{"text": "you must really be enjoying yourself if you need a robot to play the game for you laughing crying emoji", "label": 1}
{"text": "And that’s fine. You and your loser friends that hold your experience points can gossip in your discords. You lack some serious creativity or foresight to understand where this could go. \n\nExactly what achievements are you proud of verifying?", "label": 1}
{"text": "First of all, it was JCW one of the best/biggest skilling nerds out there that was getting 72k an hour first day.  So it was not a skill issue.\n\nYou calling me shit does not make me shit blue helm", "label": 1}
{"text": "You are such a toxic loser lmao, that was jcw getting 72k an hour on release btw(he's better than you)", "label": 1}
{"text": "You aren't OP are you genius?", "label": 1}
{"text": "Different account only phone vs PC, but ok", "label": 1}
{"text": "Account for sale in the tabs? 🆗 ?????", "label": 1}
{"text": "![gif](giphy|l1J9sBCbyZs92zmpO)", "label": 1}
{"text": "gz and fuck you :(", "label": 1}
{"text": "The amount of hours I spent botting on OSBuddy was amazing. iDungeonPro, put it on overnight and let my boi run dungeons whilst I sleep. good shit,.", "label": 1}
{"text": "Way to take something from 0 to 1000. You could be playing scape instead of being on reddit making up some scenario about a f2p player", "label": 1}
{"text": "Yeah but you can also be a dickhead all at once too", "label": 1}
{"text": "Yeah nah only noobs and bots splash", "label": 1}
{"text": "Nice try tho blomee", "label": 1}
{"text": "Botting is very cool good for you", "label": 1}
{"text": "![gif](giphy|szWu9brqcBP45m36YE)", "label": 1}
{"text": "![gif](giphy|7ILfGZFvTPMB1TAkXE)", "label": 1}
{"text": "I’ve been playing for 20 years (on and off) and my original account isn’t maxed. If these weren’t botted, please get some professional mental health help.", "label": 1}
{"text": "Lil bot army", "label": 1}
{"text": "you also just don't need to do that content, there's plenty of things you can do in this game solo, for literally thousands of hours, that does not require other players. \n\nIf anything it's you with the depressing mindset, I'm sure if your internet went out for an hour you'd be miserable", "label": 1}
{"text": "no? just because you think the content is hard doesn't make it impossible for the \"99.9% of the player base (also funny how you take such liberties with that when you got thrown into a hissyfit about me saying tons of ironmen use entity hider) \n\nbut really looking at your account history on this reddit I feel bad for you man, you're perma online lmfao", "label": 1}
{"text": "its funny because you did not \"demolish me\" or disprove my argument, all I see is you ignoring my questions that clearly poke a hole in your argument, but keep being delusional", "label": 1}
{"text": ">all I see is you ignoring my questions that clearly poke a hole in your argument,\n\nlike what? I answered all of your questions directly", "label": 1}
{"text": "i have no idea what you're going on about I haven't deleted anything in this thread lmao \n\n> Thank you, so then you admit this game wouldn't work as a singleplayer game then? Unless they just cut out that content why have a game where you straight up can't do a portion of it? Does that make any sense to you?\n\nyou just completely ignored this btw", "label": 1}
{"text": "And here's the comment you deleted\n\nhttps://preview.redd.it/hg1ien40r1xd1.jpeg?width=1080&format=pjpg&auto=webp&s=6d5e215ac7b55e6dc312a9c2e87afa195af5d0be", "label": 1}
{"text": "The polling system works just fine guys /s\nJust vote everything yes guys, Jagex knows what they are doing all the time.\n\nFuck forestry and everyone who voted for this shit.", "label": 1}
{"text": "People downvoting me already sticking their head in the sand.", "label": 1}
{"text": "Broadly well received. Another day another straight up lie by devs", "label": 1}
{"text": "Every boss should have a boss room teleport. Why? Because fuck you I'm not running back every time.\n\nIt's one of the sole reasons why I don't bother bossing.", "label": 1}
{"text": "God you're a fucking loser lmao", "label": 1}
{"text": "It was meant as a figure of speech i would sure hope you have a fire cape. My ign is grind pets, i promise you there isn’t a single thing you have done in the game that would impress me buddy. I have better things to do then sit on reddit and argue with you, have a good one. Deleting this in a bit so i dox myself.", "label": 1}
{"text": "I love how you know nothing about me but just jumped in to assume I’m some 1500 total level rando that hasn’t done any pvm, but sure I’m the one using straw man arguments! You claiming I wanted a 99 agility lamp because I suggested the hardest skilling content in the game could use an exp buff is actually what a straw man argument is by the way. Might want to be less stupid when arguing with people on the internet in the future", "label": 1}
{"text": "He says he is iron = ironman, not about using iron mace.", "label": 1}
{"text": "Cry more about a video game being too hard. Touch grass dork.", "label": 1}
{"text": "No.", "label": 1}
{"text": "Irons always crying", "label": 1}
{"text": "A point and click game that is too hard for you. Go play club penguin", "label": 1}
{"text": "![gif](giphy|5tiG8KMfk8h7Dabth8)\n\nJust a few more insults bro, tell me to play with my Barbie doll set next and you’ll reach true a state of pure nirvana I’m sure of it", "label": 1}
{"text": "What in the world is your title?", "label": 1}
{"text": "> So if you picked a couple of those skills as your first unlocks, you just dug yourself a hole and put yourself at a major disadvantage\n\nskill issue\n\nPeople make bad choices and come whine and jagex nerfs it", "label": 1}
{"text": "It was jagex this is why they removed permanent iron so they can hack accounts de iron them and try to get you to restart thus being forced to use their shitty launcher", "label": 1}
{"text": "Imagine you are just chilling around Glienor and you hear a random voice contacting you", "label": 1}
{"text": "Oh im sorry did i fucking hurt your ego go fuck yourself", "label": 1}
{"text": "Oh im sorry did i fucking hurt your ego go fuck yourself", "label": 1}
{"text": "You're trying a bit too hard to repeatedly get a rise out of me. You can be blocked now.", "label": 1}
{"text": "Yo where’d you get the from?", "label": 1}
{"text": "Where can one get this.", "label": 1}
{"text": "Still a loser after a month, honestly impressive", "label": 1}
{"text": "I found 2 OSRS Wiki articles for your search. \n\n **[Poison chalice](https\\:\\/\\/oldschool\\.runescape\\.wiki\\/w\\/Poison\\_chalice)** | https://oldschool.runescape.wiki/w/Poison_chalice \n\n> A poison chalice is a cocktail obtained for free from Stankers, a dwarven miner near the Coal Trucks west of Seers' Village. Drinking a poison chalice applies a random effect, and leaves behind an empty cocktail glass. Drinking the poison chalice cannot lower your Hitpoints past 4. \n\n**[Bandit's brew](https\\:\\/\\/oldschool\\.runescape\\.wiki\\/w\\/Bandit\\%27s\\_brew)** | https://oldschool.runescape.wiki/w/Bandit%27s_brew \n\n> Bandit's brew is a type of ale that restores 1 Hitpoint and temporarily boosts Thieving and Attack by 1, while draining Strength and Defence by &#x230a;Level&#xd7;6100&#x230b;+3 (see table below) \n\n --- \n\n ^RuneScape&#x2005;Wiki&#x2005;linker&#x2005;|&#x2005;This&#x2005;was&#x2005;generated&#x2005;automatically.", "label": 1}
{"text": "Dam you can tell 3 years ago you guys were so new to the game. You seem to not know about the eighth option, where you buy an account that has the quest already done.", "label": 1}
{"text": "I dont have this therefore I will be taking my own life shortly", "label": 1}
{"text": "Got people saying the argument \"It'll bring players in that don't want to grind\"! For what, 2 weeks until they get bored?", "label": 1}
{"text": "What's the evidence?", "label": 1}
{"text": "Those are all totally different games. Not even comparable.", "label": 1}
{"text": "You're right. Everyone should be maxed and have full gear off tutorial island.", "label": 1}
{"text": "This has nothing to do with the comment above. Please learn to parse sentences better.", "label": 1}
{"text": "Because Jagex needs more money remember.", "label": 1}
{"text": "You're comparing creating individual customizable private servers to the main game. I'm genuinely confused how your brain links the two.", "label": 1}
{"text": "Some people have critical thinking and foresight.", "label": 1}
{"text": "youre so delusional lmao theres so many bots in wow everywhere you must be closing your eyes when playing the game", "label": 1}
{"text": "She is a furry, 5k at best.", "label": 1}
{"text": "I'm gonna find a different use for a long rope if I ever have to run through that city again", "label": 1}
{"text": "Piss enema my dirty ass, sexy", "label": 1}
{"text": "Your name fits with how you type", "label": 1}
{"text": "Bgs is 14m and the dwh is 20m which one is better?", "label": 1}
{"text": "I’ll get masori and bowfa", "label": 1}
{"text": "Redditors are insufferable, they downvote when they read something that hurts their feelings", "label": 1}
{"text": "I could use that long rope to swing from the Fishing trawler", "label": 1}
{"text": "Ew, OP is a dirty peasant. You'll associate with people who only have 10b? Pathetic \n🎩\n🧐\n👔☕", "label": 1}
{"text": "Except my comment is 100% true, look at the dislikes. Prove my point. The whole world is crazy except for redditors in your minds.", "label": 1}
{"text": "Project rebalance should have addressed the rare drop table", "label": 1}
{"text": "Sincerely go outside, breathe some fresh air, take a moment, and truly consider what you find to be important. Because dear God can I just feel the cheeto dust falling off your fingers as you typed that out.", "label": 1}
{"text": "I swear on my life... A dude traded me. I was at the GE. I had just logged in for a long time in a while. Dude wearing nothing just trades me and puts up 50M. I'm like... Why? He just says take it. I accept and he logs out. I'm sitting there in the same square. Added his name. They never logged back in. I dont even remember the name.", "label": 1}
{"text": "Not being daft mate but if shit like this legitimately upsets you, you need to hop offline for a bit", "label": 1}
{"text": "No one is forcing ideas onto others except the ones passing laws outlawing health-care and love for people that are different than them. \"Give me basic respect and rights\" \"OHHHHHHH NOOOOOOO THEYRE FORCING THE GAY UPON MEEEEEEEE\".\n\nGrow up.", "label": 1}
{"text": "Yeah the \"I'm not upset I just think it's weird\" crowd seems very keen to let you know their thoughts on the subject.", "label": 1}
{"text": "much easier to make dumb shit where you can pretend people are outraged about so you can easily swipe your shortcomings under the rug and never deliver the updates in the form they were promised", "label": 1}
{"text": "That's okay, racist colonialism is a part of british culture.", "label": 1}
{"text": "You'll take the gay frog touching events and you'll like them.", "label": 1}
{"text": "Leftists and censoring go hand in hand though", "label": 1}
{"text": "Ya gotta have an og blue party hat. Also actually stepping outside helps.", "label": 1}
{"text": "When you hear people talk about the alt right playing Osrs they mean people like /r/Godjorn. Terminally online losers.", "label": 1}
{"text": "Bet all the drama around manned and his name brought some of these into the light and forced jagex to take action.", "label": 1}
{"text": "do you sniff glue daily or what? megascaling just straight up is not against the rules, it has literally 0 to do with what's going on LOL", "label": 1}
{"text": "You're deranged", "label": 1}
{"text": "Noob", "label": 1}
{"text": "Read it again brother you’ll gleam the hidden message spelled out in plain English", "label": 1}
{"text": "Idc about any of these servers brother we’re talking about cox boosting…and not the kind your mom does.", "label": 1}
{"text": "Ur a bitch.", "label": 1}
{"text": "wow how do you ever leave your house if thats how you try to rationalise bad things happening 😂 delusional \n\nI can list 2-3 discords for you that have been going for years with no issues", "label": 1}
{"text": "https://www.reddit.com/r/2007scape/s/xvfRJ5F4rw", "label": 1}
{"text": "waa waa game too hard", "label": 1}
{"text": "Why This lilttle bro is 99 mining? ☠️", "label": 1}
{"text": "dang that's crazy how did those come to your mind", "label": 1}
{"text": "gratzzz", "label": 1}
{"text": "keep grinding brotherrr", "label": 1}
{"text": "Unfortunately from what I've seen in other similar posts, once an account is linked to a Jagex account there is no way to unlink it. I'm so sorry.", "label": 1}
{"text": "You’re on crack bro calm the fuck down. It’s fucking useless for end game PvMers for irons and shitters I can see a use enjoy it. You 100% fall into one of those categories.", "label": 1}
{"text": "Personally I still think you got scammed even though she had “family issues” you don’t get paid until the product has been delivered. $700 is insane, I’ll give you a $100 deposit and give the rest upon receipt of the purchase. \n\nWhat’s your RS? I’ll trim your armor for you for 30m.", "label": 1}
{"text": "0/10 troll, unlucky.", "label": 1}
{"text": "How fucking dare you\n\nSuggest such sensible logic", "label": 1}
{"text": "It literally takes 40 minutes with quest helper on runelite smh3-4 hours if your brain doesn’t function well 🗣️🤣", "label": 1}
{"text": "We know", "label": 1}
{"text": "You can get reported for sending these.\n\nAsk me how I know.", "label": 1}
{"text": "I don't know why we are victim blaming when this Botty guy (with a name like that I wouldn't be surprised that he bots) viewbotted a fake stream trying to scam new players. I don't know how anyone can be so soulless as to scam noobs for like what 50k? This is a problem for Jagex's anti cheating team who needs to dish out some swift permanbans to this Botty guy's accounts.", "label": 1}
{"text": "lol loser mad he didnt pay for prayer scroll protections when boosting his ironman & now he cant boost at all anymore so he needs it made easier", "label": 1}
{"text": "You get blessed by rng and cry and shit and piss on Leddit about it? Rip", "label": 1}
{"text": "This is probably a phishing email", "label": 1}
{"text": "When they took away the wildly!!!", "label": 1}
{"text": "Not trying to be an r/AITA regular where everyone solution is “break up with them” but genuinely why stay with someone who thinks something harmless you enjoy is weird? That’s not very nice.", "label": 1}
{"text": "Baby just learned what the phrase “highest they’ve ever been” means\n\nD’awwwwwwwww\n\nr/cutenoobs", "label": 1}
{"text": "Teach us your ways", "label": 1}
{"text": "I use anglers as a main food at vorkath. I don’t use combo food. My inventory is slayer staff, scb, anti venom,super anti fire,3 restores, rune pouch, boots, voidwaker, rest anglers.", "label": 1}
{"text": "womp", "label": 1}
{"text": "I mean if you're getting offended by this you should probably just enable the profanity filter... lol.", "label": 1}
{"text": "I'd rather them figure out how to get rid of the website spammers tbh.", "label": 1}
{"text": "It's amazing to me that people actually take shit like runewatch seriously.", "label": 1}
{"text": "Absolutely nothing.", "label": 1}
{"text": "That is such a stupid take...\n\n\nYou have the option for s profanity filter but you want a second individual to you profanity filter that only filters words you don't like...\n\n\n\nTalk about a Karen attitude.", "label": 1}
{"text": "So? Move on snowflake", "label": 1}
{"text": "Seek help not being scared or offended by words... right. Thanks chief.", "label": 1}
{"text": "You're projecting way past the title of the post which was just about the word, but sure man. :thumbs up: Did they remove right click ignore or something?", "label": 1}
{"text": "Well one is a nuisance spam that happens 100's of times per out and this is one that could have been handled with a right click ignore.", "label": 1}
{"text": "Imagine giving a single fuck about this when the ignore list exists or you could have simply turned on the in-game filter already provided guess we just want to be a victim today huh.", "label": 1}
{"text": "imagine being scared of words lmfao. \"trigger words\" is a trigger word for me because it reminds me of other trigger words. Guess we should ban it.", "label": 1}
{"text": "Share the RSN, these type of words need punishments.", "label": 1}
{"text": "I mean I already a better person than you because I can't be damaged by weirdo's yapping. Meanwhile you're over here throwing a hissy fit.", "label": 1}
{"text": "Doesn't seem like you've got to do any imagining, because you just admitted that you are scared of words!\nStupid snowflake.", "label": 1}
{"text": "Imagine being so weak as a human being that you have to cripple other people's ability to communicate because you can't control your feewings.\n\nWho cares if you don't understand why people don't give give a shit about you. Maybe just be a decent human being and mind your own buisness. pretty simple.", "label": 1}
{"text": "Say less.", "label": 1}
{"text": "I miss the old rick voice actor :(", "label": 1}
{"text": "2 years later and i just wanna say: you are seen, you are heard. this still sucks. I think it's really funny that not a single person in the comments says they like this boss or what it adds to this content, nor the fact that it is literally bugged according to the OSRS wiki. Just a bunch of toxic sad sacks that want to feel better than other people because dragging their balls through a mile of glass didn't hurt them at much as it hurt you. I don't think there's anything wrong with wanting this to be more reasonable, since it's otherwise a cozy piece of content. \n\nNMZ is dated anyways. I love the idea of a boss rush but none have been added in over a decade. Somehow I think that would piss these people off more.", "label": 1}
{"text": "having a bit of fun on an internet forum a sad life doesn't make. if you're personally offended by harmless fun being poked at someone else on the internet and running to aid on their behalf when theyre not even bothered or upset by the fun having, you should likely re-evaluate some things stranger. the scythe yoiker guy doesn't seem upset by it, why the fuck are you", "label": 1}
{"text": "fuck it. fine. i hope they confiscate your shit.", "label": 1}
{"text": "It is the internet. Who fucking cares lol", "label": 1}
{"text": "Link in bio 😹😹", "label": 1}
{"text": "Tbh, you're delusional if you think that report button does a dam thing lol", "label": 1}
{"text": "If anyone wants his name lmk lol", "label": 1}
{"text": "2008 piss filter for games", "label": 1}
{"text": "Average 3rd worlder", "label": 1}
{"text": "Don’t smell my butt, my stinky winky butt \n\n* Banefan1901", "label": 1}
{"text": "Shooshoo stinky iron", "label": 1}
{"text": "damn lol i should try this, bro actually spazzed too", "label": 1}
{"text": "Basically Jagex are a bunch of clowns and in due time will ruin OSRS. They will put things like gay parades into the game or ban people who report dupes because it made them look bad.", "label": 1}
{"text": "11 months later and I still hate the elves", "label": 1}
{"text": "I had no idea we could still log in with our old accounts. I wonder if I could dig up mine.", "label": 1}
{"text": "I don't get it.", "label": 1}
{"text": "Ah, yes, \"ChugginBeer\", clearly a NSFW name, it's not like you do exactly that multiple times in game. I bet half the names on here are like that, get a life.", "label": 1}
{"text": "BIG FACTS 😤😤😤", "label": 1}
{"text": "People underestimate the power of belief. She’s got the luck, now she just needs to train her beaver skills!", "label": 1}
{"text": "Lynch him for killing car!!!!!!", "label": 1}
{"text": "They could potentially keep old clickboxes. It'll be a shittier plugin ofc. And the users of the plugin would just accept that some activities are gonna be weirder because of the clickboxes. I don't think I'd mind at all. It would be a cool toggle to have notheless", "label": 1}
{"text": "Still not a single 99 😂", "label": 1}
{"text": "The ban rates are anywhere between 0.5% and 3% depending on the time of year for RWT gold. Obviously, being careful lands you more toward the former than the latter. It's really low, even in a bad scenario. If he bought tons of gold, it probably came from a more believable account that's less likely to be caught. The smaller the GP pile, the more likely you are to get banned. It's ironic. But the number of trades is a big factor in RWT catches.", "label": 1}
{"text": "TIL that migraines are literally the only headache I ever get. I ain't ever had none of the other ones. Especially the gold nugget headache. \n\nJust get the drop kid", "label": 1}
{"text": "Victim", "label": 1}
{"text": "Send pls", "label": 1}
{"text": "Thx", "label": 1}
{"text": "Too bad this isnt gay rs3 so there is no world 2", "label": 1}
{"text": "Idk if I am \" your guy \" you might be pretty gay", "label": 1}
{"text": "Can a something be dead and gay at the same time? I guess", "label": 1}
{"text": "Politics should be banned from osrs", "label": 1}
{"text": "I couldn't imagine being as miserable as you.", "label": 1}
{"text": "In USD standards that’s ~2,500 $.", "label": 1}
{"text": "Hopefully it won’t drop for another 10 years such a shit skill that literally no one except shitters want", "label": 1}
{"text": "You're beating a bush that's been beaten more than a gamers wiener. \n\nThey are not going to do anything.", "label": 1}
{"text": "I've played too much XCOM to chance this.", "label": 1}
{"text": "Bro’s an Ironman tonight 😔", "label": 1}
{"text": "Right", "label": 1}
{"text": "u/osrsflips", "label": 1}
{"text": "It’s the fucking runescape bed, not the sleeping bed op. get a clue scroll", "label": 1}
{"text": "Because fuck you. That's why.", "label": 1}
{"text": "Sounds gay", "label": 1}
{"text": "I'm sorry, what? Most of the stuff they showed off was QOL. End game players received all the content the prior 6 years.", "label": 1}
{"text": "I don't \"go\" for pets. I just cast a wide net and hope I get one somewhere somehow. I guess right now you could say I'm going for the olmlet but I'm not really going for the olmlet I'm just doing a lot of scales and cm's", "label": 1}
{"text": "You realize like all of these are either the same thing or not end game right? Toa, dt2 bosses, and hydra are very clearly not end game. Cm cox/normal cox, inferno, and hmt/normal tob are literally 6-7 years old. CAs are 99% just bloated annoying bullshit that anybody could do. The game is almost exclusively early-mid game content", "label": 1}
{"text": "You are literally just lying lol. The end game content of the last 5 years is awakened bosses, hmt, arguably colo, and arguably nex. The mid game content of the same time period is sarachnis, scurrius, perilous moons, hueycoatl, amoxliatl, artio, spindel, calvarion, muspah, nightmare, duke, leviathan, whisperer, vard, araxxor, hydra.", "label": 1}
{"text": "What even is this comment, it's just objectively lying. Almost every single update in the last 6 years has been early or mid game. The only real end game updates have been hmt and awakened bosses, and one of those you spend 1 day grinding out then never touch again because jagex decided you should have to pay 1m to fight them one time.", "label": 1}
{"text": "R.I.P legend time to yahoo in heaven.", "label": 1}
{"text": "That's based on pure hypotheticals lol he should be remembered for the way he carried himself, which was as a pest and egotistical loser", "label": 1}
{"text": "> \"man or bear\" misandryst hypothetical\n\nI love men, and I would still choose a bear!!", "label": 1}
{"text": "Always we go next to chef bc he taught us how to play runescape 🤝🏽", "label": 1}
{"text": "They are trimming barrows now? Gotta find my guy", "label": 1}
{"text": "Ur still a noob", "label": 1}
{"text": "Not shirts, but you can buy skill related hoodies on fashionscape.shop. Some hoodies have the skillcape printed on it too", "label": 1}
{"text": "Remember youd get made fun of for being gay on runescape back in 04 good times", "label": 1}
{"text": "Perhaps, I did something dumb. >.< When I try to do the UPGRADE NOW option, but when I enter my email address I keep getting an email saying: \"You already have a Jagex account. It looks like you are trying to create a new Jagex account, but an account already exists using this email address. looks like you are trying to create a new Jagex account, but an account already exists using this email address.\"\n\nI do have a Jagex account as I created one earlier per their request. I'm confused as to how to continue the import now since it won't let me past this page: \n\nhttps://preview.redd.it/sc8a3ea0uhyd1.png?width=483&format=png&auto=webp&s=15587f5e3234a65c2c796fe89eaf4b80e4c8c0c3\n\nI don't get a verification code in my email. Instead I just get an email saying I have an account already", "label": 1}
{"text": "This looks like garbage", "label": 1}
{"text": "You look puerto rican", "label": 1}
{"text": "What about my comment history makes you think I'm gay lmao", "label": 1}
{"text": "Gold also used to cost $1/mil on RWT sites and now they advertise at the GE at $0.12/mil, so probably closer to $0.18/mil", "label": 1}
{"text": "Yeah yeah yeah but if I'd say some shit like \"women are [insert misogynistic stereotype here] because I had such an experience with one woman\" you'd call me a misogynist, because yes, that is a misogynist thing to say. But when it's about men, it's apparently fine to say \"men\" generally? And then backpedal like \"of *course* it's not about you specifically\" when pushed about it. Nah, that's fucked.", "label": 1}
{"text": "I like to pvm, I will join in on the bullying, get the gear, noob", "label": 1}
{"text": "Due to…ya know…your diagnosis", "label": 1}
{"text": "I would still choose magic, all day.", "label": 1}
{"text": "why what happened", "label": 1}
{"text": "U.S. election. Assumption is that Trump will win and the antifascists/liberals of reddit will melt down over it", "label": 1}
{"text": "The assumption is that Harris will win and the trumpers will start a riot and try to invade the capital building or some shit again", "label": 1}
{"text": "Fr, the loser already tried an insurrection on J6, what makes people think he's not going to try again?", "label": 1}
{"text": "nobody cares loser", "label": 1}
{"text": "Plot twist: The husband wrote this and there is no wife (he's a UIM).", "label": 1}
{"text": "Still only $5/month if you buy gold", "label": 1}
{"text": "Get your slayer up, ew", "label": 1}
{"text": "Let's not be slow here, use your poor reading skills. He was typing \"fat ass\" it turned into *fa*ass\" 🤦🏻‍♂️ look at the first comment, he posted an image", "label": 1}
{"text": "If you need to post to ask for what do in the game, osrs isn't for you. Go back to valorant.", "label": 1}
{"text": "Dont worry. You might hit, at least a few 99s before you fucking rot away.", "label": 1}
{"text": "Ranged is too easy. Magic is cool but I rather just have a cool ass big sword and slice mfers up. Bonk build", "label": 1}
{"text": "What a fucking weird over reaction to a comment about prif and pc power.\n\nNot everyone suffers that's why we respqwn in prif.\n\nGuess what nobody gives a fuck about your shit pc and single income.", "label": 1}
{"text": "capybara", "label": 1}
{"text": "Don't worry, it'll take them a few days to fudge all the numbers anyway.", "label": 1}
{"text": "My account is new but I don't have to be a member, I only have 189qp, that's fine, I would like to have it all but I'm missing the bond, what can I do to get it again?", "label": 1}
{"text": "When is that account from?", "label": 1}
{"text": "Why worry about defining it, when calling names is so much better?", "label": 1}
{"text": "Get a real computer operating system? It's 2024", "label": 1}
{"text": "Bro you are a bit over drop rate if you are destroying. Did momma Raise a birch? Think so.", "label": 1}
{"text": "Nah the real ones just made it call the house phone and all charges were instantly accepted 👍", "label": 1}
{"text": "You're the fuck wad that took time out of their day to flex your PC and respond again", "label": 1}
{"text": "I can't account share with my friends. With group, we can login to each others accounts to grab something if they didn't deposit/offline.", "label": 1}
{"text": "Hahaha wow what a silly comment full of nonsense. \n\nIf your comment is satire bravo, if your comment isn't satire wwwwwowwwwww...", "label": 1}
{"text": "I have one and I can no longer play on mobile since getting one, yeah my phone kind of sucks but it can run the game just fine. What it can't do is get jagex account to work. Still recommend getting jagex account but that's a heads up if anyone was wondering if there are hidden problems...", "label": 1}
{"text": "Barely done anything else, disgusting", "label": 1}
{"text": "Holy shit you're an actual crazy person", "label": 1}
{"text": "dont worry you'll be forced to upgrade soon. keep coping", "label": 1}
{"text": "hey jamflex make mobile cooler thanks bye", "label": 1}
{"text": "Shitter", "label": 1}
{"text": "I never did any of those things but if you want to think I did just because I made one post on a free and open platform and that makes you feel like a better person then you go ahead.\n\nYou are full of hate and spite to the point that you can't even bite your tongue and keep it in for the briefest of moments.  \nSo I'll let you be you but I will always pity you because whilst trying to prove yourself the better person you have only made a fool of yourself. You are a clown screaming at the internet and you will never let yourself be anything more.", "label": 1}
{"text": "Not being able to log on for a couple hours at most on brand new content launch is such a whiny excuse lmao. Grow up.", "label": 1}
{"text": "🏳️‍🌈 for sure 🤷🏻‍♂️🤦🏻‍♂️", "label": 1}
{"text": "Why don’t you de-iron.? That’s like actual money", "label": 1}
{"text": "What's gonna happen when they take the fluoride outta the varrock sewers!?", "label": 1}
{"text": "There's no good reason to upgrade and a bunch not to, actually.", "label": 1}
{"text": "Im happy about this", "label": 1}
{"text": "You sir, are a grade A rat.", "label": 1}
{"text": "first ballot hall of fame rat", "label": 1}
{"text": "People should feel shame for getting 99 cooking.", "label": 1}
{"text": "That's the problem. If you have to forcefully mandate switching to a jagex account rather than provide additional incentives to entice someone to switch, it says a lot about the product you're pushing on someone. P. S I have 2 alt accounts on a jagex account, but the way they structured switching mobile accounts when you might be something as menial as your dailies essentially renders them pointless to play.", "label": 1}
{"text": "I was going to type up a thorough and detailed response to address each of the retorts you made to my post individually, but nothing will get accomplished. We'll both metaphorically die on this hill. Makes more sense to type up a draft or petition and accrue billable hours doing the same thing lol. All I'll say is if you don't find value in something, you shouldn't be subject to make the transition when there are already viable alternatives in place. If you find value in jagex accounts, that's great, but dont purposely ignore the flaws that were addressed in this post about jagex accounts that remain to be addressed or fixed. I do not wish to transition to a jagex account on my main and would like to be able to bank without having to close the jagex interface every single time you bank. This was implemented a few days ago and was not something that was discussed with the player base beforehand. People who are opposed to the idea of Jagex accounts are also paying customers, and potentially losing even a small percentage of them over miniscule forceable interface changes seems nonsensical, especially considering they felt the necessity to recently raise rates and dont put much value into providing support for the authentic complaints. If jagex valued account security, constructive criticism, or providing support to their player base, they would have implemented a viable support team years ago. When Jagex makes changes and addresses people's trepidations about the product, or actually provides worthwhile incentives that would actually entice a maxed main account with already 100 empty bank slots that are readily available, I would be happy to switch. I have 2 alts on the same jagex account and despise switching between them on mobile as a result of the poor design flaw associated with said Jagex account and purposely opt to only play my main that is not on the Jagex Account. The fact that you mentioned filing a support ticket and actually believe that's a viable method to achieve a resolution for an issue on osrs means you have apparently never had to do so, lucky you.", "label": 1}
{"text": "Examples of potential enticing options Jagex could explore implementing, 1 additional name change per month for individuals who have a jagex account. Making a new membership options for accounts that fall within the umbrella of one Jagex account, perhaps $25 a month so they can generate additional profits, but the account owner can gain membership on all the accounts that can fit on the one jagex account (I think it's 7 accounts). Just to name a few ideas.", "label": 1}
{"text": "Please submit links using the [link submission form](http://www.reddit.com/r/2007scape/submit).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/2007scape) if you have any questions or concerns.*", "label": 1}
{"text": "Excellent song choice. Absolutely impeccable.", "label": 1}
{"text": "Dude I was hearing some ppl in game talking about major scams with the hoodies. It pains me to hear about it. I hope it’s not true man.", "label": 1}
{"text": "Just as an FYI, jagex accounts do not hinder botting at all and makes no difference when it comes to cheating", "label": 1}
{"text": "I have a username account from 2005, I'm not giving that up. Even if I was willing to do that, the Jagex account itself is not free from flaws. People have been hacked with Jagex accounts. Not only that, but if you link all accounts to a Jagex account, all of your accounts get banned at once (not that false bans are likely, but they do happen.\n\nMy username account is different from my in game name, isn't written down anywhere and so it doesn't appear in any data leaks. I don't see any value with a Jagex account, only liability. And the whole arrogant attitude you have here about how your opinion on the matter is the only valid opinion is hilarious by itself.", "label": 1}
{"text": "No it doesn't lol. It has no more elevated access than they did before the anti cheating is the same as before", "label": 1}
{"text": "Simple, I don't trust jagex.\n\nNot to mention every few updates the client crashes and the game goes down for jagex account holders only.", "label": 1}
{"text": "Wow, literally every single thing you said in this wall of shitter cringe is wrong.", "label": 1}
{"text": "American politics are so fucking uninteresting I cba.", "label": 1}
{"text": "Trump 2024 baby", "label": 1}
{"text": "Waaa sad baby 😢", "label": 1}
{"text": "3ab and venator bow aren't substitutes for each other", "label": 1}
{"text": "Congrats....Happy for you....Go die pleae", "label": 1}
{"text": "What do you mean? I bet your politician never jumped into a garbage truck for publicity while your other politician faked accents to try & garner favor with specific demographics. \n\nNo but actually, since when has politics gotten away from policy so horrendously. Trump & Kamala could literally put out a sex tape & I would not give a shit so long as I agreed with their policy decisions.", "label": 1}
{"text": "They're not wrong there though.\n\nCommunity sentiment is direct PROOF that most players haven't bothered to understand what the wilderness is, or how to use it properly.\n\nTo use your words - You *are* clearly too stupid.\n\nNo, I'm not sorry 😒", "label": 1}
{"text": "Sorry ur dog shit man it'll get better sometime hopefully", "label": 1}
{"text": "Found the Rot wannabe", "label": 1}
{"text": "Yes this is efficiency scape and it will be more efficient when i get the wildy removed thank you ", "label": 1}
{"text": "Sorry - who’s the biggest creator in RuneScape? \n\nSorry - what’s the biggest old school community outside the game itself?\n\nSorry - what happens to PvP updates when they get polled? \n\nThe community has an opinion - evidence supports it being mine - your input is absolutely asinine", "label": 1}
{"text": "I tried like twice and I am also very bad so the kill isn’t happening regardless ", "label": 1}
{"text": "You are complaining about a game mode that is not compatible as an account type that you signed up for. Congratulations you're entitled! If you don't like playing with restrictions I'd recommend playing as a traditional main", "label": 1}
{"text": "Good job there’s more of us than you - so let’s have a poll on it ", "label": 1}
{"text": "I am not in rot nor a wannabe, in fact you should thank me for voluntarily being bot patrol at revs. It's okay tho lil guy lumby is a safe space you can be yourself in", "label": 1}
{"text": "Lmao you made a burner to comment this - good job fella - hope mums proud ", "label": 1}
{"text": "Wrathmaw poll got 50% and it was hated by most pkers too. Seems like more than half the player-base actually votes in favor of wildy content even with the shittiest proposals lol.", "label": 1}
{"text": "No it isn’t.\n\nI made this comparison in another thread, but essentially:\n\nLocking pvm encounters behind pvp risk in the wild is unreasonable. It decreases how fun and accessible the content is. I don’t like getting geared up in cheap gear to go get a couple combat achievements, and getting pked and stomped by someone looking at me like a loot piñata. The fact that pvm can be interrupted by pkers getting priority on you in singles+ areas makes this worse.\n\nReplace “being pked” with “being SAed” and think about how messed up that would actually be. How messed up it would be to throw out candy and offer people rewards and wealth and fun times doing non “being SAed” things if they only accept the risk of “being SAed” because that’s part of the fun. I have to use this specific unpleasant example because it seems no one else makes the connection that non-consensual combat forced upon a player by another player has the exact same dynamics.", "label": 1}
{"text": "It smells like bitch in here. The problem with PvP is the ahk auto eaters. I don’t know why 80% of people don’t bring a switch or ko weapon to wildly activities. Most pkers are just having fun in mystics, keep their hp low and don’t know how to eat properly. The second you fight back, most of them short circuit. If you’re going to the wildy to kill bosses with increased loot tables, expect to be killed for those loot tables. Buy an imp box if you’re doing a clue.", "label": 1}
{"text": "People like you are why the rest of us passionately hate pkere, js.", "label": 1}
{"text": "“collect rare” is the username", "label": 1}
{"text": "You shouldn't have an opinion if you don't participate, I don't talk about Ironman content because I don't play iron. Problem is Ironmen don't do the content and spite vote so others can't enjoy it either. Y'all r terrible for the game truthfully", "label": 1}
{"text": "You are paying for the luxury of clicking less", "label": 1}
{"text": "Venator bow does not 'surpass' 3ab because it does not substitute for what 3ab useful for. They are both bis", "label": 1}
{"text": "You asked me a clearly rhetorical question. I'm not answering that, because it was rhetorical and you know it. The topic was about RNG and competitive game viability.\n\nMax cash bet I dump your ass over the side of the duel arena walls 10 times in a row. You aren't gonna take it though. Little shit, we're done here. Go back to /r/PoliticalCompassMemes and whine about Harris some more.", "label": 1}
{"text": "Lmao what? Can you read? I said you shouldn't be surprised that a dude risking 2000x what you are can catch a freeze. I've never bought gold and have been competitive in the wilderness since 2002. You're just coping because you're not good enough, so everyone else is a hold buyer or an ahker. No, you're just bad. \n\nThat whole paragraph told me you have exactly 3 minutes of wilderness experience", "label": 1}
{"text": "You deleted 4 angler pieces because you couldn't discern a trash can from a dollar sign.\n\nLow T is the least of your worries", "label": 1}
{"text": "It was wonderful! I wish I could do that too", "label": 1}
{"text": "I'm afraid to imagine how much this license plate costs", "label": 1}
{"text": "Someone tell jamflex it's not ok to put your pee pee where poo poo comes from.", "label": 1}
{"text": "Vote blue!", "label": 1}
{"text": "![gif](giphy|fXnRObM8Q0RkOmR5nf)", "label": 1}
{"text": "I mean vote Harris mostly.", "label": 1}
{"text": "Or you could slow down and read like 5 words", "label": 1}
{"text": "Can you define the word \"love\" here? I'm not sure how putting your penis into another man's anus is an act of love.\n\nTo be fair, I'm not just picking on gays. I don't believe a man and a woman sleeping together with zero intention of commitment is an act of love either. It's more just two people using each other for pleasure.", "label": 1}
{"text": "https://preview.redd.it/13ck9uxqo5zd1.jpeg?width=1290&format=pjpg&auto=webp&s=2d1c196aa88074015754b3fbd916677dc5ed3184", "label": 1}
{"text": "Because they’re the entire point of those games, whereas PvP is a small part of OSRS. I’m convinced you’re trolling, or a certified mouthbreather \n\nMaybe both", "label": 1}
{"text": "the poe community is such an entitled and angry community, it's fucking bizarre", "label": 1}
{"text": "I'm just voicing my beliefs on the matter, you're free to do what you want.", "label": 1}
{"text": "I literally said “PvP is a small part of OSRS”\n\nLmao, you are a total clown", "label": 1}
{"text": "What?\n\n>1. Someone tells you, \"if you correctly call a coin toss, I'll give you $20. Or you can skip the coin toss and I'll give you $10.\"\n>\n>2. Someone tells you, \"Let's make a bet on a coin toss. If I win, you give me $10. If you win, I give you $20.\"\n>\n>These two scenarios are functionally identical in terms of their outcomes\n\nNo they aren't...\n\nScenario 1:\n\nDon't Gamble: +$10\nLose: +$0\nWin: +$20\n\nScenario 2:\n\nDon't Gamble: -$0\nLose: -$10\nWin: +$20\n\nScenario 1 has a guaranteed return if you choose not to gamble, first off. This is already a massive change. \n\nAnd if you gamble, Scenario 1 has an EV of +$10, but scenario 2 has an EV of $5. People will pick scenario 1 because it's a strictly better option both if you choose to gamble or if you don't. There's no outcome where I'm better off taking #2 regardless of whether or not I choose to see the coinflip.\n\nI don't think you understand the argument you're trying to make.", "label": 1}
{"text": "Stop allowing people to logout or worldhop while in the wilderness. \n\nThen you can add whatever the fuck you want.", "label": 1}
{"text": "Vocal minority - it’s the third most upvoted post of the day and we’ve seen multiple PvP polls get voted down. It’s almost certainly the majority and I suspect polling a removal of all non PvP content from the wildy would pass a poll in a landslide. \n\nAll this bitching and whining comes from people who are actually in the minority and they know it - hence the noise. ", "label": 1}
{"text": "You can recognise a gay runescape player by face alone, it's the face that's buried in varrock guard cock", "label": 1}
{"text": "I think you got the point 😘", "label": 1}
{"text": "Was the point that you are not very smart, and hate me a lot, and struggle with reading comprehension?", "label": 1}
{"text": "Always lovely to see people just lying straight up on this sub.", "label": 1}
{"text": "> Once again, in both of the scenarios, you have the choice to take the bet, which has two outcomes. You end up with $0 if you lose and $20 if you win. And you also have the choice to not take the bet, in which you have $10.\n>\n>You end up with **$0 if you lose** if you lose and $20 if you win.\n\nAre you just stupid? This is your post:\n\n> **If I win, you give me $10.**\n\nIf you lose, you're not ending up with $0. You're -$10 in debt. How is basic math just beyond you?", "label": 1}
{"text": "Jeus fucking christ you're stupid. Yes, I now have $0. I started with $10. That's -$10.", "label": 1}
{"text": "Least delusional redditor lmao", "label": 1}
{"text": "Yeah keep telling yourself that buddy, the reality is that we're going to have a repeat of 2016-2020; i.e. a better economy and still no right wing death squads that you dummies have been promising would come.", "label": 1}
{"text": "How is this any different than the pride parades and other bullshit?", "label": 1}
{"text": "I looked her up and hub a hub a\n\n* Banefan1901", "label": 1}
{"text": "Who skips that event now that you can get the baguette?", "label": 1}
{"text": "All of this boils down to - I don’t want to engage with PvP - I don’t enjoy it in RuneScape and I think it should be segregated from the PvM/skilling experiences that I enjoy.\n\nYou can write a huge post about how great the wilderness is and all 1009 people that agree with it can agree - but the vast majority of the playerbase agrees and we pay we say.", "label": 1}
{"text": "8 kc rancour suck my dick", "label": 1}
{"text": "you know maybe you're right", "label": 1}
{"text": "Guys you're gonna make us wait like what 3 years to finally finish the Mahjarrat storyline?\n\nFinish a quest line i'm begging you man.\n\nI feel like we get alright updates but man does it take a long time to get to the actual good parts of the lore especially with these world expansions that for some reason have 3 parts (varlamore) and we've got people wasting away hours trying to make Sailing work.", "label": 1}
{"text": "Brother, I’m not even playing this fucking game lmao. I’m just not a pants-shitter on Reddit who doesn’t have a job so 15$ a month scares me.", "label": 1}
{"text": "Honey, don't project your own desires on me.", "label": 1}
{"text": "Maybe if you spent a little less time getting loud on Reddit you wouldn’t have carpal tunnel - think you need a bit more outside time ", "label": 1}
{"text": "there's nothing wrong with anything you're complaining about in your post. grow a dick and a spine, and protip: bringing more than 5k value in equipment might give you a better chance.", "label": 1}
{"text": "You put an s but are clearly actually upset about this. It was voted on and added in directly as voted", "label": 1}
{"text": "This is a 2k upvoted thread - think you’re mistaken tbf ", "label": 1}
{"text": "Why change something perfect? It’s gross it makes me puke", "label": 1}
{"text": "Absolutely pointless update", "label": 1}
{"text": "Why not do something the community want instead of changing existing perfection?", "label": 1}
{"text": "Unpolled too huh? Couldn’t bother asking your paying playerbase?", "label": 1}
{"text": "Pointless company im getting a charge back", "label": 1}
{"text": "Not seem more than 2 post", "label": 1}
{"text": "Nah its gross man", "label": 1}
{"text": "Yeah ive been playing years on mobile and they change it unpolled i swear I’ll go apply to jagex to change everything back to perfection", "label": 1}
{"text": "Poll your stuff jagex stop being a coward", "label": 1}
{"text": "You probably play once every years, but i got to play daily on this shit well no more now it’s so pointless they took 3 years to waste their time when they could of fix plenty more thing like the codes for example", "label": 1}
{"text": "I remember when gotr release on mobile it was unplayable for 6month what about fix those problem instead? No of corse not breaking game bug are not an emergency but ui is so stupid company", "label": 1}
{"text": "Thank you im just venting", "label": 1}
{"text": "You on reddit that all is about lmao", "label": 1}
{"text": "I got like 3 max cap lmao get good 😂🤣 i want the choice to revert that trash at least", "label": 1}
{"text": "But i met your mom on it it’s been our date game", "label": 1}
{"text": "It pages of complete trash anyway", "label": 1}
{"text": "Fix your game not the ui, the have been so many game breaking bug on mobile for years and you fix them 8months later but the ui is a priority what a waste of a studio go public already so i can buy the entire stock for 20 cents because it ain’t worth anything.", "label": 1}
{"text": "She works at jagex", "label": 1}
{"text": "Nah it’s completely trash #reverback", "label": 1}
{"text": "The new ui is absolutely trash #revertback", "label": 1}
{"text": "The new ui is disgusting looking it’s absolutely trash, how often do you play mobile? Probably never some people need to look a this disgusting trash all day #revertback", "label": 1}
{"text": "New ui is disgusting and trash #revertback", "label": 1}
{"text": "She made the new ui with her infected feet", "label": 1}
{"text": "Imagine stating the obvious thank you captain obvious we really need people pointless like you, you’ll go far in the dumpster", "label": 1}
{"text": "Nah she’s too busy with me", "label": 1}
{"text": "I had fun till they change that trash ui i got 3 max account on mobile only and then they change to this trash fuck jagex this a new beginning but what most people would think", "label": 1}
{"text": "Thank god some classy men or women, you cannot change it unfortunately i know it’s completely trash", "label": 1}
{"text": "Ur doing too", "label": 1}
{"text": "Ffs, is there any way to revert the interface and everything back to normal in settings, I can't find it. This has messed up all my muscle memory fml", "label": 1}
{"text": "Mass report it", "label": 1}
{"text": "Mass report the new ui", "label": 1}
{"text": "you are so g\n\nay", "label": 1}
{"text": "You are complaining about people complaining. Go fuck yourself", "label": 1}
{"text": "Go back to the wildy and grab some more spades b\n\n\nitch", "label": 1}
{"text": "Yeah. This dude eats shit for breakfast no doubt.", "label": 1}
{"text": "I dont have time to sink into this game a lot anymore. \n\nThere is 0 chance, regardless of which mechanics are added or changed in the wild that will make me agree to risk losing my items. I worked hard to get them. They are mine. I don't care if an entire area of the game dies if it means I get to keep my items. \n\nFuck you, fuck your desire for pvp in the wild. I'll go do LMS or other minigames where I don't have to risk what I've worked hard to gain. \n\nI simply don't have 1b+ to blow out the window in order to learn how to pvp \"IN THE WILD\" even then, I don't care to put myself in a situation where people are using cheat clients to swap prayers, or use animation stalls to KO me with a weapon type I can't even see. \n\nThere is nothing in the wild that is worth risking my time for. Nothing. Not a single fucking thing.", "label": 1}
{"text": "If that was a joke dude is a failed comedian ", "label": 1}
{"text": "What a post history Jesus Christ - which part of buttfuck America are you from? ", "label": 1}
{"text": "Miserable fuck you are", "label": 1}
{"text": "whats your log in? ill give it a shot on my computer", "label": 1}
{"text": "Because I was confused my the context of the comment and what the item does and they came back with \"are you on drugs\". You're right tho, I'm an asshole, I deleted my comments, thanks, carry on", "label": 1}
{"text": "Another dogshit copium plugin post 🌚🌚🌚\n\n\nUninstall that piece of shit plugin and suddenly u dont feel nearly as bad when looking at the log. Truly one of the magic tricks of all time.", "label": 1}
{"text": "You can’t sit at his table, move along", "label": 1}
{"text": "That car looks like it’s from 1982", "label": 1}
{"text": "Reading is hard", "label": 1}
{"text": "\"OH NO my self imposed restriction bars me from this content >:(\"\n\nStfu", "label": 1}
{"text": "Tune 🤘🏻", "label": 1}
{"text": "Why can't everything in life be easy!! 😭 Mum I'm trans", "label": 1}
{"text": "Sweaty, Squinting, Bloated...yet accomplished 🏆", "label": 1}
{"text": "Sweaty, Squinting, Bloated...yet accomplished 🏆", "label": 1}
{"text": "song so fitting 👏", "label": 1}
{"text": "Song name?", "label": 1}
{"text": "Robo Rabbit Furry mask. Increases speed and endurance. So hop to it.", "label": 1}
