{"text": "Yeah well OP lied, he got two rewards and left lmao\n\nIf he actually thought it was fun he would be going for everything, or making it his primary training method.", "label": 0}
{"text": "I want to point out that with increased speed the world becomes slower. I know it as a WoW veteran. When they added fast and esp flying mounts, the world became 10 much slower and it was never like before. That os one of the reasons i like runescape, you can touch and explore the world, not just zoom from thing to thing", "label": 0}
{"text": "Sure, you don't have to buy it. But then you're missing out on QoL/best in slot mount. At least with OSRS you get the whole game when you pay your sub.", "label": 0}
{"text": "nah dude, 2 hours of demonic gorillas vs 2 hours of raids definitely feels like different amounts of time", "label": 0}
{"text": "It is indeed a non issue for experienced players who are at the mid to late game and know about all the ways to get around run energy, all of us who can afford stamina pots/got 77 herblore on an iron and have trained construction to get the poh pool don't really have to think about run energy. I know I haven't had to worry about it for years myself\n\nBut we aren't the only kind of player. Brand new players who don't know what an energy pot or a stam is, or about the pool in ferox and how to easily get there by making dueling rings, and who run around in full plate armour have a miserable experience with getting to move fast through the world for 25 seconds and then having to walk for several minutes while the energy bar regenerates. It's a dog shit system and always has been and it isn't explained or particularly intuitive how to deal with it in game, and it will put a lot of potential new players off. Jagex has a serious incentive to make this better to try to retain new people", "label": 0}
{"text": "These Servers just sound like a terrible idea to me. sounds like it could kill the player base/community on the real world/servers which can lead to a downfall. should just stick to leagues and create your own game modes servers for limited periods so people have to come back to the real game. what if someone's private server is better than the real game? just think of the what if before.", "label": 0}
{"text": "With enough stampots you could always do this.", "label": 0}
{"text": "I would vote no because it'd take up A LOT of dev time... nobody that I know of has asked for it and its just a cash grab imo. But I wouldn't vote no to Ironmen and bonds....🖕", "label": 0}
{"text": "I was kinda thinking the same thing. I wanna see the loot tracker. I'm not saying he faked it, but what I am saying is that it's very easily fakeable.", "label": 0}
{"text": "there are also boss tasks/certain monsters that give more slayer exp than their health. tormented demons and araxxor for sure", "label": 0}
{"text": "I think they should have a discount for 2nd+ sub on the same Jagex account. \n\n\nFor long-time mains in good standing they could offer a free/heavily discounted first month membership for a new Ironman so people could try it out. Shouldn't be too abusable by botters if you restrict it to 1 per account with a main that's progressed a certain amount.", "label": 0}
{"text": "100% it is worth it, especially when compared to the dark bow.  Only use for dark bow is PKing.  And don’t buy the cannon from the G.E., get it from Nulodion after completing the quest for 750k", "label": 0}
{"text": "Don't do mahogany planks, it costs insane gp for the minor extra xp.\n\nSet up you miscellenia to collect Teak Logs, then use your butler to convert them to Teak Planks when you have enough for 99.", "label": 0}
{"text": "Ridiculously over complicated. It's easy, just make it so if you stop inside a pub your energy regens significantly faster, and have the bartenders sell some kind of beverage that restores your energy to full like the tea in mahogany homes for an instant refresh. Simple solution", "label": 0}
{"text": "You can enjoy a method and then stop doing once you've gotten all you want from it. Got the 2 things he wanted and dipped. I enjoy WT and GotR and got all I need from it but haven't been back since.", "label": 0}
{"text": "Tbh, those are basically cosmetic upgrades. In wow you can summon a bank chest wherever you want ", "label": 0}
{"text": "Genuine question but how much do you raid in WoW? Because as someone who's done a lot of raiding every guild I've been in has lost more than a few minutes each raid night to someone having to hearth, grab something from the AH, get summoned back etc. Over the course of a tier that easily accounts for a week or more of lost raiding time. There's been multiple tiers where a couple more weeks might have given us the time needed to get CE before the tier ends. (yes thats mostly a skill issue but yknow, paid items helping alleviate skill issues is kinda the problem)\n\nEven when we've had someone with the old Bruto you still get random times where someone isnt listening to put down a mailbox or nobody has one off CD, etc. It's a very real and impactful QoL.\n\nThat isnt even to mention what that time save means if youre in a guild competing for Hall of Fame.", "label": 0}
{"text": "I suppose that is worse. Closer to the 200m xp drop rate increase though", "label": 0}
{"text": "Should drop blessed bone shards tbh", "label": 0}
{"text": "Imagine someone playing the game a different way to you....\n\nBesides, they're a GIM, how do you figure they used bonds?", "label": 0}
{"text": "Show your log/loot tracker", "label": 0}
{"text": "Zombie axe just hard out classes it and it's relatively easy to get", "label": 0}
{"text": "im gonna leave it up because he's definitely botting. but thanks for the warning", "label": 0}
{"text": "How in the heck do you get that many seeds to begin with?! 🤯", "label": 0}
{"text": "The mount gives you an edge over other players because it has features that other mounts don't.\n\n\nAnother way to think about it is the OSRS sub let's you access the entirety of the game including all BIS. The WoW sub doesn't unlock the entire game, you need to pay more if you want the BIS mount.", "label": 0}
{"text": "😭😭😭😭😭", "label": 0}
{"text": "It’s kind of Wyrm like, drip wyrm bones", "label": 0}
{"text": "> I for one find it shameful jagex hasn’t made all content in the game for irons soloable and made them play in their own solo worlds in 2024.\n\nIt’s an account restriction that has zero impact on anybody around them. Ironman-only worlds are a terrible suggestion.", "label": 0}
{"text": "I disagree, if something is fun you actively would like to go back and do it again.  I think you just find them bearable, or the best alternative to getting the reward you want.", "label": 0}
{"text": "Mind your own business", "label": 0}
{"text": "Dragon sword…", "label": 0}
{"text": "Galv gave me a hard time. Grats dude", "label": 0}
{"text": "Exactly! They're way over complicating this when there's a much easier and better solution right here", "label": 0}
{"text": "As far as I'm concerned that's perfectly acceptable", "label": 0}
{"text": "bro said ugly mobile game looking on a old school runescape sub", "label": 0}
{"text": "You should look into the RS3 membership options. They have 1 day and 2 day packages, and naturally it applies to your OSRS account as well.\n\nI hope they bring those over to the OSRS store because it's annoying having to install RS3 just to get them.", "label": 0}
{"text": "Your advice is wrong. It's simply untrue. It entirely depends on the bank and type of banking licence they hold. Small banks won't have the ability to enable preauthorised transactions via cancelled or stolen cards, however bigger banks will such as HSBC etc. This is especially true for payments taken for recurrent subscriptions as those are preauthorised.", "label": 0}
{"text": "Right now almost all of what you've shown are simply restrictions that people can already put on themselves (boosted starting stats and non-respawning resources being the only exceptions).  If you want us to get excited about private servers, you've got to pitch things we CAN'T already do in the main game.\n\nI said this in the survey, but the thing that would get me to try private servers would be custom map creation and quest scripting tools that creators could use to make their own unique worlds on their servers.  Otherwise, it's just going to feel like something temporary I'm wasting my time on when I could be improving my main instead.", "label": 0}
{"text": "It's still gonna feel absolutely dog shit if you're a low level player who has to stand still and wait like 5 minutes for your energy to recharge, then you get like 45 seconds of running before you have to stop and wait 5 minutes again. These proposed changes don't do much to help the new player experience at all", "label": 0}
{"text": "Lmao, if a new player can't use google or wiki, there's no helping them. Why should we balance the game to braindead kids?", "label": 0}
{"text": "Hey congrats. Also fuck you", "label": 0}
{"text": "Bondbuyer detected", "label": 0}
{"text": "30-60 hours of entertainment per month for $10-15 is pretty good value tbh\n\nhow do you feel about other subscriptions? do you feel obligated to watch 50+ hours of TV series to make a streaming service worth it?", "label": 0}
{"text": "I have tried everything. My yard is full of maple trees from IRL Farm Runs", "label": 0}
{"text": "Most weapons with (p) or (p+) have almost 0 daily volume sold on the grand exchange, so you can theoretically use them to trade money between accounts, since there is often no one else selling them. I'm not sure if this makes it safer to rwt, but you do occasionally see these items selling for 1m+, so someone is buying them for far more than their actual value.", "label": 0}
{"text": "I had this same dream last night.", "label": 0}
{"text": "House host, I guess", "label": 0}
{"text": "why the downvotes", "label": 0}
{"text": "Exactly!", "label": 0}
{"text": "4000+ seaweed patch harvested is where the bulk of them came from.", "label": 0}
{"text": "You’re right about the UK world in peak times lol that’s for damn sure there’s some NH’ing studs there.    \n     \nI think the most prevalent ahk is auto overheads that’s what I notice the most of as far as cheating.", "label": 0}
{"text": "Dont give jagex ideas.", "label": 0}
{"text": "I mean, higher level weapons being better than lower level weapons is generally how it goes... It is like saying the Cudgel hard out classes Scimitars.", "label": 0}
{"text": "It does have in-game effects, but I am pretty sure there are several mounts that already do the same thing as this mount", "label": 0}
{"text": "What happened to #7?", "label": 0}
{"text": "This cosmetic costs way more than the expansion that came out a few months ago lmao. Insane", "label": 0}
{"text": "I literally told him to check with his bank because it could go either way. What if he banks with a small local/regional bank like I do? I didn't make a matter of fact statement that you were wrong. I just offered my own experience with the issue and suggested he find out how his bank handles it. \"yOuR aDvICe Is wRoNg\" calm down buddy, we aren't on a debate stage.", "label": 0}
{"text": "thank you that worked!", "label": 0}
{"text": "Its an auction house and mailbox mount (to get stuff after buying/selling it on the auction house it gets sent to your mailbox).\n\nSo in osrs terms. Its a mobile GE you can plop down and use anywhere you're not in combat.", "label": 0}
{"text": "Nope. There was \\_one\\_ mount that had the auction house functionality. And these days it's pretty much not avaliable.", "label": 0}
{"text": "A portable GE would be a billion times stronger than this. If I need a certain reagent to craft while I'm out, I can comfortably stash hundreds of them in my inventory in WoW (aka you dont really need it). If I could just buy an inventory of sharks mid boss run in osrs that would break the game", "label": 0}
{"text": "Been a bit since I've done more than heroic pugs tbh, I guess I didn't think of the timeloss to people fucking around. I can see that (though losing a whole week because no brutosaur seems a little steep). Could definitely see how that could help keep momentum on a raid night ", "label": 0}
{"text": "Point is blizzard have said they were able to keep sub price unchanged due to the cash shop. Now they are introducing a mount with a walking grand exhange and bank collect function anywhere in the open world and some instances.\n\nHence OP is pointing out that keeping the same sub cost leads to more mtx at least in blizzards case.", "label": 0}
{"text": "I personally appreciate your earnest and casual language. It seems only damnable in modern professionalism that those who are earnest aren't formal enough or are secretly insincere, and those who are formal are corporate cronies. \n\nLike of course the community wants a parameter that Nieve doesn't die in MM2 and a parameter that we can marry NPCs. And we know these more fine tuned options will be included. It's only appropriate to talk basics in the beginning.\n\nGuthix blessed I cannot wait to marry Nieve.", "label": 0}
{"text": "Brine Sabre?", "label": 0}
{"text": "That boss fight doesn’t need to be any harder", "label": 0}
{"text": "If you’re going to grow up to not be a JW there is no appeal (or point) in befriending the other kids in the hall who are clearly going to be lifers. I’d hang out with other kids but never considered any of them my friends", "label": 0}
{"text": "What method are you using for kills? Considering camping Zulrah just don’t know whether to go with t bow or shadow only", "label": 0}
{"text": "Yeah this is a fabricated mess", "label": 0}
{"text": "spent over 600m on 99 prayer with superior dragon bones", "label": 0}
{"text": "It ain't that serious. I'm not buying this mount but I've spent plenty in other games because they are providing a product that I want to support.", "label": 0}
{"text": "There's only 4 questions so if you memorize the 4 answers you should be good! Or you can just bring Strange Old Lockpicks to skip the doors!", "label": 0}
{"text": "Who needs women? I still have other skills to max", "label": 0}
{"text": "It's close. Closer than I thought because I'm normally used to people talking about cape or secateurs, which are applied earlier than attas.\n\nhttps://oldschool.runescape.wiki/w/Farming#Variable_crop_yield\n\nAs you can see there's a 1 and a 0.5 in the formula that is never affected by multipliers, so any given multiplier does not apply flat.\n\nCalling it 5% flat is not technically true but it's close enough to the truth until you start pulling out calculators (which there is one on the wiki) https://oldschool.runescape.wiki/w/Calculator:Farming/Herbs or are *really* trying to figure out whether attas or iasor is better for you personally.", "label": 0}
{"text": ">I think everyone has had those skotizo kills where it just spams altars non stop\n\nYou mean this isn't the norm? I've never had a Skotizo kill where I could get all 4 altars killed before a new one spawns.", "label": 0}
{"text": "This is it, this is the answer to the Ancient Shard Question.", "label": 0}
{"text": "Oh hell I just completely forgot about Sepulcher. I guess it ultimately doesn’t have an xp boosting armor set tho (I don’t think it does anyways) so I always forget about it, despite being I think the best xp to 99.\n\nThe wiki doesn’t do GOTR any favors when trying to learn it. I had to watch like three or four YouTube videos and play probably 5 games or so before I really got into the groove of it. It’s simple after you learn what you should be doing and when you should be doing it", "label": 0}
{"text": "You should always start range pray, as it’s much easier to react to the mage animation than the range animation, which is an idle delay into a quick stomp. \n\nAs soon as you see the projectile for either, your fucked anyway.", "label": 0}
{"text": "No, because I have an assembler :]", "label": 0}
{"text": "I can see either interpretation being valid with Ash's response. A 5% percentage reduction of 50% could be meant as 50*.95 and i wouldn't get mad at someone reading it as 50-5 either.", "label": 0}
{"text": "I’m guessing they still want Stamina Pots and Ring of Endurance to be useful.", "label": 0}
{"text": "I'm afraid it's not percentage but rather whatever unit Jagex uses for their drain rate forumla on the blog post. I believe it is run energy lost per tick, which is represented internally as 10000. This is just the difference between the two formulas.  \nI can re-do it with percentage. Sorry for the confusion!", "label": 0}
{"text": "I would not eat them with the gnomes, I would not eat them during mahogany homes", "label": 0}
{"text": "The wiki button on the bottom right of your minimap! You may have to enable it in the settings. It opens the oars wiki when you click on any item or NPC with it", "label": 0}
{"text": "I don’t think people realize how massive this will be", "label": 0}
{"text": "Hey sorry, a few weeks late and just saw this lol\n\nAll the important stuff is still the same, just moved the games room into a dungeon and put a leagues hall where it was to display some trophies.", "label": 0}
{"text": "This would be akin to a development sandbox of game mechanics.\n\nI'm intrigued by the concept but this is kind of like handing the mob the keys to the castle. I think their intent is very specifically to allow the parameterization they've shown, not to allow users to start developing a game outside of their own bounds and parameters.", "label": 0}
{"text": "I LOVE FASHIONSCAPE", "label": 0}
{"text": "P2W mount priced for more than a AAA game. This mount did not take a significant amount of dev or design time and it's artificially inflated because of pay piggies such as yourself.", "label": 0}
{"text": "No, it’s a video game", "label": 0}
{"text": "i saw a dude here blowing theough dragon arrows with a dark bow and mixed hide cape instead of assembler abd i just gotta ask, what is it about wyrms that seems to attract people who dont have a clue whats going on", "label": 0}
{"text": "you are the rare 1/200 person to do that.", "label": 0}
{"text": "just take it one quest at a time, quest helper on runelite is great, tells you all what to buy and filters your bank for those items :)", "label": 0}
{"text": "Play the game how you want to play it man. There are 23 skills for a reason! Obviously you will have to level them all above 70 for certain quests but do what you want! I am personally a clue hunter so i do slayer for clue drops then i do the hard clues as they come. Then if i hit a roadblock in a clue (quest requirement, music requirement, etc.) i go and do the quest/skill requirement. If you play the game the way you want the levels come naturally.", "label": 0}
{"text": "Scummy but if you give anything without collat that's kinda on you.", "label": 0}
{"text": "Fun fact about that, back when they released Corp some dude had it on and did like 12 kills and got d boots every drop. They fixed it quickly but apparently it DID work for \"new\" bosses at the time.", "label": 0}
{"text": "Thank you for the insight. Doesn't justify the price point", "label": 0}
{"text": "I just got farming pet at 2.5m farming xp, spoons are real this week", "label": 0}
{"text": "At least 7", "label": 0}
{"text": "“qol” huh\n\nalso it’s not demonbane, it’s the ancient shards. this idea doesn’t make sense", "label": 0}
{"text": "This worked for me\n\nI'm guessing mobile doesn't like it when you spit like 10 or 20 items onto the ground at once?", "label": 0}
{"text": "Great take", "label": 0}
{"text": "The only advice I can give that hasn't explicitly been stated already is that--\n\nLiterally every single person with boss kc has died so many times. If you see a hardcore account with boss kc, it's 100% not their first account. The only way we learn to kill bosses is by dying and that isn't failure - it's growth.\n\nDying is good. It means you're pushing your boundaries and getting better.", "label": 0}
{"text": "I know, you’re welcome", "label": 0}
{"text": "And its still, straight up, P2W if you look at bonding out of early / mid game, buying services and gear, etc.", "label": 0}
{"text": "I've always had an issue with Loot Tracker on mobile. Ground items has been fine though.", "label": 0}
{"text": "I believe it'd be -7 less run energy drained per tick compared to the original system. Run energy is represented internally as \\[0, 10000\\]. Sorry for the confusion!", "label": 0}
{"text": "Just an incredibly overweight character sprite that does nothing but eat for the whole team.", "label": 0}
{"text": "Hell nah i just killed vork 50 times in 1 kc trips with abyssal dagger lol", "label": 0}
{"text": "What if you got a chromium Ingot when you rolled the ring piece so that when you got the vestige you would get your third Ingot and be able to complete the ring? \n\nThis would also silence the “how many rolls have I had so far” problem as well", "label": 0}
{"text": "No way thats you! Its an honor to even be in the same post as you brother,you inspire me so much hopefully one day I can be number 2 :)", "label": 0}
{"text": "Difference in run energy lost per tick. Run energy internally is stored from \\[0, 10000\\].", "label": 0}
{"text": "You won't really run into this issue much if you got high combat stats and at least Emberlight/Scorching bow i'd imagine right? Worse gear = having to destroy altars more often if you can't DPS skotizo in-time.   \n  \nGood QoL but if it only affects like the one bad RNG kill out of the 10 totems you got doing slayer, its probably not the biggest priority in all honesty.", "label": 0}
{"text": "I don't think it's that. Some 3x3 monsters like Wyrms and Lizardman Shamans drop their loot on their middle tile, but ammunition and RDT/tertiary drops go on their SW tile.", "label": 0}
{"text": "Suggesting someone needs an alt to get into bossing is crazy though", "label": 0}
{"text": "I guess that works lol", "label": 0}
{"text": "Ah yes, Group Ironmeepo.", "label": 0}
{"text": "Someone else pointed out that silver light and dark light do not work either. Demonbane isnt the importants factor the shards are so not an oversight from that point of view.", "label": 0}
{"text": "Quite funny tbf 😂", "label": 0}
{"text": "I mean it's just my opinion. I find it easier.", "label": 0}
{"text": "Wow hasn't raised its membership price ever I believe but it's also filled with shit like this. Basically pick your poison.", "label": 0}
{"text": "Emberlight and burning claws probably goes wild then as a good secondary", "label": 0}
{"text": "Straight to questcape with some money slayer on the side.", "label": 0}
{"text": "Straight to questcape with some money slayer on the side.", "label": 0}
{"text": "Straight to questcape with some money slayer on the side.", "label": 0}
{"text": "Scorching bows spec should work on non demon enemies like it was supposed to.\n\na 2.4 sec bind, and 5 burn damage is not overpowered at all, basically arc spellbooks undead grasp for 1 hit, with a little burn damage.", "label": 0}
{"text": "Literally picture, puzzle, pattern, door.", "label": 0}
{"text": "Just hit 99 Strength so no more controlled for me.", "label": 0}
{"text": "They're a task most more efficient players will have blocked 24/7, the people in the boring max setups aren't going to be there unless they're horrifically dry on a clog slot or something. \n\nSo so most of the people whose either don't care as much about efficiency and will be more likely to be using stuff because they like it, or new players who are using whatever nonsense they can scrounge together. \n\nAnd they're only in one place, and said place is big enough to support a decent few ppl,so you get to see the entire population of people doing wyrms on your world all concentrated together  and many of them will have not bothered to hop to a free world.", "label": 0}
{"text": "Advocate for more RS cosmetic items.  It's honestly not easy and for every one you see 3 were terrible and not really achievable.  The new hair styles helped alot.  If they made new base clothes and colors that would be HUGE.", "label": 0}
{"text": "I used to pk a lot until I felt I was no longer able to do it well. My pure was in a good position to do Konar slayer so I used to do her a lot until I found out that the highest lvl monster was Konar exclusive then I decided to main her from 70-99. I have 3k+ hydra kills with everything except pet. Hydra is tedious but pays the bills. I also have a zerker that now does wildy slayer and its a lot of fun for me but YMMV because like Konar specific builds benefit more from Krystilia (i.e taking into account pkers, doing the wildy achievements, having access to WGWD.)", "label": 0}
{"text": "Why is it a waste of time if you find it \"fun\"?", "label": 0}
{"text": "Yea the video i watched on Zulrah straight up said dont get mad if it takes you 20+ attempts to get it down and get your first kill\n\nIts a lot to remember", "label": 0}
{"text": "I don't think it'd be fun for a \"public\" private server. It'd be fun solo or with friends (or as part of some YouTube series with a large group, I guess).", "label": 0}
{"text": "Evil Gnome Child.", "label": 0}
{"text": "It could be something specifically coded to the monsters I mentioned, or I could be misremembering slightly which tiles are which. But I've experienced the 1 tile diagonal offset with RDT and ammo drops enough to know that it's definitely a thing for Shamans/Wyrms.", "label": 0}
{"text": "Low alch it", "label": 0}
{"text": "at least this is an optional purchase, membership is not", "label": 0}
{"text": "As far as I can tell this man never lied", "label": 0}
{"text": "Venmo me 500$?", "label": 0}
{"text": "HS is a bit of a mix of agility course, minigame, and PvM-like movement mechanics, focused on manually dodging obstacles that get more difficult as you go. It definitely requires more attention and learning to get into, but is much more enjoyable than regular rooftop agility.\n\nGOTR is easy to get into, it's a simple loop of get shards -> make essence -> craft runes, plus there's a plugin that highlights most things as you go. There's some ways to make it a little more efficient by timing when portals spawn to minable objects that allow you to skip making the essence, but that's not necessary to just play the minigame.", "label": 0}
{"text": "The flex is sticking to your choice to stand alone", "label": 0}
{"text": "Thanks everyone! Definitely seems to be the raw bird meat spawning and how it interacts with the ground items overlay. Hoping Jagex adds the feature on mobile to toggle specific items", "label": 0}
{"text": "If I asked to borrow a tbow to complete the inferno and then only tried once a month for the next couple years, is that a lie? *playing devil’s advocate here, would never do scummy shit like this but I see the argument in a game”", "label": 0}
{"text": "Is it? This literally JUST happened to me on the Varlamore herb patch. Kwuarm became Avantoe after using a plant cure on it and waiting for it to grow.", "label": 0}
{"text": "Haha all mine are solo or duo, but duo I’m always MVP cause it’s with my iron buddy 🤣 it’s a hard grind", "label": 0}
{"text": "I understand this is a joke, but in the real world there is a thing called court where you can sue people for not holding up their end of a deal. In osrs there’s not so we had to bring in a 3rd party being runewatch to at least give some sort of incentive to not scam people.", "label": 0}
{"text": "The video guides made this seem intimidating but I swear GGs are actually very fun and simple. They just have like 6 phases or whatever, so you need to know what to do on each phase, but they are individually super easy.\n\n Compare to something like Zulrah where you have to be doing a lot at once with gear swaps, prayer swaps and just eating a shit ton of food.", "label": 0}
{"text": "If someone wants to play the game with NoCurrencies, or do Quests in Release Order (whilst only being to use items, do content or go to map areas for that Release Date), it feels an awful lot like this could be in the main game.  \n\nBasically, a lot of these options would be cool to otherwise have and not be just on Community Servers.  Any chance some of these things might be implemented in the main game?  (I have a particular soft spot for the By Release idea; thanks J1mmy.)", "label": 0}
{"text": "Summoning was cool, but I’m glad it ties into magic in OSRS with thralls. Obviously no storage but maybe someday\n\nI do miss the rest option though. That was goated cuz u could sit down with friends", "label": 0}
{"text": "I would not combo eat them with a brew\nNot even if they save me from a Verzik miscue", "label": 0}
{"text": "??? Is it though. The drops are trash and the kills are super slow", "label": 0}
{"text": "Let's not forget anything approaching efficiency for mole is locked behind 70 prayer for the Falador hard diary", "label": 0}
{"text": "Actually there's no pop up warning if you click to log in to a high risk wilderness world from the main menu login screen instead of the world hopper. All you get is a tiny message on the log in screen which  nobody looks at because they see the same message multiple times a day. This definitely needs a looking at.", "label": 0}
{"text": "If there is no date set on return it is presumed to be upon request of return from the owner.", "label": 0}
{"text": "both of these guys are severe clickbaiters. simply click the dots next to the videos and select. do not recommend channel\" they lie constantly.", "label": 0}
{"text": "It pulls on the rope. He thinks the rope is his", "label": 0}
{"text": "I don't think you can do this? But if so yes, because you'd be disconnecting and reconnecting", "label": 0}
{"text": "oh awesome! that's a good idea too! I really had no idea burning claws were just so damn good... haha.", "label": 0}
{"text": "Yeah insane amount of needed resets/rng for speed times are the reason I likely won’t ever get gm. Huge gz to you!", "label": 0}
{"text": "Only 3 hours?", "label": 0}
{"text": "It's very strange that you're so offended by someone complimenting the JMods for doing a good job (which is a subjective opinion). Why do you feel the need to call out positive reinforcement as \"dick sucking\" or \"ass kissing\"? You even acknowledge that the JMods are doing their job pretty well, so why is it a problem for someone else to emphasize that?\n\n\nI just don't get where you're coming from on this. ", "label": 0}
{"text": "Found this in a search helping a clanmate, thank you!", "label": 0}
{"text": "Most people don’t do wyrm tasks.", "label": 0}
{"text": "Uuuum id try awakened vardorvis, hes chill af and youd love him.", "label": 0}
{"text": "I’d let him axe 1. He don’t got the ammy, gloves, or ring for the question to 1 shot me.", "label": 0}
{"text": "I'm at 200 something KC at CG on my iron and my deaths still outnumber my completions, but the gap is shrinking. \n\nCG teaches you boss mechanics without forcing you to invest in supplies. It's hard because it's the easiest thing before the rest of the game. If you've ever played Dark Souls, CG is Ornstein and Smaugh. A pure skill  check to see if you're ready for what's to come. \n\nYou get better at by sucking at it until you don't. At the end of the day, OSRS is a game. It's designed to be beaten.", "label": 0}
{"text": "There's no right or wrong way to play, but there are more and less efficient ways to play. \n\nOP is playing horribly inefficiently. Which is totally fine, but you wouldn't recommend it.", "label": 0}
{"text": "Truly horrific, congratulations", "label": 0}
{"text": "I just got my first KC after 25 deaths at around 78 range/mage/def\n\nTbh learn t2 prep like the back of your hand, makes things easier. That and keeping offensive/steel skin on always is super important.\n\nTotally just practice tho. You got it!", "label": 0}
{"text": "If you can do floor 5 of hallowed sepulchre at 85k xp/hr, or lava runecraft for 100k xp/hr, then use lamps on agility.\n\n\nHowever, if you plan to train with easy/afk methods and only get 45k xp/hr runecrafting Souls, or 65k xp/hr doing agility at ardy rooftop, then use lamps on RC. ", "label": 0}
{"text": "In Moons of Peril, if I am only killing blood moon, do I roll specifically for blood pieces or is the whole table available?\n\nMy buddy said he was only doing blood moon because he's looking for tassets and he got a dupe of an eclipse piece. It was my understanding it didn't work like that and to get eclipse pieces you'd have to kill eclipse?", "label": 0}
{"text": "Can anyone explain?", "label": 0}
{"text": "Jagex ban this man now", "label": 0}
{"text": "Maxed iron, can do all content, entry level pvper it very little rewards", "label": 0}
{"text": "Huevos Verde y jamón", "label": 0}
{"text": "Hey thanks for the reply. I appreciate it.", "label": 0}
{"text": "Lucky you. If I try to train something in my peripherals, the autopilot is like counting sheep, I'll pass out in 15 minutes.", "label": 0}
{"text": "I really like this question. My main is maxed now and I just pet hunt when I do play it, but I don’t play it often.\nOn my road to max, I preferred to level things pretty evenly (like base 75s then base 85s then base 90s and finally maxed). Prior to base 75s I was mostly using quests and then diaries once they released, to guide my progression.\n\nMy GIM, which I play a lot more actively, I focus on combats mostly. And quests and diaries to guide skill progressions. I find combat stuff to be more progression on my account than skilling, so I heavily prioritize bossing.", "label": 0}
{"text": "This is definitely a non-issue. As a main, getting to 80 crafting would only cost 6.3m and take ~6 hours with green d'hide bodies if they were the minimum level of 50 for quest requirements. If they get a drop they could easily grind that out for a big payout. 80 crafting is not stopping anyone from grinding DT2 bosses lol", "label": 0}
{"text": "Nothing comes up, he's not updated or something", "label": 0}
{"text": "Me when I home tele after the worst vardorvis combo possible.", "label": 0}
{"text": "Soon ™️", "label": 0}
{"text": "Yo the fkn clicks sheesh", "label": 0}
{"text": "Feel free to do so, I can probably be updated to the better", "label": 0}
{"text": "Also a thing for cg demi bosses", "label": 0}
{"text": "https://en.wikipedia.org/wiki/Green_Eggs_and_Ham", "label": 0}
{"text": "What combat level are you?", "label": 0}
{"text": "Yeea i feel like I don't have enough really make something that looks nice", "label": 0}
{"text": "These have been so incredible. Please post a large summary at the end!!!", "label": 0}
{"text": "Maybe its just... fun? Not everything has to be optimised meta to within an inch of its life.", "label": 0}
{"text": "Maxed combat 200k off 99 slayer, 1B bank, literally never boss… can’t be bothered to overly focus on osrs plus I play mainly mobile, 99% of my time is just killing vast amount of creatures. Rune drags, lv221 tzhaars, Abby demons to name a few", "label": 0}
{"text": "Looks like a tzhaar", "label": 0}
{"text": "I cant fathom playing this game and not bossing. Best part.", "label": 0}
{"text": "How you only get 2 permits in a game?", "label": 0}
{"text": "I literally did that just so I have the option if I ever return. Unfortunately the cost/benefit is just too great to ignore and that’s super scummy but it’s the reality", "label": 0}
{"text": "I mean when you think about it why would a demonbane weapon have any effect on an altar? Skotizo is a demon. Makes sense. An altar is not a demon.", "label": 0}
{"text": "What plugin is this?", "label": 0}
{"text": "I pretty much just play fashionscape so I know your pain!", "label": 0}
{"text": "More like at least 7m 😂", "label": 0}
{"text": "While it’s not AS powerful it’s better than many people think. Like if you’re in a raid and someone forgot their mats, if one person had Bruto then it’s a non issue. Only one person needs it though but still a raid without one is at a severe time disadvantage, making someone with it *slightly* more valuable that someone without it", "label": 0}
{"text": "Very good", "label": 0}
{"text": "Tbow taker has some competition", "label": 0}
{"text": "Looks neat", "label": 0}
{"text": "You can train magic, defense, and slayer all together with barrage on defensive. So you really shouldn't train defense with melee. Imagine (im using round numbers for simple math here, not a realistic example) if it took 100 hrs for me to get 99 strength with an abby dagger and then 100 more hours to get 99 atk with a whip. So 200 hours to finish both. Just doing whip on shared that whole time it would take over 300 hours since you waste 1/3 of your xp on defense that you could have passively leveled with barrage slayer. On top of that, having 99 str would make the attack training portion higher xp/hr.", "label": 0}
{"text": "It's not exactly the fault of the person loaning the money but it's also the only way you can get scammed like that. The scammer is still the problem but people should also be more careful.", "label": 0}
{"text": "Monkey terms: Red = Good. Yellow = Normal. Blue = Bad.\n\nThe black line with a \"0\" Indicates that there is no change", "label": 0}
{"text": "I understand that at the end of the day in a game like OSRS it's all about RNG; however, I hate how RNG is a basis on combat **achievements**. Shouldn't they solely be based on skill?", "label": 0}
{"text": "Sometimes it's better to have lot of small things than few large things.", "label": 0}
{"text": "Correct, you must be careful. But literally saying it is on the loaner takes away all responsibility from the scammer.", "label": 0}
{"text": "So this is tracking doses, not full/4-dose potions? Can you set what value the full bar is? Looks like is is currently 100 doses, which honestly isn't that many potion (25 4-dose).", "label": 0}
{"text": "That's a significantly better idea than the npc crafting it for you.", "label": 0}
{"text": "Barrows , the two new bosses scurrius and the frost nagua are great for learning Pvm. \n\nThey will teach you to swap prayers , and get you prepped for harder things. \n\nMoons of peril is also surprisingly good money. All depends on if you prefer stuff group or solo", "label": 0}
{"text": "That’s just a prayer potion (9001)", "label": 0}
{"text": "Not all of it. Like I said, the scammer is the offending party but the scam also can't take place with money you don't trade them.", "label": 0}
{"text": "Nice try osrsdiddy", "label": 0}
{"text": "This was a problem before that fix", "label": 0}
{"text": "They as a company are responsible for what they put out, they should take responsibility for not following through with what they said.  You seem to care way too much about the semantics.", "label": 0}
{"text": "visit your poh in prifddinas, oh wait you need song of the elves for that which you didnt do :(", "label": 0}
{"text": "I’ve literally only been skilling since I got back into RS (1200 TL so far) and just this week got into some slayer. Never done a boss other than wintertodt. Figure at some point maybe I’ll make friends that can teach me bosses and until then I’ll just be grinding my 99s :)", "label": 0}
{"text": "Based", "label": 0}
{"text": "Exactly bro like they really got us good with this one, because it’s too good of an upgrade to pass up. I literally bought it yesterday because I was afraid they’d stop selling it or something (which may be a ridiculous worry since they are raking in cash, but they HAVE said they want these mounts to be rare, so if it sells too well I wonder if they will pull it). It would literally bother me for years if I didn’t get it at this point, and they really don’t offer it for another several years again. The $90 for me is worth not being bothered by it anymore. \n\nI feel guilty for buying it and supporting practices I normally rebel against, but it’s just too sweet a “deal” to pass up. The last time they sold this it was $650 in WoW tokens, and this one is better because it has a mailbox.", "label": 0}
{"text": "Osrs is one of the ugliest mmos on the market right now", "label": 0}
{"text": ">> some sort of incentive to not scam people\n\nRemember how the top comment mentions collateral? You’re right that there is no court of law in gielnor. \n\nPersonally I’d trust collateral more than runewatch but ymmv", "label": 0}
{"text": "For noob guilds maybe but for any guild that’s even semi serious about progression you’re gonna have someone with everything you need on hand all the time. Also you can just have someone not in the raid mail you shit lol.", "label": 0}
{"text": "It's just tracking doses, though it probably wouldn't be hard to add an option to show the number of full potions instead.\n\n> Can you set what value the full bar is?\n\nYep!", "label": 0}
{"text": "It’s an extremely practical mount. But it doesn’t give anyone an edge in the game, just saves people who get it a trip back to town. It’s really cool when micro transactions don’t give you an edge and maybe just have a nice slight QOL feature. I don’t understand what the big deal is", "label": 0}
{"text": "If it's anything like glorious bars, please make a special furnace you can deposit noted ores/bars first, since we have no metal bank\n\nNot only would it be absolutely ass to run to and from the bank for hundreds of ore for a single bar, I think it'd make them nearly impossible to smelt for UIM", "label": 0}
{"text": "I’m on the elite diary grind now. Unboostable 93 slayer for Western Provinces is _by far, by a million miles_ the longest requirement to get. Jagex went and gave the slowest skill in the game the highest unboostable requirement. If you’re sitting at the minimum quest cape slayer level of 69, you have _hundreds_ of hours of slayer left. For me, compared to that, none of the other reqs even chart in difficulty.\n\nI got my quest cape with basically minimum stats and then did things in this order:\n\n- Base 70 stats\n- All Hard Diaries\n- Base 80 stats, base 90 combats (not incl. Prayer)\n- Now working towards elite diaries\n\nOnce I’m done with this I’ll probably go for max combat, grind cash, and figure out where to go from there.", "label": 0}
{"text": "Gentle reminder that slayer is the slowest skill in the game", "label": 0}
{"text": "He said anyone not anyjuan", "label": 0}
{"text": "What is the bar for? This looks like it maxes out at 100 doses, and potion storage can obviously store a lot more than that", "label": 0}
{"text": "With all due respect, why comment if you don't know what you're talking about", "label": 0}
{"text": "Well what about farming gold locations? Like if you have an AH and Mailbox, you can clear your inventory by posting items then get right back to the grind. This prevents wasting time going back and forth and improves your gold/hour.", "label": 0}
{"text": "I’d eat anything off Zilyana tbh", "label": 0}
{"text": "> Is it that simple to hack an account? \n\nIt depends on how you view 'simple'.  \n For instance, if your account is protected by some form of authentication then that adds another layer of security that the hijacker would have to get through - which makes it quite cumbersome! Conversely, if the account wasn't equipped with 2fa, all a hijacker would need to gain access is your password and the login email.   \nPasswords can be found from breached databases -  if you regularly re-use your passwords across multiple services you might have some trouble down the road. \n\nHaving said that, I would wager that your email was compromised, then the hijacker disabled the authenticator via your email. \n\nDid you have 2FA enabled on your email account?  \nNote that having the Authenticator enabled on your legacy Runescape account will not matter if your email was compromised as they can easily disable it.  \nIf you had no 2FA protecting your email account, I strongly encourage you to enable it. \n\nPermanent RWT bans cannot be appealed as per this [page](https://support.runescape.com/hc/en-gb/articles/115002238729-Appeal-an-offence), so there isn't much that can be done I'm afraid.\n\nIf you decide to create a new account, [consider upgrading to a Jagex account.](https://support.runescape.com/hc/en-gb/articles/10682990186129-Upgrade-your-RuneScape-character-to-Jagex-account)  \nTake note of the security advice listed [here](https://support.runescape.com/hc/en-gb/articles/207217595-Security-tips) before you create a new account.", "label": 0}
{"text": "You realize a lot of people paid real cash for the original brutosaur? People just bought tokens.", "label": 0}
{"text": "More like at least 7b 😂", "label": 0}
{"text": "The bar is just a nicer way to see at a glance how much of each potion you have. 100 doses is just the default value, you can configure it to whatever you like!", "label": 0}
{"text": "No please. Red green is a nightmare with colorblindness. Especially since in that scenario the colors would blend and would have large stretches where all the colors are the same to a person with colorblindness.", "label": 0}
{"text": "If you are praying your protection prayers then 90% of them will be indiscernible from the regular ones. Just look at the wiki for the superiors of that task", "label": 0}
{"text": "Gratz m8, I got the exact same log.. enjoy showing it off to everyone who asks you 'what kc?' lol", "label": 0}
{"text": "Yeah I never said anything about the drops, just that it was a good boss to learn mechanics on.", "label": 0}
{"text": "The duality...\n\nhttps://preview.redd.it/l4a54sumhywd1.jpeg?width=1065&format=pjpg&auto=webp&s=52c09e085c785979b02248e6525951a7db4de2a0", "label": 0}
{"text": "Same thing can be accomplished by mailing shit to your alt", "label": 0}
{"text": "Don't set it to 1% what are you doing lmao. That would drive me nuts.", "label": 0}
{"text": "I got the duke time with zombie axe on an entry kill, just grind out 1k kc and you'll get it :)", "label": 0}
{"text": "Its..its.. PERFECT", "label": 0}
{"text": "Another 30 for each to unlock it would be really cool IMO. Need 90 shards to \"complete\" ancient shards", "label": 0}
{"text": "Meh. Kind of crazy some grown adults throw away years worth of friendship for a hundred dollars worth of gold", "label": 0}
{"text": "runewatch", "label": 0}
{"text": "Yup I totally get that, but I still got it lol. They got me good :/. But still yet I really rarely buy anything and my savings are pretty healthy so eh it’s fine. I spend the same amount of 10 packs for bonds every now and then and get similar benefits from it. I’ve done that once or twice as well since the bond launch tbh, but it isn’t a regular thing for me so eh.", "label": 0}
{"text": "Nail beast pet that makes loud noises for every player on screen", "label": 0}
{"text": "Every 2 hours right? Plus you have to take the time to switch characters which adds up over time", "label": 0}
{"text": "This is cool enough that hopefully Jagex makes this vanilla!", "label": 0}
{"text": "rock golem decided to be gnome child for halloween", "label": 0}
{"text": "rune scim is pretty much why I said most, it's the 1 significant item f2p irons can't get without smithing. they would utilize it for sure, though it's questionable if F2P irons would even want that kind of change - a good chunk of the few F2P irons consider rune scim one of the major milestone goals of the game mode\n\nother than scim, everything else is pretty accessible through shops or obor/bryo/ogresses", "label": 0}
{"text": "What in the fuck", "label": 0}
{"text": "What’s the point of collateral when you can just sell the item? Removes the point of the loan.", "label": 0}
{"text": "I am new to the mechanics of OSRS so forgive me if this is silly - it seems like there is a difference between a miss and a zero. Sometimes when fighting Blood Moon, she will combo 0-1-1 which I thought wasn't possible, so there must be some difference. Is there a way to tell in combat/visually? \n\n[Example](https://imgur.com/pGnq5UG)", "label": 0}
{"text": "Make it louder. Give it a New York since its an armored pigeon.", "label": 0}
{"text": "Evidently I don't know how to play it efficiently since I've only done it five times.", "label": 0}
{"text": "It's about pragmatism for me. There is a reasonable margin of error that doesn't bother me, because humans aren't perfect.\n\n\nMy main objection is calling it a lie. I don't see why it would benefit them to lie about the Amylase from the course, nor do I think that's the most likely reason that expectations weren't met.", "label": 0}
{"text": "Could see this useful to gauge how much longer you have before an iron needs to reup herb supplies. If you start chambers with 3000 prayer doses and you see the bar at 20% you know you should prob start farming more snape grass soon or w/e", "label": 0}
{"text": "Just like they did here. Massive gains in run time and doubled regen over the old system at lower weight and agility level with the gap tapering off as your weight goes up. It's pretty rare to need to carry a shit load of weight early/mid, or if you have heavy gear the longest run is usually to a slayer spot and you'll most likely have enough energy to get there from a teleport.\n\nIt's only late game stuff like raids and X:0 methods where you *need* to run for extended periods of time with a lot of weight on you and stams have that covered.", "label": 0}
{"text": "Can you run skip the traps in the zebak puzzle room or whats the timing to avoid damage? Ill start the tile before the first trap, avoid poison, and still somtimes take damage.", "label": 0}
{"text": "Hey, this is really cool. I love quick visualisations like this!", "label": 0}
{"text": "No one says you have to switch characters as soon as you mail the stuff over lol, I think it’s safe to say you’ll probably log into one of your alts at some point, no? I don’t really see how that’s wasting any time. And yes the engineer mailbox is every 2 hours but I believe there are other mailboxes in the game now too. I don’t know if they share cds or not but it’s irrelevant because you have so much bag space in wow there’s no way you should be running out of space every 2 hours given that you can have like 160 slots these days, most items stack to 20 or higher, and you can easily get a mount to vendor trash without any real money purchases.", "label": 0}
{"text": "exactly the same xp?? damn that’s kinda dope actually", "label": 0}
{"text": "https://preview.redd.it/srdexhy7jywd1.jpeg?width=646&format=pjpg&auto=webp&s=9db74a611c28585a9e99e0eec66778215d3864a6", "label": 0}
{"text": "Tbh it had a lot to do with me never clearing my emails, so I was fortunate enough to have receipts for everytime I got back into rs going back like 15 years.", "label": 0}
{"text": "Yes officer, this man right here...", "label": 0}
{"text": "Do you think the \"new prayers\" that they want to implement are not going to affect power much?\n\nIn my opinion, tweaking/reworking prayer is fine but they should be very cautions adding new prayers. As OSRS players are not kids anymore, we min-maxing naturally and end game mechanics require you to learn about ticks and various manipulations in combat.", "label": 0}
{"text": "That's cool", "label": 0}
{"text": "Have you seen from dusk til dawn?  It's peak Tarantino foot fetish", "label": 0}
{"text": "You play how you want to, thats the idea no?", "label": 0}
{"text": "Holy copium.\n\n\n>Slayer XP rates aren't shit, if you have the correct block tasks set up for Slayer XP. \n\n\nThis is just a 0 thoughts take. Even w an absolutely perfectly optimized blocklist your melee slayer xp/h w perfect rng is still only half or so of what youd get from the same blocklist and tasks w ranged/magic. Not to mention how stupidly big the speed difference is between range and melee when it comes to doing the turael skips between the xp tasks.\n\n\n\nIf u compare the xp rates of lets say, meleeing bloodvelds/abyssals in the  catacombs vs bursting/venator bowing them in the catacombs, yes, the melee slayer xp/h you are getting is significantly worse.\n\n\n\nLets take another example: Greater/black demons. If u melee them in catacombs you are getting significantly worse slayer xp/h vs cannoning them in the chasm of fire.\n\n\n>It's more efficient for progressing an account naturally to grind your way through the levels upgrade gear through drops.\n\n\nThe major gear unlocks and big ticket items from slayer come from the higher levels. If you want to get those as soon as possible, youd obviously want to reach those impactful levels fast, and sorry to say this, but meleeing as many tasks as possible is the complete opposite.\n\n\n\n>You can then afk for 8-10 mins depending on prayer level. \n\n\nmmm nuking your dps to as low as possible in an attempt to reduce the activity requirement to as low as possible, resulting in worse xp rates.\n\n\n\nMelee is such a free combat style to level up passively thru other content (raids, bossing, certain places w massively boosted xp rates like melee/range hybriding tormented demons), its literally griefing yourself to force purely melee slayer to cut your xp/h by half.\n\n\n\nAs for NMZ, I never even mentioned it, you are just dragging that dogshit in to try and prove something. Everyone knows NMZ is dogshit content you only do for your few ring imbues if u dont want to deal with the omega jankiness of PVP arena dolo boosting.\n\n\nYou sound like one of those andies that still think the ghrazi rapier is an amazing weapon for slayer because it happens to kill a monster 2 ticks faster than an abyssal whip.", "label": 0}
{"text": "What is a loan and how does it work", "label": 0}
{"text": " Could still get an Ava’s 😂😂", "label": 0}
{"text": "I got bowfa, vrystal body and legs, barrows glpved, power ammy, mixed boots and cape, so I should be able to send it by now", "label": 0}
{"text": "You ain't alching anything, bruv", "label": 0}
{"text": "Lmao run watch is such a joke. I just don't get it. It's why I fucking solo anything and everything cause people suck lol this guy however is a comedian and he does not suck. Infact I'd loan him 100k just for the laugh", "label": 0}
{"text": "Basilisk Knights also drop loot in their middle tile, still no clue why", "label": 0}
{"text": "It’s a reference to the Dr. Seuss book, “Green Eggs and Ham”. ", "label": 0}
{"text": "0.33 0.33 0.33 0.99", "label": 0}
{"text": "Nah man I’ve been playing for almost 30 years most of it was legit bullshitting in F2P and just making shit from scratch over and over again. Never had an account with over 60 in any skill just would restart and chop trees you feel. \n\nGot into OSRS with friends later in life one of whom had a ton of bossing kc and he pushed us to try small things.  Some of the most fun things I’ve done in the game are CG, TOA, and Calvarion. I haven’t touched most of the wildy bosses, and have done neither of the two raids. Scurrius is decent fun and doing woox walk at Vorkath makes it more enjoyable. I haven’t down GWD bosses outside of getting 1 kc each and some group runs at Garagedoor (not fun at all, dumbest shit I’ve done in the game imo) but if I ever get bowfa I’m going to try the 6:1 or whatever at Kril and I feel like that’ll be fun. Kalphite Queen will forever be ass and people recommending barrows are on drugs I think super lame. It’s not hard and you could probably make it fun and it might be fun for others but I can’t stand it haha.", "label": 0}
{"text": "with a 1/250 chance that it'll play for everyone in the same world instead.", "label": 0}
{"text": "I would not eat them in the wild. \nI would not eat them hot or mild. \n\nI would not eat them in varrock square. \nI would not eat them, not anywhere! ", "label": 0}
{"text": "Let me play a song for you on the worlds smallest violin", "label": 0}
{"text": "I am keen for this! I still have bulk points I haven’t cashed in yet", "label": 0}
{"text": "At rate for 2 synapses, has 6. Not even at any rate for imbued heart, has 3. What in the fuck lmao", "label": 0}
{"text": "Actively using or soon to be using outfits or things I don't normally have a bank spot for\n\nArmor\n\nWeapons\n\nRunes/runecrafting\n\nValuables/currencies\n\nTeleports\n\nFun/clue rewards\n\nSlayer resources\n\nSkilling resources \n\nLoot", "label": 0}
{"text": "Its called the Middle-eastern or Mexican mom special", "label": 0}
{"text": "Just had a whole ass conversation all by himself", "label": 0}
{"text": "u/JagexGoblin Graceful's 30% run regen passive is not working while running, only while standing still. \n\nI gain 30% increased run energy while while standing still/walking.. The time to 100 energy was reduced from 2:05 to 1:37\n\nI don't gain the 30% increased run energy regen while running. The time to 0 energy went from 2:05 at 0 weight 99 to 2:05 at 0 weight 99 with graceful\n\nIsince we gain regen while running now, shouldn't graceful's 30% run regen passive work while running?", "label": 0}
{"text": "Waste of time and fun aren't exclusive to each other.\n\nPlaying OSRS is fun. But it's waste of time.\n\nWe can choose to waste time doing fun stuff.", "label": 0}
{"text": "I wanna say it works like the waves where you have to be in motion the tick before, so you can't actually stop on the tile before the first trap (You can click it but the instant your character gets there you have to move again, if you stand still for even 1t you'll fail the skip)", "label": 0}
{"text": "I believe its one speed below the fastest", "label": 0}
{"text": "idk, could be juggling clues.\n\nalso if im doing harder content and have some down-time, i like keep my rythm by moving every tick in odd ways.\n\nyou could try asking?", "label": 0}
{"text": "Would you, could you, with rune arrows?\nWould you, could you, at the Barrows?", "label": 0}
{"text": "looks like eli porter", "label": 0}
{"text": "In normal enrage you get hit by a ball every two ticks. In awakened it’s every tick", "label": 0}
{"text": "Maybe he is dry on mithril axe, and can't complete the quest?", "label": 0}
{"text": "It's no surpri-", "label": 0}
{"text": "It’s pretty subjective. For me, the cost of items determines where I’m at. You’ve got early game gear that costs under 1mil a piece, mid game gear that costs maybe 1-30mil each, and end game gear that costs 100mil-billions.\n\nIt isn’t perfect, a better player with good levels but shit gear can probably still do endgame content, but this is what I find most helpful when trying to figure out what I can do", "label": 0}
{"text": "It was funny I am looking at the OP in this who is also wearing a max cape and I was like \"what he's just sitting there\"?", "label": 0}
{"text": "> Id highly suggest switching over to the ideal path. It’s a lot faster… To put it simply STR > ATK > D.\n\n> The reason you do this is because your XP gains is equal to the damage you hit for. You want to focus on strength to increase your max hit damage.\n\n.. But higher ATK lets you wield weapons that do more damage and are more accurate too. So is this really true?\n\n[Here is a DPS calc for attacking sand crabs. One loadout is a player with 60 attack and 70 strength, who is using a dragon scimmy. The other loadout is a player with 70 attack and 60 strength, who is using the whip](https://dps.osrs.wiki?id=ThreadNasturtiumsGlobetrotter).\n\nThe whip player is actually doing more DPS and getting more xp. The player who prioritized strength and is using the dragon scimitar is doing less damage and getting less xp.", "label": 0}
{"text": "Data Packs are scripting... They are just more external and not a default config like you are asking for. I agree that some form of scripting would be nice, but I doubt it will be baked into the server settings like you are asking for. There are just too many things with so many different attributes to modify to expect the website to properly cover. And if anything, having to go through clunky menus like that for each thing you want to change would be far slower than something like a data pack.", "label": 0}
{"text": "Yeah basically never do shared methods.... want my lvl gains quicker lol", "label": 0}
{"text": "Woahhhh this brings me back. Built in IRC Chat too and score lookup and clue help and price lookup because GE didn't exist.\n\nSorry. Didn't mean to need out lol. Been playing since rsc . Always like seeing old stuff like this", "label": 0}
{"text": "Yeah fair, I'm just being cautious about it for the time being lol. I need to actually play test it to see how I really feel. I think double regen might be slightly strong but I'll have to see.", "label": 0}
{"text": "That's the weakest potions tab I've ever seen", "label": 0}
{"text": "So when he revs up to the fastest, awakened enrage is one below that?", "label": 0}
{"text": "Barrows melee, Verac helmet, torag plate, Verac skirt if you want a tiny bit of prayer minmax.", "label": 0}
{"text": "Literally just whatever I feel like leveling at the time. Got 99 WC while in the 40s combat level / less than 750 total level. Next closest was fletching in the 80s and Magic in the 70s, everything else in the 40s or well below. I’ve now evened out a bit more at 1200 total level but still have some things I only have experience on from quests and haven’t put any actual time into (Hunter, construction, runecrafting, farming). \n\nBasically I just do whatever I feel like doing at any given time. :)", "label": 0}
{"text": "I don’t have the self control for that, but it sounds incredibly satisfying", "label": 0}
{"text": "Vids like this make me reminisce about my stracraft 2 days. Locked in, fast, precise clicks, and then the adrenaline release at the end of the match. If it weren't for the rng, I'd probably enjoy rs pvp.", "label": 0}
{"text": "Zilyana in the God Wars Dungeon was where I really got into bossing. The whole fight is just running and shooting so it's a good place to start learning those kinds of mechanics. She doesn't throw any surprises at you requiring gear or prayer switches, you just take consistent damage from her minions so your defense and supplies will be your limiting factor.", "label": 0}
{"text": "Cool plugin, can you drop the github? I'm interested in how these are made", "label": 0}
{"text": "Being organized has zero negative consequences. Especially in a game designed to be a time sink, there are only positive outcomes from an organized bank.", "label": 0}
{"text": "Luckiest player alive complaining lol", "label": 0}
{"text": "Where does one start? I'd like to look into it and maybe come up with my own first plug in! 😊", "label": 0}
{"text": "I met long term friends in SwiftKit's mIRC, still talk to a few of them. Wild to see this, thanks man.", "label": 0}
{"text": "I promise you you can’t go that dry on mithril axe…", "label": 0}
{"text": "Do you not have an Ava’s?", "label": 0}
{"text": "I never bossed for a few years, recently started with barrows after that scurius the rat boss, after that moons of peril/cal’verion.\nRealy recommend those.\n\nWhen you understand the mechanics its so satisfying. Especially when you feel the progress true the combat gear when you have the gp.", "label": 0}
{"text": "yes.\n\nif you wanna practice i'd go and let it ramp up all the way, do both of the sets at that speed (the one with melee orbs too) and practice going around corners + staying on the edge of the walls you built (assuming following redeyes guide)\n\ntry to stun it after so you can continually practice this instead of dying xD", "label": 0}
{"text": "Lmao I would have forgotten to screenshot with my first KC excitement", "label": 0}
{"text": "I was practicing flicking triples to a video while at shilo and got called a bot immediately lol.", "label": 0}
{"text": "Do people think DHL > DHCB when going for this CA?", "label": 0}
{"text": "I agree, but seeing how chompy bird hunting still does not give hunter xp, i am not optimistic.", "label": 0}
{"text": "Clean as fuck damn", "label": 0}
{"text": "Wooosh you aren’t very bright huh lol", "label": 0}
{"text": "oh my god what did you do to him", "label": 0}
{"text": "why? you don't have one?", "label": 0}
{"text": "I was in a High Risk World doing TOB, the usual warning for hopping to High Risk World pops up.\n\nThere is an additional Wilderness warning specifically for High Risk Worlds which prompts when entering the Wilderness via the Wildy Ditch or Teleport Levers but **not** from Player Owned House interactions (portal nexus/obelisk)", "label": 0}
{"text": "If you read any of it, you would understand the comments here are comparing experience. You keep shoehorning in a bunch of other stuff that doesn't matter with each reply anyways.\n\nObviously HS is better and the faster route. All of what you say in your comments can be found on the wiki.\n\nThey're 2 different activities targeted at different play styles. Calling HS \"high exp\" is laughable at best.", "label": 0}
{"text": "Well it has bad drops, stuns you a bunch, hits really hard for no reason, fight is riddled with chip damage\n\nBy all conventional standards it's annoying as hell. It's like on par with kalphite queen and chaos ele except there's a lot more to try and master", "label": 0}
{"text": "Would you, could you, in Falador? Would you, could you, with General Graardor?", "label": 0}
{"text": "Pb 1:11. Took me a little bit to get the strat down.\n\n1x vw at the start into 3 emberlight, 3 hally then vw as it casts eye attack so you don't miss ticks on your next hally. Then hally until sub 25 (should be 0-1 hits if you are on pace) then ember to finish. 42 mushrooms and thrall as you use your first mush.\n\nDon't need to but you could even add sbs veng in there as well to increase your chances.", "label": 0}
{"text": "No wonder why they are so cheap", "label": 0}
{"text": "You’re playing “Old School RuneScape” my man.\n\nRuneScape 3, the version of this game that would make changes like this, already did in 2019.", "label": 0}
{"text": "i think once levi does specials it doesnt reset all the way back to its very starting speed so you would want to stun and let it do one special and just play around with it from there.", "label": 0}
{"text": "So is sailing just dead and forgotten ?", "label": 0}
{"text": "You know bolts sometimes drop to the floor with accumulator on", "label": 0}
{"text": "In case you weren’t joking I meant trillion! But yea can also measure in tons with a very large scale", "label": 0}
{"text": "The amount of times someone, or myself said 'Freinds' after a 2 word exchange remains funny to me to this day.", "label": 0}
{"text": "We pay we gay", "label": 0}
{"text": "Love friendship and a willingness to help others in my opinion.", "label": 0}
{"text": "\"you think this is shitty look at the shittiest company\" yes let's just let all companies be shitty as long as they aren't the shittiest", "label": 0}
{"text": "It also says in the blog post that the Regen rate is buffed at all cases so, even though at low levels and high weight means less time spent running, it is also coupled with less time spent walking. \n\nOverall even at 1 agility and max weight, it's more running per hour even though you'd run out more often.", "label": 0}
{"text": "Was a joke. Too bad my joke are usually unfunny.", "label": 0}
{"text": "GE tax/buy sell gap. The idea is you're not to broke to not be able to have the item, you just don't have the GP available to purchase it yourself.", "label": 0}
{"text": "Will do ty", "label": 0}
{"text": "i only tried lms because of those bots lmao, but after a while i got good enough to kill 3 or 4 real people and it felt pretty good", "label": 0}
{"text": "This is gold. Thank you for posting. I’m swimming in nostalgia now", "label": 0}
{"text": "Oh I see. I skipped it I guess. \n\nThanks for not saying reading comprehension", "label": 0}
{"text": "Give 50k or hacked", "label": 0}
{"text": "what i want is a total war:warhammer esque runescape game. we have the races we have the regions and region specific outfits and such. there is even seige equipment in game in the form of trebuchet/cannons. the potential is there for a runescape rts.", "label": 0}
{"text": "Idk about “a lot” \n\nPretty sure that would’ve cost around $1000", "label": 0}
{"text": "Not been north of Varrock often?", "label": 0}
{"text": "I followed the guide on [here](https://github.com/runelite/plugin-hub)", "label": 0}
{"text": "92 is only half of 99!!", "label": 0}
{"text": "Isn't 65 att/65 str way faster to get than 50/80?\n\nAnd having a dragon defender is gonna be one of your biggest DPS upgrades.", "label": 0}
{"text": "Will probably get downvoted for this but I don’t think you’re really playing the game if you don’t do any pvm whatsoever", "label": 0}
{"text": "Awwh. I love that take. Keep on being you.\n\nI'll do what I can to make your dream a reality.\n\nIn the past 2 weeks I've done 4 or 5 COX diary carries for Redditors who have messaged me in game, so I guess I'm getting there.", "label": 0}
{"text": "Definitely start slayer and agility when you get membership, agility sucks to train but its so worth it shortcuts across the map and overall better run energy is so worth it when doing other quests, and slayer is super slow to train so its worth training most of your combat stats through slayer shoot for 60 atk and def and around 70ish strength so that way you can wear the coveted dragon gear!", "label": 0}
{"text": "You can actually train str with a very high eff weapon now.\n\nDual macuhatls.\n\nJust dual macus at sulphur naguas can give 100k+ XP/h if you got like 60 herblore to get the super combat potion effect (might be able to get away with lower herblore).\n\nIf you have dual macus and full bloodmoon at sulphur naguas, you'll be getting some pretty insane str xp gain for relatively cheap /farmable gear.", "label": 0}
{"text": "I mean, there's absolutely no implication like that in the Gazette, we just get that info through the responses in the thread.\n\nWhich also suggests they actually currently have no plans in regards to giving them a future use, just a vague idea of \"future crafting ingredient\".", "label": 0}
{"text": "Honestly I’d say don’t, I’ve always wanted a build like yours", "label": 0}
{"text": "65 atk and 65 str or 60 atk and 70 str is for the dragon defender by the way, incredibly good off hand item with great offensive stats", "label": 0}
{"text": "> Generally speaking, we see just about everything that makes it onto here or gains traction on other platforms\n\nsorry", "label": 0}
{"text": "This might be the most insane loot tracker I've ever seen for a GWD boss. That's crazy", "label": 0}
{"text": "Adding on to what others are saying but 1600 total is still very pretty early into the account. You have tons of time to learn and get into bosses if you so want and if not…you still have plenty of time not to", "label": 0}
{"text": "Yeah it’s cool for sure but I plan on making a similar one in the future but with lower defence and use Statius armor set and SWH. \n\nYou have a 60 att 45 def zerk?", "label": 0}
{"text": "Persecution complex", "label": 0}
{"text": "No that doesn't really make any sense codewise. It's not as though 'made by ancient shards' would be a weapon property.\n\n\nWhereas demonbane might actually be.", "label": 0}
{"text": "Gnome Child got caught in Vorkaths acid phase.", "label": 0}
{"text": "I was on a government funded vacation for 6 months with no phone or computer, I thought about RuneScape every night to go to sleep. Thought of a few good ideas for new quests. I thought to myself “man I’d even enjoy doing mindless things like firemaking at the GE or agility laps for 14 hours a day”", "label": 0}
{"text": "Yes I’ve got exactly that", "label": 0}
{"text": "![gif](giphy|d9gJJEQiAXiZXarzKZ)", "label": 0}
{"text": "\"Time you enjoy wasting is not wasted time.\"", "label": 0}
{"text": "I was mainly just afker until I did SOTR bosses and after getting clapped over 50 times the process of learning the mechanics and the reward of finally getting the kill made me an addict. I can’t wait to learn other bosses. I do hate dying and losing money so I think I will much prefer the CG and moons so I don’t have to waste supplies", "label": 0}
{"text": "Oda ain't got shit on my man", "label": 0}
{"text": "Pretty solid returns for an hour of free vidya", "label": 0}
{"text": "I asked him if he's bot broke but he didnt answer", "label": 0}
{"text": "I only play RS3, but does anyone on OSRS get this at random sometimes like 15 minutes (or less) right after you've opened the game? It seems to happen to me at least once or twice a month.", "label": 0}
{"text": "Swiftkit chat was so goated I remember doing .DMs all day in it haha", "label": 0}
{"text": "Ayy very nice man, that’s sick. You mind helping me out with the quests to make that 3 def jump? Also is there any attack xp quests I should check out?", "label": 0}
{"text": "I’ve done this before at Crafting Guild but… That far away from the bank? Bit odd", "label": 0}
{"text": "Ok, so in runelite there is a plug in setting within maybe one of the menu entry swapper plugins whereby you can prioritise different things to be the top of a stack, eg if you prioritised wyrm bones here, they'd appear on top", "label": 0}
{"text": "Let me trim your Bando right quick", "label": 0}
{"text": "it's the fap often and teleport small or fat rarely and teleport big philosophy, there is no wrong answer only a wrong man for the answer.", "label": 0}
{"text": "Uuuhhhh....", "label": 0}
{"text": "No I don’t think it will fracture the osrs playerbase at all and think the people that suggest it will are being overdramatic about nothing", "label": 0}
{"text": "skill required for most CMs: open boosting discord, pay someone to do it for you", "label": 0}
{"text": "This reminds me of “Swift Kit” from back in the old old RuneScape days", "label": 0}
{"text": "I made this plugin. I can add the obelisk, just something I overlooked as I don't have one in my house. I believe I can also remove the manual casted wilderness teleports from the ancients spellbook now too as the plugin guidelines have changed since I made this plugin. \n\nSide note, the portal nexus teleports and the black chins teleport have always been legal to modify under the guidelines, I just don't know how. They both are Widgets instead of regular menu entries so if anyone wants to, feel free to make a pull request if you're able to do that.", "label": 0}
{"text": "love this movie / series, good costume", "label": 0}
{"text": "Yeah he might be juggling, but his pattern was always the same movement you see in the video, but it always went one tile further, possibly because he was botting something but it got broken. \n\nGuess we will never know", "label": 0}
{"text": "During the week I don't play much because of work so I just purchase the 1 or 3 day membership options for .99c/1.99. They also have 1 week for 3.99. I think it's only available on the rs3 mobile app but the membership carries over to your osrs account. Same login info", "label": 0}
{"text": "That's a bad example because the efficiency people would argue that you don't need anything to do while cooking karambwans. \"You should be 1 ticking them\"", "label": 0}
{"text": "And that already made me feel like cheating..", "label": 0}
{"text": "That's true but I also got very lucky did 20+ almost every hit ", "label": 0}
{"text": "F", "label": 0}
{"text": "That's amazing, will definitely be playing with that when I get home", "label": 0}
{"text": "It works like: You lend someone some expensive items.  Then you never get them back.", "label": 0}
{"text": "I'm pretty sure they were the same program.", "label": 0}
{"text": "If all you want to do is afk skilling fine. But that is not what the game is about. Not anymore.", "label": 0}
{"text": "I'll honestly never touch those servers except to practice harder content and not drain my bank account. My friends are in the same boat so I don't think it will affect player count too badly", "label": 0}
{"text": "Curious what he’d even be botting, as his hiscores are mostly just tons and tons of low level PvM.\n\nAnd of course the very legit 1 and done infernal cape.", "label": 0}
{"text": "Smol at 5kc o: was that a gamble?", "label": 0}
{"text": "You know a lot of whales then. The WoW players I know can’t afford to drop $1k on a mount. But they do have a lot of GP from boosting/etc", "label": 0}
{"text": "100% 1st tab is quest items and junk that is on the dropping block", "label": 0}
{"text": "The spawning behaviour is definitely my biggest turn off.\n\nEspecially the \"Egligiblity\" part.\n\nI go dry for way too long, rotating between 4 willows/maples, always cutting except for banking or dropping.  Despite my efforts, the moment an event shows up right next to the tree I was cutting: You're not eligible. I've no idea why this happens but it's very, very frustrating.\n\nThis seems very common at seers.\n\nAt draynor willows, some players also seem to try and sabotage spawning with cannons. I don't know if it works, but events seem very rare when it happens.", "label": 0}
{"text": "Yeah its pretty funny how some of these guys really dont give a shit and go as far as changing their name to make fun of it... Not everyone using RuneWatch. It needs a feature that auto adds those players to mute list.", "label": 0}
{"text": "The radio system was the best and dragon scim icon..remember the good pk days with a clan, IRC chat and teamspeak was the old school discord", "label": 0}
{"text": "well, the closest thing we have to that is the wiki telling you starts for how to get a CA. e.g. the page for the arma salamander one.", "label": 0}
{"text": "Swift kit was goated til it got hacked", "label": 0}
{"text": "Only server I might use is one that lets me set stats and items so I can try bossing without wasting supplies", "label": 0}
{"text": "No clue i dont play RS3", "label": 0}
{"text": "People are doomsaying this shit like any other update. I think it opens alot of opportunity for the longevity of the game.", "label": 0}
{"text": "You cant do a 1 item switch and change your prayers, but can do hard mode tob. Yeah i dont believe you.", "label": 0}
{"text": "I do see what you mean, but also 1 tile further could also be consistent with clue juggling. Yeah idk really could go either way", "label": 0}
{"text": "Does he have lots of clues done? Many people said that he might be juggling clues, but for how long he was doing it he would have like 50 clues on the ground.", "label": 0}
{"text": "Eh, it will be even more sweaty. Pkers will switch to 1 ticking soul split while attacking, making it even worse", "label": 0}
{"text": "I'm asking if it happens on OSRS.", "label": 0}
{"text": "Tbh idk anything about code so you’re probably right, but I think it could make sense that the dark blade was demon blade and then they just add ancient shards as another property. But 🤷🏼‍♀️", "label": 0}
{"text": "Zam i am", "label": 0}
{"text": "For def it’s just fremmy trials, assuming you already have b gloves.\n\nFor att I think (correct me if I’m wrong) you just train it. Have a look at def and att giving quests to be sure", "label": 0}
{"text": "The IRC chat attachment? Literally everything.", "label": 0}
{"text": "I want to say the Wintumber tree does the same thing", "label": 0}
{"text": "Right back to using sals realm, zybez, and rune hq to figure out the game", "label": 0}
{"text": "I think there will be some servers that get fairly big and might pull some people away, like if there was a server with everything the same but 2x xp i think alot of people would play it", "label": 0}
{"text": "The radio and that icon were perfect. Proper gaming.", "label": 0}
{"text": "Nice!", "label": 0}
{"text": "Different versions by Strider", "label": 0}
{"text": "Didn’t know the gnome child starred in as Boog in The Nightmare Before Christmas", "label": 0}
{"text": "Realistically, these servers are going to be used either like Private Servers or to create weird game modes. That's not going to split the community because private servers already exist and people who play weird game mode servers are either gonna behave like people do during Leagues and eventually burn out and return to the main game, or are doing something so odd they'd probably not be interested in the main servers.\n\nThe only *big* enduring splits I could see are stuff like servers with no Grand Exchange or trading, but no banks, and those wouldn't be any more significant than Permanent Deadman worlds.", "label": 0}
{"text": "No you get notifications at 4 hours, 5, 5.5, and 5 hours and 50 minutes", "label": 0}
{"text": "There’s an easier way to get it but I understand Redditscappers are adverse to it due to its location.", "label": 0}
{"text": "Only if General GarageDoor’s pet animation has louder footstep audio", "label": 0}
{"text": "I used to play during 2007. Stopped playing after RS3/EOC was introduced and only returned 1 year ago after discovering osrs was on mobile. On one hand, I want to keep the game I loved so much as a kid as close to what I remember, but I realize so many other players have continued playing or have played for many years since then and I can see those players wanting something brand new like this. I just feel like it could negative effects overall, but I could be wrong.", "label": 0}
{"text": "The joke is on Blizzard, I would have paid $100!", "label": 0}
{"text": "The radio! Omg. Memory unlocked.", "label": 0}
{"text": "Its a new acc\n\nI dont got 750 total", "label": 0}
{"text": "The little things", "label": 0}
{"text": "Seeing all that food in your inv makes me think that's deserved tbh", "label": 0}
{"text": "I think, if anything, it will grow the game. People that already play are not gonna abandon their accounts with hundreds and thousands of hours, but a private server with a fun gimmick may convince someone to give the main game a try that normally wouldn't (like Leagues already does)", "label": 0}
{"text": "I still miss the built in Mirc sometimes", "label": 0}
{"text": "Make a new f2p account and try to get like 10 qp, then test out the run beta. One of them is gonna be awful and it isn't the one where you get to run more", "label": 0}
{"text": "A similar mount like this cost 550 bucks a few years ago. Based on gold/value, it's niet 90 bucks it's actually cheaper.", "label": 0}
{"text": "Alienating your target market, marketing 101.", "label": 0}
{"text": "Im the grim reeper give me money or i will kill you", "label": 0}
{"text": "Lolol I love that, Reddit man mode", "label": 0}
{"text": "Right wtf is going on here. Did they forget to swap accounts?", "label": 0}
{"text": "then train some stats passively. look up some PvP account build guides and train your melee stats to those levels and get some quests under your belt. 750 total level you could obtain in a day or two of serious playing.", "label": 0}
{"text": "I mean you could just look me up on highscores if you don't believe me lmao\n\nAlso switching isn't the problem it's trying to keep count of my attacks and it's attacks while also moving to avoid the floor and tornados. I tend to loose count of attacks in the later parts on the fight where there are multiple tornados and alot of floor to avoid and then end up eating too many off prayer attacks or eating floor or tornado damage. \n\nI also don't have a lot of attempts or regular gauntlet kc so I simply don't have alot of experience with gauntlet cause it's very punishing and not enjoyable to me so I stopped trying. If I go for gm I'll have to go back. \n\nAs I said in my comment I'm 100% sure I can do it if really try and want to but I've never tried more then 3 attempts in a row. Then I don't touch the content for months.", "label": 0}
{"text": "back when ppl and their characters actually had personality", "label": 0}
{"text": "I got it today playing guardians of the rift never thought that would happen lol", "label": 0}
{"text": "I was fine with Jags, it was the defense and being hit a lot that was causing issues. Made a new post with my gear setup", "label": 0}
{"text": "Swiftkit was the newer version", "label": 0}
{"text": "I would rather die than 1tick", "label": 0}
{"text": "Looks like the church in shayzien.", "label": 0}
{"text": "Pay a lawyer a few mil to write up a contract", "label": 0}
{"text": "I miss when 450k was a good amount of money. 🥹", "label": 0}
{"text": "Those bunny ears were rare as fuck. I was unlucky and misses out on those along with the scythe", "label": 0}
{"text": "Oh okay, I never knew the older name, this is an absolute throwback", "label": 0}
{"text": "I want Jimmy to have a costume competition video, but if anyone uses your costume ideas, I think everyone should shame them and deem them Skywalker Andys", "label": 0}
{"text": "nah when i got the kill, i just wanted to get 5kc to be on the leaderboard lol", "label": 0}
{"text": "If it was purely cosmetic I don’t see any harm whatsoever, but its P2W", "label": 0}
{"text": "I lived in the IRC chat for years. There was such a good rs trivia channel that I dominated", "label": 0}
{"text": "With shit like this you know I'm a guthix follower.", "label": 0}
{"text": "Everything reminds me of her", "label": 0}
{"text": "DT2 boss drop mechanics are shit (fact)", "label": 0}
{"text": "Ok thx", "label": 0}
{"text": "I miss the old community lmao", "label": 0}
{"text": "Haha, will rune bolts work? XD ive got like 1.5k of them from doing slayer", "label": 0}
{"text": "We gonna ignore the account for sale tab open lmao", "label": 0}
{"text": "Oh it’s forced?", "label": 0}
{"text": "If you had enough collateral to balance out a tbow you wouldn't be loaning one in the first place.", "label": 0}
{"text": "It did not.", "label": 0}
{"text": "Full torags, obsidian shield should get the job done in a budget setup. If you can afford a dragonfire shield, add that to the mix. \n\nBut if you’re 70 attack, definitely prioritize an abyssal whip over stronger armor if you haven’t.", "label": 0}
{"text": "I can swap axe for whip, whip is cheaper anyway", "label": 0}
{"text": "I just want the potion storage to work with bank tags :(", "label": 0}
{"text": "Sounds like you’re just not doing enough DPS, and he’s despawning. You may need to come back after a couple upgrades.\n\nObviously I could very well be wrong, this is just my best guess.", "label": 0}
{"text": "Still too complicated to redditors.", "label": 0}
{"text": "it won't be impossible to catch up", "label": 0}
{"text": "I get why to use obsidian in some cases… but let’s be honest. Strength bonus only matters if you survive and are hitting. Generally speaking, within a “tier” (used loosely) of armor, there will be defensive armor without any strength bonus and possibly without much accuracy bonus… and there may be offensive armor with lower defensive bonuses but better accuracy bonus/strength bonus.\n\nIf you’re dying/struggling at content, take defensive armor to it. Get comfortable with the content with defensive armor - sure it’ll take you longer to kill and the biggest number you can hit may be lower… but that doesn’t mean crap if you actually survive for once with defensive armor.", "label": 0}
{"text": "Does default potion storage work with bank tag layouts yet? Will never buy it without that.", "label": 0}
{"text": "I don't think I understand how? Not only is WoW far more expensive (buy 2 play, sub cost, and heavy MTX), but it also yields far less content than OSRS does? And I'm coming at this from someone who has played more wow than osrs.", "label": 0}
{"text": "Wait a few weeks for Leagues to release and try that out on OSRS. It’s so much fun bro", "label": 0}
{"text": "Yeah I was 15 and trying to make some money lol", "label": 0}
{"text": "I don't think it's fair to just look at something in a vacuum like this -- if you're comparing monetization models, then you should contextualize the entire model. For example, would you still say WoW is a better deal than OSRS if it had an equally priced sub but the box price for the game was 1000$? Probably not. \n\nWoW is buy to play, subscription based, and has a lot of microtransactions. Two of these things do not exist in OSRS, thank God, and I would rather have a more expensive membership in OSRS than those things, too. Can you imagine paying money to access Varlamore? Can you imagine if OSRS released 35$ cosmetic outfits? That would be antithetical to the entire ethos of OSRS.", "label": 0}
{"text": "Did you take the loan", "label": 0}
{"text": "I don’t get it, why is better?", "label": 0}
{"text": "Every day I am happier and happier that I quit World of Warcraft. This is obscene for a game that charges 50$ to play an expansion, 15$ a month for the subscription, AND has an enormous cash shop on top of all that (including paid convenience like leveling, server transfers, etc.).\n\nJust absurd. The fact that OSRS has none of this as well as more content is truly one of the best parts of this game.", "label": 0}
{"text": "Wowwww thanks for clearing this up. I always wondered about it", "label": 0}
{"text": "Valid, ty for the advice", "label": 0}
{"text": "No mention of GOTR updates? Can you share a release date for that?", "label": 0}
{"text": "It was 100% fashionscape for me all the time", "label": 0}
{"text": "horrible", "label": 0}
{"text": "My main concern for Project Zanaris is how having ready access to every single element of the game at any point would potentially, conceptually devalue certain grinds in the main game. I think part of the excitement of earning a Tbow or a Scythe is the surrounding content you need to do to eventually obtain these items (whether it be doing the raids or just earning the gp for them).\n\nAll of that allure, mystique, excitement, kind of disappears if you can just log in to a private server and fuck around with a scythe whenever you want. I think that's one of the good points about Leagues, it's so limited time and SO different from the main game, that it still retains the value of the elements of the main game that should have a value as aspirational content.", "label": 0}
{"text": "hopefully you simply get the pet soon and don't have to think about the math of it anymore!", "label": 0}
{"text": "If your deliberately going for Stars your point is moot your gonna be world hopping at least once an hour. Which means your timer will keep being reset.", "label": 0}
{"text": "No gloves?", "label": 0}
{"text": "Yes, but technically if you have a big enough monitor you can split the wiki window with the game, it's not like OSRS needs a full 4k resolution lmao, I do that when skilling and I'll watch something, when I quest or don't understand something I just alt tab out. I'm sure two monitors help but aren't entirely necessary.", "label": 0}
{"text": "Dont have stats yet for finishing recipe for disaster, got combat bracelet now", "label": 0}
{"text": "I don't think it would be catastrophically gamebreaking, especially if there were a few blacklisted places (raids, inferno), but how would you feel if portable GE was a $90 limited time MTX?", "label": 0}
{"text": "I still have an account from 05 after I sold this one that transferred to RS3, it's a blast seeing my temp bans and mutings from the mid 00s on there.", "label": 0}
{"text": "Lol it was definitely deserved, Bofa was smacking so I was trying to go for a PB (didn’t get that as you can see)", "label": 0}
{"text": "Eat the fish", "label": 0}
{"text": "Get sulphur blades for blood moon. And the glacial tamales for blue. Zombie axe for eclipse. \n\nLearn the step under method to avoid the 3rd hit. This is especially important for blood moon. Watch gnomonkeys recent vid for this tech.", "label": 0}
{"text": "Servers are capped at 2000 players max, I don't think thats enough to have something big or something going for a long time.\n\nI'm mostly expecting smaller servers hosting a couple of homies playing for a month or two on a 15x rate server, similar to the GIM release content creator only server with boosted rates.", "label": 0}
{"text": "They haven't released pricing. They already said it's going to cost more the more people you have so let's be very generous and say it's 50$ a month for 1k players. The owner now gets to spend 700$ a year for basically nothing as no one is going to care you got x on a private server", "label": 0}
{"text": "Spinach lady turning on the person taking a piss was amazing. Dude with a blue h'ween mask is getting boxed to death with a baguette \"DON'T IGNORE ME ZEZIMA554!\" whilst everyone gathers round like a bunch of salivating wolves like >:)", "label": 0}
{"text": "I can appreciate the honesty, sometimes you just gotta send it.", "label": 0}
{"text": "You gotta be really addict and sweaty to have multiple accounts period", "label": 0}
{"text": "I uploaded a bunch of my old hard drives to my new NAS and the meta data sorted it by date to 2007. Was a blast seeing it crop up.", "label": 0}
{"text": "Vanilla game with PVP off in wilderness gonna do damage🤣", "label": 0}
{"text": "I would not in fact, get caught in the act, at the grand spirit tree", "label": 0}
{"text": "The majority of people in this thread have very obviously not actually watched the video", "label": 0}
{"text": "Unplayable", "label": 0}
{"text": "How do I get support for legacy accounts", "label": 0}
{"text": "hmm, you sure i half remember their forums had a plaintext password database that one of the admins periodically tried to login into with high level accs", "label": 0}
{"text": "Making screenshots on moparscape just to show your school friends on msn that you had BANK back in the day.", "label": 0}
{"text": "Really wish the fight started a bit later. Just enough time to make it to one side before the fight starts. Now you have to do an annoying setup kill.", "label": 0}
{"text": "This belongs in a museum.", "label": 0}
{"text": "Leagues is temporary, just jump into the main game and see how you go! ", "label": 0}
{"text": "Rune gloves would be okay", "label": 0}
{"text": "?", "label": 0}
{"text": "Are you an iron?", "label": 0}
{"text": "this has to be satire", "label": 0}
{"text": "Its not cosmetic though. You cant really get the equivalent mount in game and this one grants auction house(grand exchange) use anytime anywhere.", "label": 0}
{"text": "nah :(", "label": 0}
{"text": "Gas lighting noobs into buying addy 2h to prove they're not noobs!", "label": 0}
{"text": "Took me just over 5,000 wyrms to get a dragon harpoon\n\nhttps://preview.redd.it/yxl7usff2zwd1.jpeg?width=1120&format=pjpg&auto=webp&s=2008415414ebd5b0e5a6f34d29e976bd98b9486d\n\nI was one of those people in near max killing those fucks", "label": 0}
{"text": "I've kept my 99 attack cape untrimmed... Have 5 or 6 other 99s now, but will forever keep attack untrimmed.  It's my favorite and you are right - it looks pretty fricken sweet. \n\nDrop them all in the ground right before you 99, then telegrab them back.  It's somewhat of a pain, but walking around in the untrimmed attack while your fashion scaping with a litany of other 99s is peak", "label": 0}
{"text": "Hate to say this, but I think you have it right already. Flesh crawlers are probably your best but until you can handle Giant spiders also in the stronghold. \n\nMore fun IMO is moss giants. They will be aggressive for a while, drops are better and you get the occasion hit of dopamine with the moss keys, but xp/hr might be worse. Bring runes for high alch and big bones are better for prayer.", "label": 0}
{"text": "Cool..Thank you. What is the baseline loss/tick?", "label": 0}
{"text": "You could say the same for OSbuddy and later Runelite in the 2010's.", "label": 0}
{"text": "It simply looked cooler, same with the legends cape, cooking gloves and desert boots. Fashionscape has always been prio #1", "label": 0}
{"text": "I'm more worried about the legal reprecussions of making fan content. It's been vague so far in the newsposts on what that would even entail and until something is clear, I will no be looking forward to this.", "label": 0}
{"text": "It's never too late to catch up. Start small with Varlamore stuff to dip your toes in and everything will come back to you. You got this!", "label": 0}
{"text": "I stand there at the bank for 2 hours and think of what to do. Then log off because my plans were too ambitious.", "label": 0}
{"text": "Not sure when stuff was released prior from when I started playing, but only 3 updates in my 4 years of playing has brought end game content; TOA, DT2 bosses and Colosseum, the rest are easy mid game bosses. If was was able to start as a fresh level 3 and learn most of the game then I'm sure you'll have no problem catching up", "label": 0}
{"text": "Swiftswitch was banned because of the world hopper and then swiftkit was born, which is hilarious considering we have hotkeys to hop to new worlds now.", "label": 0}
{"text": "At a slower rate than getting str up faster then att", "label": 0}
{"text": "Wait wut?!?!??  I knew of RuneHQ but wtf is this!?", "label": 0}
{"text": "10/10 would cheese cape again.", "label": 0}
{"text": "Enjoy the McDonald's Cape ", "label": 0}
{"text": "Yeah but I'm a gigachad so mine is all special and yellow", "label": 0}
{"text": "Honestly, yeah. Demonbane arrows would be fine in general. One shard -> 100 tips wouldn't really be a balance issue and it'd be nice for all account types as an alternative way to use shards. \n\nThey'd \"need\" to be only about as strong as dragon arrows even when fired from Scorching, but that's not inherently an issue.", "label": 0}
{"text": "Tl;dr drain rate is slower (slower is better for every single account with higher than ~55 agility under all circumstances\n\nDrain rate is faster for people with 1 agility and high weight", "label": 0}
{"text": "No. You want 300+ in defense stats. If you’re a main, buy an obby shield of a DFS. \n\nAlso zerker ring (I) and d boots.", "label": 0}
{"text": "Tomb Raider was my favorite, but god damn. This one is a banger", "label": 0}
{"text": "Bruh two factor authentication will save your account from hackers way more than any “permanent iron mode” that really protects nothing except your subjectively important status", "label": 0}
{"text": "It’s also in like 4 weeks. More than enough time to loae that itch", "label": 0}
{"text": "Nope, I just suck and am very inexperienced haha. My apologies.", "label": 0}
{"text": "Would you, could you at the Varrock fountain? Would you, could you on White Wolf Mountain?", "label": 0}
{"text": "There’s way to much in this game that I can barely commit to doing once", "label": 0}
{"text": "why would you take a loan if you have enough collatoral to do the loan? then you could just buy it lmao", "label": 0}
{"text": "This guy gets it", "label": 0}
{"text": "They waited for asmon to get banned before releasing it lol", "label": 0}
{"text": "Seems kind of a weird reason considering the BP can envenom/poison even if the darts aren't poisoned\n\nI'm guessing it has to do with the fact that the darts are inside the BP and not in the ammo slot", "label": 0}
{"text": "If a player has sufficient collateral to compensate a loan then they don’t need a loan in the first place.", "label": 0}
{"text": "This is what gets people out with pitchforks and torches? Him wanting more robust changes to run energy?\n\n\nHe rated Kalphite Queen S-tier in his boss tier list and y'all complain about this take? S-tier! Kalphite Queen!", "label": 0}
{"text": "I actually didn’t know he did them (I just got the whole idea and the “Andy” joke from Asmongold…lol)", "label": 0}
{"text": "yeah i think the replacement characters suck! especially ladee", "label": 0}
{"text": "It was all about ad revenue for Jagex back then. Each time you wanted to switch worlds you had to navigate through 2-3 pages on the website, each with multiple ad loads. SwiftSwitch bypassed all the ads and denied Jagex money, hence the anger/banning.", "label": 0}
{"text": "Gnome conehead", "label": 0}
{"text": "Like, at least give a unique design to the new one.  Why cookie cutter copies of dead characters?  So dumb", "label": 0}
{"text": "The mode is the last line of defence, like a bank PIN is.\n\nIt allows a hacked iron to rebuild and keep their status for players who really care about the game mode. If they were de-iron, they would abandon the account entirely.", "label": 0}
{"text": "Just play the game. Or don’t.", "label": 0}
{"text": "This is the way 😂", "label": 0}
{"text": "If you’re max there’s not much worry about catching up. You can do all the content in the entire game with a relatively small bank value. So really it’s just a matter of going about it. The way I see it you have two distinct options that aren’t necessarily mutually exclusive:\n\n1. The classic RuneScape experience: Explore and discover all the new stuff yourself! As is most of the game, there is very little truly “dead content”. Some stuff is meta, but virtually everything that has been released is good to try!\n\n2. Watch some content creators or streamers for inspiration: You’re max. Go see what some other people have done, see what looks fun, and go for it! Max gear is expensive, but you can do everything in the game for substantially less. Given your skills you can jump into anything with a basic setup. \n\nGood luck!", "label": 0}
{"text": "No you need to pet the varrock strat dog each run ", "label": 0}
{"text": "Say her name! (Uma Thurman)", "label": 0}
{"text": "The real blorva", "label": 0}
{"text": "So it’s only worse for f2p players running in full rune?", "label": 0}
{"text": "Hmmmmm😅", "label": 0}
{"text": "https://i.redd.it/0rioatff5zwd1.gif", "label": 0}
{"text": "I was using \"you\" as a general term for whoever is applicable to the situation, not you specifically /u/bknight2", "label": 0}
{"text": "It's still worth it since it's a quick decanter you can use from any bank. You can store potions you want in tag tabs outside of it and use the potion storage for stuff you use less / as a dump. I keep a handful outside for tags but when I bank to resupply, I dump any remaining into storage so I can quickly grab what I need without depositing dosages less than 4 into my main bank. I just pull more from potion storage if my in bank supply gets low. \n\nUnderstandable if its still just not for you, but it has sped up my resupply time and removed less used potions and dosages under 4 from my bank.", "label": 0}
{"text": "Bro I used to pick flax for days", "label": 0}
{"text": "It works with the newer vanilla Runelite bank tag tabs, but not the Runelite plugin hub version.\n\nIf you actually mean inventory setups with bank tags, people are working on that too.", "label": 0}
{"text": "selling law runes 1k ea and Lobs 250ea.", "label": 0}
{"text": "# r/deadheadcirclejerk \n\n#                   \n\n#", "label": 0}
{"text": "I hit gm a couple days ago and i thought the worst ca BY FAR was toa 8 man. I have a hard time getting 4 other friends to hmt 5 man sometimes. And i need to get 7 with expensive gear to do a raid hardly anyone at that skill level likes? It seems like a ca really benefits servicers. Thank god for kirby man", "label": 0}
{"text": "I don't recall the one you're thinking of, but I played one called Ballerscape around the time it just before gwd came out.", "label": 0}
{"text": "get your barrows gloves or highest available rfd gloves. dhoraks axe is okay against eclipse moon during its shadow clone phase, but You'll really want a one-handed weapon to pair with your best shield because your defense bonuses are the most important stat at perilous moons.\n\nI'd recommend either an abyssal/tentacle whip to use against blood moon wielding either a blessed spirit shield or dragonfire shield, as its weak to slash and you really want to minimize its hits to prevent it from healing and thus extending the fight.\n\nFor frost moon, wield glacial tamotli, as its weak to crush and the dual hitting is very effective against it.\n\nfor eclipse moon, you'll want a strong accurate stab weapon such as an osmumtems fang or zamorak hasta alongside your chosen shield, swapping to your heavy hitter such as your axe during the clone phase.\n\nother useful things would be a god blessing to wear in your ammo slot for the prayer bonus, and combat bracelets if you haven't unlocked any of the better gloves through RFD. Swap your boots for dragon boots, as they give a higher strength and defense bonuses.\n\n  \nAnother decent weapon available to you is the Zombie axe, as its 1-handed so can be worn with a shield, and you can use it on slash against blood moon, and crush against frost moon.", "label": 0}
{"text": "*skotizo stomp sound has entered the chat*", "label": 0}
{"text": "Daddy's Home exists.  But it did take a long time after construction came out.", "label": 0}
{"text": "That’s literally what I said in my comment above. It is not the demon bane property from arclight it’s the ancient shards “effect”", "label": 0}
{"text": "The hills have gnomes", "label": 0}
{"text": "This is very cool op, ty", "label": 0}
{"text": "Straight up looks like a horror movie villain. Leatherface maybe? Thanks, I didn’t want to sleep tonight anyway.", "label": 0}
{"text": "I used to wake up at 4am before school to fish lobbies", "label": 0}
{"text": "Yeah, they allow you seemingly to only chabge a few parameters and nothing else.\nWill be DoA if you are not a Content Creator.", "label": 0}
{"text": "I had one drop yesterday 💀\n\nhttps://preview.redd.it/v5fuyf3b7zwd1.jpeg?width=1044&format=pjpg&auto=webp&s=61783a5d6a525399e8db0b1021721e456025f8b3", "label": 0}
{"text": "I’ve gotten kbd pet on 2 accounts under 200 kc. Bad luck", "label": 0}
{"text": "Oof I feel ya, I didn’t get mine until after 20 mil xp", "label": 0}
{"text": "Your link has been removed because it is not whitelisted. If you are posting an image, please use [imgur.com](http://imgur.com/) to upload images.\n\n/r/2007scape only allows certain links to be posted due to a high amount of phishing links, if you feel your link should be whitelisted please [message the moderators of 2007scape](/message/compose?to=%2Fr%2F2007scape).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/2007scape) if you have any questions or concerns.*", "label": 0}
{"text": "I tried it a few years ago, but I didn't really get into it. I might have to try it again cause I think getting super into Isaac just fundamentally altered that part of my brain lmao", "label": 0}
{"text": "I’m at 18.7m right now 😭", "label": 0}
{"text": "The toggle is ::hween", "label": 0}
{"text": "I try to complete all diaries and go from there. First the easy ones, then medium etc.\nSince each diary has certain requirements, I always have some goal for different skills.", "label": 0}
{"text": "Silverlight and Darklight both have demonbane effects and don't one shot the altars either. It's definitely a unique Arclight feature that Emberlight inherited.", "label": 0}
{"text": "Im 2003 total level... \n\nhttps://preview.redd.it/bn1cf92u7zwd1.png?width=210&format=png&auto=webp&s=50b90c5afbcfcb3f23e95977f11be44f33d29b42\n\nAs you can see, not much bossing.. I dont enjoy it very much due to having a very high ping (around 200, with frequent drops to 300) which make bossing for me a pita.. i have to react twice as fast to almost any content, not a fun time.. Yet I have found ways to do it in some bosses that are predictable enough or dont need quick reactions..", "label": 0}
{"text": "you know the difference between you and some guy panic stuffing his face full of food to get his first kill?  they didnt die. lul\n\nI joke. bound to happen eventually", "label": 0}
{"text": "Just check the quest experience rewards page on the wiki and do whatever quests have rewards that you'd want", "label": 0}
{"text": "Agility 88-99 is about 10k laps at rellekka or ardougne. Those laps have 7 obstacles, and short run from end back to beginning. That is about 70k-100k clicks on the screen, with nothing happening but your character walking.\n\nHonestly I don't think many players would want to be obligated to do that to unlock some very useful/important shortcut, rather than it being about maximizing run energy efficiency.", "label": 0}
{"text": "Lol thanks, creepy is definitely correct 😂 The longer I look, the deeper it stares into my soul!", "label": 0}
{"text": "Can you explain what this is for someone who hasn’t played with a Lego in 20+ years?\n\nIs this an official Lego product?\n\nFan made?\n\nWhy is it $230?", "label": 0}
{"text": "I do not know off the top of my head. Just was showing how although STR is important you will still have to train ATK at time. The information is out there.", "label": 0}
{"text": "His main activity was playing wow/other account. I don’t think any ”efficiency people” would complain about him afking karams vs not doing anything on the account.", "label": 0}
{"text": "Facehugger transmog >", "label": 0}
{"text": "How to tell people you buy gold without telling people you buy gold smh", "label": 0}
{"text": "We do raids has a list for people just leaving a raid because of disagrements even if it was first «offense»", "label": 0}
{"text": "IIRC this is correct but I haven’t done it in a while.\n\nAwakened enraged: 1t speed, 1t look ahead. The switches are 1t apart, but the projectiles travel for a tick before hitting you. You will essentially be switching prayers 1t behind as they come at you.\n\nFastest normal: 1t speed, 0t look ahead. The switches are 1t apart, but they hit you immediately the tick after they appear. As in, you must change prayer immediately as each orb appears on its head.\n\nThe 2nd fastest normal speed however, I believe is the same as the awakened enrage. You can practice this speed for two rotations - once with mage/range only (as the enrage awakened) and then the next rotation will be mage/range/melee.", "label": 0}
{"text": "You are the GOAT! That worked. Just out of curiosity is that documented somewhere?", "label": 0}
{"text": "This, scurrius is a great starter. Took a buddy from rs3 and a buddy that played for the first time and they loved it. Really helped the new one get mechanics down to start getting into the game more.", "label": 0}
{"text": "But it's nothing to do with the ancient shards in the code. You're making it sound like the code is the way it is because you have to add ancient shards. It's not.", "label": 0}
{"text": "Honestly, I'm reasonably happy with it. It definitely does feel better, but almost less different than I expected it to, in a way. I'm also not surprised they're taking the approach of energy regenerating quickly, since that's the approach they took in RS3.", "label": 0}
{"text": "In the old system it scales linearly from 67 (0kg) to 134 (64kg).", "label": 0}
{"text": "We pay we say", "label": 0}
{"text": "poor Hoots", "label": 0}
{"text": "Little bit of all of it for me personally. I buy a few 4 doses of potions I use frequently, then I make placeholders for 1-4 doses. Keeps it looking full, even if stock is low. After that I hoard them however I can.", "label": 0}
{"text": "Ugh I know, it just seems like it involves SO much walking 😭", "label": 0}
{"text": "My original comment was about the code for the arrows not arclight. I’m not trying to argue that I’m right but also didn’t say anywhere that it was arclight/ancient shard code. Relax it’s not that serious.", "label": 0}
{"text": "Tell him he can axe me when his gloves are more ferocious", "label": 0}
{"text": "I organize very much like you do. But my friend, you are so stacked to have so little done on achievement diaries. Trust me when I say you should work on those, please.", "label": 0}
{"text": "10/10. No notes. ", "label": 0}
{"text": "Negative values are a buff as they are less drain per tick. (0, 1) is a negative value.", "label": 0}
{"text": "That's awesome, congrats! Some people really are made of iron cause I could never muster the dedication for that grind.", "label": 0}
{"text": "I stopped caring about these things because they usually come out after 3 years.", "label": 0}
{"text": "Brother why are you telling me to relax? I never got rude or anything, youre the one that needs to chill, I was just letting you know the real reason. Your comment sounds like it's talking about ancient Shards, which it is, when they don't have anything to do with it. If arclight didn't need shards and was just another quest upgrade it would have the same problem.", "label": 0}
{"text": "Exit of Hespori cave, aka the Hesporussy.", "label": 0}
{"text": "Swiftswitch and Swiftkit. Telling people you use it actually got you muted/banned. Ah now I feel so old.", "label": 0}
{"text": "Every day we stray further from Saradomin’s Light.", "label": 0}
{"text": "Elvarg transmog clears", "label": 0}
{"text": "I remember rsbuddy from back in the main game, in probably around 2007ish", "label": 0}
{"text": "I still dont know why the 6 hour log exists.", "label": 0}
{"text": "Why did Andrew Gower name it RuneScape? Because he was always bullied and he would choose to run and escape.", "label": 0}
{"text": "Can't believe we pay almost 13€ for this shit, bring it back Jagex this is not acceptable", "label": 0}
{"text": "Wiggle your big toe", "label": 0}
{"text": "Lol, you too, mines pretty good rn. Hope you learn to not take everything as a personal attack", "label": 0}
{"text": "with a 1/100 chance to play at GE", "label": 0}
{"text": "The biggest problems I saw was that protection prayers weren't easy to give up so they had to stay, buffed versions of some prayers were straight upgrades with the downside not being impactful enough to warrant caring about, and while some god alignments vibed with a majority other ones didn't.\n\nSo, I'm assuming this prayer book has to be from a difficult quest. Why not make the reward your regular prayer book getting enhanced. Too hard to move away from protection prayers? Lean into them instead. Modify the existing prayer book, adding in the new prayers also, and then you won't have the issue of it being too similar to what we have.\n\nYou would still be swapping your prayer book like we do with magic, but all the current prayers are buffed, just keeping with the mentality that this improvement is high risk high reward.\n\nProtection prayers. Take (avoidable and able to pray against) damage off prayer and your god alignment is impacted, turning off all prayers for a certain time. If the source of damage is rng, like KQ or Zulrah, it instead gives stacks equal to the amount of correctly prayed against random attacks consecutively. Guessing incorrectly removes all stacks, reducing the damage you take from the next random attack by 30% per token.\n\nI believe this solves the problem of it being too similar to what we have, because it is what we have. Just with added conditions with consequences and rewards. I hated that chip damage was a main factor in the protection prayers being kept. The problem is, everything is balanced around the current prayers, so any new prayer book is going to feel similar in a big way.\n\nSo then just work with what we've already got. Get creative with it, really give some consequences to your actions. Add a chance to parry with piety active and missing the chance to click the boss for a counter instead has the boss counter you instead. Rapid restore heals you at 1hp per two ticks now, but only works in combat and getting hit off prayer while it's active could have you bleed for a bit at x? the rate of its restoration.\n\nI'd like to know if these are at all viable ideas that I thought up in the last 20 minutes and didn't care too much to think about the consequences (thematic) of adding them to the game.\n\nI also didn't have anything to add on the god alignment prayers themselves, just the existing ones.", "label": 0}
{"text": "If you cant use the bank you will just buy food from a shop. If you cant do that you will just fish and cook. If you cant do that you will steal from thieving stalls. If you cant do that you will collect food off the floor. Unless you just block people from doing anything while someone else is in combat there will always be an \"exploit\" for someone else to heal you.", "label": 0}
{"text": "Says the guy downvoting every response I give. Didn’t take anything personal. Gave what I thought was right saw another comment clarifying and added it to my original.", "label": 0}
{"text": "Also special shout out to miniclip. The place where I discovered runescape back in the day.", "label": 0}
{"text": "I used SwiftKit back in the day", "label": 0}
{"text": "Nice.", "label": 0}
{"text": "You've got your work cut out for you you know\n Every single KC that's above 69 must go to 6969.", "label": 0}
{"text": "Tbh I just kinda throw caution and preparation to the wind and spazz the fuck out hoping the snake dies before I run out of food.", "label": 0}
{"text": "Nice", "label": 0}
{"text": "Long live swiftkit", "label": 0}
{"text": "Bossing is usually kind of just something I do as a means to an end, the only one I really have fun doing is the whisperer but I like to push my limit after a boss becomes “easy” and I try harder bosses", "label": 0}
{"text": "The noise plays even if you have the volume turned all the way down, and Jagex must threaten to end all Runelite support unless Runelite bans all plugins that remove the noise. Also if you try to play runescape with your computer volume's muted, the app volume muted, or without an audio device plugged in, the noise crashes your computer and corrupts your hard drive.", "label": 0}
{"text": "I gotta say, I'm not a fan of fixing these types of problems with \"add an npc that you can throw money at\". I quite like the suggestion of forcing an ingot drop the first two times we roll a vestige 1/3 (leaving the 3rd ingot to be had as a random drop, could reduce drop rate a bit to compensate), and then adding ways to get rid of excess ingots (such as turning them in to open the chest in ancient vault).", "label": 0}
{"text": "Dw op, next few kills you're gonna get it for sure", "label": 0}
{"text": "Cheers buddy. That's neat", "label": 0}
{"text": "I frankly will be pissed off if we get blighted overloads.. before we get regular overloads..  Mixology was the perfect time to introduce them into the game... \n\nCould have taken the elements of overloads broke them down with mixology and  could have had a reward scroll to buy the recipe.. to them use the minigame to Mix them.", "label": 0}
{"text": "That's absolutely huge dude, congrats!", "label": 0}
{"text": "You’re actually an unbelievably kind person because this will teach them you should only splash on rats in f2p worlds", "label": 0}
{"text": "this is fucking hilarious", "label": 0}
{"text": "74 range and 85 mage is more than enough even for corrupted. You're using T3 bow and staff, right?\n\n>T2 I was 9min+. \n\nT2 prep can be done consistently in CG with the 7:30 time limit so 9+ min prep time is very slow. Hard to say what you're doing wrong without a video but you're probably wasting a lot of time running around.\n\n>Been trying t1 and the chip damage is brutal. Then I get flustered and miss a prayer and get nuked.\n\nYour #1 priority should be to use the correct prayer. #2 should be to avoid tornadoes and floor damage and #3 to deal damage to Hunllef. Slow but consistent kills are better than dying.", "label": 0}
{"text": "Swiftswitch was the og client", "label": 0}
{"text": "I did not extend and finished the log and pet organically at 98 slayer", "label": 0}
{"text": "If this was a HCIM Pumpkin I'll guarantee you it'd be smashed by someone before the night is over.", "label": 0}
{"text": "Really just said it to end this pointless back and forth. Not mad whatsoever but you can think whatever you want man. Have a good evening.", "label": 0}
{"text": "Lol yeah dead to DC.", "label": 0}
{"text": "Eh not really. We had Authenticator and OSbuddy was run by a Jmod/ex-Jmod. And Runelite was open source + the guy is friends with Jmods, even Jmods used it etc.", "label": 0}
{"text": "Oh no", "label": 0}
{"text": "Not really big power creep. people typically bring brews out to the wild anyway.. and if they follow the same rule as they did on deadman they will lower def lvl.", "label": 0}
{"text": "There's a dude I've met a few times that did that but 420 (and 42 zuk), I think his name is 420kc or something like that. Neat.", "label": 0}
{"text": "You too man", "label": 0}
{"text": ">Every GM I know did it that way.\n\nI've run this CA lots with GMs and those just wanting elites/masters. It's not that bad, had a lot of 1nd's but never more than 3 attempts. Just need to be careful on acid phase and be prepared when he's looking at melee. Much worse CAs exist.\n\nRan it last week and we failed at the very end of p3 when portals dropped one guy into flame wall on the tick damage was calced, I will admit that one was sad.", "label": 0}
{"text": "I remember my cousin telling me he's going to start picking flax for a whip...and remember thinking to myself...tf does that work? You craft thousands of flax into a whip?", "label": 0}
{"text": "We have it so good now a days. These greedy little goblins used to charge a membership in order to get all the good features.", "label": 0}
{"text": "One of a kind 😂", "label": 0}
{"text": "lol I thought you meant grandmaster quests. When I clicked on your post I expected to read your review of them lmao. I’m such a noob. Just getting to dragon slayer 2 this weekend", "label": 0}
{"text": "I need this plugin for my fridge so I know how many sips of beer I have left.", "label": 0}
{"text": "https://preview.redd.it/uhgcbp8edzwd1.jpeg?width=980&format=pjpg&auto=webp&s=0c24ac05d2aaa87a479623799d48d806a6f40fb1", "label": 0}
{"text": "Always rocked the warrior helm", "label": 0}
{"text": "How do i get in on this?", "label": 0}
{"text": "I did 4k of these for the pet and got like 6 hilts.", "label": 0}
{"text": "Osbuddy was ran by a person who installed a keylogger on the rival cheat client, sold or gave away the info, all so his own client would get more users or for revenge, i forget.", "label": 0}
{"text": "you are joking but I bet these meme polls would not pass if the volume only was loud if you voted yes and the plugins/volume controls were locked for you if you voted yes\n\nwilling to bet the ones who vote yes to this dumb stuff either do not interact with any of the content or they use plugins/settings to mute the audio", "label": 0}
{"text": "Full support on this. I never use anything other than a 4 dose for brews or restores so I just dump those all in storage and have a big stack of four doses out in my food/pot tab. \n\nAs an iron super helpful for eliminating a ton of spots for pots I rarely use (like anti-venom or anti-fire variants), I do need those at some point and no point in dropping but glad to have the cleaner bank without them visible", "label": 0}
{"text": "Long Live PowerBot", "label": 0}
{"text": "Sat in irc chat all day, shit was so much fun", "label": 0}
{"text": "I'll never forget that day in the library. I found the game, I walked, I poked goblins, I walked, I got pwned by some weird dude in a hooded robe. \n\nI kicked goblins. I get armour. I can't wear armour. I am confused. \n\nNearly 20 years later, I walk past the weird dude in a hooded robe in triumph (I teleport everywhere, I haven't seen the weird dude in the hooded robe since I did demon slayer)", "label": 0}
{"text": "Post the meme then", "label": 0}
{"text": "If you have Runelite be sure to run Hunllef Helper. It will tell you when you need to swap prayer so you can pay more attention to the field and keeping count on your own attacks. If you count your own attacks you can know when to swap weapon.\n\n\nThe Hunllef helper call-out also assists a bit with keeping track of your own prayer when prayer is disabled as simply swap to last one you heard. Helps avoid mixup when the disable occurs as Hunllef's last attack before swap.", "label": 0}
{"text": "Dudes awesome, been friends with him for a while now. Always chills at farm guild on you guessed it world 420 lol", "label": 0}
{"text": "Jesus dude", "label": 0}
{"text": "if they don't want to get crashed then they should've splashed somewhere else", "label": 0}
{"text": "I tried to do this today but couldn’t find anything. I’ll keep my cat on me and ready.", "label": 0}
{"text": "Kids these days don't even remember Konduit", "label": 0}
{"text": "For a while there was Konduit as well", "label": 0}
{"text": "They could be splashing in a place where this is not possible but instead they choose the place where they're the biggest eyesore for the most amount of people. Serves them right.", "label": 0}
{"text": "Would be too distracting if it was 73", "label": 0}
{"text": "That would be so funny, I would just never level anything 🤣", "label": 0}
{"text": "Honestly, if you spend your time ganking ironmen for scraps just to annoy them, you deserve to go sky.", "label": 0}
{"text": "I’ll gladly do all this stuff in destiny 2, ff14 and Wow though :)", "label": 0}
{"text": "I paid for osbuddy pro just for the clue solver", "label": 0}
{"text": "I never heard about that story so unless you have actual evidence it's hearsay. In any case I was talking about Jacmob who was the main owner and a Jmod/ex-Jmod. That gave it a sense of security.\n\nJAG existed before Authenticator actually. Also Authenticator existed for Runelite, I was more referring to that.", "label": 0}
{"text": "Oh man I loved swiftswitch. It was such a game changer at the time.", "label": 0}
{"text": "Dude is just roleplaying at a higher level.", "label": 0}
{"text": "There'sa minigame now, guardians of the rift. Still not an afk skill but getting lv 50 can be knocked out in a few hours now.\n\nAlso start doing herb+tree+birdhouse runs, hunter and farming take a while to level and it's very worth to start investing 20m a day on those.", "label": 0}
{"text": "https://preview.redd.it/qsdrtt2wezwd1.jpeg?width=1178&format=pjpg&auto=webp&s=6d35ad82ff4abb83d0477cbaf33ca2572c979747\n\nSad to think all my friends list back then logged out for the last time", "label": 0}
{"text": "I hated OSB. I preferred using Konduit since it was fully free.", "label": 0}
{"text": "He played RS3 for a few years recently, and the equivalent system there caused lag issues for servers.", "label": 0}
{"text": "try this special runelite client i have", "label": 0}
{"text": "The ammo is the bolts. The rack just the magazine that holds them. Given the crossbow, it looks like the racks mount on top and probably auto-load into the crossbow. That is why it is a faster \"repeating crossbow\".", "label": 0}
{"text": "Please , do it more 😆", "label": 0}
{"text": "I think calling you a \"bad person\" would be a bit far, but tbh they're not bothering you so doing this to no benefit of your own other than messing up their afk is not a particularly nice thing to do", "label": 0}
{"text": "I’d rather stick my balls in a blender than pay 90$ for that whack monkey garbage.", "label": 0}
{"text": "It’s a “magazine”", "label": 0}
{"text": "Plugins always have a link to the git repository when you search for them in the plugin hub", "label": 0}
{"text": "Swiftkit had YouTube built in it was great", "label": 0}
{"text": "Honestly it's been awhile since I watched any of his guides because I was so turned off by the style and lack of information tbh, but maybe that's just me, I like a lot of information and details before doing stuff, stuff like what the Ed b0ys makes", "label": 0}
{"text": "Usually people colat items for specific tasks or grinds. \n\nLike maybe someone wants to go grind toa for a week and doesn't plan on doing much tob. Friend in guild colats Max mage for scythe + other shit. \n\nA lot of people have one or two megas but having to sell them often isn't ideal.", "label": 0}
{"text": "Nice to see some storage plugins coming out for sure :)", "label": 0}
{"text": "Gzzzz. Now for inferno", "label": 0}
{"text": "You're absolutely right about Peach Conjurer. Like anyone can get it but spending that much time is overboard", "label": 0}
{"text": "My main memory of Swiftkit was being phished through someone sending me a fake forums link in it's chat feature.\n\nMost devastating thing that happened to me in gaming, but a life lesson that's served me well since.", "label": 0}
{"text": "Yeah that's good context. It reminded me that before Sk or adblock I used to play in a window that wasn't full screen so I could scroll down to where the banner ad wasn't visible either.", "label": 0}
{"text": "Yeah, I really should do them. Atm I'm working on the quest cape requirements. I only need the fm then I'm there", "label": 0}
{"text": "I posted a video on YouTube back in the day of a bunch of snowmen appearing at the void Knight outpost outside of any holiday events and someone commented I'm using a hacked client and the whole thing was fake lol", "label": 0}
{"text": "Depends on the circumstances obviously. If you can afford a new weapon while you reach that level in attack, i doubt its ever a bad choice except very early on, but every time im using dps calculator to see what is worth more, STR always wins out even if getting a new max hit is only a 5% dps increase if you keep the same setup, even more so if you are potting and praying. Also dragon defender is not only a huge boost in attack but one of your only ways to get attack values, thus meaning Attack is actually becoming even worse, since you get such a high boost once you get your defender that its bonus pales in comparison", "label": 0}
{"text": "Pvm Johnny’s make me sick", "label": 0}
{"text": "https://preview.redd.it/sqvibqgogzwd1.png?width=886&format=png&auto=webp&s=2d5ceb06765738d1c9d352cd4d6c20081471774c\n\nthis happened before i hit 300 kc", "label": 0}
{"text": "Tbf, it was like $2 per month for the premium version and worth every single cent. We're paying what, 20 now for a 20 year old game with a shit client.", "label": 0}
{"text": "the only fansite membership i'd be willing to pay for would be GeTracker", "label": 0}
{"text": "I think it was more how clients were pushing the boundaries of what was allowed without polls or approval from Jagex. Like it was \"add powerful plugins, then remove/scale back if Jagex says something, otherwise keep it\". Eventually, OSB did push things clearly too far and Jagex finally stepped in and made the third-party client guidelines to establish where the line was. Since then, there has been far fewer issues like that since the rules are clearer, not just whatever OSB decides to do.", "label": 0}
{"text": "https://preview.redd.it/jvdizjz8hzwd1.jpeg?width=796&format=pjpg&auto=webp&s=3779175dc11b451a89679116c89d47d9f2f15f1a", "label": 0}
{"text": "Just put the fries in the bag bro", "label": 0}
{"text": "I'm mentioned in this and I don't like it", "label": 0}
{"text": "Yeah it happens almost every birdhouse run. ", "label": 0}
{"text": "We're now paying $0 for the same features that OSB charged $2 a month for... Also, the official client hasn't been bad for years; it is even getting Menu Entry Swapper in a couple weeks.", "label": 0}
{"text": "There is a benefit, not having to look at that eyesore anymore.", "label": 0}
{"text": "Damn thats pretty nice... Also for some reason i didnt think of using moon potions for the nagas there, not that i really regret doing Scurrius for a while.", "label": 0}
{"text": "Can you not be on both Reddit and RS at the same time? 🤔", "label": 0}
{"text": "Konduit was decent but osb actually had tons of extra features etc. Osb was also the first client to get the gpu support plugin, that was huge.", "label": 0}
{"text": "I used Konduit until it went under then paid for OSB, was worth it at the time but it was never as good as Runelite", "label": 0}
{"text": "I've had people rage at me for doing this. It makes me do it more.", "label": 0}
{"text": "No. Because splashing on rats is the objectively inferior option.\n\nWe have the docks at port sarim for a reason.", "label": 0}
{"text": "They also give you a lot of time to make your switches and activate you prayers and spec", "label": 0}
{"text": "No", "label": 0}
{"text": "It's been quite some time since I watched any of his stuff and I went through a lot of content creators at the time so probably mixing them up", "label": 0}
{"text": "Some of us play the game for fun, buddy.", "label": 0}
{"text": "I had swiftkit back in the day", "label": 0}
{"text": "wasn't osb orginally a bot program? or am i remembering wrong?", "label": 0}
{"text": "In the real world, court is for people with money.", "label": 0}
{"text": "Didn’t konduit have a ton of issues with login info getting leaked after it was end of life", "label": 0}
{"text": "And you can easily argue that defense has a lot more diminishing returns than either of attack and str because its not like you arent negating most of the incoming dmg by prayer and its not like every attack is rolled against your defense, because a lot of them dont.", "label": 0}
{"text": "Also you can do this in varrock sewer as well", "label": 0}
{"text": "Gz ,I still need to go do the new valamore quests to get my cape back.", "label": 0}
{"text": "Or just splash on seagulls/chickens/ardy knight so people can pick pocket", "label": 0}
{"text": "This is why you splash on seagulls in Port Sarim", "label": 0}
{"text": "Perfect!", "label": 0}
{"text": "Nice.", "label": 0}
{"text": "He has head", "label": 0}
{"text": "You can pickpocket chickens? TIL", "label": 0}
{"text": "I vaguely remember OSBuddy! I feel like there was an RSBuddy too?", "label": 0}
{"text": "Both are great. Best of luck, my fellow adventurer. I'm 3 quests away from qc, and my goal is to finish before Thanksgiving.", "label": 0}
{"text": "No because they could splash on so many other things", "label": 0}
{"text": "And before that we had SwiftSwitch", "label": 0}
{"text": "This is beyond evil and I'm glad I learned I can crash people splashing like this", "label": 0}
{"text": "You mean SwiftSwitch", "label": 0}
{"text": "Rats are basically squirrels with shaved tails", "label": 0}
{"text": "I think I remember protests in Falador when SwiftSwitch was banned.", "label": 0}
{"text": "What's the easiest warm clothing for an ironman to get for wintertodt?", "label": 0}
{"text": "*points to sky* Orion’s Belt", "label": 0}
{"text": "Konduit gang rise up", "label": 0}
{"text": "You missed my point, the question could also be \"is there a reason for this particular xp formula?\"", "label": 0}
{"text": "I miss konduit and runeloader", "label": 0}
{"text": "You missed my answer, they probably liked the curve of the xp formula.", "label": 0}
{"text": "Check runelocus", "label": 0}
{"text": "+1 to adding the full potion option. Also thank you for your plugin!", "label": 0}
{"text": "Hot take: 90% of the people on this sub don’t actually know what it is and just regurgitate other people saying it for clout", "label": 0}
{"text": "Uhh nice, do you have all the Reqs?\n\nThese are my diaries\n\nhttps://preview.redd.it/6ju7sjrljzwd1.jpeg?width=3522&format=pjpg&auto=webp&s=53560fb352d2f15e20929955063ef5c5c62e1beb", "label": 0}
{"text": "I was just wondering if a reason was ever stated for why they liked it ¯\\_(ツ)_/¯", "label": 0}
{"text": "I want to have Jad as my slayer master", "label": 0}
{"text": "They deserve it. Probably scouts anyways", "label": 0}
{"text": "Lol yes, but it's such a hilarious little way to screw with people.", "label": 0}
{"text": "I mean you could 100% guarantee scaling isint scewed if you made it so mod nox could only use 2nd best in slot gear for testing.\n\nProblem is then you would prob want to go back and rebalance the inferno, and other extreamlly high scaled challenges that dont have true balancing.", "label": 0}
{"text": "I was more of a Swiftkit kind of guy...", "label": 0}
{"text": "It's really no worse than the 3-4 pkers stanced up bankstanding on every world....", "label": 0}
{"text": "A man of culture. I do it as well whenever I Tele to ferox and see them", "label": 0}
{"text": "I mean all the clients except OSB were free; it was the only one that charged. So yah, when a more community-driven, free alternative comes along, it makes sense players prefer it over the one that charged them.", "label": 0}
{"text": "TISM TOCK SAVS PEAKING RN‼️💯😎 (I've been bankstanding farming guild w428 for 40 minutes drinking beer shittalking my cc 😎)", "label": 0}
{"text": "Donate to the brown and green chad next to you", "label": 0}
{"text": "Would have been better if you were a HCIM", "label": 0}
{"text": "Mans really got the pet, geared up for slayer, got to his task, and then decided to take the pic", "label": 0}
{"text": "We're getting even better shit now for $0. But this is not normal, all that work they put for nothing is saintlike and if they started charging money for RL I'd gladly pay another 2-5 a month for it. Probably more even.", "label": 0}
{"text": "Nice", "label": 0}
{"text": "I don't get splashing on seagulls, I thought it was mostly defence pures that kill them since they have negative melee defence. Am I missing something? There's thousands of chickens, only a few seagulls", "label": 0}
{"text": "The answer is always 1 beer too few sips", "label": 0}
{"text": "Rather see a teleport to the top of the island from something earlier game than DS2. Like there used to be major city there; surely there is an old teleportation pendant or such that goes there somewhere...\n\nLike one thing I'd love to see a post-Dragon Slayer quest/miniquest where the descendant from Crandor wants to return to his family's home now that the dragon is gone to see if anything remains. Would be a good place to unlock a teleport item and perhaps an expansion to the dungeon.", "label": 0}
{"text": "I did 7.4K for one", "label": 0}
{"text": "Is there a reason to do scurrius loot wise? The ratbane stuff seems.... Good for doing scurrius I guess", "label": 0}
{"text": "Just a place to splash that can't be griefed by cats, no real reason to use them over chickens but they do work.", "label": 0}
{"text": "I never researched super deep but if you dont know about the hackings then i kinda doubt the info is true. Gh0st aka matthew was the main dev of orion/osbuddy/rsbuddy. Rsbuddy was 100% ghost's and is why orion changed its name to osbuddy. Maybe jacmob was the owner behind the scenes and not just involved but itd be super weird because ghost was the one pushing it in irc channels and was the sole advertiser. \n\nIts not even a rumor too. he gloated, live streamed himself doing the hacking, live streamed the info of accounts, and then much later apologised for it lol. Though he would throw a tantrum everytime someone occused orion/osb of being keylogged. \n\nYou can just google it and click a million links. It would be a lot of work to finding the original rsbuddy gloat post or the rival client explanation post through wayback and not just accept the pictures of the threads. Plus those links would be banned here anyway.\n\nAlso JAG didnt work for osrs", "label": 0}
{"text": "Same. Tried for a couple hours, and, no joke, got a 55. Still don't have ca", "label": 0}
{"text": "Also remember how OSB basically spectacularly blew up all its credibility with the community so quickly.", "label": 0}
{"text": "Appreciate it!", "label": 0}
{"text": "Poll followup suggestion: Make all the pets do this.", "label": 0}
{"text": "Biggest reason is Sea Shanty 2 on repeat", "label": 0}
{"text": "YES IT WOULD! I have been kinda waiting for news on that. It's pretty much on my bucket list of features I want them to add with sailing.", "label": 0}
{"text": "what", "label": 0}
{"text": "thanks (ok)", "label": 0}
{"text": "Theyve added a lot of noob friendly content. If you wanna get better at mechanics go scurrius, amox, huey. Moons of Peril are great. Theres", "label": 0}
{"text": "I mean, if you get GM you are obviously good. But it also doesn't mean you're gonna be super great in all content by default. Most GMs I know personally, granted only a half dozen or so, still have a lot to learn to git gud at raids", "label": 0}
{"text": "Hanging out on the zybez forums with swift switch and zybez radio.", "label": 0}
{"text": "\"I'm watching you, Wazowski. Always watching...\"", "label": 0}
{"text": "Some of those osbuddy premium plugins were straight up cheating. The farming one worked like it does now in runelite except it gave you real time updates on the status of your patches without the lunar spell. Also demonic gorillas were free. Lol good times.", "label": 0}
{"text": "I miss that radio man.", "label": 0}
{"text": "As you can see, I've only done the diaries for the things I need at a specific moment. But really should work on all hards as a start \n\nYeah the night at the theater I ginne be tough.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "I use controller on my whip but never “train” with it. Combat xp comes gradually", "label": 0}
{"text": "Probably not much of a reason beyond it just fitting with the exp rate they wanted. Like the whole \"exp doubles every 7 levels\" was likely the main thing they decided to build around, which doesn't quite work for the early levels. So maybe they found a rate they liked for high levels and worked back or started with the formula to pace early levels, then changed to the double every 7 later.", "label": 0}
{"text": "To be fair if you get enough people you can one shot someone regardless", "label": 0}
{"text": "it was powerbot back then, rsbuddy formed a bit later", "label": 0}
{"text": "Jesus yall have no brain or just no sense of humor  everyone knows in every video game the general idea is the higher level the monster the better the reward? so why is anyone confused, the post is he’s getting garbage loot or am I wrong? I’m somehow confusing yall by laughing at the fact that such a strong monster gave him bad loot consistently by coincidence? Okay…. I’ll crawl back in my hole now 🤣🤣🤣", "label": 0}
{"text": "Zybez radio was my shit", "label": 0}
{"text": "Grow up", "label": 0}
{"text": "What does that mean?", "label": 0}
{"text": "Please dont give up on god alignments. dont let such a good idea vanish.", "label": 0}
{"text": "I do see that. I think doing the diaries will help you speed up what you still need. They add so much utility to an account. Just food for thought. Play how you enjoy playing. That is the most important thing.", "label": 0}
{"text": "Working back makes a ton of sense to me, I know they said they never expected people to hit 99 so maybe just worked from the middle somewhere :o", "label": 0}
{"text": "clannies keep telling me to learn t2 but it sucks soooo hard. I guess it is better knowing you're gonna fail after 3 minutes of prep and resetting than it is eating shit at the boss after 6+.", "label": 0}
{"text": "Part of it is that they don't work as others said, but also you want to kill spawn asap to end phase", "label": 0}
{"text": "What features do you use from paid GE tracker?", "label": 0}
{"text": "No that’s funny as shit. Especially if they get mad, like bro just go somewhere where that can’t happen", "label": 0}
{"text": "Weird", "label": 0}
{"text": ">20 Perfect Theatres so far for friends\n\nhey its me ur friend", "label": 0}
{"text": "ToB reg times being much harder than HMT times is funny", "label": 0}
{"text": "ToB reg times being much harder than HMT times is funny", "label": 0}
{"text": "but its slow tho", "label": 0}
{"text": "Could you tell me more about this please? In my knowledge we have never banned someone from WDR for leaving a raid as their first and only offense. Also, we have two ban-lists:\n\nThe first is is only accessible in our Discord (which is to say, not integrated into any plugin), and it shows all players banned from WDR for scamming and WDR-specific rule-breaking (like repeatedly leaving raids, or being toxic, etc).\n\nThe second is used by the runewatch plugin and shows players banned for scamming *exclusively*, not those banned for WDR-related offenses. Players banned from WDR for anything other than scamming will not appear in the runewatch plugin.", "label": 0}
{"text": ">I've gotten very close doing trio cms, but it always fails during acid phase.\n\nI got it with 2 friends on their very first CM while I was teaching them, completely by accident", "label": 0}
{"text": "that's the thing. these tasks were easy before the powercreep.\n\nremove (or move) the less relevant bosses like hydra and vorkath to master, keep raids, inferno, coll anything that would be considered high level in gm and make gm actual gm, because most of the times are a total joke and always have been.", "label": 0}
{"text": "Always been purely pvm focussed. Grinding combat stats while doing the bare minimum non-combat skills for quests and hard diaries. \n\nThen once i got into raids i basically never left cox for years until i decided to go for zuk helm.\n\nNow that ive finished zuk helm i started an iron. The goal on the iron is still pvm; but ill have to do a lot more skilling to allow it.", "label": 0}
{"text": "Reddit: no this is great, do this to everyone!!!\n\nAlso reddit: pker bad, pkers are only griefing!!! Dk lurer is also griefing!!!", "label": 0}
{"text": "The spiders beside the fairy ring outside the GE are my go to.", "label": 0}
{"text": "i means it a roole playing game and youre roleplaying", "label": 0}
{"text": "TIL speed tasks are cancer. Can't say I'm surprised.", "label": 0}
{"text": ">get it passively by just playing well.\n\nOnly thing is, it's reliant on your team also playing well, or more accurately, playing it safe", "label": 0}
{"text": "Scorching bow is better than tbow for kril...", "label": 0}
{"text": "Yeah", "label": 0}
{"text": "You’re not going to get flagged for legitimately borrowing gear.", "label": 0}
{"text": "I'm not sure if Jagex scrutinise accounts with RWT history more than normal. But friends lend stuff all the time, this wouldn't flag normally.", "label": 0}
{"text": "Lunagang", "label": 0}
{"text": "When ur mum tells you to get off the computer and go outside", "label": 0}
{"text": "Why do you like making your melee training slower for no reason", "label": 0}
{"text": "Seagulls also only hit 0s", "label": 0}
{"text": "You were so close! Haha", "label": 0}
{"text": "how else do you get eggs?", "label": 0}
{"text": "They were separate entities, powerbot and RSBuddy were around at the same time. Rsbot was what powerbot was before the rebranding", "label": 0}
{"text": "Your mom loves my talent ", "label": 0}
{"text": "That, and also, team content IS a skill. Organization, communication, etc is skill expression", "label": 0}
{"text": "THEYRE SEAGULLS, EXCUSE YOU!", "label": 0}
{"text": "While were at it make it do full damage vs ice demon.", "label": 0}
{"text": "And yet I don't want to be training slayer for just slayer levels.\n\nJust a different approach and mindset.", "label": 0}
{"text": "Back before I had ornate pool in my house (5 days ago) I did it every single time I even had to tele to the ferox enclave. Sometimes the itch doesn’t go away and I gotta hop worlds to find more", "label": 0}
{"text": "The beauty of the game is the journey is yours. Only you choose what to do. I don’t boss much so I skill instead. Slayer, farm runs, agility…. I Just play the game lol", "label": 0}
{"text": "TIL americans go to jail a lot.\n\nAustralian here and only guy i know who whent to jail here litterally killed someone.", "label": 0}
{"text": "Every eboy you knew was walking up in Saradomin and a white beret.", "label": 0}
{"text": "ngl would love to use it looks dope", "label": 0}
{"text": "they arent going to post their server source code so it can be optimized", "label": 0}
{"text": "Yeah, I know, it’s why it’s a fun thought experiment.", "label": 0}
{"text": "0.00539863%\n\nWith 163,625 other players with 201 kc. About 8-9 players had this kind of luck or better already. Pretty lucky though but not 0.00026% lucky.", "label": 0}
{"text": "Incoming NPC \"nice\" comments", "label": 0}
{"text": "Team CM cox is the free-est of the free. Can literally do it with a 2+1 lol", "label": 0}
{"text": "I don’t understand why all the downvotes… Practically everyone seems to love these character/costume ideas but why do so many people not like that this person loves them!?!??? I’m so confused…", "label": 0}
{"text": "Started on miniclip as well for me, those were the days!", "label": 0}
{"text": "Just login and we'll double your bank!", "label": 0}
{"text": "Moms credit card isn’t safe", "label": 0}
{"text": "Yea I don't do much team cm so I wasn't sure where to put those, but I did beat them both by like 6 minutes first try", "label": 0}
{"text": "Found the splasher", "label": 0}
{"text": "Nice", "label": 0}
{"text": "Mods please buff seagulls to hit 99 one out of every 5000 attacks", "label": 0}
{"text": "Not only that but like, the chances you buy all GM tasks is basically 0. The amount of money that would take is just insane. Like, IRL money, that has to be WELL into the thousands. Do some GMs buy some tasks? Yeah 100%. But like, come on, there's no way they bought everything or even just the hard stuff. There's a lot of hard stuff. Also it's a game who cares, doesn't impact you. Im not a GM and don't want to be, but even if I was I don't think I would care if others bought it. For me real prestige is stuff you can't just buy, like really fast diary times nearing WR.", "label": 0}
{"text": "Yea that's why I don't get the point of collateral on loans unless it's like half or something.", "label": 0}
{"text": "They have a magic level and magic defence bonus so I think you'll need accuracy.", "label": 0}
{"text": "Yeh fair enough. Few more range and defence levels and you should be golden :)", "label": 0}
{"text": "It's a subtle foreshadowing to raids four which will abreviate to \"FAN\".", "label": 0}
{"text": "Rats with wings are still rats tbh", "label": 0}
{"text": "I love my ancestral pajamas", "label": 0}
{"text": "If you actually beat team trio by 6 mins first go that IS wild lol. I assume no prep? With some competence I could definitely see that, lots of solo cmers run circles around WDR LFR cox cm", "label": 0}
{"text": "> At worst you will be able to make custom rules only.\n\nThis is almost a guarantee given they were exclusively talking about adding parameters for players to adjust\n\nIt's likely just gonna be like PoE custom servers, which can be fun enough but you're almost surely not gonna have creative freedom like people are assuming", "label": 0}
{"text": "It’s just not smart.  Level attack, then strength, then defense.  This is day one shit guys", "label": 0}
{"text": "Konduit is the client i've spent most time on, by far!", "label": 0}
{"text": "hella nice !  im yet to get one and im 1828 kc. hopefully the luck continues", "label": 0}
{"text": "> Why not\n\nWay, way more workload than fits in the scope of this project", "label": 0}
{"text": "Make it optional for those of you nihilistic to enjoy this.", "label": 0}
{"text": "I would upvote this but it’s at 69", "label": 0}
{"text": "Try to keep your hp above zero by healing with food! Hope this tip helps!", "label": 0}
{"text": "Bruh why is it on the ground", "label": 0}
{"text": "I agree entirely with your point about perfect tob denying strats. Like really nobody that really does tob alot is going to do \"perfect tob\" by just tobing normally as strats like barraging clumps of nylos, bgs drive by bloat and running under zarpus all would cause perfect to fail.", "label": 0}
{"text": "swiftswitch with the irc chat on the bottom was great lol", "label": 0}
{"text": "Yea the zgs has gatekept a lot of my best solo cms as well, I love having a huge rng check as the last room", "label": 0}
{"text": "iirc - Orion was OSBuddys old name, and in pre-eoc Orion was actually a botting client", "label": 0}
{"text": "Doing perilous moons is possible at 70 base att/def/str, piety is the hardest requirement (maybe 66 herblore for ironmen).\n\nYou can spam kill just the bloodmoon for no supply cost and get the full set in a pretty reasonable timeframe.", "label": 0}
{"text": "i used konduit", "label": 0}
{"text": "Nothing beats his CG guide where he just straight up planks but ends the video regardless. Funny as shit.", "label": 0}
{"text": "I was coming in here just to say: Where the hell is the Swiftswitch at?", "label": 0}
{"text": "you are correct. The calculator I used assumed the chance for exactly 4 drops, not \"at least\" 4 drops, it was my mistake", "label": 0}
{"text": "I am doing my part.", "label": 0}
{"text": "a few they do to 169, 696 and 1696", "label": 0}
{"text": "Super cool, finding a wildy slayer partner and a wife at the same time is some pretty good rng.", "label": 0}
{"text": "They (me) probably saw the Colonello video about it", "label": 0}
{"text": "Clips like this make me realize that I wouldn’t last 5 seconds in LMS / PvP 😂", "label": 0}
{"text": "Everything else lol. Minigames, skilling, slayer, clues, whatever I feel like doing. Also some easy bosses which typicaly isnt considered as such: Barrows, the Moons.", "label": 0}
{"text": "I mean that’s a little bit of a stretch but it will definitely make them seem more inviting ", "label": 0}
{"text": "Context matters and the game would be extremely boring if there was only one way of doing things.  Also people like to AFK while they do stuff so this is always useful to know. \n\nAgain, I made up all of those numbers I was just trying to show that yes ATK is important as well.  Some people go for ATK faster for better weapons, for example.", "label": 0}
{"text": "That's what he put in his video description, so it's literally his words.", "label": 0}
{"text": "This guy copulates", "label": 0}
{"text": "$90 greedy as hell!", "label": 0}
{"text": "Just here to support chromium ingot rework. The arbitrary ingot requirement simply makes me not want to continue doing DT2 bosses at all on an Ironman, let alone the demotivating scenario of getting a duplicate vestige before the needed ingots and having dozens of millions worth of untradeable bank filler\n\nHearing that I don’t need 11 more ingots after 1200 boss kc, and that duplicate vestiges could be made easily tradeable/sacrificeable soon, makes me want to log in and finish the grind", "label": 0}
{"text": "Wtf is your rng", "label": 0}
{"text": "+1 :)", "label": 0}
{"text": "I do this sometimes...", "label": 0}
{"text": "Agree with everything but duke and perf trio.\n\nDukes a 1 in 4 with good prep, and I have accidentally gotten perf trio like 5 times now.", "label": 0}
{"text": "Any recommendations for clans that do them often?", "label": 0}
{"text": "Sorry, probably my fault :( I had to go to ferox for a hard clue this afternoon and ended up clearing most of the worlds lmao", "label": 0}
{"text": "lol I made an appearance on Zybez radio back in the day. Miss that forum.", "label": 0}
{"text": "Yes. Gaining enjoyment explicitly from making others feel bad is bad person behavior.", "label": 0}
{"text": "There was some backend sly stuff going on, for some time Jagex was shutting down all of the paid 3rd party clients except RsBuddy Pro. \n\nThe shareholders of rsbuddy were:\n\nPrevious RsBuddy Owner James Thompson\nPrevious Jagex COO/CFO Riaan Hodgson\nJagex CEO Mark Gerhard", "label": 0}
{"text": "no, they're not. Str increases max hit, attack increases accuracy. Strength is priority #1, attack is only priority when you need a weapon upgrade for increased dps, which is also boosted because of higher strength if you decide to go this route.\n\nDoing all starting at lvl 70 att/str/def will take exponentially longer than str>atk>def", "label": 0}
{"text": "Every Falador knight name is a pun", "label": 0}
{"text": "For many of us, PVM is the best part of OSRS. Raids and high level bosses are most of what I do for fun.", "label": 0}
{"text": "People should start out at scurrious. Barrows is just pray this and hit. Nothing a quest boss can’t teach you.", "label": 0}
{"text": "Beautiful... this is art!", "label": 0}
{"text": "I'm a begger. Got any bonds or cannonballs?", "label": 0}
{"text": "Every day we stray further from Saradomin's light....wait", "label": 0}
{"text": "Hang on, this is confusing.\n\n>I can log on the website with a code\n\nWhat code? Do you receive one by email, or use an authenticator app on your phone to generate a code that changes every minute?\n\n>But when I try to log in using 2fa with Google\n\nI assume this is the one generated by google authenticator, changing every minute. Right? Are you sure that authenticator is associated to your Jagex account? Do you have multiple accounts?\n\n>Neither the code i has previously on one of the accounts nor the jagex codes will work.\n\nDid you not say you could login in the website? What's the difference here?\n\nFinally, do you have your backup codes? They're 10 static codes you generate when you login into your Jagex account on the website.", "label": 0}
{"text": "Still struggling with this month later. I've done 55kc and some times it's a 6food kill but I just got off 2 back to back fights where I ran out a full inv of food\nGear - zaxe, barrows helm and legs, rune body, dragon sq shield, hide boots, rune gloves, hide cape, B-ring and piety and a DDS for spec\nStats 75/81/73 att/str/def\n\nI am doing all the mechanics correctly, preempting tiles, spec at below 100. I understand there are upgrades to do there but surely considering the target demographic for this content this is enough defense. I just had a fight where 2 people finished their kill, made it back through the other 2 moons and couldn't believe I was still in the same blood moon fight\n\nAny tips pls?", "label": 0}
{"text": "I do this too lmao", "label": 0}
{"text": "Correct. The same email I used that I had a confirmation that the account was “successfully imported”", "label": 0}
{"text": "My man", "label": 0}
{"text": "20million gold - you had to pay the person that sniped it on the BMAH 10m for the character with the mount reserved, but then also had to reimburse them for the 10m that they spent on the BMAH for the right to buy the mount", "label": 0}
{"text": "So the other guy is \"0 to 1000\" for calling them eyesores.... But this is also your opinion on splashers?", "label": 0}
{"text": "Yet osb was by far the most popular client, because it was the best by a long shot. Pre runelite the free clients were honestly pretty trash. Runelite was the first to actually compete with equivalent plugins, the devs worked a ton to get it up and running.", "label": 0}
{"text": "Sorry for the dumb questions but you were the one to import it and you had played on it at least once since you imported it?", "label": 0}
{"text": "And before Orion, we had swiftkit.", "label": 0}
{"text": "Idk but I got a weird token from it", "label": 0}
{"text": "Yeah there was shadyness for sure. And just the fact osb was the biggest botting client in rs2 should raise red flags. But it was still the best 3p client for the longest time.", "label": 0}
{"text": "Nightmare and Phosani are already not super rewarding bosses for the required time spent there, on top of that, the useful teleport for it is locked behind a possibly 15+ hour grind just to make getting to the boss easier. The run from Ver Sinhaza is nearly 2 minutes itself and puts you well below 50 run energy even with an active stamina. This also makes the process of using an alt to restock you a little bit lower barrier of entry as you would only need Priest In Peril instead of Sins of the Father to be effective (I understand run energy is being reworked but I still think the process of getting to nightmare could use a little love to make the experience more enjoyable.)", "label": 0}
{"text": "If they would care they could just go to seagulls or something else.", "label": 0}
{"text": "559", "label": 0}
{"text": "OP is some next level beggar lmao", "label": 0}
{"text": "Ignoring fun weapons, quest items and other similar stuff... I gotta go with mud pie. I have never made the item, I have never seen it in anyone's inventory, I have never seen anyone use it and I didn't know it was a weapon until I googled.", "label": 0}
{"text": "Pkers > splashers", "label": 0}
{"text": "Even knowing that i never really thought about this one", "label": 0}
{"text": "It was so good.", "label": 0}
{"text": "That’s the entire point of the tablet…", "label": 0}
{"text": "That's an insanely heavy lineup, I'm jealous. I wanna see Orthodox again so bad", "label": 0}
{"text": "Yes. I watched a video on how to fix it.", "label": 0}
{"text": "That's not necessarily true lol", "label": 0}
{"text": "Osbuddy was in oldschool, not orion. Rsbuddy was a bot client back in the day", "label": 0}
{"text": "Which goes against why ingots as a system were ever added.  \nJagex picks the dumbest fights over the most shit mechanics", "label": 0}
{"text": "[Potion Store layout fix](https://youtu.be/iOlZnzsz54A?si=oQxCo4TAvW97knP8)", "label": 0}
{"text": "bypassing the ingots is a great idea", "label": 0}
{"text": "I’ve got 126 days spent and never hit the nerd timer once. I’m starting to think it a myth", "label": 0}
{"text": "regurgitation is pretty common on this site.", "label": 0}
{"text": "Why would bots splash? You don’t need a script for that bro", "label": 0}
{"text": "Thank you brother ! Much appreciated and yeah I should start switching to tank gear", "label": 0}
{"text": "Staff of fire, Fire tiara, Rainbow scarf, Rainbow jumper. Various other holiday event items.\n\n\nhttps://oldschool.runescape.wiki/w/Wintertodt/Warm_clothing\n\n\n\nOr Clue Hunter set.", "label": 0}
{"text": "Part of the reason for that is that OSB had connections to Jagex that let it bypass some of the red tape other clients had to deal with. It made it hard for others to compete/catch up and the first time one could compete with OSB and hurt their profit, it conveniently was told to shut down...", "label": 0}
{"text": "It is one of those things that always seemed a bit ominous as a kid if you've never tried it. Tons of gear you see comes from it. Yeah it's pray and hit, but people gotta start somewhere", "label": 0}
{"text": "Party room is mostly dead. Most drop parties I see these days are people dropping stuff around the GE. Sometimes you’ll see someone in 302 or 301 rounding up a train of players to take the drop party somewhere a bit more private too. Lots of guilds hold drop parties or giveaways for their members too.\n\nBut the massive Falador party room days are over.", "label": 0}
{"text": "Can you trim my armor while youre at it?", "label": 0}
{"text": "That's me lol(lv 47). You're a menace :p", "label": 0}
{"text": "Very cool! Any others?", "label": 0}
{"text": "Fyi it used to be two steps for most attacks in game. First step is a roll to determine if it hits. The second is a roll to determine damage (between 0 and maximum). So a 0 damage 'hit' is possible.\n\n\nRecently this was changed for players, so now you do 1 damage on what would have previously been a 0 damage hit. I guess monsters weren't changed so they can still 'hit' a 0.", "label": 0}
{"text": "Doing gods work", "label": 0}
{"text": "I'm guessing an image didn't post here?", "label": 0}
{"text": "No.", "label": 0}
{"text": "Git gud", "label": 0}
{"text": "And that's the entire point of this conversation.", "label": 0}
{"text": "Seagulls can only hit 0's. Splashing is by no means fast xp, but that's not the point. Purely for the long AFK.", "label": 0}
{"text": "I can see not wanting to lose money over the ge tax when selling/buying your items back", "label": 0}
{"text": "Nice", "label": 0}
{"text": "If you don't like it, they changed permanent IM, so that everyone can do it! Might be worth a shot for you", "label": 0}
{"text": "Yea… this is totally why I haven’t started my nightmare grind. Mhm.", "label": 0}
{"text": "It doesn't count unless the only numbers are 6 and 9 and they must be paired together in that order.", "label": 0}
{"text": "Don’t forget to play with the bottomless bucket at the same time, that’s the key to finishing Hespori…", "label": 0}
{"text": "forestry didn't die because people became less interested over time, it died because you jmods took it out back and unloaded a full mag into its lifeless updated corpse.", "label": 0}
{"text": "He dropped it", "label": 0}
{"text": "It's at least part! Lol.", "label": 0}
{"text": "We'll trim all your armor and double the amount you have!", "label": 0}
{"text": "It used to be that way in practice.\n\nDuring COVID Reddit became crossed over with mainstream social media and people started coming here from Insta, TikTok etc \n\nThen Reddit became what it is today, people vote based on opinion, and use the system as you would a like system.\n\nIt's also why 99% of content on the app today is just bots reposting TikTok content.\n\nNot to be old and miserable, but those were the good old days.", "label": 0}
{"text": "https://preview.redd.it/pf8yasoozzwd1.jpeg?width=1284&format=pjpg&auto=webp&s=2899088496651a743e261a1c056c19ad5aeb394c", "label": 0}
{"text": "https://preview.redd.it/mft9qq3nzzwd1.png?width=562&format=png&auto=webp&s=b7b5585228902e747ce2c56178b24817e99eef93\n\nthats tough", "label": 0}
{"text": "This makes sense and they should also buff the tablet Tele", "label": 0}
