{"text": "Ohhhh I didn’t know that!!! Imma definitely add that to my consideration list for a new tablet!!\nThank you", "label": 0}
{"text": "What's strange is they are updating the mid core and efficiency core but avoiding the big core from the latest  arm offering. How much work effort they are saving by porting X4 vs implementing the latest big core. Moreover the G4 already served as a stop gap chip.", "label": 0}
{"text": "Sorry, atbest10, your post has been automatically removed because it links to the mobile version of the site. Please delete and resubmit from the standard version of the site (usually just requires deleting the \"m.\" from the beginning of the link).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry /u/atbest10, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "The players are from countries around the world...", "label": 0}
{"text": "Someone was saying that Google was also working with QC for a RISC-V chip for watches.\n\nWhich of course makes sense -- embedded is where RISC-V has already been making inroads in real products. Western Digital switched to it for some/all of their controller chips a few years ago. And you don't need the same performance level in a wearable that you do in a phone or personal computer.", "label": 0}
{"text": "Then 3 years after it got merged, a new PM will split the Tasks app back out to vie for a promotion", "label": 0}
{"text": "When the dynamic island came out I saw hella people trying to replicate it so idk what you're on about lol.", "label": 0}
{"text": "oh I know, I just wish there was more money being spent on that tech so it wasn't as shit. Until then, I'll try to buy phones with those kinds of camera", "label": 0}
{"text": "I don't like the under-screen ones, they still are kind of visible in the pixels, and the quality suffers.\n\nBut I LOVED my phone with the popup camera.", "label": 0}
{"text": "It's actually interesting what we consider an old phone, but yeah based the logic that I implemented to my code structure on my tests I'm sure that it will work on every android phone. Actually just make sure the requirements are satisfied (few points 1.5 minutes of tapping), plug you device using your cable to your PC and enjoy.", "label": 0}
{"text": "I hate heads up view we have now. Liked the earlier ticker system/breathing notifications from Holo days.", "label": 0}
{"text": "A few people may have mentioned it, but the general consensus between a lot of folks was that it was pretty cool.", "label": 0}
{"text": "Forgot vivo used to use exynos for some of their phones lol", "label": 0}
{"text": "I kind of agree. I'm not sure what it's like on other devices (I tend to stick with Samsung). Samsung's pop ups are pretty good but I can't deny I love the idea of the old notification ticker coming back!", "label": 0}
{"text": "I hate Knox efuse. Remember when it was introduced in S4 via an ota update and that was the beginning of the end.", "label": 0}
{"text": "quite similar to the notification feature on some custom roms I tried on android 4.4; It will display the notification content in the status bar.", "label": 0}
{"text": "You think androids will imitate Apple's copy of Sony's dedicated camera button that's been a thing since the Xperia X5 from 2015?\n\nYou could be right.", "label": 0}
{"text": "Shitty title tbh\n\n>Android 12 added an API that lets dialer apps show the duration of an ongoing call in a status bar chip a full year before Apple introduced its Dynamic Island feature\n\nBut clarified in the article. 'Chips' have been around for years but only really in system apps like phone and duo I think? Now it's being opened up to more apps including third party. \n\nOne click back to a timer, video call, phone call, ect is really useful. One less swipe on the notification bar and such", "label": 0}
{"text": "Saved you a click:\n\n$49.99, Releases Nov 29, For phones between 100mm and 170mm, Bluetooth only. No USB-C, Android only, 350mAh battery, 236g\n\nI think it’s dumb. Why no USB-C when you put your phone in it anyways? And why Android only? Another thing to care about keeping it charged. Nah thx.", "label": 0}
{"text": "Yeah its gotten better for sure. Had a OnePlus 9 Pro before this one and it had aggressive battery management as well, didn't give me any trouble though.\n\nOn this phone I had to do a little tweaking but that was a few minutes of work max.", "label": 0}
{"text": "didn't knew that sony had same thing", "label": 0}
{"text": "Who wrote the title? This sounds more like opening up whatever they use for the phone call chip than anything related to Apple's Dynamic Island", "label": 0}
{"text": "> The Pixel 9's strengths include good photo quality, long runtimes, a super bright OLED display and extensive software support. We also really like its new ultrasound fingerprint sensor. These are all virtues that a Galaxy S24 also has, but the Samsung phone offers the better total package and additionally features a high-end SoC. Especially the Tensor G4 inside the Pixel 9 is in no way superior to its Qualcomm and MediaTek rivals. In addition, the Pixel 9's slow charging speeds are anything but a reason to purchase the phone.", "label": 0}
{"text": "I'm not sure stereo speakers are necessarily a killer feature, I think most consumers assume it would have them and maybe only notice the speakers \"suck\" compared to their old phone.", "label": 0}
{"text": "I mean typical of Android features right? I know it's up to developers but this kind of model seems to result in endless delays for support for an actually useful feature.", "label": 0}
{"text": "Looks to me more like moving the toast popup (which we've had, like, forever) into the status bar.", "label": 0}
{"text": ">  our status bar shows everything\n\nThe ticker was a lot better back in the day. The status bar today is a huge regression from what it was back in the ICS days.", "label": 0}
{"text": "Am I crazy to expect the Galaxy A56 to hit $500 this time around? Anything less would be a steal since a processor of this quality would be absolutely worth $450.", "label": 0}
{"text": "What's the difference between that and what Samsung has been doing for years with their popup notifications.", "label": 0}
{"text": "Just very likely with snapdragon 8 elite. Just \"likely\", hope that i work in samsung", "label": 0}
{"text": "Anyone seen it there keeping the IR blaster ?", "label": 0}
{"text": "I’ll tell you I could care less that I lose that screen real estate for 10 seconds. I do care that it feels underbaked still and relatively few apps (eg airlines, cab rides, sports) use it well. I also don’t like how cumbersome it is to swap between the floating widget icons and how swiping across the island results in likely smudging your front facing cam at the same time", "label": 0}
{"text": "I didn't know AV1 was from the VLC people, hell yeah France!", "label": 0}
{"text": "Feature trucle down Apple ‐> Chinese Android OEMs -> Samsung -> Pixel...", "label": 0}
{"text": "Let me dynamically disable this shit", "label": 0}
{"text": "It's not like Dynamic Island has a lot of third party support either.", "label": 0}
{"text": "I made this script to automate the patching process with magisk.", "label": 0}
{"text": "I'll never understand how the pop-up camera went away. I had a Umidigi phone with one. Cheap phone. The pop-up camera worked without fail for over 5 years until the battery finally gave up. To this day, if I could have that phone with 5G I would be perfectly happy.", "label": 0}
{"text": "Honestly 50$ for it ain't so bad. If it will be better than the Gamesir G8+ this really has potential ", "label": 0}
{"text": "I'm not talking about the popup killing your screen estate. The whole pill itself is already taking more space than the notch due to it now being lower compared to the notch sitting right at the top. This isn't sth that will stop after 5 seconds cause the pill is permanent", "label": 0}
{"text": "that was not even close to the button in apple.", "label": 0}
{"text": "Correction it’s a Moto G Play", "label": 0}
{"text": "It was a two stage camera button on the side of the device. Apple's button is…a two stage camera button on the side of the device.", "label": 0}
{"text": "I have a cheap Chinese controller similar in design to this. It also doesn't have USB-c use and I'm so happy for that. I bought it 5 years ago and I don't have the same phone that I had then. The new phone would not be sitting in the center of the controller if it used usb-c. The same is true for my 7in tab USB would mean that it can't be used in portrait anymore.\n\nNo comment on the Android only but I suspect they will be able to add iOS compatibility with future updates.", "label": 0}
{"text": "It's not. But the VLC people made an amazing library for it that is so good even the creators of AV1 are using it where hardware functionality doesn't exist.", "label": 0}
{"text": "My bad thank you for the precision's!", "label": 0}
{"text": "It’s bad design from a OEM standpoint\n\nIt’s an extra failure point and that means possible warranty service", "label": 0}
{"text": "Sorry /u/Ok-Zookeepergame1297, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, Ok-Zookeepergame1297, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": ">General theme is non pro pixel has moved into flagship pricing but hasnt really moved up as a phone except more ram.\n\nI mean I would say outside of the camera that is pretty much the Pixel in a nutshell. Take the corpse of the Nexus, raise the prices, keep the quality, charge Samsung and Apple prices, and claim it is a flagship.\n\nJust like the Nexus before, Pixels have always been a really good deal in that $300-$600 rage. $800 or more and there are better quality options that have most of the same features and more.", "label": 0}
{"text": "Ok, then the best solution would be a controller with an integrated battery, which doesn’t power the controller but acts like a powerbank. You may charge it or you may not. Doesn’t impact the experience.", "label": 0}
{"text": "They'll just be 15 minutes late due to the OS dozing the app.", "label": 0}
{"text": "ITT: People who didn't open up the article and view [the image](https://www.androidauthority.com/wp-content/uploads/2024/10/Android_16_rich_ongoing_notifications_demo_hero.jpg.webp).\n\nThey're not making a dynamic island. They're just experimenting by moving notification previews to the status bar.", "label": 0}
{"text": "53% higher performance at 30ºc ambient. Insane generational improvements.", "label": 0}
{"text": "Counterpoint on performance: https://youtu.be/FoXIWkqK-t8?t=178\n\nThe video is done with an 8GB RAM variant of the Exynos 1330.", "label": 0}
{"text": "There's nothing you need to change in settings.", "label": 0}
{"text": "wondering the same. Reading it seems like it won't work cause it needs the find my network from your phone? Could be wrong.", "label": 0}
{"text": "Other than the blue pretty boring on the ultra as usual. Perhaps the online exclusive colors will be more interesting, but I'm not counting on it.", "label": 0}
{"text": "Lol imagine one notification after the other popping up when you unlock your phone.. thank god for adb commands", "label": 0}
{"text": "Manufactured e-waste", "label": 0}
{"text": "How did Android go from being completely different to iOS, to hurriedly implementing any bits of design they do", "label": 0}
{"text": "Jokes on you, it won't even have first party support either.", "label": 0}
{"text": "I just want a good sports app to pin scores. Crazy that apples own app doesn’t do this.", "label": 0}
{"text": "Sorry, Straight_Fan_8134, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, Straight_Fan_8134, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": ">**Codec**  \nHEVC (H.265), H.264, VP9, VP8\n\nIt's kinda mind-boggling that their cheaper chipsets still don't support AV1.", "label": 0}
{"text": "Stop calling it small. The iPhone mini and SE are small. The Palm Phone is small. The Pixel 9 is not. ", "label": 0}
{"text": "I guess that's the problem with suddenly finding your footing and releasing so many banger processors in such a short amount of time.", "label": 0}
{"text": "My phone has offcenter usb port, so it flaps down, if you have usb on the right", "label": 0}
{"text": "I've just seen my friend's recently formated a53 and it was really laggy, doing anything in the UI would drop a lot of frames", "label": 0}
{"text": "Jesus fucking Christ, Google sucks so much ass at everything it attempts.", "label": 0}
{"text": "The status bar chip API predated Apple's Dynamic Island a year before, as mentioned in the article. ", "label": 0}
{"text": "Is this good or bad for us buyers? Does the exynos series have the same issues from prior years?", "label": 0}
{"text": "I disagree. It's entirely redundant and the Calendar app has even more features. No need to have 2 different apps with the same thing. ", "label": 0}
{"text": "I think Apple is just a lot better than Google at enforcing/encouraging new features to be implemented. \n\nJust take Material You icons. I believe they were introduced back in Android 12? Maybe 13. Still so so so many apps (big ones too, like plenty of Microsoft apps) that don't support it. I can promise you that if it was on iOS, Apple would've had a deadline for when all new app releases would need to support it or they wouldn't be getting approved.\n\nApple ruling with an iron fist is debatable normally, but in situations like this it's a big win for the consumer.", "label": 0}
{"text": "Bluetooth only but only works in Android? Make it make sense", "label": 0}
{"text": "That’s another $49.99.", "label": 0}
{"text": "Oh I get that. I have iOS 18 and you can turn on themed icons. Granted I don't like the look but it's universal. Bam. Done in 1 OS rev. The entire Material You theming still just looks incomplete even though we're 3 years into it now. Icons are beta still IIRC.", "label": 0}
{"text": "Don't you have to pay for the MFi cert?", "label": 0}
{"text": "How exactly is this a banger SoC? It's slower than all of the competition. It's only 10% faster than last year's 1480... Am I missing something?", "label": 0}
{"text": "No issues, but the A55 didn't launch in the US.", "label": 0}
{"text": "Okay so the verge article is bullshit as always.\nDoes it support rumble? I'm not interested if it doesn't. Also, \"Android only\" means no IOS, but do they mean only Android phones? So it would work on switch, pc etc? Does it support motion on the switch?\n\nHonestly, a fucking child could write a better summary of the controller than the Verge.", "label": 0}
{"text": "Ya the ticker notification. I miss it. The heads up notifications block a huge chunk of screen and are pointless for 80% of the notifications.\n\n\nI wish the ticker still existed.", "label": 0}
{"text": "#### Hey there Straight_Fan_8134, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Probably some sort of payment, 30% of the revenue generated per sale of the controller probably.", "label": 0}
{"text": "I disagree with the other commenter that reliability was the issue, sure it's an extra failure point but so are camera buttons, or curved displays, and they still exist.\n\nHowever they take up more space, thus adding weight and reducing the space for other internals like battery, make waterproofing harder (not impossible mind you), add extra cost. \n\nConsumers clearly don't care so it just isn't worth the cost and possible tradeoffs to manufacturers, the only upside other than lack of a notch/punchhole is potentially better FF camera on Asus Zenfones or something like Samsung A80.", "label": 0}
{"text": "Bcuz fuck apple, that's why. \n\nThis is /r/Android after all.", "label": 0}
{"text": "Damn. \n\nI guess it makes sense business wise, since they could probably make unique looking controllers for each platform.", "label": 0}
{"text": "Yeah even if the space isn't big enough for it to be super practical, just having the text scroll makes it more stylish. It's just more fun. So much UI these days is so flat and sterile, having something with some extra spice creates a more memorable experience imo", "label": 0}
{"text": "Historically, this is a phone and the  9 Pro XL and others are phablets", "label": 0}
{"text": "It does", "label": 0}
{"text": "4 years of update Support and ill Sell my 15 pro Max ", "label": 0}
{"text": "Prob would be if they didn't move the clock to the left side for no fucking reason.", "label": 0}
{"text": "The 'brief\" style notification on Samsung phones is fantastic. Thin bar that doesn't block a forth of the screen.", "label": 0}
{"text": "I wholeheartedly agree. I liked the flat design of the Lolipop days, but man it's gotten so boring! I'm ready for some change and maybe some depth!", "label": 0}
{"text": "Thanks apple for that.\nI can bet that there is some kind of limitations made from them", "label": 0}
{"text": "I absolutely utterly hated the notch at first but now that it's hidden in the status bar, I don't notice it\n\nIt's annoying as hell in an application that forces wide screen", "label": 0}
{"text": "Nope. Anything using Apples architecture is fairly useless on android.\n\nThe best I've been able to find is to set up a tracker on an iCloud account, then link it to xfi tracker on the Android.\n\nYou can't get real time tracking or proximity like you would on your Apple phone, but you can get \"last known position\" which is good enough for my needs.\n\nI guess that means Airtag is probably the best thing to go with. Which sucks.", "label": 0}
{"text": "Funnily enough, for time critical notifications like calendar appointments and Tasks reminders my OnePlus actually sends them early. It's like it knows \"who tf knows if the notification will come through on time\" so it pushes it early", "label": 0}
{"text": "Only if you look at the phones by screen size and not their overall dimensions \n\nThe S24 Ultra and OP12 are nearly as big as a nexus 7 screen size wise, but since they don't have huge bezels, you can actually stuff them into your pocket", "label": 0}
{"text": "Which phones are supported?", "label": 0}
{"text": "Shit dawg I checked right before football season and it didn’t. That’s new. Thanks!", "label": 0}
{"text": "8 Elite is really elite. D9400 is also good. I wish Samsung would release a no compromise phone like what Xiaomi will do with 15 ultra.", "label": 0}
{"text": "No.", "label": 0}
{"text": "If you compare this to the [Oneplus 13 review](https://www.youtube.com/watch?v=GkJCWncZbJc), the Xiaomi 15 Pro uses ~9% less power while rendering ~14% more pixels with the same chip (ignoring differences in power from other components)", "label": 0}
{"text": "I already have a steam deck, switch, modded 3ds, and anbernic rg35xx-h for emulators...but I am tempted to get this lol...", "label": 0}
{"text": "Still mad about this, and the notification bar elements being pushed in for no reason, and the notification icons being arbitrarily limited... I specifically choose phones without notches and I still have to suffer because somehow Android isn't smart enough to figure that out", "label": 0}
{"text": "> no fucking reason\n\n\nBalance. Instead of stuffing everything in the same corner it's now spread out over the entire status bar. \n\n\nAnd even if the clock was still on the right side there still wouldn't be enough space on the left side of the camera to preview a sizeable chunk of a message. ", "label": 0}
{"text": "This shouldn't be a thing in the first place.\nLike what is a photo at this point?", "label": 0}
{"text": "I have samsung note 10 that doesn't get updated. Dose that men i don't get patche ?", "label": 0}
{"text": "Adb commands for what exactly?", "label": 0}
{"text": "Yeah they'll display as long as the app wants it to be there, like the phone call chip thing that appears in the top already", "label": 0}
{"text": "I like the ticker too but it won't work well on phones that have camera holes or notches in the middle of the status bar, which many of the current ones do.", "label": 0}
{"text": "You can take this exact same argument for all the other stuff that changed for the worse over the years.", "label": 0}
{"text": "#### Hey there ninjaspy123, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "It's the smallest you can get right now", "label": 0}
{"text": "What exactly is all of the competition in the 400$ category with a comparable chip?", "label": 0}
{"text": "I literally mentioned two smaller ones that are in production right now, and one of them runs Android", "label": 0}
{"text": "The Mac OS used a translation layer to transcode x86 instructions to ARM. That is never going to happen on iOS nor is there any reason to even justify it as Apple is very happy with their relationship with ARM.", "label": 0}
{"text": "It's larger than the S24 and 30 grams heavier.", "label": 0}
{"text": "Especially when it's royalty free.", "label": 0}
{"text": "Hall Effect joysticks needs to become the standard ASAP.", "label": 0}
{"text": "Literally every sponsored review (yes, that's a real thing in China) mentions how similar it is to the iPhone in the title. Apparently that's in the talking points Oppo sent to reviewers. Not that copying Apple is necessarily a bad thing, but I have no idea why they are so proud of that and want to advertise it so badly.", "label": 0}
{"text": "Got so offended over his mini phones", "label": 0}
{"text": "Tired of helping reddittors with reading comprehension", "label": 0}
{"text": "Honestly I think it's 8bitdo doing it. There's probably issues with Apple too, but the way they handle their other controls is annoying. One *specifically* doesn't work with the Switch, and you have to buy that specific one which is almost always more expensive. Why? Idk, but why not make it so it works on every console? I'd pay more if I can use it on more devices.", "label": 0}
{"text": "I got the 8bitdo ultimate PC controller for 40$. I don't think quality wise any other wireless controller is beating it. 8bitdo has good value for money.", "label": 0}
{"text": "You won't. It EOL(End of life)", "label": 0}
{"text": "Bluetooth? I'll pass.", "label": 0}
{"text": "Bluetooth controller latency is terrible and variable on Android. iOS actually addressed this in 18 but it's still bad on Android. Once you hook up Bluetooth headphones both become unusable.", "label": 0}
{"text": "Well sure but you’re an end user you wouldn’t see it\n\nIt shows up at the manufacturing end since they have to do warranty calls, and a moving part is a failure point over a non-moving one, just how it goes", "label": 0}
{"text": "I know how many batteries, screens, and even rear cameras that didn't outlive that pop-up camera.", "label": 0}
{"text": "Sponsored reviews are a real thing in the US to…", "label": 0}
{"text": "It’s not at all the same thing. This is for ongoing things that you want to keep an eye on like timers, sports scores, or uber ride pickup, etc. Not for notifications like text messages.", "label": 0}
{"text": "Welp, I see that now.\n\nWell in that case, yes, that is rather useful. Not new, but useful.", "label": 0}
{"text": "Touch grass bro, it’s not a big deal", "label": 0}
{"text": "I had an Android Go phone. Even answering a phone and showing the keyboard are laggy.", "label": 0}
{"text": "Sorry /u/SpoonBendingChampion, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "There adding an ai tool in oxygen is 15 that will reduce or get rid of lens flare so that may help with that issue in particular", "label": 0}
{"text": "But did you buy the Sony phone or just talking?", "label": 0}
{"text": "Google's decision in hardware doesn't make sense.", "label": 0}
{"text": "What's the obvious reason besides a clear competitive advantage by the first mover?", "label": 0}
{"text": "One thing that wasn't mentioned that I was hoping to see is a desktop mode. In hoping it's offered on the next phones as I love samsung dex and one of the things keeping me in the Samsung ecosystem", "label": 0}
{"text": "Not just Chinese phones. My s24 was HORRIBLE for this but maybe due to only have 8 gigs of RAM and Samsung's ui being pretty bloated and heavy. A few updates have helped but YouTube almost everytime needs to reload if I swape out of it", "label": 0}
{"text": "That's my question...I love Samsung dex and use it a lot but I'd jump ship just for even a basic desktop mode", "label": 0}
{"text": "My 9 still stutters on scrolling. There should be enough power since g4 is better than d9000 which didnt stutter. ", "label": 0}
{"text": "There should be a final team that has the say so on what gets released so there is a coherent set of apps. \n\nI miss being able to search for businesses near me in the phone app. Now I have to find it in the maps app and press the phone button in there.  Things are all turned around.\n\nI am surprised they haven't killed Voice. I wouldn't be surprised if it's only kept alive because there's a wiretap on a bunch of people using it.", "label": 0}
{"text": "It's not a joke that software optimization can be so critical to power efficiency.", "label": 0}
{"text": "Won't it be patched by Google via Google Play System Updates?", "label": 0}
{"text": "It melts a bit easily though.\n\nI left mine behind my laptop for a few hours and came back to a tacky mess.\n\nIt did harden again though so it's just fugly now.", "label": 0}
{"text": "I usually get black, but with cases, the color doesn't even usually matter for me.", "label": 0}
{"text": "Ern most console users don't even no what hall effect analog key is. The obvious reason here is when gamepad breaks those who stick with OEM controllers will keep buying them in every year. Couple that with the number of users they have it's a profit worth millions", "label": 0}
{"text": "Great plan, just requires patience", "label": 0}
{"text": "Why can't awe have wired ones with hall effect?", "label": 0}
{"text": "Themed icons are kind of a UX nightmare. Honestly I felt the same thing about adaptive icons instead of the freeform shapes we used to have in Android. I legitimately have trouble distinguishing all of Google's app icons at a glance now. Uniformity may look more appealing visually, but it makes it harder to find the app you're looking for.", "label": 0}
{"text": "That's TM Roh", "label": 0}
{"text": "So we're just jumping straight past A710 & A715 now", "label": 0}
{"text": "Just like how their tablets used to offer OLED and quad speakers at a $400 price point (Tab S5e.) Five years later and you have to spend double that for those same features.", "label": 0}
{"text": "Calm down, this is a rumour.", "label": 0}
{"text": "Theyve been doing this the last few years right? One gen behind iphone", "label": 0}
{"text": "Where from?", "label": 0}
{"text": "Yet another reason to keep your old phone. Tech seems to only go backwards nowadays, despite us paying more and more for it.", "label": 0}
{"text": "#### Hey there Least-Ad3900, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Each day, my decision to remain with S23 Ultra for another year becomes more n more valid", "label": 0}
{"text": "And by replacing the settings app with AI data farming nonsense", "label": 0}
{"text": "Eyeroll emoji", "label": 0}
{"text": "Are you serious, m8?", "label": 0}
{"text": "When he means extra, it relates to the retail price steadily growing while the new features and some even disappear. \n\nIt’s not about doing better than Apple, it’s about being fairly priced on their products.", "label": 0}
{"text": "What the actual fuck.\n\nBut this kind of dicking around is exactly why I cannot use Google services for stuff like this.", "label": 0}
{"text": "Those are also gigantic compared to my old startac.", "label": 0}
{"text": "I hope it's the good kind of Xiaomi optimization and not the \"I need to load the homescreen if I leave it a few minutes\" kind of optimization.", "label": 0}
{"text": "According to sources even the Ultra will not use the latest screen tech.", "label": 0}
{"text": "Yes the brand that doesnt discount hold its value, because they dont discount. The brand that has all the discounts and promo offers cant hold its value because the new price keeps coming down", "label": 0}
{"text": "Totally agree.", "label": 0}
{"text": "Sorry /u/qm623, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I do kinda my old flip phones. My last one was functional for almost 10 years, until the network stopped supporting it. That was my one-man protest of phones becoming more than I wanted them for. After that I had a Moto G4 Play, which was great. Perfect size for my hand considering it had a grippy back texture. It was light and thin, and had a removable battery. That's too much to ask these days. Somehow whatever I really love about a phone, they always take it away in the next generation. It can be quite frustrating.", "label": 0}
{"text": "Wow is this legit?\n\nEven Huawei?\n\n\nOf cause in assuming it comes with the same problems associated with root like banking apps not working?", "label": 0}
{"text": "This after they apologies for lack of innovation.\n\nIronic", "label": 0}
{"text": "Even in China, Apple has the highest brand value, and they don't want it to grow like in South Korea, where every Gen Z and Alpha only wants an iPhone. Despite its software limitations, people feel justified in spending so much on an iPhone without question. So, if Oppo manages to present itself along the same lines, they can start quoting Apple's prices soon, and that's the end game, in my opinion.", "label": 0}
{"text": "Fyi, the black ring around the front facing camera is only when it's in use (it can be bugged sometimes and stay enlarged tho), otherwise it's a regular side I believe", "label": 0}
{"text": "Looking at the comments, they have been doing this already with previous models, no?", "label": 0}
{"text": "It has a basic desktop mode which you can enhance via open source Task Bar app. It supports the experimental desktop mode introduced with Android 10. Search about it.", "label": 0}
{"text": "Its the same with the Sensors, still using the HP2, others get the HP9. It's a pure joke of Samsung.", "label": 0}
{"text": "Yeah I really wish that was still a thing. But nope, only shitty changes. No options allowed.", "label": 0}
{"text": "On the US", "label": 0}
{"text": "Ummm .. the answer is brightness and anti reflection. But I think you mistook my point", "label": 0}
{"text": "iPhone", "label": 0}
{"text": "Because you know have 2/3 of the Pill removed by simply switching to TouchIF", "label": 0}
{"text": "Yeah, most people don't understand business units like Samsung. Each on if effectively their own company. Samsung Mobile doesn't get some deal because they are both \"Samsung\". They have to buy the displays from Samsung Display like everyone else, and they might get outbid for thew newer stuff, or they can just penny pinch and buy what's cheapest.\n\nWe also have to remember that the SD Elite chips are likely at a huge premium for this gen, so they are probably trying to save costs where they can (which again, they don't pass on, they want  their huge profit margins to stay the same).", "label": 0}
{"text": "that's true, I'm using the calling notification constantly.\n\nwondering how it will handle the chips if you're in a call, listening to music and have a timer running.", "label": 0}
{"text": "Imagine being the leading mobile display manufacturer and *not* putting your own latest display tech in your own flagship phone series.\n\n\nNo wonder Samsung leaders are angry at their mobile division. Past 5 years have been boring and uninspired. Zero innovation, just small refinements. Only interesting thing to come out was the anti-reflective display coating on the S24U.", "label": 0}
{"text": "IMO.. this works better for notifications of ongoing activities, like a phone/video call or music playback. I feel like a pill like this for music is MUCH NEEDED, instead of having to pull down the notification shade.\n\nBut for static notifications, the current toast notification system is better.", "label": 0}
{"text": "#### Hey there Mystical_PumpkinxD, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Very intelligent way to solve the Gaussian blur lag. I love those kinds of clever optimisations.", "label": 0}
{"text": "Even in Europe S24 is €600 in most Countries that's cheaper than almost all flagships released last year. I understand if someone complain about ultra cutting costs but plain model has always been cheaper nowadays. ", "label": 0}
{"text": "Who's ready for all the display grain posts?", "label": 0}
{"text": "Blame it on Samsung Foundry", "label": 0}
{"text": "S21 Ultra: M11\n\niPhone 13 Pro: M11\n\nS22 Ultra: M11\n\niPhone 14/14+: M11, iPhone 14 Pro/Pro Max: M12\n\nS23 Ultra: M11s\n\niPhone 15/15+/15 Pro/Pro Max: M12\n\nS24/S24+/S24 Ultra: M13\n\niPhone 16/16+: M12, iPhone 16 Pro/Pro Max: M14", "label": 0}
{"text": "Apple used M12 in the iPhone 15 Pro and 15 Pro Max again as it did in the iPhone 14 Pro and Pro Max, and Samsung used M13 in the S24 series.", "label": 0}
{"text": "No chance at all.", "label": 0}
{"text": "Sure, but my phone rarely lasts the full day so I really notice the charging when I charge during the day.", "label": 0}
{"text": "Uses M12, so even further behind.", "label": 0}
{"text": "Meanwhile Xiaomi's even cheaper T series shipping with 4000nit Dolby Vision displays...", "label": 0}
{"text": "P9P, no issues here. Kind of amazed, I've had several Pixels (and the original Nexus line) but this is the first one there's no real issue or problem for me (mostly thinking about stuttering/random lag/UI going bonkers).", "label": 0}
{"text": "Moved to iphone again after getting back to android, and it seems like the right decision. Samsung is only the main competitor to apple at least in the eyes of general consumers, and they are cheaping out on essentials.", "label": 0}
{"text": "Don't spread these fucking lies. Samsung always used their best and newest displays on their own phones while others got older ones.", "label": 0}
{"text": "The Galaxy S21 and S21+ was the first year they downgraded the screen resolution to 1080p. They dropped the price from $999 to $799 (and $1199 to $999 for the plus) compared to the S20. From everything I remember, we lost the microSD slot, we downgraded resolution from 1440p to 1080p, dropped RAM from 12GB to 8GB, and (arguably a good thing) went to completely flat displays instead of the 2.5D edges. \n\n\nThe base model S phones have been pretty stagnant since then. It took until the S24+ to get the screen resolution and RAM back. ", "label": 0}
{"text": "There has been a huge campaign in Finland where you get 400€ off by bringing ANY old phone in return and you also get on top of that what the old phone was actually valued of.\n\nSo I just traded my Pixel 6 and got Pixel 9 256GB for 500€ and so far I have been loving it. Haven't found anything to complain so far.", "label": 0}
{"text": "I had the first Xperia, then the Z5C that I lost in the snow. I've never been able to find a phone that was as confortable as this one. \n\nI then bought 2 Z3c because I'm an idiot and had a very bad 2/3 years where I kept breaking them. Both have broken screens but I will just try to fix them myself (tried to give to a friend and the fix was pretty bad). \nThen I bought a X performance from a seller from China, I'm pretty sure it was a fake one as it had huge software issues. Like turning off on its own. Pretty sad that Sony stopped the compacts, I loved them.", "label": 0}
{"text": "HP2> HP9", "label": 0}
{"text": "Outside of China, and maybe Japan, Samsung is seen as THE Apple’s rival out of all Android manufacturers. Even people who don’t like Samsung would often group Apple and Samsung as “the mainstream smartphone brands”. I think Oppo wants some of that status too.", "label": 0}
{"text": "Android 15 resolved any stuttering for me on my 8 Pro. It was only on some apps before, like Discord, but it's fluid now. I heard the official Reddit app was pretty terrible but I don't use it. ", "label": 0}
{"text": "8 Elite seems like the best chip since 8gen2 and is even better than that... Damn.", "label": 0}
{"text": "But the iPhone 16 got the M14 displays and the news above says the S25 will get the M13?", "label": 0}
{"text": "MSRP says one thing, but I actually haven't seen a significant increase in street prices since the S10 era. I've been able to upgrade to the newest S flagship for ~200€ every year basically, and even if I had to buy them outright I'd look at anything between 600€ (S24) and 900€ (S24U), which is 50% less than what Apple charges here", "label": 0}
{"text": "It's not 1 feature:\n\nAndroid 4.3 disabled apps from toggling aeroplane mode. \n\n6 took away cache clear from settings.\n\n8 made it so apps Can't enable WiFi while in aeroplane mode, 8.1 requires location on for WiFi stuff. \n\n10 ruined /android/data and also introduced Scoped Storage\n\n11 brought Phantom process killer\n\n12 took away overscan and WiFi tile\n\n14 made it a pain for certain features relating to automation\n\n15 has ruined sideloading", "label": 0}
{"text": "> slow charging speeds are anything but a reason to purchase \n\nThe prose is so weird. \n\n\"Anything but a reason.\"\n\nBad thing is not a reason to purchase? What? This is some lazy, space-filing mumbo jumbo.", "label": 0}
{"text": "inflation", "label": 0}
{"text": "haha hasn’t been always been true. since the iphone 14 pro apple has been getting better displays. pixel 9 pro display is better than s24 ultra.", "label": 0}
{"text": "Oh man, I asked for this exact product like four years ago. Now I have a Steam Deck as my ultimate emulator device, but this is still great for those who want to use their android phone.", "label": 0}
{"text": "That's not inflation.", "label": 0}
{"text": "the iPhone 14 Pro (Max) got M12 while the S22 series got M11 and the S23 series got M11s but the iPhone 15 Pro (Max) got M12 again while the S24 series got M13. So neither Apple nor Samsung always adopt the latest OLED material set.", "label": 0}
{"text": "Neither Samsung nor Apple always uses the latest OLED material set.", "label": 0}
{"text": "We still will have anti reflection which is better tech than the whatever newest oled panel will be lmao", "label": 0}
{"text": "Ok now optimize older flagships", "label": 0}
{"text": "Plenty of comments in this thread acting like there's only Samsung or iPhone, no other options, when there are loads of Android alternatives like Xiaomi, OnePlus etc.", "label": 0}
{"text": "Surgeflation", "label": 0}
{"text": "10% not 200%", "label": 0}
{"text": "Why it's not flagship? ", "label": 0}
{"text": "It's a completely different phone, with a subpar camera system, small battery and a worse/smaller screen? And no pen.", "label": 0}
{"text": "All things you mentioned don't make flagship phone though, for years S series don't have S pen does that means they were not flagship? Camera is not good as ultra but still will destroy any midrange, display size and battery also don't define flagship phone, for years Flagship had worse battery than midrange. ", "label": 0}
{"text": "? Lower than xiaomi did half a decade ago", "label": 0}
{"text": "What defines a flagship then in your opinion, if not those things? The name, or?", "label": 0}
{"text": "If u focus on non tech users, should make a gui root manager apk with simple allow/deny buttons and a app lock unlike magisk and ksu", "label": 0}
{"text": "Most of the improvements here seem to be regarding HyperOS 2.0 so hopefully older flagships get better too.", "label": 0}
{"text": "Poco, Oneplus, Realme and Vivo give you 8 gen 2/8s gen 3/Dmensity 8300 ultra in this price range, which are way better socs.", "label": 0}
{"text": "You can have more than 1 flagship in niche products, like Fold 6 is flagship in foldable devices, S24 is flagship in compact device. It's best phone from Samsung in small form factor.\n\n\nThe main feature which make phone a flagship or not is Soc used, if phone has best available soc it's a flagship, if it cut features you may see people call them budget flagship. Samsung has other features which separate flagship and other midrange phones like Samsung Dex, Samsung AI etc and all of them you will find in base S24. ", "label": 0}
{"text": "Yay S25 will be worse than s24. Samsung is going downhill, fast.", "label": 0}
{"text": "Can grain be warrantied?", "label": 0}
{"text": "I don't think it's just a downclocked version. There are cache differences as well iirc", "label": 0}
{"text": "Is it slow like the pixel 8 50MP though?", "label": 0}
{"text": "#### Hey there Apophiszx, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "When you look at reportings of public companies and see profit increases significantly outpacing expenses, that's not inflation.", "label": 0}
{"text": "Right? Not everyone wants the gigantic phones that resemble bricks.", "label": 0}
{"text": "I'm not saying there aren't things about them that's better but this isn't typically how technology works. Usually, what's available at a specific price point (or slightly higher with normal inflation) improves while the tech that was available makes its way downward since they get less expensive to make overtime. OLED should at the very least still be in the less expensive options today let alone have made its way down the line at all. The fact you can only get OLED in the top of the line shows that Samsung isn't confident the other improvements you get are enough to justify what they want to charge so they have to downgrade their less expensive offerings to make certain benefits exclusive to the expense options.", "label": 0}
{"text": "What do you mean?", "label": 0}
{"text": "Sorry /u/switchtomonk, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "PriceJumpflation", "label": 0}
{"text": "Never had ads on my device, don't believe anyone who do not have it brotha", "label": 0}
{"text": "Okay, now mention all the features they've ADDED. I'll wait.", "label": 0}
{"text": "the non-XL phones are only a smidge bigger than the pixel 4a, which was the same size as the OG pixel. \n\nIt's not small, but Large, it is not.", "label": 0}
{"text": "https://www.gigantti.fi/magazine/palvelut/trade-in", "label": 0}
{"text": "God this is so annoying to me, too. Samsung needs to treat the Base S better, it deserves so much more.", "label": 0}
{"text": "I suspect this has something to do with them using the Snapdragon elite chip which costs more than the prior gen. They are now looking to cut cost somewhere else.", "label": 0}
{"text": "Sorry, Ok-Kaleidoscope-7932, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "how much of a consoomer do you need to be to say this about a 2 year old top of the line phone jfc", "label": 0}
{"text": "You can't rate the product without context. PCs nowadays are infinitely more sophisticated than 20 years ago but they don't cost much more. Lol.", "label": 0}
{"text": "Apple was getting better displays with their first OLED, the X.\n\nI prefer Android as an OS, but Apple's hardware is objectively better. \n\nThere's been so much cope for years on Android forums over it. Android OEM's simply don't sell premium models in the sheer volume Apple does.\n\nTheir higher end SoC's, better panels, and ability to consistently offer large storage SKUs every year are enabled by the economies of scale they operate at.", "label": 0}
{"text": "it 100% is also for pixels. Just search pixel 9 there", "label": 0}
{"text": "People don't understand that Samsung isn't a fully vertically integrated company like American conglomerates.\n\nSamsung Display won't gatekeep the best panels for Samsung mobile.", "label": 0}
{"text": "#### Hey there Stroov, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Notification ticker and notification led were the best", "label": 0}
{"text": "Weird, they get expensive every two year yet still cutting features off, huh...", "label": 0}
{"text": "They physically can’t. The exynos yields for gs23 were rumored to be so bad that they had to use sd for everything.", "label": 0}
{"text": "They did do that with sensors, sony too, the latest to the highest bidder, the last generation best thing to their flagships, except fold where they keep same sensors for years XD.", "label": 0}
{"text": "Wtf. Apple has been using intel modem for years. Cdma was mostly 3g and is basically irrelevant now we are 5 years into 5G", "label": 0}
{"text": "When you make a sponsored video on YouTube you have to disclose the sponsorship. You definitely can't disguise it as a unbiased review unless you wanna get letters from the FTC.", "label": 0}
{"text": "Pixel", "label": 0}
{"text": "I trust Google to make Android bad enough I can peacefuly by a phone \"by another vendor\" when my S23+ finally dies", "label": 0}
{"text": "Yes they've famously never cut costs lmao", "label": 0}
{"text": "How is it becoming more difficult?\nYour best bet is to buy the p9 on black Friday.", "label": 0}
{"text": "You should read the article before coming to the comments to just be upset over nothing.", "label": 0}
{"text": "I know, but the hp2 is still the higher end sensor.", "label": 0}
{"text": "Do you really think manufacturing cost doubled? Sorry to inform you but: no. The actual parts costs are so low they could sell it for the same price as 5 years ago and be fine.", "label": 0}
{"text": "It depends, the qualcomm 8 Elite will be a major upgrade, but they might use the same display panel, the same cameras and overall design.", "label": 0}
{"text": "Yes they have but they never compete with Samsung or other brands for the Ultra flagship. They're always offering a slightly lower spec phone for quite a lot cheaper. They are forced to cut cost", "label": 0}
{"text": "A year? Try a week .", "label": 0}
{"text": "Romanian isn't either. But still, there it is.", "label": 0}
{"text": "Totally fair, just saying it may be a low priority.  Romanian has twice as many native speakers.", "label": 0}
{"text": "They are a serious company, so they are probably already evaluating possibilities of risk v processors. But! Best case scenario, in 5 years risc v is on par with current ARM.", "label": 0}
{"text": "It does. But still, LLMs have total integration of Greek so I can't understand why it's SO hard for Samsung to offer it.", "label": 0}
{"text": "Oh nice, didn’t even think about LLMs already having most of that down. Which makes tons of sense given the name lol.  Probably need X amount validated by human speakers before making it available, otherwise our Reddit shitposts will be prominently featured by AI translators lol", "label": 0}
{"text": "Sorry /u/goldenlampgenie, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, ThatBattleCat, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, goldenlampgenie, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, and the 8GB RAM version of the A16 is not worth the money when the A35 and A34, much more powerful phones, cost the same amount for 8GB of RAM. It may be worth it down the line 3 or 6 months from now when the 8GB RAM variant comes down to about $150 or lower.", "label": 0}
{"text": "To most consumers (and probably all execs) a higher base price isn't worth a hardware difference you won't notice for at least a year. There are some nice hall effect sticks out there and I'm glad that more manufacturers are making it standard, but the only real difference is that they don't drift a year or two down the line. Longevity just isn't something that a lot of consumers or manufacturers are super interested right now, especially with the pace of new releases.", "label": 0}
{"text": "Intel/Apple have never shipped a modem with 5G based on Intel tech that Apple acquired. Intel/Apple have experienced in developing a power efficient and performant modem. [The rumor is the next gen of Apple iPhone SE in 2025 will contain an Apple 5G modem](https://www.digitimes.com/news/a20240917PD201/apple-5g-2025-modem-chips.html), but that it would be limited to low band/high band 5G and not capable of MMwave.\n\nCDMA was relevant five years ago as there were still areas of T-Mobile (due to Sprint merger) and Verizon's networks that were dependent on 3G (generally remote areas) as 5G first came to market. So you had a point at 2019 where Apple was still dependent on CDMA support (Qualcomm has standards essential patents that they don't license under FRAND terms, making it so it's cost prohibitive to not buy their modem). End of 2022 is when the 3G CDMA networks on T-Mobile & Verizon were sunset.\n\nApple did use Intel modems on Verizon models in the iPhone 7 and 8 series, and they performed much worse than the Qualcomm equivalents. By the iPhone X, Apple was putting Intel modems in the AT&T and T-Mobile equivalents (all GSM), and Qualcomm modems in the Sprint & Verizon Variants (CDMA for 3G, LTE onward is all GSM) because their performance on CDMA was so bad.\n\niPhone 12, 13, 14, 15 series have all used Qualcomm modems because Intel/Apple have never shipped 5G capable modems and they need 5G support to be competitive in the modern smartphone market.", "label": 0}
{"text": "#### Hey there Jazzlike-Fishing1264, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Unfortunately I think the future of handhelds is going to be PC operating systems like windows and steamOS, not android. Android gaming handhelds are great for emulation and mobile games, but that's still a huge niche. \n\nAlso, as someone else pointed out, \"can't I just use a phone for this\" is always going to be a big factor with the less powerful handhelds.", "label": 0}
{"text": "I'm still waiting for a decent 8\" tablet. Its been almost  a decade.", "label": 0}
{"text": "Money.", "label": 0}
{"text": "What you've described is exactly why I didn't end up buying the Ultimate controllers and just bought cheap wired controllers for my emulation setup. The compatability nonsense was just annoying to get through, and their own site doesn't make it especially clear which controllers can be used for the different setups you want to use them with.", "label": 0}
{"text": "Basically a phone to sell to people that don't know anything about specs cause they've heard of the brand and like the low price.", "label": 0}
{"text": "Sorry, serious-aspirant, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "It has it where it matters. Even Instagram uses the Dynamic Island as an upload counter so you know when your stories is uploaded.", "label": 0}
{"text": "Because the camera hole is not a notch and Apple actually imbued theirs with some legitimate usability.", "label": 0}
{"text": "Later on complain about Android is bad and switch to iPhone. Good way to lose users.", "label": 0}
{"text": "Some when 90W is only \"average\" speed?", "label": 0}
{"text": "It's below average in China", "label": 0}
{"text": "Sorry /u/ilovecoffeelots, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Seriously, my Moto Edge 50 Pro can do 125W with its charger which is insanity, how and why the hell did they do that.", "label": 0}
{"text": "#### Hey there IrishYank33, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I'm more interested in the API around this than the actual UI. The Live Activities API in iOS is really great.", "label": 0}
{"text": "HyperOS on flagships: 🤡\n\nHyperOS on ≤500USD devices:💀", "label": 0}
{"text": "To be fair, every phone since the Galaxy S10 series has been a downgrade in features, not sure why they would stop now if customers have kept buying them.", "label": 0}
{"text": "I don't know what it is about Google's Quick Settings implementation, but it looks so amateurish.", "label": 0}
{"text": "Oneplus 12R Snapdragon 8 Gen 2, Realme GT6 Snapdragon 8s gen 3, Samsung S23 Snapdragon 8 Gen 2, etc", "label": 0}
{"text": "My phone charges at 68W and I feel like that's plenty and suddenly 90W is average? A bit of a shame about the camera though considering how the X100 absolutely crushed it.", "label": 0}
{"text": "#### Hey there purrnoid, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry to clarify I’m using an iPhone. I don’t have those options sadly. ", "label": 0}
{"text": "Sorry /u/Brian-Henderson, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "mods can we block these speculation articles? this is like the 12th article that is all speculation about android 16 and features or changes \"coming\". google hasn't said anything about it and yet these articles pop up every other week.it's all clickbait BS. it happened with android 13 and 14 and 15 and all they do is cause confusion and frustration when people see a speculated 'feature' then get all excited for it and then are frustrated and pissy when it doesn't come. especially when it was never mentioned by google or the android team as being a feature that is going to be released. ex see desktop mode. so many people pissy about it no being in android 15, but google never announced it was coming. but these sites and articles all speculated that it was definitely 100% releasing with android 15.", "label": 0}
{"text": "oh and look all these speculation articles about 16 are all from android authority....", "label": 0}
{"text": "My man speaking at 1.5x speed", "label": 0}
{"text": "Nonetheless, 7+ G3 and 8s G3 are binned from the same dies.", "label": 0}
{"text": "That is also a rumour.", "label": 0}
{"text": "Nova Launcher has done this since 2011!", "label": 0}
{"text": "Probably some translation wonkiness? I think notebookcheck usually published in German before getting translated into English.", "label": 0}
{"text": "They never say 100% coming. It clearly says it's a possibility. It's in the title. Flipping flags and enabling it means Google thought about it enough to put in real effort. It's certainly a possibility it'll be coming. Just enjoy the world of Android, this stuff is exciting.", "label": 0}
{"text": "Sony please update the Xperia Z3 Compact Tablet. I'm begging you. A day one buy for me.", "label": 0}
{"text": "No, clearly not. [Just look at the OPPO Find X7 versus the OnePlus 12](https://www.gsmarena.com/compare.php3?idPhone1=12778&idPhone2=12725).", "label": 0}
{"text": "there was a review about that, TLDW is pretty much yes (sometimes only trading blows with x100 ultra though) https://www.youtube.com/watch?v=EOSlhtpqJnA", "label": 0}
{"text": "If you can get root on FireOS you'd make many people happy in /r/HomeAssistant", "label": 0}
{"text": "Miles better than Samsung's overpriced phones that cost more & function less. (Oh and in case you need examples here are a few: 13T vs 23Fe, 13T vs A55, 14T vs S24Fe, 14T Pro vs S24, S24+)", "label": 0}
{"text": "Sorry /u/AlJK91, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Cutting costs on \n\nDisplay - check (let iphone/Pixel have the latest M14)\n\nbattery - check (they are going to use the same battery and not the the new Si C battery used by Vivo )\n\nCamera Sensors - check (same main camera, telephoto and periscope. We have to love another year of flagship having tiny 10MP sensor on telephoto)\n\nPrice - $1200 as high or higher than most flagships. \n\nNon Ultra phones were already gimped big time by not having LTPO screens and sub flagship camerars which are worse than midrange Pixel 8a if I am not wrong.\n\nWith US/China relationship in tatters and no chance of anyone getting to buy a good Android flagship, Samsung gets to coast but at the cost of declining sales/margins(they are sold at lower prices via various exchange/carrier deals). \n\nTM Roh has to go and new leadership has to come and hopefully start to compete again.", "label": 0}
{"text": "on the brightside the S25 will be an insane upgrade for you", "label": 0}
{"text": "Always wondered who bought the galaxy beam.", "label": 0}
{"text": "Because every chinese flagship has 120W", "label": 0}
{"text": "TM Roh", "label": 0}
{"text": "I think I will be keeping my S24+ for a LONG time. I wonder how I'm able to get the battery replaced when it comes time? Do they have a program similar to Apple?", "label": 0}
{"text": "I have an iPhone for work and run into the exact same issue.", "label": 0}
{"text": "Lenovo did this years ago already too with the old Yoga Tab series\n\nhttps://preview.redd.it/st14cn2j86xd1.png?width=725&format=pjpg&auto=webp&s=d3b3df39a58655d31795dbee27805964d977197a", "label": 0}
{"text": "Can they eliminate the small delay for swiping the whole thing down plz", "label": 0}
{"text": "My guess is that it will be announced with the OnePlus 13.", "label": 0}
{"text": "Not sure what you are trying to argue about. The video I posted compares Apple SoC to Pixel. Not Samsung.", "label": 0}
{"text": "Sorry, thedreamsof, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Are they... not at the top?", "label": 0}
{"text": "My argument is that you're going off pure SoC benchmark performance numbers (which are often tuned and not 100% representative of actual performance). I can tell you have no real world experience of using a pixel as your arguments aren't indictive of real world use cases. Again for most everyday users it performs perfectly fine and offers a great simplified experience. \n\nGenerally I compare Androids to Androids. The A18 pro is the best SoC in any phone, but android people tend to not buy iPhone and vice versa. S24 would be the closest competitor to a Pixel 9. Comparing a pixel 9 to an iPhone 12 is just silly (again going off benchmark numbers). My pixel 8 is a much better performing phone than the iPhone 12 or OnePlus phone I previously used. Battery life was terrible on the iPhone 12 specifically.", "label": 0}
{"text": "Sorry /u/Painiskeyy, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Your Pixel 8 was released last year, so you should be comparing it against the iPhone 15, not iPhone 12.\n\nI literally listed 3 different examples of non benchmark uses in my 2nd comment and you are still trying to say 'but benchmarks don't matter!'.\n\nLmfao you need to go back to elementary school and understand logic and reading comprehension. You are never going to convince me or anyone else if you just ignore my comments and harp on defending a bad phone with a bad SoC.\n\nBtw you never responded to why Google is labeling this as a premium phone and charging premium prices while delivering a subpar experience for gaming, video editing, photo editing, modem and call quality, and poor battery and thermal management. It's baffling you defend such a bad phone.", "label": 0}
{"text": "I miss when you could choose different shapes for icons and whatnot", "label": 0}
{"text": "Secret agent from china assigned to bankrupt Samsung electronics mobile division.", "label": 0}
{"text": "I don't get why we don't have this in Norway. Same company. I get 200$ for my mint condition P7P. So better off selling it second hand.", "label": 0}
{"text": "Even with software Google is not so far ahead that it makes up for it. Many of the Gemini AI features are rolling out and available to non Pixel devices. OnePlus is getting circle to search and alot of the Galaxy AI features that are based on Google/Gemini AI.\n\nThe main point of the Pixel was suppose to tout Google's software superiority but that isn't even the case. There aren't really many AI features that are exclusive to Pixel that you can't get on other phones. Sorry to burst your bubble. There's no scenario where I would recommend a Pixel over a Samsung or onePlus or iPhone.", "label": 0}
{"text": "Is there any official way to buy one of these in North America (ie not relying on a shady daisy chain of resellers)?", "label": 0}
{"text": "good to see chinese manufacturers pioneering ip69 and silicone carbide batteries  \n  \nboth are important factors to me", "label": 0}
{"text": "This was the reply I've been searching for. I know my phone is waiting for me to restart it to finish the update (which I started on 15 as a beta immediately after it's release) so I've been trying to find someone else that came from the beta to see where their phone stands before I let my phone finalize the update. ", "label": 0}
{"text": "Because wattage isn't the same thing as charging time.", "label": 0}
{"text": "Samsung probably if you consider One UI \"heavy\". Chinese OEMs seem to have the biggest changes from stock but I haven't tried them.", "label": 0}
{"text": "#### Hey there shtarker53, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Hey VikingCleaners. We've removed this submission as youtu.be/Jech_Bvb7E0 is a shortened link. Please [resubmit](https://www.reddit.com/r/Android/submit) the full canonical link www.youtube.com/watch?v=Jech_Bvb7E0 instead. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Google did a terrible job with quick settings since Android 12", "label": 0}
{"text": "I quite like reading these articles.", "label": 0}
{"text": "Samsung Display and Samsung MX are actually seperate entities (brainfuck right?), and I heard that SD doesn't like MX that much", "label": 0}
{"text": "All the designers who were responsible for the M3 redesign have finally received their promotions, so now their changes could be slowly undone.", "label": 0}
{"text": "Yeah, missed that. My bad!", "label": 0}
{"text": "[This](https://www.lifewire.com/thmb/8NPWWoNO-qqgRBYUWND6Im8Uscs=/1500x0/filters:no_upscale\\(\\):max_bytes\\(150000\\):strip_icc\\(\\):format\\(webp\\)/005-how-to-use-the-quick-settings-menu-on-android-33c43b42a60b4f1281477fb4082ac964.jpg) version of the toggles is my favorite.  This, of course, is the fully pulled down version, but tapping the carrots next to each of the toggles would open, in the pane, some additional settings instead of opening other pop ups or going into another application to make changes.  You still could, memory serving, by long pressing on the toggles but it just seemed a lot faster and space conscious than the stuff we have nowadays.", "label": 0}
{"text": "#### Hey there pnc4k, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Haha. Loosers. They removed SD, jack, led notification. Now they remove good screen. It's been nothing but downsizing lately for a lot of brands. Well, S24 is OK not ideal, but that might be my last Galaxy.", "label": 0}
{"text": "Until the new gen comes out. New find x8 and x8 pro have also been reduced to 80w and other brands will follow", "label": 0}
{"text": "Tradingshenzhen and Giztop are very safe for that", "label": 0}
{"text": "Damn, no A14 support 😢", "label": 0}
{"text": "Yup", "label": 0}
{"text": "I would advise you to wait until 2.2 stable version", "label": 0}
{"text": "working on it", "label": 0}
{"text": "Yet iOS as of late has opened up a lot more and allowed far more customization and free will than they ever have gotten before.", "label": 0}
{"text": "Will do, thank you!", "label": 0}
{"text": "Sorry /u/leg18, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Since Geekerwan & others are getting their recognition (deservedly) in English communities, one thing I'd like to mention: this one belongs to one of their paid reviews (evidently from it being demonetized on Bilibili) where the manufacturer will get copy and content approval before video publish, which is common for Chinese tech reviewers. Not saying they are making things up but they definitely avoid talking about the negatives.", "label": 0}
{"text": "Another bloat feature that destroys the integrity of a perfectly functional tool. This is no different from incorporating WiFi into a kitchen scale. To create an alternative organizer app and then permitting sync between the two would be the correct strategy, not deliberately undermining the simplicity of an intuitive tool already relied upon by millions of users for a decade. Obstinate.", "label": 0}
{"text": "Nope\n\n[https://i.imgur.com/8guAU5n.png](https://i.imgur.com/8guAU5n.png)", "label": 0}
{"text": "I wanted to play BLACKPINK the Game, it's some kind of Rhythm game. \n\nGot it installed, and it had a in app/game download, cool ok. \n\nYou have USB Debugging on, please turn it off, ok sure that makes sense.....\n\nYou have Shinzuku installed, not allowed, wtf? ok sure?? Y\n\nou have termux installed, not allowed also.... \n\nI just uninstalled the games.", "label": 0}
{"text": "I'm snatching this up for $50 for sure, the other options were a little too expensive imo", "label": 0}
{"text": "i love ads and blotware for better cameras and features cause otherwise you have to pay more", "label": 0}
{"text": "I'd say some more then Google for most people.  You can remove everything from the home screen.  Sure you can use a different launcher on Android but most people won't do that.", "label": 0}
{"text": "newpipe, revanced, browsers with actual desktop extensions. ublock origin, sponsor block, innertune", "label": 0}
{"text": "but they charge an arm and a leg for their shit. It was especially noticeable 20/20 through 2022 when the pixels were more aggressively priced, but even still comparing it to like OnePlus 12 it's crazy.", "label": 0}
{"text": "It works fine on A14.", "label": 0}
{"text": "was wondering the same thing, might be wrong but if you look at the article thumbnail, the pill-shaped hole getting covered by the person's finger seems to have the same shape/placement as the IR blaster on the 12", "label": 0}
{"text": "I had a S20 myself. Was running it at 1080p anyway because of 120 Hz.", "label": 0}
{"text": "Agree to disagree I guess. \n\nIve owned 3 OnePlus devices and really liked them but found them too buggy and unstable to recommend to non techy people. Samsungs are ok but I personally find oneUI over complex and not very nice to use.  iPhones are great but are overpriced and some people dont like iOS. My pixel 8 has been reliable, never gave me a performance\n problem and OS has been a clean, simple, unified experience. \n\nOverall pixel to me is the best user experience besides iPhone, user experience is ultimately what matters. Didn't go iOS because I personally prefer android and the pixel 8 at $499 was $300 cheaper than the iPhone 15 at the time.", "label": 0}
{"text": "definitely try oneui (ideally on a flagship).", "label": 0}
{"text": "[System no longer prompts to complete action for apps with android.intent.action.CHOOSER on Android S preview [183035750] - Issue Tracker](https://issuetracker.google.com/issues/183035750)\n\n>*Status: Won't Fix (Intended Behavior)*", "label": 0}
{"text": "I just tested it on my S22 Ultra and just like you mentioned, I got served VP9, not AV1. Thank you for letting me know this.", "label": 0}
{"text": "It depends on you. I like to have dedicated devices that are good at what they do, so I can have a good experience. Some people don’t mind compromises for a different price point.", "label": 0}
{"text": "Why a shitty chip is a shitty chip no mater who makes it.", "label": 0}
{"text": "Once LG, never again. At least for me when it comes to Smartphones. I was a LG slide-out keyboard user before the smartphone era. Yeah I'm old(er). I was so happy with LG that I bought them back to back which I rarely do as I dont have a brand loyalty. So one of my first smartphone was the LG G series, I think it was the G2 Flex. But boy I hated it. It was slow, choppy, laggy and even froze at times. One of the worst smartphones Ive had, tied with the Xiaomi Redmi Note Pro (early 2010 model).", "label": 0}
{"text": "So it does, thanks! I was hesitant to buy it since it explicitly claims not to, but the QS theming is fine on my Motorola phone.", "label": 0}
{"text": "I agree.. Some brands are very confusing with the Pro, Ultra, T, etc. naming. There are a few where the Ultra model has a lower CPU than the Pro model.. You would think that Ultra is better than Pro lol.", "label": 0}
{"text": "The GPU is good enough for 87.9% of users. Not everyone is buying a phone to play Genshin Impact. And if they did I think it could run it at low-med. graphics and have extra money to buy skins or chests or whatever that game sucks people in to buying.", "label": 0}
{"text": "Motorola can usually be got for cheap few months after release. In Canada/USA there is a lot of people who dont know of Honor, Realme or even Xiaomi. But they know of Motorola. But yeah I agree the MSRP is high imo based on the specs. But if the camera and software is good then that might lure people into buying it on sale.", "label": 0}
{"text": "It's in rearrange mode, and it's a very very early beta. They don't even show in the normal edit. It's not exactly final designs, more like first look.", "label": 0}
{"text": "Are they going to make a new chat app that only lives in the notification shade?   I would not be surprised.", "label": 0}
{"text": "Sorry, Pinchecarro, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I don't trust \"it's a beta, they will fix it before stable\" as through the years I saw so many instances when companies didn't fix issues like that and even worse.", "label": 0}
{"text": "#### Hey there Silverbackslay, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "And the wildest thing is, of all of those Ultimate versions, guess which one got firmware update to *officially* supports Apple devices (including wirelessly)? I'll give you a hint: it's not the fucking Bluetooth one.\n\nAt least they still make the Pro 2 (and it even got updated with hall-effect stick).", "label": 0}
{"text": "another qc advertisement. samsung uses qc chips becos of qc patent troll fees and samsung foundry hiccups", "label": 0}
{"text": "It's not about yield rates anymore, this gen no chipset can compete with Qualcomm performance and efficiency.", "label": 0}
{"text": "They actually had a version of windows Phone that supported Android apps. That could have saved it.", "label": 0}
{"text": "They are in quite a pinch now. Arm is canceling Qualcomm's chip design license and that includes the snapdragon chip. It will be interesting to see how this plays out.", "label": 0}
{"text": "> We get more competition, we get better things .\n\n\nWhen ARM will cancel Qualcomm licence what competition are you expecting? ", "label": 0}
{"text": "If it wants to be a true Flagship it needs to get rid of that god-awful 200 megapixel sensor. Pixel binning is not the same as naturally large pixels", "label": 0}
{"text": "is it too much to ask qc to share their exorbitant fees?", "label": 0}
{"text": "Heavy is oneui. Is it the smoothest? definitely not stock and other chinese oem skins are way smoother", "label": 0}
{"text": "It's not that strange, it's like LG Electronics versus LG Display.\n\n\nSamsung Display's goal is to introduce new products and push technology forward. They will find buyers, it's just a matter of time. Samsung MX's goal is to build phones. There's no expectation of parts being used.", "label": 0}
{"text": "Qualcomm built their own architecture supporting ARM instruction set and that's what caused the recent problems.", "label": 0}
{"text": "That's because they are different divisions. One company just creates parts and hopes others will buy them. \n\n\nThe other one'scgoal isn't to build a phone with all of the latest bells and wbhistles. They have to build something that is profitable yet not overly expensive, even if that means not using new parts.", "label": 0}
{"text": "whats wrong with that", "label": 0}
{"text": "Not for flagships.", "label": 0}
{"text": "Those days back in 2010🤩🤩", "label": 0}
{"text": "It's just a paid article.", "label": 0}
{"text": "What specific \"qc patent troll fees\"?\n\nAnd Samsung have used Exynos before, but right now the gap is too large in QC's favor.", "label": 0}
{"text": "That Motorola Droid takes me back.", "label": 0}
{"text": "It's not even just that, Verizon and AT&T employ pay to play tactics where any device has to be \"certified\" to run on their networks. They want not only a stream of money from customers who use their mobile towers, but any device even attempting to connect to them.\n\n\nIt's not just enough to build the devices to be physically compatible with the band requirements, the mobile operators also want their cut.", "label": 0}
{"text": "Not me. I had Tegra 2 and Tegra 3 powered phones and they were hot, slow messes of a device.", "label": 0}
{"text": "Man. I have a friend who's about 15 years older than me, and that means she was my age when this came out.\n\nThat age gap feels so much larger now.", "label": 0}
{"text": "Don't most put a case on it? Colour only matters when selling the phone.", "label": 0}
{"text": "My first tablet is powered by Tegra. Sony Tablet S. \n\nAlso, probably everyone forgot, but Nintendo Switch is powered by Tegra.", "label": 0}
{"text": "\"At the end of May, we announced the launch of the RISC-V Software Ecosystem (RISE) Project alongside Google, Intel, NXP, Nvidia, Red Hat, Samsung and others to advance software adoption. \"\n\nDo we assume that ARM will improve it's design faster, in the long term than the above list of collaborators can improve RISC-V?", "label": 0}
{"text": "The issue is with a buyout Qualcomm did recently. They absorbed arm licenses that the company had and Arm is not happy about it.", "label": 0}
{"text": "Galaxy Nexus on a TI chip. Man I miss that phone.", "label": 0}
{"text": "There are two types of architectures.\n\n- Microarchitecture (the CPU core)   \n- Instruction Set Architecture (the CPU language)    \n\nThe Snapdragon 8 Elite utilises Qualcomm's own custom CPU microarchitecture, but it's based on ARM's CPU ISA.", "label": 0}
{"text": "Sorry, CaterpillarOk1329, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Had HTC One X Tegra3. As far as I can remember, gaming was good though it became hot as hell.", "label": 0}
{"text": "So in that case, QC would be better off use ARM until RISC-V is flagship capable? Wouldn't that make ARM a monopoly?", "label": 0}
{"text": "Thank god fucking finally holy shit.\n\nThey have been downgrading QS with each update wince Android 10 I think, with its absolute worst rendition ever arriving in Android 12 and then decided to stick with that for some reason. \n\nThat being said, I cannot wait for this to get removed in the final A16 beta before the stable release.", "label": 0}
{"text": "What is that supposed to mean exactly?", "label": 0}
{"text": "Seriously. They kept fucking with it since Android 10 and then decided to make it the absolute worst it has ever been in Android 12 and never fixed it since.", "label": 0}
{"text": "Pretty much every single other OEM realizes how utterly obnoxious and ass-backwards stock QS are and fixed them.", "label": 0}
{"text": "I don't know but the phone has larger 6000 mah battery which will obviously take longer to charge.", "label": 0}
{"text": "Do you want to ban all content? This subreddit is already on its deathbed with a lack of submissions but sure lets ban more content from items found within future android code", "label": 0}
{"text": "Phones shouldn't stutter even if you multitask", "label": 0}
{"text": "Respectively I don't agree. It's largely a marketing thing, Qualcomm has become a consumer buzzword in the android community and media for \"quality\". If Samsung released S25  tomorrow with an amazing dimensity chip, or even there own exynos that beat snapdragon, there would be a wave of reddit posts and news articles \"Samsung no longer using Snapdragon\", \"Can the new S25 keep up with Snapdragon?\". This is not good press and even if the chip is much better, it will put normal people off it. \n\nIt's very much like Intel prior to amd Ryzen release. Intel was dominant, amd chips were just bad. But Ryzen was good, in fact it was much much better and much cheaper. It took nearly 5yrs for manufacturers to start mass producing Ryzen options because general consumers thought negatively of products with an AMD logo.", "label": 0}
{"text": "Tho keep in mind the Chinese version doesn't have band 71 nor eSIM, wait for the Global version first", "label": 0}
{"text": "Apple has arguably more premium hardware, using more expensive materials (Titanium grade 5 vs the cheapest they could find, Sapphire for lens covers and camera control etc). And now we get the news that they plam to cheap out on their own hardware, what do you mean what’s wrong with that?", "label": 0}
{"text": "What fees? ", "label": 0}
{"text": "iirc IP69 also grades temperature resistance in addition to water jets, it can withstand hot water now", "label": 0}
{"text": "Hmmm, thanks gór clarifying. I'll have to launch myself down a YouTube hole on this subject. Seems like a trick situation.", "label": 0}
{"text": "*Customer interaction with this product is up by 28.6% after these changes*\n\n\n~ Some middle manager at Google, I guess.", "label": 0}
{"text": "Then Google came with their \"customization\" focus that... removed customization options.", "label": 0}
{"text": "licensing fees for 4G standards", "label": 0}
{"text": "Don't forget Nokia too. And I wouldn't say Google was late - they completely disrupted the market, with a combination of free, first party and a good product (in most locations).", "label": 0}
{"text": "I purchased my first 8bitdo controller a few weeks ago and never would I have thought it needed to be confusing to buy a damn game controller!", "label": 0}
{"text": "And it lagged like sht", "label": 0}
{"text": "Seeing as how X200 series and X8 series uses SiCa batteries, it might be due to them not figuring out how to push more than 100W safely yet", "label": 0}
{"text": "Motorola is actually a US company, there were bought by Google then sold to Lenovo. But originally were US founded.", "label": 0}
{"text": "Back when Google was aspirational and good instead of a shitty follower corporation just interested in sneaking an extra buck.", "label": 0}
{"text": "Simping for ARM is WILD. They both collect royalties based on patents, copyrights and designs.", "label": 0}
{"text": "So basically where people live and drive?", "label": 0}
{"text": "I owned one. Stopped using it once I realised they wanted a heap of money to update the maps", "label": 0}
{"text": "Ultra still takes better photos. But you get way better battery and performance with the 200. Pick your poison/perk I suppose.\nIt is a good upgrade from 100pro just for these reasons.", "label": 0}
{"text": "This is such an outdated take.", "label": 0}
{"text": "Unless the 100 pro is significantly cheaper I wouldn't. \nI personally think it needs to be 24-50% cheaper to be considered at this point. If budget is an issue then 100pro is still excellent and I enjoyed it and would have been happy to use for another year.", "label": 0}
{"text": "> A project to drive on pretty much every road on the planet, photograph everything and stitch it together and provide it all on the net.\n\nNot just once, either. They drive it multiple times for updates.", "label": 0}
{"text": "I'm on the X80 pro and it's still an amazing phone.", "label": 0}
{"text": "It's hardly all the roads in the world.", "label": 0}
{"text": "> Except it doesn't cover every street in the world. Street View still has low coverage. Usually just cities and main roads.\n\nIt really is country dependent. Western Europe** has pretty much universal of every public road, rural or urban. China has none. And there are plenty in between. A good chunk is also getting a bit stale now and needs a revisit, but I'm still astonished by just how far their coverage goes and it's an indispensable tool when travelling to somewhere new.\n\n(** Germany has, for a long time, been an exception due to various privacy cases but my understanding is that it's now opening back up and more of the country is now available on Streetview)", "label": 0}
{"text": "I hope they let us apply our theme stuff we buy in the same way. I always used Google for this anyway there's just no comparing the 2 when it comes to performance", "label": 0}
{"text": "cool. why do developers reject mediatek then?", "label": 0}
{"text": "If you're on an android phone Branch Metrics has your data already.", "label": 0}
{"text": "When I navigate to family parties, the oldest sometimes ask me what road we choose and why, and I'm just like \"Yeah, I have no clue. I just do what maps tells me\"", "label": 0}
{"text": "There is no RISC-V chip witht the performance of the arm chips now.  RISC-V right now is being used low power chips.", "label": 0}
{"text": "And Qualcom broke ARMs terms.", "label": 0}
{"text": "No they didn't the license is non-transferable, but they thought hey we well use it anyway.", "label": 0}
{"text": "Can Someone tell Google.", "label": 0}
{"text": "Street view coverage in Japan is actually quite good. They covers remote area, and even remote islands too, although the data are outdated.", "label": 0}
{"text": "I loved the gn. Was my first nexus. Zero battery life though.", "label": 0}
{"text": "Memories!", "label": 0}
{"text": "It's not about architecture itself, it's about chips that exist now. You can't make a completely new high performance chip from nothing at a snap of your fingers, it takes many years of R&D. ARM has an enormous advantage of having those now, which allows them to create new chips in an evolutionary manner by improving existing designs. Nothing like that exists for RISC-V, so it will take someone years to catch up to ARM even if they pour billions into it right now (and ARM of course won't stand still meanwhile).", "label": 0}
{"text": "Completely agreed.  My favorite is when there's one option to be selectable, but instead of just fucking putting that option, they put an overflow menu button to first need to click so it's adding additional unnecessary tapping/clicking and movement of finger/cursor.", "label": 0}
{"text": "I think that's only partly the case, the bigger reason being the single cell design.", "label": 0}
{"text": "Phone ? it should be called tablet *", "label": 0}
{"text": "Just wait for r/jerryrigeverything to try it!", "label": 0}
{"text": "Elite Extreme Ultimate is coming next", "label": 0}
{"text": "Yeah except the Samsung phone has Samsung's shitty skin over android. Fuck that.", "label": 0}
{"text": "*Offline* navigation to boot. Not (that) much of an issue nowadays, but back then it made all the difference in practical usability.\n\nAlthough - turn-by-turn functionality wasn't free initially, if I remember correctly...", "label": 0}
{"text": ">I remember when Apple released Apple Maps on iOS and for some reason, that version of iOS didn't have Google Maps, it was pulled from the App Store (can't remember the reason why)\n\nBecause Apple at the time had app store rules against \"duplicating core functionality\", which meant they felt that Apple Maps was included in that.", "label": 0}
{"text": "Red Magic needs to add more years to support device, two years and one Android version is not enough anymore, 7 years Android OS and security update is normal now.", "label": 0}
{"text": "#### Hey there RealEstateAdventurer, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Yes, only around 2009-10", "label": 0}
{"text": "I was going to make a joke about this being described as \"compact\"on release but the article does actually say it could be their smaller model.", "label": 0}
{"text": "My fist smartphone with android was LG p970 with TI OMAP 3630. It was a really good decide for the time, the battery life wasn't great though", "label": 0}
{"text": "Why? I like the big targets much more than the old smaller ones. It also looks much better than the visual inconsistent slop of iOS and ones that are inspired by it.", "label": 0}
{"text": "I'm reading articles that claim it's 98%", "label": 0}
{"text": "insanity", "label": 0}
{"text": "TomTom was almost bankrupt because of Google Maps Navigation. Before this you'd need a separate device in your car for turn-by-turn navigation. And you'd often also need to pay for map upgrades. \n\nTomTom still exists solely as a mapping company.", "label": 0}
{"text": "It was free and got you on the destination all right. It was much cheaper than having to buy a separate GPS-device and paying for map upgrades.", "label": 0}
{"text": "> they’re a chip company wanting to become a household name. \nMakes sense, they are the principal shirt sponsor of Manchester United.", "label": 0}
{"text": "Yes!!!", "label": 0}
{"text": "I could've sworn there was an option to do just that I earlier versions of Android. Maybe I'm just misremembering 🤷🏾‍♂️", "label": 0}
{"text": "So much Street...*[View!](https://www.youtube.com/watch?v=rsKik2Y5r5k)*", "label": 0}
{"text": "I often wonder if the Google of today would have greenlit such a thing. They seem a lot less willing these days to do such things.", "label": 0}
{"text": "Yes, after 888.", "label": 0}
{"text": "Let's go!!!! Finally a phone with 7+ inch display 😭😭🙏🙏", "label": 0}
{"text": "Sorry, leg18, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "RISC-V chips releasing now are only about 2 years behind top end ARM chips right now. They are gaining ground very quickly.\n\nBut most of the dev focus has been for servers and AI -- where the $$$ really is.", "label": 0}
{"text": "Agreed, still using mine, 0 issues. Amazing phone overall, but it's incredible to have a small tablet in your pockets all the time.", "label": 0}
{"text": "But it's hard to overstate how much of a game changer this was in the consumer GPS market - and a HUGE selling point for Android phones. If this launched in '09, I'm pretty sure iPhones didn't get it until late (December!) 2012.\n\nI remember going on a class trip in college in 2010 and one of the professors was so proud of his Droid being able to do this. It was BETTER than standard Garmins/TomToms of the time, too. I remember everyone being impressed. (Maybe you had to be there, lol)", "label": 0}
{"text": "#### Hey there Ginlife, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Whatever happened to using street view to show turns?", "label": 0}
{"text": "I'm sure I remember that too. When your screen was locked, everything was locked. Now you have to hide tiles that you don't want people to have free access to, like wifi and internet which can be disabled from the lock screen without verification. \nMaybe the new theft detection features will help, but I still don't like my lock screen not actually being fully locked.", "label": 0}
{"text": "Sorry /u/Full_Advertising82, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "God I love big phones", "label": 0}
{"text": "Sorry /u/Full_Advertising82, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "The entire subreddit?", "label": 0}
{"text": "I'm honestly rooting for MediaTek to step up their game. More competition means better chips for us consumers in the long run", "label": 0}
{"text": "And I was still printing maps until 2017 somehow", "label": 0}
{"text": "What would be the screen that is used on ultra? The one with super anti reflection or something like that. I'm wondering if we gonna see these in other devices soon.", "label": 0}
{"text": "Sorry /u/Ex_lord_of_Dark, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, Ex_lord_of_Dark, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I have reno 12 pro global version there is not anti flicker setting. Is that setting there in Asian version?", "label": 0}
{"text": "I have reno 12 pro global version there is not anti flicker setting. Is that setting there in Asian version?", "label": 0}
{"text": "Yeah it has had a negative impact, in terms of routing a lot of traffic through roads that you would never use if navigating using a paper map. In the city where I live (London, UK) traffic has doubled on unclassified roads (i.e. ones deemed not important enough to be part of the numbering system) since GPS apps became popular. But over the same period, traffic on other categories of road has barely changed at all.\n\nI suppose that's not necessarily on Google though. To them, roads are just data representing lines on a map, and they don't really differentiate one line from another. If local authorities don't think a road is suitable to take large volumes of through traffic, then there are ways to prevent that, e.g. traffic circulation plans (although these are rarely seen outside of urban areas).\n\nSome kind of \"keep to main roads\" option would be nice, but really unless the places you're driving through have done the legwork to try and keep through traffic to suitable roads, the only option as I see it is basically to keep an eye on your phone, and keep manually correcting the route when you see it's taking you on a detour to \"save time\".", "label": 0}
{"text": "That's what ARM claims. Qualcomm denies it. \n\nUltimately, it's for the courts/judges to decide.", "label": 0}
{"text": "Qualcomm already held their own ALA. So the fact that the Nuvia ALA was non-transferable wasn't a problem.", "label": 0}
{"text": "No they didn't. Qualcomm used to buy CPU designs from ARM for the past few gens, after the Nuvia acquisition, they no longer use ARM designs, just the instruction set. So they paid ARM the lower fee, and ARM being dramatic is crying. Probably to get back at Qualcomm for being against the Nvidia acquisition", "label": 0}
{"text": "they asked fElon", "label": 0}
{"text": "I get that there are a few people who actually want this, but what we really need are some good smaller options. \n\nMy 6.x\" phones are already uncomfortable in my pocket. I want a good 5.1\"-5.5\" phone again.", "label": 0}
{"text": "Featuring Dante from Devil May Cry Series", "label": 0}
{"text": "Seriously I've been searching for a launcher that can emulate the old android 7.1.1 that had camera and settings as individual buttons on home screen and not that irritating pull up menu that's omnipresent. I've made my peace with planned obsolescence I'll happily pay a couple hundred dollars every few years to do the same thing the iphone 6 could do a few years ago but seriously forcing these interface changes on us.", "label": 0}
{"text": "Maybe 98% of countries that have any support at all. There's still a lot of countries that just aren't supported, including China.", "label": 0}
{"text": "More then needed, looking forward to it.", "label": 0}
{"text": "Ah yeah, I forgot we're on Reddit and we need to hate on everything Google regardless of context. If not you must work for them. No other answer is possible like oh, maybe there's been years of dev previews and revisions where features get added, removed and refined. Predictive back animations look nothing like the very first previews, because that's all it was, an early preview. If you can't understand the difference between a bug and pre release code, I don't have anything else to say.", "label": 0}
{"text": "Good, hope they return to the s23 display as the s24 sucks big time!", "label": 0}
{"text": "keep seeing some saying it will be the same 3 cameras but slightly improved from the X100 Ultra. Then there's the rumor for 4 cameras total -> if it does end up being 4 cameras will they have the reduced sensor size or will they include the 1 inch one I keep asking myself? \n\nI hope they don't reduce the sensor size if they include 4 cameras ... but wasn't space a bit of the reason why they didn't include 4 cameras with the x100 Ultra?", "label": 0}
{"text": "Another Samsung \"4nm\" class SOC. Samsung's GAA nodes have flopped. Just a watch SOC to show for it. Rumors are that Exynos 2500 is having issues. Not used in S25 series anywhere and even 25 Fe will use Exynos 2400.", "label": 0}
{"text": "it basically killed stand alone GPS. Previously Garmin GPS was a thing. And it was much better than those as maps were auto updated and we got traffic as well.", "label": 0}
{"text": "Ever heard of clear cases?", "label": 0}
{"text": "Main camera downgrade is biggest downer. It happened last time for Xiaomi 14 pro and now Vivo have followed suit. One Plus/iQoo have made their sensors smaller in this years flagship as well. \n\nThis might give some ideas to Samsung as well to follow suit :-(", "label": 0}
{"text": "It all depends on the price they'd be selling at.", "label": 0}
{"text": "Elite Extreme Ultimate Pro Max?", "label": 0}
{"text": "> Samsung giving away their best and latest displays for Apple and other companies\n\nYou meant selling to these companies. There's a reason the Pixel 9 Pro XL launched at $100 more than the Pixel 8 Pro.", "label": 0}
{"text": "Which is precisely why I want a 5.1\"-5.2\" screen. With modern bezels, it would actually be a properly compact phone!", "label": 0}
{"text": "It's more or less confirmed by the famous Chinese leaker Digital Chat Station that the Ultra will have cameras. The only doubt is about the main sensor.\n\nhttps://m.weibo.cn/detail/5081781623591247", "label": 0}
{"text": "It didn't help that TomToms weren't very good. Certainly better than nothing, but I remember one in my work truck that I ultimately just ignored because it never routed correctly or would have connection issues. They changed out the unit to a newer one at some point, same issues.", "label": 0}
{"text": "9 or 10 also removed call recording support for third party apps.\n\nAnd recents UI being integrated into the stock launcher instead of system UI.\n\n12 removed the default open link with option and added some verified link nonsense.", "label": 0}
{"text": "And their Non-Chinese rom support needs to be more than just a Ctrl-F Ctrl-P form of language swapping.", "label": 0}
{"text": ">the cost of licensing 4g standards in US is equal to the cost of a QC modem with the license bundled\n\nThe cost of QC's [patent licensing is only $13-$20 lol](https://www.cnet.com/tech/mobile/apple-and-qualcomm-settle-heres-what-it-means-for-your-next-iphone/)\n\nUnfortunately, Qualcomm's modems cost far more than that (but same with MediaTek/Samsung)", "label": 0}
{"text": "Oneplus retains it's lyt808 iirc    \n\nBut iqoo neo's case is because imx920>921 is indeed a reduction in size, but i think it's more on Sony end since they are the one pushing the imx921 as the upgrade", "label": 0}
{"text": "I have the same setup as well and have the same plan. Hopefully, they will keep the original SE size instead of replacing it with a mini.", "label": 0}
{"text": "But what about the OnePlus 13", "label": 0}
{"text": "They absolutely would. GPS data is invaluable in today's smartphone world. It's why they make all their money thru AdSense. Without capturing data points, advertisers can't target you and won't have context of why you're there.\n\nIt's why they even got into the hardware business as a software company. Android is a mine of data and Maps just happens to be the tool.", "label": 0}
{"text": "That's so disinformative.\n\nQualcomm had an Architectural licence long ago. Qualcomm actually used to develop their own cores. Scorpion, Krait and the first Kryo.\n\nYou're outright refusing to believe that the reason why Arm sued Qualcomm had any backing to it. Why are you believing Qualcomm and not Arm, our of curiosity? Instead of giving the benefit of the doubt to both.\n\nOne of the rumoured reasons which are said to be the way Qualcomm broke Nuvia licence terms, was that they (Qualcomm) are now and repurposing the IP (developed by Nuvia) for consumer use (smartphones) broke the terms of the licence that Nuvia had with Arm, which was for 1) A small startup, so likely with better terms; 2) For cores intended for enterprise (datacenter) use, hence not applicable to consumer devices.\n\nWe don't know whether that is true or not.\n\nWe don't know anything. Siding with Qualcomm or Arm, at this point where everything is pure speculation, is entirely idiotic.", "label": 0}
{"text": "I bought an Nokia N9 for this, and it was the last Nokia I ever owned, Maps worked but the device was incredibly clunky....they were using Microsofts Windows Mobile platform.", "label": 0}
{"text": "They definitely don't engage in the marketing tactics that Oppo does (year-long sports sponsorships, celebrity endorsement spam, the most aggressive salespeople on earth)", "label": 0}
{"text": "Sony needs to make the Playstation phone again with a built in emulator. That would be bad ass.", "label": 0}
{"text": "Great. The end result still is despite wanting their phones, I can't use them. And there's a real easy solution to this.", "label": 0}
{"text": "It's useful but also a privacy nightmare.  And it's too bad there isn't a FOSS alternative that comes close to it's usefulness.", "label": 0}
{"text": "An upgrades camera setup would be a good start...", "label": 0}
{"text": "This seems like such a miserable way to live. Life is too short to devote this much energy to being paranoid about data that companies like Google get from you.", "label": 0}
{"text": "gonna switch to a Chinese phone next gen. much better value for money", "label": 0}
{"text": "Well they finally upgraded the Telefoto this year, but not the damn x3! It's the same for 4 years damnit", "label": 0}
{"text": "Note to everyone that Larry Page is still evading subpoenas relating to Epstein.   \n\n>In 2023, the US Virgin Islands tried several times to serve Page a subpoena in the lawsuit over JPMorgan Chase's links to Jeffrey Epstein. \n\nThe 'best' part is that this is from under the [\"Personal Life\" section of his wiki](https://en.wikipedia.org/wiki/Larry_Page#Personal_life) vs a Legal/Controversy section.", "label": 0}
{"text": "Saying that with owning a Xiaomi 😂😂", "label": 0}
{"text": "👍", "label": 0}
{"text": "If they're selling in the EU after 6/2025 they have to support at least 5 years, by law.", "label": 0}
{"text": "Sorry, Zap_Series2, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "The R series always have 2.0 so it's expected. For the flagship line, since the 7 pro they all have 3.0, except OnePlus 11 :/", "label": 0}
{"text": "And you have access to all the photos. It's really interesting to compare how places change over time.", "label": 0}
{"text": "Yeah I absolutely love it, for some reason. \n\nI also like the timeline for the satellite view on google earth. There's some aerial footage of the area I live in from the 1940s and 1960s, you can see it going from fields, to a half built village, to a 50 year old village now.", "label": 0}
{"text": "Dimensity 9300+ (1x 3.4ghz X4 + 3x 2.9ghz X4 + 4x A720)\n\n6.67in 2712x1220 144hz Amoled\n\n12/256,512,1TB\n\n5 yrs OS (from 14) and security (quarterly) updates\n\n5000mah 120w fast charging\n\nList 799 euro 12/256 899 12/512 Street $700 12/512\n\n\n-\n\nThey noted rather poor web performance in benchmarks but said irl it doesnt feel it so could be some dimensity quirk in the test.", "label": 0}
{"text": "Then your opinion isn't worth the shit stuck to a stray dog's arse.  Putin  (who cancelled the death penalty when he took office & gifted 100million people out of poverty) is far less like the image you have been painted of Hitler than are a majority of the members of the US Congress (where free speech has been curtailed, peacefully protesting students & their lecturers, beaten by armed police), the UK (where they take away old people's winter fuel allowance whilst giving billions to US proxy Ukraine & sending bombs to Isreal), and the EU (where you get imprisoned for wearing a Palestinian flag T-shirt).  Suppose you think what Putin has done in Eastern Ukraine is wrong. In that case, you are ignorant of the facts (the US-orchestrated & funded coup overthrew a democratically elected government, installed the party that lost the election, which then waged war on the Eastern provinces) and an insult to any Jews whose relatives suffered at the hands of the Banderites.  The US has been responsible for 50 million dead civilians since the end of WW2 (which Russia won (learn real history)), whilst how many have China or Russia killed?  The military operation in Ukraine has the lowest civilian death rate of any war in modern history, in 3 years, killing fewer civilians than Israel did in 6 months.", "label": 0}
{"text": "Price seems too high when you can get an s24+ for a little more.", "label": 0}
{"text": "Yeah and now gmaps wants to turn on avoid ferries and tolls or turn on avoid highways for no reason other than to torture you! Get bent goog!", "label": 0}
{"text": "I, and I imagine millions of others, would have taken additional drives (whether personal or uber etc.) instead of public transit but for Google Maps great integration of public transit networks.", "label": 0}
{"text": "Well, did you buy the Asus Zenfone 10, or Zenfone 9?\n\nOh, you didn't?\n\nGuess why they don't make them small anymore.", "label": 0}
{"text": "Just get a widget. Launchers don't magically change the way your device works, but somehow half this subreddit seems to think so.", "label": 0}
{"text": "Sorry /u/s_senju21, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, s_senju21, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Most Nokia's did run Symbian.", "label": 0}
{"text": "Sorry /u/s_senju21, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I had a good chuckle at how small the phone was, especially knowing that would have been considered relatively large for the time.", "label": 0}
{"text": "Probably too distracting and unnecessary", "label": 0}
{"text": "I can't wait to buy this 3 years after its released.\n\nI have a huawei mate 20 x. I bought that thing in 2022. Thats 4 years later.", "label": 0}
{"text": "> What were the original advantages of Android compared to iOS, before it turned more and more to iOS-like system?\n\nThe better question to ask, and I'm amazed *that youve neglected to do so youreself*, is:\n\n> How much can you afford to *lose* to be \"free\"?\n\nI don't fucking like Apple telling me what I can/not do with the stuff I own/use. It feels a lot more like \"I paid the equivalent of $649 in 2007 US dollars for a *license* to use an iDevice\". It's like paying $60 for a game on Steam, except **because it's Steam**, *you don't OWN the game* - you merely *bought a $60 license* to play the game.\n\nI also don't like having System Administrator privileges on my devices. That term came from the days of Microsoft's **Windows Vista** and its overly aggressive UAC backend, where *elevating your user privileges* by converting your user account to `sysadmin` could override all UAC warnings/prompts. Went into the first year as an Android user doing all those rooting and rom flashing shit\n\nBy the end of that first year I was fucking sick of that shit. It certainly didn't feel like I fully *owned* the device, rather, it felt more like I was *unpaid working for the device*. These days I just want shit to work *and I'm not going back to iPhones*. If I want more functionality than Android I'd need to use full blown Linux on a phone, Terminal and all, which AFAIK is nowhere near production-ready and user-friendly for the masses. \"20XX is the year of Linux!\" lmao.", "label": 0}
{"text": "Any update on this from your end?", "label": 0}
{"text": "Not my Xiaomi 14U or Vivo X100U. Strangely, for the past 2-3 years, the Ultra variants never had faster charging than their Pro models.", "label": 0}
{"text": "Sorry, ronin-godslayer, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Steve Jobs even does a demo of it in the first keynote presentation - https://youtu.be/VQKMoT-6XSg?si=TBznUBHNXGuX-YQt&t=2753 (Google Maps starts at 45:55).", "label": 0}
{"text": "#r/AndroidGaming", "label": 0}
{"text": "I wanted to do this but didnt know its possible so good!", "label": 0}
{"text": "You're awesome! Incidentally, I have some random cool projects you might find interesting here:\n\nhttps://github.com/jazir555?tab=repositories", "label": 0}
{"text": "L take.", "label": 0}
{"text": "I absolutely loved that thing back then. Felt so futuristic.", "label": 0}
{"text": "It's going to be an *insane* resources for historians in the future.", "label": 0}
{"text": "Might just be T-Mobile they don't support, it lacks some of the most important bands for T-Mo US. At least the 9S Pro and Nubia Z60 Ultra do.", "label": 0}
{"text": "Sadly with USB 2.0 (for people that care about wired data transfer.)", "label": 0}
{"text": "I'm pretty sure car manufacturers hate Google Maps even more, because it rips that juicy \"let's charge $600 for half-assed navigation and extra $$$ for updates\" option from their grubby hands.\n\nI just wish Google Maps would stop using weird Californian notation for instructions. Because why would you say \"turn slight left\" when you clearly taking a normal left turn, and not call u-turn a u-turn.", "label": 0}
{"text": "However, they delete some street views from time to time. They caught my entire middle school class on the street, it was up for years, but recently I noticed it is gone. I wish I had saved a screenshot of it.", "label": 0}
{"text": "I get a new car rental every week for work. Companies are definitely trying to make it more difficult to use Google maps. Some are cool and let you use Bluetooth. Others will only play music now through Bluetooth. You need to have the right cable to connect and use maps in some cars. It's annoying. I don't mind competition but don't force your product on me like that. Especially if it's sub par. If you want to compete make a viable alternative.", "label": 0}
{"text": "\"You no longer need your Windows PC and your Android phone to be on the same Wi-Fi network to quickly transfer files.\"", "label": 0}
{"text": "I doubt it, they wouldn’t do it unless a competitor did it first. The Google of today is much more reactionary then it used to be, not to mention the fear of public backlash would stop them before the mention of such a project even made it past the first stage.", "label": 0}
{"text": "Sorry, Error_40-4, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, Error_40-4, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": ">popular apps are full of videos and the experience is terrible on a smaller screen\n\nI have an old iPhone 4s lying around, and I went back to see just how bad the video viewing experience is...and holy cow, I don't know how we went for years watching videos on sub 5\" screens", "label": 0}
{"text": "#### Hey there Talonjackson, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I've been itching to finally upgrade from my S9 and looking forward to the S25 for the release trade in promos, but all the latest news seems negative on the camera, screen, battery, etc.\n\n\nI wonder if I should start researching Chinese phones, since the S24 has the screen grain issue (I often use my phone on low brightness so it would be noticeable). Or the S23, or the Pixel, or...", "label": 0}
{"text": "Honestly, just keep your S9 if it does what you need it to do. I wouldn't recommend upgrading to anything newer than the S20 series/Note 20 Ultra, as the new phones are basically those but with less features. The 20 series can be bought relatively cheaply used. My S20+ and Note 10 Plus look and function great, and have performance that is identical to my friend's S23.", "label": 0}
{"text": "Anyone can make their own architecture with enough money but the whole thing is a patent landmine. ARM, Intel and IBM collective hold alot of patented techniques for modern chip building.\n\nThe costs of multiple patent lawsuits may outweigh the costs of just paying ARM off.", "label": 0}
{"text": "TL;DR\n\nGoogle is considering adding an under-display infrared (IR) camera to the Pixel 11, based on a leak from Google’s chips division.\n\nThis would enable more secure and versatile face unlock, addressing limitations of the current face authentication system that relies on regular color cameras.\n\nThe Tensor G6 chip is expected to support the new IR camera system, potentially matching Apple’s planned under-display Face ID technology for 2026.", "label": 0}
{"text": "Ever since the disappointing G5 leak looks like a lot more G6 articles are releasing.", "label": 0}
{"text": "Pixel 9 barely released, already talking about Pixel 11, wtf.", "label": 0}
{"text": "honestly that's lame. then why did they add a ultrasonic fingerprint sensor in the first place?", "label": 0}
{"text": "Hb a native shortcuts/routines app, better quick settings, more lockscreen customization and a way to remove at a glance...", "label": 0}
{"text": "You can disable Fast charging on Samsungs tho, if that was your goal.", "label": 0}
{"text": "The S9 gets the job done and the battery surprisingly lasts an average day of infrequent use, so I could stick it out to year eight. My current reasons for wanting to change are the charging, camera, and hardware capabilities. There is also a disconcerting internal jiggling sound when the phone is shaken, but nothing has come of that yet.\n\n\nI noticed the camera quality falls off a cliff in non ideal conditions with strange processing when looking through photos from my last big vacation, which was a big letdown. I have heard that Samsung isn't the greatest at photo processing though.\n\n\nI've never replaced the charging port or battery but at the moment a charge takes 5 to 6 hours, if the cable is bent the right way, and three times slower than that charging in a car. I could theoretically fix this DIY for less than $100 according to Google.\n\n\n\nI also used to play mobile games in the past but I haven't for a while now; I'm not sure if that's because I've changed or my phone has no storage space for huge modern mobile games which run up to 10-20+ gb each. I remember my phone getting hot back in 2020/2021.\n\n\n\nIt is also nice that the prerelease trade-in deals don't caring how old my S9 is, as its value is otherwise $50 or less in online calculators.\n\n\nHowever, it is also true that newer phone models won't have an earphone jack or SD card slot, although I only use the earphone jack very very rarely.", "label": 0}
{"text": "With the  Dimensity 8020 chipset at its core, the Infinix Zero Flip delivers impressive speed and efficiency! The expansive 6.9-inch AMOLED display makes everything look stunning, whether you’re browsing or watching movies. Coupled with a long-lasting 4720mAh battery, this phone is perfect for users who want both style and functionality in a foldable device.", "label": 0}
{"text": "Some people have a new phone and wait for future phone? I personally look forward to pixel 12 to replace a55", "label": 0}
{"text": "Sounds like a great idea! Gj Google", "label": 0}
{"text": "sure. but how come galaxy s24 ultra still lags while taking photos indoor? creating smeary and blurry shots?  its not lack of hardware power.", "label": 0}
{"text": "The school kids grew up and are now working in their marketing team.", "label": 0}
{"text": "Sure but how reliable do you think these 'leaks' even are? my guy please.", "label": 0}
{"text": "There's a timeline feature for street view too. Is it not there?", "label": 0}
{"text": "Yes, the timeline for this location goes back to 2007 and has 9 years viewable. But they removed the year with my classmates - it was about 30 of us, dressed in uniforms, 12-13 years old. No idea why Google removed it. Someone should start archiving street view because it could be lost at anytime", "label": 0}
{"text": "Probably because it was cheaper than adding a IR camera. For a while you needed a notch and I’m sure Google rather not have one since they would get roasted. If google plays their cards correctly and listens to their audience they should have both options available and the user gets to pick their preference.", "label": 0}
{"text": "It’s not free ?", "label": 0}
{"text": "Sorry /u/waterrrrrrrrtd, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Similar story here. My Samsung phone still works fine even 6 yrs later. The only noticeable issue is that the battery has degraded somewhat but not to a degree that its unusable outside. ", "label": 0}
{"text": "The trick is to never buy the current phone. You gotta always hold out for the phone 2+ generations out. I'm personally holding out for the Pixel 15 which is gonna bring back the IR blaster and headphone jack! /s", "label": 0}
{"text": "True. Also GPS systems have come a long way. Phones have assisted GPS using cell towers. Other nations have launched their own satellite constellations. This massively helps connectivity and accuracy. Also the newer generation of GPS and Galileo (EU) satellites have more accurate signals.", "label": 0}
{"text": "I don't think you appreciate where and how we got to the AI/ML age.\n\nSmartphones have been the driving force of understanding all sorts of data. Android is the most widespread OS in this realm. \n\nGoogle is an Ad company that sells software. YouTube was bought by Google and take a guess what they did with it....ads/monetization on a money sinking pit because of hosting costs.\n\nAlphabet is their holding company, I urge you to see how deep into the game they are....they literally have Waymo all around SF. They are much bigger and their moves are extremely nuanced. They don't innovate like the small guys because they'll just buy them.\n\nFear public backlash? Google? Have you seen the ever ending list of dearly loved products they've taken? They are ruthless if they can't turn a profit.", "label": 0}
{"text": "#### Hey there KendoArts, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "I wish Ai could fix the biggest problems with these articles by just replacing clickbait titles with the actual information.", "label": 0}
{"text": "I'm talking here on the case sharing from pc-to-phone and vice versa, on my windows PC i have to install software specifically to enable this share, and per my understanding i need to have Bluetooth or something in order to be able to share which is invalid for my case since i have a Desktop PC.\n\nAs for sharing with others (phone-to-phone), what's wrong with email or drive or even Whatsapp (considering image/video quality compression is not a big deal for the majority out there)", "label": 0}
{"text": "> DeArrow fix\n\nDude, Thank you !", "label": 0}
{"text": "I meant Nokia own navigation.", "label": 0}
{"text": "The features I actually want back:\n\n\nHardware fingerprint reader\n\n\nReplaceable battery\n\n\nSD card slot\n\n\nAudio jack\n\n\nSize that is usable with one hand\n\n\nHonestly if there was ever a community motherboard swap project to convert Nexus 5X to modern performance standards I would pay $1000 for it", "label": 0}
{"text": "Why are you unnecessarily taking up storage space over email or drive when you can just send a copy of it wirelessly? You are creating solutions by creating unwanted problems first. People who do stuff like you say eventually end up with reduced cloud storage. Maybe you are buying Terabytes of storage but not everyone is as privileged as you. Tech is about accessibility and ease of use.", "label": 0}
{"text": "That's good to know but something like replacing RAM sticks on a laptop is far beyond the repair capability of the average consumer.", "label": 0}
{"text": "I'm still happy with my 5yr old phone", "label": 0}
{"text": "There is probably a reason why Apple stuck to the IR sensor for face unlock all these years.\n\nSoftware might work for some faces, but I doubt that it is as consistent as a IR face scan.\n\nThey probably realized this after so many years.", "label": 0}
{"text": "fwiw articles nowadays have a tldr right below the image", "label": 0}
{"text": "The Infinix Zero Flip, powered by Dimensity 8020, is impressive in the foldable market. It manages to deliver high performance and battery efficiency, making it perfect for multitasking and gaming. Mediatek’s chipset keeps things smooth even with high-demand apps, showing foldables can be powerful and practical daily devices.", "label": 0}
{"text": "I’m impressed with how the Dimensity 8020 chip powers the Infinix Zero Flip. This foldable is not just about looks; it’s packed with serious performance capabilities, thanks to Mediatek. The battery life is solid too, which is crucial in foldables. It’s a solid choice for tech enthusiasts and casual users alike.", "label": 0}
{"text": "So the linux kernel is unsuccessful? Or “the web”?", "label": 0}
{"text": "That's interesting because for me it is seamless. One of those bits of tech that does just seem magical.", "label": 0}
{"text": "You missed the important part; \n\n>Instead, your Windows PC just needs to have Wi-Fi turned on, even if it’s not connected to any network.", "label": 0}
{"text": "I tried transferring files from my phone like 60gb of data. Transfer speed at less than 200kb/s. Ridiculous. \n\nI took my cable and transferred that way. And its faster.", "label": 0}
{"text": "Probably your router or router settings.", "label": 0}
{"text": "Transfer speed is dependent on your wifi connection and nothing else really. Move closer to router.", "label": 0}
{"text": "Default scheduler is definitely undercooked for S8 Elite if Xiaomi can gain so much free performance with less consumption.", "label": 0}
{"text": "I've never used Magic Eraser equivalents on Samsung or Apple phones. But based on the few comparison articles I've seen online, they also mostly do a worse job than Pixel Magic Eraser.\n\nGoogle also does not use AI to _preserve_ the metadata (that is trivial), but to edit the gain map and then multiply it with the initial gain map to match the edits to the SDR image.\n\nI don't understand what we're discussing. Google could only output an SDR image if you used certain editing tools before, now it outputs an HDR image. It is a net benefit for all users. Great on Samsung and Apple if they already did this.", "label": 0}
{"text": "Sorry /u/Resident-Ant8281, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "what kind of setting?", "label": 0}
{"text": "Tenker du på Flex tilbudet? Ser ikke noe innbytte..", "label": 0}
{"text": "The massive chip leak from a few years ago that detailed the chips for the Pixel 8, 9 and 10 was correct so far. The author of this story has done quite a few credible leaks as well.", "label": 0}
{"text": "peak r/Android comment", "label": 0}
{"text": "I really hope they keep making the non-XL Pro. Please give me 3 good cameras, a bit more battery and not an oversized display and I will by the Pixel 10 Pro", "label": 0}
{"text": "\"Do I get the Pixel 11 or wait for the Pixel 12?\" /s", "label": 0}
{"text": "Because if phones today had easily swappable batteries, their capacity would be like halved. There's a reason why there's no need to switch batteries in the middle of the day anymore. Even with the pixel's subpar battery (and the fact that the pixel 6 which I have is nearly 3 years old), worst case scenario (unplugging at 7am, plugging in at 8pm) I'm down to about 15% after a long day", "label": 0}
{"text": "How about a new 1\"-type sensor? \n\nWhat about oversampled 4K option when recording video? So the end result is 1080p video with a smaller size, but 4K crispness. \n\nCould we get focal lengths along with zoom values? \"1.5x\" tells me nothing. What is its focal equivalent? Almost all modern smartphones show that now. Pixel still does not. \n\t\nI would love focusing speed control when recording video. Modern smartphones focus so quickly that sometimes it causes focus hoping as the camera locks on another subject. I would like an option that slows down the focus reaction, and slows down focus transition to make it more cinematic. \n\nI don't know how is it on modern Pixels, but focusing is hit and miss on my 4a. Sometimes it gets it right, but other times you can tell it's off just slightly. Make focusing more precise if that's still an issue. \n\nWhat happened to slomo? Progress stopped on it. Can we get 480fps @ 1080p? 960fps @ 720p?\n\nThis would be truly innovative, how about coming up with a solution to a 180 degree shutter rule in bright daylight? So the shutter speed is not so high in bright daylight causing videos to be all crackly and unpleasant.\n\nCan we fix ash, noise, and grain in Pixel photos? - [Pixel 4a](https://i.postimg.cc/zJdTmq5f/10-a-EHq-Atd.jpg), [Lumia 950](https://i.postimg.cc/CxhntQQD/09-xud-Fp-K2.jpg)\n\nCan we fix evaporating blur at the edges of photos? - [Pixel 4a](https://i.postimg.cc/R4Q65vLz/19-Pixel-4a-Camera-PX-Automatic-mode.jpg), [Lumia 950](https://i.postimg.cc/mbhtHCfb/20-s-Xf-Qr-St.jpg)\n\nCan we address Pixel's handling of purple? - [Pixel 4a](https://i.postimg.cc/k72mNc4h/51-LEh-YZwo.jpg), [Lumia 950](https://i.postimg.cc/4Z1sXyqw/52-5-W7-S6-XB.jpg)\n\nCan we improve the lack of sharpness and \"thick lines\" caused by HDR slapping multiple photos together? - [Pixel 4a](https://i.postimg.cc/1mhs3qy7/44-2-IWTcrq.jpg), [Lumia 950](https://i.postimg.cc/2mNSzP6j/43-q-K2am-WO.jpg)\n\nYou know what? Forget it. Too much effort. Just give me 100x AI painted zoom, and fake cinematic blur that I will never use, please.", "label": 0}
{"text": "It's not just people remembering Windows Phone with rose tinted glasses. There were plenty of people suffering from Stockholm syndrome while they were using Windows Phone. They were so convincing I bought one.\n\n\nI hade a Microsoft Phone that shipped with WP8 and was later updated to WP10. It was absolutely terrible in every way: the keyboard was shit, the browser was shit, the calendar was shit, the e-mail client was shit; and worst of all the supposedly great maps app with offline navigation was utter shit, the maps were so out of date they were completely useless.\n\nAt the time I looked back at the Android phones I had before, even Android 1.6 was a better user experience than the turd Microsoft released years later.", "label": 0}
{"text": "It takes years to design a phone.", "label": 0}
{"text": "It takes years to design a phone.", "label": 0}
{"text": "But I heard the Pixel 17 is gonna bring back removable batteries", "label": 0}
{"text": "They pulled an alternative maps app aimed at replicating the look and feel of the iOS 5 Google Maps app. The pulled app was not made by Google, but was powered by Google Maps", "label": 0}
{"text": "LocalSend is about as savvy as it can be.\nInstall\nSend file to a device, which will be listed automatically. If not then choose device number displayed on another device\nLiterally zero config, zero uneed user interaction required", "label": 0}
{"text": "https://preview.redd.it/6lbze3lzthxd1.jpeg?width=1080&format=pjpg&auto=webp&s=a3c5fad0d7e91337064be7a7b4cec0b2963d5e02", "label": 0}
{"text": "I recognize phones are getting larger so our concept of mini has changed. But I think for something to reasonably be called mini, it should be smaller than the base model s24 or iPhone 16 or Pixel 9. \n\nwhen you're larger than the three base model flagship phones, how can you be mini?? least make it 6 in or something.", "label": 0}
{"text": "Is iris unlock possible?", "label": 0}
{"text": "TL;DR\n\n\n- Google plans to release a custom Tensor chip for Pixel Watches in 2026 alongside the Pixel Watch 5.\n\n\n- The “NPT” chip will use older CPU cores, following a trend in wearable chips prioritizing efficiency over cutting-edge performance.\n\n\n- Details like the process node and modem are still unclear, but the chip is expected to enhance smart features.", "label": 0}
{"text": "Oh yea. I remember when I first got GPS on my phone and I was blown away how accurate it was for like…2010 or whenever it was. Now I’m mad if GPS doesn’t know where things are in my carpet fibers. It’s gotten crazy good.", "label": 0}
{"text": "From the article, it sounds as though this should now be using a direct WiFi connection as it does between Android devices, so proximity to the access point shouldn't matter.", "label": 0}
{"text": "I know I've transferred files between my phone and computer with Quick Share without being on the same network. It wasn't Bluetooth either, I would not have transferred a 1 gig file over BT.", "label": 0}
{"text": "Not sure if it's good news, Tensor has been plague by performance and efficiency only really made acceptable with G4. On the other hand, W5 is like 3 years old at this point and Qualcomm still doesn't seem very invested in wearable chipsets even if it was the first decent wearable chip theyve made.", "label": 0}
{"text": "Yasss. Hopefully, just like the pixel 4, we'll be able to access that camera directly with third party apps for fun low res IR imaging", "label": 0}
{"text": "Which makes Pixel UI the de facto stock Android.", "label": 0}
{"text": "It's a hardware leak. Hardware and software are very different and so are the teams working on them.", "label": 0}
{"text": "#### Hey there Acanthisitta_Known, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sony does the same thing with camera sensors on their phones", "label": 0}
{"text": "Never had problems. Multiple networks with subnets, multi-tier networks, repeaters and mesh node. All of them work seemlessly.", "label": 0}
{"text": "lol, we are way beyond lag now and it has been the case for at least 4 years. My old phone's Kirin 980 barely showed any lag after a whopping 6 years of usage. All these shiny numbers of newer CPUs are just marketing scams.", "label": 0}
{"text": "Just as Dimensity 9400 phones are ariving on the market.", "label": 0}
{"text": "> Software might work for some faces, but I doubt that it is as consistent as a IR face scan.\n\nI just hate that I can't use it at night in bed.\n\nAnd then it's either get blinded by the light from using the finger print reader camera, or enter my PIN like a caveman", "label": 0}
{"text": "Using A55 core from 2017 in 2026 ☠️", "label": 0}
{"text": "It wasn't pulled from the store, it was never on the store because it used to be pre-installed.", "label": 0}
{"text": "That gave you terrible transfer speed before.", "label": 0}
{"text": "Nope\n4 OS update, from 14\n\n\nXiaomi 14T Pro\nUpdate Frequency\n90 Days\nRelease Date\n2024-9\nSecurity Update EOL\n2029-9\nOS Version - Future\nAndroid 15,Android16,Android 17,Android 18\nOS Version - Shipped\nAndroid 14", "label": 0}
{"text": "Less likely if Google doesn't follow what Samsung did in Exynos W1000.", "label": 0}
{"text": "Samsung Foundry's 3nm GAA node made Samsung LSI able to put Cortex-A78 in Exynos W1000 which lead to a huge performance leap compared to the previous Exynos W920/930 and Qualcomm's W5(+) Gen 1.\n\nNow Exynos W1000 is the second most powerful chip for smartwatches after Apple's S9 and S10.\n\nIt makes me curious if Google will also adopt TSMC or Samsung's more advanced nodes and try to put C-A78 as well.", "label": 0}
{"text": "If you aren't too worried about accuracy, they can already do this.", "label": 0}
{"text": "Do we know if it works on a PC without a wireless NIC that is currently connected via ethernet? Seems like that should be a thing, but I'm not sure.", "label": 0}
{"text": "There is no Pixel 18 cuz Google discontinued their smartphone division.", "label": 0}
{"text": "For one, I was talking about OS updates, not apps. Second, the main use case for an OS is to run apps, if your apps are lagging then there's no point in lauding OS being snappy.\n\nLike I said, Windows 98 on Pentium 4 is snappy, but actually using it for any purpose is going to be hellish.", "label": 0}
{"text": "Nuvia had a cheap license to make server chips.\n\nQualcomm bought Nuvia and pivoted to making consumer chips.\n\nThe license for making consumer chips that Qualcomm has cannot transfer to Nuvia without ARM agreeing to it.\n\nARM is suing because Qualcomm broke that license agreement.", "label": 0}
{"text": "Why would i want to use a cable !! My photos are always backed up via google photos, and if i want to send anything else to my PC, Pushbullet is more than perfect.\n\n  \nThe only exception or real use case that i can think for a quick share is you want to share something with someone else nearby whom you can't (or don't want to) communicate with via Instant Messaging app.", "label": 0}
{"text": "They're accurate. Android Authority is a decent source and Kam is a reliable author. Looking at a chips capabilities and outlining what it's capable of is not a leak.", "label": 0}
{"text": "I can't believe people are still bitching and moaning about headphones jacks in 2024. If you spent all that energy doing literally anything else you could have earned enough cash to buy a pair of wireless headphones every other day.", "label": 0}
{"text": "Brother your phone has thousands of LEDs. It's called a screen.", "label": 0}
{"text": "The features I actually want back in my laptop:\n\nCD ROM\n\nFireWire \n\nPhysical latch to hold the screen down when closed", "label": 0}
{"text": "Yeah who wants to carry around an external DVD drive in 2024?", "label": 0}
{"text": "* The “NPT” chip will use older CPU cores, following a trend in wearable chips prioritizing efficiency over cutting-edge performance.\n\nWhat a joke lol. Look at the Exynos W1000.", "label": 0}
{"text": "https://preview.redd.it/m0lpd02ivixd1.jpeg?width=904&format=pjpg&auto=webp&s=2fa2fceb235eee3e04ea52b3784271f028e0e432\n\nPicture for context", "label": 0}
{"text": "Nope, you just pull off the back panel and pull out the battery. Sorry for the TikTok video, that's the first result I found: https://www.tiktok.com/@fairphone/video/7307325374994681120", "label": 0}
{"text": "They gave me more for my P8 than I paid for it. Plus $200 in Google store credit.", "label": 0}
{"text": "I'd actually be okay with this. They kinda suck at the hardware side of phones.", "label": 0}
{"text": "So just transfer via proximity", "label": 0}
{"text": "Literally the top 4 links on this subreddit right now are from  androidauthority, and labeled rumor. \n\nGo ahead and search the word \"Could\" on this subreddit see how many hits you get.", "label": 0}
{"text": "If you have fomo, you will find all the excuses in the books to waste money. I did my part, hopefully someone else will benefit from my experience.", "label": 0}
{"text": "Did he stutter?", "label": 0}
{"text": "God bless one drive", "label": 0}
{"text": "Definitely seems more greedy than before. Before 2015, it seemed like focused more on innovation and bringing in people into Google or introduced to them. After that, just the shut down of various products, cutting off unlimited storage and pixel products and offerings.", "label": 0}
{"text": "\"quietly\" annoys the hell out of me", "label": 0}
{"text": "If I remember correctly. Tomtom and Garmin were pretty buggy and slow. Google Maps came out were really ahead of their game.", "label": 0}
{"text": "I just wish they'd make a 49mm to compete with Apple's largest offering.  \n\nThe 45mm of the new Pixel watch is nice but I don't think I'll be happy until Google makes a watch akin in form factor to a Garmin.", "label": 0}
{"text": "Any access point built in the past 10 years should get more than 2Mbit. If you are far enough to drop that low your connection will probably drop out", "label": 0}
{"text": ">Ever find yourself hooked on a Netflix scene that sticks with you long after it’s over? Now, with Moments — a new mobile feature launching globally today on iOS and **in the coming weeks on Android** — you can easily save, relive, and share your favorite Netflix scenes.", "label": 0}
{"text": "I'm sure LocalSend is absolutely perfectly easy to use once it's installed, but just installing it is a big hurdle for the average consumer. \n\nPeople can handle installing something directly from Google on their laptop to work with something already on their phone. But asking an average consumer to download something from some random website they've probably not heard of before (Github) to work with another app they need to install is a big ask for a lot of people.", "label": 0}
{"text": "Hi! Thanks for all your feedback. I am active on the app and most of the features you talked about are almost ready to be released ;) There's also other features that you may or may not find helpful depending on your use case of the app. The new release will be out soon. Thanks for your interest.", "label": 0}
{"text": "Not really the most explosive news out there... they've got a custom Tensor chip in the Pixel Buds Pro 2. They're slowly changing over to Tensor for everything.", "label": 0}
{"text": "I was getting like 100 MB/s the other night. Never saw it go anywhere near that fast before. Not sure if this is the result of the update or some other random factor.\n\nWhat's too bad is it's hella inconsistent.", "label": 0}
{"text": "Easy: delete phone link. Problem solved", "label": 0}
{"text": "I am still pissed off at the skeevy Best Buy salesman who sold my grandfather like $600 worth of Garmin devices in 2010 to give us as Christmas gifts.", "label": 0}
{"text": "Idk it's pretty silly", "label": 0}
{"text": "You might want to use a modern, non-A pixel and compare photos (specifically your lunia comparisons). Many of those comparisons looks different/better now.\n\nThe blur at edges has only gotten worse with pixel 6 and later as that is what happens with all phones with larger sensors and the needed optics. Same for other phones besides pixels.\n\nhttps://www.reddit.com/r/GooglePixel/comments/rbaake/discussion_pixel_6_pro_camera_images_blurry_edges\n\nI'm down for some of your other wants (focal length called out in zoom, focus speed control) but many of these features exist simply in other camera apps.", "label": 0}
{"text": "As someone with an ethernet desktop, I really hate how random things like Quickshare and Miracast require a wi-fi connection. Why can't my phone be on the wi-fi and my desktop on ethernet? They should still be able to talk to each other...", "label": 0}
{"text": "$629 for a Pixel 7 Pro is wild lol.", "label": 0}
{"text": "If you sent it to only fully charge when you usually unplug the cable, that can lengthen battery life.", "label": 0}
{"text": "So wifi direct?", "label": 0}
{"text": "thats a weird looking laptop", "label": 0}
{"text": "I didn't realize this wasn't a thing as Samsung kept the one-click toggle in the quick-settings instant access which I primarily use for these toggles.\n\nI'm personally a fan of tap to toggle, and long-press for more in-depth control.", "label": 0}
{"text": "Been waiting for years. On beta, but no dual rca. Guess I will wait some more.. ⚰️💀", "label": 0}
{"text": "You can find these phones for like 300. 😭They are smoking crack", "label": 0}
{"text": "Yeah, I prefer how it is currently. Why would one need to toggle the radios constantly instead of just connect or disconnect to a network?\n\nAlso, the new design looks hideous. Hopefully they improve it.", "label": 0}
{"text": "I sometimes accidentally turn it off on galaxy since it's a one tap.", "label": 0}
{"text": "Did I miss something or didn't they say they wouldn't make it more iOS-like becuase people hated the new design?", "label": 0}
{"text": "Are they still stuck with horizontal scrolling all apps section, I had a hope that they would switch to vertical scrolling one", "label": 0}
{"text": "Well, I don't sync my photos to the cloud and I hadn't ever heard of Pushbullet before, so I use QuickShare. It's not that hard to understand.", "label": 0}
{"text": "Big disclaimer is they arent guaranteeing new batteries\n\n> [Seybold stopped short](https://www.theverge.com/2024/10/28/24281735/google-pixel-6-7-refurbished-phones) of guaranteeing any specifics about battery health when we asked. Both Samsung and Apple replace the batteries for their refurbished phones, while Google’s blog post says “If any phones need work, our technicians only use authentic Google parts for the repairs.", "label": 0}
{"text": "Sorry, this is not my affiliate link. I pulled the link from Slickdeals where it was posted yesterday.", "label": 0}
{"text": "what innovations are you waiting to see trickle down?", "label": 0}
{"text": "Thanks. Fixed the link in my original post.", "label": 0}
{"text": "how budget and what kind of innovation?\n\non the very low end theres alot of margin squeeze with oems trying to go from emmc to ufs and go to 1080p 90 or 120hz while having to keep adding more cameras. This is making them keep using the same old helio chips to keep costs down.", "label": 0}
{"text": "To save battery when you’re outside. More convenient to have a one-tap toggle to turn off wifi and bluetooth.", "label": 0}
{"text": "Nope, its the batteries, even when in storage capacity you don't want Li-ion batteries sitting on the self for more than 2 years.", "label": 0}
{"text": "If you're losing battery significantly when not on Wi-Fi you have bigger problems than the radio.", "label": 0}
{"text": "Their copy of the Control Center is less customizable than iOS 18's.\n\nHow is Apple beating Samsung of all companies on options, you would think they would go all out on quick settings.", "label": 0}
{"text": "almost 2 years ago I got a Pixel 6 refrub from a best buy sale for $99.  Hoping for a similar deal on a 7 or 8.", "label": 0}
{"text": "Not necessarily. Your phone does keep scanning for new networks if the radio is on, which consumes battery. Especially when the battery is old.", "label": 0}
{"text": "I wonder what was the yield rate for the W1000? Supposedly the smaller the soc, the higher the yields?", "label": 0}
{"text": "I hope they dont, horizantal is the superior one.", "label": 0}
{"text": "So Google joins Apple in making their own refurbs at a high price.", "label": 0}
{"text": "Ah ya my refurb Pixel 4XL 3 times for the back panel says otherwise about their quality. I haven't had to refurb my 6, 7 or 9 though so hopefully it got better.", "label": 0}
{"text": "I can click one time on my Nothing Phone", "label": 0}
{"text": "I've been testing this feature for a while now (via Insider Preview) and it doesn't work as well as the article suggests. Syncing often hangs up and transfer speeds over USB are still significantly faster than Phone Link, for example...", "label": 0}
{"text": "They were doing some crazy early-bird pricing in the UK. \n\n256GB 14T Pro + Xiaomi Pad 6 128GB + 50W wireless charger + £50 bonus trade in credit for £486.\n\n512GB 14T Pro + Xiaomi Pad 6 256GB + 50W wireless charger + £50 bonus trade in credit for £524. \n\nConsidering you can get roughly £200 for the Xiaomi Pad 6 on eBay you were effectively paying under £300 for the phone.", "label": 0}
{"text": "128Gb refurbished phone near the end of 2024 for that prices... really wild", "label": 0}
{"text": "To make it super clear the magnetic wireless charging works with certain cases only.\n\nApologies if I've missed the sarcasm.", "label": 0}
{"text": "The pill form of notifications looks cruel🤬", "label": 0}
{"text": "Same, when I first switched to One UI this took awhile to get used to. Just switched back to pixel and this feels more intuitive to me.", "label": 0}
{"text": "I have no clue what you mean by just get a widget.", "label": 0}
{"text": "They might if they're locked in with Google Store Credit.", "label": 0}
{"text": "Samsung already has this feature ", "label": 0}
{"text": "People are comparing it to face id but it's more similar for windows hello. Using an ir camera and standard camera for authentication has been Microsoft's MO since before face ID existed.", "label": 0}
{"text": "That's what the ir camera is for.", "label": 0}
{"text": "Because minors and privacy reasons ", "label": 0}
{"text": "If you read the article. All this info is from the same leak. They are just releasing it slowly to keep up engagement and to get more clicks.", "label": 0}
{"text": "it's really no different than google drive etc appearing in the file explorer", "label": 0}
{"text": "Apple has puppet strings attached to them. Samsung doesn't know what to do and has been down trending for a while.", "label": 0}
{"text": "If they never removed it then they wouldn't be able to market it as an incredible new feature of Android 16", "label": 0}
{"text": "My pc is connected via Lan as well, and last I checked I couldn't use quick share except for bt.", "label": 0}
{"text": "> The Tensor G4 is not a good chip at all\n\nOnly a Sith deals in absolutes. What a joke of a comeback.", "label": 0}
{"text": "With this you get both implementations in a single partitioned toggle (left half being a quick toggle, right hand for opening the pane). What do you lose with this implementation?", "label": 0}
{"text": "This isn't removing the pop out menu. You still have 1 tap access to the pop out menu *and* and quick toggle now. What is your complaint exactly?", "label": 0}
{"text": "Sends as standard mms between my desktop and pixel 9 xl", "label": 0}
{"text": "QI2 doesn't necessarily mean that it has magnets on the back.", "label": 0}
{"text": "Sad. One UI 5 was the best, 6 is worse and 7 looks like a further deterioration", "label": 0}
{"text": "As intuitive UI intended. R/android likes to shit on oneui chumps, and sometimes they do have points, but damn man. There is a reason why Samsung is synonymous with android in many parts of the world.", "label": 0}
{"text": "It's been removed from Good Lock, and the Good Lock Devs have said it's because the option will be part of the main release. So I hope so!", "label": 0}
{"text": "Do you have a link? Curious and want to see it.", "label": 0}
{"text": "By my measurements on s20fe 5g keeping Bluetooth and wifi active drains around 0.5 to 1 % extra per hour (work has no wifi, I leave the phone on the table not touching it so this is around 10 hours of pretty heavy doze)  for context leaving always on display on with auto brightness drains between 1 to 2 % per hour. Not the end of the world but noticeable.", "label": 0}
{"text": "No it isn’t", "label": 0}
{"text": "OMG, I forgot about that store! Amazing deals!", "label": 0}
{"text": "Thank fuck. I hate, and I mean absolutely hate having it open up a more detailed menu. Just let me turn the fucking thing on or off", "label": 0}
{"text": "Only if the Internet can go back 5-10 years.", "label": 0}
{"text": "It's just porn starved redditors", "label": 0}
{"text": "I like it the way it is now, honestly. I don’t need to turn off WiFi or Bluetooth much. I’m not sure why so many people on Reddit feel the need to do this. I’d rather have things like Bluetooth always on and ready to use. Especially since I use wireless buds that connect the moment they come out of the case. It saves me time just to leave the Bluetooth on.", "label": 0}
{"text": "No sane or normal person cares about geekbench or even knows what it is\n\nThey care more about the camera", "label": 0}
{"text": "Click area.", "label": 0}
{"text": "All I want is better predictive text.", "label": 0}
{"text": "The Samsung implementation of quick settings is way better IMO", "label": 0}
{"text": "Yeah, but in the 17, the get rid of the headphone jack again!", "label": 0}
{"text": "eh, it's a lot different than it used to be. Now it's just an amazon outlet for overstock and returns.\n\nStill neat, also very different than it once was.", "label": 0}
{"text": "I just use the Perplexity app for most of my searches now", "label": 0}
{"text": "I had to use Tasker to get this functionality back. Fucking Google.", "label": 0}
{"text": "Why don't you just use messages.google.com/web ? It can be installed as a web-app as well. Works perfectly fine also with RCS :)", "label": 0}
{"text": "i dont think it would be great as that is the only SOC made on Samsung \"3nm\" class node based on GAA. Rumors are Exynos 2500 may get cancelled are circulating around. At last all models of S25 and even S25FE are not going with the chip.", "label": 0}
{"text": "I find it's useful, but if I don't log into Windows frequently enough I have to reset it up every time.  And then it's just not worth the time investment to get it set up. I find a similar circumstance if I'm trying to use Samsung flow on my tablet or whatever\n\nIt's cool that it can do it. I guess I just don't use my Windows laptop enough these days to really get my money's worth out of them. \n\nmost stuff I can do on my phone. honestly, I could get most of my work done with a good phone with USBC video output mirroring.", "label": 0}
{"text": "not really, pixel is a skin. stock Android is the open source version of Android that Is far more bare Bones and doesn't have any other pixel exclusive features .\n\nI do understand that the term stock Android has sort of become shorthand for stuff like the pixel or Motorola which largely leans into a lighter skin with a vertical app drawer and so on. \n\nBut technically speaking, pixel is a pretty specific and modified version of Android. But all of this is pretty pedantic.", "label": 0}
{"text": "sort of like the Microsoft rewards program. The more apps you buy or books or micro transactions, the more points you get. sometimes you get double points if there's a special deal. \n\nI've never gotten much use out of it. although I'll get couple hundred play points a year just from spinning the wheel once a week. \n\nI usually just trade it in for $1 or $2 in store credit and use it to buy It an app. or maybe get the pro version of an app I'm already using.", "label": 0}
{"text": "6 months of free Hulu or Disney Plus?", "label": 0}
{"text": "I think most android phones already do that? \nOnly Pixels seems to have that thing which doesn't make any sense.", "label": 0}
{"text": "I won a OnePlus 12R. On some YouTube channel this year. first time I have any experience with them and one thing I like about it is how they don't shove AI down my throat.", "label": 0}
{"text": "I got my P7 for like *$200*. Lmao", "label": 0}
{"text": "Obviously. And that's why they needed the radio toggle.", "label": 0}
{"text": "I think your taking his joke way too serious", "label": 0}
{"text": "I mean, r/android and especially pixel related subs still think PixelUI is \"stock android\" when stock android is borderline unusable if not a completely different experience all together. LTT did a great video on it.\n\nNot surprised.", "label": 0}
{"text": "Ugh, so much wasted space \n\nI really hope they leave in some ways to customise it", "label": 0}
{"text": "And summaries of news articles too.\n\nI got so tired of having to X out of an auto playing video and skimming through 6 paragraphs just to find the point of the article", "label": 0}
{"text": "What's this but? I haven't got this yet?", "label": 0}
{"text": "I absolutely despise the right side quick settings pull down action on iOS and nobody will like it on One UI. It's significantly less ergonomic to reach to the center/left of the top of the device than the top right corner. Of all the things to copy from iOS, this is definitely one of the worst.", "label": 0}
{"text": "Everything works fine, Bank apps with Denylist work, also with shamiko. Device passed every check excepting for strong integrity and SELinux check on rootbeer, after some testing, i believe Zygisk Denylist its better than Shamiko in the detection of some anti-cheats wich shamiko doesn't bypass. I activate enforce denylist to play games with xigncode3 anti-cheat but use shamiko for the rest of apps\n\n(Note: The anti-cheat of the game 'Limbus Company' its practically impossible to bypass, atleast with my knowledge and the previously mentioned results)\n\nMagisk v28 \nModules: 'Shamiko v1.1.1' 'Anti bootloop v1.3.1' 'Play Integrity Fix v17.9' 'Zygisk - LSPosed v1.9.3_MOD' (lsposed 1.9.2 kept crashing)\nLSPosed Modules: 'Hide my applist v3.3.3'\n\nSo far, it has been working fine on\nDevice:Xiaomi 12T Pro (Diting)\nOS:HyperOS 1.0.7.0.ULFMIXM (Global Rom)", "label": 0}
{"text": "You can pick up an s20 fe 5g for $150 that is quick enough for anything outside of emulation of AAA games, or even an s23+ for 400-450 off Amazon. It's really hard to get \"more\" anymore outside of software improvements and folding phones. Innovations come from fancy camera features and QoL software updates. iPhone has been rough the same since the 13.", "label": 0}
{"text": "I don't think there is a Oneplus deal in the US anymore unfortunately. Well l don't think they released anything this year yet anyway.", "label": 0}
{"text": "Photos, file transfers, media controls, notifications, pretty much everything but phone calls.", "label": 0}
{"text": "I have explained how to do that to peopme that age. For most people, it’s not *that* hard. \n\nPrivacy should never be opt-in.", "label": 0}
{"text": "#### Hey there Humble-Basis5787, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Is there a button to just one-click WiFi or mobile internet?", "label": 0}
{"text": "Xiaomi and OnePlus have it like that as well.", "label": 0}
{"text": "Embarrassing pricing, just like the Apple refurbished store.\n\nApple can mostly get away with it because their reel value isn’t terrible unlike Pixel phones.", "label": 0}
{"text": "OnePlus has one of the best android skins for sure.", "label": 0}
{"text": ">Naturally it gets first class android update support and most features advertised by android updates come first to pixel.\n\nNo, most features that come first to pixel never end up on \"stock android\". Stock android is so bare bones you can't even make a phone call properly.\n\nPixelUI is just as much of a vision of Android as OneUI. They are so far removed from stock android that calling PixelUI stock android is wholly misleading.", "label": 0}
{"text": "Thanks for sharing!", "label": 0}
{"text": "Aww I bought one from woot a few months ago for $440 but it was 256gb. That's insane for 512", "label": 0}
{"text": "Lmfao why would you wanna buy a refurbished when new gets deeply discounted so often", "label": 0}
{"text": "I call pixelUI stock android because again, it's *google's* vision for android. I'm not implying that actual stock android is in any way usable because it isn't.", "label": 0}
{"text": "I literally work in tech in security. A read receipt is not an reasonable expectation of \"privacy\".\n\nConversations in real life involve seeing if the person you spoke to has heard you. The same is reasonable with written conversation. We aren't mandating response, or even the feature be on, but it is fairly reasonable to assume in a conversation with someone that they be able to tell if you heard them. To enforce this unnatural mute mechanism doesn't make sense.", "label": 0}
{"text": "I see, and I can understand your opinion. Though \"stock\" in this case refers to \"source\" which a company like Samsung for example builds on top of. It's no longer stock by definition, and calling it stock just confuses people outside of Android users or people who are not well informed, regardless of its Google since PixelUI has many exclusive features you won't see on other phones.", "label": 0}
{"text": "HOLY SHIT GAME CHANGING", "label": 0}
{"text": "To compete with themselves?\n\nIn the real world, they're the number 1 seller of foldables globally. It's really only in these weird niche spaces that you have people pretending as though experimental phones from China whose durability is untested and whose software support is limited, are better.\n\n\n\n\n\nIf I'm not mistaken this device also sold out within minutes of launch.", "label": 0}
{"text": "> your entire argument reeks of entitlement, arrogance, immaturity and tone deafness\n\nYikes. Imma stop reading here, go outside, learn how to have a normal conversation with real people. Learn how to match your delivery to the subject being discussed.", "label": 0}
{"text": "Probably wanting to bang on the fact that it behaves like an iPhone with better specs in terms of camera", "label": 0}
{"text": "> As someone with an ethernet desktop\n\nI can relate but I have not felt the urge to use QS on windows. If you want you can buy a 10€ usbwifi card and be able to use QS?", "label": 0}
{"text": "Sorry /u/Pepibro, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Why do manufacturers always skim on RAM", "label": 0}
{"text": "Ok but what about Android 15 lol?\n\nThere's nothing notable yet.", "label": 0}
{"text": "Sorry /u/Pepibro, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "You assume Google is capable of having a vision.", "label": 0}
{"text": "Looking like that AI supercycle all those wall street investors were betting on for fruit isn't coming.", "label": 0}
{"text": "Reading /r/android is so strange on a Samsung sometimes because of that.\n\nLike wait that's a Samsung thing not and android thing? Well I guess it's good everyone is getting it...", "label": 0}
{"text": "Totally agree", "label": 0}
{"text": "What the f... us this s...\n\nLike for real...its like Apple and Xiaomi had a baby...", "label": 0}
{"text": "Phone link does that just fine. Maybe you aren't clear on the difference between mms and rcs. Look it up.", "label": 0}
{"text": "You have to factor in inflation as well.  Putting in the same tech costs the same as when they built it in the first place. Then adding higher tech is higher in price.", "label": 0}
{"text": "It'll do that anyway even if you turn WiFi off. You'd need to go into location services and disable WiFi and Bluetooth scanning as well or the first step is mute. \n\nI find my GPS is worse though when they're off, Google maps says low accuracy basically all the time with it off for me.", "label": 0}
{"text": "Especially if you live in the USA. Much less available brands and models across different price ranges compared to the rest of the world.", "label": 0}
{"text": "I agree 100%. I love iOS for how clean it looks, but hate the limits. One UI blew me away. Samsung has come so far since my S8", "label": 0}
{"text": "It's also so limited in customization, I believe, so people aren't running around with Choco-cookie font and ugly icon packs with homescreens in disarray, besmirching their good image.", "label": 0}
{"text": "But wouldn't you need the menu to switch the device anyway? The toggle and menu are together so it's saving you going into the entire settings isn't it?", "label": 0}
{"text": "If they added RCS support maybe I would consider using Phone Link.", "label": 0}
{"text": "It's a different leg of the same spider so it's not uncommon to see better discounts or completely different ones across the same products but it still makes the examples look bad in comparison. I imagine they're collecting some back from the plan you take out with the device one so there's better discounts as a result.", "label": 0}
{"text": "I love it too", "label": 0}
{"text": "[Wireless Power Consortium: Qi Standard](https://www.wirelesspowerconsortium.com/standards/qi-wireless-charging/)\n\n**Qi2 devices feature Magnetic Power Profile technology which aligns devices and chargers perfectly for improved energy efficiency, faster charging, and easier usability.**", "label": 0}
{"text": "Even if it is not great, the pretty much have the watch game nailed down.", "label": 0}
{"text": "Roku is completely garbage...compare to this.", "label": 0}
{"text": "Quick settings looks terrible as well. The brightness and volume sliders are unnecessarily massive.", "label": 0}
{"text": "If they are on the same lan then they can see each other already", "label": 0}
{"text": "The notification history is kinda dogshit compared to the one on Pixels, easily accessible by clicking the \"no notifications\" text in the notification shade (or through the settings if you don't want to dismiss other notifications)", "label": 0}
{"text": "I wonder how the W1000 compares with the Apple S10. Given Apple has actually been pretty stagnant with their watch chips, I could imagine Samsung might have outpaced them.", "label": 0}
{"text": "Hopefully that means watches will get 5years of support.", "label": 0}
{"text": "You're right! I felt like something was off with my math and that's get from quickly skimming and believing the top of the list was the most current - thanks for pointing out how I was wrong", "label": 0}
{"text": "I was told by some dude a few months ago that the trade off for 6000mah was taking out wireless charging, and that the paper thin coil was the reason they managed to fit more capacity.\n\nlol", "label": 0}
{"text": "What a pile of shit that quick settings menu is.", "label": 0}
{"text": "I really hope this is true. It's a shame it's not projected to be in the Pixel 10. I'd even trade a larger hole punch out for that sensor back. The soli sensor on the Pixel 4 was incredibly underrated. The face unlock not only worked reliably, but it was wicked fast, and worked perfectly in the dark. There isn't a single task performed as often on a phone as locking/unlocking. Nothing has felt as responsive as the Pixel 4 was.\n\nOther handy features included how the alarms and ringtones would lower volume a bit as your hand moves close to the phone. I really appreciated that and miss it all the time. Being able to skip songs/videos was a bit of a gimmick feature, but handy on rare occasions. \n\nThe matte glass finish with matte black metal sides was also just such a refined look. I hate the trend of glossy metals we have these days.", "label": 0}
{"text": "Or go to settings and reset the app.", "label": 0}
{"text": "i dont want a ransomware encrypting both my pc and phone storage at the same time", "label": 0}
{"text": "Samsung would prolly take a couple of years to try to figure out how to produce lithitum-silicon batteries (the new battery tech in question) themselves\n\n  \nAs for Apple they better call ATL (the company producing OnePlus 13's battery) fast, where do they even get their batteries rn", "label": 0}
{"text": "I already skipped the S24U. This doesn't give me confidence that the S25U will be much of an upgrade either.", "label": 0}
{"text": "More correctly i think it's reference to specs rather than innovation. The charge was led primarily by Redmi Note, they have decided to sandbag since the 10 series since they feel comfortable \"namebranding\" with their *existing* market and the rise of Transsion made them unwilling to compete in their market   \n\nRedmi Note 10 was a huge leap from 8 & 9 while 11,12,13 still hasn't caught up to the 10 in various aspect. Transitioned to amoled and at this price point. Their SD678 cpu still beats note 11, 12 & 13. Got a hefty imx582 sony sensor bump, 11 and 12 \"downgraded\" to jn1. Note 13 got a comparable hm6 but it's weak SD685 doesn't allow it to record 4k which the 10 could for $150 in 2021     \n\nAnd more crucially Redmi Note 10 vs Note 10 Pro actually had tradeoffs and function more like an preference rather than the current offering of existing to upsell the Pro/Pro+", "label": 0}
{"text": "I really wish want companies to push sensor size yet again. Gimme micro 4/3 please", "label": 0}
{"text": "Pixels are notoriously unreliable. Chinese ODM devices stomp all over them in that regard.", "label": 0}
{"text": "FFS Google we have more important things to fix than fucking around with these buttons every few releases. Can you please get someone to remove 97% of the garbage in the UI in the play store and just focus on being a simple app update and search tool? And can it please just fucking automatically update at least once per day on its own so I don't have to keep checking for updates every so often only to find 31 apps our of date each time? This is some basic stuff.", "label": 0}
{"text": "100 PCT, categories were the best", "label": 0}
{"text": "It is mostly good, but why cut off 3.5jack, sd card and use an obsolete soc 😮‍💨", "label": 0}
{"text": "Android auto support?", "label": 0}
{"text": "#### Hey there MajinDipu, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry /u/make1e10, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "One of the early selling points of Android for me. Google Maps on my Nexus One felt light years ahead of the iPhone at the time.", "label": 0}
{"text": "> In apps with smooth high-speed display and game settings registered in the gaming menu turned on, the display is updated 120 times per second while a black screen is inserted between frames. When these settings are turned off, the display state changes four times as fast (the display state changes 60 times per second) to achieve 240 times per second. Depending on the specifications of the application, 4x speed (240-Hz) display may not be possible.\n\nFascinating tech. Didn’t some VR headsets do this, black frame insertion?", "label": 0}
{"text": "Lol 8s Gen 3 for 1,200+ USD?? That chip is worse than 8 Gen 2", "label": 0}
{"text": "> high-performance Snapdragon® 7s Gen 2 Mobile Platform\n\nOkay, this gets a bit complicated due to Qualcomms (intentionally) very confusing naming, but basically:\n\n- The Snapdragon 7+ Gen x series is fantastic, practically on par with the 8s and sometimes even with the 8.\n- The Snapdragon 7 Gen x series is good overall, a true midranger.\n- The Snapdragon 7s gen x series is total dogshit you should avoid at all costs\n\nWelcome to *branding*…", "label": 0}
{"text": "Kinda disappointing they went for 7sg2, was expecting a 7sg3 based on rumours.\n\nPerhaps they are reserving it for the Sense 9 plus?", "label": 0}
{"text": "You could always long-tap to access the selection menu.", "label": 0}
{"text": "I actually kind of like the current one. One Click to see all the options, long-press to open the settings.\n\nIt just feels intuitive to me.", "label": 0}
{"text": "It's a way to price gauge, in my honest opinion. It might be uncompetetive *now*, but sellers will take note of these prices and while used prices will never reach these levels I bet they'll slowly creep up over the next couple of months.", "label": 0}
{"text": "Yeah you can keep them for that price, Google..", "label": 0}
{"text": "Older designs are simpler and more efficient sub-1ghz than newer core designs. Phones have the battery capacity to push higher frequencies so new designs take advantage of that. That's why phones 10 years ago and now still aim for the all day battery mark, despite having capacities of over double.", "label": 0}
{"text": "Respectfully, I am not that retarted and have turned location accuracy, mobile data always active and and other background garbage off. Still, needed to be said.", "label": 0}
{"text": "Can't make the user use a cable if they don't want to include them with the phones anymore.\n\nThe included cables are the only ones that reliably charge AND transfer quickly. Most people have offbrand charging cables that have no useful data throughput.", "label": 0}
{"text": ">Respectfully, I am not that retarted \n\nlmao bad time for a typo.", "label": 0}
{"text": "I don't. don't want that ugly notch of the iPhone ruining that beautiful display", "label": 0}
{"text": "OnePlus makes my nipples hard", "label": 0}
{"text": "I dont have the phone but there is a comparison where P9p outlasts s23 ultra and one of the lastest iphones in throttling and battery by a significant amount. I take the benchmarks with a pinch of salt for that reason. I kind of think of it as having a very powerful gpu in a computer that runs unoptimized game vs having mid range GPU running very optimized game. Pixel with it's mid tier chip, but in house optimization from every angle, makes sense for 99% of people and Google wants to invest in features that satisfy the highest amount of people. Maybe I'm wrong though.\n\nI guess I'm the weird one because im more worried about the screen ratio, I don't mind small phones if they are wide enough like iphone for instance, but tall and thin looks weird to me, I returned P7 for that reason and I guess p9 is similar in size to p7.", "label": 0}
{"text": "It's on by default", "label": 0}
{"text": "With the new version you can access your android phones drive in windows file explorer as if it's an usb flash drive. Copy, paste, delete also has clipboard sync.", "label": 0}
{"text": "They do have a vision though. Make the absolute worse use of screen space, ensure a ton of nested menus and shove AI into everything!", "label": 0}
{"text": "Linus makes one video about using a GSI and suddenly everyone and their mom thinks they know what stock android is", "label": 0}
{"text": "It was patched", "label": 0}
{"text": "OnePlus 12 camera is fantastic", "label": 0}
{"text": "Smartphones have been stagnating for close to a decade", "label": 0}
{"text": "It's very nice, how the people themselves raised such a Google to treat them like this. You deserve all of this.", "label": 0}
{"text": "Development for Syncthing Android has been discontinued due to lack of contribution and google play app permission problem sadly.", "label": 0}
{"text": "No offence but Roku isn't even in the same ballpark\n\nHow incredibly locked down it is as well as how performance wise it does worse with nearly every application (even compared to devices of similar specs) due to using its own bespoke OS which apps struggle to optimise for", "label": 0}
{"text": "Wow, I've got the Roku Ultra and it's pretty great.", "label": 0}
{"text": "Fair point. I'm just used to a much stricter security profile than that.", "label": 0}
{"text": "See, you had to resort to insults with pretty much no knowledge at all, then had the abundantly unintelligent audacity to suggest that I'm the one with the problem. Scuse you", "label": 0}
{"text": "Not to mention the ability to encrypt the data (with syncthing and some actual cloud providers).", "label": 0}
{"text": "People use tf out that app, someone will fork it again, if they haven't already", "label": 0}
{"text": "give me my sim enable disable backkkk", "label": 0}
{"text": "6.1\" display! Must be the smallest \"new\" Android on the market", "label": 0}
{"text": "and in real world applications you will never even notice the difference anyway.", "label": 0}
{"text": "It is under the screen, the ones on Iphone there is no screen", "label": 0}
{"text": "If still 10/100 then that's a no from me, Dawg.\n\nIf they add 1g then I'll either buy or wait for the next model up to replace my Shield Tube.", "label": 0}
{"text": "I just wish they'd let me turn off auto connect for certain Bluetooth devices. It's very annoying when someone else drives our work car, but my phone connects to it from inside the office.", "label": 0}
{"text": "Is it using BT? Must be slow as shit then.", "label": 0}
{"text": "Sorry, forebearpro, your post has been automatically removed.\n\nYour account is brand new or has low karma, and our subreddit experiences a lot of spam from new accounts. As such, we remove submissions from brand new accounts to prevent spam.\nIf you're a developer who's new around here or if you're trying to promote your website/article, please ensure that you've throughly read our rules, in particular Rule 4 and 5.\n\nhttps://www.reddit.com/r/Android/w/rulesandregs/\n\nYou may also want to be aware of reddit's own guidelines on self promotion\n\nhttps://www.reddit.com/wiki/selfpromotion\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "and TVs too\n\n\n\n\nTho I hope they fix the sense9's screen, the sense8's screen had a lot of green screen issues", "label": 0}
{"text": "They're taking things slow, they've only restarted selling outside of Japan in 2023", "label": 0}
{"text": "I really hope Sharp changes their marketing tactics this year, last year they didn't give any review copies of their phones so they didn't get any exposure\n\n\n\n\nand they also really should cut down on the excessive bonuses, for example here in Indonesia the Sense8 launched at $400 but had a $100 Traveloka coupon bonus, who tf wants that \n\n\n\n\nno wonder the sense8's price quickly plummeted to $250", "label": 0}
{"text": "Wait a minute, so Android 14's (16) UI looks like this in notification bar!? I thought it's of Lineage21 OS.", "label": 0}
{"text": "Its a shame that Nvidia stopped updating Shield. That was the best streaming box but software issues made it meh and no longer updated. No other company filled that level of box as they all went with cheap boxes.", "label": 0}
{"text": "This looks like a weird choice. How can plus be better than pro? And if it is better, why is the ram lower than the pro? Plus is coming out with android 14 and still no update for the pro that came out just months ago.", "label": 0}
{"text": "still having this issue? I waited a little bit so they fix issues but not sure about  updating my pixel 7 tbh", "label": 0}
{"text": "I would rather get the a25 lol...", "label": 0}
{"text": "for some reason Sharp phones cost more in Japan compared to other countries, prolly bc of carrier deals\n\n\n\n\nfor example，the R8 Pro was also 1240 USD in Japan, but when it came to Indonesia it started at 1000 USD ", "label": 0}
{"text": "They finally figured out that forcing a singular 17mm ultra wide camera to also serve as main and zoom camera, no matter how large, is not a good idea 😆", "label": 0}
{"text": "I would agree with you if it had RCS support", "label": 0}
{"text": "It brings up this \"internet\" section which then allows me the option to turn off/on my data and wifi.", "label": 0}
{"text": "Classic Google, charging a premium for a half-assed product.", "label": 0}
{"text": "HyperOS, One UI, the ColorOS family. Funtouch is pretty custom, but it doesn't diverge too far from stock.", "label": 0}
{"text": "Ehh it's Walmart though. Everything associated with their brands is junk though.", "label": 0}
{"text": "If it's anything like previous versions then it needs Bluetooth to sync but doesn't use it for file transfers, but my desktop doesn't have Bluetooth so I couldn't even connect 🤷", "label": 0}
{"text": "Microsoft doesn't seem to know a lot of things these days.  Try reporting a technical glitch to the Outlook Android app and let me know if you ever hear anything back.", "label": 0}
{"text": "Sorry, One-Mathematician673, your post has been removed because it violates one of our rules.\n\n>Images related to Android must be posted as links in a [self-post.](https://www.reddit.com/r/Android/submit?selftext=true)\n\n>If posting an image that is not self-explanatory, please provide an explanation in the self-post body.\n\n>Exception: memes, comics, reaction gifs, or silly screenshots are not allowed, under any condition.\n\nPlease [read the rules](https://www.reddit.com/r/Android/wiki/rulesandregs) and submit accordingly! Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "The Onn 4K Pro has gotten favorable reviews across the board.", "label": 0}
{"text": "At meats I clapp something...", "label": 0}
{"text": "the big reviewers never review them, I've only ever seen reviews from smaller reviewers who bought the phone themselves", "label": 0}
{"text": "Didn't they use 7sg3 on their R9? As Sense is a lower tier smartphone, getting 7sg2 is pretty good.", "label": 0}
{"text": ">  6.1\" compact size.\n\nThat is a funny sentiment these days...", "label": 0}
{"text": "Camera hardware is basically oppo find x6 pro (minus the uw) + leica lenses", "label": 0}
{"text": "Trash", "label": 0}
{"text": "You can still use the older one", "label": 0}
{"text": "Sorry /u/Modifoid, but your submission was removed as you included a post body within your submission. We do not allow users here to insert their bias/opinion (Rule 6) in direct link submissions and, due to [a bug that reddit](https://www.reddit.com/r/ModSupport/comments/1174ccv/why_are_users_able_to_tag_text_alongside_a_link/j9a6cyh/) seems OK with please omit the post body next time. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "We know nothing about camera specs yet so it might end up being worse, we'll see.", "label": 0}
{"text": "#### Hey there gillesgroulard, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "But you could always access that with a long press. There's currently no way to just single tap turn on/off those settings.", "label": 0}
{"text": "Only the x200 pro does, the rest are still optical", "label": 0}
{"text": "It is actually insane how far ahead the Chinese brands are to samsung, apple, google, etc... It is not even remotely close anymore", "label": 0}
{"text": "that is like asking a device to be used on windows xp, when it was released with drivers for windows 10...how are you supposed to get the drivers for older versions of the OS if none ever made them?", "label": 0}
{"text": "Right now mot facing issue , i took my phone to local repair shop and told him to clean the usb port and he cleaned and gave me back \n\nI first checked with slow charger to just check \nAnd its working now", "label": 0}
{"text": "Due to the new more dense battery tech almost all the upcoming phones will see huge jumps in batteries,\nOf 500-1000mAh. Its been 5 years since S ultra is on 5000", "label": 0}
{"text": "What?\n\nHow can they sell their own refurbished devices without replacing the most important component of a used/refurbished/old phone?\n\nThey already have the phone open to replace the screen and shell, why not do the battery at that point?", "label": 0}
{"text": "Well I think they had wireless charging early and then got rid of it and people were pissed so they brought it back lol", "label": 0}
{"text": "Also, unlike the Japanese version which has [*nothing* on the box](https://youtu.be/3zPXD0Mby8s?si=lVncYKsWwrAAX0-x), the Indonesian version of Sharp phones gets an  complete package of [charger/case/TypeA-Type C adapter/earphones/screen protector](https://youtu.be/IUHG8o-RREk?si=zPVVFvqpabYh7r7L)", "label": 0}
{"text": "Google's batteries are heavy! For some reason OnePlus & Motorola have longer usage between charges and are much lighter in weight. And they super charge in less than an hour. Google is not top of class, just barely above mediocre from my experiences.", "label": 0}
{"text": "When I bought my Japan spec r8 pro in cocoro store, they offer an option that gave free screen protector, lens protector and protection case. Quality were shit though", "label": 0}
{"text": "Random thought - I remember my Pixel 5 5G had bangggger battery life back in the day", "label": 0}
{"text": "The DAC is perfectly fine, for basically all IEMs and easily driven headphones.", "label": 0}
{"text": "That's embarrassing.", "label": 0}
{"text": "not even in the same galaxy", "label": 0}
{"text": "Cool!Glad to hear that.", "label": 0}
{"text": "Happy about the battery, but they keep going opposite of what I'd like for everything else. It's too big, opted for wide angle camera instead of tele, main camera has lower f stop. ", "label": 0}
{"text": "#### Hey there Awkward-Ease-2051, your post has been automatically filtered for further review for the mod team. It does not mean your post has been removed!\n\n> Rule 2\\. \"We welcome **discussion-promoting** posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (support questions, rants, customer service complaints, selling/trading devices, etc). Your post will be removed if it is part of the latter category.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_2._we_welcome_discussion-promoting_posts_that_benefit_the_community.2C_and_not_the_individual.)\n\nYou may be interested in:\n\n- [Our daily threads](https://www.reddit.com/r/Android/search/?q=daily+superthread&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidQuestions / [Your device's respective subreddit](http://www.reddit.com/r/Android/wiki/subreddits) or [xda-developers.com](http://forum.xda-developers.com/compact).\n- /r/PickAnAndroidForMe - Device recommendations. You could also look at our wiki where we recommend [entry-level](https://www.reddit.com/r/Android/wiki/affordable), [midrange](https://www.reddit.com/r/Android/wiki/midrange) and [flagship phones](https://www.reddit.com/r/Android/wiki/flagships)\n- The [Saturday Appreciation threads](https://www.reddit.com/r/Android/search/?q=saturday+appreciation&include_over_18=on&restrict_sr=on&t=all&sort=new) or /r/AndroidApps - App recommendations.\n- /r/AndroidGaming - For all things gaming on Android.\n- /r/AndroidThemes - Customizing your device.\n- /r/AndroidPreviews or /r/Android_Beta - Queries regarding Android betas/previews.\n- /r/Android/wiki/switchingfromios -If you're an iPhone user considering the switch from iOS to Android.\n- /r/androidafterlife - Finding uses for your old devices\n- /r/AndroidTV - For queries related to Android/Google TV\n- [The AOSP tracker](https://code.google.com/p/android/) - Reporting Android bugs/feature requests.\n- [eBay](http://www.ebay.com/), [Swappa](http://www.swappa.com/), [craigslist](http://www.craigslist.com/), or /r/hardwareswap - Selling, buying or trading devices.\n- Additionally, you might be interested in viewing our [IRC  or Telegram chat servers](https://www.reddit.com/r/Android/wiki/index#wiki_.2Fr.2Fandroid_chat_rooms). \n\nFeel free to message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fandroid) if you want further information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Android) if you have any questions or concerns.*", "label": 0}
{"text": "What", "label": 0}
{"text": "i paid less than 500euros for my 6a in 2022.\n\ni don't think that will happen with the 9a... 700 minimum i would guess.", "label": 0}
{"text": "It is true I swear!!, a lot of posters have had the same experience. Hopefully, the OP13 uses the same ultrasonic scanners as the S24 and not the S23 as those were not compatible.", "label": 0}
{"text": "The 9 Pro is better but the 9 is still really good. Most reviews from sites *and* users I've read mention the 9 having really good battery life.", "label": 0}
{"text": "I'll be surprised if the lens isn't designed and made by manufacturers like Largan in Taiwan, but I guess we'll never find out, I am also not sure Zeiss can contribute much software wise, Leica make more sense because they still make their own digital camera bodies.", "label": 0}
{"text": "It was using the Snapdragon 765, which was much more efficient but a budget chip with less power meant for mid tier devices.", "label": 0}
{"text": "I have am S23 with some cheap plastic screen protector and after re scanning my fingerprint it's been working just like before for what it's worth", "label": 0}
{"text": "Yeah and I think that's such a stupid idea for companies to take into consideration. I understand that they are trying to think of everyone who's the phone but for the most part from my experiences working for a phone provider, I can go ahead and tell you that about 99% of old people have absolutely no idea what half of those buttons will do 😂 And in the ones that do know what the buttons do, rarely ever touch them because they hate their phone changing because they'll just use it to and I quote \"I only need to send text and calls and that's all I need it for\" I hear it on a daily basis", "label": 0}
{"text": "If you look at the horrible \"reflection\" that plague recent iPhones, you will understand how very important the lenses are for those tiny camera and how big of a difference does it make in low light situations.", "label": 0}
{"text": "likely next year if they keep expanding", "label": 0}
{"text": "I intend to purchase one myself to do a review on youtube", "label": 0}
{"text": "they're just adding carbon powder into batteries. \ncurrently at 10% carbon, they're achieving around 30% increased cell density.", "label": 0}
{"text": "FTP: *Am I a joke to you?*", "label": 0}
{"text": "Hence the issue with how mobile OSes are developed (particularly Android). Drivers are tailored to the OS version, while in the Windows world, things are more flexible (though with varied degrees of success).", "label": 0}
{"text": "To a point, yes. Lens design for tiny phone camera modules hasn't actually changed that much however. There's a reason Google keeps using a 4 year old samsung GN1 in their phones, and the IMX363 for every model before the 6. The pictures keep getting better, the Pixel routinely tops \"best phone camera\" charts, the sensor and lenses don't change.", "label": 0}
{"text": "That's probably the reason why Apple will make a \"Slim\" iPhone next year. Now they have the energy density to make their designers wet dreams come true.", "label": 0}
{"text": "Opening the actual settings app, but that's not what I want. I want a single tap to open the pop out menu, not actually leaving my current app", "label": 0}
{"text": ">There's currently no way to just single tap turn on/off those settings.\n\nAnd I don't want that, I want a single tap to open the pop out menu", "label": 0}
{"text": "Im aware about it\n\nBut google are a beginner designers compared to apple or Samsung", "label": 0}
{"text": "Because all the others skimp on it so the competitors can too. All of these boxes outside of the Nvidia Shield TV and the Apple TV seem to made from terrible components that are all equally slow whether its because the processor sucks or they don't give it enough RAM. I kinda blame Roku and Amazon for making it normal for these slow set top boxes/sticks existing in the first place as they sold the most early on and shaped the expectations for these devices.", "label": 0}
{"text": "Anology to the Microsoft Xbox branding these days:\n\nSnapdragon 7s = Xbox Series S\nSnapdragon 7 = Xbox Series X\nSnapdragon 7+ = Desktop gaming PC with RTX 4090", "label": 0}
{"text": "Always did, some were sold in Europe during the early to mid 2000s.\n\nThey only restarted expanding globally since 2023", "label": 0}
{"text": "What makes it sound crap?", "label": 0}
{"text": "Not sure where you get that from. No fingerprint scanner issues at all with cheap screen protectors on my S23 ultra.", "label": 0}
{"text": "All I care about is if it will make batteries last longer in general, or if 2 years is when we start really noticing the degradation still.", "label": 0}
{"text": "I wouldn’t be surprised if they never release an update for it again. I know they probably use to be good with updates, but companies change.", "label": 0}
{"text": "Plastic probably be the better option for phones with cruevd screens.\n\nThe only glass screen protectors that stay on the on curve displays and are compatible with Ultrasonic FPS is the white dome glass protectors but they are very pricey.", "label": 0}
{"text": "Knowing them they'll just take advantage of the increased density to provide the same capacity in a thinner form, rather than actually improving something. \n\nMaybe they'll be gracious enough to add 30W fast charging if people are lucky.", "label": 0}
{"text": "Ok, that's true, but the effect is negligible in the scope of this conversation. The SoC will throttle before that is a problem.", "label": 0}
{"text": "Battery life is not the same as battery health.", "label": 0}
{"text": "I have the cheapest tempered glass protector on my s23 and it works about 95% of the time after re adding the finger prints. Maybe I got lucky :))", "label": 0}
{"text": "They haven't. They recently issued a hotfix patch you can download, so someone is definitely still working on updates(unless the hotfix patch was the last one).", "label": 0}
{"text": "Under display fingerprint readers all seem like a solution to a problem that was already solved by having the sensor on the back of the phone.", "label": 0}
{"text": "Names have hit a new low with \"X200 Pro Mini Deluxe Super\"", "label": 0}
{"text": "that battery patent is only available for use in china as of now, i dont think apple has access to it unless they order batteries from CATL", "label": 0}
{"text": "It was just an example to say you cannot do that cause there arent drivers compatible.  \nYou can actually force most W11 drivers to work on W10, but it is the same for W11 rolling back to W10, if a device has no compatible W10 drivers, you couldnt use it. Most legacy Android version would actually work fine on any device, but the issue would be indeed the lack of devices drivers. The same for custom roms, they need those drivers too.  \nAnother issue you would encounter is app compatibility, many apps dont work at all with older android version, even if the phone itself can run an older android version.", "label": 0}
{"text": "its supposedly about the same since OEMs have not really maximised the amount of carbon they are using. iirc having 100% carbon in a battery is possible, but its prone to explosion", "label": 0}
{"text": "My zenfone has magnetic wireless charging without a case. (Stick on mag ring)", "label": 0}
{"text": "Just use tap-to-focus to get what you want in focus. Although the Xiaomi 14 Ultra has a variable aperture which is a very cool feature.", "label": 0}
{"text": "Shame about that software tho.", "label": 0}
{"text": "Tensor is inefficient, not sure if it's the architecture or some other software issue but the chips just use more power.", "label": 0}
{"text": "I'm only going by what other users have said so I could be wrong!!!.\n\nMy FPS works 100% and is fast with a glass protector on on my S24.", "label": 0}
{"text": "I agree about the UI thing, some changes seem to be made just for the sake of making changes.  \nBut I can say that the OS thing is basically the same on apple devices, I have an old Ipad and it cannot be upgraded above a X ios version (ios 9 if i remember correctly), it is kinda unusable for anything else than browsing cause most apps requires a newer ios version.", "label": 0}
