{"text": "The call was never disconnected, so Turbo Granny heard everything. It's not explicitly clear in the anime, but chapter one of the manga shows the call duration when the alien picks up the phone.", "label": 1}
{"text": "lol", "label": 1}
{"text": "yea", "label": 1}
{"text": "mhm", "label": 1}
{"text": "i see", "label": 1}
{"text": "...", "label": 1}
{"text": "nice", "label": 1}
{"text": "???", "label": 1}
{"text": "lol", "label": 1}
{"text": "Not just Hestia familia....", "label": 1}
{"text": "Hey, 1/100 of the original’s the best I can do!", "label": 1}
{"text": "No for free like a website. I’ve been using hi anime but it’s down ", "label": 1}
{"text": "Adding in some additional details from the LN that aren't covered explicitly in the anime, the name of Memento Mori is probably because MMTM are a bunch of Euroboos. \n\nJokes aside, the phrase has a lot of iconography and weight around Christian art throughout the 2nd Milennia, AD and is generally a really cool phrase to swing around. MMTM [LN details not covered in anime] >!use a lot of European military equipment and tend to like it they wear Swedish uniforms, and their weapons are typically German firearms. A G36K, an HK21, an MSG-90, a G3 rifle, and a Steyr-Aug derivative, which I don't think is being used right now.!< The choice of a Latin phrase is probably in homage to their European equipment.", "label": 1}
{"text": "You obviously didn’t read the article if you think my critique long. Similarly, I don’t advise using your dick as a measure of what you consider “lengthy and bloated”", "label": 1}
{"text": "cry about it nerd", "label": 1}
{"text": "I mean th op did say kaori gonna kill herself and it a open book this one of the sadest anime of all time equal to violet everganden", "label": 1}
{"text": "It's had its depressing moments, but I don't think it's been soul-crushingly sad.", "label": 1}
{"text": "Thays why im afraid to watch it", "label": 1}
{"text": "Ok bro ur so cool u watch anime kawai uwu", "label": 1}
{"text": "Like stfu 😂", "label": 1}
{"text": "Glorio says that Supreme Kai's race is called \"Glind\" and presumably this applies to all Kais (so Kibito, Zamasu, King Kai, etc).\n\nBack in 2009 Toriyama said in a lore guidebook that their race was called \"Shinjin\". So I suppose this is technically a retcon, but that was from a side book released years after the manga ended and was never said in the manga or anime itself, so it's not really a big deal I think.", "label": 1}
{"text": "Since I just finished it today, I'll recommend **Girls' Last Tour**. Completely wholesome (there are a couple of bathing scenes but they're about as innocent as can be). No romance. Just two girls traveling through an empty world, discussing the human condition and trying to make the most out of their journey by enjoying the simple pleasures of life. A great example of how to nail the combo of humor and melancholy at the same time too.", "label": 1}
{"text": "I have no read the manga started watching it cause I saw a manga panel and now i am watching this side by side with the manga in hand. WHY DO THEY JUST MAKE THEIR OWN ANIME IF THEY ARENT GOING TO FOLLOW THR BOOK THIS SHIT IS SO LACKLUSTER AND ASS I HATE IT SO MUCH LIKE ITS LOOKS SO GOOD IN THE MANGA THE ANIME IS KILLING ME I HATE IT, I HATE IT, I HATE IT", "label": 1}
{"text": "Are you actually so stupid or are you playing with me? You said she just follows orders and I compared that to the Nazi soldiers who committed atrocities who were \"just following orders\". Pick any other military force in history that has committed atrocities and the same applies, you can't just say \"I was following orders\" and suddenly you have no ethical responsibilities. Is it too hard a concept for you to understand? \n\nToday I learned that enjoying killing and participating in warfare is not evil! You people are so intent on defending a fictional character you have no idea what the fuck you're saying. Not sure if you're just lolicon weebs or dumb", "label": 1}
{"text": "Bleach would be a great dubbed anime and it's ongoing as well but if you're looking for a rom-com then go for horimiya also Attack on Titan is a must watch show", "label": 1}
{"text": "baller outfit, what kind of spells does that axe cast?", "label": 1}
{"text": "I always read on mobile because it's comfortable, so I use tachiyomi. It's only on Android though.", "label": 1}
{"text": " i just want to be able to post some shit, god damn. whatever, fine.", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "this is a comment", "label": 1}
{"text": "oh shit fr?", "label": 1}
{"text": "# Here's few that i can suggest.\n\n* **Gakusen Toshi Asterisk**\n* **Rokudenashi Majutsu Koushi to Akashic Records (Must watch if you like magic theme)**\n* **The Irregular at Magic High School**\n* **Chivalry of a Failed Knight**\n\n# OR\n\nIf you wanna start with something really great story here's the best one i can suggest.\n\n* **Attack On Titan** \n* **Vinland Saga**", "label": 1}
{"text": "Why is it, that only retarded people hate Re:Zero? Finish grade school, kid. Clearly you don't understand writing at all, you moron. Also, since your name is Waifu_Review I can tell, that you are jealous of Subaru. He actually has good relationships with women, which basement dwelling incel like you definetely doesn't have.", "label": 1}
{"text": "Why is it, that only retarded people hate Re:Zero? Finish grade school, kid. Clearly you don't understand writing at all, you moron. Also, since your name is Waifu_Review I can tell, that you are jealous of Subaru. He actually has good relationships with women, which basement dwelling incel like you definetely doesn't have.", "label": 1}
{"text": "Why is it, that only retarded people hate Re:Zero? Finish grade school, kid. Clearly you don't understand writing at all, you moron. Also, since your name is Waifu_Review I can tell, that you are jealous of Subaru. He actually has good relationships with women, which basement dwelling incel like you definetely doesn't have.", "label": 1}
{"text": "yes great choice", "label": 1}
{"text": "Did they forget that the Supreme Kai has the ability to read people’s minds? Or did they keep that plothole from DBZ?", "label": 1}
{"text": "Re:zero should at least be 2nd place next week with ep 5 for what's what content it's covering, as Dan Da Dan will mostly be a setup episode.", "label": 1}
{"text": "ive had people call my ecchi series “straight up porn” lol https://globalcomix.com/c/sayaka-s-secret-/chapters/en/1/1", "label": 1}
{"text": "Why does your reply sound chatgpt-ish", "label": 1}
{"text": "Probably because English is not my best language, so I wrote the text first, and asked ChatGPT to assist me.", "label": 1}
{"text": "Look at their post history, most of it is an advertisement for their sub.", "label": 1}
{"text": "Correct! I'm trying to grow it by adding value to other communities.", "label": 1}
{"text": "the giant frogs are resistant/immune to bludgenering and waterbased attacks, so Aqua did nothing to them. but she can also kill entire armies of undead/demonic creatures, including very strong ones, like the dhullahan. just crying next to a strong lich makes that lich dissapear. she is also able to dispel one of the strongest magic defenses known from the destroyer fortress.\n\nmake no mistake in Aquas power just because we see her do nothing vs the frogs in the beginning.", "label": 1}
{"text": "Yes please", "label": 1}
{"text": "Code Geass did that in season 1 finale for me.  Watching Euphenia fall in love and ...", "label": 1}
{"text": "Yo how much of this was original?", "label": 1}
{"text": "Back in my day an episode like this would've been called filler, now it's just Peak Cinema ✋🙂🤚", "label": 1}
{"text": "Wonder if this means no carpet Ichigo later.", "label": 1}
{"text": "If fiction has taught me anything it's that characters can really sell themselves as bad guys for a long con and so long as their betrayal moment is successful, it'll all be okay. \n\nThough, granted, he **is** literally voiced by Sasuke lol.", "label": 1}
{"text": "I think at this point it's obvious that from here on every episode will be half anime original and that's just freaking amazing!    \nUryu vs Ichigo really loved upto the hype that it created since Cour 2.", "label": 1}
{"text": "The changes and additions made to the TYBW have been nothing short of fantastic. THANK YOU KUBO-SENSEI!", "label": 1}
{"text": "Hot Damn, we just got a whole episode of new content. Kubo is cooking", "label": 1}
{"text": "This tops even the Ichigo V Yhwach fight a few weeks back! Absolute Cinema! Kubo you are spoiling us!\n\nA fully original Ichigo and Ishida duel (-and gorgeously animated/choreographed at that!)\n\nIshida's complete Vollstandig\n\nOrginal fight for Ganju, Orihime and Chad\n\n  \nWhat I love about this most is how it elevates the tension so much more than it was in the manga, this time Ichigo is way too pre-occupied to stop Yhwach killing the Soul King's arm.", "label": 1}
{"text": "Yeah, Ichigo isn't going to go all out this arc for a while, he's still playing, so to speak. Unfortunately, he played too much with Uryu.", "label": 1}
{"text": "dattee", "label": 1}
{"text": "Yeah it would be a miracle for them to get out of that situation if Ishida wasn't there. :)", "label": 1}
{"text": "I hope so, but considering Ichigo's current luck, probably not 😂", "label": 1}
{"text": "Murichiro And Genya from demon slayer", "label": 1}
{"text": "Yeah this is an S tier adaptation. It makes me very excited for cour 4.", "label": 1}
{"text": "For the manga readers you now what’s in this sentence🤭", "label": 1}
{"text": "I'm not gonna lie Ishida getting a powerup strong enough to beat Ichigo here seems insane to me even knowing that Ichigo wasn't trying to hurt Ishida at all. Now several other characters have to get an insane upscale compared to the manga as well for this to even make sense. It's hype though they're cooking", "label": 1}
{"text": "So they’ve added a lot in this episode compared to the manga?", "label": 1}
{"text": "Attack on Titan is my top anime too. I tear up every time that Hange dies too lol.\n\nThe anime that I don’t like is Fullmetal Alchemist Brotherhood. It’s suddenly ultra childish at times, I can’t bear that. I love the 2003 version. I think it was a good call to make the anime darker and more gritty.", "label": 1}
{"text": "HANGE‘S DEATH IS SO DAMN SAD, I CANT GET OVER IT EVEN AFTER REWATCHING THE SHOW 5 TIMES WAAAAA\n\nFMAB is a hot take tho, but I respect that, not liking tensura is already a hot take for me lol", "label": 1}
{"text": "Still extremely happy with this remake. Love the new pacing.\n\nCan't wait to see her short hair. Because the long hair looks beautiful in the remake, better than in the manga or old anime imo.\n\nAlso the scene before the hair cut between Ranma and Akane was super cute ❤️", "label": 1}
{"text": "That fight was insane, especially finally seeing Uryu's Vollständig which the manga never showed us. Then he turns poor Ichigo into a doughnut... surely there's better ways to end your friendship.\n\n\nIt's also hilarious how Ganju of all people caught the Schutztaffel off guard, and Pernida sinking into the sand like that was pretty funny. But I can't believe Chad lost...\n\n\nOverall, this is the best episode of Cour 3 for me, though I've enjoyed them all so far. I'm looking forward to the return of God aka Chair-sama next episode... oh, and I guess Aizen too.", "label": 1}
{"text": "this manga in general is a little drawn out, largely because the sports plotlines take up a good amount of screentime, so [mild manga spoiler] >!yeah this love triangle will be drawn out but i'd say it's handled more maturely than most stories!<", "label": 1}
{"text": "Favourite Anime - Ranma 1/2", "label": 1}
{"text": "I really love the new intro scene. It seems to be a parody of Street Fighter 2. But funnily enough, there was a Ranma 1/2 fighting game for SNES. I'm guessing we're getting new intro scenes every few episodes... 👀\n\nFinally, Ryoga is here. For Zoomer viewers, before there was Zoro, there was Ryoga. He's the OG. \n\nThe fight scene between Ranma and Ryoga looked rough tbh. It didn't look bad but it clearly looked worse than the animation in the last episodes. That being said, the animation looked beautiful near the end. \n\nSpeaking of the end, what a cliffhanger. \\[Ranma 1/2\\] >!I'm going to miss long-hair Akane. :( She looked much prettier in the remake than in the OG anime.!<", "label": 1}
{"text": "I really love the new intro scene. It seems to be a parody of Street Fighter 2. But funnily enough, there was a Ranma 1/2 fighting game for SNES. I'm guessing we're getting new intro scenes every few episodes... 👀\n\nFinally, Ryoga is here. Much faster than in the original. For Zoomer viewers, before there was Zoro, there was Ryoga. He's the OG. \n\nThe fight scene between Ranma and Ryoga looked rough tbh. It didn't look bad but it clearly looked worse than the animation in the last episodes. That being said, the animation looked beautiful near the end. \n\nSpeaking of the end, what a cliffhanger. \\[Ranma 1/2\\] >!I'm going to miss long-hair Akane. :( She looked much prettier.!<", "label": 1}
{"text": "It is but the remake is better with the character interactions because it’s straight from the manga while the OG anime was kind of doing it’s own thing", "label": 1}
{"text": "I guarantee I watched and read Bleach before you were even born lol. It's obvious you're like 15 years old by the way you can't handle objective criticisms of a cartoon you blindly fanboy over. ", "label": 1}
{"text": "Prison School", "label": 1}
{"text": "Blood Lad (on Anix.sh)", "label": 1}
{"text": "Attack on Titan       Devil man and Baki ( both met flic ).       Cyberpunk 2077.       Prison school 🤓", "label": 1}
{"text": "All i see everyone complaining about the MC. But i wanna know what that unconscious form was that he was in, any manga readers in chat?", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "I did like that the character interactions in the older anime were more detailed though, like occasions where Akane points out to Ranma-chan that her blouse is open/torn when around a guy", "label": 1}
{"text": "[technical Uryu schrift spoilers since its been shown but not explained]   >!At the same time though his volstanding seems like it would compliment his schrift extremely well. (Ishida constantly swapping places with one of the thousands of different arrows. or right before an arrow is blocked/dodged, it's like \"Oh, did you think that one was the one that fired? It was actually the one behind you\")!<\n\nscary stuff tbh", "label": 1}
{"text": "Yes it kinda does because he needs to hit and have targets to use it on.", "label": 1}
{"text": "They ramped up Akane's tsun in the original anime that it gets kind of annoying. The remake is thankfully more inline with the manga where its usually Ranma that instigates Akane's violent behaviors while she's trying her best to get along with him.", "label": 1}
{"text": "I definitely feel like 03 is worth a watch, both for the early content and as its own thing.\n\nThe latter half doesn’t follow the manga, but it’s hardly unwatchable. Some of my favorite moments were non canon, like >!Roy defeating King Bradley with his original skull,!< >!Lust’s character growth,!< and >!Rose’s new traumatic event partly caused trying to follow Ed’s advice (holy shit that some twisted irony)!<", "label": 1}
{"text": "I meant Ishida shining in general in this arc cause practically everything we’ve seen him do didn’t happen in the manga. Not just this fight. And ofc he didn’t finish off Ichigo, he’s the MC like you said that’d never happen.", "label": 1}
{"text": "Oh wow the bandana thing is new to me. The original anime didn't have it", "label": 1}
{"text": "Yeah because of the filler in the old anime the relationship got a bad rep, but Ranma and Akane were always adorable.", "label": 1}
{"text": "Nope. Enjoy your rapist QB and 4th tier city though", "label": 1}
{"text": ">thinking just about romcoms, usually it's the girl that's the title character (Shikimori, Aharen, Nagatoro, etc.)\n\n\n\nMeanwhile, here I am liking Izumi more and rooting for him like what I did to most of shoujo FMC. I know people wouldn't mind anything about him if he was a girl instead.", "label": 1}
{"text": "Coomers like you just can't enjoy anything unless it needlessly sexualizes a grandma with awful design. You'll have to come to terms with that", "label": 1}
{"text": "You're the one making stuff up because you're mad. Pretty sure the rest of us are good here.", "label": 1}
{"text": "Don't talk about Best Boy Ryoga that way! He can absolutely be deviously clever, as he often proves via \\[ep 5 spoiler\\]>!P-chan!<.\n\nNot his fault dude was born 30yrs too early for GPS turn-by-turn directions ⤴️ 😂", "label": 1}
{"text": "Ryoga is the Vegeta of Ranma. Only difference is that this is probably the worst thing Ryoga ever does \\[ep 5 spoiler\\]>!in human form!<. He's such a fun character. Ryoga x Ukyo are my forever-fanfic ship.", "label": 1}
{"text": "Ryoga is a fan-favorite, so without spoilers, I'll just say that this is probably his worst moment. He does have a caring & protective side, but the \"I will have my revenge\" part is winning out since this is his big intro.\n\nAnd yeah, what u/SS4312 said - this is a farce, the worst thing that happens is that someone gets injured and goes to Dr Tofu, or ends up ludicrously wrapped in bandages. Or heartache of the unrequited love variety. The comically dangerous antics are just set-dressing, really.\n\nAs for Ranma x Akane, there's a reason they are anime's favorite wholesome couple. \n\nI doubt they'll adapt the entire manga, but the pacing here has been great. Rule of Funny will always take precedence over the romance, much like you've already seen. If you're left wanting after the anime ends, just go read it, it's hands-down one of Takahashi's best, and one of the best romcoms of all-time. \n\nOr go dig up some of the 40yrs worth of fanfic & doujin 😅 I'm tempted to start a thread requesting ppl's favorites after the season wraps.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  This belongs in the Source Corner at the top of this thread. In discussion threads for currently airing anime, discussions about source material, spin-offs, mangaka comments and unadapted content must be posted there, and not outside it. This applies specifically to comparisons to the anime or hints about future events, even if such hints are vague. Please note that you still have to tag your spoilers in the source corner.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Didn’t realize how much extra scenes they added in the OG anime that made this Ryoga intro longer, and I appreciate the production staff being very faithful to the manga this time just to help with better pacing. Also getting to appreciate the addition of the announcer character since these commentaries in fights sure are (annoying) appreciated.", "label": 1}
{"text": "Nah, it was there, it's a part of his manga character design. Nearly all his clothes are weighted for training, like in Dragonball and classic martial arts movies. It's why he's so freakishly strong.", "label": 1}
{"text": "Yeah rewatched the original ep. It was only showed in the haircut scene", "label": 1}
{"text": "As if, are you stupid?? Why would he build a house if he didn’t like it?", "label": 1}
{"text": "yeah I'm done dealing with you. Have a nice life", "label": 1}
{"text": "Hot mama", "label": 1}
{"text": "She freaked out like crazy haha girls", "label": 1}
{"text": "Where to buy?", "label": 1}
{"text": "I am not reading all that you must just care too much about incest go fuck your sister or something. Why would I ever watch yosuga no sora.", "label": 1}
{"text": "Buddy what", "label": 1}
{"text": "I was not gonna buy a subscription again on netflix but this thing caught my attention. Lol", "label": 1}
{"text": "Thanks stupid guy that wasted 5 minutes of my life🫶😎", "label": 1}
{"text": "You’re welcome", "label": 1}
{"text": "Yeesh, they keep yapping forever. I much prefer this scene in FMAB.", "label": 1}
{"text": "Now that’s a good boy here’s a lollipop for you🍭", "label": 1}
{"text": " App for watching anime?\nI got some free options\nApp\n\n- bstation\n- crunchyroll\nWeb\n- watch anime online\n- watch cartoon online\n- onaboy\n- otaku poi", "label": 1}
{"text": "I don't know if this trope or not but a lot of characters who are voiced by Nao Tōyama always ends up as losing heroines (harem especially).", "label": 1}
{"text": "I would agree to this too. Shiro has memorised all possible outcomes in chess, making it a mere simulation for her. Sora knows that and blends his own double think into her chess games, making it difficult to double guess Shiro's moves. This lethal combination makes it impossible for anyone else to win. \n\nEven the enemy Queen game became a game where Sora just messed around with politics instead with no real chess, because Sora's expertise is to confuse and frustrate, which meant an almost definite loss for the opponent.", "label": 1}
{"text": "This episode made me so unbelievably mad, i already hated SF-zoo, theyre so slimey and disgusting, but then WITHOUT EVEN OFFERING SUNRAKU ANYTHING, that b- demands to get into rabituza and the craziest part about it? Sunraku just gives in EVEN THO SHE HASNT OFFERED HIM ANYTHING IN RETURN", "label": 1}
{"text": "He was surprised that Soul King's arm was acting in favour of Soul Society. Genuine question - are you ret@rded?", "label": 1}
{"text": "Nice 👍🏾", "label": 1}
{"text": "Nice 👍🏾", "label": 1}
{"text": "Nice 👍🏾", "label": 1}
{"text": "Nice 👍🏾", "label": 1}
{"text": "In the Japanese Learning community we usually use Jimaku to find subs, Then we use Asb player to load the subs onto the video.   \n  \nI don't know of any (good) sites that have subs natively, you can try Animelon, but their site is pretty broken, and the other option is Netflix, but their catalog is pretty limited. \n\nIt's just easier to use your favorite legal anime streaming site with asb player if you really want JP subs", "label": 1}
{"text": "Goddamn, these banners be going wild (especially **Yakuza Fiancée**, **Grieving Soul**), and I knew Tino would still be chosen.\n\nThe gap between **Re:Zero** and **Bleach** is insane\n\nThat banner of **Orb**... Rip Gras\n\n**Tower of God** and **Grieving Souls** made it to the left side, meanwhile **Most Notorious \"Talker\"** is still winning the Edgy Mondays battle.\n\nDanmachi's plot twist this week has broken me, that was wild.\n\nAnd Charlotte's hanging there with her big \"Explosion\", that was a cool battle to see.\n\nLooks like Uzumaki came up a little after a disastrous run (I still don't want to watch it).\n\nAnd **One Piece Fan Letter** having 9.23 on MAL? Damn! That's already #2... I can't wait to see what it looks like, I recently started to read the manga instead of the anime to watch (Chapter 10 now)\n\nWhew, what a week it's been!", "label": 1}
{"text": "I don't know but you can watch it on hi anime for free", "label": 1}
{"text": "And grinding is hell for normies in danmachi. Adventurers keep dying left and right. >!And the final boss is fucking insane to deal with even with cheats!<", "label": 1}
{"text": "> Vash was part of the silhouettes.\n\nIt's [the manga](https://static.wikia.nocookie.net/shangrila-frontier/images/3/34/The_Seven_Colossi.png) where it is obviously Vash, while [the anime](https://static.wikia.nocookie.net/shangrila-frontier/images/7/78/The_Seven_Colossi_anime.png) is more discrete about it. \n\nAnd now I totally believe Vash is one (gotta find me that hand grenade...) and that this is less a \"theory\" then a fact just waiting to drop but we should probably be a bit wary of something let slip so early having a few twists in it and/or changing as the story was/is written. \n\nLike over in One Piece the early glimpse of Kaido we got was nothing like his final design. same with the Shichibukai. And this from a master of long term planning.", "label": 1}
{"text": "> the reveal of her being in high school was the last thing that did it.\n\nHaven't watched Ep5 yet but damn this is disappointing. Thought they were all adults.", "label": 1}
{"text": "Till the H man shows up anyway", "label": 1}
{"text": "i’ve watched then already 😭 but thx", "label": 1}
{"text": "Was in 4!", "label": 1}
{"text": "I know this a very long and detailed One Piece Fan Theory however bear with me for a sec I promise you won't regret this. NOTE: Whether it's true or not I just wanted to point out that we are doing this for fun nothing else. \n Sanji might not be genetically modified but rather inhuman. When you think about it why didn't he awaken his German genes from the beginning and why he didn't lose his humanity when he did awaken his genes and if Queen had all the genetical powers why didn't he heal like Sanji or use flames or even move as fast as Sanji? If Judge was actually looking to have strong kids, why didn't he marry a woman from a superior race than that of humans, unless Sora is somewhat like that but she was born weak due to an illness. What if Sanji's siblings were copies of him to be more specific, they are seraphim? That is why they were bullying him, they were jealous. Sanji the weakest and the original who had will, hope, ambitions, dreams, and most importantly feelings. Which also means that Reiju was somewhat of a failed experiment, instead of duplicating her she became a cyborg that is why she has feeling and that is why Sanji wanted to save his sister on WCI. If Sanji's mother didn't die because of an illness because when Usopp's mother died she appeared in the anime in a very ill state at the end of her day's which didn't happen with Sanji's mother. So, what if Sanji was the reason behind his mother's death? What if Sanji's pervert innate behavior comes out of a sense of guilt and it is an uncontrollable thing as he grows stronger which also suggests that Sanji might be mentally unstable? Maybe that is why he hit Luffy on WCI, he was afraid history would repeat itself, he would rather be a traitor than his captains' killer (besides all of that they were holding Judge as hostage). Why was Sanji placed in solitary confinement? If it was a form of punishment his father wouldn't have allowed the guards to bring cooking supplies or books unless Sanji's mother died because of him and ever since then Judge had become terrified of him? So, what actually happened? My theory suggests that Judge killed his own wife right before his son. Why did he do that? He did it for an experiment. When Sanji was born with no special powers Judge decided to never give up and turn him into a Lab Rate, his father kept giving him drugs but since Sanji has some demonic traits his body treated these drugs as poison and his body disposed of these drugs. When Judge realized what was going on and that his feelings trigger his powers he decides to kill his wife in front of his child. Sanji went bonkers and destroyed half of Germa Kingdom. In his battle with Queen Sanji at some point was standing before a destroyed building with the helmet on, this building was part of the Kingdom that he destroyed and got him placed in solitary confinement and these are the real abilities he is afraid of. What if Sanji can use what's called alchemy since we don't know from where his flames came. If it was really coming from his pation like he is saying then every patinate being will be able to use flames which is not the case and we saw that Shanks can also use flames and from where is Shanks? From the God Valley so what if this power is alchemy and Sora was the second survivor of the god valley besides shanks? We have seen that Sanji can reflect light which means that if alchemy can change an element into another then it can easily allow him to reflect light. Another thing that supports the presence of alchemy is Saturn he used weird circles to summon the others so what if that was alchemy not to mention that he was present in the God Valley incident. What if Zeff was killed, then history will repeat itself and Sanji will show his true nature. The scientist at Germa kingdom confirmed that Sanji doesn't have any genes as for losing his humanity is because he is partially demon the \"Diable Jambe\" or the \"Devil's leg\" who does the leg belong to? The devil AKA Sanji. So, if Zoro is \"king of Hell\" then Sanji \"King of Demons\". Why is Sanji a demon? What if people in the god valley used alchemy to summon demons from the underworld and through time these people started merging with the demons creating \"Demi-humans\" a demon soul with human form (THIS DOESN'T MEAN THAT ALL PEOPLE IN GOD VALLY CAN DO IT MAYBE A SPECIFIC FAMILY). This might explain a lot about the Tot Musica which was created out of people's loneliness or rather a person's loneliness after the Joyboy left the Tot Musica or its physical form was never accepted by people that they started torturing her until she killer herself, but her soul stayed for revenge from those who were the reason behind her death. Evidence, in Uta's first appearance in the show she was covering her left eye same as Sanji. Sanji and Uta are 21 years, they were both adopted by Zeff and Shanks. They both tried to protect Luffy in their OWN WAY. When Uta was 9 shanks left her, when Sanji was 9, he met Zeff. Uta who sang Tot Musica which is a demon is so similar to Sanji who has demonic abilities. And for those of you who aren't convinced yet, in Alabasta, Skypia, and Enies Lobby arcs Sanji was fatally injured yet stood up as if nothing who can you explain that. What if Germa Kingdom once ruled kindly and respectively over the North blue before the Void Century and they supported the Joyboy and lost their kingdom after a bloody war that lasted for 66 years in the Void Century. The Joyboy promised to return and aid them but never returned this could explain their current ruthlessness as a way to reclaim power without the Joyboy who they think betrayed them, which also suggests that before the final War Judge might die and Sanji will lead the Germa Kingdom under the rule of the Joyboy. This could also explain why Judge’s family retains the title of royalty despite lacking a traditional Kingdom.\nI'd like to read everyone's opinion on this theory?", "label": 1}
{"text": "Huh? How was *that* irrelevant revelation the straw that broke the camel’s back?", "label": 1}
{"text": "Was keeping it around as a show of adults as that's on the rare side.\n\nAlso if the show goes the romance route I don't want any part of that even more now.", "label": 1}
{"text": "How does it even matter when it *felt* like they were all adults anyway?\n\nIt only really matters when you were hoping for a ship and don’t like small age gaps I guess?", "label": 1}
{"text": "Ah yeah I meant 4 lol.  Either way this week's.", "label": 1}
{"text": "Could be worth picking back up but I have more faith in anime going the underage route than that one...", "label": 1}
{"text": "yeah i realize now i should’ve been less vague", "label": 1}
{"text": "i’ll definitely try clannad and a silent voice", "label": 1}
{"text": "Ultimately it does not matter and I probably wouldn't care had I known this beforehand. But all-adult casts are exceedingly rare so thinking you have found one only for you to have been wrong is a bit of a letdown.", "label": 1}
{"text": "i’ll try this one", "label": 1}
{"text": "Thank God Ranma 1/2 is there. One of my absolute favourite manga.", "label": 1}
{"text": "Yeah. I've heard of Mineta like person and am not looking forward to him. I want at least the anime to tone him down.", "label": 1}
{"text": "i’ll add all them in my list! i wold love some comedy ones too if you’re up to", "label": 1}
{"text": "Thanks.", "label": 1}
{"text": "🍼🍼", "label": 1}
{"text": "i’ll try those!", "label": 1}
{"text": "i’ll give it a try", "label": 1}
{"text": "Why do I feel that the latest anime lacks creativity? Are the stories in new anime becoming repetitive or dull? Also, could you recommend some good but lesser-known anime?", "label": 1}
{"text": "If I could live in any anime world, I would pick the world of \\*Attack on Titan\\* because it's my favorite anime. I really admire Mikasa's character—her strength and determination are inspiring. Plus, the intense battles and the thrill of fighting against Titans would be an unforgettable experience! Although I’d probably get eaten by a Titan in the first episode! 🤣🤣", "label": 1}
{"text": "Steins;Gate is clearly the best anime oat", "label": 1}
{"text": "Yeah found em. You were right about the volumes, volume is bit further into the future when they meet (manga spoiler)~~Rust~~, so there's still a bit more to go. As for the 1st one, have they adapted any of the extras so far? I've not gone through all the extras so I actually don't know if they adapted it or not", "label": 1}
{"text": "That's definitely something I also wonder! I looked it up and the haircut occurs on chapter 13, so that's almost 2 months of serialization with long hair Akane.\n\nI wonder if she ever talked about it on an interview or something", "label": 1}
{"text": "[](#stare)", "label": 1}
{"text": "Miseng does get much stronger later, the end of this episode/ next episode is kind of like a preview of her potential", "label": 1}
{"text": "For explanation: initially Rak is forced to shrink by Yu Hansung (the yellow haired guy from season 1) as a sort of prank. It’s done via a contract with the administrator of a floor. Now Rak does it because it’s often more convenient for him to be small in cities and towns.\n\nThe out of universe explanation is that SIU didn’t like drawing Rak at full size and detail.", "label": 1}
{"text": "Iirc thanks to this he often says Rak is actually the easiest to draw", "label": 1}
{"text": "Yup only thing I’ll add is he does this by making a contract with the administrator on each floor", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "\\>I kinda like that she didn't end up with the protagonist when the other male had feelings for her. It was nice, in a way, that instead of her holding on to someone first and wanting to keep them around someone else saw her in that way and started to love her first. When you think of it that way, it's much nicer but I just wish more focus was put on it.<", "label": 1}
{"text": "Trying not to spoil you here 😅\n\nIt gets addressed later in the story, don't sweat it too hard", "label": 1}
{"text": "Oh no I'm aware at the plot line! haha don't worry I've been a ranma fan since I'm little\n\nI did think about that part too", "label": 1}
{"text": "Oh, okay! I think she always planned to \\[Ep 5 spoiler\\]>!establish the Dr. Tofu motivation!< and have Akane willingly cut her hair. That would fit the usual pattern of having the haircut represent a character's emotional/attitude-shift.\n\nBut of course, this is Ranma, so it had to be way crazier, and introduce extra complications to the growing relationship-web.", "label": 1}
{"text": "Yes it's true, the SK didn't need to be mutilated after being encased in the crystal. But he was, I'm not sure if we'll see the reason in this season. \n\nI can totally see your point. You'll see what I mean in a couple of episodes.", "label": 1}
{"text": "oye, en q cap van del manga adaptando, voy reperdido 😵‍💫", "label": 1}
{"text": "Here is a bit of description of that sequence in the light novel:\n\nThe massive bodies of the Dark Young trampled the Royal Army underfoot.\n\n Splinters from countless shattered spears flew through the air.\n\n Although they crushed the meaningless resistance that did not even count as resistance, the Dark Young of the Black Goat were merciful in their own way.\n\n There was no pain.\n\n There was no time for their victims to feel pain before they were squashed flat under the titanic weight of the Dark Young’s charge.\n\n The spear-wielding soldiers did not even have time to realize that the pikes they were holding had been pulverized by those massive bodies. All they saw were black shadows falling over them.\n\n They screamed and they screamed and they screamed.\n\n Gobbets of meat flew through the air. They had not come from just one or two people, but tens, hundreds of victims. They were stamped flat by the enormous hooves, and thrown— no, flung away by the waving tentacles.\n\n Be they patricians or plebeians, now they were all the same chunks of bloody flesh.\n\n Some of them had families in their villages. Some had friends left behind. Some had people waiting for them. Once they were ground into the mud, none of that mattered any more.\n\n The Dark Young treated everyone the same way, bestowing death upon them all.\n\n Surely they must have been satisfied after crushing countless humans underfoot, but they showed no signs of stopping.\n\n The Dark Young began to run.\n\n They ran on. They did not stop while in the midst of the Kingdom’s forces, simply running on.\n\n “Gyaaaaaaaaaaaaaaa!”\n\n “Abbaaaaaaahhhhhh!!”\n\n “Stoooooooooooooop!”\n\n “Save meeeeeeeeeee!’\n\n “Noooooooooooooooo!”\n\n “Uwaaaaaaaaaaaaahh!”\n\n The screams rose up every time those gigantic hooves came down. It blended with the sound of humans pulping under the Dark Young’s mighty legs, and the sound as they playfully batted humans away with their tentacles.\n\n A sound which men had never heard before went on and on without end.\n\n Trampled.\n\n What better word was there to describe this scene?\n\n Several people desperately thrust their pikes forward. The Dark Young, whose bodies were massive and who had no intention to evade the attacks, were hit solidly by the points. However, the pikes could not pierce deeply enough to cause harm to their slab-like bodies. They were masses of iron-hard muscle sheathed by thick, rubbery skin.\n\n The Dark Young did not mock their futile resistance, but simply charged forward.\n\n Before the soldiers realized that their fatal resolve was meaningless, the Dark Young had already reached the centermost portion of the Kingdom’s army.\n\n “Run away! Run away!”\n\n They heard the shouts from the distance. In response, all the soldiers began to flee. It was exactly like a swarm of spiders scattering in all directions.\n\n But of course, the Dark Young were much faster than human beings.\n\n Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat. Splat.\n\n The sounds of humans being crushed to death and turned into chunks of meat went on and on\n\nCombine with the illustration, and you can see how this whole sequence should LOOK.", "label": 1}
{"text": "Which male lead in romance anime you think have cute look and appeal rather than \"hot beauty\"?\n\n\nit seem hard to find such male lead outside of BL, so I'm curious", "label": 1}
{"text": "Cool", "label": 1}
{"text": "They aren’t. This is the mark of a child. You can always tell. Your statement should be: “I don’t like them, but I can see some positive aspects of the shows and why other people enjoy them”.", "label": 1}
{"text": "[Spoilers] \n\nExcited for the fans reaction on Alien Invation Arc lol. Mirror Yokai is OP af!", "label": 1}
{"text": "hm", "label": 1}
{"text": "I need time to  procees", "label": 1}
{"text": "alright", "label": 1}
{"text": "👌", "label": 1}
{"text": "10", "label": 1}
{"text": "Ishida has always said to Ichigo in verse/in story they are not friends - they are only working together until they aren't. Your head cannon does not supersede the writer. Have they done things together - yes: where did I deny that? Idiot. That does not mean they are friends. They are at best partners, until they aren't. Similarly to coworkers who hang out casually but get a job done. That has always been Ishidas view on their relationship again for emphasis: in the story written by the writer, not based on your or my interpretation and the character has said this more than once and demonstrated thru his actions this is how he feels. Ichigos view that they are friends does not overwrite Ishidas feelings or point of view.\n\nDo you think Ishida was helping Ichigo for Ichigos sake? He was and is not. He worked with him for his own purposes, his own agenda. This has been said I'm verse too many times for you to simply ignore or forget it. Ishida has a grudging relationship with Ichigo, not forced by circumstances not based on friendship.\n\nIn this arc Ishida says outright, he is doing what he wants for his purposes and he does not stop to waste time on thinking Oh I am friends with these people I know and have worked with, no he participates in a plan of attack, an ambush, and a war knowing people will be killed. That is an escalation and participation in murder. Ishida at least shows his mettle his spine and his convictions. Ichigo does not.\n\nSo put that to bed.\n\nAs I point out: even if Ishida is playing at subterfuge it is poor writing because at this point without PIS, Plot Armor, and Hax Ichigo has lost and everyone should be dead. However the writer continues to rely on plot with no consequences, in part because this is not high literature, and as a writer he has weaknesses, which he has admitted.\n\nYes, you are a peak clown for overlooking what the story tells us explicitly and instead relying on your headcannon.\n\nPeace out.", "label": 1}
{"text": "It triggers me to watch this on weekend", "label": 1}
{"text": "God damn", "label": 1}
{"text": "Long shot, but Detective School Q has an episode with the poison coffee scenario.\n\n[Detective Q episode 31](https://www.youtube.com/watch?v=3HBCGRIVdYY&list=PLRWhRcIIpl2OQ1UXzE9z3WMI5ezULyuza&index=31)", "label": 1}
{"text": "Yeah, Syaoran definitely have cuter visual because of his younger age. I don't really try to consider \"cute on the inside\" as good example at first because what even the point if you still have \"hot beauty\" look (example: Mikorin), but I guess Takeo is still neat example because of his not conventional appeal", "label": 1}
{"text": "Yeah the original is even more imo. But its slower paced. I like the slow pace but the Ryoga arc until he finally get to the school was one I was glad the cut it out lol. That shit drags for ages", "label": 1}
{"text": "I guess it just really that rare, huh... I also don't really consider height as factor that made someone cute, at least not big factor.\n\n\nLike, Izumi is actually taller than Shikimori herself, yet he still so cute and made me wonder \"how can people don't get how adorable he is\" when I look at reception of him. I feel Ichikawa is closer to Otani, but more awkward and less crass.", "label": 1}
{"text": "The Angel Next Door Spoils me Rotten\n\n(I would recommend like Just read the light novel, no anime no manga, The light novel is the best thing ever and you’ll nostly love reading it)\n\n(Unless well of course you can't have the patience to finish a book, which some people do)\n\nTotal 9 Volumes, dm me if you want them in pdfs\n\nThe Dangers In my heart- Anime \n\nTonikaku Kawaii- Anime\n\nShikimori's not just a cutie-Anime\n\nHorimiya for a slow burn", "label": 1}
{"text": "I truly don't understand this kind of take because I never had trouble finding anime with less fanservice than Fairy Tail.", "label": 1}
{"text": "I mean if they don't want to watch it because it creeps them out, that's perfectly fine.\n\nHowever western live action has a long history of sexualizing school age female characters and continues to do so, usually using the \"they're 18 years old\" as a cover.  So unless they're applying similar standards, or they somehow believe that declaring a fictional age makes everything okay or not okay, then there's some logical inconsistency going on.", "label": 1}
{"text": "No, the anime didn't skip or speed up anything. Without spoiling anything, Liz is one of the troublemaker among Strange Grieve.", "label": 1}
{"text": "I'm Not Trying To Be Rude But Are You Speaking Against Or For Lolis For Me I'm Against.", "label": 1}
{"text": "Neither, just making an observation that all character ages are fictional.", "label": 1}
{"text": "Fair In My Opinion I Think Shota And Lolicon Ruin Gives Anime A Bad Name.", "label": 1}
{"text": "That stuff is fairly removed from the mainstream of anime though.", "label": 1}
{"text": "Fair Point But It's Known Enough To Be Giving The Anime Community A Bad Name.", "label": 1}
{"text": "School days", "label": 1}
{"text": "They are being downvoted for having a bad take", "label": 1}
{"text": "Are you frigid? The level you detest sex seems personal", "label": 1}
{"text": "You are right in the sense a lot of explanation was skipped; not sure why you were downvoted to be honest.", "label": 1}
{"text": "Its the same univerese", "label": 1}
{"text": "[Made in Abyss](https://www.youtube.com/shorts/6OYm-QtVJr4) is genuinely horrifying", "label": 1}
{"text": "To be fair .. after you've seen the god awful trash that was Attack on Titan. Literally everything else in existence seems like a 10/10 masterpiece in comparison.", "label": 1}
{"text": "🫰🏽🤜🏻👈🏼👈🏼🖕🏻👈🏼👈🏼", "label": 1}
{"text": "**\"Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\"", "label": 1}
{"text": "(first part) So let me make it easier for myself and take one of the easier dialogues, which is a fragment of the conversation between Subaru and Rem in episode 18 of the first season.\n\n>Rem : I know that you are someone who cannot give up on the future.\n\n>Subaru Natsuki : You're wrong.\n\n>Subaru Natsuki : I'm not that kind of—\n\n>Rem : I am not wrong.\n\n>Rem : You haven't given up on anyone.\n\n>Rem : Not Emilia-sama or Sister.\n\n>Rem : Or Roswaal-sama, or Beatrice-sama, or anyone else.\n\n>Subaru Natsuki : I have... I have given up!\n\n>Subaru Natsuki : Carrying it all was impossible from the start!\n\n>Subaru Natsuki : My hands are so small,\n\n>Subaru Natsuki : that it all slipped through my fingers, leaving nothing.\n\n>Rem : No, that isn't true. You have—\n\n>Subaru Natsuki : What do you know?!\n\n>Subaru Natsuki : What do you know about me?!\n\n>Subaru Natsuki : This is the kind of man I am!\n\n>Subaru Natsuki : I have no strength, but I want it all.\n\n>Subaru Natsuki : I have no knowledge, but all I do is dream.\n\n>Subaru Natsuki : There's nothing I can do, but I struggle in vain!\n\n>Subaru Natsuki : I... I...\n\n>Subaru Natsuki : I hate myself!\n\n>Subaru Natsuki : All I do is talk a big game,\n\n>Subaru Natsuki : and make myself sound like a big shot, when I can't do anything!\n\n>Subaru Natsuki : I never do anything,\n\n>", "label": 1}
{"text": "It’s on YouTube (both sub and dub) in its entirety", "label": 1}
{"text": "It has been there for years and YouTube would take it down if there was a copyright claim or strike. And Japanese companies are particularly litigious so I would say it is there legally because they don’t seem to have any intent on getting it removed", "label": 1}
{"text": "It isn't. If you look it's been uploaded over and over again by tons of different accounts.", "label": 1}
{"text": "One of the playlists on there is 6 years old with every video in it being 6 years old from the same account", "label": 1}
{"text": "There you go, I agree on this.", "label": 1}
{"text": "And there's one that's 9 months old. Just because it hasn't hit all of them doesn't mean what's left is legally there or that uploads aren't hit for it. It was available legally on Youtube for awhile by the publisher, but it got pulled when it got picked up again. People have just been reuploading those versions.", "label": 1}
{"text": "RESPECT TO BLEACH AND REZERO", "label": 1}
{"text": "[I'm going to post horse every day whether or not you like it](https://x.com/Merufena/status/1847207259740463276)\n\n[](/u/Amndeep7) [](/u/ZaphodBeebblebrox) [](/u/bananeeek)", "label": 1}
{"text": "Maybe some random Liz fan downvoted you, I mean yeah in early chapter Liz is indeed too much. But Tino do not hate Liz at all after all, Tino only afraid and respect toward Liz, after all she want to join Strange Grief which only consist of monsters. A little spoiler, every Strange Grief member will train their temporary apprentice harshly.", "label": 1}
{"text": "Last I checked it was on youtube", "label": 1}
{"text": "no I haven't what's it about???", "label": 1}
{"text": "I'll look into it thxx!", "label": 1}
{"text": "thx I'll deff look into them!", "label": 1}
{"text": "Can't wait", "label": 1}
{"text": "🤣", "label": 1}
{"text": "Fire", "label": 1}
{"text": "I’m thinking the face stealer from avatar last airbender", "label": 1}
{"text": "So I just finished watching the four episodes of I'll be the greatest villainous. I haven't come across anyone discussing this but, is the main character 5 years younger then the romancable characters?\n\n\nQuick spoiler warning\n\n\nShe is ten when her bro joins and 15 is the age you are suppose to enter, so at a minimum everyone is is at least 5 years older then her, she comes to the academy at 13 and the prince teleports, corners and pretty much sexually harasses her for a moment in the library (he reaches into her dress boob area to check if she's wearing the necklace he gave her when she was even younger) so he's at a minimum 18 reaching into a 13 year Olds bra to kiss said necklace that was conceived between her boobs... beyond that it's a great story but that one scene is a lot even if it was played as romantic and heart thrombin I could not see it that way because it was the most predatory thing I've seen in a while from the genre of anime I usually watch and because of all the time jumping I don't think people have realized exactly what the context of that scene is because it's very creepy but it's so fast and thankfully she barley interacts with the prince but every time she does I get serious ick from him. Who chose those ages, it also doesn't make sense for the game she's in because she got in at 13 by breaking the game, how did the original villainess act as a villainess when she wouldn't even have been going to school with them??? And why would the heroine be so upset by a literal child harassing her, the kid sister of two romancable character no less to the point where if she marries the prince she gets this kid exiled. The story is great except for the prince yet the premise is so heavily flawed... I still recommend watching it and judging for yourself though.", "label": 1}
{"text": "Wtf is going on. I thought flooding part would be something which would occur at the end of the arc, and not smth in ep 5. Well they did state that they are evacuating everyone to safe area.\n\nSirius invading the buildings, where the ppl injured by her authority is present, wow.\n\nStill bummed that archbishop of lust has body morphing ability and not brainwash ability, which wouldve suited her more than for wrath.", "label": 1}
{"text": "Dimension W", "label": 1}
{"text": "death note", "label": 1}
{"text": "akame ga kill\n\nsummer time rendering", "label": 1}
{"text": "One of the shitiest anime out there, which i had never herd of this.", "label": 1}
{"text": "I am interested to know why do u think like that, can u explain with some examples", "label": 1}
{"text": "End it", "label": 1}
{"text": "The author lost the plot with avenging for Shion.", "label": 1}
{"text": "Shion should have stayed dead tbh. Atleast that would make the show more interesting.", "label": 1}
{"text": "Haha no way it's the worst one, I have seen much worse animes out there 😂😂😂", "label": 1}
{"text": "I wouldn't know, I'm not a writer, but if I were in his position, I'd try to stop getting ahead of myself by introducing way too many elements with little to no idea on how to resolve them in a satisfying way and end up pigeonholing these ideas. Examples like Historia come to mind; she was just... dropped, for no reason despite how prevalent she was in the 3rd season.", "label": 1}
{"text": "By not pulling a Code Geass.", "label": 1}
{"text": "I wouldn't let Eren go full General Sherman and finish the job. ​", "label": 1}
{"text": "It's been long time since i watched Nichijou and Haruhi. For Nichijou, The comedy is bizarre and over-exaggerating animation especially in some moments is cherry on top but still can't touch how relatable is Daily Live of High School Boys' humor is and they're not like trying to be funny. \n\nFor Haruhi, i don't really remember it too much because i hate the FML so much lol.", "label": 1}
{"text": "They changed a little part of Armin & Erens conversation at the end. \nInstead of Armin saying we’ll be together in hell forever etc (anime), in the manga he just thanks Eren for committing genocide.", "label": 1}
{"text": "she was hated for killing someone who is useless and unimpactful in the scout. her death didnt make any difference in the story , meanwhile gabi in just a short amount of time she had major character development.", "label": 1}
{"text": "my comment got removed for mentioning General Sherman and attempting to answer your question.", "label": 1}
{"text": "I agree that the ending made me go ??? at some points, especially the reveal about the mom (this and the Mikasa/Ymir thing were the only things I actually HATED), but I don't think it's AS bad as people make it out to be. Definitely worse that AoT and the peak of its writing, but not as bad as some of the fandom would have you believe.", "label": 1}
{"text": "It was great for me until season 4. Upto Season 3, it's peak dystopian fantasy for me.", "label": 1}
{"text": "Only better thing That first half has is L. The rest is as good as first half", "label": 1}
{"text": "For me, it always been perfect. But ofc. I love the ending but wished it had been better.", "label": 1}
{"text": "Hmm, I'm kind of curious what's your take on a better ending.", "label": 1}
{"text": "Maybe a 100 percent rumbling tbh Or something, but I’m still really happy with what we got.", "label": 1}
{"text": "Dude, right? Reiner's whole development had me hooked. One of my favorite anime characters, story-wise.", "label": 1}
{"text": "Yeah, sound design is almost, if not as important, as animation. We don't watch TV with the sound off, do we? \n\nThe first anime that comes to mind when I think of sound design is Gurren Lagann. It's not just about having good sound, but knowing when to use and how. In the scene where <!Kamina dies!> the only sound is rain. There's no emotional music or anything, just rain, and that has a massive impact on the scene, more so than the animation. \n\nAlso, anytime I hear one of a handful of songs from that anime, I get goosebumps, just hearing the song, because it's that powerful in the show.", "label": 1}
{"text": "1. The communities full of hypocrites. They will excuse things in some shows and then be the first people to call it out in others. This can apply to characters as well. Even ones in the same show, IE: Gabi and Eren\n\n2. I feel people forget that anime (and manga) are JAPANEESE culture, so when they asked to be catered too because of their own views (\"add more black characters! Do this, do that!\") they forget to realize that japaneese people probably dont give a shit. This also goes for the people who fantasize and idolize japan weirdly becayse of anime.\n\n3. I dont know if this is a hot take, but YES, the anime community, IN GENERAL, is one of the most toxic fanbases as a whole.", "label": 1}
{"text": "I genuinely think MHA fell off because All Might lost his powers. Like, i'm pretty sure he was the main reason why it became popular.", "label": 1}
{"text": "I never listen recommendations from people saying Aot is best anime ever made, cause I already know they have bad taste. \n\n\nI rarely admit I watch anime and I avoid any social media profiles about anime or manga, to many weirdos and toxic fandoms review bombing other titles if they are doing to good.", "label": 1}
{"text": "> Im fighting demons to not downvote you and your replies.\n\nFew fans of a show have as thin skin as Rezero fans, its pretty incredible how fast they get agitated.", "label": 1}
{"text": "I’ve seen posts like this time and time again, and there is nothing that could convince me that the nature of the relationship at the end of the film is okay. Gilbert was her father figure, and him loving her in that way is fucking gross.\n\n\nI don’t blame Violet for feeling the way she does, but Gilbert is a piece of shit for falling in love with a girl he raised as a child and taking advantage of her not understanding what love is.", "label": 1}
{"text": "People who dislike mushoku tensei because the main character is a \"pedo\" are stupid, its a fucking anime not real life.\nSecondly he has a brain of a child, and the point of it is that he becomes a child again, it would be stupid to go for milfs.\nIf i become a child again i would totally go for girls my age as a child.", "label": 1}
{"text": "Crazy you're calling other people thin skinned considering you have literally made hundreds of hate comments about re:zero", "label": 1}
{"text": "Bible black", "label": 1}
{"text": "You might wanna go through your comment history mate, for someone who dislikes the show so much you seem to spend more time talking about it than the actual fanbase lmao", "label": 1}
{"text": ">you have literally made hundreds of hate comments about re:zero\n\nThats news to me, think i might have posted 40 at most, but i guess rezero fans are so bad at handling criticism that it feels like hundreds of comments.\n\nCould you link those hundreds of comments?", "label": 1}
{"text": "High school DxD would have been way better with 1/10th of it's boobs time, if I want to see boobs for 20 mins I will search for porn, how can someone actually think \" and then I will make children sing a song about the Oppai Dragon with the Red Dragon Emperor, one of the beings that killed God himself, cry like a baby, then, literally 5 minutes later, the main character will get a power up after pressing Rias's boobs like a doorbell\". \n\nSame goes with High-school of the dead, Sora no Otoshimono and many more\n\nIt should be a fucking crime to use soft porn as a bait for visuals when it is used in a show with actually good story\n\nYou want to base a character's whole personality on boobs?, make it a funny quirky little thing that is talked about every now and then, not the gooddam plot point", "label": 1}
{"text": "I agree. When it was a city getting attacked by titans it was hard asf but when it turned into a war with another country and everything after that I just lost interest. in the end I didnt even finish it.", "label": 1}
{"text": "Tower of god lame and the people who like it are stinky and get bad grades.", "label": 1}
{"text": "What really pissed me off is that I feel like they abandoned the cool worldbuilding and characters to come back to the boring cast, which didn't even make sense. Having Alice as MC and Kirito in the wheelchair was better. And if it was Bercouli who actually defeated Vector (or Vecta not sure) after this amazing fight, it would have been better imo. But no, because the boring MC had to do it himself.\n\nAlso wait WoU is in season 3 ? I didn't know. Where I was watching it they considered Alicization and War of Underworld as different seasons.\n\nSorry if I ever sounds offensive or anything, it's just my opinion.", "label": 1}
{"text": "Media literacy is low in this community", "label": 1}
{"text": "Akame ga Kill!  What a depressing anime.  When the first killing of one of the gang happened, I should have stopped watching but I thought, it'll just be the one.  Man, by the end, I felt so messed up inside.  I'm not into grief porn.", "label": 1}
{"text": "\\*Almost every single anime community that there exists", "label": 1}
{"text": "*At best*, and I admit it's kind of a ridiculous stretch to apply this to *this* scenario, but it does hold some kind of significance.\n\nIt happens right as the previous arc resolves, where Araragi and his little sister are at odds about what it means to practice \"real justice.\" Truth is though, it's more about how Araragi grew up and felt like he left his sisters behind, so any immaturity that he shares with them has to be differentiated between real and fake so he feels better about himself. \n\nAfter the arc, he and his sister see a little more eye to eye, but there's still a wide gap left in their relationship after years of strain. She asks him for a favor, and he tries to freak her out by doing something weird, toothbrush scene happens, etc etc.\n\nThe actual contents of the scene feel like a joke that's either meant to shock or repulse you (as it did for me), but I think Nisioisin wanted them to reach a level of understanding by having them non-sexually breach the walls and boundaries they'd set and having them become closer as siblings. Of course though, Nisio is also kind of a pervert, so he slips in a \"it was almost sexual anyway\" in there. \n\nSo honestly, no it wasn't really necessary. It could have been any event that got them closer to develop their characters. But the author loves to do weird shit too much to have avoided it", "label": 1}
{"text": "I think Violet Evergarden is a good example of this as Violet is really young for her age, but Commander Gilbert is an older man. He took her under his wing when she was literally a child. She met him when she was just 10 years old, and it's implied that she's 14 or 15 during the events of the anime. Gilbert was implied to be 29 years old, so thier age gap could bother and gross out people who watch the anime but if your willing to overlook that age gap between them, the story and Violets development is great to watch.", "label": 1}
{"text": "So all it takes to make you sad is showing backstory and then killing the character. Then repeating this for the whole season", "label": 1}
{"text": "I deluded myself into believing it was an older brother/little sister or mentor/student type of love and not a \"I fell in love with the child I raised\" situation. That's how I ignored it. At least it's ambiguous enough that I can do that... Well for the first season anyway, lol", "label": 1}
{"text": "A large amount of anime fans bully and shit talk to each other almost as bad as the anti-anime crowd that they claim bullied them growing up", "label": 1}
{"text": "As someone who was put off by the gore but didn't see enough substance to push through, dropped because it reminded me of claymore so the reveal and move towards a war between genociders lost me, dropped because I never got the follow up on Yuji actually having an arc to pay off killing thousands of people, never got interested in the first place, and read the manga once without being that mad about it but wasn't into anime at the time, for each of these series I absolutely agree. Though no disrespect to people with different tastes. Just surprised to see someone with that similar taste tbh.", "label": 1}
{"text": "Wait till arc 6.", "label": 1}
{"text": "FMA 2003 has a lot going on for it. The tone, like you said, and the slower pacing allowed for more character development and gave the viewer more time and reason to have attachments to supporting characters. Certain tragedies lose a bit of their punch in FMA:B because you didn't have those shared experiences along the way. I also really liked their take on what the homunculi were all about ([and the body-horror aspect of something running around with your own severed limbs](/spoiler)). My only issue with it, really, is that the ending goes quite a bit off the rails.\n\nMassive spoilers, obviously:\n\n[Realizing that \"equivalent exchange\" has never actually been equivalent, and discovering that the magic is actually siphoned from another world is a pretty neat idea. But I have to say: magical, flying, inter-dimensional Nazis was certainly...a choice. I know the setting of FMA is loosely based on Weimar-era Germany, so I kind of get what they were going for, but still -- _flying space Nazis_](/spoiler)", "label": 1}
{"text": "You gotta watch the movie. Nothing ambiguous about that relationship lol.", "label": 1}
{"text": "I just finished AOT and I wish they explained more detail about the giant worm and how it came into existence. Some backstory behind Ymir’s powers would have been nice whatever that tree was in the forest", "label": 1}
{"text": "The evil corpo/amnesia light arc went on too long, they should have given a couple of those episodes to the final arc", "label": 1}
{"text": "That fight scene between Ochaco and Toga in the latest season of MHA was the same of the stupidest shit i’ve ever seen. Probably one of the most disappointing ways possible to see Toga go out.", "label": 1}
{"text": "Alicization pretty much had that as it was the only thing keeping Kirito alive.", "label": 1}
{"text": "That real world politics don’t belong in anime and that forcefully trying to absorb a character into your sexuality is wrong and fucked up.\n\nControversial I know I like to fight people on Twitter about forcefully coding characters.", "label": 1}
{"text": "He's mc-kun so stakes are 0.", "label": 1}
{"text": "They're pedos. Everything is sexual sex sells in general but the fact that most of these girls are in high-school it's disgusting. And loli don't get me started on that weebs are pedos. And it's ther culture blah blah blah Japan isn't like anime and otaku means gross nerd so these people are hated in Japan as much as America wasting hours playing video games and watching foreign cartoons isn't normal. Stop pretending it is. ", "label": 1}
{"text": "if you say some of an anime's fans aren't real fans because they disliked how it was adapted from the manga then the only thing you're a fan of is being a whiny bitch online *one piece fandom*", "label": 1}
{"text": "Can't wait to see how they blend action and comedy in this one!", "label": 1}
{"text": "The MC is neurodivergent in the manga, but the anime doesn't really highlight that part. (No, not like mentally handicapped, just a high functioning autistic with some genius level perception when he doesn't even consider stuff)", "label": 1}
{"text": "JJK is ass but no one would admit it \n\nThe anime relays on shock through killing characters and some relationships between \"unexpected characters* to keep u interested the powerscaling is wired ( from what I know) enhanced by the fans unreasonable scaling and compressions \nI haven't watched the anime I can't talk about the story but I interacted with the fans and wired they are\n\n\nMushoku Tensei is ruined <!by the fact the author put insects in the novel between Rudeus's sister and his son that ruined for me it's disgusting and wired the set up was enough to make me lose interest the author tried to say Incest is better than polygamy indirectly !>", "label": 1}
{"text": "As someone who really hasn't watched much and doesn't have rankings other than \"I do/don't like x\" lists lmao, I can just say that I've really enjoyed:\n\nVivy, re zero, higurashi, birdy the mighty decode, d gray man, nurarihyon no mago, noragami, mob psycho 100 too, read or die(ova+tv series), so I'm a spider so what, otherside picnic, I'm quitting heroing and serial experiments lain.\n\nThe bad adaptations which I've actually read the source for are d gray man, nurarihyon no mago and noragami(this one is alright I guess but the anime just felt really slow compared with manga and the music choices were terrible). I also read but didn't watch claymore which has an anime only ending and isn't liked(considering I loved the ending, that's basically a no lol). I have criticisms and know others have criticisms of lots of these as adaptations too, but all the shonen I like has been manga which had terrible adaptations by shitty studios lmao so this isn't much of an ANIME recommendation just manga.\n\nOther things I feel the need to rant about: sigrdrifa was way too overhated considering it just has a slower first half but the climax in the second half was really meaningful imo. I'm quitting heroing should never get shit on for not saying \"Yeah this guy? He's programmed to become the enemy in times of peace so should just kill himself.\" The ending happened because he spent thousands of years worrying over his core programming to the point of sui but didn't realise that meant over that time he'd become sentient(ie able to switch OFF that programming). It wasn't a human having an off switch to save him from killing himself but a long suffering android learning he's become sentient through a millenium of trauma.\n\nAnd lastly, serial experiments lain is recognised as excellent for really stupid reasons, it's not another bloody anti escapism theme imo but pretty neutral about how both in person and online, we can lose our identities. People just treat it as the non-Anno evangelion, but it's...not? I mean don't get me started on arguments over Lain's mental illness. I don't really care about the somewhat related vn for that because the anime makes me think the other Lains represent her identity being distorted based on the Wired and the other characters' interactions with her through it, it has a character who looks like a literal anthropomorphised pornbot so how exactly is the weird stalker masturbating Lain a product of mental illness? It has nothing to do with the themes. I also loved the ending based on her finding happiness in a life where she's not human, it's kind of melancholy because sure her real family were all planted but she was never human either, so it's kind of fitting that she finds peace with a fictional Wired/electronic version of her father. Maybe compared with the human father that's a lie, but her living as human was also a lie so it's kind of a happy ending?\n\nBut maybe someday I'll read the Lain vn and realise my interpretation and life was a lie too lmao. I feel like having a different interpretation of it is good because of the creator expressing his disappointment in not managing to divide the american and japanese reception to the anime, even if I have no idea what he wanted us to think of it I feel like it wasn't just escapism=bad.", "label": 1}
{"text": "AOT, i luv it but its so sad, and i don't feel like crying again", "label": 1}
{"text": "True, tho not as bad as the gaming community.", "label": 1}
{"text": "Not everyone lives on social media, stop being some weird stuck up fan boy and answer his question, it isnt hard", "label": 1}
{"text": "It's funny, but my 13 year old brother enjoyed watching JoJo and JJK. Mob 100 and Neverland seemed boring to him", "label": 1}
{"text": "Found pedo incel", "label": 1}
{"text": "I just hate how certain Near is with Light being the culprit over fringe evidence at best. That plus a few other moments that kind of don't feel super logical, while the first half felt flawless in that regard. Other than that though, I think the concept of Light getting bamboozled by L's successors was cool. Introducing multiple teams in the second half def added more dynamic to the series. The finale is also fucking A+++. A lot of the hate I think is because of people being pissy that L was gone.", "label": 1}
{"text": "Nice👍", "label": 1}
{"text": "Anime should be gatekept more. It has always had fanservice and incest and lolis and all that other freaky anime bullshit and I'm tired of these newbies coming in trying to sanitize and moralize the medium.\n\nDon't like freaky anime bullshit? Don't watch anime.", "label": 1}
{"text": "Hot takes. Stop making spicy anime fanfics, it’s weird (especially bakudeku cuz it’s a bully and a victim.) Also at some point we have to stop pointing to classics and saying “those are the best”, new good animes exist ", "label": 1}
{"text": " your complaining about things that aren't in the anime yet they won't tell you everything from the start, and just cause you have an opinion doesn't mean you have to face it on everyone even though you being dumb and can't see art in front of you.", "label": 1}
{"text": "pedo", "label": 1}
{"text": "Just curious about one thing. In the end of the episode that dick bag got in the car with a girl. They didn't show her full face, but he called here chiharu. Spoiler from the manga, but that is the name of the amagami sisters mom. But, at least where I'm at in the manga, it's been confirmed that she's dead. So I'm just curious if there are any manga readers out there who are all caught up and know who she is. I don't mind if you spoil it for me.", "label": 1}
{"text": "A large portion of anime viewers tolerate or straight up enjoy content that lands on the child porn spectrum.", "label": 1}
{"text": "There are certain hypocrites in the fanbase who would point out flaws in a decent show while ignoring half the criticism of programs that are complete shit.", "label": 1}
{"text": "Stopped watching hetalia after my mutuals started reposting hetalia 9/11 fanart unironically on 9/11. We were in junior high. One of them is a nurse now. Hope she’s doing well", "label": 1}
{"text": "Not watching hetalia after my mutuals started reposting hetalia 9/11 fanart unironically on 9/11. We were in junior high. One of them is a nurse now. Hope she’s doing well", "label": 1}
{"text": "Watching dubbed anime is for sub humans.", "label": 1}
{"text": "How about [the other one](https://x.com/KingjoshuaArt/status/1851279891620057480?t=zS7T-OIS1XIlFlXKH5oEBA&s=19)", "label": 1}
{"text": "Do we finally have an anime with more lore than Gundam?", "label": 1}
{"text": "Heavens Feel Movie 3", "label": 1}
{"text": "😍", "label": 1}
{"text": "Is it good? I don’t have good experiences with older anime 🫠", "label": 1}
{"text": "I've watched it 5 times; it's one of my favorite anime. I’d like similar anime if possible 🥰", "label": 1}
{"text": "The Catholic Church now has an anime mascot.\n\nhttps://www.ign.com/articles/the-catholic-church-just-rolled-out-an-official-anime-inspired-mascot?utm_campaign=trueAnthem%3A+Manual&utm_medium=trueAnthem&utm_source=facebook&fbclid=IwY2xjawGPHYxleHRuA2FlbQIxMQABHVH4rmpTfoHQBatew1XUdD1v7h_3kOUaYYCJmnrENDM7_Iaj7-HnJx7yfA_aem_k9lKy1I86JWh14IpSp3ykQ", "label": 1}
{"text": "It's interesting to see others' views of this show as someone who's read few volumes of the manga.\n\nThese first episodes have been a bit rough ngl, the cast is so big and in the beginning they all seem so one-dimensional. I'm pretty sure it's gonna get better though, but I'm not sure if it was just the manga format that made the jokes land better. Sensei is definitely a cinnamon roll even here, the school uniform jokes don't really bother me as they're portrayed very lightly.\n\nI'm excited for the next episode, it seems we're going to get outside of the schoolground and meet Sensei's family.", "label": 1}
{"text": "This week on Rezero breaktime, they revealed an important bit of information that was previously cut in season 1. I'd strongly recommend you to watch it as it contains important lore about one of the major characters. I have linked the video with translated english subtitles.\n\n\nImportant: Don't read the comments of the youtube video as it contains major spoilers of future arcs.\n\n\n[The video](https://m.youtube.com/watch?v=z6gdbscbZ7s&pp=ygUYcmV6ZXJvIHMzIGVwIDUgYnJlYWt0aW1l)", "label": 1}
{"text": "10 years... and I still shed a tear when I hear Hatoko's speech...", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n- Direction toward specific sources of pirated content of any type is not allowed. This includes links to unofficial scanlations, streams, uploads, and download sources of any copyrighted content. It also includes direction towards specific sites offering this type of content, and watermarks mentioning such sites in uploaded images/videos.\r\n\r\n  Discussion of piracy in general is allowed, **but naming, linking to, or hinting towards specific sources is not. Offering to send links via PM is also not allowed.** For more details, see our [full rules on illegal content](https://www.reddit.com/r/anime/wiki/rules#wiki_do_not_link_to_illegal_content).\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Absolutely, but even then the novel description for the scene was a bit better but with season 3? I can say they are starting to go all out with the brutality, episode 2 was what made me realize this with white fox even adapting subaru monologue etc... My hopes for a great arc 6 adaptation are quite high now.", "label": 1}
{"text": ">My hopes for a great arc 6 adaptation are quite high now.\n\nWhite Fox is pretty much openly saying that Re:Zero is their magnum opus.", "label": 1}
{"text": "A lot of people's comments got mass deleted last episode because the 1st season has been so long that people have started reading the LNs and Season 1 parts were self-contained so they had to cut out these foreshadowings during that production time of Season 1.\n\nAnd yeah, if Eminence could do it with subtitles, Kadokawa/Crunchyroll should be uploading these with subtitles themselves.", "label": 1}
{"text": "This episode has absolutely reignited my hopes for Season 3 after not being so hot on Episodes 3 and 4.\n\nI have so much hope for the Arc 6 anime now that we've seen how good the horror direction can be", "label": 1}
{"text": "And we are feasting with it\n\n&nbsp;\n\nSasuga, White Fox", "label": 1}
{"text": "Archbishops, Warlocks and Witches are just different names of the same thing", "label": 1}
{"text": "Pretty sure this was more so an outlier because it was S1 cut content but yeah some minor details are shown in breaktimes.  \nAlso, kadokawa releases the breaktime episodes on their youtube channel... not with subs tho. You have to look for the section in the comment section. Some, nice fellow would have posted them there", "label": 1}
{"text": "Wtf do u mean not being hot on 3 and 4? They were phenomenal eps!!\nOr are you one of those whiny entitled Re Zero LN readers who thinks that unless the anime adapts everything perfectly then it's \"mid\"?", "label": 1}
{"text": "They are lol", "label": 1}
{"text": "As an LN reader, there was some stuff they cut out/left out which seemed... weird that they did so? But they also cut some stuff that really didnt matter + they are covering some of the small stuff in the Breaktime, so any grievances I had personally are mostly gone. (They also \"censored\" some of the outfits but like... fair enough LOL)", "label": 1}
{"text": "It's because this was a SKIPPED content in season 1. \n\nThis conversation originally happened during the first time they met, but the anime skipped it.  It's been a long speculation on exactly why considering how important this seems to be.   I've since wondered if they'll do a reveal later in the story before Al gets to shine, and it seems my hunch was correct.\n\nThere are few other seemingly-big-deal cut content from s1 and s2 like this one, so I imagine the anime will weave them in as they become relevant.", "label": 1}
{"text": "With the insane amount of monologues and dialogue this series has , we somehow still need to watch some additional stuff to understand characters and world ? Just goes  to show the incompetence of writer and the director.  \n\n\nI am just reading the LN of this series because everyone keeps praising it high heaven and I still haven't found anything good yet in anime and the novels are far wrose. There is too much dialogue but very little characterisation.\n\n The villains feel the same that go on unhinged monologues for minutes that add nothing to their character expect the fact that they are mentally retarded.\n\nEven though there was so much happening in episode I still managed to fall asleep.\n\nAnyone that thinks that series is more than 6/10 is deluded. And that is me being generous.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  This belongs in the Source Corner at the top of this thread. In discussion threads for currently airing anime, discussions about source material, spin-offs, mangaka comments and unadapted content must be posted there, and not outside it. This applies specifically to comparisons to the anime or hints about future events, even if such hints are vague. Please note that you still have to tag your spoilers in the source corner.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Is it good?", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n- Your comment technically breaks two of our rules. First, everything in your second paragraph after the final comma breaks our Source Corner rule. Second, your link breaks our piracy rule. If you delete the text after the comma, replace the link with the name of the twitter account, and let me know, I'll reapprove your comment.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  This belongs in the Source Corner at the top of this thread. In discussion threads for currently airing anime, discussions about source material, spin-offs, mangaka comments and unadapted content must be posted there, and not outside it. This applies specifically to comparisons to the anime or hints about future events, even if such hints are vague. Please note that you still have to tag your spoilers in the source corner.\r\n\r\n\r\n\r\n- You can name the twitter account where people can find it, but you cannot directly link the video. If/when you fix it, let me know and I'll reapprove your comment.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "I don't give a SHIT that the insane mod here is going to delete this, even though it's 100% anime content.  \n\nGo check out the Breaktime episode following this one, it's pretty important to the anime and the idiot MOD is deleting every mention of it- EVEN THOUGH IT'S PART OF THE ANIME.\n\nJapanese version here: \nhttps://www.youtube.com/watch?v=KbEZQcn8c80\n\nI lost the link to the translated version, although they will probably delete this comment too before I find it.", "label": 1}
{"text": "The idiot mod is erasing every comment about this, but the reason why this seems too important is because the Breaktime is supplementing the anime with skipped contents.  It's the anime's way of course-correcting the story.  This is very relevant discussion to the anime and yet the stupid mod is removing evey mentioning of the Breaktime, which is part of this anime. \n\nto the moron Mod: This isn't about source material or spoilers, this is literally about the anime episode itself and its extra youtube content's editing decisions.", "label": 1}
{"text": "Same VA\n\nHopefully, Reinhard will not be sealed", "label": 1}
{"text": "Cult lore is not fully explained but there is some added context in the novels during Emilia's flashback.\n [Re:Zero novels]>!It's implied that there used to be two branches of the witchcult, one more moderate lead by pre-train tremble Geuse and a more radical one by Regulus. Then Pandora showed up as seen in the flashback and got to Geuse.!<  ", "label": 1}
{"text": "This was mentioned in arc4, season two. I'm not sure if they removed it from the anime. It's very simple actually. His wives are not immortal like him. That's why he finds new women when his wives die. I think the total number of wives, including those who died, was around two hundred.", "label": 1}
{"text": "Thanks", "label": 1}
{"text": "It’s cut content but my comment will be removed so…", "label": 1}
{"text": "Don’t worry not even novel readers know who she is so that’s still a theory.", "label": 1}
{"text": "Apparently Tappei tweeted Capella never seen Emilia and made her probably based on some Subaru's brainwave info, but honestly I like my interpretation better lol 😄\n\n\n\n(She did know about the wedding, so I'd imagine she had seen Regulus with Emilia knocked out at some point)", "label": 1}
{"text": "Yeah either way to Capella, Emilia is just some girl but your headcanon feels a bit cleaner", "label": 1}
{"text": "Bitch stfu", "label": 1}
{"text": "Cry more, join Subaru in his slothfulness", "label": 1}
{"text": "I vaguely remember in the WN, that it was described more disgustingly and horrifyingly about the situation with the flies in the room. Iirc, it was just a room filled with flies like, squished up flies sticking together and they were all looking at Subaru", "label": 1}
{"text": "The Kingdoms of Ruin", "label": 1}
{"text": "Oshi No Ko", "label": 1}
{"text": "Not gonna spoil anything but if want to see the stakes being raised to the absolute maximum then I would recommend reading the light novel/web novel since the anime will probably take decades to catch up to it", "label": 1}
{"text": "Is there any other anime like Monster? One that doesn't take place in Japan but not in a fictional world? I mean like an actual IRL country, not an isekai or fantasy world. In the case of Monster it takes place in Germany.", "label": 1}
{"text": "i read the title, thought to myself \"school days\", then read the rest of your post. everyone i know that watched school days feels the same way", "label": 1}
{"text": "Your name", "label": 1}
{"text": "I didn't realise civility was relegated to specific themes and categories! Let me rephrase my comment, then: \n\n\"That is the single most stupid and poorly thought argument for the justification of a show demonstrating paedophilia in a largely positive light that I have ever witnessed. Every single letter of each word so thoroughly vapid and wasted that I feel dumber for having read it. Shame on your argument for ever existing.\"\n\nPerfectly civil, by your standards. Thank you for clearing it up.", "label": 1}
{"text": "Thank you! You did it in style!", "label": 1}
{"text": "''oh this is nothing, it gets so much worse!'' ''oh he doesn't know hehe''\n\nCan't you just, like, stop? It's not cute or funny to do this vague hyping up something in the future.", "label": 1}
{"text": "one piece", "label": 1}
{"text": "It's wild because without context, you'd think this was about just a girlfriend talking to her nerd-ass boyfriend.  But no, they HAVE superpowers which actually makes this scene so much worse.  Bro's still trying to be a chuuni edgelord with superpowers.", "label": 1}
{"text": "It's wild because without context, you'd think this was about just a girlfriend talking to her nerd-ass boyfriend.  But no, they HAVE superpowers which actually makes this scene so much worse.  Bro's still trying to be a chuuni edgelord with superpowers.", "label": 1}
{"text": "You need to like chill dude. Stop acting like answering a question without any specifics in anyway is bad.", "label": 1}
{"text": "First if the mods are going to delete my commen please just ban me instead.\n\nI said that people who hate MT due to the MC is hitting on young girls are stupid, because its just an anime and they shouldnt take it seriously, and the point of the anime is the MC is reborn and experiencing life again (in reality its his first time experiencing life). And lastly, most other animes sexualize girls and there are punch of lolis who look young but people say its fine to sexualize because they are 1k years old.\n\nIm not saying pedos in anime is fine, no, it is bad, but the argument of hating MT because of it is stupid.", "label": 1}
{"text": "Oh fuck off. \n\n>he person in question was attempting to defend this facet of the show - the paedophilic content.\n\nExcept he wasn't. YOU are putting words in his mouth.\n\nAccording to your so-called \"justification\", anybody who doesn't hate this show because of its questionable content is automatically a pedo. \n\nAnybody who watches mafia movies is automatically susceptical to committing crimes. \n\nAnybody who plays shooting games has a tendency to shoot up their schools.\n\nWe could go on.\n\nSpare us your condescending virtue signalling. Reported for trolling and blocked.", "label": 1}
{"text": "not gonna spoil but this is the one author you can't doubt. This is only arc 5 out of current 9 out of the planned 12 arcs. He is going to explore all possibilities in depth with Return by Death...", "label": 1}
{"text": "That information was actually revealed all the way back in Arc 3 when Subaru was in the horse-drawn carriage with Priscilla and Al. It was just not included in the anime. Light novel readers wondered for a long how the anime will decide to reveal that information to the anime onlies.", "label": 1}
{"text": "hi everyone, has someone got a place where i can watch anime for free without a subscription? i was using animeusge but... its gone RIP, i remembered so many animes that i wanted to watch the second season of but i forgot:(\n\nas many websites as possible would be appreciated, byeee", "label": 1}
{"text": "Yuri on ice , and still waiting for 2nd season", "label": 1}
{"text": "Also the 2nd episode of this season caught me off guard. I didnt expect gore to be so detailed as in the LN. Seeing his fingers getting cut off by the chain, and then blood floating away from his cutted fingers like a river was just next level gore. I never saw any anime with similiar popularity, to be a shonen and at the same time preseting so much gore. I love re zero", "label": 1}
{"text": "Remember when Rudeus groped the dog and cat girl and that made them become his loyal servants? Or when he tried to take Eris's panties off while she was sleeping? Or how he worshipped a box with his mentor's panties in it? Or how he didn't tell Roxy he had a pregnant wife at home?  Rudy sucks and the writing sucks.  Part 2 of season 1 was so good I forgave it, but I only made it through Season 2 out of spite for Rudeus.  ", "label": 1}
{"text": "Re-zero", "label": 1}
{"text": "Ecchi anime", "label": 1}
{"text": "Am I the only one who loves Kirishima? When I heard ppl saying he keeps sleeping around and cheating on Yoshino and that’s why they hated him, I was like hmm.. ? I read the whole manga to the latest update and he literally only sleep with 2 girls. And 1 of them was for Yoshino’s sake. Kirishima is so genuine and sincere to Yoshino. He’s devoted and is like a cute happy little puppy infront of its owner all the time. I LOVE them so much!!!! Am I the only one who thinks so? ", "label": 1}
{"text": "Overhyped flavor of the month dogshit shounen fluff winning by a landslide? On Reddit? Whoever would have predicted such a thing?\n\nAt least I can take solace in the knowledge that while Frieren may at the moment be carried by some collective self delusion among this self-proclaimed \"community\" (thank fuck I've never considered myself part of any such thing), that must sooner or later die down, at which point it'll inevitably be forgotten inside a week.", "label": 1}
{"text": "The anime you’re describing seems to be either 'Kiddy Grade' or 'Gundam Build Fighters,' as it features characters wearing robot suits. However, it can be difficult to pinpoint it accurately based on the description alone. If you have more details or elements you remember, I might be able to help you better.", "label": 1}
{"text": "And oddly skimpy clothes which are, based on what I heard, also censored to be less so in the anime.", "label": 1}
{"text": "Clearly english isn't your first language, so I'm not gonna come at you, but just to give some advice, work on your grammar. Specifically pronoun and verb agreement as well as your run-on sentences. good luck! 🤜🤛", "label": 1}
{"text": "Youtube. Officially:  \n[https://www.youtube.com/watch?v=KbEZQcn8c80](https://www.youtube.com/watch?v=KbEZQcn8c80)", "label": 1}
{"text": "Let me rephrase: all the lore from the episodes is canon.\n\nThe actual interactions and events could be interpreted as anime canon. None of the other episodes have done big plot reveals like this week's episode, so this one creates a difficult situation.\n\nThe reveal is cut content from Season 1 if we're talking about where it happened in the Light Novel (source material). Therefore, it definitely didn't happen like that.\n\nIt's the fate of anime adaptations, I guess. Cut content will always plague anime adaptations when the production committee doesn't know if they will do a full adaptation or not.", "label": 1}
{"text": "Now if only someone who knows both designs could give us a comparison? Reminds me of what happened with konosuba:bakuen's Arnes between LN and anime.", "label": 1}
{"text": "U can’t say this when the author of MIA was literally caught with so much CP that they thought he was a distributor.\n\nAnd no I really don’t think MT is an advocate for pedophillia, we’re clearly watching different shows(especially if u make it past season 1) if u think that.", "label": 1}
{"text": "I'm an Anime-only, so can't really compare to the LN descriptions or whatnot, but the WIKI does have a handful of pictures of her in the 'Light Novel' tab. Here's the [most prominent one](https://static.wikia.nocookie.net/rezero/images/4/43/Capella_Emerada_Lugunica_LN_character_design.png/revision/latest?cb=20230523001724). I'd check deeper for you, but I don't want to risk any spoilers for myself. It seems mostly like she just has a much more 'bikini' style top in the LN verses the [slightly less revealing version](https://static.wikia.nocookie.net/rezero/images/c/c5/Capella_Emerada_Lugunica_Anime_Season_3_Design.png/revision/latest/scale-to-width-down/1000?cb=20240901173637) from the anime.", "label": 1}
{"text": "fate, any of em", "label": 1}
{"text": "Baki", "label": 1}
{"text": "Definitely Monster, Ergo Proxy, Paprika. Elfen Lied if you can handle edginess for the sake of being edgy.", "label": 1}
{"text": "My Hero Academia.\n\n\nNo, really.", "label": 1}
{"text": "just watched Gurren Laggan (not sure if that's how it's spelled), and it's this", "label": 1}
{"text": "The Banished Former Hero Lives as He Pleases - bear in mind the anime is pretty boring and generic, but I think it's the exact premise you are looking for.\n\nDeemed a \"good-for-nothing\" for his low level and lack of a god-given Gift, Allen is stripped of his noble status and banished from the Duchy of Westfeldt. But Allen has a secret: he was a great hero in a previous life, and he's thrilled for the chance to finally live the way he pleases! His drama-free existence, however, is soon interrupted by a desperate encounter with his ex-fiancée. As a former hero who still possesses the incredible powers from his past life, Allen can't ignore someone in need—no matter how much he might like to! And so begins the new heroic saga our former hero never wanted!\n\nBanished from the heroes party\n\nChillin' in my thirties after getting fired from the demon lords army\n\nI quit heroing - exact premise you are looking for \n\nI Couldn't Become a Hero, So I Reluctantly Decided to Get a Job\n\nCurrent season - Goodbye dragon life looks like it has some potential. Dragon gets killed and gets reborn as a regular human. \n\nI am actually looking for similar stuff too. Chill fantasy stuff.", "label": 1}
{"text": "tengen toppa GURREN LAGANN", "label": 1}
{"text": "And as if on cue, here come the lobotomized apes to defend this shit with their middle schooler level \"retorts\".", "label": 1}
{"text": "KotakuInAction as you community is fine tho, right? Incel 🤣", "label": 1}
{"text": "Hunter x Hunter", "label": 1}
{"text": "My hero academia", "label": 1}
{"text": "Which is odd because Suberu ends up with a harem of lolis. It gets so bad he ends up with the nickname of \"little girl tamer\". I get that it's \"different\" because the MC isn't into that, but the author is clearly writing for and targeting that demographic. He wants the readers to spend a lot of time thinking about how all these underage girls are into him. Betty, Ryuzu, Petra, Meili, Rui.. Even Emilia is only like 16 at the beginning of the story and it's not like Rem/Ram actually look like adults either. Actually that's a common theme. There's also a bizarre amount of loli antagonists. I also forgot that mentally Emilia is like 10 years old or something canonically.", "label": 1}
{"text": "Ok buddy, where do I start with this\n\n> Which is odd because Suberu ends up with a harem of lolis.\n\nWhat in the even? Are we talking about the same show, Subaru outright rejects Beatrice and Petra’s crush hardly counts as nothing relevant.\n\n> It gets so bad he ends up with the nickname of “little girl tamer”. I get that it’s “different” because the MC isn’t into that\n\nNo, this is just for Beatrice (if I count correctly, that’s one person), it’s only a gag and has no devious meaning behind it.\n\n> but the author is clearly writing for and targeting that demographic.\n\nTappei isn’t that kind of author, he outright says he dislikes fan service and at no point he puts Beatrice or any child in these kinds of situation (apart from brutally murdering them ofc)\n\n> He wants the readers to spend a lot of time thinking about how all these underage girls are into him.\n\nWHEN? When did tappie allocate precious time for that kind of thing? No character thought of it like that, and again, Petra has crush, are you an alien perchance? Did you not have a crush on your teacher or a person of older age during puberty ever? Did god make you so he can think of how these underage people are into your crush?\n\n> Betty, Ryuzu, Petra, Meili, Rui..\n\nIn that order:\nRejected - when was this even hinted? - one sided childhood crush - man she loved him so hard she killed him and all the people he loved multiple times, if this is a bait I congratulate you on triggering me - anime only watcher so I don’t know who that is sadly.\n\n> Even Emilia is only like 16 at the beginning of the story\n\nWrong, She’s 17 at the beginning, and 18 in season 3.\n\n> and it’s not like Rem/Ram actually look like adults either.\n\nDid you close your eyes every time Emilia was on screen? When did she ever look like a child?\n\n> There’s also a bizarre amount of loli antagonists.\n\nSo far in the anime, only 2, whoever rui is who was cut from the anime looks evil idk, but I’m an anime only sadly\n\n> I also forgot that mentally Emilia is like 10 years old or something canonically.\n\nAfter she woke up, yes, but we don’t know how long she lived in the forest alone (or maybe we do, I just don’t remember lol) and we don’t know how long she lived with Roswald before Subaru arrived\n\nBut in either case, tappie said she’s 17, later 18 in season 3, and almost surely he means mentally, because since elves are immortal in rezero, biologically she probably 400+ years old, and I don’t think he’d confuse the 2.\n\nLook man, if it makes you happy, I am triggered, I am a beta soy cuck fuck who got angry at your bait comment, so excuse me if I sounded prudish in this comment, because you look like you didn’t even watch or read the thing.", "label": 1}
{"text": "Really incredible. Kinda used to seeing things going to shit, but things are continuing to stack on getting worse and it doesn't look like Subaru's restarting powers will proc because somehow he's not dying.", "label": 1}
{"text": "I'm sorry that you are retarded .\nThe average resistor is an absolute moron, and you are it.", "label": 1}
{"text": "Why yes, I would rather associate with a random mass of Christian lunatics, conspiracy theorists and the occasional sane person than any group that'd take \"people\" like you.", "label": 1}
{"text": "If we don't crush this problem we will lose everything we love if you don't believe me watch this https://youtube.com/@yellowflashproductions?si=bRbHWKNR4ERFO1si", "label": 1}
{"text": "It contains lore, character interaction, funny moments, cut content, etc. They are all cannon but they are not too important, you can watch it if you want more Re:Zero content. However, the break time this weak contains crucial cut content that should not be missed\n\nThis cut content was supposed to be in Season 1 and people have assumed that it will be added to Season 3 due to how relevant it is to the current story arc and future arc. Nevertheless, now that it adapted to the break time, that means that it won't be added to Season 3 anymore while the anime considers that this event has already happened. This will cause a lot of confusion so I would like to recommend anyone to watch the break time. The fan are quite outrage about it decision and I don't blame them, this cut content should be added into Season 3", "label": 1}
{"text": "> What in the even? Are we talking about the same show, Subaru outright rejects Beatrice and Petra’s crush hardly counts as nothing relevant.\n\nHarem isn't about actually getting all the girls, it's about being surrounded by lots of girls and selling the idea that the protagonist could if he wanted. I'm pretty sure you know that.\n\n> No, this is just for Beatrice (if I count correctly, that’s one person), it’s only a gag and has no devious meaning behind it.\n\nNo this is in the light novel too. When he recruits Meili to help cross a certain desert the party makes fun of him for it. It's remarked on several times by people throughout the LN because of how many girls he's traveling with. \n\n> Tappei isn’t that kind of author, he outright says he dislikes fan service and at no point he puts Beatrice or any child in these kinds of situation (apart from brutally murdering them ofc)\n\nThe amount of underage girls written into the story, whether as side characters or antagonists is baffling. There's so many. \n\n> Wrong, She’s 17 at the beginning, and 18 in season 3.\n\nThat doesn't make it better.\n\n> Did you close your eyes every time Emilia, rem or ram was on screen? When did she ever look like a child\n\nRam/Rem don't look 18 to me.\n\n> So far in the anime, only 2, whoever rui is who was cut from the anime looks evil idk, but I’m an anime only sadly\n\nShe's in the LN. Honestly I haven't even read all the LN, but he continues every arc to pick up more underage girls for his party. Like every arc he gets at least 1.\n\n> After she woke up, yes, but we don’t know how long she lived in the forest alone (or maybe we do, I just don’t remember lol) and we don’t know how long she lived with Roswald before Subaru arrived\n\nWe do know, it's in the LN but I can't remember the exact age. As far as I recall, she was like 7 when she was frozen, and then after that she lived with roswall for several years but her body aged while she was frozen. I just remember thinking at the time that basically gives her the mental equivalent of a child. It comes up in the LN sometimes and even the anime *where she thinks that kissing makes babies and Suberu has to explain to her that kissing won't make her pregnant.* \n\nAnyway. My point is that the only thing more overwhelming than the amount of lolis in Re:Zero is the hypocrisy from it's fanbase. \n\n> because you look like you didn’t even watch or read the thing.\n\nI'm Vol 27 currently. There's 39 total though not sure I'm gonna keep reading it.", "label": 1}
{"text": "To answer you question in the third paragraph \n\nIn the novels Emilia felt threatened by regulus and refused to make any rash moves because she could sense he had some great power.\n\n“Emilia was filled with doubt and resistance, but at the same time, her instincts were telling her not to openly defy this man, that Regulus Corneas possessed great power. A horrifyingly vast amount of power.”\n\nExcerpt From\nRe:ZERO -Starting Life in Another World-, Vol. 18\n\n“She watched him disappear down the hall, and when he was finally out of view, her shoulders gradually relaxed at last. Her body had instinctively tensed up, completely on guard against him without her ever realizing it.\nHis mere presence felt just as menacing as the horde of great rabbits—”\n\nExcerpt From\nRe:ZERO -Starting Life in Another World-, Vol. 18\n\nThe anime couldn’t convey it well in that short window frame but I think it’ll show more in the coming episodes so people like you can get it.", "label": 1}
{"text": "\nIn the novels Emilia felt threatened by regulus and refused to make any rash moves because she could sense he had some great power.\n\n“Emilia was filled with doubt and resistance, but at the same time, her instincts were telling her not to openly defy this man, that Regulus Corneas possessed great power. A horrifyingly vast amount of power.”\n\nExcerpt From\nRe:ZERO -Starting Life in Another World-, Vol. 18\n\n“She watched him disappear down the hall, and when he was finally out of view, her shoulders gradually relaxed at last. Her body had instinctively tensed up, completely on guard against him without her ever realizing it.\nHis mere presence felt just as menacing as the horde of great rabbits—”\n\nExcerpt From\nRe:ZERO -Starting Life in Another World-, Vol. 18\n\nThe anime couldn’t convey it well in that short window frame but I think it’ll show more in the coming episodes so people like you can get it.", "label": 1}
{"text": "Move the goalposts back, chief - BL covers a wide range of things *including* pornography. Truly straight men do not consume gay porn.   \nAlso asexual does not mean aromantic nor that they do not have or desire sex, simply that they do not feel sexual attraction to any gender. In other words it's completely redundant to the point.\n\nNo, it doesn't HAVE to be equivalent - I doubt many furries are practicing zoophiles. A lot would probably fuck a werewolf were they to exist, but we can't argue hypotheticals since there's no way to solidify proof.   \nUnfortunately correlation exists, and people very typically consume what they enjoy or are attracted to. \n\nOr are you next going to argue that it's perfectly acceptable for people to fantasise about fucking children?  \nMatter of fact - don't answer that. With the way you people be talking I'd rather not risk being violently ill.", "label": 1}
{"text": "The official LN which is subject to multiple mistranslation btw. Also \"Lolimancer\" isn't even the correct translation lmao, why do LN readers keep bringing it up? It's just a fan translation that got popular, and doesn't even make sense cus 'loli' isn't in their world's dictionary.", "label": 1}
{"text": "[-mancer as a suffix basically just means 'user' or 'practitioner of a type of magic'.](https://en.m.wiktionary.org/wiki/-mancer#Emagic. Like how necromancer means undead magician/user. I don't know Japanese but I imagine the suffix part of it was just a Japanese version of the word which the translators felt matched well with -mancer's English definition. Lolita is absolutely an English word and loli would absolutely be known by anyone actually watching anime, but it carries a negative connotation with it thanks to porn and CSAM. So I'm honestly not surprised it wasn't used in the English LN or crunchy roll translations, but if you have a more direct I would actually be interested to know since I don't know what is specifically said in Japanese.", "label": 1}
{"text": "1", "label": 1}
{"text": "it literally translates to little girl user", "label": 1}
{"text": "So little girl-mancer?", "label": 1}
{"text": "Eminence is shadow is the one", "label": 1}
{"text": "My condolence, truly. But i assure you that [minor spoiler]>!our heroes would get their break in next week episode!<", "label": 1}
{"text": "Tbf that person’s questions were rhetorical", "label": 1}
{"text": "Yeah! It soooo good", "label": 1}
{"text": "I've got a question for the manga readers, will we get anything about the war with the Teutonic Order?", "label": 1}
{"text": "Did you finish redo of healer?", "label": 1}
{"text": "not even gonna try to translate that", "label": 1}
{"text": "Any of you guys still remember Witch Hunter Robin?", "label": 1}
{"text": "It's more satisfying given that Ribbons and Alejandro were fucking.", "label": 1}
{"text": "nah demon slayer, one pm, naruto a the end of the list  \nbruh, fr nah, nah", "label": 1}
{"text": "AND JUJUTSU KAISEN, you guys are no life", "label": 1}
{"text": "Глупые и слабые малыши, нет дедушек зато шлака в топ запихали….позор вам новое поколение анимешников", "label": 1}
{"text": "Thanks", "label": 1}
{"text": "Akame ga kill", "label": 1}
{"text": "Worse- Quality of voice acting same voice actors in every anime. I can understand using them for side characters but for main characters it can be easily spotted\n\nBetter: the anime have better pacing now", "label": 1}
{"text": "**You can read the Light Novels (EN) :**\n\n[LN FAQ](https://reddit.com/r/DanMachi/w/meta/light-novel-faq?utm_medium=android_app&utm_source=share)\n\n* DanMachi (19 Vols)\n* Sword Oratoria  (12 Vols)\n* Familia Chronicle Episode: Ryu (1 Vol)\n* Familia Chronicle Episode: Freya (1 Vol)\n* Astrea Record (2 Vols)\n\n**Adaptation:**\n\n**Anime:**\n\n**DanMachi :**\n\n* Season 1 : LN 1 - LN 5 (it was ok)\n* Season 2 : LN 6 - LN 8 (it was bad)\n* Season 3 : LN 9 - LN 11 (it was ok)\n* Season 4 Part 1 : LN 12 - LN 13 (it was good)\n* Season 4 Part 2 : LN 14 (it was very good)\n* Season 5 : LN 15 - LN 18 \n\n**Sword Oratoria :**\n\n* Season 1 : LN 1 - LN 4 (it was bad better read the LN/manga)\n\n**OVA:**\n\n* Season 1 : Is it Wrong to Expect a Hot Spring in the Dungeon? (Not canon)\n* Season 2 : Is it Wrong to Seek Herbs on an Uninhabited Island? (Not canon)\n* Season 3 : Is it Wrong to Seek Hot Springs in Orario? \\~God of the Bath Forever\\~ (Not canon)\n\n**Movie**: \n* Arrow of the Orion (Not canon, but i will watch it for the lore)\n\n**Manga (EN) :**\n\n* Is It Wrong to Try to Pick Up Girls in a Dungeon II - Ongoing - At LN Vol 8 (Note: they skipped LN Vol 6)\n* Sword Oratoria - Ongoing - At LN Vol 12 (Note: they skipped LN Vol 9)\n* Familia Chronicle Episode Ryu - Complete\n* Familia Chronicle Episode Freya - Ongoing (Note: they only covered LN Ch 1)\n\n**DanMemo Videos (Game: Memoria freese) :**\n\n**Season 1 (Cut content) :**\n\n* DanMachi LN Vol 4 (SS) [https://www.youtube.com/watch?v=aoIeCis8v8U](https://www.youtube.com/watch?v=aoIeCis8v8U)\n* DanMachi LN Vol 4 Special Chapter [https://www.youtube.com/watch?v=6TuTKcIeJrs](https://www.youtube.com/watch?v=6TuTKcIeJrs)\n\n**Season 2 (Cut content) :**\n* DanMachi LN Vol 8 Part 1 : [https://www.youtube.com/watch?v=llO5LQ6AsfI]([https://www.youtube.com/watch?v=llO5LQ6Asf)\n* DanMachi LN Vol 8 Part 2 : [https://www.youtube.com/watch?v=pTzsM5-VFQg](https://www.youtube.com/watch?v=pTzsM5-VFQg)\n\n* DanMachi Season 2 (SubStory) [https://www.youtube.com/watch?v=ZGcObbbyZd0](https://www.youtube.com/watch?v=ZGcObbbyZd0)\n\n**Season 3 (Cut content) :**\n* DanMachi LN Vol 11 ; Part 1 [https://youtu.be/AT510B3qV0k](https://youtu.be/AT510B3qV0k)\n* DanMachi LN Vol 11 ; Part 2 [https://youtu.be/3cwbCsa1sd8](https://youtu.be/3cwbCsa1sd8)\n* DanMachi Season 3 (SubStory) [https://www.youtube.com/watch?v=HhpkJnWMa2M](https://www.youtube.com/watch?v=HhpkJnWMa2M)\n\n**Season 4 (Cut content & original) :**\n* DanMachi Season 4 Part 1 (SubStory) [https://www.youtube.com/watch?v=sBIGiOMYojw](https://www.youtube.com/watch?v=sBIGiOMYojw)\n* DanMachi Season 4 Part 2 (SubStory) [https://www.youtube.com/watch?v=SwlkN-EgRTU](https://www.youtube.com/watch?v=SwlkN-EgRTU)\n\n**Sword Oratoria LN (Some changes from Vol 8 - Vol 12) :**\n* Sword Oratoria LN Vol 5 - Manga Ch 41 [https://www.youtube.com/watch?v=q1Uf70iOb5g](https://www.youtube.com/watch?v=q1Uf70iOb5g)\n* Sword Oratoria LN Vol 6 : Part 1 [https://www.youtube.com/watch?v=TO6OsPq\\_rC4](https://www.youtube.com/watch?v=TO6OsPq_rC4)\n* Sword Oratoria LN Vol 6 : Part 2 [https://www.youtube.com/watch?v=tv17nabSax4](https://www.youtube.com/watch?v=tv17nabSax4)\n* Sword Oratoria LN Vol 7 [https://www.youtube.com/watch?v=P6fZhJO6PCU](https://www.youtube.com/watch?v=P6fZhJO6PCU)\n* Sword Oratoria LN Vol 8 [https://www.youtube.com/watch?v=dKA47V-rM2k](https://www.youtube.com/watch?v=dKA47V-rM2k)\n* Sword Oratoria LN Vol 9 [https://www.youtube.com/watch?v=lfVyNviZw-w](https://www.youtube.com/watch?v=lfVyNviZw-w)\n* Sword Oratoria LN Vol 10 [https://www.youtube.com/watch?v=tIil5cYQOQY](https://www.youtube.com/watch?v=tIil5cYQOQY)\n* Sword Oratoria LN Vol 11 [https://www.youtube.com/watch?v=USY0G1h6cp0](https://www.youtube.com/watch?v=USY0G1h6cp0)\n* Sword Oratoria LN Vol 12 [6th Anniversary event - Great Tale Orgion Saga (DanMemo ver 2023 - LN 12)](https://www.youtube.com/watch?v=pGTgNA4t8-E&t=4s)\n\n**Familia Chronicle LN :**\n* Episode Ryu : Part 1 [https://www.youtube.com/watch?v=ut8tT9lPt24](https://www.youtube.com/watch?v=ut8tT9lPt24)\n* Episode Ryu : Part 2 [https://www.youtube.com/watch?v=59kjUiX75BI](https://www.youtube.com/watch?v=59kjUiX75BI)\n* Episode Freya [https://www.youtube.com/watch?v=8e4arSLSkmQ](https://www.youtube.com/watch?v=8e4arSLSkmQ) (Incomplete Adaptation)\n\n**Anniversary Events :**\n\n2nd Anniversary Event - [The Clown March (DanMemo ver 2019 - canon)](https://www.youtube.com/watch?v=fSYDxpunLyI)\n\n3th Anniversary Event - [Astraea Record (DanMemo ver 2020 - canon)](https://www.youtube.com/watch?v=7UWD4pu_ETs)\n* Short Story : A Twilight Dream (What If) [https://www.youtube.com/watch?v=8cbDLJqJIdA](https://www.youtube.com/watch?v=8cbDLJqJIdA)\n* (Note: The JP light novel version of \"Astraea Record\" that was released in 2022 made some changes and added more lore)\n\n5th Anniversary event - [Knights of Fianna (DanMemo ver 2022 - canon)](https://www.youtube.com/watch?v=Yx8j4b2DrHs)\n\nFor more [DanMemo Full Stories](https://youtube.com/playlist?list=PLNkNRmafL0HOlflxUYx_GkOc9HS33SwOE&si=APfDssT-TNEjJEeC)", "label": 1}
{"text": "You're right cyberpunk is probably more sci-fi than fantasy but David was deeply infatuated & in love with Lucy and even died for her. How much more romance do you need lol?", "label": 1}
{"text": "She not an antagonist as she is not evil as she loves bell and helps him grow she is something like an ally antagonist as she challenges him but she is also does stuff on whims and is a selfish person.", "label": 1}
{"text": "It was a very good episode hard to watch but good, it felt rushed as a LN reader tho.\n\nFreya best girl anyway tho.", "label": 1}
{"text": "Yes they did but that stuff got cut out.", "label": 1}
{"text": "You didn't forced yourself to rewatch it did you?", "label": 1}
{"text": "not an Anime but Perfect Days [https://www.imdb.com/title/tt27503384/](https://www.imdb.com/title/tt27503384/) get me in the calming mood", "label": 1}
{"text": "The title is somewhat misleading i misinterpreted it", "label": 1}
{"text": "I won’t spoil but yeah the moment in the trailer was really good!!!", "label": 1}
{"text": "tokyo revengers and re-zero", "label": 1}
{"text": "I mean the trailer doesn’t necessarily show you what will happen so I guess not. \n\nBut yeah giving you a yes/no answer to your theory does so that’s why I’m not saying anything.", "label": 1}
{"text": "There’s only a couple gods that can resist it. \n\nMaybe 6/7. Loki isn’t one of them and neither is Hermes.", "label": 1}
{"text": "Im hoping that Japan has their heads on a swivel and sees the reality of what the UN involvement would truly mean. UN has no place to force Japan to do shit. If the UN was really concerned about violence toward women and children, instead of going after Japans entertainment media, maybe they should go after the hordes of violent ME migrants pouring over Europe and extending into the east - ya know, the ones who are Actually carrying out atrocities towards women and children. Japan is probably one of the safest places on earth for women and children ironically so its nonsense for the UN to write such crap and makes me think they have other motives", "label": 1}
{"text": "Do the other gods up in the heaven not have anything to say about this? I thought none of them were allowed to use their powers outside of heaven.", "label": 1}
{"text": "But wouldn’t that make other gods angry? Freya is basically rawballing over both them and their familias.", "label": 1}
{"text": "I agree if it doesn't affect the plot", "label": 1}
{"text": "Good question. The other gods will obviously be pissed but you also shouldn’t forget Freya’s beauty and how it effects the average mortal/god by simply looking at her.\n\nAs for Loki and Hermes:\n\n1. Loki and Freya are basically day 1 friends/rivals: They rose to the top together, they both struggled together and they both fought against each other and together. Loki will obviously be angry but not to the point she wants to kill Freya.\n\n2. Hermes is a trickster himself. He makes deals with others just for the sake of his own goals. So if someone actually pulls something on him, like now for example, he doesn’t have the right to get angry. He knows that as well.", "label": 1}
{"text": "Well I already seen some of them said it. Which is hilarious.", "label": 1}
{"text": "Just finished season 1 of made in abyss,\nI think it was worth it but i am kinda scared or idk of the disturbing scenes. Do they get worse? If they, is it still worth continuing?", "label": 1}
{"text": "It was more or less the latter: at this point of the story Freya is at her weakest state mentally so waiting 6 months just wouldn’t work for her.\n\nAs for your second half of the comment: There is a lot more to her character than her just being thirsty over Bell, though I can definitely understand why you would want Freya gone to the Heavens lol.", "label": 1}
{"text": "Ao basically they would know they got charmed by Freya, but just wouldn’t bother with it since they are gods. That actually makes sense.", "label": 1}
{"text": "She seems like a total outlaw at this point -- as to men and gods alike.....", "label": 1}
{"text": "It depends on which god we are talking about but yeah", "label": 1}
{"text": "I don’t blame you.", "label": 1}
{"text": "Only the 3 Greek virgin Goddesses (Hestia, Athena and Arthemis) can resist Freiya's power", "label": 1}
{"text": "Bell's Falna is protected now which means it doesn't show up unless Hestia unlocks it or somebody uses an item called Status Thief", "label": 1}
{"text": "[Kinda sad we didn't get the famous meme pannel tho.](https://i.redd.it/ozaoduyt82d71.jpg) But they used it as a setup reveal later with Momo.\n\nThe rest of it was super faithful.", "label": 1}
{"text": "One thing I like about the romance in Dandadan is that Okarun and Momo only have eyes for each other, and that's clear from chapter 1 until the newest chapter\n\nThere will be others who have a crush on them both (for spices of course), but everyone can see the endgame from miles away", "label": 1}
{"text": "I probably gonna get downvote for this post. But what the hell is that pseudo CP anime ? I had to nope it out alt+f4 when the main character tried to initiate sex with Eris, a 12 years old girls. Or earlier when he touched her while she was sleeping ... What is wrong with all the praises behind that anime ? It's just wrong to seing a fucking 40 years old pervert in a body of a 10 years old boy.\n\nThe story is not that bad, good animation but god damn I can't stand all the CP content, Feel like more I watched it, more it's getting worse. I know japan culture is something else sometimes, but how this anime get soo much recommend ?\n\nAnyways had to rant about this anime because I don't get it. After watching Frieren and Delicious in dungeon, this one shouldn't be that high in ranking.", "label": 1}
{"text": "It's implied by Alejandro's dialogue towards Ribbons \"My angel\". Plus there was that added hotel scene in the Special Edition of s1..", "label": 1}
{"text": "God I am not a fan of how they adapted this scene, they speedrun everything and didn't let scenes linger so it ends up feeling too rush, the LN had a perfect pacing for how the scene played out and you were able to slowly see Bell lose his mind, here the scenes just play bc it's the scene that is now supposed to be playing with no consideration for the atmosphere and tone that the original was going on", "label": 1}
{"text": "Damn, Didn't expect turbo granny in maneki neko form to have a child like voice. In the manga when momo say turbo granny is kinda cute, I always thought momo only referring to her appearance and doesn't include her voice so I was kinda surprise of how cute she's actually was.\n\nAnd also I just can't unheard Aira with a soft cute voice when I already knew of how chaotic she is.", "label": 1}
{"text": "Cannot wait for the rest of this arc to be adapted, I have full faith that science saru is going to animate it perfectly", "label": 1}
{"text": " Nah, she did walk all the way to near the tower. In the novel, we get to see her using her charm on people of the Guild to gather the others. The anime just sped through all that", "label": 1}
{"text": "He still would have to acquire a Status Thief (illegal item, so only sold in places like the town of Rivira on the 18th floor of the dungeon) without the Freiya Familia stopping him", "label": 1}
{"text": "Dragon Ball Z got traction in the West because it is the originator of modern shonen tropes ie it was completely original and new to western audiences. Blew people’s fucking minds when Goku died in the first five episodes.", "label": 1}
{"text": "Really glad I watched this episode, because from the manga I never realized that when Hina is talking about \"an opponent she thinks she might not be able to beat\" she is talking about Chinatsu... From the manga I assumed she was actually talking about gymnastics lol. Props to the animators for showing Chinatsu while Hina is talking, so that even dense people like me can understand", "label": 1}
{"text": "Try Hi anime", "label": 1}
{"text": "There are only 3 gods who are immune to charm, and they are the virgin gods; Athena, Hestia, and Artemis. Everyone else, god or no, is fair game. And Freya's charm is something innate instead of being a divine power, so her using it isn't breaking any rules.\n\nIt's why Hermes mentioned that she's breaking the rule she set for herself. She could have charmed the entire world, and nobody could really do anything about it. But she purposefully held back for the sake of the children of the Lower World. But no more. Not when it comes to having Bell.", "label": 1}
{"text": "Wait, so goddesses who have Charm can charm eachother?  (Dunno if there are any of those left after Ishtar)", "label": 1}
{"text": "Y’ALL AINT READY FOR THE BACKSTORIES (manga readers iykyk)", "label": 1}
{"text": "you're perceptive lol his character progression directly correlates with getting his balls back", "label": 1}
{"text": ">What in the even? Are we talking about the same show, Subaru outright rejects Beatrice and Petra’s crush hardly counts as nothing relevant.\n\nHarem isn't about actually getting all the girls, it's about being surrounded by lots of girls and selling the idea that the protagonist could if he wanted. I'm pretty sure you know that.\n\n>No, this is just for Beatrice (if I count correctly, that’s one person), it’s only a gag and has no devious meaning behind it.\n\nNo this is in the light novel too. [Re:Zero Starting life in another world Spoiler]>!When he recruits Meili to help cross a certain desert the party makes fun of him for it. It's remarked on several times by people throughout the LN because of how many girls he's traveling with.!<\n\n>Tappei isn’t that kind of author, he outright says he dislikes fan service and at no point he puts Beatrice or any child in these kinds of situation (apart from brutally murdering them ofc)\n\nThe amount of underage girls written into the story, whether as side characters or antagonists is baffling. There's so many.\n\n>Wrong, She’s 17 at the beginning, and 18 in season 3.\n\nThat doesn't make it better.\n\n>Did you close your eyes every time Emilia, rem or ram was on screen? When did she ever look like a child\n\nRam/Rem don't look 18 to me.\n\n>So far in the anime, only 2, whoever rui is who was cut from the anime looks evil idk, but I’m an anime only sadly\n\nShe's in the LN. Honestly I haven't even read all the LN, but he continues every arc to pick up more underage girls for his party. Like every arc he gets at least 1.\n\n>After she woke up, yes, but we don’t know how long she lived in the forest alone (or maybe we do, I just don’t remember lol) and we don’t know how long she lived with Roswald before Subaru arrived\n\nWe do know, it's in the LN but I can't remember the exact age. As far as I recall, [Re:Zero Starting life in another world spoiler]>!she was like 7 when she was frozen, and then after that she lived with roswall for several years but her body aged while she was frozen.!< I just remember thinking at the time that basically gives her the mental equivalent of a child. It comes up in the LN sometimes and even the anime where she thinks that kissing makes babies and Suberu has to explain to her that kissing won't make her pregnant. (Which is in the anime from last season.)\n\nAnyway. My point is that the only thing more overwhelming than the amount of lolis in Re:Zero is the hypocrisy from it's fanbase.\n\n>because you look like you didn’t even watch or read the thing.\n\nI'm Vol 27 currently. There's 39 total though not sure I'm gonna keep reading it cause I'm not really liking the arc I'm currently on so far.", "label": 1}
{"text": "Sorry, your submission has been removed.\r\n\r\n- This doesn't appear to be about [anime per our definition.](https://www.reddit.com/r/anime/wiki/rules#wiki_everything_posted_here_must_be_anime_specific)\r\n\r\n\r\n- Tensho's story is fine, but the focus on the response of a non Japanese anime industry person is off topic.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Tonari Animation *is* a Studio doing jobs in the Japanese Anime Industry. They have a small office in Japan. The latest Anime Production they did work on was that well known McDonald’s commercial aired in Japan.", "label": 1}
{"text": "They actually put a studio in Japan finally? They were in New York for a while.", "label": 1}
{"text": "Oh, look at that, they did. My bad, I'll put the post back.", "label": 1}
{"text": "Yes, they do although it was very small.\n\nOther past works they’ve done are Astro Note, Re: Monster, and Dungeon Meshi Season 1.\n\nDo you need more proof of Tonari’s involvement in the Japanese Anime Industry?", "label": 1}
{"text": "Kind of just realised just how much of the manga was about finding his balls , like he legitimately just got them back recentlt", "label": 1}
{"text": "Interesting little montage they inserted there with the [Blue Box]>!candy apple!< making an early appearance.", "label": 1}
{"text": "**Blue Spring Ride**", "label": 1}
{"text": "Nisekoi? I think bc raku and chitoge were friends before they met again in high school", "label": 1}
{"text": "Hestia is a virgin goddess . Freya is allowed to use charm if she doesn't use arcanum because it's her nature so she just has that ability hestia can resist Freya's charm in the same way because immunity to charm is Hestia's nature too", "label": 1}
{"text": "I'm very worried this will not work well as This trope not worked in Bleach(filler arc) It's not worked in one of my all time favorite anime \"Ushio & Tora\" mid of 2nd season they do this same mind wipe suddenly there enemies/neutral to all friends it was terrible. Lot of bad writing dragged down the middle of the 2nd season of Ushio & Tora. To be blunt I can't remember this ever working out well. \n\nDoesn't help the market square segment is almost beat for beat what I remember in Ushio & Tora well with less fighting but the gist the same. I'm sorry to keep bringing that up but when they did this in that anime it almost pushed me to stop watching and that would of been a mistake because the latter half of season 2 of Tora is insanely good.\n\nI'm really worried this will drag on and on Like i've seen it done before I really hope this is a quick mask off for the mind control. Guess time will tell", "label": 1}
{"text": "What a Great question", "label": 1}
{"text": "🫤 ", "label": 1}
{"text": "、やら、りd", "label": 1}
{"text": "I heard of that anime but I  didn't really care about that anime actually", "label": 1}
{"text": "Horror is rare anime and horror/comedy is even rare than dinosaurs", "label": 1}
{"text": "I think Dandadan have that aspect, i Didn't watch the anime but iv read some chapters, it has ghosts and comedy", "label": 1}
{"text": "Any episode from clannad after story, but if we wanna get specific…the episode where ushio wants to go for one last walk in the snow…tearing up just thinking about it", "label": 1}
{"text": "Season 2 episode 20 of JJK when mechamaru is saying goodbye to miwa on the train.", "label": 1}
{"text": "Not sure if it’s the same episode, but the one that gets me is the one where they go back and see the world after he died all those times", "label": 1}
{"text": "Dandadan, Hope de one piece", "label": 1}
{"text": "Gurren Lagann, the moment when Simon \"came back\", and the ending", "label": 1}
{"text": "good episode.", "label": 1}
{"text": "Hestia is not the only virgin goddess in lore :P I also still find Freya deserving of the worst.", "label": 1}
{"text": "Sasha Blouse AOT\n\nThe ending of assassination classroom Koro-Sensei\n\nSir Night Eye MHA\n\nKite Hunter x\n\nMaes Hughes Full Metal ( Thought he would be resurrected ti no avail).", "label": 1}
{"text": "KimiKiss and a ton of other examples. \"Childhood friend never wins\" is just a baseless trope people exaggereted. Sometimes they win, sometimes not.", "label": 1}
{"text": "Amagami is a bit complicated as every girl won. And if I remember right, childhood friend one only got romantic ending in S2.\n\nAnd both NagiAsu and True Tears are series where I wanted childhood friend to lose (if we are talking about pairing with MC). [plot]>!Both Noe and Miuna were so much better choice IMHO!<.", "label": 1}
{"text": "I'd be fine with if they had good animation for characters like demon slayer let alone background. But even thats rare", "label": 1}
{"text": "Touch and Cross Game, both by Mitsuru Adachi. Interestingly enough, his longest work, H2, doesn't have the childhood friend win.", "label": 1}
{"text": "Tomo-chan is a girl (but there's not any competition; she was the only love interest)\n\nThe Quintessential Quintuplets.", "label": 1}
{"text": "Ep 10(?)\n\n\"But if daddy gets buried, he won't be able to do all his work\" \n\nShit cuts me deep every time.", "label": 1}
{"text": "He said that in the manga too", "label": 1}
{"text": "How many episodes will this anime have?", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Action/comedy", "label": 1}
{"text": "Biscuit. Iron blooded orphans.", "label": 1}
{"text": "Watched 4 episodes of this and never understood what was going on. Everyone just started killing each other, lol.", "label": 1}
{"text": "Potato girl's dead in attack on titan season 4 ep 8. I cried soo much it was painfull guys", "label": 1}
{"text": "are you autistic autistic? what did I do to get spoiled like this..", "label": 1}
{"text": "In the wrong place, buddy. Go to r/piracy", "label": 1}
{"text": "Without spoiling anything but that's what's neat with Dandadan. The author strays away from the usual tiresome tropes.\n\nWith the character's relationships, sure they may argue and bicker but they make up straight away and do not spend chapters and chapters not talking to each other.", "label": 1}
{"text": "When Itachi had to kill his parents. His parents didn't resent him for his actions. They were proud of the decision he made and even called him a kind child. That episode fucking stung.", "label": 1}
{"text": "Thewatchcartoononline", "label": 1}
{"text": "are they still making bleach?", "label": 1}
{"text": "saw the first part of the first new one and it was good", "label": 1}
{"text": "all these guys end up single, this main dude (i forgot his name) messes up big time and loses the girl he likes chiyo or whatever her name is, the president (chiyo's elder sister) leaves the school without telling anyone, leaving her macho lesbian vice president hurt, and because of this protagonist's fuck up, the sweet innocent chiyo end up becoming just like her elder sister...a 'man' hating president of the council and the team of these guys stays a team of losers", "label": 1}
{"text": "basically no happy ending for anyone, no one ends up with the person they like", "label": 1}
{"text": "cute Anya❤", "label": 1}
{"text": "You will bee happy to see that Taiki is not like the typical dumb harem protag haha. He's a walking green flag.", "label": 1}
{"text": "The episode of FMAB with Hughes's funeral. Not necessarily the funeral itself, but his daughter being confused as to why he's being buried", "label": 1}
{"text": "why do mangakas always self insert", "label": 1}
{"text": "If we get a ending like this i would have hade my peace but author not only choose violence he fucking nuked as like armin in aot", "label": 1}
{"text": "I can agree on Miuna being better, but Noe was fucking dumb", "label": 1}
{"text": "Ok, now i realise why everyone was pissed at the ending \n\nWell, that's realistic highschool for ya! \n\nLooks like they forgot the endless amount of paperwork for the violation of human rights and the school getting shut down and becoming a national scandal \n\nThe only reason I kept watching it is because the guys made it was hilarious, didn't like the over the top fan service or the bitches \n\nLowkey wanted those guys to go berserk and decide \"fuck getting a girlfriend, im shutting this shitshow down for good\" and worked towards running that shit school into the fucking dirt", "label": 1}
{"text": "An a piece of fictions target audience *require* the ability to self insert, you can probably expect sales to drop once they can't relate to the character anymore (I.e. not be a kissless virgin anymore.)\n\nAlternatively, when you consider that maybe your target audience *wants* the female characters to be sexy and \"attainable\" by having them being kissless virgins as well, despite all the lewd shenanigans they get into. Think about why Japanese and Korean idols are forbidden from having public partners.\n\nBecause they take that shit seriously, and sales die along with the fantasy.", "label": 1}
{"text": "The end of the episode 24 of Cowboy Bebop, when Faye and Ein are leaving. Even Spike's death made me cry less.", "label": 1}
{"text": "The end of season 1 is the real ending... Nothing else happened", "label": 1}
{"text": "How did they fuck up Anzu and Shingo?", "label": 1}
{"text": "The ending was apt, trash people deserving trash people. It's the journey that sucked. It was a proper mercy killing to something that already lost readers and beyond saving. We got the best developed pair, it's not bad.", "label": 1}
{"text": "Team Hana, and Hana won.", "label": 1}
{"text": "Hana wins. How is that bad?", "label": 1}
{"text": "This might be a controversial take, but I'd say the only truly bad thing about the ending is how abruptly the final chapter concludes. There's no real epilogue after the penultimate climax. However, I think what 99% of people hate about the ending is the fact that the main character, Kiyoshi, gets absolutely blown the fuck out right as he's getting ready to confess to his love interest, Chiyomi. He's about to win it all, but instead he just gets body-bagged, and his love interest goes from being a kind and innocent girl to a man-hating feminazi like her older sister. But she's arguably justified at least to some degree considering what happens lol.\n\nLike, I can totally understand why people were so upset about it. Kiyoshi is presented as the underdog and you're constantly rooting for him to succeed throughout the series, even when he's doing arguably fucked up shit. But none of the characters aside from Chiyomi are truly innocent when you think about it. Prison School's setting being so utterly absurd and hyperbolic is what makes it so entertaining, and the ending perfectly embodies those things in my opinion.\n\nTo me, it's a manga that you should read for the journey, rather than the destination. It's insanely crude, illogical, and perverted, but it's one of the funniest god damn mangas out there because of that. The anime is even funnier and it's a shame that it never got another season.", "label": 1}
{"text": "Indeed. The message was that nobody is pure and innocent there, even Chiyo got corrupted. Trully an apt ending for a degenerate manga, I'm fine with how it ended even though I really shipped Kiyoshi and Hana. It's people's own fault for having different expectations that manga didn't follow through.\n\nWhat pissed *me* off was how Mari was just phased out abruptly...and that stupid and pointless Chairman adventure.", "label": 1}
{"text": "e", "label": 1}
{"text": "e", "label": 1}
{"text": "Not sure if the text has importance, but without actually spoiling what it means, [minor manga context spoilers] >!the lollipop (actually a candy apple lol) is just an easter egg to something manga readers will recognize from a later chapter. It’s not important to understand what it is now. Hina is holding the candy apple in the ED as well!<", "label": 1}
{"text": "Does she really because I remember the MC being single ", "label": 1}
{"text": "Nah disagree, Kiyoshi and Hana got what they deserved at the end with each other. What sucked for me was Chiyos insane personality flip", "label": 1}
{"text": "When I've made similar complaints (about romance stories) in the past I've been hit with \"how do you expect them to write drama and make it interesting then??\" but it's honestly sooo tiring and not needed to make a story interesting at all.", "label": 1}
{"text": "Gojo finally back in this one for sure", "label": 1}
{"text": "In the manga she says \"I blew a gasket when that not-a-kiss happened\" lol", "label": 1}
{"text": "Hmmmm", "label": 1}
{"text": "Thank you for such a thorough answer! I was worrying that I missed something significant because it was so prominent.", "label": 1}
{"text": "Agatha Christie + Groundhog's Day = Higurashi", "label": 1}
{"text": "For me it was mostly obvious stuff literally created to make you cry like Anohana and Violet Evergarden.\n\nBut AoT's final season really got to me. \nSasha's and Hange's deaths were so masterfully done.", "label": 1}
{"text": "They were quite close, to neutral at worst, vs incinerated bridge with Chiyo. The ending left ample scope for hana kiyoshi to continue their experiments on each other", "label": 1}
{"text": "> both are too coward to admit it.\n\nThey did, and they ended up breaking up in the manga.", "label": 1}
{"text": "Yeah, that sadist pedo author animating his fantasies. Can't watch that at all, let alone twice.", "label": 1}
{"text": "I would like to think that a lot of romance authors and even the readers do not know what a healthy relationship is. For example tsunderes can be cute at first but it gets tiring in the long run, it just shows that the character is shallow and has no self awareness at all.\n\nThat's where Dandadan excels in. The author has a fair grasp of what a healthy and realistic relationship is. You do not spend days or weeks stone walling someone just because of an argument. Momo and Okarun had an argument at lunch time and they resolved it by the end of the school day, it also realistically portrays how some would agonize how to apologize like what Momo did.", "label": 1}
{"text": "they didn't though?", "label": 1}
{"text": "It's a reference to something that happened between Taiki and Hina in middle school. Can't say anything more without spoiling.", "label": 1}
{"text": "Cool cake", "label": 1}
{"text": "So cool!", "label": 1}
{"text": "Nostalgia anime for me", "label": 1}
{"text": "> It is unknown what became of Hana at the end of the series. While it is apparent that she left the academy after finishing her third year, **it is unknown if she has made any interaction with either Chiyo or Kiyoshi following that tragic day.**\n\nTaken from the [Prison School Wiki ](https://prison-school.fandom.com/wiki/Hana_Midorikawa).", "label": 1}
{"text": "but did they even start dating", "label": 1}
{"text": "[https://www.randomanime.org/spinner](https://www.randomanime.org/spinner)\n\nLanded on Tiger & Bunny.", "label": 1}
{"text": "No one won. Hana and kiyoshi start wearing each other's underwear, but kiyoshi is still into chiyo so they go on a date where hana confronts them and reveals kiyoshi in her underwear. Chiyo freaks out and it cuts to showing her being just like her sister. The end, nothing confirmed. I honestly don't hate the ending but the last 100 chapters to get there have terrible pacing and lame jokes, so it really needed to be something more than what we got if it was going to be remembered fondly.", "label": 1}
{"text": "For right now that is what we know, but there is a lot more to their story that'll get explained in the future! (Sometimes it pays to be a manga reader)", "label": 1}
{"text": "Oh just you wait lol. This is NOTHING compared to the chaos that is about to start.", "label": 1}
{"text": "Very nice!", "label": 1}
{"text": "This looks tasty", "label": 1}
{"text": "BORITTO SLUAPPPPUHHHHHHHHH  🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥 🗣️🔥", "label": 1}
{"text": "my favorite thing there is the blue lock season 2. its really good ❤️", "label": 1}
{"text": "having binged the anime and manga, the \"cliffhanger\" and the \"drama\" complaints are things i disagree with. i don't know how it would've felt to read the chapters as they came out, but from the perspective of a reader and watcher of this amazing series after it has ended, the \"drama\" really wasn't anything at all, and i had no issue with how things happened at all. the \"cliffhanger\" stuff i also disagree with, the way the final chapters and episodes dealt with things happened just fine in my opinion. \n\nthe only complaint is that we won't (or most likely won't) be getting a sequel manga and anime called \"giji harem: the seven-year timeskip\". would've been so amazing if we got to see the 7 years rin and eiji spent off-screen. otherwise, no issues in general, even the way the final chapters and episodes were presented i had absolutely no issues with.", "label": 1}
{"text": "Kiyoshi and Hana had a toxic chemistry and they have ample scope to date and do experiments again after the ending. They have practically done everything except sex lol. They are the closest options to each other if they decided to go all the way. But if we consider Kiyoshi x Chiyo, that bridge was incinerated.", "label": 1}
{"text": "Try These :\n\nInsomniacs After School\n\nLoving Yamada at Lv999", "label": 1}
{"text": "Maybe you didn't know but actually the manga went viral because of that certain scene in episode 1.", "label": 1}
{"text": "Looks like I'm right😁😁", "label": 1}
{"text": "Dont watch it if you don't want to", "label": 1}
{"text": "This anime is brought to you by PornHub.", "label": 1}
{"text": "Kenja no mago", "label": 1}
{"text": "The tallest mountain in Africa is Mt Kiliminjaro ", "label": 1}
{"text": "Wholesome 11/10!", "label": 1}
{"text": "Ex... calibaaa", "label": 1}
{"text": "Story in DB? lol. It's just a cringe show with jokes about girls underwear", "label": 1}
{"text": "One piece is cringe", "label": 1}
{"text": "whatever you say, PDFile", "label": 1}
{"text": "My love story with Yamada Lv 999, Sign of Affection, Yona of the Dawn", "label": 1}
{"text": "blue lock on top", "label": 1}
{"text": "Only the middle one is realistic", "label": 1}
{"text": "Seeing Orihime hugging Ichigo was cute. I am so glad that the anime is at least trying to show some interactions between Ichigo and Orihime.", "label": 1}
{"text": "You sound like a manga reader pretending to be an anime-only guy", "label": 1}
{"text": " I don't see anyone hating on assasin i think its a solid Isekai anime compared to trash like shield hero which is 'underhated'", "label": 1}
{"text": "bro you should watch BLUE BOX it's a new anime and the story is going well; as of now, everything is fine. And yes, five episodes have come out.", "label": 1}
{"text": "That additional time with Niko, Aryu and Gagamaru was so wholesome \n\n\nAs a manga reader I don't like that Aiku feels \"deflated\", he looked beefier in the manga but it is what it is.\n\n\nThey cut some of Rin and Shidou's fights from the anime, in case anyone was wondering; they also cut him and Igaguri beating Reo and Kunigami.", "label": 1}
{"text": "Avatar:the last airbender. it will always be great, but it loses the magic of the incredible twists and story beats when you already know what's going to happen. it will never be the same as the first time.", "label": 1}
{"text": "Fun fact, Ryoga's voice actor plays the Jusenkyo guide.\n\n[Ranma1/2 Triple role Ryoga](https://www.youtube.com/watch?v=hVVq3PUBeTw)", "label": 1}
{"text": "Koichi Yamadera the goat.", "label": 1}
{"text": "I'm glad the anime kept the haircut joke (a bit mistranslated - original, and dubbing, refers to Shinji's hair as a \"kappa's\"), with Soifon quipping back. They already cut out several brief/corner of the eyes jokes so far, and I liked this one in the manga.", "label": 1}
{"text": "I’ve watched that too haha but I love the interaction with the other isekai characters when he remade Japanese food for them", "label": 1}
{"text": "Pretty sure Stark is dead-dead. \n\nUntil, y’know, the arc that shall not be spoken happens.", "label": 1}
{"text": "Shut up dude like fr", "label": 1}
{"text": "I’m new to YouTube got 0 likes 0 views I’m not sure how to get my first 100 subscribers[link to YouTube channel](https://youtu.be/xaYjk33OGfU?si=mA5iZKcYmJe-eYmA)", "label": 1}
{"text": "blue lock, blue box and The Wrong Way to Use Healing Magic   \nthe 3 is one of my favouirte.", "label": 1}
{"text": "One scene that still sticks out in my head was that scene where they piled old and sick people into a pod and dropped them into the ocean. Really gave me vibes from this one book where people were \"released\" or something like that once they were no longer useful to the civilization/community.", "label": 1}
{"text": "He deserves to get used better there. He's the coolest designed character in Bleach.", "label": 1}
{"text": "I mean he is Spike Spiegel", "label": 1}
{"text": "In the manga they’re pretty minor but pivotal, so hopefully they’re expanded on a bit", "label": 1}
{"text": "Blue Exorcist and fire force", "label": 1}
{"text": "Thank you! :D\nIt's not a commissioned piece, but it's available for sale.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n- Please remove the edited line where you said you saw a clip explaining something from the manga, mentions of something like that belong in the Source Material Corner pinned to the top of the thread. If you remove that line, I can restore your comment.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "In the scans, they translated it as Mental Energy, rather than MP.", "label": 1}
{"text": "Thank you for your suggestion", "label": 1}
{"text": "Beastars", "label": 1}
{"text": "Best girl without a doubt", "label": 1}
{"text": "He does. He wasted 0 time creating Kazui after tybw", "label": 1}
{"text": "How did what I say break any rules when I pointed out we have a season and half of this to know what's being cooked? We already know their abilities are strong, so it would be a waste to use them?", "label": 1}
{"text": "Can you message me please", "label": 1}
{"text": "I love how they added a frame of Bazz-B once again admiring Renji's eyebrows, Renji getting all flustered over it while Rukia is silently judging them both over it. Nice callback to a fun scene from the previous cour.", "label": 1}
{"text": "Nice chart. I like that you explained what went into it and what didn’t. Looks to me like the past few years there is an uptick again. That is good! Maybe ecchi will grow again in the future.\n\nBtw, if you love ecchi, you should check out [The Otaku Box](https://theotakubox.com/). You can vote each month for what titles they’ll feature, and get ecchi scale figures and exclusive collectibles.", "label": 1}
{"text": "Nice chart. I like that you explained what went into it and what didn’t. Looks to me like the past few years there is an uptick again. That is good! Maybe ecchi will grow again in the future.\n\nBtw, if you love ecchi, you should check out The Otaku Box. You can vote each month for what titles they’ll feature, and get ecchi scale figures and exclusive collectibles.", "label": 1}
{"text": "Real.", "label": 1}
{"text": "Jolenta (the girl from the OP) is Nowak's daughter apparently.", "label": 1}
{"text": "I already watch Deathnote and future diary. What I mean is I want to watch anime that has a longer season.", "label": 1}
{"text": "Btw thank you for the suggestions.", "label": 1}
{"text": "Chatgpt 😮‍💨😤", "label": 1}
{"text": "Haha it’s so goooddd season 3 was my fav part when everyone was like wtf", "label": 1}
{"text": ">I hope that the pig Ryoga thing doesn't stay a secret from Akane forever since she deserves to know who she's sleeping with at night.\n\nIt does get complicated as we get more characters, more transformations, and who knows what-about-whom. IIRC, P-chan & Akane is mostly played for sitcom/slapstick winks at the audience like we saw here. \n\nRanma's not really a \"deep emotional / social consequences\" kind of story.\n\nI remember there being a few major fanfic schools that explored the idea though: \n\n* some took a serious note, following up on the betrayal angle, from both Ranma & Ryoga\n* some had her find out and then the story becomes an Akane x Ryoga romance fic, with or without furry implications\n* and others went with \"Akane knows all-along\", either turning into (B), above, with a more femme-dom angle, or becoming a sort of hurt/comfort fic when Ranma does stupid stuff.", "label": 1}
{"text": "no one recommend boku no pico?\n\nwhaattt??", "label": 1}
{"text": "IIRC Dr. Tofu was an assistant at the clinic and Kasumi was a junior/senior (17?) in high school. So not that far-off in ages. He never voices his feelings - still hasn't - so that's mostly okay...\n\n...but the fact he's their doctor is more of an issue IMO.", "label": 1}
{"text": "porn addict", "label": 1}
{"text": "    A whole team of reapers sat around in the control room. Let some humans save the world.", "label": 1}
{"text": "> Still not really fond of Ryoga, sure he got knocked into the spring by fem Ranma but that only happened because he had stalked him all the way to China. He did it to himself as much as Ranma did.\n\nSomething you'll realize as the show goes on, is that Ryoga is to Ranma, as Vegeta is to Goku.", "label": 1}
{"text": "Kubo actually clarified this and said it was because he was battle master and in charge of training other Quincy so he was skilled in all techniques while most others just focus on the stuff they're good at.", "label": 1}
{"text": "What did it remind you about?", "label": 1}
{"text": "The dog looks very cuteee! Awww", "label": 1}
{"text": "[If I could go back and wish for a scene to do that it'd probably be this one](https://puu.sh/KhY38/02ebb7b125.png). Compared to the [original panel](https://puu.sh/KhY3b/573cf23d90.png) it doesn't hit as hard but it's still great don't get me wrong", "label": 1}
{"text": "Who was promoted?", "label": 1}
{"text": "Naruto is best one out there", "label": 1}
{"text": "I can't speak much because I don't want to spoil anyone but got to impatient betweent last week and this one and ended up on episode 45 of the original and I'm stil screaming at the scream some chosen words, so I hope to feel the empaty I felt for Vegeta soon lol", "label": 1}
{"text": "Nice", "label": 1}
{"text": "😫", "label": 1}
{"text": "I'm pretty sure it was confirmed somehwere Quilge's absorbtion technique was far ahead that of the other sternritters", "label": 1}
{"text": "that Quicy is a trap not a girl,", "label": 1}
{"text": "she is not a girl but a trap. damn forgot about that already", "label": 1}
{"text": "My case with JJK. I stopped reading after Shibuya arc because I think it went to shit, but when people started talking about Gojo coming back, I went back in, skipping the entire Culling Game arc. I got my time saved tbh", "label": 1}
{"text": "Name of Anime please.", "label": 1}
{"text": "Ok thanks, didn't actually note that.\nFirst time here actually.", "label": 1}
{"text": "True but when that girl looked at his stats she said something like orgin or ebd of all things so that might mean he's an anomaly which mean standard rules of logic doesn't apply to him so his ability might be able to do it since it can kill divine beings which were said to be unkillable", "label": 1}
{"text": "Mushoku Tensei its a family anime 100% no fan service", "label": 1}
{"text": "The Elusive Samurai, easily.", "label": 1}
{"text": "It should be explained in the next episode. From the bit and pieces I remember, there's a very special reason why he was able to get there.", "label": 1}
{"text": "What about it?", "label": 1}
{"text": "What’s with so many anime seeming to sexualize children or at least characters that physically present as child like? Is that not weird?", "label": 1}
{"text": "Tbh this season vs S1 is turning out to be a prime example of why being more faithful to the source material isn't always a good thing for anime adaptations", "label": 1}
{"text": "An awkwardly paced episode is still an awkwardly paced episode regardless of how faithful it is to the source material.  It was pretty clear their priority with this episode was to bridge the gap between last episode and the Anaak vs Ran episode.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "Like I said: My memory of season one is hazy. With that being said: \n\nI don't remember Bam becoming strong out of nowhere, but since there is a timeskip between season 1 and 2 that shouldn't be an issue anymore. \n\nI think Rachel betraying him is interesting and a plot point that I don't remember seeing a lot like this in battle shounen. If you just find ger annoying that's fine.\n\nI'm not sure what you mean by bland character designs. There's a walking talking aligator as one of the most important characters and my favourite character from the Webtoon has a pretty cool design.\n\nWhat exactly is the issue with the FUG storyline?\n\nI'm not trying to \"debunk\" you; I'm just curious.", "label": 1}
{"text": "> this episode was very faithful to source material\n\nSo the source material was garbage? Good to know.", "label": 1}
{"text": "I wouldn't say it was garbage, but it really started to get bloated after season 1.", "label": 1}
{"text": "I was not prepared for the drowning pig sounds lmao", "label": 1}
{"text": "I was obviously referring to the source material for this episode in particular being garbage.", "label": 1}
{"text": "I was wondering who was voicing his pig self, can't believe it's the same VA holy shit XD", "label": 1}
{"text": "Just don't cut it in half.", "label": 1}
{"text": "That sounds intriguing! The description of the insects reminds me of an episode from *Paranoia Agent*, which aired on Adult Swim. It has a distinctive early 2000s animation style and deals with surreal themes. Another possibility could be *Mushishi*, which also features nature and insects but in a more mystical way. Have you checked those out? If not, I hope one of them is the anime you’re looking for!", "label": 1}
{"text": "That's good", "label": 1}
{"text": "https://www.foxaholic.com/novel/i-became-the-strongest-with-the-failure-frame【abnormal-state-skill】as-i-devastated-everything/", "label": 1}
{"text": "Just what S1 did: cut, modify and rearrange the material into cohesive and purposeful episode units tracing defined steps towards a single well defined vision and end goal. \n\nThe primary complaint about this season is the animation but it's failure goes further than that. It feels like it's just going through the motions of the Manhwa. Events simply happen without much fanfare or punctuation, there isn't a sense of what the current Arc's purpose is, and thus no greater order that unifies each scene and episode. \n\nIn S1 that purpose was learning about what kind of place the Tower is. Obviously S2 can't just copy that because we're already done with it, it has to find something else. If I had to say it's should probably be about FUG and Bam's place and role in the Tower, about the political and cultural systems of the Tower or something like that. But as I said, such a strong central thematic is lacking in S2.", "label": 1}
{"text": "And you sound like a pathetic loser necro'ing a thread from 2 months ago and your username is racist as hell.", "label": 1}
{"text": "> cut, modify and rearrange the material into cohesive and purposeful episode units tracing defined steps towards a single well defined vision and end goal.\n\nWonderfully concise and completely correct.", "label": 1}
{"text": "What makes you think it was well deserved?", "label": 1}
{"text": "@vsbattlefour\nyoutube\nplease subscribe", "label": 1}
{"text": "@vsbattlefour\nyoutube\nplease subscribe", "label": 1}
{"text": "@vsbattlefour\nyoutube\nplease subscribe", "label": 1}
{"text": "Nude Batter Tetsuo. I cry laughing every time I watch it.\n\nWarning: Crude Nudity\n\nhttps://youtu.be/qRgLbSnFKy0?feature=shared", "label": 1}
{"text": "🤡☝️", "label": 1}
{"text": "Don't u dare step on it", "label": 1}
{"text": "Idk if this was addressed already in a previous ep but how exactly are Khun and Ran related? Obviously they're from the same family but are they just from the same clan or more closely related like cousins? I'm assuming the reason they're fighting on the same team hasn't been revealed yet either.", "label": 1}
{"text": "Goblin's Box (Mouryou no Hako)\n\nFrom the New World (Shinsekai Yori)\n\nShiki\n\nMonster (it's long)", "label": 1}
{"text": "post nut clarity of u/atropicalpenguin \n\nheathens liking this drawing should be cleansed", "label": 1}
{"text": "NFT’s will be airdropped not market am not using NFT’s like most of people do", "label": 1}
{"text": "ok", "label": 1}
{"text": "hmm", "label": 1}
{"text": "oh", "label": 1}
{"text": "he", "label": 1}
{"text": "cool", "label": 1}
{"text": "woah", "label": 1}
{"text": "yikes", "label": 1}
{"text": "yk", "label": 1}
{"text": "woah", "label": 1}
{"text": "rty", "label": 1}
{"text": "Half brothers! ", "label": 1}
{"text": "Cowboy Bebop, Trigun, Ghost in the shell, Hellsing, Outlaw Star, and Lycoris Recoil.", "label": 1}
{"text": "> [Manga] >!His whole intelligence squad will join down the line as he finally chose to have a stable foothold.!<", "label": 1}
{"text": "i mean after he got kit katted by sukuna he deserves to be stepped on bro", "label": 1}
{"text": "The Rising of the Shield Hero ! i think", "label": 1}
{"text": "Kimi no Suizou wo Tabetai , my all time fav one <3", "label": 1}
{"text": "You don't have to tell me, i will find that out myself, keep your goddamn mouth shut", "label": 1}
{"text": "Anime🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "label": 1}
{"text": "re:zero in my heart 👀", "label": 1}
{"text": "You didn't removed his comment which is i think is a spoiler. I don't want to know anything about anime if its get better or worse its a spoiler imo", "label": 1}
{"text": "Bokuu no pico", "label": 1}
{"text": "Definitely! I remember hiding my love for anime back in the day because it felt so taboo. It's amazing to see how much the culture has shifted—now it's celebrated! It’s nice to connect with fellow fans who felt the same way. Cheers to embracing our interests without shame!", "label": 1}
{"text": "Eh, I dunno. I feel like cutting off someone's head is more gruesome than a tongue", "label": 1}
{"text": "dont watch clannad afterstory the ending gunna infuriate you ☠️☠️☠️", "label": 1}
{"text": "It's a bit absurd that they would get that good in a couple of months but there are a couple of things they explain in the novels that the anime kinda touches on but doesn't go into too much detail.\n\n1) Hajime spent all day using his spiders to dispel all the traps/magic around the palace. So most of the magic security was turned off without anyone noticing. They just had to deal with the guards who were expecting alarms to work that had been turned off.\n\n2) They're using radio earpieces to communicate. They're essentially the only faction in the world that has radios or even knows its a possibility. Can't overstate how massive an advantage that is for coordinating a complex op.\n\n3) They use bombs and stealth and techniques totally foreign to a world where people usually fight with swords and magic chants and such. In the books they actually start the fight with a flashbang then cut out the tongues of all the casters they down. I wouldn't say they fight like a modern military or anything because it's still anime physics with their jumping and somersaults etc but it's definitely closer to pragmatic anything goes fighting than the rest of the world does.\n\nThey just totally blindsided the empire with a revolutionary fighting style and technologies. They were taught to 'stack the deck' before the fight as much as possible so it was basically over before the fight started.", "label": 1}
{"text": "Explanation: Aria and Rio have magic swords, which increase one's physical ability beyond regular physical augmentation via magic. They also usually have special abilities. But they don't enhance your skill. They also use up a lot of magic power so if you don't have enough you get tired quickly.  Lastly, they're super rare in Strahl (the Europe-style region), so you need to be capable enough to be entrusted with one.\n\nIn Rio's case he's enhancing his body via spirit arts, so the physical ability enhancement from his sword is irrelevant. He's also using wind spirit arts while pretending the ability comes from his sword.", "label": 1}
{"text": "go ge tyour prirorites STRAIGHT", "label": 1}
{"text": "Have to agree. It made me wonder if the film writers watched the anime. After a series about her moving on, being her own badass person, and trying to find a meaning in life beyond a specific guy, she just...goes to be a girl to that guy? Nevermind all the weird implications of him being a father-esque figure in the past for her. They ass-pulled a Palpatine revival for a character that was supposedly already dead before the show started just to bring that message across? ", "label": 1}
{"text": "Eh, agree to disagree. He doesn’t deserve her. She deserves better", "label": 1}
{"text": "I'm not sure about the agility but they definitely don't have super strength. They make a big deal about super strength being Shea's thing (through magic) and she's the only Haulia like that. The only thing innate to rabbit men is sensing danger and hiding their presence, they're meant to be the 'weakest' beastmen. Hajime made them a bunch of unbreakable razor sharp short swords and they've been practicing a ton with using them accurately\n\nOf course, being supernaturally good at sensing enemies and hiding yourself actually means you're extremely good at infiltration and guerilla warfare.", "label": 1}
{"text": "It also invalidates what she was going through during the show of trying to find purpose beyond the guy. She suffered just to suffer. ", "label": 1}
{"text": "Tell me, was it REALLY about moving on? That’s only one interpretation. \n\nThe main theme of the anime for most is that she wants to know what love means. She literally says that exact question in the first episode.", "label": 1}
{"text": "Call me crazy, but how the fuck does it invalidate literally anything?", "label": 1}
{"text": "That’s why I’m conflicted. The major was such a coward at everything, he put her on a weird pedestal and he didn’t want to respect her decision for a long time because he thought he knew what was best for her. Even though she made her choice herself. But it’s what Violet wants, after living her new peaceful life. I felt happy that Violet was happy but I still don’t like the major", "label": 1}
{"text": "What happens to his appraisal skill? It evolves? I need some spoilers here.", "label": 1}
{"text": "Oh piss off with your sanctimonious self-fellating bullshit. \n\nHere's the big difference between everything you described and the depiction I'm abhorring: those murders, the genocide, the other crimes you might wanna list? Almost always get PRESENTED AS A FUCKING CRIME. In the vast majority of media a character doing something so shitty is usually a shitty character that the writer is trying to make us hate, the actions they take are not justified, not glorified, and not taken lightly. \n\nHow the fuck y'all don't understand that? Imagine someone writing a story with Mussolini as the good guy. THAT is what we have - a paedophile deuteragonist who everyone is supposed to root for as he *chases a 10 year old girl with his unwanted advances.*\n\nGet real.", "label": 1}
{"text": "He didn’t raise her. He taught her things, but his role was always her army superior. \n\nBut clearly you don’t have the media literacy to comprehend that.", "label": 1}
{"text": "Being this obsessed over one series isn't very healthy. It's not my main issue with the movie, but one could absolutely argue that there was a power imbalance present in the relationship. \n\nIt's not that big a deal, most of the reasons for liking VE are typically for the side stories (Ep 10, Ep 7 etc), not the main plotline itself.", "label": 1}
{"text": "Bro literally does not know what grooming is. He never had any intention of getting with her. He said he loved her, but clearly there are MANY forms of  “I love you” something you don’t seem to get\n\nIt was only romantic in the movie and that was because he simply accepted her feelings. They originated from Violet since she wanted to be with him.", "label": 1}
{"text": "Nah fuck that. I’ll defend this series as long as it takes. It’s brilliant, and deserves it. \n\nI have no sympathy for the movie haters. Sorry.", "label": 1}
{"text": "Hey everyone! 👋\n\nI've been a longtime fan of anime, manga, and light novels, and recently I’ve been thinking a lot about ways to enhance the experience. Whether you're watching your favorite anime, reading an epic manga, or getting lost in a novel, I’m curious:\n\n**What do you feel is missing in these experiences?**\n\nFor example:\n\n* Is there something you'd love to track or organize better? 📚\n* Do you wish there were better ways to connect with other fans, or even the creators? 👥\n* Are you looking for a platform that makes it easier to discover new series or organize your \"to-watch\" and \"to-read\" lists?\n* Or maybe a way to visualize your progress, achievements, and completed collections?\n\nPersonally, I’ve found myself wanting a way to **track everything I’ve watched or read over the years**, and to show off my collections or achievements as a fan. I feel like there’s so much that could make the experience richer.\n\nSo, let me know! What’s one feature or tool you wish you had while watching, reading, or keeping up with anime/manga/novels? I’d love to hear all your ideas and see if others feel the same way! 😊", "label": 1}
{"text": "The way you manage to argue pure nonsense is crazy. This is a waste.", "label": 1}
{"text": "I hate to tell you this but you will see by yourself why he is acting like this and you will also by the time turn to his side episode by episode", "label": 1}
{"text": "If you are trying to create an idea, just copy GoodReads or Letterboxd but make it for anime", "label": 1}
{"text": "what if not just keeping track but also give suggestions based on what you have watched?", "label": 1}
{"text": "yes i am a full stack developer, and i was thinking if there is something people are missing in general and would like to see if there is something i can do about it? be it a webapp or a chrome extentions.", "label": 1}
{"text": "There have been many attempts at this, not sure any of them were particularly useful to anyone.\n\nIf you want to check something that's not a single dude's hobby project that has no maintenance, try anime.plus", "label": 1}
{"text": "And written very similarly to one we got a couple months ago on a different account. ([now removed](https://www.reddit.com/r/anime/comments/1fde6uk/anime_questions_recommendations_and_discussion/lmihcwu/?context=1))", "label": 1}
{"text": "In the novels at this point Kaori's had 3 separate parts that show off how ridiculously OP she is now she's in Noint's body. But the two biggest ones happen in the beastman capital which the anime continuously skips over for some reason.\n\nIt's a shame too because it's basically the same thing they do in Ankaji at the start of season 2. Except now instead of treating the symptoms of one person at a time she can use Gods age restoration magic and has an almost unlimited mana pool. It's a really cool moment and it's the first thing the hero party see her do as a member of Hajime's team since she joined up with them to show off her crazy growth. And they freaking skipped it!", "label": 1}
{"text": "Belonged to an anime club in grade 8. People would literally laugh at us daily, all day everyday. We were the retards who watched cartoons still like babies.", "label": 1}
{"text": "Munou na Nana has a fairly similar scene with a white haired boy that can only remember events for I think it was two years, so he writes everything down to remember more than that.\n\nHis sickly sister wants to leave his life and so she manipulates all his records without him knowing and makes him eventually forget that he even had a sister.", "label": 1}
{"text": "I think the ending is really good. Gilbert being alive doesn’t make everything that happened before obsolete, not at all", "label": 1}
{"text": "you remember that violet never actually believed that gilbert is dead, right?\n\nand the forshadowing is there from the first scene onward, too.", "label": 1}
{"text": "considering how little people watched it and how good it is, I think is safe to assume is actually the most underrated", "label": 1}
{"text": "I dont think we appreciate enough a COROCORO webcomic got a full length 20min Anime season. Initially on the anouncemnt I thoought we are gonna get 5 or 10 min fun episodes. Is there any other CoroCoro manga that got anime adaptations besides the big toy mangas like Pokemon, BEyblade, etc.  \nI think Dangerous Jii chan is the only Manga I remember having an anime and that one was 5min episodes only  \n  \nAs a manga reader I enjoyed the extra content. Initially I thought they will go jsut through the whole plotline speed running. But it seems they are spacing it out pretty wide which is fine by me! If people might find it cute they might look into the bit more plot focused manga ( I say that loosely as theyre still lots of just fun chapters)  \nI hope well get the other MainCast members introduced soon!", "label": 1}
{"text": "Why do you need to? Is it a life or death situation?", "label": 1}
{"text": "I won't watch Heavenly Delusion S2 when it comes out. The end of S1 is just garbage. The MC which get's raped lets the rapist run while he could have been offed by the other MC. The reason why the rapist was allowed to stay alive?   \nFrom the anime perspecitive, because of memories and admiration the MC had for this person before this happened and somehow still has...  \nThe more logic reason is the author wants the rapist to be alive so that he doesn't have to think about a \"new villain\". Because why using braincells to write a new one when you can keep the existing one. Pure lazy and mostly stupid and disgusting writting. Also that the other MC stopped from killing him while he had the chance is a thing I don't get...", "label": 1}
{"text": "Expected that anime to show up in that thread and it didn't miss.\n\nHonestly, I would love to reccomend Mukoushou Tensei : great worldbuilding, beautiful art direction, interesting story... But I can't get over the fact that Rudy \\[middle of the first season spoiler\\]>!casually put his hand in Eris crotch while she was taking a nap.!<", "label": 1}
{"text": "Elfen Lied\n\nDog Scene. \n\nDidn't stop watching, but holy shit did I consider it", "label": 1}
{"text": "ranma 1/2", "label": 1}
{"text": "One guilty pleasure anime that many fans enjoy is \"My Teen Romantic Comedy SNAFU\" (Oregairu). It blends slice-of-life elements with deep character development and witty dialogue, making it both relatable and entertaining. The protagonist, Hachiman Hikigaya, offers a cynical view on high school relationships, which resonates with viewers who appreciate a more realistic take on adolescence.", "label": 1}
{"text": "\"Your Lie in April\" - A touching coming-of-age story that centers around music and young love, this anime beautifully combines emotional depth with stunning visuals. It’s a tearjerker that leaves a lasting impression.", "label": 1}
{"text": "\"K-On!\" - This lighthearted series revolves around a group of high school girls who form a band. It's full of cute moments, music, and friendship, showcasing the everyday lives and adventures of the characters.", "label": 1}
{"text": "\"Black Lagoon\" - This series follows a group of mercenaries known as the Lagoon Company who operate in Southeast Asia. With intense gunfights and a gritty atmosphere, it delves into the underworld of crime and mercenary work. The characters are well-developed, and the action is relentless.", "label": 1}
{"text": "I totally get that sometimes those uncomfortable moments just outweigh the rest of the experience, and it’s perfectly fine to walk away if it’s not sitting right with you.", "label": 1}
{"text": "\"Code Geass: Lelouch of the Rebellion\" - This series follows Lelouch Lamperouge, who gains the power of Geass, allowing him to command anyone to do his bidding. Similar to Light Yagami, Lelouch uses his newfound power to challenge a corrupt empire while grappling with the moral implications of his actions. The series features strategic battles and political intrigue.", "label": 1}
{"text": "like this scene", "label": 1}
{"text": "Did she vector a dog?\nIt's been years and I can't remember.\nEww if it happened", "label": 1}
{"text": "took the time to watch the clip, and goddamn did it make me wanna hug and kiss my doggos\n\n\n\nglad there was instant karma with all of them dying", "label": 1}
{"text": "Many anime fans remember a time when anime was considered niche or uncool, particularly during the late '90s and early 2000s, before shows like \"Dragon Ball Z\" and \"Naruto\" helped shift public perception and make anime more mainstream​", "label": 1}
{"text": "Danmachi… Really enjoyed the first few seasons, liked how the MC slowly gets stronger but the part where he stopped Ryuu from killing the villain in the dungeon irks me so much. I get it that it’s required to progress the story but the MC imposing his ideas on not killing on Ryuu leading to the villain summoning the monster which killed more people is a major turn off. Dropped the anime after that episode.", "label": 1}
{"text": "Fruits of grisaia. Yeah it gets really dark ", "label": 1}
{"text": "Damn that’s rough since right after the duel is the *exact* point where he’s at his worst—and the start of him having to realize how much of a shithead he is and fix it.", "label": 1}
{"text": "I was fine to keep watching it but.. I'm pretty sure that show traumatized me a little bit tbh😂😅.\n\nWatched it for the first time when I was.. either 10 or 11 years old? In it's entirety.\n\nNail scene, Rika scene with knife.. everything the show entails lol. I was a pretty smart kid but that show, as much as I neverrr would've admitted it at that age, was a bit much for me I think.", "label": 1}
{"text": "Not her, some random kids did the dog dirty", "label": 1}
{"text": "True, of all the things that could've happened to, it shouldn't have been a dog, one of the purest beings in existence", "label": 1}
{"text": "For me it's when Rika commits suicide by *repeatedly* stabbing herself in the head.", "label": 1}
{"text": "A terrifying level of media illiteracy.\n\nIncel Hero stacks the deck because the author is a sociopath who can't understand why buying a girl lunch once didn't result in sex. So she much be a devious cunt who abuses men even as she gives it up for everyone but him because he's just a little overweight. \n\nOr whatever variation of rapist fantasy he's too chicken shit to act on IRL but still gets his pecker stiff.", "label": 1}
{"text": "kingdom of ruin.\n\ni think i made it to episode 6 and fully dropped it when the female MC had her eyes gouged out while the MC did nothing but plead then not to. only to immediately power up afterward and kill him.\n\nthere's a lot of violence in the show, with 98% of it being directed against the female cast. even as a guy, it was making me uncomfortable.\n\ntldr: its torture porn with a really thin plot.", "label": 1}
{"text": "Dandadan. Despite the epic level artistry and vivid colors of Dandadan, the anime and the Manga  just became too uncomfortable for me. I stopped watching it episode 1. I perused the Manga and saw the same issues.\n\nThe author and artist of Dandadan didn't have to sexualize the 16-year old high school MC to make the plot compelling. The story was already good enough. Remove the nearly-raped scenes and stripping of the teenager MC and the story would be a interesting.\n\nAlso, SPOILER ALERT, the MC isn't the only sexualized female teen character in the Manga and the nearly-rape scene happens again in the manga. What a wasted potential Dandadan is.\n\nAlso, after knowing that the artist of Rurouni Kenshin( Samurai X), Nobuhiro Watsuki got arrested for child pornography in 2017 by the Tokyo Metropolitan Police, I fiercely avoided Manga artists and anime shows that sexually portray underaged MCs even if the plot seemingly demands it. Watsuki didn't even make sexualized characters but was actually a closet child porn user.  The Dandadan arist isn't even hiding the sexualization of teens.\n\nSexy anime isn't bad, but for goodness sake use adult characters. Why use teens and rape to tell a fictional story??? So, this begs the question: Who is the target audience of Dandadan? Closet Child porn users? \n\nTL;DR- Watch Frieren and Dungeon Meshi or even Mashle instead. Dandadan is overtly sexualizing teens. Avoid it.", "label": 1}
{"text": "Gushing Over Magical Girls is literally child sex abuse material. Like, not even being hyperbolic. It's literally a girl raping other animated teen girls.", "label": 1}
{"text": "that's the point of the chuuni rambling, it's not supposed to sound cool you bag of bricks", "label": 1}
{"text": "It's literally, not figuratively, literally child sex abuse material. Like the main girl **literally** rapes the other kids. The series was uncensored too. \n\nIdk why you were downvoted.", "label": 1}
{"text": "Didn't seem to stop that regardless. lol", "label": 1}
{"text": "Or all the horrific shit that happens to Satoko. The mental breakdown in the classroom was perhaps THE heaviest thing I've ever seen in an anime.", "label": 1}
{"text": ">He even saved a young girl and she came onto him and in order to \"control himself\" he had to pull out a pair of panties and sniff and lick them for 5 straight minutes right in front of her. Apparently if he didn't do that he would have cheated right away.\n\nI personally find the scene funny. It really depends on your humour I guess. And it's not that bad of a scene. There are worse things he has done in anime.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "If you hold out you see him understand it in a sense.   He’s still got that “want to save everyone” thing but quickly gets a reality shock about how things really are including ransacking a corpse.\n\nI’m hoping in  time  he makes the opposite leap as he did that season.     (Monsters and xeno are different, he comes to terms with killing monsters despite his connection to “good” monsters ie xeno….). Maybe the result of this and knowing the whole story of evilus will leave him able to kill “monsters” among the humans too.", "label": 1}
{"text": "I'm surprised how many people actually watched that like a normal seasonal tbh.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "I literally finally made it to episode 18 after the 5th try.\n\n\nI finally get it. In fact I was listening in an earlier episode from the kitchen and was like \"god damn subaru it ain't all about you, you weird full of shit creep\"\n\n\nPhew, *that was the whole point*.\n\n\nIt's so much more realistic. Why would people fighting hard and struggling do anything for him, (this isn't a video game and he isn't the MC to them). And figuring out quite a few people can tell he is lieing (and he never even stops to realize that). \n\n\nThe details are everywhere. Like the warning about a certain creature and he doesn't even ask or learn about, he just gets mad and forgetting all about that *fucks everyone up again*.\n\n\nSo good.", "label": 1}
{"text": "I dropped it after they decided to keep working with the asshole who burned a village, pretended to be a good guy to take in the two surviving girls from said village, groomed one of the girls into loving him, and planned to sacrifice the other girl (the sister of the girl that loves him) to teach MC a lesson about priorities. I know he's done even more super evil shit but that's what i remember off the top of my head. I don't care that they put him under a geis or whatever or that they \"need\" his help. He is absolutely fucking disgusting and needs to die horribly.", "label": 1}
{"text": "This is on the level of Eren affecting the past by making Titan that was supposed to eat Bertholdt eat his mom instead. It was supposed to give him motivation to hate the Titans despite the fact he already did and had a desire to go outside the walls.", "label": 1}
{"text": "Made in abyss. The author is a pedophile with a sick diarrhea and vomit obsession.", "label": 1}
{"text": "Mushuko Tensei. I dug the first season. But the ED bullshit. And the way he treats women under the guise of having past trauma. ALL WHILE ACTUALLY BEING A 40+ YEAR OLD?? My man has been through puberty twice and still acts like a chump.\n\nDude. I couldn't. Which sucks because I really like the world building and animation quality.", "label": 1}
{"text": "That sounds like Grisaia. Really good visual novel despite the absolute horror of Amane's route.", "label": 1}
{"text": ">!Wethermon!< fight (s1 spoilers around ep 18) was so well animated", "label": 1}
{"text": "I started off with One Punch Man, and it's still top 5 to me!", "label": 1}
{"text": "That was not why he did it tho? If Berthohold had gotten eaten by his step mom, the entire history would have been changed, as she would have turned into a titan shifter and regained her sanity. Now why he thought it was better to let his mom die rather than letting it play out it's natural way, that i don't know. Probably a doctor strange \"just one\" moment", "label": 1}
{"text": "Re zero season 2 \n\n,Subaru got his closure for the one he left behind, the witch of sin introduction, Emilia finally do sth. Great, right expected it took to long getting there that my patient just run out", "label": 1}
{"text": "Try out Spy x Family and Fly me to the Moon (Tonikaku Kawaii)", "label": 1}
{"text": "What genre are you loking for? Seen Haikyuu?", "label": 1}
{"text": "Alrr. How about Spy x Family?", "label": 1}
{"text": "Wasn't the entire point of that scene to show how Eren was never truly free, he was simply a slave to fate all along and he had no choice but to make the titan eat his mom?", "label": 1}
{"text": "Yes! Do let me know if you enjoy it.", "label": 1}
{"text": "Japan really wants them to breed huh lol", "label": 1}
{"text": "Seven Deadly Sins because of the sexual harassment and groping of Elizabeth who was 16/underage. Really grossed me out.\n\nOshi no ko once I learned of the incest plot later in the series.\n\nHighrise Invasion because of the gross amount of sexualization of the main underage girls.\n\nWonder Egg Priority and Banana Fish were ROUGH in general, loved them and kept going to finish them (because of the amazing social commentary), but had to take many solid breaks and will probably never watch again.", "label": 1}
{"text": "Grand blue 💙", "label": 1}
{"text": "There are many but, is there any specific genres you're interested in?", "label": 1}
{"text": "Reminder that I have a YouTube channel where I talk about anime and am currently giving out daily anime awards such as favorite character, least favorite character, best anime, worst anime, etc. I also have a cast where I have a weekly anime watch party.\nThis month’s show is Rozen Maiden.", "label": 1}
{"text": "It's expected for the violence to be directed mainly towards women, as they are only women with the one exception in Adonis and humanity is trying to wipe out the witches. I read the manga before the anime aired and found the concept pretty interesting and the master's death was one of the most painful I've seen so far but dropped it bc, as you said, the plot is very thin.", "label": 1}
{"text": "why do you reply like a child? starting off with \"whatever\", are you 13? i thought reddit has a age rule. grow up you wet wipe", "label": 1}
{"text": "giganotosaurus", "label": 1}
{"text": "Grisaia?", "label": 1}
{"text": "Got it! Let me give you my recommendations in few genres and in fantasy and few other genres as well...\nGenres:-\n\n:)Comedy:- Konosuba,The disastrous life of saiki, Grand blue\n\n:)Dark/Horror/Physchological:- Another, Tokyo ghoul,Elfien lied,Parasyte:-The maxim,Serial experiments lain,Uzumaki,Neon genesis evangelion\n\n:) Fantasy/isekai:- Mushuko Tensei:-Jobless reincarnation,That time i got reincarnated as a slime,the seven deadly sins,date a Live,\n\n:) Romance/Action/Adventure/Drama + Comedy:- Lookism, Gintama, Fairy Tail, Hormiya, Kaguya -sama:-Lobe is War,The devil is a Part-Timer, Shikimori,s bot just a cutie, Assassination Classroom..\n\n\nTHE BEST I WOULD I RECOMMEND IS:- \n\n✅LOOKISM 🕵️Genres:- Action, Comedy,Drama, Supernatural(pretty much same genres as Tokyo revengers,just it's not romantic)\n\n✅ Welcome to Demon School! Iruma-kun\n\n✅ Fantasy, Drama, Romance:- Fairy Tail, Kaguya sama:-love is war, gintama,Hormiya\n\n✅ Comedy:- Grand blue and Konosuba \n\n✅ Horror/Dark/physiological:-Tokyo ghoul,, Another,Devil man crybaby(❌not included and watch it at your own risk❌)\n\nAnd that's all I can provide, I am sorry I am not able to provide many recommendations for dark/horror genres because I don't watch it that much, so I hope this will help, if you need any help further just ask me ...\n\nHope this helps 🤍", "label": 1}
{"text": "I think its CP or something like that.\n\nNasty stuff...", "label": 1}
{"text": "Comedy:-Grand blue 💙", "label": 1}
{"text": "Nope! I realllyyy don’t get Mushi-Shi, know people love it but I was falling asleep", "label": 1}
{"text": "I can't watch jojos bizarre adventure, the art style and so.e scenes with certain characters gross me out", "label": 1}
{"text": "nah thats not even a spoiler its a fact that he got trashed which the fandom deserves to get by not understanding GODKUNA", "label": 1}
{"text": "Grisaia is super dark, but I personally loved the visual novel. Never seen anything like it since, it really goes for things I'd never seen before.", "label": 1}
{"text": "Ah man that sounds like Grisaia. That whole situation had such a great payoff when you find out at the end. Great anime but came from an visual novel so has some of the tendencies to be more explicit than needed.", "label": 1}
{"text": "Embrace it, friend. I even play the video games. I've love since accepted that I'm a proud 'Bitch-chan' (or Little Bitch if you watch the dub)", "label": 1}
{"text": "\"GODKUNA\" got trashed too. lol", "label": 1}
{"text": "not by your beloved gojo it was basically GODKUNA against everyone lol", "label": 1}
{"text": "Has nothing to do with \"beloved Gojo\", you're just a weird troll on someone's art post. lol", "label": 1}
{"text": "nothing to do? post literally shows gojo glaze for no reason", "label": 1}
{"text": "Ok and? No need for agenda stuff on someone's art post.", "label": 1}
{"text": "and? I’m just saying that he got trashed though is there anything wrong with that?", "label": 1}
{"text": "Just very weird on someone's art...", "label": 1}
{"text": "idk how its weird you are clearly defending the character…", "label": 1}
{"text": "Nah, I'm more in defense of OP posting their art and posting art about character isn't necessarily about \"glaze\". lol Doesn't even have to be about Gojo in particular.", "label": 1}
{"text": "defend if the art if you must, i didnt say it was not good or anything", "label": 1}
{"text": "Yeah you're comment wasn't even about the art but a weird agenda, comes off as rude.", "label": 1}
{"text": "thats why i didnt comment about the art cause it has nothing to do with it smh", "label": 1}
{"text": "Then why comment at all? lol Go to JJK folks sub for agenda posts for this kind of thing, not on someone's art.", "label": 1}
{"text": "I don't like to spoil everything, but the anime states the truth. \n\n\\[Spoiler source\\] >!Master Krai Andrey is a beast!<", "label": 1}
{"text": "nah it's true its a trash rug for a trash character.", "label": 1}
{"text": "Ok? lol", "label": 1}
{"text": "Same, in VS they killed the most interesting character in episode 5 or something and the rest is just boring as fuck", "label": 1}
{"text": "You hate slime or you are a retard", "label": 1}
{"text": "I like it until they killed off askeladd, then the story became very predictable. And it's only getting worse in the manga.", "label": 1}
{"text": "For anime fans, a character with traumatic past, is good looking, has iq like Newton is well written character. If he was ugly monster anime wouldn't be popular as it is  now", "label": 1}
{"text": "Yeah, now that I look up the name, it's Grisaia.", "label": 1}
{"text": "Not an anime, but it is an unknown manga called Schlepping Sharon who was sadly made by the same woman who made P*pa 💀 , He was uncomfortable in a very good way but I had to drop it sometimes because he was definitely something, I would love too recommend it but I don't make credits for someone like the author sadly ;(", "label": 1}
{"text": "it is really good, i’m hoping for a szn 2, but that last episode is insane. puts you through a big rollercoaster of emotions", "label": 1}
{"text": "I know the episode you mean but with Heavenly Delusion at least we know the world is dark and dangerous. Science fell in love is a lighthearted cutesie romcom. So that shit just comes out of nowhere and smacks you so hard it gives you whiplash lol", "label": 1}
{"text": "Attack on titan in 2018 and it's still the best I've ever watched till this day", "label": 1}
{"text": "yep, the night scenes are gonna be epic. They are probably setting up for the fights in the counterattack arc.", "label": 1}
{"text": "Because you talked about manga spoiler and seem weird to troll on one's art", "label": 1}
{"text": "It's called denial, people who lose significant others in war commonly deny their deaths, and in many cases the body is never found but that doesn't mean they actually are alive.", "label": 1}
{"text": "What is the full name of the anime?", "label": 1}
{"text": "The marriage thing with the brother and the mirror girl was the last straw for me. Didn't even finish last episode because of that.", "label": 1}
{"text": "This is the kind of storyline that keeps me coming back for more", "label": 1}
{"text": "The movie?", "label": 1}
{"text": "Me back. Though I couldn't achieve what I set out to do.\n\nBut it happens. So good to be back here.", "label": 1}
{"text": "Record of Grancrest War - Episode 9 there's this really fucked up scene where one of the main driving characters of the series a queen, basically forges an alliance with a kinda sketchy dude with an army and seal it with very under dubious circumstances sex, and its just gross AF. Literally ruined an amazing tale of magic and war, and idk went from being a fantastical tale of a war, to just being why the fuck would I want to watch this. Shit broke me, cuz it was such a great fantasy/magic/war series, but literally just felt gross after watching that.", "label": 1}
{"text": "\n\n\"I've been playing this game [https://mangadle.co/jujutsudle](https://mangadle.co/jujutsudle) recently, and it seems similar to yours, but I feel like yours is more fun.\"", "label": 1}
{"text": "what did you...set out to do?", "label": 1}
{"text": "Re: Monster episode four. The protagonist was already unlikeable with little morality, that episode was just the final straw.  \n\n\n(Re: Monster ep. 4) He forces the elf captives to fight his goblins to the death and also strategically pairs them so that more of the male elfs are likely to die. All so he can recruit more of the female elfs to his harem.  \n\n\n I was too disgusted by that to keep watching.\n\n\nBy the way, the auto moderator is moronic. My comment already indicated the anime and episode, as well as marking the spoiler. Yet it still deleted my comment and instructed me to add it again. That's the reason for the redundancy.", "label": 1}
{"text": "It was an exam. It was also my first time taking it. so nothing too big. \n\nAlso those downvotes. Man it's the best welcome r/anime can do I am not mad about it it's pretty funny.", "label": 1}
{"text": "Ah sorry if you didn't do as well as you hoped :S", "label": 1}
{"text": "The fruit of Grisaia", "label": 1}
{"text": "REDLINE (MADHOUSE)", "label": 1}
{"text": "i know how to guess this! \n\nhow many terabytes of CP do you have on your PC?", "label": 1}
{"text": "Thanks", "label": 1}
{"text": "I mean, I've dropped tons of shows becaus ethey were just plain bad, but there's one called Kodomo no Jikan... I don't know how anyone was allowed to make this shit. It's about a 3rd grade teacher and it's all just a bunch of lolicon ecchi bullshit, but even worse is that some of the 3rd grade girls have fucked up family lives, abuse and dead parents and whatnot, which really turns the lolicon ecchi shit into something very real and fucked up. It tries in vain to be a comedy but the teacher is really just a depraved unsympathizable pedophile. The cherry on top is that, in the manga ending, the teacher waits until the main (3rd grader) girl is 15, I repeat: *fifteen*, and enters a sexual relationship with her.\n\nAgain, I don't know how anyone was allowed to write this, and how any publisher was allowed to publish this lmao. For the record, I don't know how accurate this info is, I only watched till like ep 3, then looked up the plot out of morbid curiosity.", "label": 1}
{"text": "is the speech this episode? doesn't seem like it", "label": 1}
{"text": "Alright so get ready this will be a long one… [tower of god blogpost and skipped content spoilers] >!think of Shinsu as the perfect love child between nen and chakra… in the tower Shinsu is everything it’s everywhere it’s what you breathe it’s life energy and it gets more concentrated and dense the higher the floor you go up in the tower… regulars have to make a contract with the administrator on each floor to gain permission to use shinsu, irregulars don’t have too and can use it at will (why the administrator in season 1 said this will be a shackle for you) Now let’s get into techniques and usages, everyone has a natural flow or current of Shinsu inside their body the technique you see bam use in the beginning of the season is called reverse flow control a ranker technique where you forcibly pour your own Shinsu into someone else reversing their flow and temporarily paralyzing them, there’s also baangs… these are concentrated pockets of Shinsu skilled regulars and rankers can use that can fire shinsu offensively the amount of baangs used often shows the proficiency and skill of the user, it’s why it was such a big deal that Baam was able to use 5 even though he was only on the 29th floor (skilled rankers can use hundreds), Shinsu also slows down aging the more proficient you are with it which is why age is complicated in the tower (ie: Endorsi is like 300) now let’s get into properties and 10gf, now when you see people use lightning Shinsu or fire shinsu etc. that can be the result of 2 different things it can A. Be the element they have a natural affinity to (again think of shinsu like nen it is pure energy I can get deeper into this but it will be a spoiler for later on) or B. Be a result of being a descendant of one of the 10 great families, the 10 great families is a very important aspect of the worldbuilding the anime kind of skipped, each of them have a family head that is a irregular, immortal and are the most powerful beings in the tower outside the administrators, each family head has a strength or aspect that they pass down to their descendants, each of their descendants are extremely naturally strong and adapt to shinsu well, there are the:!<\n\n[tower of god] >!Khun Family: have affinity for being great spear bearers, lightnig and ice shinsu (You’ve met: Khun Aguero, Khun Ran, and Khun Maschenny Jahad (the blue haired princess you seen on the first episode))!<\n\n[tower of god] >!Ha Family: Pretty much Bezerker builds with a high skill/affinity with shinsu armament (You’ve met: Jinsung (Bam’s trainer, Yuri Jahad, Novick)!<\n\n[tower of god] >!Yeon: affinity with fire shinsu, dominated by women You’ve met: Yihwa!<\n\n[tower of god] >!Lo Po Bia: extremely talented animas ( pretty much pokemon trainers they control animals n stuff) You’ve met: Jahad officer that got washed by Yuri at the end of the first season!<\n\n[tower of god] >!Arie: Strongest family, extremely talented sword skills that are unmatched in combat,!<\n\n[tower of god] >!Ari: Family known for their skills with needle combat (another thing skipped was needles are used in tower instead of swords because it is hard to swing around swords in shinsu because shinsu is like water) each member gets a special named needle!<\n\n[tower of god] >!Po Bidau: Known to be geniuses and talented wave controllers!<\n\n[tower of god] >!Eurasia: most Talented wave controllers love their sleep You’ve met: Lauroe (dude in sleeping bag from first season)!<\n\n[tower of god] >!Tu Perrie: Most talented Light bearers!<\n\n[tower of god] >!Hendo Lok: most members and don’t live long due to a curse, most talented defenders and most shinsu resistance!<", "label": 1}
{"text": "I haven't read the manga in a few years, but there was essentially 3 major arcs.\n\n* First year:  Tomoko is a loner who think the world is against her. Reality is that people around her are either caring, or are just going on with their day without paying attention as they should. That's what the anime covered, and it's mostly a collection of short skits where she slowly improve her behaviors. \n\n* Second year: Tomoko end up in a small group of a friends (forced pairing on a school trip). It's similar to the first part, but a bit more focussed. It goes through the awkwardness of meeting up people, and dealing with each other quirk. \n\n* Third year: They are preparing for college, and the various friends group in Tomoko's class intermingle a lot more. The story often shift perspective to other characters to address their issue. Tomoko is kind of at the center of the stage, but it follows the classes and their interaction with each other.\n\n\nPersonally, I liked the first two arcs a lot. Third arc feel like a natural progression, and there is some nice story beat/progress occasionally, but some of it is too contrived and lack the realism of the first two part..", "label": 1}
{"text": "wow", "label": 1}
{"text": "# Anime Recommendations:\n\n1. **Mob Psycho 100** – An engaging story with unique animation, great character development, and a mix of humor, action, and heartfelt moments. It avoids excessive fan service and stays away from body horror.\n2. **Spy x Family** – A mix of action, comedy, and wholesome family dynamics. It’s a fun series with great characters and no problematic content.\n3. **Psycho-Pass** – If you enjoy detective stories, this cyberpunk crime thriller could be perfect. It deals with deep themes about society and justice without the need for fan service.\n4. **Great Pretender** – A con artist-themed anime filled with twists, humor, and strong storytelling. It has a stylish animation style and keeps things clean and engaging.\n5. **Death Parade** – A thought-provoking series that explores themes of life, death, and morality. It has emotional depth and avoids problematic content.\n\n# Manga Recommendations:\n\n1. **20th Century Boys** by Naoki Urasawa – A masterpiece in suspense and storytelling with a mystery that spans decades. It’s mature without crossing into excessive gore or problematic content.\n2. **Pluto** – Another work by Naoki Urasawa, based on a story arc from *Astro Boy*. It’s a deep, character-driven mystery with sci-fi elements.\n3. **Yotsuba!** – A lighthearted and funny slice-of-life series that’s perfect for a change of pace. It’s wholesome and well-loved for its charming simplicity.\n4. **One Punch Man** – A blend of comedy and action that satirizes the superhero genre. It’s clever, entertaining, and free of problematic content.\n5. **Beastars** – A unique story with themes of identity, society, and personal struggle. It’s mature without being excessive in fan service or horror.", "label": 1}
{"text": "The Fruit of Grisaia for those wondering what he is talking about, aka *Everyone I ever loved or trusted sexually abused and raped me, yet I overcame it all to save the world*", "label": 1}
{"text": "If you watch this show I just automatically think you’re a pedophile, no one else could tolerate Rudy.", "label": 1}
{"text": "That doesnt explain the smirk though, huh...", "label": 1}
{"text": "You're one to talk lol.", "label": 1}
{"text": "Dot", "label": 1}
{"text": "Fate Zero is uderrated so much", "label": 1}
{"text": "Bro you literally skip through anime just to consoom more of it. Watch the things youre actually interested in and maybe you wont feel compelled to do something so braindead.", "label": 1}
{"text": "So that basically means you stand against shows like dragon ball z kai then doesnt it?  Because it skips large amounts of the original content.\n\n\nI guess you also firmly stand against filler guides too, since that is also skipping content.\n\n\nWhat a stupid hill to stand on lol.\n\nEdit: 🤡🤡🤡🤡", "label": 1}
{"text": "lol, \"misread\". Since when is the average intellligence on reddit so low? It was literally explained in the anime how the saint was informed by the king of alicia's kindnappers and location. She didn't misread jack and it's explicitly said in words. Everything she did was obviously deliberate and calculated, to anyone with average media literacy that is.", "label": 1}
{"text": "I preface this short list with the following: I’m generally immune to the fuckery of anime. Fanservice, slapstick, and rapestick humor has come at me so hard and fast since the 80s that I am super desensitized to it. \n\n Kare Kano. It’s not explicit in the anime, but when ||Arima takes the MC in the library and she just rolls with it|| I lost respect with the story, and stopped buying the manga. \n\nI love Mushoku Tensei from beginning to end, and I’m glad the anime didn’t turn me off from reading the webnovel, but man the skeezyness of Rudeus really irritated me the first couple watch throughs. \n\nDan Da Dan starts a little on the rapey side too.", "label": 1}
{"text": "Bokurano for the R@ stuff. It's a show where kids are forced to pilot a mech to fight and save the planet but the main pilot is sacrificed at the end of a fight, making everyone panic and trying to experience what they can before they're chosen as the next sacrifice.", "label": 1}
{"text": "Private message? Is that possible here?", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n-  Your comment looks like it might include untagged or wrongly-tagged spoilers.\r\n\r\n  When spoiler-tagging comments, you'll have to use [] before the spoiler tag to indicate the context of the spoiler, for example `[Work title here] >!tagged text goes here!<` to tag specific parts of your text. [Find more information here.](https://www.reddit.com/r/anime/wiki/rules#wiki_tagging_comments)\r\n\r\n\r\n\r\n- Naming the show this is from turns it all into spoilers.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "It may be from the anime **\"Akame ga Kill!\"**. In this series, the protagonist, Tatsumi, becomes involved with a group of assassins known as Night Raid, who aim to overthrow a corrupt empire. The anime is known for its intense action sequences and dramatic confrontations. The specific scene you're describing likely involves Tatsumi confronting one of the antagonists, leading to a climactic battle.", "label": 1}
{"text": "# Action/Adventure:\n\n1. **My Hero Academia** – A story about a world where people have superpowers, and a young boy strives to become a hero. It’s full of action, friendship, and inspiring moments.\n2. **Hunter x Hunter (2011)** – A fantastic adventure series with rich storytelling and great character development. While it has some intense moments, it’s generally suitable for a younger audience.\n3. **Dragon Ball Z/Kai** – Since you’ve watched *Dragon Ball*, this classic series is great for its action and humor. *Kai* is a more concise version with less filler.\n4. **Naruto** – A story about an aspiring young ninja and his journey to prove himself. It’s packed with themes of perseverance, friendship, and growth.\n\n# Fantasy/Supernatural:\n\n1. **Little Witch Academia** – A fun, magical adventure following a young girl who enrolls in a witch academy. It’s light-hearted and perfect for younger viewers.\n2. **Pokemon** – Always a classic, it’s an easy watch filled with fun adventures, friendship, and battles.\n3. **The Rising of the Shield Hero** – A fantasy story that’s interesting without excessive mature themes. It follows a young man transported to another world and forced to face challenges with only a shield as his weapon.\n\n# Comedy/Lighthearted:\n\n1. **One Punch Man** – A humorous take on superhero tropes, with great action and a lot of laughs. It’s pretty clean and enjoyable for younger audiences.\n2. **Haikyuu!!** – A high-energy sports anime about volleyball. It’s all about teamwork, growth, and striving to be the best.\n3. **The Disastrous Life of Saiki K.** – A hilarious series about a boy with psychic powers who just wants a normal life. It’s full of comedy without inappropriate content.\n\n# Slice of Life:\n\n1. **Barakamon** – A heartwarming story about a calligrapher who moves to a rural island and finds joy in everyday life, learning valuable lessons from the locals and a young girl.\n2. **Natsume's Book of Friends (Natsume Yuujinchou)** – A gentle and touching story about a boy who can see spirits and tries to return their names to them. It’s calming and beautiful.\n3. **Silver Spoon** – A slice-of-life anime about a high school student who attends an agricultural school and learns more about life and himself through his experiences.\n\n# Sci-Fi/Adventure:\n\n1. **Digimon Adventure** – Another classic that combines adventure, friendship, and battling digital monsters. It’s a nostalgic and fun watch.\n2. **Astro Boy (2003)** – A modern take on the classic tale of a robot boy with a heart of gold who fights for justice.", "label": 1}
{"text": "# 1. Moribito: Guardian of the Spirit\n\n* **Why**: A compelling fantasy story with strong world-building and an amazing female protagonist, Balsa. It has great action scenes and explores themes of duty, protection, and redemption.\n* **Genre**: Fantasy, Adventure.\n\n# 2. Zankyou no Terror (Terror in Resonance)\n\n* **Why**: A thought-provoking thriller involving two mysterious boys who carry out elaborate terrorist acts in Tokyo while leaving cryptic clues for the police. It’s intense, intelligent, and visually striking.\n* **Genre**: Psychological Thriller, Drama.\n\n# 3. Kaiba\n\n* **Why**: A unique and surreal anime set in a dystopian future where memories can be transferred between bodies. The art style is unconventional but matches the deep, thought-provoking storytelling.\n* **Genre**: Sci-Fi, Drama.\n\n# 4. Planet With\n\n* **Why**: A mecha anime that takes common tropes and flips them in unexpected ways. It's surprisingly deep and well-paced, with themes of forgiveness and justice.\n* **Genre**: Mecha, Sci-Fi, Action.\n\n# 5. Mushishi\n\n* **Why**: A beautifully crafted series that follows Ginko, a \"Mushi-shi,\" as he travels to help people dealing with supernatural creatures called Mushi. It's calming, philosophical, and visually stunning.\n* **Genre**: Supernatural, Slice of Life.\n\n# 6. Princess Principal\n\n* **Why**: A steampunk spy anime featuring a team of female spies in a divided city reminiscent of Victorian London. It’s stylish, has great action, and features intricate plots.\n* **Genre**: Action, Mystery.\n\n# 7. The Tatami Galaxy\n\n* **Why**: A unique, fast-paced story that follows a college student exploring different possibilities of his life choices. It's a blend of surrealism, comedy, and existential themes.\n* **Genre**: Psychological, Comedy, Slice of Life.\n\n# 8. Run with the Wind (Kaze ga Tsuyoku Fuiteiru)\n\n* **Why**: A sports anime about a group of university students training for a marathon. It’s more than just a sports story; it’s about perseverance, teamwork, and personal growth.\n* **Genre**: Sports, Drama.\n\n# 9. Barakamon\n\n* **Why**: A feel-good slice-of-life anime about a calligrapher who moves to a rural village to find inspiration and ends up finding joy and friendship in unexpected places.\n* **Genre**: Slice of Life, Comedy.", "label": 1}
{"text": "Likeee I’m surprised to see so many people on here willing to give Liz the benefit of the doubt. Not only did she know who the kidnappers were, it honestly looked like she restrained Alicia so the kidnapper could finish the job. Had it not been clear it was the blonde guy I would Have sworn Liz hired the kidnappers herself. She def put the blonde up to it/encouraged it. She is evil and she knows exactly what she is doing", "label": 1}
{"text": "for sure gonna be participating, been planning to watch this for a while now", "label": 1}
{"text": "Yes, we can give you some recommendations.", "label": 1}
{"text": "I think they started putting lead in something in what people here eat or drink. Or maybe back in the gasoline. I swear that a decade ago the intelligence of people on the internet was vastly higher than it is today. And people normally grow more intelligent from their 20's into their 30's, so getting older isn't a reason.\n\nI mean the animators themselves gave liz the wicked smile trope 9 minutes in, completely shattering any form of subtlety.", "label": 1}
{"text": "Yep they must be. Even in the cover picture Liz looks evil and is giving Alicia the evil eye from behind", "label": 1}
{"text": "https://w5.vostanime.fr/film-vf-vostfr/blue-giant-vostfr/\n\nCadeaux 🥸", "label": 1}
{"text": "I cannot. Sorry.", "label": 1}
{"text": "Someone can yes but not just anyone.", "label": 1}
{"text": "Yes, someone can.", "label": 1}
{"text": "You’re a retard", "label": 1}
{"text": "Yes. That's what martyrdom is. \n\nAskeladd is the most interesting character in season 1, though. Maybe you need to watch it more, or ... well, I don't know how to say it very pragmatically, but maybe you'll like it more when you're older.", "label": 1}
{"text": "Naruto", "label": 1}
{"text": "Bleach", "label": 1}
{"text": "Naruto", "label": 1}
{"text": "Bleach", "label": 1}
{"text": "Bleach", "label": 1}
{"text": "Haikyuu", "label": 1}
{"text": "I don't know. Lol", "label": 1}
{"text": "Use anime.9. Its free.", "label": 1}
{"text": "Better question would be when did you start watching anime", "label": 1}
{"text": "Nope. Went all wacky. And turned into a battle manga with JoJo stands.", "label": 1}
{"text": "Natsume's Book of Friends, Love Is War", "label": 1}
{"text": "You should def watch blue exorcist or death note", "label": 1}
{"text": "Def chainsaw man but idc bc its my fave anime anyway...", "label": 1}
{"text": "Watchcartoons.io", "label": 1}
{"text": "still turned into a battle manga", "label": 1}
{"text": "Skip and Loafer, a healing one", "label": 1}
{"text": "OMG, I totally feel the same way! I was honestly shocked to hear that so many people thought the first episodes were boring. I was completely hooked right from the start! I had no idea what was happening, but I just couldn’t get enough I wanted more and more", "label": 1}
{"text": "Surprised no one mention Boku no Pico", "label": 1}
{"text": "that was intense", "label": 1}
{"text": "For me it's Vampire knight", "label": 1}
{"text": "cool", "label": 1}
{"text": "What's the excuse for your decline?", "label": 1}
{"text": "Yes, someone can.", "label": 1}
{"text": "Watched it", "label": 1}
{"text": ".", "label": 1}
{"text": "Thank you, I'll check 'em out.", "label": 1}
{"text": "Thank you, I'll check 'em out.", "label": 1}
{"text": "Thank you, I'll check 'em out.", "label": 1}
{"text": "Hunter x Hunter, watch the 1999 version if you want the old school aestethic.", "label": 1}
{"text": "Super fun series (from the first 4 chapters that are translated). If you like two (possibly more?) ojous insult each other after everytime they play together, you are at the right place.\n\nThis series is actually just two years (and a week) old, so this is a really early anime. Weekly manga are scary.\n\n  \nI am not gonna lie, I am kinda amused/frustrated this somehow got news for its anime before ggwp:young ladies don't play fighting games did, despite starting 2.5 years later (~~and also almost 1:1 stealinging ggwps first chapter,~~ even the title sounds like they just negated ggwps one)", "label": 1}
{"text": "Fruits basket anyday", "label": 1}
{"text": "Thank you, I'll check 'em out.", "label": 1}
{"text": "I like the art its perfect", "label": 1}
{"text": "Wow that's interesting", "label": 1}
{"text": "I'm suggesting some shoujo animes of old graphics \n\nKimi ni todoke \nToradora \nTsuki ga kirei \nHyouka (pls pls pls do give this a try. This one is a masterpiece no doubt)\nThe pet girl of sakurasou (you'll love this one)\nMy little monster \nSay I love you", "label": 1}
{"text": "Looks so pretty!", "label": 1}
{"text": " Gintama and fire force", "label": 1}
{"text": "Means you are retarded", "label": 1}
{"text": "LMAO\n\nThat sounds hilarious", "label": 1}
{"text": "That looks amazing", "label": 1}
{"text": "My dude Al is a little bit sus.", "label": 1}
{"text": "Aldebaran try not be suspicious challenge: Impossible ", "label": 1}
{"text": "The author tweeted out the reason when the last ep was airing. Its not really a spoiler, just some lore.\n\nMods, can I say it, or is that not allowed?\n\nIg I can just link it lol, [https://x.com/LoremIpsumVerb/status/1853014390515130704](https://x.com/LoremIpsumVerb/status/1853014390515130704)", "label": 1}
{"text": "Fr being at the end of the device used to communicate with Regulus? This can't just be a coincidence now.", "label": 1}
{"text": "sus is one option, but if he took down Capella, that’s him being a major cunt\n\nbecause if he was in fact able to take her down yet ONLY escorted Subaru to the City Hall and ***LEFT***, Al is mental", "label": 1}
{"text": "There's also a mystery with Al as was revealed in the breaktime ep 5 that he came from Earth like Subaru.", "label": 1}
{"text": "Capella called her blood \"cursed dragon blood\" last episode. Perhaps it has something to do with this.", "label": 1}
{"text": "In addition he is isekaid just like Subaru as was revealed in the breaktime episode. He surely has some ulterior motives.\n\nPS : Don't forget to watch the post credit scene.", "label": 1}
{"text": "Thank you, I'll check 'em out.", "label": 1}
{"text": "I don't think Capella is down because she was just having a convo with Regulus and only say Rienhard can defeat her so quickly and then call the phone. I think that he like Emilia took the mirror after Capella left.", "label": 1}
{"text": "Wasn't he referring to the post credit scene?", "label": 1}
{"text": "this look fantastic nice job", "label": 1}
{"text": "Or maybe he is strong as well, because we haven't seen him in combat at all and what's under his helmet", "label": 1}
{"text": "‎", "label": 1}
{"text": "Re:Zero Break Time Episode 6 (this week), there’s a possibility Aldebaran’s Japanese name is:   \n\n#.\n#.\n#. \n  \n^(Subaru.)\n\nwhen Emilia calls out “Subaru~”, both Subaru and Al respond. Then he sorta does a ‘oh wait, she’s not calling me’ moment", "label": 1}
{"text": "Cool!", "label": 1}
{"text": "No one is mad or worked up over your opinion on the anime. Just how you’re addressing people tbh.\nCalling people sheep. Thinking your opinion is the shit, better than everyone else’s. End of the day your opinion is just an opinion. Just like mine, or anyone else’s. Your tastes in life aren’t anymore superior than anyone else’s. Everyone’s just saying, if you don’t like it, move on to the next thing. No need to come online and bash others for liking it 🤷‍♂️. Doesn’t make you seem alpha or whatever you want to call it. Just looks like a child who’s throwing a tantrum when he doesn’t hear shit he wants to hear 💀", "label": 1}
{"text": "Why are you dull-witted?", "label": 1}
{"text": "I want to believe that he's just using the same frequency the Archbishops are to try and clue in to their planning but how would he even know that in the first place?", "label": 1}
{"text": "I think he's probably just using the same communication frequency all the Archbishops are using.", "label": 1}
{"text": "Also I get the vibe that Priscilla knows more than she's telling, like the way she responded when Subaru talked about the Archbishop of Wrath.", "label": 1}
{"text": "Yes, something they'll like to fix on a BD release, this is what a non-priority episode looks like going forward. Just hope they'll not waste all their fuel on arc 5 part 2, need all the stops for peak fiction arc 6.", "label": 1}
{"text": "Sorry, your comment has been removed.\r\n\r\n- Please remove both your first paragraph and the direct link to the Break Time special. The former breaks our Source Corner rules, the latter breaks our anti-piracy rules (linking to the *official* upload on YouTube is fine, linking to an unofficially translated one is not).\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.", "label": 1}
{"text": "His ranking refers to when he chronologicaly got the wife, the reason Emilia is 79th out of 291 and 54th current wife is because [ReZero Season 2 cut content] >!He Wanted Fortuna to be his wife as well when he met her since he liked her face, but alas couldnt get her, so he reserved the number for another elf-eared girl who comes along, he didn't even remember he met Emilia too so that was non-factor.!<", "label": 1}
{"text": "all of them. every single one", "label": 1}
{"text": "Honestly I get kind of sus vibes from Priscilla too the way she's reacting to talk about Archbishops.", "label": 1}
{"text": "When I read this, I imagined it like a fire dash where she cuts them but this fits really well with them describing it as her fighting gracefully like she's in a ballroom dance.", "label": 1}
{"text": "hey mod, anime-only here\n\nI’ve seen you remove some comments about Aldebaran, but I don’t exactly understand where’s the spoiler.\n\nBecause as I understand it, claiming he’s sketchy is a fair assumption. Spoilering it makes no sense from my point of view.\n\nYou are confirming suspicions for anime-onlies.", "label": 1}
{"text": "he wanted Fortuna back in the past but couldn't get her so he chose Emilia", "label": 1}
{"text": "Overflow. Not even kidding. Everyone needs to be fooled at least once before death by a friend to watch that anime. Its kinda like being enlightened about the down badness of ppl", "label": 1}
{"text": "Idk about his shoe, but in the novel is did say the bandage was still attached and only slightly beginning to fall off, and he had to take it off to see his leg. But it is still weird", "label": 1}
{"text": "Excited for this one truly!", "label": 1}
{"text": "I swear if he's like a Yuki from Slime...", "label": 1}
{"text": "i think the Eminence in shadow is a good one", "label": 1}
{"text": "Honestlyy I kind of miss when it was more of a hidden gem but its nice that more ppl are appreciating it now", "label": 1}
{"text": "That punch is ridiculous!", "label": 1}
{"text": "It implies she is of Vollachian royal family which isnt in good relations with Lugunica. And she is going after Lugunica\\`s throne.", "label": 1}
{"text": "Technically, at the moment of that conversation, they were no longer at war.", "label": 1}
{"text": "The same applies to political parties though. Eventually the competent and well meaning party will be infested by corrupt and self-interested people, or another party that's much worse will be elected. \n\nAt least with a dictator you've got a competent leader for 40-60 years before having to worry about finding a replacement, while the political parties swap every 4 years, often undoing the work of the previous party if a new party gets in. Long term plans suffer while short term gains are prioritized because they can use that to brag about how good their term was, so they can hold onto power for another few years. A dictator can also select a successor, giving a much better chance of a good replacement, as long as they don't choose their own children. \n\nChildren raised by someone with supreme power, wealth and status, won't have any concept of actual hardship and they'll be removed from the world they're supposed to be living over, which makes for a poor ruler. Perhaps there'd be some success with a properly tutored child but I reckon you'd always be better off with a tutored candidate chosen from assistants, advisors and other prominent people near the dictator. \n\nThe line about the people having the right to violate the rights of the people is some clever rhetoric but totally wrong. \"The people\" were responsible for slavery in America, for example. \"The People\" is made up of multiple groups and it really just means the majority within the population. So the guy is arguing that the majority within a population has the right to remove the rights of people within the population. Which ultimately just results in the majority serving themselves while stepping on the minority. It's honestly an abhorrent argument. It's based in a stupidly simplistic idea of \"people can choose what to do with their own body, so lots of people can choose what to do with lots of people's bodies.\" and it just totally misses the fact that a body isn't conscious or made up of individuals that have wills and emotions, unlike The People.", "label": 1}
{"text": "> Regulus truly is the ideal husband, let's see we have:\n> \n> \n> \n> Domestic abuse, threats of violence, kidnapping, gaslighting, attempted murder, terrorism (threatening to blow up the tower)... and unlawfully redecorating a church cause let's be real he probably did not rent that place.\n\nHe could become President or something with that résumé ... =(", "label": 1}
{"text": "Real and topical", "label": 1}
{"text": "Fun fact : The wolgram and dragon scene is actually from Arc 7, so Season 4/5. No idea why they put it in so early, but no qualms either.", "label": 1}
{"text": "So this was after the initial war and before the rebellion?", "label": 1}
{"text": "Honestly, I'm surprised you could forget this conversation. It was arguably one of the most pivotal conversations of the entire series since it was the first time Yang and Reinhard talk face-to-face. It happened just right after the Alliance surrendered.", "label": 1}
{"text": "That so sad for him", "label": 1}
{"text": "So basically what I said? I remember the conversation, I just didn't remember where they were in the war. I'm pretty sure this is also the only time they speak face-to-face.", "label": 1}
{"text": "Ah, the 'I know you are but what am I?' defence. Brilliant.", "label": 1}
{"text": "Goosebump!", "label": 1}
{"text": "Said the simpleton projecting his own inadequacies", "label": 1}
{"text": "[Kamala Harris must feel like this rn.](https://i.ibb.co/rbj0L8x/woody.jpg) I haven't seen Reddit say a good word about her since the results were called.\n\n[](#sadholo)", "label": 1}
{"text": "Or Biden. Really, the only Dem getting any love is Reddit heartthrob Montgomery Berns.", "label": 1}
{"text": "Misguided? Your tripping, take your own advise and “worry about yourself“. From the fact your this combatitive over a simple health awareness post, I can already assume this is hitting close to home.\n\nIf you think bro is coming of preachy, then ignore the post, your the one imposing the belief he/she “wants to the save the children“, theres only one subset group who go haywire wheb healthy lifestyle choices/suggestion are said, in short your probaby Lizzos’ number one fan P4P🤨", "label": 1}
{"text": "The old man right? Hahaha", "label": 1}
{"text": "Hahaha I got hooked when the twist came for jobless reincarnation but I’ll try konosuba and re-zero idk why but I struggled to get into it. Tyyyy ❤️", "label": 1}
{"text": "If he was American they would vote him as president for sure.", "label": 1}
{"text": "The pet girl of sakurasou", "label": 1}
{"text": "Most anime never get a second season, and even fewer get a third one. I would say its very unlikely.", "label": 1}
{"text": "For a while the majority of people in the democratic system maintained slavery. I don't care about the other colonies. I wasn't attacking America and saying the rest of the world is better, I was just using it as an example. \n\nA dictator could also have ordered the end of slavery. Like, again, there's just no argument for democracy here. None of these arguments are about democracy. They're just rhetoric that attributes qualities to democracy that democracy doesn't have. I can just as easily say that the murder of anyone killed by American weapons is also the result of democracy, so democracy is clearly evil. The use of nuclear weapons in WW2 were done at the behest of a democratic country so clearly democracies are all about mass destruction. They're just silly arguments. \n\nDemocracy is honestly a joke in the modern countries I know about. America has it's 2 party system and Britain is almost at a 2 party system too. There's barely any choice and people are voting tactically for parties they don't even want just because it isn't the other party they dislike more. At the head of these parties are oligarchies or even miniature dictatorships anyway. America is rotten with bribery, though I hear they call it lobbying, and the UK is full of corruption and incompetence. Neither government, regardless of whatever party is winning, is actually acting for the benefit of the people. They act to preserve their own wealth and to try to retain power. \n\nDo you genuinely see abortion bans as a reasonable step to take for the benefit of the people living in the US? I would say it's a great example of democracy failing the people. It's actively denying medical treatments that save lives. It's forcing accidental pregnancies to be carried to term by people who aren't ready and who maybe just got unlucky with the 1/100 failure rate of birth control, thereby forcing them and their new child into poverty.   \nFrankly, even if the majority of people did vote for that, it's still a failure of democracy. If the majority is going to make blatantly bad choices then it's clear that the vote of a majority simply isn't a good basis for policy. \n\nThere's a reason we have experts. Just like I wouldn't consider 50 random people the equivalent of a doctor when I need an illness diagnosed, I don't consider the general populace to be the equivalent of economic experts, philosophers, psychologists and medical experts when I need a country run competently.", "label": 1}
{"text": "You can also see him in Season 1 for a shot.\n\nA lot of his moments in the novels were cut, so it makes sense anime onlys can't remember him.", "label": 1}
{"text": "Thats why so many people were surprised they ever put Project 2025 in writing, a lot of that stuff is backrooms talk.", "label": 1}
{"text": "Dude, look at yourself. All your replies. How you act as if you are so clever and you snap and insult anyone who disagrees. Watching too much anime is not a basis for intelligence. If anyone in this thread is projecting, it's you. Sound like you're not actually a little boy anymore. It's time to grow up.", "label": 1}
