{"text": "A day on Venus is longer than a year on Venus", "label": 0}
{"text": "The flying monkeys in the Wizard of Oz. When they busted up the Tin Man and the Scarecrow.", "label": 0}
{"text": "Hell do I know. Every time I’ve asked her this question (Which I’ve tried multiple times in my life.) Her answer is always whatever sounds good to her at the time. Essentially her favorite food is whatever she’s in the mood to eat. She doesn’t have a favorite food. \n\nIn fact she doesn’t have a favorite anything. Color, shows, etc. It’s always whatever she feels like atm.", "label": 0}
{"text": "Jumper. always been for the past 15 years", "label": 0}
{"text": "Same. ER doc said its just a bunch of 6 inch falls", "label": 0}
{"text": "I hate United so much", "label": 0}
{"text": "Comcast", "label": 0}
{"text": "“It” - and makes me dislike clown until I’m grown up. And dark sewers always creeps me out, feels like something down there is watching you.", "label": 0}
{"text": "My sister had two kids in Vermont.  One kid was when my brother in law was working for the state.  Cost about 17K, fully covered by state insurance.  Two years later, she had another kid, covered by private insurance since my brother in law was no longer working for the state.  Cost about 28K, my sister and her husband had to pay a deductible of 2K.  Same hospital, same doctor, all the same but the insurance provider.  When  she asked why the bills were so different, she was told that the state audits insurance claims and private insurance doesn't.  They just bill a deductible and pay the difference.  The hospital puts whatever charges they can get away with on the bill.\n\nAsk for an itemized bill.  You'll see a huge difference.  I was presented with a bill for $800 for three stitches.  I asked for an itemized bill and 'medications' went from $350 to $18 for two extra strength tylenol.  Imaging went from $200 to an x-ray for $73.  The only thing that really didn't change was the doctor's rate.", "label": 0}
{"text": "Plain ice cream is just frozen cream, it's delicious when made with good cream.", "label": 0}
{"text": "Netflix", "label": 0}
{"text": "Every single one. At some point all animals including us will die.", "label": 0}
{"text": "'Swing away, Merrill. Merrill... swing away.\"\n\nMost terrifying event of my childhood.", "label": 0}
{"text": "Which Emirate did they live in? I know multiple people, including my own cousin, who had to get the authorities (idk if thats the right word) involved because of the woman getting pregnant and that leading to messy paternity and stuff. The worst that came out of my cousin’s situation was that they had a hard time getting the birth certificate because her husband was the default father.", "label": 0}
{"text": "If you had to weigh and prioritize the entirety of the species in terms of survival in a WW3 scenario would Ukraine be your first priority? Or to be more blunt: is it worth it? The answer no. ", "label": 0}
{"text": "Sexy French Depression [https://youtu.be/H1DCoGCVUxY?si=Z7fGxNkiZ7HiMTzX](https://youtu.be/H1DCoGCVUxY?si=Z7fGxNkiZ7HiMTzX)", "label": 0}
{"text": "Yeah I know, I was a lot more pissed off than Jerry was. I wasn’t in the mood to make clever comments, I wanted to go the fuck home", "label": 0}
{"text": "Also unnecessary data caps for most of their customers. There's no technical reason for data caps with cable internet. There's not even data caps with most wireless 5G internet. It's just entitlement and greed that negatively impacts families with multiple internet users the most.", "label": 0}
{"text": "Worst experience is trying to get to 50 karma so that I can post on the sub I want to.", "label": 0}
{"text": "Ate the baby", "label": 0}
{"text": "No, I’m asking you.\n\nActually, I’m asking you to be logically consistent. ", "label": 0}
{"text": "28 days later. I was 6", "label": 0}
{"text": "Anime and video games, I'll never give emm up!", "label": 0}
{"text": "Definitely Starbucks.", "label": 0}
{"text": "I could but no company is gonna offer an engineering position to someone without engineering qualifications. No matter how good my portfolio is.\n\nMy drawings are basically rough sketches of potential jigs to speed up or simplify manufacturing processes. I can only come up with simple, obvious solutions  that people can't believe  wasn't thought of sooner.\n\nI don't have the mathematical knowledge to draw it perfectly to scale, I only have an intuitive knowledge of the physics behind mass, weight, friction, momentum and resistance.", "label": 0}
{"text": "USB-C options are available. For headphones, car radios and more. I personally have loved the 3 pairs of USBC headphones I have. ", "label": 0}
{"text": "Snozzberry? Who ever heard of a snozzberry?", "label": 0}
{"text": "She says bad stuff about me when texting her boyfriend ", "label": 0}
{"text": "Any insurance company.", "label": 0}
{"text": "This is the correct answer. I saw this when I was 8 years old. I wonder what kind of man I would have grown up to be had I not seen that movie at such a young age. 🤣", "label": 0}
{"text": "Buying influencers.", "label": 0}
{"text": "The Sound of Music… after I decided I didn’t like it anymore.  I was 6 or 7 years old at the time.", "label": 0}
{"text": "Check monthly for displaced dirt", "label": 0}
{"text": "Landlords are generally pretty cool until you don’t pay on time.", "label": 0}
{"text": "Rarely, but that's because most people don't think. There is no such thing as absolute darkness so long as stars and rhe moon exist. Basically, pure black stands out if you're paying any attention at all, and sometimes if you aren't, because nothing in the natural dark is black.", "label": 0}
{"text": "\"team building\" lol thats funny", "label": 0}
{"text": "I can't wait for those to end", "label": 0}
{"text": "Cheese, pepperoni, pineapple, onions, mushrooms and green peppers.", "label": 0}
{"text": "Nintendo", "label": 0}
{"text": "My roommate put hot pepper flakes into a big pitcher of iced tea that I had in the fridge. I'm not sure what her goal was, I could see the flakes in my glass when I poured it. She did other awful things but tampering with my food was just too much", "label": 0}
{"text": "Check your inbox", "label": 0}
{"text": "Could be, but it isn't in any of them", "label": 0}
{"text": "When did I do that?", "label": 0}
{"text": "Can't really walk. Waiting for my second back surgery this year.  As a former pro athlete I can say this last year and a half, I couldn't do much walking.", "label": 0}
{"text": "Talks a lot of shit. Criticizes other’s hobbies, interests, and way of life in general.", "label": 0}
{"text": "Honestly, almost all of them", "label": 0}
{"text": "Totally.  It was just a bunch of crappy pop songs hosted by a reality TV star.", "label": 0}
{"text": "Jay Z Killed Michael Jackson", "label": 0}
{"text": "Lots of good ones here but I have yet to see Frontier. To make a change to a flight you have to use their app. But the app won't let you change your flight, you will have to call in. But it doesn't provide a number to call into. Then you have to use their Virtual Assistant and try to guess the right prompts for it to inevitably give you the phone number to call. And that phone number with have a really fun phone tree where you have to keep track of which routes you've already tried. Because guess what? 16 out of 17 of the paths tell you to use their mobile app or their Virtual Assistant and only 1 gets you to talking to a person who just tells you to cancel your flight and rebook. Oh, and even then there's no instructions on how to apply the credit of the canceled flight to the new flight.", "label": 0}
{"text": "I completely suppressed and forgot about the scene in Bambi where the hiding birds are trying to talk one of them out of a panic attack, as the hunter is near. \n\n\"We better fly!\"", "label": 0}
{"text": "Airbnb", "label": 0}
{"text": "Then you should read about Stanislav Petrov, that was even closer, and way after the missile crisis, in the 80's at an unexpected moment.\nAnd I'm sure we have multiple of these stories, Russian stories AND American stories.\n\n\nI just don't really get your logic, are you saying cause it didn't happen in the Cuban Missile Crisis it will never happen?\nWe have nuclear warheads pointed at eachother right now in Europe... and assuming you read about Stanislav you would know that an accident can always happen, and when a proper accident happens, we will still use nuclear deterrence to counter, which means: world = nuclear wasteland.\n\n\nAnd what if I told you we're now at 1.5 minutes to midnight? And have been since the war broke out in Europe?\nThe Cuban Missile Crisis got us at 7 minutes till midnight.\n\nI would also recommend listening to Annie Jacobsen or read one of her books about nuclear war and how they play out.\nYou clearly have a unrealistic view of this matter.", "label": 0}
{"text": "Burger King wins for burgers.\n\nBut McDonald's wins for everything, especially outside of the US where they have fried chicken.", "label": 0}
{"text": "xfinity", "label": 0}
{"text": "Im not advocating like its the only way lead head. But acting like it’s absolutely horrible to spank a kid is pretty ridiculous. Like no shit there is other ways to parent, but some kids are pretty violent and physical punishment is the only way they will listen and learn. If they learn hitting other kids hurts, by being hit themselves, they learn to stop doing it. Thats the way a lot of people learned not to hit people. Like no one’s advocating to do it all the time. No one is saying when you do, haul off and hit your kid as hard as you fucking could. So being so black and white about it like it’s down right evil to do is, yeah, ridiculous.", "label": 0}
{"text": "One thing I will always buy my kids, no protest, no “you have something similar at home” is books. \n\nLike yes, that new Lego set does look cool, let’s look online and see if we can find the manual and build it from the millions of legos you already have scattered all over the floor of your room. No, I don’t have squishmellow money today, besides, you already have one that looks exactly the same but a different tie dye pattern.\n\nBooks though, those are always an automatic yes.\n\nI always got in trouble as a kid for laying awake with a flashlight and book under my blanket. Because bedtime means you have to go to sleep. For my kids, lay in bed reading as late as you’d like, because I know they’re going to fall asleep anyway, might as well except use their brain a little while winding down.", "label": 0}
{"text": "Took too long to find this answer.", "label": 0}
{"text": "All airlines - each one is vying for ways to treat the customer more like cattle, abuse their employees more, which leads to the employees treating the customers poorly, which loops back to customers treating the employees poorly, and round and round.\n\nThe safety rules are outdated and used as excuses to discriminate based on ableism, and federal laws protecting them and employees don't allow for much change.", "label": 0}
{"text": "But they just love money so much more than that.", "label": 0}
{"text": "Not a movie but fucking puppet master", "label": 0}
{"text": "If you are someone who is naturally competitive:\n\nLearn to be less competitive with others, and more competitive with yourself.", "label": 0}
{"text": "GameStop", "label": 0}
{"text": "In my early teenage years I tried to make a pocket pussy of sorts by hollowing out one of those thicker cucumbers. I cut it in half and scraped out the middle with a spoon, then tried to tape it back together. I warmed it up very carefully in the microwave. I gave up using it after 2 seconds. The inside of a cucumber isn't a soft place, and it smelled like a warmed up cucumber", "label": 0}
{"text": "Agreed", "label": 0}
{"text": "All CEOs hate the common man.", "label": 0}
{"text": "I'd buy a country and pay all the top doctors in the world a compelling amount to come work there instead and make a global health care destination. \n\nI'll also take all the doctors so that every country is reliant on me. I set the rules and I say everybody gets it while I work on doing it as cost effective as I can. \n\nI would focus on transportation. It's stupid that we focus on bringing medicine to the patient when that's impossible. People live across too big of areas to provide necessary specialty and sub-specialty care. Even in developed countries, health care access to just basic things like emergency rooms may be non-existent. The solution is not to build health care in areas that don't have enough demand to support operations, but to build a health care city that is easy and cost effective to travel to.\n\nNo insurance, no contracted rates, no more corruption, no more countries deciding health care treatment. I would probably have to build a major self defense as I suspect interests will not want me to succeed. If money has to be diverted to assassinating these people, so be it.\n\n\nWith the cost of infrastructure, compensation, logistics and military. I guesstimate the cost will be anywhere between a gagilloon and fuckgillon. I get pissed when people try to criminalize wealth or say things like \"you don't need that much.\" Yes, yes I do.", "label": 0}
{"text": "any insurance company", "label": 0}
{"text": "EA.", "label": 0}
{"text": "Don't stick your dick into mentally ill ladies. Don't. Stick. Your. Fucking. Dick. Into. Mentally. Ladies", "label": 0}
{"text": "Xfinity/Comcast. Not only do they hate their customers, they hate their call center staff.", "label": 0}
{"text": "Ticketmaster. Verizon.", "label": 0}
{"text": "Pfizer", "label": 0}
{"text": "They didn't have customers, they have users.  They operate more like a drug dealer than a company.", "label": 0}
{"text": "Romance. Shit sucks, yo", "label": 0}
{"text": "french depression?", "label": 0}
{"text": "Disaster movie - kung fu panda with denchers and rabid death metal Alvin & the chipmunks rattled me, watched it with my cousin who was babysitting us. I was like 9 and it had just came out.", "label": 0}
{"text": "Wife and I met in HS but were just friends for over 8 years before hooking up, married almost 20 now.", "label": 0}
{"text": "It’s like a base flavor for a lot of ice creams. And the cheap ones use imitation vanilla, not a real thing", "label": 0}
{"text": "Stephen Miller", "label": 0}
{"text": "I don't get it either. But, I had a friend who did reaction videos and made a living off of it and going out to eat with him was a joy.\n\n\nHe was naturally expressive and always wanted to try something new. Watch him try a knew food was amazing. He wore his emotions on his face and experienced the most joy I have ever seen in a person.\n\n\nIt was like you could feel his emotions when you were with him.\n\n\nHe has a gift.", "label": 0}
{"text": "I can see that.", "label": 0}
{"text": "Turned out I wasn’t “the one” but “the many”", "label": 0}
{"text": "we were driving west to iowa across illinois and realized we had taken a wrong turn and were approaching the wisconsin border instead when we started seeing billboards on the side of the road saying \"cheese and fireworks, 10 miles ahead\"", "label": 0}
{"text": "The military", "label": 0}
{"text": "I felt misaligned with my goals and lacked fulfillment", "label": 0}
{"text": "We're not that drunk", "label": 0}
{"text": "Like the others said, the older you get the faster it goes. They are not lying.", "label": 0}
{"text": "Wells Fargo & Spectrum!", "label": 0}
{"text": "Happiness.", "label": 0}
{"text": "She started making moves on my long term boyfriend (now husband). Gaslit the hell out of me. Told me that they both wanted it “how could we not after knowing each other so long”. Until she made a move on another friend’s husband. And then another… except the 3rd she really went for it. He too had a long term girlfriend, so she decided to befriend her whilst “secretly” fucking him behind her back. Even when I confronted her about this she denied it. The scary thing was she never saw this behaviour as wrong or not okay. There was a year where I was living through this fuckery. It was so intense. I finally called it, and we left most of that friendship group behind. I copped a lot of hate but I’d do it all over again. I can’t believe I stayed as long as I did and try to make it work.", "label": 0}
{"text": "They fit in the wall socket easier", "label": 0}
{"text": "Oregon Cherry or Marionberry", "label": 0}
{"text": "Octopus. So intelligent. Their ability to camouflage. Their ability to slip through tiny holes like liquid.", "label": 0}
{"text": "They merged in 2010", "label": 0}
{"text": "Kroger.", "label": 0}
{"text": "Spectrum/Optimum. They have like 7 different names depending on where you live. After working there, let me tell you, they are just being optimistic as fuck when they set tech visit times. We couldn't guarantee shit. The system will email them \"Got it! Your appointment has been confirmed!\" But the dispatch center would cancel the visit without rescheduling or so much as making a courtesy call.\n\nSo then we would get pissed off customers who took the day off work for no good reason. That's not even getting into the fees, billing and the special department you have to speak with to cancel. They are required to get you to say \"no\" clearly 3 times before they cancel your service and get wrote up if they let too many people cancel.", "label": 0}
{"text": "Several months ago, somewhere around the first year anniversary of the pikmin game Niantic had a TON of layoffs that most don't know about while shutting down four planned games- only one was being tested and just failed to gain traction (which happens) but two were fully supported with devs doing private beta tests with signing lists to get in as the server could take more players and then everyone was fired suddenly and then one that was in alpha testing by Niantic was suddenly also canned and everyone was fired. \n\n\nThe guy doing one of the servers was fired on his vacation and the cm who replaced him basically said he exists and then disappeared. \n\n\nI quit my since day 1 Ingress account after that shit.", "label": 0}
{"text": "Pacific Gas and Electric", "label": 0}
{"text": "Haagen Daz anything is good", "label": 0}
{"text": "I’m not for everyone. Everyone isn’t for. No matter how awesome I am, no matter how awesome they are. Two people that get along really well, doesn’t automatically mean they are good for each other in a committed relationship.", "label": 0}
{"text": "My former “best friend” with whom I was emotionally and physically close. While we were seeing each other, she started seeing someone else.", "label": 0}
{"text": "Military relationships", "label": 0}
{"text": "Should have way more upvotes", "label": 0}
{"text": "Please follow all traffic laws, I don’t care if everyone else is driving crazy. Also respect the wildlife, and don’t feed or harass them.", "label": 0}
{"text": "Beer and Alone time.", "label": 0}
{"text": "Guacamole", "label": 0}
{"text": "Marley and me. I cannot watch any animal movie SOLEY because of that movie", "label": 0}
{"text": "That's The Point™\n\nWhen you build obfuscation into society as a stalwart, it's a feature, not a bug.", "label": 0}
{"text": "Expecting anyone to avoid looking at 50% of the population is an unrealistic expectation. A better question is to ask yourself why you feel so threatened by him glancing at others. Or by \"wandering eye\" do you mean he's actually cheating?", "label": 0}
{"text": "Once i slept in the bus, because i was going from work and was very tired, i woke up in depot and it literally was no other living person there. Luckily the doors of the bus were open and i could explore a bit. I took some nice photos because i always carry my nikon with me. When i found a fire exit i met a security guy who told me that i was not the first one who slept in the bus and that they live the buses open in case anyone get stuck in the bus. After that i called a very expensive Uber ride", "label": 0}
{"text": "For me Rosemary's Baby, 1968", "label": 0}
{"text": "Bank of America", "label": 0}
{"text": "Comcast, 100%", "label": 0}
{"text": "Especially when you’re getting a handy", "label": 0}
{"text": "First off, it's a *cylinder*", "label": 0}
{"text": "Look at my cat, isn't she cute?", "label": 0}
{"text": "He transformed into my \"service dog.\"", "label": 0}
{"text": "Being lazy as a goal.  We all get tired sometimes, but to deliberately avoid anything even remotely stressful all the time makes one soft, unhealthy, and fragile. \n\n\nAll healthy people exercise their body and mind. People need to get some sun, sweat a little, stretch their legs, interact with actual humans.  Gaming for 12 hours, only taking breaks for door dash is not good. \n\n\nI'm my experience, it's the laziest people I know who, paradoxically, have the most depression, worst outlook, terrible social skills, and anxiety.", "label": 0}
{"text": "You thought you said something smart hey 🤓", "label": 0}
{"text": "I recently bought a good surround sound system and several times we had to stop the movie because we thought these disturbing sounds were coming from outside.", "label": 0}
{"text": "Every night, no matter how much energy I’ve consumed, I have to shut it down..for 8, 10, 12 hours. P", "label": 0}
{"text": "I've been on anti depressants for almost ten years now, I still haven't found one that works like id imagine it too. How did you figure out which one was the one that was working? Could you even tell or was it just settling on that particular one by chance? Hopefully that wasn't too invasive to ask.", "label": 0}
{"text": "Lol I bet you have a lot of friends who really care about you.", "label": 0}
{"text": "Can confirm. Have missing front tooth", "label": 0}
{"text": "E.T.", "label": 0}
{"text": "I appreciate that🙏🏼", "label": 0}
{"text": "She probably had those things said to her a lot as a child", "label": 0}
{"text": "Nope. And even if I were, I'm not so evil as to tell that to a girl.", "label": 0}
{"text": "Metropolis.", "label": 0}
{"text": "Having fun at the arcade", "label": 0}
{"text": "May us all get home safe & sound .. SALUTE!", "label": 0}
{"text": "Wouldn’t have even been that bad it the wait wasn’t so goddamn long!", "label": 0}
{"text": "After 18 I didn't even realized now I'm 35", "label": 0}
{"text": "It had poo brain", "label": 0}
{"text": "Found love and found my voice through an artistic medium. \n\nI have fought my entire life for both and may give up soon but I am trying.", "label": 0}
{"text": "I’ve heard Martyrs is WILD. And I haven’t heard of come and see but I’ll look into them!", "label": 0}
{"text": "They’re right though, people keep going 😂", "label": 0}
{"text": "Fans are not the customers of Ticketmaster, the venues and artists are their customers", "label": 0}
{"text": "Did he look at the camera?", "label": 0}
{"text": "Its not about abortion. Its about a bunch of old white men telling women what they can and cannot do with their bodies.", "label": 0}
{"text": "what did he do to you?", "label": 0}
{"text": "That preacher dude from the second one still terrifies me. Holy shit was that guy scary.", "label": 0}
{"text": "Octopus", "label": 0}
{"text": "I saw this as a teenager in the mid-80s. It was very very disturbing to me. It’s probably an important film for people to watch so they truly understand what happened.", "label": 0}
{"text": "Stop complaining about how much there's political shit during a time where people are most political.", "label": 0}
{"text": "Former paramedic: I would make CPR certification, including AED usage, mandatory to graduate from middle school.", "label": 0}
{"text": "My wife and I actually made up a bingo game we play with these when they start showing the Hallmark Christmas movies. Each square says something like \"goes back to small hometown for holiday\", \"meets guy in flannel shirt that becomes love interest\", \"young kid of single dad plays matchmaker\", etc.", "label": 0}
{"text": "My integrity, my anger and pride. I might think of more.", "label": 0}
{"text": "Walking down the Boise River middle of winter with a friend.   There are islands with trees. We came up to one and saw a moose raise it's head then another one and then a third..   maybe thirty feet away.  \n\nWe slowly backed up for the most gut wrenching and heart pounding moments of my life as they stared us down..   \n\nWe were on Broadway area and no where outside of City limits.", "label": 0}
{"text": "I think they've served their time.", "label": 0}
{"text": "Popeyes.  That vibe of “what the fuck uou want?” has to start at the top.", "label": 0}
{"text": "Anything that doesn’t apply to them, or that they cannot control. If you can control it, work your ass off to change it to your liking. \n\nIf not, either find people who can change it, or ignore it. It’s not worth wasting breath or energy over.", "label": 0}
{"text": "I don’t remember the name of the film, but it was about a boy and his dog who got stranded out in the wilderness. The dog protected the boy and was only reason the boy survived long enough to be rescued. When rescuers did find them the boy got airlifted out and the dog got left behind. \n\nIt made 9yo me feel sick for days afterward.  Leaving the dog felt like such a huge betrayal it completely overshadowed the “happy” ending (with the dog somehow finding its way home out of the wilderness on its own.)\n\nOh yeah, and also the ending of Old Yeller destroyed me.", "label": 0}
{"text": "Living without worrying about rent, water food and wars", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nYour post has been removed as it violated [Rule 2](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_2-). Please check that your post doesn't contain the following issues:\n\n* **If your question is specific to your situation, or involves a story, please post your question somewhere else. If you're not sure where to post, take a look at the [list of related subreddits](https://www.reddit.com/r/AskReddit/wiki/sidebarsubs/) or ask for suggestions in r/findareddit.**\n\n* **Your post title cannot reference yourself in any way, including but not limited to having first person personal pronouns that reference yourself.**   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Looking into my grandfather’s eyes and having to act like everything’s normal in front of my family after I came to the realization that he’d sexually abused me my entire childhood.", "label": 0}
{"text": "I mean it does clearly say on your benefits summary if you have child or adult/child ortho. That one’s kinda on you homie.", "label": 0}
{"text": "my company is literally removing all java code from our products because of Oracle lol", "label": 0}
{"text": "Speaking as an advertiser, the service for us also sucks. On the plus side, if I spend 10 minutes clicking around through the support website, I have about a 50% chance of finding a button that will let me open a chat window to speak with a human, but it’s really the luck of the draw.", "label": 0}
{"text": "Nev-aye-ah I think.", "label": 0}
{"text": "Not a movie, but some of the popular SCPs, mainly 173. The thought of something suddenly being there, and you have to maintain complete visual of it or you die, even if it’s just a blink, would scare me. \n\nI didn’t fear the dark in particular, but I did fear what I could not see, with that not particularly being in the dark.", "label": 0}
{"text": "Orphan", "label": 0}
{"text": "Are you looking for a whole bedtime story?", "label": 0}
{"text": "Doordash and GrubHub\nThey rip off their customers, drivers, and restaurants", "label": 0}
{"text": "Agree 100%. Took me years to get it out of my head. Had nightmares, a huge fear of any unidentified loud noise, panic attacks and anxiety when being left alone at home... Had to go to therapy to realize I was dealing in fact with a religious trauma. Also only realized a couple years ago that I wasn't the only traumatized child it was shown to. There's so many of us, it's sad.", "label": 0}
{"text": "Our business involves going out a lot to shows and fair. The association and our own business has protection for weather damage as a lot of these venues are marquis outside.\n\nIn our earlier years, missing a show that would rake in £800 range could have quite possibly bankrupted us. So any protective insurance was a must. \n\nWe went out to one show that was beach side and the weather was predicted to be light rain and some wind. After setting up the Friday night we went back to our caravan and the weather turned horrendous. We didn't realise just how bad until the next day turning up at the venue. \n\nTo set the scene right\n\nStill storming, torrential rain fall, gale force winds. All the support ropes had been yanked from the ground or ripped in two. Some still had the metal anchors in that were driven over a meter into the ground. And they were flailing in the wind like it was nothing. They had that cliche whip crack sound effect but amplified 100 fold. One dude tried to reverse his landrover into marquis and a rope (thankfully one without an anchor in) whipped his back window and shattered it. Another managed to catch a rope and attached it to his tow, he had to abandon that pretty quick as it was physically pulling his vehicle \n\nNot only was that show obviously cancelled, but we lost in excess of about £1000 in stock as it was our 2nd biggest show of the year. We're all sat there like thank fuck for the dual insurance. \n\nSpeed up a few days later to claim. Ours and multiple others point blank refused to pay anyone, citing a storm doesn't count for standard weather damage, it counts as, and get this right \"An act of God\" and legally they were entitled not to pay out because the storm severity was out of reasonable foreseeable conditions. As I said, they were specialists in just offering weather insurance. And we're talking Wales, UK here so nothing crazy in the grand scheme of things. \n\nMy folks were stressed out their mind for weeks. Not just the value of stock gone and lost earnings. But back in those days we had a small standard hob. A batch of cooking was 4 small pans that took hours to cook. Each pan having a value of about £25 retail contents wise. So you can imagine how friken long it takes to build up a stock. \n\nThankfully, while we're a small business. The association at the time wasn't and the at the time current president was a retired lawyer and he was down for making it a long drawn out battle to cost them through the roof. A few months in and they agreed to pay out what their policy said we'd all get and we dropped the moment the cheques cleared.", "label": 0}
{"text": "They keep canceling dates", "label": 0}
{"text": "Pokémon", "label": 0}
{"text": "In biblical terms idols?", "label": 0}
{"text": "As someone who currently works in the industry you're absolutely right. Half of my coworkers talk like weed is gift from God and quote studies to our customers all the time about all the new benefits scientists are discovering. But we all know that a lot of these studies have small sample sizes and not often replicated to test their validity. \nNot to mention the industry itself (in CA anyways) is still pretty dirty and relies very heavily on the illegal market to stay afloat. I believe it was the LA times that published an article earlier this year exposing a lot of well-known weed brands for bribing testing facilities. So even weed from legal dispensaries may not be as \"clean\" as you think. We're all smoking and ingesting a lot more pesticides, heavy metals, mold, and other contaminants than we realize.", "label": 0}
{"text": "Takes exactly a lifetime", "label": 0}
{"text": "Essential updates and reboot", "label": 0}
{"text": "Walking I convince myself I’m walking weird and everyone can tell and they are all judging me 😂", "label": 0}
{"text": "What book do you recommend to people.", "label": 0}
{"text": "I think what stressed me out the most was that I used to work in DC, and during January 6th I recognized a lot of the hallways and buildings involved in what happened that day. I guess my problem is I don't trust people and it's probably from looking at the internet too much", "label": 0}
{"text": "watched it on acid, sounds terrible on paper… but, I highly recommended.", "label": 0}
{"text": "Predator. I was six even we watched it. Nightmares for weeks on end.", "label": 0}
{"text": "The first 3 Spider-Man movies with Tobey Maguire.", "label": 0}
{"text": "God that must’ve been terrifying! I Hope everything ended up being okay?", "label": 0}
{"text": "Ticketmaster owns Stub Hub which is owned by Live Nation...there's no where to run.", "label": 0}
{"text": "I felt like it was a good idea to read this book when I was 7. I thought I was cool for being an advanced reader... nope. Only got a few chapters in. Was afraid of water in the gutters until many years later. \n\nMoved on to read Congo right after and, well that was better but still scary. I dreamt about a gorilla smashing my eyeballs into my head with its thumb for quite some time. Decided to read R.L Stine and crap like that for a while.", "label": 0}
{"text": "the ring.. had me terrified to take a bath 😭", "label": 0}
{"text": "Do they still do the thing where everyone that starts there is just going to be washing cars all day?  I applied for a position there eons ago and got an interview (they seem like they're hire just about anyone), but didn't go when I learned about the car washing thing.", "label": 0}
{"text": "no i like goatees my beard is just better.", "label": 0}
{"text": "My girlfriend calls me gay when I suck her cock.  The nerve!\n\n(It's obviously a joke, I love the heck out her silly self <3 )", "label": 0}
{"text": "Original war of the world's..  i was 6", "label": 0}
{"text": "Meanwhile I am using it more than ever. My neighborhood has an active residents only group. It's the first place to check if your dog digs under the fence and gets out. \n\nAlso it's how I learned about the neighborhood hot dog cook out and food drive tomorrow that funds the neighborhood Christmas parade.", "label": 0}
{"text": "Playing background music is pretty soul draining. Not as much as having nobody at all, but it's not that much better.", "label": 0}
{"text": "We basically have to ditch all the names of these illnesses & make up new ones cause people have ruined them lol \n\nThe depression label is the worst. Depression is not just being sad, it’s so much more than that. But it’s understandable people would think it just means you’re sad, cause that’s the typical definition of the word depression.", "label": 0}
{"text": "Trilogy of Terror. Particularly the animated doll.", "label": 0}
{"text": "I'm probably close to hitting there myself. I'll check back in a few months and let you know lol.", "label": 0}
{"text": "r/sillyconfession and r/dailychallenge", "label": 0}
{"text": "yeah and always remember to shop around.", "label": 0}
{"text": "Paramount plus", "label": 0}
{"text": "18", "label": 0}
{"text": "Qantas", "label": 0}
{"text": "Same. This movie in particular seems very polarizing, it either scares the crap out of you, or you find it hilariously bad and laugh through it.\n\nI like to immerse myself and I also found the scenes to be in a realistic way to where I could make myself believe during the watch. Lets just say the next few nights I heard every noise at night time, and looked everytime I thought I felt my blanket move....", "label": 0}
{"text": "Coroline and Monster House", "label": 0}
{"text": "KIA, 100%, KIA.", "label": 0}
{"text": "War Thunder — Aircraft Arcade— I’ve been playing this one game 8 years maybe?  I haven’t earned Terror of the Sky in awhile—but I’m getting locked in.  I’m 73. 😅", "label": 0}
{"text": "Hey family name is Wanker.", "label": 0}
{"text": "A.I. Artificial Intelligence with Haley Joel Osment. The part where he was eating food and broke, and the bit with the execution of androids with the molten steel really messed me the fuck up.", "label": 0}
{"text": "Honestly soup making pretty bi coded", "label": 0}
{"text": "It’s hard to say. I’m not the kind of person that gets adapted into things, I’m not very interesting in any capacity.", "label": 0}
{"text": "i was scrolling to find this one, i literally ended up choosing chocolate and mint 90% of the time cause both of them are just like \"but if i would test out this other flavor i can't get that one\" lol \n\nhoweverrr i'm actually vegan now so lately i chose fruitflavors - fine by me, they're great actually! i'll find a vegan mint one in some onlineshop if i have to and i can still get chocolate in supermarkets and sometimes specific icecream parlors have it too (seldom but i had it in one about two months ago and that wasnt a huge city)", "label": 0}
{"text": "??", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nYour post has been removed as it violated [Rule 2](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_2-). Please check that your post doesn't contain the following issues:\n\n* **If your question is specific to your situation, or involves a story, please post your question somewhere else. If you're not sure where to post, take a look at the [list of related subreddits](https://www.reddit.com/r/AskReddit/wiki/sidebarsubs/) or ask for suggestions in r/findareddit.**\n\n* **Your post title cannot reference yourself in any way, including but not limited to having first person personal pronouns that reference yourself.**   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "That’s where I’m from 😆", "label": 0}
{"text": "r/sillyconfession and r/dailychallenge", "label": 0}
{"text": "There's like a 10-hour loop of \"It's Doc Gerbil's World\" somewhere on YouTube. That song still gets stuck in my head from time to time.", "label": 0}
{"text": "annoying people", "label": 0}
{"text": "Return to Oz", "label": 0}
{"text": "And the amount that YOU, the pharmacist/pharm tech get screamed at because of what these insurance companies do, merely because you're talking about the person who will be angry about it at the time you inform them they have something to be angry about, is limitless. \n\nI hate it.", "label": 0}
{"text": "Mayflies for sure. ", "label": 0}
{"text": "Is illustration a computer program?", "label": 0}
{"text": "Lol this is that cringe Reddit behavior people always make fun of on other sites but I rarely get to see first-hand.", "label": 0}
{"text": "We use it for process mapping and it's so limited vs the competition ", "label": 0}
{"text": "Frontier Airlines", "label": 0}
{"text": "Juggling...or break dancing!", "label": 0}
{"text": "This is why I always try to be nice when I have to call Medicaid or Social Security for something. You folks have the shittiest job ever and zero control over policy or approvals. The least I can do is avoid making your day any worse.", "label": 0}
{"text": "They still have customers? Why?", "label": 0}
{"text": "Nba basketball", "label": 0}
{"text": "Stock was up big the other day, I don’t get it", "label": 0}
{"text": "I once heard that we measure how fast life goes by memories. The more memories you make, the faster it is going. Let’s spend our time wisely folks, because life is like a train. It is long but it moves pretty fast.", "label": 0}
{"text": "Quit a job after two hours lmao", "label": 0}
{"text": "They are always the ones who try to boast and instigate to try and maintain their ego that they feel may be in danger.", "label": 0}
{"text": "12 steps, sans religion. w/ codependency segment", "label": 0}
{"text": "Burger King for the whopper, everything else for Mickey Ds.", "label": 0}
{"text": "Tales from the Darkside, that movie from 1990, specifically the story about the gargoyles. I was maybe 5 or 6 when it came out and I was not prepared to see that.  I was petrified of my closet and was convinced one of those gargoyle things was in there at night.", "label": 0}
{"text": "That was genuinely awful to read. I read the first 50 or so, then skimmed, and then just abandoned it. What an awful event.", "label": 0}
{"text": "My parasitic twin", "label": 0}
{"text": "My bf and my cat", "label": 0}
{"text": "r/sillyconfession and r/dailychallenge", "label": 0}
{"text": "Humans.\n\nWe can barely survive in earths biosphere without harvesting plants or animals and using their parts to protect us from the environment.", "label": 0}
{"text": "LOL - I saw The Exorcist at 6 years old, in the movie theater. My dad called me a sissy for having nightmares about it for a month.", "label": 0}
{"text": "$200 dollars on the slot machines. Don't remember the exact name of the game, but it's the one with the buffalo.", "label": 0}
{"text": "It's a freaking free download on their website, you don't even need a login. That's just ridiculous if your browsing a website and click a link to try out some software and then get a lawsuit. Like wtf. \n\nEven if they were using it just ask them to pay for it like every other company in the world.", "label": 0}
{"text": "A friend of mine is currently going through ethics and compliance with a list against one of her shifts because a certain store manager of theirs decided that nit picking and talking down and basically forcing them to be a robot \"isn't bullying or harassment and they can deal with it\"\n\n\nSo she's dealing with it through corporate who seem to think otherwise if she's right from eavesdropping.", "label": 0}
{"text": "Most airlines, for continuing to squeeze customers and give less and less, while charging more and more", "label": 0}
{"text": "Vacuum hose. A bet’s a bet.", "label": 0}
{"text": "The exorcist", "label": 0}
{"text": "Reddit", "label": 0}
{"text": "Good. \n\nGraduated college, full time position, and looking into housing options slowly. \n\nIt’s not as terrible as the news and stuff makes it. I’m really glad to be a “younger” adult in this new world. I’m excited to see where the next 10-15 years go.", "label": 0}
{"text": "Cars...", "label": 0}
{"text": "I keep my calendar stocked with tiny things I'm looking forward to and whenever I feel like dying, I look at it.", "label": 0}
{"text": "Ironically, “Kids”. Harmony Korine man.", "label": 0}
{"text": "I had the same experience recently.went online, reserved a van to take a group to an event 300 miles away. I got an inkling to double check so i called a couple days before. The employee told me they didnt rent vans at that location. I said i have a confirmation number blah blah blah. She said the online system will confirm anything and it is meaningless. WTF is that????? Thank god i called beforehand. Never enterprise. Done.", "label": 0}
{"text": "When I was a kid", "label": 0}
{"text": "I maintain this movie is just unnecessarily cruel. It just wants to torture the audience, not just make them sad.", "label": 0}
{"text": "Yeah, I'm a heavy Power BI user and it's the one Microsoft product I truly enjoy. Tons of resources as well.", "label": 0}
{"text": "Amazon delivery drivers", "label": 0}
{"text": "Same about the bear scene. I didn't know anything about the sexual part of it, but just seeing that bear out of nowhere, with to me, absolutely ZERO context, was just like a weirdly ethereal horror that I can't place my finger on how to describe correctly. Just menacingly out of place.", "label": 0}
{"text": "The only thing that's ever helped me know my team better was a Jeopardy style game where your table was a team and tables took turns trying to figure out which person in the room matches the \"fun fact\" behind each clue.\n\nEverything else is trash", "label": 0}
{"text": "Two minutes to midnight", "label": 0}
{"text": "r/sillyconfession and r/dailychallenge", "label": 0}
{"text": "Are those records on your fingers?", "label": 0}
{"text": "Nintendo to a certain degree. They openly defy piracy and emulation (especially with the SNES display at the gaming museum being allegedly emulated). They have an eshop to buy games from previous consoles that people want to play again. But their library of games on the virtual console is limited.", "label": 0}
{"text": "Ferrari", "label": 0}
{"text": "what if ma friend zone??😭", "label": 0}
{"text": "Tim Hortons", "label": 0}
{"text": "Not just neglecting your perspective, but refusing it.\nBonus points if they poke holes in or taunt what they did listen too.\n\nThis isn't even just for significant others. This is anyone you have any kind of relationship with. If you sharing your feelings, no matter what the kind or extreme, results in you being shut down or made fun of by that person; they don't love you so don't waste your love on them.", "label": 0}
{"text": "Knowing that suicide is what they want.", "label": 0}
{"text": "Relationships.", "label": 0}
{"text": "Do not thank them lol", "label": 0}
{"text": "It, I can't look at clowns like I did before that movie.", "label": 0}
{"text": "My mom. She has had too much loss and I couldn’t do that to her.", "label": 0}
{"text": "My step daughter in September of 2021 had a mental breakdown. Her husband called 911 and the police and an ambulance showed up. Stepdaughter was taken to ER then admitted to psych ward. She was then moved to a psychiatric hospital. After she was discharged she continued going daily for therapy. After a total of 5 months her insurance said they wouldn't pay for any more therapy. 3 doctors called on her behalf trying to get the insurance to change their minds. They refused. Less than a month later my step daughter has another breakdown. Once again she was rushed to the ER and after that the insurance company agreed to keep paying for her therapy. \nA few months later our youngest daughter was called to jury duty ina case involving an insurance company. She told them what had happened to her older sister and that she was convinced insurance companies were only out to make profits and don't give a damn about the people. She was dismissed. As she walked out she heard the judge let out a big sigh. \nInsurance companies don't give a damn about people!", "label": 0}
{"text": "Not only that, they're fucking horrid as an IT customer using your products. HORRID. And demanding without regard to the reality of the situation.", "label": 0}
{"text": "That's what my old boss told me. He said for what you pay in, it covers so little once you actually need more than a cleaning that it's not worth it. You might as well just pay straight up if you need something and save the rest of your money.", "label": 0}
{"text": "I rewatch many horror movies, I will never watch that one again. So fucking unsettling and just makes me feel sick to think about it.\n\nToni Collette is way too good an actress to be allowed in that role... I still tear up when I remember her scream of grief and horror.", "label": 0}
{"text": "I think Jason Pargin has my favorite take on Funny Games \n\n  \n[https://www.tiktok.com/@jasonkpargin/video/7426906411256352030](https://www.tiktok.com/@jasonkpargin/video/7426906411256352030)", "label": 0}
{"text": "Empathy", "label": 0}
{"text": "Dante's Peak \n\nIn the opening scene, the protagonist's wife is struck in the skull by a volcanic rock through the roof of their car and killed, seizing slightly as she dies.\n\nI have lived with a mild phobia of head trauma ever since.", "label": 0}
{"text": "I always wanted to get in a bar fight, then I got into a bar fight and spent a week on the hospital and months in physical therapy.", "label": 0}
{"text": "Grew up in NYC, so I think I would hit the character limit here.", "label": 0}
{"text": "Wendy’s", "label": 0}
{"text": "Anheuser Busch", "label": 0}
{"text": "los gatitos son los más lindos🥰🥰", "label": 0}
{"text": "The economy. It's fine. No, you can't make it as an unskilled laborer anymore. So what? Get good at something.", "label": 0}
{"text": "Best Buy. They used to be amazing. Now, they don't even have an email option. Their phone customer service is offshore. You cannot call a local store (or even be transferred to one). Their return policy is 15 days unless you pay for a membership. They even outsourced Geek Squad to random locals for things like TV mounting.\n\nIt is horrible. But who can you complain to? You can never reach a supervisor.", "label": 0}
{"text": "Dreamcatcher. I was so scared to use the toilet after that.", "label": 0}
{"text": "Sony Entertainment Network\n\nJust had to kill Helldivers to ensure that ***~~PS3~~*** ***PS5 HAS NO GAMES!***", "label": 0}
{"text": "Oh man, try hanging out in the classical music world, where anyone who ever saw Amadeus thinks that you have to be perpetually on the brink of financial ruin and/or die young. No. Haydn lived with and worked for a prince. Tchaikovsky had a benefactor. Brahms and the Schumanns were perfectly successful teachers, and Clara concertized everywhere. Handel was practically a God in England. Bach had steady work in a church. None of these guys fell prey to the idiotic idea that you have to suffer.", "label": 0}
{"text": "It wasn’t the handle! I have been shitting pancakes ever since!", "label": 0}
{"text": "I bought pet insurance when I got my Golden because why not right? Had to take him in and thought all would be good. After 3 months of arguing with them I just gave up, ate the cost, and cancelled my plan. They did everything in their power to make it as difficult as possible for me to file a claim and then when I filed it they kept declining it and I kept showing them their own coverage plan I had and where I was covered and we'd restart. This was through nationwide as well, bunch of fucking crooks.", "label": 0}
{"text": "Splice traumatized me as a young adult \n\nI can't think of one that did as a kid, but I can say that I hated westerns with a passion. I still do.", "label": 0}
{"text": "America", "label": 0}
{"text": "No. I’m a gay guy. I love lots of women, and I tell them. I tell everyone I love that I love them.", "label": 0}
{"text": "  My bones are weakened from a chronic condition and I tried to lift something heavy when I wasnt feeling up to it. \n\n\n  It felt exactly like swinging an aluminum baseball bat into a steel pole as hard as possible. For some reason it also sounded like that and my ears rang like a bell.", "label": 0}
{"text": "A rubber glove blown up to be a butt", "label": 0}
{"text": "“If you can read this, you don’t need glasses”", "label": 0}
{"text": "The Healthcare system.", "label": 0}
{"text": "A cat sized rat somehow found its way on board a subway train. A guide dog growled at it and the rat ran like a chicken with its head cut off, sending everybody screaming and dodging.", "label": 0}
{"text": "I fucking despise Delta Dental.", "label": 0}
{"text": "Eons is great. I just discovered it recently.", "label": 0}
{"text": "Fantasia. idk why, but Chernabog scared the fuck outta me.", "label": 0}
{"text": "Pet Semetary", "label": 0}
{"text": "Theif “customers” are shareholders. So they like them a lot.", "label": 0}
{"text": "Nothing.", "label": 0}
{"text": "Marriage. \n\nIt’s work. Hard work. And that doesn’t mean it isn’t also enjoyable and fulfilling. But it’s not just being with your “best friend, soulmate” garbage I see so many people say it is. It’s so much more than that and many people aren’t prepared for it.", "label": 0}
{"text": "Humility", "label": 0}
{"text": "I have never heard of this. What is it?", "label": 0}
{"text": "The Omen.", "label": 0}
{"text": "Maryanne Dashwood - Sense and Sensibility. I always fell hard and wore my heart on my sleeve.", "label": 0}
{"text": "Promoting bar crawls. So many alcoholics I. This world why keep promoting it?  People will spring regardless but let’s not encourage them to go from bar to bar possibly being irresponsible and reckless. Won’t even go into driving home after’sobering up’.", "label": 0}
{"text": "Wow. Just wow.", "label": 0}
{"text": "Cable and satellite TV companies.", "label": 0}
{"text": "A really crazy artist girl named Kira", "label": 0}
{"text": "Cancer", "label": 0}
{"text": "Hospitals. Some doctors are great. Some doctors make me think the devil wears a lab coat.", "label": 0}
{"text": "What people really want to know is which one of you was the more popular brother in highschool.", "label": 0}
{"text": "\\>misunderstanding\n\nAlso known as going down the MAGA rabbit hole.", "label": 0}
{"text": "The ghoulies fucked me up too honestly. I was afraid of going to the bathroom for years as a kid. I think I watched it around the age of 5. I always tried to go to the bathroom as quick as I could, because I literally thought something was going to come up out of the toilet. Always closed the toilet seat too to make sure nothing would come get me while washing my hands after using the bathroom.", "label": 0}
{"text": "I scrolled all the comments to find this one. Yessss and it wasn’t just Large Marge that scared me. Lol", "label": 0}
{"text": "kittens are the cutest", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nYour post has been removed as it violated [Rule 2](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_2-). Please check that your post doesn't contain the following issues:\n\n* **If your question is specific to your situation, or involves a story, please post your question somewhere else. If you're not sure where to post, take a look at the [list of related subreddits](https://www.reddit.com/r/AskReddit/wiki/sidebarsubs/) or ask for suggestions in r/findareddit.**\n\n* **Your post title cannot reference yourself in any way, including but not limited to having first person personal pronouns that reference yourself.**   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "As a dumb little girl, I severely blocked my nose and had to get surgery when I shoved a mint up it because I wanted to see if I could.\n\nI was 17.", "label": 0}
{"text": "Hmm. Again, I am not a professional by any means. \n\nSo in those stories I feel your deep pain friend, and I'm so sorry you are hurting so badly. I see you. But if I can presume, I also see a family friend who moved in to keep you alive. I see a wife and sister who made the painful choice to get you help when they couldn't keep you safe. I know it may have felt like a betrayal, but their love for you meant that the fear of you hurting yourself was stronger than their respect for your wishes of staying out of the hospital. With the limited information I have, I would have done the same thing. I see 7 people at the door trying to convince you not to hurt yourself. All of those people care about you profoundly. Your dogs certainly love you. And the strength left your arm for a reason. You aren't done here, and you know it. You are just tired of hurting. \n\nSo then the question is, why is the saboteur so convincing at telling you that you aren't loved, and blocking those feelings of love from reaching you? What those voices in your head tell you does not necessarily match reality. They are telling you what they are afraid of, not what is real. \n\nI also think, maybe consider what you are asking of others - what do you need from them? Is it possible for them to give it? If what you want from them is to make you feel better, that isn't something they can do until you are ready to receive it. And if you have loud, powerful saboteurs yelling in your ear that no one loves you and you aren't questioning them, you may not be ready to receive that yet. Emphasis on the YET. There is hope for you, and the tide can turn faster than you would believe. Do you have support? A therapist?", "label": 0}
{"text": "They're immediately all prevented from leaving. The first death of their crew happens like a minute after this exchange.", "label": 0}
{"text": "I loved *totally*  not stealing from them. And I *totally*  did not steal hundreds of dollars worth of items.", "label": 0}
{"text": "No, Ticketmaster/Live Nation does not own Stub Hub.", "label": 0}
{"text": "You're not their customer, your employer is their customer.  That's the #1 problem with US Healthcare.  The patient is nobodies customer.", "label": 0}
{"text": "The Chicago Transit Authority.", "label": 0}
{"text": "Guns and ammo lol", "label": 0}
{"text": "Only my wife knows…\n\nI can imitate most voices after hearing them a few times.  If I’ve talked to you on the phone I could call someone and probably convince them I was you.\n\nI mostly use it for cartoon characters though and making my wife laugh.", "label": 0}
{"text": "And still got his ass kicked by a dude from Texas. Fuck yeah, Murica!", "label": 0}
{"text": "So tired of them discontinuing everything we buy.", "label": 0}
{"text": "I got to see them this year! Beautiful. Now I've seen meteors, the International Space Station, and Star Link. But I was unsuccessful with the last 2 comets.", "label": 0}
{"text": "If I had a family of 4, we'd fly to South Korea having fun cooking dog meat, and we'll make *Bosintang*.", "label": 0}
{"text": "Don't take it for granted. Little fights add up over time.", "label": 0}
{"text": "Frozen cream isn't ice cream though. It's frozen cream.", "label": 0}
{"text": "Tiger Tail is amazing", "label": 0}
{"text": "Dude you have strong protective and survival instincts. \nGlad both of you came out alive.\n\nWhat happened to the car and your parents reaction after?", "label": 0}
{"text": "You'll poop as you're giving birth.", "label": 0}
{"text": "Uh... do men actually do that?", "label": 0}
{"text": "I once had a coworker decide to talk about a time where she got really high at a concert during our first week of training.", "label": 0}
{"text": "Birds and psycho.", "label": 0}
{"text": "How tall they are.  Being 6’3” I get excited to meet taller folks.", "label": 0}
{"text": "United Airlines", "label": 0}
{"text": "A lemon perfectly situated in an empty seat as if it was a passenger. Tokyo.", "label": 0}
{"text": "thank you so much for this!!", "label": 0}
{"text": "Cliffhanger. Movies need to show how evil a villain is sometimes but man this one just goes all out over and over and over. It's just disgusting. Dad got it home and mom regretted it. Sent us to our rooms.", "label": 0}
{"text": "Does using a Mac count? Only ever used MacOS at my last job and got quite handy with it. Lowkey loved Automator and the multiple-desktops. Fast-forward a few years and I'm still being asked for key-shortcuts and tips for using it more efficiently, lmao.", "label": 0}
{"text": "My antimalarials were more expensive with insurance ($900?) so I went with GoodRX (~$500 iirc.) Incensing.", "label": 0}
{"text": "Not putting out.", "label": 0}
{"text": "learning skills. i want to be very good at learning new skills and improving skills. some people genuinely do things for the first time and are instantly just insanely good at it every time and i dont fucking understand how they exist.", "label": 0}
{"text": "No small talk and keep your distance", "label": 0}
{"text": "r/marfans ", "label": 0}
{"text": "For me it was 3 movies Grizzly, Cujo and Man's Best Friend.\n\nI already had a dog phobia as a kid by getting attacked by a German Shepard when I was 5 so the dog movies even as a teen messed me up and now at nearly 30 still really unsettle me.\n\nGrizzly I first saw at like 9. I could generally handle animal horror movies really well. Was watching things like Deep Blue Sea, Jaws, Python etc from a young age and it never bothered me but those three still haunt dreams occasionally.", "label": 0}
{"text": "Same except they came to where I worked from Ticketmaster", "label": 0}
{"text": "It's dark out. I'm on holiday in Costa Rica and spent most of the day at the beach", "label": 0}
{"text": "Bethesda.", "label": 0}
{"text": "She told me after 4 years that she never liked me and that I was ugly", "label": 0}
{"text": "I'm a middle aged man. I still like cartoons. I make no apologies.", "label": 0}
{"text": "I’m just gonna say it: I don’t particularly care for serial killers! And you can quote me on that", "label": 0}
{"text": "Her face?", "label": 0}
{"text": "My situationship that ended in April of 2023. He was the best friend I’ve ever had in someone I was romantically involved with. We had the same sense of humor. I knew I could say whatever popped into my head and not be judged. We giggled together constantly. He didn’t want a relationship at the time because he wanted to date around and figure out what he wanted before committing to someone (which was fair because he’d only had 1 serious relationship and so had I) but I had feelings and didn’t see how we could be “just friends”. We were never “just friends” so I couldn’t see how we’d make that work or what would happen if one of us got into a relationship. I was terrified he’d get into a relationship and then ghost me because his new girl wouldn’t want him being friends with someone he had a history with. I broke things off with him and went no contact because I figured that would be less painful than becoming friends and losing him later on. I know he’s in a relationship now, and I was in one for a while too. But I haven’t found that level of friendship and comfort with another person since. I still hope he’s well and selfishly hope the universe forces us to run into each other some day", "label": 0}
{"text": "i don’t want my kids to be orphans.", "label": 0}
{"text": "This was my immediate first thought", "label": 0}
{"text": "1997’s “My Teacher Ate My Homework.” \n\nrented at the local VHS store thinking it was a funny family movie. scared the daylights out of me and my best friend (I think we were 10?) and made me scared of dolls for life.\n\nneed to rewatch now though because it apparently features Shelley Duvall!", "label": 0}
{"text": "I really feel someone should take them to court on that. \"Misleading\" doesn't begin to describe that branding.", "label": 0}
{"text": "Thanks. It’s not even the American election,(although that’s fucking me up too) but it’s a similar situation.\n\nOur right wing idiots want the same awful shit the Republican’s do and our moderates do the same stupid shit that gets them tossed out after 3 elections.\n\nSiiigh.", "label": 0}
{"text": "Well, you did say you're not a dreamer.", "label": 0}
{"text": "Nothing is better than the Big Mac and McDonald’s fries with a coke.", "label": 0}
{"text": "Hell no", "label": 0}
{"text": "All of them, the distain is palpable in every store", "label": 0}
{"text": "We aren't so much into tourism. But it's important they respect rules like everywhere.", "label": 0}
{"text": "Don't stop me now \nBohemian Rhapsodi\nRadio Ga Ga\n\nI love Queen", "label": 0}
{"text": "Of course they are. That's why they \"steal\" Free Open Source Software and then provide shit support for it as compared to (many of) the actual creators of the FOSS they utilize.", "label": 0}
{"text": "That was mine, I am so sorry I forgot to fill it back up", "label": 0}
{"text": "Good grief - I totally thought you were making a silly joke about “size” by replying Siamese similar to “size-a-mese” 🤦🏻‍♂️\n\nGlad you were able to work it out and sounds like a good landlord.", "label": 0}
{"text": "no I meant draw like detailed pictures of things maybe make drawings on how to build something or schematics of things", "label": 0}
{"text": "A blender. Good thing I’m a grower. Just had to stay soft.", "label": 0}
{"text": "oh every day is an eternal and internal struggle with my self. i have crippling anxiety. ive had years where i couldnt leave the house. im a lot better now though its still hard but im stronger than i was then.", "label": 0}
{"text": "The exorcist", "label": 0}
{"text": "Hush....Hush, Sweet Charlotte\n\nAs a  kid, I saw it with a group of friends at a drive-in, sitting on a blanket next to the car. Have never scrambled so fast to get back in a car when the ax came down, again and again...", "label": 0}
{"text": "He also told Henry Ford Jr. that he made ugly cars. So Ford decided to kick his ass in the most humiliating way possible.", "label": 0}
{"text": "The ones that go to the hospital afterwards and have to awkwardly explain what happened", "label": 0}
{"text": "Any “bonding” past 5:00pm (honestly 4:00pm). If you want to do happy hour, make it 2-4 with an hour off for morale. \n\nThe second 5 hits traffic is now worse than it normally would be and I can only talk about SNF and politics for so long. \n\nAlso I really do NOT care about your weekend plans. We get it, you love brewery’s.", "label": 0}
{"text": "Good!", "label": 0}
{"text": "I've worked in insurance for 6 years. I've seen thousands of claims denied (and many more approved!) Out of those thousands I think maybe 10 were a bad company call that I disagreed with as a human with empathy. The rest were from the insured not understanding their insurance.", "label": 0}
{"text": "My peace. To hell with anyone and anything that would cause me to step outside of that.", "label": 0}
{"text": "Do you remember what he said? Asking for a friend...😅", "label": 0}
{"text": "What?!  No!  Say it ain't so!", "label": 0}
{"text": "\"peperony and chease\"", "label": 0}
{"text": "Fire in the Sky", "label": 0}
{"text": "I enjoyed the lack of responsibilities and not having to worry about money, etc. but when I think about it, I prefer having determination over my own life. I wouldn’t trade it to be a kid again.", "label": 0}
{"text": "I appreciate the examples, thanks", "label": 0}
{"text": "They just stir up the anger every time. Then I gotta go pet a cat, which is obviously a HUGE hassle /s.", "label": 0}
{"text": "Just like the military said we had aliens in our midst, when Elon musk had an unimaginable jet fighter!  USA", "label": 0}
{"text": "\"America: No Monopolies\"? Oh they got this all screwed up.\n\n\"America? No! Monopolies!", "label": 0}
{"text": "My rubber snake from 13 or 14 years ago. It's a good snake, I swear!", "label": 0}
{"text": "And an unannounced visitor.", "label": 0}
{"text": "As a dev, I could build 50 phishing websites and steal information, credit cards, potentially trick others into giving up their bitcoin, etc.\n\nIf this were \"legal\" you can bet a large part of the population would try it too, even though it's morally wrong.\n\nMany \"successful\" people have the same mentality. \"Paying people very little for their work isn't illegal! That's capitalism!\". Of course the biggest players are breaking the law all the time, but by that point they're untouchable anyway.", "label": 0}
{"text": "Other goods / services. I think a barter system would be ideal", "label": 0}
{"text": "Yes, I watched the whole series as a kid. The first 2 movies traumatized me. The little boy w/ the red balloon and the guillotine......ugh. 30+ yrs later and I can still remember how it jacked me up", "label": 0}
{"text": "My two daughters. And the fact that they’re so little that if my depression won they wouldn’t have a memory of me. That’s what keeps me going.", "label": 0}
{"text": "Echidnas", "label": 0}
{"text": "Yes, you can heard him cry over her passing. I named a set of foster kittens little foot, spike, cera and Ducky. They were set for euthanizing at the shelter and I foster failed Lucky Ducky, oh yes I did yup yup yup. I hug her extra everyday.", "label": 0}
{"text": "Yeah you should have told him he needed King's Cross station.", "label": 0}
{"text": "Return to OZ", "label": 0}
{"text": "Nah it was a hardtop, Midnight blue with a black roof. I sold it last year after having it 17 years, sad day", "label": 0}
{"text": "So they fired most of their staff during the pandemic?", "label": 0}
{"text": "First off, didn't realise it would be so long!\n\nI wouldn't call it a horror (we'll I have 3 for various reasons, but the first two are for pretty much the same reason. However the third, even though it has a similar theme, is one of my favourite horrors because of its style and horrific story that is a study of a serial killer.\n\nGrotesque is a Japanese torture porn movie that took the idea of hostel and went all... well Japanese on it.\n\nThe second is August Underground.\n\nThat did the same thing but went American Teens.\n\nBoth movies are basically a movie about 1 or 2 guys torturing some poor souls.  They don't escape, there is no hope nor release (though if iirc August Underground has somewhat if a imagination ending, buy I honestly forget) the reason I forget about A.U. is because at least with Hostel one if the victims was going to get away, there would be the climactic triumph over adversity and the sole survivor walks away, changed forever.\n\nNope. Not with these two, it was just people being tortured to death.\n\n\nWhich takes me to one of my top 10 possibly top 3 horrors.\n\n\n(Forgive the spelling if autocorrect doesn't pick it up)\n\nThe Poughkipsie Tapes.\n\nThe tell the story in a documentary and found footage style of the victim of a serial killer who records all his kills, but keeps one captive.  I'm not going to spoil this because it has a very twisted ending and I found the cat and mouse games the killer played were something else.\n\nThough the themes are the see, Grotesque, and August Underground are for shock value only and have no story nor plot, and the movie itself stay with you for a while as a lot of what you see is just fucking barbaric.\n\nWhereas TPT is a study of murder, obsession, black humour, mystery all wrapped up in 1200 video tapes (the movie will give the reference)\n\nI would recommend The Poughkipsie Tapes to any horror fan.", "label": 0}
{"text": "Graham Cracker\n\n\n\n\nIt's so damn good, but hard to find", "label": 0}
{"text": "This thing came from Bosnia, son! You ever been to Bosnia? You ever been in the shit?", "label": 0}
{"text": "Trying to think of anyone, real or otherwise, that I can relate to anywhere near as much as I do *Thana* (from a movie I can't even abbreviate) is difficult, and she's probably inappropriate to say since that might be mistaken for my agreeing with her actions in the film. So maybe Faora -- no, that doesn't work, they completely waste her best quality in the live action movies. Um, **Carole from Repulsion** isn't too inappropriate to say or wasted. Yes, I'm in the mood to *say* Carole ... publicly. Or 99 percent of the population from a 1999 TV movie that I'll just abbreviate out of embarrassment; TLMOPE.", "label": 0}
{"text": "I didn't even know he wrote one. I will seek it out immediately.  Thank you.", "label": 0}
{"text": "Climbing trees and swinging high on swings without judgment", "label": 0}
{"text": "Those tooth flossers with the picks are amazing for cleaning the nose pieces on your glasses. It gets all the gunk out.", "label": 0}
{"text": "EA. Ubisoft too. Video game companies reveal who they are when they get a bomb of a game. Many immediately blame and complain about “gamers” instead of analyzing what they may have done wrong.", "label": 0}
{"text": "\"New England\" was a thing long before they declared independence from \"Old England.\"", "label": 0}
{"text": "Not to mention when they are based abroad, they're just out right scam artists. My exs family had a villa in another country as a 2nd home. Every. Fucking. Time. We rented a car, we had to pull them out multiple times to point out they missed highlighting existing damage on the cars paperwork. We used to have to stand over them pointing out every single scruff and video record the entire ordeal. \n\nOne time, we actually did fuck up and drove to close to a wall and took the wing mirror out. Taking a chance we took it to a local garage, laughed and said half his day custom is people doing this. One day later replaced wing mirror, all evidence cleared up and he even went on to bump out some of the dents from other people who had rented the car and cleaned / waxed it for a finish. \n\nTook it back the cheeky fucks tried to fine us for damage in every spot BAR the wing mirrors saying it came back in a different condition.", "label": 0}
{"text": "McDonalds: How to multitask.   \nMotel: How to clean fast & efficiently.   \nDollar General: How to deal with unpleasant people in a courteous manner.  \nPub: How to mix drinks & a lot of my cooking skills.  \nCall Center: Salesmanship.   \nWarehouse: How to properly stack things to make the most efficient use of space.  \nSecurity: Observation skills. \n\nVarious trades: Enough skills to renovate my home by myself.", "label": 0}
{"text": "Comcast/Xfinity", "label": 0}
{"text": "Any insurance company.", "label": 0}
{"text": "NOT HAPPY, JAN!\n\nThe Aussies will get it...", "label": 0}
{"text": "Bald eagle. Protected and I get to fly around. I would do alot of sight seeing.", "label": 0}
{"text": "In California -- PG&E aka the Devil", "label": 0}
{"text": "Don't let it stress you. Remember the motives of the people that are giving you the info. The news and internet what's to hype it so the can sell ads against it. The Dems want you to think the Republicans are evil and the Republicans want you to think the same about the Dems.\n\nThey all spin and twist stuff and none of them are honest.", "label": 0}
{"text": "Is it okay to like Java though?", "label": 0}
{"text": "Go to the bar, act like you're tired of your job, talk to someone and come up with totally different personality, like mossad agent or sociologist.", "label": 0}
{"text": "Ah, I see. I interpreted that as freshly made espresso.", "label": 0}
{"text": "Hotels walking people isn't just about overbooking to cover no-shows. Travelers with status at the big chains have a guaranteed availability benefit and when someone uses it, the lowest booked guest on the totem pole is shit out of luck \n\nMy Hyatt status gives me 48 hour guaranteed availability. I can have a base level room at any sold out Hyatt as long as I book at least 48hrs before check in and whoever is on the cheapest rate that booked third party gets to give me their room and stay somewhere else. Price is rack rate so it's quite expensive to do this and I've never actually done it because it's always way cheaper elsewhere, but there are definitely people who use the shit out of the benefit", "label": 0}
{"text": "My home country does this crap too especially in rural areas. At some point they were even normalized in some movies.  Truly WTF scenario", "label": 0}
{"text": "Um… what?", "label": 0}
{"text": "Not mine", "label": 0}
{"text": "T-Mobile.", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nYour post has been removed as it violated [Rule 2](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_2-). Please check that your post doesn't contain the following issues:\n\n* **If your question is specific to your situation, or involves a story, please post your question somewhere else. If you're not sure where to post, take a look at the [list of related subreddits](https://www.reddit.com/r/AskReddit/wiki/sidebarsubs/) or ask for suggestions in r/findareddit.**\n\n* **Your post title cannot reference yourself in any way, including but not limited to having first person personal pronouns that reference yourself.**   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Electric guitar", "label": 0}
{"text": "I was just thinking about this. I think just: Finally!", "label": 0}
{"text": "y'all gonna have to elaborate on this one cause they were one of the better places in Atlanta", "label": 0}
{"text": "“Oh shoot hunny that was the turn”", "label": 0}
{"text": "The Exorcist. Being about 7 and watching that movie... Not a good combo.", "label": 0}
{"text": "Hella lotion in a sock stuffed between the mattress and a soft part of the box spring as a preteen", "label": 0}
{"text": "Chopper Chicks from Zombietown. Saw it when I was 7 years old. Kept having recurring nightmares. Its more rare now, but im 37 and still happens a few times a year. The movie is silly of course, but its a bit fucked up for a child to watch.\n\nI actually forced myself to play some resident evil games later when i was older to overcome the zombiefear. They are the ones who should fear me. Hehe.", "label": 0}
{"text": "The Blair Witch Project.. \n\n\nI was just a kid at the time and we lived in a trailer out in the middle of nowhere surrounded by woods.", "label": 0}
{"text": "The thing is, Paradis is a stand-in for post-war Japan. The whole \"then their memories got erased\" is basically the author's allegory for post-war Japan just wanting to \"get over it\" and put Japan's colonialism behind them.\n\nThe reason the story falls apart is because it's actually just a long, drawn out metaphor for the author's own victim complex over how the victims of Japanese colonialism refuse to just \"get over it\" like they did, which makes him the *real* victim of Japanese colonialism because sometimes he feels bad talking about it.\n\nSee, a lot of overseas fans don't know this, but the original comic came out at the height if the ultra right-wing \"masochistic education\" movement, which was basically a movement demanding that children in schools not be taught anything negative about Japanese history to avoid \"confusing\" them, and that they must never be made to feel bad about anything their country has ever done. \n\nBut also that, if they *did*, it would be incredibly destructive to Japanese society - which, they also believed was the explicit goal of foreigners refusing to \"get over\" the past and keep talking about that history - things like memorials to Japan's victims were treated as *existential threats.* Feeling sad in history class was portrayed as literal reverse genocide.\n\nIt's not even subtle, either, the entire plot of the comic is literally just \"make up a fantasy world where ultra right wing beliefs about 'masochistic education' are a real thing.\" You get a world where the people who study their country's history turn into literal monsters who go and try to eat the other people who've magically forgotten all that and can't understand why they're being attacked.\n\nIt's obviously all just unhinged nonsense, but the clever thing the author did was set it in not-Germany, which made a lot of people see it as an anti-Nazi allegory, (which still falls apart when you get to the Eldians in ghettoes marked by yellow stars). \n\nBut it all kinda falls into place when you realize Paradis isn't Nazi Germany, it's early 2000's Japan. It's cohesive, it's just that it's a cohesive presentation of an utterly insane worldview, which you, a sane person, instinctively rejected.\n\nThe author even hints at this early on when he portrays the only Japanese character, Mikasa, as the last surviving victim of a genocide - it's literally just a Japanese version of \"they're coming for our women,\" and it's just right there in the first few episodes. ", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for one of the following reasons:\n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) Questions seeking a correct or definite answer, that can be researched elsewhere are not allowed on AskReddit.\n\n* [Rule 5:](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_5-) Rhetorical and loaded questions (in which you are asserting an opinion, bias, or leading respondents towards expressing a specific opinion) are not allowed on AskReddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Orange pineapple", "label": 0}
{"text": "Strip club", "label": 0}
{"text": "Need to “Win”. Obsessed with being right or coming out on top, even in trivial situations", "label": 0}
{"text": "Try and pretend it isn't happening", "label": 0}
{"text": "Vodafone", "label": 0}
{"text": "It's not that it ended but..he has a family and despite lives 5 minutes far by walking we never go out.\nBeen years now that I have no group of friends that's why I haven't social life anymore", "label": 0}
{"text": "Royal Mail", "label": 0}
{"text": "Omg... I had this at Boxed Lunch the other day. \n\n\nThey have this thing where you buy something as a member and it donates food to people. Great awesome. Its why I'd love to shop there. Get cool stuff and help others. Win win.\n\n\nI am also fully aware that the guy at the counter has to ask me to get a membership. I'm certain if a secret shopper says he didn't then he'd get in big trouble. Don't want that so go ahead.\n\n\nBut DO NOT ask me every second sentence to sign up. Which he did.\n\n\nAll I wanted was a new cute Winnie the pooh sparkly looking Keychain.\n\n\nGuess who left the store without a sparkly Winnie the pooh Keychain because the guy wanted to go \"above and beyond\" for that quota that i understand he needs to hit but doesn't need to nag about ?", "label": 0}
{"text": "I watched it once as an adult a few years back, actually. As an adult I can see how cheesey it was. . But as a kid it traumatized me. (The whole Thief In The Night movie series)...ugh.", "label": 0}
{"text": "I want to live the childhood I never got to. I want to be surrounded by people who love and support me without expecting something in return. I quite literally just want to prove my father wrong.", "label": 0}
{"text": "When he asked me to get a specific kind of ice cream that does not exist, and laughed because I was upset.", "label": 0}
{"text": "Companies only like your money", "label": 0}
{"text": "> And stub hub\n\nStubHub was owned by ebay from 2007-2019, and Viagogo from 2020 until now.\n\nIt's not owned by Ticketmaster or LiveNation. Where are you seeing it is?", "label": 0}
{"text": "Blow a spit bubble off my tongue, into the air", "label": 0}
{"text": "r/apeirophobia", "label": 0}
{"text": "There are limits to what one should do for a Klondike bar", "label": 0}
{"text": "I like Jimmy Carter. I don’t have a crush on him.", "label": 0}
{"text": "Truly? Graduating high-school with my preferred college lined up and made my closure with friends and family before leaving. Sure college and transitioning into the workforce were their own chapters, but being at that crossroads in high-school with your affairs in order felt optimistic, even if a little naive.", "label": 0}
{"text": "I'd probably be the shortest of all of them because I stand at *( 164cm or 5'4\" )*.", "label": 0}
{"text": "The exorcist \nThe shining\nCarrie", "label": 0}
{"text": "Semi-Charmed Life\nI know the lyrics are pretty clear but I never really thought it through because it was so catchy to me", "label": 0}
{"text": "??", "label": 0}
{"text": "I have no qualms about standing there and telling \"more, more, more\". I'll pay for more protein, but you're not putting one scoop of rice in that humongous bowl you purport to sell.\n\nAnd if on the third \"more\" they give me a stink, that is 100% fine too, I'll have them finish the product and at the end say \"you know what, that doesn't look full to me, so I'm gonna walk away, and we can try again tomorrow\".\n\nI'll make them waste it ALL rather than giving them any profit for short changing me.", "label": 0}
{"text": "Apple...people pay way too much for technology that Android users have had for 5 yeara", "label": 0}
{"text": "Brother what?", "label": 0}
{"text": "What a weird fuckin comment lmao. There was nothing wrong about what they said, so why are you being annoying? ", "label": 0}
{"text": "I couldn’t agree more. I have been diagnosed with a couple mental illnesses and it’s my personal goal to ensure it doesn’t define me or isn’t my identity. I prefer people don’t know or would never know. I know everyone is different in how they deal with stuff but having it be a quirky/silly identity trait is annoying to me.", "label": 0}
{"text": "Yeah; LOADS of acts that used to give them flack have bent the knee at this point. F'ing **ZACK** was touring with them!\n\nThese days the biggest acts I see lobbying against it are peeps like Lawrence or little niches like Ineffable Records (/r/Calireggae rise up!) or whatever. I love 'em to hell but Matisyahu ain't Eddie Vedder you know what I'm saying?", "label": 0}
{"text": "cash out his stock and put the money somewhere that i can get it tomorrow.", "label": 0}
{"text": "Onlyfans", "label": 0}
{"text": "have you ever met a crow?", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Seagate. They make replacing bad hard disks painful.", "label": 0}
{"text": "Fast enough. \n\nWe live longer then ever and can experience so much. Don’t be angry at the time gone, be excited for the time coming.", "label": 0}
{"text": "Comcast or whoever is the major cable/internet provider in your area.", "label": 0}
{"text": "Wow, thank you so much. This has been a really tough year for me with no end in sight, and that is incredibly meaningful to hear.", "label": 0}
{"text": "Eating McDonald’s breakfast", "label": 0}
{"text": "Buy everything around the house of someone I hate and make it miserable for them.", "label": 0}
{"text": "Stop having children", "label": 0}
{"text": "Grill cheese sandwich", "label": 0}
{"text": "Little Nicky", "label": 0}
{"text": "I had the same thing happen to me, one end of my permanent retainer came off and kept poking me in the tongue. I went to Comfort Dental and they refused to touch it, saying that only the orthodontist who originally put it there was allowed to remove it.\n\nThat was twenty years ago! For all I know, he could be dead! So I found my old pediatric dental office and explained it to them - the guy had retired a few years ago, but they went ahead and got it out.", "label": 0}
{"text": "Bruce Hornsby & The Range", "label": 0}
{"text": "The latest Mission Impossible.", "label": 0}
{"text": "Niantic. It’s like they’re actively trying to lose their customer base.", "label": 0}
{"text": "That's what they said tho", "label": 0}
{"text": "Sleepless in Seattle. Woman hears a dude on the radio, “falls in love,” uses her job as a journo to track him down, shows up randomly at his house, etc.. real weird stuff that could easily be a horror film if recut.", "label": 0}
{"text": "Swiss cheese.", "label": 0}
{"text": "Their sexuality. I've had quite the knack at reading someone and swiftly knowing if they are heterosexual or not. I normally don't bring it up because that is kind of rude to just announce something like that, especially if they prefer to not make it the core of their persona.\n\nIt has made for some interesting twists of events in the past though. I once had an HR Manager from back when I worked retail that checked off a few boxes. One day I was helping him in the break room to set up for holiday decor and he was mentioning his honeymoon coming up. I said that I wished him and his husband a good honeymoon and the room froze. A few other staff members piped up and said that I was rude for accusing the HR Manager of being homosexual. Meanwhile the HR Manager got the room to stop when he asked me how I knew he had a husband and not a wife.\n\nI just shrugged and said \"*Isn't it obvious?*\"\n\nApparently it was not obvious to everyone else.", "label": 0}
{"text": "I would *not* pay people to vote for this or that president.", "label": 0}
{"text": "Travel to the bottom of the ocean in a glorified water heater maneuvered by a video game controller, obviously. Maybe stick 4 other rich guys in there with me?", "label": 0}
{"text": "Look who’s talking Too. \n\nThe talking toilet scene haunted me for yearrrsss.", "label": 0}
{"text": "The fact that I’ve had 2 coworkers that have changed their pronouns multiple times throughout the few months they’ve worked there, one is gone because she which then went by he then changed their name like 4 times so the manager had to keep giving this person different name tags and this person would get triggered if you called them the wrong pronoun after they were just going by the pronoun you called them a week earlier. The other one is on the verge of quitting because they get triggered when customers call them she, they expect people to automatically know because they have short green hair but they are still very much so shaped like a woman because they are biologically, they also only want to be considered a female when it’s time to do the harder work so they can get out of it. Both of these people were also friends when they both started out and keep switching their pronouns from she to he, but now they hate each other for some reason.", "label": 0}
{"text": "This sounds like a joke but I’m serious: the US presidential election of 2016 was when I stopped feeling okay about the future, maybe for the rest of my life. \n\nI guess, up until then, alternate dystopian timelines didn’t seem possible.", "label": 0}
{"text": "Almost any trait can be a character flaw if taken to an extreme", "label": 0}
{"text": "Celonis and Disco are both solid options", "label": 0}
{"text": "McDonalds. Fries are better. Plus BK doesn't have McNuggets or Szechuan sauce.", "label": 0}
{"text": "they'll wobble and make noise if there's a blade coming loose - usually ;)", "label": 0}
{"text": "The person above tried to be an advertiser and still got a runaround.", "label": 0}
{"text": "Seasonal national park work if you want to travel! Or national park adjacent jobs, at like restaurants or recreational equipment rental places. Lots of them provide free or cheap housing. They only need lots of employees during their peak seasons. You can live somewhere beachy for summer and in the mountains for ski season.", "label": 0}
{"text": "My dad had a friend from high school who died from fighting. This was in the 90s and it wasn’t a good place in California. There was a fight between his friend and two other dudes, they ended up knocking my dad’s friend head against a bench in the locker room. The guy died and left behind his girlfriend and their newborn son. It’s really devastating honestly:/", "label": 0}
{"text": "I work for a hospital getting prior authorizations, my vote is health insurance companies", "label": 0}
{"text": "127 Hours: A Toddlers Tale.", "label": 0}
{"text": "The smell of pig's shit.  Might be crazy but my hometown used to be known for pigs market. Every time I smell that particular scent  it reminds me being a kid traveling back home from vaction.", "label": 0}
{"text": "White chocolate with raspberry swirls and fudge hearts FTW \n\nMostly underrated because no one's heard of it lol", "label": 0}
{"text": "Did you see when Bob Loblaw lobbed a law bomb on his law blog?", "label": 0}
{"text": "Huge fake lips, botox, fillers, butt implants, breast implants etc.", "label": 0}
{"text": "I feel this.   Sometimes I just want a crappy fast food meal.    And then seeing it top 20 bucks in my cart makes me go make a peanut butter and jelly sandwich.", "label": 0}
{"text": "Do what? Work a miserable job for a lousy company? Because I don't have a magical unicorn that craps gold bars, so I have to work for a living like a barbarian.", "label": 0}
{"text": "A couple of my Fa ebook friends have died in the past year and I didn't find out until months later because the posts never showed up on my feed. They sure have no problem showing me ads and spon con, though.", "label": 0}
{"text": "What dreams may come", "label": 0}
{"text": "That’s even LOVELIER to know! 😂  \n\nAfter getting ripped off at every dealership for being a clueless woman, not having to deal with that anymore would be a blessing lol. \n\nI will say, the best car place we ever went to was DEEP in the ghetto, and the guy who owned it wasn’t even wearing a shirt while working, but that man knew his stuff and did it for CHEAP! What a guy!", "label": 0}
{"text": "not rlly weird but cool - Helium changes the sound of your voice because it’s less dense than air, which causes sound waves to travel faster through your vocal tract. \n\nthis fact is less know for sure - when you inhale helium, Oxygen is actually *removed* from the blood stream during the exchange of gases and is replaced with helium. this can lead to asphyxia (oxygen deprivation) and death, and it is more common than people think, especially with kids. and if u run around after inhaling it it is even more dangerous as u are already lacking oxygen. i did a science project on inhaling helium in grade 6 (which was 11 years ago) and have never inhaled it again since learning this info lol", "label": 0}
{"text": "I think it depends on what kind of area you're in. If you're in an area that's the least bit touristy... I don't know what to tell you.  \n\nIf you're in a lame area then you could make prank phone calls to other hotel guests.", "label": 0}
{"text": "Bud light", "label": 0}
{"text": "He sounds insufferable", "label": 0}
{"text": "Cocaine and strippers", "label": 0}
{"text": "I'm also afraid of escalators, especially crowded ones, and especially in airports or train stations when people have a lot of luggage. I'm afraid someone near the end will fall or get stuck and then we'll all keep piling up near the exit. I always leave 2-3 steps in front of me, and look around and make a game plan, deciding if I could hop over the side or yell loud enough for someone to hit the emergency stop.", "label": 0}
{"text": "\"Death is but a door, time is but a window. I will be back\"\n\nAnd then I'll haunt a painting in New York\n\nCage my grave all you want, I'll come back either way", "label": 0}
{"text": "Got behind a very slow driver ( 35 mph instead of 50 ). Started to overtake him. They accelerated while I was doing it.\n\nWhile I was at his level, saw a car coming in front of me. The car I was overtaking was still accelerating on purpose. Had no time to brake and get back behind the car. \n\nSo I got to 75 mph instead of 50 and was really close to crashing into one of them. Some people are crazy", "label": 0}
{"text": "Whoever makes call of duty", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "The opposite of love isn't hate, it's indifference.\n\nThis should not be taken as *any* sort of a defense for abusive/narcs, they get off on hurting/hating people.", "label": 0}
{"text": "Oh yeah I can do that with a pencil and paper.", "label": 0}
{"text": "When I seen how F up the life of my friends that their parents where their friends and not parents. They raised losers and drug addicts.", "label": 0}
{"text": "what is it", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\n60.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.84\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/Early_Equipment667 is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "I just hope we all pay attention to what you posted and learn the lesson this way rather than the hard way", "label": 0}
{"text": "Loblaws. No doubt.", "label": 0}
{"text": "EA", "label": 0}
{"text": "I once went to a Burger King where they had no meat. No burgers, no chicken, no bacon, nothing. I asked why they were even open and they said they still had fries.\n\nSo to answer your question: I don't eat at either.", "label": 0}
{"text": "I literally explained it in the context Russ demonstrated it wdym? these are his exact words from his YouTube community post addressing the deletion of the video: \n\n\"The video was a review of the MIG Flash v2\nand Cartridge Dumper, which I demonstrated\nas a use for backing up and preserving your\nown Switch cartridges. ln the video I showed\nhow to take my own games and convert them\nto digital files, much like you would back up\nCDs to mp3s, DVDs to mp4s, etc. There are\nlegal protections for backing up media for you\nown personal use in the United States and 1\nused no software to circumvent Nintendo's\nanti-piracy measures -- in fact, the Cartridge\nDumper itself requires no software to use.\" \n\nyou literally need physical games like he says here.  also the topic isn't the dumper, its his video about the dumper. there's difference. just because I didn't mention a feature about the product doesn't make my argument any less valid lol", "label": 0}
{"text": "Ubisoft", "label": 0}
{"text": "Grammar", "label": 0}
{"text": "Getting hit by a car 70 mph by a lady and into a car in front of me, a car I wasn't even close to. A lady was playing with her phone.", "label": 0}
{"text": "The Fog. My grandpa let me watch it when I was about 6 I cried within the first 20 mins", "label": 0}
{"text": "Strawberry", "label": 0}
{"text": "When Hungrydruid was referencing a sibling situation, and you asked if they would do the same to their girlfriend", "label": 0}
{"text": "What's Eating Gilbert Grape. Been mildly depressed ever since.", "label": 0}
{"text": "My dog.", "label": 0}
{"text": "So basically kill of any dog powerful enough to kill someone? That leaves only chihuahuas and that.", "label": 0}
{"text": "Peanut butter, i was just curious kid back then, i was 14 and now i am 30", "label": 0}
{"text": "I always loved E.T. he was the friendly alien.", "label": 0}
{"text": "**Your local bar.  Most likely they can't stand you, and put up with you to take a portion of your paycheck.**", "label": 0}
{"text": "Our insanely corrupt government and media", "label": 0}
{"text": "While it doesn't actually bother me, I sthink The Exorcist is probably the scariest one I've watched. The time it was done, the practical effects, being based on a true story. And still to this day it holds up extremely well.", "label": 0}
{"text": "Spit play", "label": 0}
{"text": "i grew up in the 80s so like... everything?\n\nAdd to that, parents who weren't media savvy so they would take me to watch just about anything that wasn't r-rated.\n\nmemorable ones include Poltergeist (like all of it), Wrath of Khan (parasite scenes), and Temple of Doom (which is famously the reason that PG-13 even exists), hell, my dad let me watch Alien when I was like 8.\n\nAdd to that pretty much all movies had some ultra traumatic shit in it - disney films and killing off parents, kids films with objectively terrifying moments - ET with the \"attack\" of the scientists and then the death scene, Goonies with the dead agent and threatening to blend up Chunk's hand, Never Ending Story and artax, like all of the Dark Crystal, the Secret of Nihm, Watership down etc...", "label": 0}
{"text": "They poison your tea", "label": 0}
{"text": "I don’t know that they hate passengers as much as they are indifferent to us. We’re cargo, and they’re all terrible, so our only recourse is to not fly, which isn’t practical in the U.S. at least.", "label": 0}
{"text": "If you have to ask you can't afford it.", "label": 0}
{"text": "Crowdstrike. Can’t believe nobody said this. They put out an update that grounded half the flights in the world for 2 days.", "label": 0}
{"text": "Pretty sure there is a policy in there somewhere that states to work as federal employee you must agree to have sort of vendetta against Americans.", "label": 0}
{"text": "The possessiveness and the lack of trust.", "label": 0}
{"text": "Her bullying was sadistic and she made sure to get a bunch of other people involved in it, so my life was hell the whole time she was in it. Never before or since have I been as certain that someone genuinely enjoyed causing pain to other people. Even then, I understood that she was taking her self-loathing out on me, but that doesn’t make it okay. I’m tired of people saying that like it gives bullies the right to torment people.", "label": 0}
{"text": "A good personality, apparently. Almost everyone around me is awful. That's how I found my girlfriend. She's like me, but a girl, but weird in her own way, and too nice for her own good.", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\n60.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.84\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/Early_Equipment667 is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "I don't buy that for a minute.   Heck, DD and GH alone have national advertising.   You can't tell me they aren't making some money.", "label": 0}
{"text": "Saw it, great flick", "label": 0}
{"text": "That's not what this is about. You can be worse or better off for countless reasons. It's about who is more likely to make it better for you in the future. Who is more credible and capable of dealing with complex issues the US and the world is facing.", "label": 0}
{"text": "Access to wise people and rare opportunities\n\nMay add more later", "label": 0}
{"text": "House cats", "label": 0}
{"text": "He constantly hyperbolized. He constantly sang his own virtues while blaming everyone else for everything bad that had ever happened to him. He constantly would mirror but also one up anything I shared about myself. He wanted to move way too fast despite my protests and could be very emotionally manipulative. I was trusting and naive, it took me an embarrassingly long time to realize he was an actual pathological liar. Our dating relationship only lasted a month but he sure made it a roller coaster of BS.", "label": 0}
{"text": "Bk, because there, I can have it my way.", "label": 0}
{"text": "A guy", "label": 0}
{"text": "The original Willy Wonka movie. I recently watched it as an adult and realized a lot of the jokes went over my head as a kid.", "label": 0}
{"text": "Sir, you are not wrong.", "label": 0}
{"text": "Reminds me of trying get a prescription for mounjaro, I already work out and I try to eat right but I'm still overweight, didn't really take my health seriously until my mid-30s, And now 4 or 5 years later The older more health-conscious version of me just wants an edge to help me lose weight. \n\nAnd lo and behold, I basically get back this rejection letter explaining that I am too healthy, That in order to get this medication approved on my insurance, I would have to fail all these blood glucose tests over a period of time, I would need dangerously, unhealthy, A1C, and other markers. Just it's just so fucking stupid what we do in this fucking country. Just so some asshole can buy another vacation home and see the line go up.", "label": 0}
{"text": "T-Mobile. Never have a seen a company more unwilling to actually provide customer service.\n\nOr Robinhood….had a horrific experience with them", "label": 0}
{"text": "That voodoo doll on Trilogy of Terror, holy crap.  Loved Karen Black, though.", "label": 0}
{"text": "Honestly in hindsight we have a lot to thank Enzo for - being the kind of person that grows taller when they’re given Viagra has resulted in us getting Lamborghini and the iconic GT40.", "label": 0}
{"text": "Why especially white?", "label": 0}
{"text": "Not a movie, the “Dumb Ways to Die” music video", "label": 0}
{"text": "I’ve never been curious", "label": 0}
{"text": "Their kids lovingly hug them.", "label": 0}
{"text": "Can make mosquito bites stop itching too.", "label": 0}
{"text": "This submission has been automatically removed because it has 3 words or less. Please write your question in a proper full sentence, thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Came here to say this", "label": 0}
{"text": "I dunno but a very obvious sign of a kamala supporter is they can't stop talking about Trump.", "label": 0}
{"text": "Oh wow I found you!", "label": 0}
{"text": "I'm from bosnia take me to America", "label": 0}
{"text": "Pet Semetary. I watched it with my dad and brothers when I was 4. It's not really scary now, but it was when I was 4 lol", "label": 0}
{"text": "Transfer 5 million to my account", "label": 0}
{"text": "Yeah. it was really hard for him to stay on the ball...", "label": 0}
{"text": "People don’t understand what empathy is first of all “the ability to understand and share the feelings of another.” assuming one’s feelings is not empathy, assuming what someone wants is not empathy. To understand you have to learn about that person, so you have to listen observe and most importantly connect your energy with their by talking with them, asking them so you can learn as much as possible what they are feeling, and being cautious that you might be wrong but never stopping to learn about them. Many don’t know how to do this or think empathy is something else besides  that. I just we weren’t really taught to be genuinely empathetic, we were taught a version of it that was not genuine or heathy.", "label": 0}
{"text": "Any company that sells printers", "label": 0}
{"text": "You.  It all starts with You.  And, tomorrow.  Living life as a human being is an absolute gift that far too many take for granted.  And, no matter how bad of a day you had, get some good sleep and wake up to see tomorrow, for it's a Brand New Sparkling Sun Shimmering Day.  Every passing second is chance to make a new again.", "label": 0}
{"text": "Type 1 here and I’d just add that my needle scripts are for up to 5x daily (evening basal dose, evening correction dose if needed, prior to all meals). They don’t call it “multiple daily injections” for nothin’ 🫠\n\nBeats the hell out of the alternatives tho, by a long shot. (I don’t want to mess with a pump, especially in light of playing rec hockey, which is non-*checking* but very not no *contact*.)", "label": 0}
{"text": "Reminds me of the only part of Nope I liked, when Daniel Kuluuya is in his truck watching shit go down in the house, and instead of doing the dumbass horror movie thing of going in to investigate, he just says the title word. That was awesome.", "label": 0}
{"text": "Mobbing and utter violence, nothing better than that, maybe someone drilling a stick into your anus to round it up.", "label": 0}
{"text": "Worst experience is someone kept calling me “dude” even though I told them not to. It happened to me three times since September 9, 2023.", "label": 0}
{"text": "The movie IT, the shower scene. Fucking drain", "label": 0}
{"text": "Darkness falls made me afraid of the dark until I was 12. Then the grudge creeped me out for a while too.", "label": 0}
{"text": "Realizing for the first time that when somebody says “I’ll love you for the rest of my life” it’s probably bullshit", "label": 0}
{"text": "Walmart", "label": 0}
{"text": "I'm quietly optimistic.", "label": 0}
{"text": "You know at the end of a rock concert when the drummer throws out his drum sticks too the crowd. Nuf said.", "label": 0}
{"text": "Nothing really. Just scared to die", "label": 0}
{"text": "Donate to several charities but especially MY friends and family \n\nAnd my damn self 🐸", "label": 0}
{"text": "I like to add pepperoni to mine", "label": 0}
{"text": "Fire in the Sky", "label": 0}
{"text": "Animated but similar on the scale of insanity, invincible. The first episode feels like a straight up kids show... until the end.", "label": 0}
{"text": "Good quality vanilla is great! But the usual vanilla that's being sold in stores doesn't give vanilla any good rep.", "label": 0}
{"text": "Drinking and drugs", "label": 0}
{"text": "No. Just because I don’t vocally and vehemently rail against a thing in no way means I support it. ", "label": 0}
{"text": "This!", "label": 0}
{"text": "The airlines!!", "label": 0}
{"text": "I used to be the same way until I found Vice Grip Garage. Derrick pumps out such insanely entertaining content", "label": 0}
{"text": "Video Games.", "label": 0}
{"text": "The United States of America", "label": 0}
{"text": "Jamie", "label": 0}
{"text": "Yeah no shit. They’re funny because they practice.", "label": 0}
{"text": "Their elite book and z series are solid.", "label": 0}
{"text": "I was waiting for a large group of friends cashing out at the cage and decided to take a seat at a random slot machine right beside our group and pulled $500", "label": 0}
{"text": "Buy online and read the reviews", "label": 0}
{"text": "I recently re-watched it and was surprised how early on it happens. In my mind, we had all these scene of adventures and bonding with artax, but no - it's literally the first thing that happens after Atreyu sets off on his mission.", "label": 0}
{"text": "I think they'd already know everything they want to know if they met me in person", "label": 0}
{"text": "I would do that every week", "label": 0}
{"text": "That I waited for marriage and got engaged at 19 so I’ve been with only one person for my whole life and I wish I had had more fun while I could", "label": 0}
{"text": "my grandmother said sliced bread, indoor plumbing, electric washing machines were huge. 7 kids and having to do everything manually.", "label": 0}
{"text": "Are your feet worth anything?", "label": 0}
{"text": "Planet Fitness. Their business model relies on customers that never come to the gym.", "label": 0}
{"text": "Try to figure out why that is. Are you not getting what you want in return out of the act of kindness? If so it wasn't an act of kindness but more like a tactic to control an outcome. \n\nCould it be the feeling of being walked all over? The whole give an inch they ask for a mile thing, in that case I'd be less available.", "label": 0}
{"text": "27F here...I make stuffed peppers for dinner on Halloween. I use orange bell peppers and carve little faces in them so look like Jack-O-Lanterns. Then I make a chocolate mousse graveyard for dessert with crushed up oreos for the dirt. I decorate it with Milano cookies for the headstones and write R.I.P on them and scatter gummy worms on top. Then I hand out candy to the trick or treaters.", "label": 0}
{"text": "When I was a kid, probably 6. I went to an autumn fair with my grandparents and some other family, there was this blow up obstacle course thing for kids, and I went into it. I soon somehow got my head stuck into a spot where two parts of the blow up thing meet and couldn’t breath and almost suffocated to death, wasn’t to happy afterwards", "label": 0}
{"text": "Kept forgiving my husband for his affairs and believing I was to blame. Finalizing the divorce hopefully soon.", "label": 0}
{"text": "I always feel sick after McDonald's", "label": 0}
{"text": "Giant Stay Puft Marshmallow Man", "label": 0}
{"text": "Definitely CVS", "label": 0}
{"text": "Diapers.", "label": 0}
{"text": "Love you're self first!", "label": 0}
{"text": "when they don’t spend their time posting dumb shit like this on reddit", "label": 0}
{"text": "MAGA.\n\nThere's a legit kink revolving around it. Many of the people involved are not conservatives/Republicans.", "label": 0}
{"text": "I got beaten but was so injured the cop wouldn't ket ne drive to the ER.\n\nThen when I got out - 7 damn hours later - I was like 7 miles from my car and 4 from home.\n\nNo Lyfts or Uber back then.", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there! Your question has been removed as it looks like you're asking a question that violates r/AskReddit's [Rule 3](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-)\n\nDAE (\"Does Anybody Else\") questions and questions that can be answered with \"yes\" or \"no\" are not allowed in r/AskReddit. Try rephrasing your question to be more open ended, or submitting to a different subreddit.\n\n\nOtherwise if these don't fit your needs, check out the [multireddits in our sidebar](http://www.reddit.com/r/AskReddit/about/sidebar) which cover almost every topic imaginable, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "MAGA Isn’t less government, it’s more.  Heritage.org", "label": 0}
{"text": "Call of Duty.", "label": 0}
{"text": "Alice Sweet Alice and Salems Lot", "label": 0}
{"text": "# How fast does life go ?\n\nI was 14 yesterday and today I'm almost 60.", "label": 0}
{"text": "My son", "label": 0}
{"text": "Pardon my ignorance but who is “romanticizing” autism and why?", "label": 0}
{"text": "Hellraiser. To be fair, though, I was four...", "label": 0}
{"text": "StubHub isn't owned by TicketMaster or Live Nation, but I wouldn't be surprised if there was a huge amount of illegal collaboration. Eric Baker is a veteran of McKinsey and Bain Capital, which doesn't speak well for his reputation.", "label": 0}
{"text": "Flying monkeys in the Wizard of Oz", "label": 0}
{"text": "Wow. Youre insufferable ", "label": 0}
{"text": "I just watched it for the first time and I liked it", "label": 0}
{"text": "OCD is tough man.", "label": 0}
{"text": "All of them do. It's by design. Some just don't have to hide it.", "label": 0}
{"text": "They are successful.", "label": 0}
{"text": "Hocus Pocus.  The zombie that got his head knocked off?! 🤮", "label": 0}
{"text": "After that whole trial happened, my adoration kinda faded. \n\nI didn’t even keep up with it for the most part tbh, just memes about it really, but even then I knew he did some fucked shit. \n\nHe’s still quite beautiful, but yikes. lol", "label": 0}
{"text": "I got a little miniature human that looks like me and he's intense. I think they're called children or something", "label": 0}
{"text": "Yeah, unfortunately my best targeted ad-spend is Facebook. I hate giving them money, but I absolutely get results from it.", "label": 0}
{"text": "I had a friend who was like a brother to me, we supported each other through thick and thin.  Then in 2016 he became a hardcore trump supporter and got real deep into conspiracy theories.  Then he shaved his head and got a swastika tattoo and we decided not to be friends anymore.  He was a kind, thoughtful and considerate person before and was my closest friend for over a decade.  I'm still confused about what changed in him so drastically and suddenly or if he had been fooling me the entire time.  He's homeless now and I still keep track of where he camps. Last Saturday I left him a coat, a pair of boots in his size, and a bottle of his favorite vodka so he knows someone out there is still thinking of him.", "label": 0}
{"text": "Young Einstein. 🐈+🥧= fucked me up as a kid.", "label": 0}
{"text": "Yeah it always feels like I’m driving on a dark road while it’s raining and I’m about to be murdered", "label": 0}
{"text": "Happiness", "label": 0}
{"text": "Good managers like having people smarter than them on their team. Everyone helps everyone learn, people are happier, everyone advances and such. \n\nShitty managers are intimidated by people smarter/more competent than them. Instead of taking the opportunity to learn they make stupid useless rules or spreadsheets or something and everyone hates life.\n\nSource: was US government manager and seen some shit", "label": 0}
{"text": "It's relative.", "label": 0}
{"text": "Burger King has better burgers, but McDonald’s has better fries.", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nYour post has been removed as it violated [Rule 2](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_2-). Please check that your post doesn't contain the following issues:\n\n* **If your question is specific to your situation, or involves a story, please post your question somewhere else. If you're not sure where to post, take a look at the [list of related subreddits](https://www.reddit.com/r/AskReddit/wiki/sidebarsubs/) or ask for suggestions in r/findareddit.**\n\n* **Your post title cannot reference yourself in any way, including but not limited to having first person personal pronouns that reference yourself.**   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Yes I remember hearing that.  And also many recording artists have complimented this album and song.  I believe Paul McCartney considers it the best album ever.", "label": 0}
{"text": "Begged for him to take me back.....", "label": 0}
{"text": "Same. I do not use any other platform unless you count reddit, but I know no one on here. I never got into Twitter, and MySpace is just the land of music and nostalgic pictures now. The other social media platforms I also never got into, mainly because I could never understand why I needed more than one. Lol\n\nAbout the only time I have said anything on the vegan post was after about the 10th one that I was trying to get rid of, and it wasn't so much aimed at the post as it was me airing my frustration about the Facebook algorithm out on that post. Telling Facebook to show me less of a topic almost makes Facebook decide you really need to see more of said topic...", "label": 0}
{"text": "Every time anyone has reminded me of how dangerous average people have been historically and by nature.", "label": 0}
{"text": "The hospital scene may be the single most dread-inducing scene in horror history.", "label": 0}
{"text": "Ryanair, Easyjet", "label": 0}
{"text": "Adobe.", "label": 0}
{"text": "Nice", "label": 0}
{"text": "Yesssss", "label": 0}
{"text": "Uh, err, well, uh... boobs.", "label": 0}
{"text": "Same, to this day I CANNOT watch this movie.", "label": 0}
{"text": "Cops. In my town, theyre pretty good honest helpful people and we appreciate them.", "label": 0}
{"text": "I’m not friends with her anymore. For many reasons other than this one:\n\nThe moment she told me that people can buy fake pregnancy tests with a positive result online, she had this crazy look in her eyes. This happened while she was fighting with her then boyfriend. \n\nI started to rethink our friendship right then.", "label": 0}
{"text": "I usually watch the news everyday, but I've been taking a little break.", "label": 0}
{"text": "The past.", "label": 0}
{"text": "My kids. They have enough challenges in life ahead of them, I can't allow myself an easy way out when I could be here to help them. I owe them that.", "label": 0}
{"text": "i’m sorry to hear that", "label": 0}
{"text": "Seduction", "label": 0}
{"text": "Spy kids", "label": 0}
{"text": "Crochet", "label": 0}
{"text": "Playing guitar. Every aspect of it, if that counts. Music theory, chord progressions, scales, everything", "label": 0}
{"text": "i hate illustrator with a passion", "label": 0}
{"text": "Why is this dumbass question asked 10 times a week?", "label": 0}
{"text": "The paranormal activity movies, they are based on true stories.", "label": 0}
{"text": "any ISP and most streaming services", "label": 0}
{"text": "Rattlesnakes under my bed. Stems from encountering a large rattlesnake in the woods as a child. I'm 64. I never let a body part hang off my bed 😆", "label": 0}
{"text": "Because I don’t like heavy things on me.", "label": 0}
{"text": "If you ever come to Europe, we have fior di latte, which is milk ice cream.", "label": 0}
{"text": "Clutter", "label": 0}
{"text": "The Simpsons", "label": 0}
{"text": "A watermelon.", "label": 0}
{"text": "Dying from accidental electrocution. My grandfather and great grandfather both died this way. No electricians in our family. \nFor natural death from disease it seems living shorter lifespans. Grandparents generation died between 89-99. Dad’s generation 73-83. My generation 49-56.", "label": 0}
{"text": "I don’t think I would want this power lmao", "label": 0}
{"text": "Teen pregnancy", "label": 0}
{"text": "At my age, the life of the party is in the charcuterie board.", "label": 0}
{"text": "I work for Kroger.  We HATE customers.  We like their money though", "label": 0}
{"text": "Any insurance company", "label": 0}
{"text": "Should be legal, but socially frowned upon.\n\nI feel the same way about drugs and prostitution.", "label": 0}
{"text": "Basically, any large corporation. Whether it’s food, insurance, printers, tech, the big corporations make money by reducing service in their respective markets; markets which they are effectively oligarchs", "label": 0}
{"text": "I liked the scene where the ape put his white stuff into simbas face, first cumshot scene of my life.", "label": 0}
{"text": "I'm broke.", "label": 0}
{"text": "Poverty.", "label": 0}
{"text": "This", "label": 0}
{"text": "That sometimes prescription meds cost less when you forget your insurance card.", "label": 0}
{"text": "It happened after I had 20 beers.", "label": 0}
{"text": "I have a friend who is a wannabe IG influencer. She prides herself on being a teaching assistant specialising with autistic kids at a special ed school, and constantly posts photos of her \"wonderful kids\" and their \"wonderful achievements\". She's crafted an image of an angel who tends to the vulnerable.\n\nSince she is practically my first friend ever who I've grown up together with for as long as I remembered, I decided to disclose that I was one of the people who she constantly praises.\n\nTo my bewilderment, her tone changes and immediately asks if I've ever considered the shame my parents felt having me.", "label": 0}
{"text": "I had such a fucking nightmare with them in my old job. \n\nOur managers were chill, employ someone, get them a new desktop or laptop to the specs they want all good. Sign into your personal shit like facebook or listen to a podcast on youtube while working? All good type of mentality. \n\nI was the unofficial tech guy in the office and one of the co workers is trying to set up an add, spending £5k on it for the department. Wouldn't let her do it so she came to me. It just kept blocking her. I said well I've done this before on my account for my own stuff, transfer the cash to my work account, I'll sort it out over lunch.\n\nIt blocked me from doing it. For THREE WEEKS I couldn't get it working at all. When I finally got through to someone that had more than two brains cells, they were like \"Oh the issue here is there's thousands of log ins from your location. Its flagging the system as multi accounts\".\n\nI just sat there in silence for a good few seconds before going \"It's a university....\" It took another week of the IT department getting involved and communicating with FB to sort it out. \n\nMost stressful time of that contract ever. That advert had to go out on the day she asked me because it was time sensitive  & limited. Had to reach a real niche field of people as well.", "label": 0}
{"text": "I refuse to give up living and being happy. And voting. I will never give up voting.", "label": 0}
{"text": "My husband and I went to a courthouse best decision I ever made", "label": 0}
{"text": "And add to it how Jonathan Larson died before he saw his own success.", "label": 0}
{"text": "Pokemon. If you read basically any ghost pokemon dex entry it gets dark fast", "label": 0}
{"text": "My top choice as well.", "label": 0}
{"text": "Can't disagree", "label": 0}
{"text": "That retained placenta is a thing and what they do to try to fix it.", "label": 0}
{"text": "Username checks out", "label": 0}
{"text": "Solving prime numbers is not gonna create skynet, you're making a big scary thing of a specific system thats decided to solve specific set of problems i.e math in this case.\n\nThats the one point i've been reiterating/", "label": 0}
{"text": "Make the wife and kids happy.", "label": 0}
{"text": "Came here to say this, about both of your moms", "label": 0}
{"text": "Oingo Boingo - Nothing to Fear", "label": 0}
{"text": "An ex gf rapedme whilst I was drunk. I was in an out of consciousness. He said men can’t be raped. As in I only woke up twice because her tears dripping onto my face woke me up. \nShe said “I’m sorry I’m raping you”\n\nMust of awoken something in her because she would continue to sexually assault me in my sleep for months after that. I woke up to it a few times and she would deny it. \n\nNever got therapy again. Waste of time, it made me feel so alone.", "label": 0}
{"text": "How is your iPhone manufactured?", "label": 0}
{"text": "Disney with Star Wars and Marvel", "label": 0}
{"text": "If you have to say goodbye to someone, they were never meant to stay in your life. Love is not rational but learning from the experience makes you better prepared for when you meet the person who is meant to stay in your life.", "label": 0}
{"text": "Gotta go with McDonald's. Their fries are just legendary, crispy and salty, can't beat that! The Big Mac has this iconic taste that hits different. ", "label": 0}
{"text": "There is a reason why, at one time, the tallest building in every city you visited in America had an insurance company or banks name on it.\n\nNow, they sell that space to others.", "label": 0}
{"text": "I just didn't know if he was pretending to be in love (my parents were married for almost 25 years and never happy) or if he's like me and my husband. We've been married 28 years and are still like newlyweds. I hope it's the latter.", "label": 0}
{"text": "Same. The room with the heads screaming was fucking nightmare fuel for life. (I will always love the robot Tik-Tok though.)", "label": 0}
{"text": "is that the horse from horsing around?", "label": 0}
{"text": "I have a complex medical illness and Facebook has some fantastic support groups. Otherwise it's a dumpster fire.", "label": 0}
{"text": "I saw a clip of this movie when I was very young and spent the last 12 years trying to find it. You dont know how grateful I am. Thank you very much", "label": 0}
{"text": "The way they worded it isn't really accurate. The end result that one version is paid and the rest are free is true though.", "label": 0}
{"text": "Hereditary", "label": 0}
{"text": "Haha. Whoa there. I wouldn't go that far.", "label": 0}
{"text": "Octopus", "label": 0}
{"text": "Large letters or bold text", "label": 0}
{"text": "I guess it depends if that’s what you’re going for and under what conditions. I don’t want to be confident about stuff I am unsure about. But if we’re just talking about being comfortable in your own skin dealing with people for sure.", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for the following reason:\n\n* [Rule 3:](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-) Questions that are asking for an amount of something or a number are not considered open-ended questions. Try adding a followup like, \"Why?\" Or, think about if you can rephrase the question with just \"how\" and it still make sense. For example, instead of asking, \"How much did it affect you?\", ask, \"How did it affect you?\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "I'm not a fan of horror movies, though I wish I was because I love watching people play horror games. I've only seen maybe a handful of horror movies and the one that scared me the most was The Descent because of the tiny narrow as fuck cave openings and such. I can't even imagine what it feels like to get stuck in one of those. And I've accidentally seen the movie twice.", "label": 0}
{"text": "Good things are coming!  When I was 18, I was seriously done.  A month later, I found a boy friend who became my husband.  I finished college, got a job, had kids, traveled overseas bunches, and I am recently a grandma.  Live can be so good.  Keep trucking.  Have good people around you.  Look for the good.", "label": 0}
{"text": "Saving private Ryan, watched it when I was 11. Needles to say I’ve never had the urge to join the army.", "label": 0}
{"text": "Blue Moon!", "label": 0}
{"text": "Manga/Manhwa/Anime/Cartoons", "label": 0}
{"text": "EA", "label": 0}
{"text": "Money will solve more than one negative thing, so keeping the money.", "label": 0}
{"text": "McDonald’s", "label": 0}
{"text": "SECRET FROM AN REA || I wasn’t ’found out’ per se. I had a cat for the last 2 years of my 8year rental. His belongings would go in a cupboard we’d go on a little car trip while inspections happened. Never suspected or any issues with inspections.\n\nWhen I eventually left, and was having the final look over; REA asked if I had ever had a cat? I lied and said no, but at times I’d have my aunt’s cat stay with me for a few days. And she nodded knowingly.\n\nTurns out she could tell because: \n1. Cat would always sit behind the curtains and watch out the window, and left a lining of fur. Apparently people (including myself) forget to clean/check the rear of curtains. \n2. You know how your cat likes to rub their noses on corners? They leave their oil buildup; which, when you know what you’re looking for, show little smudge marks clearly on the corners of walls and a metal pocket door - all at kitty nose height.", "label": 0}
{"text": "Mikey", "label": 0}
{"text": "D’oh! Wait, wrong sitcom…never mind.", "label": 0}
{"text": "I worked for an insurance company. The bottom 95-99% of employees worked there because it was a job, simple as that. And most of us really wanted what was best for the customer.\n\nThe top 1-5% were fucking vile human beings. They openly bragged about how they were in the job for the money, denying care is what lead to bigger bonuses, and blamed sick customers for “abusing” the company for using our service for the exact reason it was intended. \n\nOur call center employees had a great idea, which was to have each Executive listen in on call center calls for a day to see the true impact of claim denials on real human beings. The Executive team aggressively shut down the idea, saying they “didn’t have time” to care about the issue. \n\nThis story is unfortunately extremely accurate on how execs talked about the sickest customers: https://theonion.com/insurance-company-gets-fucked-over-by-another-cancer-pa-1819575283/", "label": 0}
{"text": "The one scene from a movie that fucked with me for years was from IT. Where pennywise comes out of the shower drain. \n\nBruh. Anytime I took a shower I would speed through the shampoo process cause I couldn’t have my eyes closed for that long 😂", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for the following reason:\n\n* [Rule 3:](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-) Questions that are asking for an amount of something or a number are not considered open-ended questions. Try adding a followup like, \"Why?\" Or, think about if you can rephrase the question with just \"how\" and it still make sense. For example, instead of asking, \"How much did it affect you?\", ask, \"How did it affect you?\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Loli", "label": 0}
{"text": "Wawa is a private company.  It's a gas station/food joint similar to sheetz, 7/11, etc.\n\nWhat started as an actual deli with sliced meats and cheeses and freshly made sandwiches/hoagies has turned into something else.\n\nNow it's just coffee and a mediocre lunch.", "label": 0}
{"text": "tangible: a piece of land where I'd like to live\n\nintang: a promise that this land shall remain my dominion until my death", "label": 0}
{"text": "I’m not a guy but my boyfriend constantly gets told not to cross his legs or rest a hand at his waist. Super rude to emasculate any man :c", "label": 0}
{"text": "The ring", "label": 0}
{"text": "Hate myself", "label": 0}
{"text": "And a lot of the ticket resell sites. Ticket master sells to scalpers, then lists the scalpers outrageously high priced resells on their other sites, basically double and tripe dipping.", "label": 0}
{"text": "A scientist, particularly those in fields like physics or biology.", "label": 0}
{"text": "Mac and Me and ET", "label": 0}
{"text": "Old Yeller", "label": 0}
{"text": "OCD \n\nPeople online casually call things like a crooked line, mismatched colors, or lack of order ‘OCD,’ but in reality, it’s a serious disorder that can make your life miserable and in extreme cases, it can kill you.", "label": 0}
{"text": "Underrated? I don't think I've ever talked to a person that had seen the show and didn't like it. Maybe I've just been lucky.", "label": 0}
{"text": "The White Sox", "label": 0}
{"text": "I took an 8 hour advanced coffee class when I worked at Peet's Coffee. I still use the knowledge I gained to sound like a pretentious snob every chance I get.", "label": 0}
{"text": "Donald Trump", "label": 0}
{"text": "I wasted 5", "label": 0}
{"text": "Sweeney Todd is my favorite documentary.", "label": 0}
{"text": "I can't find her videos anymore, but in the early days of Youtube I happened upon this girl who had a huge crush on Richard Ramirez.  Since he's known for responding to letters, she got all giddy and excited when he wrote her back.\n\nWhen I looked at her channel, she had various other videos about how much she thought Richard Ramirez was hot, along with another video where she filmed herself laughing over a dead squirrel on the side of the road\n\nI hope she got the help she needed, because that was a disturbing find", "label": 0}
{"text": "Lululemon.", "label": 0}
{"text": "I place blame on both the companies and Uncle Sam for that bullshit.     \n\nUncle Sam: \"You should work hard and want to be your own boss!\" \n\nPerson: \"Hey, good idea!  I'm doing that.\"\n\nUncle Sam: \"Oh really?  Then in addition to income tax, you now owe me insurance taxes as well.\" \n\nPerson: \"Ok?   How much is that going to be?\" \n\nUncle Sam: \"About 1500; what?!   Don't look so sad.   If your business takes off that will be nothing!\" \n\nIt's a screw job man.   The whole thing is a damn screw job.", "label": 0}
{"text": "I am in an airport for a layover and two hours is taking two months here.", "label": 0}
{"text": "Had a guy share with me that when you use a cheap hotel parking lot hooker you must always carry an extra wallet with a few ones in it. That way when they go through your pockets they will stop when they find the decoy wallet.\n\nHe was not joking.", "label": 0}
{"text": "You are right but it's not so obvious, I think it was meant for adults to enjoy the show while sitting with the kids like inside jokes or something", "label": 0}
{"text": "My mom, my cat, and my sister ❤️ the only reasons I am still here", "label": 0}
{"text": "Maybe you buy some cookies. Maybe this all goes away…", "label": 0}
{"text": "I tried to read them all, but Bob Loblaw's Law Blog left me in a fog.", "label": 0}
{"text": "Because it seems that it’s mainly white men who want to. Pretty much all the lawmakers in the southern red states are white.", "label": 0}
{"text": "Noise reduction for subs hasn't advanced nearly as far as sub sensing technology. There's only so much you can do to not make noise, and almost everything you can do was already implemented during the cold war, rubber coating around the hull, special propeller designs, keeping your speed low, and just having everybody be quiet. There's only one other thing you can reasonably do to reduce noise, and that's to turn off the power plant at low speeds.\n\nMeanwhile, sub sensing capabilities have advanced dramatically with the use of computers. Passive sonar can already detect infrasound, now we can put sounds into a computer to determine what made it. \n\nYou pointed out that China has a greater shipbuilding capacity than us. This is true. But shipbuilding capacity ≠ ships, and in this conversation, does not mean more subs. And unless they plan to massively expand their boomer fleet, to the point that our attack subs wouldn't be able to follow them all, it's not an issue. They're not planning to, but if they did, we can restore our shipbuilding capability, which is mostly mothballed since the end of the cold war. \n\nPart of breaking out of the cold war era mindset is to acknowledge the massive changes to nuclear strategy since the 90's. First thing, we don't have 50,000 nukes, we only have 2,000  in our active arsenal, and the yield has dropped significantly. While 100% counterforce effectiveness should never be assumed, the major change is that if only a handful of nukes get through, that might be considered acceptable for a nuclear war, especially considering what we were planning for in the cold war. This increases the possibility for nuclear war.\n\nThe rapid pace of technology, especially in reconnaissance and accuracy, means this trend will continue. This undermines strategic stability, and the only obvious solution is for more countries to build more nukes. But we don't want this either, more nukes is bad, but there isn't really any other solution other than to ignore it. And in my opinion, putting your head in the sand for nuclear strategy is really, really bad.\n\nOh, yeah, and the whole hurting for bodies thing, that's old news from a year ago. While there is still some concern, all branches met their recruitment goals this year.", "label": 0}
{"text": "TERRIFYING", "label": 0}
{"text": "Intelligence", "label": 0}
{"text": "Creating my own Pokémon", "label": 0}
{"text": "Google fi \n\n0 customer service", "label": 0}
{"text": "Private Prisons treat their customers like they are criminals.", "label": 0}
{"text": "Verizon", "label": 0}
{"text": "I watched it for the first time last week because I'm on the Silent Hill train and it was apparently one of the main inspirations for that game series.\n\nI really enjoyed it.", "label": 0}
{"text": "Not a company but all US Government agencies. Especially the DMV.", "label": 0}
{"text": "All of them!", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Viagra", "label": 0}
{"text": "Most of them", "label": 0}
{"text": "All about the fry’s", "label": 0}
{"text": "I wish I had never started drinking. I wish I had never seen it as a form of “medicating”. I wish I could take it all back, all of the horrible things I’ve said and done. Luckily with alcohol abuse comes forgetting memories, but the ones I haven’t forgotten are burning.", "label": 0}
{"text": "Don’t forget the mayo", "label": 0}
{"text": "A mexican film where they buried someone alive, I think exposition to media like that at an early age gave me the anxiety I have now, never considered that until recently how exposure to scary things can impact you in ways you cant imagine", "label": 0}
{"text": "Do we get to choose what changes?", "label": 0}
{"text": "\"Here lies Vell, freaking awesome.\"", "label": 0}
{"text": "JCPenney. One register hidden in the back, no one at the jewelry counter, closed the dressing room. ", "label": 0}
{"text": "Leave all my money to something dealing with puppies or cancer the go to Mars and never set foot on earth again.", "label": 0}
{"text": "None", "label": 0}
{"text": "McDonald’s", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "My eyes water when I go to the bathroom. If I really have to go I’ll get full tears running down my face", "label": 0}
{"text": "Lodging service provided by AirBnB. They fully support the \"hosts\" who sell on their website. They strongly dislike the individuals who are the actual renters of their products/services. If you voice any grievances, AirBnB will view you as if you've committed a crime.", "label": 0}
{"text": "Oh, you're leaving out way too much. It started as a normal coconut. But dude thought he could keep using it for weeks without even attempting to clean it, then was surprised it started to rot and got infested with maggots. Didn't he discover the maggots after he found them on his penis?", "label": 0}
{"text": "Every health insurance in america", "label": 0}
{"text": "ITS DOC GERBILS WORLD", "label": 0}
{"text": "This is adorable!", "label": 0}
{"text": "Their face", "label": 0}
{"text": "Definitely the best/scariest episode.", "label": 0}
{"text": "Breastfeeding will make you have contractions and bleed.", "label": 0}
{"text": "Serenity 2.  I want to know what happens next", "label": 0}
{"text": "Are you getting fillings or root canals everytime? I don't pay anything.", "label": 0}
{"text": "Having kids thinking it will strengthen or save a fragile relationship.", "label": 0}
{"text": "married", "label": 0}
{"text": "They're Sobeys.\n\nI moved to Vancouver Island last year. There's a chain called Country Grocer here that as far as I can tell is actually independent. Thought they were more expensive at first but I think they're about on par, though it depends on what you're getting, of course.", "label": 0}
{"text": "we are curiosity engines", "label": 0}
{"text": "This sounds like Trevor, or T money", "label": 0}
{"text": "Melon", "label": 0}
{"text": "Rental car companies", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "I had puppy chow custard a few months back and I haven’t stopped thinking about it…", "label": 0}
{"text": "so many trauma inducing scenes in there:\n\n* singlehandedly induced coulrophobia in a generation of kids thanks to that fucking clown\n* human-eating tree\n* maggot steak\n* man rips off his own face\n* pool full of skeltons (that were apparently real?)\n\nI watched the sequel, too, and that was terrifying.", "label": 0}
{"text": "I mean I’m not technically licensed as anything because I only do this part time and the aircraft are all registered as experimental anyways. Because I’m kinda just helping out wherever needed for the most part I deal with minor repairs like stop drilling, oil changes, tire alignments, mostly stuff you might consider day to day (when you’ve got a fleet of 20+ aircraft each flying 6+ hours/day)", "label": 0}
{"text": "Wells Fargo", "label": 0}
{"text": "That my face turned into her best friend’s face. We were on acid. Then my inner and outer beings channeled and became her best friend.  All of a sudden I had boobs and I could feel her caress and pinch  my nipples . It was  sensual, orgasmic, and  the weirdest thing that came and went in a moment", "label": 0}
{"text": "I've got an add blocker built into this browser on my laptop I use for watching shit, so I've never seen an add on amazon. \n\nThis week I've had the place to myself and theres a 65\" 4k TV downstairs. I was like oh shit finale of Vox machina is out today, I'm going to watch it on the big screen for a change. \n\nHit play then all of a sudden \"Add 1 of 5, 40 seconds to go\" And they were all 40 seconds long. I was like what the actual fuck. Then it did another 3 at that length ten minutes into the show", "label": 0}
{"text": "my mercy prevails over my wrath", "label": 0}
{"text": "McDonalds and Walmart. Don’t care about their customers. Allow their employees to be rude and ignore customers.", "label": 0}
{"text": "There are no girls on the internet", "label": 0}
{"text": "We eloped too and I have no regrets! We had an awesome vacation abroad in EU and flew out photographers. Whole thing was $10k.", "label": 0}
{"text": "100%…know someone that got in a dumb fight after partying at an 18 and up bar after hs…one punch, head hits the concrete, dead. Also know the guy that killed him. That piece of shit was all over espn with his “redemption” story a few years later. Him and his brother were the dumbest wiggers ive ever met, fighting anyone that looked at them the wrong way. Meanwhile my friends dead.", "label": 0}
{"text": "If you were at work then it sounds like it was unambiguously a legal harassment and there were absolutely avenues you could have explored to demand she gets the fuck away from you.", "label": 0}
{"text": "what??  I'm literally supposed to pick up a car from enterprise tomorrow.  I'll be royally screwed if they don't have one.  Should I call ahead to confirm?", "label": 0}
{"text": "The 50s", "label": 0}
{"text": "To walk in cross country", "label": 0}
{"text": "In Shakespeare's \"Romeo and Juliet,\" the tragic irony unfolds when Romeo believes Juliet is dead due to a plan that goes awry. He then takes his own life, only for Juliet to awaken moments later and find him dead, leading her to take her own life as well.", "label": 0}
{"text": "Suck it up", "label": 0}
{"text": "Pest control I make around 6-8k a month sometimes more. Didn’t need any experience.", "label": 0}
{"text": "Etsy- but hates their sellers", "label": 0}
{"text": "This might sound odd, but I feel like “The Purge” is the scariest movie I ever seen. Not due to Gore or jump scenes, but rather the fact that if we have the wrong person in office, this sort of thing could really happen and be put into effect.", "label": 0}
{"text": "Freedom. Blissful freedom.", "label": 0}
{"text": "I will not call her name", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for one of the following reasons:\n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) Questions seeking a correct or definite answer, that can be researched elsewhere are not allowed on AskReddit.\n\n* [Rule 5:](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_5-) Rhetorical and loaded questions (in which you are asserting an opinion, bias, or leading respondents towards expressing a specific opinion) are not allowed on AskReddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "\"Love, Rosie\"", "label": 0}
{"text": "There’s a reason you see primarily the same type of trees as those whose leaves blanket the ground in a forest.  With exception of a few persistent species of vegetation.  If you have a thick, lush lawn growing and thriving through a thick blanket of whole leaves, then you should contact every major lawncare product manufacturer and let them know your recipe for success, because they’ll pay huge and people from far and wide would appreciate it.  Your dedicated garden isn’t exactly a prime example of what you’re saying being true.  Anecdotes don’t refute countless amounts of research.\n\nWhat I’m saying isn’t my opinion.  I’m glad the pollinators like your native plant garden and the plants that grow through the leaves that you put there, but that’s not quite the same as trees dropping a knee deep layer of leaves on your yard and I doubt your garden that you’re spreading leaves in is somewhere you’d be raking leaves from, is it?", "label": 0}
{"text": "6 zyn pouches", "label": 0}
{"text": "My negative choices got me where I'm at today and I'm surviving without hitting the lottery. I'm keeping the money.", "label": 0}
{"text": "Consult my lawyer before committing felonies", "label": 0}
{"text": "People who can read questions properly.", "label": 0}
{"text": "Spectrum.", "label": 0}
{"text": "The SONG. \n\n\"Two men walking up a hill, one disappears, and one's left standing still. I wish we'd all been ready. There's no time to change your mind, the Son has come, and you've been left behind.....\"", "label": 0}
{"text": "\"Why am I calling in sick? Well, are you sure you want to know? I can't untell you. \"", "label": 0}
{"text": "Omen.  Jaws.  Salems Lot", "label": 0}
{"text": "Piano", "label": 0}
{"text": "My ex wife", "label": 0}
{"text": "High blood pressure, diabetes, fatty liver disease and depression.", "label": 0}
{"text": "Insurance", "label": 0}
{"text": "Stir-fry", "label": 0}
{"text": "Gmork and yes. The swamp of sadness was sad but the eyes on the dark terrified me", "label": 0}
{"text": "grow up", "label": 0}
{"text": "Driving. It’s embarrassing and inconvenient to learn in your 30s, and you’re more inclined to be excessively fearful than a teen. And once you have learned, it’s embarrassing to be so inexperienced at it.", "label": 0}
{"text": "Bethesda", "label": 0}
{"text": "My grand nephew was 3 or 4 and did not want to watch it and was a huge MJ fan. So, I found some wedding videos where the bridal party did the dance and he enjoyed that a great deal.", "label": 0}
{"text": "Lululemon\n\nThe Founder/CEO Chip Wilson named the brand what it is because he said it’s funny hearing Asians try to pronounce it since “L” is difficult for them, despite its popularity in Asia.\n\nThe company was founded on racism.", "label": 0}
{"text": "This day too shall pass.", "label": 0}
{"text": "I was just watching the Mask cartoon last night and I realized I've never known there was a cartoon, I had only seen the movie before.", "label": 0}
{"text": "Eh. It has been helpful. You know how you go into a party and sometimes they have wristbands that are color-coded to show what sexuality and availability they are? That is basically what it is for me at all times. Now, can I accurately predict their exact sexuality? Not really. But I can predict if they prefer same sex relationships and avoid opposite sex relationships. I cannot tell if someone is Pansexual or Bisexual at a glance, just that they check off some boxes.", "label": 0}
{"text": "Tell me about it. I became a hobbyist luthier.", "label": 0}
{"text": "really?😳", "label": 0}
{"text": "My kids and my trust that God has a plan. That He didn’t let me die when I was in the hospital for 6 months and had four brain surgeries because He still has something for me to do. I can’t imagine what it is because I’m also left sided paralyzed now and unable to do any of my previous hobbies or my job that I loved", "label": 0}
{"text": "growing up poor. \n\nhaving things like the phone turned off, the electricity turned off, eventually having the house foreclosed on. my parents had already jumped ship and moved away, I spent christmas that year in an abandoned house with no heat or electricity. \n\nnot having reasources is traumatizing. it’s followed me into adulthood, I’m horrible with money, I’m impulsive, I’m always expecting the floor to fall out from under me at any time. I’m fortunate that I’ve ended up being somewhat successful in spite of that, i’ve been trying to save some money but instead of doing that I end up buying something to make me feel like I can have things that I couldn’t.", "label": 0}
{"text": "It's because Sean Bean is hogging all the Sean deaths", "label": 0}
{"text": "Vanilla", "label": 0}
{"text": "I am truly jealous of each and every one of you who can answer this question… if only I had a penis for just one day oh the possibilities", "label": 0}
{"text": "For the longest time, it was for my children . Then my grandchildren. Now I'm here for me. So, I guess it was a group effort.", "label": 0}
{"text": "Bud Light.", "label": 0}
{"text": "Oh man I was literally just craving some cherry ice cream a week or so ago. Haven’t had it in ages but It’s so good.", "label": 0}
{"text": "Bicentennial Man, Iron Giant, Bambi, and Independence Day", "label": 0}
{"text": "HR exists to protect the company, not the employees.  You report HR to State and Federal agencies, just like you do other employees, because HR is NOT the right place to bring those issues to.", "label": 0}
{"text": "Abusive behaviour.", "label": 0}
{"text": "EMS. I used to work as a paramedic, and dear god is the portrayal of the profession in movies and television abysmal. The terms EMT and paramedic being used interchangeably is the least of the problems.", "label": 0}
{"text": "My very last day of school", "label": 0}
{"text": "At least as of this time, Ryan Reynolds/T-Mobile haven't absolutely fucked me (or changed my plan) on Mint Mobile, and in fact they increased the monthly allotment from 4GB of data to 5GB when they bought Mint.\n\nWhen I'm rarely out and about for long stretches, I love having a deep discount cell provider that gives me the same map as T-Mo and Sprint's, even if I'm deprioritized in the event of system overload (knock on wood, it's never happened).\n\nT-Mobile actually wasn't bad either, but $56 for one line with unlimited, in a family plan with max devices on the plan (i.e., the largest discount typically available), was just still so expensive, even if it wasn't the $80 I was previously paying with Verizon. \n\nBut $180/year (or $240 if I move up to 15 GB/mo) is just too good to pass up.\n\nNot a shill, just a frugal, satisfied customer.", "label": 0}
{"text": "And also “The Labyrinth of the Faun”, my Mom thought it was a kids movie lol", "label": 0}
{"text": "*Swoon", "label": 0}
{"text": "MATILDA.", "label": 0}
{"text": "Verizon and spectrum", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n44.44% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.52\n\nThis account exhibits traits commonly found in karma farming bots. It's likely that u/Just_Use_5621 is a bot.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "A water bottle 🤓", "label": 0}
{"text": "lol reading that right now", "label": 0}
{"text": "Why?", "label": 0}
{"text": "Bruh, there was a MASSIVE discourse on Twitter, like, less than a year ago over people bitching about how expensive it is to order Door Dash/GrubHub/whatever every day because it's too harrowing to fix microwave meals. God, I wish I was joking. There were legitimately people saying it was too difficult to not just cook simple meals, but even do microwave stuff. When they got to \"microwave meals have too many histamines\" and \"I have anxiety attacks when I nuke a TV dinner,\" I wanted to reach into the screen and strangle these people.", "label": 0}
{"text": "Whole Foods.", "label": 0}
{"text": "3D tvs", "label": 0}
{"text": "Toasted sandwich.", "label": 0}
{"text": "It’s the autocorrector… and the lack of energy to correct the auto correction cause you’re so exhausted when dépression’s messes with your brain.", "label": 0}
{"text": "Pretty much all of them. They are not interested in customer satisfaction.  They are only interested in the customers money and getting it from you.", "label": 0}
{"text": "The fact they made it so you had to complain to get the appropriate level of meat is insane.  Instead of addressing the portion size they still put it on the consumer to trigger fair portions.", "label": 0}
{"text": "Store mannequins.   I don't know why, but, I just feel like they are going to start moving and I am aware of all of them and their location when I'm in a shop.", "label": 0}
{"text": "that was poltergeist 2 wasn't it?", "label": 0}
{"text": "This is kinda where my point is, all my friends talk about the drinking party they went to at school and how they just complain about having to do work in school", "label": 0}
{"text": "The doctors wouldn't share info on my kids' care with her because she wasn't a parent/legal guardian. I worked 50 hours a week on 1st shift so it wasn't like I could take them.", "label": 0}
{"text": "I told ya I was sick, but no-ooo...", "label": 0}
{"text": "Comcast. Not only do they throttle my Internet but everytime I move it's the biggest headache on earth. Most recent time they got my address wrong and shipped equipment to the wrong address. After fixing it and having them send it to my actual address they then charged me $150 because I didn't return the equipment they shipped out first time. Got the charge removed but not before getting bounced between 3 people who didn't understand that I didn't magically move 2 times in one week.", "label": 0}
{"text": "13th Ghost, naked dead shower chick had lil me terrified to go to the bathroom alone for months", "label": 0}
{"text": "That sucks, sorry.", "label": 0}
{"text": "r/girlsarentreal", "label": 0}
{"text": "The NFL. Stupid TV rules that force you to watch bad games, constantly moving teams away from their fan bases, disgusting prices for everything from merch, tickets, PPV. This whole experience sucks.", "label": 0}
{"text": "This movie ruined me using rain noises as white noise at night.\n\nIt just reminded me too much of the sound water makes in a cave 😬", "label": 0}
{"text": "I don’t have an iPhone, Mr. Defend-China-And-Tiktok-At-All-Costs", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n44.44% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.52\n\nThis account exhibits traits commonly found in karma farming bots. It's likely that u/Just_Use_5621 is a bot.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Fair enough I didn’t think anyone will go that far in the past", "label": 0}
{"text": "I want to marry my partner because I want to know that we’re equally committed to each other. I want the world to know of my endless love towards him, and vice versa. \n\nYou can live with anybody, but you can’t just marry anybody.", "label": 0}
{"text": "My momma. She lost enough people. Can't do it to her. Never.", "label": 0}
{"text": "Have you considered therapy?", "label": 0}
{"text": "I couldn’t fathom my dogs ending up in a shelter and then being split up as well. The thought of them wondering where I went and being scared, hungry, sad, cold, thirsty, lonely - I could never.", "label": 0}
{"text": "She wanted to change basically everything about me", "label": 0}
{"text": "\"there were times when i could have strangled her\"", "label": 0}
{"text": "Spotify", "label": 0}
{"text": "CVS", "label": 0}
{"text": "All of them", "label": 0}
{"text": "I dont know the name , but it was a doctor who put something like vaccume inside a women stomach to take out the ice cream that she eaten , it was only a clip from tv channel i find it by coincidence when i was 8 and till this day,  18 years later a remember my feelings", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n44.44% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.52\n\nThis account exhibits traits commonly found in karma farming bots. It's likely that u/Just_Use_5621 is a bot.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Dark Crystal. BTW I'm a huge fan of Henson growing up, but damn there's some scenes...", "label": 0}
{"text": "She tried to get me to give her my ADHD meds after knowing me for 3 hours, told me she loved me after 6. \n\nSix days in she got the exact same tattoo I have... One that my like girl picked out and was stupid AF. \n\n3 weeks in she made up some weird bogus story about an elderly employee being racist that got the woman forced into early retirement.. then went nuclear on me when I wouldn't go along with her lies.\n\nCalled the cops on me over 5 times.. tried to have my kids taken from me, tried to have me fired from my contract.. \n\nMoved her girl room across from mine without any notice... Bought multiple assault rifles including an AR-15 shortly after. \n\n\nI am on the spectrum and have a hard time reading people until it's too late. This bitch almost killed me. \n\nKimberly McConnell.. I hope you're rotting in hell somewhere you psycho. Thanks for the PTSD.", "label": 0}
{"text": "You win", "label": 0}
{"text": "Sounds like a brothel not a burger joint!", "label": 0}
{"text": "Butterscotch", "label": 0}
{"text": "Lawyer.", "label": 0}
{"text": "Pizza delivery. Easiest job on the planet", "label": 0}
{"text": "2 Oppen 2 Heimer: Atomic Boogaloo", "label": 0}
{"text": "That's nuts! I consider myself to be pretty pleased with ATT and $70 for 1Gb fibre. The fact that most places don't have municipal internet in 2024 is just sad.", "label": 0}
{"text": "New York City. It’s not that wonderful to live in as everyone thinks.", "label": 0}
{"text": "As a classically trained Messiah I take issue with your use of the phrase \"Jesus Christ.\"", "label": 0}
{"text": "Yes, pretty much any insurance company", "label": 0}
{"text": "Also before the finale, there’s an exterior shot of the entire house and it switches from day to night. It’s like second, but when it switches to night the entire house is circled by the nude cult members.", "label": 0}
{"text": "I’m not worried about it, I’m not worried about any of this! THERES WORSE SHIT ON THE LOCAL NEWS! Thisworldsfuckinsofuckedup- & people are mad at me cause I showed a buncha naked dead bodies with their spread blue butts flyin outta boxes?? *Really??* I’m done. Do what you want. I’ll kill you.", "label": 0}
{"text": "I can’t even watch it for the first time as an adult because it’s so creepy!", "label": 0}
{"text": "Fruit salad", "label": 0}
{"text": "I'm absolutely astonished their sub count went through the roof with their changes. \n\nI've paid for netflix without a break since the mail DVDs. When they brought out multiple devices to watch at one time and were like \"Love is sharing your netflix password\" I changed to the max plan and handed out the password to mates for a pint here and there on meet ups. \n\nThe moment they brought that new system, I dropped it entirely.", "label": 0}
{"text": "Dolls (1987) - haven’t trusted a doll since.", "label": 0}
{"text": "Marriage can feel like a deeper, more formal promise to stay together long-term.", "label": 0}
{"text": "Elon Musck", "label": 0}
{"text": "i'm so scared of moths, but not of spiders, flies, snakes, bees, wasps or lizards.\n\nto clarify, i'm aussie and have had multiple encounters with snakes, spiders are basically a part of life, lizards also live under my house and love it there, there's a tiny wasps nest on my porch and bees are also everywhere. flies own australia. out of all these creatures, only moths terrify me. they fly in this erratic drunk way that always seems to be geared towards your face, they have wierd powdery wings. i despise moths. i would take a lizard or bee ANY DAY over a moth.", "label": 0}
{"text": "Old friend start going after women in relationship already, He wants to break the couple up usually by giving the girl attention & spending shit ton of money on dates, then he leave them and the girl usually goes crazy...\n\nI don't even know why he done it so many times..", "label": 0}
{"text": "Even when i am reading it's so horrible, don't know how you survived. I pray, your good days come soon.", "label": 0}
{"text": "Watership Down 😭", "label": 0}
{"text": "A Jehovah’s Witness told me , all ghosts are demons or the devil trying to trick you.", "label": 0}
{"text": "No I wasn't trying to give her an excuse I was just saying. ", "label": 0}
{"text": "Electronic arts. They don't like video games. They like money. They don't care at all about satisfying customers and make genuinely good and interesting games. They only care about satisfying their greed.", "label": 0}
{"text": "Worse, I voted for Reagan in ‘84.", "label": 0}
{"text": "Thanks, gonna go watch Jim Gaffigan now", "label": 0}
{"text": "I think love bombing and any subtle form of gaslighting", "label": 0}
{"text": "Leprechaun 😭", "label": 0}
{"text": "I live in a very small town, so I kinda just assume everyone is straight as I’ve like only seen 2 homosexuals like ever", "label": 0}
{"text": "I grew up somewhere that has a ‘potato fest’ every summer, which obviously gets shortened to potfest by just about every stoner and/or high school kid in town. I’m so disappointed that this hasn’t materialized yet.", "label": 0}
{"text": "Starbucks. I swear they hate everyone.", "label": 0}
{"text": "And VISION. Like eyes are optional", "label": 0}
{"text": "Pet Cemetery", "label": 0}
{"text": "But only if the snozzberries taste like snozzberries.", "label": 0}
{"text": "The movie Speed came out when I was around 7 years old. I watched it, and just the opening scene has made me uncomfortable with elevators since then. For some reason that one moment has stuck with me for life.\n\nNot busses. I ride them fine with no issues, but elevators i absolutely hate.", "label": 0}
{"text": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for the following reason:\n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) Your question breaks Rule 3 because it is an Either/Or question that limits responses to Option A or B, and acts as a poll. Try rephrasing this to be more open-ended.\n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) You're asking a yes/no question. AskReddit is for open ended, discussion-based questions to allow for actual discussion and discourse.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "label": 0}
{"text": "Because my wife would cut my corn dog off if I said yes to her sister.", "label": 0}
{"text": "I enjoy drinking, sometimes I like drinking and smoking black and milds.", "label": 0}
{"text": "The Neverending Story", "label": 0}
{"text": "Wholemeal seeded batch with Kerrygold butter and marmite.", "label": 0}
{"text": "Maccas!", "label": 0}
{"text": "i'd rather live anywhere other than nyc", "label": 0}
{"text": "Got drunk and burned myself with a cigarette thinking it was cool. It wasn’t.", "label": 0}
{"text": "I’m glad you stayed!!!", "label": 0}
{"text": "Zuppa Inglese and There is no debate", "label": 0}
{"text": "Yes because I would want to try living a different lifestyle and have unique cultural experiences.", "label": 0}
{"text": "Any reoccurring payments, I put on reloadable debit cards, for this reason.", "label": 0}
{"text": "Being a chef. Not everyone’ experience is like Chef, Ratatouille, The Bear, Burnt… Not everyone gets discovered, not everyone finds love on the line.", "label": 0}
{"text": "Don’t spend money", "label": 0}
{"text": "It's not always the companies, the customers make you hate them and reinforce the certainty that the human race won't make it.", "label": 0}
{"text": "I think it’s better to be seen as a nice person than a rude person, so rather just embrace that. It’s hard to change who you are", "label": 0}
{"text": "BK. Burgers taste way better", "label": 0}
{"text": "Are you reading the same thing I am? He still says it was real to this day. He's been on the joe rogan experience to talk about it. He has never changed his story.\nThe movie is fictionalized and not 100% accurate to his story.\n\n\nBut yea obviously it's not real.", "label": 0}
{"text": "I like this one a lot", "label": 0}
{"text": "I’m not going to “check out Threads” either.", "label": 0}
{"text": "As stupid as the movie was, sharknado.", "label": 0}
{"text": "🤖🤖", "label": 0}
{"text": "Cherry Garcia?", "label": 0}
{"text": "The sound of a gameboy starting up", "label": 0}
{"text": "I'm actually very grateful that my parents weren't strict with the media I could consume. I believe that growing up on a media diet that was dominated by grown-up movies like *First Blood* or *Amadeus* or unsanitized all-ages movies like *Ghostbusters* or *Temple of Doom* was better for me than being restricted to Disney movies, Saturday Morning Cartoons, and E.T. knockoffs, like some of my peers were. Being exposed to stuff that challenged me emotionally and intellectually was worth the occasional freak-out after watching *Aliens* way too young. :)", "label": 0}
{"text": "this is very true", "label": 0}
{"text": "Kung Fu Hustle", "label": 0}
{"text": "Why remove ads, when you can put them there and make *even more money*?", "label": 0}
{"text": "Overreacting", "label": 0}
{"text": "Politics influence everything, especially Hollywood", "label": 0}
{"text": "Mamma mia", "label": 0}
{"text": "And do you regret it? Why?", "label": 0}
{"text": "Let's see, dance, watch anything but comedy or action movies, exist.", "label": 0}
{"text": "Broiler", "label": 0}
{"text": "I hear you. Imagine playing a wedding.", "label": 0}
{"text": "Not fast enough.", "label": 0}
{"text": "How far do I have to scroll before I see\n\nBroadcom. \n\nMicrosoft referred to them as the gift that keeps on giving.", "label": 0}
{"text": "I'm all bones bb 😘🤣", "label": 0}
