{"text": "Yeah, I’ve eaten pig eyeballs, snout, ears and tongue. They were delicious. I’m an adventurous eater, I will try almost everything once. \n\nI’m always gonna be a big NO on raw chicken and balut.", "label": 1}
{"text": "In restaurant kitchens I learned that American chickens are all sick and propped up on antibiotics.\n\nIt's the only meat I know that rots from the bone out instead the outside in.\n\nWell cooked chicken is the only way; otherwise you're working on a Darwin award.", "label": 1}
{"text": "Balut is cooked though? Or do you just mean the idea?", "label": 1}
{"text": "Cooking beef, chicken, and pork thoroughly is essential for food safety, flavor, and texture. Here’s a breakdown of the reasons why each type of meat should be cooked to safe internal temperatures:\n\n# Chicken\n\n* **Risk of Harmful Bacteria**: Chicken commonly carries bacteria such as *Salmonella* and *Campylobacter*, which can cause serious foodborne illnesses if consumed undercooked.\n* **Temperature Requirement**: Chicken should be cooked to an internal temperature of 165°F (74°C) to kill these bacteria.\n* **Texture and Flavor**: Properly cooked chicken is tender, juicy, and has a pleasant flavor. Undercooked chicken can be rubbery or mushy, while overcooking can make it dry and tough.\n\n# Beef\n\n* **Risk of Pathogens**: Whole cuts of beef are less likely to contain harmful bacteria inside, but surface bacteria, including *E. coli* and *Salmonella*, can pose a risk. Ground beef is more susceptible to contamination because bacteria on the surface get mixed throughout during grinding.\n* **Temperature Requirement**: Ground beef should be cooked to 160°F (71°C), while whole cuts, like steak, can be cooked to 145°F (63°C) with a 3-minute rest.\n* **Texture and Flavor**: Cooking beef enhances its flavor and tenderness, releasing the rich flavors and juices that people enjoy. Raw or undercooked ground beef poses a higher risk and may taste metallic or unpleasant.\n\n# Pork\n\n* **Risk of Parasites and Bacteria**: Pork may carry bacteria like *Salmonella* and, though rare, parasites like *Trichinella spiralis*, which can cause trichinosis if the meat is undercooked.\n* **Temperature Requirement**: Pork should be cooked to 145°F (63°C) with a 3-minute rest to ensure safety without overcooking.\n* **Texture and Flavor**: Properly cooked pork is juicy and tender, with a mild, savory flavor. Cooking also reduces toughness and improves overall palatability.", "label": 1}
{"text": "Yeah, the idea, the textures, the taste. \n\nI developed anosmia in my late 30s, I can’t smell anymore. It makes foods like this, or oysters even a no go anymore. I encourage everyone else to try it, for sure.", "label": 1}
{"text": "As i’ve said it is also possible to eat chicken raw. Special measures need to be taken, moreso with chicken than with steak.", "label": 1}
{"text": "*Campylobacter*... Try not to get that.  My son and I both got it when I stupidly made scrambled eggs but hadn't washed my (farm fresh, not store bought) eggs.", "label": 1}
{"text": "A lot of people are commenting on the difference in safety, and while that is definitely a huge factor, even before people knew about pathogens and whatnot, rare chicken wasn't very popular. The reason is that its just not good. Rare beef tastes better to a lot of people compared to well done, but if you've ever accidentally bitten a piece of undercooked chicken, you'd probably find that you don't enjoy the texture.", "label": 1}
{"text": "For completeness, I do think the 'porous' / 'dense' arguments are a bit of a myth. \n\nCow and Pork are prepped in a way that they remain 'internally sterile'. Bad stuff is usually in feces and intestines, so a proccess which doesn't let it mix with muscle means far far less contamination.  The inside of the meat should be safe to eat, if they don't have other concerns like worms / parasites. If you ground up the meat or cut into it, it stops being sterile / safe to eat raw/undercooked.\n\nChickens are often prepped in a pretty terrible way for staying sterile (the water soaking, plucking, and  'evicerating' steps are like \"how to push gut/bowel bacteria deep into muscles 101), so as a result, by the time they get to you they are far, far far less likely to be safe to eat raw.\n\nSome places such as Japan will have chicken sashimi, because they are prepping the meat in a way that is safer (still their highest cause of food poisoning AFAIK). \n\nBut it comes down less to the meat density, and more to the 'killing chickens and prepping them efficiently is not sanitary, while we can kill larger animals in a way that doesn't contaminate the meat or the machines that touch the meat. \n\nSources: worked sanitation in abattoir and a chicken slaughter factory.", "label": 1}
{"text": "But you're OK with eyeballs?", "label": 1}
{"text": "I ate those years ago, before I had the smelling problem. I wouldn’t do it again, but I was given them by the head of the family at an Indonesian dinner, so it was an honor.", "label": 1}
{"text": "so most balut is older than it needs to be. don't get it at restaurants since it tends to stick around.\n\nif you have asian friends who partake, if they take their balut seriously, they'll get fresher, younger eggs direct from a farm. balut is like this spectrum between chicken and egg. if you're getting it fresher like in this scenario, it'll be closer to egg with this super tender chicken. it's kinda like chicken veal really. if it's too old, it'll be more chicken than egg and both sides of the equation suffer. it gets weird and tougher. \n\noh and the broth from a nice fresh balut is divine", "label": 1}
{"text": "My limited understanding is that the meat used to make tartare is cut from a larger piece whose edges have been sterilized.\n\nCow organs (can’t recall which ones) contain the nastier illnesses.  When they’re butchered, those illnesses can be spread to the surfaces of the meat.  However, because the meat is insufficently porous as described above it only contaminates the surface.  Sterilize it via chemicals, heat, or other methods, and infection chances are low to zero.", "label": 1}
{"text": "Thank you for the information, this is the first time I’ve ever heard it described in such detail. Perhaps you’ve changed my mind. I’m still a hard no on raw chicken!", "label": 1}
{"text": "I’m like you … except raw chicken, raw pork, raw horse, and balut are all fantastic. \n\nAlso, raw cow liver, two thumbs up. \n\n(Raw horse is best.)", "label": 1}
{"text": ">but we can also eat raw steak (tartar) though?\n\nFrom my personal experience with authentic mongolian tartar, there are a few caveats to it.\n\nFirst, the dish has to be prepared and consumed as fresh as possible, in order to minimize the bacteria spread. Second, the recipe isn't just the raw meat, it involves mixing the meat with spices (in particular, minced garlic and powdered black pepper), which have notable short-term anti-bacterial effect on their own.\n\nI can imagine a similar procedure involving the chicken instead of a beef/horse (AFAIH there is some kind of such recipe in the indonesian kitchen), but that'll obviously require much more attention to the meat condition.", "label": 1}
{"text": "Thank you for your submission! Unfortunately, your submission has been removed for the following reason:\n\nIt suffers from issues listed in the AskScience [guidelines](http://www.reddit.com/r/askscience/wiki/guidelines#wiki_asking_askscience). \n\nThe question may be written in a way we believe does not contribute to scientific discussion at /r/AskScience.\n\nIf you disagree with this decision, please send a [message to the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Faskscience)", "label": 1}
{"text": "Wait. You wash your eggs?", "label": 1}
{"text": "Thank you for your submission! Unfortunately, your submission has been removed for the following reason(s):\n\n* Google 'microphone'", "label": 1}
{"text": "Yeah if people actually liked the taste of rare chicken then there would be more incentive for them to be raised and slaughtered in a “clean” way.\n\nThe reason we don’t is because there isn’t demand for rare chicken so nobody wants to foot the bill for the extra work needed to do this.", "label": 1}
{"text": "I have eaten chicken sashimi in Japan.  A bit scary, but I trust a top Japanese restaurant to source and prepare safely.  It is quite a remarkable taste and texture - soft and buttery.  Not like cooked chicken at all.", "label": 1}
{"text": "That's where my head went too, but why is this?", "label": 1}
{"text": "Chicken meat is physically close to the gut.  Removing the gut is liable to contaminate the meat.  That makes cooking and eating before bacterial traces can multiply important.  Meat can be taken from from a cow cleanly and stored for a long time in dry cool conditions.    \n\nAlso the bacteria in ruminants are designed for digesting grass.", "label": 1}
{"text": "you can eat raw fish, raw chicken raw beef and raw pork and raw veggies.  Not a problem digesting any of that stuff.  The problems are parasites and other flora and fauna.  Our digestive track cannot handle some of the raw food hitch hikers that are air water, fertilizer and soil. In the past humans were filled with parasites and we commonly died from food poisoning.", "label": 1}
{"text": "Steak tartare is chemically cooked. You start with a good cut of beef. Then add acid to \"cook\" or alter the proteins.\n\nAs for issues with bacteria, It's a little like sushi, in that you only do this with good cuts, and only the chef touches the meat. I'll only eat sushi near a coastal town. And I'll only eat steak tartare when I'm in a rural cow country, or my brother is paying for a wicked expensive meal. \n\nLiving where I am, I could easily get the right beef to make tartare. But I sure as hell won't try to make sushi this far inland.", "label": 1}
{"text": "Iirc our gut flora were also more robust for a long period of time too. Over the generations some that can handle some less clean foodstuffs has gone 'extinct'.  In hyper clean countries it's more prominent (source: I contain multitudes) \n\n(Not a good excuse to not wash hands, get vaccinated or pick your nose though)", "label": 1}
{"text": "I learned recently that you can cook chicken at lower temperatures, they just must be held at that temp for a while. Apparently the temp ranges we all know for food safety are based on the times the FDA states that require the least time AT that temp to kill the baddies. I guess chicken at 145-155 is totally fine, as long as you let it hang out there for 10-15 minutes. Problem is, that is... basically not possible to do reliably without sous vide. The video I saw on it said that it IS better at a little lower temp, and definitely more moist, but also maybe not worth the time. \n\nThe video did not explore what we would consider \"rare\" though. I'd rather go hungry than eat that.", "label": 1}
{"text": "Having seriously undercooked chicken for myself more than once when learning to cook, and comparing it to undercooked steak:\n\nChicken was harder to chew and tasted fattier/oily\n\nBeef seemed to require less jaw pressure to masticate and didn't seem to have the same oily problem \n\nThis is just my experience however and since I don't make a habit of eating undercooked meat of any sort anymore, it's a very small data set", "label": 1}
{"text": "Additional theory: ducks aren't quite as domesticated/bred for the same things as chickens or turkey so may end up with a difference there.", "label": 1}
{"text": "I undercooked some chicken last year and when I bit into it I thought, \"oh that's not cooked all the way through.\"  Then I thought,  \"this is actually kinda good.\" I ate a couple more bites and then was ok I better stop. I liked the texture and the taste. ", "label": 1}
{"text": "People eat it regularly in Japan. I had it during my last visit to Osaka, and it was actually delicious. Texture was like sushi grade tuna and flavor was great. They basically season or marinate and then sear it on the outside leaving the inside rare. I think we had it done 3 different ways. I had no stomach or other issues after either.  Agreed sure it would be popular enough for this to catch on in the US, but I enjoyed the experience.", "label": 1}
{"text": "the lack of demand is also likely due to the widespread awareness that its less safe to eat. kinda a catch 22", "label": 1}
{"text": "do you get sinus infections often? any cases of pneumonia? or any other long lasting abscesses?", "label": 1}
{"text": "Yep, but I don't have a clue if/how that's safe to eat, so I didn't want to muddle the message by bringing up questions I'm wholly unable to answer.", "label": 1}
{"text": "I have a recent blood test that just listed \"Globulin\" as within the normal range, is that it?\n\nThe gastro is going around in my area at the moment, so likely viral but the Dr didn't check. I do have occasional issues as a one off though from time to time (sounding similar to milder IBS but did not look into it).", "label": 1}
{"text": "It’s dead easy to keep it at 150 long enough. You get it to 150, pull it off the heat, and it stays that hot for at least the necessary 3 minutes. I always cook chicken to 150.", "label": 1}
{"text": "Its crunchy-squishy. Imagine if sushi had tendons, that didn't taste like anything.", "label": 1}
{"text": "that is premium chef-mafe fine dining fare\nsteak is ground immediately prior in sterilized equipment.\nit's not packaged hamburger beef from the grocery case.\nthe citrus juice/vinegar in the recipe starts a chemical process called maceration that bacteria don't survive when done properly. fresh fish muscle has the same internally sterile quality for sushi or tuna tartare.", "label": 1}
{"text": "Think slices/medallions. Reminds me of raw scallops, and it's really delicious.", "label": 1}
{"text": "All these comments ignore the obvious: bacteria live on the surface and in the intenstines of an animal. In a chicken, there is very little space between the edibles parts, the intestines, and the skin.  \n\nChicken is sold with the skin attached and intestines removed, which allows for contamination at any point of processing.  \n\nOn a cow, the animal is culled, and the intestines and skin are removed immediately. Then, the animal is sterilized with chemicals  stored in a freezer for a month or more to make the meat edible. So when a cow is cut up into sellable pieces, there is almost no skin or gut bacteria present. When those.leices are cut unto servings, there is almost no harmful bacteria present.", "label": 1}
{"text": "Maybe it would taste delicious once prepped and seasoned, but raw chicken just doesn't smell *good* and appealing like raw beef does. At least not to me. Pork smells neutral, but better than chicken when raw.", "label": 1}
{"text": "We had 3 different cuts of chicken seasoned in different ways. Not really thin, no.  Honestly, I was shocked at how nice the texture was given how it was cut. The seasoning and the dipping sauces were great also. Probably a 7 or 8/10 and I will likely have it again some time.  [Osaka Chicken](https://imgur.com/a/wRQ4wUW)", "label": 1}
{"text": "Ducks are most definitely not raised in a quality environment. Source: live in a county that farms ducks. It's just a field with a pond in the center. They mass feed the ducks and they openly walk around shitting on everything. The farms smell from a good distance away. It's hardly what I'd consider sanitary and I do my best to stay away from them.", "label": 1}
{"text": "I got 3 different sites saying 3 minutes for 150 degrees, including Serious Eats. I can't find anything more official since the FDA says 165, but to the best of my Googling ability, it seems to be 3.", "label": 1}
{"text": "Duck is extremely fatty. Maybe helps prevent bacteria from penetrating as a common vector is water, and water won't penetrate as deep with all the fat.", "label": 1}
{"text": "I used to work as an editor for an infectious diseases journal. One time I was working on a report about a case of a parasitic infection, and it was determined that the likely vector was \"sashimi of backyard chicken meat.\"\n\nThat was probably like 20 years ago, and I still think about that particular phrase all the time.", "label": 1}
{"text": "Yeah, capsaicin does have anti-microbial properties; however, the methods of butchering, storing and preparing the meats are different in important way.", "label": 1}
{"text": "I’ve had it here both in very thin slices (see through) and thicker cut. Thin slices are often brushed with an acid of some kind and maybe rolled up with a shisa leaf, which can aid in digestion. The thicker stuff is seared at the edges, and just not worth it. The taste is the same as cooked chicken, but the texture is wet. That’s really it and you’re not missing out.\n\nI also don’t think people here eat it all that regularly. It’s like horse sashimi. It’s around and it’s available, but it’s a cultural dish from certain parts of Japan. I’ve seen it more often eaten by Japanese people when they’re with foreigners to show off, but I don’t think this is a regular dish eaten all the time. They don’t keep it stocked at 711 or anything.", "label": 1}
{"text": "Where do you gather that? Japan doesn't have agricultural industry?", "label": 1}
{"text": "I don’t know about Japan’s poultry industry, but for the chicken sashimi its typically heritage breeds from farms that specialize in raising the chickens for eating raw so special considerations are in play.", "label": 1}
{"text": "I doubt Japan treats livestock much better than the US but would love to be proven wrong", "label": 1}
{"text": "I doubt many places are allowed to treat livestock as bad as the industrial cattle farms in the US. And as far as Japan goes, cattle raised for wagyu meat are treated very well, comparatively. Here's an AI generated rundown:\n\nWagyu cattle are raised with a high degree of care, attention, and specialized management to ensure the quality of their beef. The practices can vary depending on the farm and region, but here are some general aspects of how Wagyu cows are treated:\n\n1. Breeding and Genetics\nWagyu beef comes from specific Japanese cattle breeds, with the most well-known being the Japanese Black (Kuroge Washu). The cattle are often carefully bred to maintain the desirable genetic traits associated with high-quality marbling.\nFarmers might use selective breeding to ensure the lineage remains pure, leading to the distinctive marbling and texture.\n2. Diet\nWagyu cattle are typically fed a high-energy diet that includes a mix of grains (like barley, corn, and wheat) and sometimes rice straw. This diet is designed to promote intramuscular fat, leading to the marbling Wagyu is famous for.\nThey may be fed this special diet for up to 600 days, much longer than typical cattle. The diet can be adjusted to each cow’s needs, ensuring optimal growth and fat distribution.\n3. Living Conditions\nWagyu cows are often raised in a low-stress environment. They are given ample space and are sometimes raised in small herds to avoid competition and stress, which can affect meat quality.\nSome farms pay extra attention to cleanliness and comfort, ensuring the cows have soft bedding and are protected from extreme weather.\nIn Japan, farms might go to great lengths to ensure that the animals are calm, such as playing soothing music.\n4. Care and Management\nFarmers closely monitor the health of Wagyu cattle, checking their diet, weight, and general well-being. If a cow is stressed or unwell, it can affect the quality of the beef, so maintaining their health is a priority.\nThere’s a belief that some Wagyu farmers massage their cattle to relieve muscle tension, although this is less common than popularly thought. However, it is true that some farms take extra steps to ensure cattle remain relaxed, including providing shade and comfortable living conditions.\n5. Longer Rearing Period\nWagyu cattle are often raised for a longer period compared to other beef cattle. While typical beef cattle are slaughtered at around 18-24 months, Wagyu may be raised until 30-36 months. This longer rearing period allows the cows to develop the characteristic marbling and flavor.\n6. Regional Differences\nDifferent regions in Japan (e.g., Kobe, Matsusaka, and Omi) have their own standards and traditions for raising Wagyu. For instance, Kobe beef comes from cattle raised in the Hyogo Prefecture, where strict criteria must be met to label the beef as \"Kobe.\"\nOverall, the treatment of Wagyu cattle is centered around minimizing stress, providing a balanced diet, and maintaining ideal living conditions to produce the highest quality beef.", "label": 1}
{"text": "The specialized practice of Wagyu really isn't relevant to the quality of the rest of Japan's beef industry. What was the point of this post? You could have just asked the AI to tell you about the normal industry instead of an irrelevant summary of wagyu", "label": 1}
{"text": "I've had small pieces of raw chicken in japan once, but i'm sure they have high standards", "label": 1}
{"text": "Seriously. You were talking about feeding the masses, not the ultra rich", "label": 1}
{"text": "Wagyu is the name of japanese cattle breed that we use in the West, so wagyu applies to their normal industry.  Not all cattle are raised to be A5 quality but they still dont factory farm.  Beef is not a big part of their diet so they dont need the volume that we do in the US.", "label": 1}
{"text": "Chicken Sashimi is the only thing my brother in law eats in Japan that I couldn’t make myself try. Fugu? No problem. Raw chicken that had been slightly singed by a blowtorch? Nah, fam. I’m out.", "label": 1}
{"text": "Well, surely you could fire it almost straight up but adjusted a bit to make it come down where you want it (missile guidance must account for the coriolis force anyway, in a normal trajectory also).\n\nNote that in a normal ICBM launch all the stages do not burn to completion, the final stage has a \"thrust termination\" system to cut off when the missile has exactly the right velocity to hit the target. But I guess at least the first stage needs to burn out, so there is a minimum velocity.\n\nIn addition to lofted trajectories, another way to hit close targets is a \"depressed\" trajectory, where it flies on a low-altitude path. In that case there *is* some limitations on how short you can make it, because flying through dense atmosphere will put too big loads on the missile so you can't make it *too* low.\n\nI would guess if there is a limitation in how close you can launch it, it would mostly be in assumptions in the targeting software.\n\nYou often see stated that the ICBMs that Ukraine inherited from the Soviet Union had a minimum range of 5,000km and therefore could not hit Moscow, but I have never seen any explanation of what this is based on. I kind of suspect someone misunderstood the definition of ICBM (\"a missile that can go further than 5,500km\") to mean that it could not go closer than that...", "label": 1}
{"text": "No you don't. They are vaccinated for other things, but not salmonella. Mammals naturally have ecoli in their digestive system, birds and lizards naturally have salmonella. \n\nAnd eggs in Europe are recoated with a mineral oil to seal them, which is why they don't need to be refrigerated. Just as my unwashed eggs can sit on the counter for months and still be fine. In NA they wash the eggs and don't seal them, allowing the natural salmonella to multiply if not refrigerated.", "label": 1}
{"text": "Thank you. \n\nDipahits can't use google apparently.", "label": 1}
{"text": "And they are wrong, or you are not reading it correctly. \n\nThe vaccines given to chickens REDUCE the potential for salmonella buildup. It specifically states that it does not eliminate salmonella and precautions are still required. \n\nThis simply helps due to the crowding factors in industrial farming. Salmonella is rarely, if ever, a factor in low intensity chicken facilities.", "label": 1}
{"text": "You can easily target the launch site (unless its software blocks that). It will be a trajectory that's not perfectly vertical but very close to it.", "label": 1}
{"text": "sweet bread? what's that? stupid .od bot asking for extra letters when it's such a simple question..", "label": 1}
{"text": "You can if you sous vide it for a much longer time. Cooking temps are a function of time. You're supposed to cook chicken to 165°F because at that temp you can remove it from the heat immediately and eat it. You can cook it to a much lower temperature for a much longer time and still be safe. But I'm told the texture of rare chicken is not appetizing at all.", "label": 1}
{"text": "I eat raw chicken sometimes, if it’s decent chicken from the butchers. I don’t get ill from it. \n\nAnswers to your questions:\nA: Most chicken is raised in terrible conditions and is dirty and germ riddled\nB: our immune system is crap\n\nBy the way, don’t eat raw chicken if you’re not sure.", "label": 1}
{"text": "Hippos love impressionist self-portraits. \n\n They taught our most ancient ancestors how to do them, and those results can still be seen in so-called \"cave paintings\" to this day. \n\nI don't see what part of that is so hard to understand.", "label": 1}
{"text": "Heh, probably a matter of perspective - 1000 hens on a family farm is a large operation. My grandpa had about 100, the most I knew of was a cousin with 250. On a factory farm they probably pack 1000 hens in a 10x10 area and have 2000 of those across 9 hen houses on every farm.", "label": 1}
{"text": "\nMy Mom gave me raw ground beef chunks as a treat when I was good as a kid. She got upset when I helped myself to some raw ground pork one time, thinking it was the raw ground beef. I didn't get sick, but she said it's unsafe because pigs are dirty. I found her reasoning to be pretty weak, but still, I only eat raw ground beef and not the raw ground pork.", "label": 1}
{"text": "My Mom gave me raw chunks of raw ground beef right  from the package if I behaved, or on some special occasions while groeing up. A little salt and it's still one of my favorite treats. Just a golf ball size chunk at a time, once or twice a week. No one ever tries it when I offer, and some people really seem bothered by it.", "label": 1}
{"text": "I can't provide an answer with any helpful information. But allow me to answer a question with a question\n\nHow do people know how to perform our own elaborate courting rituals? Sure they are behavioral and we sort of figure things out through a social osmosis: we learn from seeing others and then we replicate.\n\nBut how do we do that, and how do most people seem to do it automatically?", "label": 1}
{"text": "It's learned during infancy or young adulthood by observing the adults perform it. Great Pandas for example have lost this behaviour in captivity, because the early ones were taken as infants who never observed this behaviour. This behaviour is however very important to get them in the mood so that's why it's so difficult to breed.\n\nAnother maybe easier example to understand why it's definitely not genetic are humans where courting behaviour is essentially just us flirting. We aren't natural flirters, we learned it by observing either adults or we learned through trial and error. \n\nThe thing about courting behaviour is that it's more important than non-experts think, because it generally sets the mood for what's to come afterwards. Be it gifts that are presented to the partner, a nicely built nest, impressive calls or expert flirting, if they are done correctly, they will lead to a hormonal shift in the partner which sets the mood for sex. Without courting behaviour, it would be the equivalent of walking up to someone and ask them to have sex directly. Which may work of course, but the success rate is pretty low. You can try it out yourself on the street if you want to, but I don't recommend it.", "label": 1}
{"text": ">Another maybe easier example to understand why it's definitely not genetic are humans where courting behaviour is essentially just us flirting. We aren't natural flirters, we learned it by observing either adults or we learned through trial and error.\n\n\nIn other words, it is definitely not genetic because we cannot do it naturally and had to observe it.\n\n\nWhat do you mean we aren't natural flirters? I disagree and state we are natural flirters. Now we have each provided as much evidence for either side of that argument as each other.\n\n\nThis is just a bare assertion and doesn't support you saying it is \"definitely\" not genetic.", "label": 1}
{"text": "I'm pretty sure it can come at the same time.  That is,  beta or alpha decay will give off a gamma ray also.  It's possible that this is a simplification and that the gamma ray comes some tiny fraction of a second later with its own half life. \n\nBut remember alpha,  beta, gamma particles are named in Greek because they are in order of ease of detection,  and named before we knew what they were.  Alpha decay (not the same as an alpha emitter) is so named because it was the first thing we could study. Neutron and positron decay didn't even get Greek names because they weren't studied until later.", "label": 1}
{"text": "Because memories and behaviors are imbedded in RNA. Monarch butterflies know their way back \"home\" even though they are generations removed from having made the trip in the past. Planarian worms can regrow brains that have the same memories as brains that were cut out and removed. And this RNA coding even stretches across species. In one study, scientists trained hamsters, sacrificed them, then injected their RNA into rats. The rats in turn adopted those learned behaviors. [Cross-species transfer of learning: effect of ribonucleic acid from hamsters on rat behavior. (pnas.org)](https://www.pnas.org/doi/pdf/10.1073/pnas.54.5.1299)\n\nFascinating stuff!", "label": 1}
{"text": "I know this is far fetched but would it be possible to do this to humans, too? Or is it too unreliable?", "label": 1}
{"text": "There is probably no bacteria that we are immune to - just that in low enough quantities or when cooked it doesn’t cause us problems.  Or that is is part of a symbiotic relationship, so that it is part of our natural gut flora. \n\n\nFor viruses there are plenty of plant viruses that don’t cause any harm to people - I think all of the mosaic virus class (tobacco mosaic virus and cauliflower mosaic virus).", "label": 1}
{"text": "Would you have, by chance, a more recent bibliography? Sounds truly fascinating, but genetics have evolved so much since 1975.", "label": 1}
{"text": "We're well on the way to doing that. Scientists are digging into the role of long non-coding RNas and disorders such as Alzheimer's and PTSD with the ultimate goal that we will be able to \"transplant\" memories.\n\nMaybe these guys were on to something? [The Little Known Ritual of Endocannibalism - SevenPonds BlogSevenPonds Blog](https://blog.sevenponds.com/cultural-perspectives/the-little-known-ritual-of-endocannibalism)\n\nHere's a more recent experiment with snails: [Memory Transferred between Snails, Challenging Standard Theory of How the Brain Remembers | Scientific American](https://www.scientificamerican.com/article/memory-transferred-between-snails-challenging-standard-theory-of-how-the-brain-remembers/)", "label": 1}
{"text": "Believe it or not you are covered in bacteria all over your skin, you have bacteria in your gut, your mouth, part of your reproductive tract etc. It turns out these bacteria are desirable and form part of our bodily defenses against pathogens. How? Well under normal circumstances that bacteria on your skin does not harm you it may eat the oils and other things you secrete. But they also compete for space on your skin. They are not going to just give up this valuable resource rich real estate to some pathogen that comes along to eat their food so the good bacteria dies. No Siree, those bacteria are not giving up their spot without a fight. So they  outcompete the bad bacteria, eat the food, take over all the space so there is no easy entry point for some pathogen. This is for their own self purposes of course, to eat and survive. But it turns out it also protects us. The good bacteria out competing the bad bacteria is desirable. Without them there is always the risk that a pathogenic bacteria could move in and they could cause damage.", "label": 1}
{"text": "I'm sorry, we shouldn't accept a far-fetched study as serious evidence if few people have ever successfully replicated it since 1965. Especially since it seems like a pretty straight-forward study using 1965 technology.\n\nI found a paper in 2018 doing a similar thing with sea slugs, and articles from a year later were referring to this as a \"controversial study.\"\n\nThis is definitely not settled science.", "label": 1}
{"text": "I don't have a super specific example, but some bacteria that can survive and reproduce in very extreme environments like deep underground seem effectively immortal and have incredibly slow, but active, metabolisms. But most of what we think we know about them comes from genome sequencing and not directly observing or testing them because the conditions they live in are difficult to replicate while observing them. We could learn more generally about cellular processes and microbiology which could have implications for medical stuff down the line.", "label": 1}
{"text": "I've heard you can get rid of scar tissue with scrubbing, in some contexts.  Do you know anything about that?  Asking as a guy with a fair number of scars, but doesn't really care if he has them.  So for interest's sake.", "label": 1}
{"text": "I assume that means scrubbing the wound clear?\n\nThe general idea behind that is that cuts tend to leave foreign matter and bacteria and other nasty things in the wound which inhibit wound healing and cause inflammation. That means scar formation is much more likely. By cleaning the wound properly with soap and scrubbing you can ensure that the wound is healthier and so is less likely to heal as a scar.", "label": 1}
{"text": "Not who you replied too, but in my personal experience it was more whether the wound could be tightly closed. If a chunk of you is missing that will generally heal much worse than a surgical incision.", "label": 1}
{"text": "Like electrons, protons and neutrons in the nucleus are arranged in shells. We have the nuclear shell model to describe how they are arranged.\n\nhttps://en.wikipedia.org/wiki/Nuclear_shell_model\n\nSo, considering the electrons fill the shells in very pre-determined ways, you can assume the protons/neutrons also do the same thing. Of course, the Heisenberg uncertainty principle has things to say about how accurately we can know the position and momentum of those small particles.", "label": 1}
{"text": "I thought I had a grasp on how atoms work. Then I read “doubly magic quantum nuclei.” ", "label": 1}
{"text": "Does that mean that particles in the nucleus are also smeared, just much more compact?", "label": 1}
{"text": "Even in stable atoms, there's a lot of uncertainty in what the actual configuration of the nucleus is. So that alone answers the question. But this is an especially pertinent factor when it comes to radioactive element decay chains. You see, after a nucleus flings off an alpha particle or an electron/antielectron and an antineutrino/neutrino to flip a nucleon from a neutron to a proton or vice versa, the nucleus you end up with afterwards, while lower energy than its predecessor, is usually not arranged in the most stable configuration for that isotope. So it reshuffles itself to minimize the electrical strain and energy levels of each individual nucleon. Much like how an electron going from a high to a low energy state emits a photon, this process also emits a photon - except since the particles here are jammed much closer together, the amount of strain reduced is much greater, so the energy released is greater as well. Hence, you see really high energy photons released in the process, which are gamma rays.", "label": 1}
{"text": "They are, and relative to their size the \"smearing\" is even more radical than it is for electrons. \n\nThe shell model of electrons treats full shells as basically being multiple copies of the single-electron orbitals. This works quite well because electron-electron interactions in most atoms are relatively weak compared to the electron-nucleus interaction. That lets you treat individual electrons as being like a \"smeared out\" version of themselves, regardless of what the other electrons are doing. \n\nIn a nucleus, there is no heavy central object whose location roughly organizes the behavior of the nucleons. Instead, you have to treat all of the protons and neutrons on equal-footing with each other. This ends up looking more like the collective behavior of condensed matter physics than the individual electrons of atomic physics. You have to start treating the protons and neutrons as Fermion fields, rather than individual particles, and this leads to the Yukawa theory of [mesons](https://en.wikipedia.org/wiki/Meson).", "label": 1}
{"text": "Your question has been answered but I wanted to add that while the MIT Physics youtube channel is evidently quite dry a short video visualising the nucleus was just published and it discusses the organisation and movement of nucleons in several interesting example elements. The 3 minutes from 3:30 to 6:30 are germane. \n\nhttps://www.youtube.com/watch?v=ach9JLGs2Yc \n\ncredit: Rolf Ent from Jefferson Lab, Richard Milner from MIT, James LaPlante from Sputnik Animation", "label": 1}
{"text": "And these different states for the same number of protons and neutrons are called [nuclear isomers](https://en.wikipedia.org/wiki/Nuclear_isomer), where a metastable state is denoted by putting an \"m\" after the mass number, like e.g. ^(99m)Tc.", "label": 1}
{"text": "Yes, atomic nuclei can shift between different configurations, though it’s a bit more complex than simply \"ordering\" protons and neutrons in specific ways. This behavior is governed by the principles of nuclear structure and quantum mechanics, and it can affect nuclear stability and energy levels.\n\nNuclear Shell Model and Energy Levels\n\nThe nuclear shell model describes how protons and neutrons in a nucleus occupy specific energy levels or shells, similar to electrons in an atom. In this model, protons and neutrons (collectively called nucleons) fill discrete shells based on their energy. Certain configurations, particularly those with \"magic numbers\" of nucleons (like 2, 8, 20, 28, etc.), are exceptionally stable because these numbers correspond to completely filled shells, which minimizes the nucleus's energy.\n\nShape and Configuration Shifts\n\nSome nuclei can shift between different configurations or shapes due to internal nuclear forces:\n\nSpherical vs. Deformed Shapes: While some nuclei have nearly spherical shapes in their lowest energy state, others can adopt deformed (prolate or oblate) shapes. This shift between shapes can happen as nucleons interact within the nucleus, particularly when it’s excited by energy (like from collisions or radioactive decay processes).\n\nIsomeric States: In some cases, nuclei can exist in isomeric states, which are long-lived excited states with distinct energy configurations. For example, the protons and neutrons may adopt different arrangements with respect to spin and pairing, resulting in higher or lower stability in each configuration.\n\n\nCollective Modes and Vibrations\n\nNuclei can also undergo collective modes of motion:\n\nVibrational States: Some nuclei can oscillate or vibrate, where nucleons move in collective patterns. This often occurs in heavier nuclei with many nucleons.\n\nRotational States: Deformed nuclei (those that are not perfectly spherical) can also exhibit rotational states, where the entire nucleus rotates, leading to specific energy levels associated with the rotational motion.\n\n\nNuclear Transitions\n\nThese configurations and shapes can affect how nuclei transition between energy levels, emit radiation, or undergo decay. For instance, a nucleus might shift between shapes or configurations as it moves to a more stable, lower-energy state, releasing energy as gamma rays in the process.\n\nIn summary, while nuclei don’t have a simple, fixed set of configurations like a crystal structure, they do have preferred arrangements and shapes that correspond to minimum energy levels. These configurations and shapes can shift based on the nuclear forces and energy levels, resulting in the complex and fascinating behavior we observe in nuclear physics.", "label": 1}
{"text": "This has been my experience with physics. I took 2 years of physics in college. Thought I had an ok understanding. Turns out just about everything I thought I knew was just another layer of simplification.", "label": 1}
{"text": "'magic' just means 'a particular arrangement/count of hadrons which is more stable than others within a local range of configurations'. \n\ndoubly magic just means that both the protons *and* the neutrons have a so-called magic count.\n\nIts magic in the same way that 'please' is the magic word.", "label": 1}
{"text": "My apologies, I meant that HIV is capable of attacking and destroying WBC. From my understanding it’s the only well documented virus which is capable of directly killing a WBC.", "label": 1}
{"text": "You beat me by 52 minutes.   \nI can remember training pest control tech in a German Cockroach infestation.  Spray 4 ft and down, they don't go over 4 ft up the wall.  \nI went into an apartment where they were complaining about roaches.  I could not find the roaches I looked 4 ft and down.  Finally I looked up and saw the antennae behind trim at ceiling.  Sprayed and cured the problem.  \nThe German Cockroaches had changed their habits from pressure we were putting upon them 4 ft and down.", "label": 1}
{"text": "Why were they originally only 4ft and below? What's the benefit?", "label": 1}
{"text": "Bugs. Lots of bugs. Bedbugs evolved from cave dwelling batbugs. \n\nGerman cockroaches are pretty much entirely a cosmopolitan species. They've been living in our homes so long that they can't really make it in the wild.", "label": 1}
{"text": "My hypothesis is that food generally is 4ft and below. No reason for a roach to be where there isn't food and a place to hide.", "label": 1}
{"text": "This is actually a good question \\^\\^\n\nThanks to you, I've found this very instructive thread on the subject: [https://www.reddit.com/r/HaircareScience/comments/lrd41m/why\\_did\\_my\\_hair\\_get\\_darker\\_as\\_i\\_grew\\_up/](https://www.reddit.com/r/HaircareScience/comments/lrd41m/why_did_my_hair_get_darker_as_i_grew_up/)", "label": 1}
{"text": "I think urban foxes are a good example of how animals can adapt to city life. They’ve learned to live in towns, using parks and backyards to find food and places to hang out. [There’s this YT video](https://www.youtube.com/watch?v=R_KZHSZUIvI) that shows them in action... definitely worth a watch. It shows how they move through the city, and even interact with humans. They really become pretty smart at taking advantage of the urban landscape.", "label": 1}
{"text": "They bite. You can also be allergic to their poop. It causes a rash or breathing issues.", "label": 1}
{"text": "Very interesting reads. I just assumed it was because kids spend more time in the sun than most adults.", "label": 1}
{"text": "Anecdotally, before puberty I had pin straight, wispy bright blonde hair\n\n\nNow I have thick, dark brown, tight locked curly hair", "label": 1}
{"text": "> City raccoons are smaller \n\nThat's interesting because it's been the opposite in my experience. City racoons are humongous.", "label": 1}
{"text": "This is slightly related, but I remember when my parents got those \"roach repellants\" that plug into the wall. We quickly went from many roaches to essentially zero roaches. I was surprised, since I've consistently read they were scams/ineffective.\n\nA year later, the roaches returned. This time, they had black stripes across their body. Different species, but it was still interesting.", "label": 1}
{"text": "I would guess, (because I don't know for sure) it was closer to where the food was and also lots of places to harborage (hide).  Drawers, cabinets, ovens etc.", "label": 1}
{"text": "I believe they went higher because we were spraying the heck out of 4ft and lower.", "label": 1}
{"text": "Yea, I don't think anything will ever be a permanent solution.  Even our pesticides become less effective.  Roaches don't become immune to an insecticide but they become resistant to a family of pesticides .  That is why your pest control operator should change pesticides from time to time.  \n\nI have found one with two active ingredients so if one doesn't kill 'em the other should.", "label": 1}
{"text": "I have seen baits do amazing things, when used properly.  When I first started using baits I did not use them according to label. ( I applied them like they were caulk, long beads.  They should be applied in dots (.25 gram dots on average).  When you find the one your roaches / ants like, they will almost try to steal it out of your hand.   \n\nThey do not work as fast as sprays, but they do last longer (up to 4 weeks).", "label": 1}
{"text": "You will not starve a roach. Don't even bother. You can however dehydrate them, so removing water sources has been very effective in my experience.", "label": 1}
{"text": "My brother and father had sandy straight light brown hair that turned dark brown and very tightly curly.  Not the women,", "label": 1}
{"text": "Does this apply to highly targeted biologics such as IL-17A/F inhibition  ? My allergies seem to have kicked off ! ", "label": 1}
{"text": "Oh very interesting! As far as I know, that drug has been designed to be very specific in that it should technically only target interleukins that cause inflammation. Since 17A promotes IgE production, I expect the drug to also dampen allergies.", "label": 1}
{"text": "when you are immunocompromised its not a quantum state of i.e. immune system working at 100% or not working and at 0%.  Think of it as more your immune system is working or your immune system is f-upped. My GF has MS and is severally immunocompromised due to the drugs she is taking.  When she gets sick she gets really sick because her immune system in not working well and on the flip side it seems like every week she has a new allergy.  But the allergies change over time.  Sometimes she is allergic to oranges sometimes she is not - its food russian roulette.", "label": 1}
{"text": "Would you happen to know which of those 5 antibody types are produced in the spleen, if any? I had a complete splenectomy, and I'm curious to know if I'm missing any of the major groups.", "label": 1}
{"text": "Fantastic answer, thank you so much. \n\nThis surgery was just shy of a decade ago, so I'm perfectly recovered. My surgeon at the time informed me of an uncommon occurrence where a small accessory splenule might grow in place of the old one, as well", "label": 1}
{"text": "I've had immunity suppresive therapy because of a bone marrow transplant (got aplastic anemia) and where extremely intolerant to pollen while on medication. Fine now though", "label": 1}
{"text": "That’s really interesting. Anecdotally, since I started Taltz (a biologic immunosuppressant for psoriasis) it seems like my allergies to both cats and seasonal pollen have disappeared.", "label": 1}
{"text": "Oh that very interesting. As far as I know Taltz targets interleukin 17, which has been linked to allergic rhinitis! That could explain why.", "label": 1}
{"text": "Different types of cells, with different types of jobs….\n\nT Cells and B cells (to a lesser degree) - mediate immune rejection\n\nMast cells and IgE affect allergic responses - which is what most medications for allergies target.", "label": 1}
{"text": "That would make sense, allergic rhinitis is exactly how my allergies normally manifest! It’s been very interesting to me how big of a difference Taltz has made in my quality of life that is completely unrelated from clearing the psoriasis patches.", "label": 1}
{"text": "That's super interesting, as Cosentyx (another IL-17 hitter in the same category) is what's been working for my spondylitis and I also have lifelong issues with idiopathic rhinitis. Granted, mine haven't really been clearing up under treatment, but I guess it *could* at some point?", "label": 1}
{"text": "Oh those long-ago beach days ruining my hair with lemon juice to look like Barbie", "label": 1}
{"text": "Our son has mirage syndrome.\n\nIt is very rare and ultimately he struggles with fighting infections. He is 2 and we give him steroids to push back against all kinds of things from pneumonia to gastrointestinal issues. Pretty concerned the steroids will become less effective / stop working  some day. Have you ever heard of this genetic disorder?", "label": 1}
{"text": "You have a similar situation with my mom. Was wondering why her hair type became so different, and this made sense.", "label": 1}
{"text": "This is my first time hearing this condition and it sounds like a lot of work to deal with.", "label": 1}
{"text": "It’s a lot. I get IVIG infusions every few weeks, and am in the doctor’s office (I have 8) all the time. I’m on a host of meds, and I’m so exhausted all the time that my physical health and work performance has suffered.\n\nBut. Had I been born 10 years younger, I’d have never made it to 48. I wouldn’t have built a great career. I wouldn’t have met the woman I love. I have two great kids, and because of medical science, I’ll get to watch them grow up.\n\nSo that keeps me going and keeps me thankful.", "label": 1}
{"text": "House mice. They're literally everywhere humans are, but they don't live outside. Only in our structures.", "label": 1}
{"text": "As a normal person with no scientific background\n\nI think you are right. Since it's only singular atoms, they are not big enough to cause that kind of ripple effect. Imagine it like a pool table, but the table is 10km² big, with the same amount of balls. They are just too small and too far apart", "label": 1}
{"text": "ask yourself why they don't make sound. which would be a coherent wave of particles. a nitrogen molecule moves at that speed, but all others are too. their direction is not synchronised. they keep colliding and passing energy.", "label": 1}
{"text": "What medium would this particle create a sonic IN?\n\nA sonic boom is a compression and rarefaction wave moving at the speed of sound. One particle moving at this speed (or all particles moving in random directions at this speed) would not impact enough other particles in the same direction to create this wave, like a macroscopic high speed jet airplane does.", "label": 1}
{"text": "Sound consists of corrated motion of air molecules. Motion of individual gas molecules doesn't have enough energy to be detected as sound.\n\n\nA similar question would be: why is a single water molecules not wet? If you see what I mean.", "label": 1}
{"text": "A sound wave is caused by trillions and trillions of air molecules being displaced at the same time by the movement of some surface pushing on them, which results in an increase in pressure at that surface, since there are now more molecules in that space than in other equivalent spaces. \n\nThat pressure increase then moves away from the surface, through both the movement of individual particles and collisions of particles with others, leaving behind a lower pressure zone. \n\nThose two things are called compressions and rarefactions, and they make up sound waves. Repeated vibration of the surface results in repeated compressions and rarefactions, which we hear as sound. \n\nThe amount of pressure difference between the compression and rarefaction is related to the volume of the sound. The speed of travel of the compressions and rarefactions is the speed of sound.\n\nA sonic boom is created by a surface moving through air at the same speed as sound. This means that the air is continually compressed, because the compression is moving away from the surface as fast as the surface is moving; so it is not moving away at all. The eventual pressure difference is extremely high, which is why we get a sonic \"boom\"; it's a very loud sound. \n\nThese behaviours are the property of bulk behaviour of particles interacting with each other, not the property of individual particles. The nitrogen molecule you speak of does not create sound; the difference in pressure between a trillion nitrogen molecules in one place and 0.9 trillion in other place does, when repeated, somewhere between 20 and 20,000 times every second. The nitrogen molecule can be *part* of a sonic boom, but is not a sonic boom, in the same way a water molecule can be part of a tidal wave, but is not a tidal wave and cannot create tidal waves.", "label": 1}
{"text": "Ok but how about other radiation?\n\n1 molecule traveling at that velocity colliding with 1 other particle is still releasing a lot of energy all at once right?\n\nHow efficient is the transfer of momentum between those particles?  The difference must be released as heat/light/sound/something right?", "label": 1}
{"text": "_slightly_ off topic, but 500 m/s is the average velocity of all the molecules. There will be extreme variation in the actual velocity of each individual molecule. So much that in a warm glass of water, some faster molecules will escape the surface tension and evaporate even though the temperature is well below boiling (“off gassing”). Which is why water can evaporate from the window sill, for example.", "label": 1}
{"text": "They just bonk into each other and bounce off with new directions and velocities.", "label": 1}
{"text": "They say they just find a nice spot and extract energy from their surroundings. \nThey have a lifespan tho. I think purple ones are supposed to be older. \nStill room for loopholes tho so yea", "label": 1}
{"text": "At what speed would a single molecule need to travel to create a sonic boom? Can it?", "label": 1}
{"text": "Another way to think about it:\n\nIf a sonic boom is a standing ovation in a packed concert, a single atom hitting another is like a single person in that audience clapping. Chances are, it is too small to hear.", "label": 1}
{"text": "the string is usually required to be in tension for it to work so I would think it would be closer to the solid speed.\n\nactually it's probably related to the natural frequency of the string at that tension.", "label": 1}
{"text": ">while a string is a solid, it behaves more like a liquid\n\nTo avoid heading down a path of misconception, I’d instead say that all solids are deformable. Liquids have no tensile or shear strength; a string certainly does. ", "label": 1}
{"text": "Hmm, good point. I would think that it would be more like how tension changes are propagated through a spring, only faster due to the string being less elastic. ", "label": 1}
{"text": "Sound travels through the string as a compressive wave, same as in solid or liquid or air. Different string materials will have different speeds of sound but I’d bet any house-hold string would have a higher speed of sound than air.\n\nI work in acoustics.", "label": 1}
{"text": "Good point. As I was discussing in another branch of this thread I think it would be more appropriate to think of the string as acting like a very stiff spring instead. The tension would propagate down it's length at a dampened rate due to the material's elasticity. Would be a fun experiment ", "label": 1}
{"text": "# A nitrogen molecule at room temperature moves at about 500 m/s. Why doesn't this or gas particles create a sonic boom?\n\nat the age of 13 i asked my physics teacher, why we don't hear a sonic boom every time we turn on the light. after all photons move at light speed, which is clearly hypersonic...\n\nyes and no. it's about air, but not about molecules. 78% percent of all \"air molecules\" **are** nitrogen molecules\n\nbut the sonic boom is an effect caused by displacement of resp. shock waves in air (from compression by a fast moving **object**). a single molecule is not a macroscopic object in this sense", "label": 1}
{"text": "It can't. What OP is missing is that the average direction/magnitude of each Nitrogen atom in the air is 0. The air is not moving, even tho every atom is moving very fast. So the total energy (from movement) is 0.\n\nI suppose if we calculated the energy needed to move the entire room of air at mach speeds, and then calculated how fast a single atoms mass would need to be moving (most likely beyond light speed)...then there is a number theoretically possible to get the entire room of air moving with 1 atom. But you'd be hitting limits like nuclear affects, you'd be splitting atoms at those speeds and the energy would turn into radiation parts", "label": 1}
{"text": "I'm thinking this: When you're using it, you're keeping tension in the string.  The wave would be areas of increased or decreased tension rather than actual compression of the material.", "label": 1}
{"text": "The wave's whole existence is based around the inertial and elastic properties of a material. Inertial - its mass - makes it less prone to moving and slows the wave. Elastic - how hard it pushes back when you push on it - tells us how little movement of one section of material is needed to get the next piece moving.\n\nSo, the speed of the wave depends on the square root of (the rigidity over the density). A spring is not very rigid, so waves travel slowly. Solid steel is very rigid, so waves travel quickly.\n\nThe \"speed of sound\" in a material is measured for bulk solids. The 'straight line path' of a wave. Springs don't let you apply that, but a straight string under tension does (so long as it remains under tension).\n\nhttps://phys.libretexts.org/Bookshelves/University_Physics/University_Physics_(OpenStax)/Book%3A_University_Physics_I_-_Mechanics_Sound_Oscillations_and_Waves_(OpenStax)/17%3A_Sound/17.03%3A_Speed_of_Sound#:~:text=Recall%20from%20Waves%20that%20the%20speed%20of%20a%20wave%20on,v=√Bρ.", "label": 1}
{"text": "Go for it. Seems easy enough to test with a speaker, a microphone, and an oscilloscope.", "label": 1}
{"text": "Or to look at it from another direction, the partial pressure of gas molecules comes from all directions.  It takes molecules flowing together on similar vectors to create a wave.", "label": 1}
{"text": "The demon core was below the mass/density required to achieve a plutonium bomb.\n\nWith uncompressed delta phase plutonium you need 16kg of material, and the demon core was only 6.2 kg.\n\nhttps://en.wikipedia.org/wiki/Nuclear_weapon_design#Pure_fission_weapons\n\nThe demon core reached criticality and became a mini-nuclear reactor from the neutron-reflecting bricks.\n\nThat's a stead state where nuclear fission is self-sustaining as one spent neutron is replenished by the produced neutron(s).\n\nA fission-based nuclear bomb needs supercriticality, where you have an exponential production of neutrons, exponentially releasing more energy as time goes by.\n\nThe key to a good yield in a nuclear weapon is making alot of neutrons before the force of the fission blows the core apar, physically stopping the fueling/amplification of the explosion.", "label": 1}
{"text": "Also the heat would cause it to expand (reducing density) and eventually melt (as OP said), ending the reaction.", "label": 1}
{"text": "< 1 →  Sub-critical: Decreasing radioactivity. \n\n\n= 1 →  Critical: Sustained fission.\n\n\n\\> 1 → Super-critical: Positive feedback. More delayed (thermal) neutrons than fast neutrons. Will eventually chain-react and cause a meltdown (literally the fuel rods melt from heat). Can explode but this will be due to chemical and thermal interactions (hydrogen gas from coolant flash-over). Chernobyl. \n\n_________\n\n\nPrompt critical: More prompt ('fast') neutrons than delayed ('thermal'). An atomic or nuclear bomb. Reaction happens in less than a millisecond.", "label": 1}
{"text": "Sobering. I’m an old lab tech from a coal fired powerplant. I don’t understand some of this but I sure recognize the human factors problem. \n\nUnlimited capitalism is great for production in a wartime survival environment but really lousy in an overall safety conscious environment.", "label": 1}
{"text": "  \"Unplanned criticality\" is the term we use for things like that...If you want to study the various types of interactions the closest way to do so is a trigger-type...in swimming pools at  several colleges ..\n\n   The demon core/blue flash unplanned criticality killed anyone close...the rest got more dose than I like to think about ( they were Most likely  study subjects for the rest of their lives,a is anyone who gets that much dose\n\n  Its a coin toss how long the material would stay in proximity/fisson configuration/criticality....I dont think they have done that kind of a study due to the consequence if someone dropped a zero or forgot how weird things radioactive can act\n\n  A good example was one I heard of that fortunately did not kill anyone..(I Think)....In one of their labs at Hanford ,(That will remain nameless)  Someone was doing various tests to determine the best way to chemically break down fuel assemblies for processing...this involved making some very Very VERY radioactive solution's in tanks of really seriously nasty chemicals. Weekend comes...all the worker bees go home.....around 3am all the remote monitors alarm from a \"Flash\" \"unplanned criticality\"  This is the type that the Radiological Emergency Responders get gray hair and nightmares about... Searched for the source of the flash....nothing....exit the area thinking \"we are back to chasing ghosts\" ...and as they are exiting  \"Flash\" Boom !\n\n   It turns out one of the tanks the worker bees had put a highly radioactive solution in to store till monday turned into a impromptu  nuclear reactor.....as the fissile material plated out of solution to the bottom of the tank ,a critical mass was formed and Boom!  \"steam\" explosion of truly horrendously radioactive chemical soup which disrupted the critical mass enough to stop ,,,,until enough plated out to become a critical mass again...then \"flash\" boom !\n\n  I honestly don't think they paid the Health Physics  (Radcon) techs enough to play with fissile material at a experimental waste processing facility", "label": 1}
{"text": "TLDR: The certainty of plate tectonic reconstructions decreases as we look further back in time, with more reliable data available only up to around 200 million years ago. This is due to the loss of older sea floor, which has been subducted, leaving paleomagnetic data from continental rocks as the primary source for ancient reconstructions. However, these data have limitations in constraining certain aspects, like longitude or types of tectonic boundaries, and the available rock record becomes sparser with age. Advances over the past decade, including improved paleomagnetic data, quantitative tools like GPlates, and new methods like seismic tomography, have helped narrow uncertainties and allowed for more consistent reconstructions, even up to a billion years ago, as shown in recent studies.", "label": 1}
{"text": "I see. That's an insane story! I'm glad no one died.", "label": 1}
{"text": "Sounds similar to the tokaimura criticality incident. Poured a bunch of uranyl nitrate into a precipitation tank which then settled out of solution and killed 2 people", "label": 1}
{"text": "so many oops..I made a point of forgetting just how batshit crazy some of the things we did appear to people outside \"the bidness\"\n\n  And ...well hell.some were just batshit crazy.There is nothing more dangerous at a nuclear facility than a bored Health Physics Tech, Yes,there are many stories I could tell,but most of the participant's are still (mostly) alive & employed", "label": 1}
{"text": "I remember reading about a worm or parasite or something of the sort where only one male is born along with all females.\n\nThe females will rape the male in the womb, then eat their mother from the inside.\n\nThe male will die outside of the womb as its sole purpose is to impregnate the females.", "label": 1}
{"text": "My stepdad installed asbestos in the 60s and 70s, but didn't die from mesothelioma until 2018, and didn't have any symptoms until 2017. Why the lag period? Why didn't the asbestos create enough inflammation earlier?", "label": 1}
{"text": "That’s an interesting point! Many studies suggest that antibiotic resistance can come with metabolic costs, which might reduce fitness in non antibiotic environments. It’s definitely a complex balance between resistance and overall survival.", "label": 1}
{"text": "I've got dibs on the title for my new album! It'll be released as soon as I get the words right. Or the rights to the words.", "label": 1}
{"text": "Yeah, on my grandparents family farm, they had one rooster and one bull for breeding and the rooster lived as far away from the house as they could put it and chickens put in that area for breeding. The bull roamed a fallow field and would get cows specifically to breed and become milk producers.\n\nI don't remember much more than that, it was a long time ago. I do remember being told not to go into the fallow field when it was near the house, though (rotated every 3 years).", "label": 1}
{"text": "It’s based on certain factors like gear, abilities, and stats that boost your healing powers.\n\nThe more healing power you have, the more effective your healing is. Some abilities or effects can boost your healing rate. Certain debuffs can slow down or reduce healing, making it harder for you to recover.", "label": 1}
{"text": "> traits we had a significant number amount of people having that are now gone?\n\nThat depends on the value of \"people\". \n\nNeanderthals had large brow ridges.  Some people today  have X%  Neandertal  ancestry.  [  https://en.wikipedia.org/wiki/Interbreeding_between_archaic_and_modern_humans#Neanderthals, https://en.wikipedia.org/wiki/Neanderthal_genetics   ]  No human  today has Neanderthal-type brow ridges.", "label": 1}
{"text": "Here's an evil, related fact: If you take a large pumpkin still growing on the vine, you can cut a hole into it, take out that piece to have access to the interior, then put that piece back in and it'll grow back in place. There'll be a bit of a scar, so it's best done at a spot of the pumpkin surface that is already a bit scarred already. Why am I telling this? Because if one were to feel particularly evil, one could cut a hole into one's neighbour's prized giant pumpkin, take a dump into it, then seal it all up again. }:>", "label": 1}
{"text": "Teeth , since our ancestors discovered fire ,humans knew that placing meat near heat softens it up and is easier to chew compared to chewing it raw ,so as our ancestors got used to cooking things our teeth became smaller and smaller could also explain why wisdom teeth are useless \nAlso we weakened our immune system since our body was no longer used to eating raw meat and handling the bacteria \n\nOur ability to breathe under water too , we have hiccups because our ancestors used to breathe under water through gills before land as we change from gills to breathing with mouth instead ,it resulted in us getting hiccups which had no advantage in survival .\n\nBody hair too, since humans discovered fire and clothing our body evolved again to not have body hair as a second party was already keeping us warm.", "label": 1}
{"text": "Such an interesting question! I was literally wondering this same thing a few weeks ago when my husband went to an underwater pumpkin carving contest 😂 I was like…will it suck water in like a vacuum when punctured underwater or will it have resistance to the water until there’s a good opening?? I didn’t get to go so idk the answer", "label": 1}
{"text": "The overbite we have is extremely recent due to eating soft food. It not an evolutionary trait but a behavioural? one. If you go back even two to three hundred years, most skeletons show the top and bottom jaws meeting without an overbite, with the exception of nobles who often had an overbite due to the softer food they ate.", "label": 1}
{"text": "There's a reason ancient humans said our ancestors were \"those weirdos from over in one-dick valley\"", "label": 1}
{"text": "They lost their penis bone around the same time cocktail parties were becoming popular. It was considered just plain rude.", "label": 1}
{"text": "Makes sense. Why would animals want non aligned teeth. Maybe I shouldn't have treated my teeth with braces. I had  alignment of upper and lower teeth without any overbite or underbite", "label": 1}
{"text": "Pressure scales linearly with depth, liquid density, and gravity. Water is essentially the same density in both examples, and Europa has \\~13% of earths gravity so the pressure would be roughly 13% of whatever it is on earth at the same depth. According to NASA Europa's oceans go to a depth of \\~150 km (you incorrectly used the depth in miles and labeled it km), which is equivalent to a earth depth of 19.5 km almost twice the depth and by extension pressure of anything on earth. There is only one submarine that has even gone to the bottom of earth's oceans, and based on it's tests it could make it to roughly \\~14km on earth if such depths existed or \\~105km on Europa. The vast majority of submarines on earth can only go a few hundred meters down on earth. \n\nNote that I ignored the ice crust for my initial calculations. This is because ice in that volume is structurally different than the ice we are used to on earth. In practice this probably means that it is slightly denser than typical ice and actually quite close to the density of water. You can probably just add it's depth to the water's depth for pressure calculations but this will give a slight over estimate. (max \\~8%)", "label": 1}
{"text": "I guess the easiest way to compare it is cancer, there are some cancer that if someone on your family died from it it's almost certain that someone else in the family will die at a similar age, while other are just some markers that are risk factors where the environment will play a hand on whether you get cancer or not.", "label": 1}
