{"text": "Do you ever ponder how often Trump claims the victim?", "label": 1}
{"text": "The fact that you're asking for examples that they're not 'the enemy of the people' shows that Great Orange Leader's Koolade is well and truly in your system. Examples wouldn't change your mind, would they? you'd just either find ways to deny the reality or change the narrative to fit your perception.", "label": 1}
{"text": "I'd say the fact you don't have examples says everything. The fact is the left's actions are a direct assault on America and our values.\n\nThink about it, the left is the side that supports importing illegals into the country, supports importing terrorists into the country, and support increasing inflation with their policies. The fact is there is not a single platform the left stands for that benefits America. Everything they support benefits our enemies.", "label": 1}
{"text": "I didn't say I don't have examples, did I? You can easily do a Google search yourself and find out those labels aren't true but you choose not to because then you'd have to justify your support of Trump when he's lying to your face. Why do other people have to do the research for you? It just shows laziness on your part that you have to be spoonfed the truth, rather than watch Fox 'News' for all your talking points. America was built on immigration and I guarantee your family would trace back to immigrants, yet you choose to attack the same people who did what your ancestors did.\nDo you even know which counties are enemies of the US? The ones that Trump boasts about love letters from and the ones who compliment him to massage his ego so that he gives them what they want.", "label": 1}
{"text": "Biden is the President and had the House and Senate for two years, what’s the evidence of democrats being Marxist, Fascist and Communist? How has his presidency been any different from the standard left-right balance of American politics?\n\nI won’t even bother with your assessment of IQ considering who Trump is and the quality of the people he surrounds himself with. \n\nShouldn’t the burden of proof be on the person making the claim?", "label": 1}
{"text": "False.  Your original questions dealt with whether Mr. Jeffrey Goldberg is telling the truth in his article, and how would we know what Trump said to others in private, and this is under the whole shroud of whether Trump is a Nazi and idolizes Hitler.  All of those links touch on that subject in some way, shape, or form.\n\nI knew you would lose focus and cause more work for me.  Done with you.", "label": 1}
{"text": "Are you a sex weirdo?", "label": 1}
{"text": "There's a problem here.\n\nYou are trying to make MAGA into a thing.  It's a slogan.  It's not a thing.  It's like fetch.  It's not going to be a thing.\n\nI get it.  You want to make a distinction between graceful losers and people who are willing to actually fight for what they perceive as their rights.  It doesn't work.", "label": 1}
{"text": "Did you cheat on three wives, defame an assault victim, talk kindly about a dead sex trafficker and his accomplice?\n\nWhat about making multiple public comments involving your teenage daughter's body while claiming that you would date her if you weren't related?\n\nSpanking is weird though, right?", "label": 1}
{"text": "Your worldview is so cooked it’s hilarious.", "label": 1}
{"text": "Who gets to determine that?  \nFrom 2019 to 2022, the rate of maternal mortality cases in Texas rose by 56%, compared with just 11% nationwide during the same time period, according to an analysis by the Gender Equity Policy Institute.  \nIt's amazing how more women die in the more conservative states.  \nDoctors are scared to treat women because of clunky laws written by politicial activists who don't understand the human body. And women die because of it. A woman's life is more important than the fetus inside her. It just is.", "label": 1}
{"text": "How many women have to die to defend your hypothetical?", "label": 1}
{"text": "It's trumps euphemism, I'm just trying to understand it on an ask trump supporters subreddit. That's why I asked what you think \"draining the swamp\" means since you are a trump supporter. Why even participate in this sub if you don't want to answer?", "label": 1}
{"text": "What about a tiny little mushroom?!", "label": 1}
{"text": "Such Moronic accusations he isn’t even dignifying you with a Response 🤣", "label": 1}
{"text": "Every damn high ranking officer I met growing up on a military base. Any other stupid questions?", "label": 1}
{"text": "WTF are you talking about?   If something people need become rare, so people are willing to pay more money for it, the price goes up, it causes inflation.  Gas and food prices rose.   By your metric as gold has gone through the roof recently, everyone should be thrilled with lack of inflation.  The problem is that people don't have gold, On the other hand, when gold inevitably goes down in value, people can still buy things.", "label": 1}
{"text": "dollar sign(s)", "label": 1}
{"text": "I feel like you're missing my point entirely. If she doesn't understand what \"leftist\" means (which I find suspect but whatever), does she understand what \"tears\" are? If your mug said \"women's tears\" she'd understand that that meant you enjoy women crying so much that you'd like to drink their tears, right? \n\nSo my point is that it doesn't matter if it said leftist, maga, libtard, women's, men's, etc etc etc because they'd *all* be joking about liking that person crying so much that they want to bask in their misery. \n\n> wants to be tainted by its toxicity\n\nSays the guy who has a \"leftist tears\" mug 😂", "label": 1}
{"text": "Why doe sit matter to you? I support abortion because if a mother wants to not be a mother and carry the child any farther, she should be able to. I also don’t care about an abortion that might happen with a medical team , woman, and unborn child that I’ll never meet. \n\nAnd from a personal, more subjective perspective, I just hate children because they’re annoying so the less of them the better", "label": 1}
{"text": "No point arguing with someone in bad faith. The chart shows a clear slow growth for many years, continuing with Trump in 2016 to 2019. Then covid then massive continued spending by Biden. \n\nI don't believe you are being sincere when you say it shows Trump having higher spending.", "label": 1}
{"text": "Add em all up buddy and average the 4 years. Ill wait. You are full of shit sadly.", "label": 1}
{"text": "Humble? You can’t be serious. We are truely not living in the same reality anymore. You are on some other plane of existence. \nThe guy who only talks in superlatives about himself is humble now.", "label": 1}
{"text": "How about you're a pedophile accusations to you?", "label": 1}
{"text": "I’m confused by your comment. What are you asking?", "label": 1}
{"text": ">I’m confused\n\nI know", "label": 1}
{"text": ">numerous claims \n\nAccusations m8. Don't change the subject m8. Another drink for Kamala? 🍻", "label": 1}
{"text": "Wait! Don't tell me you voted for that hoe?", "label": 1}
{"text": "If you’re the average Trump supporter, you’ve shown us a lot. Thank you. I choose to believe there are Trump supporters who don’t condone sexual assault. I hope I’m right. You’re making claims against Harris you’ve refused to show evidence for (a YouTube video commentary is not evidence.)\n\nI wish you the best. Take care.", "label": 1}
{"text": "If you’re the average Trump supporter, you’ve shown us a lot. Thank you. I choose to believe there are Trump supporters who don’t condone sexual assault. I hope I’m right. You’re making claims against Harris you’ve refused to show evidence for (a YouTube video commentary is not evidence.)\n\nCan you clarify?", "label": 1}
{"text": "I left the Kamala speech right after Beyonce walked out", "label": 1}
{"text": "No. Trump supporters often will disagree with eachother often about several issues and it's okay. You guys just wait for the first massively botted upvoted comment before forming your own opinion. And you all just fall in line instead of forming your own opinion.", "label": 1}
{"text": ">Do you have any rebuttals other than emotionally loaded rhetorical questions? \n\nNah, I just think that people should be able to do whatever they want with their own body if it isn't harming anyone else. Why do you want the government to make those choices for individuals?\n\nI know a Christian couple with a son that transitioned in their teenage years. This was a person that hated wearing women's swimsuits as a kid. Like a pre-teen girl wearing swim trunks and no top to the beach on family vacations.\n\nHe would have 100% offed himself if his parents didn't support him after a year or two of consultations to make sure that it was right thing to do at his age.\n\nKids don't just wake up and randomly decide to transform their body. It's years of pain and suffering that gets suppressed in certain family environments.\n\nNo one is pushing for an \"industry\" around trans people. They just want those kids to not off themselves and/or feel comfortable talking about difficult subjects with trusted adults. No one is trying to make your kid cut their dick off. That's weird and idk why y'all think about it so much.", "label": 1}
{"text": "It does", "label": 1}
{"text": "Do you feel this was a productive response?", "label": 1}
{"text": "Are you aware that Ben Shapiro utilizes a debating technique of talking fast to appear smart or otherwise well informed of the topic. Have you reviewed ben shapiros ramblings and musings? I cannot speak on every session hes done, but dude do not know what hes talking about half the time. A good chunk of it is making a bold claim and projecting surface-level analysis of the claim with zero comprehension. He self-owns more often than not.\n\nAlso are the 21yr olds stupid for being 21 or because they are not well informed on their subject at hand to hold any form of a debate?", "label": 1}
{"text": "Oh my gosh, the American History X thing his incredibly spot on. I read lines straight out of that movie on this sub any time I visit, it's been bugging me to not put a finger on the character until now. \n\nTo TS, have any of you seen this film? If so, are there any characters whose viewpoints you resonate with? Or is it pure coincidence that you emulate the same talking points, near verbatim?", "label": 1}
{"text": "This made me laugh so loud I scared my dog - do you happen to have written a book on how to form a loaded question?", "label": 1}
{"text": "Start here: \n\n[https://www.theguardian.com/commentisfree/2018/nov/19/voter-intimidation-republicans-democrats-midterm-elections](https://www.theguardian.com/commentisfree/2018/nov/19/voter-intimidation-republicans-democrats-midterm-elections)\n\nthen read more about it.", "label": 1}
{"text": "Do any of you have any arguments that don’t hinge on everything being a left-wing conspiracy? Like let’s say this isn’t, for funsies. What then?", "label": 1}
{"text": "Ooh, I forgot one, but you came at it from a different angle. The fact that your solution to the schooling problem is to eject the kids you don't want rather than expand school access and funding is also incredibly selfish, which is another common conservative trait. The fact that your daughter not having to compete with a \"biological male\" is more important than trans kids being able to freely enjoy sports in school is, again, selfish. In other areas of Republican politics and policy, there's a definite sense of \"f- you, I got mine.\" \n\nBiden has a great line that he doesn't use often enough because it upsets conservative snowflakes: don't tell me your morals, show me your budget, and *I'll* tell you your morals. Using this paradigm, Republicans are wicked, hateful, selfish people *by policy.* \n\n>It has nothing to do with their skin color. It has everything to do with putting Americans first, in America. \n\nEven this. What do you mean by \"Americans\" in this context? I think you mean *white* Americans, and the brown kids who are the American-born children of immigrants don't count.\n\nAll this is just to say, the reason people don't want to be around Trump supporters isn't merely about policy differences. I can have a civil discussion with a friend about a parks levy or a public transit system in my city and remain friends. But conservative policy choices reveal unpleasant things about you beyond those specific policies. \n\nDon't you think that liberal policies are also derived from our values? What do you think those liberal values are?", "label": 1}
{"text": "You just want me to be racist so bad so it can prove your point or something. That's pretty sick. You might want to seek therapy for your unhealed traumas.", "label": 1}
{"text": "What do you make of the fact that the top 5 highest divorce rate states are all red states (Nevada can swing, so let's say 4) and out of the states with the lowest divorce rates, 3 are Blue states?  There is a definite pattern with Red states and higher divorce rates.", "label": 1}
{"text": "I honestly can't tell if you're trolling or not?", "label": 1}
{"text": "That’s because America isn’t having a political debate, it’s having a moral one.  In choosing trump you’re asking people to ignore his dozens of sexual assaults, his rapes, his criminal career, his frauds, his stealing from a cancer charity, his close friendship with Epstein, his vilifying of Muslims, Mexicans, Haitians, his racist comments about Obama or Harris not really being black or American, his hoarding of top secret documents, his taking money under the table during his presidency, his selling of fake watches for money laundering purposes, his friendship with Putin and Kim Jong, his disdain for the military, the fact the dozens of the most credentialed people who worked up closely with him were horrified and have gone public begging Americans to take seriously the threat that he is and the list goes on and on.  The fact is his policy ideas are few and far between and really bad. He still thinks tariffs are paid by other nations, they’re not.  We don’t even get to talk policy because the morality debate is utterly dismissed as if it doesn’t exist by Trump Supporters. They needn’t actually deal with the devastating facts and the reality, they just get to dismiss it as media spin and poof Trump is a victim rather than a grotesque, criminal, predator and human being.  Because Trump supporters won’t address these grave problems in a serious way they get to pretend they’re confused and injured by the intolerance of others when in fact it is deeply disturbing to people who love them that they can be so cavalier about issues ghat personally harm and devastate the women or minorities in their families and communities.  This passive aggression, this gaslighting bc that’s what it is, is the reason you FIL or friend or coworker has put a barrier between you and them. You think it’s them. Every bully tells themselves their victim deserves it.  Is it so hard to believe that maybe you’re being a huge a hole?  I’ve been a huge a hole. We’re all capable of it. The key to recovering from being a huge a hole is acknowledging it, taking responsibility and then doing something to change.", "label": 1}
{"text": "we know you can't it's a problem", "label": 1}
{"text": ">Sorry, Your first sentence was that Trump is not a politician. Now it seems you're not interested in discussing was a politician is. That seems odd to me, but so be it. I'll drop it.\n\nYou are being intentionally obtuse. I am a Trump supporter and you are posting in r/AskTrumpSupporters and you think that the part of the sentence \"Trump is not a politician\" that I am interested in is the politician side. That is ridiculous. \n\n>How does my perceived frustration with Trump preclude me from being able to understand Trump? Those two things are unrelated to each other. And how does have anything to do with you understanding Trump better than me?\n\nI cannot help you with that.", "label": 1}
{"text": "Just have a concert:\n\nHey! What are you up to on Wednesday <name>? Vice President Kamala Harris is coming to Madison, WI, for a campaign rally & concert with Gracie Abrams, Mumford & Sons, Remi Wolf, and The National's Matt Berninger and Aaron Dessner - will we see you there? I'm Zach, a volunteer with the Democrats. (stop to quit) \n\nSign up here: https://txt.democrats.org/c783", "label": 1}
{"text": "Just have a concert:\n\nHey! What are you up to on Wednesday <name>? Vice President Kamala Harris is coming to Madison, WI, for a campaign rally & concert with Gracie Abrams, Mumford & Sons, Remi Wolf, and The National's Matt Berninger and Aaron Dessner - will we see you there? I'm Zach, a volunteer with the Democrats. (stop to quit) \n\nSign up here: https://txt.democrats.org/c783", "label": 1}
{"text": "Do you think this is a common belief among Trump supporters? Idk it kind of just seems like making excuses, like no matter what obviously insane things he says, it’s totally fine because he meant to sound crazy. Is that really a great defense? It just doesn’t seem like a plausible strategy to me, and even if that is what’s happening, I’d rather not have a president who pretends to be an idiot. Seems pretty childish, no?", "label": 1}
{"text": "How is the desire to \"protect our girls\" compatible with voting for a party that will willingly let girls and women die or forced to carry assault spawned pregnancies to term? Like that's the part I genuinely don't understand.\n\nThat's not even getting into supporting a person who bragged about going into teenage beauty pagent dressing rooms to see them nude? (whether or not 'grab' em by the *****' actually happened, he bragged about it like it's an acceptable thing to be proud of)\n\n How do these things equate to 'protecting girls'?\n\nI get the biological concerns about sports, whether or not I agree with it, I can understand that point of view.... but everything else about DJT and red laws... How is any of that compatible with protecting girls?\n\nI'm not trying to be whatever, I just don't understand how to equate those things. Can you explain it, please?", "label": 1}
{"text": "You answered your own question", "label": 1}
{"text": "Do I understand correctly, that trans/sports is the only thing that you care about is 'protecting our girls'?\n\nIs that a more important issue than letting girls or women bleed out or permanently lose their ability to have wanted children?\n\nOr is that just a damning non-answer?", "label": 1}
{"text": "Are you trolling? Is your participation in this sub motivated by sadism?", "label": 1}
{"text": "No I just really believed you in your previous post I'm agreeing and can see what you're saying", "label": 1}
{"text": "Ok brother have you googled that?\n\n“A tariff is a tax imposed on a foreign made good, paid by the importing business to its home country’s government”\n\nSee how that isn’t what you’ve been told? It’s upsetting.", "label": 1}
{"text": "dumb question.", "label": 1}
{"text": "stupid question", "label": 1}
{"text": ">So in your opinion, only straight, white, male landowners should have the right to vote?\n\n>I think that was a pretty good system, yea. Makes sense to me.\n\nIt's always shocking to see such takes openly advocated for, isn't it? Would you be surprised to learn that the person you're having a conversation with is a mod of this very subreddit? Do you see these kind of takes as often as I do online?", "label": 1}
{"text": "I would not be surprised at all. Recently, I have been seeing them a lot more, and I think the MSG rally over the weekend really just kicked the doors right off the barn. Do you think this is more akin to cicadas coming out of hibernation, or lemmings just following each other off a cliff?", "label": 1}
{"text": "Please, no trolling. Can we refer back to intellectual effort?", "label": 1}
{"text": "I mean, we've done worse things before, you know?", "label": 1}
{"text": "[https://www.reddit.com/r/AskTrumpSupporters/comments/1gc7rx9/do\\_you\\_think\\_trump\\_assigning\\_elon\\_musk\\_in\\_charge/](https://www.reddit.com/r/AskTrumpSupporters/comments/1gc7rx9/do_you_think_trump_assigning_elon_musk_in_charge/)\n\n4 days ago.", "label": 1}
{"text": "is it \"intellectual\" to put forth that GOP is the only entity to ever cast doubt on an election?   oh no that's a \"Troll\"   yeah.   exactly!", "label": 1}
{"text": "Did you eat breakfast today?", "label": 1}
{"text": "So after two attempts you aren’t going to clarify the question I am directly trying to get input on that I took directly from your original comment?", "label": 1}
{"text": "If that's the case, why did Republicans absorb most of the blame for the shutdown at the time? Trump couldn't negotiate $5B *and* lost the perception battle? You must think that Pelosi really worked him over if you're saying this is the Democrats' fault.", "label": 1}
{"text": "Doesn't he also call them \"suckers and losers\" behind closed doors?", "label": 1}
{"text": "Well yes it was a Nazi rally, because trump and his supporters are basically Nazis. Why else does Trump was quote Hitler all the time?", "label": 1}
{"text": "/s - Are you going to go back to that floating island of trash if Trump loses?", "label": 1}
{"text": "Like do you believe they don’t exist or do you just not agree with them? That’s a wierd world view to be like I reject this as being a real thing, do you do go I do t believe in birds?", "label": 1}
{"text": "Well, clearly Pelosi won the battle for you. So, all the sa.e questions you asked in the op, but in reverse -- was this worth it? Did it enhance our national security to throw 11 billion in the trash? Are we better off? Is this a Pelosi highlight? Etc.", "label": 1}
{"text": "You're welcome. I bet you disagree, though?", "label": 1}
{"text": "By responding to my request for a single piece of evidence with vague and unsubstantiated claims, are you acknowledging there is no evidence of outcome determinative fraud? Why can't you cite a single report?", "label": 1}
{"text": ">I don't know how to be effective under those conditions\n\nIt's kind of weird, isn't it? When the GOP had the power, they didn't do a thorough job. Even when the dems compromised, Trump killed the GOPs own bill. \n\n>Evidently neither can/does MTG and all of them, so.... shrug i guess we need to do better at the vote\n\nDo better by voting Democrat?", "label": 1}
{"text": "What are you attempting to clarify", "label": 1}
{"text": "If the GOP isn't and hasn't been doing what they're supposed to do, isn't it the only option to vote differently? in your case, wouldn't it would be voting Democrat?", "label": 1}
{"text": "So let .... let me make sure I have this. I said \"they won't negotiate with us, we have to do better at the vote.\" You're asking if what i meant by that was \"JUST VOTE DEMOCRAT I GUESS, NO OTHER CHOICE! DAMN.\"\n\nIs that the clarification you're looking for? I just want to make sure I understand.", "label": 1}
{"text": ">Stop trying to make \"weird\" happen, the \"y'all\" is actually quite weird when y'all use it after living in Los Angeles for 20 years.\n\nI'm small town midwest, born and raised. No LA shit here, but I'd love to have that weather and somewhere new to eat every week.\n\nYou say you're too young to understand shit? \n\nMaybe grow up a little bit and get out of your *strange* incel mindset? It happens to a lot of dudes and some of em end up pretty cool afterwards. \n\nYou're going through a phase. Don't worry bro. It won't be like this forever.", "label": 1}
{"text": ">How else do you do better at a vote?\n\nReach more people,  win more seats,  pick better candidates,  forge a stronger coalition, present a stronger platform,  do better at campaigning......\n\n>if the party you're usually voting for isn't effective at achieving its goals, why would you keep voting for them?\n\nWe picked Trump over Jeb and Romney and all the old blood for just that reason,  by the by. I mean I know you're just...... sincerely discussing in good faith, in accordance with the rules, and I'd never suggest otherwise,  but for the record,  you're describing how we got here in the first place.", "label": 1}
{"text": "Oh, I thought you meant the voter needs to do better but you're talking about the nominees?", "label": 1}
{"text": "Who could it be?", "label": 1}
{"text": "Covid vax mandates. \n\n\n>There are no COVID measures in place so I don't count those.\n\n\nThe gene therapy can't be reversed, so as far as I'm aware, it's still affecting people.", "label": 1}
{"text": "So you give Trump the benefit of the doubt that he’s not calling all Democrats the enemy from within, but you assume Biden means all Trump supporters? Seems like a double standard, and that you are holding Trump to a different standard, no?", "label": 1}
{"text": "Were u around during covid?\n\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2021/11/04/fact-sheet-biden-administration-announces-details-of-two-major-vaccination-policies/", "label": 1}
{"text": "I’m ignoring anything written after “jan 6”", "label": 1}
{"text": "Do you consider yourself a good father?", "label": 1}
{"text": "> Maybe grow up a little bit and get out of your strange incel mindset? It happens to a lot of dudes and some of em end up pretty cool afterwards.\n\nI'm already up a lot on Polymarket and DJT. Kamala supporters will be funding my fuckboy lifestyle 🤣", "label": 1}
{"text": "Sure, can you explain the difference between how scientists define gene therapy and how the SEC doesn't actually use any sort of strict scientific definition? \n\nThe reason I ask is because my understanding is very different and would mean that the SEC's definition is rather irrelevant in the context of this conversation.  \n\nThe document you shared is a filing from Moderna, a company that makes one of the COVID-19 vaccines. In it, Moderna mentions that mRNA vaccines, like theirs, are sometimes put in the same category as “gene therapy products” by the FDA. This doesn’t mean the vaccine changes your DNA, though. Here’s why:\n\n\t1.\tWhat mRNA Vaccines Do: mRNA vaccines, like the ones from Moderna and Pfizer, use a small bit of genetic material called mRNA to teach your cells how to make a piece of the COVID-19 virus (the spike protein). This helps your immune system learn to recognize and fight the virus if you’re exposed to it later. The mRNA breaks down quickly after it’s used, and it doesn’t interact with or change your DNA.\n\t2.\tWhy They’re Called “Gene Therapy Products”: The FDA (the government agency that approves medicines) sometimes groups mRNA vaccines with “gene therapy products” because they are new types of treatments involving genetic material. However, this is just for regulatory purposes—it doesn’t mean the vaccine is like traditional gene therapy, which is meant to change DNA to treat genetic diseases.\n\t3.\tOther Types of COVID-19 Vaccines: The Johnson & Johnson (J&J) vaccine works a little differently. It uses a virus to deliver DNA instructions for the spike protein, but this DNA also doesn’t change your own DNA. This method has been used in vaccines for other diseases, so it’s a more traditional approach than mRNA vaccines.\n\nIn short, the Moderna and Pfizer vaccines don’t change your DNA or permanently alter anything in your body. They’re just grouped with “gene therapy products” by the FDA for oversight reasons, not because they actually change genes.", "label": 1}
{"text": "So your the expert?\n\n\nTell me, how exactly does your immune system learn?\n\n\nIt's by memory cells, the b cells and the t cells right?\n\n\nAnd how do the b cells do this learning?\nIt's by somatic hyper mutations which involve changes to the DNA right? \n\n\n>In short, the Moderna and Pfizer vaccines don’t change your DNA or permanently alter anything in your body.\n\n\nDisinformation.", "label": 1}
{"text": "What do you mean, \"for me\"? I'm just bringing this incident to the table for discussion. You're the one telling me that this was all up to democrats. Although, as Trump admitted in the Dec 2018 televised meeting, he verbally took credit for the shutdown so it's, let's say *interesting* for you to blame democrats following that admission. It happened while trump was president, his performance as president should probably be a subject of discussion, do you agree or disagree? Nancy Pelosi isn't running for president in 2024.", "label": 1}
{"text": "Tf kind of question is that?", "label": 1}
{"text": "First, you didn't answer the question. \n\nWhat's the difference between how a geneticist and an SEC financial auditor would define gene therapy? \n\nThat aside, just like how lifting weights is training for your muscles—it strengthens them but doesn’t change your DNA—the Moderna and Pfizer vaccines train your immune system to recognize COVID-19 without altering your DNA.\n\nThink of the vaccine as giving your immune system a cheat sheet for a test. The mRNA provides a temporary set of instructions that your cells read, learn from, and then discard. It’s like studying for a test with flashcards—you use them to memorize the answers but don’t keep the cards permanently in your brain. The mRNA doesn’t go near your DNA and has no lasting presence in your body.\n\nB cells, a type of immune cell, naturally “learn” and remember infections as part of their job, similar to how a firefighter remembers how to handle different emergencies. This learning is a natural process that happens with any immune response, whether from an infection or a vaccine. It’s not the vaccine changing your DNA but rather your immune system improving its skills.\n\nIn short, the Moderna and Pfizer vaccines help train your immune system without changing your DNA, just like exercise trains your muscles without altering your genetic code.", "label": 1}
{"text": "> \"The crazy lunatics that we have — the fascists, the Marxists, the communists, the people that we have that are actually running the country,” Trump said this month at a rally in Wisconsin. “Those people are more dangerous — the enemy from within — than Russia and China and other people.”. -- https://apnews.com/article/donald-trump-enemies-from-within-5c4a34776469a55e71d3ba4d4e68cf62\n\nI'm not giving him any benefit.", "label": 1}
{"text": "What is this a copy+paste from chatgpt?\n\n\nHow about instead of using analogies you discuss the actual content. I just showed you how it modified DNA.", "label": 1}
{"text": "Biden later clarified his comments:\n\n> “Earlier today I referred to the hateful rhetoric about Puerto Rico spewed by Trump’s supporter at his Madison Square Garden rally as garbage — which is the only word I can think of to describe it,” he posted on X. “His demonization of Latinos is unconscionable. That’s all I meant to say. The comments at that rally don’t reflect who we are as a nation.”\n\nDo you intend to still be outraged by other people tell you that Joe Biden says you are garbage ever after he clarified that that's not what he meant to say? I'm just curious if the clarification matters or people are going to be receptive when conservative media continues to take it out of Biden's intended context and instead use a sound bite to make you angry at Joe Biden.", "label": 1}
{"text": "How did you show me? You just asked questions. \n\nAnd you still didn't answer the question.", "label": 1}
{"text": ">What's the difference between how a geneticist and an SEC financial auditor would define gene therapy? \n\n\nAn SEC financial auditor would cite the geneticist (the FDA) to get a definition, which is exactly what I showed.", "label": 1}
{"text": "Right and during his “Red Speech” he said that all MAGA are radical extremists.  The elitist left hate all Americans.", "label": 1}
{"text": "Is that a yes? Yes, you intend to continue to be offended by a sound bite taken out of context?", "label": 1}
{"text": "OK but how many people \"running this country\", as Trump said, do you think *self-identify* as fascists, Marxists, or communists? Does anybody raise their hands and say, \"I'm a communist\"? \n\nIf not- and I'm just guessing you can't identify any self-proclaimed communists that have been elected to office-  well then *who the hell is Trump talking about*? Is it up to *Donald Trump* to identify who exactly the Marxists and communists are? Or if nobody is actually a Marxist, then who is he referring to? Please break that down for me.", "label": 1}
{"text": "So you're choosing to ignore the man's clarification of his own words, and you are now deciding that Joe Biden meant something other than what Joe Biden said he meant?", "label": 1}
{"text": "What I'm deciding is that he stated what he stated and then decided to backtrack.", "label": 1}
{"text": "Are you aware that, with respect to this incident, you're now operating in a \"fact-free\" space? If democrats decide to disregard information that's available to them in favor of their chosen political narrative, you would agree that that's probably bad, right?", "label": 1}
{"text": "How did you install wheels on that goalpost?", "label": 1}
{"text": "Read Trump's comment. Marxists and communists running the country. Who? Give me names. \n\nOr, are we talking about people who *Trump is labelling* as Marxists and communists? So, we have to trust that he knows what he's talking about? I don't, do you? Do you think Donald Trump can even *define* Marxism? So is he just calling people names and then saying \"they\" are the enemy within? Who is Donald Trump talking about? Don't talk to me about moving goalposts and then also tell me that nothing Trump says is intended to be taken literally.", "label": 1}
{"text": "I think he brings up a good point. Trump seems to refer to all democrats as marxists and communists, so that would mean he was referring to all democrats when he said that. He constantly refers to non-Marxist and non-communist democrats in that manner, and calls them the enemy from within, so I would certainly say that he is referring to all democrats when he mentioned the enemy from within at MSG just a few days ago, wouldn’t you?", "label": 1}
{"text": "Not at all and I don’t think anyone actually believes that, despite the medias attempts to manufacture consent on that point. He’s clearly talking about radicals, people like antifa, the Robin D’Angelo’s of the world, the Johanna Olson-Kennedys of the world, etc. Furthermore, I’d wager Trumps understanding of Marxism is about on par with the average “educated” liberal’s understanding of the word fascist. Close to zero.", "label": 1}
{"text": "It did fundamentally change things, for the better. Black people used to get beat up and arrested for trying to eat at diners, and now they are legally protected.\n\nIt is completely morally different to say that you don’t want strangers in your house, but that businesses can’t discriminate against black people when they are more than willing to serve white people. I don’t think they are even in the same ballpark of comparability, and Americans didn’t think that historically at all. The evidence is that the CRA didn’t make it so that anyone can walk into your house, but it did protect people’s civil liberties. \n\nI have to ask, just because I’m in awe, do you think Trump Supporters as a whole are pro-segregation, or are you in the minority?", "label": 1}
{"text": "Why does he call Kamala a communist, a Marxist, and a fascist?", "label": 1}
{"text": "Why? Is it because it’s a sore subject for you, given it was the culmination of the failure of Trump to overturn the election to stay in power?", "label": 1}
{"text": "OK so why are you telling me that I am \"no longer\" contending something that I never said in the first place? What conversation is taking place here if you're misattributing things to me and referring me off to other comments?", "label": 1}
{"text": "I just think people who think of it as a politically important event arent probably gonna be capable of interesting or intelligent conversation. Bit of a heuristic", "label": 1}
{"text": "It was not out of context and I'm not \"offended\". Given that I'm not a hypersensitive leftist is quite difficult to offend me. The point is Biden, and the democrat party have a very long history of looking down at everyone who is not within their elitist circles. They are the unqualified \"management class\" and they think all others are beneath them. This was very well documented decades ago by Thomas Sowell in his insightful book titled Vision of the Annointed.", "label": 1}
{"text": "Why don’t you view Jan 6th as a politically important event?", "label": 1}
{"text": "But \"radical extremists\" and \"garbage\" don't mean the same thing, so why are you treating them as if they do? There's a lot of projection taking place in this comment. You're projecting opinions onto other people and then using that projection as your rationale to interpret Biden's comment. These are all *your* opinions, are they not? How do you \"know\" that other people hold your opinions?", "label": 1}
{"text": "Can you, without Google or any outside help, define communism and Marxism?", "label": 1}
{"text": "Who's your daddy?", "label": 1}
{"text": "Well since there's no Marxists or communists running the country, and essentially none even just running around the country itself, it seems clear Trump is just relying on his most popular strategy - demonize the enemy and call them names. Since there aren't *actually* these people he's clearly just labeling the real people he's against with these hyperbolic names - something he is known for and at this point is basically his trademark move. Soooo... Who is he referring to then? Certainly not Republicans.", "label": 1}
{"text": "It’s clear that you want to argue nonsense and ignore the long despicable history of the democrat party.", "label": 1}
{"text": "I can order Chinese food", "label": 1}
{"text": "Well let’s apply that same logic to democrats calling everyone Nazis and fascists ;)", "label": 1}
{"text": "I’d prefer neither side do it!", "label": 1}
{"text": ">I just think people who think of it as a politically important event arent probably gonna be capable of interesting or intelligent conversation.\n\nIt’s obviously not politically important to ***you,*** but you understand how it is important to the larger country and in a historical context? Jan. 6 — along with Trump’s illegal actions to overturn the election leading to it — are objectively historic and hugely consequential events. \n\nIf the exact same scenario happened, but it was Obama instead of Trump, then it would obviously be extremely politically important to you. Likely to a much more significant degree.", "label": 1}
{"text": ">I don’t care what he thinks as long as his policies preserve my rights. \n\nWhat rights is he preserving that Kamala Harris wouldn’t? \n\nIf anything, Trump is far more likely to trample on rights than preserve them.", "label": 1}
{"text": "Biden loves to stir it up.\nRemember what he said about Romney back in 2012, “he’s going to put y’all back in chains.”\n\nAnd Romney just took it and smiled.", "label": 1}
{"text": "Latino is not a race, and Puerto Ricans are Latinos. How are you confused by this? Do you have any more questions I can answer for you? You probably shouldn’t reply to some of these issues if you really don’t know such basic things", "label": 1}
{"text": "Puerto Ricans are Americans.  Some are Latino.  Not everyone in Puerto Rico is Latino.  That is entirely my point.\n\nIf I were to move to PR, I would be a Puerto Rican, but not Latino.", "label": 1}
{"text": "Given I never said anything about him waiving his rights nor made any statements about the trial itself what would I amend? And what does that line have to do with anything?", "label": 1}
{"text": "No? I meant to reply to you with a rhetorical question that others following the thread can see.", "label": 1}
{"text": ">No? I meant to reply to you with a rhetorical question that others following the thread can see.\n\n\n\n\n\nOkay, I don’t really understand why you would pose that question to me, and not the Trump supporter who I was replying to, but that’s fine. Appreciate the additional context you’re providing here.", "label": 1}
{"text": "Do you think undocumented migrants that cross our border are Americans? They live here now, so they are officially Americans right?", "label": 1}
{"text": "Did you use AI to help you write this comment?", "label": 1}
{"text": "Oh, I'm terribly sorry that you tried to poke a hole with a SWERVE!\n\nIllegal immigrants are criminals.  I am legally allowed to move to Puerto Rico.  If I were to move to Mexico, I would do so legally as well.", "label": 1}
{"text": "Got it, so living somewhere doesn’t make you from that place? People living in America aren’t automatically Americans?", "label": 1}
{"text": "I think you're trying to get a GOTCHA and it isn't going to work.  Enjoy your evening.", "label": 1}
{"text": "But you don't accept the proof when it is shown to you? Are you so desperate to exonerate Trump at all costs that you're unwilling to even look at the facts that lead him to lose his case against her? \n\nCome on. It's okay to criticize a politician. He is one. It's okay to hold him to account once in a while. He's not God. \n\nMy goodness.", "label": 1}
{"text": "If you’re going to be that overwhelmingly generous about trump’s comments, it’s pretty easy to apply even an iota of that generosity to interpret Biden’s comments to only be about racists that support Trump rather than all supporters. He isn’t even talking about his general supporters in the quote. He was specifically asked about the Facist love fest. \n\nWhy is it that TS constantly glaze Trump for “saying what he means” then in practically the same breath defend him by saying “oh he’s just talking he doesn’t mean any of that”?", "label": 1}
{"text": "I’m talking about Trump, who referred to those who oppose him as “evil” and “vermin.” He’s also outright stated that he hated people. For example, his “I HATE TAYLOR SWIFT!” tweet.\n\nHow do you feel about that, given your outrage over hate and hatred in people’s hearts?", "label": 1}
{"text": "Hospitals don't make the laws.\n\nIn Texas these decisions are left to ignorant Christian geriatric white men with zero medical knowledge. They know what's best, right?", "label": 1}
{"text": "Burden of evidence is very, very different.", "label": 1}
{"text": "Civil cases need to show 51% chance he did something. \n\n\nCriminal cases need to show 100% chance he did something", "label": 1}
{"text": "Not at all. Innocent until proven guilty. He wasn't proven guilty", "label": 1}
{"text": "Do you use this same standard in your assessment of immigrants? Of Biden? Of Harris? Of Hilary Clinton? Of George Floyd?", "label": 1}
{"text": "Yes. Biden accepted bribes, Harris slept her way up, Clinton deleted emails, floyd was high on drugs.\n\n\nAll of this is 100% verifiable and I have seen it. They got nothing on Trump but witness testimony from 20 years ago", "label": 1}
{"text": "You saw Harris “sleep her way up”?", "label": 1}
{"text": "Aren't they all not guilty of all of those things?", "label": 1}
{"text": "Let me think about it.  What do we know about it?\n\n1. The jury was made up of 95%+ of democrat voters\n2. They actually passed a law specifically to allow this sort of attack on Trump\n3. The nut job that accused him has also accused something like 8 or 9 other people in the same way and had them all throw out due to lack of credibility\n4. The accuser couldn't even tell you whether it happened in the 80's or the 90's\n5.  The dress she claims she was wearing when it happened wasn't even designed until years after the time period she said it occurred \n6. The judge was absurdly biased against Trump as can easily be seen from his rulings and factually incorrect statements\n7. There was zero evidence\n\n  \nUh, yeah. No, I don't feel at all uncomfortable about it.  That whole thing was a complete joke", "label": 1}
{"text": "You burn a ballot box in a liberal area where it makes absolutely no difference, then let the media spin take it.", "label": 1}
{"text": "In bizarro world only.", "label": 1}
{"text": "OK, but that doesn't change the act that was performed into something less than what it was. Why are you so concerned with legal semantics and not the fact that your chosen nominee forcibly inserted himself into a woman in a department store dressing room? That act still happened whether he's civilly or criminally liable. A brainwashed person might hold the opinion that the event never happened because a criminal conviction never resulted from the incident, but nobody is alleging that.", "label": 1}
{"text": "How about a court of law? I don’t understand applying this rigorous standard to those who have been in court, but not to those who have never even been on trial.", "label": 1}
{"text": "Sure. He had dimensia so I’m glad he’s not running again. Will you say the same about your candidate?", "label": 1}
{"text": "51% is still greater than 0%, right? As such, it is at the very least more likely than not based on the evidence that Trump sexually assaulted E.Jean Carroll.", "label": 1}
{"text": "If you took my meal away and didn't replace it because you still didn't have the replacement option prepared, then yes I would consider that you ended my meal. \n\nIf I took your steak meal away and told you I was bringing you another steak, but didn't have another steak to show for it, would I have ended your meal or not?", "label": 1}
{"text": "Wouldn’t a better analogy be something like, I say I’m going to take away your steak but don’t worry, I’ll replace it with something even better. And you say, okay with what? And I say, don’t worry about it. And you say, well I kind of like steak so I want to be sure it really is better. And I say, louder, don’t worry about it! And you say, well I am worried about it. And I say, well I’m going back to the kitchen and having them make something better. But no one in the kitchen can come up with anything. And then John McCain comes out with a thumbs down and I eat the steak. ", "label": 1}
{"text": "That’s not an accurate analogy, the “meal” in your comment would refer to healthcare in general. If you took my steak, you would be replacing it with a different steak, not the same one. So if Trump repealed Obama care, he would be getting rid of it and replacing it with something different, not the same thing. That’s a more accurate interpretation, right?", "label": 1}
{"text": "If I replace my relationship with another relationship, did I end thst first relationship?\n\nYou're arguing semantics. Trump supporters tend to dismiss his inconsistencies and hyperbole by saying we should figure out what he means, not listen to what he says. Don't you think he previously tried to communicate his intent to end Obamacare?", "label": 1}
{"text": "If Trump started pissing on your head and said it was raining would you get mad at the weather man for saying it’s sunny?", "label": 1}
{"text": "Airports during the revolutionary war?", "label": 1}
{"text": "If I replace your Angus Tbone with  a tough cut of stewing meat and a finger in your ass - did I replace your meal?", "label": 1}
{"text": ">From my reading, which is clearly not exhaustive. \n\nThis is why I ask. These hospitals, in addition to employing doctors, also employ a team of malpractice lawyers.\n\n>My reading is they wouldn't have been breaking the law.\n\nHowever, the team of actual malpractice lawyers I mentioned above had the doctors pump the breaks because they see a lack of clarity in the law. \n\nAn unclear law is a bad law. I don't see the logic in telling doctors to ignore the law at their will. Would you say the same to an abortion doctor doing what she thinks is right?", "label": 1}
{"text": "Do you feel you answered OPs actual question?", "label": 1}
{"text": "No. Geez. I just hate Obamacare. Sorry to upset you so much. I have no clue about any of the other stuff above. I guess we’re not allowed to even say anything anymore.", "label": 1}
{"text": "Not the person you were replying to. Am a doctor. Wife is a L&D nurse.\n\nTo be clear, this isn’t an extreme situation. It happens tens of thousands of times in the US, every year, if not more than 100k.\n\nWould you, if you and those like you if you were in power, be willing to enshrine in law, that the deliver/C-section must happen instead of a D&C procedure? Please be explicit in your response, and remember that either way the baby absolutely will be dead because it is pre-20/21 weeks (when lung alveoli capable of gas exchange even start to develop), and that the risk of maternal death is much decreased if an abortion takes place.\n\nAgain, please be explicit in your response that you would prefer more septic and dead moms (tens of thousands annually) regardless of the fact that the baby would die either way?", "label": 1}
{"text": "I think you’ve made it abundantly clear you’re willing to kill a lot of women when the outcome would be the same either way. \n\nYall need to go down bad. Thanks for the extra motivation to get my other physician friends to vote, I guess?", "label": 1}
{"text": "I've made it abundantly clear that I want women and children to be put in the same level and for both of their lives and care to be important to doctors. I made it abundantly clear at the start of this exchange (not with you, but when I started talking about this under this post) that I would like for us to do better in medicine to be able to serve both as best we can. \n\nIf that position sounds like I'm perfect fine with a bunch of women dying to people like you, I'm not going to lose sleep over you being incorrect.\n\nI think it's incredibly sad that you and others would vote in favor of killing children in situations where you see fit as doctors.", "label": 1}
{"text": "You don’t think we care about both? Why do you think I went into medicine? My wife going into labor and delivery?\n\n*There is no better solution. “Trying harder” is not fucking possible. The baby is going to die. Gas exchange is literally not possible before 20-21 weeks because of the timeline of fetal lung development.* The ONLY harm mitigation that can be done is for the mother in those situations. Antibiotics will NOT fix the problem, the dying fetus is effectively a massive abscess that only source control of the problem will fix, and the ONLY way to safely do that without MASSIVELY increasing the risk to the mother is a dilation and curettage, otherwise known as a surgical abortion. A C-section where there is again, effectively a MASSIVE INFECTING ABSCESS, will NOT help anything, and will only accelerate the bacterial infection of the mother, killing her more quickly.\n\nYou can try putting fucking guns to our heads and ask us to do what is literally impossible, and then you fucks will pull the trigger after we fail.\n\nWhy don’t you believe doctors when they tell this to you? Doing more is literally not possible!", "label": 1}
{"text": "I'm not disbelieving your medical knowledge. I'm just not willing to agree that killing the baby beforehand is okay. I understand the child is already dying, but you going in there and killing it then taking them out is not something I'd support.", "label": 1}
{"text": "This sounds very Catholic. Are you Catholic?", "label": 1}
{"text": "I am.", "label": 1}
{"text": "I am familiar with Catholic philosophical debate around this topic. Figured. I am also compelled to let you know that per the doctrine of double effect, as applied in the USCCB ERD Directive 47, there are absolutely situations where a surgical abortion for a pre-viable fetus is acceptable. The OP example is one such example, which again happens tens of thousands of times annually in this country alone.\n\nhttps://www.ncbcenter.org/messages-from-presidents/a-false-charge-against-catholic-health-care?format=amp\n\nPlease also note that the Church does not say that the abortion is a moral good in these situations, just that proportionality outweighs it.\n\nI am leaving this conversation, rather tired of being implied to be a murderer for facing impossible situations and actually choosing to save a life. Please understand your own denomination’s moral decision-making correctly. Goodbye?", "label": 1}
{"text": "I never implied that you're a murderer, just that you're supporting something I find to be wrong. \n\nAs I have said before, I'd understand removing the baby before viability for mom's health, as I said before. I'll read into that and learn about what the Church feels about that, so thank you for that information.", "label": 1}
{"text": "Child trafficking. Women's safe spaces are being compromised. Victims of illegal drugs. Homeless veterans.", "label": 1}
{"text": "When there are no victims, then it begins to look like lawfare.", "label": 1}
{"text": "Have you gone back and looked at Trump’s legal history? New Yorkers know who he is, has been and will always be.", "label": 1}
{"text": "Is there anything Trump could say that you wouldn't defend?", "label": 1}
{"text": "So if Trump suggested that companies fire employees for striking, would you consider that a position that was anti union?", "label": 1}
{"text": "You can’t be serious right?", "label": 1}
{"text": "And baleeted.  Oops?", "label": 1}
{"text": "There are SO many discombobulated Democrats here.", "label": 1}
{"text": "I know you haven’t replied, I assume that’s intentional, but a teenager just [died](https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala?utm_campaign=propublica-sprout&utm_content=1730413907&utm_medium=social&utm_source=threads) under the exact circumstances I suggested. And she’s not the only person. \n\nDoes this change your view of the liberal argument or no?", "label": 1}
{"text": "Do you still believe a bullet hit his ear, even though you don’t understand what a bullet would do to a human ear if it were hit? Obviously he was shot at, which is unacceptable, but let’s be accurate with what actually hit the individual.", "label": 1}
{"text": "It's shocking that you would even consider letting the government interfere with the free market and sell coke with whatever ingredients the public demands?", "label": 1}
{"text": "No.\n\nThe basic idea of \"we just have to not have any laws on abortion otherwise the red tape will be a massive issue\" just seems odd to me given how utterly extreme the position you are advocating for as a solution is.\n\nI am open to the possibility that the law could be written better, but it still doesn't make me think \"...and so abortion should just be fully legal\". That's bad reasoning imo.", "label": 1}
{"text": "So…not going to answer the question?", "label": 1}
{"text": "Do you ever listen to him speak and think, man this dude is batshit crazy and shouldn't have the keys to the nukes?", "label": 1}
{"text": "Why would they think that? Crazy people who are in a cult don’t think their batshit crazy cult leader is crazy.", "label": 1}
{"text": "Not going to sit here and debate conspiracy theories with people trying so hard to find fault.\n\nI suggest you look to other people for the rage bait.", "label": 1}
{"text": "Again, that’s not the issue. Is there a reason you continue to misrepresent the liberal position despite being told it repeatedly?", "label": 1}
{"text": "Is that not the position you described? Abortion needs to be fully legal, because otherwise doctors will be put in situations where they have to consider legal liability, and that will cloud their decision making.\n\nIs that not your view?", "label": 1}
{"text": "Is this how you handle all conversations when questions are posed to you that are difficult for you to answer?", "label": 1}
{"text": "I recommend you do your own research.", "label": 1}
{"text": "You can do your own digging for that.", "label": 1}
{"text": "Hadn’t he, for years, been saying China was our biggest threat. When did your fellow countrymen take over as the biggest threat to the US?", "label": 1}
{"text": "Not at all.", "label": 1}
{"text": "He sounds like a strong, intelligent leader?", "label": 1}
{"text": "How so?", "label": 1}
{"text": "As the person who’s expressing the views I’m telling you that it’s not. \n\nIs there a reason you feel entitled to dictate to liberals what their position on abortion is? Does that same grace get applied to me? \n\nOn another note I’ve presented evidence for my side. That women do actually die because of the policies you support. Can you provide any evidence of the elective late abortions? Or is evidence purely a liberal thing?", "label": 1}
{"text": "Like... Woman having the right to make their own health decisions about their body?", "label": 1}
{"text": "I think you have been fed a little propaganda. It was Hillary who purchased a fake dossier from Russia and got illegal FISA warrents to spy on the opposition, so don't lead with obvious propaganda.", "label": 1}
{"text": "Okay. I did my own research and decided HFCS is not nutritional, but not otherwise harmful. I’m undecided whether it’s worse than sugar. I’m curious whether you think it is the role of the government to prevent citizens from eating non-nutritional foods?", "label": 1}
{"text": "You haven't seen a rise in how often he slurs his speech, rambles, or goes off on weird tangents?", "label": 1}
{"text": "Name one, at least. And what has he been accused of?", "label": 1}
{"text": "Presumably the place doesn't have piles of drugs just lying around, so I would think you're referring to the place being infested with people on drugs. But then you said you're not talking about the people, so I am confused about what you're trying to say. \n\nCan you clarify what you meant?", "label": 1}
{"text": "Are you intentionally obtuse or habitually uninformed?", "label": 1}
{"text": "The New Yorkers who contribute to the highest GDP region in the country? Those New Yorkers?", "label": 1}
{"text": "Sex with a porn star is illegal?", "label": 1}
{"text": "I'm interested..is there anything Trump could do that would turn you off from voting for him?  He's got teflon like no other politician in history.  \n\nTrump simulated sex with a microphone today. at his final speech before the election:  [https://www.youtube.com/watch?v=1AebaA1AF9w](https://www.youtube.com/watch?v=1AebaA1AF9w)", "label": 1}
{"text": ">Ask yourself this, why do y'all struggle so much with his language when people who never even finished middle school have no issue with it?\n\nSo you're saying that most Trump supporters have never even finished middle school?\n\nSee how words can be interpreted when you value insult over just saying what you mean?\n\n>He's conveying that he takes that responsibility personally while somebody like Cheney doesn't.\n\nLike when he took responsiblity for abondoning the Kurds? Or how he took responsibilty for the deal he struck with the Taliban?", "label": 1}
{"text": "So you're saying that some Trump supporters haven't even finished middle school? That says a lot...", "label": 1}
{"text": "This question was already posted in this sub, then was deleted after the OP realized they were lied to by the media.", "label": 1}
{"text": "do you have a legitimate question? or are you just here to be a snarky bitch", "label": 1}
{"text": "I walked past the Trump rally in Milwaukee. Lots of hispanics, meaning Mexicans and Puerto Ricans, Milwaukee has no other hispanics, but a lot of Mexicans and Puerto Ricans. Milwaukee has Mexicans since the 40s so they're basically Italians. I bought a building in Shenandoah, Pennsylvania 12 years ago and the city was multi-racial, black and white, and they both hated the new Mexican population. It was weird.", "label": 1}
{"text": "Still waiting on an answer to my original question. Why you being a snowflake? Nice insult by the way, really shows your intelligence.", "label": 1}
{"text": "I don't know about you, but I'm tired of trying to parse meaning out of what he says. Aren't you? Doesn't it get exhausting having to defend what he says at every turn?", "label": 1}
{"text": "Maybe there's a disconnect here.", "label": 1}
{"text": "With all due respect, you didn’t answer my question.\n\nBack in July, Trump retruthed a post saying Liz Cheney was a “traitor” (pretty, extreme and/or divisive rhetoric, no?) and that she should face “televised military tribunal.” Are these beliefs not at all relevant to these recent comments about having guns pointed at her? \n\nAdditionally, there are subs where you can ask left leaning users about things Kamala has said, r/askaliberal. If you want to know liberal’s thoughts on Kamala’s statements, you can create a post over there. I’m interested to hear what specific statements you want liberals to “answer for”?\n\nThe point of highlighting the Liz Cheney and Dick Cheney endorsement, along with the 40/44 members of Trump’s Admin/Cabinet is to show that even lifelong republicans and conservatives who disagree with the VAST majority of liberal policies, can still agree and unite around common american principles of respecting the rule of law, free and fair elections, and rejecting wannabe “strong men”.", "label": 1}
{"text": "Apologies but I was not trying to respond to your question.   I am not interested in responding to your specific question as I feel I addressed the substance (or lack thereof) in my response above.  \nCheers", "label": 1}
{"text": "I think they’ve fixed that now? I’ve tried asking a weird question instead.", "label": 1}
{"text": "> Sure there’s a longer clip but I just don’t see this kind of authenticity and sense of humour from the left, at all.\n> \n> https://x.com/endwokeness/status/1851372266006987036?s=46\n\nSorry, did you post the right thing? I was looking forward to seeing something as you described but he's just dictating tweets complaining about Kamala's speech. What friends and family do you see? I only spotted Stephen Miller.", "label": 1}
{"text": "> You think a vaccination and possible side effects are temporary?\n\nSorry, you lost me equating *possible* side effects with making women’s decisions for them. I appreciate you explaining your point of view. At this point we’ll have to agree to disagree  as I don’t think your logic is logical at all.", "label": 1}
{"text": "Is there some tactful way to talk about war. I guarantee families of veterans get it.", "label": 1}
{"text": "Aww that's too bad :c \n\n\nAh well, was a good bit for a while, no?", "label": 1}
{"text": "Well stated.  I feel exactly the same.", "label": 1}
{"text": "There's literally a sub for asking Kamala supporters questions but this sub removed that link. Seems sus, no?", "label": 1}
{"text": "What’s does this mean?", "label": 1}
{"text": "Ask Aldrich Ames.", "label": 1}
{"text": "Why are Trump comments and \"out of context\" go together so often? Do you realize that every single bone-headed comment he's ever made has been excused as \"taken out of context\"?  At what point does that literally become the context?", "label": 1}
{"text": "What were your favorite parts?", "label": 1}
{"text": "Is it possible that the richest man in the world might be representing “the swamp” instead of the common man? Does Elon Musk seem like he is good at auditing expenditures considering he purchased Twitter for $44 billion when it’s now worth about 75% less than that?", "label": 1}
{"text": "If you don’t have any interest in what Trump has to say or believes why do you support him?", "label": 1}
{"text": "What did you think about them?", "label": 1}
{"text": "You should listen to context before trying a dumb gotcha question that you only try to ask to create your little attempts to show you dunked on a Trumper. \n\nThe nine isn't specific cause the only way for your idea to work is the number in a firing squad. He grabbed a number to point out we were outnumbered when fighting on average.\n\nBy the way, we haven't done firing squads in decades at least. Look into what a death sentence in the Military would mean now, then talk.", "label": 1}
{"text": "\"Can you find these exact words, while I ignore even more direct statements against him and act superior?\" No. This is a stupid game and you should be ashamed.", "label": 1}
{"text": "I have been civil and sincere. Can the generic responses to my specific requests for a quote or statement and name of a politician who has stated anything in equivalence be considered with the same sincerity and civility, which I thought was the purpose of this Reddit?", "label": 1}
{"text": "The purpose is to understand why we are who we are, but people like you are trying to play gotcha games using sad attempts to restrict the subject to where you have a chance.\n\nBy the way, if you want politicians threating each other, look up Cassius Clay sometime. Abolitionist.", "label": 1}
{"text": "Thank you for your response. IñAs mentioned previously, sincerity and civility were my goals and it was not my intention to play gotcha games by requesting a quote or example and doesn’t the addition of examples provide context to assist in understanding points of view?", "label": 1}
{"text": "Do you enjoy him as an entertainer or also as a politician with views you agree with? What were some hyperbole and stories from him that made you a supporter?", "label": 1}
{"text": "Alright then, what did I misunderstand?", "label": 1}
{"text": "Are you aware that Musk has banned several high profile journalists from the platform, complies with about 50% MORE government censorship requests (and we're talking FOREIGN govts controlling what you see and can say), not to mention he's banned several words from the platform because they upset transphobes? That his \"free speech absolutism\" was never intended for you or I?", "label": 1}
{"text": "Why is your post history?", "label": 1}
{"text": "the bots are getting loose.", "label": 1}
{"text": "So you see low egg and gas prices and assume everything is just fine?", "label": 1}
{"text": "What does that mean?", "label": 1}
{"text": "The question should be, does populism have a place in scientific discussions?", "label": 1}
{"text": "That’s a pretty accurate assessment. We learned recently that some (not all) democrats are bigger threats to America than China and Russia. We know they support abortions past nine months. They’re forcing kids to transition in schools. In fact we’re learning new info at every rally about how evil Kamala is I really don’t see how a supporter can ignore it all.", "label": 1}
{"text": "Ah well they should be banned since they can't learn anything from asking.", "label": 1}
{"text": "What are you talking about? None of this is true. Stop getting your news from Fox Entertainment.     \n     \n\n\nThe left side doesn’t want to kill babies. A person should have full bodily autonomy; fetuses are not babies. There are so many other factors involved in abortion. First, it’s none of your business. Second, how does it affect you personally? It doesn’t.     \n     \n\n\nLet’s think about this. This entire country was, and continues to be, built on the backs of immigrants. Unless you are Native American (meaning your lineage is from this continent and nowhere else), your ancestry came from another country at some point. Proud of that Irish or Italian heritage? Well, were your great-grandparents murderers or rapists? And what does it say on the Statue of Liberty? When your country is a melting pot of people from different nations, you can’t just close the doors when you feel we’re “full.”     \n     \n\n\nTransgender people are a world you may never understand. Closed-minded people are the worst because they care more about being “right” than acknowledging that people just want to live their lives.     \n     \n\n\nAnd this claim is just plain stupid. Use some common sense. No one is taking children to drag shows with sex toys. People take their children to libraries where drag queens read to them—a public place, during the day, and with no sex toys involved.     \n     \n\n\nHonestly, reading your comment makes me so sad that you believe everything Fox Entertainment tells you. Listen to NPR, read AP News. Use your brain, and stop regurgitating what you hear.     \n     \n\n\nI know none of this will change the way you think. I know I’m wasting my time and energy, but the ridiculousness of it drives me insane.     \n     \n\n\nIt’s simple: one side wants the rich to get richer while the middle and lower classes get poorer. Corporate greed is alive and thriving in this country. Meanwhile, the other side just wants basic needs and rights for everyone, not just for those they deem worthy.     \n     \n\n\nHuman kindness is free and never hurts.", "label": 1}
{"text": "Are you an American voter?", "label": 1}
{"text": "I never did, they brought it up. The conversation generally goes something like...\n\nMe: How have you guys been?\n\nThem: Not too bad really, but man, these gas prices have really jumped. I was planning a vacation to <insert place>, but I just can't afford the gas.\n\nMe: That sucks, the gas where we live is a bit lower/higher than up here, but ya, hope they go down soon.\n\nThem: If Biden would stop trying to kill the oil it would go down faster...\n\nMe: Gotcha, ya, well Iet's hope things smooth out!\n\nThem: It really is evil what they've been doing, him and Harris, can you believe it?\n\nMe: I don't really agree with that, but if that's what you believe, that's what you believe.\n\nThem: No, I'm telling you, they are out to destroy this country, just plain evil, a battle between God and the Devil.\n\nThis isn't an exact, literal, word for word example, but I'd say it's fairly representative. Now, admittedly, it doesn't happen every time, but enough times.", "label": 1}
{"text": "Fluoride is our best state.", "label": 1}
{"text": "Who on earth that is not self employed or working for a small business does NOT work for and towards institutionalized power. What a delusional thing to say?\n\nAre we only supposed to trust people who work for small businesses? Do you think Fox News or breitbart or infowars aren’t “institutional”? Omg", "label": 1}
{"text": "How should we pay for national voter ID?  The homeless or disabled (like a family member of mine living in a facility, destitute) can’t afford one, but own the same rights as every other citizen.  What new federal bureaucracy is going to be built to print, store, validate, distribute, adjudicate, and issue these new cards?  \n\nDo we have a strong understanding of why we do not have national laws requiring voter ID today?  \n\nIt makes sense to this independent to know a proper ballot was cast by a true citizen.  There has to be a historical reason why this is not encoded in law, today.  I have no understanding of this, but do you?  This can’t just be Willy nilly or completely ignored.  It can’t be an issue that only one side wants?  \n\nI think I am very skeptical that the lack of voter ID laws are skewing any election outside of what is statistically relevant.  Am I wrong?  What supporting context can I read or learn about that will help straighten this all out for me?", "label": 1}
{"text": "I'm sure this is what happened.\n\nAnd I'm sure you're trying to get me to go out and correct people when I have never once heard anyone say anything of the sort.", "label": 1}
{"text": "I guess if you ignore the rest of the post and the link and then twist it, it sounds a little ridiculous,  huh.", "label": 1}
{"text": "It's probably more nefarious then just keeping you busy, they can ask provocative questions. Then set up a bot that reports certain words.", "label": 1}
{"text": "> Who on earth that is not self employed or working for a small business does NOT work for institutionalized power.\n\nNo institutional economists predicted the subprime mortgage crisis. No scholarly papers or articles. [Austrians did](https://youtu.be/sgRGBNekFIw?si=wGWYmDWY1KRNqV19). Institutional (Keynesian) economists mocked them.\n\nKeynesianism is the theory that giving people with money and power more money and power will redound to the public good. It doesn't work and is too convenient. Distribution of money and power is organic, just stifled by gov't.", "label": 1}
{"text": "Do you not think Republicans have low intelligence because they are easily manipulated by a conman and are sucked in to a cult?", "label": 1}
{"text": "I see. Why do you think people with a little bit more knowledge of the world chooses Harris whilst those with a limited worldview chooses a populist like trump?", "label": 1}
{"text": "RFK, Elon Musk, and Tulsi Gabbard, all are former Democrats who currently have center stage in the republican party. Donald Trump himself a former Democrat. How can it be possible that the left feels misunderstood in any way. We understand them all too well.", "label": 1}
{"text": "I try to see which side lies most. Democrats hand down.", "label": 1}
{"text": ">Republicans seem to think of Democrats as stupid, but Democrats seem to think of Republicans as evil.\n\nI've seen the exact opposite, actually. I've also seen many Republicans claim this, even in the face of evidence to the contrary. It's really more of a truism.\n\nWe think of *Trump* as evil, but Republicans on the whole as misguided and misled. Why else would they follow someone who is so demonstrably criminal in his actions and words?", "label": 1}
{"text": "> The United States is not a democracy\n\nExcept it is. It's a representative democracy.   \n\n>The founders explicitly did not want to create democracy. \n\nYou are aware that they did, in fact, create a democracy, aren't you?  \n\nWhy do you believe the US is not a democracy? It fits multiple definitions of a democracy.", "label": 1}
{"text": "I should probably change that. It's become clear who any decent person should vote for, don't you think? Trump is *not* a decent man.", "label": 1}
{"text": "The only thoughtful answer, even if I don't arrive at the came conclusion.\n\nDon't you think this is already the default with a two party system in the US today?", "label": 1}
{"text": "I think your words do not belong in my mouth.", "label": 1}
{"text": "Aren’t we having a regional level headed discussion?", "label": 1}
{"text": "And there we go.  Another point in my favor!", "label": 1}
{"text": "No.", "label": 1}
{"text": "> Austrian economists, like the ones that work for George Mason…UNIVERSITY???\n\nNo one on the planet thinks George Mason University is an institutional power. It's not even Ivy League.", "label": 1}
{"text": "I don’t think you’re meant for this sub. I’ll let the mods know that you are a troll not here for the right reasons. To finish this off, I know many that don’t classify themselves as MAGA even though they plan on voting Trump. I know some that think Trump is an all holy being and truly consider themselves MAGA. From my experience, there is a distinct difference between MAGA and normal conservative. I’ll give you another chance to contribute in this reasonable, decent discussion. Is everyone in your circle all truly MAGA, or do some that you know not actually like him, but vote for a few singular issues that are impotent to them?", "label": 1}
{"text": "How so? I said that anyone who supports Trump is indecent, because he himself is indecent. I didn't call Republicans evil, and in fact many Republicans aren't supporting Trump- and more each day, apparently.\n\n\nOr are we at the stage of discussion when you'll simply claim victory even though you're quite clearly wrong? Let me know if you're going to continue to misinterpret my words, just so we don't waste each other's time.", "label": 1}
{"text": ">The left has this conspiracy theory all wrapped up in half truths, misquotes, and non-obvious connections..\n\n[Are these retruths by Trump \"misquotes or a non-obvious connection\"](https://x.com/TomDreisbach/status/1848770108400754744)?\n\nSpeaking of conspiracy theory...kind of like believing there was nationwide widespread fraud perpetrated by democrats by hacking voting machines, flooding the USPS with fraudulent mail in votes, making water pipes burst on purpose, [italian space lasers](https://en.wikipedia.org/wiki/Italygate), etc? Rather than just saying, \"Hey, maybe our guy is unpopular and lost the election\" and not trying to recreate the Pepe Silvia meme from a bunch of random things that happen in literally every election in history (voting machines being bugged, random circumstances of ballots being misplaced on accident, etc).", "label": 1}
{"text": "So what about the tons and tons of economists at non prestigious universities who disagree with Austrian economists? Are they disallowed from having opinions or positions you’ll hear out?", "label": 1}
{"text": "> So what about the tons and tons of economists at non prestigious universities who disagree with Austrian economists?\n\nA lot of people admire Madonna but she never wrote her music and she can't even play guitar. Her songs are pretty bad except Holiday. People just go along to get along. Keynesianism--or giving gov't more money and power--is the only ideology that makes sense for large, expensive, subsidized gov't institutions.", "label": 1}
{"text": "Has it really a place? Populism is us vs them. Solving complex problems with easy fixes. Trump is always saying he has a plan for anything that is coming in two weeks, it will be so easy, there is never a plan. Populism is just a way for chaos agents to rile up the people against the establishment. Is that really needed?", "label": 1}
{"text": "Trump needs to get elected, and succeed. \n\nThe left have no policies and no ideas because everything is anti-Trump. They will try to continue the anti-MAGA with the next candidate but then it will wane and they will realize they have to get back to proposing good policies instead of just fear mongering.", "label": 1}
{"text": "Lol, how does that even remotely follow from what I said?", "label": 1}
{"text": "\\> 2 million Americans have F levels above the US recommended amounts.\n\nSo because 0.6% of the population have drinking water with fluoride above the recommended level the white house should \"advise all U.S​. water systems to remove fluoride from public water\"?\n\nShit, if you guys took this attitude and applied to lead I might vote for Trump!", "label": 1}
{"text": "The problem here is pretty simple.  You think what you are doing is valuable discussion.  I strongly disagree and, to be perfectly honest, it's the same sort of garbage that I keep seeing from NS over and over an over that is neither productive nor anything outside of getting on your soapbox and trying to paint anyone who is a TS as \"worshipping\" Trump.  I would recommend not doing so in the future, and perhaps toning things down a bit, but that's just me.\n\nIn other words, I have no problems engaging in valuable discussion.  I haven't found anything valuable about this one, here and now, with you.", "label": 1}
{"text": "It was such a simple and easy question, and truly does help me understand a trump supporters perspective on if you believe that there are differing perspective on their support for trump or the support for the party. You see how you’re being a poor contributor?", "label": 1}
{"text": "And as I (tried to) point out, I didn't. But hey, there's no way you'll admit that, is there?", "label": 1}
{"text": "lol stop responding this commenter is just trolling you", "label": 1}
{"text": "But anyone who says this change would positively impact our health is objectively wrong, though, which is the issue I'm highlighting. It doesn't matter if RFK personally believes what he says or not. The government would still be encouraging officials to do something harmful.\n\nAre you saying that you agree with the conspiracy that fluoride in the water is bad for our health?", "label": 1}
{"text": "Enjoy your day.", "label": 1}
{"text": "Me or him?", "label": 1}
{"text": "Populism is common people vs elites. I’m a common person, so that’s the side I’m in. I’m against having a ruling class.", "label": 1}
{"text": "As an Australian, this American idolization of freedom has been really laughable. Do do plenty of things that make you not 'free'. Do you think you're free if you have to go into bankruptcy for a hospital visit? Or a more apples and apples comparison, are you free if the scary government *forces* you to file your taxes every year?", "label": 1}
{"text": "As an Australian, this American idolization of freedom has been really laughable. You do plenty of things that make you not 'free'. Do you think you're free if you have to go into bankruptcy for a hospital visit? Or a more apples and apples comparison, are you free if the scary government *forces* you to file your taxes every year?", "label": 1}
{"text": "So you're in favour of things like cheaper/free university education, better funded schools (inc. public schools), school lunches, etc? Because that's how you improve intelligence and political knowledge.", "label": 1}
{"text": "Say, people who know who won the presidency in 2020?", "label": 1}
{"text": "The libertarian half of me says yes, but the other side of me says it doesn't damage my children's brain.", "label": 1}
{"text": "Why don't you add floride to your own water and leave the rest of us alone.", "label": 1}
{"text": "That lie is so horrible.", "label": 1}
{"text": "Oh, the Washington post never lies. LOL", "label": 1}
{"text": "One of my favorites is lead. You develop a taste for it when the government doesn't give a s... about you.", "label": 1}
{"text": "I suppose slavery or imprisonment or persecution might not cause brain damage necessarily, but it may cause some serious PTSD.", "label": 1}
{"text": "Why don't you drink your own untreated water and leave the rest of us alone?", "label": 1}
{"text": "This is just “both sides” in long form. One side gets its news and information from reputable, credentialed sources, like scientists and good quality journalism outlets. MAGA, on the other hand, get their “information” primarily from each other (via social media) and alt-right conspiracy theory outlets, like Breitbart or OAN. Further, one side wants to preserve our democracy and believes government should at least be functional and in service of the people. MAGA do not even believe we live in a democracy *now*, and they certainly are much more prone to violence: against queers, against Latinos, against “the other.” They want an autocracy. There isn’t an equivalence between MAGA and their opponents: TS are evil, by any reasonable definition of the word. They are also confederates, just the same as those of the 1850s. Isn’t it a shame we haven’t treated them as such?", "label": 1}
{"text": "None of that is interesting, because it’s pure fantasy. The reality Trump has constructed isn’t real, and people who believe it are suffering a mental illness. People who support him are all racists, homophobes, and fascists. Why else would they support someone who wants to use the military against the American people and especially his political opponents, who repeats transphobic conspiracy theory lies to foment the outrage, and who wants to put Latinos in “detention” (i.e. concentration) camps? One day, armies of PhD students in psychology and neurobiology are going to be using Trump supporters as case studies in their theses about mass delusion and pure vile hatred of the other.", "label": 1}
{"text": "No, of course not. What a stupid, ridiculous question. That would be on you.", "label": 1}
{"text": "Have you read the majority of responses on this thread? https://www.reddit.com/r/AskTrumpSupporters/s/AmXNQx0lHy", "label": 1}
{"text": "Have you ever done anything in your life and found it difficult, while people elsewhere in the world might have done that same exact thing and not found it difficult, maybe because of environmental difficulties and circumstance? Would you consider yourself empathetic?", "label": 1}
{"text": "ID is easy for any adult to get. One can make excuses for the easiest of tasks. Society marches on.", "label": 1}
{"text": "Democrats are cunning linguistically.", "label": 1}
{"text": ">He isn’t Greek.  \nIf i somehow got Japanese citizenship\n\nGiannis didn't *somehow* get Greek nationality. He was born and raised in Greece. He was given a Greek name. He holds Greek nationality. Giannis' first language is Greek.\n\nWhy is his parents' origin relevant for you to assert that he isn't Greek when the Greek constitution clearly disagrees with you on this?", "label": 1}
{"text": "Yes.\n\nOP: \"I am scared by words.\"\n\nMe: This is what I think will happen. Do not be scared.", "label": 1}
{"text": "Was it another watermelon joke?", "label": 1}
{"text": "What do you think about Trump making up the story about Haitians eating pets?", "label": 1}
{"text": "Why was nothing done in the last 4 years to stop the repeat?  We all know the issues and the public has been screaming about it for 4 years.  \n\nTime to shrug our shoulders and yell about something we chose NOT to change, again?", "label": 1}
{"text": "Counting the mail in ballots, of which GOP passed laws delay the counting of til 3am?", "label": 1}
{"text": "I hear this \"late night dump of ballots\" a lot from Republicans.  But please let's remember a few things.\n\nLast election Trump and Republicans spent MONTHS saying \"don't vote by mail!\"  So of course this lead to a huge disparity of voting by mail being favored by Democrats rather than Republicans.  While the inverse, voting in person, was favored by Republicans.\n\nIn some states, like PA, they can't even begin to open the envelopes of the mail in votes until after polling has closed. If you have a ton of votes that you need to open and count and you can't even begin until 8pm then of course it's going to take well into the night to finish counting.\n\nNext thing to consider is that where there are more votes it's going to take a much longer time to count.  That should be pretty obvious.  Counting 10,000 votes takes longer than counting 200 votes.  So cities, because there are more people to count, take longer than rural areas.\n\nThe math on this was pretty straight forward too.  3:1 in favor of dems for cities.  3:1 in favor of dems for mail in votes.  So 9:1 in favor of dems from cities with mail in votes.  This is why these late night \"dumps\" were 90% dems.\n\nIs there any of this explanation that you disagree with?  Or do you really think it is all just rigged?", "label": 1}
{"text": "Because.  Reasons.", "label": 1}
{"text": "Would that apply to Mr Menendez of NJ?  Disgraced DEMOCRAT who had friggin gold bars in his house because of bribery?\n\nWhat’s the distinction between a politician who does “bad” things but is held accountable vs a politician who just does “things” and gets lawfared?  \n\nWho is the authority which can help me tell which politicians are convicted in court of true crime or whether it was a political hit job?\n\nI don’t need a re-hashing of all of the whataboutisms of the last decade specific to Trump - I’m looking for a process to help me understand when it’s bullshit and when a politician is truly guilty of a crime?  Regardless of the politician’s name?", "label": 1}
{"text": "This is by far the most reasonable take. Why do you think most other people in here think Trump is going to easily win? ", "label": 1}
{"text": "The law isn’t about your feelings or beliefs—it’s about upholding standards for everyone. What happened to law and order? Laws exist to protect people from deception and harm, even when that harm isn’t immediately obvious. Just because you don’t see it doesn’t mean it’s not real or that it should be ignored", "label": 1}
{"text": "It's not real because it's not real. What I see or don't see isn't relevant.", "label": 1}
{"text": "Isn't the problem that what the lawyer said conflicts with how it was marketed? Musk said it was \"random\" leading people expect a fair, unbiased selection without hidden criteria. If there were additional factors influencing the choice, then participants were fraudulently misled about their chances.", "label": 1}
{"text": "So we're just ignoring reality now? Saying 'it's not real' doesn’t make it true. Whether or not you see the harm doesn’t change the fact that it exists. Dismissing something because it doesn’t fit your perspective isn’t a valid argument—it’s just willful blindness", "label": 1}
{"text": "We had 4 years of Republican lead investigations in the House, in the states and in the courts. \n\n\nIn Arizona specifically a Republican backed group was just given all of the ballots and voter registration information to look over for years. \n\n\nNothing was determinative was found. The group in Arizona specifically found nothing. \n\n\nHow is this not the most investigated election result in our history? ", "label": 1}
{"text": "I think it’s similar to people rooting for their sports team. Yeah, they could lose, but it’s not fun to talk about it.\n\nLots of people like to stay in their bubble as well. Goes for both sides", "label": 1}
{"text": "Do you have evidence of actual fraud from 2020? If so, you should have sent it to Trump’s legal team, because they couldn’t prove anything in 60 court cases.", "label": 1}
{"text": "I’ve never heard a good answer to this follow-up question: if so many fake ballots were dumped at the last minute for Democrats, why didn’t it show up in the Congressional elections? Democrats underperformed in several winnable Senate races and in the House, barely clinching the Senate and leaving no room for error on votes. Are you suggesting they were able to swing millions of votes for Biden across several states, but couldn’t manage to unseat Susan Collins?", "label": 1}
{"text": "Are you gonna claim it was fixed no matter who is winning after 3 AM, or is it going to be Schrödinger’s election?", "label": 1}
{"text": "Hypothetically, the steal occurred at the precinct level. The Democrats obviously can't pull off fraud in every precinct, especially in red ones. The fraud would be over producing in urban precincts they had full control of and could add ballots without people noticing. If anything, Republicans taking the house and losing the presidency and Senate is evidence of fraud, as the precincts that couldn't be controlled went Republican.", "label": 1}
{"text": "Interesting you taking that route since trump wasn’t chosen by the people either (has never won the popular vote). \n\nBut as for my question, I meant an example of organizations choosing the winners. Do you have any examples besides Musk?", "label": 1}
{"text": "Would gerrymandering also explain this and why or why not?", "label": 1}
{"text": "I’m sorry, what WOULD a “threat to democracy” look like to you, if not a violent attempt to overthrow the federal government (Jan 6)?", "label": 1}
{"text": "Let me clarify. The democratic government didn’t do enough to stop the violent republican coup, so they’re at fault for the coup? Not those who… actually did it?", "label": 1}
{"text": "To be clear, if it was illegal that would have been bad? Perhaps breaking the law is even, disqualifying?", "label": 1}
{"text": "You think an organisation capable of installing the most powerful person on the planet only does so when they think they have to? Maybe you should stop believing the word of a man who literally cannot stop lying?", "label": 1}
{"text": "Again they thought Hilary had it.", "label": 1}
{"text": "Not the same person above, but wouldn’t having social media remove dangerous messages from their platforms technically be considered censoring?\n\nIt’s really hard for me to understand, but  it appears that there are many people who believe that they have the right to say anything at all online with zero consequences.  Why they believe that when you can’t do it walking down the street without being charged with disorderly conduct or worse I have no idea?\n\nBut if they agree that it’s wrong and a crime to threaten to blow up a federal building or kill police they don’t agree with, then they already believe it some form of censorship.  We’re just haggling over where the goal posts should be. Why not just extend the same rules from physical space to online space?", "label": 1}
{"text": "I think OP means well, but there is truly no need for that question. You people are anti american traitors who are a threat to our country.", "label": 1}
{"text": "What's your point? \n\nThe percentage of abortions that happen in the third trimester, especially in the last few weeks of pregnancies are not something that a person suddenly just decides to do because they aren't ready for/don't want a kid. These people have gone months expecting a child. Probably have a nursery set up. Probably have a name picked out and then are given terrible news that either their life is at danger or the life of their future child is not viable.", "label": 1}
{"text": "Is this your sincere response? Because since you’re so sure of Biden’s health I was assuming you at least had a medical background and can speak to which type(s) of dementia he’s exhibiting. And I’d dare to ask if you notice any symptoms of dementia in Trump, but I wouldn’t expect a genuine answer at this point", "label": 1}
{"text": "Conspiring to do what?\n\nIs taking 3.5 days outside the norm with huge turnout and laws restricting when mail-in ballots can be counted?\n\nTrump also got more votes than Obama despite having low approval numbers. Is that also suspicious too? Isn’t it plausible that millions of people turned out to reject Trump rather than support Biden? If not, why not?", "label": 1}
{"text": "Will you cry fraud when Trump loses?", "label": 1}
{"text": "If it’s a fair election, no", "label": 1}
{"text": "I'm genuinely confused. How bad is public education at this point that people DON'T know this?", "label": 1}
{"text": "How will you be able to tell?", "label": 1}
{"text": "Doesn’t your article say it was small as a percent, but was the biggest simply because it was the biggest campaign ever? Just seems like a disingenuous thing to mention \n\nAlso, thank you for your perspective on what Musk’s doing not being like buying votes", "label": 1}
{"text": "And yet thanks to Trump and other republicans, those clauses don’t exist or are useless. So why vote for more of that? For more dead mothers?", "label": 1}
{"text": "Correct it's one of the only things that I disagree with the Republican party on. \n\nBut to your point, the human trafficking across the border and the innocent women and children killed in war are something that I believe is equally if not more important.\n\nI say this because as of now the abortion laws can be decided in each state. So I will vote accordingly for that in my state. And I urge others in illegal states to change their laws to protect women.", "label": 1}
{"text": "So you will vote blue and encourage others to do so to avoid the many preventable deaths of women?", "label": 1}
{"text": "I enjoy our union of states, I enjoy the republic that is our constitution. I have voted blue for Wisconsin government before. And red for federal. This will be what I will be doing this election also. Trump 2024 for sure, but for my wisconsin legislature, blue.", "label": 1}
{"text": "Is it viable to invent conspiracy theories to explain shortcomings?", "label": 1}
{"text": "How do you feel about Trump’s Truth Social post on 12/3/22, writing “A Massive Fraud of this type and magnitude allows for the termination of all rules, regulations, and articles, even those found in the Constitution” ?\n\nHow do you feel about him threatening to hang Mike Pence for following the Constitution?", "label": 1}
{"text": "Bruh, having discourse with dictators is the only way to have diplomacy. \n\nI don't believe she will be effective with a ceasefire in Gaza, definitely not more effective than Trump, and certainly not more affective then Trump with Putin. Putin is praying Kamala wins lmao.\n\nThe kids in cages thing started with oboma and continued throughout Bidens presidency. A whistle blower came out in 2023 and spoke about how immigration in 2022 was sending kids to unknown locations and never hearing back from them. https://judiciary.house.gov/committee-activity/hearings/biden-border-crisis-exploitation-unaccompanied-alien-children it lists the whistleblowers name.\n\nAs for the litigation Trump paid, idk but it was litigation for defamation. If he there was a rape in confused why this hasn't been prosecuted to the fullest extent with conviction. And why am I only hearing about this now, seems like a story the media should have been saying forever if it bore legitimacy.\n\nWhy hasn't the Biden admin released the Epstein list/papers then?", "label": 1}
{"text": "Nancy Pelosi said the exact same thing in 2017 when Trump won the first time he ran. https://x.com/SpeakerPelosi/status/864522009048494080?lang=en\n\nEither an election can be stolen or it can't. Y'all need to make up your minds on this one. When Trump claims fraud it's a huge deal, but when Democrats claim fraud it is acceptable? \n\nWell how much do you believe in the checks and balances? I don't believe he has the power to make a dictatorship even if he wanted to, but I don't think he does anyway.", "label": 1}
{"text": "As long as he goes about changing the system the legal way to ensure we have fair elections in all for it, which I believe he absolutely will remain within his legal bounds.", "label": 1}
{"text": "\nDo you think he has discourse with dictators or that he idolizes them? \n\nTrump says, “I need the kind of Generals that Hitler Had”.\nIn a conversation with his former Chief of Staff, John Kelly - Trump said: “I need the kind of generals that Hitler had,”\n\nKelly responded by asking, “‘Do you mean Bismarck’s generals?’” He went on: “I mean, I knew he didn’t know who Bismarck was, or about the Franco-Prussian War. I said, ‘Do you mean the kaiser’s generals? Surely you can’t mean Hitler’s generals? And he said, ‘Yeah, yeah, Hitler’s generals.’\n\nWhen Kelly asked Trump for clarification, the then-president reportedly replied by specifying: “The German generals in World War II.” Source: https://www.msnbc.com/rachel-maddow-show/maddowblog/john-kelly-trump-offered-private-praise-hitlers-generals-rcna176664\n\nJohn Kelly his long serving chief of staff today said: He said that, in his opinion, Mr. Trump met the definition of a fascist, would govern like a dictator if allowed, and had no understanding of the Constitution or the concept of rule of law. source: https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html\n\nIn the interviews, Mr. Kelly expanded on his previously expressed concerns and stressed that voters, in his view, should consider fitness and character when selecting a president, even more than a candidate’s stances on the issues. source: https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html\n\n-———\n\nTrump using Nazi Rhetoric\n\nTrump saying “They’re Poisoning the Blood of our Country”\n\n•\t⁠Trump: “They’re poisoning the Blood of our country that’s what they’ve done” - https://www.youtube.com/watch?v=RKPFjAhd3KQ\n•\t⁠Trump: “they’re ruining our country and it’s true they’re destroying the blood of our country that’s what they’re doing they’re destroying our country they don’t like it when I said that and I never read Mein Kampf they said oh Hitler said that in a much different way and they’re destroying the blood of our country they’re destroying the fabric of our country and we’re going to have to get them out” - https://www.youtube.com/watch?v=aDQWgF5KMTw\n\n-———\n\nTrump keeps a book of Hitler’s speeches by his bed:\n\nIn 1990 way before Trump got into politics Ivana Trump (his first wife) told her lawyer that Trump would keep a book of Hitler’s speeches titled “My New Order” by his bed:\n\n•\t⁠Ivana Trump told her lawyer Michael Kennedy that from time to time her husband reads a book of Hitler’s collected speeches, My New Order, which he keeps in a cabinet by his bed.\n\t⁠•\t⁠You can read the entire 1990 Vanity Fair Article here: https://archive.vanityfair.com/article/share/e515a2cd-a51b-4f83-8d61-6ebb9a104e0a\n\n-———\n\nTrump Praising Putin and Kim Jong Un:\n\nPutin:\n\n•\t⁠Former President Donald Trump on Tuesday described Russian President Vladimir Putin’s invasion of Ukraine as “genius” and “savvy,” - Source https://www.politico.com/news/2022/02/23/trump-putin-ukraine-invasion-00010923\n•\t⁠“The smartest one gets to the top,” Trump told the crowd. “That didn’t work so well recently in our country. But they ask me, ‘Is Putin smart?’ Yes, Putin was smart.” source https://www.cnn.com/2022/03/28/politics/trump-putin-ukraine-russia-smart/index.html\n•\t⁠“They say, ‘Trump said Putin’s smart.’ I mean, he’s taking over a country for two dollars’ worth of sanctions,” Trump told a crowd at a fundraiser at Mar-a-Lago, according to a recording of the event. “I’d say that’s pretty smart. He’s taking over a country – really a vast, vast location, a great piece of land with a lot of people, and just walking right in.” source. https://www.cnn.com/2022/03/28/politics/trump-putin-ukraine-russia-smart/index.html\n\nKim Jong Un:\n\n•\t⁠“How smart is Kim Jong Un? Top of the line. … really smart. You know, when you come out and as a young man at 24, 23, even though he sort of inherits it … he took over a country of very smart people, very, very energetic people, very tough people at a very young age and he has total dominant control.” source. https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/\n•\t⁠“‘You know you call people sometimes killers, [Kim Jong Un] is a killer. He’s clearly executing people,’ Baier said. ‘He’s a tough guy,’ Mr. Trump responded.” source https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/\n\nThis link has a huge list of all the time Trump has Praised Putin, Xi JinPing, and Kim Jong Un source https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/\n\n—————\n\nTrump regularly dehumanizes Illegal Immigrants and those who are opposed to him:\n\nDuring the Holocaust, Nazis referred to Jews as rats. Hutus involved in the Rwanda genocide called Tutsis cockroaches. Slave owners throughout history considered slaves subhuman animals. In Less Than Human, David Livingstone Smith argues that it’s important to define and describe dehumanization, because it’s what opens the door for cruelty and genocide. Source: https://www.npr.org/2011/03/29/134956180/criminals-see-their-victims-as-less-than-human\n\nTrump:\n\nFormer president Donald Trump denigrated his domestic opponents and critics during a Veterans Day speech Saturday, calling those on the other side of the aisle “vermin” and suggesting that they pose a greater threat to the United States than countries such as Russia, China or North Korea. That language is drawing rebuke from historians, who compared it to that of authoritarian leaders.\n\n“We pledge to you that we will root out the communists, Marxists, fascists, and the radical left thugs that live like vermin within the confines of our country,” source https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/\n\nTrump has frequently referred to immigrants in the country illegally in subhuman terms, for example referring to them as animals who are prone to violence. source https://www.reuters.com/world/us/bloodbath-vermin-animals-trumps-rhetoric-trail-2024-03-22/", "label": 1}
{"text": "Wow you've got a whole ass copy-pasta ready for this discussion 🤣", "label": 1}
{"text": "Did you read any of it? I don’t understand the term. It’s facts and sources of Trump praising Hitler, Putin, and Kim Jong Un", "label": 1}
{"text": "So you don’t care about him overturning the constitution or hanging a man? I guess we’re done here. Have fun with your fascism. I’m too worried about losing access to my cancer meds because they’re the same meds project 2025 wants to outlaw. Can’t sleep tonight wondering if I’m going to die a preventable death in my 30s.", "label": 1}
{"text": "Oh you have to give me longer than 39 seconds to read and respond to each link. Copy-pasta = you had this ready and written somewhere prior, copied it, and pasted it into the reply box", "label": 1}
{"text": "So John Kelly's eyewitness testimony is that, it's hearsay. We have no proof trump said those things and it cannot be proven. Such statements would never hold up in a court of law and cannot be trusted as fact.\n\nThe vanity fair article with Ivana is the same as the above. No does reading historical books signify that he agrees or aspires to be like the historical figure. I would argue that if he did this it's probably partly where he learned how to make good speeches. It means absolutely nothing in terms of him trying to a dictator though. I can read the 52 rules of power, but that doesn't make me some evil manipulator. You aquire knowledge and then can use it to benifit you sure. Where the knowledge comes from is of little importance as long as you motives are pure. \n\nHim calling Putin smart is quite literally just a true statement. Putin has to be smart for him to still be alive and in full control of Russia. It doesn't mean he agrees with the guy.\n\nAs for his use of speech such as poisoning blood of the nation, vermin, ect... It is bad rhetoric, but does not signify at all that he wants to exterminate or commit genocide. That is an absurd comparison. If Trump came out and said we need to start offing immigrants for no reason other than their skin color, id be right there with you fighting against him. But that is not at all what he is saying.\n\nEverything that you have just typed into this message is : \n\n1. Appeal to Emotion (Pathos)\n\nThe language used, such as \"Nazi Rhetoric,\" \"dictators,\" \"fascist,\" and comparisons to historical atrocities, seems aimed at evoking a strong emotional response rather than solely focusing on logical evidence. This tactic can lead to biased interpretation, appealing more to feelings of fear or disgust than rational analysis.\n\n\n2. Association Fallacy (Guilt by Association)\n\nThe argument suggests that Trump’s praise for foreign leaders or his possession of a book of Hitler’s speeches implies alignment with, or support for, dictatorial or authoritarian values. While these facts may be relevant, assuming his actions or similar intentions without further evidence can lead to a misleading conclusion.\n\n\n3. Cherry-Picking\n\nThe argument selectively cites incidents that support the claim of Trump’s alleged admiration for dictators and fascism while ignoring any statements or actions by Trump that might contradict this narrative. This selective presentation of evidence can create a distorted view.\n\n\n4. Straw Man Fallacy\n\nThe argument may misrepresent Trump’s actual statements or views to make them easier to criticize. For example, describing his praise of leaders as an endorsement of their authoritarian qualities might be an oversimplification of his comments, which could have been made for other reasons (such as recognizing strategic intelligence or strength, not necessarily endorsing their ideologies).\n\n\n5. False Analogy\n\nDrawing direct comparisons between Trump’s language and historical authoritarian rhetoric (such as Hitler’s or that of the Nazis) implies that similar language has similar intent. However, language can have varied meanings based on context, and drawing a direct parallel can be an overreach if the full context of his statements is not equivalent to those historical examples. \n\n\n6. Appeal to Authority\n\nThe argument relies heavily on John Kelly’s opinion as a former chief of staff, suggesting that his personal views about Trump’s fitness, character, or intentions hold authoritative weight on Trump’s character. Although Kelly’s perspective is significant, it doesn’t necessarily serve as conclusive evidence, as it remains a subjective viewpoint. In this case it is also Hearsay.\n\n\n7. Slippery Slope\n\nThe argument appears to imply that Trump’s language and admiration for strongman figures suggest that he would, if given the chance, govern in a fascist or dictatorial way. This presumes a chain of events or motivations without clear evidence connecting them directly.\n\n\n8. Confirmation Bias\n\nThere’s an apparent focus on information and sources that reinforce a particular viewpoint about Trump’s alleged admiration for authoritarianism and fascism. This narrow focus indicates a biased approach to interpreting and selecting evidence", "label": 1}
{"text": "He did not do that, and he will not. \n\nWhat cancer meds is P2025 outlawing?", "label": 1}
{"text": "Did you read my comment about his statements? \n\nEligard, anastrazole, tamoxifen, lupron, letrozole. I’m sure there’s more.", "label": 1}
{"text": "It links me to a new network that paywalls my ability to read their article. \n\nI still question why he didn't just fully overthrow the government at that time if that really was what he planned/plans on doing.\n\nHow exactly would he overthrow our government, and if he can, what's to stop the Democrats from doing exactly that?", "label": 1}
{"text": "God I'm so tired of you people using your misunderstanding of economics as a gotcha against the Biden admin. Why do you people only praise trumps first 3 years that he inherited from obama but ignore covid flat out, only to then blame Biden for the aftermath of covid? Why do you not blame Trump for making the deal with opec to stop oil production in the last months of his presidency so then oil prices would skyrocket? Why do you not blame trump for his terrible tariff plan that caused a trade war with China and hurt the agriculture sector? Why do you ignore trumps awful tax policy which expired for the poors?", "label": 1}
{"text": "So you gonna ignore the question or are you going to answer? Would you be just as disinterested if it were George Soros doing the same thing?", "label": 1}
{"text": "She was on the god damn ticket that won the primary and she got the delegates she needed. Do you understand that the parties can choose how they choose their candidate? \n\nEvery single lib I've talked to about this issue either doesn't give a single shit about it or it is a tertiary issue for them. Why does the right seem to care so much when the party that the candidate represents doesn't seem to give a shit?", "label": 1}
{"text": "This isn't my experience of any Dems I know. \n\nAnd I know trump is a fascist. And famously no fascist has done anything for their country but commit economic suicide and lead to the dead of civilians. \n\nI think if he goes away, other authoritarians will take Trump's place when he's done and destroy democracy in the US using the rules and norms he breaks. \n\nThe ferver for fascism is the issue for me.\n\nHalf my friends are republicans. None of them are fascists.\n\nAre you a fascist?", "label": 1}
{"text": "\"Be careful to do what is right in the eyes of everyone.\"\n\n\nWhy does that not apply to conservatives, who almost universally support their fancy, very controversial story about election fraud without any evidence? \n\n\nThat's clearly not right in the eyes of everyone. It's right only in the eyes of most conservatives. (And I bet most don't feel it's right in the sense of provable, instead it's right in the sense that it gives power to conservatives by sowing mistrust in democratic processes).", "label": 1}
{"text": "I've had people accuse me of thinking that way. Trump supporters are SERIOUSLY twisted in the head. I think anyone who commits violence because they are trying to overthrow the election results if Kamala wins should be jailed appropriately, and got accused of saying that I want to jail Trump supporters? Get fucking real lol.", "label": 1}
{"text": "Wasn’t it JD Vance that called Trump Hitler?", "label": 1}
{"text": "> Burning down our cities.\n\nWhere can I read more about entire cities that were burned? I've heard other TS bring this up, but never once found an example of a city burning due to political things.", "label": 1}
{"text": "Look, man. What you're displaying is someone who has a ton of internal trauma/pain, and it's being projected onto everyone else within your vicinity. I promise you that right now, you are only talking like a kid who hasn't gotten what they wanted, and its easier for you to spew it onto everyone else, especially behind a keyboard. I suggest you seek some help and to work on self(awareness). Narcissism and egomania are powerful traits and not in a good way at all. What happened to you to cause this pain?", "label": 1}
{"text": "Lol. Sure thing", "label": 1}
{"text": "Lol. Fuck out of here with pseudo-psychic bullshit.\n\nI'm White and working class in America. If that's not obvious \"psychic trauma\" to you, then we are speaking different languages and it's a gap that cannot be bridged.", "label": 1}
{"text": "Let's start with Hillary and a fake dossier she purchased from Russia. Then Quid Pro Joe and his dealings with his son and Ukraine. How about the cover-up of a laptop computer belonging to said son. All the hidden money from China as well as Ukraine.  The fact that Covid was conjured in a lab and that the NIH had a hand in that. How about Trump followers are racist when the opposite is true. I could probably go on.", "label": 1}
{"text": "Now, you are beginning to understand. Most of the worlds lawers are in the US.", "label": 1}
{"text": "You haven’t picked apart anything have you? You thing talking about polygenic traits is a digression because you don’t understand how to do science. To dismantle an assertion you look at all the ways an assertion can have validity. I did that and dismantled any possible way race could be real, didn’t I? The fact that you. Any understand why I was talking about polygenic traits, or gene pools isn’t my problem, is it? Your views have no basis in fact or science and are completely deluded and devoid of evidence, aren’t they?", "label": 1}
{"text": ">>think it was the “Trump is Hitler but this time we’re serious”\n\n>This came from Kamala?\n\nYour reply  to this comment:\n\n>Yea\n\nQuoted.\n\nHopefully you learned something.\n\nWhy are you arguing in bad faith?", "label": 1}
{"text": "Have you heard of Allan Richtman? He's never been wrong on picking the president for the last 43 years", "label": 1}
{"text": "What? He can't take being held to account as a politician for his Hitler paraphrasing? Is he too weak to handle a little criticism? Hmm?\n\nA president shouldn't call his constituents demonic. Remember, Trump works for us too now. He's no longer just president of MAGA World. He's answerable to US TOO.", "label": 1}
{"text": "Trump was right about one thing. We are a failing country.\n\nI hope you guys realize that Trump works for us too now, right? He's not just president of MAGA-World anymore. If he wants to be our president too, he better start listening to the concerns that WE have too, for once. We are hard-working Americans after all, right? He should at least care about THAT if he wants to be our president too... you'd think? \n\nBut I don't think he will. He's never been kind to \"losers\" like us. I guess we're just going to have to get used to being kicked around, right?", "label": 1}
{"text": "I'm aware you all are delusional, yes. That has nothing to do with him.", "label": 1}
{"text": "Are you joking? You say this yet his cult of personality and charisma is the reason why he grew such a massive cult following in the first place?", "label": 1}
{"text": "That's really all it was about right? To hurt the opposition... not to govern. ", "label": 1}
{"text": "What about Democrats just doing what you guys do and saying \"fuck it, the system is broken, let's burn it all down\"? \n\n\nI can tell you honestly, as a Non-supporter, that I no longer give a shit about this country. And if anyone on the right tries to tell US that we need to \"unite\" and \"have hope for the future\"... My answer to you will be in the immortal words of the guy you just elected:\n\n\n\"FUCK YOU.\"\n\n\nIf he say that to half the US, then Democrats need to get a candidate who will play the same game and say it right back to YOU. ", "label": 1}
{"text": "Have you considered having your gullibility organ checked by a doctor?", "label": 1}
{"text": "You’re right about voting values. All people vote their values, not their personal self-interest. Rural values tend to be “traditional” meaning conservative, with a fear and reluctance to change. With a desire to “conserve” they way things used to be: men in authority over women, fear of people different than them like immigrants and the LGBTQ community, and the idea of individual responsibility  (meaning kids who go hungry shouldn’t get school lunch because it’s their parent’s responsibility, not the government). All good, loving, biblical values?", "label": 1}
{"text": "This logic makes no sense. So tax cuts for the wealthy are good? Raising taxes for the poor and middle class are good?", "label": 1}
{"text": "lol do you think capitalism started 50 years ago, or that it always had an income tax for instance lol.", "label": 1}
{"text": "You know he does sound like a fascist right? Or do you not get that news?", "label": 1}
{"text": "Do you guys even listen to what he says?", "label": 1}
{"text": ">There are many. If you can’t be bothered to find them, I can’t be bothered to explain them\n\nThat's entirely your prerogative. I was asking for one positive reason, bonus for it bringing the country together, bonus if it wasn't actually, in certain lights, a negative (i.e. I don't like how this thing was going so I'm going to undo it).\n\nI can name many, many negatives to place against your list of 0 positives. The financial impact of protectionism; the effect on women's health and rights; the looming threat over the heads of LGBTQ people; the cosying up to the enemies of democracy so long as they show the correct amount of deference to Trump himself (NK, Russia); the climate change denial, which flies in the face of one of, or the, biggest threats to the West, or even the world today (and which is set to make any current migrant crisis look tiny).\n\nIt's fine to say \"let's tackle illegal immigration\", but by definition it was already *illegal*. Previously the guy said he would build a wall and Mexico would pay for it. Didn't happen. So even if he had a \"positive\" plan for blaming poverty and inequality on immigration and then addressing it, why should we even believe him? Considering what went on last time - i.e. separating children from families, putting them in cages - I'm not absolutely sure that I want him to do what he says he's going to do, but even if he says it, I don't necessarily believe it would happen. It would be very naive to believe him.\n\nPlus, I mean, you're missing the point about the cats and dogs thing. It's a factor of the election being absolutely riddled with complete misinformation. People are willing to believe a complete lie, doubled down on by the VP - or the have the cognitive dissonance of knowing it's a lie but pretending it's correct in a vague, \"it's not true but it's believable\" way. What does that say about the American public's grasp of the issue(s), the media's ability to hold liars to account, or the clarity of the talking points? What else are they lying about? Saying things like that muddies the waters and makes an absolute farce of public discourse. Which of course is what Trump, and possibly in fact both \"sides\", wanted!\n\nIf you can't name a positive policy? No problem, but please don't pretend that's a *me* problem, it's a *you* problem.", "label": 1}
{"text": "Just to say - The point about fascism, Hitler, Mussolini, Franco, WW2 - is *a lesson from history*.\n\nThat is, don't let it happen again, and be on guard for it happening again.\n\nIs Trump a Nazi? No, of course he isn't. Do Nazis like him? In some instances, yes, they do. Is Trump a narcissist, an egoist, who feels as if he is entitled to power, and is desperately vengeful and spiteful about anyone or anything that criticises him? Yes.\n\nWould such a person use the means at their disposal - the far right, evangelical Christianity people, useful idiots who just go along for the ride and the opportunity to feel like they're important and having an impact - would he use those means to grip on to power, even if it meant throwing the people that these groups hate - LGBTQ people, women who don't want to just be a womb on legs, religious and racial minorities - under the bus?\n\nThat's the question at hand, and that's where \"never again\" comes into play. Don't you think that it would be reckless and irresponsible to see someone hinting that they may do away with elections, signalling that they don't believe in climate change, that immigrants and liberals are \"the enemy within\" and are secretly Marxists, that most immigrants are criminals and rapists who barely have an understanding of modern societal norms, such that they'll eat your pets and so on - don't you think it would be irresponsible to see this happening and shrug? To say \"well until he opens the first camps, we'll stay silent\"?\n\nHe's not a Nazi. He may be fascistic and dearly wish that he did live in a country where he could seize power and rig elections. He's far from being morally or intellectually above using his more extreme supporters to ride the wave to endless emergency power. That's what people are worried about, so far as \"he's a Nazi, he's a fascist, and so on\".\n\nQuite part from that, he's an abhorrent person who has done some utterly disgusting things during his last presidency, so even taking out this casting of him as a right wing demagogue aside, most people are upset to see the return of that \"kind of thing\". I thought Biden was absolutely rubbish (and indeed arguably evil), but he didn't intentionally separate families from their children, and lock those children in cages. He oversaw a genocide in Palestine, but Trump shows no sign of preventing that going further, so no change there.\n\nNot a liberal, not a supporter of Harris, apologies if that's a very wordy explanation.", "label": 1}
{"text": "Do you recognize any irony in stating that while being a supporter of Donald Trump? That is his entire political personality in a single sentence.", "label": 1}
{"text": "So you’re admitting all of you are just full of shit?", "label": 1}
{"text": "With respect though, \"the right\" seems to be... almost inextricably tied up with the forwarding of an agenda that puts to the forefront the rights and privileges of the already strong and already powerful, for social reasons, the economic status quo, and probably also for religious reasons. In the US, this happens to primarily be white people, and mostly men. This seems to come at the detriment of... women, POC, LGBTQ people, non-religious people or people who aren't Christian.\n\nThe left seems to be tied up with criticising that mindset and looking to - on a sliding scale - either redress the balance by sliding some of the power and resources to people who are at the bottom of the ladder, or... you know... destroy the ladder, if you mean an anarchist or a communist or whatever.\n\nSo, I guess my question is, how are these things \"comparable\"? I don't think \"the left\" is perfect, but the political goals of the left are to upend the structure so that things are fairer (or so we start from scratch), \"the right\" is to rigidly maintain that structure. To my mind, either actively trying to keep down, or passively and callously not caring about people being kept down, by political policy, is inherently... \"bad\", either ignorant or just... evil, basically. \n\nSo, in short, I agree. Where do we meet in the middle? I say to you \"OK, we can let the police sometimes treat black people unfairly in certain scenarios, and if you want you can roll back some rights for LGBTQ people, and we can meet somewhere between taking action on climate change and doing nothing to do the minimum\"?", "label": 1}
{"text": "Who has that mindset other than trump?", "label": 1}
{"text": "And Democrats have openly supported all of it. Evil.", "label": 1}
{"text": "Following evil like sheep is even worse.", "label": 1}
{"text": "It's a willful ignorance.", "label": 1}
{"text": "I understand your point, but it still turns my stomach. I'm Christian and have been called all the names. All are lost, including ignorant people.", "label": 1}
{"text": "Saying you are going to impose a flat 10% tariff on all imported goods and a 60% tariff on Chinese goods and then not doing it isn't exaggeration. If he doesn't do it, as you guessed, that would be lying.", "label": 1}
{"text": "My main concern isn't actually trump himself, but those in his orbit. He is infamously pretty easy to influence and manipulate, all it takes is saying nice things about him and he likes you. Last time he claimed he only hires the best and half his cabinet ended up saying he's awful, a \"fucking moron\", a \"fascist\", disbarred, or imprisoned for actual crimes\n\nThis time around he's been surrounding himself with project 2025 proponents, elon musk who has straight up said he wants to wreck the economy, rfk who wants to gut the CDC and do away with fluoride, herschel freaking walker in charge of missile defense, just weird and unqualified picks like that but even moreso, the house and Senate are fully republican affording this term full reign to enact all sorts of things that I do not agree with at all. The supreme court especially will be firmly in the hands of those who are utterly against my views for in all likelihood the remainder of my life.\n\nMy own opinions aside, what are you expecting of the quality of his staff going into this new term?", "label": 1}
{"text": "You see, that’s where you’re wrong. I’m not here to convince anyone anything. Especially now that Trump has won a second term, I have no need to convince you of anything. \n\nYou being unable to understand the majority of the country, is a *you* problem. Not a *me* problem.", "label": 1}
{"text": "Rural people feel more self-sufficient and community involved while city people feel more dependent on government for all services. This dependentancy creates animosity and a desire for security, which can only come from the government.", "label": 1}
{"text": "The Republican Party don't care about the country either, in fact they seemingly actively want to harm it. IMHO, the Dems are clueless, with no real sense of purpose - their purpose seems to be to deliver a less extreme and more \"fair\" vision of neoliberal corporation-and-bank driven America, where there is no social justice or justice of any real kind, but the working class are given *just enough* to keep them from getting too upset, and distracted just enough so that corporations and the rich can continue to live in peace and luxury. The GOP, on the other hand, want to actively tell people that they should take their poverty and like it, and if you're a non-white, non-straight person then, frankly, you can go fuck yourself.\n\n>As a NS, what are your thoughts on the left-bias media outlets and pundits pointing fingers at everything but the glaringly obvious reasons that this was such a massive loss for Democrats? [(for example)](https://x.com/endwokeness/status/1854180309325254743?s=46&t=UEQ39mOv1Qf4bv5sJKVf6w)\n\nSeveral things here.\n\nFirstly, I think the media is bad, but it's bias in both directions. It's not a left wing thing. There is no mainstream left wing media. There's undoubtedly media that is sympathetic to the mainstream Dem Party, that doesn't make them left wing.\n\nSecondly, the example you have given, from a twitter account called \"End Wokeness\" is a completely bizarre nonsensical answer that takes a clip out of context. They actually say *in the clip given* \"it's complicated\". \n\nThey make the point that Hispanic people might have problems voting for a black candidate, and that black and hispanic men might be misogynistic. Where's the problem there? Harris was a bad candidate, so they may well have very good reasons indeed for not voting for a black woman, but are you making the argument that 0% of Hispanic and black men are misogynist/sexist? If so, that's completely silly and self-evidently not true.\n\nWas Harris a rubbish candidate? Yes. Did some people choose the old racist white guy instead of the woman because they don't trust a woman to run things? Also yes. \n\nHaving this cartoonish, black-and-white view that \"THE LEFT WING MEDIA CALLS BROWN MEN RACIST\" helps no one, least of all you or anyone who takes an account like that seriously. It's out of context, it's not representative of what the media is like overall in the US, and that isn't even the point being made in the (out of context) clip. The media sucks, but let's at least try and be honest about why it sucks.", "label": 1}
{"text": ">I hope he implements the kinds of policies that you're afraid of.\n\nWell, I'm afraid of Gilead, essentially. I'm afraid that the US will become the Christian equivalent of Turkey or Iran but with more foreign influence and power. You want that to happen?", "label": 1}
{"text": "Evangelism is important, but it always begins with the understanding of sin and repentance. We must strongly self examine to fully understand our sin. A claim of ignorance can not save us.", "label": 1}
{"text": "Probably worth pointing out that the eligible voter base is about... 245 million. He's on about 72 million votes, or thereabouts. That discounts anyone who was ambivalent about Trump but just didn't want Harris. So, no, not the majority of the country, even if we took every single vote for Trump as coming from a die hard Trump supporter.\n\n> I’m not here to convince anyone anything.\n\nI've said, already, that's fine. If you can't answer, no problem. You can pretend you just don't want to. It's a slightly strange impulse to answer someone in /ATS but *not* answer them, just respond to say you won't be answering.\n\nI think I understand why people voted for him, it would be up to you to decide whether you want to challenge my conclusion/assumptions? If you're not willing to do that, all good. I asked a specific question, a couple of times now - what is he going to do to bring the country together?", "label": 1}
{"text": "Are you a bot. You are getting me all wrong. I am not Republican per say. I would call them out for evil as well. I do not persecut someone for their sins. I do point out demonic evil when I see it.", "label": 1}
{"text": "Keep your eyes wide open the next 4 years, because what is about to happen is your doing. Both good and bad. No blaming democrats now. EVERYTHING that happens is going to be your responsibility.", "label": 1}
{"text": "God can use very interesting people sometimes.", "label": 1}
{"text": ">The country is not as racist as you’re making it out to be.\n\nJim Crow ended 60 years ago, within the living memory of many people. Redlining went on into the 70s and 80s.\n\nI mean, aside from that, we're hardwired to be \"racist\", which is a simplified and specific way of saying that we're hardwired to fear \"the other\", the outsider.\n\nOnly one party is leaning into the fear by saying that people coming from outside want to eat our pets and rape everyone and sell drugs.\n\n>Just about the only people who bring up race and/or gender are democrats\n\nThat's, obviously, patently untrue. But aside from whether it's true or not, how do you address racial and social inequality by just ignoring that issue?\n\n>The right question to ask is why is your party picking people like Harris, when the country wants people like Manchin.\n\nIt's not my party, far from it. I don't condone them picking someone like Harris, but I don't support them anyway.", "label": 1}
{"text": ">he's not putting people in camps though\n\nGiven that his \"cOnSeRvAtIvE\" judges (MAGA isn't conservative, don't bother defending it as such) will let him do whatever he wants, if his loudest, most fervent supporters *want* him to put his most effective detractors in prison (or in political prison camps) do you think it would change his mind?\n\nDo you think maybe he *should* put his detractors in camps?", "label": 1}
{"text": "You are the one who led with the evils of human trafficking.  Now you are claiming it's not evil. Can you decide?", "label": 1}
{"text": "I have no doubt trump has no clue what’s in project 2025, but it doesn’t matter. The people around him will be directing him what to sign off on and those people will surely be interesting in an extreme religious right wing wish list. Have buyers remorse yet?", "label": 1}
{"text": "Do you think it’s funny to be the laughing stock of the educated world?", "label": 1}
{"text": "No, of course I don't. His agenda is very clearly laid out in agenda47. It's not perfect of course but it's clearly not the Christian nationalist wish list that the media has convinced you is his plan. Take a breath it's gonna be fine.", "label": 1}
{"text": "Oh I’m good. I didn’t vote for a fascist so I have a clean conscience. I just find it funny that you guys vote for someone who pretty clearly tells you what he’s gonna do, then does it, and then you pretend it’s something other than it’s not. Also you consume media just as much as anyone else. Right?", "label": 1}
{"text": "Normally eradicating an ideology requires convincing forensic debate based on facts, not just yelling “LIBTARD” repeatedly. How will Republicans be able to convince people to abandon their values when republicans have failed so badly at prosecuting their flawed world view, and we can’t even agree on what a fact actually is?", "label": 1}
{"text": "I am surprised they are not aware. It the top discussion each and every day for the last 4 years? You seem super eager to defend something here. Ignorant Democrats? The blind that lead the blind? That's fine, but you are doing them a disservice. I already stated where ignorance takes you.", "label": 1}
{"text": "Yes, but Trump was an awful candidate. He did awful things in his first term - he rambles, talks nonsense, says inflammatory things, and completely fails to give any policy detail - and he's - almost objectively - a completely trash person.\n\nHarris is a bad candidate, ill-suited to the job of trying to run against Trump, burdened by her own party and her current and now ex-boss Biden. However, the only faults I can find with her persona and morality are things that I would expect Republicans to be fine with! Namely, and primarily, that she is supporting Israel in its genocide of Palestine.\n\nSo if you have two bad candidates - and we can even go as far as saying that they're as bad as each other, if you like and if it helps your argument - then you have to start looking at reasons as to one bad candidate won and the other lost.\n\nIt's surely not unreasonable to suggest that people - perhaps primarily men (look at the voting statistics for which demographics voted for who) - came to the conclusion that a woman can't lead? Trump, even though he did a bad job of it, has proven he can at least get through a term.\n\nAdd that to the fact that a percentage who may have voted for Clinton decided \"I don't mind a woman, leading, that's not so bad, but a black woman? No thank you\".\n\nAnd by the way I - and probably not very many people - are making the argument \"she lost because she's a black woman\". They're making the argument that, in a racist and misogynistic country, and with the atmosphere that Trump himself has helped to engender and throw fuel on, these things are factors.\n\nLet's turn this around then - why do you think Harris lost? What were people voting **against** but perhaps more importantly, what were they actually voting **for**?", "label": 1}
{"text": "Now some willfull ignorance on your part, or are you saying the discussion has been suppressed?", "label": 1}
{"text": ">What other rights do LGBTQ people have that would get rolled back? What rights don't they have?\n\nWell - any number of rights. I mean I feel like maybe this isn't the best place, and I'm not the best person, to give you a rundown of civil rights for gay people in the USA over the last 100 years.\n\nFor trans people, the right to identify as their chosen gender without being misgendered or discriminated against. For gay people, gay marriage, the right to live without persecution, the right to openly discuss homosexuality without it being seen as a perversion.\n\nHomosexual activity was legalised in 1962 in the US. Sex discrimination laws were extended to trans people in the workplace in the US in 2020. The ban on transgender people in the military was lifted in 2021.\n\nThere's a whole wikipedia article on trans rights in the US and attempts to limit these rights and roll them back. If the theoretical \"public toilet\" issue was enforced, then effectively trans people would disappear from public life, or else we'd have some kind of bizarre system where toilets are policed (which, again, would effectively disappear them from public life).\n\nI'm not getting into arguing about whether these laws or rights or whatever are correct or incorrect, by the way, that's a whole other rabbit hole, I'm just pointing out the things that conservatives would want to roll back (or in some places have rolled back.\n\n>What rights don't women or POC have?\n\nThe former - the right to universal healthcare and contraception in certain states, the latter... well, Jim Crow was a thing until just recently. I've also seen/heard conservatives talking about how they want to roll back the inclusion of PoC in schools etc. i.e. the right to free association, \"if we want to have all white schools then this should be allowed\", that type of thing.\n\n>I'm all for equality of opportunity, but equality of outcome/equity/etc is just reverse discrimination. In what universe do you fight discrimination with more discrimination?\n\nWell you're... not, then? At least you don't think it's important enough.\n\nAgain... we could be here for a long time if you want me to explain my entire political philosophy. But, generally, statistically, people will always end up in certain trends of behaviour, repeated for ever and ever and ever without intervention.\n\nThe most basic being - if you're rich, you have to fuck up extremely, extremely hard to end up not-rich. If you're poor, chances are you're staying poor. Something that addresses that balance is the only sensible means to give the poor person a leg up. Otherwise it's not a meritocracy, it's an oligarchy.", "label": 1}
{"text": "I see you have made up your mind and are not open to a productive conversation.  Have a good one.", "label": 1}
{"text": "There are Trump supporters who still think he's going to \"drain the swamp\" after doing literally none of that during his first term? Do you think Trump is backed by powerful people with no skeletons in their closet?", "label": 1}
{"text": "By going out and debating and having conversations with each other. The heart change needed in leftists is what's supposed to bring about the huge change.", "label": 1}
{"text": "Just so everyone here knows, I completely disproved the user \"Academic-Effect-340\" on Trump's Liz Cheney quote, saying that it was taken out of context and why. They then proceed to say that it's all false because I edited a few words outside of the quote due to misspellings, and they instantly block me. This is the sad stuff we are dealing with in 2024. My goal is to provide and listen to other peoples' inputs, but if people cry and block as soon as we provide evidence of something, how can we get anywhere in this country? Shouldn't we be trying to equip ourselves with accurate information?", "label": 1}
{"text": "I'm not certain this is the right place for this discussion. We can have it, if you want, or we can DM it. But don't be surprised if I get disappeared by a mod for debating.\n\n>27% of super rich people started poor.\n\nNot sure what you base this on.\n\nI found \"a study\" which said that 27% of people who are super rich (whatever that means) started out either poor or middle class.\n\nFirst off, there's a big difference between those two things. A middle class person has access to education that a poor person doesn't, extra curricular, a support network, money to go on trips and other resources, money to go to college... etc.\n\nIt's not just about material, monetary wealth in terms of being \"set up\" for the future. It's about opportunity, education, networking, and so on.\n\nAlso, I would add, 27% is not at all impressive! Less than one third? That sounds bad. Especially in, you know, Horatio Alger myth \"American Dream\" country. I could just as easily say \"did you know that only 27% of the super rich are self-made\". You're proving my point about oligarchy.\n\n> Only about 33% of people born in the lower class stay there. 55% ascend into the middle class. I'm one of them\n\nAgain, not only do I not know what you're referencing here, I don't know what is meant by \"lower class\" and \"middle class\" really. These are vague terms. You could have no money but happen to live in a fantastic school area.\n\n>I chose to be successful.\n\nNot really.\n\nI mean, sure, you did, but people don't choose the opposite. This is self-evident.\n\nPeople make a success of things through a combination of having opportunities available to them, being lucky, and working hard.\n\nIf someone gets bad grades at school because they have an alcoholic mother and an absent father, their home is not safe or secure or peaceful, and they are underfed and malnourished and can't concentrate - they're not choosing to be unsuccessful. Plus I would argue that if you put someone in such a situation, don't expect them to say \"you know what, I will climb out of this hole\". They make predictable choices. It's unreasonable, unrealistic, and frankly weirdly cruel to say to such a person \"just try harder, be a software engineer, that's what I did!\"\n\nI mean there's also a further argument to be made here which is that - no one, and I mean no one, ever, ever, becomes \"super rich\" off their own back. They become super rich by exploiting the resources they have at their disposal (letting their money earn money) or by exploiting the labour of others (hiring people).\n\nAlso this is certainly the case with the likes of Trump or Musk, who *were* silver spoon children and *also* definitely exploited people or took the ideas of others, or let their money do the \"work\".\n\nThere's the further, further argument that your approach *doesn't even make any practical sense*. Your approach is \"you fucked up the first 10 years of your adult life well tough shit bub!\". How is this in any way conducive to a functioning society? A socialist wants what's best for the most number of people, and a capitalist can see that putting people on the scrap heap of life for the remaining... 60-70 years of their existence, turning them into a drain on society, potentially even a criminal, is a very bad idea for both business and \"the markets\" and the stability of society. Why the hell would you want to put someone on the welfare state or in low paid, low productivity jobs for the rest of their life as \"punishment\" for messing up the first 10-20? Makes absolutely no sense. Unproductive, depressed, potentially criminal people **don't buy things** and don't contribute. Unless you want to just... build an economy off loans and credit, I suppose. That seems bad/immoral to me.\n\n>we will not pay for someone else's mistakes.\n\nYour philosophy/approach means that you always will be paying for someone else's mistakes.", "label": 1}
{"text": "Didn’t one of the speakers at CPAC call for transgenderism to be “eradicated”?", "label": 1}
{"text": "There's lunatic media on the right too, mostly shills rather than corporate types. As with all sources of information you need to find the sane and ignore the crazy.\n\nCalling Trump a fascist might feel good, but he's a moderate leftist similar to Bill Clinton. There's a lot with the US that needs to be fixed and much of the vote turnout was from citizens concerned that the policies proposed were leading the US to rapid decline.\n\nThere's no one serious proposing violence against leftists no matter how much they find leftists to be thoughtless or destructive. You can fear whatever you want, but it's a waste of energy and really badly disconnected from reality.", "label": 1}
{"text": "I have to answer in the form of a question - yes, that sounds good, DM me?", "label": 1}
{"text": "Dichotomous thinking is convenient for arguments sake, but with all due respect, it lacks IQ. \n\nI encourage you to expand your mind.", "label": 1}
{"text": "The real problem is that there’s not much to discuss. The only people still supporting Trump are misinformed and will talk circles launching outrageous defenses of heinous actions. How do you have a rational conversation with a 1940s German who defends the crimes they see? \n\nTrump literally promised mass deportations. You think that happens without concentration camps?\n\nWhat are we discussing then? “Well I think concentration camps are bad. Do you”", "label": 1}
{"text": "Which policies spoke to you? Blanket tariffs that would raises prices across the board or ignoring climate change that’s destroying our planet?", "label": 1}
{"text": "Except this time he has no one to please to try and get elected again and the people that kept his first 4 years sane will not be around this time to stop him.\n\nAre you not worried in any way that the people that worked closely with him last time did not support him this time?", "label": 1}
{"text": "So is your position that power bouncing back and forth from one party to the other every 4-8 years is somehow evidence of fraud and that honest elections would naturally produce more unbroken winning streaks for a single party?", "label": 1}
{"text": "It only took him several meetings and parties and trips on Epstein’ private jet for him to figure out he was a bad guy huh? Not a great judge of character or?", "label": 1}
{"text": "Do you trust the due process of law in this country?", "label": 1}
{"text": "How do you think it'll play out when that doesn't happen? I don't think Republicans will try to catch the car again like they did with abortion. ", "label": 1}
{"text": "Don't worry!  It will be a compassionate concentration camp we send you all to.", "label": 1}
{"text": "> he's a generic Republican \n> Romney in 2012\n\n\nI feel you've basically said \"don't worry about the house fire, because in 2012 you spilled a cup of boiling water, and that was mostly harmless\".\n\n\n\nHarris ran on more restrictive borders and stuff like that. 10 years ago, people with her political position were solidly right-wing. Today the same position is routinely called radical left-wing.\n\n\nThat tells you how much the political spectrum as a whole has shifted to the right, apparently without even being noticed by most of the right wing.\n\n\nWhen you write \"generic Republican\" in 2024, are you not aware that this is hugely different from Romney in 2012, or a generic Republican in 2012? \n\n\n* Why did Trump need a massive, all-encompassing purge of \"RINOs\" over several years if your assumption is correct and today's GOP is still similar to 2012's GOP?\n\n\n\n* Romney, by the way, is firmly against Trump and has warned of a Trump presidency often https://www.foxnews.com/politics/romney-stays-course-whether-supports-trump-president-matter-personal-character . That alone should tell you that the two are not similar at all.\n\n\n\n* But even apart from that: How does that comparison even apply? Romney e. g. was criticized heavily for saying about poor people: \"And so my job is not to worry about those people. I'll never convince them that they should take personal responsibility and care for their lives.\" Can you imagine being criticized for that in today's political climate? If Trump had said that, the only thing that would have happened is silence and Trump getting a few more votes.\n\n\n\n* Later, under pressure, Romney retracted the statement and said that was \"just completely wrong\". Can you imagine retracting that statement today? (What has Trump ever retracted?)\n\n\nSo: in what way do you feel there's a valid comparison here? I feel you've basically said \"don't worry about the house fire, because in 2012 you spilled a cup of boiling water, and that was mostly harmless\".", "label": 1}
{"text": "You are literally just spewing shit in retaliation. I hope you wake up and realize you have been lied to. Thankfully it looks like most of the country has this election cycle, consider joining them.", "label": 1}
{"text": "> Talk to actual human conservatives about their views and why they believe the things they do. For example, there would be VERY few, if any, conservatives that want to “trample on women’s rights.” Abortion involves the rights of two entities, the mom’s and the baby’s, and we realize it’s a complex topic\n\n\nThat all sounds reasonable, and I salute you for that. But do conservative lawmakers know or care about your beliefs and appreciation of complexity? I can believe that you are like that - I just don't see the GOP is. \n\n\n\nJust the other day another young woman died due to conservative abortion laws: https://people.com/texas-teen-suffering-miscarriage-dies-due-to-abortion-ban-8738512 Conservative lawmakers were obviously warned of this and ignored the warnings and the complexity. How are they like you? How do they reflect your beliefs and appreciation of complexity?\n\n\n\nAnd I really don't see how conservatives like you have much influence within the party. Would you really vote against a conservative based on issues like that, or would you hold your nose, vote conservative, and grumble about it a little online? Because I suspect conservative leaders know that full well.\n\n\n\n> Abortion involves the rights of two entities, the mom’s and the baby’s, and we realize it’s a complex topic\n\n\nThat part, by the way, is a position that basically all liberals agree with and always have. Meanwhile I expect lots and lots of conservatives to disagree with it (maybe it's even a majority of them). How could you even paint that as a typically conservative opinion?", "label": 1}
{"text": "Keep your eyes open and remember you voted for everything that is coming. Can’t blame it on dems this time. Say hi to the leopards for me?", "label": 1}
{"text": "Do you think some citizens may accidentally get swept up if mass deportation goes ahead?  \n\nI think it is likely that some citizens may share a name with some migrants and I think it's likely people will be accidentally caught in an attempt to deport a large amount of people.", "label": 1}
{"text": "The great thing for you is that all of those definitions can be applied to people you just don’t like. Sounds an awful lot like ant-intellectualism. Weird that another right wing, anti-immigrant, pro-eugenics movement would promote re-educating intellectuals. Yall better get started building your camps, only four years to go, right?", "label": 1}
{"text": "Should we stop imprisoning people because someone may be innocently convicted?", "label": 1}
{"text": "I think the difference is due process and the chance to appeal, I am not sure that would happen in a mass situation.", "label": 1}
{"text": "I think the difference is due process and the chance to appeal, I am not sure that would happen in a mass situation\n\n??", "label": 1}
{"text": "Nothing to say there wouldn't be a process or appeal, of course there will. ICE agents aren't going to randomly pick up people. Some people just have caricature view of how this is going to be carried out. The US imprisons about half a mil a year, much easier to certify someone's legal status than conviction.", "label": 1}
{"text": "When \"kill them all, let God sort them out\" has been an idea for over 800 years and we've got things like Winston33's joke above to read, why shouldn't some people have what you call a caricature view?", "label": 1}
{"text": "Here's a shocker for you, there's already is a system for \"mass deportations\" being used, and ICE has deported hundreds of thousands a year. It's just that the number that gets released into interior outnumber the deported so it feels like a  hamster on a wheel. Just need to 4x+ the deportation numbers, and stop the incoming flow.", "label": 1}
{"text": "What are the logistics? Where will the money come from? Who exactly will be carrying this out? How are the negative economic consequences going to be addressed? What compensation will be awarded to those who are mistakenly deported or have their lives upended when errors are made? What kind of time frame are we looking at?\n\nAlso, are you aware that the Alien Enemies act only applies to males older than 14 years of age, and only if they're from a nation that's an official enemy of the United States? Are we going to declare Mexico, and Cemtral and South American countries, enemies?", "label": 1}
{"text": "Your body, MY choice\n\nYou're ALL going back", "label": 1}
{"text": "You ask a lot of questions, my friend.  Some of them are even relevant.  We will have to watch how our President goes about fulfilling his campaign promise.  One thing we both know though is that he will.  Is that why you seem so upset?", "label": 1}
