{"text": "I came flying into the comments for this, it gives me anxiety when I see it", "label": 1}
{"text": "Wasn’t married but engaged, he suddenly became antisocial with our friend group and played video games day and night, never came to bed. Never spent time with me. Had a weed addiction so couldn’t speak to him in the morning until he had some otherwise he would get angry. I simply cannot love that type of person so left.", "label": 1}
{"text": "You'll have to be more pacific.", "label": 1}
{"text": "it’s terrifying that that’s the conclusion you came to after reading that", "label": 1}
{"text": "Didn’t happen to me, but those where I saw it, beyond the reasons already given here (abuse, cheating), I think k a general issue is people vetting married to early, with wrong expectations. This includes marries that were insisted on by one partner only, with the other one “giving in”, and the other big one, a couple’s belief that a marriage will rescue their relationship that’s already falling apart. Other problematic motivations (without other reasons to marry) include unplanned pregnancy and family pressure, which in the absence of a couple really wanting this, can quickly lead to a complete disaster and a very short marriage.", "label": 1}
{"text": "If the events are in that order , then it’s perfectly to think that way , but i m just just speculation/", "label": 1}
{"text": "Right? kinda weird.", "label": 1}
{"text": "it is not perfectly “reasonable” to think that way. someone having access to your body even when you say NO is not sexual incompatibility. please get that through your skull & always remember it.", "label": 1}
{"text": "having the right to have sex with your partner whether they want to or not is not problems in the bedroom. what is confusing to you? he wanted to rape her. what is confusing to you?", "label": 1}
{"text": "That is not what i said", "label": 1}
{"text": "it’s obvious that there are comprehension issues here. it is absolutely what you said.", "label": 1}
{"text": "Thank you for knowing me more than myself", "label": 1}
{"text": "don’t need to know you to know ENGLISH", "label": 1}
{"text": "This is a great answer!", "label": 1}
{"text": "For hoes yes", "label": 1}
{"text": "I have a boy and a girl.  I can tell you 100% children are born with their personalities and individual unique ways of perceiving the world.  \n\nAs a a parent you do your best to nurture those in born traits towards their positive spectrum.  For instance my daughter is very creative, emotionally intuitive and can read people well.  This gift often comes with anxiety.  We all know the negatives of anxiety and you can enable those negatives by allowing avoidance.  I'm teaching her to articulate her thoughts and feelings and to embrace her anxiety as a means of signaling the areas of life she needs to work on, in essence run towards the scary things, not away from them. Parents are meant to let their children struggle to grow, but with guidence.  Guided struggle.\n\nMy son is neurodivergent and this comes with all the problems associated with social miscues. It is not sunshine and daisies but we are constantly communicating and supporting him when he has been bullied.  We don't run from bullies. We work together to find strategies to deal with them.  This will be a lifelong issue for him, but despite this he is a happy go lucky kid.  He has his own circle of friends and he knows that we are always in his corner.\n\nAny parent with an ounce of emotional intelligence knows you raise the individual while instilling the right values and character.  Boy or girl.  It doesn't matter.  You honor the individual while simultaneously teaching them to function in a social world and respecting others.q", "label": 1}
{"text": "Yes it is, and has been since the early 1900's.", "label": 1}
{"text": "Three. Irregardless is a word that has been used for hundreds of years and has been in the dictionary since before world War 2.", "label": 1}
{"text": "Three. Irregardless is a word and has been for hundreds of years. It's been in the dictionary for almost a century.", "label": 1}
{"text": "That's not the reason at all. It's considered a word because it's been used in the English language for hundreds of years and has been in the dictionary since before world War 2.", "label": 1}
{"text": "They use it because it's a word that is in the dictionary.", "label": 1}
{"text": "It's not a word now it's been a word for centuries. It's not incorrect at all it's been a word in the dictionary since the 1930's", "label": 1}
{"text": "Who cares parties are boring", "label": 1}
{"text": "Growing: because adulting is just winging it, right?", "label": 1}
{"text": "It was more like 2 years....and it was cause she had a secret gambling addiction and she was crazy and abusive", "label": 1}
{"text": "Me too sis, me too.", "label": 1}
{"text": "I couldn’t stop smiling the rest of the day; it felt amazing.", "label": 1}
{"text": "I expected to be financially secure by now, but rising costs and unexpected setbacks have kept me in a constant catch-up mode.", "label": 1}
{"text": "Sorry for that for you. I had an ex call me once because her new guy absolutely berated her after a car accident for not doing all the \"right things\" like exchange insurance, etc. She told me 'all I wanted was for you to hold me while I cried.' \nI told her 'you left me for this guy. Best of luck.'", "label": 1}
{"text": "I agree (mostly) but if she's been fooling around behind his back, it is horribly blindsiding.     And hurts like hell.", "label": 1}
{"text": "January! It's very sweet of you to say this. What made 31 the best birthday of your life, if I may ask? :)", "label": 1}
{"text": "Yikes, tough day for her :( but keep your boundaries, bb. I get it. Looks like she’s got a bit of a pattern getting with dudes who are cold to her and then seeking external remedies to that feeling of rejection. Is her dad a mean guy? Like some cranky guy from Michigan that loves his new family more or something?", "label": 1}
{"text": "This is a GOOD ONE. Also, bartenders are a messy bunch (no offense) I dated a professional (lol, idk, he went to school for it) who did big fancy events and THAT guy would wake me up in the middle of the night, bc I’d hear the little ball on my blackberry spinning, bc he was high on blow and looking through my phone. Inevitably, every time, he’d find some 4 month old text from a male friend that said “miss you!” and freak out about it for hours. He had a nice house, but there was a bullet hole in one of the walls. Anyways, best sex of my life. What were we talking about?", "label": 1}
{"text": "Every time I reached any major art milestone, landed some major gig, being in the paper, selling out my art show on opening night,  inevitably, and I mean EVERY time, whoever I was dating would tell me it was just because I was hot, and whoever (client, organizer, owner) hiring me just wanted to bang me. This was the worst/meanest when I’d date other creatives, and was the worst worst when I was with another painter.", "label": 1}
{"text": "that is so un-empathetic and unnecessary for him to do ugh", "label": 1}
{"text": "i hear about this happening way too much :( i’m so sorry you’ve experienced that belittling behavior", "label": 1}
{"text": "“he should have read my mind and not answered the question I asked him”", "label": 1}
{"text": "This is the way to go ☺️", "label": 1}
{"text": "> I told her 'you left me for this guy. Best of luck.'\n\nThis is my answer to the title of the thread. \n\nDon't pick up the phone for schadenfreude, just ignore the call.", "label": 1}
{"text": "I have an ex from years ago and to this day he still goes around telling people I broke up with him over laundry. You're so right about there just being absolutely no self-reflection.", "label": 1}
{"text": "Yeah, like why the fuck do you want to do this in the first place? Why does that give you pleasure?", "label": 1}
{"text": "No.....?", "label": 1}
{"text": "I’ve seen there’s a lot of women who have this fetish to break a guy’s No Nut November (NNN).\nProbably because they find the thought of a guy cumming for them in that phase too hot", "label": 1}
{"text": "Non-heel wearer here (I love them, but my toes can't tolerate the position).\n A pair of black Converse have gotten a lot of mileage on my end.", "label": 1}
{"text": "Yes but you don’t need to share that information.", "label": 1}
{"text": "I'm a cap and I'm the same. However, when I was honest  and called someone out, the group pushed me out because I was \"instigating\" just for them to find out a couple of months later exactly what I was trying to warn them about and now they are all not friends with her either", "label": 1}
{"text": "And knowing myself I’d be like cool beans good riddance, those weren’t my real friends either way if they chose someone new over me.. 😂 i don’t dwell either haha ye im making myself sound like a real B 😆 and let’s be honest i am 🤪 but hey, atleast i don’t dwell lol", "label": 1}
{"text": "women but in an open relationship , we share the account", "label": 1}
{"text": "Idk I wouldn’t want anyone to be confused.", "label": 1}
{"text": "Are you confusing pouches with patches? \n\nI’m not aware of pouches being a smoke cessation tool but could be wrong.", "label": 1}
{"text": "Literally everyone uses them between 15-50 years old in Sweden? Why? Because it’s so addictive and no one can resist?", "label": 1}
{"text": "Pouches provide nicotine and are an oral fixation. Common for people getting out of the smoking habit", "label": 1}
{"text": "Hello /u/neonviper21. Thank you for participating in /r/AskWomen. **Please read this entire message before taking action.**\n\nThis post has been removed as AskWomen does not allow posts about personal situations, advice or recommendations of any kind. This sub is about receiving answers from the community about *their own* opinions and experiences, so posts also cannot include your own answer or commentary. Posts that are undistinguishable from personal situations are not permitted.\n\nYou can always go to /r/askwomenadvice, /r/relationships for romantic/non-romantic relationship advice, /r/legaladvice for legal advice, /r/femalefashionadvice for fashion advice, /r/skincareaddiction for skin care advice, or /r/findareddit if you dont know where else to go.  Please remember to read the rules of any subreddit you go to.  \n\nReceived this in error or have questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your post in your message, the mod team will not reply to messages without a link for review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*", "label": 1}
{"text": "That’s an interesting take - I would consider it to be more like swapping rather than quitting. Like if someone took up vaping.", "label": 1}
{"text": "I prefer casual sex. Easy to get, easy to have. Want to come in my mouth? Sure!\n\nI'm not promiscuous by any means, but I love how quickly I can get laid these days. It would take a week+ when I was younger, and now? Less than an hour.", "label": 1}
{"text": "I can relate to the feeling because that is how my wife feels about fucking someone else other than me.", "label": 1}
{"text": "valid point but some people have layers like onions and take some time to see the real person. i just rather give them the benefit of the doubt. who knows, we might be best buddies in no time. lol.", "label": 1}
{"text": "I think I am *that friend*", "label": 1}
{"text": "Why do you think you’re single?", "label": 1}
{"text": "First thing I thought too.", "label": 1}
{"text": "I don’t think that’s a bad thing. You probably like them when they check all the boxes so that actually should be saving you time too. Good luck!", "label": 1}
{"text": "A woman after my own heart! I like someone once every 3-4 years and take forever to have the appetite for relationships again.", "label": 1}
{"text": "I too am that friend. Apparently it’s because I don’t put myself out there… that and because I don’t know when men are flirting with me 🤣", "label": 1}
{"text": "It’s me. Hi! \nI don’t know when men are flirting with me, or sometimes I don’t know why men are flirting with me if I eventually clue in or I think men are being friendly because they like my friends more and are using me to get to them. \n\nAlso apparently I don’t put myself out there 🤷‍♀️", "label": 1}
{"text": "I am that friend. I'm not interested in any sort of relationship beyond platonic relationships and even then I rarely make new friends.", "label": 1}
{"text": "Have to say, I checked your profile to see if we knew each other and you were talking about me lol", "label": 1}
{"text": "To add to your comment. Someone once told me finding the right person is not someone who checks all boxes on a list, but someone who makes you want to throw the list in the trash. I still think that was a very nice analogy.", "label": 1}
{"text": "omg I was so bad at recognizing when people flirt with me (I still kinda am!). my friend and I were at this guy's house, she was hanging with one dude, me another.... he asked if I wanted to lay next to/with him on the couch. I was like, nah I'm good....🤦🏻‍♀️ we'd already fucked and it was hot so I didn't think he was trying to be cute or anything and she about smacked me upside the head as we were driving home lol", "label": 1}
{"text": "Are u me?", "label": 1}
{"text": "Me. I'm that friend with hella high standards!", "label": 1}
{"text": "I am sorry but that sounds like a book character-style person that doesn’t really exist. Thats… too much.", "label": 1}
{"text": "Or are you me??? Twins….", "label": 1}
{"text": "Tell her to stop watching hallmark movies and reading 3rd rate romance novels.", "label": 1}
{"text": "Wow.  You will never how bad you made that guy feel.  He may never want to do you again or will now just want to fuxk you to prove a point but not anything serious.  Even if he likes you", "label": 1}
{"text": "Im that person. Spent quite a few years working on myself and a lot of other stuff that made me kind of not good.\n\nHad a chance for getting into a relationship a few months ago but the other person was trying to get the relationship into dating terms rather too fast for my liking so I had to tell them I was not interested. More so because I wanted to make sure this was what I wanted/was ready for it. Saying it outloud makes me feel like an asshole now. 🙃", "label": 1}
{"text": "To clarify, im just a random guy making a joke, but i imagine thats how friend sounds like", "label": 1}
{"text": "Omg we should totally put together matching outfits!", "label": 1}
{"text": "Yep the perfect Lifetime movie lead.  Lol🤣🤣🤣", "label": 1}
{"text": "I am that friend 😅 my friendships faded when everyone had children but I don't. They also distanced when my marriage broke down and failed. I don't think they know what to say to me and they do a lot of kids or couples stuff so I'm the awkward one. I've also reverted back to the way I was as a teen rediscovering my style, interests and hobbies. Things i lost during my relationship becuase of abuse. They moved past all that stuff. So I dont think they know what to do with me. I've gone back in time.", "label": 1}
{"text": "I am that friend.  95% of my married friends are miserable, and almost always involves some form of infidelity (both ways).... I don't need that added stress.   I like coming home to my two cats and doing what I please.", "label": 1}
{"text": "Omg letsss!!!", "label": 1}
{"text": "Because men suck lol", "label": 1}
{"text": "Vaping is also a tool to quit smoking.", "label": 1}
{"text": "Fair play to her", "label": 1}
{"text": "I bet she thinks she’s perfect and is not willing to adapt.", "label": 1}
{"text": "Someone reads way too many Booktok-ish romance novels.", "label": 1}
{"text": "I am the single friend. I'm asexual and don't care much for sex. The men I've met do care, as such we're incompatible.\n\nFunnily enough it was my ex who figured it out for me. \n\nHaving some trauma from being stalked also isn't helping.", "label": 1}
{"text": "I wish someone could answer this for me as I am that friend lmao", "label": 1}
{"text": "I wonder, what does is considered average? What are the types of guys she’s into?", "label": 1}
{"text": "I don't feel too bad considering he's responsible for breaking my wrist less than a year after that, then stealing my pain meds I was given for the *surgery* I needed to repair the break because it was so bad. but yeah, sure thing, \"poor him\"🙄", "label": 1}
{"text": "Yup, got that friend too. She’s smarter than most men she comes across (and they don't like it)… and has the most intense radar for red flags. Sometimes I think she’s overreacting, but I have been proved wrong every time—Literally, sometimes years later, but her predictions are always correct.\n\nShe knows she's better off single then compromising on things that are important to her.", "label": 1}
{"text": "Umm does she teach classes? Asking for a friend", "label": 1}
{"text": "Men not liking women who challenge them is so so true", "label": 1}
{"text": "Anything that's not smoking a cigarette is considered a better alternative/ quitting aid.", "label": 1}
{"text": "Because beauty isn’t everything. She’s literally the most beautiful girl I know but has a horrible personality. Once guys she’s seeing realise that, they’ll ghost her.", "label": 1}
{"text": "Nicotine is no worse for you than caffeine. Smoking is not, vaping is also like 99% safer than smoking. It’s the disease and stink of smoking that should be the problem", "label": 1}
{"text": "Some Men want opinionated women as long as the opinion matches theirs", "label": 1}
{"text": "They sound like people who think they know better than everyone else and are insufferable.", "label": 1}
{"text": "I don’t know what vape company told you it’s 90% safer than smoking but I think you should look up some more data on the amount of nicotine that’s in a single vapw cartridge being sucked into people’s lungs…", "label": 1}
{"text": "Why would a guy not like a women to be intelligent? Sounds crazy, that's a good thing. Literally cannot fathom why that wouldn't be a positive.", "label": 1}
{"text": "My friend is exactly like this. She has said that she expects men to be obsessed with her and if they are not, then she throws a tantrum or will just block or break up with them over the littlest things like not calling her at exactly midnight to wish her a happy birthday while she was traveling and in a different time zone because he did the conversion wrong or forgot she was in a different time zone. She expects to be on the phone talking, face timing, and texting all throughout the day every single day too. If not, then she assumes the guy isn’t into her and gets upset. It’s a lot, while she’s closed off emotionally and plays a lot of little games to test if they’re into her. \n\nWhen I first met her I didn’t understand why she was single and how a catch like her couldn’t find someone.  Her standards in men aren’t ridiculously high but her expectations of them to be obsessed with her is a lot. I got it after seeing her pursue a couple relationships that didn’t work out. They all ended when she decided to block or break up and the men didn’t come crawling like she expected anymore. This also bruised her ego/self esteem more. \n\nHow do you deal with your friend? Whenever I gently point out how strong of a reaction she had to something so minor she would just change the subject or not talk to me for a couple weeks to a month. So I just stopped really saying anything when she’d complain and we’re no longer close. Must be because I’m not obsessed with her either. Lol", "label": 1}
{"text": "Well, there's two lists, the deal breakers lost and the \"perfect guy\" list. You can throw the perfect guy list away but you better keep the deal breaker list handy", "label": 1}
{"text": "This is wonderful! Thank you!", "label": 1}
{"text": "Curious why it’s seen as so much different than coffee. If it’s good to help focus with a bit of nerve relaxation, how is it different than prescription meds that do the same thing for a lot more money?  Those meds have some unhealthy side effects as well.", "label": 1}
{"text": "Oh, there’s a word for that? Damn, that’s what happened in my most toxic relationship and I have such a hard time understanding or explaining it!", "label": 1}
{"text": "If her standards are only for her personal relationships, why are they unacceptable? It’s her life.", "label": 1}
{"text": "Honestly good for him. Sounds like he's just living his best life.", "label": 1}
{"text": "Possibly a red flag. He may have thought about it and has doubts. He doesn't want to hurt your feelings or end what you currently have going on, so he doesn't tell you his doubts. Instead, he pushes the topic out for 3 plus years because a lot can happen in that time frame. Maybe his doubts will disappear, or maybe the relationship will come to an end in that time frame.", "label": 1}
{"text": "Loansharking sounds horrible to deal with, but is it okay to try to loanshark the occasional backrub? It could be a small red flag in that it could escalate into bigger things. \n\nThis was a bit of a joke but that caused me to have a Relevant question. Are there some major red flags in some people that can be less of an issue in others? Like if my joke scenario were actually true, a partner loansharks for small things that might feel helpful in a relationship? Or does the manipulation piece throw all of that out the window? I have very minimal tolerance for manipulation so I think if I noticed this behavior it would cause distrust and ruin the relationship. But loansharking feels a bit of an extreme, so are there other behaviors that can be very bad for some and almost beneficial to others?", "label": 1}
{"text": "I relate and I feel like that’s a form of neurodivergence that can’t be helped. I’m not the best with interpretation and tend to over analyze everything and it’s all so confusing. I don’t understand the games with men- if he wants/wanted to he would. There’s no rule book for this stuff, no one teaches you anything, I don’t always know how to play hard to get.", "label": 1}
{"text": "Great suggestion! Thanks!", "label": 1}
{"text": "Likely an assessment that the personal standards make their personal goals impossible. \n\n\ni.e. I wanna get my masters degree, but I MUST NOT EVER get any score below 98%. If anything is scored below 98%, the masters degree would be WORTHLESS!\"\n\n\nYeah, sure! Your allowed to have standards like that...but you're bein' a bit ridiculous if the goals and standards clash.", "label": 1}
{"text": "Well he had something going on for him or he wouldnt have been so succesful.", "label": 1}
{"text": "Say your partner, unprompted, starts giving you a back rub. They tell you, “I know you had a long day, I just want you to feel better.” \n\nYou lowkey don’t want a back rub right now, you were about to take a shower and you want to get dinner started. And you’re just not in the mood to receive a back rub right now.\n\nYou tell your partner as much, and they say, “Shh come on it’s good for your, I know you’ll feel better afterwards.” You’re kind of annoyed, but you relent.\n\nIt’s not even a particularly good back rub tbh, and for the first portion you’re not really relaxed because you’d already gone into another gear (shower, dinner) and then got interrupted into whatever this is.\n\nBut by their own admission, your partner wants to show you care, and that’s pretty sweet you guess. You should let them love on you since that’s clearly what they want. And it certainly doesn’t harm anything to receive a half-assed back rub for ten minutes.\n\nBack rub ends, you thank them (despite the fact you didn’t actually want this in the first place), and your evening goes on. You shower, make dinner, watch some TV.\n\nIn bed later that night, as you’re starting to fall asleep, your partner starts rubbing against you. You don’t really want to have sex. But they remind you that *they* gave you a back rub earlier to relax you — don’t *they* deserve to have you reciprocate by relaxing them? You care about them, don’t you? After all, they care about *you*, they showed it by giving you that “great back rub” earlier. They helped you feel better and wind down — don’t you want to help *them* wind down?\n\nAnd you go along with it, because you are a compassionate partner who believes in exchanging care. Forgetting entirely that you didn’t ask for the back rub, didn’t want the back rub, and didn’t even *enjoy* the back rub! But it got put on your “account” anyway, so you feel you have to pay it back.\n\nThat is loansharking. Your partner decided the value of the favor, pressured you to accept it, and then used it to “cash in” to get what *they* wanted from you, because you felt like you owed them. So no, no amount of loansharking is okay. In healthy relationships, people exchange favors and care all the time, *by mutual consent*. This is not that.", "label": 1}
{"text": "He literally wouldn’t bathe between sexual partners, or at all for days at a time- working outdoors with livestock and animal waste, and he routinely didn’t wash his clothes because he didn’t see the point as they were just going to get dirty again.\n\nHe was a serial cheater, he was abusive, had multiple women pregnant at the same time, refused to use protection, had a protection order against him that he violated- resulting in him being jailed while his gf was pregnant with his first, his ex gf was pregnant with their first, and he was still married- while incarcerated his utilities were disconnected because she couldn’t pay all of her own bills as well as his bills on her own and dozens of his animals died on his farm because he refused to allow them to be sold and she was banned from reaching out for help because he told her she would be the one charged with cruelty- even though it was his home and they were his livestock and she didn’t live there, he’s a serial impregnator, and actively bragged about not waiting even two weeks before coercively forcing her to have sex with him after she gave birth.  \n\nHe pays no child support, is chronically broke and working off the books, and she’s been pregnant non-stop since the first, I think he’s up to double digits now in offspring…\n\nAnd those women he sleeps with- why do you think his charms didn’t work on me?  It’s because he goes for the low hanging fruit, vulnerable women with low self esteem, and in one case, a crazy older woman with endless red flags and restraining orders that literally impact her ability to travel for work who was desperate for a baby- she literally described him how she’d describe a horse in her equine stud books- it was incredibly bizarre!", "label": 1}
{"text": "i fear i am that friend", "label": 1}
{"text": "How I deal with her is exactly how you are dealing with your friend. Completely the same. Because I feel like there is no other way, like what else can we do? We re also no longer close. She ended up falling out of the friend group as well. The sad thing is we all really liked her. But the closer friends we became, more difficult she became. She is a distant friend now.", "label": 1}
{"text": "I have the same job — it's not for the faint of heart, but someone's gotta respect me. And if they won't do it, I will.", "label": 1}
{"text": "Yes, these types of ridiculously high personal standards are impractical, unrealistic, and even evil—destructive to one's life. In the end, one will realize that having these was a huge mistake, and will deeply regret it. I experienced this myself.", "label": 1}
{"text": "This is me.\n\nI’m happy having my free time be entirely my own, and I’m content with my family and friends. A relationship would be nice, but I’ll take dating seriously in my own time, when I feel I’ve met someone I want to settle with.", "label": 1}
{"text": "This book both changed my life and gave me night terrors.", "label": 1}
{"text": "Isn't that what everybody wants? If you're left-leaning, do you WANT to date someone on the right?", "label": 1}
{"text": "It’s how you react to the opinion different than yours! I don’t believe it’s possible that two people have exactly the same opinion and perspectives on each and every thing.", "label": 1}
{"text": "I am sure he is a piece of shit but I just have to come out and say that acne is not caused by poor hygiene. Coming from a woman with PCOS who has struggled for decades with acne with good hygiene. It's a stereotype that needs to end and honestly does a lot of harm to those of us that struggle with the disease.", "label": 1}
{"text": "He doesn’t have PCOS.  His is purely from working in hot, dirty, gross places and refusing to bathe or wash his clothes for days on end because he doesn’t see the point because he’s just going to get dirty again the next day.  \n\nGrinding dirty and bacteria for days on end into one’s skin and not using soap and water on one’s skin and clothes on a regular basis will most certainly cause acne, blackheads, and infected hair follicles.", "label": 1}
{"text": "I wanna be her lmaoo", "label": 1}
{"text": "Not exactly, some opinions are just simply not compatible, and some you can agree to disagree", "label": 1}
{"text": "good for her!!!!", "label": 1}
{"text": "i do this. the amount of times i’ve said (very genuinely) “it’s okay to be wrong don’t worry” to people who are blatantly wrong about things is outrageous", "label": 1}
{"text": "We have the same toxicity lol I'm trying so hard to just be more open in these instances, but it's sooo hard!", "label": 1}
{"text": "Exactlyyyy", "label": 1}
{"text": "Yes I have a friend just like that!!!! To the T, I honestly encourage her to stay that way/single until she feels she met the one. I’m in a relationship and remind her all the time of why it’s okay to be single especially in your 20s.", "label": 1}
{"text": "I’m sorry, that’s really sad. Thank you for sharing your experience. I haven’t talked to my friend in months and just kind of gave up.", "label": 1}
{"text": "And science shows unmarried childless women are the happiest soooooo🤷🏽‍♂️", "label": 1}
{"text": "As a chap, this really doesn't compute for me?  Intelligence can only be a positive. What possible downside is there? What on earth is there to feel insecure about? Intelligence of both parties is an asset for a couple.\n\nThere are loads of attributes I can think would be negatives,  that one can only ever be a positive. \n\nWhat do those supposed guys that don't like that want? someone at an intellectual level they can control or manipulate? Doesn't sound healthy.\n\nI generally think of it as a positive, never as a negative. Beyond a certain level of intelligence, it doesn't matter too much to me, but it'd never be a turn-off, not in a million years. I'm far more interested  in looks and personality as a chap.\n\nI wonder if some of those who identify that as the reason they're not finding someone are perhaps misidentifying the reason? It's something I've personally only ever heard women say they think is a problem for chaps? Could be just the folks I hang around with?", "label": 1}
{"text": "😂 I'm using this.", "label": 1}
{"text": "I do this exact thing. I never ask follow up questions. The best way to get back at someone is simply to ignore them. They’re left wondering and it’s always so frustrating", "label": 1}
{"text": "Why are you assuming that this is only about political opinions?", "label": 1}
{"text": "Lmao, welcome to ask women! If you need help answering any questions, just DM one of us. 💕", "label": 1}
{"text": "Yup!!! My bff is a catch and a half. She knows her worth. Unfortunately, most men are annoying.", "label": 1}
{"text": "I like to call them Community Boyfriends 🙄", "label": 1}
{"text": "OMG, so true.", "label": 1}
{"text": "This is very true. I think it’s the distinction between core values and opinion. \nI’ve had plenty of dumb opinions that I’ve been happy to trash when they are questioned due to them not being valid enough to stand up to questioning.\n\nAnti-racism, lgbtqi+ etc. I would definitely not consider a mere difference of opinion.", "label": 1}
{"text": "Because it's ok if he doesn't want his pickle, and doesn't prefer shellfish. We can differ on West Coast vs East Coast rap. Even religious beliefs are less polarizing than the current political climate.", "label": 1}
{"text": "Good for her!", "label": 1}
{"text": "In my limited experience, I'd say many intelligent (cis hetero) men prefer intelligent women — as long as it doesn't feel like they're more intelligent than the man. They want someone quick and knowledgeable enough to keep up and appreciate their intelligence, but not necessarily someone who is going to challenge or stretch them (someone they would have to keep up with). It seems shaped by socialization and cultural expectations across the board; many very intelligent women seem to reinforce these roles and have learned to gently undermine/hide their intelligence with cuteness or other masking. There are of course a minority of intelligent men who genuinely don't mind as long as their prospective partner is \"intelligent enough\" to be a good match (and it sounds like you might be one of them), and I hear that the other side of things seems surprising to you (as it doesn't seem rational to actively avoid partners who might seem \"too intelligent\"), but this is my experience as a woman. It seems more instinctual than conscious. When intelligence is embroiled tightly into someone's identity, especially a lot of men's, and men are conditioned to be providers, many men who have identified intelligence as their means to provide seem threatened by and uncomfortable with seemingly more intelligent women (particularly if it's intelligence in an area that has been generally masculanized; a woman they can teach higher level math concepts to might be hot, but one who might teach them something similar is friend zoned). In fact, I feel like it is sometimes more of an issue precisely for more intelligent men who work in presumed intellectual fields or identify strongly with their own breadth of knowledge and analytical ability. Of course this is anecdotal (though I've seen studies that support it) and broadly generalized with plenty of exceptions, but it seems far, far too common to be a coincidence or attributable to anything else. You mention it could be a pattern of incorrectly assuming the issue is intelligence when it's something else, but I've never met a very intelligent heterosexual woman who hasn't had to either mask or have a much harder time with dating.", "label": 1}
{"text": "Sounds like a small town thing. Everybody knows everybody.", "label": 1}
{"text": "Yep, 100%. My ex would often say “I don’t want a woman who feels the need to challenge me or step up to me.” Left him so he could find the doormat he was looking for.", "label": 1}
{"text": "Proud of your progress nonetheless", "label": 1}
{"text": "Yea me too. That’s how they get you. Nope, the magic is that it’s all about absolving yourself of the consequences of others. It doesn’t erase the past, it doesn’t mend the past. What’s done is done and cannot be undone. It’s about readjusting perspective on reality and being in as much love with yourself as possible.", "label": 1}
{"text": "I don't lol I've been made homeless in the past year (revenge eviction by a slum landlord) and my mental health is barely hanging on by a thread because of this. In the past during big life changes I've self medicated with Promethazine or turned to bad habits and getting lost in my imagination, if I'd had a decent family who could have provided me with emotional support I wouldn't have had to sink so low but my family are dysfunctional so it is what it is. My anxiety wins every time I usually just carry it around inside me like a disease and I smile and pretend I'm OK to my family when really I'm dying inside because I don't want them to see how much I'm suffering so they can gossip over it.", "label": 1}
{"text": "I'm also not very forgiving. It's why I have issues with the second-chance romance trope. My life experience has been once someone does something shitty, they will apologize and then keep on doing shitty things.", "label": 1}
{"text": "In the past in my younger years, definitely. But as I’ve gotten older I make a concerted effort try and be as self aware as possible and that includes knowing when I’m wrong and out of line. I grew up as an only child in a house full of adults (Mum and grandparents) so I was treated as an adult most of the time and a huge part of that was taking accountability and owning my stuff when it was necessary.", "label": 1}
{"text": "Good job!!", "label": 1}
{"text": "Thank you! I'm about to spend some hours on a plane, and I just bought this for my Kindle after reading your comment :)", "label": 1}
{"text": "As with many sex addicts, he knew how to make vulnerable women feel special.  \n\nI asked a neighbor that admitted begrudgingly to sleeping with him and she said there was a lot of alcohol involved and he laid it on thick with compliments about her curves.  A topic about which her ex has been particularly crappy to her lately about some health issues related weight gain- though ironically, he had gained well over twice what she had with no known health issues- just being unemployed and sitting on the couch all day….", "label": 1}
{"text": "My brother definitely like an intelligence and life experience gap, he like teaching his partners and coaching them through new experiences.  He’s a hardcore mansplainer!", "label": 1}
{"text": "Ditto the book recommendation!", "label": 1}
{"text": "Highly seconding this recommendation :D", "label": 1}
{"text": "Would love to learn more about loansharking. I love doing favors for people because it makes me happy to help people. But now I’m thinking twice..", "label": 1}
{"text": "Eeewww", "label": 1}
{"text": "This is me. This is in correlation of a big trust that I give to them.", "label": 1}
{"text": "You must be perfect.", "label": 1}
{"text": "Sheesh there’s some mean people here!", "label": 1}
{"text": "You should hear the MIL", "label": 1}
{"text": "Nelson Mandela : “Resentment is like drinking poison and then hoping it will kill your enemies”.", "label": 1}
{"text": "That's textbook gaslighting.", "label": 1}
{"text": "I have the same traits. I don't let the feelings build up or fester, the people slip from my mind a lot. Every so often something will remind me of them and I think \"yup. Still hate them.\"", "label": 1}
{"text": "This is very true but I don’t hold on to resentment. I’ll just never ever think about you again or trust you. \nWe basically just go back to being strangers.", "label": 1}
{"text": "Feel bad for anyone who interacts with you", "label": 1}
{"text": "I love that, I think I’ll do something similar. When/if any toxic people crop up in my thoughts I’m going to think ‘yep, they’re still a shitty person, out there shitting on people, I’m well rid’", "label": 1}
{"text": "Is this a problem? Because I genuinely feel this, I'm wondering sometimes if there's something wrong with me because once someone did something that really hurt me, I couldn't forget it and it comes back to me from time to time : (", "label": 1}
{"text": "I don’t think this is toxic at all tbh", "label": 1}
{"text": "I have the same mentality as you, I got bullied by this one guy and a few years later he acts all cool with me now but I ain’t forget how he treated me", "label": 1}
{"text": "Anytime my boss comes over... she tells me its important for my career... but i actually like it 😳😜", "label": 1}
{"text": "Do you wear them?", "label": 1}
{"text": "High-rise pants: because comfort trumps fashion any day, right?", "label": 1}
{"text": "How would they know they’re comfortable if they don’t wear them?", "label": 1}
{"text": "Sounds a bit like BPS.", "label": 1}
{"text": "Telepathy", "label": 1}
{"text": "Telepantsthy", "label": 1}
{"text": "**Please read this entire message before taking action.**\n\nThis post has been removed as questions are required to be descriptive and open-ended. The title to your post must be a descriptive question.\n\n* Questions that do not adequately state what is being asked are not descriptive.\n\n* Yes/no, Either/or, or options list questions are not open-ended. \n\n* No \"would you rather\" or \"does anyone else\" questions permitted at all.\n\n* Please leave your own response to the question as a comment rather than in the description or the question.\n\nAdditional Reminders:\n\n* If you are using uncommon or unusual terms or asking a question that many people will not understand without further explanation or definitions, please place these in the description. \n\n* Please remember that links require comprehensive summaries.\n\n* Askwomen is about receiving answers from the community, so please do not include your own reply/commentary in your title or body text. Details in the question or description about a personal situation which would lead your question to personal advice or to discussion of your response rather than individual responses to the question are not permitted.\n\n* Questions indistinguishable from [trauma tourism](https://www.reddit.com/r/AskWomen/comments/8xqgco/announcement_update_to_our_moderation_policy/) are not permitted.\n\n* Before reposting, please recheck to make sure that your post meets our [inclusivity guidelines](https://www.reddit.com/r/AskWomen/wiki/inclusivephrasing) and does not specify majority demographics.\n\n* Still Trying to Find the Right Sub for Your Post: Try /r/findareddit can help for safe-for-work posts or /r/nsfw411 for nsfw posts\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately.\n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "This is not toxic", "label": 1}
{"text": "Hello, /u/IndigoSunsets!  **Please read this entire message before taking action.**\n\nYour comment has been removed:\n\nRemoved for casual or inappropriate usage of mental health related terms or diagnostic labels. Please do not speculate, armchair diagnose, or label other people's mental health situations; or use terms for mental health issues as judgments, slurs, or synonyms for toxic/abusive behaviour even when talking about yourself. Please [click here](https://www.reddit.com/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to/) for clarification regarding this rule.\n\nIf you're referring to someone (yourself or others) who has been formally diagnosed by a medical professional, please make sure your comment reflects that. Let us know once you’ve made the requested changes and your content may be reinstated.\n\n\n\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "I appreciate a genuine apology as much as the next person and I understand that no one (including me) is perfect. I really don’t give second chances though. There’s just something in me that won’t allow it. \nI won’t dwell on it and it’s not like I’m sitting around poking pins in a voodoo doll, I’m just moving on with my life and our interaction has proven that you’re just not for me. Unless it’s really bad, no hard feelings. I wish you well, but I’m out", "label": 1}
{"text": "That's fine ......if you then hold yourself to the same standards.", "label": 1}
{"text": "I really don't care for the genres of relationship books, or feminist writings really or romance. \nBut I had a spell where I liked genres in general and like good or interesting writing in general and finding a book that happened to be written by a female was kind of neat in that it did put it in the realm of possibility.\n\n\nChildhood ant & bee books, Beatrix Potter\nBedknobs and broomsticks movie Mary Norton, pippi long stocking author,\nHardy boys led to Nancy Drew series\nAwkward tween Judy Bloom, cartoonist Linda Barry \nRead a lot of sci Fi 99% male authors but liked a Wrinkle in Time. Wasn't super into fantasy liked McCaffrey ok but LeGuin was too fantasy type for me.\nReading Sherlock Holmes led to Agatha Christie, reading Poe led to Emily Dickinson\nSouthern gothic authors led to Flannery O'Connor, odd viewpoint author Patricia Highsmith. Did not care for Ayn Rand at all.\nSimone Beviour, made me feel uncomfortable.\nThen I did get into fantasy a bit, but mostly was pre reading books in the juvenile fiction category but I actually enjoyed myself as an escape as a lot of modern fiction too much about sex, relationships, horrible reality stuff.\n\n\nSo various authors there.\n\n\nSo, not so much a specific book, but to have a sprinkling here and there was mind opening as a possibility in life.\n\n\nTo have a something it is even possible to have a life of the mind, or to have that as an endeavor or occupation.\n\n\nI am not necessarily going to like or agree with something just because it is written by a female. Maybe even slightly prejudiced against it. So it has to be good enough to cut through that.", "label": 1}
{"text": "I’m often surprised by how openly supportive male friendships can be. They seem to have a way of expressing their feelings and showing vulnerability that I didn’t expect. It’s interesting to see how they encourage each other without all the drama that sometimes comes with female friendships.", "label": 1}
{"text": "When family stress hits, I try to take a step back and find some time for myself. I might go for a walk or dive into a good book to clear my head. Talking things out with a friend really helps, too. Sometimes, I’ll journal my thoughts to process everything better. I also remind myself to set boundaries when needed, so I don’t get overwhelmed. It’s all about finding that balance and taking care of my mental space.", "label": 1}
{"text": "As it should be honestly. No use throwing away a friendship over stupid decisions", "label": 1}
{"text": "Oh this is so real", "label": 1}
{"text": "Okay so as a trans woman, I can offer some context. There is basically a massive taboo on it. It's ridiculous. But you're generally mocked from a young age for being \"weak/gay\" for having feelings.\n\nIt's toxic and ridiculous but it's deep programming. Allowing myself to feel took a *lot* of effort over several years.", "label": 1}
{"text": "Let's not talk about what happens at Brazilian jiu-jitsu classes....", "label": 1}
{"text": "I'm the kind of woman where it's hard for me to hold on to anger, there are times where I cognitively realize that someone shouldn't be forgiven just yet but I can't bring myself to care that much. With men I can be livid with them one second and fine the other because I know that they won't take what i said when I was angry with them so seriously. With women I know they might take it harder, so I tip toe around them more than with men. Just something I've noticed", "label": 1}
{"text": "This, it’s actually a psychological term called the “Tough Guise”. It’s basically when men are conditioned to hide their feelings to seem tough or manly. It is terribly toxic.", "label": 1}
{"text": "Amen. Shit happens.", "label": 1}
{"text": "Incredibly toxic is even an understatement. It's nothing short of ruinous. Knowing how it looks and feels and seeing people buckle under it is heartbreaking", "label": 1}
{"text": "Yes! Are you me?! I have a best friend who’s a dude and we can piss each other off so much and then laugh 2 seconds later. I 100% agree with your response. It has to be multiple occurrences adding up for me to drop someone, but I’ll generally try to give grace where it’s due.", "label": 1}
{"text": "Yeah ofc there's a line that shouldn't be crossed. But I'm saying just normal stuff that aren't really bad", "label": 1}
{"text": "Wait, we are allowed to say the words brazilian jiu justsu ? I thought I was supposed to say I went to a bar or something.", "label": 1}
{"text": "Really it depends. If I catch my friends cheating on their girls, they are not my friends anymore, and the girl is not theirs anymore.", "label": 1}
{"text": "Then it isn’t “when it comes to morality” like the OC said", "label": 1}
{"text": "Most of us play video games together so that’s our hangout spot", "label": 1}
{"text": "Yep that sums it up. Nobody really cares that much is more or less what it is. They're asking out of kindness if you're fine but deep down they couldn't care less and won't really help in any way. If they did, what is it they could do anyway? Everything is transactional to a degree", "label": 1}
{"text": "Im meaning more like assault and stuff, I’ve seen dudes stay friends with creeps. But, birds of a feather", "label": 1}
{"text": "The whole, \"I want to see you eat...just not at my table\" kinda thing.", "label": 1}
{"text": "Let me guess, you are quite young, right?\nI used to be the same, but life gave me few lessons — don’t put your fkin nose in other relationship, its not your fkin business unless you are asked directly.", "label": 1}
{"text": "That's what I do with people who aren't my friends, I don't mix colleagues and friends. And besides, unless it is very obvious, I don't typically act because I always might be wrong.", "label": 1}
{"text": "I watch the international Love is Blinds and it’s always wild to me that the romantic relationships will be so rocky or toxic but yet every season, the men will come out of the season with a strong sense of brotherhood. \n\nThroughout the entire process, they’re supporting each other through the pods, celebrating getting to the honeymoon, usually maintaining a group chat and going to bat for one another when their partner is skeptical of questionable behaviour and every group meetup is a joy because they get to hang out with “the boys” again. They often leave the show saying this new friendship is for life and 9/10 they also leave without a spouse. This is especially evident on the Brazil seasons.", "label": 1}
{"text": "Even if it becames obvious. It may be that actually it became obvious for you only now, and all parts knows everything and are ok with it, unless some 3rd party persob starts talking about that in a loud.", "label": 1}
{"text": "ChatGPT comment leaving bot", "label": 1}
{"text": "I'm gonna be real with you, I have a pretty big circle and that has not been my experience at all. Even if its just for self serving reasons, noone wants to be the creepy group. But most of the time it's on principle. \n\n\na guy in my close friend group Got accused of some stuff ( which im sure he did) and the rest of us lost his number pretty much immediately.  I knew the guy since elementary school but when he called me I told him I wouldn't be associating with him anymore and why. \n\n\n\nHe is now friends with all the other creeps and weirdos who did some shit.\n\nSo yeah, birds of a feather is right.  MOST groups (95%) don't have even one creep, its just that 5% that everyone has to watch out for.", "label": 1}
{"text": "There's a reason my partner refers to Brazilian Jiu-Jitsu as \"butts\". \n\nYou know. Because of the butts. The butts I have in my face.", "label": 1}
{"text": "Look, I'm not here to debate with you what I should do and when I should just let it go. I may be younger than you, but I learnt the hard way that there is a reason why I have principles and that letting go of them lead me in the wrong crowd. If you want to keep your façade with your friends, please do it. But don't tell me that I am wrong for doing what is right.", "label": 1}
{"text": "I can only speak for myself, but male gossip is vacuous. Part of it is I'm being trusted not to act on the gossip and keep it to myself. Another part is understanding that it *is* gossip, and is therefore not in and of itself evidence of behavior. I would hate to ruin somebody's day by acting on wrong information, or letting that potentially wrong information cloud my judgement of another person's character, especially if I don't know them very well.", "label": 1}
{"text": "That’s why I said I’VE seen dudes stay friends w creeps, I didn’t say MOST or anything. People have different experiences. Glad you have basic morality, here ya go 🍪", "label": 1}
{"text": "Just trying to share experience, but youre right, you will get it when it will strike back and that lesson you should experience yourself", "label": 1}
{"text": "This convo regressed into some really bad gibberish .", "label": 1}
{"text": "Thing is guys don’t typically keep a scorecard. They just go full aggro the moment there is even the slightest slight. It results in broken teeth but no resentment coz the anger is taken out there and then.", "label": 1}
{"text": "What's the weirdest is how the most homophonic guys are super homoerotic.", "label": 1}
{"text": "I agree with the young guy. You seem like an ass", "label": 1}
{"text": "Yeah but the question you answered is about male friendships in general.  Perhaps you didn't mean for it to come across as a generalization. But in this context that's how it came across. \n\n\nThanks for the cookie tho", "label": 1}
{"text": "Yeah, exposing a cheater is good character. So you let your friends keep being cheated on behind their back, and still be friends with the cheater? And act as everything is good? \n\nNice character", "label": 1}
{"text": "Hello, /u/Stressyand_depressy!  **Please read this entire message before taking action.**\n\nYour comment has been removed:\n\nRemoved for casual or inappropriate usage of mental health related terms or diagnostic labels. Please do not speculate, armchair diagnose, or label other people's mental health situations; or use terms for mental health issues as judgments, slurs, or synonyms for toxic/abusive behaviour even when talking about yourself. Please [click here](https://www.reddit.com/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to/) for clarification regarding this rule.\n\nIf you're referring to someone (yourself or others) who has been formally diagnosed by a medical professional, please make sure your comment reflects that. Let us know once you’ve made the requested changes and your content may be reinstated.\n\n\n\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "My best friend was going through something similar: SIL was constantly messaging her only to trauma dump and complain about things. but never asked her how she is, how her kids are etc. Told my friend to get away from her. Good on you for distancing yourself. dealing with people like that is exhausting", "label": 1}
{"text": "Girl working in a male dominated field here. With my female friends we are not really into the same things or not at the same stages, but we are still friends", "label": 1}
{"text": "i'm quite young and i'm wondering what makes you say this? i vehemently disagree with what you're saying but I would really like to understand your reasoning behind it", "label": 1}
{"text": "Agreed. They seem able to hang out and have fun, without telling each other about their wife, kids, family etc. Like one of them could be getting married or have just had a kid or their parents have died, and the friend will not ask about these events at all.", "label": 1}
{"text": "see i'll forget, but not forgive, there's a few people i hate and i can't remember why", "label": 1}
{"text": "Meeeeee", "label": 1}
{"text": "Because most of them are quite shallow. It's easy to keep a long friendship, when all you do is game, watch sports and drink", "label": 1}
{"text": "This happened to me.\n\nWhen I worked at wendys, about 13 years ago, I was in the walk-in cooler, where this girl i worked with entered too. It was just the two of us. \n\nShe tells me her dad just got diagnosed with cancer, and she starts crying. Keep in mind 3 years before this, my brother died from brain cancer, and she knew this \n\nTurns out her dad dad never had cancer and was fine.\n\nShe was crying. Looking back at it, it was scary, as she was definitely a pathological liar. It was some Oscar award winning actor shit. \n\nShe's the only one I can think about who I was kind of actually scared of. Keep in mind I am a big man, and she was a little woman, but it didn't matter, I didn't know what she was capable of. \n\nShe lied all the time, for fun", "label": 1}
{"text": "This is awful.\n\nA few years ago, a friend of mine lost his remaining parent, his mum, and was devastated. A few months later, his girlfriend's mum died suddenly in a car crash, and she was devastated too.... except it turned out the gf had just made it up, to get attention. Her mum was alive and well, but she'd kept up the pretence of grief for _months_ to her friendship group. Like your friend.\n\nUnderstandably, when the truth came out, the gf was promptly dumped, and shunned by just about everyone who knew her.\n\nSome people do despicable things for attention, when they see others getting attention.", "label": 1}
{"text": "And how sometimes they look up to those behaving that way. Not only girls like bad boys.", "label": 1}
{"text": "Were the breakups actually devastating to your life or did they just feel emotionally devastating without affecting your job/friendship/housing?", "label": 1}
{"text": "Could it be that the men are hanging out while the women does all the housework and childcare, even when they work too?", "label": 1}
{"text": "I hadn't thought about the difference, but no, they were only devastating emotionally.", "label": 1}
{"text": "I wasn't trying to invalidate your experience btw, just curious about the level of devastation. Breakups suck!", "label": 1}
{"text": "Hanging out is a break. No expectations, no responsibilities. Just whatever we are doing while hanging out. Watching a football game? Talk football. Playing video games? Talk about video games. We don't want to get off work then go talk about work or get out of the house to talk about projects around the house.\n\n\nHanging out is most often an escape, not a time to rehash recent events in our lives.", "label": 1}
{"text": "It’s not hard to avoid drama when the relationship is surface level. All of my surface level friendships are drama free and long lasting too 😂", "label": 1}
{"text": "Is there something you'd like to vent about? (being sincere)", "label": 1}
{"text": "A lot of them are surface level or they don’t actually hold each other accountable for certain things said/done. My low effort, surface level friendships are long lasting too", "label": 1}
{"text": "I’ll take music suggestions! Thank you for responding!", "label": 1}
{"text": "Woof, most? That's a bit harsh.\n\nPlus, all the things you listed is time spent together. Sharing ones insecurities and expectations every other day isn't the only way bonds are formed.", "label": 1}
{"text": "I don’t this is particularly true fwiw. Less complicated isn’t the same thing as less deep.", "label": 1}
{"text": "This is a pretty sexist thing to imply tbh. Men tend to bond in a different way, not a lesser one.", "label": 1}
{"text": "post-break up clarity after you truly heal from a breakup is the best thing of all time", "label": 1}
{"text": "Yeah, that's why there's a \"male loneliness epidemic\" lmao.", "label": 1}
{"text": "Women are taught not only to judge themselves harshly, but other women. So if there’s more discrepancy in personality, beliefs, anything then women are less likely to stay friends. Whereas men will literally overlook, for example, that their friend is a rapist. “He just gets a little handsy sometimes! I’ve never seen him do anything that bad.”", "label": 1}
{"text": "Men make jokes every day that in their friendships they don’t talk about problems, meet up for a beer once a year and are still “best friends”, and that they think female/female friendships are harder to maintain because we expect more out of our friendships… But I’m in the wrong when I say it. LMFAO ok", "label": 1}
{"text": "This bugs the SHIT out of me. I just want something in-between. A little truth, a little letting go. Not something that builds and not something that we NEVER talk about. It’s getting worse with the internet too, people being unable to have hard convos.", "label": 1}
{"text": "To say that men and women tend to expect different things out of their friendships? Of course! To imply that all or most male friendships are surface level only? That’s straight up sexist yep.", "label": 1}
{"text": "Totally. Ironically, I kind of blame the immediacy of our day to day lives with smartphones, etc. I think sometimes a lot of folks don’t want to do the extra work required with relationships, whether platonic and romantic because it’s not overnight sometimes. Sometimes you have to have hard convos face to face, and smartphones, texting, DMing allows us to hide. Just a theory.", "label": 1}
{"text": "Yes! Literally not forget but forgive and move forwards (unless it’s really bad). I mentioned this above somewhere I think, but my best friendship is with my best guy friend who we literally fight like siblings and still fiercely protect and platonically care about each other. It’s the best thing ever. Recommend everyone have a friendship where you can call each other out, get on each other’s nerves, and a have a blast hanging out. It’s the best! And grateful for it 🙏🏻", "label": 1}
{"text": "You sure didn’t think the original comment was sexist tho, you’re mad that I used “surface level” to explain it rather than “laid back”. YOU’RE the one who took “surface level” as being lesser in VALUE when it means lesser in effort and depth.", "label": 1}
{"text": "Is there no other way to explain it? That seems awfully presumptive. \n\nAnd implying that one gender has predominately surface level friendships is sexist, yes. It’s no different from a man suggesting than women are predominately neurotic in their friendships. In that it’s a negative and incurious generalization about the richer and more complex dynamics going on.", "label": 1}
{"text": "That's how male humans really become Men.\n\nReally is.", "label": 1}
{"text": "“Your friendships are lazier and less deep” is not quite a nicer or truer statement imo. \n\nTwo dynamics can be different in a neutral way, with their own tradeoffs. Men’s friendships, on average, tend to be *simpler* true. But that’s not a synonym for superficial.", "label": 1}
{"text": "That's a gross generalization.\n\nThere's a difference between hearing about how some random I hardly know gets wasted every other day, and a close friend being a cheating scumbag. The first is gossip, the second is an accusation.\n\nI have no sympathy for cheaters, rapists, or other harmful behaviors. I'd be subtle and nondescript about how I go about looking for proof, because again I'd hate to accuse somebody of something I have no evidence for, and especially if it's a close friend; but I and a lot of other guys will absolutely burn bridges over this type of stuff. I don't care how intimate we are or how long I've known you: if I have undeniable proof you're a sack of shit, you're dead to me, and your victim deserves to be free from you.", "label": 1}
{"text": "Thanks for confirming", "label": 1}
{"text": "Thats not necessarily wrong exactly but is biased framing of it. \n\nAnother way to phrase it would be to say that male friendships of this type are ones that you you can be sure of your continued friendship even without constant validation of that friendship and that the friendship is not contingent on what they can provide for you emotionally. \n\nIt just IS, and will continue to be even without constant reaffirmation unless something huge occurs. There is the general understanding that even if you havent spoken in a decade if you reach out and ask for help they will be there 100%, but also that they wont want to burden you with anything unless they absolutely decide they cant handle it. So much of a mans interaction with the world is transactional and based in what they can provide that its almost a subconscious reflex to try to keep that mentality out of personal relationships.\n\nI would read what you wrote as male friendships having a stronger bond. All about how you interpret it, it doesnt mean the friendship is surface level. \n\nBasically boils down to: i KNOW you are there for me, you KNOW i am there for you, as long as we are hanging out lets try to forget our problems and just exist.", "label": 1}
{"text": "Nobody is asking you to rehash events at every hang out, but the fact you don’t know anything about your friend’s life is sad. Can you even call yourself a friend? I don’t know every single detail about my friends but I know who lives in their house, how they are doing. I know when my friend is going through a hard time. You can’t escape things forever.", "label": 1}
{"text": "Of course there are several ways to explain almost anything, that’s the way I chose to. Again, I said “surface level” instead of “laid back” and you took that as a negative because…? Most people have surface level relationships in their life, that doesn’t mean it’s morally wrong or terrible to have. It’s okay to have surface level relationships LMAO.\n\nIf you’re hurt by wording or the way someone explained something based on your own connotations that you added, I’m not sure if Reddit would be good to stay on.", "label": 1}
{"text": "Yeah yeah. Lots of men say that “if they have hard evidence” but no evidence is ever enough.", "label": 1}
{"text": "This is definitely true. It’s sort of a bond and loyalty you develop from shared experiences. It’s hard because you hold on to that person that you knew before they became morally bankrupt. It’s often how some friendships just drift apart.", "label": 1}
{"text": "I don't have to know that somebody's 4 year old daughter has a ballet concert coming up to be a good friend. I'll listen if he is excited about it, sure, but I dont give a shit what color her tutu or whatever it's called is. I know partners' names, but if there was a problem with work/family life, he would tell me, either verbally or nonverbally. If there isn't, then great, let's enjoy each others company.\n\nAt least for me, what makes my friendships so special is being able to tell when something is wrong, or even what is wrong, without having to say anything. Then, knowing if it's something that needs to be talked about or if he just needs a distraction.\n\n\nA couple of months ago, my friends were sitting around a fire in various states of sobriety. A couple of them visually started looking upset. Without a word, the rest of the group simultaneously identified the source and provided exactly what they needed when they needed it.\n\n\nIt's not like guy friends never talk about things, just a different emphasis on how we want to spend our time together.", "label": 1}
{"text": "I didn't write it but the way I see it, everyone has shit on them and nobody is perfect and destroying a long friendship over an action someone took and then confided in you out of trust is going to leave you with very few friends because you're going to find yourself in putting everyone on your shit list holding everyone to unrealistic standards and letting one moment define them forever, like only evil people cheat that's why if you cheat you're evil!\n\nIt's a very simple viewpoint and human beings are not simple which is where the belief that you must be young to still believe this because as you grow up you realize there is a lot more to people than simple actions.", "label": 1}
{"text": "There is an in between. It’s called getting drunk and crying at eachother for an hour and a half in the bathroom at a girls night. ", "label": 1}
{"text": "Hahahah yes! 😂 I may or may not have done a version of that before.", "label": 1}
{"text": "Just a dude, and somewhat related, but I've only recently begun to experience this for the first time with another guy at work. I'm a bit slow when it comes to noticing stuff like this, but he very clearly tries to make sneaky remarks at me to make myself feel inferior somehow and yet we show each other funny memes and banter with each other and have such pretty superficial work \"friendship.\" \n\nI noticed it all started when I brought up my girlfriend when it came up in conversation in our work group. He's the type of person where everyday he just yaps about some new girl he's \"talking to.\" \n\nI've actually begun keeping a mental scorecard and the resentment is slowly building up. I've never been involved in workplace drama and not sure if I can keep this up 💀.", "label": 1}
{"text": "The only thing more gay then a group of straight men is either a group of straight men in a locker room or a bunch of homophobic men.", "label": 1}
{"text": "Going thru a devastating breakup right now. It’s hard to get up everyday but i’m improving myself out of spite. ", "label": 1}
{"text": "Yes. So this is what it’s like a little lol. Welcome! \n\nIn all seriousness, he sounds super immature and exhausting. Working with that cannot be fun 😬", "label": 1}
{"text": "Grades shot up, I met like minded people, I am thriving so so well with so much love and support. Post-break up clarity never felt better~", "label": 1}
{"text": "Breakups suck so much, and the fact that you're pushing through makes you so strong even though I bet it doesn't feel like it. One day at a time. I'm out here rooting for you, you got this!", "label": 1}
{"text": "He sits right next to me in a different seating unit. I'd love to change my seat but my favorite work friend sits in my unit (a woman a few years older so she's more \"humored\" by his antics than genuinely bothered by it). \n\nPlus, I actually have one of the most prime real estate seats on the entire floor (window view, large desk, storage space, my monitors angled so no one can see what I'm working on, etc.). \n\nIdk if it's worth losing out on these perks just to get away from this guy 😭", "label": 1}
{"text": "tf", "label": 1}
{"text": "Look up the riot grrrl movement. Bikini Kill is a top example of the genre. The Linda Lindas carry the torch now.", "label": 1}
{"text": "Scorpio?", "label": 1}
{"text": "I had the friend with such mentality as well. She would also ask me for an advice and then do something else (and usually something that will lead to the same bad outcome) and then I had to listen to her complains again and again. \nThe breaking point was when a lot of overwhelming and emotional things happened to me in a row, but it wasn’t something we had time to discuss, because all the discussions should have been about her wedding. She also controlled everything in what I was supposed to do for her in her wedding (basically to be like a cheerleader and a therapist, because of her extreme anxiety). So I decided to opted out from the wedding (3 weeks in advance, and I was just a regular maid)  and was proclaimed the betrayer and that she can’t now trust people etc. We haven’t talked since her wedding and I never got my diamond earrings that she “borrowed” for her wedding. She told our mutual friend that they were, apparently, a gift from me (even though I gifted her something else). ", "label": 1}
{"text": "When I was a teenager my best friends' girl literally gave him an ultimatum between her and I bc she thought we were actually gay🤣🤣", "label": 1}
{"text": "Sometimes this is too much. You will find them supporting a rapist/murderer", "label": 1}
{"text": "Except when it’s a girl’s sexual history… then that’s the whole truth and nothing but the truth", "label": 1}
{"text": "Basic training was the gayest straight place I've ever experienced.", "label": 1}
{"text": "Amen to that sister. Protect your peace at all cost.", "label": 1}
{"text": "Yes he should know better", "label": 1}
{"text": "It’s also a symbol of what think and how low they think of your character. Like as if the moment he turns around I’m open for business.", "label": 1}
{"text": "Don’t know why I laughed so much at this but thank you", "label": 1}
{"text": "What do you mean with \"decent\" partner?", "label": 1}
{"text": "Maybe hes got an invisible superhero cape we dont know about.", "label": 1}
{"text": "You're right. I don't follow radical feminist movements.", "label": 1}
{"text": "I have chronic pancreatitis, try me lol", "label": 1}
{"text": "Honestly from what I’ve seen with my friends and online is that women *do* boycott men but in a different way than men boycott women. \nObviously when men do it, they complain a lot about women online, they get into unhealthy habits, some even go so far as to hurt or kill women. \n\nWomen like, get cats and learn about gardening and travel with their friends. My mom, for example, after divorcing my dad, had a ton of bad experiences with dating so she just said “fuck men” and now she’s super into painting and her book club and travels with her book club friends all the time. I have a few other girl friends who have decided to stop dating and they’re just like, happy people lol. \n\nMen just can’t happily exist without women and they resent them for it. Women don’t give a shit. That’s why you only hear about men boycotting women and not the other way around, even though we figured out men can be bad (and sometimes outright dangerous) for us.", "label": 1}
{"text": "🤣🤦🏿‍♂️", "label": 1}
{"text": "Not to diminish other pain at all, pancreatitis is no joke!! \n\nJust that it is a really specific type of pain that is difficult to put into words if you haven’t felt it :) especially the leg pain. I still haven’t been able to describe it fully", "label": 1}
{"text": "Guess hes just got built-in invisible armor, huh?", "label": 1}
{"text": "Instead of \"find x\" you say \"find g\".", "label": 1}
{"text": "I mean, I’m super pro-abortion, but men also can’t decide their future without abortion if they get a woman pregnant. \nThey actually have less control because they can never control whether the woman gets an abortion or not. So whenever a man has sex without the intention to procreate, he’s putting his future completely into the hands of his partner and trusting that she’ll get an abortion if something goes wrong.\n\nI’m guessing someone will respond that men don’t have the burden of parenthood the way that women do, which no doubt is true from a physical perspective, however any man who is a decent man will take fatherhood to be an incredibly intense and life-altering commitment.", "label": 1}
{"text": "Lol, it's actually the other way around. You need us more than we need you. *Way* more, but we're fed up and happy being single. :)", "label": 1}
{"text": "I should probably add I'm an ESL teacher 😅", "label": 1}
{"text": "Sorry dude. The women don’t want you and they’re cool with it.", "label": 1}
{"text": "\"Women aren't boycotting dating\"\n\n*They are*\n\n\"Yeah well I didn't know about it, so that doesn't count\"\n\nClassic.", "label": 1}
{"text": "Yeah, some men boycott women *at* women. It’s like the little kid who goes out of his way to tell he’s ignoring you and then keeps reminding you in case you forgot.", "label": 1}
{"text": "Oooo, you got me 😂", "label": 1}
{"text": "This ! As I posted just a few seconds ago, those who get it don’t get it cause they were taught. It comes from within and/or from being shown by other me.", "label": 1}
{"text": "millennial 🤔", "label": 1}
{"text": "We do talk to each other, we just don't do it in front of women or tell anybody else that it happened", "label": 1}
{"text": "Lol, at locking all the replies. You’re only allowed to think one way?", "label": 1}
{"text": "Unfortunately, ye😂", "label": 1}
{"text": "Or just any weekend over here in Switzerland 😂", "label": 1}
{"text": "Cringe,thats literally how friends back in the days settles stuff. Fight it out and then hug it out", "label": 1}
{"text": "Virgo 😀", "label": 1}
{"text": "As someone who does partner dancing, it’s actually more common to not have a partner already . You will have one during class and the dance socials, many people go alone anyways", "label": 1}
{"text": "Ask yourself if you're genuinely hungry or do you just want to eat because the clock says so? Because food is available? Because everyone else is eating? Because you're bored? Because eating will take your mind of something? Because you're doing an activity you often pair with eating (like watching TV)?\n\n\nConsider your next bite and compare that to how full you actually are: Must you finish everything on your plate? Must you have a second helping? If you have kids, must you eat up their leftovers?", "label": 1}
{"text": "So did it turn you on if you didn’t masturbate to it? It sounds more like a shock factor.", "label": 1}
{"text": "this is the same argument porn addicts use lmaoo", "label": 1}
{"text": "Hi, I please note that my question isn't a generalisation of the love of romance novel being an addiction but specific cases where someone might notice that their behaviour is reminiscent of an addiction. \nI understand your frustration with the prior generalisation but also understand that there are many things that are not by themselves addictions but that can, if mishandled resemble such patterns.", "label": 1}
{"text": "Yes, the reason I’m pushing back is that these behaviors often get falsely classified as addiction (including by the people participating in them) precisely *because* these are sexual forms of media and we live in a puritanical anti-sex society.\n\nCertainly it’s possible for someone to be reading romance novels more compulsively than they would like to, in which case they should seek psychological help, same as they would for any other behavioral compulsion. But in a great many cases, no such compulsion/addiction exists – the person just feels guilty about their totally normal consumption of erotic media, because the culture (and/or people in their life) have convinced them that they should.", "label": 1}
{"text": "Damnnnn", "label": 1}
{"text": "As I said, if someone genuinely has a harmfully compulsive relationship to something in their life, they should seek psychological help with that.\n\nMy hope would be that in this case specifically, it would be with a sex-positive therapist who understands that the compulsive behavior is the problem, not the erotic material.", "label": 1}
{"text": "I find romance novels so cheesy and typically poorly written that they actually make me cringe. \n\nwould rather read a real book.", "label": 1}
{"text": "That's kind of wild.", "label": 1}
{"text": "Completely agree.", "label": 1}
{"text": "I mean the former. I started reading such when I was 12 and I have never stopped. I finished 3 novels on Sunday alone. I have never taken a break so maybe that's something to consider. It might alter my relationship with the genre", "label": 1}
{"text": "I have never skipped a scene in my life. I don't even think I've ever considered it. This is an interesting pov", "label": 1}
{"text": "In certainly went through a phase as a teenager where i read harlequin smutty novels and other various brands of them and easily read 10-15 a week, at one point my linrary had none i hadnt read already, but also went through a phase of thrillers like robin cook/john grisham/tom clancy and read 6 a week (thicker books than smutty novels) and i world read pretty much during all my down time, often late into the night\n\nAslong as it doesnt stop you from taking care of your responsibilities its just a hobby you are passionate about \n\nNowadays its fanfiction, mostly harry potter and twilight but also some marvel/dc and i love the mature ones where it includes some hot sex scenes, i still cook, grocery shop, do errands, walk the dog, hang out with friends, but after that i read read read read\n\nDont see any issue with it and would not consider it problematic in any way", "label": 1}
{"text": "My mom has kind of the opposite of mom lore; she almost never discusses her past. It’s particularly weird because my dad always told us stories from his life. I could probably tell you what my dad was up to every half decade until I was born, but nothing for my mom. One time in my 30s I went to Toronto for a conference and told my mom I liked the city… She said “Oh yeah I loved it when I lived there.” ?!?!?!!?? What??? Never knew about any of that.", "label": 1}
{"text": "Oooo someone does not tick any boxes!", "label": 1}
{"text": "It's funny because I go braless, wear tight tops, you can see my nips and I genuinely get next to no stares. Some glances for sure. Though they are itty bitty ones so that's probably part of it lol", "label": 1}
{"text": "Yeah, I have DDs. I'm also 10w pregnant, so no bump yet but my tits are even bigger with pointy nipples. I'm not leaving the house like this.", "label": 1}
{"text": "I heard someone say putting band aid on them hides them...", "label": 1}
{"text": "True, aligning vintage jams with TikTok dances tough.", "label": 1}
{"text": "Solidarity.", "label": 1}
{"text": "Definitely an achievement. A wilful power I wish I had. Please send some over. Quitting smoking is hard", "label": 1}
{"text": "I’ve 100% always failed at making biscuits. No idea why", "label": 1}
{"text": "Thank you! But I just realized I was spending close to $500 a month so that definitely helped.", "label": 1}
{"text": "Complicated relationships with parents is so difficult sometimes and definitely places strains on the marriage. \n\nMy mom has been in and out of the ICU twice for a month each the last two years, almost dying multiple times, lots of medical drama. Our complicated relationship made it all the more difficult and confusing, esp feelings. \n\nI just got news tonight she's back in the hospital , and I don't know how to feel, what to think. doesn't help I'm her eldest of 4, and you can see the hospital from my backyard....", "label": 1}
{"text": "Try ozempic. Terzepitiide.", "label": 1}
{"text": "Get nipple covers. They’re silicone and they stick on via body heat and reusable", "label": 1}
{"text": "I think we should consider the term “happily married” because it equates marriage with happiness hence can be misleading. There is no other relationship status that has happily or some sort of emotional state attached to it. Marriage like all relationships ebbs and flows", "label": 1}
{"text": "Just open it up. Works wonders.", "label": 1}
{"text": "Exacerbated not exasperated", "label": 1}
{"text": "During your PPD, did you treat your husband badly? And if so, in what way?", "label": 1}
{"text": "I am just worried about your back o.o.", "label": 1}
{"text": "You are truly lucky. Some women don’t have this privilege. You made me think of a friend whose partner would’ve made her life a living hell if she did that. She has completely lost herself and her self esteem since being with him and it hurts because she used to have so much life inside of her now she is a recluse and given up on life at 31!", "label": 1}
{"text": "Why didn't you consider adoption?", "label": 1}
{"text": "No I didn’t treat him badly. I was really sensitive and felt like he didn’t love me or wanted to be with me. In hindsight that wasn’t the case at all. I guess I was paranoid? I felt like a shell of a person.", "label": 1}
{"text": "Adoption is typically incredibly expensive and there isn’t insurance coverage to help like with fertility treatments. It can also be a long and difficult process that doesn’t always result in a child. It comes with its own amount of trauma for you and the child. It’s not an answer to infertility!", "label": 1}
{"text": "so women listen but theres no fans here?", "label": 1}
{"text": "Hey, what detangling spray do you use? I’m looking for one", "label": 1}
{"text": "It's crazy how this is almost 1:1 exactly my friend. Every time I suggest we go to a new/different activity, she kind of makes excuses saying \"it's not for her.\" I think inside it's deeply terrifying that she's so out of practice and she's afraid of rejection and failure, so she avoids rejection by never attempting to meet people. That way she can shirk blame and just say \"society makes it so hard to meet people!\" \"guys these days don't want commitment\" etc etc (all true statements) to avoid looking inwardly and seeing that maybe she has to change some of her behavior. But when she's being herself and feeling comfy in her own skin, she's beautiful and silly and funny, someone that so many people would love to know. It's so tragic!", "label": 1}
{"text": "What silk bonnet do you use?", "label": 1}
{"text": "I have one that ties in a bow at your forehead and it is driving me nuts - staying here for recs. (also promoting the bonnet for anyone who hasn't tried it! game changer for me - I had a terrible bleach incident and now my hair is crispy AF but the bonnet has saved it from breaking, and my hair looks feshly washed for like 3-5 days)", "label": 1}
{"text": "I wash the dishes; he does the cooking. I clean the bedroom; he tidies the living room. We shop for groceries together.", "label": 1}
{"text": "I have a tie one from Velanico that stays tied. The elastic one I got from a beauty supply store is also really nice because it's a wide band and stays put. It doesn't have a tag, so I don't know the brand. I've had it for over a year.", "label": 1}
{"text": "according to your comment, it can be understood that anyone with you will be emotionally stable and happy", "label": 1}
{"text": "What bonnet do you use?", "label": 1}
{"text": "Thanks :)", "label": 1}
{"text": "Then, you’re off topic", "label": 1}
{"text": "Growth over grand gestures, got it. Wheres the signup sheet?", "label": 1}
{"text": "Hahaha, you reminded me of the time my dad gave my mom satin pajamas for Christmas, when she would wear them she'd fall out of the frickin bed! She finally fell hard enough she said F this and got rid of them. They were hazardous with hardwood floors and their high bed lol", "label": 1}
{"text": "I got mine from Costco and the back end is bamboo so it doesn't slide.", "label": 1}
{"text": "Ahh! I need to find this one then!", "label": 1}
{"text": "Hello, /u/Mid_Night_Rose!  **Please read this entire message before taking action.**\n\nYour submission has been removed:\n\nThis is a common topic or recently asked question. Please have a look at the front page, use the search bar, or have a look at our FAQ.\n\n\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "It's from Night and they call it dual sided.", "label": 1}
{"text": "For the most part, you get judged for being emotionally vulnerable by women if you're a straight guy.", "label": 1}
{"text": "You’re meeting the wrong women then", "label": 1}
{"text": "If it was the right person, it wouldn't have been the wrong time.", "label": 1}
{"text": "I am completely ditching mine!! if I do wear a bra for a special occasion or really thin top, I will do a wireless one", "label": 1}
{"text": "A relationship with built-in travel perks, nice move.", "label": 1}
{"text": "Time travelers dating woes: timelines just never match up.", "label": 1}
{"text": "Yes, I only found out when I met the right person.", "label": 1}
{"text": "Untrue. I think that people can be perfect for each other, but maybe they’d prefer getting to a better place in life before making something out of the relationship. 🤷‍♀️", "label": 1}
{"text": "That’s very mature of you", "label": 1}
{"text": "Nah if they were \"perfect\" for each other then it would've worked. We like to romanticize our partners but if they aren't compatible with the person you are now, with the life you have now then they're not your person. \n\nYou can't say that they're perfect for the person you aren't now but the person in a position you hope someday to be. It's at its root  delusional.", "label": 1}
{"text": "I’m sorry you see things this way, but often times people are mature enough to say “hey, let’s meet back in two years once I’ve got my life together” and there’s nothing wrong with that. It’s not necessarily that they aren’t compatible, it’s that they want to have their life together so that they can give their person everything they are capable of giving. Devoting their time to their partners instead of suffering through college, etc.", "label": 1}
{"text": "A lot of women in another thread said they would lose respect for their partner if they didn’t stand up for them. You are very emotionally mature", "label": 1}
{"text": "Haha good point, women are unfortunately not off limits when men fight each other", "label": 1}
{"text": "Some women said they would lose respect for their date in another thread so wanted to see if that was the consensus.", "label": 1}
{"text": ">I’m sorry you see things this way, but often times people are mature enough to say “hey, let’s meet back in two years once I’ve got my life together” and there’s nothing wrong with that\n\nThat's not a sign of maturity, that's a sign of more delusion. Mature people understand that the people who would meet back up would be different people than they are now and that they both have a life to live in the meantime, expecting that person to \"wait for them\" is not mature. If they wanted to try being friends and going from there, sure that's a possibility. To hope that despite the fact that a partner is suppose to be there for the ups and downs of life, and you're both agreeing to do the exact opposite that you can just pick up right where you left off is just a big dose of copium. \n\nThe saying \"if you don't want me at my worst, you don't deserve my best\" is usually a sign of a toxic person but a couples who response to hard times is to take a few years for a break? Yeah, I don't see that going anywhere serious.", "label": 1}
{"text": "That’s a good Jedi mind trick. Touché!", "label": 1}
{"text": "Lighting diyas, bursting crackers, demolishing gulab jamuns and samosas.", "label": 1}
{"text": "Hello, /u/annesherleycuthbert!  **Please read this entire message before taking action.**\n\nYour submission has been removed:\n\nToday is [Thersday](https://www.reddit.com/r/AskWomen/comments/mvwubm/happy_thersday/), where we are only allowing questions centered towards women outside of all relationships with others. If your post meets all other requirements, you are welcome to repost tomorrow!\n\n\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "How was the sex? With new people?", "label": 1}
{"text": "Well I've never had that so I'm here for the comments.", "label": 1}
{"text": "Me neither! I’m almost giving up so I always wondered how it would feel", "label": 1}
{"text": "when i could sing and dance around them. i’m very shy ig or socially awkward. i never feel judged around them and im not afraid to cry either. he makes me feel like im at peace. like he’s my home", "label": 1}
{"text": "I don't believe this is always the case. Sometimes we aren't in the right space for the kind of person we need in our lives. This is why sometimes people come back to seeing someone from their past and then spending the rest of their lives together, happily.", "label": 1}
{"text": "Lmao, same babes", "label": 1}
{"text": "I'm a 28yo single mom who recently decided to end my toxic marriage. Now, I'm focusing on raising my daughter while working from home.", "label": 1}
{"text": "When the fact I have male friends and have always had male friends didn't turn him into a annoying needlessly jealous psycho. Nearly 3 years together and it's never once been questioned or looked at closely and never should have been by others either. It has made me feel so tremendously safe and relaxed that I can have friends and it's not a \"problem\".", "label": 1}
{"text": "I got flack for trying jumpsuits and rompers and saying I felt like I had just torn down a set of curtains and tied them like it was toga day at school.  I've tried so many on and none of them ever look flattering on me.  Idk why. They look great in pictures and everyone else.  Even my other petite friends say they look good in them.  I'm wondering if it's because I don't wear heels that they look bad on me.", "label": 1}
{"text": "Please, don't give up!", "label": 1}
{"text": "I think the OP was looking for stories specifically related to sexual activity.", "label": 1}
{"text": "Yes thank you for clarifying sorry for not being more precise in my description", "label": 1}
{"text": "The idea that men get complimented for being promiscuous is not true. It’s always been one of those things where if it’s not your personality then most people won’t know or care.", "label": 1}
{"text": "Ah, that makes sense! I interpreted it more as “on the basis of sex”. Will delete my comment since it isn’t relevant.", "label": 1}
{"text": ">In those cases I think people who are genuinely compatible will eventually come back together after recognizing that no one else fits as well.\n\nWhy would anyone else fit as well? You've been carrying a torch for years of an idolized person that never existed, no one is able to compete with imagination", "label": 1}
{"text": "Without getting into specifics I've hurt my partner deeply recently and the past month has been terrible for her because of me. We aren't talking much atm and I'm not sure of the future of our relationship. I want her to know I'm always thinking of her and want to send a \"I hope you have a good day\" text without saying \"I hope you have a good day\". The best I've come up with so far is \"I hope the day is kind to you\" but I feel like that kinda leaves me open to a pointed retort. Any suggestions on what I can say to show her I'm thinking about her and wish her well without being too generic?", "label": 1}
{"text": "Funky outfit there 🤔", "label": 1}
{"text": "The \"basic\" understanding of how to be intimate comes from the (more or less) lack/deprivation of intimacy. It's nothing any man can just change, especially if they never had any relationships.", "label": 1}
{"text": "im not scared to open his texts, i dont get anxiety when i have to see him, i dont get second hand embarrassment whenever he does anything, i dont cry 24/7, im like never mad at him, he treats me with respect and kindness, he shows me how much he cares all of the time, and I can actually trust him", "label": 1}
{"text": "My boyfriend likes it when I wear a dress. A mini one.", "label": 1}
{"text": "That's horrible for the simple fact that fat guys are often really gross, yet get less flak for it. Not your husband, I imagine, but many fat guys don't take jack shit care of themselves; they just get all hairy and sweaty, whereas many fat women at least try to keep up in order to keep people from picking on them. I notice it a lot. I know fat people who the guys don't bat an eyelid over, yet when these same people are talking to a fat woman, they get all weird and owly. It sucks. ", "label": 1}
{"text": "Strategic outfit planning, I like your style.", "label": 1}
{"text": "Equal pay for equal play, let's level the love field.", "label": 1}
{"text": "Thought skinny jeans were a no-go, now I'm a convert.", "label": 1}
{"text": "So many things about humans seem completely backwards. ", "label": 1}
{"text": "I think there’s some nuance here though, at some point a woman also becomes a loser for being a virgin because it’s assumed something is wrong with her.", "label": 1}
{"text": "I used them. If she is 'receiving' a booty call from anyone she is doing them a favor.", "label": 1}
{"text": "Have you ever thought a woman needs a man to orgasm to get pregnant? Probably something to do with it.", "label": 1}
{"text": "Have you ever thought a woman needs a man to orgasm to get pregnant? Probably something to do with it.", "label": 1}
{"text": "For pregnancy sure, for sex not leading to pregnancy, that doesn't matter one bit.\n\nMajority of people when having sex are doing it for pleasure, not to get pregnant.", "label": 1}
{"text": "I'm always treated exceptionally well and I think part of that is because I'm a beautiful and feminine woman. Strangers open doors for me and offer to help me when I need without me even having to ask. I also think women have immense power in our relationships if we know how to express our desires in a way that inspire our men to bend over backwards for us. I can simply express to my husband that I'd love a latte when I'm at work and my husband will drop what he's doing to get me coffee and bring it to me at work. Same with my clients. I think we have so much power as women, but we need to know how to channel that femininity and grace and almost anyone will do what they can to put a smile on our faces.", "label": 1}
{"text": "Lactose intolerant here; ice cream is now my frenemy", "label": 1}
{"text": "I knew it existed, but I've never met anyone else who developed a shellfish allergy later in life and knew exactly what they were missing out on now...", "label": 1}
{"text": "YES!!! soy is a huge trigger for me & it’s always lingering around!", "label": 1}
{"text": "I make time for it. If I need to go somewhere, I prepare earlier. If I'm running late, I just wash it quickly.", "label": 1}
{"text": "Whilst you think you’re having sex for pleasure, I can assure you the body thinks differently. It literally has given you orgasms to make you have sex. Your fact about pre cum containing sperm whilst true is a little silly. Again it’s all about being pleasured and sexually aroused, it not just falling out of penises and hanging around on park benches.", "label": 1}
{"text": "Just so you know, green valley lactose free sour cream, cream cheese and butter changed my life.", "label": 1}
{"text": "Never heard of this. Looked it up and learned something new. Thank you for sharing", "label": 1}
{"text": "Just a heads up, I was doing an Asian recipe and found out sweet potato is a substitute for shrimp. It worked great for my bahn bot lok", "label": 1}
{"text": "Didn’t even know this existed 🫣👀", "label": 1}
{"text": "Start with the fodmap diet and go from there.", "label": 1}
{"text": "I was desperate one night and scoured the internet cus I JUST wanted... no... needed nachos.", "label": 1}
{"text": "Switch to dry shampoo; embrace the messy bun life.", "label": 1}
{"text": "This is so true! My son is vegan and when I'm around him (when he's not away at school), I eat far more vegan. He and I eat really well. It is fun to cook vegan food. But when eating out, ughhhhh, sometimes it's tough to find options.", "label": 1}
{"text": "when i was struggling really bad after being diagnosed with borderline personality disorder and rather than leaving, he remained patient and was willing to learn about it with me as well as encouraging me to keep going to my DBT group sessions and taking my medications. i will never understand why he tolerated my splits the way he did and how he managed to stay so calm, but i am infinitely grateful. to this day i still do not think i was deserving of that level of kindness and compassion. thankfully, the majority of my symptoms are in ‘remission’, and we’ve been together for three happy years :)\n\nthe other thing that made me realize was when we were having sex one day and i started having flashbacks from a previous assault and i said ‘stop’ and without missing a beat, he stopped. i bawled my eyes out afterwards while he held me because i didnt know he actually would. it was very healing.", "label": 1}
{"text": "I'm not a woman but the last one has to be annoying having someone else tell you what you enjoy", "label": 1}
{"text": "Seems to be the exact opposite here. \"Fat\" women are seen as beautiful whereas \"fat\" men are slobs who need to go on a diet.", "label": 1}
{"text": "I feel like in my lifetime I enjoyed a brief period where the sentiment yes I've had consensual sex before was taken at face value instead of reframed by a weird angry man as no you were used!!", "label": 1}
{"text": "For some men. Yea.", "label": 1}
{"text": "I can tell you this much for the bloating - avoid the heck out of sugar and salt, especially salt, a day or 2 before and during your period.", "label": 1}
{"text": "I was 22ish.  I thought it was because I worked in a casino buffet with AYCE crab legs and shrimp every weekend. All those particles flying around, I thought I did it to myself working there.", "label": 1}
{"text": "Fr lol free women of the 1921 shackles thinking sex is for men", "label": 1}
{"text": "What is it a reference to?", "label": 1}
{"text": "I also developed a shellfish allergy about a year ago. It’s tragic. Shrimp was also my favorite food", "label": 1}
{"text": "What's a road?\n\nAnd please don't tell me it's a street", "label": 1}
{"text": "I totally get where you’re coming from! Washing my thick, long hair can feel like a whole event. To make it less of a chore, I try to streamline the process as much as possible. For starters, I wash my hair less frequently maybe every three or four days so it’s not such a big deal each time. When I do wash it, I make sure to have everything ready before I start. That way, I can just get in and out without feeling overwhelmed. I also use a really good leave-in conditioner, which cuts down on the need for styling afterward. I like to air dry my hair as much as possible, so I’ll put it in a loose braid or bun while it dries.", "label": 1}
{"text": "You guys get presents?!", "label": 1}
{"text": "Like a sitcom, everyone loves the quirky new cast member", "label": 1}
{"text": "Forgiving someone is more about relieving yourself of the anger you hold against them. Carrying that anger aka \"chip on your shoulder\" can have negative impacts on your physical and mental health and even your social health. Take it from someone who not only has been wronged but is also guilty of causing anger and someone harbors guilt and self punishment over such an incident. I got wronged, didn't forgive and then carried that anger over to a new relationship nearly destroying that new relationship in the process. ", "label": 1}
{"text": "Good heart!", "label": 1}
{"text": "So cool!!", "label": 1}
{"text": "Awww!", "label": 1}
{"text": "No way, they so great!", "label": 1}
{"text": "Lovely 😍", "label": 1}
{"text": "That's so beautiful", "label": 1}
{"text": "That's adorable!!", "label": 1}
{"text": "Thoughtful gift!!", "label": 1}
{"text": "Oh wow!!", "label": 1}
{"text": "Fun!!!", "label": 1}
{"text": "That's awesome!", "label": 1}
{"text": "Love it!!!!!", "label": 1}
{"text": "Shave it off ..hair = ego", "label": 1}
{"text": "That can be true..it's a shame\n.. also location dependant ..wherever definitely sexist", "label": 1}
{"text": "Yes..I want my gfs to shout and if necessary...shoot..stand up..don't take sht", "label": 1}
{"text": "I like training women to shoot handguns...building confidence and self reliance..then bfs are optional", "label": 1}
{"text": "Yes  but not always an age thing", "label": 1}
{"text": "Thank you so much! It really warms my heart to read this from someone who doesn’t even know me. The people around me hardly ever check in on me or my daughter, not even once a month. You have no idea how much happiness you've brought me just now.", "label": 1}
{"text": "Thank you so much! I truly needed this good luck right now.", "label": 1}
{"text": "I'm 37 and it took a long time for me to be comfortable going out someplace simple (think grocery store) in a casual dress. The tipping point? I was too lazy to figure out what pants I should wear.", "label": 1}
{"text": "Less efforts, less results lol", "label": 1}
{"text": "Haha a dress is actually so much easier than wearing a whole outfit, you are right!", "label": 1}
{"text": " Not a criticism at all as per my intention.  Just that it isn't restricted to age gap..could be cultural\n....could be taste in art or music ..humor..etc.", "label": 1}
{"text": "See I love this, and I think I’m getting closer to this mentality! I’ve also started wearing headphones in places like the grocery store, especially if I wear something more girly. \n\nI honestly think a huge part of it for me is that I never learned how to be “causally pretty.” Idk if it’s my features or demeanor or both, but I’m either dressed in baggy boy clothes or in form fitting dresses that are more “sexy” than pretty. I’m always in quiet awe of women who can dress truly pretty, especially just like out in the world living their life.", "label": 1}
{"text": "Men can and do “earn” sex as women are the sexual selectors and have far more options. \n\nThis is pretty basic to life. ", "label": 1}
{"text": "Ah that does sound complicated. Maybe one small step at a time? Start with, I dunno, mascara and once everyone thinks that's normal to you add lipstick? Swap the jeans for trousers gradually upgrade to the occasional modest skirt and take it from there?", "label": 1}
{"text": "About once per lifetime. And I've already hit my quota. Too few women and too many men showed up, so it was boring.", "label": 1}
{"text": "A few times a year. We like to go to swingers castle events and orgies are my favorite part, it really intensifies the passion and eroticism in the room.", "label": 1}
{"text": "Zero times so far", "label": 1}
{"text": "Host an orgy every two month", "label": 1}
{"text": "Never... I'm not a sexual person", "label": 1}
{"text": "The biggest group sex situations I’ve been in were 4 people total, which I don’t think counts as an orgy.", "label": 1}
{"text": "It's legal where I'm at but I'm everyone's bestie who needs a week to get away from it all and experience a new state", "label": 1}
{"text": "I just took a screenshot of this and sent it to my bestfriend. We are three friends; all three of us committed and in good relationships; whenever we meet and hangout, this one friend is always on texts & calls with her BF. Like right when we are sitting there & drinking or chatting and chilling, she'd be on the phone constantly & when we confronted, her response was: friends are momentary; boyfriends last longer; he'll always be more important. \n\nHAHAH", "label": 1}
{"text": "Huh? I’ve never thought about it like that before. Thanks for saying that you taught me something today.", "label": 1}
{"text": "I actually feel so validated by your words... I'm very thankful for being not the only one bothered by this.", "label": 1}
{"text": "Yep. Don't tell anyone and go on vacation or sick leave. Most importantly don't tell anyone. Sometimes even people you think you can trust.", "label": 1}
{"text": "Luckily I live in a place that currently allows it. If I didn't have the ability to travel to get one or order pills online or get an illegal one I would unalive myself.", "label": 1}
{"text": "This might be an overcautious warning, but If you live in one of the states that is prosecuting women for seeking abortion care be careful answering this prompt. \n\nIf you're in a blue state please vote on Tuesday. Federal law supercedes state law so even if abortion rights are protected in your state constitution this election impacts you.", "label": 1}
{"text": "This is such a huge thing! I'm so glad you said it, and said it well. It describes how I feel also. I'm a firm believer that love without intimacy isn't anything less than love that is. I also believe that your soulmate doesn't have to be someone you are intimate with. Platonic soulmates are real.", "label": 1}
{"text": "I don't think anyone has said it, but we see it everywhere: magazines, advertisements, fiction books, TV shows etc.", "label": 1}
{"text": "Come on over to Illinois! We even allow folks to use Medicaid to pay for abortion.", "label": 1}
{"text": "For me the most confusing unwritten rule is the one that goes:", "label": 1}
{"text": "Yea the whole love-me-and-only me thing is soooo dumb. That's just not how the world works for most people and that level of fantasy thinking is just bound to lead to heartbreak. I can't imagine wanting someone to deaden themselves to an emotional experience of the rest of the world in order to prop up my own sick fantasy of being obsessed over with stalker-like intensity. Not only is it near impossible it's undesirable to anyone with a conscience.", "label": 1}
{"text": "gosh darnit i almost had one😔", "label": 1}
{"text": "I am way past the age to worry about abortion but i have already discussed with my two \"nieces\" in red states who know that \"vacation\" to come see me is always on the table and with my money.", "label": 1}
{"text": "I agree. It's because some people use the word \"respect\" to mean \"treat me like an authority fogure\" and some use the word respect to mean \"treat me with human decency\", and the ones who demand respect are actually asking you to treat them like an authority and in exchange they'll treat you like a human being (if you're lucky). It's bull shi", "label": 1}
{"text": "Completely agree. While I'm not asexual, I've had a dead bedroom for a few years now for reasons. When I finally took the pressure off myself to be having the level of sex Society claims proves you love your spouse, I realized that our relationship is still very loving without weekly sex sessions. Yes, I want to work on whatever is stopping us from physical intimacy, but not because I feel I _need_ sex to be romantic or feel connected.\n\nIt's something that's difficult to talk about because in everyone's mind, if you're in a relationship and not having sex, you can't really be in love. But no, I assure you I love my partner very much and they are my best friend, and if I never have sex again, it's far from the worst thing that could happen to me in our relationship.", "label": 1}
{"text": "Or for that matter, any expected choice at a wedding. It's your wedding, people should be there to celebrate the way you like. If the wedding is boring by your standards, just go home early, but at least show up and be happy for the couple.\n\nThe weird judgement of one of the happiest days of two peoples lives is just so irritating to me.\n\n\nWe had a pancake breakfast for dinner at our wedding and people complained we weren't having a \"proper dinner\". I mean, you can eat pancakes and eggs at 6pm one day of your life. When it's your wedding, have the five course meal.", "label": 1}
{"text": "It’s really really odd to me. Even just practically for me, There’s no way in hell I’m paying thousands of dollars everyone else to get sloshed for one evening that they won’t end up remembering, when that money could be used towards a honeymoon. God forbid you can’t have wine with your dinner for one evening. Don’t come! If what I do at *my wedding* is an inconvenience to you, sounds like it’s not my problem. RSVP No 🥲", "label": 1}
{"text": "Pancake breakfast dinner sounds AMAZING!\n\nAgreed though. I suppose wedding shave become a spectacle for other people but I’ll stay selfish and say, if I’m coordinating a big day that costs a ton of money it damn will be what my man and I want. Went to a wedding last year where the bridge baked her own little cupcakes for the reception and had a candy bar. Some people were bagging on it and I was like… are you not literally eating the cupcakes and candy she was so kind as to make and provide?? What is the issue here", "label": 1}
{"text": "Just wanted to Point out for those in an illegal abortion State, that they Plan/started to Track cell phone locations and want to use them in the Future.", "label": 1}
{"text": "Yep! It's more and more popular to not even have dinner or a bar at all. Some weddings I've gone to have been a candy bar only, and from 1-5pm so no food had to be served and it was too early for booze. The best wedding I ever went to was just at a campsite and everyone got to stay overnight and sit around a bon fire. It was BYOB. \n\nWeddings are super expensive these days and sometimes people just wanna tie the knot without having to spend their life savings. I go to weddings because I'm thrilled for the couple. If I don't like the couple that much enough to spend their big day with them, I don't RSVP (unless it's an obligation like family). Everyone should be happy at a wedding.\n\n\nAnd yes, the pancake breakfast dinner was perfect.", "label": 1}
{"text": "That's not a good sign. That isn't an inherent quality of relationships and friendships", "label": 1}
{"text": "Haha my best friend is totally like this. Very distant towards men she is interested in, but extremely cordial towards friends.\n\nShe's also extremely shy, so there is probably some correlation there", "label": 1}
{"text": "Exactly", "label": 1}
{"text": "Fly to Washington state.", "label": 1}
{"text": "Uh just get an iud?", "label": 1}
{"text": "Fyi Mexico legalized abortions and it's probably harder to get information from them sooooo do with that info what you'd like", "label": 1}
{"text": "I added a pink case and a pink keyboard. 🩷🩷", "label": 1}
{"text": "I’d be more worried about a wanted pregnancy not going perfectly.", "label": 1}
{"text": "That one is written rule", "label": 1}
{"text": "It's the birth announcement in the papers and to go on the birth certificate.", "label": 1}
{"text": "Okay, but why is it a public announcement to all your friends? I get that it is needed for paperwork, just seems like an odd thing to have to post on social media, etc. It's harmless information, but it's not really something everyone cares about, or do they?", "label": 1}
{"text": "I agree it’s weird", "label": 1}
{"text": "Never have. Never will.", "label": 1}
{"text": "Yes, some people take this really far, and have no friends other than their spouse. Like, if you can find 1 person to relate to in this world so closely that you live together, and are choosing to spend your life together, surely you can find 1 other person who you enjoy as well.", "label": 1}
{"text": "All my family knows I will take them on a weekend jaunt to see a show or go camping or sightseeing in whatever state suits their fancy.", "label": 1}
{"text": "This is technically not unwritten, but.... separate bathrooms for men and women. I hate having a sign on a door tell me what to do.", "label": 1}
{"text": "they are a blank piece of personality paper and have no history yet.. so these basic stats at least tell you how much they (may) have made their mom suffer 😂", "label": 1}
{"text": "i live knowing that I won’t be bothered by a man when I am standing there to wash some stupid stain out of mu skirt… all hiked up!", "label": 1}
{"text": "Has anyone traveled to Canada to do it? Not only is it legal, their health care costs (even out of pocket for non-residents) are so much less than in the US.", "label": 1}
{"text": "If you don't want booze or don't want to pay for it, screw anyone who says anything.\n\nBuuuuut you should probably inform on the invite. Gift cost is often/usually based on guestimated plate cost. Things like cash or open bar are important to know. Also something as simple as knowing if our need cash at all for those that don't usually carry.", "label": 1}
{"text": "I don’t like when it’s given to others as like an unwritten rule to follow for the sake of it. But I do think it might be natural for someone to want to spend time making sure the person they want to have sex with is capable of carrying and being everything they want out of someone they have sex with. Like if I’m getting naked with someone, I HAVE to be emotionally naked, and I’ve got to trust this person likes and understands that part in order for me to let go. I think some people just genuinely take time to feel the level of trust they need to feel and maybe that looks like “making the guy wait.” But again, totally agree the intention of making someone wait is a shitty unwritten rule some follow.", "label": 1}
{"text": "Oh yeah of course! I agree, it's about taking however much time you genuinely want to. My issue is there's an unwritten rule that as a woman you should \"make them wait\"\n\nSometimes I know relatively quickly from meeting someone if I want to have sex with them but because of this I'll wait so I'm not judged for putting out too soon", "label": 1}
{"text": "Oh yeah sometimes things do just click and it’s a shame how that unwritten rule can get into ones head !", "label": 1}
{"text": "13 states right?", "label": 1}
{"text": "I've never heard of this, but I think I've experienced...I'm not getting texts back from people I know are crushing on me because they want me to like them?? That's so counterproductive and off-putting", "label": 1}
{"text": "Whoever said WIC… I hope they realize it gives you $20-40 worth of food a month. That’s not gonna pay your rent, your bills, etc. it’s just a small amount of supplemental nutrition.", "label": 1}
{"text": "Tell us about the steak!", "label": 1}
{"text": "Welp. I live in Mexico and can get misoprostol over the counter and come back home to the US to visit one weekend a month so I guess if you need something, holla atcha girl.", "label": 1}
{"text": "Ofc, no doubt that overweight people regardless of gender face more harsh treatment, however the societal aesthetic standards for women in Western culture are so much more cruel than the standards men face so unfortunately they deal with more in that reguard.", "label": 1}
{"text": "I'm moving to Colorado in January (from Texas). If anyone wants to go *camping*, I will have a bed for when you're done *camping* so you can rest before heading home.", "label": 1}
{"text": "I feel like “respect your elders” is meant mostly for children to mind their manners with adults, not talk to them like they’re talking to a friend. I may be wrong but I feel like, as an adult, I don’t want to hear somebody’s kid be rude or snippy or in general ugly to me or any other adult, it’s off-putting.", "label": 1}
{"text": "As a very tall woman, I've never dated, or really even encountered, a man that was taller than me. They're all either my height or shorter. I know men can be really insecure about their height, but tbh that's never gotten in the way of a relationship for me. I think the people who actually care are just a loud minority.", "label": 1}
{"text": "I don't miss any of my ex boyfriends any more, but there are some ex friends that I haven't spoken to in years that still really hurt when I think about them.", "label": 1}
{"text": "Even in a state where abortion is inaccessible if your less than 13 weeks you can get an abortion with pills and do it at home. They will ship to you discreetly. This is legal and you will not get in trouble. There’s plenty of different sites but my favorite has been aid access it’s $150. and if you can’t afford it just let them know through email.", "label": 1}
{"text": "I get that!", "label": 1}
{"text": "But they shouldn't be rude or snippy to other kids either. To me, respect your elders doesn't make sense because it should just be \"respect others\".", "label": 1}
{"text": "Fair enough, I really really can’t stand children that are allowed to be awful to others. I realize that’s a parenting issue, most likely.", "label": 1}
{"text": "I am someone who believes in this rule. I want to understand why you find it problematic. My perspective was, I am the person who is going to spend most time with my partner and the one going to face all the consequences of my partners choices along with him. Where as his friends even though important would hardly be 10% of his life. So I was broken when my ex said I am equal to his friends. Why do you think it's not ok to prioritise me over his friends?", "label": 1}
{"text": "This is just perpetuated by management so they don't have strikes on their hands when people realize they could work there for 20 years and still get paid peanuts. I recently saw a store manager job listing that paid $20/hr at most (that's in CND, the minimum wage here is $15).\n\nI have a friend who's been working lot at Home Depot for 15 years and he's only being paid like $17/hr.", "label": 1}
{"text": "Schadenfreude's basic definition is that of taking joy in another person's suffering. As such, it is not mutually exclusive with *participating* in someone else's comeuppance.", "label": 1}
{"text": "I feel like there are differences. A one and done \"Hey, love that shirt\" that doesnt ne essary prompt further conversation and with no contact? Yeah, I would put money on it's just being friendly. \n\nThere are totally things that could make it flirting, if she tocuhes you in a way that wasn't just to initially get you attention, if she's locking eyes with you and not at all at the shirt she supposedly likes, if there's real lingering as in she's fishing for a conversation out of it, or it's too specific/personal for it to be something you would compliment someone for. All of these are just examples that, to my thinking, would tilt it more toward probable flirting. \n\nAnd I didn't mean to suggest that no compliment is ever flirting. But when I just give one as in the first paragraph, yeah... that's not me flirting...", "label": 1}
{"text": "Watched rival fail at karaoke; sang backup, poorly on purpose", "label": 1}
{"text": "If by that, you mean that all revenge contains within it some element pleasure at witnessing another’s suffering, then yes that’s true. But the two are certainly not synonyms, nor does schadenfreude imply that the one who experiences is also responsible for said suffering. \nThere is, of course, an obverse word in German as well: freudenschade -a feeling of suffering caused by another’s good fortune. Like revenge with schadenfreude, the simple temptation is to equate freudenschade with either envy or jealousy -and again misses.", "label": 1}
{"text": "I’m sorry but I just love this", "label": 1}
{"text": "As someone who never sneezes just once, I agree! \n\nI wish we would just ignore *all* involuntary body noises! Don't make them on purpose and try to excuse yourself to do it privately whenever possible... but if a sneeze or a belch or a fart or a stomach rumble or a joint crack or any other noise just *happens*, then no one needs to do anything. No \"excuse me\", no \"bless you\", no NOTHING.", "label": 1}
{"text": "Gold and royal blue.", "label": 1}
{"text": "And that this only goes for women.", "label": 1}
{"text": "This is a marketing survey hidden as a reddit question, go somewhere else", "label": 1}
{"text": "I'll tell you though, I went to a dry wedding and it suuuucked. 😅 I would never dream of not going because of that, and I would have happily paid if there was a cash bar, but there wasn't even the option. We're sitting there drinking sweet juice through the meal like it's a kid's birthday party lol it felt so weird and underwhelming. I'm not saying I was looking to get smashed, but wine on the tables and maybe a cocktail beforehand when you're waiting around would have elevated things significantly. \n\nIt's your wedding and you're right, you don't have to include anything you don't want to, but the reality is that alcohol is so ingrained in our (western) society for celebrations and socializing. Open bar is by no means a must, but generally, the lack of at least the ability to buy a drink at an event where it would normally be available is a bit jarring. \n\nI'm not vegetarian but I'm including a vegetarian meal option at my wedding. I don't eat sweets, but I'm providing desserts. This is purely for the enjoyment of the people I've *chosen* to invite and celebrate with me. They've taken time out of their lives to dress up and celebrate me and my fiance, in many cases they've travelled and spent money to be here, and I want them to enjoy themselves.", "label": 1}
{"text": "A lot of people don’t enjoy going to weddings, but know that if they don’t attend they might slight the couple. Things like good food and having drinks help to make weddings more enjoyable to sit through and make it feel like less of a chore to go to.", "label": 1}
{"text": "No one likes bratty kids, that has nothing to do with respecting your elders. \n\nLet's be real, respect your elders means \"listen to me and treat me nicely because I managed to not die, but I don't have to do the same for you\", which is stupid. Just because you're older doesn't mean you're a good person entitled to my respect.", "label": 1}
{"text": "It's just how humans see faces. We are hardwired to react differently to different expressions and most have different interpretations of 'neutral,' so this matter will likely never be resolved", "label": 1}
{"text": ">would hardly be 10% of his life\n\nI feel like you have unrealistic expectations around friendship. Some friends are family, and some family are friends, to think they’re only going to be around 10% of the time is too low. \n\nI think in a romantic relationship, you should prioritize your partner, but I also agree that the love we hold for our friends is just as great/important. It’s just a different kind of love. The love I have for my partner is not the same as the love I have for my kids. I’m someone who prioritizes my kids, some people believe you need to prioritize your partner over kids. Find the person who aligns with *you*.", "label": 1}
{"text": "I too think about the glory of Rome on a daily basis. Roma Victrix!", "label": 1}
{"text": "Who hurt you lol", "label": 1}
{"text": "Keep it. You did an adult act, you have an adult consequence.  And for any woman coming after me. She did not specify a child or a victim.  So I am taking it as you make a choice to sleep with a man on the first date and now you regret it. Or you cheated and got pregnant. Take responsibility for your actions.", "label": 1}
{"text": "Yes, but the comment was about fat men vs fat woman, and the next person double down in the wrong direction saying fat women vs fit women, so the following comment showed that that is not a gender specific issues, this are on both sides and cancel each other out. \n\nAlso, my group of guys we all give each other shit for being fat. Most guys I know just handle it better because traditional expectations are to provide and work, and guys can still make money doing that, and traditional expectations for women is their aesthetic appeal and physical appearance is what that is scaled on. What a guy looks like is less important than what he makes, what a girl looks like is more important that what she makes in the a traditional mindset that underlies our current societal norms.\n\nAnd even with that, there are always jobs that pay a lot that women won’t be attracted to someone with, and there is someone who is attracted to every single body type, color, and shape. What is main stream accepted is because it’s a generic average that most people can find attractive, and when selling anything for cosmetics(clothes, makeup, name), is all about marketing to the largest audience. \n\nI know guys who pretty much only date bigger gals, but not a single one of them will say Shakira or J.Lo isn’t attractive. \n\nI think I went way off on a tangent here, sorry.", "label": 1}
{"text": "Sounds perfect to me as I like both small and big boobs equally, I would dedicate my life researching which nip is the most sensitive one", "label": 1}
{"text": "I am blessed to live in a state where it is legal. If I did not, I would jump in the car and drive to a state where it is. If it becomes federally illegal, I’m getting out the credit card, getting my passport, and hopping on a plane to a country where it’s legal. I don’t care how much it costs. It’ll be far cheaper than giving birth to and raising a child with severe birth defects.", "label": 1}
{"text": "How does the band size affect the cup size, as far as determining how big it is?", "label": 1}
{"text": "Too much interest at once is like going on a first date with a wedding ring. A little mystery never hurt anyone!", "label": 1}
{"text": "Accidentally snatched last cupcake at meeting; watched jealous glares unfold", "label": 1}
{"text": "Black, because my bank account can't afford more colors", "label": 1}
{"text": "Don't get pregnant unless you're trying to conceive.", "label": 1}
{"text": "Being yourself is of course the most important thing. You have to make sure that whoever you end up with likes you for you, and knows who you truly are. \n\nOther ways you can show your interest without seeming desperate is 1. Be comfortable and confident in yourself, if you say you are an interesting guy, try not to overthink it too much. \n\n2. When you communicate, try to show point 1 organically (comfortable body language etc), don’t put on a show\n\n3. When communicating, be there. Listen to what they say, and show that you are listening. Eye contact, and questions. Make them feel heard. Remember what they say. Show them you enjoy talking to them and like your convos\n\n- there are many guys I ended up interested in due to 1 good convo of them being mentally present and caring about me, it really leaves an impact.\n\n4. If they don’t seem interested, don’t push it. Accept it, know that it likely has nothing to do with you, and don’t waste your time\n\nDon’t mute yourself for anyone you would ever want to like you, over time you won’t even like yourself. Brain decided to stop here lol sorry, but that’s the gist of it", "label": 1}
{"text": "I stay inside my house and avoid contacting anyone until I can move on.", "label": 1}
{"text": "Literally just described me, I swear all of the women in ym area that I know's type is the opposite of me, yet multiple comments on the internet by people who I will probably never meet in my life describe me under this.. this is actually beginning to get annoying lmao.", "label": 1}
{"text": "Well said!", "label": 1}
{"text": "literally me", "label": 1}
{"text": "Literally descirbed me.", "label": 1}
{"text": "Exactly my thought!!!!", "label": 1}
{"text": "Literally described me.", "label": 1}
{"text": "i'm a bit lazy and more than \"a bit\" weird\n\nrest is me 🙋‍♂️", "label": 1}
{"text": "Honestly depends on how it’s broached. I totally talk way more than the average person and my boyfriend telling me about it here and there has actually helped me be more aware, I’m glad he did. \n\nAlso if you’re with a person who is quieter than you, they may find your talking overstimulating sometimes when it’s time to relax. Just different strokes for different folks. These broads in the replies will tell you to leave him asap but they’re all usually single and/or unhappy. There’s things about our partners that bother us and it’s okay to express them I think! As long as it’s done respectfully.", "label": 1}
{"text": "you nailed this description. exactly my type.", "label": 1}
{"text": "I will not budge on laziness I am not going to nag at you to be an adult and take care of yourself or do good things for urself it is mad ugly to tell an adult man he should do something that would objectively make his life better AND whenever I talk to a guy and I’m like “ you should pick up your old hobby again,” “you should get into the habit of doing dishes right after you eat so they don’t sit around all day,” “you should invest a bit” whatever, and he just fucking does it like it’s not an argument 1) I feel a million times more respected and listened to and 2) I do not feel like he’s such a child \n\n\nChange", "label": 1}
{"text": "Why is this so accurate 😳", "label": 1}
{"text": "This. There are people in my life that I love but sometimes just talk too much. I don't blame them, they just get lost in a topic.", "label": 1}
{"text": "And I’m totally that person haha. I used to get offended or defensive at the thought but now I understand it’s overwhelming to people", "label": 1}
{"text": "when i said a bit lazy i meant, i tend to study in bed rather than walking to my desk, type of laziness and i am willing to work on it, regardless of your interpretation\n\ni still got a 70 out of 100 in constitution so i don't think my laziness affects me that much", "label": 1}
{"text": "You just found me", "label": 1}
{"text": "Lol I wish", "label": 1}
{"text": "Then chick you dm", "label": 1}
{"text": "Ugh I don’t get you guys!!! These type of men make me wanna throw up lmao", "label": 1}
{"text": "Send them my way babe", "label": 1}
{"text": "More people need your growth mindset!!", "label": 1}
{"text": "I’m also in my late 30’s and am incredibly self aware. My partner has never said I talk too much, but honestly I do. In my relationship with him I have come to understand how overcommunication affects him. If he did say I talk too much I’d totally understand and I’d want to know how we could work together so I felt heard and he didn’t feel overwhelmed. Obviously this is an observation in the context of a long term relationship, but I’d treat it the same way had he shared that on the beginning.", "label": 1}
{"text": "Why are you guys Insane like do not tolerate someone being rude to you this is BASIC STUFF", "label": 1}
{"text": "That’s a pretty aggressive reaction. Throw up? They might not be your type but to say it “makes me want to throw up” sounds extreme. It’s kinder to say that are simply not your type. I am pointing out that type of description you are using is cruel and in a way shaming of men who are different. Please be kinder to different types of men.", "label": 1}
{"text": "The roman emperor?", "label": 1}
{"text": "Me me me here :3 btw are u dom? Im a slightly fem boy, but i dont like dom girls, is that weird?", "label": 1}
{"text": "As a straight woman attracted to masculine men, “femboy” vibe genuinely grosses me out. Obviously plenty of women are attracted to them - don’t think anyone will lose sleep over my statement.", "label": 1}
{"text": "Ikr! So rude, macho hyper masculine men are a huge turn off but I would never say it. Femboys and submissive men need love too", "label": 1}
{"text": "Whatever you like is fine", "label": 1}
{"text": "What is a conservative looking man to you? When I picture a conservative man it's duck dynasty guys.", "label": 1}
{"text": "Honest question - for women who find this a potential problem (age 18+). I’m truly curious. \n\n- why do you choose to live in a state that restricts abortion to whatever degree they do? \n\n-are you more active in voting in your state & local elections now?\n\nOne perceptive (and currently mine) is that as an adult, this is ok. I should choose to live in a state that reflects my view points on a majority of beliefs. I actively research and vote during state elections and community elections as well. \n\nIf I impregnate someone, I would also want said individual and I to come to a conclusion together whether we keep it or not. It took two to make it, it is unfortunately a possibility of having sex, it should take two to make that decision. I say that to add a caveat as well, if a women’s health is affected by the birth (life or death) they should have 100% autonomy to make whatever choice they want. \n\nI also believe if rape happens the women should have 100% choice of abortion no matter the state. Whenever I express this viewpoint, the only argument I’ve been met with is “it’s my body, my choice”. Which I understand that view point but I also understand anatomy and biology. Women are the only gender that can carry a child to term. That’s just life. If you can’t reproduce without a male, why would a male not be in the decision making process if the woman is healthy and it was consensual from both parties?", "label": 1}
{"text": "I read a statistic that 80% of white men are conservative. So just look like a dude and you'll find someone into you.", "label": 1}
{"text": "Unfortunately not into white men but interesting statistic", "label": 1}
{"text": "The wisest answer.", "label": 1}
{"text": "Literally me", "label": 1}
{"text": "I don't think it's necessarily that bad. \n\n\nPew (very high standards for polling) has had it at just around 58%-62% for the past 3 decades (currently it's 60/39).\n\n\nOnce you take into consideration education levels, things change a bit, but not insanely so (last poll had 64% of white uneducated men as conservative and 53%/45% of educate white men are conservative vs liberal)", "label": 1}
{"text": "Hello /u/Hour-Chemistry9206. Your submission has been removed because your title does not include a question mark. Please See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and ensure your question is a good fit here, and your title is properly formatted to be a descriptive, open-ended question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*", "label": 1}
{"text": "You're on birth control.", "label": 1}
{"text": "I'm not", "label": 1}
{"text": "I don’t have one, strangely. I’m divorcing my husband who I was with for 15 years and he’s the polar opposite in every sense to a man I recently met who I found very drawn to. I can tell you my turn offs but different types have different ways that I’m drawn to.", "label": 1}
{"text": "Yes, I can totally relate. I want a connection with someone that is strong and will last. Looks, height, material things, not really important. Be good to me, the people around you, and yourself. 💜", "label": 1}
{"text": "Realllll 🙏🏽", "label": 1}
{"text": "Cut them off", "label": 1}
{"text": "Just go to the next name on the list then?", "label": 1}
{"text": "Sometimes. Harder if you’re autistic or something", "label": 1}
{"text": "Uncircumcised is interesting and quite specific lol any particular reason? (Asking as a hooded fellow)", "label": 1}
{"text": "Damn, not fat dudes with confiedence ?", "label": 1}
{"text": "My dream but no one where im from femboys lol", "label": 1}
{"text": "We had me until beard lol.", "label": 1}
{"text": "Sounds like my coffee order, but taller and fuzzier.", "label": 1}
{"text": "Tall, dark, and Reads-the-Instructions Man for the win.", "label": 1}
{"text": "I am so scared by the amount of people saying they would travel, it may prompt for travel bans or for women to go through some sort of process to leave their state. Could you imagine to leave and come, you'd have to take a pregnancy test... and if you leave pregnant and come back not pregnant, then you could face charges? It really is such a slippery slope when you revoke rights, very dystopian to even have this conversation ", "label": 1}
{"text": "That was really well said", "label": 1}
{"text": "The pressure to always wear makeup — I love going bare-faced.", "label": 1}
{"text": "Indicating interest is NOT the same as showing too much affection.", "label": 1}
{"text": "After my second", "label": 1}
{"text": "Realize he was right", "label": 1}
{"text": "Spa day including a Brazilian and a douche.", "label": 1}
{"text": "There are women who might consider carrying the pregnancy to term and exploring adoption, although this is a deeply personal choice and depends on individual circumstances.", "label": 1}
{"text": "Several reasons. I have a messy family and can't be bothered with the drama and feeling like I'm not even sure if I should have invited this or that person. Also the ceremony itself is a bit cringe for me (I can't explain why). I also think it's just not necessary - call it fear but I like to feel free to flee whenever things go bad and I really don't want court procedures and all that crap in my life. I'm just not too keen on the whole union thing, I love being my own person", "label": 1}
{"text": "It also helps with regards to taxes and passing on benefits after death etc. It's definitely an outdated system but there are still some benefits if you're part of a couple.", "label": 1}
{"text": "It's important to find a balance between showing interest and maintaining personal space, which can promote a healthier connection", "label": 1}
{"text": "As someone who can fall in love at first sight, it can definitely be authentic, maybe not for the real you though", "label": 1}
{"text": "Strong coffee, stronger books, endless curiosity, mom’s questionable advice", "label": 1}
{"text": "It would certainly skew your perception of men who go to see you dance, that's for sure", "label": 1}
{"text": "Who knew this is exactly what I needed to read. Thank you.", "label": 1}
{"text": "Aside from body dysmorphia, people get Botox too young because it's recommended to start when you're younger so it looks more natural as you age apparently??", "label": 1}
{"text": "its funny cuz people who actually live in these areas , like indians etc who already have a brownish skin dislike it and wish to get whiter. its really interesting", "label": 1}
{"text": "It’s because historically, people with darker skin were associated as common laborers that worked outside while those with lighter skin were associated with higher classes that didn’t need to be in the sun.", "label": 1}
{"text": "No, that's not how language works. If everything a woman does is feminine that means nothing is feminine at all, which isn't the case. There are certain tasks, hobbies etc. that men and women are statistically and biologically drawn to and have been since the beginning of time. A woman could add a 'feminine touch' to something masculine but that thing would remain intrinsically masculine.", "label": 1}
{"text": "That’s why they said *traditionally* masculine. As in traits that would culturally be considered as such.", "label": 1}
{"text": "You're one of the most empathetic students I've met", "label": 1}
{"text": "Better to get rid of it that just using space n being useless", "label": 1}
{"text": "Good things take time and one should not be in hurry", "label": 1}
{"text": "This is absolutely true. The way Botox works is by keeping the muscles paralyzed and relaxed, so they don't create the visible lines on the surface of the skin.", "label": 1}
{"text": "Not even worth it. I got a brazillian once and it was ingrown city. I exfoliated, used tea tree oil, etc but none of it helped. Never again.", "label": 1}
{"text": "Writing is one thing...talking is quite the other.", "label": 1}
{"text": "Well idk who else would be bringing it up", "label": 1}
{"text": "I will still absolutely cry. Before, during, and after getting the thing done by myself.", "label": 1}
{"text": "I'm usually frown-squinting on account of photosensitive eyes, it's probably not all tough guys", "label": 1}
{"text": "Some people who aren't jaded yet, they give away love or their expression of love freely, I've always enjoyed women who were like this, I never once thought \"oh this is too much\" I appreciated the enthusiasm and the extra effort to be involved with me. I always found the \"damaged\" guarded personalities pretty unattractive.", "label": 1}
{"text": "A high school bully who told me I looked like Casper and should hit the tanning bed, ended up dying of melanoma when she was 25. guess that wasn’t worth it…", "label": 1}
{"text": "Karma at its finest...", "label": 1}
{"text": "Look who's the ghost now, eh.", "label": 1}
{"text": "hahahah", "label": 1}
{"text": "Yes. And I reject the concept.", "label": 1}
{"text": "I feel you, but also feel the urge to rant, that beauty standard on being skinny is about having a BMI of 17-18, that is not a healthy one. While Flegal's meta-analysis study found out AGES ago, that the longevity peaks at the BMI of 28-30, which suggest that slightly overweight population is actually MORE healthy. With that being said, I hate it when someone says \"yOu sHoLd lOsE wEiGhT fOr yOuR hEaLtH\". Nope, that's just about crazed standartrs", "label": 1}
{"text": "Generally, as people age, the \"overweight\" BMI actually starts to have a beneficial effect. Older people, when they start getting \"overweight\" freak out, but it's a natural and healthy part of aging.", "label": 1}
{"text": "Oh shit", "label": 1}
{"text": "Whoah", "label": 1}
{"text": "💚 living is movement", "label": 1}
{"text": "Like what?", "label": 1}
{"text": "Oh!! Yea, changes like that are often scary and uncomfortable. But it's not unusual to feel that way.", "label": 1}
{"text": "Hahahah pooping on your own at 90 is a great fitness goal truly, I’ll be stealing that one from u ❤️", "label": 1}
{"text": "r/angryupvote", "label": 1}
{"text": "Hahaha brilliant", "label": 1}
{"text": "BMI was created to measure white men, that's it. Not women, children, people of color, etc. The creator even said it was not to be used as a measure of health. \n\nGo on with your curvy self! 🩵", "label": 1}
{"text": "High school bullies are so wild. Recently ran into one of mine at a bar and she managed to make \"you're so skinny!\" sound like an insult, despite having turned into a greasy heifer herself. And I wasn't even big in high school, I've quite literally remained the same size. I still felt like shit though 😂", "label": 1}
{"text": "As an impossibly skinny (roughly the size of one ariana grande), I love telling people who comment that my size is 100% due to my medications. I'm not actually all that healthy. There have been times I've looked in the mirror and cried because I didn't feel sexy or desirable, just a good ol bag of bones lmao", "label": 1}
{"text": "Aahw it makes me feel sad that you’ve felt that way though! It sucks that your medications had that side effect and I hope you’ll find a way to not just accept but love how you look! I always tried to focus on the parts of myself I always loved when I felt insecure, whether it was my hips or my lashes or my hair, we all have some part of our body we wouldnt want to trade! Most importantly I hope you will find a way to get healthy/healthier, through whatever means fit you and whatever your situation might be ❤️", "label": 1}
{"text": "What does it mean if they dont / can not make eye contacts?", "label": 1}
{"text": "AAAAAGGGHHHH stop.it.", "label": 1}
{"text": "I've always been ghostly pale. I get terrible heatstroke and sunstroke. I just stayed pasty white anyways.\n\nA \" friend \" also said the same to me and that i should sit on the beach more. She also got melanoma...\n\nI was diagnosed with epilepsy one trigger being heatstroke. \nSooo, I'm happy I didn't listen to her.", "label": 1}
{"text": "i donate them to a family i know and it kills all the guilt", "label": 1}
{"text": "SUPPORTING TRUMP IS\nNO LONGER A POLITICAL CHOICE. \nIT IS A STATEMENT THAT YOU DON’T CARE ABOUT\nMORALITY LEGALITY, OR THE TRUTH.", "label": 1}
{"text": "Thank you for this. This is the exact content I use an ad blocker to avoid seeing.", "label": 1}
{"text": "“I wonder if the sad I’d be without you would be less than the sad that I get from being with you.” -Succession", "label": 1}
{"text": "It’s a personal preference. I get ingrown hairs, have HS, and find having body hair uncomfortable/itchy for me personally. I can assure you my middle aged vulva does not look like I child’s. I think we should celebrate women doing whatever makes us more comfortable rather than shaming each other for have different preferences.", "label": 1}
{"text": "Very dumb", "label": 1}
{"text": "Yep! Middle age dame here who loves a smooth crotch! I’m pretty on top of hygiene but the lack of hair definitely helps with any odor, itching (as you say) and I have way fewer yeast infections than I did before making the change. Plus I just like how it feels!", "label": 1}
{"text": "Some people just don’t make eye contact which is fine but sometimes you can tell people are intimidated or if they’re lying. Sometimes people who don’t like you don’t keep eye contact, I’ve had that happen.", "label": 1}
{"text": "Eyebrow antics always tell the real story", "label": 1}
{"text": "Everyone's secret eyebrow language – decoding in progress.", "label": 1}
{"text": "Tell them to go find someone that have zero opinions and brainless. Sorry; I may be salty tonight 😅", "label": 1}
{"text": "Idk about me. But I know I carry the memory of my soulmate close. She passed recently, before our love had a chance to properly blossom. We knew we were meant to be with each other, but something always got in the way. Mental illness took her from this world.. I miss her every day….", "label": 1}
{"text": "Hello /u/zippiDOTjpg. **Please read this entire message before taking action.**\n\nYour submission has been removed for containing mental health related terms or diagnostic labels.  Please do not speculate, armchair diagnose, or label other people's mental health situations; or use terms for mental health issues as judgments, slurs, or synonyms for toxic/abusive behaviour even when talking about yourself. [Click here](https://www.reddit.com/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to/) for clarification on this rule.\n\n**This is an automated action**, if you believe you received this message in error, or if you edit your comment to remove the diagnostic term(s), please [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Don't forget to include a link** to your post or comment in your message, the mod team will not reply to messages without a link for review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*", "label": 1}
{"text": "I wish we could respect each other's individual autonomy and not make thinly veiled pedophile accusations over body hair removal. A thirty year old woman doesn't look pubescent if she shaves or waxes. Women shouldn't speak this way about other women.", "label": 1}
{"text": "“Everything I've ever let go of has claw marks on it\" - David Foster Wallace", "label": 1}
{"text": "\"What is grief if not love persevering?\"", "label": 1}
{"text": "Solo player mode: surprisingly fewer arguments over pizza toppings.", "label": 1}
{"text": "I had a couple friends have really difficult births, especially during COVID and this is what they've all expressed that they found helpful:\n\n1. Check in on how're they're doing but don't flood them with texts in the first few days.\n\n2. Drop off freezer meals before the birth, a lot of them didn't want a heavy rotation of guests.\n\n3. Level set the expectation that you're excited for a visit when *they* are ready for it. \n\n4. If you do visit, feel free to ask if they need help with anything while you're there. Like watching baby while they nap or grab a shower or eat a meal with an infant attached.\n\n5. Remember to celebrate *her*. For all my friends we've had an [Insert Friend's Name]'s Favourite Things night when they're ready. And we literally just celebrate them with all the things they maybe missed during pregnancy, whether that's a specific food or drink, activity or whatever.", "label": 1}
{"text": "Girl, chill.", "label": 1}
{"text": "Lol not falling for that one again.  I will be keeping things to myself.", "label": 1}
{"text": "Holy shit that was direct.", "label": 1}
{"text": "In fairness I had tried months of subtle hints and nudges at that point and he wasn't getting it bless him. In the end I thought just outright saying \"I'm crazy about you and would like to spend tonight and many other nights naked with you\" would be more effective. \n\n\nIt was 😁", "label": 1}
{"text": "i don’t think it was necessary, i feel like you’d generally have a friendly dynamic with someone before any romantic attractions are expressed?", "label": 1}
{"text": "I met my current gf when we were children, later she was my best friend when we were both teenagers. She never told me anything, I never suspected it, time past and she had to see me get married to another woman. After almost ten years I got divorced and we resumed our friendship. I took the decision to move to another country, so I left. She still didn’t say anything. After almost two more years of living apart she decided to risk it and for the first time in her life she gave me a little hint so I decided to risk it and made a move on her. Honestly I just wanted to get laid (in my mind I was thinking that if I ruined the friendship, we will never had to see each other again anyway, living in different continents) what I was not expecting was to discover that she had had feelings for me for 27 years. She could have avoided many hard things in each other’s life if only she would have told me back then. We were super compatible as best friends and the transition to a couple was so smooth.", "label": 1}
{"text": "I would tell them. I’m with my now boyfriend of 4 years because I finally told him I had feelings after having a crush on him for 7 years. I would’ve been with him a lot sooner if I was just open and honest.", "label": 1}
{"text": "I am married and have a platonic male friend that I’m pretty sure is in love with me but won’t tell me. It’s driving me insane because I cherish his friendship so much and he’s being just plain weird. I wish he could tell me because then we could deal with it, to be honest. But I understand why he wouldn’t and I’m trying to respect his decision.", "label": 1}
{"text": "Pretty intense, no?", "label": 1}
{"text": "or grandchildren 🤠", "label": 1}
{"text": "What bodily functions do you love?", "label": 1}
{"text": "Since no context is given I’d guess you’re crushing on a friend and trying to decide to say how you feel or stay friends?\n\nIn that case how much do you care about the friendship? And what are your reservations? \n\nI’ve had friends come out to me about their interests and for some I’ve said I’m flattered but I like us as friends and they recanted that they were drinking or joking etc. others I’ve said well I like you too\n\n**But if we pursue this would friendship still be on the table if things end?**\n\nThat question always determine if we pursue it at all and if so as a hookup or as full dating. I’ve kept friends in all 4 of those scenarios and I’ve also been ghosted after they told me their feels whether I was interested or not. \nThey just got scared and removed the uncomfortable variable, me 🤷🏽‍♀️ \nthat’s the worst way to go IMO", "label": 1}
{"text": "Partypooper", "label": 1}
{"text": "Farting at the end of the yoga video when you're supposed to be getting relaxed and contemplative? \\*chef's kiss\\*", "label": 1}
{"text": "This reminded me of yesterday in yoga the girl beside me, bless her, kept farting during one pose we had to do a number of times. I forced myself to stay straight faced and act like I didn't hear cos I didn't want her to be embarrassed but I'm chuckling now", "label": 1}
{"text": "love this", "label": 1}
{"text": "Seriously it is the single least offensive thing you could do that people HAVE to forgive you for. ", "label": 1}
{"text": "I’ll attempt to give context but the comment may be removed. \nThis conversation was had between myself and a few girlfriends. One of which has been casually seeing/sleeping with a man for three months. She is beginning to develop feelings for him, but they had a conversation early on where he stated that he isn’t looking for a relationship but enjoys spending time with her and getting to know her. She was wanting input on whether or not she should be honest about the way she feels knowing that he probably only sees her as a friend, or risk losing the friendship by doing so.", "label": 1}
{"text": "My dog, but only till his next meal time", "label": 1}
{"text": "Walking is acceptable publicly and isn't humorous, usually.\n\nDoing something that is a taboo of sorts can make farting funny, sometimes.", "label": 1}
{"text": "I guess bro does not have a loving mother???????????? (I’m being dead serious as it’s not common to have a mother that would not die for her child)", "label": 1}
{"text": "Girl SAAAAME. Fart jokes are our love language. Nobody but my love knows what a goblin I really am.", "label": 1}
{"text": "I have a 7yo son, if I didn’t find it funny I would be so annoyed with him all the time.", "label": 1}
{"text": "Healthy Love that is slowly formed throughout the years, with emotional intelligence and maturity.", "label": 1}
{"text": "Wow that's true I never felt love from my mother, I found it later in life, and I agree with OP, because it is indeed intense to be aware of that emotion.", "label": 1}
{"text": "How would you describe your sense of humor? What makes you laugh? 😄", "label": 1}
{"text": "\"14 year old boy\" is an apt description of my sense of humor. \n\nI'm a 36 year old woman.", "label": 1}
{"text": "I feel that this is a needlessly rude response to this question ", "label": 1}
{"text": "I think farts is my husband’s love language.", "label": 1}
{"text": "I really appreciate clever wordplay, quick-witted responses, situational/cultural observations, dry humor, witty sarcasm employed well, existential absurdity, satire, and humor that isn't too broad strokes/obvious. Toilet humor, crass humor, pratfalls/physical injury humor, embarrassment humor, etc are just not for me. For me, humor is found in unexpected cleverness and toilet humor is rarely unexpected or clever in my experience.", "label": 1}
{"text": "Everything I have ever let go of has claw marks on it. - David Foster Wallace ❤️", "label": 1}
{"text": "100%", "label": 1}
{"text": "Not a mom but I feel the same. Kids in my life love me regardless of anything and see me as a model. It's a burden but a gift as well", "label": 1}
{"text": "100%. I get super grossed out actually and openly tell potential partners about it. If they decide to test me on it, my attraction to them severely suffers and the likelihood of me ending things in the dating phase are pretty high. It's funny how many people think it's a challenge to gross me out when I am so open about the consequences of that. (Obviously if someone has a bodily function, whatever, that's natural – but I don't find it funny, nor exaggerations of it for the sake of bothering me).", "label": 1}
{"text": "I'm moving soon, got a huge work bonus, and contemplating donating everything and starting fresh. I'd love to get insights on your favorites/what you would start with?", "label": 1}
{"text": "I’m not bothered by stuff like this", "label": 1}
{"text": "When you’re not fed love on a silver spoon, you learn to lick it off of knives.", "label": 1}
{"text": "Absolutely. For me a sign people take themselves waaaaaaay to serious and are not worth my time 😂 life philosophy right here", "label": 1}
{"text": "We are all just walking each other home.\n\n- Ram Dass", "label": 1}
{"text": "I’m the opposite. I don’t understand how any adult finds it entertaining. A 10 year old boy? Ok, I get it. Otherwise no", "label": 1}
{"text": "And the love I have for myself and my femininity after having a child! I did not know the true essence of womanhood until I was surrounded with my mother, my sister, my aunts, my female cousins, and their daughters in the early days after birth. I was sitting in a comfy chair, breastfeeding openly (can’t really be discreet in those early days while you’re figuring it out) and these beautiful women were around me, speaking of their experiences and encouraging me. My cousin’s toddler at the time came up to me and was intrigued and asked what I was doing, and it was a beautiful moment listening to my cousin explain to her how I was feeding my baby with my body. I still remember that day so vividly years later because it was the deepest connection of womanhood I had experienced before. We truly are connected, and I was very grateful to have that.", "label": 1}
{"text": "I have had a similar thing happen, only it was before we got to Dad’s room and I was the guilty party. Got a high 5 from Dad (he was fighting cancer) for the effort. It broke the tension on what was a very stressful time.", "label": 1}
{"text": "You took the words right out of my keyboard!", "label": 1}
{"text": "Mine too!", "label": 1}
{"text": "I'm wondering if any of the people who find it offensive or upsetting ever have sex at all, or if they just get turned off and cancel everything the moment someone farts and chuckles it off (like most would do). \n\nThe act can be chock-full of fart sounds, whether they're actual farts, queefs, or just sweaty bodies slapping against eachother. I'd hate to try to be intimate with someone when so much as a toot could turn me off lmao.", "label": 1}
{"text": "**Please read this entire message before taking action.**\n\nDerailing the topic is not permitted. Derailing includes but is not limited to: \n\n* Changing the topic from OP's question\n\n* Leaving a top-level comment when you're not the target demographic\n\n* Giving unsolicited advice\n\n* Making someone else's response about yourself. If you'd like to share your experience in response to the OP's question, do so in a top-level comment.\n\n* Asking unrelated follow-up questions\n\n* Branching into unrelated topics\n\n* \"What-about\"-ism\n\n* Trying to start arguments, or debates\n\n* Judging or rating other responses\n\n* Meta comments about other responses, such as \"same!\" or \"this!\"\n\n* Gifs, images, emojis or other media in place text\n\n* Sharing links without a summary \n\n* Responding to comments to tell us how your dick feels. No one cares.\n\nFor more information, please [click here](https://www.reddit.com/r/AskWomen/wiki/rules#wiki_no_derailing).\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately.\n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "Oh ok! It’s a situationship question -I’ve been on the other side of it\n\nI’ve had a couple guys fall for me when we were just casual/ hooking up \n\nIt’s never ruined a situationship for me -2 couldn’t handle the rejection to continue casual , one changed his mind completely of wanting to date intentionally and not do casual anymore so had nothing to do with me\n\nIf she can survive rejection I’d tell her to go for it- you never know if it’s your forever love and if not then there’s other sleeping situationships possible or intentional dating options", "label": 1}
{"text": "I think I peed a little", "label": 1}
{"text": "lol sameee it’s probably why I get along well with his friends 🤣🤣", "label": 1}
{"text": "YES! The man who loves me knows I am a classic kind of gal and don't do costume jewelry (which I consider lab grown diamonds to be).", "label": 1}
{"text": "Only experts can tell the difference, and even then, it's because lab grown ones are perfect and natural ones have flaws. \n\nPay more for a less ethical and worse product, for the bragging rights of being able to say you were rich enough to do so. Frankly there are more fun ways of proving you are a fool who deserves to be parted from their fortune.", "label": 1}
{"text": "When I find a wife, I'd like our rings to have each other's birth stones. I'll have mine updated to add stones for our kids if we have any.", "label": 1}
{"text": "Was raised with it.", "label": 1}
{"text": "Love it, keeps the laughs and bellies rolling.", "label": 1}
{"text": "You don’t get how air being forcefully pushed out of your booty hole and making the silliest noise possible, would be funny?", "label": 1}
{"text": "This is amazing lol. \n\nI have 3 brothers, a husband, and 2 sons. If I didn't appreciate fart humor I don't know what I'd do 😂", "label": 1}
{"text": "Tiny couch, huge possibilities – room for more snacks.", "label": 1}
{"text": "Meal prep: the ultimate new mom superhero cape.", "label": 1}
{"text": "Solo level expert — Achievement unlocked. Whats your next quest?", "label": 1}
{"text": "Haha, made me laugh-snort!", "label": 1}
{"text": "The silliest noise possible would be louder, noises aren't funny unless a mic is clipping", "label": 1}
{"text": "Wtf does this mean?", "label": 1}
{"text": "^ wife material right here men take notes", "label": 1}
{"text": "Sex is simply 100% better for the woman with a toy\n\nmen to need to realize the vibrator is their friend, not their enemy \n\na guy who understands that knows how to please a wiman", "label": 1}
{"text": "I did that to a girl and she was 🤩", "label": 1}
{"text": "I’m dyslexic. I read ‘what are your thoughts on used sex toys’ and I SPRINTED to the comments only to realize I may have misread the title.", "label": 1}
{"text": "I agree with this.", "label": 1}
{"text": "A toy on your ass or ass playing while using a toy on your vagina?", "label": 1}
{"text": "A toy in my ass while I'm having sex is the best", "label": 1}
{"text": "Agree. Jewelled butt plugs are very cute (and if you are a bit self conscious about how your anus looks, its a fun way of covering up the ol' chocolate starfish.", "label": 1}
{"text": "What kind of toys, special ‘ass toys’?", "label": 1}
{"text": "Sorry but why the fuck are you creeping around here asking those kinds of questions? Why do you need to know that?", "label": 1}
{"text": "Vibrating butt plugs are the best lol", "label": 1}
{"text": "Vibrating butt plugs? The best feeling when I'm inside her.", "label": 1}
{"text": "Totally agree, variety is the spice of life.", "label": 1}
{"text": "the use of needles is absolutely normal, it is a personal preference of people and it is individual. For me, this is the order of the day", "label": 1}
{"text": "Because I myself like it when a woman uses toys, so I ask becaus I can try this stuff with my partner. What are you meddling with..", "label": 1}
{"text": "Thnx for your response, some people think I creep around with just asking questions.", "label": 1}
{"text": "Stop being such a people pleaser and stop letting people (your husband included) walk all over you", "label": 1}
{"text": "Ugh I aspire to be like this but I struggle. How do you do it without hurting anyone’s feelings? I’m afraid if I’m too blunt about my opinions that she’ll start distancing herself from me for thinking I’m judging her", "label": 1}
{"text": "Investing in a guilt-free, wallet-emptying wardrobe, huh? Nice.", "label": 1}
{"text": "At some point it gets tiring trying to give these types of people advice. Ima be honest i had a friend that was delulu like that and i blocked her. I kicked her out of my life cuz I don’t have the energy for this…lmao", "label": 1}
{"text": "We're a group of 3. The 3rd has completely washed her hands of this shit. I don't know why in hell I continue entertaining it. It's so frustrating!!!", "label": 1}
{"text": " insecure? Not really .", "label": 1}
{"text": "What other reason would someone not want to use them if it would enhance pleasure ?", "label": 1}
{"text": "Not up to you, buddy", "label": 1}
{"text": "I recently got into assplay with my gf and it definitely does intensify the O. Still very new to assplay. What are some do’s and dont’s of assplay? Thanks in advance.", "label": 1}
{"text": "Yes, agreed!", "label": 1}
{"text": "I would be interested to know the answer, too. Sending you love ❤️", "label": 1}
{"text": "I’m sorry you’re going through this. Healing from sexual trauma and relearning to feel safe and positive about intimacy can be a complex and deeply personal journey, and it’s entirely natural to struggle with this. Many people find that they need time, understanding, and a sense of control over their own pace to rebuild a healthy relationship with intimacy. Therapy, especially with professionals who specialize in trauma or sex therapy, can be a supportive space for working through these feelings. Some people also find that focusing on self-compassion, setting boundaries, and gradually reconnecting with their own body in non-sexual ways helps them feel more in control and at ease. Remember, there’s no right timeline, and it’s okay to take things slowly—your comfort and healing are what matter most.", "label": 1}
{"text": "You're brilliant, thank you, I was after some practical steps like that.\n\nI had actually thought about self defense classes, might help with inner confidence", "label": 1}
{"text": "I wanna say this to a friend as well", "label": 1}
{"text": "I feel this, except there seems to be reciprocity in all of her relationships except ours? Totally takes our history for granted and probably hasn’t even noticed I’ve stopped calling. Fortunately, I have other (better) besties, so I’m quite happy to let this relationship just fizzle out.", "label": 1}
{"text": "**Please read this entire message before taking action.**\n\nThis comment or post has been removed for containing gendered slurs that do not meet the [gendered slurs guidelines](https://www.reddit.com/r/askwomen/w/genderedslurs) for /r/AskWomen. If you edit to meet these guidelines, please let us know and your item can be reviewed for reinstatement.\n\nGendered slurs are not permitted unless they are part of a quote, being used in a discussion of the term itself, to refer to the actual body part referenced, or as part of a specific set of irreplaceable common terms. For more detail, review the linked guidelines.\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) and [CLICK HERE to contact the moderation team](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). **Please include a link** to your comment in your message, the mod team will not reply to messages without a link for review.  DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)", "label": 1}
{"text": "Dance it out in socks, slide like a funky ninja.", "label": 1}
{"text": "This one resonates. I feel like my friends with kids have lost their personalities. I have 2 women in my life who have put so many borders up for themselves \"I can't do xyz because I have a baby\". One isn't coming to my wedding because she doesn't want to leave her son for a few days (he and her husband were also invited), she was a asked to be a bridesmaid too. \n\nI am very aware as someone who is not a mother that I don't understand their situation. But it makes me scared that if I ever have kids, I will lose myself too, and that I've lost the people I once knew.", "label": 1}
{"text": "Not mine, but my partner's..... \"You're a f**king disgusting c*nt a** bi*ch and yet somehow you call yourself a good mother to your mixed race daughters when you just voted for Hitler 2.0. Fuck you, and I fucking hope your children never have to reap what you have sewn for them.", "label": 1}
{"text": "my partner and I are looking to move Colorado. I’m in FL. 😭😭😭 feels lonely here", "label": 1}
{"text": "I have an aunt that is a nun. She left her parents when she was 16 to join the nunnery and today she's in her late seventies. I'm pretty sure she's a virgin. \n\nIf you want a Gold Standard: she's a candidate. \n\n(No, I'm not going even to ask her if she has ever lusted after a man, let alone the rest of your debaucherous questions.)", "label": 1}
{"text": "I had therapy this week and it was the last session until January, due to her going away. It was a good session.  Then I was completely triggered 2 evenings ago and Im struggling to get up again. It really is one step at a time, forcing myself to do the things I usually love. I dont think it has to be one or the other, ie heal or escape, most of us are doing the best we can with what we have", "label": 1}
{"text": "I had therapy this week and it was the last session until January, due to her going away. It was a good session.  Then I was completely triggered 2 evenings ago and Im struggling to get up again. It really is one step at a time, forcing myself to do the things I usually love. \nI don't think it's one or the other ie heal or escape. We're doing the best we can with what we have", "label": 1}
{"text": "Lol what changed?", "label": 1}
{"text": "This. And also, there was effort involved in meeting girls which us men really enjoyed. As a millennial man who dated before the apps, there was a different thrill in meeting up, spending time together, going to random spots, bunking classes together etc", "label": 1}
{"text": "Yep, people had less options so you would focus on people you really liked. What dating apps did was to make the dating pool infinity for most women and selected men", "label": 1}
{"text": "Felt like I was in a better place to finally trust a man again.", "label": 1}
{"text": "Well, if other people are into old school dating you're right. But most aren't. Hence the problem. ", "label": 1}
{"text": "But even if you are not using dating apps, the means of communication today is a lot different than it was 20 years ago. You can reach someone in seconds, this is both bad and good. Not just to dating but to everything.", "label": 1}
{"text": "Yes, sharing nudes wasn’t never a possibility when I was a still in the date scene. You either got together and saw it live or didn’t. A lot safer I would say.", "label": 1}
{"text": "Just hanging out together, taking in the nice sights and eating the good food. Doing things together that both people enjoy.", "label": 1}
{"text": "Damn, I remember when it was like $7.50. I paid $11 earlier.", "label": 1}
{"text": "Some men. Gen-X here. I enjoyed it until I didn't. After the mid 90s offline dating went to shit, which is why so many men migrated to websites and apps. Online dating still allowed me to engage in meeting up, spending time together, going to random spots, and all that. It just allowed me to easier meet women whose values and interests aligned with mine. It was much less of a grab-bag. But I wasn't looking for casual sex, I was looking for LTRs.\n\nDudes looking for casual sex are half responsible for ruining dating in general.", "label": 1}
{"text": "I wouldn't say it's without a partner. I'm a celibate guy but I go on dates. Just am celibate until I find a girl that wants a family and to be a sahm. id consider myself celibate though given i end the exploration once I find out they have different goals/are not traditional", "label": 1}
{"text": "not a woman but dating apps dont work", "label": 1}
{"text": "Didn’t know how good we had it then 🫠", "label": 1}
{"text": "How old are you?", "label": 1}
{"text": "i wear a tux", "label": 1}
{"text": "Your husband doesn’t deserve you. You deserve so much better.", "label": 1}
{"text": "Obviously don't know you or the situation so just throwing this out there....is it possible you're acting a certain way when single as opposed to with someone? I just know some women who are downright exhausting at times when single bc they constantly whine about not having a boyfriend but never want to hear any constructive criticism that could help.  \nAnd then when in a relationship,  they do a 180. \n\nI also know some women that are scandalous AF when single and will go after every taken guy within a 100 yard range.", "label": 1}
{"text": "PLEASE either leave him or stop treating him like trash. You’re making a bad situation SO MUCH WORSE with your thinly veiled contempt and determination not to leave.", "label": 1}
{"text": "You can't complain that you'll never find someone if you make no effort to actually meet people. You always talk about going out and starting a family but do absolutely nothing to make your situation better. You don't drive, don't have a license, don't have an actual job besides babysitting for your sister, and live at home at 25 with your parents. I have offered so many ways to get a job, so many opportunities to meet other people, yet you want to stay at home and play games. I LOVE YOU BUT GIRL, GET A GRIP.", "label": 1}
{"text": "This is a sub called \"ask women\"", "label": 1}
{"text": "Valid 😂😂😂😂", "label": 1}
{"text": "what a wild , insecurity to have… for anyone, but esp for a woman", "label": 1}
{"text": "I won't move in with you because you drink too much and gaslight my kid when you're hammered . Also, you don't need a man to pay your bills. You just need to learn how to budget. Your dog is awful.", "label": 1}
{"text": "It's going to FLOURISH in Red States where you can very easily die from a miscarriage because doctors will go to jail if they help you.\n\nI can't even say those women would be wrong.", "label": 1}
{"text": "What? I thought complaining is the whole thing about relationships? Men complain about their wifes and women complain about their men. I put the dishes next to the dishwasher on purpose so my wife can complain about me while while drinking wine with her friends.\n😉", "label": 1}
{"text": "Women’s attention spans were stronger", "label": 1}
{"text": "Sorry, I’m tired I should have been more specific lol. Complaining=hooking up with redpill men and then wondering why they are getting their heart broken by these said redpill or blackpill men. Like my Sister in Christ, I love you, but these fellas do not deserve access to you.", "label": 1}
{"text": "Why does that matter? Some of us are younger and want this.", "label": 1}
{"text": "Living the dream, one sick day at a time.", "label": 1}
{"text": "There’s nothing stopping you. I always ask their views on that. It’s important!!", "label": 1}
{"text": "Yeah, pretty much this. Honestly, too many women either support Trump or simply don't care about politics. Personally, I won't be doing it because 1, I'm in a phenomenal relationship with an amazing man, and 2, because if I somehow end up single, I like men. I'm not going to put off dating, sex, and relationships over a presidential election. There are plenty of good men out there still. I just wish more of them would have voted.", "label": 1}
{"text": "Because hookup culture has always been a thing. My grandad has told me that in the 50s (a period very romantacised) that him.and his mates were just trying to get a leg over.", "label": 1}
