{"text": "\"B-but I like da dwagons😭\"", "label": 1}
{"text": "Cry harder.", "label": 1}
{"text": "no u", "label": 1}
{"text": "Yikes.", "label": 1}
{"text": "Same to you my stupid friend.", "label": 1}
{"text": "There's a certain type of person who genuinely can't conceive of someone inhabiting a position of power or advantage for any other reason than being just better than everyone else. Renly had the largest army for 3 months therfore he was an ubermensch no circumstance could lay low (other than Stannis CHEATING with BLACK MAGIC). \n\nSee also \"Mace the Ace\" and the related sentiment \"X character must be retarded, else how could they have experienced misfortune?\"", "label": 1}
{"text": "Literally not worth engaging with you, I'm surprised you are literate enough to even read the books.", "label": 1}
{"text": ">Bro you've got thicker head than gregor clegene if this was the best insult you could come up with\n\nOh come on, if you are going to insult someone in GRRM style you compare them to, Dunk the lunk, thick as a castle wall (and twice as tall).\n\nBut seriously, Dunk, your reply they insulted was poorly written.", "label": 1}
{"text": "Nah even season 1 of Hotd has retarded things in the level of GoT season 7-8, at most It Is in the season 6 GoT level of quality which was already in a noticeable declining.", "label": 1}
{"text": "the opposite is true, he's said his notes are to be burned after he dies\n\n  \n[https://winteriscoming.net/2015/12/02/george-r-r-martin-doesnt-see-anyone-else-writing-in-the-a-song-of-ice-and-fire-universe/](https://winteriscoming.net/2015/12/02/george-r-r-martin-doesnt-see-anyone-else-writing-in-the-a-song-of-ice-and-fire-universe/)", "label": 1}
{"text": "Calling Tyrion insecure, traumatized, and an incel isn't a take, it is literally who he is. Call it reductionist, but what three words would you use to describe him? You'd be hard-pressed to find words that explain him better than those. I get you don't like the connotation, but it's definitely accurate. \n\nAnd no one is upset about people who are just explaining why Tyrion did what he did. That's not the problem. As said multiple times, the problem is people using any discussion about Shae's murder to talk about how much they enjoy seeing a woman get murdered for humiliating a man. If you can see why Tyrion doing what he did was wrong, then you're not the problem and there is no need to be offended.", "label": 1}
{"text": "I thought I was at r/asoiafcirclejerk and was so confused why everyone was saying no instead of adding more into the joke ", "label": 1}
{"text": ">the problem is people using any discussion about Shae's murder to talk about how much they enjoy seeing a woman get murdered for humiliating a man. \n\nYou should genuinely be banned for this unless you're able to produce quotes from people saying this. This is just a gross thing to accuse people of with zero evidence backing you up. The subreddit shouldn't have to deal with bullies.", "label": 1}
{"text": "Pointing out that someone's relationship with their long term prostitute vs. their barber is a lot different does not mean I think Shae isn't capable of causing the execution of Tyrion or Sansa. What I'm saying is how you feel about your barber committing perjury in a trial against you is not the same as the person you slept with damn near everyday for months or years. Sex work is not an equivalent service to hair cutting. If Tyrion's barber told on him he wouldnt be anywhere near as mad at them as he was with Shae. Anyone who refused to testify could've been tortured or killed, and Tyrion knew that. If he was in that situation he would've saved his own ass too.\n\nAdditionally, while She's testimony did help convict him, he was already going to be convicted once the trial started whether she testified or not. And yes she was given money for testifying, but if you think she could've just said no and walked away you are being naive. That is coercion.\n\nI'm not making up what you said, I'm just making the barber do the same shit Shae did, and one of the things in her situation was coercion. You can claim all day she wasn't coerced, but she was coerced. That happened. Think what you want but I'm not arguing with you about facts just because you don't understand the definition. And I don't agree with you that committing perjury in a trial is the same thing as helping kill someone. It just isn't. If it was, a lot more people who've committed perjury in death row or life imprisonment trials would be getting charged with attempted murder. Lying at a trial is not the same thing as physically killing someone yourself. It just isn't. \n\nAnd yes! I still think killing the barber is unnecessary, cruel, and evil. It is not morally justified to kill someone because they humiliated you or committed perjury. It is understandable why Tyrion did that, but it isn't justifiable. It is not good or right. It is unnecessary, cruel, and evil. That is my OPINION. It's okay if you don't share it. As I said before, if you're not getting joy for seeing a woman murdered then you're not the fucking problem.", "label": 1}
{"text": "\"Whatever he did was right. He was also right when he said \"I should have let Stannis kill you all\". I relate to Tyrion so much and the hate he feels towards those that mocked him and turned on him is absolutely justified.\"\n\n-\n\nThis person enjoyed Shae's death. I'm not going to add their username but it's from this thread so you can find it. \n\n-\n\n\"Insecurities as a man\"\n\nHe just got mocked, villainized and sentenced to death in a speech that ended with her stating that she forced him to say words that were originally meant to comfort him, now meant to disgrace him.\n\nI can imagine many would snap for instance if their partner complemented them on their \"aquiline features\" or \"regal disposition\" in quiet moments of comfort, and then turned it on them in a criminal trial by calling them a \"vulture looking freak with a weak stance and features\". While Tyrion probably does feel this makes him less of a man, I don't think the fear that your insecurities *as a person* being turned on you by the people you care about at the worst possible time is unique to any race, creed or sex.\n\n-\n\nI don't think this person actually enjoyed Shae's death, but the attempt to justify killing someone by saying many people would snap in that situation is concerning. Just about everyone would be upset, but strangling someone to death over it is NOT normal nor is it justifiable. Everyone has experience humiliation in their lives and most of us do not kill the person who humiliated us. So I was bothered by the implication here, but I'm not saying this commenter actually thinks killing people is okay. \n\n-\n\nThese two comments are why I commented. There are other comments that are iffy. But this isn't the only thread I've ever read where people thought it was justifiable to kill Shae. I've seen a lot of gross shit like that on Facebook specifically. 🤷‍♀️ As a female fan I see men say horrible things about female characters all the time, and it wears you down.", "label": 1}
{"text": "So no one who said they enjoyed seeing women being killed by men? That was your claim right?\n\n>killing someone so you can continue to escape is NOT A GOOD OR JUSTIFIABLE REASON. It being self defense DOES NOT MAKE IT A GOOD OR JUSTIFIABLE ACTION. All it does is EXPLAIN IT. It is UNNECESSARY, CRUEL, AND EVIL to kill people because you are trying to escape.\n\nRemember when you claimed killing out of self-preservation while trying to escape an unjust execution was evil?\n\nI don't believe you're a woman considering some of the wild things you've said about women in past posts, but hey who knows. You seem to really think it's cool that Sansa would be put to death.", "label": 1}
{"text": "No one in this thread explicitly said that but I can read between the lines. Again I have seen other people say things that indicated they also enjoyed seeing a woman killed for humiliating a man. Believe what you want. \n\nYes that's exactly what I said, that killing out of self preservation because you're escaping is evil. You are taking someone else's life who is just doing their job so you can escape. It's understandable but it is not justifiable or good. \n\nAlso, where do you get off trying to tell me you don't think I'm a woman? What do I need to do, post a pic of my vagina? Jesus, dude. Since you've been reading my past posts go read my many comments throughout Reddit talking about my experience as a woman. All this complaining about bullying and you say some shit like that to me? You are an enormous hypocrite.", "label": 1}
{"text": ">No one in this thread explicitly said that but I can read between the lines.\n\nYou genuinely can't. \n\n>What do I need to do, post a pic of my vagina?\n\nPlease stop being creepy.", "label": 1}
{"text": "Stop trying to invalidate me and then acting like you're an innocent victim of bullying on this thread. \n\nI genuinely can read between the lines, unlike you.", "label": 1}
{"text": "You actually do.\n\n\nWow.", "label": 1}
{"text": "enough with this woke shit.", "label": 1}
{"text": "Boo hoo. If you don’t like woke shit, read other books", "label": 1}
{"text": "asoiaf is not woke , characters are characters", "label": 1}
{"text": "Asoiaf was written as a love letter to marginalized communities. Go read Harry Potter if you want books about the status quo", "label": 1}
{"text": "I think you're mixing things up here, they said real life Medieval Lords would denounce it, not fictional characters.", "label": 1}
{"text": "You started with something reasonable, slavery requires ending, if it be with fire and blood, so be it. Then went on to ramble incoherently about Dany doing a second life in drogon based on one or two visions, which could just be metaphorical, I think that vision is before he stands up to Viserys and says no to doggystyle with Drogo. And then Brienne and Stannis oh my god Jesse what the fuck are you talking about?", "label": 1}
{"text": ">Then went on to ramble incoherently about Dany doing a second life in drogon\n\nWere you actually not able to understand what I wrote, or did the theories I was describing just make you really angry?", "label": 1}
{"text": "Well \"speculate with flimsy or no foundation\" is more like it, there you go.", "label": 1}
{"text": "You derailed it already after the first few paragraphs, that was the point.", "label": 1}
{"text": "What would happen if GRRM wrote he would not publish WoW if Trump won? Would that skew the results?", "label": 1}
{"text": "If he would've finished Winds then Trump wouldn't have won the first time.", "label": 1}
{"text": "Finish the book, George! (still voting for Trump)", "label": 1}
{"text": "Keep crying fascist bitch", "label": 1}
{"text": "George please.", "label": 1}
{"text": "I agree trump is bad but this is more evidence George is far too online doomscrolling.", "label": 1}
{"text": "Not sure many Trump supports can read above an 7th grade level so I doubt they are reading ASOIAF", "label": 1}
{"text": "Trump warned about this...", "label": 1}
{"text": "Should be fine, books are not hard to find.", "label": 1}
{"text": "You can yap on about human nature and go ask Micky Mouse what his policy for ruling Disneyland will be, the comparison between the average man versus Aragorn who descended from a mythic people who live on Atlantis was never fair. His wife is a bloody elf who were made by the gods.\n\nGRRM chose to approach his story with the average man doing the best they can, Tolkien was writing of high fantasy with exceptional races. Aragorn is a good king because he’s better, it’s that simple, people who tries to compare him to the average man and say the average man wouldn’t do that is the precise sort of pedantry I’m pointing out", "label": 1}
{"text": "This is my bad. When you said this\n\n>Except Aragorn also spent 80 years travelling Middle Earth, his moral and character was thoroughly tested throughout his journey, we know he is good man. \n\nit sounded a lot like yapping about human nature. If your point was \"Martin can only be questioning tax policy (explicitly not what he was saying) and the gritty bookkeeping because Aragorn is so divinely better through the genetics in his veins that the only possible response one could level at a narrative is about the specifics of tax policy, anything else is pedantry\" then I apologize for underestimating how blinkered a view of writing you have, keep up the good fight.", "label": 1}
{"text": "I accept your apology dipshit, keep your head down next time.", "label": 1}
{"text": "*The door was closed, so nobody saw into Rhaella's bedchamber.*\n\n\nYes, because abuse is only real if it's committed in broad daylight in front of witnesses. \n\n\n*The only time Jaime saw Rhaella after the attack Rhaella was fully covered.*\n\n\nAs opposed to the normal response of showing off your bruises and scars the next day for everyone to see.\n\n\nGreat arguments. Totally not problematic at all.\n\n\nJFC. ", "label": 1}
{"text": "lmao got me good there big guy", "label": 1}
{"text": "[Read this](https://tvtropes.org/pmwiki/pmwiki.php/Main/HystericalWoman) and then come back", "label": 1}
{"text": "Women are people and that’s why 2 men using the hysterical woman trope is dehumanizing. Again, read the article or stop replying", "label": 1}
{"text": "I read it. I was curious. I was pleasantly surprised that it didn't apply to asoiaf.  \n\nThe show did it poorly. The issue is you said it can't be done properly. The arc isn't inherently sexist.\n\nIs it Jon killing her or her becoming evil or both? Because book Dany literally just made the active,willing, and informed choice to be evil. \n\nI sincerely read your article and I hate shitty cliches like it describes. I hate that Jon and Dany had a relationship at all romantically, that was too cliche for me. I hate that the story had Jon kill her and that another woman's death was used to propegate a man's arc. That's another cliche I hate. But I love evil Dany, if she keeps her agency. No madness  cliche bullshit. Just a person whose arc naturally led them to its conclusion. \n\nAfter reading your article I see how grrm has deconstructed that trope with folks like Sansa and Cat (even though it flies over morons heads quite a bit). Anywho. Sorry if I came off aggressive or anything, you don't seem to enjoy this convox so thanks for the chat!", "label": 1}
{"text": "Bad taste and bad manners. What a guy", "label": 1}
{"text": "> Because book Dany literally just made the active,willing, and informed choice to be evil.\n\nThank you for letting me know that you didn’t read these books. I guess that D&D’s bigoted writing would make perfect sense to someone who believes that confronting the men who raped and murdered your handmaiden is evil. Thanks for the chat too!", "label": 1}
{"text": "Dany Stan detected.\n\n\nSeethe and cope. Dany going fucking mental was the best part of the show. ", "label": 1}
{"text": "Grrm recommended a character essay on Dany for the folks that missed her villain origin arc in adwd. It's on the Meereenese Blot. \n\nAnd I never supported dnds writing. Only grrms story \n\nNot sure what your  handmaiden strawman nonsense is about. \n\nBook Dany tortured innocent people because she was mad at OTHER people\nBook Dany refused to punish a rape because the woman was technically property \nBook Dany gave her supporters a one time free rape pass\n\nAnd book Dany decided in her final chapter that being a good person bored and frustrated her so she reprioritized her goals and values.\n\nYou are an unpleasant person who is incapable of having an intellectually honest conversation.  I'm sorry you rooted for the villain accidentally. That sucks. I didn't make that mistake, because I read the books. But still, I'm SUPER empathetic", "label": 1}
{"text": "Strawman nonsense? It’s what written on the chapter. I recommend you actually read it rather than jerking off at the thought of a woman being murdered.\n\nGrrm actually [disproved](https://www.reddit.com/r/freefolk/comments/8g4tsz/grrm_debunks_the_water_garden_theory/) the conclusion of that essay. Oops. \n\nI’m sorry that you’re a misogynist who believes that women have to be meek and inactive to deserve respect. I hope you don’t bother the women in your life too much and that they keep a safe distance from you", "label": 1}
{"text": "You are completely overreacting and trying to demonise this person's point of view, which they expressed a lot more reasonably than you're being. I'm fully in support of calling out misogyny but this ain't it.", "label": 1}
{"text": "I can’t be reasonable with people who lie about the content of the books to perpetuate a sexist narrative. Find me a comment where that person argues that Jon’s missteps make him a villain and worthy of being murdered- oops! you can’t! That’s how double standards work and that’s the pilar of misogyny", "label": 1}
{"text": "Jon’s mistakes do not indicate that he is a villain.    Dany’s mistakes do indicates he is a villain. \n\nThis is because they made different mistakes.\n\nWithout even adding any context or substance whatsoever, would you say this take is sexist? It seems like you are arguing against the plot beat of a female lead becoming a villain while a male lead does not.\n\nIf that is what you are saying then you are making an enormous generalization", "label": 1}
{"text": "You’re right! I remember when Daenerys kidnapped a newborn baby and threatened to born alive his mother, a newly freed slave, if she didn’t abandon him. That was such a scary and villainous moment", "label": 1}
{"text": "You did not even attempt to address the comments I made so I think there is no point for anyone to continue here", "label": 1}
{"text": "I can’t address your comment because you judge women harsher than you do men. Try to do a bit of retrospection 👍🏻", "label": 1}
{"text": "This is the most misguided conversation I've ever read.", "label": 1}
{"text": "I know, it’s always hard to see people defending sexism but here we are", "label": 1}
{"text": "'seethe and cope' and 'touch grass' aren't arguments darling.\n\nAnyway, you keep your braindead boring good guys Tyrion and Jon but you better not be whinging about white-washing in HotD.", "label": 1}
{"text": "Do you have any quotes for your claims? Because there is only three times \"passionate\" even gets mentioned in the whole series and none of those relate to Visenya:\n\n>Her marriage, never **passionate**, had become a mummer’s farce by 54 AC. “And not an entertaining one,” Lady Alayne Royce observed.\n\n\\- F&B, about Rhaena and Androw Farman\n\n>I suppose I came to love her after a fashion, though our relations were dutiful rather than **passionate**. Three times she miscarried while trying to give me an heir. The last time she never recovered. She died not long after.\"\n\n\\- ACoK, about Jorah's first wife\n\n>Jaime had never seen her more **passionate**. Every time he went to sleep, she woke him again.\n\n\\- ASoS, about Cersei and Jaime\n\nI can't really be bothered to check the rest of your claims, but it might help if you stopped reading the wiki and started reading the books.", "label": 1}
{"text": "I have read the books thank u all the descriptions are from fire and blood and the world of ice and fire. So please put your bitchy remarks aside and maybe not comment if it is not helpful", "label": 1}
{"text": "Then give us the quote where Visenya is described as passionate. You can't because there is no such description. You know, it doesn't make sense to lie, when most of us have ebooks to just quickly search for a phrase.", "label": 1}
{"text": "> Then give us the quote where Visenya is described as passionate. You can't because there is no such description. You know, it doesn't make sense to lie, when most of us have ebooks to just quickly search for a phrase.\n\nhttps://www.westeros.org/Citadel/SSM/Entry/More_Targaryen_Descriptions\n\n\"Visenya is both stern and sensual... more passionate, but with a dark and unforgiving side.\"\n\nTook me two minutes to find.", "label": 1}
{"text": "Nice. Thank you for sharing. Didn't know that. It seems like George doesn't see any contradiction ain describing a character as both stern and passionate at the same time.", "label": 1}
{"text": "Do you… think that’s the only factor in making good fighters?", "label": 1}
{"text": "Another representation of female empowerment? No thanks. \n\n\nNo progressive agenda here. May she return to servitude, which is what belongs to her. \n\n\nEven with nuke dragons, we need to maintain some realism, right? \n\n\nIt wouldn't take Martin nearly two decades to disappoint us in such an obvious way. He is só old, fat and white...", "label": 1}
{"text": "You do realize George R R Martin is a fairly progressive man right….?", "label": 1}
{"text": "So, ASOIAF-fandom ... are you guys ready for a major shift in direction? Or are you guys going back to \"R+L=J Only\"? George is reading all of this by the way ... and he would like to hear your opinions. He has been disappointed so far from the lack of reactions since the last time I was here (you know when I gave you guys an alternate ending to the series).", "label": 1}
{"text": "Last (and some might say the least) of the peoples of the North are the swamp-dwellers of the Neck, known as crannogmen for the floating islands on which they raise their halls and hovels. **A small, sly people** (some say they are small in stature because they intermarried with the children of the forest, **but more likely it results from inadequate nourishment**, for grains do not flourish amidst the fens and swamps and salt marshes of the Neck, and the crannogmen subsist largely upon a diet of fish, frogs, and lizards), they are quite secretive, preferring to keep to themselves. -written by GRRM, TWOIAF\n\nPrincess Alyssa Targaryen has **one green eye** and one purple eye ... a direct DNA ancestor of Meera.", "label": 1}
{"text": "Thank you for recognizing my efforts! Did you know HotPie is named after the singer Meatloaf?", "label": 1}
{"text": "If so, should I stop posting? Because I have A LOT more to give", "label": 1}
{"text": "He wanted Robert's head because he was a rebel and was Ned's friend, what has Lyanna to do with it?", "label": 1}
{"text": "Have you met.... Donald Trump", "label": 1}
{"text": "you are mad cause she’s a good person? what a stupid take", "label": 1}
{"text": "Thank you for your service. 🫡", "label": 1}
{"text": "You are right, he truly was crazy.", "label": 1}
{"text": "This just get worse when you learn George intended for Arya and Jon to fall in love on his first drafts.", "label": 1}
{"text": "In the books is Yoren tho. But I agree Hot Pie the GOAT.", "label": 1}
{"text": "Ok great! Apology accepted. Don't worry about it 🙂", "label": 1}
{"text": "You're an odd duck, huh?", "label": 1}
{"text": "Nooooo YOU'RE precious!!", "label": 1}
{"text": "This is why it's a mistake to treat hardcore shippers like they have actual reasons for believing what they say. Because it always devolves into this.", "label": 1}
{"text": "Omg yesss what she get to gain? Definitely not a crisis of ascension because her cute hubby decided to fuck and marry (in show, so far) a girl who had serious power (daughter of a head noble lord, yada yada) backing her, at a time when her own children already faced racist prejudice! Duh. I mean it's definitely not like in the past some lovely Targeryens thought they'd remarry only to end their entire lineage in severe crisis, both times! (Maegor and Viserys 1) Plus it's not like the girl in question was already engaged to ANOTHER noble lord btw, who also happened to have to ties to the throne! (Robert Baratheon was indeed the grandson of Targaryen woman, I forgot the name) It's definitely not like there was already tensions in the court due to a current ruler being cuckoo ass crazy! And it's not as if she had any self respect at all, despite being the only Non Targaryen woman who was a princess in her own right! You're so right!", "label": 1}
{"text": "As for Dany, she also thinks that her father wasn't a madman, and everyone else simply just got up in arms against him and killed him. She's supposed to be an unreliable narrator, as is everyone else. So to say that her vision may be a proof that Elia was happy is the same as saying \"Well Dany says her father was a mad man so it's true.\" It's why unreliable narrators exist", "label": 1}
{"text": "Probably because you were simping for GRRM", "label": 1}
{"text": "My life doesn't revolve around whether GRRM finishes his books or not. If he does, great, if he doesn't, too bad. Maybe you *impatient* (ooops, that bad word again, *shudders*) people could find other hobbies.", "label": 1}
{"text": "Did i say anyone said that?\n\nThank you, but next time i need a break, please rest assured that i will not be asking you for permission, or whether you think i need one. That's a burden i would not dare make you carry.", "label": 1}
{"text": "If you fart and I get so angry I kill people, is it your fault those people died? Obviously not. Lyanna didn't start the war.", "label": 1}
{"text": ">I think the fact that she has casual sex with multiple men is proof that she's a sexual person.\n\nThis is you, and this is the point I was arguing. But you collossally moved the goal posts from \"having casual sex with multiple partners\" to \"having sex ever\" just to pretend to win an argument.", "label": 1}
{"text": "Jesus christ dude you're projecting real hard here. My ego isn't that fragile over a fucking internet argument lmao. If it was, then maybe I'd make exaggerated strawman arguments like you are.\n\nYes, she enthusiastically enjoys sex with multiple men. But I guess only one of them being casual instead of two is me \"collosally moving the goalposts\". Congrats on winning your pedantic and irrelevant argument!!!", "label": 1}
{"text": "Yeah this is a much more diplomatic way to phrase what I would say.", "label": 1}
{"text": ":( what do you mean?", "label": 1}
{"text": "they callin u slow bro🤦‍♂️ I hope they wrong but ur not doing urself favors still asking what they mean", "label": 1}
{"text": "yeah i was giving them the benefit of the doubt not wanting to assume someone is mean for no reason but what can you expect from redditors lmao", "label": 1}
{"text": "U not lyin shi ignore em don’t let that stop u from asking ur questions. Some cool folks in this community that’ll engage with you!", "label": 1}
{"text": "thanks! i was still giving them the benefit because im not a native speaker so i might have written sth wrong or sth so i wanted some clarity. but other ppl were nice 😊", "label": 1}
{"text": "With Trump winning, I see the opposite happening. ", "label": 1}
{"text": "Slower actually, Martin really doesn’t like Trump so him becoming president again will probably put a damper on his mood", "label": 1}
{"text": "Only way this happens is if Trump signs an executive order forcing gurm to finish the fucking thing", "label": 1}
{"text": "He will make sure George finishes the novels, wether he wants it or not!", "label": 1}
{"text": "Uh-huh, western actors and actreses lack something, turkish ones at least you know men are men and women are women, no lgtv promotion, that pretty much killed this attrocious series for me, i'm not even bothering to pirate it, hell Turkish series are better quality than HoTD(should be renamed hot garbage btw), just lack computer effects.\n\nKıvanç Tatlıtuğ would out act pretty much whole cast by himself, except perhaps for Matt Damon. Or the Rigue Prince being played like Murat( Ismail Demirci ) from İyilik without the screenwriters moronic moral teachings and рussy ass acting cop on copium of course...  Alcock looks like a Scarren from Farscape heh...\n\n\nHalit Ergenç had the screen presence and powerful voice at least, you know he's the boss when in the room, Tom Glynn looks like Osman on the donkey from the start, wonder if he'll go on to play a rеtаrd as a career or was that second for Osman's actor...\n\n\nKurtlar Vadisi actors or Arka Sokaklar's ones would also do well i think, at least some of them, some series went too long and lost their plot that's true.", "label": 1}
{"text": "That we have to hear over and over that people hate female chapter POVs over and over again. Especially Cat who doesn't have flying nuclear weapons. \n\nThis has been going on for decades.\n\nI wonder what political affiliation they have :)", "label": 1}
{"text": "Homies just shitposting", "label": 1}
{"text": "lol", "label": 1}
{"text": "I feel like Trump would totally fit in with a TWoW cameo\n\nOnly question is who he supports? Or who supports him if he throws his Crown into the War", "label": 1}
{"text": "Yes because now Trump is busy George and he can't have gay sex, means George will have more time to write and we will get Winds of winter early.", "label": 1}
{"text": "I literally said in the comment you supposedly read that he’s not an underdog story-wise, yet you sit here saying “NU-UH HIS STORY IS TRAGIC BUT HE’S NOT AN UNDERDOG”\n\nI’m not even going to bother arguing with you as you don’t seem to actually read the comments you respond to", "label": 1}
{"text": "Retrospectively I can see why some are interpreting this as a shit-post, but no, I did intend this question genuinely. I think it’s a relatively straightforward and appropriate question to ask given the context and George’s obvious left leaning. George did make progress on TWoW during Trump’s first term, but mainly because he had nothing better to do during Covid. There’s no Covid this time. I expect George will be stewing in political ire, and I don’t think it’s a stretch to say this may affect his productivity. Give me your thoughts! How would Harris winning have changed the course of TWoW releasing, if at all?", "label": 1}
