{"text": "We don’t need “less Christians”, we need “less religion”.  Moderate or mild Christians are just as great as moderate or mild Jews, Muslims or anybody else. We need to get rid of the extremists.", "label": 0}
{"text": "In fact, it almost necessitates the opposite", "label": 0}
{"text": "I have resting serial killer face so this kind of thing doesn’t happen to me often.", "label": 0}
{"text": "None in this context actually means no subscribed religion. It doesn’t mean no belief in God. None in these studies literally means any belief that is not a declared religion. If you aren’t Christian or Muslim or Jewish but you believe there’s a magic God controlling things, that’s still none, because you aren’t following an actual religion, you have your own personal beliefs.\n\nSo that’s my point, the none category for these types of surveys is actually a really diverse category that just means “not a named or listed religion, or no specific religion”", "label": 0}
{"text": "Oh great. I imagine the victim mentality is going to skyrocket as that gets closer", "label": 0}
{"text": "If you vote in a place that is either deep blue or deep red that won't be close at all and Claudia and Katrina are on the ballot, please vote for them.  We really do need to move forward and maybe eventually not have \"leaders\" that are complicit with genocide.", "label": 0}
{"text": "I’d say “you can pray for me if you first let me tell you about the seven tenets of the satanic temple”. \nhttps://thesatanictemple.com/blogs/the-satanic-temple-tenets/there-are-seven-fundamental-tenets", "label": 0}
{"text": "I’ve never met an atheist who wasn’t a good person. Atheists are not the troublemakers of the world. Guess who is? Every single war has been attributed to one religion or another.", "label": 0}
{"text": "So not majority but most certainly still a plurality for a while after that.", "label": 0}
{"text": "I have magnetic powers! But they're invisible so they don't work.", "label": 0}
{"text": "Yes, that's essentially what they're saying.", "label": 0}
{"text": "I don’t know, the bible is pretty damn brutal.", "label": 0}
{"text": "Good. Please make sure the Muslims, Scientologists, Mormons or Catholics don't replace them. Sick of these religious fucks making the rules for everyone else, I don't care what team they're on- they all fucking suck.", "label": 0}
{"text": "…on all our houses!", "label": 0}
{"text": "You are the sandcastle, not the sand. Anyone who has died is the same place sandcastles go when washed away and only the sand remains.", "label": 0}
{"text": "I hope religion, in general, declines all together to nothing. I'm all for spirtuality but religion blows", "label": 0}
{"text": "Well I hope it's not just replaced by another religion like Islam. No religions please.", "label": 0}
{"text": "Ya think?", "label": 0}
{"text": "Thank God! Oh, wait…", "label": 0}
{"text": "🤓☝️", "label": 0}
{"text": "You should read a book called guns, germs, and steel by jared diamond. Basically, countries with very limited resources cannot support economies diverse enough to support democracy. The religion is irrelevant, if those countries were christian the would still be fascist dictatorships.", "label": 0}
{"text": "Not ALL atheists. ", "label": 0}
{"text": "How long until the US has nothing religious as a majority?", "label": 0}
{"text": "I've had a number bearded dragons, a couple of them were certainly my best friends!", "label": 0}
{"text": "I think there was some cell phone data report that said most people lied about attending church. Only like 5% attend (if im remembering correctly)", "label": 0}
{"text": "The Guns part is an American thing more than religious", "label": 0}
{"text": "That’s assuming no civil war", "label": 0}
{"text": "Yeah, but they breed like mice", "label": 0}
{"text": "As long as it's not a Muslim majority. I don't want shit replaced by shit.", "label": 0}
{"text": "lol. Too much tv for you. TMI for me.", "label": 0}
{"text": "ha.  study all you want, it will be way sooner. exponentially", "label": 0}
{"text": "The cell phone data is probably more accurate.\n\nThe act of keeping a diary influences your behavior.", "label": 0}
{"text": "Maybe it is a class thing?  Do they educate everyone, or only the upper class that has a very vested interest in maintaining their status?", "label": 0}
{"text": "In short, people are lazy. And I don't mean that as a super negative thing, what I mean is that people only have so much time and energy to spend on ideas, and in a lot of cases we need to take shortcuts. We don't have the ability to be PhDs in every topic, we don't even have the ability to pass average college courses on every topic. So we need to take shortcuts. We need to be lazy.\n\nWhen it comes to a lot of the ideas that religion hits, religious answers are a great way to get quick answers. People can't stand not having answers to questions, and religion provides lots of answers. They aren't good answers, or accurate answers, but most people would prefer to have an answer rather than having no answer at all. Even if the honest and accurate answer is that there is no answer. The comfort of having an answer is much stronger than the cold truth of not having an answer.\n\nBut *some* people don't want easy comforting answers. They want truth, even if it's the bleak cold hard truth. Some of these people accept the lack of answers and do not believe the answers given by religion that can not be backed up. These are atheists.\n\nOthers find the people of religion to hypocritical, dishonest, and abusive. These people leave the church and religion, and they see this as evidence against the idea of a god. These are also atheists.\n\nAnd then there are others that are atheists for other reasons. There's no one way to reach atheism. There's no one reason people are atheists.\n\nThankfully with the rise in access to information, more people are able to see through the facade of religion. Atheism doesn't have much in the way of spokespeople, a few philosophers and big name people who give talks and debates, but nothing like what a religion has. Like dedicated buildings constructed for the ideals of religion, atheism doesn't have that. Atheism doesn't have edicts that dictate people must go out and convert others to atheism. Atheism doesn't have a set of rules that are posted up at courthouses. Atheism doesn't have much of a \"culturec\" in the same way that a religion does.\n\nAs for the future, as long as access to knowledge and facts remains open and available and people want to have the facts over feelings, the number will grow. As long as religion can be kept out of places it doesn't belong, like politics and government, then it won't be forced upon as many people, so less indoctrination. Which always helps.", "label": 0}
{"text": "Thank you for your comment, especially the last part, I wasnt sure if I even desered to celebrate holidays with my family since I felt bad since I didnt really understand them (those are religious holidays) but yeah I think Ill just embrace it thank you", "label": 0}
{"text": "\"my relationship with god is personal\"- personally you don't believe in them. No one has to know. \n\nPeople who attack you for not participating in their virtue signaling are just, well, virtue signalers.", "label": 0}
{"text": "Does he though??    With the news everyday you'd think he's following the norm for all religions. Actually he's falling behind I think so.", "label": 0}
{"text": "That's the great thing about the Bible. You can cherry-pick verses to support any interpretation you want.", "label": 0}
{"text": "I see that makes a lot of sense thank youuuu also happy cake day!", "label": 0}
{"text": "I like anti theist. If you’re against that sort of thing…", "label": 0}
{"text": "Thanks 😁\n\n🥳🎂", "label": 0}
{"text": "Yeah but ita hard to disprove something like that\n..", "label": 0}
{"text": "Tuhhhydyoggghg but good st", "label": 0}
{"text": "Translation is to ignore Elon Musk and Donald Trump who only worship money... 🤣", "label": 0}
{"text": "> \"Imperfect vessel...\"\n\nCracked pot.", "label": 0}
{"text": "Yeah - they're forgiven.  The rest of us are going to hell", "label": 0}
{"text": "That is why he wears oversized clothes. To make him look younger. Moron", "label": 0}
{"text": "First, I feel like I’ve based my entire sense of self on what’s probably a lie. Also, I feel like there’s no reason not to hate myself anymore because I wasn’t created by someone who cared about me. And I have nothing else going for me in life. So I just feel very low. I’m also afraid because I will never see any of my loved ones ever again after they die, and I won’t ever see my cat again because he is dead.", "label": 0}
{"text": "Wow now that also makes a lot of sense, you see no matter what in my heart religion never gave me a satifactory answer but the answers in this reddit just feel... complete to me... is it okay if you also give me a reason to why shouldnt I be scared of hell? Or should I? I really dont know Im still scared I try to be the best person I could be but...", "label": 0}
{"text": "I understand that the Vatican itself will set an example - we are waiting for the dissolution of the Vatican Bank and the return of property stolen over the centuries to the nations.", "label": 0}
{"text": "“People who believe in magic sky fairy angry at reality”", "label": 0}
{"text": "Some people's will is freer than others, as far as they go.", "label": 0}
{"text": "atheists don't care what label you use.  agnostic is fine.  If your family is less bothered by that, stick with it.  Agnostic just means that you don't know, and you think it's unknowable.  Most atheists are in fact agnostic.  We aren't so conceited to day we know for certain that there isn't a god, just that we have absolutely no reasons AT ALL to think that there is one.  Technically, there isn't REALLY a difference.\n\nThe main reason why people choose one label over the other is basically to indicate how strongly you feel that organized religion is stupid.  Agonistics \"don't know or care\" and think that it's a \"toss up\" - maybe god is real, maybe god isn't both are equally likely. Atheists, on the other hand, are firm in thinking that there's no reason to believe in god, therefore they don't and they think there's virtually no chance of god existing.  Furthermore, athiests generally view religion as stupid and harmful to society.;\n\nBut those are just generalizations.  Choose the label that serves you best given your community and life situation.", "label": 0}
{"text": "We know. They know. They don't care because his base has never cared about the \"tenets of Christianity.\"\n\n This is about people who feel that their position in society has been threatened, and that feels bad. They want someone to wage war on the people that they blame for making them feel bad. \n\nThey want the Messiah that Jesus failed to give the Jewish people in that old book that they barely read. And they've decided that Trump is that Messiah.", "label": 0}
{"text": "TL;DR: Because it's taboo.\n\nWhat we make taboo, we give power over us. The allure of violating taboos is especially compelling for people (including but not limited to theists) who externalize their locus of control. The taboo is explicitly intended to restrict, so the question remains... what is being restricted, and why?\n\nGeorges Bataille (in *Erotism*) suggests that the intention behind taboos is to **restrain violence**, violence being inherent to nature. Our species' earliest taboos are around death (based on substantive evidence of ancient funerary rites) and sex, and the seemingly mysterious relationship between the two. Death and sensuality are bound up in each other in our inner life, and in the notion of the **continuity of being** that corresponds to the objective, physical reality that underscores all of our abstractions, that exists independently of our minds (with respect to the hard problem of consciousness, I am rejecting the idealist position). We are members of a species of discontinuous beings -- our consciousness is separated from other consciousnesses by an untraversable gulf. I do not experience what you experience, if you die it is not my death, etc; and because we cannot overcome this gulf, it retains an aura of mystery. We may experience a deep anguish over it. I expect the corollary for Christians is anguish related to a worldview that insists they are fundamentally separate from their god.\n\nInterestingly, sensuality is also bound up in anguish, sometimes experienced as a feeling of incompleteness or emotional pain at the lack of the Beloved, the object of our desires. The emotional pain can also cause physical pain -- we might say anguish drives our mating instincts. We project our desires onto the Beloved, and in a biological sense, all of this culminates in sex, an inherently violent physical act in which the participants experience varying degrees of absorption (losing track of the world around them), and a brief \"blotting out\" of consciousness during orgasm. In Bataille's terms, this is a fusion we're talking about, in which the participants are (in a manner of speaking) destroyed, becoming a single, continuous entity, however briefly, however symbolically.\n\nMusing on this framing, I can't help but think about the commonality of coping with death by having sex -- it is apparently quite common for couples to have sex after attending a funeral.\n\nAlso -- I think this idea touches on the very old, and Biblical, idea that sex makes us \"as one flesh\" with each other. We achieve this unity by a violent act. Taboos restrain violence.\n\nThe domain of taboo is SACREDNESS. Sacredness, conceptually, implies a setting-apart from mundane, daily, unstructured use. Let's take a well-known example: the Semitic proscription on the consumption of pork. The widely-understood rationale here is that swine are unclean.\n\nHowever, if we look far back enough in history, we find that the reasoning is quite different. According to *The Golden Bough*, the proscription actually traces back to the belief that **swine are sacred**. The original proscription was that pork should only be eaten on certain festivals, as was the case with other sacred animals (Frazier mentions that mice were similarly proscribed). Taboo sort of \"structures\" violent acts (sometimes proscribing altogether, sometimes limiting) and thus mediates our interaction with nature. **Key takeaway: transgressive acts, appropriately structured, are essentially sanctioned.**\n\nWhether or not we LIKE this framing, I can see how it speaks to the fundamental experience of embodiment as an animal, common to both theists and atheists, and why Christians might be especially compelled to violate their religious and cultural taboos on sex.\n\nThey just also happen to be regularly barred from access to sex education, contraception, family planning services, and women are often taught to be subservient to men. Throw that on top of all the anguish inherent to our mating behaviors that already drives us toward each other, especially in the full flower of our youth and the abundant sexual vigor that tends to come with it.\n\nNo wonder they're fucking even when they're not allowed. They can't resist... they barely understand what is happening to them. On some level, I think they also expect to be forgiven, because they're already \"saved\". There's definitely some doublethink going on there.", "label": 0}
{"text": "I do like the label Agnostic a lot. ", "label": 0}
{"text": "Problem is, I don’t hate God or theism. I just feel like there’s a very good chance that theism isn’t true. ", "label": 0}
{"text": "Atheists in general, don't gather to be counted. They just exist. There are far more atheists than you realize. Look at politicians. You can barely get elected in the US unless you are some stripe of theist. Barney Frank was a congressman for decades, as an openly gay man. He didn't come out as Atheist until he retired. Consider that.", "label": 0}
{"text": "Why should anyone give a rat’s ass about anything the Vatican says?  They should be tried for crimes against humanity.", "label": 0}
{"text": "both sides have egos , they will not accept other point of views", "label": 0}
{"text": "What label are you comfortable with? Be that.", "label": 0}
{"text": "A lot of atheists may never label themself as atheits, publicly nor privately.", "label": 0}
{"text": "Unfortunately, it has been shown that traditionalists change from ridicule and rationalists change from gain. \n\nIt’s not a hard and fast rule but it’s why weird Vance worked", "label": 0}
{"text": "I guess", "label": 0}
{"text": "Excommunicated endorsing the impeached.  Hilarious.", "label": 0}
{"text": "I think the overlying theme is hypocrisy. They judge others, not themselves.", "label": 0}
{"text": "Remember the old joke:  \n\"I was going to ask God for a bike, but then I realized that isn't how God works, so I stole a bike and asked for forgiveness instead.\"  \nAs a Christian, you can do whatever you want, as long as you remember to ask for God's forgiveness afterward.", "label": 0}
{"text": "Because to them, god is the ultimate authority and thus is accountable to none. Which is utter bullshit.", "label": 0}
{"text": "Sure that's how it's supposed to work, but it doesn't work that way in practice. People will choose to do something bad because they know they can repent later, and they convince themselves that they'll really mean it. \n\nIf I believed in the stuff, repentance looks like a lie that the devil created to get more people to sin, and it works.", "label": 0}
{"text": "If somebody asks you if a god exists and you answer that you don't know, you're agnostic.\n\nIf somebody asks you if you believe in a god and you answer no, you're an atheist.\n\nHow does a person believe in a thing they don't know even exists is what the religious call faith, I have other names for it, none are kind.", "label": 0}
{"text": "You're a jerk.\n\n\nNow, does it matter to you how others label you?\n\n\n(I don't really think you're a jerk I was trying to make a point.)", "label": 0}
{"text": "Religions are businesses, they get huge amount of money and expend like crazy because of the money. Atheism doesn’t grow like a business, atheism doesn’t have organizations or movements, only came after decades of education as I understand, or deep frustration of the lies from religions if they finally realized that.", "label": 0}
{"text": "Be an \"Atheist Lite\" then: AGNOSTIC", "label": 0}
{"text": "Even if it was true, it’s more so the freedom to do things god “hates.” Nobody is going to force you to get an abortion, for example, but you should be able to if you want to because we’re not a fucking theocracy.", "label": 0}
{"text": "The thing is, the label only exist because of religious people. You can just simply not believe in anything religious. You don’t need to be labeled. We don’t have an official label for not believing in other things so I don’t know why there has to be one for not believing in religion.", "label": 0}
{"text": "please google “no true scotsman logical fallacy “", "label": 0}
{"text": "Yes.  Skeptic, non-believer, or non-religious are also other options if OP really feels like they need a label to describe themselves.", "label": 0}
{"text": "Because they're giant, fucking hypocrites for starters...", "label": 0}
{"text": "\"why shouldn't I be scared of hell\" Easy. Are you afraid of ghost? It is not real. You don't have to be scared of what is not real.  \n\n  \nMy advice. Learn as much about the REAL world that you can. It is truly amazing. Isn't the beauty of the world enough without having to make something up?", "label": 0}
{"text": "An old friend of mine was a staunch Christian and once he entered college he was banging girls left and right. Of course, hypocrite of monumental proportions. He still went to church on Sundays and pretended to be a devout religious man.", "label": 0}
{"text": "It IS strange that the first obviously atheistic president is supported by religious nuts. More evidence that religion destroys rational thinking.", "label": 0}
{"text": "just call yourself agnostic..... it's more scientific", "label": 0}
{"text": "You don't have to tell your family. Atheists are not stupid. You should reach out to others in your situation, you are not stupid and you don't need to loose hope. So many people feel SO much better after becoming atheists, but you can use whatever lable you want, that's not important.\n\nKeep in mind: atheist just means \"not a theist\". So if you don't believe in god, you are a \"not theist\" = atheist. But if you don't like that lable, use whatever you want :-)", "label": 0}
{"text": "Then don't label yourself \n\nDo you go around espousing your anti Santa Claus ness\n\nJust don't believe and move on", "label": 0}
{"text": "tl;dr---My understanding of this philosophical definition is that a gnostic is someone who *claims* to have knowledge, regardless of whether they actually have knowledge.\n\n# On Absolute Certainty\n\n>It’s is not so much about the certainty - but knowledge has to be - by definition - true.\n\nFirst, let's be clear: there isn't a single definition of knowledge. However, we can have the discussion using the definition of \"justified true belief\". If you want to use that definition, though, you have to stick to it.\n\n>Why should theism/atheism have a special place were typically non-belief and not belief is proclaimed to not be known with absolute certainty?\n\nHere, you are using \"absolute certainty\" as your definition of knowledge, but you focus on \"justified true belief\" elsewhere. When I say I am an agnostic atheist, it is not because I lack absolute certainty (although I do), it is because I don't think that the claim \"no gods exist\" is justified. When I say I am gnostic about the moon, it is not because I have absolute certainty (I don't), it is because I think the claim \"the moon exists\" is justified, and that reality objectively exists, making the belief true. I could be wrong about those things, but I still claim to know the moon exists.\n\n# On Justified True Belief\n\nI think you misunderstand my objection to your third point. It is impossible for us to know which justified beliefs are true and which ones aren't. There is an objective reality (at least, I am assuming we can agree there is an objective reality), but it is impossible for us to tell which justified beliefs are true and which ones are not true.\n\n*Regardless*, that doesn't matter when it comes to gnostic claims. A gnostic atheist is not someone who has knowledge that no gods exist, and a gnostic theist is not someone who has knowledge that some god exists. No, a gnostic atheist is someone who *claims* to have knowledge that no gods exist, and a gnostic theist is someone who *claims* to have knowledge that some god exists.\n\nThe gnostic might have knowledge, or they might not. All that you need to say a gnostic exists is to point to someone claiming to know something. You were saying that gnostic atheists and gnostic theists can't both logically exist, but that's not true because gnostic atheists and gnostic theists do exist. A married bachelor cannot exist logically, and they do not actually exist. If something actually exists, it is logically impossible for it to be logically impossible.\n\nGnostic theists and gnositc atheists don't have to be correct in their claim of knowledge in order to exist. They just have to make the claim. I believe they are both wrong to make knowledge claims, but I am not going to say they aren't making a claim---which is what you are doing.\n\nIt seems like you think that in order for someone to make a gnostic claim, they have to have access to the objective truth, i.e., they can't be wrong. My understanding of this particular philosophical definition is that we don't have access to the objective truth, so we can't have a justified true belief about which justified beliefs are true and which ones aren't. However, that doesn't stop us from claiming to know things, it just stops us from being able to assess knowledge claims on the basis of truth. That is, people can claim to know something and be wrong about it.", "label": 0}
{"text": "Just waiting for them to change it to “Trumpianity.”  \n\nSafe bet Trump could have replaced every “Jesus” with “Donald” in his bible and they would still pay $60 for it.  There is no line too far for these people.  Donald Trump is Their Lord and Savior because Jesus is “too weak”, “too woke”, and “too liberal” now.\n\n[Evangelicals are rejecting the “liberal” teachings of Jesus](https://www.newsweek.com/evangelicals-rejecting-jesus-teachings-liberal-talking-points-pastor-1818706)", "label": 0}
{"text": "Ten Years After and legendary Alvin Lee.  That's good energy 👍", "label": 0}
{"text": "Gaining political legitimacy by co-opting religious institutions is like, the first page of the fascism playbook.\n\nThe irony is that biblically accurate Jesus, and not GOP revisionist Jesus, would be fucking pissed at them for invoking his name for political gain. Remember when he flipped his shit in the temple when he saw people conducting commercial business out of it?", "label": 0}
{"text": "Humans naturally want to share love.", "label": 0}
{"text": "To remind you that they are still there", "label": 0}
{"text": "Tribalism", "label": 0}
{"text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.", "label": 0}
{"text": "Are there any important chapters or pages do I need to read?", "label": 0}
{"text": "Who cares what he was?  He's a myth.", "label": 0}
{"text": "Maybe it’s time to stop worrying what other people think, and time to stand up for truth.", "label": 0}
{"text": "As long as Atheists know that religious people can’t prove there is a god. It’s game over. Checkmate", "label": 0}
{"text": "There are hospitals run by religious organizations in the US.  That's why some are pushing for abortion bans or at least exemptions, so their doctors don't have to perform them in their hospitals.", "label": 0}
{"text": "The tenets of christianity? \n\nTHe ones preached by the apocryphal batshit death-cult leader two millenia ago that said to abandon your family, that you'd be hated for following him, and that he was the only way?  The one who cursed a tree for not bearing out of season?  The one who said he didn't come for peace but with a sword? \n\n....seems like his actions align with xianity just fine.", "label": 0}
{"text": "I always liked how someone compared atheists to “not skiiers”\n\nLike how do you define a group that doesn’t do something? Not that they are against it just they don’t do it", "label": 0}
{"text": "Charlie Kirk should nosedive into an open volcano. It’ll be his greatest contribution to humanity.", "label": 0}
{"text": "An atheist does not believe the claims of PEOPLE who say there is a god.", "label": 0}
{"text": "Gotta admit. I do like bacon. ", "label": 0}
{"text": "In my state in USA, it's asked on the sign in forms.", "label": 0}
{"text": "And in 50 years, guess who will also shriek \"but he was AN ATHEIST!\" when things go sideways.  I mean, it's like Good Christians are  completely erased out of the historical records in these scenarios.", "label": 0}
{"text": "Hormones are pretty strong.", "label": 0}
{"text": "I don’t use the word atheist because unfortunately it is connected to so much negativity. I just say that I am not religious or I will flat out say I don’t believe in any god.", "label": 0}
{"text": "I would love to have someone explain convincingly and prove any god exists. Long time Atheist here.", "label": 0}
{"text": "I have read the fine print, it isn’t in there.", "label": 0}
{"text": "Which hell should you be afraid of? There are many versions. If your goal is to minimize eternal suffering, the best path is to believe in whichever religion has the worst hell and do whatever you have to in order to avoid it.", "label": 0}
{"text": "Trump isnt Christian tho.", "label": 0}
{"text": "They literally don't care, they are voting for him because he will hurt the right people, he will bring misery which they fantasize about. Christians stopped caring about their own set of morals as long as they get to hurt those they hate", "label": 0}
{"text": "Yes, but they’re religious! So it’s okay, you can trust the ! /s", "label": 0}
{"text": "embrace the phrase “Evangelical Atheist”, because our SECULAR NATION is under attack", "label": 0}
{"text": "That sounds different though, push vs pull. \nIf you’re religious, you can go to the chapel and clergy are available. Great for them, and it doesn’t impact people who don’t want it. Having the religion pushed on you by forced clergy visits is a whole different level.", "label": 0}
{"text": "Islam is not a race & criticising it is not racist. It's Muslims playing the victim card by calling their critics racist/islamophobe etc. \n\nAs an ex-muslim instead of criticising, I troll my Muslim relatives by pointing out how they are not 'true muslim' for not doing jihad/not keeping 4 wives/not having sex slaves etc.", "label": 0}
{"text": "Trump is the embodiment of an AntiChrist", "label": 0}
{"text": "It's fine not to call yourself atheist.  It is a loaded term.\n\nHowever, even if you say it in other ways, people like your family (the ones who taught you that atheist's were stupid) aren't going to be happy.\n\nThere are a lot of closeted atheists for that reason.  It's okay.  Being an atheist doesn't mean you've joined a club and have to follow their rules.  There are not any rules except one, and that one is in the definition.  If you do not believe in god, you are an atheist.\n\nI grew up Baptist.  I still live in the bible belt.  But I don't believe in magic, and religion relies on it.", "label": 0}
{"text": "Guy was kicked out by the Catholic church. Imagine being such a giant POS that even the friggin Church that is filled to the brim with horrible people went and kicked him out!!!", "label": 0}
{"text": "As information becomes easier to access atheism should increase.\n\n\nHowever, it has to overcome government subsidies of religion.\nAlso, religious people have more children. Atheists know more about science and reproduction!", "label": 0}
{"text": "I guess it depends on the hospital.  I've never had that experience.  Thank Zeus.", "label": 0}
{"text": "Charlie Kirk is an avid consumer of huge dildoes. Pink dildoes that somehow needs frequent replacement.", "label": 0}
{"text": "Good point", "label": 0}
{"text": "“I’m a fan of man!” - Satan", "label": 0}
{"text": "you dont need to label yourself atheist.   \n\nYou can just be like \"yeah I dont buy into the whole God thing\" and end it there.   However, your reasons for not wanting to be an \"ATHEIST\" are kind of inane.   Your family?   Thats their hangup.   The fact you used to be indoctrinated in a religion and viewed people who didn't believe negatively?  You should be thrilled you got out of that.", "label": 0}
{"text": "It's the cult mentality, a result of indoctrination. To the flock, the cult leader can do no wrong and is all-loving and perfectly just, and any suggestion to the contrary is blasphemy. They accept everything the leader says and does at face value. If something seems bad, they rationalize it away that it's for the greater good.  Cult members constantly make excuses and engage in mental gymnastics to justify heinous actions they'd condemn and be horrified by if anybody but the cult leader did them.", "label": 0}
{"text": "When I realized I was an atheist, I was about 35 years old. I was walking my dogs, and we went past a Lutheran church and then a mormon one. I saw all the cars in the parking lot, and I remembered when I was a kid, getting dressed up and going to church. It was so ridiculous. \n\nLike a light bulb, I understood that religions are based solely on fear. They keep people in line with the idea of hell. I looked down at my two sweet dogs. They don't believe in a God or devil or eternal life. They believe in treats, frisbees, and belly rubs. Fear is what keeps people in church. Fear is control. Now, 15 years later, I'm not afraid of anything. \n\nThere aren't more atheists because fear is so powerful and ingrained in our ridiculous society that their minds are paralyzed by it. If more people understood that, then I think our society will be able to move on.", "label": 0}
{"text": "Reevaluating what you thought was good evidence?", "label": 0}
{"text": "I felt the exact same way when I started realizing it was most likely all bullshit. Growing up in the South, the term 'atheist' carried such a negative connotation that I didn't want that stigma associated with me for the sake of my popularity, so it was hard at first to even let myself think that way. But the more I read and learned the more obvious it became, so I slowly began to accept that I was at least agnostic, but I'd only share that with people I trusted. Years later, I now realize why atheism was treated as such a dirty word. They just didn't have any good arguments against it so they did the next best thing they could, which was to apply social pressure to conform to the religious tradition so they could keep their dominant position in society despite being based entirely on epistemological ignorance. Now I'm proud to have overcome the cultural pressure to conform and to prove that atheists aren't all bad people like I was raised to believe. It's long past time for the stereotypes about atheists to be shit on and erased and that starts with good, rational people not being ashamed to be right.", "label": 0}
{"text": "“… everything God hates: … open borders, the destruction of our sovereignty, the elimination of our currency status …”\n\nI’ve read the Bible all the way through, even Leviticus, which is big on listing all the things that God hates, and I don’t recall those three. \n\nMaybe it was the story of the Xenophobic Samaritan. Or maybe one of the beatitudes? “Blessed are the closed borders, for they shall protect your dogs and cats.”", "label": 0}
{"text": "Because we are mammals.", "label": 0}
{"text": "Because they don’t believe their own god BS", "label": 0}
{"text": "Because they are hypocrites and want their rules to apply to everyone else, not them.", "label": 0}
{"text": "My information on the hospital system states no religion, but the clergy people don’t check. It’s very annoying and actually offensive.", "label": 0}
{"text": "What is wrong with the word atheist? I mean you don't have to call yourself one but if you are asked various questions you might be labeled as one later down the line by someone else. So I think you best make peace with it", "label": 0}
{"text": "You were a theist, so you just moved the letters a bit closer, now you are still Atheist.\n\nDon't worry about labels, I only call myself Atheist when a theist is getting up my nose about religion.", "label": 0}
{"text": "this is it. it is the difference between freedom from X and freedom to do X.", "label": 0}
{"text": "Or they don’t believe it themselves, or they feel the kink is worth a life of eternal damnation.", "label": 0}
{"text": "The \"good\" book **did**, however, clearly state the severity and malicious wickedness of **bearing false witness**, which is so obviously what this vile, dimwitted charlatan is doing (vis a vís such statements) that an actual toddler could call it out.\n---\n*(Example: To biblical authors, they tag epilepsy as \"demonic possession\" as well.)*", "label": 0}
{"text": "If there is a next time, perhaps I’ll say I’m praying to Satan. That should drive them away.", "label": 0}
{"text": "[This video](https://youtu.be/Lz6qUG-3UBc?si=ATjsRH7E1zKTWG7-) from UsefulCharts provides a good overview of some of the different labels that atheists and other non-religuous people use. He has a number of other videos about religious denominations as well.", "label": 0}
{"text": "You talk like math. I can't even comprehend most of that drivel. ", "label": 0}
{"text": "I like to use secular humanist to describe myself if I have to.", "label": 0}
{"text": "It's God so he wouldn't be accountable to anyone if he existed. By definition God can't be immoral.", "label": 0}
{"text": "Everybody else is basically saying what I was thinking, so I'll try saying something different.\n\nFirst, I don't have any experience with paganism and witchcraft, so I won't be able to address that specifically. However, I think that looking at the deconversion stories that are out there---which are predominantly Christian from what I can find---might be helpful.\n\nI think you may have already deconverted, but you are still deconstructing your beliefs. This is a process that can take a long time. There are plenty of former christian atheists who still have a fear of hell decades after they stopped believing in it. It's easier for some people than for others.\n\nOne thing you can consider trying is sharing your story, but I can understand if you don't want to do that. You can also try going to therapy (check out the secular therapy project).\n\nTrying to find a community of like-minded people can also be helpful, but you might have trouble since pagans are already such a small fraction of the population. I honestly have no clue whether there are more pagans or more former pagans out there. If you can't find a community of former pagans, it could be helpful to focus on what you do believe.\n\nYou aren't looking to convert to anything else, but focus on why you want to deconvert in the first place. Who do you want to be tomorrow? What would it take to be them? Try not to focus on what you need to leave behind, but what you need to pick up. That might open up avenues of advice which you aren't seeing now because you are focusing on getting a former pagan's perspective on what you need to give up.", "label": 0}
{"text": "God only exists in the minds of the brainwashed and ignorant", "label": 0}
{"text": "Rather use atheist then agnostic...agnostic broken down means without knowledge...I doubt that is what you want to be labeled", "label": 0}
{"text": "Faith-based hospital systems want to be allowed to let women bleed to death in their emergency rooms.", "label": 0}
{"text": "How does anyone know what god hates?  Ain’t no such thing as god.", "label": 0}
{"text": "In their minds, their religious rules *are* the \"common good\"", "label": 0}
{"text": "Just enjoy your freedom from religion!", "label": 0}
{"text": "I did-many of them are still fake. If they weren’t then they wouldn’t do some if the things they do and still condemn others for doing the same thing", "label": 0}
{"text": "Friederich Engels (iirc) once said that atheism is humanism in theory and humanism is atheism in practice. If you need a label and doesn't want atheist, humanist sounds pretty good to me", "label": 0}
{"text": "Hiding who you are from your family out of fear that they won't \"forgive\" you lacks courage and self-respect.\n\nLosing hope solely because you don’t believe in God anymore overlooks many other sources of meaning and purpose. You may come to laugh at yourself someday over that feeling, as I have.\n\nRelying on the idea that “God is too good to be true” as your \"biggest\" reason is a superficial approach. The biggest thing should be, and always is, the demands placed on us by reason - to believe in what we can substantiate and dismiss that which we cannot. \n\nFinally, rejecting the “atheist” label while feeling compelled in that direction seems less about beliefs and more about social perceptions. I find this to be a superficial avoidance of reality in favor of a softer term.\n\nI've read your other posts. Whether you are a man, a woman, or whatever - Man up. Respect yourself. Trust yourself. Everything starts there. Having your world view change can be uncomfortable. But there will be a day when you realize a greater, more real sense of happiness, and look back on religion with a sense of disgust. The sooner you realize this, the sooner you can begin to plan and work to improve your life with courage and honesty.", "label": 0}
{"text": "it's called hypocrisy", "label": 0}
{"text": "Because everything is forgiven", "label": 0}
{"text": "I'm sorry dude, I only got a few minutes into it.  If you really want to use that murder example, you've gotta tighten up your exposition, and maybe make it a bit clearer and more concise.  I mean, I could make arguments that God is the murderer or that God is natural causes.  You do point out that it's not a perfect analogy, and maybe just either not use it at all (I know you're trying to refute someone else's video) or show that they're using this analogy, but it's a shit analogy and then use your own analogy.\n\nGod of the Gaps just means that there are things that used to be attributed to a divine being, that we can now explain, and are no longer attributed to a divine being.\n\nLightning\n\nTides\n\nDisease\n\nThe stars, the planets, meteors, eclipses, volcanos, earthquakes, light, fire, etc.\n\nThese are all things we can explain (at least in a large part) that were previously attributed to the power or will of a god.  As we fill in these gaps, the realm of their god gets smaller.", "label": 0}
{"text": "People cheat. Most people in the US claim to be Christian. Most cheaters in the US are Christian. Most Christians are cheaters then right?\n\nIt’s just that simple.", "label": 0}
{"text": "Maybe we should stop attaching labels to ourselves and just live.  Labels don’t do much but put us in a constraint of who we should be or have to live up to.  Be a good person, do the right thing and if we mess up, fix it and learn from it.", "label": 0}
{"text": "Hello MysterWacht88,\n\nThe post you've submitted does not have a title descriptive enough to meet our [Subreddit Guidelines](https://www.reddit.com/r/atheism/wiki/guidelines). Please read our rules on [Low-Effort Posts](https://www.reddit.com/r/atheism/wiki/guidelines#wiki_what_are_.22low-effort_posts.3F.22)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*", "label": 0}
{"text": "Faith based groups are just right wing propaganda mills, funded by ruzzia.", "label": 0}
{"text": "Wrong sub.", "label": 0}
{"text": "If I abuse children and become serious about repentance a week before I die, do I go to heaven?", "label": 0}
{"text": "I’d say that’s antitheism, and Dawkins would probably call himself that though I haven’t ever heard him do so. While he’s forthright on non belief and it’s the dangers of religion, he’s not as antitheist as Hitchens was. \n\nHitchens understood the needless harms organised religions put upon populations and nations.", "label": 0}
{"text": "I don’t smoke, cigarettes. But I sure as hell don’t walk about thinking my self as a non-smoker. I don’t define myself by what I don’t do but what I do do. \nSo identify yourself by your do do.", "label": 0}
{"text": "Hey buddy. Been there - right down to the “too good to be true” rationalization, I remember thinking the same thing. You don’t have to evangelize your beliefs. You don’t have to tell your family. You can simply know a thing to be true. Now, there’s something to be said about being your genuine self around those who care about you, but if that’s what’s causing mental distress, don’t push it. There’s time for all that later. Be kind to yourself and find communities or friends where you can talk about these things safely.", "label": 0}
{"text": "It gets even more interesting than that. The same people who want abstinence before marriage, also want to ban porn, sex education, and some of those creepy people even with to the lower age requirement for marriage. So they want to keep people ignorant I wonder why religious people have a tendency for the whole sexual assault thing", "label": 0}
{"text": "Everyone is agnostic in that nobody can ever know if gods exist.\n\nAtheist isn't really a label, it's the default state, everyone is born not believing in gods, not believing in fairies, not believing in danta, etc.\n\nIt's only through people lying to you that you might start believing in those things", "label": 0}
{"text": "This just in, pedophile announces support for other pedophile.", "label": 0}
{"text": "Lots of good help here. \nBut a good way to BE while being an atheist is DON'T be an Atheist. \nSimply do not make those of other beliefs or non-beliefs be Apologist for their feelings and thoughts. \nAlso don't take shit off of pushy believers.", "label": 0}
{"text": "Uhh, the most widely accepted ,prevalent theory of the origin of the universe ? ( Surely you must-have heard of it ; the theory ,not the sitcom.)", "label": 0}
{"text": "No ,the whole thing's riveting!", "label": 0}
{"text": "Xtians favourite saying... 'Do as I say, not as I do\"", "label": 0}
{"text": "It’s okay if you’re female ?", "label": 0}
{"text": "To be fair, the tenets of Christianity are designed to be violated, such that we all have a pressing need to make a groveling apology for our very existence to the one who created us, as if it's our fault that we're alive.", "label": 0}
{"text": "Indoctrination is so hard to ignore by weak minded humans.", "label": 0}
{"text": "Christian/conservative values:\n\n\\- supporting a rapist for POTUS\n\n\\- voting for someone (e.g. Trump, Cruz, etc.) who breaks their god's commandment about lying dozens of times a day. Sometimes dozens of times in the span of a few minutes.\n\n\\- worshiping a being that's for whom genocide is his go to solution for everything.\n\n\\- supporting the \"Christian values\", as taught in the bible, of rape, incest, torture, human sacrifice, slavery, etc..", "label": 0}
{"text": "And a little wine and crackers but not nearly enough to have a good time", "label": 0}
{"text": "\"Let us tell you what to do with your lives or its not fair.\"", "label": 0}
{"text": "The reason that the Catholic Church tried to get translations or the Dead Sea Scrolls restricted to scholars and not released to the public is that most of them are personal letters, the news and gossip of the day.  Almost all of the major characters in the New Testament story are mentioned, Herod, Pontius Pilot, even Mary Magdalene are there with the exception of two people who are conspicuous by their absence... Jesus and John!", "label": 0}
{"text": "I agree.", "label": 0}
{"text": "33 “‘When a foreigner resides among you in your land, do not mistreat them. 34 The foreigner residing among you must be treated as your native-born. Love them as yourself, for you were foreigners in Egypt. I am the Lord your God\n\nLeviticus 19:33-4\n\nGod hates people mistreating immigrants...\n\nThank goodness Trump would never normalize false information like they're eating pets...\n\nOr that they're all murders, drug dealers and rapists ...", "label": 0}
{"text": "It is the difference between a worldview based on critical thinking and a worldview based on faith.  With or without evidence, a person with true faith *believes*.", "label": 0}
{"text": "Is it?", "label": 0}
{"text": "Has that ever converted anyone? Ever?", "label": 0}
{"text": "This is true, I asked my Christian friend the same and she confirmed she would still believe. Some people are too far gone.", "label": 0}
{"text": "Last time I was hospitalized, I was asked 4-5 times about what religion I professed. All times I answered with “no religion/agnostic”. Mom was there and the nurses looked at her like “really?” She just shrugged and smiled. Mom’s really catholic.", "label": 0}
{"text": "That group is not on the fence, so who cares if they’re offended? They’re already voting for Trump and other Christo-fascists enablers.", "label": 0}
{"text": "Is not collecting stamps a hobby?", "label": 0}
{"text": "Insanity;  the only videos in existence…of *anyone* saying this….is of MAGA saying “someone-else” said it!", "label": 0}
{"text": "oh i would accept its existence, no doubt.\n\nBut I will deny it worship until death. If it really exists, it's the most malicious entity in existence.\n\nSo for me it's more probable that the devil exists", "label": 0}
{"text": "Atheists might change their views with clear evidence, while some religious people might hold on despite proof to the contrary. it's all about how deeply those beliefs are ingrained. thoughts like these can spark some great discussions.", "label": 0}
{"text": "God hates in mysterious ways.", "label": 0}
{"text": "Embrace it instead of ignoring it. Being able to change your mind shows a willingness to grow. \"Athiest\" is just a word.", "label": 0}
{"text": "Just by being asked this question, they think the world / satan / god is testing them. And they’ve been told repeatedly what happens if you fail “the test of faith.”  Those that say they’d still believe are only saying so out of fear.", "label": 0}
{"text": "Atheism is not a religion, it’s a point of view or belief about only one thing. I don’t like labels but if I had to pick, I’d go with ‘humanist’ which make sense, me being human!", "label": 0}
{"text": ">Hi, why did you repent? Why did you ask for forgiveness? \n\nIt's in the former prompt. Legitimate repenting in one's own actions. \n\n>The answer to your question is yes. If you truly repent and trust in the Lord, then you will be saved.\n\nWell I guess that does explain priests", "label": 0}
{"text": "Just cause I didn't mention it every service they perform doesn't make it different. They perform the same actions as was described, I was just providing details on the *chapel* being there for those who want it. The chaplin still visits all residents in the hospital regardless.", "label": 0}
{"text": "I disagree... there are people who were sincere in their belief who have lost faith.  So there are some religious people who can be shown evidence and no longer believe.  There are surely people who wouldn't listen to the proof, and there are people who already don't believe who would continue to lie and say they do for profit or to fit in socially despite the proof.  But that is different than not changing their beliefs.", "label": 0}
{"text": "Riveting?", "label": 0}
{"text": "Probably for similar reasons as to why they're obsessed with children's genitals and sexualizing the most innocuous things.", "label": 0}
{"text": "Agreed.", "label": 0}
{"text": "Yep the US. My husband is in out of hospitals and he's visited by a minister at least once every time he goes. One stay, I had to get rude with him when he kept coming back day after day after being told no. It's disrespectful to keep pushing like that, regardless of your faith.", "label": 0}
{"text": "Yeah! Absolutely. In fact I wish there was a good god and a happy afterlife.", "label": 0}
{"text": "This is normal when converting from theist to atheist (among other feelings).\n\nYou'll get over it probably faster than you think you will. You know what you are. Embrace it.", "label": 0}
{"text": "As others have said, you don't have to label yourself.\n\nBut even if you did, you don't have to tell anyone.\n\nI've been an atheist for 6 years and have only told one person in my family \n\nBut I don't know why you would feel that atheists are misguided. That might just be internalized prejudice \n\nI will say that yes some are idiots. But that's not because of their atheism. Atheism doesn't automatically make you better or worse than anyone else", "label": 0}
{"text": "Religion is artificial. Being an atheist just means you haven’t been convinced by any cults to believe. Being an agnostic means you are an atheist but can’t quite abandon the demanded respect for the religious notions of your culture, imo", "label": 0}
{"text": "..and said-Vatican Official now believes, we should heed someone whose been ex-communicated by an imaginary God?…stuffed animals are far scarier.", "label": 0}
{"text": "Well, that was a big bucket of nonsense.", "label": 0}
{"text": "Thank you for your submission. Unfortunately it is been removed because [images are required to be posted within self posts](https://www.reddit.com/r/atheism/wiki/guidelines#wiki_4._image_policy) on r/atheism.    \n   \n**[CLICK HERE](http://www.reddit.com/r/atheism/submit?selftext=true&text={link}&title={title})** to repost this image in compliance with the image policy. *(This does not work for i.reddituploads.com or i.redd.it. For those links you will need to follow the [instructions located here](https://www.reddit.com/r/atheism/wiki/guidelines#wiki_how_to_make_a_self_post_for_an_image_using_a_web_browser.3A).)*   \n   \nPhotos containing **Personal Information** including license plates cannot be shared anywhere on reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*", "label": 0}
{"text": "I marked “Atheist” in the religion box once that became an option.  Before that, “None” was only decent option.  Of course, come to think of it, last time I was in the hospital, I had salmonella and was quarantined, and that kept the chaplains out.  Guess they didn’t believe gawd would save them from that 🤣", "label": 0}
{"text": "It's a thought that you happen to share with others that may or may not believe in the other things you believe or care about. I'm a big animal person but I don't get upset if someone that hates cats also likes the same type of dogs I own. You're not joining a club, unless you actively want to. Being an atheist is just a theory you happen to subscribe to. It doesn't actually identify anything else about you since it's just believing in a lack of something.\n\nThat said, I hope now you realize what painting people in broad brushes does. It certainly doesn't help you in the long run or the people you're making assumptions about. I don't blame you though. Theists often find *certain stereotypes* of atheists helpful. If you don't see the world in shades of grey and only through the lens of religion these stereotypes help keep you a believer. Because after all, if those people are stupid, and you're not stupid, you must not be whatever the stupid people are.", "label": 0}
{"text": "Yea, no need for science ", "label": 0}
{"text": "Happy Cake Day", "label": 0}
{"text": "No abortions are performed in catholic hospitals  never have been. If you are 40 with 4 kids already, they won't tie your tube's after your last birth. You need to go to another hospital, and have another procedure.", "label": 0}
{"text": "Physians are never forced to perform anything.", "label": 0}
{"text": "why are so many priests pedos? why are so many evangelical politicians sucking dick in bathroom stalls? because they don't ACTUALLY give a fuck. And remember all you gotta do is confess your sins before you die and it's all good, they got a get out of jail free card waiting at any moment to absolve them of wrong doing.\n\nOh yeah because religion is bullshit and made to control people and stop them from fearing death. People gonna people.", "label": 0}
{"text": "I think many people who use the title of atheist often spend too much time speaking about the hate of religion. \n\nI grew up Catholic, but when I came of age, I could not understand how \"faith\" should replace logic when it comes to the origin story and dogmatic practices. \n\nHowever, there are good lessons from my upbringing about how it is in our better interest even here on earth to treat others with compassion. This is often hypocrisy coming from many religious folks, but still an ideal many strive for. \n\nI believe the historical stories about religious leaders doing great acts of service are still inspiring. Jesus was a real man who spoke against the wealthy taking from the poor. He disregarded many class boundaries by washing the feet of people that should be below him. \n\nI also learned how to sit in a church and listen to someone I disagreed with, and how to respect those who were professing their faith without harming anyone else.\n\nThe other side of the coin is that Christian nationalism is on the rise and it must be challenged. However, I think we all lose when we resort to name-calling and other tactics that dehumanize people.\n\nWe live in a very objectifying culture. I have started to focus a lot less on what \"category\" a person is when I interact with them. They are a person who is obviously not me, so different in many ways, but we have common ground in humanity. That is enough for an instant base level of respect and reverence for me.", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "For the Children, right?", "label": 0}
{"text": "That sounds pretty fucking metal", "label": 0}
{"text": "Abortion is not againts your will what are they trying to do now tf", "label": 0}
{"text": "and gay itself is originally also a euphemism", "label": 0}
{"text": "waiwaiwait....Jon Hamm's character in the latest season of Fargo is based on real fucking people?!", "label": 0}
{"text": "Most christians aren't devout... they are culturally christian.  They have a fairly live and let live mentality compared to the fire and brimstone folks.", "label": 0}
{"text": "I was working in a seriously rural area full of evangelicals. Damn near every one of them was cheating or swinging.", "label": 0}
{"text": "No clergy signs are good anywhere.", "label": 0}
{"text": "Say you’re not a believer.  Actually you don’t need to say anything.", "label": 0}
{"text": "It's almost like it's all made up", "label": 0}
{"text": "Somebody asked me once, \"...well what are you then?\" I said: \"I'm kaoticgirl.\" \n\n\nThat's enough for me.", "label": 0}
{"text": "I'll be honest and state that I don't agree. My thinking is this: if you can 100% prove something exists, that makes it natural and explainable, so it wouldn't be a god.\n\nSo I'm not completely disagreeing, but kinda/sorta?", "label": 0}
{"text": "So don’t call yourself an atheist. Easy.", "label": 0}
{"text": "Then the rates of pedophilia in the medical field would surge.", "label": 0}
{"text": "There are more Atheists, they just quietly go about their days not believing rubbish and not advertising the fact.", "label": 0}
{"text": "Excellent point. I also want to specifically validate how hilarious it is to think saying, \"It's for the greater good!\" somehow \"shifts\" the burden of proof on the arguer to somehow disprove that claim- despite the fact that it is a completely unfounded, unproven assertion. Like they think a \"burden of proof\" is synonymous with \"a counter claim\".", "label": 0}
{"text": "No one is labeling you except you and the religious community. Unlike Christianity and Islam which requires you to proclaim your belief, you aren’t required to proclaim your disbelief. \n\nAsk yourself why you are clinging to a label of any sort. Is it because you need a community or something bigger than yourself to belong to? Maybe this can help you determine why you’re struggling with the label issue when there’s so many other arguably, more important things about your religious indoctrination you need to deconstruct.", "label": 0}
{"text": "Congrats, they don’t have to do that either", "label": 0}
{"text": "If you start taxing them, they will become a legitimate major political force, not just an outlier. Be careful what you wish for.", "label": 0}
{"text": "I'm sure someone has mentioned it already, but agnosticism and atheism are different things. Agnosticism is a philosophical statement about whether or not you can definitively say something is true or not, in this case \"know\" god does or does not exist. Atheism is a statement of belief. I don't believe in God. I personally am an agnostic atheist. I don't believe God exists, but I don't think one can prove one way or another if that is true or not.", "label": 0}
{"text": "There is a podcast you should check out..  Skeptics Guide to the Universe.  The members of the podcast, as well as the listeners that frequent their discord chat, are kind supportive people for someone that is in this sort of \"limbo\" situation you find yourself in.  You're far from alone, and they are a great resource if you want/need it.  Keep your head up, and best of luck!", "label": 0}
{"text": "My problem with being atheist is I get associated with people who treat atheism with the same evangelical vigour as a theist. \n\nIt’s like being socialist. There are people who believe n socialism and people who believe in SOCIALISM!!! ⚒️", "label": 0}
{"text": "Your thoughts are part of the process of growing. \n\n\nYou're thoughts have changed, remember this axiom: \"Sacred cows make for the best steaks\". I've had to choke down a few SC steaks and I'm better for it in the long run.", "label": 0}
{"text": "No one could possibly prove to me with 100% certainty that gawd exists other than gawd itself.", "label": 0}
{"text": ">Since these laws appear to apply all the time to everyone and everything, the only thing that changes is **our understanding of them** - the fundamental laws of physics have always been the same (as far as we can tell).\n\nPrecisely! If it were 200 BC, I wouldn't have that same understanding, and therefore, my perception would also be different. When I'm alone in the night, and I think of something that I just have to tell Socrates, tomorrow, \"the Night spoke to me.\"\n\nYou are hearing someone describing reality with the scientific method of the time, in a way that their contemporaries can understand.\n\nPhysics is an abstraction... probably the shortest one, the Planck Abstraction, if you will. But what MADE it. Countless hypotheses, constant failure, and when we could store them so they could outlast even the breaths of our descendants, then we truly discovered something \"divine.\"\n\nOver centuries we built our understanding, we were regularly \"blessed\" by the Muses with new creative artwork. Granted inspiration to conceive of new ideas, new ways of imagining things. We stored these things of utmost value, priceless things.\n\nWe hold sacred texts due to their value in education. We appreciate the tamed chaos of the artist, and admire the masters at their craft. \n\nDoes all of this fit within the \"scientific method\" the \"creator god\" of our understanding? Do we believe the scientific method will continue to provide us with understanding? Do we secure that belief with prior work?\n\n>When it comes to religion, there is NOTHING that everyone agrees on.\n\nHah! At one time, they all agreed that the key to religion, was the \"burning purple.\"\n\n>I think the solution is to just stop believing in these mythologies altogether...\n\nWe should believe in the power of abstractions, they can be useful for communicating complex ideas, in fewer terms. I can describe the sunrise to you without having to do the double-slit experiment.\n\nWe should learn from the past, as it is the basis for the education we both agree is vital to our species. These \"myths\" are termed that from our perspective. These were once truths. We should understand why.\n\nThank you for this discourse. I think there is a middle ground neither of us have realized. I'm reminded of a Hitchen's quote I'll butcher for you: \n\n\"If I could somehow fix the belief in religion, I wouldn't... there's some beauty experienced by those faithful believers, and we have the art, the literature from them... and I think we'd all suffer a great loss without it.\"", "label": 0}
{"text": "I've been there. I grew up with atheist being a very dirty word. If you don't want to call yourself that, you don't have to. There's plenty of reason to avoid that term (close ones not liking it, etc). It sounds like atheist is likely what you are. But there's no need to tell anyone that if it'll make you and others uncomfortable or cause you problems", "label": 0}
{"text": "When I was a Christian, I just got married. That’s how I curbed my lust. But it didn’t curb my now ex-husband’s. I was also used as a receptacle so that my now ex husband would not be tempted to watch porn. I had to catch every single seed LMAO (so insane).", "label": 0}
{"text": "Congratulation you have chosen the label I hate most among people I agree with. I'm sure other hipsters will be along to praise your centrist wisdom", "label": 0}
{"text": "And your saying Kamala is? The same person who with held evidence from a court until forced to reveal it?", "label": 0}
{"text": "Successful irritation.", "label": 0}
{"text": "How so?", "label": 0}
{"text": "There actually is no solid proof.  The proof you claim was written by a dude who was born more than 50 years AFTER Jesus supposedly died.  That's not proof any more than the novel Avalon is proof that a wizard named Merlin existed or a kid pulled a sword out of a block of stone and became the king of England.", "label": 0}
{"text": "This!!!  When my mother was dying in hospice she said she doesn’t want any religious people in her room. Of course, some god seller walks in following a staff member. I stepped in front of of them and said NO she doesn’t want you in here. They both looked at me like I’d just opened the top of my head and pulled a gun out. Then they chuckled and tried to go past me. I stepped in from of them and again said NO.  Apparently they decided I was intellectually disabled and began to explain what they were doing. I told them I knew what they were doing and I wasn’t going to allow them in. They hemmed and hawed and eventually left.", "label": 0}
{"text": "I just say no thanks, I've got all the god I need. They have left me alone.", "label": 0}
{"text": "I thought it was up to God to decide who's a Christian and who isn't.  Did he need some time off and hired the job out to you, or what?", "label": 0}
{"text": "This is the best post of the day. 🤣🤣🤣🤣🤣", "label": 0}
{"text": "I had a lady stop by while I was in the ICU and following my daughter's birth when she was in the NICU. I thanked the lady but told her never to come back. She still stopped by a few times, asking if I had changed my mind...I hadn't.", "label": 0}
{"text": "That's true.  Just the vast majority.", "label": 0}
{"text": "I'm not sure what would constitute proof of god.", "label": 0}
{"text": "There are many pastors who don't support Trump, and a lot of Christians don't vote for Trump? I don't see your argument here.", "label": 0}
{"text": "It's a plural -- Christians -- and does not need an apostrophe.", "label": 0}
{"text": "Because most Christians are (thank \"god\") cherry pickers!\n\nBecause nobody in a modern country is truly a Bible-Christian anymore, why? Even the most fundamentalist christians don't have slaves, they don't stone their children to death if they are disobedient, they don't rape etc.\n\nSo frankly even if it is still very old fashioned, christianity was made to fit modern society (more or less! Many still are against pre-marital sex!)", "label": 0}
{"text": "The one who compared himself to Moses and believes he was selected by God to be Speaker?", "label": 0}
{"text": "Those that control the past, will control the future. ", "label": 0}
{"text": "We're all just human beings", "label": 0}
{"text": "**Absolute certainty**\n\nFair point that I was inconsistent with the definition. I was thinking that the “absolute certainty” is what theists typically demand of atheists that do not call themselves agnostics. \nIt could be that if one claims to know truth, it’s necessarily with absolute certainty. However, I wanted to discuss the question primarily from the definition of JTB. If absolute certainty derives from claiming knowledge, your moon knowledge has to be absolute certainty. \n\nIf you claim that you know (JTB) that the moon exist, you have to have a method of knowing it to be true - could this be done without certainty?\n\nYou seem to only need a belief to be justified to constitute knowledge? If this is the case, you simply reject the JTB, and of course - then my post could be nonsense since it depends on that. If we only think that justified belief is enough for knowledge and reject JTB, i think “agnosticism” makes even less sense. If I didn’t think that there is a justification for not thinking that any gods exist - why would I be an atheist? (But this could be a separate discussion)\n\nWe could claim that reality objectively exist, the question in philosophy is however if we have access to it, or only a model of it. \n\nI do understand there are multiple definitions of knowledge, but if we don’t use the same here - the discussion is pointless. \n\n**justified true belief**\n\nOk, so we seem to agree that knowledge may be impossible to have (this is one of my major premises), which makes the prefix specifically for the godclaim pointless since it doesn’t give any information. \n\nSure, one can _claim_ to have knowledge, but my point is that one of gnostic atheists and gnostic theist don’t _actually_ have knowledge. Of course one could be mistaken, but if we look from the perspective of a gnostic theists - this positions necessarily means that “gnostic atheists don’t exist”, only people who think they are - but as you say, they could be wrong. \n\nMy question is then, if we acknowledge that the gnostic theist could be wrong about having knowledge and only _claim_ to have it. What use does the “gnostic” term fill? What is the actual difference from a mistaken gnostic theist and a agnostic theist that is so sure that god exist that he would bet his life on it - but not claim it to be knowledge (for a lack of path to truth)?", "label": 0}
{"text": "As far as I know there are not a lot of non white \"White Christian Nationalists\"", "label": 0}
{"text": "They either think it’s God‘s will, or they think they are representing God‘s weenie. \nI think the majority of prayers spoken by American Christians are basically the same, please be real, Please be real, please be real, because they fear the responsibility for their thoughts and actions. I wouldn’t be surprised if 75% of religious leaders Don’t believe a damn word of what they’re telling their followers. That’s why Donald Trump is worship like a god among them, because he’s the greatest liar they’ve ever seen outside of themselves.", "label": 0}
{"text": "hypocrisy tastes good?", "label": 0}
{"text": "Yeah just enjoy your freedom and your free will.", "label": 0}
{"text": "The poster probably doesn't gaf about that because it isn't likely to affect them.", "label": 0}
{"text": "TRUMP FOR PRISON 2024", "label": 0}
{"text": "i actually love the sound of the church bell 😬 dislike churches generally but i just think there is something pleasant about the bells.", "label": 0}
{"text": "Hahaha the concept of leaves 😂😂", "label": 0}
{"text": "😂🤣😂💀💀…love it. Worst book club ever!", "label": 0}
{"text": "Story time, or why I wonder whether hospital staff are just as annoyed by the clergy as many patients are.\n\nI am a now ex born in JW. I never formally exited or was kicked out, I just moved locations a few times in quick succession and they lost track of me along the way. \n\nThe JWs have a strict ‘no blood’ rule for members and the elduhs in the ‘hospital liaison committee’ will turn up at hospital ostensibly to support the member but really to make sure that no member is getting blood or related forbidden treatments. The have strict punishments fir members who breach that rule.\n\nWhen I had a significant surgery a year ago, I was warned that there was a reasonable chance a blood transfusion might be required. I signed all the consent forms etc. But I was worried that health information might be leaked to my mother (who is still in but doesn’t shun me and gets criticism from extended family for that) or that she might ask for the HLC to go to the hospital to “support” me. \n\nI signed a medical power of attorney form nominating that only my husband could get any info or make decisions about my care if I couldn’t and made it very clear to staff that they were to follow those directions to the letter. I was asked the reason and as soon as I said ‘Jehovah’s witness’ the response was a very enthusiastic ‘that’s great, we won’t tell anyone you are even in here’ which repeated a few times over. I got the feeling that the hospital staff were quite happy to avoid the HLC turning up! 🤣", "label": 0}
{"text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.", "label": 0}
{"text": "You dont need a label. You dont even need to be sure what you believe. It takes years to figure it out and some of us are still trying. None of it really matters. I would suggest stop obsessing about it, park it on the shelf for now and get on with your life. Come back to it with fresh eyes when you feel ready. No one knows what is in your head so no need to worry about your family.", "label": 0}
{"text": "Stop being a weenie.", "label": 0}
{"text": "Ah, no true Scotsman.", "label": 0}
{"text": "The hypothetical you pose is impossible where the Judeo-Christian doctrine requires faith in the existence of the deity & proof denies faith \n\nQED proof destroys faith", "label": 0}
{"text": "Atheism is based on facts", "label": 0}
{"text": "His Christian supporters don't care.  He'll most likely get the majority of the Christians' votes, just like he did n 2016 and 2020.", "label": 0}
{"text": "I am an enthusiastic atheist but also a healthcare worker in acute care. Our hospital chaplains are wonderful, respectful professionals who offer an invaluable service to our patients (those that choose to see them). Upon admission a patient’s religion is asked about and if they choose not to be visited by the chaplain that is 100% respected. The chaplain does respond to codes, but that is primarily to be available in case a family member wants their support at that time. If not, they respect that. I’m very sorry you’ve had bad experiences. I know I myself will not want a chaplain to visit me in the hospital. But for many people who are acutely ill, their visits are very helpful and I am glad it is a service that is offered!", "label": 0}
{"text": "Most Christian voters cast their ballots for him twice.  Most of them will probably do it again this time.", "label": 0}
{"text": "You had me at “infernal monster”", "label": 0}
{"text": "They invented a loophole to get away with literally anything except oposatcy", "label": 0}
{"text": "Exactly. Most religious people cite faith and aren’t interested in proof.", "label": 0}
{"text": "It's so invasive when people barge in without knocking, especially when you're not feeling well. having a sign to say \"no clergy\" sounds like a smart way to set boundaries. it's all about making your space comfortable while you recover. hospitals should respect that.", "label": 0}
{"text": "That would defeat the point.\n\nYou don't believe a fact. You know a fact, or you comprehend a fact. If there is 100% proof, faith is pointless. It's like asking \"Do you believe in hats? Cause there's one right behind you.\" \n\nI have 100% proof my cat exists. I don't believe in him. I know. (Well, I *believe* he's an idiot, but that's why I love him.) I also don't feel compelled to worship him, though I do make regular treat offerings.\n\nThat said, proving he exists and proving he is omnipotent, omniscient, and eternally benevolent are entirely different things. Getting me to worship him an even taller feat.\n\nThey aren't actually asking if you'll believe in God if they can prove it. They are asking if you'll humbly scrape and beg for forgiveness for your skepticism and devote your life to gargling his balls for the rest of your life.", "label": 0}
{"text": "Wait, what? Who the hell am I paying £10 a month to then?", "label": 0}
{"text": "Because they're terrible people.", "label": 0}
{"text": "Atheist has become a dirty word that has been dragged through the mud by the sheep. Just embrace it.", "label": 0}
{"text": "Hundred percent with you on \"If God is real he's a fucking psychopath.\"", "label": 0}
{"text": "Means nothing! No one cares what this person says!", "label": 0}
{"text": "Some people get so uptight about premarital sex. My wife and I raised four daughters. Every one of them felt comfortable enough to come to us and ask for birth control when it was time — 15, 16, 17 whatever. No lectures, no judgment. If they’re old enough to ask, they’re old enough to get it. Teens are human. They’re going to fuck. Might as well give them the tools to do it safely. If they wanted to ride a bike, you’d buy them a helmet, right?", "label": 0}
{"text": "Another loon for t.", "label": 0}
{"text": "Rabbit bone?", "label": 0}
{"text": "Agree to disagree on most of what you said.", "label": 0}
{"text": "The 2024 RNC crashed Grinder.", "label": 0}
{"text": "Don't worry too much about it. My background is Mexican Catholic, it's super ingrained in our culture, can't really escape it. I will go to church to baptize my niece, but I refuse to do the confession thing (my last one was on Friday Nov 13, 1987). I simply don't believe anymore, when I do have to attend it gives me a chance to really analyze what the priest says instead of just blindly following. \n\nYou don't need to be militant, most of us aren't. If someone wants/needs their faith it makes no difference to me, unless they come to my door and waste my time. In time you will feel more at ease. Welcome to the non-club!", "label": 0}
{"text": "It's taboo.  There's a theory that the reason they don't want to condone LGBTQ and they are generally restrictive is that if it's mainstream and accepted, they can't get off.", "label": 0}
{"text": "I appreciate your story so very much. I'm going to then admit my secret. I am on my second organ transplant, and I have experienced numerous orthopedic surgeries. Every time I am in my hospital room, trying to not be stressed out, a religious person would walk in. It became my dread. My confession is, one of the times when I was in the hospital and two nuns walked in my room. I lifted up my index finger and shook it while I said nope, nope, nope, nope. They looked shocked and turned around and walked out. I just was so sick of it constantly happening.", "label": 0}
{"text": "You're almost there, bud. Keep coming to the light.", "label": 0}
{"text": "It's not a group, we don't have meet ups, and you don't have to call yourself anything at all.   Personally  I like skeptic.", "label": 0}
{"text": "I think atheism and agnosticism addresses 2 different e concepts.  Atheism is to the concept of belief and agnosticism is about knowledge.  So if you don’t believe but also don’t claim to know there is no god, you would be an atheist agnostic.", "label": 0}
{"text": "Exactly, it's like you can't just read the bible and a few other books based on someone else's thoughts on that very book & call yourself a scholar. That's like reading a very long book/series & then a bunch of book reports, dissertations, & essays about that book & claiming yourself an expert in that field. By that same example I could say that Middle Earth is real and all of its teachings, after all much has been written & discussed about it right? I mean J.R.R. Tolkien is real, so... How do we know it's not some divine inspiration? LOL", "label": 0}
{"text": "why do atheists have so little? /j", "label": 0}
{"text": "Could be worse. Could be Mormon missionaries or scientologists.", "label": 0}
{"text": "A rabbit fossil dated to the paleolithic period", "label": 0}
{"text": "Hypocrites. It's that simple.", "label": 0}
{"text": "As a believer, i think everyone should have a period of agnosticism/atheism it's healthy. \n\nAs for losing any \"reason\" to believe in God, you will never find a perfectly logical philosophically airtight argument for God's existence. You will find, that you may choose between belief and unbelief, since either side is equally fallible. (unless you ask occam's razor ig)\n\nAnyway, it sounds like you might associate God existence with hope. And when given the choice to have hope or not, I chose to believe. And life has significantly improved. Whether God metaphysically exists or not only matters if you're trying to justify a human end (crusades, LGBTQ suppression, etc)\n\nWhat matters the most regardless of the literal existence of God is how your belief or unbelief affects your life. \n\nThe world has left little room for belief if you reason only in logic. Decide which works for you", "label": 0}
{"text": "Lable is unimportant, but if you need to label yourself, just use freethinkers or non-religious", "label": 0}
{"text": "Most Christians are hypocrites.", "label": 0}
{"text": "Simple.  Religion is fake, but hormones are real.", "label": 0}
{"text": "If God sent his son to teach us mortals lessons, as recorded in the Bible, then he's not exactly going to be the biggest fan of the one who opposes all of these morals. See recent comments of mine such as [this](https://old.reddit.com/r/atheism/comments/1g7i6dg/kamala_harris_is_being_called_antichrist/lsrtnoz/).", "label": 0}
{"text": "I have tried that before with those guys and I always get hit back with a “what about” “you aren’t  understanding”", "label": 0}
{"text": "You don't need a label.", "label": 0}
{"text": "I don’t believe in any of the 4,000 gods history has presented us with due to a lack of evidence. Is this something you can  agree with?", "label": 0}
{"text": "Christians have sex because they are human and humans have sex", "label": 0}
{"text": "Imagine your freedom to choice… is now viewed as a “concession”.", "label": 0}
{"text": "A lot of philosophers say knowledge is defined as a justified true belief. So when you say you know your cat exists because have seen it, you are expressing a justified true belief. This is what I think the OP is getting at. You can know god exists if it is proven to you, the proof is the justification for your belief. Assuming god is real then you will know god exists. That is not the same as believing *in* god. Like ‘go on god, you can win the race, I believe in you’.", "label": 0}
{"text": "I agree with you on this.", "label": 0}
{"text": "One word, hypocrites", "label": 0}
{"text": "Me when I was a Muslim😂 If Gods the most merciful ima make use of that🤷🏽‍♀️", "label": 0}
{"text": "It's just a descriptor that mean's you're without a belief in a deity.  What ever anyone else throws on that is on them.\n\nYou can call yourself a non-believer if you want, doesn't really matter one way or another cause it's only describing a fraction of who you are.  It says nothing about your morals or ethics or empathy.", "label": 0}
{"text": "Ex communicated and we care what he says??", "label": 0}
{"text": "So the Pope want american to vote for Harris?", "label": 0}
{"text": "If Kirk is a shining example of everything God wants, I'm fine being hated by their God.", "label": 0}
{"text": "I became an atheist in the last year or so. I also live in Indiana so I am very careful with who I tell, but at the same time I don’t need anyone to know. In fact, I still go to Catholic Church most Sundays because my wife isn’t ready to move on from the lie that is religion and gods. \n\nTake comfort that you aren’t alone in your beliefs and that you don’t need to satisfy anybody. There are way more of us out here than you probably realize, but many of us will fake it for keeping up appearances, avoiding annoying neighbors dumb questions, etc. \n\nA good book to read or listen to (my atheist friend bought me the audiobook and in this case I think it was the way to consume it) is “The God Delusion” by Richard Dawkins. Very helpful for me. Also, there are many good clips online of Neil Degrasse Tyson talking about not believing in god that are very good. He might be the most popular atheist alive (or people don’t realize he is).", "label": 0}
{"text": "In areas where atheism, meaning not actively believing in a god, is the norm, few identify as atheist. Case in point my country the Netherlands.", "label": 0}
{"text": "A/gnostic = to not know/know. \n\nA/theist = to not be religious/religious. \n\nAs such, because most theists operate on \"faith\" and not \"knowledge\", most theists are agnostic. And because most atheists can't \"know\" god is real or not, but simply lack evidence and thus do not believe, most atheists are also agnostic. \n\nAgnostic and atheist are not on the same spectrum. You are an agnostic atheist if you do not believe in a religion but admit you don't \"know\" whether or not god is real. Educated atheists always say there is not enough proof for the existence of God- not that they know with 100% certainty that no god exists.", "label": 0}
{"text": "I like the term my flair shows but nothing really gets as close as non-theist for me. I'd say there's no reason to label yourself too quickly. It's ok to think that it may not be as arrogant to assume there's *nothing* as it is to insist there is and to know its will, but still somewhat presumptuous to insist there isn't without proof.   \n  \nBest just to be ok without needed to be right about it, just as long as you know exactly how to clearly discern what is wrong...because there's all too much of that out there when it comes to spirituality and religion.", "label": 0}
{"text": "Churches were built to glorify God and impress the peasants.  They were social centers, still are, where the human livestock gathered to be managed by their betters.  So why not put the bell there as a center of the community.", "label": 0}
{"text": "Yep, and don't be scared to break out Matthew 6: 5-6. 😉", "label": 0}
{"text": "Here in Greece we gonna wait but our time will come.", "label": 0}
{"text": "That doesn't make sense as an objection. Trump's support base are almost entirely Christian. That doesn't mean Christians all support him.", "label": 0}
{"text": "A slippery slope for both sides of the spectrum. How could you ultimately prove one way or another that there's an actual god, and that it's not some entity that has evolved god-like qualities?", "label": 0}
{"text": "My grandmother (about 100 years before her time), used to just say she was \"callithumpian\" when asked. I think if she was still around nowadays, she'd just tell you to sod off. She was the best.", "label": 0}
{"text": "The correct position is atheism. Simple.", "label": 0}
{"text": "Because sex is a biological imperative and you can’t just pray that kind of thing away.", "label": 0}
{"text": "Also a good point.", "label": 0}
{"text": "Yeah I think I was making a generalization. Not all atheist would believe and not all religious people would continue believing. I do think my claim is true for the majority of both groups though.", "label": 0}
{"text": "Dirty protest usually works", "label": 0}
{"text": "the thing that people seem to forget or misinterpret about atheism is that it’s a lack of belief. the whole point of atheism is dismantling the beehive mindset and using your brain to critically think about things. you’re not part of a club and no one’s forcing u to be. don’t label yourself because you don’t have to. and this is a way of life you should start straying away from bc labels are what make religious people what they are.\n\notherwise, religious guilt is a bitch of a thing to deal with. i was raised as an atheist by atheist parents but in a religious community and the fear i felt for my parents cuz of how young and impressionable i was was something that i don’t like to remember. it’s even tougher to have been religious yourself and figuring things out on your own— congrats though.", "label": 0}
{"text": "This, yes 100%. I came here to recall this story. I was an atheist already, of course. And a fan of Bill Nye as a science communicator. But this moment at the end of the debate just nailed it for me. Everything I needed to know about either of those men or anything they believe was said right there.", "label": 0}
{"text": "All i see are Luke, matthew and john's opinions.", "label": 0}
{"text": "He would have to have actually existed first.", "label": 0}
{"text": "Well, at the least they're deciding that they know better than the women do about what is true and good, about what is best for them, and about what their medical and personal circumstances are. They may not be \"twirling their mustaches\" level of evil, but they are certainly dismissive, arrogant, inflexible, and intolerant. Not to mention totally lacking in empathy. That all adds up to evil, even if it doesn't match the \"twirling their mustaches\" standard.", "label": 0}
{"text": "This is a hypothetical scenario, I don’t think we could actually ever prove that some sort of deity does or doesn’t exist with 100% certainty.", "label": 0}
{"text": "Most are hypocrites", "label": 0}
{"text": "I usually say, \"I'm not a believer\" to lessen the blow to the listeners' ears. People seem triggered by the word atheist and forget that all it means non-believer.", "label": 0}
{"text": "Good on you!  Bullying is wrong and doesn’t make their fairy tales true.  It also doesn’t make us want them in the room.  Grrrr 😖", "label": 0}
{"text": "You might prefer \"secular humanist\" as your label, as it implies a culture and ethics based very much on reason, empathy, human rights and the wellbeing of all sentient beings; where no sectarian creeds or any other ideas get any special privileges above any other, only the opportunity to be critically evaluated on their merits.", "label": 0}
{"text": "We don’t respect religion. But we respect the people in front of us who are religious", "label": 0}
{"text": "I wish everyone had enough of an open mind to be considered agnostic. But there are plenty of people who are pretty damn sure they have all the answers, and both passively and actively anything that may challenge that assured knowledge.", "label": 0}
{"text": "Atheist isn't a label. It is stupid to need a word to describe that you are simply not Christian, Jewish, Muslim, or Buddhist, Apollist, etc. Atheist is a word. It has a definition. It is not a label, and you don't have to call yourself atheist if you don't want to. The word has negative connotations, and this is on purpose. The worse thing in the world to a theist is someone who doesn't believe in some god.", "label": 0}
{"text": "Jesus is a fictional character. It’s whatever the fuck you want it to be.", "label": 0}
{"text": "No. Why would we?\n\nWhile people can believe whatever nonsense they want, the problem is they think it's acceptable to force their kids into it, and in some cases get religious exemptions to taking their sick kid to a doctor and the kid dies a terrible death could be easily cured. And now, it's common for them to force that religion's nonsense on everyone.", "label": 0}
{"text": "Happy cake day", "label": 0}
{"text": "Because they are all hypocrites.", "label": 0}
{"text": "I don’t think we need to. I don’t, but I also don’t go out saying it.\n\nI personally don’t feel like it is worth offending people over, so unless they start something with me I just don’t engage.\n\nMuch like how I wouldnt go up to a child and tell them that Santa doesn’t exist and start a mess with that.", "label": 0}
{"text": "Assets are needed to retain the integrity of the church. They need buildings and institutions to keep the faith strong. They can't simply just remove it all and give the money away, that means the church won't be able to do the same feat again or exist. It also practically cuts off the lifelines of many catholic missions in Africa and Asia. \n\nAs for the sexual abuse, I agree there should be compensation, as the church has not adequately dealt with the situation for a long time. Fortunately, it is getting better with background checks and the like. (I am not catholic btw)\n\nTrying to include the unreasonable in a reasonable point is just another way of manipulating people into agreement. You bring in moral issues to persuade people emotionally to agree with your unreasonable and out of touch opinion.\n\nTl;dr your point adds no substance to the conversation, and just seems to bash the Catholic church over the fact that it doesn't do an unreasonable theoretical \"alms-giving\" scenario that you think they should do...", "label": 0}
{"text": "It was a sarcastic joke. Religion shouldn't be involved in politics. However I don't support trump", "label": 0}
{"text": "Religious people often claim atheists “want to be their own god,” but that seems to be projection. The people saying this shit on stages think that their intuition is what their god wants and if you don’t agree you’re a heretic and subhuman. Seems like they quote their little book less too these days.", "label": 0}
{"text": "My group of like minded individuals prefer to be known as iconoclasts and are not afraid to speak truth to bullshit.", "label": 0}
{"text": "Disgraced clergy. Even the ones in good standing are scary.", "label": 0}
{"text": "TBF Ken Ham is an asshat, and not a very good representation of “religious people”.", "label": 0}
{"text": "Personally I prefer the term \"non-theist\", which kind of tamps down the automatic trigger responses to \"atheist\". \n\nWhen they ask what's the difference, or for an explanation, I say something like I prefer not to engage in \"theism\".  If that doesn't shut down the topic, I add that \"religiosity\" is just not part of my existence.  \nFor example, an individual can choose to not have alcohol in their life without it having to be a pro / con position.  It simply isn't part of their life. \n\nGive it a go and see if it works for you.", "label": 0}
{"text": "The only successfully tolerant society is the society that does not tolerate intolerance.", "label": 0}
{"text": "Atheism is simply the lack of belief in god or gods. Anything after that is up to you.", "label": 0}
{"text": "When people make this sort of argument, with the sincere expectation that it's somehow going to be convincing; I genuinely have difficulty even imagining the response that they are *hoping* to hear.\n\n \"Well, gee, I always *thought* that slavery was bad! I mean, it's self-evidently a source of massive misery and injustice, and there are millennia of undeniable evidence demonstrating this. But then Fox News interviewed one (1) black man who claimed that he believed slavery was actually GOOD! Since this random stranger's status as a black man apparently makes him the one true arbiter of all that is Right and Wrong in the universe, I guess I must have been mistaken about slavery being wrong. I have no choice but to immediately throw out my entire moral framework and start campaigning to repeal the 13th Amendment.\"", "label": 0}
{"text": "Exactly!", "label": 0}
{"text": "Wow, that's a long and elaborate answer which basically only serves to show us that you support the catholic church and that you don't understand what a horrible institution it is.", "label": 0}
{"text": "I feel like your question has a logical fallacy… while the existence of something can be disproved, the nonexistence of something can’t be proved. \n\nWhat say you to that?", "label": 0}
{"text": "No I won't respect harmful beliefs, I won't respect abusive practices just because a religion was targeted before *cough cough Judaism cough* you aren't special you don't get special treatment in religious criticism either despite everyone getting pissed off about it all religion and religious people will get the same criticism from me", "label": 0}
{"text": "If they read it, they'd be Atheists  :)", "label": 0}
{"text": "Exactly!", "label": 0}
{"text": "No.", "label": 0}
{"text": "I have said I respect everyone's freedom to believe whatever feels right to them as long as they don't force their beliefs on others or judge people for believing something different than they do.  Honestly, I don't think most religious people are able to do this, but this is what we should strive for and I want people to respect my choice to not believe in any god, so I think this is the best type of statement to say if you're in a discussion about beliefs.", "label": 0}
{"text": "I don't think that is fair!\n\nIt would be very easy to demonstrate its existence. God could simply manifest herself, perform some tricks, resurrect your grandma, make a circle square, etc.; just enough to make it clear that you are in the presence of some supernatural being (of course, you could then ask whether it was God, or just some minor deity, Satan, or whatever, but I think that's beside the point.)\n\nHowever, demonstrating that something does not exist is much more difficult. At most, you could demonstrate that there is no evidence of any god existing, but that would still be inconclusive... who knows, maybe seeing the Spanish Inquisition at work, God thought everything was under control and decided to take a nap, but he might come back at any moment and start performing miracles again.\n\nAnd well, if you had a time machine and could take random theist to observe the life of Jesus (assuming Jesus actually existed), Muhammad, or others, and let them see what really happened, it could be shocking, but In most cases, I think they would either accept the evidence or question whether you truly had a time machine, or if it was actually a farce. I'd do the same if you took me to Palestine in the year 33 to witness some guy performing tricks, like walking on water or turning water into wine... I'd be looking for the hidden cameras!", "label": 0}
{"text": "No fuck them religious folks. next question", "label": 0}
{"text": "You may find it advantageous to be tactful or polite, but no.  You do not owe any deference to one set of ideas or another because those ideas are religious as opposed to secular.", "label": 0}
{"text": "Love the religious hate the religion.", "label": 0}
{"text": "As long as religious people leave me alone, I don't care what somebody believes. I am not going to argue about god.", "label": 0}
{"text": "All of the top religions today are selling tickets to a fake afterlife. There is no cure for death yet. To $ell so is fraud.\n\nYou do not need to respect fraud.", "label": 0}
{"text": "Josephus’s book makes two references to a person called Jesus. One of the references has been rejected by modern historians but not the other one.", "label": 0}
{"text": "Respect is for people, not things", "label": 0}
{"text": "My argument is that your message adds no substance to the conversation, and that while yes, the institution has problems, it is recovering. Your mentality is that an institution like this shouldn't recover and grow from corruption. Smh", "label": 0}
{"text": "I respect people, not beliefs. Beliefs do not obligate respect from us. If people do not want their beliefs to be ridiculed, they should not hold ridiculous beliefs.", "label": 0}
{"text": "They are allowed to commit sins as soon as they repent, that’s why there are so much bad people", "label": 0}
{"text": "Fuck no! I hate all religious equally and am not apologetic. I usually stay quiet though because it's not nice to make fun of mentally ill individuals.", "label": 0}
{"text": "I respect religion as much as I respect flat-eartherism.", "label": 0}
{"text": "Ditto.", "label": 0}
{"text": "Would that be unexpected? Just curious what it means", "label": 0}
{"text": "It's not that I respect religion, that's a worthless commodity.  However, if they can keep their religious ideals to them selves I'll have respect for the person, start shoving your religion down my throat and you gone.  I can write people off.  Don't believe me, ask my siblings.", "label": 0}
{"text": "HL Mencken: \"We must respect the other fellow's religion, but only in the sense and to the extent that we respect his theory that his wife is beautiful and his children smart.\"", "label": 0}
{"text": "I respect that people have the right to believe whatever religion they'd like.  I don't have to respect what they believe.", "label": 0}
{"text": "Studies show it actually causes brain damage", "label": 0}
{"text": "Well someone can think atheism is BS as well. Then we have no peace in life.", "label": 0}
{"text": "And Baptist don't use wine.", "label": 0}
{"text": "Religion is an ideology and so is Communism, Fascism, etc. I don't have to respect any of them.", "label": 0}
{"text": "Jealous", "label": 0}
{"text": "No, I do not need to respect someone's beliefs that include the idea that myself and my family are doomed to eternal torment simply because we refuse to stroke the ego of the invisible capricious monster in the sky. Neither do I need to respect the beliefs of someone who worships a monster that frequently chooses to solve his problems by committing genocide.\n\nThe same people who ask people to respect other people's beliefs would laugh at the prospect of respecting the belief that Elvis is still alive and living on Titan with Albert Einstein. The level of absurdity of the Elvis bit is exactly on par with that of religion and therefore deserves the same level is disrespect.", "label": 0}
{"text": "I call myself a member of the Church of I’ll Find Out When I Get There. I don’t expect to obtain new knowledge at that point, so you may label me with agnostic atheist, but who knows.\n\nI admit that I don’t, that’s why I’m not religious.", "label": 0}
{"text": "Respect needs to be earned through genuine merit. There's no point giving respect to anything that doesn't deserve it. If you see two turds on the ground and one of them has been polished, it doesn't deserve any more respect than the unpolished turd. The same goes for religions.", "label": 0}
{"text": "no.", "label": 0}
{"text": "No they don't. I respect people and their right to believe what ever they want, but that doesn't mean I have to respect their believes or dogmas. I will call them out on their believes but I will argue the ideas and not the person.", "label": 0}
{"text": "Josephus was still close enough in time that his mentions of Jesus were certainly based on at least one real person named Yehoshua who was probably a rabbi. \n\n\nLook at the mythology we’ve created about people like Rasputin, Che Guevara, or even Bob Marley. These are people who were very real and we’ve turned them into larger than life versions of themselves at this point. Now imagine them existing in a time where it wasn’t anywhere near as easy to just document things accurately. Give it another 2,000 years and there’s a very real chance that someone like Bob Marley could easily be revered as a religious prophet.", "label": 0}
{"text": "Q-Anon has admitted that they had the whole pedophilia thing backwards. Pedophilia, turns out, was a good thing, and Jeffrey Epstein was a good guy. Imagine that.", "label": 0}
{"text": "They want god to unfuck its fuckup", "label": 0}
{"text": "You don't have to respect religion. You do have to respect religious people, because you have to respect people in general.", "label": 0}
{"text": "So?\n\nHe has been accused, and convicted for that matter, of much worse much more recently.\n\nAt this point you either already know he is a horrible person OR there is nothing anyone could say to dissuade you from worshiping him.  There is no one this will make any difference too.  At this point the MAGAts will not change until it effects them personally, which is a slow process but I am just making sure I don't do anything to interfere with that.", "label": 0}
{"text": "I spent 5 days in a hospital a couple of years ago. When I was admitted, they had me fill out a form. Among other things, it had a space that said: \"Religion: __________\". I wrote \"none\".\n\nNo chaplain visited me. I assume that's what the question was for.", "label": 0}
{"text": "No.", "label": 0}
{"text": "I don't support any religion that promotes iron-age era racism or sexism. \n\nIt's not my fault if your religion falls under that category", "label": 0}
{"text": "No.\n\nThey make truth claims. Some can be tested. The history of those claims can be presented. \n\nRespect human beings. Don't attack a person for their beliefs, but only for their actions. But the beliefs themselves are objects worthy of scrutiny. \n\nMy last visitation by Mormons, I went into the near universal (among scholars) acceptance that Saul/Paul of Tarsus was the creator of Christianity, and the evidence that Paul suffered from temporal lobe epilepsy. I offered the Hyam Maccoby account that Pauline Christianity combines the spiritual identification with a dying/resurrected god (as in the Attis cult of his native Tarsus), a  proto-Gnostic belief that the world was under evil powers, while adopting the historicity of older religions that brought respect in the Greco-Roman world (In reality, monotheistic Judaism was probably only 5 or 6 hundred years old then, younger than Hesiod). \n\nI was polite to them, and respected them. And I haven't been visited by Mormons since.", "label": 0}
{"text": "*People* are inherently worthy of a level of respect.  \n\n*Beliefs* deserve no such consideration.  They live and die on their own merits.", "label": 0}
{"text": "No", "label": 0}
{"text": "Someone who believes in ghosts, reincarnation, aliens, government conspiracies, or simply that the local market is using GMO vegetables but call them organic... Foolish beliefs abound yet none of it really matters.\n\nFoolish behavior matters.\n\nA man can firmly believe they're going to chill with angry cloud Santa all day, they can even attempt to convince you to believe so you can party together for eternity, but until they require you to join them, it doesn't matter. Until they vote to pass laws to require it, until they change the subject in every conversation to the wonderful party afterlife, until they tell scary stories to children that they'll miss out on the party & be punished forever... only then does it matter & must be stopped.", "label": 0}
{"text": "Rules for thee, not for me.", "label": 0}
{"text": "We have to make it go faster.", "label": 0}
{"text": "Welcome to the atheist closet, as it is.", "label": 0}
{"text": "The woman he called a dog - it isn't because of sexism as you seem to infer.  it's because of racism.  He initially doesn't want to help her because she is a canaanite and he/god is the israeli god and therefore only wants to help jewish people.  But  he eventually relents and heals her daughter anyways. ( or \"casts out the demons\" ).", "label": 0}
{"text": "The Testimonium Flavianus (Book XVIII, Chapter 3, Section 3), yes. I am aware of the rejection and support that stance. Nontheless, it is a reference to Jesus in the oldest preserved copies of the Antiquities. The reason you find this still mentioned is due to the forementioned \"Criterion of Embarrassment\". And as you have read, I find this instance of the criterion in turn the more convincing appeal.\n\nThe other one and the one you more often see cited even in popcultural discourse is the Brotherly reference (Book XX, Chapter 9, Section 1, James, Brother of Jesus).\n\nThe problem I have with the mythicist position on the historicity of Jesus is that it is an unusal way a cult creates its own mythology. And while we can make the argument that the catholic church was a product of Paul's work, the idea that the exoteric teachings of early christianity spring out of some wild narrative about a son of god instead of being inspired by a preacher-figure that may or may not self-aggrandized himself as this messianic figure is just that tad bit more constructed itself. I have no doubt that the mythicist position makes good arguments about how the gospels were constructed and I support the claim that these are not even remotely factual about the life of Jesus.", "label": 0}
{"text": "I respect someone’s freedom to believe what they want, but I don’t necessarily respect the belief itself. I have a real hard time respecting religion as I feel it causes so much harm", "label": 0}
{"text": "I was in a terrible car accident when I was 19. I was supposed to die, then I wasn’t supposed to talk, then I wasn’t supposed to be able to walk. But I survived all the surgeries and the coma, and learned to walk again. To this day, my parents stand firm on the fact that god saved me, god was guiding the surgeons hands, got was my “strength” to walk again. \n\nWe constantly argue that no, an invisible god didn’t save me. Advanced medicine, skilled physicians and my hard work got me through. \n\nChristian parents freak out when their kids are atheist. My parents still send me like one book every month about god. So I sent a book to their house about why god is not real, and they haven’t sent one since.", "label": 0}
{"text": "I respect anyone's right to believe anything they like as long as they keep it to themselves.", "label": 0}
{"text": "I think it's calling out the hypocrisy of Christianity... again.", "label": 0}
{"text": "Why post this on the atheism subreddit?", "label": 0}
{"text": "That’s not mutually exclusive to what was said.", "label": 0}
{"text": "Idk about sex but I know they watch the most porn in the most religious places where you're not supposed to watch porn. Preaching against a natural human urge just makes people want it even more. Not too different from a parent never letting their kid eat candy or junk food, and then they end up gorging themselves on it when they're able to do so.", "label": 0}
{"text": "In Ireland, it goes: The smart son becomes a doctor, the idiot son joins the priesthood.", "label": 0}
{"text": "Atheism is the only “religious” thing that is not a cult yk.", "label": 0}
{"text": "One down, 200 more to go", "label": 0}
{"text": "religious people are mentally ill, by definition.", "label": 0}
{"text": "Don’t respect the religion, respect the religious. \n\nThey have the right to believe in fallacy. But if their fallacy is causing harm to their surroundings, then a respectful person would point out how that is happening. \n\nIn example:\n\nIf a congressperson believes it is more beneficial to the people to throw EPA regulations to the wind because protecting the environment is not as important as maintaining the status quo such that they don’t have to work as hard to get into heaven, then you could say, “well what if heaven is not real and Earth is our only place to live? Then protecting the environment by improving and maintaining EPA regulations would be beneficial to future generations while throwing out the regulations would only make the one life of future generations worse for wear.”\n\nYou wouldn’t say “well what if you’re an idiot?” Or “what if you don’t exist?” At least not out loud.", "label": 0}
{"text": "So how does the god of love hate so much?  Must be a christian thing.", "label": 0}
{"text": "Because most atheists are democrats:\n\n[https://www.pewresearch.org/politics/2024/04/09/party-identification-among-religious-groups-and-religiously-unaffiliated-voters/](https://www.pewresearch.org/politics/2024/04/09/party-identification-among-religious-groups-and-religiously-unaffiliated-voters/)", "label": 0}
{"text": "No.  I tolerated it with my spouse but I will NOT go through that again.  I detest religion.", "label": 0}
{"text": "Both agnostic and atheist are labels that are defined in relationship to theism.  If we didn't have to navigate a world dominated by theists, we wouldn't need them at all.", "label": 0}
{"text": "No.\nNo.\nNo.\nNo.", "label": 0}
{"text": "Because it feels good.", "label": 0}
{"text": "You also got that wrong.\nWhat conversation are you even talking about? I don't see a specific debate point being asked for in OP post, so I gave my general opinion of what I think any message from the pope should include.\nMy opinion is that the catholic church should be made illegal, all present and former clergy should be prosecuted for child molestering and that and any catholic person who has paid money to the church should be prosecuted for aiding and abetting the criminal activities in the church.\nThe abuse of native people, the exploitation of poor people to make them give money to the church, the sexual abuse of countless children for centuries, the horrific denial of the use of condoms during the aids crisis and the support given to nazi germany is just a few examples of the top of my head.\nSo yeah, the catholic church should not exist in our modern day world.", "label": 0}
{"text": "People who want there beliefs respected should stop having stupid beliefs", "label": 0}
{"text": "Which is ridiculous when you think about it. The gospels clearly say: \"Jesus took wine and blessed it....\" etc. On another occasion, he turned water into wine. Obviously, he had nothing against wine.", "label": 0}
{"text": "Religion is worse than cancer \n\nCarl Sagan: “We are at a critical juncture in human history. The challenges we face - climate change, nuclear proliferation, global pandemics - demand a rational, evidence-based approach to problem-solving. This is where the limitations of traditional religious dogma become painfully apparent.\n\nFor millennia, we looked to the heavens for answers, seeking divine explanations for natural phenomena. While religion has provided comfort and community, it often obstructs our understanding of the universe as it truly is.\n\nThe scientific method, however, offers a rigorous framework for understanding the cosmos. It demands skepticism, critical thinking, and a willingness to revise our beliefs in the face of new evidence, the importance of questioning authority and relying on empirical data, not blind faith.\nThe idea of a deity who intervenes capriciously in the world, dictating our fates, is not only incompatible with our observations of the universe, but also hinders our ability to solve real-world problems.\n\nTo truly progress, we must move beyond the limitations of myth and embrace the power of scientific exploration. This doesn’t mean rejecting spirituality altogether, but rather re-framing it within the context of our vast and awe-inspiring universe.\n\nWhere we see ourselves as part of a larger interconnected web of life, not as the center of creation. When we understand the incredible fragility of our planet, the vastness of space, and the preciousness of life, we are more likely to act with compassion and responsibility towards each other and the environment.\nWe can no longer afford to be guided by ancient beliefs that may have served us in the past but now threaten our future. It is time to embrace the power of reason, critical thinking, and scientific inquiry to build a better world for all, by overcoming religious dogma to fully engage with the scientific understanding of our universe.\n\n[Why Humanity Must Overcome Religion | Carl Sagan](https://youtu.be/-EdmF4OyoKI)", "label": 0}
{"text": "I respect religion only by saying the words, “I respect your religion.” To any religious person to calm them down and get them out of my face. I don’t respect shit and Jesus was probably a homosexual. That is all. Hail Satan.", "label": 0}
{"text": "I think it's important to respect another's right to believe what they want. If you can't a civil conversation about your differences then just walk away.", "label": 0}
{"text": "I think we should; it's the other person's sincerely held belief. \n\nI believe in full democracy, but I can respect those who believe in socialism or monarchs or even watery tarts proffering swords. \n\nGive respect if you want respect.", "label": 0}
{"text": "Exactly: I respect people's right to believe what they want.. even when it's stupid. I will vigorously argue against them when they express those beliefs if I think they are wrong.", "label": 0}
{"text": "I disagree. Everyone should have a right to believe what they want and should keep the stupid behaviour it engenders in private.", "label": 0}
{"text": "I respect everyone's right to their own belief system. I do not necessarily respect the belief system. And I do not respect their incessant proselytizing.", "label": 0}
{"text": "by faith based groups you mean religious zealots", "label": 0}
{"text": "Have you ever been to the Vatican?  It's wall to wall art and artifacts worth billions of dollars and they even have their own bank for some reason.  It's the least Christian place imaginable imo.", "label": 0}
{"text": "I offer people respect, unless and until they show me they are unworthy of it.  I may disagree with somebody about religion, and indeed I have no respect for it, but that doesn't mean I won't treat them ill simply because we disagree.", "label": 0}
{"text": "Paraphrasing Hitch: We should respect the humanity of those who believe, but they shouldn’t expect to be taken seriously in every sphere of society.", "label": 0}
{"text": "I'm not going to bad mouth them, but I won't good mouth them either.", "label": 0}
{"text": "this has absolutely nothing to do with atheism.", "label": 0}
{"text": "Do the Russians hold Putin accountable? Do the north Koreans hold Kim accountable? god is an all powerful, insecure, power hungry, narcissistic, autocratic, tyrannical maniac with a borderline personality disorder and low self esteem. god will strike you down for even considering challenging its authority, and then send you to the labour camps of hell for all eternity. Also, bit tricky to hold god to account when it is imaginary", "label": 0}
{"text": "This is tricky rhetoric. The going parlance is that you should respect others’ right to believe or not believe in whatever they wish. \n\nBut nobody has to actually respect a specific or religion or the concept or religion itself. It is silly.\n\nAnd when their beliefs begin to seep into their actual real life decision-making, that is when their religion begins infringing on others’ rights and should be attacked by everyone.", "label": 0}
{"text": "You don’t have to do anything.\nPersonally I see it more as “I respect people’s ability to have beliefs”, as I definitely don’t respect their beliefs.\nPeople believe a lot of crazy crap, just because it’s a religion doesn’t give it some special pass.", "label": 0}
{"text": "I generally agree, but think it is more accurate to say those who remain skeptical of their personal beliefs are more likely to change beliefs as facts are learned and those dogmatic would not be less willing to change.\n\nThere are some dogmatic atheists, but generally most of us are atheists because we are skeptics.\n\nA good example of what you positioned though aree the religious who are positioning extraterrestrial intelligence (if aliens showed up and introduced themselves to us)  as demons rather than unique life forms that evolved far away from earth.  Tucker Carlson seems to hold a position similar to that.", "label": 0}
{"text": "Sin is no problem when you can just repent 🤷‍♀️ remember, they consider this to be on par with murder but not quite as bad as blasphemy", "label": 0}
{"text": "No idea is above criticism.  None. At. All.\n\nThat said, there is also the time & place for criticism.  Telling your 90 year old grandma that her lifetime of beliefs are bullshit right after she has gifted you a $10,000 check would just be rude.", "label": 0}
{"text": "I do not mind a persons personal belief, unless it affects other people, THAT is where I have a problem.  If they believe in whatever, that's fine, if they start preaching that and saying I have to care or obey their beliefs, that is not fine or acceptable.", "label": 0}
{"text": "How many of the 10 commandments has Trump broken?  If you count the extra deaths of 400k to 600k Americans you could make a case that he’s broken all of them.", "label": 0}
{"text": "YSK \"pre-marital\" sex is \"before marriage.\" You're looking for the term \"extramarital\".", "label": 0}
{"text": "It’s supposed to identify and unite you as a member of a cohesive community acting in each other’s benefit and defense against outside agitators…\n\nOh wait, that’s gang membership. Never mind.", "label": 0}
{"text": "You do you, boo.\n\nIt's not like in life you're required to have 'flair' indicating who/what you are and stand for.", "label": 0}
{"text": "I put my foot down at having to live in someone else's delusion. I honestly don't care whether someone believes in a god or some sort of higher power/diety. The baggage that comes from organized, unprovable belief systems is a completely different story.\n\nI feel we need an easily sharable compendium of knowledge to combat the religious systems. Not for those who are too deep into the sauce but for those still figuring the world out or questioning.", "label": 0}
{"text": "Take it on a case by case basis. It's not so much about respecting the religion as it is about respecting the person. If you encounter someone trying to shove their religion down your throat, insisting they have all the answers, wanting to force religion on your schools, your children, or in your face, then no, don't respect them. If they are a kindhearted soul who just happens to also be religious, then I certainly would respect that person as they are showing respect to everyone else by the way they conduct themselves.", "label": 0}
{"text": "Isn't it exciting to secretly eat something you shouldn't?\n\nAnd to touch something you shouldn't.\n\nTo them, religion and rules are just drugs to get them excited.\n\nThe feeling of doing something wrong keeps their erection going.", "label": 0}
{"text": "I believe some of the earliest hospitals were created by religious groups. We should have grown out of that a century or two ago.", "label": 0}
{"text": "PEOPLE deserve respect, ideas DO NOT.", "label": 0}
{"text": "Even though their book says:\n\n> You will know them by their fruits. Do men gather grapes from thornbushes or figs from thistles? Even so, every good tree bears good fruit, but a bad tree bears bad fruit.", "label": 0}
{"text": "As someone who lives in Reno, I'm sorry on behalf of this person. Our city is essentially disgusting. Yall don't deserve to be exposed to this filth.", "label": 0}
{"text": "It’s as close to proof as we’ll ever be able to get because it was infinitely more difficult to document things 2,000 years ago than it was even 100 years ago. Which is the point. \n\n\nIf Josephus’ writings are genuine, which there seems to be a consensus that they probably are, then we have no reason to doubt that he’s writing accounts that are based in the reality of the world in which he lived. We mythologize people *all the time*. Obviously the person he’s writing about didn’t perform miracles or die and resurrect. Because those things are impossible. But stories like breaking bread with social pariahs, being frustrated with people selling wares inside temples, etc. are all probably actually based on the actions of one or more rabbis, possibly some of whom were named Yehoshua, somewhere within the first centuries BCE/CE.\n\n\nThat’s not saying we have definitive proof that Bible Jesus existed. We don’t and probably never can or will. Chiefly because Son of God Bible Jesus didn’t exist in the same way that the meme version or Chuck Norris never existed. But we have pretty solid proof that Christianity is based on the teachings of late-BCE/early-CE rabbis, at least one of whom was probably named Yehoshua.", "label": 0}
{"text": "Yes it's this for me - religion should not be on a pedestal. It should be open for praise, criticism, ridicule and satire as anything.\n\nThe reason I don't respect religions more than some other things is because they pretend, as their founding principle (in most cases) to be \"telling the truth\" with unevidenced claims.", "label": 0}
{"text": "Pre COVID\n\n\nYes, don't be a dick. Respect people's beliefs\n\n\nPost COVID\n\n\nFuck off with that shit for real", "label": 0}
{"text": "based on books written before modern medicine. it makes no sense for religion to be in politics!", "label": 0}
{"text": "Please explain what’s “civil” about a tax-free institution that is based on the premise that their book is the ultimate truth, despite any evidence to the contrary, and anyone who disagrees DESERVES eternal torture.", "label": 0}
{"text": "> I used to think atheists were stupid and misguided. But now it seems like I've become the very thing I thought was stupid.\n\nIt makes sense that you would be taught that. The Bible says very clearly that unbelievers are *bad* people.  That theme runs throughout the entire book, in both Testaments.  But as you're learning now, belief isn't voluntary.\n\n> my family would never forgive me.\n\nAre they really that hateful and bigoted?  If they are, it's perfectly acceptable to lie to people if knowing the truth would cause them to harm you.", "label": 0}
{"text": "Because they love and trust him so much that they would only accept/ignore bad things being done if they were done by him. Surprisingly, this doesn’t just apply to Christianity, but many others like Islam, Hinduism, and even Greek mythology. It looks like doing bad things is only okay if a god does it according to people who believe in them, I don’t get it either.", "label": 0}
{"text": "This is my favorite Jesus origin story", "label": 0}
{"text": "For a historian you don’t seem to understand sourcing well.", "label": 0}
{"text": "The same laws of physics don’t all apply to clouds (water particles suspended in gas) and molten rock (a liquid). They are acted upon by different forces and you can’t intuit what one state of matter will do from the behavior of others. Yes the general idea of physics applies to everything but it’s not one set of easily described principles that acts logically across everything. It as a field is just describing how everything behaves objectively. \n\nThe best examples I can give of the illogicalness and unintuitiveness of physics is at the subatomic scale. From a macro perspective we are made of solid material, light can’t pass through us. The atoms we are made up of are almost entirely empty space. Scaled up if the nucleus of an atom was the size of a marble, the electrons would be about 1 mile away. Photons of light logically should be able to pass through that space, but they don’t. \n\nPhotons themself act like a wave, unless they’re being observed, which collapses them into a particle. ", "label": 0}
{"text": "I show respect for people,  but not religions.  Religions have no rights.  A religion is a set of ideas that can be challenged in the marketplace of ideas.\n\nMartin Luther showed great disrespect to Catholicism as it was practiced in his day. Every protestant is indebted to his efforts.", "label": 0}
{"text": "I have a very hard time respecting a person's belief in magical beings 🤷🏼", "label": 0}
{"text": "Fuck that", "label": 0}
{"text": "Why do Christians care about \"sin\" at all? Isn't it their belief that they are born into sin but their savior absolves them of it no matter what?", "label": 0}
{"text": "Request a refund", "label": 0}
{"text": "I don't believe in respecting other people's beliefs.", "label": 0}
{"text": "There is no difference between “fake” or “real” Christians. \nThey are both “Christians”, by their own declaration.", "label": 0}
{"text": "No. A person can be respected. Culture, must be respected. But lies? There's no honor in lies.", "label": 0}
{"text": "Yes.  And if abortion gets ensconced as a right,  they're going to try to make sure they won't be forced to do it if they still want to be a business.", "label": 0}
{"text": "Tell your family you're a cultural Christian.\n\nI'm assuming Christianity as you mentioned Santa, but you can be a cultural Jew or Muslim or whatever.\n\nThe point is that you're going to join in at Christmas without a fuss. In the same way that no one tells the little kids that Santa isn't real, you're not going to tell the adults that their deity is equally made up.", "label": 0}
{"text": "The very first commandment was about his own vanity, definitely some hate in there about enforcing things.", "label": 0}
{"text": "Because they’re fucking hypocrites who are exactly the same as the rest of us. The only ones who don’t realize this is them .", "label": 0}
{"text": "Thank you for your kind answer😁", "label": 0}
{"text": "What if Jesus was actually just a phenomenally skilled chemist in secret and he had developed the formula and process to produce Xanax, so when he had to cast out demons he just slipped 'em a Xanny and they chilled the fuck out.", "label": 0}
{"text": "If you prefer another term, consider “humanist.”", "label": 0}
{"text": "because they are so busy forcing their rules on the behavior of nonbelievers that they forget to make themselves follow their own rules.", "label": 0}
{"text": "People respect people and their morals, religious affiliation aside. If you don't practice what you preach, you are undeserving of respect.", "label": 0}
{"text": "Need? No they don't need to. But I think it's good to respect other people's religion as long as they respect your religion or lack thereof. Theists catch a lot of grief in this sub, but I'm fine with moderate theists who aren't pushy about it. Big difference between the moderates and the fundamentalists.", "label": 0}
{"text": "I have met plenty of people who make the atheist identity their primary identity. It is a club for them and it is just as annoying for the rest of us as believing is", "label": 0}
{"text": "A very loving God who inspires your family to be hateful and bigoted that they would never forgive you for not believing as they do.  Right.", "label": 0}
{"text": "The problem is Christian Nationalism", "label": 0}
{"text": "I’d argue that you’re only half right. I agree that you have a right to believe whatever you want, but once you start to impose those beliefs on others, you’ve opened yourself up to the possibility of ridicule. ", "label": 0}
{"text": "If a rabbit fossil were found in rock from before rabbits could have evolved.", "label": 0}
{"text": "Atheists need to respect the sincerity of belief.  Others feel differently, they aren’t lying or intentionally deceptive, the faith isn’t really a dark cover for some insidious purpose.  I am not saying people don’t use faith for wicked purposes, but if you don’t give a stranger the benefit of the doubt on this there isn’t anything else to discuss.  You both have no shared humanity to build understanding on.", "label": 0}
{"text": "'Cause the groper in question is also a key vector of Christofascism, one might guess.", "label": 0}
{"text": "No, you can respect the fact the people believe in a religion without respecting the religion itself. I think it's important to make that distinction.", "label": 0}
{"text": "Not according to [Romans 6](https://www.biblegateway.com/passage/?search=romans%206&version=NIV#en-NIV-28092). They should live as slaves of God or else they'll miss out on the after party.", "label": 0}
{"text": "Nah... Yahweh?   Hateful? \n\nNext thing you're going to tell me, he told people to smash babies' heads and that he flooded the earth and shit! \n\n😉", "label": 0}
{"text": "I thought Christ preached love and forgiveness?", "label": 0}
{"text": "So he's Not A True Scotsmen?\n\n\nIdk, Ham seems like most \"religious people\" I've encountered, he just doesn't bother with the mask.", "label": 0}
{"text": "You're welcome.", "label": 0}
{"text": "Is this more important than the fact that he raped a 12 year old?", "label": 0}
{"text": "It’s atheism you just described", "label": 0}
{"text": "Thats what I assumed but google tells me rabbits evolved 40 million years ago, where as the palaeolithic was 3 million years ago", "label": 0}
{"text": "We should find some lion pits for them, so their persecution isn't purely imagined.", "label": 0}
{"text": "Lots of Christians are voting for Kamala BECAUSE of their religion. Evangelicals don't own Jesus and are a minority among Christians in the US.\n\nI'm an atheist, I'm not defending Christianity or Time here. But letting MAGA have symbols like the US flag or Jesus and just presuming any appearance of them is an endorsement of MAGA is insane.", "label": 0}
{"text": "Reminds me of what Julia Sweeney used to talk about, that her parents would say they were fine with her not believing in God, but atheism was a bridge too far. It was intended to get a laugh, but it's serious as well. The word has picked up a lot of baggage along the way in connotations. But if you're already seeing through the BS, you can't really go back and embrace it, and be true to yourself. If you don't believe in a God then you're an atheist. Just accept it, but that doesn't necessarily mean you have to tell other people about it. It's not worth screwing your life over. If you have to keep it to yourself to go to school or have a place to live or  whatever, you do it, and wait until you're self sufficient to \"come out\". I was an atheist by 16, almost 50 years ago, but fortunately it was no big deal in my '70's house. Eventually I had my mom identifying as an atheist and voting for Obama.", "label": 0}
{"text": "Had a seizure at a convenience store. A priest offered to pray over me so my son told him, \"she needs a neurologist, not an exorcist.'", "label": 0}
{"text": "Respect?  Depending on exactly what is meant by respect.\n\nIMO, they have a right to believe in nonsense.  And it's certainly not worth my time or trouble to argue with them and try and convince them to change.  I respect them enough to leave them alone.\n\nOn the other hand, they believe in magic, and that certainly changes how I feel about them, and how much I respect their opinion on things.\n\nI live in the bible belt.  If I start calling it bullshit every time someone mentions god or religion, I'll have to argue constantly.  And that's not worth it at all.", "label": 0}
{"text": "In the past they were the ones with all the money and power besides the monarchy. So that power extended to education, art, science, and social constructs such as time", "label": 0}
{"text": "This man belongs in a locked ward.", "label": 0}
{"text": "I'm an atheist living in Utah. The personal profile in my medical records states agnostic though atheist is more accurate. It wouldn't really bother me if a designated religious representative wished me well because conversing about my atheism doesn't bother me. Even in Utah, where Mormonism is most prevalent, I found that religious visitors are sensitive to the patient’s level of belief( or none).  Unless it's some random religious ‘cheerer-up’, hospital chaplains are trained to respect patients’ feelings. \n Be honest, if you don't want any Chaplin-type person visiting you make your preferences known.", "label": 0}
{"text": "They should replace the clergy with cats, I wouldn't mind being visited by a cat in the hospital.", "label": 0}
{"text": "> If your goal is to minimize eternal suffering, the best path is to believe in whichever religion has the worst hell and do whatever you have to in order to avoid it.\n\nI'm not sure this is what you meant, but this sentence can be taken to mean that one should follow a fundamentalist religion for the sake of avoiding the \"worst hell\" it might describe.\n\nIMO it's better to understand how emotions are a consequence of our brains' construction, and work from there.", "label": 0}
{"text": "Check out pandeism. I personally subscribe to it. https://en.m.wikipedia.org/wiki/Pandeism It might fit you quite well. It is a safe label you can give yourself and is a good inbetween spot between atheism and what you used to believe in.", "label": 0}
{"text": "He bragged about sexually assaulting women and they didn’t care. Half of our country has lost any morals and values they said they had. Many of them nod their head when trump talks about hitler. They used to have to look over their shoulder when they shared those ideas. Now they feel free.", "label": 0}
{"text": "The problem is that what they mean by, \"respect my religion,\" is, \"You must follow the rules that my religion imposes.\"  Sorry, no.  Those rules are for you, not me.  If you want to do whatever it is you're told to do/not do, have at it.  If you want *me* to do the same?  Fuck that.\n\nI'll respect you as a person and your choice to believe in silliness, but it goes no further than that.", "label": 0}
{"text": "I love my lable of atheist. It let's others know I don't believe in bullshit and signals that hopefully they won't talk about Jesus or their god much. I'd love people to ask me about it because I'd love to explain why I'm atheist and a secular humanist. \n\nYou might get to this point of feeling positive about the word, or you could just 'not be religious' instead of using the actual word 'atheist'. Anyway, welcome to the freedom and potential happiness that's comes with using logic, empathy and critical thinking to navigate life! (Instead of mean-spiritied nonsense that only gives the gifts of shame and lack of ability to question authority.)", "label": 0}
{"text": "Trump himself said he could stand on 5th Avenue and shoot someone in broad daylight and not lose any voters.", "label": 0}
{"text": "> Evangelist Donnie Swaggart, the only son of televangelist Jimmy Swaggart\n\nBecause of fucking course he is.  Smfh.", "label": 0}
{"text": "Chill bro lol", "label": 0}
{"text": "I was unloading a moving truck and a couple Mormon young men approached me and asked if I knew anyone in the neighborhood that had recently lost someone or was going through a rough time. I asked,  so you can prey on them? I had to explain to them that I didn't say pray.", "label": 0}
{"text": "Has the IRS ever enforced this?", "label": 0}
{"text": "Send us $20 and we will send you a deconversion kit and a certificate.", "label": 0}
{"text": "> I feel like there’s no reason not to hate myself anymore because I wasn’t created by someone who cared about me.\n\nActually, you'll probably find that the opposite is true.  You have no reason to hate yourself because you aren't constantly letting down a perfect creator who is disgusted by you because of your sin.  Your good deeds aren't like filthy rags - they're commendable and worthwhile and you aren't doing them to impress some god, but to help real people in the real world to improve their lives.\n\n> I’m also afraid because I will never see any of my loved ones ever again after they die, and I won’t ever see my cat again because he is dead.\n\nThat's a hard thing for sure.  Let it inspire you to make the absolute best of the time you have with the people and animals you love while you have them.", "label": 0}
{"text": "It still wouldn't convince me that biological evolution was generally wrong,  only that something is messed up with the fossil, where it was found,  or perhaps what we think we know about the origin of small mammals.", "label": 0}
{"text": "They make up their own rules, judge others if they break it, and if they break it themselves, hey no worries! Go to church and and all is forgiven. Then they can sin again!\n\nMust be nice to have no accountability whatsoever.", "label": 0}
{"text": "I've never heard this before, where did you hear it?", "label": 0}
{"text": "I wouldn't go arguing with people over their religion for no reason, but I don't think it's problematic to offer your perspective if asked.", "label": 0}
{"text": "Because they are human and when you're horny, sky daddy's rules tend to go out the window. (He also forgives quite easily.)", "label": 0}
{"text": "You want to believe what you want? Sure as long as it’s nto “queer people are disgusting, mentally ill pedos” or “sex is bad” or ”people deserve to be murdered for things I deem as bad”. The problem is (most) religious people can’t just believe. They have to push their believes on other people.", "label": 0}
{"text": "I disagree. My friend and I gravitated towards each other because of this label and happily explore it through watching shows, complaining about the illogical ideology of Christianity etc. I love shows like The Line where atheists gather and are joined by wanting to make a difference by deconstructing religious ideology.", "label": 0}
{"text": "Its not like there is just one birth story. There are two. One contains claims that are very unlikely to be true - and that people living anywhere near there anywhere near the time would have known to be false.", "label": 0}
{"text": "TIL Jimmy Swaggert only had enough sperm for one son. Weak ass Christian, sad energy.", "label": 0}
{"text": "There's a difference between respecting people's right to believe what they want and respecting the thing they believe. I respect someone's right to believe in leprechauns, but I don't respect the idea that leprechauns actually exist.", "label": 0}
{"text": "Photos of a person are not proof that a person existed. Photos of a person are proof that a photo of a person was made. You need supporting evidence in order to qualify that a photo of a person is indeed the person in question. Like sources describing the person, suggesting that the photo is an accurate presentation of the individual. Or testimony by other people on a photo claiming it is indeed that person.\n\nI understand your appeal, because in daily life we take these singular instances of evidence as convincing enough for rather trivial matters. Meanwhile, when we try to bring rigid methodology to a naturally biased an \"fuzzy\" field like history, we raise our standard of evidence to make sure we dont fall victim to mere hearsay, right?\n\nThat's fair, but due to the fact that we are dealing with a rather removed timeframe and thus have no chance to corroborate on the sources we have outside of compiling already existing contemporary sources (we can't go and ask Josephus) in order to establish a chain of evidence, the standard of evidence for the mere existance of individuals is lowered in ancient history. Not without providing respective caveat, of course. This is done for the proposed historicity of Jesus by pointing out that if he existed, we still dont know much about him.", "label": 0}
{"text": "They're in an abusive relationship", "label": 0}
{"text": "I was in an argument about gay rights with a friend, and she kept going back to her Christian beliefs and she asked “Don’t you respect my religion?”\n\nThe answer was very simple. “No. I don’t.”", "label": 0}
{"text": "Pollsters would probably lump you in the 'none' category. I'm sure eventually this new term will gain some baggage, but at the moment it's mostly baggage free.", "label": 0}
{"text": "I suspect he actually said Paleozoic, but I'm not where I can look it up right now. Can anyone confirm?", "label": 0}
{"text": "oh no, not a \"rebuke\" from a conman\n\nnot that\n\nhowever shall I recover?\n\n/s", "label": 0}
{"text": "It's way more fun when it's forbidden.", "label": 0}
{"text": "“I’ve been praying for you to arrive! God obviously heard my prayers, so let’s get the healing started!”", "label": 0}
{"text": "You could just be nothing. No labels needed. When someone asks, tell them to mind their own business. If you want to share, say you have no religious faith.\n\nDone", "label": 0}
{"text": "The way I try and explain my views on religion is by asking the religious person a question to get them to see things from my perspective and if they would have the same respect.  \n  \nIf you found out that one of the adults in your workplace still believed in Santa Claus,  would you respect them as a functioning adult?", "label": 0}
{"text": "Because it’s fun.\n\nWay more fun than they’d like it to be.  We’re driven to enjoy it.  \n\nIt’s why sex education beyond Abstinence Only is so important.", "label": 0}
{"text": "H.L. Mencken said it best, I think: “We must respect the other fellow's religion, but only in the sense and to the extent that we respect his theory that his wife is beautiful and his children smart.”", "label": 0}
{"text": "People deserve respect (until they don't). Religions (or any ideas/beliefs) do not....", "label": 0}
{"text": "i respect another person’s right to believe what they want, but my respect for the harm organized religion has caused is nonexistent.", "label": 0}
{"text": "If having a label is comfortable for you and you want one, here are some suggestions if you don't like \"atheist\":\n\n* Agnostic: it turns out that most atheists (lacking belief) are also agnostics (lacking knowledge). So it's possible to be both. I know I am! You can continue calling yourself agnostic, though this doesn't really answer any questions about what you believe. \n* Skeptic: a skeptic is someone who tries to withhold action until provided with evidence to a certain standard. You can be skeptical about aliens, or about homeopathics, or the shape of the Earth, or the existence of immortal powerful creatures. \n* Bright: a Bright is someone who focuses on intellect as a virtue. Better to believe things because they're true, even if they're not \"nice\" or \"kind\" beliefs. Brights prefer hard truths.\n* Humanist: someone who believes that we should work for the betterment of humans specifically. We should care for the planet because we live here, we should cure cancer because people have cancer, we should care for each other because we all matter. \n* None: someone who isn't religious. No strong beliefs about whether supernatural stuff exists, and a willingness to be proven wrong. But not actively searching. \n\nThese are not exclusive, you can identify as some of these, or none of these, or all of these.", "label": 0}
{"text": "we don't need to respect religion, we just need to be indifferent towards it's followers", "label": 0}
{"text": "A religion is just a set of ideas. \n\nVarious religions have poor outcomes for people, families and societies that result from the implementation of their idea set.  \n\nThis is because a bunch of the ideas inherently serve the propagation of the idea set rather than serving the constituent individuals, families and societies. \n\nIt is perfectly fine to point out the problems of implementing bad ideas. It is fine to criticize the bad ideas.  It is fine to criticize the inhumane actions of people acting on those ideas.", "label": 0}
{"text": "You can respect it much as people respect your choice to be free from it", "label": 0}
{"text": "Other than the embarassingly tangential cherry-picked dog-related one (which doesn't remotely support your point in context), not a single one of these examples has fuck all to do with socialism, feminism, or communism. It's like trying to prove Jesus wasn't a vegetarian by referring to a time he drank wine. Even if it's true it doesn't support the argument.", "label": 0}
{"text": "I don't respect religion, but I respect people's rights to believe in what they want.\n\nThe annoying thing is that some religious people don't understand that concept.", "label": 0}
{"text": "ehhhhh, some countries don't have freedom of religion as a right in a constitution b/c it really isn't a right.", "label": 0}
{"text": "The word atheist carries a lot of baggage because of the demonization we've endured at the hands of theists. \n\nBut at it's core it just means \"a person who doesn't believe in a god or gods\". \n\nWhether you like the term or not because of the silly stigma the theists have put on it, matters 0%.\n\nIf you don't actively believe in a god, you're atheist. \n\nNothing more, nothing less. It's that simple. Even agnostics are still atheists, if they don't actively believe. \n\nI'm agnostic and atheist. All that means is that I don't know for sure that a god does or doesn't exist (agnostic), and until I'm presented with evidence the convinces me otherwise, I don't believe one does (atheist).", "label": 0}
{"text": "Believers are all brainless, spineless and weak. Even with a majority they would get their teeth kicked in if they tried. Then they would whine that we are oppressing their religion freedom by not allowing them to murder us.", "label": 0}
{"text": "“Agnostic” simply means “without knowledge,” which all atheists are. It’s being in a state of uncertainty. Claiming certainty over the unknowable is a kind of arrogance in both theists and atheists I find offensive-putting. Call yourself whatever you want. I’m with you.", "label": 0}
{"text": "> What methodology did you employ to know which parts are myth as opposed to non-myth?\n\nModern historians have tests for this.  It is a problem when reading a the works of Greek and Roman historians of the era.  There are words by real historians who are attempting to report historical events or historical biographies.  They are considered serious history, but they sometimes included mythical elements.  Therefore historians need tests for what materials are mythical and should be excluded from their understanding of likely historical events.\n\nThe gospels and Acts have a lot of markers events that are mythical.  One is that they involve supernatural elements.  Another is when the story involves elements that are grossly exaggerated or contradict known elements.  Another marker of mythology is when the story seems to echo common themes and motifs from mythology.  \n\nAs an example, take the Sea of Galilee.\n\nFactually, the Sea of Galilee does not exist as it is described in Mark and the other gospels.  In the gospels, the Sea of Galilee is wracked with frequent storms, and it took a multi-day sailing trip to cross it.  However, geography can be verified.  There is a lake that was known as  Lake Tiberias or Lake Kinneret.  It is a freshwater lake.  At the time of Jesus, it was about half the size of the modern body of water.  It is surrounded on three sides by mountains that protect it from storms.  It was known to be a tranquil body of water.    The Sea of Galilee hits several markers of mythology just based on mundane facts of geography.\n\nThere are also pointers in Mark and the other gospels that the stories about the Sea of Galilee are mythical.  It is common in Greek mythology for the hero of the story to calm a raging sea during a storm.  It is common for the hero to run, ride a horse, or drive a chariot across the surface of a sea in order to demonstrate their mastery of nature.\n\nGreek stories needed storm-tossed seas, but the Galilee and Jerusalem area were inconveniently lacking a sea.  So the author of Mark transformed the tranquil  Lake Tiberias into the raging Sea of Galilee.  Then he told about Jesus calming storms and walking on water, which are patterned of the actions of Greek heroes from mythology.\n\n> Which parts aren't mythology? \n\nI think there are some things about Jesus that are more likey than not to be true.\n\n* Jesus was an apocalyptic preacher who was associated with John the Baptist (John the Baptist was a known historical figure)\n* Jesus was crucified, probably for a crime like sedition.  (That was common)\n* Jesus had a brother named James. (Paul claimed to have met James.  Also Josephus tells a credible story about political intrigue involving James the brother of Jesus)\n* Jesus had some devoted followers.  They probably included Peter and Mary.\n* Jesus was probably from Nazareth (The Gospels and Acts seem to acknowledge that Jesus was known to be from Nazareth.  That was an inconvenient because the early Christians thought the Messiah needed to be from Bethlehem.)", "label": 0}
{"text": "More googling seems to come up with Precambrian as the quote, which is 4600 million years ago, makes sense now", "label": 0}
{"text": ".\n\nI respect people's right to *believe* whatever they want, but that doesn't mean I have to respect the belief itself. For example, religious ideologies based around racism I have no respect for at all.\n\nIt should be pointed out, though, that certain religions claim that anyone who believes differently than they do deserves eternal torture. Most disrespect for religion comes from religion.", "label": 0}
{"text": "For me, if they leave me alone, I leave them alone...", "label": 0}
{"text": "I love Irishisms.", "label": 0}
{"text": "I do not feel the need to respect the religion or its belief.  I respect the rights of people to believe whatever they want as long as they don't expect to me to also believe or live according to those beliefs.", "label": 0}
{"text": "The non believers would curb stomp the weak, brainless and cowardly religious. ", "label": 0}
{"text": "Scamvangelist doing what he know's best. Projection and finger pointing.", "label": 0}
{"text": "Do I need to respect the believe of flat earthers? Do I need to respect the believe of homeopaths? Dowsers? Chem Trailers? Or even plain football fans? Is religious feeling worth more than that of those mentioned?", "label": 0}
{"text": "Since Trump talks to God,  he probably got a discount", "label": 0}
{"text": "Depends on what you feel is right for you what you want to call yourself.\n\nFor me, I was sent to Sunday School early, in the late 70s. I also went to a private school, where we had religion classes... both of them, I thought \"This is B.S.\", so I called myself an athiest.\n\nBut... my 2 favorite faculty members and the ones who helped me the most with guidance were the Chaplains. And they were never \"This is what Jesus says, you better do it\", it was more offering some guidance and parable or some such to help me figure things out on my own. Later on, I started calling myself a \"Secular Christian\", because the actual quotes attributed to Jesus Christ, I felt there was a truth to them. The divinity stuff, nope, cannot buy it. I'd be like Thomas Jefferson cutting words out of his Bible because he seemed to like the philosophy, but the supernatural stuff seemed bull. Don't give me the OT, Jesus rejected a lot of that, and don't give me stuff that Paul wrote (in fact, 2 of the 4 Gospels that are \"accepted\" are not from Jesus' direct disciples; so, that's 1 out of 6 listed disciples we hear from), but there are some good ideas in there to lead a better life and live better among other people and support each other. \n\nSo, I try to live by that little bit, and call myself a \"Secular Christian\" as it seems to fit me best. You just need to find out what term you are most comfortable with. Then... don't let that term define  you or let others use it to do the same to you.", "label": 0}
{"text": "No true Scotsman....", "label": 0}
{"text": "The bible is full of incest, rape, infidelity and genocide, but most Christians ignore it. The bible is not a guide to living a good life by any means.", "label": 0}
{"text": "What do me and disco Stu have in common?", "label": 0}
{"text": "My new liver is here!  My prayers are answered. Now lie down while we prep you for surgery. \n\nSee faith hearing can be real.", "label": 0}
{"text": "Not when Trump uses the military", "label": 0}
{"text": "Atheists have every right and reason to not respect religion. I don't respect any of them. However I try to separate the people from the religion itself. I don't feel any disrespect for them unless they are complete assholes and fundamentalist extremists. Otherwise I have had some real honest and meaningful conversations with christian friends and it has never affected our friendship. In fact some of those friendships have strengthened because of the honesty. Now that being said I live in a liberal state far from the bible belt. And believe me geography does make a difference. I have in-laws in the south.", "label": 0}
{"text": "Religion defined atheism. \nAtheists didn’t say I am this thing, theist named themselves and the atheist title came as a result. \nIf you think about it, there isn’t a real label. The stigma associated is only given from the outside. \n\nYou never have to call yourself anything once you start believing.", "label": 0}
{"text": "Meh, Hate the Christian, love the bell.", "label": 0}
{"text": "I call myself secular. Those who know what that means usually don’t judge.", "label": 0}
{"text": "Im not religious, at all, and if someone came up to me and started saying \"you should believe in god or youre a dummy wummy\" Id think that person is a weird asshole.\n\nIf someone who is an atheist did the same thing, Id believe the same thing. You dont have to respect religion, but dont sit there and criticize people for their beliefs in front of them, it isnt appropriate.", "label": 0}
{"text": "Agnosticism is dumb. We’re atheists we don’t believe in God - that’s clear. It’s not like an active stand, just neutral - absence of something. That’s clear and easy. But then you guys come with all these sophisms “you can’t prove” etc etc and it’s not nice at all anymore :(", "label": 0}
{"text": "Eh, I hear this a lot, but depends on the details for me. In the worst-case sociopath God hellfire scenario, I have a feeling you'd regret a moralistic opposition somewhere between 0 and 2 billion years into eternal torment, with forever left to go\n\nWithout hell, I'm with you, fuck that God\n\nWith it.... Eeehhhhh, where do I sign?", "label": 0}
{"text": "Ideas don’t have rights.", "label": 0}
{"text": "Nah. We would stomp any religious group that tried. The religious are weak, brainless and cowardly. It won't be difficult. ", "label": 0}
{"text": "OP this is something that I struggled with myself, I believe it's the result of programming from church, particularly in-group/out-group dynamic. \n\nWe were told to label ourselves as a believer when we were in the church, and that was to be our sole identity, so the label of \"believer\" was really important. It is just not necessary to \"wear a label\" like you used to, and you don't have to do anything you don't want to. \n\nYou mentioned that you have a negative connotation of atheists. You will work through this programmed bias and slowly, eventually, this will change. \n\nThe fact of the matter is that you are an atheist if you don't believe there's a god, but you don't have to wear that label like you used to wear the Christian label.", "label": 0}
{"text": "Acceptance is not agreement. That said, to each their own... unless someone shoves their religion down your throat.", "label": 0}
{"text": "I’m in the US, so I just tell people I respect their freedom to practice religion", "label": 0}
{"text": "Do people need to respect other people. Yes", "label": 0}
{"text": "Respect the person, not the dogma.", "label": 0}
{"text": "If your beliefs are atheist, then you’re an atheist. You don’t have to go around proclaiming that you are an atheist to the world. you don’t need to latch onto a label. It’s no one‘s business.", "label": 0}
{"text": "Why would anyone believe what trump says? It is a pathological liar.", "label": 0}
{"text": "I’m very comfortable saying “I’m not a believer” when asked. If they press with what I don’t believe in I say “anything without evidence”. I rarely get a third question, just stunned silence.", "label": 0}
{"text": "Most of them don’t believe any god exist.", "label": 0}
{"text": "God told me he'd grow you a new liver if you give me yours. Who are you to question his almighty and mysterious ways? You must act in faith!", "label": 0}
{"text": "A lot of people are moral absolutists - they believe they know what is right and wrong and everyone else should follow it. It's not exclusive to religious people, there are plenty of atheists who are absolutists. People rightfully scorn the idea of Jews considering ourselves to be 'chosen,' but one aspect of that perspective is the idea that Jews are obligated to follow a lot of rules that gentiles are not. I never learned that I should try to prevent non-Jews from eating pork when I was growing up religious. There's a spectrum of absolutism to relativism - relativism is everyone does whatever they want whenever to whomever, with no interference. I think both extremes are wrong - you shouldn't force your neighbor to go to your church (complete absolutism) but you also shouldn't sit idly by while your neighbor abuses their kids (complete relativism).", "label": 0}
{"text": "No, see, my religion has a hell that's like the worst fundamentalist religion, but it's even worse. My God says he won't send you to hell if you write me a monthly check for 5% of your earnings. Isn't he so much more generous than the gods that demand a 10% tithe?", "label": 0}
{"text": "Every atheist individually is more intelligent than every religious person who has ever lived combined. Religion is trash and the worst creation of humanity. ", "label": 0}
{"text": "I’m just an atheist what now", "label": 0}
{"text": "God is a cunt.", "label": 0}
{"text": "Respect is earned.  I have no respect for ‘religion’ or anyone’s religious beliefs.  \n\nI try to be polite if they are.  No more than that.  ", "label": 0}
{"text": "The question can mean different things. \n\n-  Should we respect the ideas in that give them any credence whatsoever. No.\n\n-  Should we stridently oppose other people having their own views if those views are not affecting anyone else. No. \n\n-  Should we oppose the views if it starts infringing upon the rights of others. Yes.", "label": 0}
{"text": "Because they believe in nothing. They pretend and they all know the pretending is part of the game.", "label": 0}
{"text": "This doesn't come up a lot in daily life for me. I'm not walking into churches and causing scenes. I don't start confrontational conversations with religious people. I don't go to online religious forums to troll them.\n\nEven when I do have a religious discussion, I generally don't call people stupid. \n\nI think I'm good on the respect front.", "label": 0}
{"text": "False. Atheists and agnostics don't give other religions a pass. Christianity has had a disproportionate influence on western society so it is the most frequently addressed religion.", "label": 0}
{"text": "Because just like the rest of us they are horny motherfuckers. Especially men don’t really care", "label": 0}
{"text": "If you have a problem with certain aspects of Judaism that’s ok. Judaism is a non proselytizing religion. They don’t want your approval", "label": 0}
{"text": " They have been close friends for decades", "label": 0}
{"text": "🎶America, America! God will be forced on thee!🎶", "label": 0}
{"text": "Well...since you can't prove a negative...  *shrug*", "label": 0}
{"text": "That's funny coming from the cesspit of pedophiles aka Roman catholic church", "label": 0}
{"text": "WWJD? Vote Harris / Walz", "label": 0}
{"text": "You need to respect people not bad ideas.", "label": 0}
{"text": "The religious in the military are also weak, brainless and cowardly. I like our odds.", "label": 0}
{"text": "God hates a lying tongue. Lying tongue Kirk.", "label": 0}
{"text": "Religion is an idea I do not have to respect an idea but  I can respect people.  Or not", "label": 0}
{"text": "Roll call... Raise your hand if you're not here!", "label": 0}
{"text": "Thank you for your submission. Unfortunately, your submission has been removed for the following reason:\r\n\r\n* This post appears to be offtopic. Submissions completely unrelated to atheism, agnosticism and secular living may be removed. For more information, [check the rules](https://www.reddit.com/r/atheism/wiki/guidelines#wiki_submissions_completely_unrelated_to_atheism.2C_agnosticism_and_secular_living_may_be_removed.) or [the FAQ.](https://www.reddit.com/r/atheism/wiki/faq#wiki_topics_that_belong_on_.2Fr.2Fatheism)\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your submission and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.", "label": 0}
{"text": "I try to simply because I don't want to be like them and push my rhetoric down their throat. I save that for here on Reddit. Though at times I do let slip a hail Satan, may mighty Cthulhu bless you with insanity, I hope FSM's appendages grace you with the holy marinara.", "label": 0}
{"text": "Scammer swaggart is no better than his insolent father was. Did he think he's holier than thou? Feh! He's just as rancid as sour milk!", "label": 0}
{"text": "I don't respect religion, but I do respect people's rights to have stupid beliefs. \n\nHowever, if you *ask me* about my religious beliefs, you're getting my unfiltered opinion. So, if you're a believer, don't ask me unless you want to hear that I think your religion is nonsense indoctrinated into children too immature to question their parents authority or knowledge. You're also going to hear that what you \"know\" about god is almost entirely dependent on what part of the world you were born in.", "label": 0}
{"text": "I myself, do not respect religious beliefs. At times, I don't even respect the people who hold those beliefs and in some occasions I even ask myself whether we as a society should respect the right of others to believe whatever they want when those beliefs are harmful to society or parts of it.\n\nFor instance, I would be in complete disagreement with someone who thinks that women are inferior to men, but I would accept that, no matter how wrong their views are, I cannot stop him from believing that. However, when it’s not just one person but a group, a community, etc., and there are victims of those beliefs, what should we do as a society, should we let those beliefs spread and flourish?", "label": 0}
{"text": "I've never hear that before, but I can tell you that quicklime (CaO) mixed with water is highly reactive and exothermic and would certainly cause a response.  However, quicklime by itself would also be irritating on your skin just from sweat.  I suppose they could attribute that to having the crucifix waved over the possessed person.", "label": 0}
{"text": "Wouldn't it be disappointing if there was something to consciousness after death, but the humans organizing religions have ruined the idea for you?", "label": 0}
{"text": "I believe that organized religion is extremely harmful to society.  It shouldn't be respected.", "label": 0}
{"text": "No, no, no. You respect other people's right to their beliefs, but beliefs deserve no respect whatsoever", "label": 0}
{"text": "Simple answer, no!", "label": 0}
{"text": "It makes me mad because I followed the rules like a moron! I do feel guilty for some things I thought about my more \"sinful\" friends. I never realized how much emotional labor I was putting toward \"hating the sin.\" It was a revelation to me a few months after I deconverted. I was sitting across from a friend and realized I didn't have any caveats about my love for them. It was so freeing. It was ironically like a religious experience.", "label": 0}
{"text": "No, the government cannot force a business to do something, in terms of offering a product. They can certainly regulate.\n\n\nPoliticians try, such as trying to get an airline to service a particular city.\n\n\nPatients have died because of lack of medical care. ", "label": 0}
{"text": "That grifting snake needs to shut up", "label": 0}
{"text": "How about “humanist”? Or “secular “? Or “secular humanist”? lol", "label": 0}
{"text": "Yeah you're \"toxic\" for saying there's no god. \n\n\nBut they are 'righteous' for telling you you're going to burn in fire for eternity. ", "label": 0}
{"text": "I can’t respect any religion. Only ones right to have one.", "label": 0}
{"text": "You must’ve gotten the Premium package without ads.", "label": 0}
{"text": "Ok say what ever you want to🙄", "label": 0}
{"text": "I spent the better part of 21 months in a pediatric oncology board in a religious hospital... Being an atheist I felt like I was constantly having to ask him to stop bringing religion into my child's care.", "label": 0}
{"text": "I was in a VA hospital... some preacher walked into my room, and he had a piece of paper saying my religious preference was Humanist.\n\nHe started quizzing me about what a humanist was.", "label": 0}
{"text": "Why does it need to have a name at all? What does a label matter? If you’re an atheist, that’s just how it is. It’s not a label, it’s an answer to a specific question. If you believe in god, you’re a theist, if you don’t, you’re an atheist", "label": 0}
{"text": "Sex before marriage is fine, but abortion is wrong. Idiots", "label": 0}
{"text": "Nope.", "label": 0}
{"text": "I am loosing hope in humanity. We need him🙏🏻☦️", "label": 0}
{"text": "Some radical Christian religious groups are trying to turn the U.S. into a theocracy through Trump and Project 2025. I haven't heard any criticism of this plan from any (so-called) mainstream Christian groups either. I never held a great deal of respect for religion in the past. However, I now feel nothing put contempt for the entitled Christian right.", "label": 0}
{"text": "You can call yourself whatever you want. Agnostic is a perfectly fine label if labels are what you're into and you don't know quite what your beliefs are. I am a heliolator who is a sun worshiper. I don't practice any \"rituals\" or anything. I just spend a few moments every day basking in the light and warmth and being grateful for the life the sun has given us.", "label": 0}
{"text": "You’ll feel much better when you give in to rational thought fully and accept the fact that all 4K+ gods are simply made up by humankind. It’s really freeing! I promise, your mental health will improve tremendously. \n\nOh, and don’t worry about a label. You can call yourself whatever the hell you want, except “stupid and misguided” of course 😉", "label": 0}
{"text": "Because christians are humans. Their stupid book preaches behaviour that is not actually in accordance with natural human behaviour. The bible also doesn't understand: human emotions, the complexity of human nature, the variations of gender and sexuality, psychology or healthy communication. It just preaches laws that are impossible to  adhere to, so peope will people, they just deal with it in different ways. Poor christians have no proper insight into themselves if they only follow the Bible, so the only thing they can do is 'sin' and try hide it.", "label": 0}
{"text": "The \"religious exemption\" line is pure bullshit. No one would be forced to have or perform an abortion. Hospitals can perform certain procedures or not.\nBut religious hospitals shouldn't get taxpayer funding if they oppose procedures that could save a person's life.\nThis stupid line (thanks, mainstream media) is only designed to rile up part of the voting public who were never going to vote for her to begin with.", "label": 0}
{"text": "What a bunch of brainwashed fucks! Christianity is total bullshit. It took me 30 years to break free from these weirdos.", "label": 0}
{"text": "That’s the conversation I have when I ask what religion would you be if you grew up in Jeddah or Delhi instead of mobile?", "label": 0}
{"text": "Generalizing🤦 thanks for the insult 🙄", "label": 0}
{"text": "The old line of \"you should respect other people's beliefs\" is nonsense.\n\nYou should respect others' right to ***have*** a belief that differs from yours. But the respect warranted by the actual belief depends on what it is.", "label": 0}
{"text": "This. I think people just forget sometimes what they pretend to stand for. I've noticed with online dating that a lot of women will have \"Absolutely NO hookups\" in there Bio....after a few conversations, we're in bed the first night. I think people just don't know what they're doing half the time. People change on the daily depending on their mood.", "label": 0}
{"text": "Well, you're wrong. \n\nhttps://www.cms.gov/priorities/your-patient-rights/emergency-room-rights", "label": 0}
{"text": "Religion? No, certainly not. People? Yeah. \n\nI don't give a shit what religion you follow if you aren't doing others harm. If you're doing harm because of religion I don't respect you because you're doing harm to others, not just because you're religious.", "label": 0}
{"text": "when asked, I admit that I am missing the part of the brain that can: do religion. \n\n\n\nNever got follow up questions, but the answer is:\nI tried so hard, from age 3 forward, to be able to religion, but by the time I was 8, I gave up.\n\n\n\nI tried every night & every morning for that entire time", "label": 0}
{"text": "That’s horrible why would anyone treat you differently? As a Christian I am sorry for what happened to you 😞", "label": 0}
{"text": "Someone get that guy girlfriend", "label": 0}
{"text": "Christians are like the Ravenous Bugblatter Beast of Traal, creatures so mind bogglingly stupid that they assume that if they don’t know the bible says these things, all those nasty things you say about it don’t exist, or at least not in the context you’re using.", "label": 0}
{"text": "If we don’t respect others’ right to believe what they want, then we are just like another religion; smug and hypocritical in our belief that we are right.", "label": 0}
{"text": "I dont respect cults no matter their age.", "label": 0}
{"text": "No.", "label": 0}
{"text": "Do you respect the flat Earth claims?  I don't.  Same thing.  My respect is earned.  However, I can be polite and not purposely offensive.", "label": 0}
{"text": "People have rights, ideas do not, especially bad ideas like religion.", "label": 0}
{"text": "Is there some evidence they do it at a higher rate? The divorce rate has always been about the same in my life.", "label": 0}
{"text": "The faith-based groups can go fuck themselves.", "label": 0}
{"text": "I think I just saw God raise his hand.  At least I have faith that he did.  He ain't here, man.", "label": 0}
{"text": "I respect their RIGHT to religion. It does not mean I have to respect the religion itself, or respect them for choosing a shiny book over the lives of their fellow man.", "label": 0}
{"text": "How you treat others is a reflection on yourself, not of them. You respect other people because of who you are not because of who they are.", "label": 0}
{"text": "I don’t need to respect something make believe that people use as rationalization for their actions.\n\nReligion is entirely 100% absolutely totally completely make believe. If God is real, may he strike me down righ…..\n\n\n\n\n\n\n\n\nHa ha, just kidding.", "label": 0}
{"text": "No, you are wrong.\n\n\nThey have to screen you and make you stable (if possible) and assist with a transfer - if you can find another facility that will accept you.\n\n\nThey don't have to solve the problem of why you are there in the first place. If that was required there would be no need for the transfer now would there?\n\n\nIf you go in for broken leg, they'd have to xray, give you comfort (ice, tylenol, maybe a crutch or splint.\nBut they wouldn't have to set it if dislocated, or do any surgery if they didn't want to.\n\n\nDo you really think our government controls our healthcare system? That in a country where businesses buy politicians, the health care system does zero lobbying?", "label": 0}
{"text": "You sound like my type of atheist. I like the Richard Dawkins approach  - attack and destroy!", "label": 0}
{"text": "No", "label": 0}
{"text": "Call yourself non-religious if you like that better. Words are made up and have no inherent meaning or value, use them the way you want.", "label": 0}
{"text": "Because like most human beings, the rules apply to everyone else not to them.  This is pretty much normal human behavior across the board not just religious people.", "label": 0}
{"text": "Labels don't matter. Unlike theists, we don't police people's thoughts and make them follow our doctrine.", "label": 0}
{"text": "When I stepped away from religion, my mental health also took a decline. I struggled with the label of atheist because of the social and moral implications and the religious view of what happens to those who denounce God. Saying I was an atheist made me feel like I was doing something really wrong, even if I didn't truly believe that I actually was. I worked a lot on coming to terms with my beliefs on my own and with my spouse before I was ever ready to confront them on a larger scale. It was nerve-wracking to lose a core piece of myself and have to find a new system of values.\n\nNot too long after I'd become confident enough to tell my friends that I was an atheist, but had yet to tell my family, I briefly stepped back into the religious community again for work. Sitting through church and listening to the beliefs I truly disagreed with really sodified the term atheist for me and allowed me to tell my family. I definitely wouldn't recommend actively seeking out religious involvement, especially for an extended period of time- it really took a toll on my mental health. However, at the end of the day, I knew the preachings were not what I believed or the values that I held, and that really helped solidify my new perspective.\n\nWhile there are still things I struggle to come to terms with about not believing in the things that I was so sure were true, I know that deep down, I have good intentions in the way I carry myself. In terms of religious labels, we don't have to select one in permanent ink and advertise it publically. Some days, you may be agnostic, and you may be confidently atheist others - I think that's okay. If you need to avoid the conversation with some people, like family or fib your way through it, that's okay too. Don't lose hope, try to find safe people to talk through your thoughts with, and look for the things you truly care about and value. The whole process you're going through really does get easier with time.", "label": 0}
{"text": "Respect is a two-way street. If someone isn't in my face with their religion, I won't criticize their religion.", "label": 0}
{"text": "I respect other people's right to be religious (as long and as far as they keep it to themselves).  I do not respect their religion.", "label": 0}
{"text": "I don't know how you get that out of: \n\nTreatment until your emergency medical condition is stabilized, or\n\nAn appropriate transfer to another hospital if you need it\n\nStabilizing you may require emergency surgery.", "label": 0}
{"text": "Can we get tax free status too?!", "label": 0}
{"text": "I have never and will never respect religion.", "label": 0}
{"text": "Ok, then America is a Christian majority country.\n\nSecular government I think is the best you can ask for.  Which Turkey had.  \n\nErdogan did things like convert the Hagia Sophia, which had been a museum, back into a mosque.", "label": 0}
{"text": "Awesome.", "label": 0}
{"text": "That's what I meant by writing \"Reagan called them ...\" I recall the critique then was \"Neither silent nor the majority.\"", "label": 0}
{"text": "The forbidden fruit is always the sweetest.", "label": 0}
{"text": "Yes, you respect people no matter what they believe in, that’s how you have a conversation, it doesn’t matter if they try to convert you, being a kind person always leads to the best outcome.", "label": 0}
{"text": "I taught Sunday school for a year after deconverting because I was a coward.", "label": 0}
{"text": "Catholics definitely feel guilty about sex outside of marriage in my experience", "label": 0}
{"text": "Why would anyone respect an obvious scam? So no.", "label": 0}
{"text": "If he means that monster of a God from the Bible, that advocates for child rape and slavery then I hope so.", "label": 0}
{"text": "Honestly who cares what that idiot thinks!!!", "label": 0}
{"text": "No. Why would I \"respect\" it? Does it respect me? No", "label": 0}
{"text": "omg I’ve lived in Indiana all my life also (65 years) and it was never cool", "label": 0}
{"text": ">Nobody is 'claiming' there is no god.\n\nI am. :D", "label": 0}
{"text": "Because this life (and their neighbor's life) means nothing to them compared to their delusion of a fantastical afterlife they'll never get.", "label": 0}
{"text": "Anti-theist?", "label": 0}
{"text": "I'm realizing I never properly dealt with my mortality. Since I was 10 I felt like I couldn't admit to a fear of death because \"to die is gain.\" Honestly, I still don't like discussing it because someone will just dismissively quote Mark Twain at me.", "label": 0}
{"text": "For me, respect means I don’t recruit.\n\nIf they want to return that respect, they don’t recruit me.", "label": 0}
{"text": "You won't get surgery.\n\n\nStabilization is not surgery.\nYou'll get a bandaid.\n\n\nThe government isn't going to force a doctor to do surgery if they don't want.\n\n\nHave you not been reading the headlines?", "label": 0}
{"text": "No", "label": 0}
{"text": "I don't even respect politicians. Why would i respect a concept that is doing more harm than good?", "label": 0}
{"text": "Hi there, did you ever receive a link to the photos? We were at the Medford event to and never received an email or link", "label": 0}
{"text": "Found one of the \"victims\"!", "label": 0}
{"text": "Hi there, did you ever receive a link to the photos? We were at the Medford event to and never received an email or link", "label": 0}
{"text": "Its fine not to respect religion. But have respect for people even if they have made misguided choices.", "label": 0}
{"text": "Fuck no!", "label": 0}
{"text": "No, religion can S my D lol", "label": 0}
{"text": "Atheist means you DON'T BELIEVE.  It has nothing to do with knowing. \n\nAgnostic means your don't know.  It has nothing to do with believing (in a pure sense)\n\nI'm an Agnostic atheist.  I don't believe in God and I don't know if he exists.", "label": 0}
{"text": "They place themselves in a bubble before they can truly mature.", "label": 0}
{"text": "Quoting bible scripture as if it were true is not something athiests do.", "label": 0}
{"text": "I respect their right to believe in imaginary things, as long as they respect my right to disagree with and mock such ridiculous beliefs.", "label": 0}
{"text": "Respect is deserved, not demanded.\n\nHate and judgment are not part of atheism. Only disbelief of a supreme being in the sky that knows all and has a plan that somehow includes cancer and early death.", "label": 0}
{"text": "I think it's okay to respect religion as an idea, but NOT okay to respect certain formulations of it. Certain religious worldviews, policies, organizations, practices, and people should absolutely be disrespected.\n\nReligion in general has no specific content -- content makes a religion what it is. It isn't necessary to denounce the entire category when your beef is with specific aspects of it. Like I think Evangelicals are bullshit, but I'm not trying to beef with Unitarian Universalists, so I'd rather name and shame the specific motherfuckers I have a problem with.", "label": 0}
{"text": "Dude, just stop.  Actually there's lots of proof these men existed and you know it.  You just want to be an ass.", "label": 0}
{"text": "I try to respect the people, but my go to line is to ask people what \"brand\" their religion is.", "label": 0}
{"text": "Slight problem with your argument: I understand what you mean when you say they are wrong and beliefs are stupid, buuut... You can't prove them wrong. \n\nThere is scientific evidence to suggest the earth is 4 billion years old, that evolution occurred, etc., but there is no evidence to suggest that God doesn't exist because you cannot prove a negative. It's an important part of the scientific method to remember. Saying God isn't real is factually impossible to prove. You can't quantify God.\n\nI can claim \"There's a black iron teapot hovering around Saturn's rings.\" That's a very outlandish claim, but you can't prove me wrong. \n\nThat being said, you have every right to think I'm foolish for claiming that there's a teapot hovering around Saturn's rings.", "label": 0}
{"text": "Your “Free will” is only for your opportunity to Choose God, or surrender yourself to an eternity of pain and torture. \n\nThere is no real Free Will in making life choices outside of that, as there is a book of Rules that covers your life for you to live by. \n\nBut then you have to choose God to listen to His Rules……but you have to abide by those arbitrary Rules if you didn’t choose God…..but those Rules only apply if you choose God….but we should make everyone follow our geographical locations God’s rules….but only if you choose God……", "label": 0}
{"text": "Shoulda had a flying spaghetti monster on the cover instead", "label": 0}
{"text": "Says peter, 13 years old", "label": 0}
{"text": "Tell that to my wife .... ", "label": 0}
{"text": "?. \n\nGod bless you☦️🙏🏻❤️❤️🛐☺️", "label": 0}
{"text": "Who gives a fuck?", "label": 0}
{"text": "I show a person the exact amount of respect that they show me. I rarely bring up the fact that I’m an atheist without a person bringing up their religion or negative ideas that stem from their religion first. The problem is that in the United States Christianity is so normalized that they don’t even realize they’re bringing it up, and when you call them on it they think it’s disrespectful because people rarely call them on their shit.", "label": 0}
{"text": "A few years ago a local realtor made some racist posts on social media. I shared this information with a potential client and the realty group he was a member of. Apparently he found out and showed up at my house. During his plea for me to stop he asked if he could pray with me. Sadly, my security camera wasn't working to capture the moment. ", "label": 0}
{"text": "Thats not correct though. Its not about what someone can or cannot know, its about what they believe they can or cannot know. You and I might agree that no one can KNOW that god does or doesn't exist, but that does not make people that believe you can agnostic.", "label": 0}
{"text": "You are aware that “being Jewish” is not just a religion but an ethnicity as well? Most American Jews aren’t religious but ethnically Jewish. Being against an ethnicity is called racism. Antisemitism is the highest motivation for hate crime this year according to the FBI", "label": 0}
{"text": "People and institutions may earn respect. An unproven belief system that encourages people to impose prohibitions upon other people does not deserve respect.", "label": 0}
{"text": "People deserves respect, religions don't, humans and animals deserves respect, ideas, traditions and organizations doesn't.", "label": 0}
{"text": "I think most people are atheists in that they think every man made religion was made up.", "label": 0}
{"text": "I’m sure black churchgoers wouldn’t wipe their ass with a rebuke from Donnie Swaggart.", "label": 0}
{"text": "Same reason it does anything else. Tradition.", "label": 0}
{"text": "The term atheist carries lots of stigma, sadly. There are plenty of other labels you can use if someone asks - secular, unaffiliated, non-religious etc.", "label": 0}
{"text": ">Because god is always right. If god is ever wrong, no he isn't. I'm wrong and need more prayer and study. I am worse than worthless. God loves me for some inexplicable reason and that's the only value I have. God is perfect, I am not. I just don't understand and maybe can't understand no matter how much I pray and study. I'm a piece of shit for even doubting god's goodness. I hate myself, but that's a sin too. Fuck me, why can't I just be holy enough to understand?\n\nIn short, severe mental manipulation at a young age.", "label": 0}
{"text": "Religion always needs more followers to keep the business going.", "label": 0}
{"text": "The catholic church is a criminal organization moving pedophiles around to avoid prosecution.  You are embarrassing yourself.  \"It is recovering\" what a joke.", "label": 0}
{"text": "shut the fuck up, Donnie", "label": 0}
{"text": "It would feel a bit like the North Koreans and their worship of their [\"Friendly Father\"](https://youtu.be/dGbvctOg5l0?si=rqQEeH5C1jlnTaUZ)\n\nLike, you'd know he was real and the consequences of not worshipping him are dire...but he ain't exactly a stand-up guy...", "label": 0}
{"text": "Idk go ask them", "label": 0}
{"text": "I think I might be becoming elderly,  but I don't like the label of elderly.  Maybe I can just keep calling myself :middle-aged\"?", "label": 0}
{"text": "You can respect the person without respecting the belief. Just be decent to people.", "label": 0}
{"text": "I call myself the same thing as people who don't believe in Santa call themselves. Humans who reason.", "label": 0}
{"text": "If your family wouldn’t understand, they don’t need to know. Family is an important support system but this is clearly something they can’t help you through.", "label": 0}
{"text": "Please don't alienate our brothers and sisters in fucked up states.  It's not entirely their fault.", "label": 0}
{"text": "Because we all have sinned.  And sinned.  And sinned.", "label": 0}
{"text": "I hear a rimshot. 😂", "label": 0}
{"text": "Its just a term, a definition. If it describes you then thats it. But I wouldn't let it attach anymore importance to yourself then you want. Its not a religion, its not a group, its not whatever your family and Christian friends think whatever it is. Its just a lack of belief in a god or gods. I mean you can even be atheist and practice and believe any religion that doesn't believe in a deity as part of that religion. Or even an atheist that believes in some parts of a religion but not in its deity. Its just a word that describes one small part of how you believe in something.", "label": 0}
{"text": "The burden of proof is different for everyone. I'm not even sure what my threshold is, since mental illness or poison or any number of things can fuck with your perception of reality in ways that are impossible for you to even *consider*, much less *combat*.\n\nBut surely God knows what it would take to convince me. The fact that he *hasn't yet* is very telling.", "label": 0}
{"text": "What they all said. You don’t have to label yourself. Most of the time, if people ask, I just say “I’m not religious.” They don’t need any details because it’s not their business.", "label": 0}
{"text": "There you go.  I don't respect religion, but I do respect the right to freedom of religion, since that gives me the right to be free OF religion.", "label": 0}
{"text": "I respect religious people so I think attacking their religions in front of them is rude and uncool. However I don't respect religions themselves.", "label": 0}
{"text": "I give the same respect to a religious person as they give me, what I don't respect is their religion saying I should be punished for not believing in their God. That doesn't deserve my respect. And since many of those religions also are used to justify seeing some people in society as \"lesser\" or beneath them, then I'll equally show zero respect to them. Prove to me first that your religion deserves respect, only then will I return it.", "label": 0}
{"text": "I. Despise. Religion. \n\n\nIt's a hate incubator. It's the only thing religion has become very, very good at.\n\n\nDon't worship OUR God? I hate you. \n\n\nDon't belong to OUR church? I hate you. \n\n\nDon't believe in Jesus? I hate you. \n\n\nDon't think abortion is wrong? I hate you. \n\n\nI'm done being nice to religeous zealots. ", "label": 0}
{"text": "We can have different experiences. I defer to your experience. I grew up with the institution of Unigov, the legacy of Orr, Bahy, Lugar, etc. it seemed like there was a time in my youth where people actually tried to do good for this state. Eviscerate me if you will, my take. Whatever your previous experience was, not looking good right now. Thoughts and thoughts", "label": 0}
{"text": "I don't waste time harping on baloney.", "label": 0}
{"text": "Well, to turn one of their favourite expressions back on them:\n\nLove the believer, hate the belief.\n\n(Love in a neighbourly, humanistic sense that is.)", "label": 0}
{"text": "Sure, practically any mammal fossil at that point would be a bamboozling find.", "label": 0}
{"text": "I have no respect for religion and actually have serious issues with it. I love to debate on it civilly.  But I stand on my opinion when debating. I have many friends who are Christian, Muslim and they know my feelings. I studied the bible when I was very young and asked questions that pastors couldn't answer. Why does the bible hate Gays but allows slavery and killing?  Just a small bit of my issues with religion.", "label": 0}
{"text": "Used to try and be respectful of other people who were religious but no more.  If they'd stayed in their own lane it would be different but they all want to foist their bullshit beliefs on the rest of us.  Add to that the damage done in the world by religions and I'm done with them.", "label": 0}
{"text": ">That's not a rethorical question. I'm really wondering where's the line. Because I feel like I have the right to say outlaud \"I think this is a bullshit\" in the same was people have the right to say \"I believe in god\". I mean I'm not saying \"you should think this is a bulshit\". \n\n>But in the same time I do respect the people tho.\n\nDO NOT GIVE IDEAS RESPECT, PEOPLE MAY DESERVE RESPECT BUT THIER IDEAS DO NOT. The moment you give a safe protection of deserveing respect it will be leveraged as a tool to be unquestionable making questions be disrespectful.\n\nAll ideas should be dusrespected and make people realize that because I called an idea dumb doesnt mean you are dumb, thats a whole seperate issue.\n\nLet this never be forgotten THEY ARE ONLY SLIGHTLY PEACEFUL RIGHT NOW BECAUSE THEY DON'T HAVE ALL THE POWER, IF YOU GIVE THEM ANY WE WILL DEVOLVE INTO ISLAMIC COUNTRIES WHICH BEGINS WITH TOLERATING INTOLERABLE IDEAS.", "label": 0}
{"text": "I am here as a public service", "label": 0}
{"text": "Who are two people that have never been in my kitchen?", "label": 0}
{"text": "Hey man, the wealthy families have to send their idiot fail sons *somewhere*.", "label": 0}
{"text": "No but I try to be respectful", "label": 0}
{"text": "In consideration of all I understand to make sense, I call myself Sane.", "label": 0}
{"text": "You're using an awfully broad paint brush my friend.\n\n\nSetting aside how you managed a 100% proof, the simple fact is that many atheists were once theists, and none of us required an absolutely perfect argument against the reality of a diety.", "label": 0}
{"text": "I have transitioned from atheist to anti-theist. \n\nI don’t have to respect their crazy beliefs when those beliefs include that I have to be killed for not believing what they believe.", "label": 0}
{"text": "You don't have to put a label on yourself, no need to choose allegiance between the forces of theism and the forces of reason.\n\nOr make you own label. I'm an atheist, but it's not an identity, it's just an adjective.\n\nWhen people ask me, I tell them I'm an agnostic-pantheistic-animist. That confuses them enough they usually stfu", "label": 0}
{"text": "No", "label": 0}
{"text": "The MAGASCOTUS doesn't believe in the Constitution.", "label": 0}
{"text": "No", "label": 0}
{"text": "I respect the individual and strive to not be a dick or rude. If their beliefs lead them to be a better human and to actually not be a dick, they have my respect, not their religion. \nReligion, like many amorphous things, is irrelevant to me. Just be good to each other. Manners and basic civility are far more important. That applies to us , as well. Being an atheist and obnoxious is just as bad as obnoxious religious folks.", "label": 0}
{"text": "I respect people, not ideas.   Religion is an idea", "label": 0}
{"text": "They're hypocrites. I've known Christians that talk about how some people aren't real Christians, cherry pick, and yet they treated people like crap.", "label": 0}
{"text": "\\>My mental health is on the decline. I feel like I'm losing all hope.\n\nThis was me in my teens. I knew I didn't believe in my brand of Christianity or any brand of Christianity.  Knowing and accepting are two different things, though.  And, accepting it was tough.\n\nI was a young man just before the Web became a thing, so there wasn't anybody I could talk to. Even in southern California, there was a stigma against atheists.  So, I didn't call myself an atheist.  I thought of myself as \"non-religious\".\n\nOnce I accepted my lack of beliefs, I hopelessness went away. It did take a while because I fought it. I mean, I didn't want to live in a world where somebody wasn't looking out for me.\n\nThis did make me more self-reliant, though. It took a while, but I did on beyond the need for an after-life/heaven.", "label": 0}
{"text": "I respect the principle of belief. But not the religion itself.", "label": 0}
{"text": "Christians want “Freedom of religion” as long as it’s Christian.", "label": 0}
{"text": "Or a puppy. That would cheer me up. They can’t pray over me.", "label": 0}
{"text": "No. Religions are just ideas.  Ideas are not inherently worthy of respect and vile ones such as religion should be derided and mocked.", "label": 0}
{"text": "Because this was never about christianity, beliefs or faith.", "label": 0}
{"text": "I haven't", "label": 0}
{"text": "Depends on the person for me. \n\nMy boss is very religious but open. He has asked me to go to church with his family and I flat out told him I don't believe and I have zero interest in it. \n\nBut beyond the heavy cult like portion and most born agains.  I have absolutely zero issue with a person believing in a God.  I've seen people come from dark places when they got \"god\" and became happy and full of life again , so i can't argue with that . \n\nAs well I just don't care enough for what someone does with thier own life . If they try and push me on the subject I shut it down really fucking quick and go about my day .", "label": 0}
{"text": "Yikes. Deal with your antisemitism dude. Says more about you than Jews", "label": 0}
{"text": "Lol no, and I don't pretend to either. Fuck religion. It's shackles that conmen use to take advantage of those looking for hope or peace in life. It strips you of your achievements while shackling you to your failures. It removes your critical thinking for blind acceptance. It's a menace on the species", "label": 0}
{"text": "I can’t really.. the thing is i know that god doesn’t exist..", "label": 0}
{"text": "So your response to my comment was pointless. Why even make it?", "label": 0}
{"text": "Seriously, Thank god. I have this urge to just thank the empty space - it feels right,lol not fats enough but I’ll take it. Hopefully not replaced with some other bullshit", "label": 0}
{"text": "OR he isn’t there.\n\nAnyway, life is hell for many “creations”.", "label": 0}
{"text": "No.\n\nWe need to respect that everyone has their *rights* to religion, but we also reserve the right to call them stupid AF.", "label": 0}
{"text": "My very confused parents thought we would be more accepted in the 'hood if we went to church.\n\nNot only did the 'hood not care, but when they took me away for 'bible school' I wanted answers to questions. I asked maybe two questions, I was seven, and they marched me back to my parents in the church. The silly man in purple clothes told my father I asked too many questions for the reason I am back. My dad wasn't happy, and I was scared he was mad at me, since it was his usual way to deal with me.\n\nInstead, he grabbed my hand and said loudly, \"He's seven fucking years old. What would he ask that you didn't have an answer for?\" He looked at my mom and said, \"We're outta here and this is WHY.\"\n\nNever went back into a church for 'services', and that was about the only nice thing he ever did for any of us kids.", "label": 0}
{"text": "I had to move there for a short term job in Wanatah IN. I was there for 11 months for work.  I worked in five counties for some cellular carriers.\n\nIt was very clique-ish. Even a couple of guys I worked with that lived there were weird, and secretive. We worked for the same company. I worked with them in various states, but when we were there for work (their hometown and where they lived at the time) it was different. I was never invited to anything. At that time, there were very little if any people of Color.\nThere was also a huge apostolic religious sect or sects there. The vibes were bad there. I worked in four neighboring counties, and was just weirded out... I was glad to get out of there, when the job project was done.", "label": 0}
{"text": "One thing I need to get off my chest. Why do some Atheists worry so much about what the bible says? I’ve gotten into some heated discussions around here about this. But at the end of the day it is a made up book about made up people and events. (Maybe based on some real people). I don’t have to debate with people about Zeus and Thor because man is now so “Enlightened” we all agree it is a Myth. Why is the judeo-christian bible any different?", "label": 0}
{"text": "They retconned that son of god stuff in.", "label": 0}
{"text": "There is zero proof of the existence of any gods. Pretty save to make the declaration that there are none.", "label": 0}
{"text": "Deprogramming yourself isn't an easy process.  You'll find a lot of questions you thought were answered where the answer was just \"don't think about it beyond this, because God\" and that takes time.  Call yourself whatever feels safe and get comfortable with more critical analysis of information.  Also atheists can be assholes too, don't let any abrasive militants either put you off or draw you in if you can help it.", "label": 0}
{"text": "It's just \"a moment if weakness\".  Show up on Sunday, pray, repent, rinse and repeat.", "label": 0}
{"text": "Considering all of the things you need to do/not do in order to get into Heaven, there will probably be less than a million in there from all time. \n\nLots of company in Hell with all the other pious, good hearted **wrong** Religious adherents, and of course the *actual bad people*.", "label": 0}
{"text": "Wonder how many others are pretending. Or have been pretending so long it stopped being an act.", "label": 0}
{"text": "I'm pretty fond of the apocryphal shit honestly. Enoch is wild.", "label": 0}
{"text": "I don't have to respect their religion. But I choose to be polite.", "label": 0}
{"text": "No religion or ideology should be free from criticism. The whole point of rationale, logic, and free thinking is to ask questions even if your questions make it seem like you don’t believe. Unfortunately, in many cases religious people don’t like it when you ask a lot of questions because they don’t want you to think for yourself. I also think it depends on how they define “respect”. Personally, I respect everyone and I believe all people should be treated with basic human decency and respect. However, you can’t expect me to believe in a religion that actively takes away women’s rights.", "label": 0}
{"text": "Yeah labels suck.\n\nMaybe you are a Humanist.", "label": 0}
{"text": "Respect is earned.", "label": 0}
{"text": "He's still their guy because they are insecure and he makes them feel special.", "label": 0}
{"text": "The majority of catholics and mainline protestants voted Biden. It's Evangelicals who  voted in droves for trump.", "label": 0}
{"text": "Evolutionary urges are stronger than dogma", "label": 0}
{"text": "One sixth of the world's population is atheist.\n\nI suspect that it's really one fifth, maybe even one fourth.\n\nIf you are raised to be religious, your social construct is built around religion and nation, mostly you will follow whatever your parents are. It takes a lot of effort to throw off the chains. It's easier to just go along, not question, not think for yourself...all the answers are given to you, no matter how stupid they are.", "label": 0}
{"text": "who can prove,its better to take it as fiction\n\njust enjoy festival holidays or traditions that come with religion\n\n[In a beautiful Temple setting in Yarlpanam, - Thillana Mohanambal - Thillana in Nadhaswaram](https://www.youtube.com/watch?v=Q-DYbJ6AisY&list=RDQ-DYbJ6AisY&start_radio=1)", "label": 0}
{"text": "I don’t respect claims without proof .", "label": 0}
{"text": "It’s one thing to not respect religion in general, and another to not respect anyone’s right to practice/ read about whatever they believe in.", "label": 0}
{"text": "It's none of my business what others practice in their own homes.", "label": 0}
{"text": "Paradox of tolerance. In an ideal world, yeah, great. \n\nWe do not live in an ideal world. The religious have persecuted, colonized & murdered millions. Even today, in the world, religious laws exist. And where they either don't exist or don't exist enough for them,  they want more control. \n\nReligion is dangerous. It shouldn't be respected nor tolerated. For tolerance of the intolerant results in the suppression of the tolerant.", "label": 0}
{"text": "I respect everyone’s right to believe and practice as they choose. That said, I find fervently religious people to be complete nutters, frequently lacking in intelligence. If only they could comprehend that they are the only ones bound by the rules of their religion, not anyone else.", "label": 0}
{"text": "I used to get this all the time.  I am supposed to respect religion because it is important to so many believers.  My question is how much respect do believers show toward atheists?  Do they ever say,  I better not say that because it might offend atheists?  I don't think so.  Most believets feel like they have a monopoly on goodness and truth and no other worldview is worthy of respect.\nAll that said,  I'm at least  as respectful towards someone's religion as  they are to my lack of religion.  If they are respectful to me I'll be respectful to them.", "label": 0}
{"text": "I wouldn't be adverse to those suggested post-birth abortions either.", "label": 0}
{"text": "I was born in NZ (in the late '60s) and grew up there. Religion was never much of a thing; I was aware that some people went to church, etc. but at the cultural level it was more like a sport or hobby. Just a thing some people were into, with basically zero impact on anyone who wasn't. \n\nMoving to the US, the difference was like night and day.", "label": 0}
{"text": "Hell no.\n\nYou’re going to need to ACCEPT that religion is going to be a major part of the society you live in and that filtering religious people out of consideration for human interaction is going to result in a hard life.\n\nBut, you don’t need to RESPECT that idiocy.", "label": 0}
{"text": "i think i respect peoples right to HAVE those beliefs and not necessarily the beliefs themselves (i dont shit on their religion to their face though)", "label": 0}
{"text": "Atheism CAN be a club, but it can also just be not caring about religion at all. Living a life where exactly zero thought is spent on the topic at all. Both are fine.", "label": 0}
{"text": "Thanks dude, but the thing is i am just a teenager dude i have no money and no freedom.. my parents wont even let me go to the grocery store to buy vegetables or groceries on my cycle or on foot they always take me in the car i never had friend cuz either they don’t know how to speak english or know how to play any of the games i have..", "label": 0}
{"text": "So does his base.", "label": 0}
{"text": "I know that this is in text, but it's so weird to see people say this stuff without at least breaking a smile. \n\n\nIt's so preposterous. \n\n\nIt's like something you'd hear a Renaissance Fair actor say.", "label": 0}
{"text": "My dearest friend is a Unitarian minister and part of his job is hospital chaplaincy. He’s a wonderful, caring, supportive man. He’s seen a lot of suffering and seeks to meet each patient with humanist, god-free support. \n\nJust sayin’ don’t paint all chaplains with one brush.", "label": 0}
{"text": "*Dad, how would you feel if you had a heart attack and I decided to pray it away rather than call EMS?*", "label": 0}
{"text": "Yeah it was a nice little lie.. and fun while it lasted", "label": 0}
{"text": "Pretty sure he was being pithy.  But finding a rabbit bone in strata that predates mammals throws a lot of things into question.  It'd be a huge WTF if the anomaly couldn't be explained.", "label": 0}
{"text": "Hey Buy-from-my-ebay-plz! In order to gather accurate traffic statistics, we don't allow Google redirect links. Please resubmit with a link to the actual site's URL. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*", "label": 0}
{"text": "There is no \"must.\"", "label": 0}
{"text": "R.I.P. Dad.", "label": 0}
{"text": "> atheism is believing that there is no god\n\nAtheism is not a belief. It is the absence of a belief. \n\nIf you do not believe in a god, you are an atheist. Even if you're open to believing in a god, **until you believe in a god, you are an atheist**. \n\nIntellectual atheism, atheist culture, etc are all outgrowths of the absence of the belief in a god (base atheism). If you want to tell me that I'm not an atheist because I have a sense of spirituality, that's fine - I will simply not respect your opinion.", "label": 0}
{"text": "Only if they respect my beliefs.", "label": 0}
{"text": "Because Jesus told them to do it in Matthew 28:19-20", "label": 0}
{"text": "Don’t the Mormons have ~$500 billion? I’d imagine the Catholic Church would be worth a few trillion.", "label": 0}
{"text": "People in general should respect other people. Most religious freaks tend to show great levels of disrespect towards both, non-religious people and people who are religious,  but worship differently. We, as non believers should give the example and respect everyone the same because it is the human and decent thing to do.", "label": 0}
{"text": "We owe a basic respect to other people as part of the social contract.  We are not obligated to respect the stupid ideas they have about the nature of the universe.\n\nMost religious people I know are really nice people and I would never tell them to their face that their beliefs are bullshit.  Why would I hurt them in this way?  However, their beliefs ARE bullshit and I don’t respect those beliefs.", "label": 0}
{"text": "NO Idea is entitled to respect. NONE. Not yours, not theirs, not even mine. Ideas must earn respect.", "label": 0}
{"text": "I may have to believe, however I'd still not worship him.", "label": 0}
{"text": "Congratulations ! I love this post and you’re very brave being true to yourself", "label": 0}
{"text": "Who?", "label": 0}
{"text": "I truly believe that there is still a lot of dna from when we neanderthals floating around, and some people just get unlucky and get a neanderthal brain, they are just incapable of thinking on a higher more advanced level, they want to reduce everything down to an oversimplified level while the world around then is getting more and more sophisticated.", "label": 0}
{"text": "Downplaying it quite a bit in my opinion makes it disrespectful.", "label": 0}
{"text": "If black churches think that Trump loving white churches are their friends, good luck with that. Most of those churches wanna take the black churches all back to the plantation feels, I’ll be honest they really want to take them all the way back to Africa, now that they’re not needed in the fields anymore.", "label": 0}
{"text": "I don't refer to myself as an atheist for the same reason I don't call myself an 'afairyist' for not believing in fairies. Like others have said, it's not necessary to define ourselves by something we don't believe in.  I just say \"I'm not religious.\"", "label": 0}
{"text": "I just straight-up say that I'm an anti-theist and that anyone who still believes in religion in 2024 is mentally ill. Facts don't care about your feelings.", "label": 0}
{"text": "It's almost as if Jesus's followers can twist his words to support hating and oppressing the very same people they already hate and oppress.\n\nMighty convenient, that.", "label": 0}
{"text": "I don’t think religion is right and STUPID but I just let people be stupid…", "label": 0}
{"text": "I don’t respect religion. I respect people, unless they give me a reason not to. \n\nIf they are good person who happens to believe in a diety, so be it. If they are obnoxious about it… no respect given. \n\nThere are certainly stereotypes that go along with being religious, and you can’t help but laugh at them. Judge the person, not the group.", "label": 0}
{"text": "Yup.  The Great Commission.", "label": 0}
{"text": "Because they believe they have the endorsement of the creator of the universe to do so.", "label": 0}
{"text": "I think we're past thinking of Neanderthals that way.", "label": 0}
{"text": "[Rhys is a character from Fire Emblem: Path of Radiance.](https://fireemblem.fandom.com/wiki/Rhys) I stan for him because he is adorable and precious, but he's not considered a high tier character because of his stats and the fact that he's an infantry unit among more mobile healers. I shall always use him in my playthroughs, thus I am a Rhys stan.", "label": 0}
{"text": "I'm glad you found a treatment that works for you.\n\nThese disorders are the emotional manifestations of a physical brain dysfunction caused by a type of autoimmune reaction killing neurons and inhibiting the growth of new ones.\n\nAsk your father if he would treat arthritis, type 1 diabetes, lupus, or inflammatory bowel disease with pray, or would he get medical help?", "label": 0}
{"text": "You can't prove god doesn't exist, but you can prove that a monotheistic god is ontologically evil.", "label": 0}
{"text": "Nah. If you couldn’t die, you’d get used to it", "label": 0}
{"text": "They're allowed to have opinions, beliefs, etc.\n\nYou don't have to respect these positions any more than you have to respect the KKK or Scientology. It's every bit as stupid and backwards.", "label": 0}
{"text": "Logically you'd think it would be easy lol but for some reason I keep getting back tracked by little things. Like something bad will happen, and my first thought is \"it must be a curse!\". Sounds stupid, I know. I guess I was seeking how to break down these ruminating/paranoid beliefs more fully lol cause telling myself \"Ok I don't believe this anymore\" isn't fully breaking down some of these mindsets. I'm just aware they're not healthy or accurate but I'm struggling to kinda snap out of it? Idk. Thanks for your response 😭", "label": 0}
{"text": "I know longer can. It has grown on me. I am so disgusted with it that I literally went to court and changed my family name so that I could not be identified as one of them. Can't, won't respect them.", "label": 0}
{"text": "It's incredibly reductive to call his vice president and chief-of-staff, the latter of whom worked with Trump for two years and was his most senior official, as \"someone\". \n\nTrump supports the termination of the constitution, in his own words. Full quote can be found here: \n https://truthsocial.com/@realDonaldTrump/posts/109449803240069864\n\nHe's a fascist.", "label": 0}
{"text": "I respect people. I respect people that are religious. I respect peoples right to believe in religion. I do NOT respect religion. \n\nPeople inherently deserve respect until proven else wise. Thoughts and ideas (religion) is respected based on merit.", "label": 0}
{"text": "Yes Hiduism has some pretty aweful practices it has no more place in the modern world then the Abrahamic religions.", "label": 0}
{"text": "I say yes, but more of the \"respect someone until they do something to deserve disrespect\" like, let them live how they wish. As long as its not hurting anyone then I'm fine with it", "label": 0}
{"text": "As with any religion, they score more points on the magical scoreboard for every convert they get.  Shit was wild back in the 1500s.", "label": 0}
{"text": "Source?", "label": 0}
{"text": "I'm trying but there seems to be some sort of rooted mindset about it. It's the what ifs, anxiety, what if I'm wrong, or constant confirmation bias thats not going away by saying \"I dont believe this\" ect ect tho I know whole heartedly its not correct, or healthy for me. Thank you so much for your response, I appreciate it. ", "label": 0}
{"text": "Roof antenna ?", "label": 0}
{"text": "It’s an orthodox cross", "label": 0}
{"text": "I can respect people, I cannot respect beliefs that harm others or undermine society’s wellbeing.", "label": 0}
{"text": "If the religious folks are just doing their thing and not trying to force their beliefs on anyone else, I'm ok with that.\n\nIf they are trying to tell someone else how to live then its Hitchens Razor 100%. *\"What can be asserted without evidence can also be dismissed without evidence\"*.\n\nTake it outside Godboy.", "label": 0}
{"text": "The KKK still openly exists? I thought it went the way of the dodo decades ago.", "label": 0}
{"text": "Astrology provides incomplete information, and our mind believes in it, adding power to it, which can be dangerous. Sometimes, negative energy may become attached to it, leading to issues like insomnia, sleep paralysis, feet twisting, energy draining, or ear ringing.", "label": 0}
{"text": "source: [https://www.independent.co.uk/asia/india/school-boy-killed-human-sacrifice-hathras-b2619899.html](https://www.independent.co.uk/asia/india/school-boy-killed-human-sacrifice-hathras-b2619899.html)", "label": 0}
{"text": "Oh man, thanks 🥺🥺🥺 I can't tell you how helpful this was, thanks. Really helped piece things together in my head a bit better.", "label": 0}
{"text": "Who gives a shit?", "label": 0}
{"text": "I am confused. You do understand that this is supposed to be a good faith argument? To explain to you why there is a certain standard of evidence applied in ancient history as a subcategory of historical research? I am trying to be cheritable regardless of your snark and if you read my responses properly you see that I agree with your general sentiment and try to explain to you why your line of reasoning is sound but does not apply.", "label": 0}
{"text": "Respect the right of others to choose to be religious, yes. \n\nRespect their beliefs, no. ESPECIALLY when they’re trying to force others to live by their religious beliefs.", "label": 0}
{"text": "“If the only thing stopping you from doing bad things is fear of god, you’re not a good person. You’re a bad person on a leash.”", "label": 0}
{"text": "Agnostic and atheist are two different things. But either way, just don't adopt a label. Just stop believing in god and live your life.", "label": 0}
{"text": "Because they’re hypocrites.", "label": 0}
{"text": "Did you know it was legal to fuck 12 year olds until 2013 in Vatican City?\n\nhttps://imgur.com/jCpt6yD", "label": 0}
{"text": "Those who give respect, get respect.", "label": 0}
{"text": "Yea, I don't get mad at children for believing in Santa Clause, they're just like big children.", "label": 0}
{"text": "When I was little we were taught to try to get along with people of other faiths or sects.  Christianity has become more extreme over the last 20 years.  Catholics  in America embrace the Dominionists now.", "label": 0}
{"text": "There's like a different religion on every street corner in that place.", "label": 0}
{"text": "Nope, not at all. We should respect religious people until they give us reason not to, but we are not obligated to respect their foolish beliefs.", "label": 0}
{"text": "Too bad “Donnie” wasn’t in the “goo” that hit the floor.", "label": 0}
{"text": "NOOOO!!!!\n\nPeople are entitled to respect until they show they are unworthy of it. Their ideas aren't.", "label": 0}
{"text": "Treating people like a person is a reflection of who you are. Past that, respect is something people have to earn.", "label": 0}
{"text": "Respect is earned, not owed.", "label": 0}
{"text": "No, we need to respect people.  I look at religion like a hobby.  Like if someone is super into monster truck rallies, I'm not going to shit all over them, they're just not something we have in common, but I'm glad they have something they enjoy.  However, if they try to tell me I'm wrong for not loving monster truck rallies, then we're going to have a talk.", "label": 0}
{"text": "The Church violates the tenets of Christianity on a regular basis also.  They don't care.", "label": 0}
{"text": "No", "label": 0}
{"text": "No. I tell people I can respect the fact you HAVE an opinion, I can still say it's bullshit", "label": 0}
{"text": "Just didn't label yourself bud", "label": 0}
{"text": "If they don’t respect your beliefs, then why respect theirs…", "label": 0}
{"text": "Yes! My goodness thats exactly what it is. The deconverting has already happened but deconstructing certain fears and anxieties is kinda kicking my butt. Feels like I'm doing something wrong cause I'm still having thoughts, fears, feelings come up even tho I whole heartedly know its not real. Thank you so much for the advice, really helping me get in the right direction. Thank you for taking the time to respond. 😊 ", "label": 0}
{"text": "I see this as they have SO much repressed sexual desire that they can't help themselves and, most conveniently - all they have to do is screech for forgiveness and it's like it never happened\n\nYet we're the heathens", "label": 0}
{"text": "Religio Delenda Est.", "label": 0}
{"text": "I don't respect the religion but I respect that people have a choice", "label": 0}
{"text": "Nearly all Christian’s do….", "label": 0}
{"text": "Respect other people. You don't need to respect their decisions or values.", "label": 0}
{"text": "I would think that any behavior that infringes on anyone else’s rights should not be allowed/tolerated. But that’s just common sense talking.", "label": 0}
{"text": "Is it baloney because there's nothing to it?  Or because it's a distasteful subject by association?  \n\nI used to think so myself.  \n\nBut an NDE experience within my family made me reconsider.  The book 'surviving death' by Leslie made me realize I had a bias against the idea, and that there WAS some empirical evidence for the notion.  \n\nAnd also that our current scientific process is equipped to handle measurements of the material world only.  \n\nAnd so my stance on religion has evolved to understand it as a human construct, haphazardly explaining a natural phenomena in a more anthropomorphic material way.  \n\nBut more importantly it maintains a class and control structure that has been the justification for acts of bloodshed.  \n\nBut maybe there's a positive slice that should be differentiated from the mountain of fables.  Spirituality vs religion.", "label": 0}
{"text": "I was just pointing out that they always have been exempt. They don't have to DO anything, whatever the laws are.", "label": 0}
{"text": "People are the proper object of respect, not ideas. Some ideas are stupid.", "label": 0}
{"text": "Atheism is simply the lack of belief in the divine. I unfortunately had to learn there are atheists who don't understand science... but regardless, there are many perspectives within it. And that: perspectives, are what I respect in other people. Yes there are flaws in religion, but there are and always will be flaws in my own perspective. Everyone has the right to their own perspective, as it is what they are. And to deny another's self is immoral regardless of perspective. \n\nYou should remember that religion has helped facilitate society before the Enlightenment era, before people even have the chance to question faith itself, to question the very thing that shaped and grew society. I see it as an elderly person, wise yet \"not hip with the kids.\"", "label": 0}
{"text": "That would be the Paleozoic then. Over 550 million years ago. Paleolithic had people and rabbits.", "label": 0}
{"text": "No, no religion deserves respect. On the other hand, others have their right to be stupid.", "label": 0}
{"text": "you don't have to respect their religion, but you do have to respect their right to believe in it.\n\nit's not your choice to make any more that it is their choice to look down you for being gay (for instance), which isn't really even a choice, but they think it is.", "label": 0}
{"text": "No. Just maybe respect the people unless they have wronged. I respect my family, not their religion.", "label": 0}
{"text": "Josephus’ mention of Jesus is widely acknowledged as being added much later to his works by a Christian monk. Not solid evidence, I can’t take seriously any historian who cites Josephus as evidence of the historicity of Jesus.", "label": 0}
{"text": "Nah. I am 37. I just know better than you and AM better than you. Low bar to clear.", "label": 0}
{"text": "Elwood,  Indiana was and maybe is a hotbed for KKK.  It's also highly religious and inbred so it's only natural.   ", "label": 0}
{"text": "I can't even respect religious people", "label": 0}
{"text": "Sarah Henry is cool and sane. David Smith has proven he cares nothing about his constituents, but he is rabid. (And FYI - I am a constituent).", "label": 0}
{"text": "What we mean is actually: I respect others’ rights to have beliefs and I don’t see any point in arguing about it.", "label": 0}
{"text": "I was in a serious motorcycle accident. There is nothing special about getting your lights knocked out. Nothing supernatural about it.", "label": 0}
{"text": "Totally fair. It’s much easier to respect people that do the work to earn in vs simply demanding the be treated better than they’re willing to treat others.", "label": 0}
{"text": "I personally have visited half a dozen of the castles Arthur is buried under ready to rise again to battle.", "label": 0}
{"text": "how are they stupid?", "label": 0}
{"text": "In general, monotheistic religions think that their God is the only true one, and therefore they must convince non-believers of it. It doesn’t happen with polytheists who are more tolerant of other gods.", "label": 0}
{"text": "If they aren't forcing it on others I won't say anything negative to them.", "label": 0}
{"text": "Nothing needs to be respected.", "label": 0}
{"text": "I don't respect religion. Religion overall has resulted in so many atrocities it is deserving of nothing but contempt aside from the fact that it is based on legends and myths. I respect the right of people to believe whatever damn foolishness they wish to believe in but that respect ends when they attempt to use their personal beliefs against me. Respect is earned.", "label": 0}
{"text": "Just the Christian who are power hungry and know other Christians won't argue too strongly.", "label": 0}
{"text": "No idea has any inherent right to be respected. Ideas should be analyzed, re-evaluated, judged, and either set aside or kept.\n\n\nPeople do deserve to be respected.", "label": 0}
{"text": "\"Better dead than smeg...\"", "label": 0}
{"text": "Not all religions are like that actually. Some even discourage or entirely disallow conversion.", "label": 0}
{"text": "As a member of the boomer generation living in the Southern US, I avoid the label of atheist, especially with people my own age. For Americans old enough to remember the Cold War, it is a word that was made synonymous through propaganda with communism and anti-theism. \n\nI don't need that.", "label": 0}
{"text": "Yes, inciting people to harm others in the name of some character in an old book ought to be something that gets you a conversation with a mental health professional. Preferably, a very long conversation.", "label": 0}
{"text": "You should respect the person, you don’t have to respect their beliefs if they don’t make sense.", "label": 0}
{"text": "What are your “beliefs” with regards to the unsubstantiated claims of people who say they have an invisible supernatural eternal buddy ?", "label": 0}
{"text": "I don't even respect them...beliefs are BS...and while everyone feels entitled to be wrong, the strongest sense of self entitlement doesn't make a person right.", "label": 0}
{"text": "Nobody. If they start a fight, I’ll happily finish it. I’m strong enough and far more than fast enough to, usually.\n\nBut I will never bring up religion, nor discuss it, because they invest emotionally in it.\n\nFor me, if it can’t be perceived with our senses, and we can’t meet a Jesus or a god while we are alive, there is no point in ascribing belief, and I refuse to be fake as fuck for the mere possibility of a reward after I’m dead.\n\nOnce I’m dead, that’s it. It’s just a forever sleep, from our perspective. Nothing more. There is nothing after death, and i’m not arguing this because I’ve died 4 times. It’s just darkness until you wake up. \n\nNow, if you have technology or literal, rising-of-the-shield-hero-style magic that can bring a deity to meet us, cool, I’ll believe.\n\nThat’s all.", "label": 0}
{"text": "Congrats and welcome to rationality. You were right to sense that the threat of hell is nothing more than manipulation. Christianity is based  in fear.  \"God loves you! but he'll set you on fire if you don't love him back\". \n\nThe entire story is nonsense. Its most fundamental premise ... that an all powerful god existed for an infinity then suddenly decides he wants to create followers, is absurd in itself. Every aspect of the story past that only makes it more absurd.", "label": 0}
{"text": "Yeah that's what Chick-fil-A IS.  It's not just the workers.", "label": 0}
{"text": "yes, people are spiritual, even the atheists. We all strive for a sense of purpose and for something beyond the material. \n\nAtheists pretend they have it figured out. I seriously doubt it!", "label": 0}
{"text": "We know.", "label": 0}
{"text": "Because their book commands them to in no less than 7.verses.\n\nMonarchists always do as they're told... like good serfs.", "label": 0}
{"text": "Even if there is a God, no way it's one of the Gods described by the big 3 abrahamics. Like you said, \"He loves you\" and \"he will literally throw you into a lack of fire for all of eternity if you doubt him\" are contradictory.", "label": 0}
{"text": "Yeah it’s absurd.", "label": 0}
{"text": "Nope. Fuck them.", "label": 0}
{"text": "Atheists should allow religious people to have their space, just as they should allow atheists to have their space.", "label": 0}
{"text": "Sometimes I will respect the person,  but I will never respect the ideas of Abrahamic religions. I am an agnostic atheist when it comes to a god concept , but am a gnostic anti-theist when it comes to those three religions,  they are absolute rubbish and they poison the minds of adherents,  and affect society adversely,  from family,  friendship on up to the political and social spheres. I'm estranged from my family because they told me I was hellbound", "label": 0}
{"text": "Because they are regular human beings like everyone else. They just love to deny it and pretend they are something special.", "label": 0}
{"text": "No. I have no respect for religion. It causes an insane amount of terrible things.", "label": 0}
{"text": "No as they don’t respect me", "label": 0}
{"text": "Ok, for the millionth time today. . . .\n\nTheism refers to belief regarding deities.\n\nGnosticism refers to knowledge regarding deities.\n\nAn agnostic atheist does not believe in God, but does not know if God exists.\n\nA gnostic theist believes in a God, and claims to know this God exists.\n\nA gnostic atheist does not believe God exists, and claims to know this as well.\n\nLastly an agnostic theist believes in God, but is sufficiently self aware to realise they could be wrong.\n\nMost atheists are agnostic, and most agnostics are also atheists.\n\nAll that aside, call yourself what you like.\n\nI think 'confused' can be a good label, then if someone starts a rant, from either side, you just say, \"this is not helping\".\n\nLikewise, \"spiritual' is probably a bad choice, because it's seen by both atheists and the religious as an invitation to rant.", "label": 0}
{"text": "Lol absolutely not. Treat it like the nonsense it is.", "label": 0}
{"text": "That dude is a piece of shit, he got himself elected to the Hamilton County library (I'm from Indianapolis), and then proceeded to remove ALL 15,000 BOOKS from the children's section.\n\n\nThe town was so appalled that they removed him from the board and reinstated all the books, but he seems to have failed upwards and is now the GOP candidate for Lieutenant Governor.\n\n\nHowever, there may be a silver lining, in that he is not only destined to lose, but he may actually be poisoning the GOP candidacy for Governor as well. Making them both appear to be massive, extremist weirdos.\n\n\nThe Governorships is currently neck and neck, with the DNC candidate (Jennifer McCormick) literally being the best DNC candidate in decades.\n\n\nShe's amazing , she has plenty of name recognition in the state because she's been an advocate for teachers, public schools, and teachers unions for well over a decade...\n\n\n...never forget, Indiana-and specifically Indianapolis-was Betsy Devoss's testing ground for her charter school movement, we are literally ground zero....and it has been a responding failure \n\n\nTest scores are down, literacy rates are down, graduation rates are abysmal, and the charter schools have [stolen tens of millions of dollars from the department of education](https://www.justice.gov/usao-sdin/pr/four-individuals-charged-446-million-scheme-defraud-indiana-department-education) allocated for our fucking kids. \n\n\n....and yet, Republicans are STILL pushing the movement under the guise of \"school choice,\" totally ignoring the failures and theft. \n\n\nI really hope McCormick can win, and I hope she takes down the entire state GOP with her, and not even for \"politics\" or whatever...but literally to save our fucking kids. ", "label": 0}
{"text": "We just have different values I guess.", "label": 0}
{"text": "No need to make a big announcement.\nDon't be a d!ck.", "label": 0}
{"text": "Ask yourself .. what is the probability a God exists .. then, if its less than say 25% you are technically an agnostic, but \\_practically\\_ an Atheist \n\nie. you assume God doesn't exist when you make any decisions in life ..  going to the doctor rather than praying, reading a book on Biology rather than waiting for the mysteries of life to be revealed, working and saving rather than buying a lottery ticket... etc\n\n  \nps. if your family might never forgive you .. or worse, actively punish you in some way .. then maybe dont tell them ?!??!!", "label": 0}
{"text": "As long as you direct it at the beliefs not the person. Unless, they attack you, then gloves are off light them up.", "label": 0}
{"text": "Just keep in mind that the (most likely election deciding) mail-in votes get counted last, and they’ll favor us non-nazis.", "label": 0}
{"text": "Nobody’s putting a label on you other than you", "label": 0}
{"text": "Throughout history, the only constant is change.  No dictator or empire has ever persisted forever, they have all eventually died away.  A single person's lifetime is a tiny sliver of time and it often seems like no change is possible in such a short time.  Yet, when we look back only a few decades and compare it to the present day, the changes are massive.  A single person seems to no power to change anything, yet a world full of people manage to make tremendous changes.\n\nThe key is collaboration.  It always has been.  It is how primitive humans survived in a violent world of predators that were faster & stronger than humans.  It is how humans built villages into cities and cities into nations.  It is how humans tamed every corner of this world, enabling us to travel to the depths of the oceans to the top of the highest peaks - and to send ships into space.\n\nWe can make a difference.  We need the will to work together and the foresight to envision a tomorrow that is better than today.", "label": 0}
{"text": "I used to tell people that I was a \"secular humanist\" - but it doesn't seem to come up much anymore.   I try to avoid the topic.  I'm sure there are many people that think I believe in God - but I don't say anything unless I am asked a direct question. ", "label": 0}
{"text": "Perhaps it not really entitlement but more about them addressing their own fragility of faith.  You know, that nagging doubt they tend to struggle with quietly within themselves. A doubt that can be briefly pushed aside with the anesthesia of group or cult affirmation.  Your rejection of their beliefs is extremely powerful and something they fear greatly.", "label": 0}
{"text": "They are running for school board positions and local offices.", "label": 0}
{"text": "They’re still around, their website is still active. They are selling a shirt on their website that has a quote by John Adams: Liberty, once lost, is lost foerever. I guess that’s their mission statement. 🙄", "label": 0}
{"text": "No, it's not the word I'm looking for. People aren't \"secular.\" Things (places, institutions, policies) are secular. I am not secular. I am an atheists. \n\nAny person that is not a theist is an *atheist*. That's what that word means.", "label": 0}
{"text": "They lost a lot of their elections, and some of them got caught in various scandals (shocking, I know).  Unfortunately, they are still around.  We need to keep our eyes on them for sure.  I don’t think they will go away quietly.", "label": 0}
{"text": "They don't, technically.  Only *their* religion.  Start pushing Muslim beliefs around the water cooler.  The Christians will complain first.  It's as you said, entitlement and sanctimony.", "label": 0}
{"text": "Satan is the bad guy. Blame him. God is spineless and impotent besides being imaginary.", "label": 0}
{"text": "Respect for people, not for ideas", "label": 0}
{"text": "Still around but not as visble.\nLike rats.", "label": 0}
{"text": "I respect others beliefs as long as they don't impede on mine.", "label": 0}
{"text": "It’s always the people that hold the real power in any nation. Always.", "label": 0}
{"text": "I have one on our local school board. He is trying to overturn title 9 because of the M4L lawsuit. Overall he is obnoxious, but so far too stupid to accomplish anything. We will see what happens next election. ", "label": 0}
{"text": "respect the sin, not the sinner \n\nbut this time it’s backed up by — ya know — science", "label": 0}
{"text": "This goes into that whole \"respect can mean two different things\". I'm advocating for basic respect, not deference", "label": 0}
{"text": "We should treat religion like a terrible virus and seek to eradicate it with vaccines such as education.", "label": 0}
{"text": "Unitarians have always been one of the better denominations.", "label": 0}
{"text": "The *Harry Potter* series includes several scenes that take place at King's Cross Station, London.\n\nKing's Cross Station exists.\n\nTherefore, everything in the Harry Potter stories must be true.\n\nIf you can understand why you don't find that argument convincing, you'll understand why I don't find *yours* convincing.", "label": 0}
{"text": "The $73 billion is just for the Vatican, and doesn't include the church in other countries. The Archdiocese of Cologne, Germany alone was worth nearly $4 billion a decade ago. \n\n[https://www.ncronline.org/news/accountability/its-first-public-financial-account-worlds-richest-diocese-reveals-assets-382](https://www.ncronline.org/news/accountability/its-first-public-financial-account-worlds-richest-diocese-reveals-assets-382)", "label": 0}
{"text": "I don’t want to hear about Charlie Kirk anymore. \n\nI used to get sucked into his rhetoric.\n\nAs I get older, I now see him for what he is: an often ignorant individual who plays a dangerous game of politics that destabilizes society.", "label": 0}
{"text": "Hey, we are NOT getting into the topic of if your blue is the same as my blue. But it is very interesting...", "label": 0}
{"text": "There's nothing respectable about it.", "label": 0}
{"text": "No, I can respect the person but not their beliefs.", "label": 0}
{"text": "It'd be like proving the existence of batman or cookie monster. Rubbish.", "label": 0}
{"text": "Yup. I respect their right to do something I have zero respect for.", "label": 0}
{"text": "I respect the fact that it takes courage and fortitude to let go of a lifelong security blanket.  I don’t hold it against those that are unable to let go, especially when the consequences for some are literal death.  But no, there’s no need to respect harmful lies.", "label": 0}
{"text": "I think it's more important to understand why you don't like the label. Is it because you're worried what people might think about you? Do you have friends/family who might change their opinions of you if they knew you didn't believe in God?", "label": 0}
{"text": "I bet you don't speak that way when your wives boyfriend is around", "label": 0}
{"text": "Your mom is an idiot. And that's putting it lightly. \n\nSorry for your loss.", "label": 0}
{"text": "Yes he’s rich. Is he wrong?", "label": 0}
{"text": "There are some school board races where I live that have M4L backed candidates. And the local Reddit has been doing the job of exposing them.", "label": 0}
{"text": "Outwardly I say nothing, inwardly I can only think this: Religion is a crutch for the weak and simple-minded. \nI desperately want to say it out loud but I don’t. I have no respect for religion, but it’s not on me to school or scold them, it’s up to them to figure it out. \nAnd then I go on my way.", "label": 0}
