{"text": "The egg came first. At some point in time, something very very close to a chicken but not quite a chicken laid the egg from which the first true modern chicken emerged.", "label": 0}
{"text": "It's the glass of wine that makes him look responsible? Isn't it?", "label": 0}
{"text": "Oh wow good to know.", "label": 0}
{"text": "I know a couple that defrosted their turkey, in the bathtub, for 3 days at room temp. Like what the fuck?! I don't even want to walk past your house while you're eating that, thats how afraid I am of that bird.", "label": 0}
{"text": "Future me... 10 years later. We met, hooked up. and broke up on the sales floor in year one. \n\nShe's on the verge of being president of the company, I'm an account executive. The minute she gets there, I'm cooked.\n\nDon't do it.", "label": 0}
{"text": "It definitely depends on the situation, I met my GF 5 years ago this month and have been together for the last 3 years. The best relationship I've had in my lifetime", "label": 0}
{"text": "Go home and fuck your lover", "label": 0}
{"text": "This thread is full of “invest in lottery tickets, I won and look at me now” energy. Most of you fucking your coworkers aren’t gonna get married. Most of you are gonna make a mess.", "label": 0}
{"text": "Well if you ever come to NC I can give you my artists info! Her expertise is anime/jrpg characters and she works on a range of skin tones.", "label": 0}
{"text": "We do love us some body shaming huh", "label": 0}
{"text": "I wrote a super long comment lol, it's not meant to be adversarial, I just find this topic interesting and close to my heart.\n\nSo being trans myself, and having studied sociology, I am very much of the opinion that the psychological aspects of transition are severely understated by most people, even most trans people. \n\nYou do very much learn how to \"think like a man/woman\" throughout your transition. Not only because were held to different expectations (and often need to conform to those expectations strongly if we want to be taken seriously as our gender), but you just find yourself in different situations (a lot of trans women talk about how we miss going on walks alone now).\n\nThat said, I don't think I cry because I'm a woman, or because it's more acceptable to cry now that I am one. Back when I thought I was a boy, I never held back tears because I thought it would make me \"less of a man\"— rather, I would often literally wish for tears in that moment and they literally would not come. Now that I'm living as a woman, I will always opt for privacy if I need to cry, and try to hold back tears in some moments. They simply come easier than they used to, regardless of my wishes, there.\n\nAlso note that I said trans women cite that as an effect of *estrogen* specifically. Emotional changes are one of the most immediate reported changes in hormone therapy. Many trans women start our medical transitions before our social transitions (known as \"boymoding\"), and experience these effects before anybody else treats us as women. I've really never heard an account of a trans woman needing to spend a lot of time socially transitioning and considering herself a woman before letting herself cry. Conversely, many trans women socially transition first, and medically transition a few years in (often because of medical gatekeeping policies requiring \"real life experience\"). They may be subject to the extreme standards of femininity more than other trans women, but still report crying shortly upon taking estrogen.\n\nI think that yes, there are multiple factors that predispose someone to crying. Social factors matter, levels of stress and I could see genetics playing a role, too. I also don't think that Testosterone's suppression effect necessarily has a \"100% no tears level,\" just that it makes things different, but that they on average make it more difficult to cry.", "label": 0}
{"text": "I guess. I'm sure he takes extra steps not to shed hair in the food 😣", "label": 0}
{"text": "Where else am I ganna find the girls at?", "label": 0}
{"text": "What suit is that? It looks AI generated.", "label": 0}
{"text": "I wanna see if it pops like that when it heals", "label": 0}
{"text": "Nah you good if she fucked wit your job you'd be getting a big bag.", "label": 0}
{"text": "Who says not to fuck people you meet at school?", "label": 0}
{"text": "There is a stark difference between having sex with someone at work casually vs meeting and dating someone you spend a 4th of your week with.", "label": 0}
{"text": "Facts", "label": 0}
{"text": "![gif](giphy|boPCysNpOXbkihGf4F)", "label": 0}
{"text": "What the hell were they making?", "label": 0}
{"text": "Even has the red lipstick. Bro", "label": 0}
{"text": "You know Little Tommy ripped off his diaper then immediately started using the cookie cutters on them sugar cookies. Hard pass.", "label": 0}
{"text": "I live with my parents....", "label": 0}
{"text": "MY OCD-HAVING ASS: *I tolt you motherfuckers this would happen!*", "label": 0}
{"text": "dogs have killed people. like little kids.", "label": 0}
{"text": "Can confirm. My last job I slept with 60% of my coworkers. Didn’t end well", "label": 0}
{"text": "Or picked his nose, then touched every cookie to decide which one to eat.", "label": 0}
{"text": "Damn 6 lines too much for you ?", "label": 0}
{"text": "https://preview.redd.it/lgzvcm05sswd1.jpeg?width=1284&format=pjpg&auto=webp&s=c73dff12c5ee256dfa3002ba5a34b3ce05639d42", "label": 0}
{"text": "🤣😂🤣😂", "label": 0}
{"text": "the dick isn't good enough to spin the block", "label": 0}
{"text": "Oh wow hold up this is a special case. I don’t think it’s because you slept with ‘a’ coworker. I think it was something else…", "label": 0}
{"text": "I grew up with mostly non-Black friends.  Their parents were always cool and super hospitable.  Out of all my friends, I only ate at 2 of their houses.  My best friend (best man in my wedding) had a single mom that made a lot of money but never cooked. \n\nThis meant all the food at his house was prepackaged and I would watch him heat up pizza rolls in real time. \n\nThe other was my friend Brandon who was raised by his grandparents. His grandmother worked at the Vietti chilli factory in our city for decades and she was SUPER serious about food safety. \n\nOf course this isn't just a race thing but I always wondered why my other friends (not Chris or Brandon) would let the dogs and cats in the kitchen. We had a dog and my sister would lose her crap every time he went near the kitchen. \n\nI never cooked (other than a sandwich or ramen) so I just assumed it was because he was going to try to beg for scraps or get into thengarbage. I NEVER considered the pet hair issue until I became an adult.", "label": 0}
{"text": "Yea but traffic is ass and it disproportionately affected minorities the most when the roads and highways were being built.", "label": 0}
{"text": "Their **hands,** specifically. They’re literally so dirty. Filthy.\n\nFun fact: If every surface of your hand doesn’t get **wet** with hand sanitizer (and then you rub them until they dry) — you aren’t using hand sanitizer properly. You’re welcome.", "label": 0}
{"text": "![gif](giphy|10JhviFuU2gWD6)", "label": 0}
{"text": "Artwork looks sharp af", "label": 0}
{"text": "AYO.\n\nI’m finna time travel for that rejection ong", "label": 0}
{"text": "![gif](giphy|xULW8Bx2HlkdALCRQk|downsized)", "label": 0}
{"text": "![gif](giphy|3o84sw9CmwYpAnRRni)", "label": 0}
{"text": "Why y'all wanna mess with your coworkers so bad. I had to report two guys to HR in one year. Leave your female coworkers alone", "label": 0}
{"text": "Usually one or both are not single either too", "label": 0}
{"text": "Funny... people are killing Diddy. Before he's been convicted of anything.\n\n![gif](giphy|HXNBTbw0aN0SFahJ89)\n\nWhile the other presidential candidate has broken laws in our face. Major ones.", "label": 0}
{"text": "You’re apparently not that rare, like half the people in here are commenting they met their spouse at work. Seems to work out almost as much as it doesn’t", "label": 0}
{"text": "Per \"Of Mice and Men\" - \"S'pose Curley jumps a big guy an' licks him. Ever'body says what a game guy Curley is. And s'pose he does the same thing and gets licked. Then ever'body says the big guy oughtta pick on somebody his own size, and maybe they gang up on the big guy.\"", "label": 0}
{"text": "You know damn well the calf muscle is the only one you can't grow.", "label": 0}
{"text": "![gif](giphy|0Wzkc9iirQ4ZI7JoaD|downsized)", "label": 0}
{"text": "Lol meanwhile my then co-worker is now my woife. Worked out for the both of us!", "label": 0}
{"text": "Hear, hear! I’m looking for them Safeway/Kroger sugar cookies with the label acting as a seal. They’re not perfect but at least they have food safety training and are required to wear a hairnet in those bakeries. I’ll grab some pretzels if I see the bag being opened, but they’re dead to me once Chad sticks his nasty fucking fingers into the bag.", "label": 0}
{"text": "https://preview.redd.it/4gwtbpwssswd1.jpeg?width=4636&format=pjpg&auto=webp&s=bd9e8094e015819eef707071baae57a3379aed2b", "label": 0}
{"text": "I already got a big bag, and at this level it's about power and humiliation. She's can't unsuck this dick and it's killing her.\n\nDon't fuck your coworkers.", "label": 0}
{"text": "\"a second Miles has hit the towers, Sir\"", "label": 0}
{"text": "Glad I’m not the only\nOne", "label": 0}
{"text": "Solange:\n\n![gif](giphy|WvSSXJ34rChVyn25Gt|downsized)", "label": 0}
{"text": "Better to live with regret than be haunted by what if.", "label": 0}
{"text": "https://preview.redd.it/ag9e5o67tswd1.jpeg?width=902&format=pjpg&auto=webp&s=73a1afe2ac06e04ce59b80c0f88418eec0adec7b\n\nBunny hopping in these comments", "label": 0}
{"text": "All my tattoos have to have colors in them.", "label": 0}
{"text": "Damn she was cute af", "label": 0}
{"text": "It was a different time. \n\nI had just broken up with my ex.\n\nIt didn’t take much conversation, or someone asking for favors and before I knew it I was swimming in a sea of 🐱and 🍆", "label": 0}
{"text": "People do stuff like that to visibly Indigenous people in Canada, especially in certain towns.", "label": 0}
{"text": "Pretty impressive, would be too much for me in a single walk xD eventually\n\nhttps://i.redd.it/uxlbjiugtswd1.gif", "label": 0}
{"text": "![gif](giphy|UyZrn9UEgJ1JwYMFc4)", "label": 0}
{"text": "Bro licked the sauce off the cardboard and everything wtf", "label": 0}
{"text": "Lol I had a white man once ask if I dated white men. When I said I wasn’t opposed, he didn’t believe me and started asking if certain NBA players were “cuter” than him. Man asked me if who I’d chose, Devin booker or cp3? Jayson Tatum or lebron James? (I was a bartender at the time and entertained the conversation only because I wanted a tip). He was absolutely mortified that I find lebron attractive. For context, he was some 6’5” nba wanna be (I’m assuming) and tried to compare himself to other men who were just as tall/muscular. Not many white nba players to choose from, however. \n\nTrust me when I say stranger comments have been made when liquor is involved.", "label": 0}
{"text": "Funny enough both my father and I don't lash out at people. I've seen him swallow any semblance of pride and deal with the world all together . Despite serving in thr Navy he's one of the calmest people ice had the pleasure to know. And when I was a teenager I've wanted to be just like that. Calm enough to make a plan in the hear of things.  Calm enough to know when to give up and when to push forward. Calm enough to admit when he's wrong and not double down on it. He's taught me to walk away from things if their aggravating you ,then come back when you're level headed , and taught me that venting is the best way to relieve stress , even if the only person you can talk to at the moment is yourself. (Though I've always got him, my sisters and my mom to talk to via messenger) \n\nWe don't bottle up emotions to never see the light of day agai , we let them out later on when it's safe and tensions are Calm.", "label": 0}
{"text": "You cannot see Jolene, she operates on Greek God rules your eyes will literally burn out of their sockets.", "label": 0}
{"text": "Why do they talk to people like shit? It’s something I’ve noticed in the culture too - not all of course, but many do.", "label": 0}
{"text": "If attempting a fucking coup almost four years ago didn't change anything, nothing will.", "label": 0}
{"text": "I watched a dude at the McDonalds I worked at wash his gloves......", "label": 0}
{"text": "About to send you a message!", "label": 0}
{"text": "You should see Project Runway when they have challenges that are with anything other than runway models. There’s one specifically where the designer is so rude to an incredibly average woman.", "label": 0}
{"text": "I’m married to my former co worker where did I go wrong!", "label": 0}
{"text": "I always thought that was such bs and it made me sad for them. They would do this to anyone with less than perfect skin, like sorry you don’t have the skill in your craft to either work around or with it but it’s like, your job. Also never cared for the fact they called people canvases. Client would have been nicer.", "label": 0}
{"text": "Yall just be saying anything on the internet huh", "label": 0}
{"text": "Not at all. A lot of people are insecure about things some of us find sexy. I'm rooting for everybody to love their body without doubts one day even as our bodies change", "label": 0}
{"text": "A narcissist can’t admit when they were wrong. It’s in direct conflict with their sense of self. \nAn extremely bad quality to have as a normal functioning person, but even worse if you are the leader of a country.", "label": 0}
{"text": "😂🤣😅😂🤣😅", "label": 0}
{"text": "Yeah but her at 36\n\nhttps://preview.redd.it/n3382msfuswd1.png?width=205&format=png&auto=webp&s=0b0b99e3cdaf3bdcba1ad3b23977dd9821b360e9", "label": 0}
{"text": "Yeah sometimes It’s like that \n\nCause like why are you walking around with all that ass? 🚶‍♀️", "label": 0}
{"text": "I had to look up \"chunti\"", "label": 0}
{"text": "They be having whole gps's and still be asking me where to go", "label": 0}
{"text": "You an asshole nigga lmao", "label": 0}
{"text": ">tasted like Pripyat after the Chernobyl disaster\n\n![gif](giphy|PPrFKKsCF96d0sFrMO|downsized)", "label": 0}
{"text": "![gif](giphy|3oFzmpOB6IYecRY5eo|downsized)", "label": 0}
{"text": "Bro there's pro athletes with calves like this. Black people don't get big calves like that usually", "label": 0}
{"text": "I got a wife and kid outta it though.", "label": 0}
{"text": "Color theory has nothing at all to do with what color stays on what skin tone the best. In fact color theory has nothing to do with the application of tattooing at all. Color theory shows which colors best go together on a palette to compliment or contrast each other. This is very relevant to all art not just tattoos. Not one to jg to do with application or canvas though.", "label": 0}
{"text": "https://preview.redd.it/sfvxd7iruswd1.jpeg?width=183&format=pjpg&auto=webp&s=3e3f4463904ebd108343bd545a221b03e22ab7f6\n\nShould this be the actual photo these days, or was she just biding her time. Some knives sharpen very, very slowly after all.", "label": 0}
{"text": "Bro, I can gear the \"dink-dink-dink-dink-dink-dink: of his little webbed tippy-toes!!!\n\n![gif](giphy|3oEjHAUOqG3lSS0f1C)", "label": 0}
{"text": "https://preview.redd.it/zaa7r6ozuswd1.jpeg?width=599&format=pjpg&auto=webp&s=6e0bbef29ed2e057e036ead1c40b31e88fe28782", "label": 0}
{"text": "Nah, I've been with plenty of coworkers & never once had a problem because of it. Just gotta be real with it.", "label": 0}
{"text": "And you know it sat on the front seat of their car, in the sun, on the drive to work too. NOPE.", "label": 0}
{"text": "Yeah, they call themselves \"Christians\" while literally doing the opposite of everything Jesus Christ stood for. School lunches for low income kids? Free healthcare? Treating immigrants with kindness and respect? Nope, they believe in the religion of Republican hate. It's time they just admitted it.", "label": 0}
{"text": "🫶", "label": 0}
{"text": "Goddammit this meme made me snort in this context haha.", "label": 0}
{"text": "I picture Christina Hendricks every time I hear Jolene.", "label": 0}
{"text": "Oh fuck dude I thought WW stood for Weight Watchers and I was ***hella*** confused", "label": 0}
{"text": "What does turkey know that America doesn't? 🤔", "label": 0}
{"text": "Y’all really mad beyoncs out her own spin on the song lmfao", "label": 0}
{"text": "Exactly, Ash didn't hear the bell cause he was stone cold dead.", "label": 0}
{"text": "Bernie did a great job of doing that. He needs to come back on once a year to keep him in line lol.", "label": 0}
{"text": "Not everyone who votes for Trump is a “cultist”.   There are different buckets, but of the ones I know, I’d classify them as “low information voters”.   All they see is that a bag of Doritos now costs $6 and it wasn’t like that when Trump was POTUS.   \n\nThey’re not going to dig any deeper than the price on those Doritos.", "label": 0}
{"text": "Your post was removed cause it's not an image hosting site.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BlackPeopleTwitter) if you have any questions or concerns.*", "label": 0}
{"text": "Which means I’m defeated, which means no half of the money.", "label": 0}
{"text": "Fuck dem kids. I ate 3 of their lil ass Dorito bags and left them with them plain ass Fritos only.", "label": 0}
{"text": "\"You know what? Don't even reanimate him. Just let him flop around up there.\"", "label": 0}
{"text": "Love Bill Burr", "label": 0}
{"text": "I remember reading that lie they told themselves too! And I hated it then, and I hate it more ***NOW***!", "label": 0}
{"text": "Pedophile anime?", "label": 0}
{"text": "In Colorado they mail us the sticker along with the ballot!", "label": 0}
{"text": "![gif](giphy|njxkENt8FXreAt5TIT)", "label": 0}
{"text": "Ain’t fucking with no one who can’t take a flamethrower, numerous thunderbolts, being those 100 feet away by telekinesis or a gust of wind then get right back up like nothing happen. Only thing I’m catching are those hands.", "label": 0}
{"text": "They \"donated\" the gazebo just like they \"donated\" all the statues of rebels and traitors. Horny young people saw a private secluded gazebo and fucked inside it. The gazebo is related to BLM, the fucking is not", "label": 0}
{"text": "No it’s billionaires going all in on fascism in order to remove all regulations and take full corporate control of America \n\nThe ones voting for Kamala are the ones who know even if they get taxed they’re still rich but at least the environment and economy will be stable. \n\nThe ones wanting Trump… 60 years of republican dreams coming true", "label": 0}
{"text": "https://preview.redd.it/fv05l3cg8ywd1.jpeg?width=274&format=pjpg&auto=webp&s=cdbfab25179a4b7d1b81931d8d16f97a6c276a8f", "label": 0}
{"text": "Of course it is! How did I not realize that I wrote city?😂", "label": 0}
{"text": "Anyone remember television back in the day after like 1am? \n\nGirls gone wild commercials. Those rated TV17+ movies. \n\nThe TVs whole personality changed", "label": 0}
{"text": "He uses cauliflower or imitation chicken for vegetarians and vegans that appear on the show.", "label": 0}
{"text": "Can I pick madara?", "label": 0}
{"text": "People often create large batches of food without properly considering the required cooling and storage needs. ", "label": 0}
{"text": "And she’s probably heard that other partners, or alternative options, are much worse so in comparison her man probably seems really good despite their politics", "label": 0}
{"text": "Theo Von had on both Trump and Vance sadly, and many people are being duped by the fact that Vance doesn’t have dementia and Von is humanizing Vance… it’s sad", "label": 0}
{"text": "I'm a white man in my 30s and I was gardening the other day and my black neighbor referred to me as \"Martha Stewart\". fucking lol", "label": 0}
{"text": "That's way cooler than we get here\n\nhttps://preview.redd.it/uhsa5klo8ywd1.jpeg?width=1977&format=pjpg&auto=webp&s=1a28b002e3feaea46316a18c67093f80c958e804", "label": 0}
{"text": "Quite possibly, the better the coat the more you get talked about. It's like it's not cool to be prepared 😂", "label": 0}
{"text": "Man, the killer for me was people sayin, “you gonna keep it like that?”, but in a “you shouldn’t” sorta way.", "label": 0}
{"text": "\"Noo she's not a minor, she's a 1000 year old demi god.\"", "label": 0}
{"text": "I will box Saint Charlos bitch ass all day any day. One Piece fans know", "label": 0}
{"text": "Huh? If it was 78% of white women, Trump would be president and the Senate and house would be majority Republican", "label": 0}
{"text": "you love it more than eating ass?", "label": 0}
{"text": "https://preview.redd.it/74g0newr8ywd1.jpeg?width=412&format=pjpg&auto=webp&s=568b18b831c5f44f66a62652ae386138aa21954a\n\nSeems like the original OP is just self reporting. Nobody else is seeing puckered assholes before lunchtime without the algorithm identify you as a horny ass nigga…", "label": 0}
{"text": "You can slice out thirty minutes after work to stop by and say hello right? You don't have to stay at a party and pop bottles all night. Notice how you don't jump right back into your responsibilities during your lunch break? You kick back and bullshit at various times throughout the day. Scroll reddit, watch tv. read a chapter of a book, bird watch. Whatever. \n\nHey my first cousin is having his birthday party tonight. Let me stop over there after work for 15 minutes and tell them hello. Drop a little gift off. You don't have to go spend 5 hours partying with somebody to show some love on their one day per year to get focused on.", "label": 0}
{"text": "They usually the worst fucking ones.... Religious people scare me. Been watching their evil asses since I was a kid. Some mean well but many fucking don't", "label": 0}
{"text": "HIS NAME TRILLIAM SHAKESPEAR (the FIRST MC...)", "label": 0}
{"text": "I get why people are frustrated with this, but I also don’t get why anyone thinks newspaper endorsements matter to anyone.", "label": 0}
{"text": "Michigan teamed up with local artists for their vote stickers and people are trying to get them\n\nhttps://preview.redd.it/d6vvsyx29ywd1.jpeg?width=1300&format=pjpg&auto=webp&s=07b5bf8c006a555153bba144f43c38aeb1f2b6ab", "label": 0}
{"text": "I mean, sometimes I need to be called stupid in a way that makes me think about why I'm being called stupid. Public service as far as I'm concerned.", "label": 0}
{"text": "Honestly if you look closely at the lyrics, the song is very kind to Jolene.  Never insulting her, and even praising her at times", "label": 0}
{"text": "All represent or try to get elected in predominately white districts.", "label": 0}
{"text": "Ash would beat the motherfuckin breaks off yo ass you ain’t wanna ketchum hands", "label": 0}
{"text": "I'm not sure what she was thinking. Most churches where I'm from literally called a big meeting to vote on having it in their church bylaws, that no member of the LGBT+ community is ever to be allowed in any position in the church.", "label": 0}
{"text": "I am not sure she is Becky with the good hair.", "label": 0}
{"text": "Exactly. That MF flies!!", "label": 0}
{"text": "Well duh, democracy dies when billionaires don't get to control the media!\n\n/s", "label": 0}
{"text": "Hamtaro i am sorry but i NEED that money", "label": 0}
{"text": "That's why I choose Hans Moleman. Just have get out of his way and he'll win for you.\n\n![gif](giphy|xT8qB8ILrcOt4Zm6kM|downsized)", "label": 0}
{"text": "you really mad ppl have a different opinion than you on a song?", "label": 0}
{"text": "Won’t endorse but will kiss Donald’s ass.", "label": 0}
{"text": "Ah yes, that one subreddit", "label": 0}
{"text": "And he had a whole fucking career outside of those commercials that everyone seems to have forgotten", "label": 0}
{"text": "I'd be the first to prevail against Truck-kun for that kind of money.", "label": 0}
{"text": "Very cool, I didn't know that!", "label": 0}
{"text": "Ash went hard af when he turned into stone ", "label": 0}
{"text": "Same can be said of New York State", "label": 0}
{"text": "Everyday the phrase \"fascism is just capitalism in decay\" makes more and more sense. ", "label": 0}
{"text": "And affairs", "label": 0}
{"text": "do we actually find the self-hating white guy caricature charming or are you just making fun of a guy who is almost certainly in an unwilling 1-way \"open relationship\"", "label": 0}
{"text": "Edit your crap. Your post is incoherent.", "label": 0}
{"text": "Yamcha can fly, shoot ki blast that can destroy buildings and can move fast enough that the untrained human eye has trouble keeping up. \n\nEven though he is a meme compared to the main DBZ cast, in the Saiyan saga alone he is easily one of the top 5 strongest humans on the Earth.", "label": 0}
{"text": "Youtube just started recommending videos of a lady grooming cats and dogs, and it's so weirdly fascinating.", "label": 0}
{"text": "Probably because he's not. Listen it's fun to play pretend on reddit but in real life, not every person voting for Trump is a racist pedo rapist. Some just don't want another 4 years of the Obama administration. \n\nAnd I'm glad we're all still allowed to vote for who we want. I mean technically I didn't vote for kamala and she wasn't even in my top 5 but I guess that's what we got so imma ride with for at least 4 but it leaves a bad taste seeing how it went down.", "label": 0}
{"text": "I would never in a million years vote for Trump.\n\nI've voted blue my whole life, and probably will, unless things change a whole bunch.\n\nThat said, I don't think it's productive to think about people who vote for Trump (or any other fascist shitbag or politician with shitty political views) as \"the enemy\".\n\nI've met plenty of decent people with deplorable political takes, and I've met many people with very enlightened politcal views who are kind of dirtbags in their personal lives.\n\nPolitics matters, but I don't think it's the full measure of anyone (unless that's pretty much all they do).", "label": 0}
{"text": "Yes, and youre average person is doing even LESS than that because the average person doesn't lift at all.", "label": 0}
{"text": "I'd send Walz to Rogan. I think Harris would do fine on there, it's not like Rogan is some debater or intellectual, but him and Walz could bond over hunting and the more rural stuff. Walz is the most personable one out of the four on the dem and rep tickets IMO. Also, Rogan usually just agrees with his guests.", "label": 0}
{"text": "some random fucker from some slice of life anime probably. Like maybe bonobono or something. I don't even have to hurt them just win in a fight", "label": 0}
{"text": "Twitter after dark is just in name bro. They don’t care cause horny doesn’t have a time zone apparently", "label": 0}
{"text": "Is [the link](https://a.co/d/dk1EnoG) just not working, or…", "label": 0}
{"text": "The commenter in question did not display one character of self-hate.\n\nI clowned him for likely having a high credit score, and obliged and said he absolutely has a high credit score.\n\nFeels like you're projecting here fam.\n\nWhite people who have a problem with Black people, in my experience, are never okay being made fun of by Black people.\n\nBut you can keep searching for problems if you like.", "label": 0}
{"text": "he’s a childb", "label": 0}
{"text": "I want to drive that.... truck. I'd roll those windows up and down all night, I'd really crank them. Up down up down, stop half way and catch my breath,", "label": 0}
{"text": "Agreed, that’s how I know he’d be an easy win. He cemented himself as a dweeb in that moment", "label": 0}
{"text": "Cancel your subscriptions and vote.", "label": 0}
{"text": "At least I’ll get to meet King Von", "label": 0}
{"text": "Then got the nerve to say what legalizing weed would do for black folks, \"I DoN't SmOkE. \n\nWell there are thousands of brothas across the country doing time for weed that will get shorter sentence and even released if this come to pass. Might even get there records clean. It also takes away 90% of the fishing attempts by cops to search black people. \n\nThey must of forgot of the VA cop that 100% of his traffic spots he claiming weed smell to search the car, either with dogs or with permission and only found drugs 10% of the time.", "label": 0}
{"text": "Late 1900's here; dirty mop water gets poured down the toilet.\n\nAlso, if it ain't Original Pine Sol^(TM), it ain't right. \n\nFight me.", "label": 0}
{"text": "I see a lot of people use the same, unwashed non-metal spatula throughout their burger cooking. You can't do that.  I always use two or give the spatula a good wash few times during the cooking process if I only have one. ", "label": 0}
{"text": "Yeah I bet you hold cups like that all the time at home", "label": 0}
{"text": "to be fair, Donald's corpse would still be a better president than Donald", "label": 0}
{"text": "“The immoveable”. It’s also works because it is Fire Emblem reference", "label": 0}
{"text": "Y'all don't rinse your mop after using it?", "label": 0}
{"text": "Thorfinn post Farmland Arc. He would let me kick his ass.", "label": 0}
{"text": "Stop it. These aren't mental health issues.", "label": 0}
{"text": "For me it’s Nate the Hoof Guy 😂", "label": 0}
{"text": "I mean, do you really think you could beat up ANY pokemon?\n\n\nThem jokers got X Men powers. \n\n\nMost of them are just massive, a Pidgeot is a 4 ft tall terrorbird. \n\n\nOne day the pokemon of Kanto will rise up and overthrown their oppressors, and the people will be massacred.", "label": 0}
{"text": "Straight-up fight with no interference? King, from One Punch Man.", "label": 0}
{"text": "Carl Weezer from Jimmy Neutron.  I'm sure I could take him!", "label": 0}
{"text": "Fair enough.", "label": 0}
{"text": "![gif](giphy|xUA7aRXoHfwXDqlZSw)", "label": 0}
{"text": "\"Democracy is being murdered in broad daylight\" - FTFY", "label": 0}
{"text": "Ash was casually lifting larvitars. Those mfs HEAVY. Ash is jacked as hell, I'm not picking a fight w him", "label": 0}
{"text": "I didn't get one for voting early. Absolute BS!", "label": 0}
{"text": "I think Trump is transparently a conman, but this propaganda and rhetoric has existed for as long as I've been alive, it's just getting more extreme.  Depending on your values, some of these \"obvious\" black and white issues, aren't.  You have people who legitimately think abortion is murdering an unborn child.  Agree with that or not, it's a viewpoint that paints one side as the \"obviously\" evil side, yet if you make it about it being woman's health or rights to her own body, the narrative shifts.  Most people exist in the middle:  immigration good, unlimited illegal immigration bad.  Taxing the rich good, taxing the middle class bad.  That sort of thing.  So call it Russian propaganda if you like, but there's a reason that 30% of Americans identify as independant.\n\nI'll just be happy when they actually bring back higher tax brackets for the millionaire class, instead of just talking about it.", "label": 0}
{"text": "![gif](giphy|GHrMQKLeR4MoAXuoUj)", "label": 0}
{"text": "Short for Tadlagesh the 16th", "label": 0}
{"text": "So good, plus Gregory Hines .", "label": 0}
{"text": "My 10 year old brother would be a better president than Donny.", "label": 0}
{"text": "I really appreciate the performance you put there. It was really engaging for the masses.", "label": 0}
{"text": "Or, more accurately, *Jeff Bezos* won’t endorse anyone.  The Post knows the danger Trump presents.", "label": 0}
{"text": "Ash was about 2 losses away from going full \"fuck it, I'll win the Pokémon League myself\"", "label": 0}
{"text": "Being pro-choice and disagreeing with someone's rationale for choosing not to abort are not contradictory positions. Being pro-choice just means that you support access to abortion and the freedom for women to choose for themselves. It doesn't mean that you're obligated to feel positively about the choice they end up making.", "label": 0}
{"text": "Nah early in the series he just straight up killed people.\n\nI'm taking one of the suitcase kids from made in abyss", "label": 0}
{"text": "\"Lookin' like Spongebob at Sandys reaching for that water with them cracked lips\"", "label": 0}
{"text": "I asked for snickerdoodles for my birthday. I think it was the only thing I specifically asked for. Didn't get any but my wife+life are so good to me I couldn't say anything about it. But im saying it now, I was really looking forward to them. Maybe Christmas but idk how to bring it up without reminding her that she forgot last time. 😐", "label": 0}
{"text": "I scrubbed my fridge with a new toothbrush during covid...\n\nIt has never been so spotless", "label": 0}
{"text": "As EASILY my holding pokemon who weigh a couple THOUSAND POUNDS 🤣🤣. I would fight hamtaro easy W", "label": 0}
{"text": "So that gives him the right to advocate for people who want to remove other people's rights?", "label": 0}
{"text": "Fear. I saw this TikTok and read comments. So apparently this occurs when these people’s husbands are rattled with fear. Many of the women I saw in the comments were talking about how their husbands weren’t conservative or anything but through constant fear mongering started following trump. This is something I have personally witnessed in a LOT of people most trump supporters are REALLY fucking scared and ignorant and their fears are somewhat understandable they are broke just like everyone and don’t know why who or what to blame. And republicans don’t tell their voters what will happen if they do vote for them just what will happen if they don’t and who to blame for the current state.", "label": 0}
{"text": "The worst part is, the younger sibling never asks for money when things are starting to take a turn for the worse; they ask when the goddamn house is on fire and they need you to empty your account.", "label": 0}
{"text": "Naw, boy is getting stronger by the day. You will go night night lol", "label": 0}
{"text": "So ... No difference?", "label": 0}
{"text": "Shinji from the Evangelion series. All that guy does is just cry like a lil bih and he ain't shit without the mecha of his.\n\nFor 100 million I'll give his ass something to cry about for sure. XD", "label": 0}
{"text": "Used to feel like a toll booth driving thru there", "label": 0}
{"text": "lol, brother, the only thing I'm projecting is my distaste for people with no dignity or self-respect, desperate for validation. I don't project, I \"describe exactly what you're doing.\" I don't even need to look through his post history to know he's got some \"white guys for Harris\" merch somewhere:\n\n>signed, your friendly white\n\n\n\n[you know exactly who I'm talking about, it's like  90% of this subreddit](https://youtu.be/x-ZdAIPJ9RM)", "label": 0}
{"text": "Oh no, not another 4 years of the Obama admin!", "label": 0}
{"text": "In CA they send you a sticker with your mail in ballot", "label": 0}
{"text": "Vegeta - because I want to die at the hands of a real nga.", "label": 0}
{"text": "I remember once attending a holiday gathering at a coworkers house back in 2008 during my first job out of college. This coworker and others had prepared a lot food. I was one of three dots at the event. After getting there and seeing two cats casually perched atop the kitchen counter and walking on top of the island, I politely 'noped' out. I stayed, but I did not eat anything. Since then I've adopted a strict rule of not eating everybody's cooking.", "label": 0}
{"text": "I support  a women's right to choose. Support is  positive and at the very least neutral", "label": 0}
{"text": "Go check the back because I ain't leaving here with a yo voté sticker.", "label": 0}
{"text": "Billionaire owner of the LA Times just did the same. The head of the Opinion board resigned. They're desperate. Get used to it.", "label": 0}
{"text": "Abject cowardice", "label": 0}
{"text": "Wouldn’t a media organization endorsing a president be more bias than not?", "label": 0}
{"text": "No? I said its sad this is what he has become", "label": 0}
{"text": "Democracy dies in Darkness, and we switched the light off because Papa Bezos told us to.  Fucking cowards.", "label": 0}
{"text": "He's a robot with no human emotion. He just spews out the long questions he memorized with no room for any extra human breaths.", "label": 0}
{"text": "Ash be tanking some high attack moves... let your base 10 attack ass think shit sweet.", "label": 0}
{"text": "They're probably not talking about Mewtwo itself, but the sub about [women](https://www.reddit.com/r/GirlsShapedLikeMewtwo/) that share its shape.", "label": 0}
{"text": "I've had people who can lift as much and more than me not be able to run a mile before tiring out, while I can go for 6+ miles without stopping. If you aren't training for that, then your body simply can't handle it. Hell, most people nowadays are tired out and winded just going up a single flight of stairs or walking uphill for 30 seconds.\n\nYou are HEAVILY overestimating the physical capabilities of your average person, especially in the US, likely because YOU are able to do something or are only surround yourself without those who can, thus skewing your perception. Considering the average person in western society is overweight if not obese, I dont know how you'd expect them to be able to do anything lengthy physical feat.", "label": 0}
{"text": "Bucket of crabs is what it is.", "label": 0}
{"text": "If the dudes wealthy folks overlook a ton", "label": 0}
{"text": "Ash would uppercut her like Tyson uppercutting a midget into the stratosphere. She hasn’t truly delved into the Pokemon universe cause if she had she’d never post that.", "label": 0}
{"text": "Who are you quoting?\n\nAnd are you suggesting white guys shouldn't be for Harris? \n\nI don't even know what you're mad at yo. \n\nSo anyway.\n\nBye.", "label": 0}
{"text": "If a newspaper can’t get the big stuff right then how are we supposed to trust them at all?", "label": 0}
{"text": "Like i was literally agreeing with you and then just saying it was sad that this is what he has become. Are you just looking for reason to fight with people?", "label": 0}
{"text": "u/washingtonpost I know you’re just one person and nobody’s blaming you for this, but this is your sign to jump ship before you’re weighing whether or not to even include this job on your resume. This is fucking shameful.", "label": 0}
{"text": "Wait, this happens to other people too?", "label": 0}
{"text": "I support this. They obviously did it for the wrong reasons but not endoring a genocidal candidate is a good idea. Considering they're both genocidal, don't endorse either.", "label": 0}
{"text": "You can use the steam mop on sealed hardwood. Just be sure not to keep it in one spot too long", "label": 0}
{"text": "Yeah, the billionaires are pulling hard for Trump because they’re scared the gravy train might come to a screeching halt. It won’t, but it might not be as easy to rip off your workers as before. They might lose a couple million dollars!", "label": 0}
{"text": "Exactly. Especially if the person had cheated on you. There’s no way you’ll be comfortable with seeing them every day for 8 hours.", "label": 0}
{"text": "Bro looks like if Handsome Squidward used cocoa butter lotion.", "label": 0}
{"text": "Hey...HEY YOU..... You stole my account name! Im old enough to just have a first/lastname email address without numbers or symbols! I CALLED DIBS!!!!!!......Wont return it huh? Eh i dont blame ya its a fine username", "label": 0}
{"text": "You be thinking things will slow down when they get jobs lol I got news for you", "label": 0}
{"text": "Oh I’m sorry I thought this was the Kanto region. This isn’t the Kanto region? Oh I’m sorry\n\n![gif](giphy|26ufqbYy8Dz7lZyYE)", "label": 0}
{"text": "It won’t be pretty when she receives that work.\n\nhttps://preview.redd.it/52ot9rnddywd1.png?width=1241&format=png&auto=webp&s=4f4f97587822217363922b144d4de800db6b4e46", "label": 0}
{"text": "The reason it's laughable is because these people still want to act like politics is something deeply important to them. Putting together a whole video parading about how you're showing the ladies how to fight against Trump all while uncritically dating a Trump voter looks ridiculous. If politics matter so little that you can overlook them for your partner then fine, but you don't get to turn around and act like they suddenly matter to you at election time.", "label": 0}
{"text": "Same.", "label": 0}
{"text": "Outside of the dramatization, there are laws being passed, taxes being spent and plenty more that don't align with what some people want.", "label": 0}
{"text": "As my man little Wayne would say, real Gs move in silence like lasagna", "label": 0}
{"text": "Even the candidate that you supposedly voted for called trump a fascist. But of course it’s just conjecture..", "label": 0}
{"text": "I’m the youngest and my older siblings call me.", "label": 0}
{"text": "Anya from Spy X Family. I'll kick the shit out of that little bitch (but it would bring me no pleasure. I would hate it)", "label": 0}
{"text": "Actually, as a younger sibling, I really only ask my eldest brother for money for the most trivial things that I don’t wanna bother my mom with. Like I asked him for $6 to get drinks from my college’s vending machine.", "label": 0}
{"text": "Sounds like he might have laid hands as well", "label": 0}
{"text": "that's some primo r/asablackman shit. damn.", "label": 0}
{"text": "It's Joey Maranara isn't it", "label": 0}
{"text": "Who else thought this was Dave Mathews?", "label": 0}
{"text": "Too young to understand what this “Jolene” reference was about so I had to look it up. Makes sense now ✅", "label": 0}
{"text": "I reckon I could tune up his buddy Brock or them Team Rocket bitches", "label": 0}
{"text": "Looks like it just got posted there, too.", "label": 0}
{"text": "Better to look like your dad than to look like the mailman", "label": 0}
{"text": "Fucking good lol about damn time. They deserve some stress like the rest of us.", "label": 0}
{"text": "ALL CAPS is kind of a sick name. Even has a song ", "label": 0}
{"text": "Yeah… I’m dusting Max from Beyblade, or the lil runt from B’Damon", "label": 0}
{"text": "The MF is 10, you better be able to win", "label": 0}
{"text": "Completely unrelated, just curious. $6 for drinks from a vending machine. How many drinks did you need?", "label": 0}
{"text": "If I don’t get a sticker, did I even vote?", "label": 0}
{"text": "The further south in Florida you go the less south it is", "label": 0}
{"text": "https://preview.redd.it/qawekkhleywd1.jpeg?width=640&format=pjpg&auto=webp&s=82a310474127bebce75e072fdcc35f46ca2d23ab", "label": 0}
{"text": "1² = 2\n\n\nThat mf is making up new dimensions", "label": 0}
{"text": "I like to call it a younger sibling fee. I only ask about every 3 months, nothing crazy, prolly bout 5-7 dollars.", "label": 0}
{"text": "It’s a whole platoon of vets", "label": 0}
{"text": "How is money and greed so important to these mofos? It’s wild that they already have so much, but they just want more at any cost to society.", "label": 0}
{"text": "Yamcha is still one of the strongest humans on earth. He’s only weak compared to other Z fighters and respective villains", "label": 0}
{"text": "We also have phones so we don’t have to write letters.", "label": 0}
{"text": "Trumpettes will say its fake news", "label": 0}
{"text": "Corey from my favorite anime, Corey in the house.", "label": 0}
{"text": "Anyone from Ghost Stories", "label": 0}
{"text": "Yeah I plan on going soon", "label": 0}
{"text": "That was my reflex to about it Obama but that wasn’t what he was doing.  He won his elections because black people were the people that voted the most in those elections in general he only got like 30% of the white vote which is terrible for a democrat.  Black people put that man in office both times cuz we showed up and showed out.  Kamala needs the same if she’s gonna win.  She’s black and a woman two things white people really don’t like so she needs us to show up and show out.\n\nThat being said Obama was not talking to conservative black folks dem niggas weren’t in the room.  Nobody cares about those niggas.  He was specifically and only talking to black men who showed up and out for him in both his elections who are being cagey about voting for her.  To which he attributed to misogyny.  He ain’t wrong for that.  What is wrong is that he talked to a bunch of different groups that day.  No other groups got recorded and democrats took this tape and do what they always do: try and scapegoat black men.", "label": 0}
{"text": "Too late. 6 years now", "label": 0}
{"text": "And electrocuted Joey's old gang. That dude was fucking nuts.", "label": 0}
{"text": "My wife and I are the inverse of this post. She reluctantly voted for Trump while I enthusiastically voted for Harris. I love her to death, but she doesn’t understand how the world works.", "label": 0}
{"text": "There are very few steps that would fix the awkwardness post break-up if anyone was hurt.", "label": 0}
{"text": "This nigga wearing blue and shit. Blue boy ass muhfuqa", "label": 0}
{"text": "Basic training brings out everyone’s skill insecurities. I had no idea the variety of ugly heads the human race could produce. RIP all the moles that were brutally chopped off in Americas most savage haircuts.", "label": 0}
{"text": "No not true at all lol. The staff wanted to endorse Kamala, the bullshit owner of Jeff bezos told them no. They don’t want anything positive for Kamala with a platform they can control.  Billionaires aren’t scared, they want control.", "label": 0}
{"text": "Yeah about that...\n\nhttps://preview.redd.it/s4lxjkd4fywd1.jpeg?width=991&format=pjpg&auto=webp&s=e349051d6c4f3d73fa8c0df2dc5f9aa36c75b578", "label": 0}
{"text": "https://preview.redd.it/zhmwuk36fywd1.jpeg?width=1290&format=pjpg&auto=webp&s=612d1fcb1b2ea08db01e49e3003506833a494beb", "label": 0}
{"text": "Democracy dies behind a paywall.", "label": 0}
{"text": "He doesn't keep Pikachu in a pokeball so good luck finding him at a vulnerable enough time to square up on him. You just lost 1mil.", "label": 0}
{"text": "Shinji Ikari from neon genesis evangelion.", "label": 0}
{"text": "https://preview.redd.it/x7g5e757fywd1.png?width=305&format=png&auto=webp&s=0da7c5c7057a9683e3710dfee5a2e3ca414c7b3c\n\nAs a gay black man, I am shocked.", "label": 0}
{"text": "I think most honest adults would admit that pretty much any time you get to a \"kid\" thing, it feels awesome. \n\n\nGetting stickers? Yep. Running the bases at my local minor league ballpark 5K? Yep. I got a theory the only reason charcuterie gained popularity in recent years is because Lunchables kids grew up.", "label": 0}
{"text": "So then what do you suggest we do if someone who doesn't *deserve* to have kids decides to get pregnant anyway? Do you force an abortion on them? Do you take their kids away and throw them into our brutal and broken foster system that's rife with abuse?\n\nEveryone agrees that children shouldn't grow up poor. It's an incredibly easy end goal for people to agree on. The problems and disagreements arise when you start trying to hash out the specifics of how you achieve that goal.\n\nYes, I think people having kids they can't afford is bad. But I don't see a viable path to preventing it that wouldn't be a gross violation of human rights.", "label": 0}
{"text": "Japanese NICKNAMED BY PEOPLE IN ALABAMA.\n\nIt’d probably be something fucked up.", "label": 0}
{"text": "If you’re referring to black men as the enemy in your post, there are probably more white men who defend that man. So I’m wondering why are black men dragged into this?", "label": 0}
{"text": "I remember getting roasted in middle school for bringing an umbrella becuase it was supposed to rain that day", "label": 0}
{"text": "Naw, I'd win.\n\nI'm like halfway through season two. So far, he can still only fart smoke around himself and he's a teenager.", "label": 0}
{"text": "There are people who pay attention to Shannon Sharpe but pretty much nowhere else.\n\nThis allows her to reach voters she wouldn't reach otherwise. Why should she not try to reach those voters?\n\nIt's not like this stops her from holding rallies or going on other shows.", "label": 0}
{"text": "Historically they have done so for the past 40 years, and made a big fucking deal of democracy dying in darkness because of the same candidate attacking the press, now all of a sudden they want to be neutral. And reports are saying Bezos stepped in to make sure there was no endorsement. Thats the issue.", "label": 0}
{"text": "I’ve never used this particular type of razor, but electric razors in general tend to chew your scalp up a bit and get quite hot. When your bald head is exposed to the world - scalp health is super important. I’ve found it’s healthiest and easiest for my scalp to just use a manual razor. You could use disposable cartridge ones, but economically speaking, better to invest in something like a double edge safety razor and use it basically for life! A little bit of a learning curve and it may take a little longer - but totally worth it", "label": 0}
{"text": "I think he made clear this was not defending Trump, he was just trying to give some hope to the audience. He emphatically criticized Trump during his Presidency:\nhttps://youtu.be/5rjtKMcvqwA?si=BLTkLsVTjYxnGfxh", "label": 0}
{"text": "https://preview.redd.it/xrrk7wxpfywd1.jpeg?width=524&format=pjpg&auto=webp&s=b1aa24db18110c91816fd3e0dbf87b7f1b5ba56f", "label": 0}
{"text": "Nabiki Tendo because she’d be lazy/smart enough to take my offer to throw the fight and split the money and of the “normal Joe” anime folks I can think of, she’d be more unlikely to have any overpowered characters coming to defend her bc no one likes her that much", "label": 0}
{"text": "Ghibli characters is so fucking funny to me. This ass beating is gonna be award winning.", "label": 0}
{"text": "White people: No way?! Seriously?!\n\nBlack people: Lookin forward to that goodass dinner I had planned.", "label": 0}
{"text": "Woah… pump the brakes. We don’t *do* anything. This is a discussion of responsibility and ethics, not policy. I’m not suggesting that anything happen to anyone who chooses to have children despite not having the resources to do so. I’m simply saying it’s wrong and irresponsible.", "label": 0}
{"text": "do they have their powers or is it strictly a physical fight? if the latter, misa amane, shes malnourished and probably has messed up knees from anime girl sitting.", "label": 0}
{"text": "First thought I had lol", "label": 0}
{"text": "Power scaling/battle boarding was fun for a while, but at some point it broadly turned into \"I need to justify my favorite character being the strongest thing ever\" and the community started to suck from that point on. And \"author's intent\" is practically a vile slur carved from deep heathen magics to too many people.", "label": 0}
{"text": "Everyone has been saying she should go on there but they (Sean/Hot Ones)  seemingly don't want to get into politics, especially  if they can't have both major candidates on so as not to appear like they're just favoring one and making a one-time political exception. \n\nI would bet all my money Kamala's team has reached out and tried but didn't get a yes. If you're willing to go on Call Her Daddy, Howard Stern, and Shannon Sharpe, you're willing to go Hot Ones where most of those spices would probably be a cake-walk for Kamala and where she'd probably get better questions than the majority of her interviews.", "label": 0}
{"text": "\" No one puts down women like women.\"", "label": 0}
{"text": "nah im good", "label": 0}
{"text": "People saying Hercule or Yamaha are crazy. Hercule was the WORLD martial arts champion. That’s like saying you could fight Jon Jones. For people saying Yamaha, that’s like fighting Jon Jones who can fly and also knows the kamehameha", "label": 0}
{"text": "The crimson Sun?", "label": 0}
{"text": "One thing I learned as a youth is the comeback don't even have to be super witty. But it absolutely must be said with confidence, if you comeback all timid and shit its 10× worse than not saying anything at all", "label": 0}
{"text": "Ash throw hands with pokemon if he don’t wanna make his fight, that ain’t smoke you want 😂😂 Gimme Light without the death note, he need to be humbled lol", "label": 0}
{"text": "Calling others Americans enemy is a bit strange", "label": 0}
{"text": "Fact # 1,030,782,672 of why Twitter is garbage and people of color should leave it.", "label": 0}
{"text": "This sub is intended for exceptionally hilarious and insightful social media posts made by black people. To that end, only post social media content from black people.\n\nDo not post content just because a black person posted it.\n\n* No low effort/shit posts.\n\n* No original content\n\n* No posts from meme/corporate accounts\n\n**Violation of this rule will result in your post being removed and repeated offenses may lead to you being banned.**", "label": 0}
{"text": "No posts with terrible titles, they will be removed. You are free to re-submit once you think of something acceptable/reasonable. Don't put the punchline in the title of the post. Do not add \"bruh\", \"fam\", or similar vernacular to your post or comment.", "label": 0}
{"text": "Getting some serious Disney evil queen energy...Does Dolly have two animals around her at all times, or a bird familiar?", "label": 0}
{"text": "Most mops have removable, reusable heads you can stick in the washer?? I wash my mop head in hot water and cleaner after each use and clean the mop bucket. I have multiple mop heads too and never use the one I use in the bathroom on the living room or something. I tend to clean reasonable sized spaces at a time as well. I’m just so confused why actual mops are considered dirty?? \n\n\nI truly believe those swiffers are just pushing dirt around and are bad for the environment.", "label": 0}
{"text": "Hit the nail on the head, if they’re scared then you know shits getting real.", "label": 0}
{"text": "She must've been the guest he was talking about that he lost when he went live on IG...\n\nIt's crazy how quickly people move on from things in todays world", "label": 0}
{"text": "You can be as judgmental as you want. If you support more easily accessible abortion legislation, you are still pro-choice.\n\nI'm as pro-choice as they come, but if someone decided whether or not to get an abortion based on whether Mercury is in retrograde or not I'm damn sure going to think they're an idiot and their decision was made based on stupid reasoning.\n\nThat doesn't make me less pro-choice, because I still support their right to get or not get the abortion based on whatever reasoning they wish.\n\nThis \"you cannot ever be judgmental about someone's decision on abortion, no matter the reasoning\" bs you made up is just that: bs you made up.\n\nI'm still gonna go to the voting booth and vote for more accessible abortion legislation. I'm still gonna be pro-choice. A stupid purity test you just pulled out your ass doesn't change that.", "label": 0}
{"text": "Never could have predicted that at all.\n\n![gif](giphy|12HFqNl5DrMWoU)", "label": 0}
{"text": "Are you mocking this take or agreeing with it? The video being quoted has a song that’s half rap and a shot with the girl doing a shot-for-shot dance lifted from a Rihanna video while she’s flanked by two guys doing the Carlton", "label": 0}
{"text": "I'm here for the appropriate response to raw chicken. That's all you need. ", "label": 0}
{"text": "Think we need to end government contacts with some of these billionaires.", "label": 0}
{"text": "Washington Post, \"Democracy Dies in Weekend at Bernie's style hijinx\"", "label": 0}
{"text": "Won’t do shit. Bezos doesn’t care if WaPo survives, and Bezos is the problem.", "label": 0}
{"text": "She should take on Brock. Just blow him a kiss and he'll die.", "label": 0}
{"text": "\"Don't take my man because you can, take ME instead, Jolene!\"  \n\n  \nok, yeah.  I can see it.", "label": 0}
{"text": "A lot of shit sounds like witchcraft in Christianity. The only difference is who they’re asking for power from.", "label": 0}
{"text": "Learned me something today. For the whole story:\n\nhttps://www.vox.com/the-goods/2020/11/10/21559458/dean-browning-dan-purdy-byl-holte-patti-labelle-twitter-gay-black-man", "label": 0}
{"text": "He is not.", "label": 0}
{"text": "Nobita (minus Doraemon)", "label": 0}
{"text": "It’s the official slogan of the Washington Post.", "label": 0}
{"text": "Thank you! Rinse it, wring it out, hang it to dry standing up after you've got the water out.", "label": 0}
{"text": "It’s older than Biden’s campaign too.", "label": 0}
{"text": "Didn’t you hear? He solved math. We about to be a Type 2 civilization.", "label": 0}
{"text": "Terrorist works.", "label": 0}
{"text": "FRANKY! this is the correct answer.", "label": 0}
{"text": "It’s another canary in the coal mine.\n\nThe endorsement itself is useless. However, the *lack* of an endorsement is very telling. That’s the issue here.", "label": 0}
{"text": "It's fuckin great", "label": 0}
{"text": "Instructions unclear, coworker is across the table in our house now after years of marriage.", "label": 0}
{"text": "That's fair, I suppose I got the wrong impression, that's my bad. The wording on \"nobody *deserves* to have kids if they can't take care of them\" just kind of led me to assume that it was more of a call-to-action thing.", "label": 0}
{"text": "\"Breaking news\"", "label": 0}
{"text": "They are not going to enjoy voting for Harris, but at the very least even just out of basic self-preservation instincts for them and their loved ones at this point, I hope they do. These are some dire times. 🫠", "label": 0}
{"text": "Our church definitely wasn’t like that, our youth minister was a gay man with a husband and kids. We followed the logic of “if two men/women fall in love, it’s holy. Because love is holy and God wouldn’t have made those two fall in love if He didn’t approve”. \n\nBut man, my church sister there was an odd duck. I used to listen to her bemoaning them not letting her in and think “Why do you WANT to be part of that? They’re so hateful and mean!”", "label": 0}
{"text": "Unfortunately I’m the youngest and I get this feeling all too often.", "label": 0}
{"text": "Damn straight. Not leaving until I get something", "label": 0}
{"text": "Shout out to Joe Rogan podcast being a credible red flag for men, even before 2020.  Essentially the way astronomy and crystal energy is for women. He keeps drifting further right though so we need a new early warning canary. ", "label": 0}
{"text": "![gif](giphy|MESArLMuJ3odWm4IWw)", "label": 0}
{"text": "More like stacking up wealth issues.", "label": 0}
{"text": "We can definitely leave “racist” in there, tbh, only because idk what else you call ‘supporting a heinous racist’", "label": 0}
{"text": "I’d kick Shou’s teeth in for free", "label": 0}
{"text": "Perfectly understandable. I see now how that sentence could’ve been misconstrued.\n\nPeople have to be allowed there freedom to succeed and fail on their own. I would never advocate forcing anyone into an abortion or into handing over their child as long as abuse isn’t taking place.", "label": 0}
{"text": "White women are the men of women.", "label": 0}
{"text": "Don't forget General Mattis, another of his own appointees... oh and his current Vice President pick.", "label": 0}
{"text": "What is it called when the man:\n\n* Has an admiration for dictators?\n* Regularly spouts Nazi rhetoric about “destroying the blood of our country” and “the enemy within”\n* Threatens to use the military on his political opposition?\n* Had an admiration for Hitler and would regularly read his speeches?\n* Wishes he had the type of generals that Hitler had? The ones that would just do what he tells them to.\n* Tried to overthrow the results of the democratic election. through a fake elector scheme?\n* His advisors from his first term and longest serving chief of staff say Trump meets the definition of a fascist and would serve like a Dictator if elected again?\n\nI’ll give you a hint: It’s called a pattern and record of Fascist behavior. So yes anyone who votes for Donald Trump regardless if they’re doing it for a “Policy” or the “Fear Mongering of Immigrants” is enabling a fascist. That’s just how it works.\n\n**-—**\n\n# **What is Fascism?**\n\n> Fascism is a far-right, authoritarian, and ultranationalist political ideology and movement, characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation or race, and strong regimentation of society and the economy. [source](https://en.m.wikipedia.org/wiki/Fascism#:~:text=Fascism)\n \nTrump fits every part of the definition of a Fascist.\n\nBut If you’re still on the fence (somehow) keep reading below and find out how Trump has a long history of fascist tendencies.", "label": 0}
{"text": "https://preview.redd.it/9zxl8c6qhywd1.jpeg?width=826&format=pjpg&auto=webp&s=b6355a77ebfc80596940358f5e61db8f9351b7df", "label": 0}
{"text": "I’m singling out WW??? I never made this post homie. Cuz’ you’re flipping out over some non-hostile questions. You’re assigning words to me that I never even uttered so you’re coming off unhinged.", "label": 0}
{"text": "Yeah i figure it's a prize fight. Gimme like Char Aznable or something, hand to hand.", "label": 0}
{"text": "https://preview.redd.it/j9o1qzishywd1.jpeg?width=826&format=pjpg&auto=webp&s=f1cb74315a5807698b445546728f4887476b69cd", "label": 0}
{"text": "Shannon Sharpe is a fucking doof. might’ve been raised right but he doesn’t act right", "label": 0}
{"text": "Bruh. I have to hide that not only do I have a job but it’s my goddamn dream job because my family gonna think that means I become the fucking bank smh.", "label": 0}
{"text": "# Trump Calls Liberals the Enemy Within and Threatens to use the Military on Americans\n\n>I think the bigger problem are the people from within. We have some very bad people. We have some sick people. Radical left lunatics,” Trump said told Fox News’ Maria Bartiromo in an interview on “Sunday Morning Futures.”. “I think it should be very easily handled by, if necessary, by National Guard, or if really necessary, by the military, because they can’t let that happen,” he added.\n\n>I think the bigger problem is the enemy from within, not even the people that have come in and destroying our country, by the way, totally destroying our country, the towns, the villages, they’re being inundated,” he said, referring to immigrants. [source](https://www.cnn.com/2024/10/13/politics/trump-military-enemy-from-within-election-day/index.html)\n\nHere is a link of Jon Stewart going deeper into Trumps Enemy from Within statement: [https://www.youtube.com/watch?v=-5KWZL1blWc&t=512s](https://www.youtube.com/watch?v=-5KWZL1blWc&t=512s)\n\n\\-———\n\n# Trump asks a General, “Can’t you just shoot them...” (protestors)\n\n>”We reached that point in the conversation where he looked frankly at \\[Joint Chiefs of Staff\\] Gen. \\[Mark\\] Milley and said, ‘Can’t you just shoot them, just shoot them in the legs or something?’ ... It was a suggestion and a formal question. And we were just all taken aback at that moment as this issue just hung very heavily in the air.” [source](https://www.npr.org/2022/05/09/1097517470/trump-esper-book-defense-secretary)\n\n# Trump says, “I need the kind of Generals that Hitler Had”.\n\n>In a conversation with his former Chief of Staff, John Kelly - Trump said: “I need the kind of generals that Hitler had,”\n\n>Kelly responded by asking, “‘Do you mean Bismarck’s generals?’” He went on: “I mean, I knew he didn’t know who Bismarck was, or about the Franco-Prussian War. I said, ‘Do you mean the kaiser’s generals? Surely you can’t mean Hitler’s generals? And he said, ‘Yeah, yeah, Hitler’s generals.’\n\n>When Kelly asked Trump for clarification, the then-president reportedly replied by specifying: “The German generals in World War II.” [Source](https://www.msnbc.com/rachel-maddow-show/maddowblog/john-kelly-trump-offered-private-praise-hitlers-generals-rcna176664)\n\nJohn Kelly his long serving chief of staff today said: He said that, in his opinion, **Mr. Trump met the definition of a fascist, would govern like a dictator if allowed, and had no understanding of the Constitution or the concept of rule of law.** [source](https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html)\n\nIn the interviews, Mr. Kelly expanded on his previously expressed concerns and stressed that voters, in his view, should consider fitness and character when selecting a president, even more than a candidate’s stances on the issues. [source](https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html)\n\nThe above statements are backed by 13 former Trump administration officials. This isn’t a one off. His former staff does not trust him. \n\n>Thirteen former Trump White House officials signed an open letter backing up former Trump chief of staff John Kelly, who told the New York Times that Trump fits the definition of a fascist. [source](https://www.nbcnews.com/politics/2024-election/13-former-trump-administration-officials-sign-open-letter-backing-john-rcna177227)\n\n\\-———\n\nContinued Below", "label": 0}
{"text": "# Trump using Nazi Rhetoric\n\nTrump saying “They’re Poisoning the Blood of our Country”\n\n* Trump: “They’re poisoning the Blood of our country that’s what they’ve done” - [https://www.youtube.com/watch?v=RKPFjAhd3KQ](https://www.youtube.com/watch?v=RKPFjAhd3KQ)\n* Trump: “they’re ruining our country and it’s true they’re destroying the blood of our country that’s what they’re doing they’re destroying our country they don’t like it when I said that and I never read Mein Kampf they said oh Hitler said that in a much different way and they’re destroying the blood of our country they’re destroying the fabric of our country and we’re going to have to get them out” - [https://www.youtube.com/watch?v=aDQWgF5KMTw](https://www.youtube.com/watch?v=aDQWgF5KMTw)\n\n\\-———\n\n# Trump keeps a book of Hitler’s speeches by his bed:\n\nIn 1990 way before Trump got into politics Ivana Trump (his first wife) told her lawyer that Trump would keep a book of Hitler’s speeches titled “My New Order” by his bed:\n\n* Ivana Trump told her lawyer Michael Kennedy that from time to time her husband reads a book of Hitler’s collected speeches, *My New Order,* which he keeps in a cabinet by his bed.\n   * You can read the entire 1990 Vanity Fair Article here: [https://archive.vanityfair.com/article/share/e515a2cd-a51b-4f83-8d61-6ebb9a104e0a](https://archive.vanityfair.com/article/share/e515a2cd-a51b-4f83-8d61-6ebb9a104e0a)\n\n\\-———\n\n# Trump Praising Putin and Kim Jong Un:\n\nPutin:\n\n* Former President Donald Trump on Tuesday described Russian President Vladimir Putin’s invasion of Ukraine as “genius” and “savvy,” - [Source](https://www.politico.com/news/2022/02/23/trump-putin-ukraine-invasion-00010923)\n* “The smartest one gets to the top,” Trump told the crowd. “That didn’t work so well recently in our country. But they ask me, ‘Is Putin smart?’ Yes, Putin was smart.” [source](https://www.cnn.com/2022/03/28/politics/trump-putin-ukraine-russia-smart/index.html)\n* “They say, ‘Trump said Putin’s smart.’ I mean, he’s taking over a country for two dollars’ worth of sanctions,” Trump told a crowd at a fundraiser at Mar-a-Lago, according to a recording of the event. “I’d say that’s pretty smart. He’s taking over a country – really a vast, vast location, a great piece of land with a lot of people, and just walking right in.” [source](https://www.cnn.com/2022/03/28/politics/trump-putin-ukraine-russia-smart/index.html)\n\nKim Jong Un:\n\n* “How smart is Kim Jong Un? Top of the line. … really smart. You know, when you come out and as a young man at 24, 23, even though he sort of inherits it … he took over a country of very smart people, very, very energetic people, very tough people at a very young age and he has total dominant control.” [source](https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/)\n* “‘You know you call people sometimes killers, \\[Kim Jong Un\\] is a killer. He’s clearly executing people,’ Baier said. ‘He’s a tough guy,’ Mr. Trump responded.” [source](https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/)\n\nThis link has a huge list of all the time Trump has Praised Putin, Xi JinPing, and Kim Jong Un [source](https://democrats.org/news/trump-cant-stop-praising-vladimir-putin-xi-jinping-and-kim-jong-un/)\n\nContinued below", "label": 0}
{"text": "I voted by mail and they give you a sticker in it.  I wore that bish all day!", "label": 0}
{"text": "Nah Ash lift, he beating the dog shit outta you fam.", "label": 0}
{"text": "Bro I know y’all killing the park and the mall. Tell me, are the streaming subscription services list also long for you…we chill hard", "label": 0}
{"text": "Cellphone havin ass.", "label": 0}
{"text": "# Trump regularly dehumanizes Illegal Immigrants and those who are opposed to him:\n\nDuring the Holocaust, Nazis referred to Jews as rats. Hutus involved in the Rwanda genocide called Tutsis cockroaches. Slave owners throughout history considered slaves subhuman animals. In *Less Than Human*, David Livingstone Smith argues that it’s important to define and describe dehumanization, because it’s what opens the door for cruelty and genocide. [Source](https://www.npr.org/2011/03/29/134956180/criminals-see-their-victims-as-less-than-human)\n\nTrump:\n\nFormer president Donald Trump denigrated his domestic opponents and critics during a Veterans Day speech Saturday, calling those on the other side of the aisle “vermin” and suggesting that they pose a greater threat to the United States than countries such as Russia, China or North Korea. That language is drawing rebuke from historians, who compared it to that of authoritarian leaders.\n\n>”We pledge to you that we will root out the communists, Marxists, fascists, and the radical left thugs that live like **vermin** within the confines of our country,” [source](https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/)\n\nTrump has frequently referred to immigrants in the country illegally in subhuman terms, for example referring to them as animals who are prone to violence. [source](https://www.reuters.com/world/us/bloodbath-vermin-animals-trumps-rhetoric-trail-2024-03-22/)\n\n**I’m sure some Nazi Apologists will try and claim ALL OF THIS is out of context.**\n\n\\———\n\n**If you’re one of those people that says I know Trump is an awful person I’m just voting for him since he’ll be better for the Economy. That’s just blatantly false. Don’t believe me, read below.**\n\n# Trump Would Destroy The Economy\n\n* Trump will add 2x as much Federal Debt [(source)](https://www.crfb.org/papers/fiscal-impact-harris-and-trump-campaign-plans) \\- The Committee for a Responsible Federal Budget (non-partisan group)\n   * “Under our central estimate, Vice President Harris’s plan would increase the debt by **$3.50 trillion** through 2035, while President Trump’s plan would increase the debt by **$7.50 trillion.**”\n* Economists say Trumps plan will accelerate inflation. (Inflation under Kamalas plan would be better) [(source)](https://apnews.com/article/trump-inflation-tariffs-taxes-immigration-federal-reserve-a18de763fcc01557258c7f33cab375ed)\n   * “**Sixteen Nobel Prize-winning economists** signed a letter in June expressing fear that Trump’s proposals would “reignite’’ inflation, which has plummeted since peaking at 9.1% in 2022 and is nearly back to the Fed’s 2% target.\n* Economists saying Kamala would be better for the economy at least over the first two years of her presidency due to the immediate impact of Tariffs. ([source](https://www.reuters.com/world/us/goldman-sachs-sees-biggest-boost-us-economy-harris-win-2024-09-04/))\n   * Under a Republican sweep, or even with a divided government led by Donald Trump, economic output would take a hit next year (-.5pp), mostly from increased tariffs on imports and tighter immigration policies, Goldman said in a note late on Tuesday.\n\n**In other words Trump will increase our national debt 2x more than Kamala Harris. While simultaneously cutting social safety nets (I.e. he’ll cost more and provide less for Americans who aren’t billionaires). He’ll reignite inflation from a reckless tariff policy making everything more expensive. He’ll also put the US in a position to hit a negative GDP which is an indicator for a recession.**\n\nBut I’m sure people who keep saying Trump is better for the economy knows more than 16 Nobel prize winning economists", "label": 0}
{"text": "Also look at some of the feats of strength he does.  He throws a log by himself into a river and casually holds lavitar who weights 156 lbs.", "label": 0}
{"text": "Did you have $200 or was all your money in the house?", "label": 0}
{"text": "So the Billionaires are Trump supporters. Why is that??", "label": 0}
{"text": "There’s reportedly been a mass exodus of writers from both the LA times and WaPo over this shit", "label": 0}
{"text": "Stopping Fascism is the number one reason to vote in this election. That sticker is a close second tho.", "label": 0}
{"text": "I keep mine in my clear phone case\n\nhttps://preview.redd.it/e7f8iblfiywd1.jpeg?width=1800&format=pjpg&auto=webp&s=b4bf190703cfa1b89b47693adcd0fd6088b80469", "label": 0}
{"text": "Seriously Weevel should've gotten his ass kicked for that bullshit", "label": 0}
{"text": "true. he’ll fold if it’s a guy that’s more jacked than him, even moreso if he’s a successful athlete or business man", "label": 0}
{"text": "The funny thing is the gravy train will still run on time. They'll figure out a way to not lose money \n\nPrice increase, layoffs, outsourcing, etc", "label": 0}
{"text": "Joey Wheeler", "label": 0}
{"text": "Damn they said it?", "label": 0}
{"text": "Master mind of the Jan 6 terrorist attack. The Chief Caucasian terrorist.", "label": 0}
{"text": "![gif](giphy|Zbze33ziRfnvDGeey5|downsized)\n\nI mean that says it all doesn’t it?", "label": 0}
{"text": "it was a joke.", "label": 0}
{"text": "My little sister got me the other day. Didn’t plan her trip out throughly so I had to pay for her hotel stay.", "label": 0}
{"text": "How many years has he been out of residency? Student loans for medical school are usually hundreds of thousands of dollars", "label": 0}
{"text": "I would pick Takemichi from Tokyo revengers. I don’t think he has ever won a fight.", "label": 0}
{"text": "I understand that There's a ton a money in being a right wing grifter these days but people like this, pretending to be black/hispanic/anything else to try to sway that community are just straight up racist losers. I can't wait for Trump to clutch his chest on live TV and break their brains. \nIt's going to take decades, even if Kamala wins, for all this political division and racist sentiment to fade because one man validated this country's worst to feel like their opinions matter. We used to look to experts, scientists, academics, and real leaders. Now we're surrounded by morons, all with their own microphone.", "label": 0}
{"text": "True exchange:\n\nMe: *Pulls out phone, no case on it*\n\nFriend 1: \"dawg, why your phone ain't have a case? You broke?\"\n\nMe: \"Naw I don't put cases on my phone, I feel like it makes me more careless with my shit\"\n\nFriend 2: \"YOU RAW DOGGING THE PHONE BRO?\"\n\nMe: \"I've never broken my phone I don't need a case!\"\n\nFriend: \"Niggas whole enviroment is butt ass naked!\"\n\nFriend 2: \"Nigga got not drawers on right now I bet, meat just free\"\n\n*Cackling ensues*\n\nMe: *Realizing the situation is starting to steer into a roast session* \"bruh how we get from phone to drawers?\"\n\nFriend 2: \"I unno, I unno how you funny phone niggas do\"\n\nFriend 1: \"Herpes phone ass\"\n\nFriend 2: \"I'ma get this nigga a jitterbug\"", "label": 0}
{"text": "Also tells me that not even the pollsters have any idea who will win", "label": 0}
{"text": "British people do the same thing 😂", "label": 0}
{"text": "Joey can get it too. You can take both those scrubs. (Sorry, this is very unnecessary aggression. I have been rewatching the original Yu-Gi-Oh and realizing how useless Yugi's friends are).", "label": 0}
{"text": "I’m gonna look into that. Gracias!", "label": 0}
{"text": "I've been buzzing my head bald for years now. I saw that picture on the left in my future and noped right on out of that.", "label": 0}
{"text": "A solution to that is inviting both, knowing the Trump would never do it (or would pull a DJ Khaled and bow out after 2 wings)", "label": 0}
{"text": "I'd beat his ass for free.", "label": 0}
{"text": "https://preview.redd.it/bn535ne9jywd1.jpeg?width=796&format=pjpg&auto=webp&s=bc0762c1ef0fa085eb73ad109e397ce7831c80c2\n\nHere's a sticker.", "label": 0}
{"text": "OK I'll bite. How exactly did Donald Trump personally hurt you? Badly renegotiate some treaties? Build one percent of a wall he was supposed to build? The only thing he did of lasting value was appointing the Supreme Court justices, which was exactly what any generic Republican would have done.", "label": 0}
{"text": "should finish it with venom in the eye glare", "label": 0}
{"text": "As a younger sister who supported her older brother, felt.", "label": 0}
{"text": "💯", "label": 0}
{"text": "A larvitar is over 100lbs.\n\nAsh carried one like it was a stuffed animal", "label": 0}
{"text": "Growing up in New Zealand I knew a woman who criticized Helen Clark (former PM) for not being attractive enough to be prime minister. It was pretty appauling", "label": 0}
{"text": "Gotta just make a porn/nsfw account it’s the only real way lol", "label": 0}
{"text": "😂😂 what did you misunderstand haha", "label": 0}
{"text": "If your measuring stick for trust is that their editorial page supports the same candidate as you you should check your priors.", "label": 0}
{"text": "Fucking BET UNCUT!? \n\n\nWhere you could watch the I Ain't Got No Panties On music video?!\n\n\nIt's wild, because modern videos are even more racy than the shit on uncut used to be. ", "label": 0}
{"text": "😂", "label": 0}
{"text": "I'm pretty sure any real person gets destroyed by M2. He created supposedly the worst storm their (pokemons universe) planet had seen and can reverse time.", "label": 0}
{"text": "😂😂", "label": 0}
{"text": "But why doesn’t she just leave him ?", "label": 0}
{"text": "The democrats specifically try and treat the black male voting bloc as problematic.  This fake concern about how black men are turning republican is just something they do to deflect and blame black people, men specifically for democratic losses.", "label": 0}
{"text": "Aye look at this warm ass nigga. All bundled up looking like Ralphie lil brother from a Christmas Story ass nugha", "label": 0}
{"text": "They’re calling themselves “Mom’s of Liberty” now", "label": 0}
{"text": "Ain’t nothin but a peanut!", "label": 0}
{"text": "Hamtaro….imma literally eat that lil rat and all his friends\n\n![gif](giphy|hc1jyTXYaiXy8)", "label": 0}
{"text": "Uh that’s not what I said?", "label": 0}
{"text": "I’m gonna have to pick dr. Doofinschmertz mans can’t do shit correctly", "label": 0}
{"text": "And yet, watching shannon Sharpe for an hour is less likely to make me pound my head against a brick wall", "label": 0}
{"text": "\"roe v wade has been settled law for decades\"", "label": 0}
{"text": "Granddad from the boondocks", "label": 0}
{"text": "Ah, the institutions. Those indestructible, everlasting institutions. \n\nWhat people fail to realize while they're consoling themselves with comforting lies, is that those institutions are full of people who actually care about the traditions that they carry out. Once that's gone, so is the institution.", "label": 0}
{"text": "Well, yes, actually.", "label": 0}
{"text": "Isnt ash thr guy that can carry 100 pounds pokemon with one hand? Nah im good", "label": 0}
{"text": "Its funny because they cant say anything they just gotta take it and wait for it to be over", "label": 0}
{"text": "How's his mortgage? Dayum", "label": 0}
{"text": "I remember reading Indigenous America where the leader of a coalition of matriarchal tribes went to negotiate with English settlers. The settlers responded by saying that they don't follow the authority of a woman. \n\nThe leader of Britain at the time was a woman (Queen Mary?).", "label": 0}
{"text": "Okay, but on the other hand, tanking Charizard's flamethrower repeatedly is pretty up there.", "label": 0}
{"text": "I’d pick hamtaro", "label": 0}
{"text": "He'll put you down clean, though.", "label": 0}
{"text": "They do. Small towns care about this because they get little to no exposure to the outside world and/or feel as though their opinions don’t matter. I recall reading an article a while ago that mainstream media specifically targeted small towns because it’s easier to give them highly curated news. And once they figured out people like to rage and be scared, they latched onto that *deep*.", "label": 0}
{"text": "Try being the middle kid and both siblings asking you. 🙄", "label": 0}
{"text": "That's cool af tbh", "label": 0}
{"text": "I probably should've been clearer that, in this analogy, it's the sibling's house that's on fire. However, it's worth noting that if my house was on fire, she'd still say, \"Hey, \\_\\_\\_\\_, let me hold $500 until my next paycheck.\" Also, that next paycheck never results in my $500 being returned to me.", "label": 0}
{"text": "L or Light from Death Note", "label": 0}
{"text": "That looks like chicken pulao. It’s like rice cooked in chicken soup", "label": 0}
{"text": "He's a conman and terrible human being, that was plenty enough. If you need more reasons that's fine too", "label": 0}
{"text": "Gotta embrace the baldy. Friend of mine has long dreds, but a forehead that is advancing every dayM. Mfer looks like a Predator.", "label": 0}
{"text": "This was my exact thought.", "label": 0}
{"text": "Nah bro gonna have to put out. He'll be the same person saying that he did it all by himself with no help.", "label": 0}
{"text": "If younger siblings have nothing else (and they usually don't with their broke asses), they have the audacity.", "label": 0}
{"text": "Im so confused by this", "label": 0}
{"text": "It’s the block they hope to bring back. White men are too far gone. I’m white and voting for Harris but I’m one of very few that I know. One of our truck drivers is an obvious Republican but he tried to convince me he was on the fence until… and it’s a story I hear all the time. If you’re willing to overlook these mountains of transgressions from trump but this one teeny little thing made you turn away from Harris, then you were NEVER going to vote for Harris in the first place. He was just looking for any reason at all to justify his vote. His reason for the record was the hecklers at her rally. He says she kicked them out for saying “Christ is King”. I tried to explain to him that lacks context but he said “I just can’t look past it”. I rolled my eyes and said you were always going to vote for trump.", "label": 0}
{"text": "They don't like being reminded that Obama was in office twice as long as the confederacy ever existed.", "label": 0}
{"text": "Ash walked through a bunch of jog to carrying a larvitar without breaking a sweat. LARVITAR IS 160 POUNDS and a 10 year old hiked him every day for fun", "label": 0}
{"text": "Ash is completely feral, nigh indestructible, and has known to perform incredible feats of strength when pissed off. \n\nHe's no Saitama, but he will throw hands with God.", "label": 0}
{"text": "In this house, we only accept the sapphic reading of _Jolene_!", "label": 0}
{"text": "“So you’re just gonna [xyz], then, huh?”", "label": 0}
{"text": "I’m the youngest and none of us have ever asked the others for money.", "label": 0}
{"text": "This is what happened to me :/", "label": 0}
{"text": "Hopefully if Kamala wins and they try overthrow the government again,they’ll be shown how things worked out for the confederacy and the nazis.\n\n\nI just want to be rid of dump and his psychotic cult.", "label": 0}
{"text": "https://preview.redd.it/ucfr23z5oywd1.jpeg?width=633&format=pjpg&auto=webp&s=ad78fbc29184badc5f45b6e8ff8db9e80e1a964f", "label": 0}
{"text": "Try to get who back?", "label": 0}
{"text": "Please show me the Verse where God tells them not to Own Human Beings. With all the excuses I seem to be getting; I still don’t see any guidelines for Indentured Servants. It says Slaves because they’re talking about f*cking Slaves. You don’t get to pass down Indentured Servants to your Children as Property. I didn’t say God allowed Indentured Servitude; I said he allowed f*cking Slavery. He gave guidelines for Slaves, not Indentured Servants. I’m sorry if you can’t come to terms with what’s in the Bible in black and white. But please don’t insult my intelligence with the Indentured Servant BS. If the Bible is true then God Allowed Slavery. You wanna make excuses for what’s right there in the Book. Slavery was/is wrong , I don’t give a damn Where, When, or by Whose hands. It makes me sick to see otherwise good people making excuses for a crappy God and his morally bankrupt Book. 🫤", "label": 0}
{"text": "Until you realize that you're on the last rebirth of your villain arc and he inexplicably knows your every move.", "label": 0}
{"text": "lol typical racist bullshit and hate mongering on here again.", "label": 0}
{"text": "Yeah, they don't even mention the time he carry around a baby larvitar at one point, which are supposed to weigh over 150lbs.", "label": 0}
{"text": "\"Should have gotten in the fuckin robot, Shinji\"", "label": 0}
{"text": "Some people just have skinny legs man. I've played soccer my whole life, I go to the gym 2 or 3 times a week, I run when I feel like torturing myself and I have a decent amount of power and great endurance with my legs. They look like fuckin twigs man.", "label": 0}
{"text": "Sanji from One Piece . I’m a conventionally attractive woman, he won’t hit me and I’m sure he’ll let me win.", "label": 0}
{"text": "Dende's roommates with Mr. Popo, chills with Piccolo, and has Gohan on speed-dial.", "label": 0}
{"text": "Yajarobi 🤣", "label": 0}
{"text": "I believe there are more billionaires supporting Kamala Harris than Donald Trump", "label": 0}
{"text": "Like any hello kitty character. But then I’d feel like a monster.", "label": 0}
{"text": "I didn’t know that. Makes a lot of sense.", "label": 0}
{"text": "Vinyl. But I used to have a stone floor, and it worked on that too.", "label": 0}
{"text": "David Lucas might be the epitome of this. He roasts in such a way that is unrecoverable and it’s just pointing out things about how people dress and look.", "label": 0}
{"text": "Cost. Generally cheaper to fly, stay, and operate. Thought you'd have to be extra careful with choosing a doctor.", "label": 0}
{"text": "He doesn't even respond to or acknowledge the answers he gets. It's like watching someone talk to a wall ", "label": 0}
{"text": "Y'all strap in. Racism is real. It's visceral for black women. When Kamala announced, I got afraid for her. Misogynoir is a different beast.", "label": 0}
{"text": "Mewtwo sexy as fuckkkk", "label": 0}
{"text": "He folded under the lightest pressure\n\nhttps://preview.redd.it/0uuxe7usoywd1.jpeg?width=1125&format=pjpg&auto=webp&s=e3dd46ecf8d207c225c791a82d9ddeba43319583", "label": 0}
{"text": "![gif](giphy|3og0IwlT5dTLVlgkIo)\n\nMe, about to send Hamtaro into next week for 100mil", "label": 0}
{"text": "I just imagine as you land your final hit and he’s on the ground writhing, you whisper “Miyajima took Chizuru and you’re not getting her back.”", "label": 0}
{"text": "I mean, they might have, but like I doubt it was something he brought up a lot. And I personally don't stalk my coworkers socials. Not that I'm defending them, I genuinely don't care", "label": 0}
{"text": "![gif](giphy|l1J3vV5lCmv8qx16M)", "label": 0}
{"text": "Yeah. Such feats as, “checks notes” tackling a Pokémon that weighs over 100 lbs, holding a couple of adults and a small Pokémon dangling off a cliff, and pulling a fish out of the water that weighs more than 50 lbs.\n\nGoku better watch his back", "label": 0}
{"text": "Shannon Sharpe also lowkey hates black women. Rogan is more dangerous and that's not really up for debate, but i'm not gonna pretend like Shannon is some 'national treasure'. \n\n  \nHe's a petty, insecure, ignorant bully. \n\n\n\nWhen things are cool he's cool, but watch how he handles any conflict. Especially when its who he THINKS is a black woman calling him out. When being told that trying to denigrate an entire group for wearing 'horse hair' (it wasn't even the woman in question she just had a MegTheeStallion image as her profile pic) dude double and tripled down.", "label": 0}
{"text": "Sure do", "label": 0}
{"text": "And I still got $100mil", "label": 0}
{"text": "The problem is that we see others with different opinions as our enemy. They're not you're enemy. That's just Jeff down the street. He's got a family, job, and responsibilities the same as you do. Just a different opinion.", "label": 0}
{"text": "Mewtwo blocked, didn't he? He didn't want that smoke.\n\nAsh also easily throws trees and\n\nhttps://preview.redd.it/zf48ldi7pywd1.jpeg?width=600&format=pjpg&auto=webp&s=5e3706136eda6479eb4ae1166e79e8a06304f1d2", "label": 0}
{"text": "\"Are gen z KILLING the mop industry? One insider says - what?. More on this at 11.", "label": 0}
{"text": "Nah James is just HIM.", "label": 0}
{"text": "That fish one is sick", "label": 0}
{"text": "Teach me how to say no 😭", "label": 0}
{"text": "https://x.com/Rhymestyle/status/934213323318427648\n\nJust holding 2200lbs in his hands", "label": 0}
{"text": "Yeah, you’re just that special that this guy’s wife wants you dead…", "label": 0}
{"text": "First off, waffles is better. I don't give a fuck, niggas be tripping out here over pancakes.", "label": 0}
{"text": "Preceeded by a This nicca and followed by a lot of laughter.", "label": 0}
{"text": "Gendo used to regularly get into fights before meeting Yui, so he's got some dawg in him. It's like half the reason he fell in love with her", "label": 0}
{"text": "Nigga, that's just a syrup sandwich trying to be uppity.", "label": 0}
{"text": "Hell nah, if it was established that he was borrowing that money and it wasn't a gift, then it's time to start ramping up the pressure on seeing that returned. You are will within your right.", "label": 0}
{"text": "People naming named characters when all you’ve gotta do is pick a baby in any anime one exists.", "label": 0}
{"text": "I have a couple theories. One being that they have a much better idea than they are revealing but keeping things close drives engagement. Two being that the polls are being flooded with fake or intentionally skewed results to support voter fraud claims if the GOP loses.", "label": 0}
{"text": "yeeted that motherfucker like a javelin a good what, 20 - 30 feet? \n\nyeah, no, I've fought 12-yr-olds before, I know better", "label": 0}
{"text": "I was going to show my age and say Speed Racer, then I remembered that Speed Racer would legit throw hands when he needed to. And, I'd have to worry about his brother Racer X jumping in the fight.", "label": 0}
{"text": "Who are you trying to impress all over these comments? Who hurt you?", "label": 0}
{"text": "It can hurt my pockets sometimes but if I got it they got it. I'm lucky enough to know that if the roles were reversed they wouldn't hesitate so I don't sweat it.", "label": 0}
{"text": "Goku.. tell him what you need and he will let ya win lol", "label": 0}
{"text": "he'll start monologuing at some point, and he's not a main character\n\nI've got interrupts for that", "label": 0}
{"text": "Got that Houndoom in him", "label": 0}
{"text": "And then it wasn't.", "label": 0}
{"text": "The black men who have actually flipped to trump. Politics has always been a culture war. I have a lot of trump friends and I honestly think the biggest reason they are republicans is because that’s what they think they should be. They fit in with their coworkers and friends. Trying to flip a white man away from where he thinks he should be is almost impossible. Cubans are the same. One of the radio shows I listen to the Dan LeBatard show and he’s talked about how he’s completely ostracized from his people. I think if you were looking at it in terms of where people fit culturally, you’re more likely to get people to change to somewhere they feel like they belong than to make them stand opposed to all the people they know. Maybe it ain’t that deep but that’s my take on why Obama and others have gone out of their way to try and bring the flippers back.", "label": 0}
{"text": "My skin isn’t dark, but it is brown so needed more saturation. My skin was irritated because he kept putting the stencil in the wrong spot. But apparently red is also just difficult in general.", "label": 0}
{"text": "Yeah it’s wild. Just blessed to be able to share that with my boys and my girl. We all moving up together and all of us feel the same lmfao. We don’t tell our family shit.", "label": 0}
{"text": "Oh Big flex", "label": 0}
{"text": "I never understood that whole \"being led\" part in a relationship. Don't people want a full adult that can think for themselves? Also isn't it supposed to be a partnership, not a hierarchy?", "label": 0}
{"text": "Isn’t there a whole thing on the Internet that talks about how Ash lifted an entire tree trunk?", "label": 0}
{"text": "![gif](giphy|sRYVJZKosY4GqtrGa2)", "label": 0}
{"text": "I wish our generation (millennials) learned from the movie \"Sausage Party\" and created an alternative to religion that people could follow.", "label": 0}
{"text": "If santa’s ass tastes like milk and cookies then you can count me in for dinner.", "label": 0}
{"text": "Lelouch's sister from Code Geass.", "label": 0}
{"text": "If you find pointing out that wealth is attainable to be “me trying to impress people” that’s entirely your prerogative. I made a statement about the relative expense of a house in a neighborhood I personally have experience with. At no point have I said it’s cheap or easy. All I’ve said is the wealth is attainable. That if you’re smart and lucky you can do it. \n\nIf anything I find it funny people are getting mad at me for saying, “it’s not impossible you can achieve this to”", "label": 0}
{"text": "I love me some bald headed women! Shit is so rare and fine af.", "label": 0}
{"text": "WHY WOULD YOU SAY THIS 😭", "label": 0}
{"text": "English isn’t my first language so I didn’t get that part.\n\nWhat does it mean in this context?", "label": 0}
{"text": "For an adult Lactose is awful for you and you no longer need the Calcium in milk, look it up. \n\nIt also taste gross af", "label": 0}
{"text": "We are facing the threat of fascism and mfs are telling us to just vote. Nah we also gotta join communist movements to counter act the rise of fascism.", "label": 0}
{"text": "https://preview.redd.it/lt741k7jrywd1.jpeg?width=990&format=pjpg&auto=webp&s=d4737ac42b295b757dd75661bf4d8749a580c91b", "label": 0}
{"text": "No. They’re cheap dollar store sandals. Most choose to keep them.", "label": 0}
{"text": "https://preview.redd.it/05tk7v1jrywd1.jpeg?width=1021&format=pjpg&auto=webp&s=cbacb3a03ee26c2792a0a71815c04f5f7f44e706\n\nMy ultra rare card", "label": 0}
{"text": "Yep. I got roasted for wearing an orange shirt. \"This mf-r out here looking like a traffic cone!\" Then everyone started calling me CalTrans and that was the end of that shirt.", "label": 0}
{"text": "No one cares about them.  There’s been no flip there has always been a small section of black men that vote republican.  They do not matter.  They swing no elections, they have no influence.  They may as well not vote as their votes don’t mean anything.  It’s not like they’re all gathered in a single place.  It’s not like the majority of them live in any swing state and the democrats have never, ever won that section.  Cubans are not the same.  Obama wasn’t talking to conservative black men a few weeks ago.  He was talking to democrat black men who showed up for him being hesitant about showing up for Harris.\n\nNobody is talking to conservative black men.  They don’t matter, bunch of dumbass niggas.", "label": 0}
{"text": "Shou Tucker.", "label": 0}
{"text": "I know. But at what cost. Won't go into it. But the leverage ain't mine.", "label": 0}
{"text": "The problem almost every election cycle is white women.", "label": 0}
{"text": "Y'all really made a sub with that name😭😭😭😭 y'all so freaky ☠️☠️\n\nhttps://preview.redd.it/4mnyvv9trywd1.jpeg?width=485&format=pjpg&auto=webp&s=5a07fda0d75144221f3069b277f3b0a7c54b924e", "label": 0}
{"text": "This is insane", "label": 0}
{"text": "Sorry not sorry, I'm stomping out Hamtaro for 1 mil never mind 100 mil.", "label": 0}
{"text": "That's gotta be peak bitch behavior imo. \n\nYou throw away a mans cards *on the way* to the tournament? Helllll nah", "label": 0}
{"text": "That crying ass dude from Tokyo Revengers", "label": 0}
{"text": "Rogan speaks highly of Harris? Any evidence of that?", "label": 0}
{"text": "In going with baby goten… not toddler or 6 year old goten… actual newborn baby goten.", "label": 0}
{"text": "Cinemax was lit after 1-2am.", "label": 0}
{"text": "Don't try to duck responsibility for your participation in a system you benefit from. Yes, you have disadvantages as a woman, but being white far outweighs that.\n\nFull disclosure, I am a middle age cis white male.", "label": 0}
{"text": "You should meet a real nazi lol they don’t tell jokes", "label": 0}
{"text": "Let's not get carried away", "label": 0}
{"text": "I didn't say I'd kill him lol.", "label": 0}
{"text": "![gif](emote|free_emotes_pack|joy) yeah pretty diabolical stuff", "label": 0}
{"text": "Yeah but the kid is like a porcupine, he takes all that but give him one good smack on the top of the head and he's down for the count", "label": 0}
{"text": "I know I'd just throw it away the next day and don't really care\n\n...but I really *do* care and I want that sticker!", "label": 0}
{"text": "With the abortion restriction I don’t think you could say they are fine honestly", "label": 0}
{"text": "Really??? Because SS is a terrible interviewer, like one of the absolute worst", "label": 0}
{"text": "That doesn’t even include him lift Cosmoem, which is essentially a neutron star. And all the times he’s been burned by Charizard and electrocuted by Pikachu and other mons.\n\nBro really is Goku’s long-lost son.\n\nhttps://preview.redd.it/5yodrf8rsywd1.jpeg?width=633&format=pjpg&auto=webp&s=2839562d942c3992cf30f04069f7889ca190046d", "label": 0}
{"text": "Listen man undecided voters tend to be a lil stupid it might just swing some folk.", "label": 0}
{"text": "Yep, and people still shame single mothers like the plague.", "label": 0}
{"text": "His nickname is literally Ash. His real name is Satoshi.", "label": 0}
{"text": "The majority of white women voted for him both times.  They’re fine with it.  They think they’ll get around it and it won’t be a problem.", "label": 0}
{"text": "I meant I like eating ass more than a sticker. I can go without a sticker", "label": 0}
{"text": "ok your comment funny af! lmaooooooooooooooooo", "label": 0}
{"text": "You can get around it as long as you have the economic means, I wonder what WW will do in this upcoming election honestly", "label": 0}
{"text": "u/Bablewocky You just gonna let her get away with that?\n\n![gif](giphy|guufsF0Az3Lpu)", "label": 0}
{"text": "😭😭😭🤣 he said he opened up the flower of life. I listened to him discuss math for a few minutes and felt dumber and turned it off.", "label": 0}
{"text": "I know women can be stupid, but damn this takes the cake. Go ahead downvote me. ", "label": 0}
{"text": "I agree.", "label": 0}
{"text": "Yeah but he went in knowing.. Pure smoke and tenacity !!", "label": 0}
{"text": "Leorio would whoop your ass from across the room!", "label": 0}
{"text": "I know it would, but I don't think they're voting to begin with. I know I'm wrong, but I just need to hold onto some shred of my sanity.", "label": 0}
{"text": "Why do you say he hates Black women?", "label": 0}
{"text": "More girls have been into me since I went bald about 5 years ago. Life is odd", "label": 0}
{"text": "Fellow white guy here- high school football they'd roast me but one of the ones that got the biggest reaction was a simple, \"beard on ya neck havin ass mothafucka....\"  It was a summer workouts, out of school I didn't need to shave.  So accurate and scathing, and the delivery was just \\*chef's kiss\\*... like he was disappointed, angry even, at the hair on my neck.  Who was I to have the audacity to be walking around looking so foolish.  For years afterward even if I didn't have time to shave I'd always at least shave my neck as I definitely did NOT want to be a \"beard on my neck havin ass mothafucka\"", "label": 0}
{"text": "They admitted it?", "label": 0}
{"text": "Does their endorsement move the needle?", "label": 0}
{"text": "Knock yourself out 😭", "label": 0}
{"text": "Same. I'm a northern transplant in a swing state. I've been here a decade and I don't usually have much in common with other ww the same age as me that are from here. \n\nI've interacted less and less with these people because when they realize I don't share their racist values, they avoid me. I don't mind that, I just wish there were other adults around that aren't like that.", "label": 0}
{"text": "I mean look at this woman’s face it’s full of hate and lies.", "label": 0}
{"text": "![gif](giphy|k6obMyrPvVm0nrGNxV|downsized)\n\nI look like one of the scary aliens with big heads without hair", "label": 0}
{"text": "She wouldn't say it outright... she'd just steer her daughter to a man who could become president one day. Hillary vibes.", "label": 0}
{"text": "Lmaoo not “who gets the first plate” \n\nIn regard to the podcast, VP Harris is running to be the president for all Americans, not just a sub section. This move is consistent with that narrative she’s been campaigning on. I Don’t see a problem with it, especially since she did “Call her daddy.” People watch podcasts and Shannon has built a pretty big platform that seems to always be viral or spark conversation. Im just glad she’s not going on Cam Newton or Joe Buddens podcast, that would’ve been too much in my opinion. lol", "label": 0}
{"text": "Diabeetus.", "label": 0}
{"text": "Humans in that universe are technically pokemon anyway. Isnt Arceus their God?", "label": 0}
{"text": "Both them niggas would smack the dogshit outta you lol you fr? Yamcha can fly, has super strength and can fire ki blasts, and Yajirobe was strong enough to jump like 50 feet in the air and cut Vegeta’s tail clean off in one slice.", "label": 0}
{"text": "yeah, it was in the article announcing it", "label": 0}
{"text": "It's not about how many you win, it's about how many you show up for", "label": 0}
{"text": "I'd box Naruto not even on some funny sh", "label": 0}
{"text": "When i see someone beefing with a black woman and their response is to hurl insults rooted in negative stereotypes about them to me thats indicative. \n\n\nThe whole exchange where he tripled down about it didn't sit right with me.", "label": 0}
{"text": "It's time to d-d-d-d-drown bitch!", "label": 0}
{"text": "Hahahaha end of the anime Leorio for sure, but not first arc Leorio", "label": 0}
{"text": "See this is what happens when you fight before you watch the tape on a motherfucker. You take the L AND you don’t win the million dollars.", "label": 0}
{"text": "The man that’s a multiple time world martial arts champion? Good luck with that lol", "label": 0}
{"text": "Something else will kill him later on down the line and he'll end up redoing your fight over and over anyway. ", "label": 0}
{"text": "He meant racist", "label": 0}
{"text": "😢", "label": 0}
{"text": "All leisurely like he ain’t got nun to do", "label": 0}
{"text": "Commented to a couple other people, but I’m also Asian and the white in my tattoo looks pretty good still after 6 years. I’ve never gotten touch ups either, just use 100+ spf if I’m ever in the sun, but I might also just be an outlier. The two photos on the right were taken today hence the time stamps\n\nhttps://preview.redd.it/8xt0upndtywd1.jpeg?width=2296&format=pjpg&auto=webp&s=96a53539b23dca48f2e4d6a31602783b824d178a", "label": 0}
{"text": "Hikaru from hikaru no go. ez clap", "label": 0}
{"text": "My spouse is slowly spiraling into some Joe Rogan, conspiracy nut.\n\nStill votes dem and gets vaccinated though, my pussy magic is stronger than any JRE podcast & he doesn't want a divorce.\n\nDoes it matter that he doesn't really agree and just goes along because it's me asking him to? A little, but not as much as finding out my spouse went full dipshit would.", "label": 0}
{"text": "Even Hercule would dust a regular human in a fight", "label": 0}
{"text": "I choosing Tucker's daughter before the transformation. Ash can take direct attacks from Charizard and lift a pokemon that's like 2 tons. That 10 year old boy could kick my ass.", "label": 0}
{"text": "My sibling had the nerve to ask me for some money when I knew that she was braiding someone's hair. Like Sis. Are you doing her hair for free? You hustling backwards? I just ignored that text lol.", "label": 0}
{"text": "Sanji for sure! He'd probably let me win if I hugged him lol", "label": 0}
{"text": "I wouldn't be in a relationship with someone I see the world differently.... at all... ever... unless I was trapped in a culture with kids and a husband hoisted on me before I could even understand the implications of it and had zero way (financially, emotionally) to get away. Feel for the many many women stuck in terrible & often abusive relationships that they cannot easily escape & applaud them when they get the chance to have a say in anything - like a vote.", "label": 0}
{"text": "Lowkey more evidence that he doesn't age because he's actually a 10 year old in a coma.", "label": 0}
{"text": "And basically blinded a guy.", "label": 0}
{"text": "Mick Foley and Bautista endorsed Harris", "label": 0}
{"text": "Not Another Teen Movie is a GOATed comedy experience", "label": 0}
{"text": "DC has universal mail in and they send you a sticker with the ballot", "label": 0}
{"text": "Lmao that's what we've gotta be on now. If you're not voting, I don't wanna hear shit about what your uncle said about Kamala on Facebook.", "label": 0}
{"text": "Democracy dies with billionaires.", "label": 0}
{"text": "He has basic Alchemy Skills, I have a cast iron frying pan and a hell of a backhand", "label": 0}
{"text": "Yeah it's way more fun when it's silly. People take it too seriously.", "label": 0}
{"text": "I always find it weird... people wash their vegetables but not their meats? I'm still trying to figure that one out....", "label": 0}
{"text": "In front of some snow bunny’s too knowing that ain’t my target demo", "label": 0}
{"text": "Please vote", "label": 0}
{"text": "Schadenfreude is over 9000!!!", "label": 0}
{"text": "“Every third hetero couple” meme", "label": 0}
{"text": "He only got like 30% of the white vote.  So no they don’t like him too much", "label": 0}
{"text": "This part right here.\n\nHis views morphed into hers over time, not the other way around. Those views keep them feeling superior and the man adopts them to keep things in check.", "label": 0}
{"text": "Reference to what exactly?", "label": 0}
{"text": "My daughter related the story of her boyfriend playing basketball and an opposing player shouting out \"I got Wal-Mart Shorts,\" referring to the BF.\n\nNow our whole family refers to him as Wal-Mart Shorts.", "label": 0}
{"text": "Them little cousins just as bad tbh.", "label": 0}
{"text": "It's true, especially if you're at the lecturn and speaking to the judge. Don't ask me how I know.", "label": 0}
{"text": "lol can I pick cabbage man from Avatar? It’s all I got ", "label": 0}
{"text": "Also beyond that, we lve seen Ash throw a whole-ass log (something like 18\"×4\" or so just comparing it to his own size) across a small river iirc, so like I got no problem admitting that he's probably *stronger* than me with feats like that, that's just nuts.", "label": 0}
{"text": "Nigga you went to school and graduated? 👀", "label": 0}
{"text": "https://i.redd.it/9bbalc69wywd1.gif\n\nWait…not exist like?", "label": 0}
{"text": "Now thts a cause i can donate to", "label": 0}
{"text": "And they realized people were onto them as well, which is why so many of them go NB, tryna act like \"oh I'm not with them!\"", "label": 0}
{"text": "She gonna chose Ash when she could’ve chosen a weak Pokémon like Azurill? Just better hope that mf doesn’t evolve during the battle 😂", "label": 0}
{"text": "Nigga said \"off kilter\" 😭", "label": 0}
{"text": "Yamcha would fold any normal human without even trying.  No, more than that, he could atomize the planet by the end of Z.\n\nThe powercreep in Dragon Ball is too insane, even Hercule could fold most professional real-world fighters without even really trying.", "label": 0}
{"text": "https://preview.redd.it/t0dof4rrwywd1.jpeg?width=224&format=pjpg&auto=webp&s=4a7d4124b2cd09a9007e192676fb2fb8a3d38b8d", "label": 0}
{"text": "how could I treat a phenomenal woman any other way ![gif](emote|free_emotes_pack|shrug)❤️", "label": 0}
{"text": "That's what I finally said to my mom like six weeks ago. You and your friends need to vote like you give a shit about your daughters and how their lives are going to be when you're gone! To her credit, she did in fact vote Kamala (in FLORIDA no less!) and I'm real proud of her for it. I told her to remind her friends that their husbands won't know who they voted for either.", "label": 0}
{"text": "Reasons idgaf about Chappell any more. You have all these rich guys around you that you could be making fun of but you’re voting for them instead dog?", "label": 0}
{"text": "Just make sure not to use it on LVP or other vinyl flooring.", "label": 0}
{"text": "I was going to say this. He needs it, anyway.", "label": 0}
{"text": "🤣🤣🤣", "label": 0}
{"text": "i'm taking Maria", "label": 0}
{"text": "Did you just stalk my comment cause we had a disagreement? I deleted it cause I wanted to make sure I read it right, but this is kinda weird bro.", "label": 0}
{"text": "easy shin chans dad", "label": 0}
{"text": "Specifically the religious ones and its not just whites. A portion of Hispanics he somehow has brain washed as well.", "label": 0}
{"text": "Ultimately women disproportionately vote blue and posts like this that serve as a punching bag for white women are kinda funny to me when it’s white *men* that lean red more than any other demographic", "label": 0}
{"text": "That Chicken Big Mac rocked his world", "label": 0}
{"text": "they don't ask for it all back at once", "label": 0}
{"text": "if you hang around any feminist spaces you will inevitably encounter a discussion on \"women who vote against their own interests\". where you will hear complex rationalizations such as \"they are stupid\" or \"she is being controlled by a man\", \"brainwashed\" etc etc.\n\nwhat never occurs to them is the possibility that these women voting different than the mainline feminists *aren't* voting against their interests... that it's possible for different women to have different interests... and if it looks like what they do is \"uphold the patriarchy\" then it might be worth while to consider that the so called patriarchy could be a misnomer. It turns out a lot of women perpetuate the status quo exactly because it does benefit them. calling it patriarchy just seeks to make men the blame for everything (as usual) and blinds you to what might actually be going on.", "label": 0}
{"text": "Man’s gotten hit by lightning bolts and survived, that before we remember him spending several years hiking cross country across multiple countries.", "label": 0}
{"text": "there's a [drunk history](https://youtu.be/mK40qogSdFI) segment about it...well its more about 'i will always love you' but the thing about her getting 'jolene' from signing autographs is there.", "label": 0}
{"text": "Roll Tide", "label": 0}
{"text": "Shinji Ikari. Skinny tween with suicidal ideation. I’m not much of a fighter, but I can beat that kid I think.", "label": 0}
{"text": "The little kid from the Ghost Stories anime.\n\nhttps://preview.redd.it/zinematnxywd1.jpeg?width=543&format=pjpg&auto=webp&s=db763a9f945dd494fc52c11b5c88cbd39f896e94\n\nEasy money", "label": 0}
{"text": "My brain immediately went to look at the romance genre\n\nThe guys would either be no fight or you're screwed. No in between and leaning towards the former", "label": 0}
{"text": "You cannot reason someone out of a position that they used no reason to arrive at in the first place. Or as I say \"you can't fix stupid.\" It is my #1 rule for life, followed by \"you can't fix crazy\" and I've yet to be proven wrong, unfortunately.", "label": 0}
{"text": "Bruh that Herman Cain subreddit during the lockdown...", "label": 0}
{"text": "Tbf shonen is the demographic \n\nThose harem animes are likely shonen too", "label": 0}
{"text": "What does voting for Trump have to do with Ecoli?\n\nYou know what, nvm. I can't wait for this election cycle to be over.", "label": 0}
{"text": "I mean the strongest one is hilarious for a 10 year old scrawny kid, but literally every single anime has stronger people. Like way stronger.", "label": 0}
{"text": "Alternately, most meaningful compliments in the world come from Black women describing you or something you're doing in a hype tone. \"OK necklace, I see you!\" ", "label": 0}
{"text": "Hamtaro. No way I'm losing.", "label": 0}
{"text": "I've always considered it code for these racists.", "label": 0}
{"text": "I’m the older sibling but my sister’s the one with her life together 😭", "label": 0}
{"text": "The jubilee.", "label": 0}
{"text": "It was a joke about earlier this Week Trump staged himself working at a McDonalds to shoot at Kamala Harris claiming she never worked their but he “did”", "label": 0}
{"text": "I have a little collection on my laptop under the keyboard on either side of the track pad to remind myself of things I'm proud of (voting, getting vaccinated, donating blood) when I get stuck doom scrolling and feel out of control ", "label": 0}
{"text": "https://i.redd.it/vk62v8rbyywd1.gif\n\nTrump staged a photo op “working” at a McDonalds serving up McFind and McLies while serving “customers” after he claimed Kamala never worked there. A few days later people started coming down with E. coli from McDonalds.", "label": 0}
{"text": "We didn't come here to work we came here to win", "label": 0}
{"text": "Is this something im missing? This sounds nasty. Replacing milk with beer and choosing Natty Lite of all the beers on Gods green earth? Help me understand", "label": 0}
{"text": "He gonna be punching holes in peoples chest 😂", "label": 0}
{"text": "Yeah there's definitely a skill to getting it to the right layer. When finding my artists I tried to use those who tattoo darker skin and showed good skill. I'm happy with the color work i have so far", "label": 0}
{"text": "The image of him burning that robber alive has stayed with me for 20 years.", "label": 0}
{"text": "Do you have any photos?", "label": 0}
{"text": "Have you heard him talk about trans people in any capacity? Literally word-for-word Nazi talking points", "label": 0}
{"text": "🤣🤣🤣", "label": 0}
{"text": "Fabuloso. Because I have class.", "label": 0}
{"text": "I appreciate the level of perception you're speaking from. I aspire to perceive $4 million as attainable.", "label": 0}
{"text": "Is this after Krillin gave her his reboot thumbdrive or before because before 18 might have killed you after and took the rest of the money. ", "label": 0}
{"text": "He has severe hands 😂😂she does not want a lick of smoke with ash", "label": 0}
{"text": "Just weird comments about how hip-hip is vibes and swag, Blackpink doesn't make the rebellious type of hip-hop/rap, Blackpink's hip-hop is something the world has never seen before and how Rihanna only makes Hip-hip music (talking about swag and vibes lol)", "label": 0}
{"text": "Monaka", "label": 0}
{"text": "My dad, exactly. He retired and got into Facebook and then down the rabbit hole. He died a year and a half ago almost, and I'm still trying to make peace with how angry I was at him over things he said after going down the rabbit hole. Gonna be a long journey, I was preparing to bring it up when he got sick and I decided if we were only gonna have a little more time, I was gonna swallow my anger, but yeah I watched the kind, loving and open minded father who raised me turn into a Florida republican. I try to remember that the majority of his life, he wasn't like that.", "label": 0}
{"text": "The guy that regularly gets electrocuted and burnt alive? The guy that spent 25 of his 10 years alive as an outdoors man? The guy that will square up with an super weapon?\n\n  \nThat Ash is the one you want to square up against?", "label": 0}
{"text": "Same—disappointed and totally perplexed. We’re talking about voting for people who would be thrilled to re-establish [coverture](https://www.womenshistory.org/articles/coverture-word-you-probably-dont-know-should).", "label": 0}
{"text": "Huey from boondocks", "label": 0}
{"text": "🤣🤣🤣I wish he was in the ufc", "label": 0}
{"text": "![gif](giphy|3otPoHUNSFWviCyboQ|downsized)\n\nThey need to take the hint.", "label": 0}
{"text": "i feel like youre lying", "label": 0}
{"text": "What doesn’t kill you makes you stronger 💪🏾", "label": 0}
{"text": "I appreciate you understanding that it’s a mentality thing. A lot of people see the 1% and say only 1/100 people will achieve that wealth. I saw those number and liked my odds. I’m not 1% rich but I’m on the path. If you don’t see it as attainable how can you ever hope to achieve it?", "label": 0}
{"text": "I'm teaching my mom about media literacy and that she needs multiple sources for things and to do fact checking. Surprisingly, it's starting to work and its really cool to watch it happen.", "label": 0}
{"text": "I want the kids that bullied Deku when he was quirkless. Specifically the one whose only power was stretching his eyeballs. Imma show him what someone quirkless can do I bet you that much", "label": 0}
{"text": "If you want to hurt the Elites vote", "label": 0}
{"text": "We tape them in our wall calendar. Gotta wear it on the day", "label": 0}
{"text": "Is Google blocked in your area? Anything they would share as \"evidence\" can quickly be found with a search. Asking people to Google for you is weird.", "label": 0}
{"text": "WHY did I laugh so hard at this!? That’s what his goofy ass gets! 🤣🤣🤣", "label": 0}
{"text": "Note the very definitive, clear response.", "label": 0}
{"text": "Little bush instead of tree got me", "label": 0}
{"text": "Mercenary Tao", "label": 0}
{"text": "What's there to lie about? the whole time they're going on about \"If it doesn't trust you it'll burn you\" and then ash gets its trust and doesn't get burned by it, how else do you expect that to work?", "label": 0}
{"text": "The niceness comes from the tyranny. Subservient behavior tbh. On the flip side, the ones who are the complete opposite usually have nice husbands that they just run over.", "label": 0}
{"text": "If the editorial page does not reflect the reality of the news division then you should check their billionaire owner", "label": 0}
{"text": "Ashe about that animal cruelty.", "label": 0}
{"text": "He’s a complex little guy!", "label": 0}
{"text": "He’ll just imagine you railing his crush and pop a boner mid fight.", "label": 0}
{"text": "Holy shit", "label": 0}
{"text": "![gif](giphy|IhyGL914g9ShHdHVFy|downsized)", "label": 0}
{"text": "Season 3 Subaru would knock your ass out. He only appears weak because he's constantly fighting S tier people that can level cities with ease.", "label": 0}
{"text": "Jesus! And what the whole world is his imagination? *unsubscribes*", "label": 0}
{"text": "We need all we can get.", "label": 0}
{"text": "Do not the ham", "label": 0}
{"text": "I’m picking Yuji Itadori, and telling him exactly what’s going on. Then I’m gonna promise to split the money with him. Dude needs a win", "label": 0}
{"text": "Bros tripping lol. Yes yamaha looks weak compared to aliens that can destroy Earth with one punch, even without yamcha ki abilities he’s still a professional fighter and wrapping up any human being", "label": 0}
{"text": "I was more thinking if you keep the super powers out; (No naruto/bleach/dragonball/ECT.) and keep it just straight UFC style brawl. \n\nAsh bodies anyone from deathnote without the notebook", "label": 0}
{"text": "The voodoo mask is what has me on the floor 🤣🤣🤣like cmon mane", "label": 0}
{"text": "![gif](giphy|7k2LoEykY5i1hfeWQB|downsized)", "label": 0}
{"text": "Gotta love those deregulations, lawdamercy. Listeria here and a little ecoli there, it's all good.", "label": 0}
{"text": "accepted my fate at 22 years old, turns out I look better this way.", "label": 0}
{"text": "I live in a very different part of the country and WW here think about individual freedoms and know their ideas about what's right/wrong should not impact the entire country.", "label": 0}
{"text": "Eh a regular human probably won’t be even able to touch Sanji. Bastard will just do a skywalk and try to flirt from 10 feet above. \n\nOr worse, he calls for Nico Robin and she shows up to fold your ass like laundry.", "label": 0}
{"text": "Just speaks to how much I dislike Rogan and his sphere of influence", "label": 0}
{"text": "[Stephen A Smith once weighed in on this](https://www.youtube.com/watch?v=D9DYuq6R6gY)", "label": 0}
{"text": "Even without psychic skills he's gonna whoop that ass. M2s physical stars are listed at 6'7 270. He's Miles Garrett with 2inches more in reach", "label": 0}
{"text": "NERD ALERT!! Jk, that’s probably accurate af, but he also might just go for it. It’s not like your punches would hurt him at all.", "label": 0}
{"text": "[sometimes u gotta let ‘em know](https://www.tiktok.com/t/ZTFqhGQ4v/)", "label": 0}
{"text": "Ash lifted a Pokémon that was basically the weight of a dying star like it was a cotton ball.\nHe got hands.\nImma fight Komi or Mineta", "label": 0}
{"text": ">white women sleeping with/marrying the enemy\n\nThe enemy? Republican men? They're the enemy of *white* women? Since when? \n\nRepublicans are certainly the enemy of *women*, but there's no shortage of white female republicans lmao idk", "label": 0}
{"text": "Don’t you know? Nice White girls don’t “do”politics. They agreed to disagree with their friends and family. /s", "label": 0}
{"text": "When i get an argument with my wife, i tell her its like we live in two separate universes. The things i do or say she would translate my words into something entirely different instead of taking my words or actions at face value. \n\nIn other words sometimes my wife is like a trump supporter. Despite the things he say, do or have done, they will change the meaning to fit their narrative.", "label": 0}
{"text": "al gore in 2000: 42%  \njohn kerry in 2004: 41%  \nhillary clinton in 2016: 37%  \njoe biden in 2020: 41%\n\nlying or misinformed? and here's part of what obama had to say at the event in question:\n\n\"So now we're thinking of sitting out or even supporting someone who has a history of denigrating you?\"\n\nso he's clearly speaking to black men who plan on voting for trump as well. and kamala harris has the largest support among white women over any other democratic candidate in the 21st century. look, it's one thing if you're not gonna pay attention to the election; it's a whole other thing to go online and espouse a bunch of total bullshit like you're doing right now", "label": 0}
{"text": "Your boos mean nothing, I’ve seen what makes you cheer", "label": 0}
{"text": "Wow that's a clip I haven't seen in a while, thank you", "label": 0}
{"text": "And his asshole", "label": 0}
{"text": "Cause you have bad friends. I'm sorry. This is an L. Manage your expectations, ask for what you want, be willing to do the planning. Aim for a flexible menu of birthday season moments with diff friends instead of one big blow out with everyone on the actual birthday. \n\n\n33rd birthday this year, all my friends have full time jobs etc, some also in school or have kids. Got the 3 core besties together for dinner and a show (bestie said \"I wanna go to this show\" and I said \"I'M IN, can I add the gang, tack on a dinner and make it about meee\" lol). \n\n\nAnother friend texted me a link to an event asking \"can I buy us tickets to this as a bday gift?\", absolutely gal! I'll make the dinner reservation.\n\n\nI set up an afternoon with my friend to bring over a small birthday cake to her place so her little ones could sing me happy birthday and eat cake and I could see her. \n\n\nBrought apple crisp into the office so I had a reason to tell everyone it was my birthday and get the attention I craved. Got the professional girlies together for a Starbz run for my free bday drink.\n\n\nGive love, get love. Make it easy for people to show up for you in the ways they're able to. ", "label": 0}
{"text": "This is the best possible endorsement for Harris: Jeff Bezos hates her.", "label": 0}
{"text": "Physical stats listed at 6'7 270. He's a pro defensive end", "label": 0}
{"text": "Hercule from DBZ", "label": 0}
{"text": "WW here. My husband and son both consistently vote Blue and against Trump and his cronies. I obviously do as well. More of us need to be doing so as well. I don't tolerate people in my life who want to strip rights from others. Not now. Not ever.", "label": 0}
{"text": "So fucking sad. What life is that", "label": 0}
{"text": "Maybe he gets powers later. I'm halfway through season 2... he ain't doing shit to me. He has no super strength or anything like that.\n\n![gif](giphy|l3V0j3ytFyGHqiV7W)", "label": 0}
{"text": "Perfectly put. It’s a thought experiment, not a Q3 business plan.", "label": 0}
{"text": "Doesn't he have Aura powers or something?", "label": 0}
{"text": "I’ve seen Ash get beat up by a small bird. [He pretty scrappy tho](https://youtu.be/xV5IW3EAXiU?si=YYoCBvEH6X2XYVjK). ", "label": 0}
{"text": "He's probably on a similar level to Batman.\n\nI know DBZ logic isn't comparable with DC comics logic but I find it interesting how Batman is able to keep up with the rest of the Justice League while Hercule is a complete joke compared to the Z fighters. I guess it's also because in addition to being a super athlete/ martial artist, Batman also has the resources and IQ of Bulma. Maybe if Bulma were to build Hercule an Ironman suit, he'd be able to keep up with the Z fighters.", "label": 0}
{"text": "Ash has super strength. Can lift and toss massive wooden logs [with ease](https://scientificpokedex.tumblr.com/post/117665655489/hey-you-remember-that-huge-ass-log-ash-ran-with/amp).", "label": 0}
{"text": "careful he don’t catch you sleeping", "label": 0}
{"text": "It was destiny.", "label": 0}
{"text": "![gif](giphy|z8vefMbdAj3xK)", "label": 0}
{"text": "You must have not listened to him since before covid. Because this isn't true at all. He was just talking about her handlers in an interview recently. Because thats the only way she could possibly win the debate. He said she was wearing an earpiece during the debate. Him and a guest were talking about how retarded Kamala is a couple eps ago. \n\nThere's plenty of reasons to hate rogan. Hes transphobic as fuck and kisses tRumps all the time. Spreads known right-wing propoganda. Like kitty litter boxes in classes rooms and tuck bathing suits from kids. Hes a mouth piece for the right. He talks shit about the left non-stop. He spread covid misinformation during the pandemic and still now to this day. He is never critical of the right. Even his own subreddit agrees that he's become a shill for the right. He's platformed the worst of the right.", "label": 0}
{"text": "Still read nasty til your comment.", "label": 0}
{"text": "The absurdity of the entire situation is exactly why I remember it so well.\n\nIt was the, \"there's no way that conversation ACTUALLY happened\" part of gaslighting yourself because the reality actually happened", "label": 0}
{"text": "The GOP wants to remove the EPA, OSHA, etc and deregulate to the point where this shit will happen more frequently and with even less consequences for the cost saving, corner cutting ghouls in corporate America. \n\nBut also because he was just seen doing a photo op in McDonalds that is somehow convincing stupid people that he’s just like them lol.", "label": 0}
{"text": "Shinnosuke Nohara", "label": 0}
{"text": "I hope he likes you. I truly do.", "label": 0}
{"text": "I’m hard-pressed to think of more than a handful of Black women married to white men *period*, no less white men who vote for Trump.", "label": 0}
{"text": "Ludacris - Last of a Dying Breed", "label": 0}
{"text": "Was that before or after his rampant transphobia? Or his palling around with Musk?", "label": 0}
{"text": "Burger king has pretty pattied", "label": 0}
{"text": "Are we talking fish Ponyo or girl Ponyo? Because I couldn't beat up fish Ponyo. That bitch too cute.", "label": 0}
{"text": "Yamcha.", "label": 0}
{"text": "Bruh, he might be a comedy character, but he's still insanely strong and good at martial arts....\n\nYou shouldn't be picking anyone from the DBZ universe, lol", "label": 0}
{"text": "Wait until he mind crushes you \n\nIf it's season zero then he'll make you play a rigged saw game", "label": 0}
{"text": "what was that anime with a piano girl that was ill, that’s a good option", "label": 0}
{"text": "I'm gonna need that sticker.", "label": 0}
{"text": "dump is just so simple", "label": 0}
{"text": "Be quiet weirdo.\n\nhttps://www.reddit.com/r/AskHistorians/comments/eaywni/was_there_comedy_in_nazi_germany_what_were_the/", "label": 0}
{"text": "I know it’s not what it means BUT\n\n“Yo, vote”", "label": 0}
{"text": "Well my big back self had the krabby patty last Friday. It wasn’t hitting at all. Just a burger with thousand island dressing", "label": 0}
{"text": "SHOWGIRLS\n\nviewer discretion is advised", "label": 0}
{"text": "But a lot of these women know exactly what these men stand for before they agree to marry them.", "label": 0}
{"text": "Ash got squabs, she finna get folded.\n\n\nShe should chose yuji from blue gender or some shit", "label": 0}
{"text": "Can we pick PBS characters? I'm fucking whooping Daniel TIger's ass and giving Trolly a cut so  I can get out the Land of Make Believe", "label": 0}
{"text": "The humans in Pokémon have to be super powered to withstand all that fire and lightning damage being tossed around.", "label": 0}
{"text": "For 100 Million, I’m fighting Whis from Dragon Ball Super.\n\n\nAngels can’t fight (they HAVE HANDS, just strictly prohibited, lest they want to be erased from existence)\n\nWhis gon dodge all my shit (to be expected), but then imma ask to have him serve as my master/teach me, an Earthling to develop some techniques or help me to develop God Ki, and boom, walking thermonuclear bomb, plus there’s a strong chance he’ll put me on with Goku and Vegeta, who is married to Bulma, who has racks", "label": 0}
{"text": "And in the case of another Trump presidency I wont consider the Post a legitimate source of coverage. A dude who has more money than he could spend in 1000 years caved to a cartoon character. Up yours Bezos!", "label": 0}
{"text": "Mawma this is art", "label": 0}
{"text": "What I think they meant is that both white women and Black men have an intersectionality of oppressing and being oppressed. Black men are Black and white women are women. But Black men still can benefit from and propagate misogyny and white women can benefit from and propagate racism.", "label": 0}
{"text": "Becky from Spy x Family, she ain’t ready for the RKO", "label": 0}
{"text": "Dont know why you're being downvoted. He does not speak highly of her at all. He said she did good during the debate but then said I mean, her handlers did good. He spread that she was wearing an earpiece during the debate. And him and a guest in the last week were joking about how retard she is.", "label": 0}
{"text": "This is it. Every demographic has inexplicable folks, but most black men are not about that life", "label": 0}
{"text": "And then they say trump is threathening democracy.... while actively messing with votes.... fucking idiots", "label": 0}
{"text": "Good point good point", "label": 0}
{"text": "While you still can.  No-Fault Divorce will almost definitely be gone if Trump becomes president.  It may not be day one, but it'll happen.", "label": 0}
{"text": "No, asking people to provide evidence of claims made is perfectly acceptable. You make the statement, and you back it up with facts.", "label": 0}
{"text": "Wait, he's 12 now? I thought he was a perpetual 10 year old, like the average redditor.", "label": 0}
{"text": "They said “y’all can have some food poisoning as a little treat”", "label": 0}
{"text": "Right?! And he didn't expect to win, he just had enough and decided it was time to swing, consequences be damned.", "label": 0}
{"text": "https://preview.redd.it/tss7milh4zwd1.jpeg?width=530&format=pjpg&auto=webp&s=8e674b10fd797221eae666f0c16d4ec4ec8838f2", "label": 0}
{"text": "I’m sorry.", "label": 0}
{"text": "We found him!", "label": 0}
{"text": "I've faced more racism from white and Asian women than any other groups.  Maybe it's because white men are more worried about being viewed as racist, whereas white and Asian women feel more protected if any accusations are brought against them.  Not sure why, but just based on what I've seen in life it feels like they're not only more racist than white men, but also more comfortable acting on their racism.", "label": 0}
{"text": "To all the older siblings im sorry on behalf of the youngest.", "label": 0}
{"text": "Flies and shoots enerby beams from his hands.  Prime Mike Tyson and Jon Jones 2 v 1 are getting packed up by Yamcha", "label": 0}
{"text": "***Vehemently violining and dancing***\n\nhttps://i.redd.it/bwfkfuks4zwd1.gif", "label": 0}
{"text": "Idk man, Nausicaa straight murders like 3 dudes", "label": 0}
{"text": "Why y'all gotta do Hamtaro so dirty.", "label": 0}
{"text": "These motherfuckers out here picking DBZ characters are out of their minds. You ain't got shit to look for with them.", "label": 0}
{"text": "Kinda like anyone non dem could stomach a dem, gross", "label": 0}
{"text": "Theres the hamster.", "label": 0}
{"text": "That’s incredible and I love that for you all", "label": 0}
{"text": "I was thinking Tommy Pickles. I know it's fucked but that's a lot of money.", "label": 0}
{"text": "I’ve seen Ash outrun pikachus lightning bolt ain’t no way I’m doing that.\n\nThe obvious answer is Shinji Ikari", "label": 0}
{"text": "Oh this is going to be messy 🤣", "label": 0}
{"text": "Well shit I only watched like the first two seasons 20+ years ago, I didn’t know he picked up super powers.", "label": 0}
{"text": "At ten years old ash climbed a cliff in the rain with no climbing equipment. Ash is a beast dont fight him", "label": 0}
{"text": "Give me a better alternative than an old moldy mop (please)", "label": 0}
{"text": "White American guy here. It's fucking crazy how quick someone can turn into a Trumper. I've seen more than one family member or friend become MAGA over the course of a couple of years. It's always someone that already leaned conservative but it's still wild to see.", "label": 0}
{"text": "My man's about to suplex an 8 year old girl through a table", "label": 0}
{"text": "I get this one a lot 😂", "label": 0}
{"text": "I get that bpt is anti-context, but how'd this miss you?", "label": 0}
{"text": "NEVERRR", "label": 0}
{"text": "NEW SADE MUSIC  [https://open.spotify.com/track/25rVDGUJj0RtfjzdR1maXQ?si=98005e402d32485d](https://open.spotify.com/track/25rVDGUJj0RtfjzdR1maXQ?si=98005e402d32485d)", "label": 0}
{"text": "![gif](giphy|Xg9qVfblOUg5oMBS1v)", "label": 0}
{"text": "Ah, a man of culture.", "label": 0}
{"text": "Maybe not physically but I'm sure she could inflict some emotional damage", "label": 0}
{"text": "As much as I like getting a sticker, I just wish we had “democracy sausage” the way Australia does.", "label": 0}
{"text": "Hamtaro. Sorry buddy I love you but you gotta catch these hands. I can't risk it for that much money", "label": 0}
{"text": "At that point at least take out one of the little dickhead kids instead", "label": 0}
{"text": "I can feel the devastation like it was yesterday.", "label": 0}
{"text": "What state are u in?", "label": 0}
{"text": "He just good looking. I'll end up looking like my daddy's daddy\n\n![gif](giphy|3o85xERD1TT5JKCIXS)", "label": 0}
{"text": "Drinks cost $2 each. I ran out of water in my dorm and got parched.", "label": 0}
{"text": "Sometimes karma is too busy and has to do a quick pop in to hit you with some diarrhea", "label": 0}
{"text": "The original Yugioh manga was a pretty dark and gory shounen. The adaptation watered it down pretty severely even before the 4Kids dub censoring.", "label": 0}
{"text": "Ainz Ooal Gown, or Momonga, whatever.\n\n*Huh?!*\n\nThe main character's his mind extracted from what's now probably his withered corpse.  Since I'm not in the game, I win by notifying the utilities I think someone's stealing power from an empty apartment.  I don't even have to catch the smell.  I've won; he's a braindead husk or a disembodied blip in the machine.", "label": 0}
{"text": "I am picking on of itchgo human nerd friends  no feats no powers just some good old hands ", "label": 0}
{"text": "That’s called the work of the ancestors. They are saying sit your dumb ass down and reconsider your life", "label": 0}
{"text": "Ooo it's the they paid $8 pic", "label": 0}
{"text": "ashitaka from princess mononoke cooks everyone in this thread with his hands tied behind his back.", "label": 0}
{"text": "South of the Mason Dixon is really the \"head in the sand\" champions, uncontested.", "label": 0}
{"text": "Hamtaro. He can bring the whole gang.", "label": 0}
{"text": "Even in ads that thing looks like it is just waiting to give you the bubble guts of doom", "label": 0}
{"text": "I've said this to my spouse so many times but ever since 2020 I'll have these moments where I really question my sanity. Like in that moment I genuinely feel like we're living in the Twilight Zone. Like I just can't comprehend how so fucking many people are taken in by the bullshit and lies and fear mongering and the only explanation my brain can come up with is Twilight Zone. I mean this asshole is going to get millions and millions of votes. I know so many people who are going to vote for him. People who are otherwise kind, thoughtful, smart people. But let Trump or one of their bullshit lies/talking points come up in conversation and it's like I'm talking to an alien all of a sudden. It's wild, and I seriously question reality when I start thinking about how close this election is going to be.", "label": 0}
{"text": "I fear yami yugi pharaoh bullshit, dude burned multiple people alive in season 0", "label": 0}
{"text": "Nah as a younger sibling I agree. Don’t ask often and don’t ask for much is the principle I go by when asking my older siblings for money.", "label": 0}
{"text": "He always did, it was just censorship that created that term outside of Japan", "label": 0}
{"text": "I’m picking pre allmight deku", "label": 0}
{"text": "Dudes got like 20 girlfriend's or something. I don't think that's simp territory", "label": 0}
{"text": "I had that thought too, but she routinely slaps around the MC. The safer bet is Nagisa from Clannad.", "label": 0}
{"text": "The by-mail ones are basic", "label": 0}
{"text": "THANK YOU! Everybody wants to look at shonen characters. I'm punting the hamster!", "label": 0}
{"text": "“Scurrying ass nigga”", "label": 0}
{"text": "![gif](giphy|CTlqkltgD8yMOOBMcP)\n\nAsh is canonically strong", "label": 0}
{"text": "Ash also has on mulitple occasions picked up pokemon that weigh more than 100lbs without batting an eye. Larvitar weights 160lbs and when it evolves its 300+lbs.", "label": 0}
{"text": "Ugh, I don't know if I could deal with more of his whiny ass crying tho", "label": 0}
{"text": "They were one of the main ones I was talking about 😂😂", "label": 0}
{"text": "Simply another voter suppression move..", "label": 0}
{"text": "It’s kinda hilarious to on fucking REDDIT talk about media favoritism.", "label": 0}
{"text": "Kon from Bleach in his stuffed animal form. Just put that bitch in washing machine. Or Mumen rider from One Punch Man, beat him up and take his bike.", "label": 0}
{"text": "He’s got that Growlith in him", "label": 0}
{"text": "Get out of my head. I heard the voice!!", "label": 0}
{"text": "I think this is like what I'm doing with my toddler cousin. Started picking him up when he was 2yo. Now he's 4yo and I'm still picking him up as high as I can at every opportunity.\n\nIt's like free weights that ask for snacks and cartoons, gradually getting heavier as I get stronger. I do curls with him as the weight, he thinks it's hilarious.", "label": 0}
{"text": "Ash can pick up a larvitar with EASE. That kid and right.", "label": 0}
{"text": "Except you’ll never catch ash without his balls", "label": 0}
{"text": "Is he a powerlifter? dafuq?", "label": 0}
{"text": "Yamcha is pathetic by DBZ standards but he could shatter your entire skeleton with a punch", "label": 0}
{"text": "Dude is immortal though.  He's been catching pokemon for 20 years and still only 10 years old.", "label": 0}
{"text": "Did you see the new stickers in Michigan?! We have a Dogman!!", "label": 0}
{"text": "That's a good joke.", "label": 0}
{"text": "Easy to say with those cheekbones.", "label": 0}
{"text": "Well in this case it was take the lecture with me from this third party", "label": 0}
{"text": "I'm prolly still picking Krillin.", "label": 0}
{"text": "![gif](giphy|exOfVLEc1hjOg)", "label": 0}
{"text": "So, so many stupid people in America these days. ", "label": 0}
{"text": "It really shows the danger of these conglomerates, where someone can threaten some distant, completely unrelated line of business, and it immediately makes the media arm start marching in lock-step with central management's orders.", "label": 0}
{"text": "Yamcha is WAY above peak human just from having ki. Mr Satan doesn't and he would be very strong for a regular human.\n\nEven before he trained with Kami, Yamcha is still many times stronger than a real human can be. Afterwards he's able to fight a saibaman, which would be completely out of reach for \"peak human\"", "label": 0}
{"text": "But to say he’s a Nazi sympathiser is wild. It’s clear that like a lot of comedians he has a hard-on against cancel culture and political correctness in speech, but all his political opinions on the record are against Donald Trump. \n\nWhen he invited Musk on, it was right when he bought twitter, to him he was just “that space guy who’s going to Mars”, that’s why he was genuinely surprised by his audience’s reaction.", "label": 0}
{"text": "I finally gave in last year and damn I am so much more comfortable! The ego hit fades but comfort is always great.", "label": 0}
{"text": "Like the second episode he survived getting struck by lightning. He always had that dog in him.\n\nNo normal human is beating Ash.", "label": 0}
{"text": "I'm fighting Goku. He likes opponents who are stronger than him. He'll be bored in a couple of mins and leave.", "label": 0}
{"text": "Strongest? He ain’t beating Goku though", "label": 0}
{"text": "Alright hear me out - \n\nGoku canonically befriends a sizable percentage of the people he beats the shit out of.\n\nYeah a hundred million dollars is great but befriending literally any of the Z-fighters would be priceless, let alone the man himself", "label": 0}
{"text": "Hell, even Bulma's non-fighting ass slapped a god for ruining her birthday. I'm not going for NOBODY in that universe.", "label": 0}
{"text": "I just voted. Sometimes that sticker is the only meaningful consequence that we feel from voting.", "label": 0}
{"text": "I’ve listened to probably over 100. But only the guests/topics that I find interesting, I don’t care for the “political” guests, pseudoscientists/conspiracy theorists", "label": 0}
{"text": "he probably just thought it’d be real fun to own a newspaper.", "label": 0}
{"text": "That sticker gets you a free day off of work in most States, so yes I want my sticker!", "label": 0}
{"text": "Turn a treasonous terrorist into a Klan martyr.\n\nhttps://preview.redd.it/f4g3z9os9zwd1.png?width=1080&format=pjpg&auto=webp&s=6a85ac85ecf62266b21c345abcdf2a17bea4219c", "label": 0}
{"text": "Cancel culture and political correctness are just dog whistles for complaining about not being able to be a bigot. Don’t act like they’re just upset they can’t tell R-rated jokes. They’re upset people call them out on their bigotry.", "label": 0}
{"text": "Well I’m staying away from that kid now.", "label": 0}
{"text": "Got his ass", "label": 0}
{"text": "Yea I was gonna say, black folks are unmatched at making fun of people. Roasting is a past time and rite of passage for black males", "label": 0}
{"text": "They call him Arcanine Ash for a reason", "label": 0}
{"text": "\"Hate is the same thing as love\"\n-Patrice O'Neil", "label": 0}
{"text": "Do yall know how badly I'm a bear the shit out of Shin Chan? He got it coming anyway", "label": 0}
{"text": "Are we talking smash bros Mewtwo or Mewtwo Mewtwo", "label": 0}
{"text": "The entire main cast of K-On.", "label": 0}
{"text": "Lelouch's blind sister", "label": 0}
{"text": "Exactly who I was thinking", "label": 0}
{"text": "Corrections skinamax\n\n![gif](giphy|IOW62vImJNEhW)", "label": 0}
{"text": "You'd get packed up by a girl who forced herself to evolve from a fish.", "label": 0}
{"text": "…Sorry, what?", "label": 0}
{"text": "Rap snitches, tellin' all their business\n\nSit in the court and be their own star witness\n\n\"Do you see the perpetrator?\" Yeah, I'm right here\n\nFuck around, get the whole label sent up for years, uh", "label": 0}
{"text": "Politics ain't life. There's way more to life then sweating politics.", "label": 0}
{"text": "Leorio, HunterxHunter. \n\nHe has zero fighting ability. A child could beat him up.", "label": 0}
{"text": "Yeah I heard it was straight ass. Sucks, they could have made so much money if they gave a fuck", "label": 0}
{"text": "It truly does. I also keep thinking of „scratch a liberal and a fascist bleeds“.", "label": 0}
{"text": "Tohru Honda…. ☹️ don’t think I could live with myself after tho", "label": 0}
{"text": "Just imagining you in a silk shirt is hilarious and I don’t even know what you look like", "label": 0}
{"text": "The BB gun assassination attempt?", "label": 0}
{"text": "Not saying shit, I'm not going on the naughty list.", "label": 0}
{"text": "Yamcha would destroy you though lol.", "label": 0}
{"text": "Elevate as in point to and say, \"See? How can I be racist if I have a black~friend~ supporter", "label": 0}
{"text": "Its not that simple, because in the American context, racism is deeply intertwined with white supremacy, in such a way that you can't make neat divisions like that. That's the whole point of intersectionality. \n\nBlack men may be individually misogynistic (note: the actual data posits that your average black man is *less* misogynistic than your average white person, but go off.) But black men have never had the privilege or access to systemic power, because under white supremacist patriarchy, we are not men. We are *boys*.\n\nLike, at some point we took the gendered relations of white people in mid century America and just ported them over wholesale to the gendered relations of black people, but that ignores an absolute shit ton of context.", "label": 0}
{"text": "![gif](giphy|JsUC9rI0VfyHi93MBU)", "label": 0}
{"text": "im the younger one and my older sibling is the one that borrowed money all the time without asking and never paid it back", "label": 0}
{"text": "Yajirobe or Mr. Satan from Dragon Ball", "label": 0}
{"text": "The problem with the abortion is murder lie is that they want abortion banned even if the fetus is already dead. How does killing the woman by refusing her an abortion of an already dead fetus save a baby? It doesn't, but it does punish the women. \n\n\nAlso\n\n\nhttps://joycearthur.com/abortion/the-only-moral-abortion-is-my-abortion/?origin=serp_auto\n\n\nA lot of these \"you're killing babies\" people seem to have no problem getting one when it's themselves. \n\n\n\n\nThis is the kind of easy to spot lie I was talking about. You are still falling for it. Try actually looking into the ACTIONS, not words of each side. Try to see if the actions match the words. Stop just believing what they tell you. \n\n\nHell, even just looking up voting records will show how frequently and how blatantly one side lies. Challenge yourself to learn something and break free from the both sides BS. \n\n\n\nAlso, look up the paradox of tolerance. \n\n\n\n I hope you take some of this to heart. I used to be the same way, trying to see the good in everyone. But some people don't have any good in them, it's grim and depressing, but it's true. \n\n\n\nGood luck.", "label": 0}
{"text": "As a fellow WW, wholeheartedly agree. I'll admit, though, the first time I saw this video, I was here for it because I was thinking about how I felt the same way in the last general election, dancing in my head the whole way to the drop box when I dropped my and my mother's ballots off because at least my vote canceled out my mother's Trump and R votes. I took great pleasure when she complained that she felt like her vote didn't matter in our blue state because of the electoral college, and she actually canceled her voter registration afterward voluntarily. I'd rather see eligible people exercise their right to vote, but it was also fine by me, one less R vote to worry about in our district that unfortunately leans red.\n\nBut, thinking about it, I don't know whether to feel bad for this woman or not because from this video alone, we don't know what her husband was like or believed before the Trump infection took hold. We all know that MAGA has emboldened a lot of people to be loud and proud with their hateful views, much to the surprise and dismay of loved ones in many cases. If he already held shitty views that she knew about when she married him, despite how opposed it was to her own views, then shame on her for marrying this garbage human. If this is new from him, girl, why are you still with him? If I were married and my spouse turned far right,  Trumper, or manosphere on me, I'd *happily* file for divorce so fast that there'd be burning tire marks all the way from my house to the courthouse.\n\nWhenever possible, I refuse to abide people in my life whose views and morals are so vile and reprehensible. I think all of us, especially WW, have a responsibility to not marry or procreate with these garbage men. And you're so right we WW have the numbers and potential to enact such incredible positive change and progress, but so many vote against our own interests and against those of minorities and other marginalized people. It's like a few years of progress let modern WW forget that we're also a historically marginalized class and that the men, especially WM, would happily strip them of all the rights they currently still enjoy at the first opportunity. It's so frustrating that they're this short-sighted, on top of being just so full of hate that they don't care who it hurts as long as they believe it hurts the *right people right now*. Ugh.", "label": 0}
{"text": "Look, 30 year old me drove all the way to the county election office with a note from the poll worker in my precinct because I needed my “GA Voter” peach sticker in 2008– and you know why I wanted it for THAT election! My mouth was poked out so hard, I was kissing other dimensions until I got it too.", "label": 0}
{"text": "I mean, I utilize basic street smarts (don't walk down dark alleys alone, don't keep cash or expensive jewelry on me, don't get too close to a crack head, etc) but otherwise nah. I ain't really too concerned with being robbed or murdered 99.99% of the time. Especially not from something as mundane as an Uber driver.", "label": 0}
{"text": "I’m leaving here with something now…", "label": 0}
{"text": "Oh yeah great point I'll straight up ghetto stomp that lanky simp kid and feel nothing", "label": 0}
{"text": "It's kiss or kill.\n\nI hope that was an X reference lol", "label": 0}
{"text": "I MIGHT be able to take Tiny Tim. Maybe.", "label": 0}
{"text": "these are so cool and top left is incredible", "label": 0}
{"text": "Not even American or old enough to vote yet, but I need that middle right one", "label": 0}
{"text": "🤣 🤣", "label": 0}
{"text": "Yamcha is the second strongest human on earth.", "label": 0}
{"text": "Get in the robot, jesterinancientcourt!", "label": 0}
{"text": "Bruh you know it. Girl loves the park and we got a pretty solid one near us so we out there. Plus I need her to use some energy so she can get to sleep for her nap. Honestly not so much on the streaming services. Just Netflix and was using my friend’s Disney+ but they cracking down on account sharing so that’s gone. Mostly just record shows cause this kid can watch the same thing over and over and enjoy the hell out of it lmao", "label": 0}
{"text": "When we have to leave Earth because Trump ruins the world, WP won’t be able to come along period!", "label": 0}
{"text": "NOT BIG KETCHUM", "label": 0}
{"text": "Anything to destroy unionized labor and impoverish the workers.", "label": 0}
{"text": "Thug may beat his case or get a plea deal to get him out of prison depending on what prosecution does after another lengthy court battle that resulted in a mistrial.\n\nMeanwhile, Durk has been arrested for potentially orchestrating a hit.", "label": 0}
{"text": "Durk got rounded up with 5 other people by the Feds over a hit. They apparently killed Quando Rondo's cousin in 2022.\n\n\nIt's been all over the news today.", "label": 0}
{"text": "&#x200B;\n\nhttps://preview.redd.it/kjxm7xsnczwd1.png?width=553&format=png&auto=webp&s=146bfe18aa43ddab8f053d7b3ea887d58fbe7540", "label": 0}
{"text": "My mom signed me up way back, but I had just joined the military so I never attended any meetings or anything. Even if I did live in my hometown, hanging out with a bunch of old white ladies wasn’t exactly my idea of a great time. Now that my mom has passed, my dad is asking me if I’m going to renew my membership and all I can say is “no thanks, that was mom’s thing.” He seems a bit hurt, maybe because it was something that was so important to my mom, but it’s just never interested me.", "label": 0}
{"text": "Oh damn I’ve been locked in at work all week, missed everything", "label": 0}
{"text": "Oh damn that’s wild af. I missed everything", "label": 0}
{"text": "badass!!!", "label": 0}
{"text": "just to add to the good comments, it was apparantly a murder for hire retaliation for King Von's death. \n\nAll this for Quando Rondo's fucking cousin lmao", "label": 0}
{"text": "I wouldn't try a good handful of them haha.", "label": 0}
{"text": "Straight to the Shadow Realm, do not pass go", "label": 0}
{"text": "Insane bro", "label": 0}
{"text": "Wow that website is fucking cancer.", "label": 0}
{"text": "The old legacy media is morphing into a very different business model, and social media and on line is changing the way information travels and is consumed in this country.  End of an era.", "label": 0}
{"text": "Ate you talking about,  \"Your lie in April \" ?", "label": 0}
{"text": "Yall acting like these are compilations of uber drivers attacking the passengers. Calm the fuck down, and ladies none of you are attractive enough to risk losing a means of making money.", "label": 0}
{"text": "Setsuko from grave of the fire flies. She's a four year old starving to death. After I gently shove her to win the fight, I'll use some of my winnings to save her, and her brother. ", "label": 0}
{"text": "https://www.fox5atlanta.com/news/ysl-trial-protest-judge-considers-mistrial-young-thug.amp", "label": 0}
{"text": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.fox5atlanta.com/news/ysl-trial-protest-judge-considers-mistrial-young-thug](https://www.fox5atlanta.com/news/ysl-trial-protest-judge-considers-mistrial-young-thug)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "label": 0}
{"text": "It seems like black people got really into anime the last like ten years.   Am I way off or is this accurate,  and why?\n\n(I mean no offense to anyone, this is a legitimate question with no ulterior motives.)", "label": 0}
{"text": "Ash has squared up with almost every legendary creature including a direct square up with Mewtwo, has nearly drowned more than 5 times, fell from fatal heights more than 10 times, has eaten more than a million volts, eaten flames over 50,000 degrees in Fahrenheit, AND has the mysterious power to never age. I think Ash might be able to box with Goku himself for a bit", "label": 0}
{"text": "not quite the good news I heard. I believe it's a mistrial without prejiduce, which means they can retry the case if the State's jurisdiction has not ended. They are considering a mistrial to recall a new jury, as this current jury is just not gonna do it for the State. So we'll see what prosecution does with that.", "label": 0}
{"text": "I could dropkick Anya Forger.\n\nActually, her parents would murder me, so I'll dropkick Damian instead. His dad don't give a shit.", "label": 0}
{"text": "Is Washington too", "label": 0}
{"text": "I’m not picking Yugi.  The challenge just says fight it doesn’t specify fists so what ever all powerful being is setting this up might interpret this to be fighting by playing cards.  It’s referred to as a duel after all. In which  case you likely to get bodied by the king of card games.", "label": 0}
{"text": "No", "label": 0}
{"text": "Weird. I just sent my older sister a couple hundred yesterday. My wallet seems to be equal opportunity.", "label": 0}
{"text": "There are days where I feel like I really missed out on the siblng relationship as an only child.\n\n\nThen i find threads like this one, and that fear I've missed out on something is replaced with relief that I only have to deal with my own shit.", "label": 0}
{"text": "My mother does this and it BURNS me up.", "label": 0}
{"text": "there was simply no call for this", "label": 0}
{"text": "It feels the same as using a sponge to wash the dishes, I don’t want that nasty thing near me after 5 minutes of use. ", "label": 0}
{"text": "Honestly I’d pay someone to let me beat Shinji’s ass", "label": 0}
{"text": "Fuck it i am HIM lol", "label": 0}
{"text": "Ash was also blessed by Ho-Oh. And probably a few other god tier mon.", "label": 0}
{"text": "Bro, Mewtwo blocked. He didn’t take the hit, he blocked it. Ash is regularly seen carrying or lifting Pokémon that weigh upwards of 500 lbs or more. Lil bro is JACKED.", "label": 0}
{"text": "So just Oregon is left out? No fair 😭", "label": 0}
{"text": "Okay, but what are you implying here? I’m genuinely listening to? Does Lil Durk or Young Thug have some connection with DJT? Are they Klan members? Do they eat a lot of McDs? What am I missing for the seemingly left-field attempt at a connection?", "label": 0}
{"text": "\"Enemy of the people\" sounds enigmatic and COLD", "label": 0}
{"text": "Ashe probably has a 80MPH pitch.", "label": 0}
{"text": "Peggy Hill would catch these hands so fast for that kind of money. Such an insufferable character.", "label": 0}
{"text": "Mama Bashame can catch these hands (as long as it’s not about rice or being a deer)", "label": 0}
{"text": "They are going hard with the stickers this year\n\nhttps://preview.redd.it/c2kugmaaezwd1.jpeg?width=1440&format=pjpg&auto=webp&s=c36b8fc451a76512a7334c6016d3d46d47a5ff7c", "label": 0}
{"text": "https://preview.redd.it/pgjp9r7dezwd1.png?width=1080&format=pjpg&auto=webp&s=c89958da4d6a2adde1b30041f0208600add8927b", "label": 0}
{"text": "This is truth. Ask Ne-Yo", "label": 0}
{"text": "Lmaooo laughed way to hard at this", "label": 0}
{"text": "Mei from My Neighbor Totoro", "label": 0}
{"text": "I get the part where you shit on Rogan, but why’d you have to belittle Quake like that?", "label": 0}
{"text": "Sabotaging every pending criminal trial while running for his life (i.e., running for president while a felon)? He didn't turn any of them into a mistrial, but his judges be doing the bidding for him.", "label": 0}
{"text": "I'd eat me some Wendy\n\nhttps://preview.redd.it/162yy17jezwd1.jpeg?width=625&format=pjpg&auto=webp&s=987342105712457ae27901948b3c41e59ea1a3c2", "label": 0}
{"text": "?😂", "label": 0}
{"text": "Oh man I can fight those kids who killed the puppy in Elfen Lied *and* I get 100 million dollars?\n\nSign me the fuck up.", "label": 0}
{"text": "Trump didn't wash his hands after adjusting his diaper.", "label": 0}
{"text": "Embrace your bald 🫡", "label": 0}
{"text": "Shou Tucker from FMAB. Not to win 100 million dollars. Just to kick his shit in.", "label": 0}
{"text": "Komugi from HxH", "label": 0}
{"text": "Yeah, they're cooked.", "label": 0}
{"text": "Salute to the Abbot 👐", "label": 0}
{"text": "Had someone say they need to see a video to see him.say that. Like.bro just search it it ain't hard to find. That's how you know they are long gone from.reality", "label": 0}
{"text": "According to dolly it was the red hair that she feared", "label": 0}
{"text": "Dude is clearly unwell. Just because he is rich doesnt mean he isnt also unwell", "label": 0}
{"text": "Why Ash and not that kid from Team Rocket. Drag him by the hair and hang his ass up by his g-string.", "label": 0}
{"text": "Literally not. Im saying he clearly is and its sad because he wouldnt have been like this way back in his chappel show days", "label": 0}
{"text": "![gif](giphy|2sgGNBgGktcr84OyMg|downsized)", "label": 0}
{"text": "Saitama", "label": 0}
{"text": "Why does this Website wants to set cookies and share my information with 1558 partners across the world?", "label": 0}
{"text": "I find even shaving such a hassle that I just bought a cheap hair clipper and use one of the blades to trim my beard and that's all I do with it. Can't even think of trying to maintain a good looking bald.", "label": 0}
{"text": "There's no way that log is only 1385 lbs", "label": 0}
{"text": "His other nicknames were “the Giant Devil” And “Dirty Egawa”. Guy was a menace on and off the field. He refused to sign with the team that drafted him #1 because it was too far away and he didn’t like flying. So instead he enrolled in USC and waited out a whole year until they traded him to the team he wanted to go to.", "label": 0}
{"text": "Yeah, pre-season 1 of the anime, Yami Yugi was straight up murdering fools.", "label": 0}
{"text": "Yeap! This is my non porn account.", "label": 0}
{"text": "Appreciate the month old reply. It really is though. Probably rop 5 generational comedies ever. Executed to perfection.", "label": 0}
{"text": "No just a self full filling prophecy.", "label": 0}
{"text": "Yamcha is one of the strongest humans to ever live...  I think Krillain and Roshi are the only ones that are above him.  Uub if you count the divine intervention reincarnation of Buu.", "label": 0}
{"text": "Durk better hope an attorney or someone fucks up worse than he did. He's going down.", "label": 0}
{"text": "RIP to the guys with weird shaped heads who are balding.", "label": 0}
{"text": "Last time I that checked(rip nipsey), ash been punching on ppl and pokemon", "label": 0}
{"text": "Cuz got heart.", "label": 0}
{"text": "\"It's not about the size of the dog in the fight. It's about the size of the fight in the dog.\"", "label": 0}
{"text": "If you're white he'll also happily take the beating so you can get your cash.", "label": 0}
{"text": "What’s the point of sanitizing floors? You trying to eat off of them? I thought we mop to stop dirt from tracking everywhere", "label": 0}
{"text": "Man that article is some half ass shit", "label": 0}
