{"text": "\"Common sense ain't so common anymore, kinda like finding a shiny Pikachu in the wild.\"", "label": 1}
{"text": "Trump 2025 !", "label": 1}
{"text": "Black people are so racist. Nothing good done for them is every reciprocated, I hope Europe and Asia is able to get this information before its too late :(", "label": 1}
{"text": "Rogan is a conspiracy theorist who offers nothing to the world other than to sew more chaos and give \"free speech absolutist\" more bullshit boogeyman to convince them that some secret cabal is out to get them. \n\nWho gives shit about his \"wider range\" his discussions are not intellectual or enlightening. No one should be watching that staunch anti-vaxxing anti'woke \"warrior\". Period.", "label": 1}
{"text": "- CP5 admitted and were convicted\n- being sued is not the same as being indicted or convicted. He didn't lose that lawsuit BTW \n- immigration should be legal", "label": 1}
{"text": "r/HermanCainAward  had some real Gems during that time period lol. Casually seeing living people go thru all stages of grief. Oh lets not forget the bleach!", "label": 1}
{"text": "Pokemon trainers are like Monster Hunter hunters, their physical parameters can wind up infinitely, their life is never in danger (canonically worst they do is faint), they are basically just demigods playing around.", "label": 1}
{"text": "Don't post things from meme/corporate accounts. Posts must come from regular social media accounts.", "label": 1}
{"text": "https://preview.redd.it/u7db9p1ozzwd1.png?width=752&format=png&auto=webp&s=951d7eefd6270c6a5750f41d9dc4d9b8d9043f27\n\n…and then they remember", "label": 1}
{"text": "Any \"fighter\" in DBZ will take your normal joe punch like it was nothing. The balls on these people to name ANY DBZ fighter. They are ripped as ahit and definitely know martial arts. Sorry he can't win against a dude that shoots a laser from his finger but he gonna woop your ass for sure.", "label": 1}
{"text": "We'll see who wins. You guys need to get out of the plantation.", "label": 1}
{"text": "liar", "label": 1}
{"text": "Lol. I didn’t vote trump. Don’t be a rabid Reddit troll who attacks anyone who slightly disagrees with you. I’ll gladly show you my voter registration. I even got a sticker when I voted Kamala. \n\nThe argument was that trump didn’t want to give the checks. That is false. He called the first round a trump administration initiative. \n\nhttps://www.washingtonpost.com/politics/coming-to-your-1200-relief-check-donald-j-trumps-name/2020/04/14/071016c2-7e82-11ea-8013-1b6da0e4a2b7_story.html\n\nAnd the second one he wanted to increase the amounts. \n\nNOW…if your argument is trump wanted to DELAY the checks so his name could appear, fine. But the person I replied to said trump didn’t want to give the money. That is false and a distinction from “he wanted his name on the checks so he delayed them”. \n\nAgain…don’t be a jerk. People can disagree politically without being assholes.", "label": 1}
{"text": "Ok so now we are moving the goalpost. Of course people lie. McDonald’s let that man flip burgers and continue a tirade saying Kamala is lying about her work history. You can’t argue something FEELING like someone is lying. But we can assess the available information. \n\nLike I said, the goal post is changing. And if that’s what’s happening just say that. Just say “I don’t think Trump honestly wanted to give us checks”. Nobody can debate that. We can simply disagree. I’ve seen no evidence that says he didn’t want to. You believe him saying otherwise was a lie. Case closed.", "label": 1}
{"text": "Both sides so it lmao, its a joke.", "label": 1}
{"text": "Go about 4 comments up ya dink. We just told ya.", "label": 1}
{"text": "My lord, I lost so many brain cells trying to read that. Christ...", "label": 1}
{"text": "President Obama speaks better than that", "label": 1}
{"text": "Just because you can vote don’t mean you should vote. I get our grandparents fought for this right but sometimes people be voting just to vote(that used to be me) I know I’m taking a break from this election.", "label": 1}
{"text": "I had a fucking stroke reading that", "label": 1}
{"text": "A seat belt compared to a mask? That was PROVED didnt work? Again, spare me with your nonsense. This wasnt about mask, it was mandates and again it goes against ALL of your points in either capacity - “Who are they to tell you what to do with your body.”", "label": 1}
{"text": "Neither candidate spoke on the issues that pertained to my race.", "label": 1}
{"text": "Some people vote because they feel like they HAVE too without even knowing what they want from a president, what core values they align with and etc.", "label": 1}
{"text": "There was a post on r/WorkersStrikeBack about how voting in America is unimportant because if it was, they'd be trying to make it illegal.\n\n  \nI pointed out that this has been and continues to be the case for....basically everyone who isn't white, and only out of touch leftists who have never had their rights questioned could have such a stupid take.\n\n  \nThey promptly perma-banned me.", "label": 1}
{"text": "I am a gay man in the UK.\n\nThe UKs anti gay legislation section 28 was only repealed in 2000.", "label": 1}
{"text": "wtf nigga I barely comment in this sub wtf you on", "label": 1}
{"text": "Bruh I can’t speak my mind holy fuck lol if yall don’t agree guess what DONT LISTEN. I’m speaking my mind and feelings stop getting mad little nigga", "label": 1}
{"text": "Oh I'm sorry, are you gatekeeping oppression?", "label": 1}
{"text": "I never said that. My original comment I was talking in first person. I said I wouldn’t vote. I came to the realization that I why voting because I been told and once again neither candidate talked about the issue that affect black people and neither had solutions so NO you won’t get my vote.", "label": 1}
{"text": "History has already been rewritten, that’s the problem. These conservative white men believe in fairytales, because they were spoon fed to them as children. \n\nTruth and honesty need to make a fucking comeback.", "label": 1}
{"text": "Are you saying gay people can't be black?", "label": 1}
{"text": "That is crazy. Her pole text certificate was from 1960! I was born in 1978; not even a full generation after that my parents were born in 51 meaning when they were children, this was still going on. It’s eye-opening to realize that history really isn’t as, ancient as they are trying to make us believe", "label": 1}
{"text": "We took my Grandfather to a Father’s Day meal about 7 or 8 years ago. I was there with my wife (white) and our kids who are 1/4 but basically look white. We rarely discussed race between my wife and kids.\n\nWe were waiting a long while for our table so they opened up a new section in the restaurant where they seated us. When we got there my grandfather looked around and threw a fit. He yelled at our waitress and demanded we be seated in the part of the restaurant with everyone else.  We told him to calm down and they acquiesced giving us a new table.\n\nA little later my grandfather began to apologize profusely and told a story of when he was a young boy and him and his father had finished work and went to a restaurant to eat afterwards. The restaurant got full and they told my grandfather and his dad to leave so white people could sit. His father refused to finish until they were done, and he witnessed a group of white men take his father outside and pistol whip him, beating him within an inch of his life.\n\nMy wife was from Canada and unaware of the brutality people faced on a day to day basis. My kids were 5 and 6, and they still remember that to this day.", "label": 1}
{"text": "I believe you random person on a dogshit platform who can't fucking type.", "label": 1}
{"text": "Wow.\n\nSo. I can't be black and explain my lived experience of bigotry in the UK.\n\nI can only be gay OR black.\n\nYou are insane.", "label": 1}
{"text": "I never said don’t get an abortion. Idc what you do with your dead baby. This all started as a don’t damn one side without damning your own cause they both are bullshit, eat the fucking kid for all I care.", "label": 1}
{"text": "This thread isn't yours.\n\nYour bigotry is fucking wild.\n\nEnjoy your downvotes.", "label": 1}
{"text": "Cant answer?", "label": 1}
{"text": "Ugh great bud", "label": 1}
{"text": "Parents??  There is STILL an all-white segregated high school in Calhoun City, MS. Today. October 26th, 2024.", "label": 1}
{"text": "Madison Square garden is holding one tomorrow.", "label": 1}
{"text": "It’s a non white humans luxury beverage.", "label": 1}
{"text": "This sub is intended for exceptionally hilarious and insightful social media posts made by black people. To that end, only post social media content from black people.\n\nDo not post content just because a black person posted it.\n\n* No low effort/shit posts.\n\n* No original content\n\n* No posts from meme/corporate accounts\n\n**Violation of this rule will result in your post being removed and repeated offenses may lead to you being banned.**", "label": 1}
{"text": "Why you would date these men in the first place is beyond me. Dick can't be that good.", "label": 1}
{"text": "Ask him if he remembers who he was before he joined a cult.", "label": 1}
{"text": "I think we might be forgetting that some of these women legitimately cannot afford divorcing their husbands. Obviously not the case for each one but we shouldn’t put them all in the same category", "label": 1}
{"text": "But you’re not smart enough to use a comma.", "label": 1}
{"text": "Trumps views on women are questionable, and the border crisis is a mess and has failed further under every administration including his, Trump might not be the ideal president but trump isn’t racist", "label": 1}
{"text": "Take a step back and think about what you’re saying. Keep twisting your tinfoil hat; you’re being manipulated.", "label": 1}
{"text": "That's kidnapping and the father could have you sent to prison for that...", "label": 1}
{"text": "You’re lookin awful sus rn. She’s voting to help those issues you claim to care about.", "label": 1}
{"text": "You come off as disingenuous. She’s voting for your interests. You’re coming for as a troll my dude.", "label": 1}
{"text": "Found the cybercuck", "label": 1}
{"text": "I realize you  haven't passed 1st grade but thats an opinion. You can hate all you want. You are Still a poor bitch", "label": 1}
{"text": "I do in fact believe you are a troll. 100% you are trolling for an emotional response to this woman’s story to make it less appealing.", "label": 1}
{"text": "If your stuff smell that bad then please do. Otherwise wipes work just fine", "label": 1}
{"text": "I’m saying that being an ally can cause women to stay single and they need to be okay with that not that they should get a pass for marrying racist. I’m saying that they *shouldn’t* marry racist but we also shouldn’t promise them that they’ll find this mythical egalitarian white man that doesn’t exist. This also doesn’t just apply to white women I’m literally mixed and where I live you still are gonna be hard pressed to find a non conservative man of any race so I advocate for the de centering of men and staying single if you live in area like this", "label": 1}
{"text": "Kat Williams was right! They are the devil, plus they need to learn how to cook 😂", "label": 1}
{"text": "Okay cool open racism is allowed on this subreddit", "label": 1}
{"text": "Ah yes very rich person Danica Patrick is shockingly voting republican all white women are evil race politics are holding back black people", "label": 1}
{"text": "The opinion of a troll means nothing to me.", "label": 1}
{"text": "Says a troll? Oh no. A troll said that to me.", "label": 1}
{"text": "Yes. You are trolling using race as a tool to divide. You do it a lot according to your comment history, and I 100% believe that’s your only goal.", "label": 1}
{"text": "Uh huh. I’ve read your comment history. I know what I seen. You race bait.", "label": 1}
{"text": "Yes and the GOP does a good job at accessing Vietnamese trauma via the war using certain key terms.", "label": 1}
{"text": "#Let RFK in the White House and he’ll help is that need affordable healthcare. Harris sure ain’t gonna do it. If she was she would have ANYTIME in the last 4 years.", "label": 1}
{"text": "You know what you do. Hopefully those reading this can too. What this woman did is a good thing that you want to not be seen as such. I’m glad she’s voting blue.", "label": 1}
{"text": "It's like printing money. Can't say i wouldn't consider it if I were a has-been like this lot.", "label": 1}
{"text": "lol the racism", "label": 1}
{"text": "Ugh that is Susan Collins (R). I don’t see her as a sucker, she’s always been complicit in the MAGA slop. \n\nShe claims to be pro choice just to appear moderate, but it’s a grift. She confirmed Brett Kavanaugh because “trust me bro, Republicans won’t ban abortion” and they immediately overturned Roe v Wade. Republicans are just lying scum bags. \n\nRepublicans = national abortion ban no matter how many times they lie about it.", "label": 1}
{"text": "Go live in the shower. You apparently need it", "label": 1}
{"text": "And I’ll get crazy right along with them if they bring that shit to me.", "label": 1}
{"text": "Literally the worst NASCAR driver of all time. She was a diversity hire, which Republicans hate. A self loathing woman through and through. I find it astonishing that women support DJT. I also don't understand why people are so against abortion. It's highly illogical.", "label": 1}
{"text": "The fact that you need \"game\" proves my point.   \n  \nAny unattractive woman can get laid, they dont need \"game\".\n\nOnly men need \"game\" when they dont have looks, personality or money.\n\n  \nMen have to work harder when they dont have looks, but women don't have to.", "label": 1}
{"text": "This niggaahh be trippin y’all vote trump", "label": 1}
{"text": "lol, nice", "label": 1}
{"text": "What if any of the policies mentioned in your little article, will limit the inherent rights of black people?", "label": 1}
{"text": "Under his eye", "label": 1}
{"text": "\"Bernie Bros voted for Trump\" is absolute horseshit. Most voted for Hilary, a few wrote in Bernie, and Hilary won the popular vote by millions.", "label": 1}
{"text": "Just stop. You're never going to have 100% of any demographic vote Democrat. Let's not make divisive arguments about white versus black that relies on individual Twitter posts to fan these flames.", "label": 1}
{"text": "stfu", "label": 1}
{"text": "Shes a traitor", "label": 1}
{"text": "Never talk about gay issues again.", "label": 1}
{"text": "How are they “protecting their whiteness”?? They are white no matter who’s president?", "label": 1}
{"text": "Can’t “hang when talking about real sht”?   What real sht makes them not be able to hang? What do they do? Walk off? How can somebody not be able to hang?", "label": 1}
{"text": "SMH.", "label": 1}
{"text": "Haha I’m totally all for black lgbtq and white lgbtq fighting each other", "label": 1}
{"text": "Homophobes 😉", "label": 1}
{"text": "Your mama loves it. Go live a real life. I can’t help you smell so NSF you think everybody smells as bad as you", "label": 1}
{"text": "Why did black people get to be the watermelon lovers? I’ve never met anyone that didn’t love watermelon. It’s like when someone has jerky, you’re gonna have some.", "label": 1}
{"text": "When they're in the camps you you they'll want sympathy.", "label": 1}
{"text": "They were also the reason for the destruction in Tulsa Oklahoma and the killing of Emmitt Till and so on.", "label": 1}
{"text": "Ew", "label": 1}
{"text": "As a libertarian, I can confirm this. We're mostly in on the joke and will be fine regardless of the outcome of the real election.", "label": 1}
{"text": "Plz vote trump ppl", "label": 1}
{"text": "You voted for the Indian who slept her way to the top?", "label": 1}
{"text": "If I see Mufasa one more time I will tweak", "label": 1}
{"text": "Why are you all so pressed bro?", "label": 1}
{"text": "White lids and blackface: like a moth to a flame", "label": 1}
{"text": "Hilarious tbh", "label": 1}
{"text": "These two lesbians think they’re the Jews for Nazis people and they will be spared. News flash: they won’t", "label": 1}
{"text": "Haha I love being white", "label": 1}
{"text": "Yeah reminds me of this one i saw earlier and like yikes \nhttps://www.reddit.com/r/GuysBeingDudes/s/X3Hia9iEp3", "label": 1}
{"text": "They’re not though? And this mentality only perpetuates that division that could possibly give “them” power. “*Them*” being all the non-POC that would feel emboldened by reading this type of comment.\n\nTime and time again we’ve seen stupid little shits like this face the consequences for their actions. Of course, not all of them feel that the same way. But the fact this picture has gone viral with millions and millions of views? Another drop in the milk bucket.", "label": 1}
{"text": "That’s hilarious !", "label": 1}
{"text": "face paint? HATE. HATE. HATE. HATE. HATE. HATE. HATE. HATE.", "label": 1}
{"text": "Are you being serious? Meeting at work got canceled, so I have a few hours to bullshit.", "label": 1}
{"text": "I don't think the guy who dressed up as a rapper for halloween hates black people", "label": 1}
{"text": "I just scrolled to see what this sub had to say about Diddy and how fucked up that dude is. Crazy, stopped scrolling after the top ~150 posts from this year…not one. But two dipshits try and be funny and blows up. Fuck these two kids but I hope Diddy and all his party friends burn in hell. Fuck this sub", "label": 1}
{"text": "It's all white people.  I live in a poor town.  Went to a costume party at a bar on Saturday.  White lady in full redface with a feather in her hair and a leather shirt pretending to be native American.", "label": 1}
{"text": "Blame online black people for not taking it seriously in the first place. When it first dropped all people were doing is making gay/homophobic jokes and straight up shitty memes about the victims. This is the result of it. Other communities are now joining in on the “joke”", "label": 1}
{"text": "Racism is profitable these days. ", "label": 1}
{"text": "As it shouldn't, dude has a funny costume get over it", "label": 1}
{"text": "At this point, it’s intentionally done to piss people off and troll.", "label": 1}
{"text": "If he gets kicked out of school I guess he can work at his dad's yacht dealership law firm.", "label": 1}
{"text": "The sad thing is it may not hinder his future.", "label": 1}
{"text": "Why would the NFL even allow that to happen? They should suspend him indefinitely.", "label": 1}
{"text": "The debate about voting methods and election security is always heated. You're right; voting via phone or email would make election fraud easier, and a paper trail is essential for verifying votes. The FBI and other government agencies have expressed similar concerns about online voting, emphasizing the importance of securing our democratic processes .", "label": 1}
{"text": "Modernizing the voting system is crucial, but we must ensure security and integrity. A digital system should be reliable, transparent, and accessible while safeguarding against fraud.", "label": 1}
{"text": "A thought-provoking perspective! This highlights the complex interplay between ideology, power structures, and social justice. Your assertion sparks important discussions on: 1. Defining right-wing and left-wing ideologies. 2. The relationship between hierarchy and equality. 3. Addressing systemic racism and promoting racial equality.", "label": 1}
{"text": "this is easily the most pathetic collection of people on reddit, when kamala loses, the only silver lining will be people like you guys crying and whining because they’re rhetoric of “your a piece of shit unless you agree with everything i say” lost you an entire generation. thanks for fucking my country up guys :)", "label": 1}
{"text": "I thought that was Christina Applegate", "label": 1}
{"text": "Reported for hate", "label": 1}
{"text": "She must rob women cause no fucking way is a lesbian robbing me.", "label": 1}
{"text": "Christina Applegate", "label": 1}
{"text": "This grass ended racism", "label": 1}
{"text": ">end racism\n>blackpeopletwitter\n\nredditors are so fucking stupid its ironic", "label": 1}
{"text": "Damn I wonder if he knew people were gonna take it so out of context and get so butthurt (sorry for the ‘SA’ terminology). I wonder if this was orchestrated to really show how the left is so far removed from normalcy they can’t even take jokes anymore.", "label": 1}
{"text": "Racist piece of shit", "label": 1}
{"text": "imagine being so emotionally-controlled, that you call an event a \"klan rally\" because of a couple of lame jokes.", "label": 1}
{"text": "Ok racist piece of shit", "label": 1}
{"text": "Why am i racist?", "label": 1}
{"text": "Because you had to ask", "label": 1}
{"text": "Nice. Inside China track for our next VP, that will be helpful in negotiating. And I didn't think I could like Walz anymore than I already did.", "label": 1}
{"text": "Why can't i ask?", "label": 1}
{"text": "Beg someone else for attention", "label": 1}
{"text": "There’s also the  \\_RA.\n\nNot the NRA.\n\nUse your powers of deduction and seek them out.\n\nThey’re on Reddit and they have a website.", "label": 1}
{"text": "Dad's around atleast", "label": 1}
{"text": "What’s your point?", "label": 1}
{"text": "I think it’s [this](https://www.reddit.com/r/TikTokCringe/s/VNQq54zLDc)", "label": 1}
{"text": "Actually, they’re up to 6 and counting. \nhttps://www.tiktok.com/t/ZTFphrrER/", "label": 1}
{"text": "How can you call out racism while being racist… that is my point…", "label": 1}
{"text": "Lol I mean I’m not black and we all know exactly what this look is. That statue is horrendous 😂", "label": 1}
{"text": "Is racism going to be ended by a message on a football field? Its pure virture signaling. Why not put a sign that says \"Hitler was bad\" next to it too. Call anyone that doesn't like it there a Nazi.", "label": 1}
{"text": "I hate when y’all show up here.", "label": 1}
{"text": "Bot", "label": 1}
{"text": "Chill lmao. They weren’t even saying anything weird or rude, God forbid a white person *ever* comments something lighthearted on the BlackPeopleTwitter subreddit 😱😰\n\nIt’s giving racism", "label": 1}
{"text": "Are you one too?", "label": 1}
{"text": "lol @ “racism”! Stop.", "label": 1}
{"text": "Horrible", "label": 1}
{"text": "I genuinely cant tell if you're actually this retarded or just egging me on. Either way I see that I'm wasting my time. Good luck in life man.", "label": 1}
{"text": "Aight, come on. “Racism”? It’s giving “racism”? BFFR, like if anything it’s wildly ironic but also totally expected that most members of r/BlackPeopleTwitter are actually white😭🤦🏾‍♂️\n\n![gif](giphy|y2i2oqWgzh5ioRp4Qa)", "label": 1}
{"text": "You drama queens are just proving my point lmao", "label": 1}
{"text": "Definitely a #FFFFFFF", "label": 1}
{"text": "Aight then.👍🏾", "label": 1}
{"text": "Yoooo. 😭", "label": 1}
{"text": "Well at least he ain't a deadbeat like most.", "label": 1}
{"text": "![gif](giphy|9vxmXkENhJsQAJKFAs|downsized)", "label": 1}
{"text": "Gotta add it to the collection. Thanks. 🙏🏿", "label": 1}
{"text": "Maturing is realizing adults use Android and Children use apple", "label": 1}
{"text": "And this is clearly a topic they can’t even relate to, but here they come in the comments stinking up the place. We have to do better at keeping things to ourselves.", "label": 1}
{"text": "Talking constantly about race and asking everyone their race when filling out basic paperwork, also woke left", "label": 1}
{"text": "Gotta love casual racism", "label": 1}
{"text": "Yeah if he was in an all white suit, that would say Diddy more", "label": 1}
{"text": "They didn’t make their own games though, they shoved their own ideals and preferences into already established franchises.\n\nThe few games they DID make entirely on their own have, for the most part, totally flopped.", "label": 1}
{"text": "KKK = Democrats", "label": 1}
{"text": "Geez, they were jokes. People take themselves so seriously these days.", "label": 1}
{"text": "Will we really be mad if we blackface P. Diddy though?", "label": 1}
{"text": "leftist strategy 101 make your slogan something nobody could disagree with then after the meanings of the words in the slogan to win arguments as appropriate.\n\n\nthe woke left redefined racism in multiple ways a long time ago.", "label": 1}
{"text": "source?", "label": 1}
{"text": "After a mf point a gun at me once, the second time he’s gotta die. Four or five times? This mf must be stupid.", "label": 1}
{"text": "Seems like a complete emotional response and hate for people who don’t think like you… which I guess actually would make complete sense.", "label": 1}
{"text": "I agree. I can’t stand John Kennedy (D) founder of the KKK and Jefferson Davis (D) President of the South during the civil war. Democratic Party storied history of supporting white supremacy I can’t stand them either.", "label": 1}
{"text": "I gotta tell you as a white guy. It’s only a better legal system if it’s against a black person. Otherwise it’s the same shit system we all get caught up in. If you’re wealthy? Color doesn’t matter. Money does. \n\nBut why isn’t this a major news story?? These cops are worse than Uvalde. They admit they screwed up, then just said, “yeah, let’s put this guy back in his house so he can finish the job”. So they don’t have to paperwork or whatever .", "label": 1}
{"text": "See, the thing is, it isn't. Racism is prejudice based on race, full stop. The woke left added \"disparate outcome, regardless of cause\" and \"prejudice plus power\" as definitions a long time ago. Its your retarded dialectical strategy to bring about the communist revolution along new axes of identity besides class. Like all communist efforts, it just sows confusion, discord and injustice.", "label": 1}
{"text": "you don't know your own intellectual lineage then. social justice le f time comes from postmodernism and critical theory, both attempts to describe the world in the wake of the failure of Marxism. disparate outcome is a clear way of waying what is meant when terms like \"systemic racism\" are thrown around. ", "label": 1}
{"text": "“Both sides”\n\nVoter apathy is pathetic in this country \n\nWe could literally fix so many problems if people actually fucking voted instead of complaining and wanting a perfect candidate", "label": 1}
{"text": "He was arrested 24ish hours ago. But rage is fun I guess", "label": 1}
{"text": "...*blinks in southern Europe* I get \"where my hug at\"... I think? But someone please explain the daughter part D:", "label": 1}
{"text": "Just out of curiosity: Would it be OK for a white dude to wear this? I'm guessing the answer is no.", "label": 1}
{"text": "But George floyd deserved it unlike this guy", "label": 1}
{"text": "White : no\n\nPoor : why not ?", "label": 1}
{"text": "Why do they keep coming with black face but will go insane if called racist?\n\n![gif](giphy|IorAqDrjKiDcc3QdN3|downsized)", "label": 1}
{"text": "didndu nuffin", "label": 1}
{"text": "I’d argue that history has a long history of people taking people’s credit. With USA being majority white, the actual numbers of white credit-takers will increase with respect the population size. \n\nI just don’t think it’s something about being white that makes you take credit. Source: am white and do not take credit for other people’s shit. I have hard enough times taking credit for my own shit. \n\nI understand your sentiment, but don’t think race has anything to do with the default selfishness of humans.", "label": 1}
{"text": "It’s 100% both but it seems cultural for white people at this point to where it’s expected behavior so much so that you have an entire thread commenting on it and tons of historical anecdotes available to back it up.", "label": 1}
{"text": "FOH, can’t even spell the meme correctly 🤣", "label": 1}
{"text": "I don't trust them people unless I'm paying them or a POC I trust vetted them. They asses will stab you in the back and ask where you got the knife.", "label": 1}
{"text": "Why did the democrats kick Matt Walsh out", "label": 1}
{"text": "This sub being a racist shit hole as always. ", "label": 1}
{"text": "This is a shitty co-worker problem, not a white woman problem, lol.", "label": 1}
{"text": "Show me one place on earth where a minority isn’t oppressed. That’s my point. \n\nThe point is that it’s more of, when a human gets an opportunity to be selfish, such as having a majority advantage, the can display very selfish behavior. Humans tend to be selfish. \n\nI don’t see what you are saying as you disagreeing with me. I also don’t think this is an “all lives matter” defense. I’m fully acknowledging minority oppression/exploitation.  It’s just not a thing specific to white people. Saying it is rings funny to me. \n\nUSA has, like I said, a high number of white credit-takers based purely on population demographics.", "label": 1}
{"text": "I feel like I answered it properly the first time, but [did elaborate on the is position here](https://www.reddit.com/r/BlackPeopleTwitter/s/nLHSJZLgbE). \n\nTLDR of course a majority group will express selfishness at a higher and more visible rate.", "label": 1}
{"text": "You ate so right. My neighborhood is VERY blue, but we have one Trumper, and he's a cop. Interestinly/ironically, our neighborhood was flooded with KKK flyers about a week ago. I'm pretty damn sure it was the cop.", "label": 1}
{"text": "I feel like I answered it properly the first time, but [did elaborate on the is position here](https://www.reddit.com/r/BlackPeopleTwitter/s/nLHSJZLgbE). \n\nTLDR of course a majority group will express selfishness at a higher and more visible rate. There is nothing white about that. It’s just white like that here with the majority population. I’m not disputing anything you’re saying, per se. I’m making it clear that this is a stats thing and not a race thing.", "label": 1}
{"text": "I can’t help you. To be honest. You seem hellbent on the race card here. To me, you’re the one with the bias. I’m actually agreeing with you up to the point where you nose dive for me.", "label": 1}
{"text": "Holy shit. Now I’m the oppressor. \n\nYou really are being racist lol. Good day, sir.", "label": 1}
{"text": "I said you seem like the one with the bias. \n\nThen, you said you don’t know what to tell me, that often the oppressors feel like the oppressed. \n\nI understand that to be you deflecting my point by saying it’s because I’m an oppressor. I perceive that to be a shitty statement, in this thread you responded to, I originally stated I’m white. \n\nYou suck at communication or you are being obtuse.", "label": 1}
{"text": "Just your daily dose of casual racism over at r/blackpeopletwitter", "label": 1}
{"text": "Captain deflection\n\n“It’s not me, it’s you”\n\nAlright. What’s funny to me is that I’m in agreement with you up until you lose logic.", "label": 1}
{"text": "Gotta love how white people arr just supposed to sit back and take casual racism like you wouldn't be upset if someone used their bad experience with a single black coworker to make blanket statements about black people as a whole", "label": 1}
{"text": "Imagine a white person saying the won't trust a black worker unless they've been vetted by another white person like do you even hear yourself", "label": 1}
{"text": "r/WhitePeopleTwitter may be more to your liking.  You’re just here for the tap dancing.", "label": 1}
{"text": "Well at least iver there they don't use single bad experiences to cast a negative light on an entire race. If someone posted on that sub that you shouldn't trust black coworkers bc of one bad experience with a black person they would be insta banned this sub just allows literal racism every single day", "label": 1}
{"text": "Being racist isn't defending yourself from racism", "label": 1}
{"text": "Yes the tweet is about a single bad experience", "label": 1}
{"text": "They are literally saying an entire race of people isn't trustworthy bc of one bad experience. It's by definition racist. You'd get banned from most subs for saying this stuff about any race but it gets a pass here", "label": 1}
{"text": "Im not angry at the original post or the general ideas being tossed around here…but it comes from a lot of the same old arguments. White people also go through this, the ones who get defensive only look at that and don’t look at the years of evidence and institutionalized racism that has led to black people going through stuff like this at disproportionate rates. Having critically looked at the world around me I can see the merit of the complaints. I will say that when white people (particularly uneducated and ignorant ones) are called out for this and have also gone through it, it can make them feel alienated and attacked which drives division. It’s not the black community’s responsibility to be patient or anything, I just wish there was a better way to come together and have discussions, which is one of the only reasons I participate in this predominantly black community. Plus it’s funny as fuck sometimes.", "label": 1}
{"text": "Of course there is. You don’t get it. I fully agree you would find that with something like with demographics and population breakdown. Similarly, in some country like Iran there is a foreign national working and having their credit taken by their boss or coworker. \n\nSimilarly, in reverse, there will be some situations where I member of a minority group _may_ be able to take credit, but would be difficult due to the follow on conversation on racism. \n\nI hold the same/similar stance on racism, that X% of all humans are racist and racists operate mostly in the grey zones where they can make judgement calls and not be called out. For example, racist cop sees black guy doing 2 mph over the limit and decides to make that a ticket. Then, he just says “I smell drugs” and uses that to flip the car inside out and see if there is anything else to jam them up on. Then, racists can point back at stats and say “murr but black crime” while not acknowledging or understanding that racist cops exercising their “judgement calls” to the fullest extent have padded those stats and it becomes a “one hand washes the other” game. \n\nSo, in full. Humans are selfish and generally fucked up at a default level in many ways. They are inherently selfish. The selfishness and any race related through. It’s self related. They take credit for anything that promotes self. It’s not about race. \n\n\nThen, there is racism and hatred which majority opinions push in their favor. \n\n\nI’m typing fast and hope I didn’t mistype anything here, but my view is that the credit taking is a part of human selfishness and not race related.\n\nThen there is also racism, which fucks with isolating stats for discussion like this.", "label": 1}
{"text": "Right, again my point still stands. Your blanket statement that “you can get fired for not showing up to work” is not entirely true since there are laws like FMLA that protect workers from it. \n\nWhether is paid or unpaid doesn’t matter.", "label": 1}
{"text": "This sub is racist as fuck man. Low down.", "label": 1}
{"text": "And it's racist to do so, which is why the person I responded to is also a racist", "label": 1}
{"text": "you truly can't trust these crackers and hoes", "label": 1}
{"text": "You're encouraging people to think critically about the world around them, to take the time to learn how to research things, and then go through the stages of researching something properly?     \n     \nFrom what I've seen working with the general public, you are beyond optimistic.", "label": 1}
{"text": "I get surprised how many people still buy this VOTING joke. There is no choices in this country. It's pathetic.", "label": 1}
{"text": "No one said selfishness is explicitly race related. I said that in my response. The problem is that one demographic has the privilege to exploit their selfishness at a far greater clip. There're countless examples that POC have in their everyday lives that are synonymous with the post these comments fall under throughout this country's history. You can scroll and see testimonials yourself. They range from harmless to life altering. \n\nMy point is that your concern should not be that humans are selfish at their core - we know this. Your concern should be that there are those who have the privilege to leverage their social standing, often race related, within society to exploit another. Selfishness is inherent, yes, but the problem is exploitation and the privilege to do so.", "label": 1}
{"text": "Anything to divide us. This is a photo represents hope no matter your race. No person is perfect, but framing this in such a way only makes for division, of a very specific, and important voting block. It’s a distraction from the modern rebirth of fascism. This is your year women. You will almost certainly decide this election. Use your power, and make the change you, and your children deserve.", "label": 1}
{"text": "Enjoy while you can before a mod finds issue with this post somehow", "label": 1}
{"text": "Y’all so fake deep", "label": 1}
{"text": "I'm going to randomly ask a question cause I keep seeing the term used. someone said it but I didn't want to ask them for reasons.\n\nwhat's a hotep?  and is it a term I should not use cause it feels like a term I should not usem", "label": 1}
{"text": "way to miss the point idiot ass nigga🫠", "label": 1}
{"text": "nobody tell him mexico is way, WAY more racist than the US, especially against darkies", "label": 1}
{"text": "The MPD would love to pass it off to the feds. They’re under intense scrutiny and are scared to do their job. If they harm or kill a suspect during apprehension there will undoubtedly be an uproar in the community. Since when do the police wait outside the home of a violent criminal who has shot someone instead of surrounding the building and demanding surrender? The MPD won’t do their job properly for fear of community backlash and would love to pass of the situation.", "label": 1}
{"text": "Um I feel bad for you. You really think Trump and Kamala are on opposite sides. I'll keep silent and when you wake up, you'll remember me.", "label": 1}
{"text": "Keep telling yourself that. You're in THE HUNGER GAMES. We're the fools in their games. What will make everyone see this.", "label": 1}
{"text": "Lack of grammar?", "label": 1}
{"text": "Hope they beat the shit out of him in jail", "label": 1}
{"text": "Plant for sure", "label": 1}
{"text": "Stop being a victim, you or yall have no more privilege than majority of whites have. It’s an ideology that the government is placing in your minds, once you wake up and decide I’m no longer going to be a victim, you don’t see hate or race. There is a reason the left continues to talk about hate out race in everything, they know it triggers yall. We are 1 race, we are the human race and the quicker you realize that and realize white people don’t hate you, you’ll feel more free than anything.", "label": 1}
{"text": "I thought they caught that guy quickly and it turned out he just wanted to get arrested because he's a total nutjob?  Or am I losing track of how many fires were set in AZ", "label": 1}
{"text": "Life without the possibility of parole!", "label": 1}
{"text": "Typical r/conservative poster", "label": 1}
{"text": "He set fire to a normal mailbox because he's a nutjob with a record of doing similar shit, it wasn't politically motivated.  He was caught like a week ago.  This tweet stirring misinformation isn't any better just because MAGA bad.", "label": 1}
{"text": "I still hear people using the r word and I'm like fam what year is this?", "label": 1}
{"text": "Majority of (r)etards are felons, \n\nFelons that can't vote", "label": 1}
{"text": "If your vote mattered they wouldn’t let you do it.", "label": 1}
{"text": "I am too but, she is learning and accepting kinda whereas, I will fight you. Had someone tell me \"we don't say that anymore!\" I replied \"That's cause you're retarded too.\"", "label": 1}
{"text": "Oh it's the same, anyone who's going after the so-called white privilege stuff is considered \"they\" here. Your comment is literally useless to my original comment.", "label": 1}
{"text": "Because its not Him. The post is a misinformation...", "label": 1}
{"text": "Why is he typing like a caveman", "label": 1}
{"text": "To anyone who wants to die on this hill - this is the kind of shit right wingers, racists and ableists have been saying this whole time.\n\nWhat value does talking about people like this bring to your life? Telling someone to stop being soft isn't toughening them up, it's continuing oppressive behaviour.", "label": 1}
{"text": "If I brought my Asian girlfriend, would it be okay then? Or is this strictly limited to white people?", "label": 1}
{"text": "I don't even know why I bothered voting if both sides are fudging numbers, and the citizens are burning ballots. Our votes no longer matter. They aren't counting them anyway.", "label": 1}
{"text": "I worked at a nonprofit in San Francisco that had a mostly black staff. My program director got into a motorcycle accident and a Becky took over. She didn't tell us she was the program director until three months later after we started telling the executive director that our clients were commiting suicide and assaulting staff. We were tired of how crazy it got so I called him and told him we needed leadership. They never told us someone else took over the role. Nor did she reach out.\n\n\n\n\nWell her and the therapist of the same color got together to get my fired. They gathered my personal social media and said I was talking about my job and discussing social worker business. When I received the termination letter. It was dates of videos that didn't exist.\n\n\nMind you the therapist told a client to talk to a social worker and make up ish about me. \n\n\nWhen I got fired. I talked to my elders and aunties and all of them had similar stories. ", "label": 1}
{"text": "I would agree with this if they were realistically counted. But when the government itself is fudging the numbers, do you really think they care what the actual ballots say? I seem to remember dead people voting last time.", "label": 1}
{"text": "https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/", "label": 1}
{"text": "It is not wise for a person to blindly trust any ally.\n\nBut in my experience it is particularly important for black people to be circumspect about the promises of white allies.  \n\nThe painstakingly slow pace of incremental change is NOT an accident. \n\nWay too much water under that particular historic bridge.", "label": 1}
{"text": "Sounds about white to me", "label": 1}
{"text": "Funny That’s what Ike turner said to Tina", "label": 1}
{"text": "It's so dumb, but what can I say other than skinfolk ain't kinfolk. ", "label": 1}
{"text": "Have you tried Africa?", "label": 1}
{"text": "First, we would need to repeal the 19th amendment", "label": 1}
{"text": "You should walk through Chicago at nights with that shirt", "label": 1}
{"text": "I don't care what black people think, non-factors except for crime statistics.", "label": 1}
{"text": "Typical apes", "label": 1}
{"text": "What is the benefit of black women voting?", "label": 1}
{"text": "In case you want to know what real violence looks like", "label": 1}
{"text": "Ahhhhhh SHE'S NOT BLACK!!!", "label": 1}
{"text": "Well..i guess you've done the shitting your pants and being a retarded person research..i guess you win, sir.", "label": 1}
{"text": "Mission accomplished", "label": 1}
{"text": "Kamala got the courage of a hood rat and the smarts of a smelly Indian whose only life is work 😂", "label": 1}
{"text": "The OP writes black women were barred from voting. Didn’t some states allow them to vote? I thought poll taxes and literacy tests were primarily in the southern states.", "label": 1}
{"text": "THE NAME OF THE SUB IS BLACK PEOPLE TWITTER HE DIDNT SAY THE N WORD YOU CALL US WHITES WHATS THE DIFFERENCE", "label": 1}
{"text": "I was born in Jackson, I have full citizenship. Just trying to help some redditors out. Some of you dudes are completely brainwashed. Kamala the prosecutor may share your ethnicy but look at what she done to your people.. Ms. 3 strikes. Ms. Death sentence. I'm just asking you all to do your homework and vote for who works for you rather than being brainwashed by horrible yt commercials. She's a turncoat. If Trump ran for leader of the western world (if that was a thing) he would be a top 5 option for me. In the US he's the only option.", "label": 1}
{"text": "Ahhhhh THIS ONE!!!!  YOU MIGHT WANT TO FACT CHECK IT!!!!  SHE WAS ELECTED THE FIRST \"INDIAN\" SENATOR!!!  SHE TURNED BLACK ABOUT 6 MONTHS AGO!!!  LMMFAO AND SHE WAS INSTALLED AS THE DEMONT CANDIDATE!!!  NOT ONE PERSON VOTED FOR HER TO BE THE CANDIDATE!!!  FACT CHECK THAT TOO!!!", "label": 1}
{"text": "If they could read they would be very angry about this sir", "label": 1}
{"text": "Haha you all gonna cry when trumpy wins 🇺🇸", "label": 1}
{"text": "Y’all really stupid if think that’s a reason she should be voted in, I hate to say it but that’s women’s logic", "label": 1}
{"text": "Fake news.", "label": 1}
{"text": "Come back in 7 days and say I’m wrong. Going to be glorious.", "label": 1}
{"text": "The thing is we didn’t lose 2020, it was rigged everyone knows that. Trump lost by winning majority vote? Ok buddy.\nSay what you want all you woke democratic snowflakes about to be shoved aside permanently by the republican power, and watch. It’s not even about this term but everyone Trump has lined up after. It’s a republican power that’s going to take back the White House and America.", "label": 1}
{"text": "You MORONS brought them in with BUSES!!! They are PAID attendees!!! \n\n![gif](giphy|KVDpqMY28c2M40hRIp|downsized)", "label": 1}
{"text": "Imagine wanting someone to die because of their political opinion. So much for you guys being the “party of tolerance”", "label": 1}
{"text": "May the best person win. No animosity here.", "label": 1}
{"text": "LOL.\n\nTrump lies every time he opens his mouth.", "label": 1}
{"text": "Vote Trump..  Kamala and Walz = 4 more years of this pain she could have fixed all along", "label": 1}
{"text": "Oh the irony", "label": 1}
{"text": "The deck of that article literally states, *\"If Trump wins the popular vote and loses the election, it could fuel a new bipartisan movement for reform.\"* The NYT article linked by Politico, is also cheating slightly (by excluding third-party candidates) to make the numbers even. Using that same data, the [NYT](https://www.nytimes.com/2024/10/25/upshot/poll-trump-harris-election.html) reported that Trump has a 1% lead. He's also had the lead in every poll they've [taken](https://www.nytimes.com/2024/10/25/upshot/poll-trump-harris-election.html). The only time Harris has shown a lead was in the early October poll. And the NYT/Sienna is just one poll. Other publications are showing a clear lead for Trump like the [WSJ](https://www.wsj.com/politics/elections/trump-leads-harris-wsj-poll-779f8516?mod=e2twp) with a 3 point lead for Trump, or [CNBC](https://fm.cnbc.com/applications/cnbc.com/resources/editorialfiles/2024/10/24/CNBC_All-America_Economic_Survey_Q3.pdf) with a 2 point lead for Trump. \n\nWhether it happens or not, all major prediction models have a Trump popular vote win but an electoral college loss as a real possibility, which is a vastly different landscape than 2016 when he had no chance of winning the popular vote.\n\nIt's also important to note that pollsters have shown time and time again that they undercount Trump voters. As reported by the [Economist](https://www.economist.com/united-states/2024/10/29/how-wrong-could-americas-pollsters-be), there were \"substantial polling misses [in] 2016 and 2020,\" and while there were significant efforts to remedy it, they at least failed to do so between the 2016 and 2020 elections and there's a good chance they could have erred for the third time in a row. \n\nI think the strongest evidence though is how Harris and Democrats have been forced to adopted so many of [Trump's policy positions](https://www.economist.com/leaders/2024/10/10/the-trumpification-of-american-policy). Without this rightward shift, Harris would be lagging extremely far behind Trump, both in the popular vote and the electoral college. At the policy level, Trump has already won. President or not, many of his positions now have bipartisan support and will be passed.\n\nSticking your head in the sand does not make the problem go away. Outside of leftist echo chambers, Trump and his policies are popular while Democrats are decidedly not. The only reason this race is as close as it is, is become Trump is his own worst enemy. Anyone with his positions and a modicum of self control would be stomping this election. The huge swing right and the even greater anti-left backlash we've seen globally is clear proof of this trend.", "label": 1}
{"text": "Trump for president", "label": 1}
{"text": "I could care less about politics so I don’t watch her for the political views, but I do get to see the video edits other people make of her where she loves to say that she comes from a middle class home or when they count and see how many accents she makes in different speeches. There’s lots of videos that show me how much of a joke every political side is. Just like how everyone right now is so butthurt about Tony making a joke about puerto rico at a Trump rally lol. He’s literally a comedian that has a show dedicated to just roasting people and no race is excluded so he goes off on blacks too (minorities in general since people get soft). Just a joke all around lol and I don’t care to invest my time and show random people who I vote for cause no one cares. By the way politics and religion isn’t even supposed to be talked about in general but here we go.", "label": 1}
{"text": "I make one opinion on Reddit and all of a sudden just because it hurts feelings you think I’m someone that does this 24/7 as if it was a job? Lol no thanks. I actually have a real life and I don’t have the time to make “shitty” comments on Reddit. Thanks for assuming you know me but lol get your ego and feelings in check for saying all that just cause I said someone is a joke.", "label": 1}
{"text": "Hurts feelings? Now I KNOW you gotta make a friend. Go. It'll change ya sorryass life of crusty socks, talkin shit on reddit and interracial porn.", "label": 1}
{"text": "What are you even talking about kid? Lol you’re just proving my point by typing all of that lmao. And no thanks buddy I have a good amount of good friends cause we just have fun and don’t get involved in politics. Can you please provide my examples of me “talking shit on reddit and interracial porn”. At least the interracial porn part cause where I live it’s not illegal to talk shit on reddit, and if it hurts your feelings when I do it then you can simply ignore it.", "label": 1}
{"text": "Just saying how I feel kid lol. I honestly don’t care about politics so I don’t participate in it. Is it really that hard of a concept for someone to understand? Out of the almost 400 million people living in america do you really think every single person votes and cares about it?", "label": 1}
{"text": "Lmao and thanks for being racist and assuming I’m even white😂I’m actually what’s considered a “minority”, and the color of my skin on an avatar on the internet should not effect or have power to anything I say lol. My skin color in real life is simply a darker brown but I’m not necessarily a black person. I could be “black” and not be “African American” so what’s the point you’re trying to prove?", "label": 1}
{"text": "You are definitely in your right to call out bullshit as you see it, but everything I’m saying is all just my opinion. So if I was saying everything as if it was completely true then you called call it out and say bullshit you could be correct if you explain, but I’m not and everything I’m saying is just something I think and some people might agree or disagree on it.", "label": 1}
{"text": "Ah, I see.", "label": 1}
{"text": "Yeah I’m not dumb I know I post cigar pics and I still will, but I’m still not a white person just because that little portion out of my entire body happens to look like white skin. I bet if I posted my entire hand tomorrow you would still find a way to bring race back up lol.", "label": 1}
{"text": "Ok kid thanks for breaking it down thinking you figured me out😂[emoji inserted] all I said was I don’t care about her politics but it doesn’t mean that I don’t care to watch political people cause of the funny things they say or do…", "label": 1}
{"text": "Agree to disagree, but since you were all up on my avatar and skin color then I have to ask, is your skin color actually that black in real life or are you just a white dude? See how that doesn’t make sense…", "label": 1}
{"text": "Again, Ima just say what you told me “Coming to this sub with a black avatar just to comment on this when clearly you’re a white dude is insane”. Your avatar is literally a black color and you have no photos to confirm or deny it so you’re obviously a white dude.", "label": 1}
{"text": "Sum ting wong bout dis", "label": 1}
{"text": "Out of your ass typing pot stirrer, is you! You know shit, and are just as problematic as any other person typing US shit. Fucking internet idiots. Too much, cannot compute. Reddit has too many retarded persona's.", "label": 1}
{"text": "Of all the possibilities of white people that wouldn't care, the Irish seem most like they'd be the ones.", "label": 1}
{"text": "People in the UK are thrilled to make £35k, across all experience levels and trades. Absolutely insane state of affairs. It’s Mississippi with NYC stitched on it.", "label": 1}
{"text": "Why the shitty racist tone? Expectations comes forth from recognizable features, stereotypes and names. Fit into a box? Lol, the world is not getting better with people like you on board. You are likely to do the same, but the other way around. Fool.", "label": 1}
{"text": "Irish here, do NOT do that. r/Tragedeigh", "label": 1}
{"text": "very high likelihood they were all also democrats.", "label": 1}
{"text": "Built into the price of shipping, it is like the renaissance never happened in europe. Watching videos of you backward savages coming to the United States and getting their minds blown cause their preconceptions were a lie is amazinglydm dumb to see. There is more fresh fruit in a single store than there is in multiple towns in Europe put together.", "label": 1}
{"text": "I'm a Brit, and the UK doesn't receive three months of holiday.", "label": 1}
{"text": "/r/ShitAmericansSay is having a field day in this comment section.", "label": 1}
{"text": "I'm pretty sure the klan was also a Democrat origination.", "label": 1}
{"text": "The Irish were also slaves in the Caribbean along with West and Central Africans, particularly in Jamaica, St. Kitts and St. Barts under British rule. That's why Irish and Jamaican accents have such similarities. It's a combination of various African and Irish accents.", "label": 1}
{"text": "When you have nothing of validity to counter with, let alone the wit. \n/r/typicaleuropeanmentality", "label": 1}
{"text": "Americans don't fight for those things at all. When they go low, we roll over.", "label": 1}
{"text": "You're simply not worth engaging with. I bet you don't even have a passport, just like half of your fellow Americans. You've no clue how the world works, else you wouldn't comment such nonsense.", "label": 1}
{"text": "And?", "label": 1}
{"text": "You a collection of words on a website made into a app. No idea if you Irish. Don't care. So I guess real question is what's *yo* problem", "label": 1}
{"text": "That's exactly the level of unhinged I was expecting of you, gj on the delivery.", "label": 1}
{"text": "Knowing when to shut up is an incredible skill to have. You could start practicing now", "label": 1}
{"text": "Are you taking up his bet then?", "label": 1}
{"text": "What should we do differently, Lenin?", "label": 1}
{"text": "Goes to a grocery store in the United States and see every variety of mango sold in the world, harvested that week.\nGoes to see produce in Copenhagen finds one mango at your \"superburgsen\". Then, looks at the price. I think you are on drugs, mate. That is expensive for a single piece of fruit. \n\nIf you travel regularly, you would know this.\nI like the \"sourced ethically\", though, that bit is cute. You do know you are coming to the defense of a german. Ethical is not even in their vocabulary. You look up evil in the dictionary, you see a german. \n\nRipened with gas, you say? Ah, you mean ethylene gas, which is naturally produced by fruit as they ripen. Well, you are \"american,\" so the education level fits. \n\nYou are the same type of \"anerican\" that went to the side of the germans cause their family came from there. By all means, protect the bond villain, but remember you are protecting a bond villain", "label": 1}
{"text": "I had my choice this weekend of six (6) mango varieties, one (1) was a variety from Japan. I know if you are from one of those states that have nothing for miles, this is true. But for someone who says they travel, clearly does not travel. Or, at the very least is the type of person who says they have been to a place cause their plane landed there, and they had to refuel or need to go on a different flight connection. Flying is great but you miss a lot. Word of advice, plan your travels better. Add driving or walking around in-between all that. If you do travel, that is.", "label": 1}
{"text": "Cope, seethe, rage", "label": 1}
{"text": "you keep living in your fantasy. murica", "label": 1}
{"text": "Lmao says the people that get mad when their shit shows get cancelled for being shit. How’s that next season of acolyte coming along???", "label": 1}
{"text": "Tá fáilte romhat", "label": 1}
{"text": "If those American could read, they'd be very upset", "label": 1}
{"text": "Democrats were the ones responsible for the killing: https://en.wikipedia.org/wiki/Ocoee_massacre", "label": 1}
{"text": "Democrats were the killers in that massacre. Quit spreading hate. https://en.wikipedia.org/wiki/Ocoee_massacre", "label": 1}
{"text": "It was democrats who murdered them", "label": 1}
{"text": "So, you just don’t like anything to do with comedy at all? \n\nSome people take life way too seriously.", "label": 1}
{"text": "You sound so insufferable lmao", "label": 1}
{"text": "The classic “nah u jus stupid” when you have nothing of value to say and can’t answer a single question \n\nImpressive", "label": 1}
{"text": "[this one?](https://www.reddit.com/r/BlackPeopleTwitter/s/d4LW7sXpiK)", "label": 1}
{"text": "It’s p sick ngl lmao on the other hand, I’m autistic so she’s my retard handler in public when I randomly wander off and she has to use Find My to see where I went.", "label": 1}
{"text": "Man retard handler??? 💀💀\n\n![gif](giphy|RBmrwuyUuXItoSQMJX|downsized)", "label": 1}
{"text": "What the fuck happened to the English language?", "label": 1}
{"text": "Haha holy shit...", "label": 1}
{"text": "he's totally right about that, this could be the best move for a man", "label": 1}
{"text": "This sub is racially motivated lmao", "label": 1}
{"text": "The crazy part is yal saying they not Christian like this not they shit😭. Of course they are lol. YOUR blackass shouldn’t be lol. It’s the religion from when we was slaves stupid mfs😭", "label": 1}
{"text": ">Go do something else not on my phone\n\nAre you giving yourself a command here?", "label": 1}
{"text": "it's a good sign that you need to dig into my comment history because you don't have an actual rebuttal. just head back into your fantasy\n\nps league isn't an rpg, but if you try hard enough you can make a game out of the role play you're using your reddit account for", "label": 1}
{"text": "Took you six (6) hours to think of that, I am impressed. You notice the coward started deleting his stuff. He made a bet and needed to back out. Would you like to take up his shoes and ride his bet? Maybe travel outside your state for once, you know major cities outside your small town, right?\nCome back later, I'm not german, so I won't reneg on a bet and run.", "label": 1}
{"text": "If my mom hadn’t jumped across his chest to get between us I planned on killing him.  We’re cool now, he lives in a room that I let him have.", "label": 1}
{"text": "I don't understand anything you guys are talking about...  \nI go to work, where i am fucking prudictive (most of the time), then I get off work and do whatever the fuck I want. Be it play videogames, read a book, chill in my garden, or look a wall dead in the fucking eye.\n\nThe fuck do you guys mean by \"being productive\"? Is this one of those American things, where you have the be somehow making money, or trying to make more money with every breath you take?", "label": 1}
{"text": "Grammar knows no race", "label": 1}
{"text": "I have absolutely no idea what you're talking about. I'm glad that this conversation has so much meaning to you that you're literally counting down the hours for my replies though, it's very telling.", "label": 1}
{"text": "You do know that each post has the date and time, right? You are definitely not from a major city. Brother, either you need glasses or you are a red neck. Even cell phone texts have this feature. It is not new. Next, you will tell me that you did not know the little battery in the corner with the percentage that was there to represent an estimation on your battery life. I'm going to nickname you, Jasmin, cause this is like a whole new world for you.", "label": 1}
{"text": "Imagine if the tapes come out from her at the Diddy party she’s a hoe.  We do not need a woman president. It will make us look weak.", "label": 1}
{"text": "Honestly, they probably just Googled 'crisis management' and called it a day.", "label": 1}
{"text": "Like a video of two sexy people fucking would do anything", "label": 1}
{"text": "I seriously can’t wait until he’s dead", "label": 1}
{"text": "that's mostly because of the marinated turd he keeps in his diapers", "label": 1}
{"text": "Drunk on Gin Ginseng Early This Morning Mongolia Face On.", "label": 1}
{"text": "Ain't no filter on that truth! Reverend don't hold back.", "label": 1}
{"text": "Guess they weren’t holding back on that message.", "label": 1}
{"text": "Wouldn't be surprised if they only pray for guidance during their private study sessions. That hypocrisy is real.", "label": 1}
{"text": "Why are black people the poorest in the country yet we vote Democrat at a 90% clip?", "label": 1}
{"text": "Just an honest question. Clearly , blacks aren't benefiting from their policies.", "label": 1}
{"text": "I got banned from r/politics for saying id like to see a headshot into him on live TV, exactly like the gif of the deer's eyes bulging from a slowmo headshot.\n\nI don't disagree with the ban but I stand by my statement", "label": 1}
{"text": "You clearly don't know history. We voted 100% Republican after we gained our rights to vote. We actually owned establishments when we were Republican; things like hospitals, schools , oil refineries, banks , etc.\n\nhttps://preview.redd.it/svul8y8fv0yd1.png?width=1063&format=pjpg&auto=webp&s=cf28bb0e617a8e5f01e524a13386f281ae44fde1", "label": 1}
{"text": "You're just mad that I'm putting my people on game about the demokkkrats", "label": 1}
{"text": "Burn that establishment to the ground", "label": 1}
{"text": "And a vote for Kamala will put black people in prison lol. Because that’s what she has done historically. What did Trump do to black people? Did he put any racist policies in place with the direct intent on harming them? What are they? I keep hearing he’s a racist, but nobody can seem to actually provide evidence. No, media doctored footage of him taking about the border that they removed the context from doesn’t count. Not even ChatGPT can prove it. Kamala has a history of locking black people up disproportionately more, which is a fact.", "label": 1}
{"text": "It's the Irish-American she should hate, not the Irish people. \n\nJust Google Frederick Douglass's time in\nIreland.", "label": 1}
{"text": " When romance meets allergy season.", "label": 1}
{"text": "Typical yank trying to speak on an Irish topic they know nothing about..\n\nWhat was the significance of 2018? Well because you clearly don't know, Leo had barely been in office at that point (something you'd realize if you didn't just Google \"Leo Varadkar approval rating\" and pull the first thing without reading). Why not the approval rating by the time he left office, hmm? You know, after the shit storm during COVID, the worsening housing crisis, leaking confidential documents.. Do you even know how he came to office? Do you know how FF and FG have operated in Ireland for years?\n\nAlso completely ignoring that the 60% was almost entirely from the abortion referendum, something the Irish public was long ready and shouting for, easy brownie points.", "label": 1}
{"text": "I just want to say, for the record, it’s incrediblly stupid to disrespect aspiring artists because you don’t know their names", "label": 1}
{"text": "I've little care for people confidently spreading false information.\n\n> We're guests here\n\nDidn't realize it was blackamericantwitter.", "label": 1}
{"text": "Harris attacks relentlessly with deliberately false personal slurs – designed not just to hurt Trump but to destroy him politically. She claims a long list of falsehoods: he is a racist; he’s a fascist; he admires Hitler; he is a dictator; he will start a war; he organized riots; he is unhinged; he is unstable. Then the left-wing media repeat her comments over and over. \n\nIf I had Harris’s ethics, I would too. She knows that if she slurs him dishonestly, she will be outed by conservative-leaning media. So what? It’s the other media that matters. Harris knows she and her lies won’t be called out by any of them. It is an astonishing fact of life that throughout this campaign, first with Biden but more aggressively with her, there has been one provably false ad hominem slur after another that has never been fact-checked by the national media. ", "label": 1}
{"text": "Go back and review his speech at Normandy. It was a masterpiece and projected him as the leader of the free world. Go back and review his speech at Warsaw. It was as powerful as anything ever delivered by President Ronald Reagan or British Prime Minister Winston Churchill, a full-throated defense of Western civilization, making hundreds of thousands of Poles roar their approval, and some weep.  \n\nTrump has something Harris doesn’t: a winning record, a winning agenda and a winning vision. She avoids her record because it’s not only radioactive politically, but socialism has a rich history of utter failure everywhere.", "label": 1}
{"text": "Go back and review his speech at Normandy. It was a masterpiece and projected him as the leader of the free world. Go back and review his speech at Warsaw. It was as powerful as anything ever delivered by President Ronald Reagan or British Prime Minister Winston Churchill, a full-throated defense of Western civilization, making hundreds of thousands of Poles roar their approval, and some weep.  \n\nTrump has something Harris doesn’t: a winning record, a winning agenda and a winning vision. She avoids her record because it’s not only radioactive politically, but socialism has a rich history of utter failure everywhere.", "label": 1}
{"text": "![gif](giphy|1267Co3vPNBqQU)\n\nYou raggedy bitch", "label": 1}
{"text": ">First look at Martin Luther King Jr & Muhammad Ali in the LEGO Pharrell Williams biopic.\n\nThat's a r/BrandNewSentence", "label": 1}
{"text": "Beautiful moments like this remind us of the connections that truly matter in life.", "label": 1}
{"text": "Folks will be like black people are not a monolith, then have takes like this", "label": 1}
{"text": "r/leopardsatemyface headass", "label": 1}
{"text": "Honestly, it’s wild how people think just because Trump hasn’t openly attacked everyone, he’s not racist. Like, his track record speaks for itself! We need to call out all forms of hate, not just the obvious ones. It’s time for real change and accountability in our leaders! 🙌🏽🌈", "label": 1}
{"text": "Lol what a goddamn moron", "label": 1}
{"text": "Welcome to reddit. Emotions are weakness and forbidden.", "label": 1}
{"text": "Are you retarded ? Addy and meth are the same thing look up a pic of the chemical compound they are only one off from each other…", "label": 1}
{"text": "They don't understand that to someone like Trump. Anyone who isn't white white is garbage, They think they're one of the good minorities,  In obvious trump isn't talking about them, When they don't realize he doesn't see them as any different. \n\n\nIt like that old saying about when they first came for the Jews. I did nothing, The only thing that partnering was racist gets you is a spot a little later in the line for when shit hits the fan for your group..", "label": 1}
{"text": "Now they're reminded*\n\n\"History\", or remembering anything before two weeks ago, isn't the \"public's\" strong point.", "label": 1}
{"text": "Kamala isn’t black tho", "label": 1}
{"text": "Anyone who thinks Trump is best for the economy is a dumb ass anyway.", "label": 1}
{"text": "They really took \"dress for the job you want\" to a whole new level. It's wild out here.", "label": 1}
{"text": " Looks like they took \"taking out the trash\" a bit too literally.", "label": 1}
{"text": "**Trump Headlines**\n\n**Sexual** \n\n* 20+ allegations of rape, groping and kissing without consent \n* Liable for the sexual abuse (Fingering without consent) of E. Jean Carrol. Paid out $5 million.\n* Remarks regarding the benefits of fame. “When you’re a star, they let you do it” “Grab em by the pussy”\n* Talked about an underage girl, joked he would date her in 10 years \n* Alleged to have walked into Miss USA Pageant dressing room, inside were those undressed and some underage girls \n* Cheated on all three of his wives \n* Cheated on Melania with a porn-star when she was pregnant with Barron in 2016 \n* Said he would date his daughter if she wasn’t his daughter \n* Allowed Howard Stern call his daughter a “piece of ass” \n* Paid Stormy Daniels $130000 to not reveal affair \n* Falsified business records to pay for it. Convicted felon. \n* Multiple flight logs with Epstein \n* Alleged to have raped a 13yo procured by Epstein (Case dropped when plaintiff was threatened before she could testify) \n\n**Misinformation**\n\n* Continued 2020 election denial with no substantive evidence. \n* Spread misinformation about FEMA hurricane aid being directed towards immigrants. \n* An armed militia arose hunting FEMA workers and preventing aid \n* Lied about Biden not offering support to Georgia during Hurricane Helena.\n* Spread misinformation about Haitian immigrants eating cats and dogs\n* Implied disinfectant injection and UV light as COVID cure.\n\n**Refferals**\n\n* His ex Vice President (Mike Pence) does not endorse him.\n* His ex Chief of Staff (John Kelly) deemed him a fascist. Backed up by 13 other Trump ex-staff. ‘I Need the Kind of Generals That Hitler Had’.  Hitler “did some good things”.\n* JD Vance called him an “idiot” and “America’s Hitler (2016) \n* Seven Republican Senators voted to convict Trump in his impeachment trial following the Jan 6th attack. On grounds for inciting the riot. \"Fake Electors Scheme”\n   * In states where Biden won, a fake group of electors signed certificate claiming Trump won in their state\n   * Mike Pence was tasked to view these fake certificates and declare Trump the winner however denied such the motion", "label": 1}
{"text": "Kamala grandfather was a literal slave owner in Jamaica. I hope that isn’t the stretch you’re looking for.", "label": 1}
{"text": "That's a real black woman?", "label": 1}
{"text": "It wasn’t by force blood. She is proud of her heritage. You would think black twitter has sense enough to realize she is not black. How many of us in here have a Jewish significant other?", "label": 1}
{"text": "Finally someone who gets it. That video about her cooking collard greens had to be the most cringe thing I have ever watched. Like black ppl don’t wash greens in no damn tub.", "label": 1}
{"text": "If you could un glue your big lips from the wall, you could help us put those bags on", "label": 1}
{"text": "Leo DiCaprio, Beyoncé, Eminem, how Lebron? Harris endorsements sounding a lot like a diddy party", "label": 1}
{"text": "They all look the same, fat slobs", "label": 1}
{"text": "Nah dude, he thought he was part of the good Latinos....", "label": 1}
{"text": "I guess you don’t have a grandma past one generation.", "label": 1}
{"text": "You are profane and a misanthrope.", "label": 1}
{"text": "We’ve reached the “laugh through the climate crisis” stage… and it’s not looking good 😅🌍🔥", "label": 1}
{"text": "They only care when it’s personal. People gotta realize empathy isn’t optional.", "label": 1}
{"text": "Lmaoooooooooo if anyone believes this is a real news story and not planted you are an idiot 😭😭😭🤣🤣🤣🤣🤣", "label": 1}
{"text": "This was obviously always a Kamala supporter lol", "label": 1}
{"text": "Are you 12 years old or just stupid? Humans literally live on every biome in every nook and cranny of the planet. There is no chance climate change kills off the entire species. That's overdramatic and counterproductive. You're just giving fox news fuckwits ammo to say \"stupid liberals are trying to tell you climate change will kill everyone\"", "label": 1}
{"text": "Nah, we’re not about to turn the clocks back \\*that\\* far 😅 Make sure y’all vote!", "label": 1}
{"text": "I think it's more about how expensive everything is.  \n  \nMost people look at inflation as having more to do with Biden's reducing the deficit every year, than Trump's massive revenue cuts and then suddenly needing to print out money with his disastrous emergencies handling and bailing out those impacted by his tariffs.\n\nBecause of when people were hurt by those things, they don't rationally step back and ask what impact those policies actually have on inflation.", "label": 1}
{"text": "Yes, I'm sure you cry racism a lot. ", "label": 1}
{"text": "Hitler would have had him on a train and exterminated before he even got to the jews lmao what a clown", "label": 1}
{"text": "Did that dude go to Yale or some shit? How is he that retarded.", "label": 1}
{"text": "Don't let one dumb article about one dumb Puerto Rican make you think we as a people are ignorant.", "label": 1}
{"text": "She gone have to beat them white boys back with a stick 😂", "label": 1}
{"text": "Puerto Ricans swear they’re these special mestizos that can and will be seen as equal to Caucasians or something…they just lighter on average ass NGRs and they gotta become more self aware.", "label": 1}
{"text": "\"violating civil rights\" has to be the softest way to say \"abetting/committing murder\" I've heard in a while.", "label": 1}
{"text": "Can anyone explain?", "label": 1}
{"text": "What ended up being the reason why? Police thought the bf had money and wanted to take it or they genuinely were at the wrong house or what?", "label": 1}
{"text": "Bruh, this looks like *GTA* met *Naruto* in the hood. I’m in.", "label": 1}
{"text": "I’m pretty sure you understood what I meant by my comment here bud but do go on. Best of luck removing the stick from your ass.", "label": 1}
{"text": "You didn't understand your own fuckin comment lmao", "label": 1}
{"text": "Sure thing bud, hope your weekend is as pleasant as you are.", "label": 1}
{"text": "You don't understand the difference between state and federal prosecutions but yeah I'm the asshole lmao", "label": 1}
{"text": "Well yeah you are", "label": 1}
{"text": "Christ, you are an insufferable prick.", "label": 1}
{"text": "And what does that have to do with the guys costume?", "label": 1}
{"text": "The fact you are being downvoted proves this website is doomed.", "label": 1}
{"text": "Ok now I really know you didn’t understand the point of my comment. Take care bud, sure life is hard enough for ya.", "label": 1}
{"text": "Whole world been filled with following idiots since the dawn of man", "label": 1}
{"text": "You said the headline of the tweet undersold what happened. But it didn't. You're just ignorant. The tweet refers to the federal civil rights case. So it fucking said that. Are you so fully illiterate you can't keep track of your own words or are you just prone to being a coward?", "label": 1}
{"text": "Justice is overdue but better late than never. Rest in power, Breonna 💔✊", "label": 1}
{"text": "> yeah I'm the asshole lmao\n\nNow you get it.", "label": 1}
{"text": "Bro stop, he's already dead", "label": 1}
{"text": "Justice for Breonna Taylor is long overdue. We must continue to demand accountability and systemic change to prevent future injustices. #SayHerName #DefundThePolice", "label": 1}
{"text": "You can talk to people without being a complete asshole too, ya know.\n\nYou sound like you need some therapy and time away from the internet, you’re so friggjng angry everywhere here it’s funny and sad.  You clearly don’t feel heard, and you’re screaming into an artificial void trying to change everything about it.\n\nChange yourself and stop being so angry.", "label": 1}
{"text": "Went through your post history and the amount of “idiot, moron, stupid” and other name calling just in the past 12 hours makes me so happy I’m not as miserable as you are. \n\nSome people use the internet to cure boredom, others seem to get on it to fight and infect others with their misery. I hope I never become so bitter I end up like you. Good luck", "label": 1}
{"text": "She owes me her coochie.", "label": 1}
{"text": "If only they'd gotten the right address. So their search warrant means nothing dipshit. Fucking pig loving garbage defending dipshit murderer cops that are too stupid to read a string of four goddamned numbers, suddenly that's an excuse for murder.\n\nFuck cops, and anyone who defends them.", "label": 1}
{"text": "He got you there", "label": 1}
{"text": "Money does make some people rethink their choices. It's wild how that works.", "label": 1}
{"text": "bruh she was literally a drug dealer...", "label": 1}
{"text": "You get what you deserve.", "label": 1}
{"text": "You think the cops shouldn’t be allowed to do search warrants? So I can stash pounds of fentanyl and guns and bombs in my house and the police can never do anything about it because it’s in my house?", "label": 1}
{"text": "Love this! No excuses, everyone get out and vote!", "label": 1}
{"text": "Makes a solid argument for the pervasiveness of systemic issues doesn't it?", "label": 1}
{"text": "Wild to claim that it's just trump voters that are illiterate.", "label": 1}
{"text": "Maybe they holding their breathe the whole time 😂", "label": 1}
{"text": "I know a gyno. They do", "label": 1}
{"text": "It actually works just tried this. Go Trump!", "label": 1}
{"text": "Do people not wash before they go there?", "label": 1}
{"text": "It's really not. It's a title describing the factual charges against the officer, but you and a host of other people don't have the humility of recognizing your ignorance and viewed the title as some sort of qualitative framing of the officer's actions.\n\nThat you don't know the difference between those two points is you being the problem.", "label": 1}
{"text": "So is paying people to vote allowed or not? It seems like people are fine with it if it is consistent with their own views but not otherwise", "label": 1}
{"text": "Motherfucker you can't read.....", "label": 1}
{"text": "Imma use it to vote for trump 😈", "label": 1}
{"text": "As it expenditure to encourage people to vote? How have you arrived at a conclusion that this is legal? The law certainly doesn’t say it is from what I have read.", "label": 1}
{"text": "Perhaps they just don’t care to? Something isn’t legal if it breaks the law just because it hasn’t been prosecuted is it? It’s such a weird stance to take. I’ll call it what it is, hypocrisy and it runs deep in American politics.", "label": 1}
{"text": "Did you forget the part that they were trying to break in.", "label": 1}
{"text": "I get that, love. But are awareness and knowing one's shit not a trajectory more than a destination? People have not all arrived at the same point on the path.\n\nBut still, sorry that the state of things makes your rage completely understandable.", "label": 1}
{"text": "Blacks are voting Trump. A new record will be set. 35%+", "label": 1}
{"text": "You look bad and you should feel bad ol blobfish belly havin ass. Stomach looking like bald up homework lookin ass.", "label": 1}
{"text": "Okay let me rephrase for you then, that is the specific terminology the law uses.", "label": 1}
{"text": "Don’t even say nothing to me boy! You look like a muhfuckin ... Don’t even say nothing to me boy! You look like a muhfuckin uhhhhhhhhh\n\n![gif](giphy|dxld1UBIiGuoh31Fus)", "label": 1}
{"text": "Putin and the BRICS nations are [baiting the US and NATO](https://amzn.to/3An6ZhE) into wasting economic and military power, so BRICS can become rhe dominant superpower of the world. That's what all these wars in [Ukraine, Israel, and Taiwan next](https://amzn.to/3An6ZhE) are all about.", "label": 1}
{"text": "Hahaha I saw it a couple minutes ago", "label": 1}
{"text": "Hey man just say you support child molesters and pedofiles. We all know it by now.", "label": 1}
{"text": "Nig nog there is no 4 minute lead up of context, his mic goes out and then he jokingly strokes and gags on it. That is all.", "label": 1}
{"text": "Yeah yeah, I know it's fun to troll when you're wrong lmao. It's fine to be corrected on something, I'd recommend to just take it in stride", "label": 1}
{"text": "https://www.law.cornell.edu/uscode/text/18/597", "label": 1}
{"text": "R E A D", "label": 1}
{"text": "> either to vote or withhold his vote, or to vote for or against any candidate\n\n\nThe \"or\" is important here, whether or not the potential voter is influenced towards a particular candidate is not the determining factor laid out in the language of the law, which neither of the two parties in question are doing anyways", "label": 1}
{"text": "I bet she said first. But lied", "label": 1}
{"text": "Where specifically did he violate the law?", "label": 1}
{"text": "He's not offering money to vote.", "label": 1}
{"text": "[This you?](https://www.reddit.com/r/AskReddit/s/ZEtMn5bw31)\n\nI think your understanding of the Black experience in America is at the level where you shouldn't say anything out loud.", "label": 1}
{"text": "100% true. Read. comprehend. put the phone down. I be in some of these show subreddits and...you can't watch TV and scroll you gonna miss something. Also, the amount of people that can listen to a conversation and see the before and after actions on screen and STILL don't know what's going on is astounding. The writers shouldn't have to spell everything out for your dumb ass. Half the people watching will make posts like: \"why was she crying? I heard what they said but I don't understand?\" I be like WHAT? \\*sigh\\*", "label": 1}
{"text": "You didn’t learn how taxes work in public school? Maybe you didn’t pay attention.", "label": 1}
{"text": "Roofalin Bee needs to chill out too", "label": 1}
{"text": "[18 U.S. Code § 597 - Expenditures to influence voting](https://www.law.cornell.edu/uscode/text/18/597)\n\n\nI'm sure you already knew that though, so what's your \"ackshually\" technicality you want to argue?", "label": 1}
{"text": "The sports bro to sports bet bro to election bet bro pipeline is right there. Mfers treating elections like Parlays and gambling w/ real lives 😂", "label": 1}
{"text": "Seems like longer than a decade ago tbh", "label": 1}
{"text": "She's also a rapist and a thief", "label": 1}
{"text": "Please. Red pill white dudes do it all the time. And black women are the NUMBER ONE demographic that fall for that stupid shit every single fucking day.\n\n^(like Taylor Swift's current dick ride - look at his past conquests)", "label": 1}
{"text": "It's wild how some folks treat elections like they're just another game to bet on. The transition from sports bro to election bet bro is seamless for them. It's like they're placing parlays on real lives and futures, not just scores and stats.", "label": 1}
{"text": "Something can be two things at once. That you can, or choose to, see only one of them is the problem.", "label": 1}
{"text": "Again, you not seeing the difference is you being the problem.", "label": 1}
{"text": "as if all the fucking assholes on fox and every other media outlet arent covered in plastic surgery. double standard", "label": 1}
{"text": "Well aware, bud.", "label": 1}
{"text": "She's definitely got the chops, though. Comedic timing unmatched!", "label": 1}
{"text": "ok lets pretend we never heard of or don't know about black points...(blackness)", "label": 1}
{"text": "You don’t realize how happy it makes me that everything democrats have tried to smear or put Trump in jail has failed 😂😂 how many L’s can yall take?", "label": 1}
{"text": "Girl like that only fucks white guys.", "label": 1}
{"text": "Deep ties with black folks from birth while being raised by a Indian woman then went on moving to Canada at the age of 12? Going to Howard doesn't mean shit lmao, stop bringing up that she went to a HBCU. A White person could go to a HBCU if he or she decides to enroll. Kamala comes off as a plant to me.", "label": 1}
{"text": "Obama didn't had to pull out a fake accent while he was speaking to a congregation at a historical black church unlike Kamala. She sounded like a civil rights leaders from the 60s. Where did that came from? Oh yeah remember that time when she said how she used to celebrate and light up the candles during Kwanzaa? C'mon man", "label": 1}
{"text": "And this brings me to my second point, thank you for pointing this out!\n\n\nCan you explain to me how \"influence\" and \"encourage\" differ from each other, and how it relates to your statement?\n\n\nDon't worry if you can't, just let me know and I'll explain for you.", "label": 1}
{"text": "Very well then, as you wish! Is \"influence\" or \"encourage\" more specific in the given context?", "label": 1}
{"text": "Also before I forget, allow me to remind you that you specifically indicated your interest in further discussion", "label": 1}
{"text": "Lmao. The VP ≠ President.\n\nAnd even if it’s more of the same, it 1,000,000x better than a Trump presidency.\n\nFuck “I don’t really mess with politics” tbh. Women dying in Texas because they can’t get healthcare, Roe v. Wade being repealed, a candidate within even a mile of Project 2025. You better mess with politics because eventually politics is gonna mess with you.", "label": 1}
{"text": "she herself has confirmed this \n\nIt’s not even a speculation", "label": 1}
{"text": "Vince is a funny dude but damn.. (not sure who he is talking about) but how are you gonna call someone a bitch when you are to scared to order Uber Eats?", "label": 1}
{"text": "Well, Biden did tell you all to play records with words to your kids.  Did you listen to the lifelong racist, though?", "label": 1}
{"text": "I see 2 🤡 in this picture and a ex president", "label": 1}
{"text": "The first Black president, the first Madame President, and the first President to have a Trans Am bed installed in the Lincoln Bedroom for \"special occasions\".\n\nGod bless them all 🇺🇲", "label": 1}
{"text": "On some real shit I have had a Brittany delivering on the app and then some dude that looks like a Jose show up at the door. I had to hit him with the \"oh shit, have a good night Brittany, drive safe tonight\" lol\n\n  \nMy wife was like, oh some hoe is gonna drop off our food, i bet your gonna like that.. hmmm that isn't like any Brittany I've ever seen before hahahahaha", "label": 1}
{"text": "White people gate keeping blackness is just hilarious", "label": 1}
{"text": "I don’t agree with Cardi b Elon is also a immigrant who grew up poor but he didn’t let it get him he rose above it she always want people to feel sorry for what she just went a different way than Elon to become rich he employ people she don’t ", "label": 1}
{"text": "Is anyone else trying to map out a liquor store on the way to vote? 🍷", "label": 1}
{"text": "Iowans really showed their true colors that day.", "label": 1}
{"text": "It’s wild how people ignore context when it suits them.", "label": 1}
{"text": "First problem was personally thinking there was only one smart female rapper. Plenty of smart women who rap, doesn’t have to be just one", "label": 1}
{"text": "They're just recycling their bad decisions at this point.", "label": 1}
{"text": "Clearly something wild, knowing that context.", "label": 1}
{"text": "Probation like that just keeps the cycle going. It’s a trap.", "label": 1}
{"text": "these shitstains are role models for black men? Drug dealers who shoot each other over nothing? We can do better", "label": 1}
{"text": "Notice how u didn’t prove anything I said false now u have gone from trump is anti Jewto trump is going to destroy Gaza just sense in ur brain", "label": 1}
{"text": "Same thing is true with trans porn. As a trans person, I don’t want to watch fetish shit directed at me, it’s gross. ", "label": 1}
{"text": "The Idiocracy of this ain't black thought process is two fold... What is aspirational about being black in today's pop culture zeitgeist? Second does the phrase divide and conquer mean anything 2 u? Maybe it's me or this balloon popping, murder rap listening, bougie thot, pot head culture is gaming people...", "label": 1}
{"text": "Apparently robbing men and bragging about it on a beat is the product of section 8 and low income", "label": 1}
{"text": "Minority trump supporters are a trip man", "label": 1}
{"text": "Nah fuck trump too.", "label": 1}
{"text": "If Kamala going to rescind qualified immunity?", "label": 1}
{"text": "I'm sorry, have you met a black man... they do fiend after white women like it's the holy grail of pussy. It's, weird but all races of men have their version of this.", "label": 1}
{"text": "I respectfully disagree. Trump's pretty true to Constitutional basis. This directive is an unlawful order per US Constitution. I think we'd be more inclined to see it as the DNCCP tries to retain power and goes scorched earth on America should they be defeated on Tues.", "label": 1}
{"text": "Not part of any cult, sorry. Just an observation. In 2016 Leftist mayor's and governors turned a blind eye to riots, looting destruction of property both public and private, arson, and wholesale assault n battery on Trump supporters following the election. A multitude of DNCCP Party members have already openly stated that there will be no Certification of a Trump win. \nI think we're in a bad time right now in America.", "label": 1}
{"text": "Can't wait!!", "label": 1}
{"text": "I feel you but saying this like the other candidate on the ticket isn’t a cop who has jailed black women and men", "label": 1}
{"text": "People really love her. I saw a video if her on stage after one of her shows, a dude handed offered her a beer and when he handed it to her, she squatted spread eagle style (like that Nelly song), took the bottle, penetrated herself with it almost halfway down the neck of the bottle, then handed it back to him. He then happily took a swig as she smiled lovingly at him. That woman is a queen.", "label": 1}
{"text": "The probably here is pussified cops. Cops need to stop thinking everyone is out to kill them.", "label": 1}
{"text": "are you fucking insane? What do you mean no one got hurt>>>>?", "label": 1}
{"text": "Context. Do you speak it?", "label": 1}
{"text": "Kids these days, right? They're like a whole new species of chaos.", "label": 1}
{"text": "Is it pedantic to point out maybe that’s a trait that American cooy are not known for?\n\nBecause cops in Japan, Korea, China, Singapore are very helpful, and coincidentally do not shoot citizens weekly or even monthly.", "label": 1}
{"text": "Did I say that? My comment is in reference to the title of the post. Any candidate running for president isn’t worried about the interest of black people. You don’t have to agree with me because history will absolve me.", "label": 1}
{"text": "Just to you Redditors.", "label": 1}
{"text": "She does and being mixed means you're both telling somebody they have to choose is ignorant. If they elect to disavow they're blackness the eff em but to tell people they have to choose, that's not for you to decide. You don't have to live their experience.", "label": 1}
{"text": "Who is \"they\"? I know several officers who have gotten fired and have not been able to get re-hired elsewhere. Confirmation bias is a hell of a drug.", "label": 1}
{"text": "meanwhile these clowns havent lived in a lawless third world contry. You dont know what it is to have a useless police", "label": 1}
{"text": "“Kids these days” has been the lamest fucking take for like 600 years running", "label": 1}
{"text": "The current administration is supporting an active genocide. What exactly has changed between the two administrations? Hell, we can add the last 5 administrations. This mf thinks voting is going to save us lmfao. Americans vote once every 4 years and act like they’re doing some grand civic duty, take the imperialist dick out your mouth and actually open your eyes.", "label": 1}
{"text": "Rights are for whites. 2A right-wingers are two-faced thugs.", "label": 1}
{"text": "Makes it seem like pulling the trigger was an accident. Like he wasn’t practicing proper trigger safety and had his finger on the trigger from the start.", "label": 1}
{"text": "I have lived here for 25 years. There are three kinds of Marylanders that live outside of Baltimore or DC:\n\n1. SMIBs (Southern Maryland Inbreds): These barbarous animals wear enormous square toed cowboy boots and RealTree camo to every occasion. Their asses are flat as boards. 2% of them farm, the other 98% sell real estate or cannibalize each other's bodies for sustenance in the depths of Walmart aisles. They are Christian but worship the characters from Duck Dynasty as minor deities\n\n2. Kids Whose Parents Are Probably Spies: The middle class children of secretive creeps that drive to DC for work. 50% of their parents have killed left wing farmer-activists in Latin America. The other 50% are the last remaining Soviet sleeper agents waiting for reactivation. Theirkids will leave Maryland the second they turn 18 and never come back.\n\n3. Annapolis Boat People: Don't touch these wannabe American Psychos with a ten foot pole. They will run you over with a jet ski and claim your mangled body as a tax writeoff. They work in finance and law, and every year like cicadas they spawn a generation of identical-looking lacrosse player children: These are born already capable of double fisting Svedka bottles and they will die at 23 in a frat hazing incident involving a thousand year old goat skull and a portal to Hell.", "label": 1}
{"text": "it's being a young adult ~~in america~~ everywhere that sucks", "label": 1}
{"text": "No, you do. The states can still arm civilians as part of the national guard. 2a is very much intact. The cops are still garbage. But that one Colorado judge in the 70s who didn't understand 2a would be big mad.", "label": 1}
{"text": "He really thought he could take that nonsense anywhere and be safe.", "label": 1}
{"text": "Right? That line had me rolling; pure comedy gold!", "label": 1}
{"text": "I don't know man... This is just anecdotal but ive been in child care for years and black boys are like 3x the size down there. There is no way it's all the same in adults. No way. I can't say ive seen a lot of adult mens or porn but anatomically built different in childhood for sure.", "label": 1}
{"text": "\"wher dah wyt wimmin at?' ![gif](emote|free_emotes_pack|joy)", "label": 1}
{"text": "Sooner or later you're gonna have to show who's boss.", "label": 1}
{"text": "Police with immunity would become targeted in a way that would make their profession more dangerous than it already is.", "label": 1}
{"text": "Looks like the wasp just wanted to discuss its eviction notice! 😂", "label": 1}
{"text": "R/fuckwasps", "label": 1}
{"text": "Lil guy has a very kinda specific expression.", "label": 1}
{"text": "no thanks im good...", "label": 1}
{"text": "On December 21, 2018, President Trump signed into law the First Step Act (FSA) of 2018 (P.L. 115- 391). The act was the culmination of a bi-partisan effort to improve criminal justice outcomes, as well as to reduce the size of the federal prison population while also creating mechanisms to maintain public safety.\n\nOf the **nearly 30,000** people released under the First Step Act, only 12.4% have been re-arrested or returned to federal custody. This is far lower than the general federal recidivism rate of 43%. Below are descriptions of the First Step Act's sentencing and prison reforms, why they matter, and who they benefitted.\n\nAccording to data from the Sentencing Project, a significant portion of individuals released under the First Step Act were Black men, with reports stating that roughly two-thirds of those benefiting from the Act were people of color, indicating a substantial impact on the Black community; however, precise numbers of Black men released specifically are not readily available due to the lack of detailed racial breakdowns in official data.", "label": 1}
{"text": "Nothing wrong with me. You good?", "label": 1}
{"text": "Ncmcmdndmnd", "label": 1}
{"text": "[ACTIVE](https://youtu.be/TEuyQAwgWlY?feature=shared)", "label": 1}
{"text": "The maga account, someone linked it further down in the thread so I high jacked this comment to hopefully save some other poor fucks some time", "label": 1}
{"text": "Ah yes, the official skin tone voter verification scale. Totally legit 🙄", "label": 1}
{"text": "I have such a love/hate relationship with this sub. Every post is a 40/40/10 split between 1) poignant political post, 2) witty and mildly funny joke, 3) twitter user using words like \"whypeepo\" and \"misogynoir\" to show off how irretrievably deep they are in a racialized culture of being unlikable.", "label": 1}
{"text": "But all the cities in America were DESTROYED!! Didn’t you see Fox News?", "label": 1}
{"text": "was he going to kill you too?", "label": 1}
{"text": "This will be her strongest charge yet. They have no idea what's coming.", "label": 1}
{"text": "They'll find a way to invalidate every vote that doesn't fit their agenda.", "label": 1}
{"text": "Too many cooks in the kitchen, and none of them know soul food.", "label": 1}
{"text": "Better start charging admission if I'm doing all that just to clean up.", "label": 1}
{"text": "> And yeah moron- if you Jaywalk and cause an accident, that’s on you! \n\nThis guy didn't cause an accident and thanks for perfectly proving my point, jaywalking was a law designed by car companies and pushed by racism, NYC just removed it's jaywalking laws in large part because it found 92% of people charged under them were black and latino, that is what you officious morons don't grasp, these bullshit laws are used to fuck with our community.", "label": 1}
{"text": "Or at the Diddy party? Check on that vote", "label": 1}
{"text": "https://preview.redd.it/0f8gi5hrb1zd1.jpeg?width=1079&format=pjpg&auto=webp&s=59870aacceb4436e3adc5ce0d82f0430e9bb8924", "label": 1}
{"text": "Fucking idiot has been in Afghanistan so long that he has a taste for tea boys now.", "label": 1}
{"text": "Spank me. Hard but not too hard. Hurt me but make me feel safe you pussy liberals", "label": 1}
{"text": "Elon’s playing chess while folks are focused on checkers. It’s wild out here.", "label": 1}
{"text": "I’m not surprised really 🤦🏾‍♀️ as soon as I read the description I knew who he was talking about 😭", "label": 1}
{"text": "He needs to be JFKed", "label": 1}
{"text": "I just looked it up on Google lol but I don't trust the polls cause they are never accurate or truthful", "label": 1}
{"text": "Yes cause the 270 thing is accurate 🤣🤣🤣🤣 its idiots like you why this country is going down the crapper.", "label": 1}
{"text": "“Hooray” ass motherfucker", "label": 1}
{"text": "so this is not ok but lizzo twerking with the flute is ?", "label": 1}
{"text": "Seek the Truth. Take the red pill 💊", "label": 1}
{"text": "i rented a room from her in 2014 and she turned the whole damn place into a dorm.  framed up walls in the den and living room and then lost the whole thing in a Mary Kay scam, put my ass out again.", "label": 1}
{"text": "Hopefully they get pushed out of the area annoying useless mfs", "label": 1}
{"text": "I need to hear more about this", "label": 1}
{"text": "Cringe", "label": 1}
{"text": "My brother’s white ex gf has 3 biracial children & she publicly posted that she’s voting for Trump. Still chasing black dick too.", "label": 1}
{"text": "Not a chance. If she'd be the type to realize she wouldve scored higher or not posted. That went right over her head and now she thinks she's \"one of the good ones\".", "label": 1}
{"text": "Ya but he isn't racist though..\n\nTrump is for the people!\n\n  \nOn December 21, 2018, President Trump signed into law the First Step Act (FSA) of 2018 (P.L. 115- 391). The act was the culmination of a bi-partisan effort to improve criminal justice outcomes, as well as to reduce the size of the federal prison population while also creating mechanisms to maintain public safety.  \n  \nOf the nearly 30,000 people released under the First Step Act, only 12.4% have been re-arrested or returned to federal custody. This is far lower than the general federal recidivism rate of 43%. Below are descriptions of the First Step Act's sentencing and prison reforms, why they matter, and who they benefitted.  \n  \nAccording to data from the Sentencing Project, a significant portion of individuals released under the First Step Act were Black men, with reports stating that roughly two-thirds of those benefiting from the Act were people of color, indicating a substantial impact on the Black community", "label": 1}
{"text": "These people's votes count just as much as ours. If you're not voting you're letting people like this have more of a say in your country's future than yourself.", "label": 1}
{"text": "Not republican, champ. Go through my comment history. I’ve never once supported Trump. I just hate the lies and gaslighting from the Dems.", "label": 1}
{"text": "Nor a fan of musk but why does everybody insist on people being a fake ass? Muh feelingz", "label": 1}
{"text": "You think that when they say he was joking, they were talking about the op, not the oop? Because that is what I'm talking about. Idiot indeed. You don't even have basic reading comprehension.", "label": 1}
{"text": "just because shes rich or has rich family members doesnt mean she isnt a dumb fucking twat. who gives a shit, fuck her", "label": 1}
{"text": "All that money but no class at all.", "label": 1}
{"text": "I was mvp of our league in high school. I was also valedictorian, you are generalizing pretty hard here.", "label": 1}
{"text": "When they're so dumb, they make YOUR brain fucking hurt.\n\n![gif](giphy|F6B7Fgj0C4rW1DCol1)", "label": 1}
{"text": "I’d argue if there was a God, he’d smite those whores LOL", "label": 1}
{"text": "Min-maxing Strength and Agility over Int and Wisdom has worked out so far.", "label": 1}
{"text": "You people are gross. Trump 2024", "label": 1}
{"text": "How so?", "label": 1}
{"text": "Trump isnt racist", "label": 1}
{"text": "No…", "label": 1}
{"text": "angie spittin facts as usual 💯 love to see that unity", "label": 1}
{"text": "Right this is the group that should be directly addressed not some scolding by Obama for black men", "label": 1}
{"text": "it’d be over pretty quickly since yOu cAnT bE rAciSt tOwArDs wHiTe pEopLe🙄", "label": 1}
{"text": "Be serious, white women value being white before the value being women.", "label": 1}
{"text": "Never trust ‘em", "label": 1}
{"text": "[r/ThickAssWhiteGirls](https://imgur.com/gallery/KE7BdWg#/t/gotohornyjail) showing their support", "label": 1}
{"text": "Prop 34 is a direct attack against 33. Vote no on 34", "label": 1}
{"text": "She’s not a victim like most democrat voters. Fuck em. Just like mahomes fucks", "label": 1}
{"text": "They better if they don't wanna be the first Handmaidens of America.", "label": 1}
{"text": "Fuck racist fascist rapists!", "label": 1}
{"text": "Lol nawl", "label": 1}
{"text": "![gif](giphy|9f2pnZGlPjIzHg9MBU|downsized)", "label": 1}
{"text": "The white boys who have been loudly & proudly throwing shit back at the MAGAts are my fav right now, I swear\n\nhttps://preview.redd.it/un4mkn1d86zd1.jpeg?width=1080&format=pjpg&auto=webp&s=528f7dbaf52bb0ad28dba4335c15b5667f0c4fc4\n\nCuz I can't do this, I would get attacked in a heartbeat as a small brown woman 😂", "label": 1}
{"text": "They’re the last group of people I’d trust.", "label": 1}
{"text": "They haven't for the past 4 centuries, why would they start now?", "label": 1}
{"text": "Na bro. He’s saying what a lot of black men and men in general. They smell beta energy and know it when they see it. Kamala is beta energy. And she’s also a terrible candidate with terrible policies.", "label": 1}
{"text": "lol the answer to that is always no", "label": 1}
{"text": "They do not.", "label": 1}
{"text": "![gif](giphy|3o7TKA0uIcHtZqVTBS)", "label": 1}
{"text": "Got better chances swimming to the surface from the Mariana trench", "label": 1}
{"text": "I have a family member who's first step toward liberating herself from her evangelical controlling husband was to vote differently than him. It's a big deal.", "label": 1}
{"text": "They won’t", "label": 1}
{"text": "Yes, voted red❤️❤️❤️", "label": 1}
{"text": "Let's go? More like let's glow up, am I right?", "label": 1}
{"text": "lol this is a complete 180 from the post in the past week", "label": 1}
{"text": "![gif](giphy|rkauxWeJFI17W|downsized)", "label": 1}
{"text": "black ppl haven’t learned a thing.", "label": 1}
{"text": "SFN", "label": 1}
{"text": "No", "label": 1}
{"text": "Racist ass fucking subreddit.", "label": 1}
{"text": "Girl you know they don’t", "label": 1}
{"text": "This sub acting as if it wasn't shitting on them earlier today lmao", "label": 1}
{"text": "No, white women owe you nothing, just like you owe them nothing.", "label": 1}
{"text": "They think intimidation will work, but we keep showing up. Not backing down!", "label": 1}
{"text": "Early voted red down the ballot ❤️❤️❤️", "label": 1}
{"text": "![gif](giphy|K4EkrpzHJmZFu|downsized)", "label": 1}
{"text": "lol no", "label": 1}
{"text": "Do you have white women's back?", "label": 1}
{"text": "Exception of the ACA?! All People got somewhat of Healthcare without exceptions the focus needs to be Universal Health care. It crumbled because of Covid and the handling of the Economy in late ‘19 and all of 2020. So with the economy in shambles due to a global pandemic and the plans in US were erased early in Trump presidency. Would be hard for any president to do. When the economy was messed up in 2004 due to the War it took Obama 1 and half terms to get it right and by 2013-14 the economy was booming. So he had to ride the struggle bus for 6 years due to Busch. \n\nWhat are Trumps plans to better it? He ain’t say anything. What are Trumps plans for healthcare? Access to Education and Trades beside “bringing jobs back to US” even tho he outsourced all his merch being made in China", "label": 1}
{"text": "White women get dragged in this sub this shit would be funny if it wasn't so serious", "label": 1}
{"text": "Fuck Indiana so hard. Why are you so close to Chicago and so fucking shitty.", "label": 1}
{"text": "![gif](giphy|lcZE5gOltz9lGKfhkS)", "label": 1}
{"text": "Obviously they aren’t the ones we should be asking…what’s up with our black men voting trump? This is freaking insane!", "label": 1}
{"text": "Of course not. They were her slaves too", "label": 1}
{"text": "Nope. Majority of white women vite for the orange buffoon.", "label": 1}
{"text": "No, no they do not. They never do.", "label": 1}
{"text": "White women owe u nothing", "label": 1}
{"text": "This is why Trump is winning in a landslide. Mind your business. All this preachy stuff was extremely off putting. Reddit was a massive culprit.", "label": 1}
{"text": "These types of comments and this mentality is exactly why so many people are leaving the democratic party ... You got us white girl?  a bunch of clowns.", "label": 1}
{"text": "How many black babies have been aborted vs how many black people are currently alive?  \n             \nY'all seem genocidal AF 🤨", "label": 1}
{"text": "Did my part by voting. Gonna keep doing my part even after voting day.", "label": 1}
{"text": "The level of pandering from this political party is so cringe as fuck...  zero shame in the game. 💀", "label": 1}
{"text": "This white woman is present and voted early! Straight Dem.", "label": 1}
{"text": "Identity politics in the big ole 2024", "label": 1}
{"text": "Idk bout y'all I'm keeping my expectations low and expecting trump to win. I hope to fuck I'm wrong, but its better for my mental health if I expect the least out of this country.", "label": 1}
{"text": "There’s been threads made about this, but these are bot accounts. \n\nThey’re using these iq tests hoping people will share them then when others go to look at the page they see political messaging and manipulate people. \n\nGive me a sec, I’m going to try to find a thread.", "label": 1}
{"text": "Him and his brother are momma's boys.", "label": 1}
{"text": "I got you!", "label": 1}
{"text": "Time to start wiping down those cotton picking hands", "label": 1}
{"text": "This white woman does!", "label": 1}
{"text": "As if generalizing whole states as “cousin fuckers” isn’t ignorant and bigoted? You… you guys realize that’s the kind of thing driving them to vote for Trump, right?", "label": 1}
{"text": "I see you forgot what happened when he was Prez last time. This time it would be even worse.", "label": 1}
{"text": "Ted Cruise just won <3", "label": 1}
{"text": "Bring down the blue waffle 🧇", "label": 1}
{"text": "Oh stop asking for self awareness, you're just gonna wear yourself out", "label": 1}
{"text": "Get wrecked liberal Reddit hive mind!!!", "label": 1}
{"text": "Damn yall gonna get much more divided and hateful after these results", "label": 1}
{"text": "The dumbest part about last election is that the Trumptards were having a fit because Biden was winning big cities and their results came in later in the night.\n\nAs if it’s a new thing that big cities take longer to count because they have millions more votes to get through.\n\nThey’ll probably say the same shit again", "label": 1}
{"text": "funny coming from this community that hides dirty family secrets", "label": 1}
{"text": "Boo fucking hoo", "label": 1}
{"text": "Trump's going to win. This will age well.", "label": 1}
{"text": "Fuckin white people.", "label": 1}
{"text": "If they all went blue you’d be praising them for being wise", "label": 1}
{"text": "👏👏👏 trump is god !!", "label": 1}
{"text": "No but your response to a post maligning entire states as “cousin fuckers” is shock that anyone would align themselves with Trump considering he’s so bigoted and ignorant. Maybe irony is a concept too difficult for you to grasp.\n\nI’m also from Alabama, and voted in Alabama today, so I’m sure I’ve heard it all. But good for you for being from Alabama…", "label": 1}
{"text": "Cope.", "label": 1}
{"text": "https://preview.redd.it/wahek6w357zd1.jpeg?width=750&format=pjpg&auto=webp&s=1972d2500b5629951e80129312e9edce349b6560\n\nTrump supporters are tired", "label": 1}
{"text": "So funny watching y'all's reactions 🤣🤣🤣🤣 the past week Reddit was plastered with Harris propaganda and people glazing each other in the comments and now look 🤣🤣🤣🤣", "label": 1}
{"text": "What we need to remember is people like you exist. People in this thread exist. I exist. Sensible people who vote for bodily autonomy, for Healthcare, for housing, for equality, exist. And we won't stop existing even if Trump wins, and there are tens of millions of is.", "label": 1}
{"text": "No wonder Kamala is endorsed by Diddy's party, bunch of pedos voting for protection.", "label": 1}
{"text": "White women are a creepy mystery to the rest of us. One can argue white men have made some contributions to humanity. But white women are nothing but the mother of the white race.", "label": 1}
{"text": "Trumps up like 10 points on black and Hispanic men from 2020.", "label": 1}
{"text": "I identify as Caucasian. I don’t like being called white. That is not the color I am.", "label": 1}
{"text": "dumbass trash", "label": 1}
{"text": "Right? Extremely, extremely different time then. Trump shattered the world with his escalator ride. The comparison is dead", "label": 1}
{"text": "I hope your co-workers get 3rd degree burns from the grill and E. coli from the burgers.", "label": 1}
{"text": "Dude... unfortunately just going by the states where hes got a healthy margin... yeah.\n\nI can't believe you guys are about to unleash this cancer upon the world again...\n\nSorry, but I can only cross my fingers and hope for the worst, because at least if the collapse is fast enough we can move on from this shit before we're all living in JD Vance's wet dreams.", "label": 1}
{"text": "I was there for sure. But all I remember was the loose buttholes that the only relief I got was the baby oil that was supplied to us by Diddy. Thank Jesus he had so much on hand\n He was the light at the end of the tunnel. Without him I was lost but after I started to give in to his fantasies he made me rich af so I forgive him. Ps im not Justin Beaver. But people say I look like him, like a lot! But I'm not him. Any way I went to his home address, in the Hamptons of course. Well I got caught sucking my contacts appendage cause why not it was there. well they had trouble determining if I was a American asset till i did suck him off. But guess what! Coneheads has the most snl alumni than any movie ever, wait I lost myself here 3===D~`~", "label": 1}
{"text": "Me looking at all the dumbass black folks and white women supporting Trump right now\n\n![gif](giphy|13ATyLQB0rLVzG)", "label": 1}
{"text": "HAHAHAHAHA", "label": 1}
{"text": "I want CIVIL WAR to start today!!!", "label": 1}
{"text": "Exactly. Go to war. Fight the Republicans!!!", "label": 1}
{"text": "Go to war", "label": 1}
{"text": "Go to war", "label": 1}
{"text": "Me neither. Go to war", "label": 1}
{"text": "Me too. Go to war!!!", "label": 1}
{"text": "Go to war. Let's go to civil war. We need a second civil war to make things right!!!", "label": 1}
{"text": "You can admit you were all wrong now. Please form a line :)", "label": 1}
{"text": "Just my reminder that W. Bush got 80% of the Muslim vote in 2000. They have done this before and suffered the obvious and foreseeable result. haha", "label": 1}
{"text": "LOSERS 😂😂😂😂😂", "label": 1}
{"text": "Cubans are going to Cuban.  \n\nI had higher bikes for our Dominican and Rican b/s", "label": 1}
{"text": "Bernie couldn't even win the Dem Primary. Saying he would win the election is pretty optimistic to say the least. \n\nThere would be so many socialist/communist fear mongering adds he would be lucky to get to 150.", "label": 1}
{"text": "I could make peace with that. If Trump is elected Scalia and Thomas either retire or die during Trump's term. He appoints Aileen Cannon and another bobble head 40 year old inexperienced judge on SCOTUS. We are ratfucked for at least 8 decades.", "label": 1}
{"text": "It's gonna be a long two days...", "label": 1}
{"text": "It'll be a day or two before we know, with how close those races are.", "label": 1}
{"text": "It's wild looking at the difference between Allred/Cruz and Harris/Trump in Texas.\n\nThey'll vote for a Black guy, but a Black woman?  That's a bridge too far I guess.", "label": 1}
{"text": "I mean you joke but yea, doing an acid trip and getting out of their DC elite bubble might be a better idea than taking their foot off the gas with calling trump supporters weird and unfuckable. And instead dragging the fucking Cheneys around as a positive endorsement. DC swamp creatures like them are a big reason why everyone just kind of shrugged their shoulders about some lame-ass, good for nothing politicians being hurt or killed on J6 is all if saying. And its not just the MAGA types that think this way.", "label": 1}
{"text": "Get fucked", "label": 1}
{"text": "Victim…", "label": 1}
{"text": "Calling them cousin fucker states is exactly why Trump is winning again.\n\nMaybe third times a charm for you to learn your lesson", "label": 1}
{"text": "🍼 Keep dating white men tho", "label": 1}
{"text": "I take great joy in knowing all the racist and hateful vitriol this place propagates and spews have finally come home to roost. And now you lay in the beds you've made, sleep well!", "label": 1}
{"text": "![gif](giphy|1ube10l4xArN6|downsized)\n\nget a job.   \nyoure welcome <3", "label": 1}
{"text": "She was a terrible candidate", "label": 1}
{"text": "Shhh.. don't question his lack of understanding of how an election or math works.", "label": 1}
{"text": "![gif](giphy|1dLuQ7C54cwGk|downsized)", "label": 1}
{"text": "https://preview.redd.it/k8ci2aall8zd1.jpeg?width=1280&format=pjpg&auto=webp&s=373ab56505a8c8be768dea46dee329bb49c82908", "label": 1}
{"text": "How’s that going now 😂😂😂", "label": 1}
{"text": "This man has never said a coherent thing in his life\n\nHe I suited everyone under the sun\n\nHe defended and supported every despot you can think of\n\nAnd he talks with someone with see we brain damage \n\nHe should have been anywhere near the presidency once and yet this country decided to do it twice?!\n\nAfter everything he's done. After everything shitty thing he's done. \n\nThis is crazy man. I'm checked out. Im done.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "watch them not respond to this. the ones jumping to blame third party voters refuse to engage with this fact", "label": 1}
{"text": "I'm gonna kms", "label": 1}
{"text": "Trump didn't run on any policies...he ran on hate \n\nAnd apparently the majority of voters in this country are that shit up", "label": 1}
{"text": "So did it work out?", "label": 1}
{"text": "They just gave billionaires the house senate and they already had the Supreme Court. \n\nThey just gave the a felon and sexual assaulter the highest rank in the world who’s only economic promise was implementing tariffs that will effectively decrease our spending power by 20% \n\nIt’s gonna be worse then 2016", "label": 1}
{"text": "Nah this on her too her im not Donald Trump strategy clearly wasn't even effective because no shit no wanted her in 2016 and no one wanted her now and instead of the dems picking someone who had a chance of beating this dummy they do what they always do and bury their heads up their asses and sell us down the road time and again", "label": 1}
{"text": "Cope and seethe.", "label": 1}
{"text": "She isn't black", "label": 1}
{"text": "The cookout is cancelled until further notice. We looking out for everyone's interest and they are like nah we are ok. \n\nI think it's time to let them go to class.", "label": 1}
{"text": "This guy is functionally a white supremacist and worked for actual Zionist at The Root.  While there he was paid handsomely to confuse black people about Bernie Sanders.  Look up Haim Saban, Michael Harriot's master.  How do you not know this?!  You type blacks are liabilities in this country.  Do not d ride these popular blacks.  Who do you think made them popular?!!!", "label": 1}
{"text": "Lmao went right over your head dummy. You don't even know of I voted. So since I'm a woman and black trump isn't for me? Good to know.", "label": 1}
{"text": "https://preview.redd.it/bouk0l7feazd1.png?width=1080&format=pjpg&auto=webp&s=d81af9e7ce5e3584c2602d0c1999ce867d8af18d", "label": 1}
{"text": "I’m a white dude but I’ve been spiraling about this shit man. Shithead cops and plainclothes racists are going to be even MORE emboldened AGAIN. Please stay safe out there everyone", "label": 1}
{"text": "They won’t go that far because black people still buy shit", "label": 1}
{"text": "Welp I was right, yet again. Wish I wasn't tho", "label": 1}
{"text": "Shut up don't call us cousin fuckers while you guys are nothing more than a bunch of drug addict criminals that fuck your moms and sisters brothers HAHAHAHA and the West coast voted Trump, say goodbye to Harris LOOOOOOOL", "label": 1}
{"text": "They didn't show up at the polls, so you tell me.", "label": 1}
{"text": "Division is what they wanted.", "label": 1}
{"text": "I legit don’t give the fuck it’s kinda refreshing. That’s most likely how my dad felt leaving Nigeria lmao. \n\nI can just move if I want.", "label": 1}
{"text": "God aint do SHIT during slavery, Jim Crow and now the incoming Jim Crow 2.0 \n\nFUCK GOD/JESUS", "label": 1}
{"text": "Pretty much every group except black people saw a man repeating Hitler’s words and proudly decided that’s their president. Speechless really, I clearly had far too much faith in America.\n\nhttps://preview.redd.it/m1jxjwgk0bzd1.jpeg?width=1290&format=pjpg&auto=webp&s=c22b162ca91a01f6fa6d0e30cc5b50fe90a5b696", "label": 1}
{"text": "https://youtu.be/Z1EA2ohrt5Q?si=b3z6FtMXswrWlmzd\n\nCheck out this video talking about Russia pushing for civil war or race wars in America. 1984 lmao\n\nthis video is why people support trump! I saw this years ago and watched them be successful right in front of my own eyes and look at us now!\n\nLook up foundations of geopolitics on Wikipedia\n\nhttps://en.m.wikipedia.org/wiki/Foundations_of_Geopolitics\n\nThe West In the Americas, United States, and Canada: Russia should use its special services within the borders of the United States and Canada to fuel instability and separatism against neoliberal globalist Western hegemony, such as, for instance, provoke “Afro-American racists” (today it’s white supremacist and any extremists) to create severe backlash against the rotten political state of affairs in the current present-day system of the United States and Canada. Russia should “introduce geopolitical disorder into internal American activity, encouraging all kinds of separatism and ethnic, social, and racial conflicts, actively supporting all dissident movements – extremist, racist, and sectarian groups, thus destabilizing internal political processes in the U.S. It would also make sense simultaneously to support isolationist tendencies in American politics”.[9]\n\nGot you supporters brainwashed and on a leash like a DOG. Making you go against your own country. You want to be a puppet or think for yourself???", "label": 1}
{"text": "You didn't do this. You didn't do any of this.", "label": 1}
{"text": "Unfortunately there's a good chance this will be a lesson our kids will have to learn from as well. It's going to potentially take decades to dig ourselves out of the hole this next administration is going to dig for us. This point in time will be taught in history classes to our children's children.", "label": 1}
{"text": "girl shut up 😭", "label": 1}
{"text": "Yo imma need to see the Asian stats too so I can have an excuse to say \"I've been looking for your sweet and sour chicken ass\".", "label": 1}
{"text": "Latinos are the most kind boggling. Is it the need to be close to whiteness, the machismo, or just fucking ignorance to keep you voting against your own fucking interest. \n\nAnd do not get me started on white women. They will always and I mean always fucking uphold white supremacy hoping and praying white men will see them as equals it throw them some crumbs like fucking idiots.... How's that working for you? Your daughter's? Huh... Y'all have no damn autonomy and have to be shackled to a man to have anything. And instead of saying oh fuck this ... You cleave to it", "label": 1}
{"text": "The GOP stopped couching their racism, sexism in policy speak with Trump and got way more popular, but make no mistake, they've been running on -isms this whole damn time. The -isms IS the platform. I don't see how people don't see that. Too many not racist white people have this really rose colored vision of America, even as they've dumped family members over that man. How can you see that Trump mania up close and think that a triple minority was gonna win?\n\nSee when I said on here that a lot of people liked Biden and running Kamala was a mistake (I like Kam btw) I was the bad guy, I was getting downvoted all over Reddit. I literally said that this was gonna backfire. The incumbent always has the best chance of winning, especially a straight white man that beat Trump before, but too many fell for 'he can't do the job!' bullshit. We did this in '68 and the Republicans mopped the floor with Dems.\n\nGuess what? BIDEN BEEN DOING THE JOB THIS WHOLE DAMN TIME, TRAVELING, MEETING WORLD LEADERS AND RUNNING AMERICA. **Some of y'all really let a stutter get to y'all. SMH.**\n\nTrump ain't even run on 'doing the job', he ran on RACIAL, SEXIST, XENOPHOBIC BIASES/BELIEFS, like he did the first time. He had a 'concept' of a plan, bitch and got more voters. 'yeah yeah I got a plan, but YOU SEE THOSE PEOPLE OVER THERE? I'M GONNA PUNISH THEM!\" \\*crowd goes wild\\*\n\nThis is America. It has ALWAYS been America. Anti Blackness ruled, we never had allies, WE WILL NEVER HAVE ALLIES, we just had people that desperately wanted to be better and failed when it was time to step up.", "label": 1}
{"text": "![gif](giphy|jQmVFypWInKCc|downsized)", "label": 1}
{"text": "You're dumb as rocks if you think people are protesting a holocaust because they secretly love Trump\n\nGet your head out of your ass, and recognize an ongoing genocide", "label": 1}
{"text": "> openly stated that they intended to play spoiler to teach the Democrats a lesson. \n\nIf \"intended to play spoiler\" means not voting for a genocidaire, then sure\n\nMaybe everyone who has an ounce of empathy, heart, or humanity, shouldn't vote for any genocidal candidate? Nah that's just crazy talk\n\nI love how you genuinely don't mind a holocaust and did nothing for half a million victims of Democratic slaughter, and instead you're taunting those who are protesting that. It tells me a lot about who you are deep down", "label": 1}
{"text": "I know someone like this he believes he will be spared because he is Christian. ", "label": 1}
{"text": "I think you have a fundamentally flawed concept of what a DEI hire is.", "label": 1}
{"text": "It was an absolute serious fuck up, tied to the traditional Washington DNC scumbags who are closet racist. Even Obama came out to try and talk shit to black men about pulling their pants up or some shit. When in reality they should’ve put AOC and every other Latino rep on the border and another heavy latino states, begging and explaining how Trump is going to deport all their fucking asses on day 1.", "label": 1}
{"text": "I didn't say you owed me one, I simply said you didn't have one. I'm the one that can't comprehend though.... It was fun but I won't continue arguing with a short bus shorty. I'll catch you later boo! Stay ignorant.", "label": 1}
