{"text": "I am actually both a good person and intelligent, you don't know me. \nWhy don't you tell me what happened in 47, huh? \nNo Google. Just your information. \nWho opened war on who? And why? \nLet's go.", "label": 1}
{"text": "No you aren't. You are worse than the Nazi's. You invaded Palestine, and you are the aggressors, in every situation since.  Sad how little you know about your own country and its history, so you aren't intelligent ethier, trollboy.", "label": 1}
{"text": "Like i said before, I'm both intelligent and a good person, which is why i won't respond to you the way you talk to me. You seem to think for some people that i support random Palestinians dying? I don't. No israeli does. We're people too.\nAnd again like i said - i academically studied this subject. I know my facts. I know the history better than most people I've met, and surely better than you. \nI'll answer my own question for you\n\nIn 1947 the partition plan was decided upon by the UN - the plan dictated that a portion of the land of israel would belong to the arab people (who didn't even call themselves Palestinians at the time, that only started in the 60s), and the other portion to the jewish people.\nJerusalem would belong to everyone. \nThe jewish people accepted that, very happily. They weren't interested in tons of land, just a safe place after what happened in the holocaust (6M jews died, a real genocide, i hope you knew this fact cause this is basic knowledge). So the accepted- not that they had a right not to, it was the UN's decision. \nThe arab people didn't accept. \nThe partition plan was a go on nov 29th 1947. \nThe arabs attacked the very next day, nov 30th 1947.\nThere was no IDF to defend anyone at the time, the attackers attacked defenseless people. Including my grandfather, by the way \n**They** opened the war that we call the independence war and they call the nakba. They attacked. They attacked with five other countries in fact - jordan, Egypt, Lebanon, syria, and iraq.\nAnd they lost. They opened war and lost. And that is what they call \"stealing\". \nThis is all facts, feel free to check me. \n\nSo again, i know the facts. I know my country. \nI *want* Palestinians to have their own country, but not at the expense of my country and my people. They could've had that in gaza, their leaders are filthy rich. \n\nAnd trollboy? I'm a girl, as my avatar clearly shows? \nHave a nice day", "label": 1}
{"text": "You are moron and your government is now and always has been a terrorist group. You just proved my point that Israel invaded  Palestine and has been on a mission of exterminating the Palestinian people ever since. You learned well from the Nazi's and improved on their methods. You have no country, just land stole from the Palestine.Pathetic trollboy.", "label": 1}
{"text": "You should start with simpler books meant for learners. The fact is, you're not fluent in Spanish. You're not even fluent in listening to Spanish. You're fluent in understanding the specific phrases and topics favored by your family. Novels, being as creative as they are, are especially challenging for second language learners. Try to read a newspaper article in Spanish, and you'll see what I mean - it will probably be a lot easier than the novel you're trying to read. \n\nIf you don't want to start with easier books written specifically for learners, definitely try books that you've already read in English, and keep a copy of the English version with you while reading the Spanish version.", "label": 1}
{"text": "you, have terrible reading comprehension. read it again.", "label": 1}
{"text": "I think it's more like Israel is Voldemort, and Hamas is Harry Potter and Hermione.", "label": 1}
{"text": "I prefer the printed versions, because I love collecting them 🥰", "label": 1}
{"text": "To Kill a Mockingbird. Was only in the 9th grade. Too young to get it all. ", "label": 1}
{"text": "Definitely not a monopoly, just an expertise. But any time a novelist describes themselves as an activist, you know you’re getting a stream of ignorant talking points that did numbers of twitter", "label": 1}
{"text": "Kind of an extreme analogy. Now ask yourself how much of what you use every day is provided by “depraved sociopaths” - as you call them. What does that make you?", "label": 1}
{"text": "...there was a time when respectable nations aspired to make the world a better place; sadly, that era seems since to have been cast-off...", "label": 1}
{"text": "Not much; C-suite people don't provide anything useful.", "label": 1}
{"text": "Western privilege is a country invading, killing and occupying with impunity because it is supported by the west and those governments are too corrupt to defend international law. The entire world can see that privilege", "label": 1}
{"text": "This article ignores a few key points:\n\n* Hamas' genocidal ambitions.\n* Hamas' use of human shields.\n* Antisemitism from people who support Palestine.\n\nIt is one sided, and it is biased.\n\nFurther, Truthout is an incredibly partisan source, and MBFC (which I've yet to see criticise sources for blindly criticising Israel the moment something comes up and not waiting for things to be verified) says it is extremely left-wing and has a mixed level of factual reporting.\n\n>“amidst the genocide happening in Gaza.” The backlash was swift, with a deluge of posts on X attacking Wong’s character and accusing her of antisemitism.\n\nIf you only only ever oppose what you allege is a genocide when it allows you to criticise Israel, you will get accused of antisemitism. If you don't know or don't care about Hamas' genocidal ambitions, you will get accused of antisemitism because those double standards.\n\n>This [conflation](https://www.nplusonemag.com/online-only/online-only/a-dangerous-conflation/) of opposition to Israel’s military action with hatred of Jewish people is only one part of a broader wave of political and social repression that is attempting to silence writers speaking out against the war. In the past month alone, authors who have criticized Israel’s ongoing bombardment of Gaza\n\nExcept there is a significant overlap between antisemitism and opponents of Israel. See the people refusing to demand Hamas cease firing, people calling for the destruction of Israel, or the support for Hamas and Hezbollah in pro-Palestine protests. Saying there is no difference ignores all the people who combine the two.\n\nFurther, if you are silent on Hamas, silent on Hezbollah, silent on the Palestinian Islamic Jihad, silent on the other terrorist groups attacking Israel, you are a massive hypocrite, and will face criticism because of that.\n\n>have been labeled extremists, been suspended and fired from faculty jobs, and targets of defamation and harassment.\n\nLooking at the three links there. [The first](https://www.usatoday.com/story/entertainment/celebrities/2024/10/09/tony-dokoupil-ta-nehisi-coates-controversy-explained/75591791007/) was a book contained a quote which could be interpreted to be saying that people in Israel aren't human, and the book contained, based on the article they choose to link, massive double standards.\n\n[The second](https://www.democracynow.org/2024/9/5/steven_thrasher) is from Democracy Now, which is an incredibly partisan source.\n\n[The third](https://www.jewishvoiceforpeace.org/2024/10/02/muhlenberg/) is from Jewish Voice for Peace, a group of people who support peace so much they refuse to make any serious criticism of Palestine or Palestinian groups opposing peace. \n\nThose two sources are biased to the level cherry picking is a likely possibility in their reporting.\n\n>In social media posts and published articles, the moderator mocked people who advocate for a ceasefire by calling them “terror apologists” and other names.\n\nThis article didn't link to or name the moderator, and given this article's own double standards, how am I supposed to take them at their word and assume that the people described weren't only demanding Israel cease firing?\n\n>Many of us who have spoken out against Israel’s war on Gaza have not only opposed the war, but also drawn connections between the violence there and other interlocking crises: mass death and displacement in [Sudan, the Congo and Haiti](https://www.unocha.org/news/todays-top-news-occupied-palestinian-territory-sudan-democratic-republic-congo-haiti);\n\nThen why is it that pro-Palestine protests are dominated by people silent on those issues? And it it happens so much, why does it not appear more?", "label": 1}
{"text": "> Kind of an extreme analogy\n\nIt isn't, when you look at what these corporations and the people who run them do. \n\n>What does that make you?\n\nA citizen trapped in a system that is all but impossible to escape from, getting what they need to survive in the only manner available.", "label": 1}
{"text": "Truth. Also, David Duke self identifies with the pro palestine camp. Strange bedfellows - Nazis and Terrorists", "label": 1}
{"text": "C-suites produce nothing. They do not exist to solve problems. They are deluded into thinking they do, because they organize and rally the people under them, and because they're paid well. They don't realize that 1) the people under them would keep everything going without them just fine, and 2) they're only paid well to disincentivize industrial espionage, which would be rampant if C-suites (who have incredible power and access) were paid fairly.", "label": 1}
{"text": "Have you looked at the technology and research that the tiny nation of Israel has contributed? They have made the world a better place. But the Islamic Republic of Iran and it's proxies have been attacking Israel for decades with the stated intent to kill all Jews. All these deaths lay at their feet.", "label": 1}
{"text": "Great breakdown of the article.  Also the professor in third article referenced is saying Kamala Harris doesn't support abortion rights and supports outright genocide which is just a blatant lie after referencing a two state solution & openly saying she will sign off on roe v Wade if a bill is brought before her... These aren't small statements either she is very vocally announcing that", "label": 1}
{"text": ">Great breakdown of the article.\n\nThank you.\n\n>Also the professor in third article referenced is saying Kamala Harris doesn't support abortion rights and supports outright genocide which is just a blatant lie after referencing a two state solution & openly saying she will sign off on roe v Wade if a bill is brought before her... These aren't small statements either she is very vocally announcing that\n\nThere's a reason I repeatedly brought up the bias of the source. Thigs like this do not make a source credible.", "label": 1}
{"text": "If Hamas stopped using noncombatants as shields, less of them would die.\n\nHamas has waged a war designed to maximise the deaths of noncombatants because it knows Israel will face the vast majority of the blame and that there will be near complete silence on its actions.", "label": 1}
{"text": "They absolutely can make or break a team - just like a sport coach or conductor.", "label": 1}
{"text": "Or a hypocrite.", "label": 1}
{"text": "Riiight, ignore the fact trump is frothing at the mouth to annihilate Palestine and the Harris is ready to let Israel do the same thing. So, dems and repubs have the same ideology. Strange bedfellows, indeed. \n\nAnd I only see one side with concentration camps, checkpoints, ID cards, tanks, etc... haven't you seen Israel blowing up Lebanon villages, in another country? Israel has a free hand to attack whatever middle east nation the US doesn't like. \n\nGet a grip. Zionists are the nazis and terrorists.", "label": 1}
{"text": "Remember, zionists started moving to the Levant specifically to create an ethnostate for themselves. They bought up land so they could create kibbutzes so that they didn't have to interact with any other population in the Levant, again with the specific aim to have only Jews. When they couldn't buy anymore land, they took it by force. \n\nAnd what are your sources? Jerusalem Post? Or some other heavily pro-Israel biased rag. \n\nAnd I love how you still attack Jews who call out Israeli bloodlust for Palestinians. Just like zionists have always done. Called the peace seeking leftists traitors. \n\nZionists have always wanted to purge \"Greater Israel\" of the other, even before Hitler did his thing.", "label": 1}
{"text": "“WhY iS sHe aLLoWeD tO SiDe wiTh tHe opPreSsED?!”\n\nThis isn’t about a difference in opinion. It’s about a bunch of Nazi sympathizers using a white nationalist U.S. client ethnostate as a cudgel to do a holocaust on people. \n\nThis person is a Mossad Bot, obsessed with calling everyone who believes Zionism is A Genicidal Suicide Cult an antisemite.", "label": 1}
{"text": "Found the Nazi!", "label": 1}
{"text": "No, a person trapped in a near inescapable system. \n\nWhen you're forced to participate in something, you're not a hypocrite, you're just surviving.", "label": 1}
{"text": "I find it disingenuous that you try to group up every person in the pro Palestine movement by citing some that have antisemitic beliefs with those who simply think bombing 40000 civilians is immoral and criminal behavior. \n\nAlso, of course people on the pro Palestine side won't talk much about islamist groups, it's literally preaching to the choir. Everyone already knows that these groups are terrorists. Why TF do they need to keep mentioning that? \n\nIsrael on the other hand is still viewed as the \"most moral army in the middle east\". Until everyone starts seeing them for the terrorists they are just as much as Hamas and the other military groups you mentioned, people won't stop to call them out more often than the others.", "label": 1}
{"text": "Are we going to ignore the zionist history since the 1880s when they specifically state they want to move to the Levant and create a religious ethnostate for themselves only? And how they moved in, bought up enough land to begin their plan and when the opportunity arose, ignored conventions of allowing refugees to return to their homes and simply stole them, started living in them, like the Cherokee in NC in the 1830s.", "label": 1}
{"text": ">Also, of course people on the pro Palestine side won't talk much about islamist groups, it's literally preaching to the choir. Everyone already knows that these groups are terrorists. Why TF do they need to keep mentioning that?\n\nThe protests literally include Hezbollah flags and other extremist symbols and slogans. Can’t be too surprised that they’re then viewed as enabling the Islamic extremist rhetoric at the very least, as it’s never other pro-Palestine protestors shutting those people down.", "label": 1}
{"text": "Zionists are just people who believe israel has a right to exist. And there are no “concentration camps” in Gaza that’s offensive and stupid.", "label": 1}
{"text": "This is pure racism. It was this thinking that allowed zionists to colonize the Levant at all. Zionists specifically move to the Levant en masse to create a religious ethnostate for themselves, no matter who else lived there. Hell, Israel is kicking out Christians now also. \n\nMost deaths are zionist's fault.", "label": 1}
{"text": ">Truth. Also, David Duke self identifies with the pro palestine camp. Strange bedfellows - Nazis and Terrorists\n\nWhat is this supposed to prove? Racists and other objectively bad people also support Israel. Hell there are even openly genocidal Israeli politicians- past and present. \n\nStrange that for exactly one country in the world suddenly we don't have standards, especially one that is supposedley a bastion of human rights. Strange that treatment of Palestinians is justified because of the actions of Hamas and yet you would be considered insane to claim Israelis deserve violence for things the worst of their politicians have supported.", "label": 1}
{"text": "Genocide as a label is loosing it's power. I don't interact with a lot of people from the black community but I had some deep conversations with some black coworkers about how they see the world. One of the views that blew my mind was the notion of planned parenthood as \"black genocide.\" \n\nI had to think about this for a while. IF you believe a life begins at conception, THEN, abortion is \"sanctioned murder of the black community.\" His belief was abortion was just one of many systems to keep black people in check. \n\nJust imagine IF there was no abortion in the food ol' USA. What would the voting demographic look like?", "label": 1}
{"text": "If you're going by this logic, sure. Let's conflate an entire group of people because a few brought flags to the event that supported terrorists. \n\nBut to say EVERY Palestinian protest is like that? And also, how does this relate to the original article in the first place? The claims the article makes is that literary agencies are surprising opinions on the genocide in Gaza. How TF does that suddenly mean the author is in support of protestors with ISIS flags?\n\nYou cannot operate under this logic UNLESS you believe every pro Palestinian is a terrorist sympathizer.", "label": 1}
{"text": "If someone said “here’s this job, and you get to do terrible things to large numbers of people, and you get to blame either the state or a corporation”, I think we know who would want to apply", "label": 1}
{"text": "Who’s forcing you to do what you’re doing? Move. Change jobs. Become what you want to become. A life  spent complaining is a prison you’ve built yourself.", "label": 1}
{"text": "What country could one move to where they aren't trapped in a capitalistic system? \n\nWhat job could one take where reliance on a capitalistic system isn't necessary?", "label": 1}
{"text": "> Russia, China, Cuba, Iran are probably your best bets\n\nStill under capitalistic systems there, with dictators thrown on top; still not an improvement. \n\nDo you even know what's going on in the world, or has mummy and daddys money insulated you from the world? \n\nYou stated you could move to countries that where you wouldn't be under such systems, and so far, have failed to do so. Do you want to try again? \n\n>Maybe start by asking, what do you want your life to be like? Realistically. You have no right to live off the efforts of others so what are you willing to contribute? Then, what environment is the best for you to do that within?\n\nStop with the deflection and address the issue at hand.", "label": 1}
{"text": "r/thathappened is leaking.", "label": 1}
{"text": "Eh, I couldn't care less about being disrespectful to zionist nazi's. Considering that both you and your zionist shill can't even come up with a source for literally any of your claims that Hamas has rejected a ceasefire, it's pretty ironic that you're criticizing my level of discourse. Enjoy being a part of your Isfake troll farm, funded by US tax payer dollars, while it lasts.", "label": 1}
{"text": "Israelis are of mixed racial backgrounds, not white. It is largely a Jewish ethnostate, which is something I am critical of, but it’s not white nationalist. \n\nAlso, I’m not an IDF bot or whatever. I could tell you more about myself, but you probably wouldn’t believe me.", "label": 1}
{"text": "You clearly don’t understand White Supremacy, and sound like an IDF bot. Have a good day, and enjoy supporting apartheid and genocide. \n\nYou’re on the wrong side of history, and clearly a deeply disturbed, extraordinarily racist ‪piece of Nazi ██‬.", "label": 1}
{"text": "This is a collection of some of the stupidest things I've ever heard in this sub, and that's saying something. How are you not embarrassed to be this stupid in public?", "label": 1}
{"text": "So why even comment? You’re adding nothing to the conversation but pointless snark. Sit down and shut up. Thanks, good bye.", "label": 1}
{"text": "So being a family member is now a crime?", "label": 1}
{"text": "Brother, I do not think Israel is indiscriminately bombing Gaza but the part about the family members is not as convincing as you think it is.", "label": 1}
{"text": "It's fucking awful. But it shows it's not a genocide. Israel is targeting Hamas. Hamas even admitted their numbers were bogus.", "label": 1}
{"text": "Again I understand your point and everything. But with the ppl you are trying to convince saying : \"well only the families of the terrorists are dying\" will not convince them. Your point that it shows they are targeting terrorists is valid Im just saying its not one that will prob convince ppl because of how it starts.", "label": 1}
{"text": "They don't seem to believe any other sources. Israel estimates 80% of deaths were militants but they just scoff at that.", "label": 1}
{"text": "Beyond comprehension. It's just sick. What an insult to Holocaust victims.", "label": 1}
{"text": "Ah the classic debate lol It’s like choosing between tea and coffee, each has its own charm, but what’s your poison?", "label": 1}
{"text": "So killing over 40,000 people in bombings and starving an entire poplulation over several months is precision targeting?", "label": 1}
{"text": "Except none of that is true. Even the UN says it isn't true. Your implicit bias just makes you believe everything bad you hear about Jews.", "label": 1}
{"text": "Lol what? \nLink to the UN website about 40k deaths\nhttps://www.un.org/unispal/document/gaza-40000deaths-turk-ohchr-15aug24/\n\nUN website link about Gaza Food levels\nhttps://news.un.org/en/story/2024/10/1155646\n\nOh and. \nIsrael is not Judaism", "label": 1}
{"text": "He's saying Jews own the economy.", "label": 1}
{"text": "If you didn’t already know, you’re a total asshole.", "label": 1}
{"text": "I'm not. But glad to know you're sensitive", "label": 1}
{"text": "Super weird you read a book about a child being horribly abused and you take that much time to write multiple paragraphs about how it’s not a great book. Wish you better luck in life than you’ve probably received!", "label": 1}
{"text": "I came to a book sub to discuss a book i read. Imagine that.", "label": 1}
{"text": "I finished this book today just after two days of getting it, and this is my second of hers after *It Ends With Us*. All I can say is that it makes me obsessed with it and done with it at the same time. It's such a RED FLAG of a book, but I just loved it, and I am so glad I read it.\n\nWith that, here is my analysis (although I wish I had read the book again before writing this). I think Jeremy married Verity because she may have been a little better off than him, and obviously, she was insanely attractive. He was hooked due to her looks and confidence. He likely didn’t want a casual relationship, as that wouldn’t benefit him financially. Plus, a woman would eventually want kids (speaking only from a biological perspective—guys, let me not be pointed for this). So, he got her pregnant, and they married.\n\nI believe she may have initially written the autobiography, but it definitely wasn’t finished by her. I’m not sure who killed Charlie or Harper, but it may have been Jeremy himself. When she confronted him, he could have created her accident. However, he doesn't know the truth about Verity being slightly recovered.\n\nNow, since she doesn’t write any more books, he goes to Lowen because he needs Verity’s money to live his life. Lowen, too, becomes obsessed with him because he has manipulated her—she competes with Verity, and many times we see her wonder why she has become this way. She is made to believe he is the true victim in every way possible, to the point of assisting him with his wife’s killing so she cannot really escape him. Now, he has the woman (and he can easily have her if he gets her pregnant) and the money.\n\nAnd maybe this is what it’s all about. I know this might be too convoluted a plot, but here I am, trying to get my mind off the true story and write some fiction, if you know what I mean!\n\nLol, this is my POV.", "label": 1}
{"text": "How the fuck is this comment upvoted so far? The first judgements in relation to the Bosnian genocide from ICJ and ICC didn't happen until over a decade after the actual genocide. ICJ has already issued injunctions months ago against Israel saying that it is plausible that they are commiting a genocide (injunctions Israel has predictably ignored) as well, so it's almost certainly only a matter of time and the gears of justice grinding slowly.", "label": 1}
{"text": "The US and Israeli have huge, public record budgets for online disinfo campaigns is how lmao. I refuse to believe most Americans are so far down the fascist hole they can see the most broadcasted genocide in human history after more than half a century of apartheid and go \"what do you mean this is out of order? This is just the way war is fought\".", "label": 1}
{"text": "I think Jane Austen and the Brontë sisters do kind of split literary fans! Austen is all about those witty social observations and romance, while the Brontës dive into darker themes and intense emotions. Some people love the lighthearted vibes of Austen, while others vibe more with the drama and complexity of the Brontë novels. I’m a huge fan of both! I feel like it depends on what mood you’re in. Don’t worry about not knowing everything; just read what interests you! 😊", "label": 1}
{"text": "This is just the same take but from a far right wing perspective. You aren't more nuanced for having a faux moderate position in this conflict. Sometimes people that you are politically opposed to are correct. Not correctish, fully and entirely correct. Does your system of ethics let you support a genocide?\n\nSorry you had to hear a slogan.", "label": 1}
{"text": "Please explain how Israel, which is the most diverse country in the region, is an ethnostate.", "label": 1}
{"text": "OMG, I totally get that feeling! It’s like you invest so much in these characters and their lives that when it’s over, it hits hard. I felt the same way after finishing “The Night Circus.” I just wanted to keep wandering through that magical world! Rereading is such a good idea! I love diving back into familiar stories. It’s like hanging out with old friends. Have you thought about fan fiction or other books in the same genre to ease the pain? It helps sometimes! 📚✨​", "label": 1}
{"text": "Oceanofpdf.com", "label": 1}
{"text": "So you have nothing from Netanyahu himself, got it. \n\n\nSo you have nothing from the person at the highest level of power in that country. \n\n\nYou've got comments from the minister of commerce or something like that making pretty bad statement. And comments from the defense minister who is explicitly talking about Hamas and making sure that they will eliminate everything that can cause a danger. \n\n\nMore importantly, are you so dumb to believe that the people at the ICC and ICJ don't know how to turn on a tv and don't see what was said? This isn't proof of a genocide. You don't have shit, you've never had shit, and you refuse to produce any evidence of this. \n\n\nYou'll never change your mind because you're an ideologue. You're a biased brainwashed tankie who is obsessed with virtue signaling. You aren't smart, you aren't seeing behind some curtain that blocks the truth, you're a peddler of false information. \n\n\nI'm tired of people like you who are a waste of space on our planet. If the ICC and ICJ actually had proof of a genocide and released this information, I would gladly change my mind but you will never change your mind because you're brainrotted.", "label": 1}
{"text": "I'll have you know that I'm officially _not_ a tankie, based on discussions with the fine folks in /r/subredditdrama\n\nI do wish you'd see justice for your outright support for an ongoing genocide, even if you're unpaid and not in the paid Hasbara troll squad.", "label": 1}
{"text": "You understand that we can all see your comment history right? You've clearly talked about how capitalism is bad, liberal capitalism is bad, america is bad, you've repeated every tankie talking point. \n\n\nYou're not making a good argument for yourself. \n\n\nAnd as for your last part, if there was any justice, you'd be the one to see it first for spreading misinformation. I haven't repeated any Hasbara talking points, all I've done was ask you a simple question, what proof do you have of a genocide that the ICC and ICJ do not have. And you can't answer a simple question. \n\n\nYou're a tankie. Don't hide from it. Just admit it. You're a modern extreme leftist, you're MAGA levels of delusional about reality. Just bit the bullet and embrace it. \n\n\nI'm fairly bored today so I can make another comment and start quoting all the things you've said through your comment history so everyone can see how you refuse to accept reality and \"aren't a tankie\". ", "label": 1}
{"text": "I wrote a book that I have chosen to self publish. Now all I have to do is find its audience...\n\nAn artificially intelligent human body hosting multiple human minds threatens the stability of a global state regulated by a massive social network.\n\nThe novel extrapolates social networks' pervasive nature and power into a future society whereby life in 'meatspace' is rationed following a long period of overcrowding that has endangered the survival of humanity. Separating the mind from the body and introducing artificial intelligence as an essential component to human existence form a culture that we still recognise but that adheres to fundamentally different rules of behaviour. Engineered adult bodies, the extension of life, and the eradication of family, old age and youth lead to extreme extensions of what we witness around us today. Rooted in manufactured bodies, the struggles of the growing AI population highlight what humanity is steadily losing by becoming more human than their creators have been for a long time.\n\nThere is no need for sleep as the minds go offline in shifts. Bods are maintained by training AIs physically resident in each bod, which minimises downtime. They are capable of free thought but are subject to the control of the vats as they represent the workforce responsible for production. Reproduction is via complex algorithms, and birth into meatspace occurs in adulthood. The care of child minds, their education, and upbringing occur in virtual space.\n\nNina Toft is the adopted personality of NT62, a bod bred in a vat in the Danish capital of Copenhagen. She narrowly misses destruction by the state after Ralf Theissen, the Berlin-based software developer responsible for her development, discovers her emergent behaviour. Nina has access to an unregistered vacant space to pursue her goals. She narrowly escapes destruction early on, thanks to Ralf, who decides to hide her and observe her further. She collaborates with other NT bods on a plan to remain safe.\n\nAgents of the state mistake the plan of a group of activist minds, who desire a single body each, for the growing number of NT bods connecting within the social network. On the run from the agents, Ralf becomes involved with the London-based historian Ava Metcalfe, who mistakenly betrayed the activists to the agents. Together, they physically hack into the social network.\n\n[https://books2read.com/vacant-space](https://books2read.com/vacant-space)", "label": 1}
{"text": ">  what proof do you have of a genocide that the ICC and ICJ do not have. And you can't answer a simple question. \n\nIt's an utterly irrelevant question and you know it.", "label": 1}
{"text": "Ocean is great for the occasional obscure thing, but Anna has an Archive with 95% of what I've looked for in retail format without oceanofpdf.com on every page.", "label": 1}
{"text": "The original claim from the other commenter was that Elisa Albert is denying a genocide is happening. \n\n\nYou're claiming that there is a genocide and taking that side in the argument. There is no genocide. No genocide has been proven. No one has been charged with genocide. \n\n\nSo what fucking proof do you have? If you got nothing, then just shut up. Quit posting. You're trying to dodge the question and refusing to hold yourself accountable for your dumb beliefs. I'll hold you accountable for your dumb beliefs and I'll ask the question a thousand more times if I have to.", "label": 1}
{"text": "LOL, what you believe makes no sense. You honestly commented recently that you think America didn't win WW2. That's insane levels of mental instability. You should probably be hospitalized.", "label": 1}
{"text": "Yes obviously a genocide is being conducted by Israel in Gaza and Palestine more generally. It has now also expanded to south Lebanon. This is simply clearly observable fact from looking at what's happening and the both original and later legal definition of the word. Denying this is, in fact, denying an ongoing genocide. The statements from Israeli officials, soldiers and media prove intent. Their actions prove themselves.\n\nThat the ICJ and ICC are slow-working institutions doesn't change that.", "label": 1}
{"text": "So you have no proof of this except your own personal feelings and push this off as the ICC and ICJ moving slow despite the fact that they already put out charges on several people so far in leadership or Israel and Hamas for war crimes but no charges for genocide.\n\n\nIf the genocide is so obvious, how come there are charges for so many other war crimes but not genocide? The current charges contradict your claim of slow moving. \n\n\nSo you're just straight up lying to suit your narrative ", "label": 1}
{"text": "> The ways in which the investigations by Forensic Architecture oscillate between judicial proof and art work is subject of an ongoing theoretical debate on evidence, aesthetics, and third-generation institutional critique.\n\n\nhttps://en.m.wikipedia.org/wiki/Forensic_Architecture\n\n\nDon't need to go any further than the wiki for proof that this is not a reliable source. They don't follow judicial proof to the letter. This is absolutely required for cases like genocide. ", "label": 1}
{"text": ">international white nationalist ethnostates.\n\nMaking racist statements like this isn’t exactly helping your position.\n\n>it’s not a war, it’s an extermination.\n\nThen maybe don’t, you know… start a war and declare you’re going to rid the levant of Jews? Calling it genocide when they hit back and you actively refuse to surrender is idiotic.\n\n“No, I won’t surrender or give back the hostages but also stop genociding me!”", "label": 1}
{"text": "That's a great question! 📚 I totally get wanting to declutter while still enjoying books. For me, I usually check prices too. If a physical book is way cheaper, I might go for that, especially if it's a series. But sometimes the convenience of a Kindle and the ability to carry multiple books wins out, even if it costs a bit more. What do you think? Do you have a format you prefer? 😊", "label": 1}
{"text": "Totally agree on the slow burn! I recently read a trilogy with sirens that had that perfect blend of romance and myth. The fantasy twist added unique stakes and made the relationships feel more intense and layered. If you’re into mythical themes woven into romance, you might really enjoy something like *The Mer Chronicles*!", "label": 1}
{"text": "Hi everyone! I'm not sure if this is the right subreddit, but I'm also an avid reader and recently created my own reading app for iOS. It's called ReadHero, and you can download and use it for free. I'd really appreciate any feedback or reviews!\n\n[https://apps.apple.com/de/app/readhero-remember-books/id6450433398](https://apps.apple.com/de/app/readhero-remember-books/id6450433398)", "label": 1}
{"text": "Who would have thought taking kids out of a school due to a virus that mostly affects the elderly and unhealthy would hinders children’s education?", "label": 1}
{"text": "Wow. White people can get away with anything. I think any and all tribal schools should teach the white peoples history is fiction. White people always exaggerate their standing in history, so it wouldn't be wrong.", "label": 1}
{"text": "I'm sorry but your post currently counts as \"shallow content.\" Do you have something else to say about the book that you could edit into the text? Preferably your own thoughts about the book or at the least a description of the book - without spoilers.\n\nLet me know if you edit it & I can reinstate your post.", "label": 1}
{"text": "Tell me about it! Like, Naoko committed suicide because her life only revolved around a man... Midori is a stand-in for Naoko and to stroke Toru's cock. Reiko.. We don't go there, but she, too, exists for the pleasure of the male reader (and the author's wet dream). \n\nThe average person has utterly garbage taste in fiction!", "label": 1}
{"text": "Hi everyone! I'm not sure if this is the right subreddit, but I'm also an avid reader and recently created my own reading app for iOS. It's called ReadHero, and you can download and use it for free. I'd really appreciate any feedback or reviews!\n\n[https://apps.apple.com/de/app/readhero-remember-books/id6450433398](https://apps.apple.com/de/app/readhero-remember-books/id6450433398)", "label": 1}
{"text": "Hi everyone! I'm not sure if this is the right subreddit, but I'm also an avid reader and recently created my own reading app for iOS. It's called ReadHero, and you can download and use it for free. I'd really appreciate any feedback or reviews!\n\n[https://apps.apple.com/de/app/readhero-remember-books/id6450433398](https://apps.apple.com/de/app/readhero-remember-books/id6450433398)", "label": 1}
{"text": "Well, only idiots become teachers, so it tracks.", "label": 1}
{"text": "🖕🏻", "label": 1}
{"text": "Finished : Fourth Wing \n\nStarted : Twisted Love ❤️ \n\nI had actually read twisted love before but I read it again after a few months to remember the story so I can read Twisted Games (book 2).\nI absolutely loved 😍  reading Fourth Wing, the spice was perfect and the plot twists were so interesting. \n\nSpoiler: \n\nWhen Xaden became venin at the end of Iron Flame (book 2) it left me dying for Onyx Storm to come out.", "label": 1}
{"text": "Hello. Per [rule 3.9](https://www.reddit.com/r/Books/wiki/rules/), please use spoiler tags.\n    \\>!Spoiler content here!< which results in:\n >!Spoiler content here!<. Or apply the built-in spoiler tags when using the redesign.\n\nMore spoiler instructions are in [our wiki](https://www.reddit.com/r/books/wiki/spoilers). \n\nSend a [modmail](https://www.reddit.com/message/compose/?to=/r/books) when you have updated your submission and we'll reapprove it. Thank you.", "label": 1}
{"text": "We read Romeo & Juliet in high school English in 1968 and then went on a field trip to see the movie. It was helpful to discuss first, and made the old English in the movie easy to understand. \n\nShakespeare isn’t difficult & you appear to be kind of a moron if unfamiliar with the human nature in his work.", "label": 1}
{"text": "Thank you for your interest in /r/books! As we are a very high-traffic subreddit, we require that anyone posting a standalone thread first spends some time in the community and earns some karma from contributing comments. Please be sure to [**read our rules**](http://www.reddit.com/r/books/wiki/rules) before posting even once you are allowed to. You can also feel free to post in one of our weekly threads linked in the sidebar, such as the Simple Questions thread or the Weekly Recommendations thread (we do NOT allow standalone recommendation posts). If you are trying to find a book you forgot, try /r/whatsthatbook or /r/tipofmytongue instead, as we do not allow those posts at all.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/books) if you have any questions or concerns.*", "label": 1}
{"text": "Honestly, that’s kinda disappointing! 😩 I get that some classics can be tricky, but avoiding them totally misses out on the depth and lessons they offer. Like, how will students appreciate the beauty in language if they don’t give it a shot? Plus, tackling something challenging can be super rewarding! 💪 I feel like it’s all about how you teach it—make it relatable and fun!​", "label": 1}
{"text": "Wow, that sounds like such a powerful experience! 😢 I totally get how you feel—when an author feels like a friend, losing them hits hard. For me, it was Robin Williams; I grew up with his movies, and it felt like losing a part of my childhood. It’s crazy how stories and characters can connect us so deeply to someone, even if we never met them. 💔", "label": 1}
{"text": "> I don’t need to be told several times in several ways how Stalinist/N@zi totalitarianism is bad.\n\nI hope that's true, but looking at the US's ongoing election campaign it looks like a good 50% of Americans haven't managed to get the message.", "label": 1}
{"text": "I honestly can’t give even half a shit about American politics anymore. Both sides are terrible.\n\nIf I could move overseas somewhere, I’d take the lost city of Atlantis.", "label": 1}
{"text": "So apparently you didn't get the message, you've got to stop the fascists before they get into power.", "label": 1}
{"text": "Yes, but the other option fucking sucks as well. I’m not supporting either side at all.", "label": 1}
{"text": "Not even addressing points, but go by insults?\n\nYes, I did get it, smartass.", "label": 1}
{"text": "Never mind, you're a mod. This kind of behavior seems par for the course.", "label": 1}
{"text": "Wow, that’s such a powerful experience! 😢 I can totally relate to feeling connected to an author while reading their work. It’s like they become a part of your life. I remember feeling so sad when I heard about certain authors passing, especially if their books really touched my heart. Losing someone who gave you so much through their stories feels like losing a friend for sure. 💔 Do you have any other authors who have impacted you like that? 📚✨", "label": 1}
{"text": "A story of two tales.", "label": 1}
{"text": "Don’t start that journey. Russia and all things Russian must be cancelled and vanish into oblivion.", "label": 1}
{"text": "Frfr bros can only tlk lik this, bet lmao", "label": 1}
{"text": "Exactly! But you know equality sounds like oppression to idiots like the replier under mine who totally missed my point.", "label": 1}
{"text": "Did I go in depth on my beliefs? Lol wtf are you on about. Critical thinking is a vital skill for survival. Do you keep touching a hot stove after it burns you?", "label": 1}
{"text": "I think you are the one who needs critical thinking skills if you don't understand what i said.", "label": 1}
{"text": "Vote trump and ban TikTok, YouTube shorts… that will do it.", "label": 1}
{"text": "It looks like you're trying to start a conversation, but you haven't included much for users to respond to. Please make a new post and include your thoughts in the text portion of your post. For example: What did you like or dislike about the book? What did you think of the actions of the main character? etc. Please don't add random stuff as it is just going to get your post removed again. \n\n If you just want to ask a simple question please do so in our simple question thread (posted Tuesday and Saturday). Recommendation/suggestion requests should be posted in /r/suggestmeabook or in our weekly recommendation request thread (which can be found on our front page, just below the banner.) \n\n If you feel you have received this message in error, click the link below to speak to a human.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/books) if you have any questions or concerns.*", "label": 1}
{"text": "\"Sam is totally gay for Frodo\"...what? You're not on Tumblr buddy", "label": 1}
{"text": "Netanyahu has singlehandedly caused the highest increase in antisemitism in 80 years.\n\nAll of my Jewish friends are horrified by what is being done in the name of their faith. They are out on the streets protesting, to no avail.", "label": 1}
{"text": "This past year, my Israeli friend has had to introduce herself as, \"I'm from Haifa originally but I don't support the genocide.\"\n\nWe were at a bar a month ago and she was venting about it, she told us she'll probably be apologizing for the genocide to everyone for the rest of her life.", "label": 1}
{"text": "Anti genocide/anti zionism is not anti semitism. \n\nIt's common sense", "label": 1}
{"text": "Weird.\n\nIsrael was subject to massacre. Israeli women were subject to mass systemic rape.   Hamas is torturing kidnapped Israel I toddlers and is executing hostages as we speak.\n\nHezbollah bombed Israel for a year with zero provocation.\n\nAnd we need to punish Israel more?\n\n\nThis is perversion.", "label": 1}
{"text": "Then why don't Palestinians release hostages and make peace?\n\nThis is nonsense.\n\nAlso Hezbollah is bombing Israel for zero reason other than to \"kill Israelis and Jews \". Which kind of gives up the game.", "label": 1}
{"text": "Because peace is only possible when Israeli's convert and sharia is the law of land.", "label": 1}
{"text": "Nah -- peace will only come when the ENTIRE WORLD converts and accepts (the hardline Iranian Shiite interpretation of) Shariah law", "label": 1}
{"text": "Really? I've never seen news about Israeli's mass raping. I've never seen anything about Israeli's using hospitals as cover. I've never seen Israeli's stealing aid meant to help their civilian population.\n\n  \nDive into some actual research and you'll notice Israel is almost always the defender and honestly if Hamas or any other Arab country that want to act like dogs and attack Israel should be put down like dogs.", "label": 1}
{"text": "*🔍 Into conspiracy theories and hidden truths?* \n\n📲Follow *@Hidden Wires* on Instagram for deep dives into the mysteries shaping our world! 🌎👁️ \nhttps://www.instagram.com/hidden_wires/\n\nFrom secret societies to unsolved controversies🤐, we’ve got it all. \n_*Don’t miss out❗*_", "label": 1}
{"text": "It sounds like you're doing all the right things by reading to him and taking him to the library! Maybe try mixing it up a bit—like finding books that tie into his interests, whether it’s a favorite show, game, or topic. Graphic novels or comic books can be a hit too since they have a fun visual element. Making reading a part of daily life, like reading signs or instructions together, can help too. Just keep it light and fun! You’ve got this! 📚💪✨", "label": 1}
{"text": "girl, it's wild how studying can drain the fun out of reading! we should be able to enjoy books without overthinking. let's bring back the joy of just getting lost in a story! 📚✨", "label": 1}
{"text": "eyes angel real life happy big dresses black long not zipper house yellow boy   boy cake girl cake man woman laser spk f221 fm yes mon 080 australia magic touch power  2000 yes fm  banned usa", "label": 1}
{"text": "For me, \"The Great Gatsby\" would have been amazing with more voices. Imagine seeing Gatsby's world through Daisy's eyes.", "label": 1}
{"text": "I usually give myself a break by reading something more light-hearted after an intense or long novel", "label": 1}
{"text": "Shooting my shot for those craving another gay romance similar to Song of Achilles. I just released Honor of the Aquila on Amazon if anyone would like to give it a shot!", "label": 1}
{"text": "It sounds like you’re doing a fantastic job supporting his love for stories! Maybe try incorporating audiobooks with the physical books to bridge the gap.", "label": 1}
{"text": "Well cool, thanks for your shitty, unspecific opinion.", "label": 1}
{"text": "If it was easy, everyone would be doing ibut.o got a stout gift to give to someone that loved to creatmemicw cocks", "label": 1}
{"text": "Lolita", "label": 1}
{"text": "I'm not assuming anything, this is /r/books. You have no clue what you're talking about, and you're piss-terrified of anything that isn't science fiction, fantasy, or vampire smut", "label": 1}
{"text": "You're overly aggressive for no reason. I hope you move past that phase on the future.", "label": 1}
{"text": "Trolls gotta troll.", "label": 1}
{"text": "He is 44 and she is 18.\n\nAnd he is rich and powerful, he could have a beautiful young lover like Julius Caesar has Cleopatra.", "label": 1}
{"text": "How you can tell someone's  a pretentious dick for 500 Alex.", "label": 1}
{"text": "\"Anyone who disagrees with me = troll\" huh? Expansive viewpoint.", "label": 1}
{"text": "Ignorant, insecure, illiterate take.", "label": 1}
{"text": "You understand that a troll isn't just someone who says means things, right? jfc", "label": 1}
{"text": "Why are you in a literature forum if your reading comprehension skills are that low?\n\nWhat I wrote was clear.", "label": 1}
{"text": "totally get what you mean about Frankenstein… it’s like Victor is his own worst enemy. but love that you still found meaning in it!", "label": 1}
{"text": "Literary fiction often explores deep themes and character development, while non-literary fiction focuses on plot.", "label": 1}
{"text": "At this point I'm not sure whether you're trolling or illiterate.", "label": 1}
{"text": "Hello, all. I was reading Howard Zinn's *A People's History of the United States*, and I'm noting every referenced book in the main text for future readings. \n\nHowever, there's one book that I can't find online, which is Richard Drinnon's *Violence in the American Experience: Winning the West*. When I googled the title, I can see it being referenced in some journal articles, but I can't find the actual book itself. Where did it go? \n\nDid it get renamed to *Facing the West*? Or was this book decommissioned for some reason, or?", "label": 1}
{"text": "I just read the Elliot Mintz book extract in the London Times. It's enough words to reveal that he is living in a fantasy world. I went straight from the hospital to the Dakota, arriving at about 11:45-midnight. When I entered the cavernous driveway, there were no glass splinters or blood stains anywhere. Although a window in the vestibule door had two bullet holes located at about eye level, with a third bullet hole above in the wooden door frame. This tale continues in the same vein, mixing times, names, and events. But what else would we expect from a PR man?", "label": 1}
{"text": "Yep! You sound a little bent out of shape. What fandom are you part of?", "label": 1}
{"text": "Someone who has always struggled with money thats who", "label": 1}
{"text": "I’m not defending it. But she herself admits that the poverty mindset is hard to break.\nAnd we don’t actually know whether she has millions or not; I couldn’t find her net worth online; but between taxes, her school and other debts, and purchasing a house; I wouldn’t be surprised if she doesn’t really have that much.\n\nAlso, we don’t know anything about her relationship with her step daughter. If her stepdaughter was an entitled little jerk, I would charge her rent too. The fact that her dad did not intervene suggests there might be a little more there. Charging rent is one step before kicking someone out.", "label": 1}
{"text": "Sounds like late next year: https://deadline.com/2024/09/barack-obama-a-promised-land-volume-2-memoir-release-date-1236096562/", "label": 1}
{"text": "it’s a fertility ritual. want my address?", "label": 1}
{"text": "No one is bullying you, the premise of your post was just flawed and you're getting corrected for it. Take it in stride and acknowledge it instead of acting like a victim.", "label": 1}
{"text": "Hahaha Redditor doesn't understand tongue in cheek comment. \n\nAlso, it ain't flawed.", "label": 1}
{"text": "Take the L bud, your literary comprehension needs work.", "label": 1}
{"text": "I've not taken an 'L' as you put it. Perhaps your reading comprehension should be tested if you can't write out the word 'loss'. There are plenty of people getting involved in this thread and having a good time.", "label": 1}
{"text": "Trash. If you wanna read about gay bugs, then this book is definitely for you. Did not finished it.", "label": 1}
{"text": "OP is kind of a dickhead.", "label": 1}
{"text": "Fame and popularity have indeed affected several authors significantly, often in ways that mirror George R.R. Martin’s experience but with different impacts on their work, mental health, or public interactions. Here are a few notable examples:\n\n# 1. J.D. Salinger\n\nAfter publishing *The Catcher in the Rye*, J.D. Salinger quickly became an icon but was overwhelmed by his fame. He found the public’s fascination intrusive, which drove him to retreat from public life entirely. Salinger’s fame influenced his personal life to the extent that he stopped publishing new work altogether, maintaining a strict privacy until his death.\n\n# 2. Harper Lee\n\nThe success of *To Kill a Mockingbird* brought intense attention to Harper Lee, who reportedly felt enormous pressure to write a second novel that would live up to her debut. The demand for more work and constant public scrutiny pushed her away from publishing, and she remained largely out of the public eye until *Go Set a Watchman* was controversially published decades later.\n\n# 3. J.K. Rowling\n\nWhile J.K. Rowling achieved massive success with the *Harry Potter* series, her fame has led to a mixed experience. The spotlight shifted from her writing to her public image, and her interactions on social media have sometimes sparked significant backlash. This has affected her personally and shaped the reception of her newer works under her pseudonym, Robert Galbraith.\n\n# 4. F. Scott Fitzgerald\n\nKnown for *The Great Gatsby*, Fitzgerald achieved a level of celebrity that impacted his mental health and work. The pressures of fame, coupled with financial instability and alcoholism, contributed to a decline in his later writing. His desire to maintain his status in the literary world affected him deeply, both personally and professionally.\n\n# 5. Stephen King\n\nKing embraced his fame but admitted it had its toll, particularly with substance abuse in the early years of his career. King’s productivity didn’t wane like Martin’s, but he has spoken openly about struggling to meet the public's high expectations, even as he managed to continue publishing consistently.\n\nGeorge R.R. Martin’s fame and the pressures tied to it might be unique in that it has become a meme-like cultural phenomenon tied to expectations for a single series. Yet, Martin is not alone in feeling the weight of public demand and scrutiny. The experience of fame can be challenging for many authors, and while some retreat, others respond by setting strict boundaries or exploring other genres and pseudonyms. Each response illustrates how deeply fame can impact an author’s creative process and personal life.", "label": 1}
{"text": "Totally get this! Classics like \\*Marco Polo\\* can be super confusing, especially with all the old place names and cultural references that don’t hit the same way today. Sometimes it's the translation style that makes it harder too, like they try to keep it old-fashioned and it ends up feeling kinda jumbled. Maybe try reading a summary alongside it? Helps make sense of what’s going on without the extra layers of confusion! 📚", "label": 1}
{"text": "Hi we make books every month we are still hiring please wait you cannot be hired", "label": 1}
{"text": "How she was a bigot?", "label": 1}
{"text": "Saying a biological fact doesn't make you a bad person Indeed.", "label": 1}
{"text": "Saying that a man Cannot turn into a Woman isn't harrassment.", "label": 1}
{"text": "Woman's Shelters are for... Women...\nA man who says that is a Woman... Isn't a Woman.", "label": 1}
{"text": "This is such an interesting take! I totally get the idea of wanting to focus on the journey instead of the destination. It’s like savoring every detail instead of just rushing to the big reveal! Spoiling yourself can definitely change how you appreciate the writing and themes. But I also get the thrill of a good plot twist—it’s such a rush! Maybe it just depends on the book and your mood? Either way, it sounds like you're really diving deep into \\*The Vampire Chronicles\\*! Happy reading! 📚✨", "label": 1}
{"text": "This is such an interesting perspective! I totally get where you're coming from. Sometimes knowing the end can help you enjoy the journey more. But, like, there’s definitely something magical about experiencing those twists for the first time. I think it really depends on the book and how much you value the surprise versus the details. Both ways can lead to different, but equally rewarding, experiences! 📚✨", "label": 1}
{"text": "It’s totally normal to feel that way when diving into classics! They can be really dense and sometimes the language or cultural references are so different from what we're used to. Marco Polo’s journey spans a lot of diverse cultures and places, which can make it tricky to keep track of everything. If you're feeling lost, maybe try reading a summary or analysis alongside it to help clarify things. Don't beat yourself up—reading challenging texts is a learning experience! 📚✨", "label": 1}
{"text": "I totally get what you mean! 🤦‍♀️ It's like when you’re vibing with a story, and then the ending just throws everything off. One book that got me like that was \\*The Catcher in the Rye\\*. I loved Holden's voice and his journey, but the ending felt so flat to me. It's like, after all that buildup, I wanted something more! What about you guys? Any other books that had a great build-up but disappointing endings? 📚✨", "label": 1}
{"text": "How the fuck is the answer not donate more books but instead is steal books from other kids. Reddit is full of such bitches thinking that anyone who makes more money or comes from a wealthier family is evil.", "label": 1}
{"text": "What sort of reading comprehension did you expect from the book smelling sub?", "label": 1}
{"text": "The answer can be both. -far too often, those with privilege are allowed to wall themselves off from the rest of the community. Reddit is full of bitches thinking they got theirs and everyone else can fuck off. ", "label": 1}
{"text": "You can't be that fucking stupid", "label": 1}
{"text": "That isn't borrowing. It's stealing you fucking idiot", "label": 1}
{"text": "The bottom quintile of society strikes again", "label": 1}
{"text": "Do you think she would charge her own children rent? Even if they were \"entltied little jerks?\" I know that, even if my child was an entitled little jerk, I wouldn't put them out on the street in a Missoula, Montana housing market (which is really, really bad). That's just bad parenting. And you don't know that the dad didn't try to intervene. It's common knowledge that Land's husband doesn't work and provides childcare instead. There is inherently a power imbalance present in a relationship like that, and I've actually heard rumors that they're getting divorced anyway. But you're making a lot of assumptions in order to defend her, so I'm not going to spend any more time arguing with someone who would rather create narratives around a writer rather than pay attention to what's right in front of them.", "label": 1}
{"text": "Yeah, I get that feeling sometimes with classics. Some of those old texts can be tough to wade through 'cause it's like they assume you’re already a history buff and know all the context. The Travels of Marco Polo is kinda like a bunch of journal entries that don’t always follow a clear linear path; it’s just like lots of “and then this happened” moments. The translations can be a mixed bag, too. One might be all fancy-pants like Victorian and another one might be just a snoozefest of wordiness. And those place names! It feels like they're using a secret code sometimes. When I hit hard parts, I sometimes look up a map from that era online or read some summaries—but not the spoilers—to get some bearings. It’s totally normal to feel lost in those old books, so don’t sweat it! I'm still figuring out whole chunks of books I already thought I understood.", "label": 1}
{"text": "Go fuck yourself\n\nI've worked in community where people struggled to eat and make rent. Literature is a pastime and as important as it is no sane individual rich or poor would put it over necessary expenses.", "label": 1}
{"text": "Yes, that exactly what I said. excellent reading comprehension. ", "label": 1}
{"text": "Vonnegut’s insights are timeless! That blend of humor and philosophy really resonates, especially the emphasis on love.", "label": 1}
{"text": "They should just stop being poor, duh", "label": 1}
{"text": "Lol as if she has the answers to this country's problems! Neither does the other guy but pretending that she does is just stupid.", "label": 1}
{"text": "lmao is she planning on shutting down the department of education and defunding education in conservative cities? no. pretending that trump isn’t vastly worse for this country is just stupid.", "label": 1}
{"text": "That's a cool method! I’ve totally done the whole audiobook and physical book tag-team before, mainly when tackling long or complex reads like that. Stormlight Archive is no joke! What’s been working for me recently: I started reading poetry out loud to myself. It’s random, I know, but it’s become strangely satisfying. I started with Robert Frost and Langston Hughes, just because of their rhythm and vivid imagery. I’ll pause in between verses to just savor the words and it keeps my mind from wandering. Plus, it’s like a mini escape, even if it’s just for a ten-minute break. Another thing, when I read on my Kindle, I use the vocabulary builder to revisit words and phrases I didn’t fully get the first go-around. You don’t realize how much you’re learning till you start doing that. Anyway, sometimes it’s the little tweaks that end up making reading fun again.", "label": 1}
{"text": "Yeah, i don’t know why black people don’t like to read either", "label": 1}
{"text": "I'm very similar in this regard. But do you think it's because you BOUGHT the book? versus just reading the sample on Amazon.\n\n  \nBecause if I'm not impressed with the sample, there's no way I'm buying the book which therefore means I won't struggle with my determination to finish it.", "label": 1}
{"text": "While it's being mentioned, The Hunger Games. The whole series happened because Katniss wanted to save Prim. Guess what happens with zero build-up? Prim getting bombed to shit.", "label": 1}
{"text": "This is such a great initiative! It’s so important to make sure kids have access to books, especially in areas that need it most. ❤️📚 Your efforts to keep the little free library organized and stocked are truly inspiring! It’s heartbreaking to see the disparities, but it’s amazing that you’re stepping up to make a difference. Hopefully, more people will be encouraged to donate and help fill those empty shelves! Keep up the awesome work! 🌟✨", "label": 1}
{"text": "That sounds like such a powerful read! It’s amazing how books by survivors can resonate so deeply. It’s cool that you found one that connects with your experience like that. I’ll definitely add it to my reading list! 📚💖", "label": 1}
{"text": "If I’m struggling to read on my kindle I use the “continuous scroll option” on the iPad app and I find for some reason that helps keep my attention\n\nI’ve also started making “aesthetic” TikTok’s as o read as i like to see what im imagining in the book for example", "label": 1}
{"text": "excuse me. tge only disgusting thing here is you? the author wont translate her book to hebrew? that has nothing to do with gaza. but sure support terrorists. they rape people and drag them throughthr strerts but oh no irsreal retaliated. how dare they. gay palestinians always had to flee to isreal because they would be beheaded but ooh jews bad", "label": 1}
{"text": "Ew\n\nAnyway, free Palestine! 🇵🇸", "label": 1}
{"text": "Troll or just an incredibly bad speller...?", "label": 1}
{"text": "The fact that you come to a book sub and peddle your propaganda and insult people who disagree with you is telling about what kind of person you are and what you believe. I won’t engage with you again.", "label": 1}
{"text": "Only if I really don't like the book and want it over with!", "label": 1}
{"text": "Based", "label": 1}
{"text": ".", "label": 1}
{"text": "# Thanks for sharing your thoughts! It sounds like a powerful read, I'll definitely add it to my list.", "label": 1}
{"text": "They’re animals, they literally shit on the floor in the hallways, they punch and fight the teachers, they have no regard for authority. You tell me how the magical “government” is the answer here? You can’t, because you have no idea how governments work.", "label": 1}
{"text": "Lmao great troll, this is hilarious", "label": 1}
{"text": "No answers, just name calling. Sounds like you went to Baltimore city schools, or you teach there.", "label": 1}
{"text": "I’m only angry because Reddit is full of moronic weak people that drive the country into decadence and decay and corruption and bankruptcy.\n\nYes there has been a time when school age children didn’t shit on the walls or fight their teachers! We would had our asses handed to us and then got worse at home. When we fought is was against each other and when the teacher showed up we ran away.  Teachers don’t break up fights, most schools need a police officer. \n\nTime to delete Reddit again! \n\nHave a nice evening", "label": 1}
{"text": "Hannibal. >!spolier Having Clarice fall in love with Hannibal Lecter completely ruined her character. Silence of the Lambs is one of my favourite psychological thrillers, but whenever I re-read it, I have the fact that Clarice ends up dating a serial killer in my mind.<! Hannibal ruined my experience for re-reading books from the series.", "label": 1}
{"text": "I would really appreciate if you explained why you aren’t responding.", "label": 1}
{"text": "I don’t care about solving the problems of the homeless or society. For all I care we can put them in a death camp. i just care about having usable libraries for my kids. \n\nThe solution IS easy and cheap. Ban homeless people from libraries. There are some legal hurdles with doing this bc libraries are public resources. But if there was a general public will to accomplish this it would be easy to loophole some rules through excluding the homeless from using these facilities as day shelters. \n\nLet’s ship them to Alaska with a bag of fentanyl and the problem will sort itself out.", "label": 1}
{"text": "Enjoy having to make what is probably your fifth account this month. Shithead.", "label": 1}
{"text": "That sounds like a powerful read! 📚 It’s amazing when a book resonates so deeply, especially from someone who’s been through similar experiences. Lauren Hough’s story seems like it really captures the complexity of those challenges. Thanks for sharing your recommendation—I'll definitely keep that one in mind! 🌟", "label": 1}
{"text": "I totally get what you mean! Slowing down to really soak in a book makes such a difference. It’s all about quality over quantity, right? Plus, discussing themes and characters just makes reading so much more fun! Let’s keep encouraging each other to enjoy the journey! 📚✨", "label": 1}
{"text": "Yes it is", "label": 1}
{"text": "I’m not sure what this comment means", "label": 1}
{"text": "Did Hitler actually shoot any Jews?", "label": 1}
{"text": "Instead of being a jackass, why don't you actually answer the question?", "label": 1}
{"text": "He’s definitely not. Read the book. Biden is bending over backward to bring aid to Gaza and to stop Netanyahu’s constant escalations. Biden/Blinken know that Gaza is made up of mostly innocent people who have nothing to do with Hamas. Bibi just lies straight to Biden’s face (or Blinken’s) when Biden begs for him to stop attacking or to let aid reach the Gazans. You wanna be mad at someone, be mad at Netanyahu. And Hamas.", "label": 1}
{"text": "Not by Biden, though.", "label": 1}
{"text": "I completely agree! Taking your time with a book can deepen your understanding and appreciation, it’s all about quality over quantity.", "label": 1}
{"text": "Gaza hasn't had an election since 2006.", "label": 1}
{"text": "Right. When they voted for them.", "label": 1}
{"text": "Many people alive now were not old enough to vote for them. God forbid people defend themselves from their oppressors right?", "label": 1}
{"text": "Their oppressors are Hamas.", "label": 1}
{"text": "Their oppressors are Israel who keeps pushing their boundaries by illegal settlements. Zionists are disgusting.", "label": 1}
{"text": "Bless your heart.", "label": 1}
{"text": "You do know that the Biden and his venerable friends haven’t stopped sending the bombs that have been killing the Gazans, despite Netanyahu not allowing aid through?\n\nIt’s also quite clear that Blinken lied to Congress about Israel allowing aid to Gaza, despite evidence to the contrary, in order to send them more bombs.\n\nIt’s just easier to twist yourself into a pretzel defending the indefensible.", "label": 1}
{"text": "So he's not committing genocide. \n\nGot it.", "label": 1}
{"text": "Genocide takes many forms and denial is one. Aiding and abetting the ongoing wholesale slaughter of innocents and acting morally superior to those asking for him to do more than nothing is wrong and if you think otherwise then I can only assume you do not see Palestinians as real human beings.", "label": 1}
{"text": "> Genocide takes many forms \n\nTrue. \n\n>denial is one.\n\nFalse. \n\n>Aiding and abetting\n\nHow is he \"aiding and abetting\"? \n\n>if you think otherwise then I can only assume you do not see Palestinians as real human beings.\n\nDisagreeing with your asinine take is not the same as not seeing Palestinians as human. Grow up.", "label": 1}
{"text": "Show me some facts and I’ll amend my opinion. Let me hear some in-depth interviews from people working behind the scenes and I will reconsider my opinion. Give me anything other than a silly troll-like response and I will listen closely. If I’m wrong, I want to educate myself.", "label": 1}
{"text": "That’s a fair point, but the situation is more complex than you’re stating here. While I agree that we should not be giving or selling any weapons to Israel, neither do I think that Biden is committing genocide by giving aid to a traditional ally. The main fault lies with Netanyahu and Hamas, both of which can see nothing but blood. Both Israelis and Palestinians deserve peace. And none of this means anyone should vote for Trump.", "label": 1}
{"text": "You could find a lot of reputable sources, I'm not gonna google for you. If you've been wilfully blind during a year of this carnage, I won't change your mind now. Honestly, though, your innocence is sweet. I wish I was this gullible.", "label": 1}
{"text": "You can kill zero people and still be culpable of genocide. Forceful relocation is, by definition, genocide (West Bank settlers).\n\nTrying to somehow pin this on the US and not Netanyahu is a bit of a delusional take, though.", "label": 1}
{"text": "This is the problem with the Internet. I’m asking a genuine question. You seem to have information that I don’t. I’d love to see it. I’m not a Biden apologist; I think he’s made some really serious screw-ups during his time as President (and before). But I also don’t think he deserves the lion’s share of blame.\n\nYou tell me to Google something. Okay, I will. But what am I Googling other than, “This one guy on Reddit doesn’t like Biden”?", "label": 1}
{"text": "Okay, I'll bite. Here is a really good piece on how \"Biden is trying so hard\" is just PR. \n\nhttps://www.columnblog.com/p/the-horrors-of-gaza-wont-end-until", "label": 1}
{"text": "Illegal settlements aren’t in Gaza. Hamas runs Gaza.", "label": 1}
{"text": "Hello!! Im a teacher and have worked with students like this. I have many students who sound similar to your son. Believe it or not, this is normal for a child at his age. However, I’m very happy to provide my tutor services to help in this area! I have wonderful references whom I can share with you and my rates are very reasonable! My email is: adrianakcrespo@gmail.com \nMy name is: Adriana", "label": 1}
{"text": "Thanks for the link! I appreciate it. But even that article shows how this issue is not as cut-and-dried as one might think. Both sides, according to the piece, are guilty of obfuscation and politicking. And while I agree that we should NOT be arming Israel if Netanyahu is only going to bomb Gaza like an addled toddler, neither do I think that Blinken/Biden/Harris/et al. are committing genocide. If anything, they are supporting a madman (Netanyahu), and that should definitely stop.\n\nA better discussion should be about international politics and why we should (or shouldn’t) support traditional allies. But even if Biden were personally responsible for all the atrocities some have mentioned, I still don’t believe that a vote for Trump is warranted by anyone. (I’m not suggesting that this was part of your argument—it just seems to be the undercurrent of this entire thread.)  I seriously doubt I could do better than Biden at handling the issues in the Middle East, but I guarantee you that any random human pulled off the street could do better than Trump.", "label": 1}
{"text": "Completely agree ", "label": 1}
{"text": "Agree. Back then, it was surprising to see younger folks know old TV shows.", "label": 1}
{"text": "Get over yourself. No one has to prove they are retaining information. You sound upset ppl like to read like that…get off your high horse and stop crying about ppl reading faster than you. Your reading speed is not the same as everyone’s. To say someone can’t is just pure nonsense and something you have no proof of and based off of ppl here and also ppl I know…ppl can read that fast and retain the information…I read faster. Always have been able to. If I read slower it actually becomes harder to understand. That may not make sense and I can’t really give you an answer to why that is but it’s how my brain works. You may can’t but others can and they are no less or more than you just bc they have a faster pace…you asked ppl that do read this fast just to reply to them that they actually aren’t taking it all in…sounds like you just wanted to start something bc you can’t do it…it’s not that hard to understand that ppl are different…its so weird to be upset that ppl like to read faster than you…how sad is that? Just bc you can’t comprehend it if you read faster or you can’t finish a book in a day doesn’t mean others can’t. That’s just plain ignorant and laughable as someone who can read faster and definitely retains that information…If I didn’t then I wouldn’t read bc there would be no point…why read if I can’t understand or remember things? There are many ppl downvoting you and replying to your question with actual answers so that right there shows your wrong…most ppl think ppl like you are insufferable…let ppl read how they want to read and don’t cry that they don’t retain information just bc you couldn’t do it…just bc you don’t see it doesn’t mean it doesn’t happen…did you think ppl that read fast and actually understand where gonna reply respectfully to your weird takes? No. Especially not when you reply like that to ppl giving actual answers and you still act like this…you didn’t want an answer to your question you wanted to seem better than other ppl so you came here to start something…there are a lot of ppl that read and to say every or even the majority of fast readers are skimming or not fully comprehending it wasn’t really gonna get you respectful responses. Critical thinking is a good quality to have. You can’t read faster. Others can. Doesn’t mean you’re better or you understand it more (how full of yourself do you have to be?) maybe actually listen to ppl who read fast and who are giving you actual answers instead of downplaying and dismissing them…but I guess you can’t expect much from someone who says things like this bc of their own personal experience and then provides no evidence besides your feelings…if you can’t read fast then that is perfectly fine…just like how reading fast is also perfectly fine. It’s not that deep and yes ppl can retain the information if you believe it or not…my reading speed may be fast to others but to me it’s comfortable…I don’t force myself to read faster it just comes naturally. I read every word on the page bc I don’t make minimum wage to go get a $18 book I’ve been wanting just to skim through…that’s a waste of time and money…and a waste of a good book. Don’t tell me or anyone else if they are able to comprehend it or not bc you don’t decide that. Most don’t agree with you (see ur down votes and replies) but you choose to ignore what ppl are telling you so you can make yourself feel better by trying (but failing) to borderline insult ppl and make them seem less than you…when in reality you just don’t like/cant comprehend fully when reading faster. YOU ARE NOT EVERYONE!!! Get rid of your entitlement and maybe try to actually understand ppl who really find it more enjoyable and can comprehend everything when reading faster. To just tell everyone they are lying (or something in that realm) bc you cant understand it shows your personality as well…readers like you ruin everything for the rest of us bc yall want (but aren’t) better than everyone else. A normal person would come to the conclusion that “others can read faster and enjoy it and that’s ok and it doesn’t make them less…” sorry but I can read fast and I do retain the information. I have friends who read faster or slower than me and they also comprehend it as well…wow…it’s almost like where all different and shouldn’t just sit here and cry bc you don’t want to believe fast readers actually retain information. It really just sounds like you are mad ppl read fast and you can’t so you tried to make others seem invalid to make yourself feel better. Last time I checked ppl read at different paces…you claim to be able to retain and comprehend information from books then maybe you need to do that in other areas of your life as well.", "label": 1}
{"text": "Steven King is 1000 years old, and isn't a terminally online preteen with nothing better to do than endlessly scroll tiktok and 4chan looking for anything to distract them from a constant state of frustrated boredom.     \n     \nYou should just accept you don't need to get every reference as long as you understand the sentiment. Its just not a valuable use of your limited free time.", "label": 1}
{"text": "Don’t be dramatic. We’ve already been through a trump term and what is basically a Harris term. And we’re fine. We’ve been through worse lol.", "label": 1}
{"text": "I mean he tried to overturn an election and if he gets back in he will be surrounded by lickspittles", "label": 1}
{"text": "> I don't understand how Americans are so afraid of the human body....they're being taught to fear it and to loathe being human.\n\nDoes this mean when conservatives are ousted from power, we can see more of [this on broadcast TV?](https://www.youtube.com/watch?v=jizGtDn6p3M).  Progressives have removed most so-called \"indecent and profane content\" from broadcast TV.  Young kids channel surf, right? Apparently many people don't see the issue here.", "label": 1}
{"text": "It’s interesting how pop culture references can really date a character, especially in a story aimed at younger audiences. It’s like King is pulling from his own childhood instead of what’s current for teens today. I get why it would be distracting—kids today definitely don’t reference Laurel and Hardy! 🎬 It might make the characters feel less relatable and more like they’re from a different era. Have you read any other recent books where the teen characters felt more authentic? 📚", "label": 1}
{"text": "Sounds like you really enjoyed \\*War\\*! Bob Woodward has a talent for making complex political topics accessible. It’s great when a book feels engaging rather than heavy. If you're thinking about diving into more of his work, \\*Fear\\* and \\*The Price of Politics\\* are solid picks! What did you think about the characters he portrayed? 📚✨", "label": 1}
{"text": "It sounds like you’ve hit on a real issue with King’s writing! 🤔 His style can definitely feel out of touch when it comes to how kids and teens speak today. While nostalgia can be fun, it can also pull you out of the story if it feels forced or outdated. It’s tough when references don't resonate with the younger audience, and it makes you wonder how well he connects with that age group now. 📚✨ What did you think about the overall plot despite those quirks?", "label": 1}
{"text": "🤣", "label": 1}
{"text": "Well I thought the election was important this week but YOU, Comprehensive-Fun47, I just don’t know now 😥", "label": 1}
{"text": "Not for me. I know myself.", "label": 1}
{"text": "I've had a library card for 52 years. I've never lost or damaged a book and I take them everywhere.", "label": 1}
{"text": "Right on. It’s easy to feel lost the first time around. The story is so big that it can be hard to get into without knowing what to expect. Reading it again makes all those complex parts fall into place, and by the third time, it’s like discovering new details in every line. The way it’s written can still be tough to adjust to at first, but once anyone finds the flow, the deeper meanings really show. The mix of real-life themes and its mark on sci-fi and fantasy is huge. So many famous stories today, even \\*Star Wars\\*, borrow from it. It’s layered, tough, but worth it. And calling it \"easy\"? That’s surprising.", "label": 1}
{"text": "I totally get it! Bringing a library book feels risky but can be so worth it. It sounds like your trip turned out to be a fun adventure with that book! I love the idea of pressing a leaf in there too—it’s such a sweet keepsake. I’ve definitely taken library books on vacation, and they always make the trip feel cozier. Who else has some wild stories about their library books on the road? 📚✈️🌿", "label": 1}
{"text": "It is. It’s a superb example of literary setting, and the main character is meant to disgust you, but you find yourself strangely identifying with him, then being revolted by the fact you were doing so. You’ll find him “normal” enough because of the messed up world he lives in, and the deplorable things he encounters but doesn’t participate in. \n\nFor example, SPOILER: he comes across a rural homestead where a teenage girl is being repeatedly raped by her brothers and father, and is so desensitized to sexual violence that she basically looks at the just-arrived protagonist and says something akin to, “you too?” As if her default interaction with a male human involves him putting his penis inside her.", "label": 1}
{"text": "Dollface by Ryan Powell. It's a short story that I read very recently. A pedophile is tortured to death in it by his teenaged victim and his sex doll who becomes sentient because she's come in contact with virgin blood. Even though the perpetrator receives the retribution that was coming to him, the whole thing still made me feel very dirty and has kind of turned me off of extreme horror as a genre tbh. ", "label": 1}
{"text": "Take my begrudging up vote", "label": 1}
{"text": "Throw in some ebonics and you're on to something. Dis ting mandems yute", "label": 1}
{"text": "I thought this book was one of Johnson's 3 masterpieces, up there with Jesus' Son and Angels.\n\nI LOVE the part where Grainer \"would sometimes sing to himself. Then he remembered that he was a sad man and stopped.\"\n\nIt broke my heart. The way those evil Canadians (and I am Canadian) told the Native guy that if you drink beer with lemonade you won't get drunk because the citrus kills the alcohol's effects? The Native who'd never been drunk before in his life? Who then comes to a very bad end because of he believed those Canadians? (There's a line in the story about it being the 20s, and Prohibition was in effect, so Canadians were considered \"experts\" when it came to booze.)\n\nGreat story. The ending was a little perplexing to me, but I still think about it.\n\nIt was a fantastic portrayal of a lonely man living a lonely life. Johnson is usually at his best when he's writing about men forced into intimate proximity when they don't want to be (military life, drunks drinking at a bar, inmates in prison) but this one was just a solitary guy who lived well into the 20th century but never really joined it. There's a line somewhere near the end that mentions he'd never ever used a telephone is his life. Which isn't THAT shocking. I can think of two pertinent quotes here:\n\n**\"The future is here. It's just not widely dispersed.\"** \\- Some tech bro deep into life extension techniques and whose house is set up like it's from the year 2089.  \n  \nSo Grainier was still living like it was the 1890s well into the 20th century because it was all he knew. Then there's this quote about the past:\n\n**\"From the beginning, we find evidence of a deep continuity that is the legacy of an unimaginably distant past. The nation itself represents the nexus of custom with custom, the shifting patterns of habitual activity. This may not be a particularly exciting philosophy of history but it is important to avoid the myth of some fated or providential movement forward. Below the surface of events lies a deep, and almost geological, calm. . . . We still live deep in the past.”** \\- Peter Ackroyd\n\nTrain Dreams is a book I will always treasure. There's nothing like it in Johnson's corpus and nothing like it, that I've read, in American lit. Sometimes a Great Notion has a lot of logging but there's a lot of social interaction going on. The most social interaction Grainier gets is with the she-wolf and by howling at the other wolves at night.\n\nNot sure the book is about madness. I think Grainier has been on his own for so long that she thinks the she-wolf is his daughter when really she isn't. Isolation can warp things. Ideas pop into your head and you start believing them. Byt your reading is def fascinating, I'm not taking anything away from that.", "label": 1}
{"text": "I put down The Only Good Indians after \\*spoiler\\* the bike death and didn't pick it up again for four months.", "label": 1}
{"text": "Author: \\*spends years meticulously crafting the perfect emotional journey\\*\n\nReader: \"DURR MY ANXIETY\" \\*skips to the last page\\*", "label": 1}
{"text": "The most confusing story I've ever attempted to read was probably Shakespeare's Romeo and Juliet. I didn't understand one god damn word. We were forced to read it in high school, aloud, in class; each student taking turns reading a passage. The teacher had to pause frequently to explain what every single phrase meant, because none of it was coherent to our contemporary ears. Suffice to say, I retained absolutely *nothing* of the story that way.\n\nThe story that made me physically angry was SevenEves, because the author is so full of himself that he thought it was a good idea to waste every other page with the most useless, pointless expositions about physics. I was not able to finish the book, because by the beginning of the 3rd act, I became physically angry and threw the book in the trash.", "label": 1}
{"text": "OP, I have read both those books you mentioned and still neither come close to 'Dead Inside' by Chandler Morrison. I don't even want to know how he came up with those ideas. No, I would not read it again, but yes it was an interesting experience and I hope I don't come across anything that could top it... Overall, what made me able to get through it was probably the fact that it felt made-up enough not to haunt me in the ways very real-feeling things can...", "label": 1}
{"text": "Could you elaborate? Know too much of what? ", "label": 1}
{"text": "There could be deeper truth. There's a deluge of information we can't really handle and books are a form of an information. For example.\n\n\nIf books used to be our primary source of knowledge, one can easily say, it isn't the case anymore. \n\n\nJust recently we were very positive about positive uses of tech. I have an old Wired magazine that says how we'll evolve into super-powered multitasking brainiacs over tab-bing and app-ing. We gave our kids devices because they'll invent their own media, language, rules. (It's clear now that it didn't happen. So now what?)\n\n\nThen, there's the negative view. Why educate if education is superfluous? Chamber music on the Titanic, really. ", "label": 1}
{"text": "Ha. You are the only one calling my bluff. However, I don't agree with the Titanic part. These quirky, weird younger generations might still grow into devilishly smart adults. Maybe they are transitional and quite unique given that no generation has ever experienced the ride they are on... nobody knows. If they write/read books of knowledge and pleasure, they will hopefully be brand new.", "label": 1}
{"text": "TLDR?", "label": 1}
{"text": "I get really frustrated when characters make decisions that feel completely out of character or unrealistic it breaks the immersion, things like overly predictable plots or cliché characters can definitely take away from the enjoyment.", "label": 1}
{"text": "Yes, maybe there's more to it. These brands have built up so many connections and meanings that they almost take on a life of their own, like his mystical figures. It’s been a while since I last read Murakami, so I can’t say for sure why he includes them so much, but it’s an interesting point to ponder.", "label": 1}
{"text": "I've read a lot but no book was as mind numbingly boring and just outright shit as \"the curious incident of the dog in the night time\", except perhaps \"kung fu high school\". These books are not made by or for functional adults.\n\nWeirdly, \"this book is full of spiders\" (two or three books) are laden with disturbing stuff, but couldn't put it down.", "label": 1}
{"text": "Come on man, does my content look like spam?", "label": 1}
{"text": "Nice edit to your comment", "label": 1}
{"text": "Did you comprehend anything else that was said?", "label": 1}
{"text": "Yes, it was still not relevant to what they were saying, and a snarky (“not to be snarky”) response to a parent trying to defend themselves. I didn’t feel the need to respond.", "label": 1}
{"text": "It was relevant, it was not an attack, and saying \" not to be snarky\" isn't calling someone else snarky per your own accusations based on misreading what I said. \n\n\nAnd you're just being defensive over it. It's kind of weird, actually.", "label": 1}
{"text": "The fuck?", "label": 1}
{"text": "Lil bro thinks КПРФ is not allied with Putin. Go back to your hole, tankie or whoever the fuck you are. Russian troll farms wouldn't even hire morons like you.", "label": 1}
{"text": "The thing is, there are plenty of right wingers who read. \n\nIt'd be nice to think that just being smart is enough to make a person empathic and politically decent. But it isn't. Smart people are just as prone to conservatism as anyone else.\n\nRemember that during the time the USA legally permitted slavery rading was the ONLY form of home entertainment that existed. \n\nBooks are great. But they're not a cure all for society's ills.", "label": 1}
{"text": "People should read more fiction written from diverse perspectives.", "label": 1}
{"text": "Sure. But now we're getting well past just reading in general, and even that's not going to convert many people. \n\nIt's startling sometimes just how much people on the right and avoid critical analysis.  Look at all the right wing people who were baffled and hurt when they found out that Rage Against The Machine is leftist. Or that Springsteen's \"Born in the USA\" is not a jingoistic anthem.\n\nThey're the kind of people who can watch Star Wars and think the Empire represents liberalism and the rebellion is conservative.", "label": 1}
{"text": "Well sure. It happens all the time. But I don't read books to make friends. If it's a well-written and interesting tale, and the character's actions make sense in the context of the type of person they are, and in service to the story, it doesn't matter if I \"like\" them or not. In fact, in the days prior to seeing people's so-called \"reviews\" of books in places like Goodreads or this subreddit, it never occurred to me that so many people would struggle with a book if they couldn't \"relate\" to the main character. To me, those folks are missing out on some great literature.", "label": 1}
{"text": "I knew her fate because of cultural osmosis. I remember thinking as I was reading, \"Throw yourself in front of the train already!\"", "label": 1}
{"text": "I don't care, ban me", "label": 1}
{"text": "Painting with a pretty broad brush there, aren't you? I have a group of eight friends (nine, including me) friends who are pretty politically diverse. All of them, from the furthest left to the furthest right, are intelligent, empathetic, and politically decent. We sometimes disagree on things, but we more-or-less agree far more often than not. I can assure you that some of us voted differently today, but I can also assure you that each of us did what we honestly thought was right. \n\n\nAnd, regardless of who wins the election, the nine of us will still meet up on Friday at our whiskey and cigar club and have a great time in each other's company.", "label": 1}
{"text": "This person will not answer, cause they don't speak or read Russian, have not lived in Russia and do not talk to Russian people, have only read tankie propaganda on some shitty subreddit and have basically only one take, which is \"America bad, therefore anything which is not America is good\".", "label": 1}
{"text": "Being able to not care about politics is a privilege of those who won't be hurt by it. \n\nAnd of course people voted for what they think is right. People more or less always either do what they think is right, or what they think is wrong but necessary. That's how humans are. Every Nazi did what they thought was right/necessary. Every Bolshevik who participated in the Red Terror did too. Every Confederate soldier. Every Imperial Japanese Army soldier. Every single terrorist on 9/11. Both Hamas and Israel are doing what they think is right/necessary. \n\nSo the part where Trump voters think what they're doing is right/necessary is not anything special. No one thinks they're the baddies.\n\nBut you can't vote for Trump and be politically decent. And I can't be friends with someone who thinks the lives and safety of my LGBT friends, my Black friends, and my female friends are expendable.\n\nPoliis not some dry academic debate. It's life and death for some people. So no, I don't think your willingness to go have whisky and cigars with people who, for whatever reason, are OK with hurting all the people Trump will hurt is something to be proud of.\n\nBecause what you're really saying is that the lives of Trump's victims don't matter to you.", "label": 1}
{"text": "Cool. 👍", "label": 1}
{"text": "This is honestly so sad. Kids missing out on books means missing out on imagination, empathy, and so much creativity. We need to bring reading back! 📚❤️", "label": 1}
{"text": "I read it and it's a piece of shit", "label": 1}
{"text": "I only care when they’re gay. Why would I care if they’re straight? I’m straight. ", "label": 1}
{"text": "Wow you’re a jerk and a loser.", "label": 1}
{"text": "That's right. If you bother to check this thread again, who exactly is receiving this kingly gift?", "label": 1}
{"text": "Ducks*,* Newburyport can feel overwhelming with its stream of consciousness, but it’s also a fascinating deep dive into the mind. Keep going it’s definitely a unique experience!", "label": 1}
{"text": "I read Ducks, Newburyport a while ago, and it’s a really intense experience. The stream of consciousness style can be overwhelming, but there's something so captivating about it that keeps you hooked. It’s a huge book, but there’s this weird pull to keep reading despite the lack of traditional structure.", "label": 1}
{"text": "Ugh, I tried reading this one too, and I had to put it down after the big reveal. It felt like the author was more interested in pushing an agenda than actually telling a good story. The characters didn't make sense at all, and it really took me out of the experience.", "label": 1}
{"text": ". I didn't enjoy this book at all. The characters were shallow, and the plot just didn’t work. I didn’t get why it had such high ratings. It felt more like a soapbox than a thriller. The twist especially was poorly executed and unnecessary.", "label": 1}
{"text": "Yes, I know exactly what you mean! Ducks, Newburyport is a wild ride. It’s so long and the stream of consciousness can feel like a never-ending loop. But there’s something strangely compelling about the way the author captures a person’s mind in that state. You’ll probably feel overwhelmed at times, but I think that’s part of the experience.", "label": 1}
{"text": "[https://honwix.com/ebook?b=ca7cbcb0167](https://honwix.com/ebook?b=ca7cbcb0167)\n\nfree", "label": 1}
{"text": "That book was a mess! I don’t know how people are giving it good reviews. It was so hard to follow, and the characters didn’t even feel real. I just couldn't get past how poorly written the entire thing was, especially that one twist. Definitely not what I expected.", "label": 1}
{"text": "Oh man, this book. It’s definitely a challenge, especially with the writing style, but I found it really interesting. It takes a while to settle into the rhythm, but once you do, it’s kind of like you’re in this person’s head completely. I don’t know if I could read it all in one go, but there’s something hypnotic about it.", "label": 1}
{"text": "Be mad 😠 at all the fake news and fake people who constantly lied to you and brainwashed 🧠 💧 🚿 you into thinking President Donald 🇺🇸 Trump was something he was not. It was Democratic propagandists, they have degrees in Psychology. The first step into recovery is to admit you were brainwashed. Avoid people who constantly use the words: \"racist\" \"dictator\" \"hitler\" \"bigot\" \"sexist\" \"felon\" \"grapist\" and \"misogynist\" these are all trigger words to evoke an emotional response from you. Unplug TV/internet, go outside and touch the grass. 🌳 Get a bus ticket and move to the country if you have no grass. Choose to become Happy 😃", "label": 1}
{"text": "It’s fine. The reality is more people wanted him that didn’t. People here need to stop acting like this was somehow forced on the American people by stealth or some bs.", "label": 1}
{"text": "Wrong sub bro. Go cry in one of the politics subs.", "label": 1}
{"text": "The Trump election is bad but this is so over dramatic. ", "label": 1}
{"text": "People are taking away your rights but it’s fine, shut up, sit down, and accept the threat of deportation or death. The people have spoken. ", "label": 1}
{"text": "Women are dying in red states. That’s pretty dramatic. ", "label": 1}
{"text": "Take your crybaby political whining somewhere else. This is a book sub.", "label": 1}
{"text": "They said all the same crap during his first term too, and we're all still here, lol.", "label": 1}
{"text": "Thank god Trump won.", "label": 1}
{"text": "UK Government just took away winter fuel payments for like a million pensioners, some of them might freeze to death, no one is out on reddit saying \"omg that's worse than the hunger games!\" ", "label": 1}
{"text": "How many of his bold claims came true last time? How's that wall coming along? ", "label": 1}
{"text": "Tell that to the many people that died of Covid-19 or were tormented in his first presidency that turned to suicide as a way out.", "label": 1}
{"text": "Exactly", "label": 1}
{"text": "Dying, how?", "label": 1}
{"text": "I tested with college level reading and comprehension by 4th grade.  I can speed read 300+ pages in an hour.  I read everything I can get my hands on, non fiction and fiction. I'm a latina. And I like Trump. Generalizing on how dumb, racist, sexist, poor Trump supporters are is what lost you the election.  Maybe don't be so high and mighty next time and you won't alienate over half of the country.", "label": 1}
{"text": "Cruddy by Linda Barry", "label": 1}
{"text": "Hi! Please make the effort to answer your own questions with enough detail to get a discussion going and to give something to other users to respond to. Let us know if you have edited your post.", "label": 1}
{"text": "🏆", "label": 1}
{"text": "Went to your profile in hopes of finding an intellectual but utterly disappointed.\nI guess books can't help everyone.", "label": 1}
{"text": "I’d look to your own house before you criticize others…", "label": 1}
{"text": "I don't happen to be supporting any genocide so...", "label": 1}
{"text": ">Speak for yourself \n\nWhat do you think I'm doing?\n\n>If anecdotes are acceptable, so are ones that don't align with yours.\n\nYou don't know what an anecdote is do you? You're remarkably dumb for someone so arrogant.", "label": 1}
{"text": "Neither do I - but it is hilarious that you needed to find a year old comment of mine to seek to engage with me.\n\nUnfortunately for you, I don’t engage with antisemites nor those who treat their servants as less than human.\n\nSo again, look to your own house before you cast stones.", "label": 1}
{"text": "You don't though do you? You haven't told one. And there you go again downvoting as if that proves your point. Lol", "label": 1}
{"text": "Sigh! You're boring me now. Either provide the anecdote or accept I don't want to talk to you anymore. Is it \"My nephew skateboards\"? Is that your \"anecdote\"?  Which you didn't reply to me, you're confused again.\n\nAnd also isn't an anecdote, but that's OK. You don't know what an anecdote is", "label": 1}
{"text": "GTFO", "label": 1}
{"text": "I've edited the post to include more details about my experience", "label": 1}
{"text": "You need to include details specific to the book. Not general statements that can be applied to many books.", "label": 1}
{"text": "I feel like King did well with Jack in The Dark Tower series, but the time period was more familiar to king. I imagine many authors struggle with this as they age. It doesn't really bother me though, I just enjoy the anachronism, and the King's style. Maybe it's because I'm in my mid 40's myself, but I find a lot of newer science fiction and horror to just not hit well, and I go back to King for comfort.", "label": 1}
{"text": "In an effort to reduce the amount of spam in /r/books, this post was removed because your account is less than 1 day old (we get a lot of spam from newly created accounts). Since you look new to reddit, please be sure you have read through our [**subreddit rules**](http://www.reddit.com/r/books/wiki/rules) before participating in the community. If you have any questions or think your post should be reinstated, please [**message the mods**](http://www.reddit.com/message/compose?to=%2Fr%2Fbooks).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/books) if you have any questions or concerns.*", "label": 1}
{"text": "That sounds ridiculous. I agree that racism has become the default conclusion anytime someone POC isn’t immediately handed the keys. It’s ridiculous. And it’s half the reason Kamala lost.", "label": 1}
{"text": "OP provided a great analysis of the common activists habit of looking at everything though the lens of their narrative.\n\nDon’t get the job? Don’t get a raise? People don’t agreeing with your arguments? Getting a ticket for speeding? Must be racism, sexism or such. Dare to disagree with that analysis? Because you don’t „get it“, are a racist, sexist, etc. ", "label": 1}
