{"text": "If it’s illegal, the entire Con party and them now this team are facing jail time lmao", "label": 1}
{"text": "> On the other hand, anyone who volunteers to help defeat an evil Islamist regime and rescue its sex slaves\n\n[Come again?](https://www.thenation.com/article/world/sde-teiman-detention-camp/)", "label": 1}
{"text": "Why do you sympathize with terrorists?", "label": 1}
{"text": "You clearly don't understand economics deeply if you think having a deficit is awful.", "label": 1}
{"text": "\"With the first link, the chain is forged. The first speech censured, the first thought forbidden, the first freedom denied, chains us all irrevocably.\" - Star Trek said it best in the Drumhead.\n\nI am standing up for our rights.  If you view that as 'sympathizing with terrorists', that speaks more to how little you value our charter than anything about me.", "label": 1}
{"text": "you asked an overly simplistic, bad faith question, and I'm doing the exact same to you. \n\nOP did not in any way say they were against any freedom of expression. If you can't take bad faith questionning, don't be giving it.", "label": 1}
{"text": ">OP did not in any way say they were against any freedom of expression. If you can't take bad faith questionning, don't be giving it\n\nYes, they are.  \n\nAnd by their stated words, anyone who chants \"Death to Canada\" should be punished for it.  I am against such a heavy handed approach to speech, and our own courts and government have sided with me on that.\n\nSo.. by all the rights afforded to me as a proud Canadian, \"Death to Canada!\"  I'm going to go burn a Canadian flag this weekend, as is my Charter right to do so.", "label": 1}
{"text": "Last time I saw this clown's face he was trying to sell me on the barbaric practices snitch line.  Takes nerve to be the biggest embarrassment in Canadian election history (so far) then expect to be taken seriously.  Also do not remember ever seeing any material by the reporter that would indicate the claims would be true.  So I am going to balance a 40 year career against the others who has shown me his character in neon lights.", "label": 1}
{"text": "If you somehow take “you’re done, gtfo” as a “heavy handed” approach or asking for punishment, I don’t know what to tell you. OP is allowed to not like it and is expressing their own freedom of expression.\n\nIf you twist that into thinking they’re somehow against charter protections, I don’t think you know a whole lot about a whole lot.\n\nTake some pictures while you burn the flag, just to make sure you really school us mere mortals who hate freedom.", "label": 1}
{"text": ">If you somehow take “you’re done, gtfo” as a “heavy handed” approach or asking for punishment, I don’t know what to tell you. OP is allowed to not like it and is expressing their own freedom of expression.\n\nAdvocating for the exile of people who express themselves in a way you don't like, is punishment.  If they're just expressing a distaste for it, then I have no issues.", "label": 1}
{"text": "Do you realize why many of these people are living in these locations? There are countless instances of the proto-Canadian government authorities displacing these people from their traditional lands and into the most inhospitable places. Now making the excuse that it’s too expensive to provide basic necessities to these places exposes the ugly truth behind Canada’s birth", "label": 1}
{"text": "It is a deeply ignorant comment, on multiple levels. I think it's best not to encourage them, assuming your admirable attempt to educate doesn't work out.", "label": 1}
{"text": "You're not just a clown, you are the whole circus. Everything you say is projection of things you are doing yourself.", "label": 1}
{"text": "Removed for Rule #2", "label": 1}
{"text": "Please seek help before you overdose on hypocrisy and projection. This is honestly sad and is bumming me out.", "label": 1}
{"text": "“Sure, Canada has declining living standards, but the top line numbers have been manipulated to look okay to economic illiterates.  If you point out flaws in our analysis we’ll call you racist and misinformed.”  - LPC", "label": 1}
{"text": "Well I have a theory as to why such a huge amount of Indian immigrants came this round & it all ties into the CSIS report of the Conservative corruption of interference of Leadership race to place Pierre Poilievre in that role (plus other compromised Conservative members), etc. \n\nSo ya, we need to OBVIOUSLY have a better balance of ethnicity coming in.", "label": 1}
{"text": "Government will respond by continuing to let in hundreds of thousands of them into the country.", "label": 1}
{"text": "Sikhs aren't Indian, and racism against them is why the Indian government feels comfortable doing this.\n\n\nThe fault lies with Canadians as well. ", "label": 1}
{"text": "People need to not comment about communities they don't understand. Sikhs aren't a \"race\", it is a religion that nobody else is barred from converting to.", "label": 1}
{"text": "We should shift our immigration away from India. We have to put up with their cultural baggage, and then be humiliated by their country on the international stage? India is not a reliable partner.", "label": 1}
{"text": "I think immigration is irrelevant here tbh.", "label": 1}
{"text": "I don’t. We need to punish India and this is one of the easiest things we can do that will solve our own problems with Indian migrants while also sending a signal to India. Indians send lots of money to family members in India. Those remittances will no longer be coming in if we stop bringing in more people from India. Hit them where it hurts, while benefiting our own country.", "label": 1}
{"text": "Come to think of it immigration is relevant for one reason.   \n  \n1.Why is Canada involved in a fight  about the establishment of a theocratic state in some far away land?\n\nBut other than that canada's remittences etc are a drop in the bucket and if anything Canadian colleges stand to loose their sources of funding and housing prices might drop is foreign inflows stopped.", "label": 1}
{"text": "Weird. I am from south east Asia. We love trump here. BTW try ask India. Who that they love. Better yet ask their PM. Blackface justin or trump. I can elaborate on why we like Trump and why we hate weakling like Kamala and Biden and blackface Justin. ", "label": 1}
{"text": "GB News should be auto-banned as a source.", "label": 1}
{"text": "Take your meds man.", "label": 1}
{"text": "Or the not-insignificant amount of the conservative base that actually likes this shit.", "label": 1}
{"text": "The blue wall is starting to fall. ABC'S are starting to take back Canada.", "label": 1}
{"text": ">LOL - OF COURSE this is a piece by Aaron Wherry. The man is a walking, talking Liberal Party sycophant. \n\nCBC\"s chief political reporter wrote a hagiography for Justin Trudeau. Let me know if any of this is a surprise to anybody.", "label": 1}
{"text": "It wasn't that level but the about face is more about them realizing the hole they're in.", "label": 1}
{"text": "Ah yes, because nothing says 'saving a legacy' like trying to appease everyone at once. Can’t wait to see how they juggle the opinions of everyone while maintaining a straight face! Bravo, Trudeau!", "label": 1}
{"text": ">*I'm not mad BC I'm just disappointed.* \n\nwow, how sanctimonious of you!   Almost 9 out of 20 British Columbians think otherwise, but I guess that makes them stupid for voting Blue.", "label": 1}
{"text": "So no one ever makes the wrong choice?", "label": 1}
{"text": "Figures the NDP echo chamber here would downvote this point.", "label": 1}
{"text": "Yuuuuuuuuup!", "label": 1}
{"text": "Great! I'm also fine with the ban.", "label": 1}
{"text": "I don't care about Indians killing each other, as long as it doesn't affect me.", "label": 1}
{"text": "It will be a sad and scary day in Canada if pp gets elected! And to everyone voting for him, careful what you wish for!", "label": 1}
{"text": "wow conservatives making up scenarios and slogans. nothing new when your head is that empty", "label": 1}
{"text": "your NDP tag always makes me laugh.", "label": 1}
{"text": "please explain.", "label": 1}
{"text": "There are still a couple people like thescientus and hopoke that are either very dedicated trolls or very partisan liberals that live in a different universe", "label": 1}
{"text": "Nah I'm good.", "label": 1}
{"text": "I agree. PP really should get that security clearance or he’s gotta go.", "label": 1}
{"text": "It's 2024, food banks shouldn't exist. \n\n\nAbolish them and fix the issues first hand. Guaranteed livable income and food waste.", "label": 1}
{"text": "Careful there,  crybaby will hit the report button on you. ", "label": 1}
{"text": "Don't bother, they are known propagandist/ troll on the sub", "label": 1}
{"text": "She's a longtime grifter selling books, nothing more.", "label": 1}
{"text": "Says a lot about the state of Canadian conservative parties that all of them are near universally afraid of when Trudeau is no longer PM.", "label": 1}
{"text": "I hate how some people have such limited knowledge of the SNC Lavalin case that they think Trudeau wanted the charges dropped. \n\nAnyways it doesn’t matter JWR didn’t follow what Trudeau wanted and because of it SNC Lavalin got let off with a slap on the wrist.", "label": 1}
{"text": "The brain rot from the south always eventually works it's way up here. We're just on a slightly delayed track of bat-shit", "label": 1}
{"text": "Who cares if 280 of the 300 households we serve per day Canadians in need. 20 might be betting a free lunch! Good for you for sticking to your principles of definitely not helping anyone.\n\nHow about donating adult diapers? We always need those. Or are you worried that an international student might want those, too?", "label": 1}
{"text": "Why is she in the UK?  I thought her boyfriend was an Ottawa doctor. ", "label": 1}
{"text": "It is petty and pathetic.\n\n“Don’t criticize me, I have a family”\n\nSo step down then, don’t do the job. Canadians would actually prefer that outcome. I don’t know what he’s trying to do here aside from a very cheap sympathy ploy.", "label": 1}
{"text": "How many families has he destroyed with his policies? ", "label": 1}
{"text": "It's a subtle attempt by JT, to stop criticism.", "label": 1}
{"text": "Tbf, a career in public office looks toxic and  terrible nowadays. The amount of name-calling and targeting is insane and wouldn't be acceptable for any other normal job. \n\nI can't help but think that we're pushing out qualified and genuine people away from politics because it simply isn't worth the headache.", "label": 1}
{"text": "Pierre says he gets death threats often and has similar concerns. Electing someone to run the government does give you the right to make threats.", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Yeah, what a coward. He should man up and never mention the swarms of inbred morons, frothing at the mouth because daddy Putin told them he is the real authoritarian. That’s just part of the job.", "label": 1}
{"text": "Criticism = Threats, got it.", "label": 1}
{"text": ">Yes, Canada has even had to had information session with Indian officials to teach them what counts as evidence\n\nOh yes, Canada has great respect for the concept of \"evidence\" like when the Canadian government stood by twiddling their thumbs ignoring all warning from the Indian government and their own intelligence and allowed a plane full of Indians to blow up. And then destroyed all evidence against the perpetrators leading them to walk free.\n\nYes, it's clear how much Canada values \"evidence.\"\n\n>Yet India continues to fail to provide evidence.\n\n# [Congress leader shot dead in Punjab, Khalistani terrorist takes responsibility](https://www.indiatoday.in/india/story/congress-leader-shot-dead-in-punjab-baljinder-singh-balli-khalistani-terrorist-arsh-dalla-2437449-2023-09-18).\n\nLmao. Khalistani terrorists in Canada are openly boasting about committing murders in Canada and Canadians are still screaming their heads off about No EvIdEnCe.\n\nMeanwhile Trudeau keeps screaming about EvIdEnCe and yet all he has to show is TrUsT Me BrO.\n\nWhen India was attacked by Pakistani terrorists, Indian intelligence laid a damning trail of evidence back to Pakistan for the whole world to see, complete with the villages that the attackers originated from. It took Canadians a whole year to find the assassins who never left Canada in the first place.\n\nAnd till date nobody has seen the evidence that Canadians keep screaming about. The only evidence is their continuous refusal to extradite Khalistanis.\n\nOh, and let's not forget the fact that the murderer of the founder of Bangladesh was given sanctuary in Canada.", "label": 1}
{"text": "Its a lot harder to feel bad for Pierre when the majority of his political career is devoted to stoking anger, fear and hate and the other part is actively voting to take the rights away from minorities he doesnt agree with.", "label": 1}
{"text": "The actions of the Trudeau government over the last 10 years have meant that people can't buy a house, can't afford food, can't find a job, ...   \nHe's shown his own morals by dressing up in blackface, groping a woman, and his countless scandals \n\nSorry Justin, any flack you get is well deserved.", "label": 1}
{"text": "this. \n\nand then he wonders why even his own party hates him. \n\nbut oh wait, its PP's fault for \"stoking anger\"....fucking bullshit.", "label": 1}
{"text": "So you're saying anyone you perceive as having done a poor job should expect widespread abuse and harassment, and even their family are fair game?", "label": 1}
{"text": "We can't expect standards for one and not the other. No one should be receiving threats or harassment and certainly not their families.", "label": 1}
{"text": "I'm saying that if you're in a position of power and you fuck up generations of people, you shouldn't be surprised when people hate you.", "label": 1}
{"text": "No one should be receiving threats and I didnt say they should. I said I dont feel bad for Pierre because his, and the politics of those in his party, are a MASSIVE contributor to why those threats happen and because of that I dont feel bad for him. Reading comprehension is a wonderful thing", "label": 1}
{"text": "You can look it up, she was getting followed by the media at a hotel. She was drunk and had absolutely nothing to say nice about her father.", "label": 1}
{"text": "And somebody else won’t feel bad for Trudeau because in their eyes he has done the same thing.", "label": 1}
{"text": "Youre right, there will be people who feel like that. But for all Trudeaus faults and bad policy, if you think he uses fear mongering and hate as a political tool to anywhere near the amount that the CPC does, youre a fool and thats all there really is to it.", "label": 1}
{"text": "What do you mean “feeling bad” doesnt come into things when you replied to my comment which was VERY SPECIFICALLY about me saying I dont feel bad?", "label": 1}
{"text": "I’m very chill, calmed by the polls. Why would anyone need to attack him physically when he’s clearly on the way out ? I’m just have little sympathy for a man who’s had so little for the people he was supposed to be serving. I voted for him twice.\n\nI’m not going to pretend the mean words these people have to hear are acts of terrorism. \n\nWhen Pierre gets in, people like yourself will flip 180 degrees on this position.", "label": 1}
{"text": "How did I get negative 5 votes for this? I simply stated the truth that it is on video record for all to see. I didn't pull this out of my ass...it even made the news circuit on mainstream news.", "label": 1}
{"text": "I think you need to back up your claims with a link to an article or the actual video clip before anyone can believe you.", "label": 1}
{"text": "Which members called him a dictator, and link the quote of them saying it.", "label": 1}
{"text": "https://youtu.be/Hh4bBcI0NHI?si=ESm2fczQjwlhyR62", "label": 1}
{"text": "Feel free to link that video at any time...", "label": 1}
{"text": "https://youtu.be/d0utez-KFak?si=-42_gT--OUcSBNZV", "label": 1}
{"text": "Thanks for providing the link. Just watched it. \n\nA couple of things though.  No where did she criticize her dad.  That person was stammering on about how she got her dad to get her a trip to Jamaica. \n\nNext, more than half the comments to the video is saying it’s not his daughter.  I don’t know if it is or not but regardless, the provided video doesn’t back up your claim that his own daughter is saying anything bad about her dad.", "label": 1}
{"text": "A “nice narrative”, as that stalker idiot on the beach in Tofino said.", "label": 1}
{"text": "> Pierre says he gets death threats often and has similar concerns. \n\nSince when? Given how much he attacks others, inciting death threats against his political opponents, I find that hard to believe.", "label": 1}
{"text": "> When Pierre gets in, people like yourself will flip 180 degrees on this position.\n\n\nNope. This is just another excuse, thinking that everyone else will act the same so it's okay for you to do it.", "label": 1}
{"text": "MCGA? \n\nSeriously? Sod off.", "label": 1}
{"text": "This is honestly the most infuriating part.\n\n\nNobody was throwing rocks at Harper or planning assassinations, no matter how badly he botched things. Both sides are not the same.", "label": 1}
{"text": "Meanwhile we're all out here living with how his incompetent rule affects our families now and for years to come.", "label": 1}
{"text": "All I’ve done is point out the guy’s failings, which people like you will absolutely partake in once he’s PM (as will I). To equate criticism to calls for violence because you don’t like the tone is childish.", "label": 1}
{"text": "Onguardforthee will just say it was Russian bits who voted lol", "label": 1}
{"text": "Because it looks nothing like her? \n\n  \n[https://www.instagram.com/p/DBFlBWnMmQ-/?hl=en](https://www.instagram.com/p/DBFlBWnMmQ-/?hl=en)\n\n[https://www.instagram.com/p/CvtK7\\_6LYXz/](https://www.instagram.com/p/CvtK7_6LYXz/)\n\nIf you look at the frontal view of the person's face in the Youtube video it clearly doesn't match Ella's. And Ella has never had long black hair.", "label": 1}
{"text": "Meanwhile we're all out here living with how his incompetent rule affects our families now and for years to come.\n\nAnd yes, moderators, it is very substantive, to use your term. It is reality for millions of Canadians, thanks to him, that life in this country is harder to afford and much harder to enjoy. \n\nSo good for him that he's receiving negative feedback. That's what happens when you are atrocious at your job. He deserves it.", "label": 1}
{"text": "What a god damned narcissistic. \n\nYou know whose children really are affected by shitty Liberal polices (and more often, inaction)? \n\nEveryone else’s children who weren’t born with platinum spoons in their mouths and famous last names. \n\nWhat a load of shit. ", "label": 1}
{"text": "Bullshit. It’s one of the few jobs whose wages have kept up with inflation and it’s very little work for the compensation. Get over it. ", "label": 1}
{"text": "lol oh boo hoo", "label": 1}
{"text": "Not surprising. They are trusted by those who either have no experience of the damage they do and/or are poorly educated about the history (another side effect of conservative policies).", "label": 1}
{"text": "Time for the kids to touch the hot austerity stove.  We've all done it", "label": 1}
{"text": "If you're 30 now, you were 21 when Harper lost, and 14 in 2008. Safe to say, not very attuned to real life.", "label": 1}
{"text": "https://i.imgur.com/XcktlF2.jpeg", "label": 1}
{"text": "I didn’t say home prices, I said rental prices. \n\nHome price growth has slowed in most major urban centres due to higher interest rates, but rental prices since the end of COVID have skyrocketed due to higher demand primarily driven by population growth - even though rental completions are near record highs. \n\nThis is not overly simplistic, this is just the reality.", "label": 1}
{"text": "Are you actually trying to imply that rental prices have no relationship with house prices? 😂", "label": 1}
{"text": "Guys, I promise THIS TIME trickle down is actually gonna happen!  All we have to do is cut taxes to the rich, and remove services for the poors, and then the sweet sweet wealth is gonna trickle all over us all!  \n\nTrust me bro!\n\n/s", "label": 1}
{"text": "This is really quite gross. You used to donate to the food bank but you stopped at a time when the food bank has unprecedented need for support because you heard a small number of the people using it might be dishonest?", "label": 1}
{"text": "https://www.fraserinstitute.org/sites/default/files/examining-federal-debt-in-canada-by-pm-since-confederation-2020.pdf\n\nThis document from the Fraiser Institute clearly shows that only two governments have ever made significant changes in the national debt.\n\nBoth were Liberal governments.\n\nThe idea that \"conservatives are superior fiscal managers\" is a straight lie. The only thing they do is cut taxes for corporations and services for the public  to pay for the tax cuts.\n\nConservative voters are less intelligent than most. It's widely studied. High IQ correlates positively with left wing ideology. Expecting nuance and critical thinking from these people is wasted time.\n\nhttps://www.zmescience.com/science/news-science/high-iq-genetics-politics/", "label": 1}
{"text": "Luxury goods becoming more affordable is not trickle down economics no matter how hard you try to stretch or intentionally miss the definition.\nTrickle down economics is the belief that the wealthiest citizens will dispense their excessive wealth upon the masses instead of continuing to hoard it like mythological dragons.\n\nIt was formerly referred to as horse and sparrow economics, the belief that if you feed the horses so much oats in excess they will pass undigested oats into the road for the sparrows to salvage from their droppings.\n\nNow kindly educate yourself or stop participating in bad faith.", "label": 1}
{"text": "its not gonna pass.  Even if it does, the conservatives can kill it when they take power.  The scary part is that these corrupt Liberals are trying to push something like this through at all.  Truly the most evil government to take hold of power in Canadian history.", "label": 1}
{"text": "Why waste time say lot word when few word do trick -Kevin Malone\n\nLet's please, please stop entertaining the notion that the CPC cares one iota about climate action. All this \"When will CPC start to expand on policy?\" Or \"The CPC should expand on this policy\" what is the point? It's not engaging with reality. It's just wishful thinking and sanewashing for people who desperately want to believe the CPC is still interested in governing and not just the acquisition of power for its own sake.\n\nIt's about as realistic, and naive as me saying \"Here's what the CPC should implement if they're serious about protecting LGBT children\"", "label": 1}
{"text": "I was told the budget would balance itself.", "label": 1}
{"text": "Yes quiet liberal supporters whisper hail.trudeau to each other knowing they are them majority\n\n\n/s", "label": 1}
{"text": "Oh trust me, it's one of the reasons I voted for in 2015 and was very sad to see it explode. At least we got weed...", "label": 1}
{"text": "Trudeau failure is more optics\n\n\n1. He denied there were issues\n2. Then said there issues but nothing is his fault.\n3.  Says he will now fix these issues but pretending he is not been pm for 9 years", "label": 1}
{"text": "Can we stop beating around the bush with phrases like \"Americanization\" when what the author means is specifically taking cues from one party of fascists?\n\nThe rise of fascism is an international effort not linked to just one country.\n\nEdit: first time I posted this the comment was auto-hidden.. let's see if second time's the charm", "label": 1}
{"text": "We prefer jingoes", "label": 1}
{"text": "Dear Saskatchewan, every single vote matters. In BC our election is coming down to like a handful of votes. Don’t ever let anyone say your vote does not matter. Get out and vote. Please vote for the party that doesn’t want to erase people. \n\n- A BC resident.", "label": 1}
{"text": "Canada is the LEAST free country I can think of in the desirable world. \n\nThis is basically a country thats adopted the feudal system", "label": 1}
{"text": "Eight minute speech?  I know bots around here that can keep it under 25 words.  Timothy a family hire?  They're pulling his leg", "label": 1}
{"text": "The Americanization is happening to all Canadian conservative parties, and they seem bent on attacking Canadian cultural institutions as well.", "label": 1}
{"text": "Because these people are cultlike in behavior.", "label": 1}
{"text": "\"Hi Canada, I'm Pierre Poilievre, I'm too big of a piece of trash to get a security clearance even though I could be elected prime minister one day. Oh, those names of security risks? Why, they are in my own Conservative party! Oh but it's totally Trudeau's fault for not naming them, I have no responsibility or stake in this what so ever!\"\n\nFixed it.", "label": 1}
{"text": "4/11 are already named. Watch cpac they just had a press conference. 3 Liberal MPs, 1 Con appointed senator.", "label": 1}
{"text": "4/11 are already named. Watch cpac they just had a press conference. 3 Liberal MPs, 1 Con appointed senator.", "label": 1}
{"text": "Ugh. Reading comprehension not that strong I see. \n\nI did not state I didn’t believe Trudeau. I stated I believe there is a possibility he stated it for no other reason than to score political points.", "label": 1}
{"text": "Ah yes the NDP. The party that exists solely to provide pensions for their MPs.", "label": 1}
{"text": "Hilariously ironic when the CPC’s leader has only ever lived off of the tax payer.", "label": 1}
{"text": "4/11 are already named. Watch cpac they just had a press conference. 3 Liberal MPs, 1 Con appointed senator.", "label": 1}
{"text": "If you don’t understand the difference between a party and a person, you probably aren’t smart enough to be part of adult discussion.", "label": 1}
{"text": "lol k", "label": 1}
{"text": "Says the guy that goes straight to personal insults after the slightest pushback against their cue card talking point of a take.", "label": 1}
{"text": "5 of the 11 names are now out.  4 of the 5 are liberals the other is a retired conservative senator.\n\n  \n[https://youtu.be/UWfsMusq92E?si=TDBeHm\\_9-6G6D-sW](https://youtu.be/UWfsMusq92E?si=TDBeHm_9-6G6D-sW)", "label": 1}
{"text": "you believe? a hunch? gut feeling? good try numb nuts", "label": 1}
{"text": "I think you've only proved you're far from unbiased yourself here...what a silly statement, honestly.", "label": 1}
{"text": "Do we know what they're supposed to have done or why they didn't release all of the names? I can't watch a video right now.", "label": 1}
{"text": ">you believe? a hunch? gut feeling? good try numb nuts - u/similar_resort8300\n\nThat's not very polite.", "label": 1}
{"text": "Yes it is outlined in the video.  Of the ones brought up, Liberals working with China.  Senior liberal officials trying to block candidates on behalf of China, etc.", "label": 1}
{"text": "The names are going to be released to the public by investigative journalists soon anyway, and poilievre is going to get to have his cake and eat it too by not getting the clearance. 3 Liberal MPs and 1 Conservative senators names have been released today. More to come.", "label": 1}
{"text": "The “political points” he might score from having said this is based on the info impacting voter’s trust in conservative MPs. If your first reaction to Trudeau calling out foreign interference is to call him out for pandering for votes, you are clearly biased.", "label": 1}
{"text": "Typical leftist response.  Name calling is all you know", "label": 1}
{"text": "The Sam Cooper who can't tell the difference between a movie and real life?", "label": 1}
{"text": "lay it on me schoolie. any charges?", "label": 1}
{"text": ":)\n\nAre you denying that those all happened? Or are you just saying that those were all ok and good things for our government and country?", "label": 1}
{"text": ">and they seem bent on attacking Canadian cultural institutions as well.\n\nSuch as?", "label": 1}
{"text": "Simple JAQ. These head movies make my eyes rain. \n\nYou’re not subtle, friend. By framing security considerations as “protecting traitors”, you are implying something about the decision that doesn’t exist. I’m sure anything else I say will be deliberately misconstrued by you, so I’ll leave it at that", "label": 1}
{"text": "now do PP. start with the free dumm convoy", "label": 1}
{"text": "No, it's a terrible plan.", "label": 1}
{"text": "Why would the greens willingly give up all their power to influence legislation", "label": 1}
{"text": "You ok? You seem pretty mad friend, I'm not sure what kind of gotcha you think this is, the conservatives are flirting with fascism and right wing extremism and it's csusing issues across the country and emboldening right wing conspiracy theorists everywhere.\n\nBut sure:\n\nHarper gagged scientists and stopped them from discussing clinate change\n\nThe Senate expense scandal \n\nHarper ignoring eligibility rules and appointed his own judge\n\nRobocall Scandal\n\nPP meeting with and dog whistling white nationalists during convoy and during yellowvest movement\n\nHarper prorogued parliament to silence debate around the Afghan detainee scandal\n\nHarpers Foreign Minister Max Bernier left classified documents at his gfs house who had links to H.A.\n\n .....\n\nYou seem pretty upset maybe you should get some fresh air.", "label": 1}
{"text": "Women's autonomy.", "label": 1}
{"text": "So, are you saying Trudeau lied under oath? Cuz for all his failings, I find it highly unlikely he would do so lol.", "label": 1}
{"text": "Oh boy, Tom Mulcair is clearly a totally unbiased source of political analysis without any kind of obvious anti Trudeau bias or anything!\n\nNothing about his comments here \"explain\" the situation, he just offers his own biased spin.  He gives no new unique insight at all.", "label": 1}
{"text": "This is not a credible news source.", "label": 1}
{"text": "Sam Cooper making claims is not “the names being released.” \n\nJournalist trying to make a name for themselves who are being sued for defamation are not credible sources.", "label": 1}
{"text": "You probably have no clue what far-right actually is.", "label": 1}
{"text": "You have to be incredibly partisan to believe a journalist who is being sued for defamation and an MP who was booted from the LPC caucus. Or just a fool.", "label": 1}
{"text": "“They” aren’t anyone credible. ", "label": 1}
{"text": "Trudeau can stand in the House of Commons and share whatever information he wants. You donut.", "label": 1}
{"text": "Speakers don't help pass legislation", "label": 1}
{"text": "What freedom of speech has been denied you?", "label": 1}
{"text": "Of course, it's *always* Trudeau's fault.", "label": 1}
{"text": "I think you’re missing the point.", "label": 1}
{"text": "You are not educated enough to comment on this topic.", "label": 1}
{"text": "Classic troll behaviour.\n\nI'm reporting for Rule 2 and moving on.", "label": 1}
{"text": "I question his mental stage considering he thinks he very polular", "label": 1}
{"text": "Just because the CPC hasn't yet succeeded in undermining Canadian cultural institutions doesn't mean that they aren't trying to. Their failure in doing so, so far, does not make it OK.\n\nExample: British Broadcasting Corporation (BBC), Australian Broadcasting Corporation (ABC), Canadian Broadcasting Corporation (CBC). All of those are cultural institutions, with a common(wealth) origin. But only the last one is in danger. Because of the CPC.", "label": 1}
{"text": "Do shoppers drug mart even have them. Wtf is this", "label": 1}
{"text": "Wtf are you talking about ", "label": 1}
{"text": "Think you are.", "label": 1}
{"text": "First of all, don't talk to me like that.\n\nSecond, not sure what part is difficult to comprehend. Trudeau is known to campaign against CPC on boogeyman issues like abortion, which are literal non issues in Canada. A Trump wins allows false and fabricated lies that Trudeau can use.", "label": 1}
{"text": "It's hilarious to say NDP wants a better immigration plan. That's just pure trolling at this point. Mass importing very low skilled people has been the prime work of trudeau-jagmeet. They created this existential disaster. Keep drinking the kool aid.", "label": 1}
{"text": "Jagmeet is using public funds to pay for his luxury items while wanting to punish successful Canadians. The guy's a joke.", "label": 1}
{"text": "NDP, LPC directly import American realities and policies ", "label": 1}
{"text": "Declassifying this would have sever ramifications from our allies and the 5 Eyes Network. He may have the authority but thankfully he's smart enough not to damage Canada in that way.\n\n\nPP should know this, so all of this is political theater for him. Nice knowing our next PM is not much more than a human skintag putting his desire for personal power over what's good for Canada.", "label": 1}
{"text": "Can you tell us why they think it's a good idea?", "label": 1}
{"text": "Not sure why you're lying. This is literally been pasted throughout several news outlets.  No party leader has the right to release names during an ONGOING INVESTIGATION. Try to stop being a homer for a second and just follow the law. Not sure why PP is the only leader in Parliament who refuses to look at it.", "label": 1}
{"text": "I open YouTube and I always see Charlie Kirk or Jordan Peterson fighting against woke kids and teaching them lessons.", "label": 1}
{"text": "The fact that he's had two terms and will likely be getting a third is embarrassing. Especially with the awful voter turnout.\n\nI remember Ontario's education system being touted as world class, but I'm just not seeing it with the number of braindead people in this province that support this idiot.", "label": 1}
{"text": "I moved to Alberta from Ontario and have similar feelings.", "label": 1}
{"text": "The problem is \"the Liberals\" are doing this stuff while the right thinks it's just Trudeau in an office with a gavel or something. The liberals saying what they've accomplished as a government does nothing when Trudeau is the only reason people get triggered enough to vote for cons.", "label": 1}
{"text": "The libs say thier goal is to beat pp not even have any vision anymore\n\n\nThey are planning for an election 100%", "label": 1}
{"text": "Excellent contribution to the conversation, u/iamkingnico is truly an intellectual of the highest order. Can’t to see what nuggets of wisdom he/she/they drop(s) next.", "label": 1}
{"text": "100%\n\nI just hate that I can't downvote these comments to oblivion.  I know it's all meaningless, but I feel better about it when I get to.", "label": 1}
{"text": "Seems you are definitely stupid.  People really need to learn \n\nTrudeau #1, rated by inflation caused the biggest deficits in Canadian history, with the exception of his son.  From a balanced budget, he ran deficits over 90 billion rated in today's money.\n\nMaloney tried to fix the problems caused by Trudeau, but the problem was so large he wasn't able to.  He absolutely reduced the deficit caused by Trudeau.  He was absolutely hated for the GST, which he had no choice but to introduce.\n\nChritien wasn't fiscally responsible.  He brought balance by implementing absolutely massive cuts to Healthcare and Education across the country.  \n\nHarper was absolutely fiscally conservative, bringing a budget back to balance after the biggest global recession since the depression.  He did so AND reduced taxes to the low.and middle classes WITHOUT cutting heal and education funding.\n\nTrudeau #2 inherited a balanced budget and instantly blew it up running a 20 billion dollar deficit in year 1.  He continues his spending spree and will leave an enormous deficit behind for the Conservatives to fix.  It's going to take a decade or more to resolve the issues he's caused...just like his father.", "label": 1}
{"text": "Partison attempt at rewriting history.   \nLmao @ harper balancing a budget by huge financial loss selling GM.   \nGish gallop nonsense.", "label": 1}
{"text": "You really should educate yourself.  It's important to understand these things.\n\nIt's not partisan at all.  It's what actually happened.  I could include more details, but, I don't feel like typing it all out in my phone.", "label": 1}
{"text": "You should obfuscate less when you’re pretending to be non partisan while fandoming your vibes on PM economies.", "label": 1}
{"text": "We used to rail against corporate owned towns because they dominated the lives of their employees until they were almost slaves.\n\n\n  Now we have corporate owned housing and stores across thw country and are quickly working towards a country wide version of this.", "label": 1}
{"text": "Now!!! Organize your neighborhood at the kitchen table level.", "label": 1}
{"text": "Speaking of rewriting history, GM stock was sold at a price that was (a) a profit at the time and (b) a pretty competitive price point relative to GM's price over most of the last decade. And this isn't hard to look up, so why are you misrepresenting the facts?\n\nUsing asset sales to balance the budget is a shell game. So let's say the GM asset sale doesn't count for balance and Harper was in a ~1B deficit at the end of his term. That's still something like one tenth the magnitude of Trudeau's *smallest* deficit in government, and Trudeau ran those deficits when the economy was at the height of the business cycle *before* covid.", "label": 1}
{"text": "Crazy they can destroy the future of multiple generations and face almost no real push back whatsoever", "label": 1}
{"text": "That's an ironic thing to say when you straight up lied about the outcome of the GM asset sale in a comment a few minutes before this.", "label": 1}
{"text": "The article is about homeowners being rich, not corporations. Not landlords. Homeowners.\n\nThe homeownership rate is 65%.\n\nThey're the NIMBYs voting for politicians against density that keep house prices high. \n\nBlaming corporations is literally just conspiratorial. The homeownership rate has barely budged. We need more rentals, not less.", "label": 1}
{"text": "Classic Maloney!", "label": 1}
{"text": "Yes, it is unsurprising that when presented with actual facts you take your leave of the conversation. More or less exactly what I'd expect, frankly.\n\nYour immediate downvoting of my reply is pathetic. I would encourage you to reacquaint yourself with the sub rules, particularly rule #8.", "label": 1}
{"text": "Talking like it's set in stone and we have no choice or say in the matter is...kinda weird imo.\n\n And does that change anything I said about messing with the foreign meddling investigations? Why can't we let the RCMP and our intelligence agencies do their jobs?", "label": 1}
{"text": "Drat! If only there were some way for a government to create and revise legislation...", "label": 1}
{"text": "OP doesn’t care, he’s one of PP’s base who just laps up whatever the conservative talking points of the day are.", "label": 1}
{"text": "So you think they should revise how we handle national security simply so PP can have a win? Or, and hear me out, PP could just go and get his security clearance and read the fucking names for himself. Oh wait, that doesn't give him nice little sound bites for his followers to eat up.\n\nThe guy hasn't done anything productive in office for 20 years, why do people think he will suddenly be a good politician if he becomes PM now?", "label": 1}
{"text": "If he won't submit for the screening now, why would we assume he does then?\n\n  \nFrom what I've read, the background checks are mandatory for everyone in government, not just granted 'because'.", "label": 1}
{"text": "They never suggested it, they just said there’s a solution PP can work with. Reading is hard", "label": 1}
{"text": "It’s unfortunate for PP that he has to both rile up the racists and try to court the Indian voters at the same time. They’re getting pretty good at doublethink lately though. \n\nI truly believe his support will tank once his fan boys realize he will bring more Indian immigrants in for his billionaire constituents.", "label": 1}
{"text": "Again, implying that our laws should be changed so PP can have national security information released.\n\nWhat else would be the result of changing those laws? Yes, reading is so fuckong difficult that you can't understand anything beyond the words in front of you.", "label": 1}
{"text": "They never said they should be changed, that’s a bible verse made up by ShadowSpawn666 after watching a bush burn", "label": 1}
{"text": "Please define 'revise'.", "label": 1}
{"text": "In other words, overthinking a Reddit comment to conform to my beliefs", "label": 1}
{"text": "No, that is not the definition of revise. Thank you for proving how hard reading is for you.", "label": 1}
{"text": "Grandma said I’m handsome too", "label": 1}
{"text": "Understanding appears to be hard. I mean, why even bother with national security at all? Why does Canada need a spy agency to gather intelligence just because other countries have one. \n\nLike seriously, has anyone in the “just release the names” contingent spent a moment thinking about the impact on current investigations by the RCMP or our relationships with nations we share intel with? ", "label": 1}
{"text": "It's not obvious at all.  Slightly facilitate travel?  At a cost of 100 billion dollars?", "label": 1}
{"text": "Sorry, due to large amount of troll and bot accounts I don't waste time on bottom of the barrel word-word-number accounts just looking to say everything is bad.", "label": 1}
{"text": "If they oust Trudeau Pp will loose his only talking point and plan.", "label": 1}
{"text": "Cliquey-McCliquester. The good old boys clique won't age well on any of the Trudeau fan club. Along with losing seats, they are losing face every day they make excuses for the party imploder.", "label": 1}
{"text": "Because Trudeau is weakened, and no one is really paying attention yet to how pitiful, No Name Brand Trumps this little whiner is.", "label": 1}
{"text": "It actually gives me some vague hope that if the rebel Liberals can overcome Trudeau's massive ego and get him to resign that, in the absence of the Trudeau comparison, Poilievre's horrendous personality could hand the election to a new Liberal PM.", "label": 1}
{"text": "I doubt it. And I’m not even sure Trudeau is wrong. The odds of liberals being able to elect a new leader fast enough seems slim to me.\n\nThey probably loose with Trudeau. They definitely loose if the election is called and they are still in upheaval without a leader.", "label": 1}
{"text": "Yeah as I said it's a vague hope, but I do think their chances of winning (which, let's be real, are single digits either way) are higher with a new leader than with Trudeau. He has a major incumbency disadvantage at this point. People are sick of his face lol", "label": 1}
{"text": "So if you take some time and actually listen to the testimony (instead of the GnMs exceptionally creative interpretation), youll find that Drouin says nothing about the PM being unaware, instead that the PM and PMO were not directing the PCO and RCMP in how they communicate.  \n\n\n Drouins exact words: \"There's whole strategy has been shared with the Prime Minister and his office\". \n\n\n You gotta be better than this.", "label": 1}
{"text": "Oh god you’re right. He’s President’s Choice Trump. \n\nThe Sycophant", "label": 1}
{"text": "Removed for Rule #2", "label": 1}
{"text": "You have a monopoly on being blatant and spreading a narrative, or too lazy to respond with talking points.", "label": 1}
{"text": "I doubt it. Affordability hinges on one thing. Things being build. No one is building anything until this Needle Drug Poverty party is out of office.", "label": 1}
{"text": "Pretty rich statement for a guy who refuses to even get clearance lmao\n\nOh its ok tho. He *will*, just not today\n\n/eyeroll", "label": 1}
{"text": "But diversifying the energy market is a no-go.\n\nI'm sick of these Oil&Gas humpers. They need a fucking reality check.", "label": 1}
{"text": "Cry me a river. \n\nAmazing how those of us in the private sector have been doing it for this long already. Those of is who work at companies doing corporate jobs also realize it's actually better for the economy, because we understand how the real world works and don't live in our own little bubble, like public sector workers do.", "label": 1}
{"text": "Pierre is nothing more than a barking dog, I bet you would be a better leader.", "label": 1}
{"text": "If Pierre is a “barking dog”, what exactly does that make Trudeau?  A quieter dog busy tearing up all the furniture and hoping people don’t notice?", "label": 1}
{"text": "Just shows how entitled these unionized public sector bureaucrats are. Completely out of touch with reality. ", "label": 1}
{"text": "Nope, just need them to put an honest days work in for their inflated wage.   No more doing laundry while on the clock.", "label": 1}
{"text": "All those money announcements with press ops is campaigning.", "label": 1}
{"text": "Return yours if you feel it is a bribe. Those of us who don't believe it is bribe but an offset to the hugh liberal increases in the cost of living as Ford says can keep theirs.", "label": 1}
{"text": "Bring back the white anglosphere! Maybe it's time to give old school colonialism a chance again!", "label": 1}
{"text": "Over 23B now. Could be worse.", "label": 1}
{"text": "How is this post allowed?", "label": 1}
{"text": "huh, it was clearly a stupid retort to a stupid comment.  \n\nAlberta has very successfully diversified over the years and will continue to do so", "label": 1}
{"text": "Inference skills: 147%", "label": 1}
{"text": "Why UNJUSTin trudeau no force people to buy our oil??????  We is would have many money but now we dont and its all trudeaus fault!\n\nIm the average albertan and i wear a cowboy hat for some reason.", "label": 1}
{"text": "\"Its unjustin trudeau's fault because taxes  im being oppressed :'(\"\n\nYour oil is expensive to process because its shitty oil: its *sour* and *heavy*, sulfur impurities make it corrosive, and also it yields less fuel than better, less shitty oil.", "label": 1}
{"text": "This is true. (Wow you really struck a nerve with someone lol)", "label": 1}
{"text": "Ok, well, when the vast majority of their concerns are fabrications that they pulled out their asses, addressing those concerns will be difficult.", "label": 1}
{"text": "Respectfully, FUCK OFF Polivere!!! We already have a trump we don’t need your nonsense invading every nanosecond of our remaining mental energy having to fact check your dumb ass. GO AWAY!", "label": 1}
{"text": "I would strongly prefer a Canada full of undocumented migrants than a Canada full of you", "label": 1}
{"text": "Not a typo. Nope. I find the right very \"bro\". \n\nMy partner's son in law! Ay yi yi. He and his boys. Very bro culture, sleep with their caps on I'm sure, and there's the trucks and the muscles. \n\nAll far right wingnuts. They're too secular to believe in God and the Devil, but their technical 'education' failed to lift their primitive minds. So instead of the Devil we have sinister global forces, and 'guvmunt's with such extraordinary powers that they are responsible for everything that goes wrong. \n\nSweet guy though, and a really great Dad when he has the time for it.", "label": 1}
{"text": ">Adding money is wasting money until ...\n\n...someone wants to go to war.", "label": 1}
{"text": "But....but PP PROMISED TRICKLE.DOWN ECONOMICS WAS GOONG TO WORK THIS TIME.", "label": 1}
{"text": ">You believe a bunch of largely untalented people in a room (government) can determine policies better than a business or the private sector would.\n\nNo. I believe that we should be electing better representation, people who actually want to find solutions instead of finding a pension. \n\nI also do no believe that the private sector is always the solution. Every time we privatize something, we are tacking on someone else's profit margins to the cost. That isnt always OK. \n\nWhen it comes to the delivery of services, especially critical services, we need accountability. You don't get that when it's hidden behind several layers of privatization and profits. The free market isn't always going to save us - see the current housing market, the grocery situation. All those things are the result of unchecked PRIVATE interests. You want more of that? \n\n>You believe that by taking more taxes and reducing the quality of life of the average citizen will drive better outcomes over the entire population.\n\nI believe that by reducing access to essential services and reducing spending on those same services the quality of life goes down. Believe it or not, pooled resources get more bang for the dollar than individuals going out and looking for those same services. \n\n>Moreover, the auditor general found in 2022 that $4.6 billion in Canadian Emergency Response Benefit (CERB) and other payments went to ineligible recipients (dead Canadians, prisoners and children), and $27.4 billion was deemed worthy of a government investigation. Another $9.9 billion in COVID subsidies was linked to more than 51,000 ineligible employers.\n\nAnd the government knew this would happen, and look, mechanisms in place are catching them. The whole point was to get money out to people ASAP and it was a success by that metric - ***the most important metric was that it helped those who needed it.***\n\nI'd rather that people in need receive the help of it means that some ineligible people slip through the process. The alternative is that the people who are in need suffer for longer. Help those who need it, then deal with those taking advantage. \n\n>Since Justin Trudeau’s Liberals were elected in 2015, the federal public sector has swelled by 42 per cent to nearly 370,000 employees. But because the government doesn’t produce revenue for the economy, bureaucrats are remunerated in taxpayer dollars and freshly printed money.\n\nYes. That's called running a government. You need manpower to deliver services. This simply means the conservative under Harper were adequately staffing the government - that's an addiction of responsibility. Aka irresponsible governance.\n\n***GOVERNMENTS ARENT SUPPOSED TO TURN A PROFIT.*** That's why you don't run them like businesses because that would be stupid.\n\n>In 2014, the prime minister infamously claimed “the budget will balance itself,” but his government’s reckless spending has maintained upward pressure on inflation — which Statistics Canada says surged by over 19 per cent between 2015 and 2022. During this period, 31 per cent more executive-level bureaucrats were hired, and their total compensation surged by 42 per cent from $1.4 billion to $1.9 billion, with their average salaries growing from $193,600 to $208,480.\n\nWow it's almost as if a global pandemic brought the economy to breaking point. It's almost as if major corporations - PRIVATE INTERESTS - took advantage of the situation and called all their opportunistic price increases \"inflation\". \n\nPrivate business is largely responsible for inflation. Period.\n\n>Without private sector being interested or willing to invest, even the Royal Bank of Canada reported in June that the national economy, adjusted for inflation and population growth, has regressed by about a decade. Outside of real estate and construction, investment in Canada’s economy has dropped and, therefore, flatlined wages.\n\nMeanwhile all our big corps raised prices and raked in billions in additional profits. The private sector, once again, fucked us.\n\nSo do me a favour. Stop telling me what I believe, it makes you look silly and like you have absolutely no idea what you're talking about. Bootlicking for big corps is such a weird personality trait.", "label": 1}
{"text": "Bro...PP has absolutely,  pinky swear promised that trickle down economics will.work this time.", "label": 1}
{"text": "Has Trudeau? Or even come close to doing anything about it...does it count he is paying twice the amount for planes now?", "label": 1}
{"text": "\"Freedom is slavery.\"\n\nYeah, no.\n\nLet's leave all of this ancient religious screed behind, please.  It is not welcome.", "label": 1}
{"text": "Nice slimy non-sequiturs. You should get into politics. \n\nI’ll just continue to care whether our funding is from an ethical or extortive source. ", "label": 1}
{"text": "You can be happy that it's perfectly ethical then.", "label": 1}
{"text": "Lol.", "label": 1}
{"text": "Resistance! What the hell does that mean?", "label": 1}
{"text": "They were put together in the same ideological thrust of the government. Hence the term bundled, pedant. \n\nCan I call handguns and machine gun legislation passed in the same season bundled anti-gun legislation of will your panties, funnily enough, become “bundled” as well. ", "label": 1}
{"text": "> This isn’t David and Goliath.\n\n\nIt was prior to the ONA. This is detailed in the report linked to you in the other chain. You should take some time to read it. ", "label": 1}
{"text": "Oh. The think tank report from an org I’ve never heard of which doesn’t maintain a list of it owns members? \n\nThe giant editorial that doesn’t justify its premises of Google having unfairly gained beyond being “present” \n\n\nThat “report”? Lol", "label": 1}
{"text": "Why the bla bla bla talk\n\nWalk the talk lol😂\n\nYou should be ashamed you have a prime minsiter that is doing all this for a terrorist.", "label": 1}
{"text": "You should read the report. It will help you greatly.", "label": 1}
{"text": "\"Party with a single solitary seat in Quebec says they won't play Quebec games.\"\n\nI'm shocked. Shocked, I say.", "label": 1}
{"text": "I’ve obviously read it. As I’m not a rabid partisan it did not answer key questions or defend its own premises.  \n\nIt’s also from some invested group. This isn’t an impartial govt report. ", "label": 1}
{"text": "OP \n\n>A useful idiot or useful fool is a pejorative description of a person, suggesting that the person thinks they are fighting for a cause without fully comprehending the consequences of their actions, and who does not realize they are being manipulated by the cause's leaders or by other political players.", "label": 1}
{"text": "You're trolling right?", "label": 1}
{"text": "Don't want to answer the question i guess", "label": 1}
{"text": "100 percent trolling.", "label": 1}
{"text": "Thanks Captain Fun", "label": 1}
{"text": "Not helping OPs case...", "label": 1}
{"text": "If pinkies are involved then he has my vote. When do I line to put in place mine?", "label": 1}
{"text": "Rule 4 - Direct advocacy", "label": 1}
{"text": ">Why does he keep saying this?\n\nI know you know this, but to answer anyways, it's because he's effectively a con artist.", "label": 1}
{"text": "Not knowing any better and then whining like a little bitch is the modern conservative hallmark.", "label": 1}
{"text": "‘If I know the truth, and get the hard data and facts it is harder for me to lie to Canadians because I’m a power hungry shit weasel!’\n\nTranslated that for you.\n\nThe security clearance would make it harder for him to lie. It’s that simple.", "label": 1}
{"text": "You mean historic loser. Well done, you earned a participation medal.", "label": 1}
{"text": "My work calls Christmas and Easter winter and fall celebrations. We are explicitly told not to say Easter or Christmas. But we have a Diwali party with not just lights but an explanation of the religious holiday.", "label": 1}
{"text": "That makes no sense and you need to contact a labour rights lawyer", "label": 1}
{"text": "It also makes no sense and you need to contact a calendar. Easter is in the spring.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "This isn’t real. This is sensationalism. Who here can’t say Christmas or Easter in their workplace? This is a ridiculous comment meant to scream persecution where none exists.", "label": 1}
{"text": "And now Pierre just rehashed his attack on Singh about his pension, now titled: \"PENSION BEFORE COUNTRY\".\n\nLil PP is deflecting as much as he wants; but I don't think Justin should've tried to bend over backwards to Pierre Poilievre to give him some names.", "label": 1}
{"text": "Is Easter even celebrated in Canada? Sure we have Cadbury eggs, but that's about it as far as Easter festivities.\n\nAlso, fuck Christmas. It deserves all the flack it gets for being absolutely egregious when it come to encroaching on other holidays.\n\nI saw Christmas decorations up for sale in September. SEPTEMBER.", "label": 1}
{"text": "bots be botting. beep boop", "label": 1}
{"text": "Im not going to be the person to do that. That is a guaranteed way to destroy my career", "label": 1}
{"text": "That internet persona claims Easter is in the fall, so you know.", "label": 1}
{"text": "Yes the key legislation he is waiting for is the legislation that moves election day further out by a few days.", "label": 1}
{"text": "Issue is jagmeet words are stupid\n\n\nTrudeau bad\n\n\nBut I will support him", "label": 1}
{"text": "Pretty sure this is a sub for mature political discussion. Pharmacare and dental care are key NDP goals that they want progress on.", "label": 1}
{"text": "Justin Trudeau isn’t going? I wonder why…", "label": 1}
{"text": "Canadians need to shut up your country is not relevant that all the world tries to interface with your retrded of election", "label": 1}
{"text": "Was it some \"War on Christmas\" nonsense?", "label": 1}
{"text": "As much as i can't stand PP,  perusing the Conservative MP list reminded me of looking for coconut buns in the Wonderbread Isle. My guess is Bloor Street and women outside the kitchen would be unimaginably exotic for the majority of them.\n\nGood luck, Mr Prime Minister. It'll be a short list, I think.", "label": 1}
{"text": "Well said", "label": 1}
{"text": "It is a movable feast you know, but Spring to Autumn is a pretty big move.", "label": 1}
{"text": "Well said.", "label": 1}
{"text": "Isreal: You haven't been sufficiently supportive of our indiscriminate bombing campaign, Canada. We're disappointed in you.", "label": 1}
{"text": "I’m sorry that you see using your own critical thinking skills as a waste of time, though it does explain quite a bit. \n\nTry to understand that I’m not obedient to the positions of a party, its leader, or its former leaders. Just because Mulcair said something doesn’t mean I have to agree with it. \n\nAll I asked is that you use your own words, not someone else’s, to explain your position on the issue. It shouldn’t be hard, considering you independently came to that conclusion and aren’t just uncritically parroting a narrative someone else told you, right?", "label": 1}
{"text": "Play this scenario out for us please.\n\nThe Prime Minister expels several opposition MP's from Congress based on classified information he can't share. What happens next?", "label": 1}
{"text": "An investigation? Please keep saying the PM has no power to do anything. Crazy enough he could ask for a meeting and be genuine with PP....has he done this? No, just theatrics.\n\nIt seems people here don't think the PM has any responsibility.\n\nWe have seen the leaks, it's mostly Liberals....JT does not want PP to see or get those names.", "label": 1}
{"text": "Why doesn't PP just apply for security clearance and get those names himself?", "label": 1}
{"text": "CBC is linked heavily to the Liberal party...you have to parse both to try and get some truth.\n\n  \nTake a minute and peruse the political section of CBC, find one positive news entry on conservatives(I know that's what you guys like but come on)", "label": 1}
{"text": "🤣🤣🤣🤣", "label": 1}
{"text": "Because then he can't press the PM on the issues. He is effectively muzzled.\n\nHis chief of staff could be told the names and he could tell PP you need to get it if this story/theatrics had any merit.\n\n  \nSee this is all political games...the PM wins if PP gets it or if he doesn't....as long as leaks don't keep coming out.\n\nThe other two leaders said they have seen the list and there are no names on it...all of a sudden now there are?", "label": 1}
{"text": "> CBC is linked heavily to the Liberal party\n\nNo it's not.", "label": 1}
{"text": "Another thread has already been posted for this story.", "label": 1}
{"text": "Lol sure.\n\nLook at their reporting.\n\nThink they may put another frivolous lawsuit against the conservatives in the middle of an election?\n\n  \nEveryone knows that the CBC is left leaning. Do a google search on where they stand.", "label": 1}
{"text": "Can anyone tell me why Mary Ng is still a sitting minister?\n\n\n*Crickets*\n\nSo is the info in these reports critical to our national defence and democracy, or not?", "label": 1}
{"text": "Thanks for posting this. It's good to know what position the media company that dominates our newspaper industry is willing to publish on this. Upvoted for awareness.\n\n>He handled the Jan. 6, 2021 attack on the U.S. Capitol poorly.\n\nHe spent a decade lying about epection fraud, culminating in him refusing to hand over power willingly after losing the election to Biden and encouraging this attack.\n\nHe should be completely ineligible as a candidate by anyone who supports dmeocracy and elections.\n\nThere doesn't however seem to be any lowpoint he can reach where he won't lose support from a significant portion of people and media organizations. At this point I can't really conclude other than that they oppose democracy.", "label": 1}
{"text": "I came into this conversation not knowing anything about the issue. Thank you for persuading me that your views are not credible.", "label": 1}
{"text": "How do you expect the liberals to import our own Canadian flavor of trump derangement syndrome, without slightly intentionally misquoting and misrepresenting facts?", "label": 1}
{"text": "I guess as a voter I have no choice but assume all MPs are compromised until the public is let in on the secret. So I won’t vote for anyone who’s incumbent, regardless of party affiliation.", "label": 1}
{"text": "You trust a notoriously corrupt demented fascist? The guy who never pays the people who work for him? The one who's supporters talk about \"liberating\" Canada? The guy who thinks \"negotations\" with Canada means \"Cede to everyone of my demands while I give you nothing or else\"?", "label": 1}
{"text": "Of course it's all political games. It's politics. PP is playing the same game.\n\nIf Trudeau expel's MP based on classified information PP screams fascism\n\n\nIf Trudeau orders the RCMP to arrest those MP's on unreleased information (can he even do that?) PP screams fascism.\n\nIf Trudeau keeps saying \"you can have these names if you're willing to get security clearance\" and PP keeps refusing, then Polievere appears to not be taking this issue seriously.\n\nI think it would be naive to assume that any of major parties don't have members who are implicated in some way. Recent years have shown how effective and easy it is for foreign adversaries to make citizens distrust their own democracy.", "label": 1}
{"text": "I can find proof the earth is flat if I do a google search", "label": 1}
{"text": "I agree, sorry.", "label": 1}
{"text": "Name one political party the CBC has gone on record in endorsing.", "label": 1}
{"text": "Tell me you didn't read the article without telling me you didn't read it. 🤡", "label": 1}
{"text": ">His chief of staff could be told the names and he could tell PP you need to get it if this story/theatrics had any merit.\n\nNo, his chief of staff could not relay any of that information to Poilievre if they had it because it's classified information and sharing that information would be breaching their security clearance, a serious offense.\n\nYou realize the outcome of what Poilievre can say is the exact same whether he reads it or not, right? If he continues to not read it, he continues to not know what's in it so cannot speak to it. If he does read it, he knows what's in it and there are certain things he cannot speak to. The only difference between either scenario is in one he knows what's in it and in the other he doesn't. \n\nSeeing as how his own MPs have been implicated, one would think he'd like to know what it says. Instead, he seems to be perfectly fine remaining ignorant. What he really means when he says he'd be \"gagged\" (which has been disproven time and time again through other leader's, including the PM,'s, ability to speak on it) is that he wouldn't be allowed to say whatever he wants because he'd know the truth, i.e., he doesn't care about the truth. \n\nIn fact, if anything, because the other leaders have read the report, they're actually able to speak about it *more* than Poilievre, who knows nothing and is intentionally renaming ignorant. That his MPs have now been explicitly implicated has crushed any veneer of acceptable politicking that he may have had. It's time for him to grow up; if he one day would like to be a leader in this country, he should act like it.", "label": 1}
{"text": "We only know that her name is in the report, and we heard that from a man who is in court for defaming someone, so anything beyond that should be taken with a massive grain of salt. We don't know how she is involved. It may be that she is in the clear or was an unsuccessful target for interference.", "label": 1}
{"text": "So glad to see 50k-60k earners who already pay for benefits having to pony up for dental for the non-workers of society....", "label": 1}
{"text": "Your flair is wild.", "label": 1}
{"text": "You guys life in fools paradise. India obviously needs to be held to account but Trudeaus intention here is not nationla security but pure partisan politics.\nAs someone who knows what CCP has been doing in Canada I know that Trudeau until very recently was in bed with them and allowed them to do whatever they want as long as his party won. Traitorous behavior", "label": 1}
{"text": "lol his chief of staff can’t say to him the things the pm are? That wouldn’t breach anything.\n\nHave you even had a security clearance? ", "label": 1}
{"text": "Righr, in the face of something you don't like just make up a bunch off bullshit and hide behind it.\n\n\nCool man.", "label": 1}
{"text": "They're made up.", "label": 1}
{"text": "Same as why every potential Fascist hates publicly funded media: they can’t control it and it has a nasty habit of speaking truth to power.     \n\nGetting rid of media you don’t like is one of the most basic Fascist things you can do.", "label": 1}
{"text": "Until you check the comment history, then it all makes horrific sense.", "label": 1}
{"text": "lol of course it’s all made up, they didn’t say what the article stated. They don’t survive on the public purse that’s cbc.\n\nRefute what he said about the twitter crao those mp’s are doing.\n\nOh yeah that’s right it’s acceptable because they are your side.", "label": 1}
{"text": "Just read their politics page. Do you need to be specifically told? Seems pretty simple minded.\n\nYou do not sue a party in an election for what is clearly a frivolous lawsuit.\n\nYou don’t get selfies with the pm during an election, hello Rosie.\n\nIf you don’t hold the government to account one has to ask, why?\n\nThe problem here if you are pro liberal you see nothing wrong with any of that.", "label": 1}
{"text": "lol so it’s all good if they support the liberals. ", "label": 1}
{"text": "Canada itself being a very large enclave for the descendants of the European barbarians who used violence to forcibly take land around the world. These people continue to reflect the uncivilized world view and ideology that led that group of people to commit violence on a scale only seen by the descendants of the sameish European immigrants who settled in the country to the south of us.", "label": 1}
{"text": "Do they have an official policy of supporting the Liberal party or do people think they do because our other major news sources support the Conservative party?", "label": 1}
{"text": "I agree, can't wait until it's expanded to cover everyone so no one has to pay for dental coverage.", "label": 1}
{"text": "lol the irony in your statement. ", "label": 1}
{"text": "You don't realize Postmedia, and others, get millions from the gov't?  It supposed to keep \"local\" news viable.  The rest of your post is garbage you should be embarrassed about.", "label": 1}
{"text": "lol ok...", "label": 1}
{"text": "But the government is borrowing from future generations to pay for more benefits for baby boomers right now. If we didn't have debt servicing costs, we'd have less expenses right now, and hence more which could be spent on benefits.", "label": 1}
{"text": "Pierre saw what Trump did with Haitian immigrants in Ohio and is just straight up copying his rhetoric for Canada.  \n\nNo originality.", "label": 1}
{"text": "Right? Like can you believe we also use taxes to pay for the sick? Crazy we have to pony up for all those cancer patients....\n\nYou sound ridiculous when you complain about taxation", "label": 1}
{"text": "Both the LPC and CPC steal way too many rhetoric points from the US.", "label": 1}
{"text": "Very Christian of you", "label": 1}
{"text": "So in your eyes talking about an immigration system that has been out of control is the same as saying immigrants are eating people's pets? How?", "label": 1}
{"text": "No, you sound ridiculous. \nTaking from slightly poor people to give to slightly poorer people. I'd be onboard if the money was coming from Walmart or McDonalds. But its not. \nGo over to Europe if you love taxes, you'll fit right in.", "label": 1}
{"text": "Well for now, the people who make 50k-60k are getting shafted HUGE. \nWhat a crock of shit this plan is - Why the fuck am I paying X2?", "label": 1}
{"text": "50k earners pay income tax bud", "label": 1}
{"text": "Look at how successful conservative misinformation has been on this story. ", "label": 1}
{"text": "So do minimum wage earners.", "label": 1}
{"text": "Typical the biggest defenders of this program would be ignorant of its most basic parameters. Sad, but often the case with these types of social programs. \n\nYou (including your children) can only qualify for the program if you don't have access to a dental program through an employer or family member's / professional or student organization / pension plan or family pension plan. \n\nYou (including your children) only qualify for the program if your net family income is below $90k. \n\nI would encourage you to at least understand the basic concept of something before forming an opinion in the future.", "label": 1}
{"text": "Crazy how much background you seem able to do on an obscure party, but you couldn't make it thru 10 mins of a committee hearing to see what was actually said.", "label": 1}
{"text": "Why don't we just do a Logan's Run and end people after they hit a certain age? That's better for the economy right?", "label": 1}
{"text": "Poilievre just needs to get off reddit. Not every problem in the world is because of immigration", "label": 1}
{"text": "I considered your request. I disagreed. If you wish for other Mods to consider your request, please use Mod Mail, which is the appropriate means to make such requests.\n\nYou are new to our community, so I have given considerable leeway. But you are not entitled to special considerations not given to other users. We have ways for you to report or send a request. Please read about them in our sidebar.", "label": 1}
{"text": "And what is he going to do???  So far I haven't heard any solutions just slogans", "label": 1}
{"text": "You are right. It's definitely a problem that lower income people with partial coverage don't get any help from this program.\n\nBut I'm glad we can all celebrate that so many people who previously had no coverage are now getting care.\n\nPeople on Ontario Works or ODSP already had access to dental benefits, but there are so many people working middle and lower income jobs that don't have benefits.", "label": 1}
{"text": "Trump and Vance also view themselves as critiquing a broken immigration system though.  \n\nPierre knows what he is doing.", "label": 1}
{"text": "Exactly. The system hasn't been used properly. Shouldn't be demonizing sentiment against immigrants though.", "label": 1}
{"text": "The premise here essentially is that, without an independent news organization such as the CBC, one with journalistic integrity, and that is securely funded, Canada's democracy will not be able to withstand the attacks from anti-democratic forces and bad actors, of which PostMedia-Chatham, Skippy and the party he controls for now are the prime examples. \n\nPostMedia-Chatham, controlled by American Trump enablers as a consequence of a special concession to the law preventing such things by Harper, is the hegemonic content production and publishing platform in Canada. Any other platform that comes onto the market is purchased by them at rock-bottom prices, on borrowed money, whereupon staff are then fired, and their market penetration absorbed into their existing platform.\n\nThere are only two other national platforms; CBC and the Globe & Mail, the latter of which tends to be \"conservative\", and not to overtly challenge Skippy's over-reach, and the former that does.\n\nIf Skippy can neutralize the CBC, he gets a free ride, insofar as analysis and criticism of his shenanigans will be sufficiently muted to be inconsequential.", "label": 1}
{"text": "Plus anyone arguing in good faith can see the difference between saying ‘excessive immigration is straining our housing supply and should be scaled back’ and ‘immigrants are bringing crime and we need a mass deportation’ \n\nPoilievre critiques have almost entirely been from a policy perspective, where Trumps are rooted in xenophobia.", "label": 1}
{"text": "It's cute you think he'll actually do anything.", "label": 1}
{"text": "Has Poilievre blamed immigration for anything but housing? An issue where it *is* absolutely linked? He’s been very restrained on immigration as an issue compared to global conservative leaders", "label": 1}
{"text": "It's okay if you didn't pay that close attention to American politics. But the Republicans were blaming the Haitian immigrants in Ohio for causing all sorts of problems including housing.  \n\nWhich, as you just laid out is exactly what PP  is doing.", "label": 1}
{"text": "Weird comment.\n\nI'm not going to brag or anything but I'm certainly kinder than you are... Don't you have immigrants to hate on or something?", "label": 1}
{"text": "It's OK, I know that nuance is not your strong suit and that you're incapable of seeing past your partisan leanings. One day you may be able to move on from those obvious limitations and begin to understand the world a little better.", "label": 1}
{"text": "Not substantive", "label": 1}
{"text": "This jackass is the premier of the province. How about he pick up his damn socks and start doing something other than booze and highways.", "label": 1}
{"text": "It's plain to me, and everyone else, that Pierre just copies whatever seems to be working for the Republicans.  \n\nOne day you might understand that.", "label": 1}
{"text": "You know, I hated the fact that they took almost 5 months off (5 fucking months!) but it also meant we didn’t have to hear from this jackass.", "label": 1}
{"text": "But we also need to reduce immigration to \"look after our own\". Until we actually do anything to look after our own, of course.", "label": 1}
{"text": "Just another example of Smith feeding red meat to her nut job party members.  They might vote her out on Saturday unless she can give them all the crazy they demand.", "label": 1}
{"text": "Read Mobile_trash8946’s comment. You’re suffering from utter delusion lmao", "label": 1}
{"text": "Oh think this is more about absolutely unhinged things like the chemtrail people, full nn white christian  supremicist, the coutts dudes, the sovereign citizen people and trans litter box theorists. Crazy and dangerous people, mostly.", "label": 1}
{"text": "The framework built on the research and expertise of medical professionals over decades is the real framework.\n\nWhat Alberta now has is random restrictions based on Facebook memes and radio talkshow host opinions.", "label": 1}
{"text": "So one that aligns with your ideological predilections rather than any form of medical consensus or compliance with the Canadian charter?\n\nCan you tell me what the framework actually was? This started with Policy 713 in NB. What was the policy? What did Higgs change? What was the reasoning he gave? What was he forced to change again when he was told his initial changes were illegal?", "label": 1}
{"text": "Pierre is going to create chaos if his party wins, and that’s why Canadian voters will reject the conservatives at the ballot box, like they did at the last three federal elections.", "label": 1}
{"text": "I wonder why politicians wouldn’t want to associate with a group called “Overseas Friends of India”… 🤔\n\nI’m quite perplexed!", "label": 1}
{"text": "You've got more faith in humanity than I. Far too many people's policy awareness doesn't extend beyond t-shirt slogans.", "label": 1}
{"text": "Thank fuck Doctor Smith chimed in on this important subject with her great depth of experience in Notafuckingclueology.\n\n\nI would have been lost without her sage input.", "label": 1}
{"text": "Tories weren't really rejected last 2 elections\n\n\nLibs got a minority govt and lowest vote share of any govt in history.", "label": 1}
{"text": "He isn't even in power and he's undermining municipalities.  Who's going to sign on to a project that can get tanked at random?  At least with the Liberals a deal is a deal", "label": 1}
{"text": "I know liberals have gone full rabbit hole.when they say conservatives are gonna be more pro immigration\n\n\nLol 😅", "label": 1}
{"text": "Why would they not ?\n\nHarper government  incensed and changed the rules for  foreign  workers. \n\nConservatives  are pro corporations", "label": 1}
{"text": "The conservative way", "label": 1}
{"text": "Guys literally think trudeua gonna debate pp and win so hard he overcomes a 20 point issue", "label": 1}
{"text": "I mean, Harper was literally the one who turned the TFW program into the inhumane mess it is today, and Poilievre has never committed to any specific reductions in immigration like reddit commenters want him to.", "label": 1}
{"text": "Ha! Nope!  If she's forced out it's because she's not extreme enough.  No Conservative premier (PC or new UCP) has survived a full 4 year term since Ralph Kline!  The whole process for this party is to lean hard crazy during the internal leadership review.  Then pretend to be a moderate to win the general election.", "label": 1}
{"text": "Immigration numbers when harper left office\n\n\n320k in 2015\n\n\nAfter 8 years of trudeay\n1.267 million in 2023\n\n\nHarper did change rules but total immigration numbers didn't really explode...they only did during trudeau.", "label": 1}
{"text": "Someone more moderate might run, but the Take Back Alberta folk and other social conservatives will make sure they don't get the leadership. Smith getting the boot will only result in someone more extreme taking her place.", "label": 1}
{"text": "I'm deeply disappointed that conservatives in Alberta want Smith representing them. Most of my family leans conservative, so I used to have some respect for them. Ugh, why do they have to be the worst kinds of fools? I've lost all respect for anybody who would vote for such a hateful and idiotic person.", "label": 1}
{"text": "Accelerationism is a really dumb ideology.", "label": 1}
{"text": "And what were they before harper?", "label": 1}
{"text": "> Anyways, the raw antithesis of OP’s statement that “healthcare decisions based on public opinion are always wrong” is “healthcare decisions based professional opinion are always right.”\n\nEmbarrassing attempt at logic. Sometimes two things can be wrong.  \n\nPointing out times when doctors were wrong would only help your argument if the position of the government at the time was better. Which isn't true in a single example you listed.", "label": 1}
{"text": "But since harper trudeau made th3 system ten times worse\n\n\nIt's like liberal supporters are gaslighting the last 9 years of immigration policy didn't exist", "label": 1}
{"text": "Not a Liberal supporter, thanks.", "label": 1}
{"text": "Please do, unemployment is rising and we need real hard workers back in the work force now more than ever. That way, when we’re cleaning up the mess, you can still take credit for it when we’re done because you were helping fight facism!", "label": 1}
{"text": "The \"real mess\" is the bigotry you and your ilk are spewing.", "label": 1}
{"text": "Young voters: \"I'm voting conservative because the liberals aren't making home ownership easier\"\n\nPoilievre: \"Hold my beer\"", "label": 1}
{"text": "We have idiots who think chemtrails are an issue, should the government get involved?", "label": 1}
{"text": "Ummm...  Good... Temporary means TEMPORARY...\n\ntem·po·rar·y\n/ˈtempəˌrerē/\nadjective\nadjective: temporary\n\n    lasting for only a limited period of time; not permanent.\n    \"a temporary job\"", "label": 1}
{"text": "\"Entitlement\" = the government has set up false expectations.\n\nWe literally have set up entire industries (diploma mills, higher ed, immigration consultants) to create those expectations and market them exploitable people who don't know they're being sold a bag of goods.\n\nShut those down. Stop bringing people here with false promises & whatever perceived \"entitlement\" you are accusing them of GOES AWAY because they're no longer being duped into y'know, emptying their life savings on a promise of citizenship, or dedicating years of their lives toward a pipe dream.\n\nIf you're so against this \"entitlement\" how come you're fine with all that dishonesty on the part of our government, corporations, and higher ed institutions?? Maybe because it benefits you when brown people subsidize your education? Because it benefits greedy corporations when you order your cheap ass coffee? Disgusting.\n\n>Immigration is not a human right.\n\nI didn't say any of this? You're just literally arguing with the thoughts in your own head right now.\n\nGo ahead and shut down immigration, I don't care.\n\n**JUST BE HONEST. IT'S NOT THAT HARD.**", "label": 1}
{"text": "Let's re-educate ourselves on this topic. During that podcast, he said his greatest regret was not proceeding with ranked ballot, anyway. And, respectfully, immigration has been leveraged as a wage suppression mechanism by both the federal liberals and conservatives, not to mention numerous provincial conservative governments by way of abusive 'student' mismanagement.\n\nThank you, though, for highlighting the difference between those who blindly support a 'team' versus those who demand more of their politicians.\n\nAs for my liberal purity test, I voted for them in seven of the last eight federal elections. I deviated for Layton. That good enough for you? If not, too fucking bad.", "label": 1}
{"text": "Not messaging. We’ll be getting gas lit about how his failures are successes. ", "label": 1}
{"text": "If Trudeau implemented ranked ballot, the headlines would have read \"Trudeau The Tyrant Forces Ranked Ballot\" and everyone would lose their minds. There's no winning when it comes to choosing a voting system, because there is no consensus as to which is best.", "label": 1}
{"text": "While progressives consider ensuring drag queens have unmitigated access to children a flagship issue while food bank usage is at an all time high they will continue to lose.", "label": 1}
{"text": "Ugh it’s just becoming annoying how pathetic he really is….also in complete denial. Talk about a leader who’s going to drag down the rest with him. Unfortunately he’s already done it to our country.", "label": 1}
{"text": "This is the reason the defund CBC side is winning.  When you are trying to make the person abusing the system be the victim, honest people are not going to be happy.", "label": 1}
{"text": ">During that podcast, he said his greatest regret was not proceeding with ranked ballot, anyway.\n\nTake away that \"anyway\", and you're closer to what he actually said. He wasn't regretful that he didn't push throughh RB after the ERRE; he was regretful that during the 2015 election he campaigned on \"Electoral Reform\" instead of directly campaigning on Ranked Ballot.", "label": 1}
{"text": "In 2015, when Trudeau ran on this, surveys and polls put support for proportional representation versus FPTP at 65%.\n\nRanked ballot was favoured by the fed Liberals because it would have led to less vote-splitting with the NDP and secured them enhanced majorities based on the voting trends up to that point.", "label": 1}
{"text": "I'm not playing this game with you.  Beat it.", "label": 1}
{"text": "He specifically campaigned on 'electoral reform' and a pledge to explore viable options because he was courting Fair Vote Canada and the 65% majority of Canadians ho wanted to see proportional representation replace FPTP. He had a temper tantrum when things didn't go the way of RB.", "label": 1}
{"text": "Fair enough. But, he put it the way he did to reap an immediate benefit and return the liberals from the brink of a historically unprecedented defeat to forming a majority government.\n\nNow, his short-term gains came at the expense of long-term pain for the Liberals. Had they swapped leaders, they may have escaped their reckoning. Had he apologized for the way he went about electoral reform, he might have softened the blow.\n\nIt appears to many of us like he engages in gaslighting, instead. This is also the message that a portion of his caucus wanted to deliver to him regarding his horrible voter-perception. He went from a golden boy to a pariah, and it was all his own doing.", "label": 1}
{"text": "Would you affirm a skinny anorexic that they are fat? Or would you treat that dysmorphia?", "label": 1}
{"text": "You used the wrong word. Equity is not equality. Equality of care would mean the most competent doctors for everyone. Equity means the prestige of the medical profession must be redistributed, merit and competence being false ideas preserving the racist hegemony that are in the way of liberation.\n\nIt doesn’t matter that the social position of doctors are due to their competence and not the other way around. It doesn’t matter if narcissistic grifters are attracted to selection processes based of victim status. It will look good, it will write history, it will slowly destroy the foundation of a prosperous and healthy society, and many other things they want as social justice activists.\n\nEquity is not equality. When you hear equity, remember that it comes with the believe that the western society must die. They’ll take online-certified shamans before any kind of doctors.", "label": 1}
{"text": "> When you hear equity, remember that it comes with the believe that the western society must die.\n\n\nWhy would someone want to remember something that isn't true?", "label": 1}
{"text": "This is my issue with \"conservatives\" today and why I left the CPC and didn't vote for the BC Conservatives this my provincial election a couple weeks ago. They're not trying to govern with any good ideas, they're just a bunch of assholes.", "label": 1}
{"text": "I think you’re confused about who considers that a flagship issue, seeing as conservatives are the only people that ever bring it up", "label": 1}
{"text": "Somebody beaks off like that against my friends they better have their footing", "label": 1}
{"text": "\"real news\"", "label": 1}
{"text": "Cuba has the best income equality, good health care, fairness and happiness.", "label": 1}
{"text": "Wow. I thought you were pretending to be “neutral”. Kinda went mask off there. \n\nA lot of people are suffering under this economy. It’s an “us” problem. ", "label": 1}
{"text": "If you don't think your job is a good one then you have an idea of what a job you consider to be good would be, so I think it's on individuals to do what they want with their lives. Our government is pretty generous with providing opportunities, take advantage.", "label": 1}
{"text": "Yes. He argues that GDP does not tell the full story, then goes on to recommend several other nebulous and difficult/impossible to quantify factors like \"fairness\" and argues that those are part of the picture as well. He also makes implicit assumptions that I don't agree with around wealth distribution. \n\nGDP per capita isn't just a \"convenience\" metric. It correlates extremely well with other desirable economic outcomes.", "label": 1}
{"text": "The government has brought in millions of immigrants effectively making every job bad.  I'm a software developer which used to be a good job until half of india moved to Canada.  What should I go do now?  I'm not seeing a lot of growth industries in this country.", "label": 1}
{"text": "\"He also noted that in her victim impact statement, Abdelkhaleq said her life had been turned upside down by the assault. She left both her job and the country as she didn't feel safe.\"\n\nSeems like a win-win to me. 1 less case clogging the courts and 1 less Hamas sympathizer openly calling for violence in our country.", "label": 1}
{"text": "Too much to summarize. All of Justin's greatest hits are here:\n\nAga Khan!\n\nSNC-Lavalin and Jody Wilson-Raybould!\n\nWE Charity!\n\nSDTC slush fund!\n\nChinese foreign interference!\n\nWith guest appearances by former ministers Bill Morneau, Yasmin Ratansi, Liberal House Speaker Greg Fergus, current ministers Mary Ng and Randy Boissonnault, and the debut of special adviser Mark Carney!", "label": 1}
{"text": "Perhaps we can all agree that it is for the best that Narendra Modi's close friend Patrick Brown was not able to win the 2022 Conservative Party leadership race. 😏", "label": 1}
{"text": "Hell, even if I got pantsed for 5-10 seconds at a public protest, I'm still not quitting my job and leaving Canada.  \n\nDoing so would be pants-on-head behaviour.", "label": 1}
{"text": "Black doctors are better at treating black patients, but as someone that already has white privilege, you are not entitled to choose the race of your doctor.  Think about it.", "label": 1}
{"text": "Only 40% support high deficit, socially conservative parties (CPC + PPC) and 58% supporting progessive, center-left parties (LPC + NDP + BQ + GPC). Will the country be hijacked by another convoy protester supported CPC?", "label": 1}
{"text": "It's so disgusting; and yet there will be no consequences. The SDTC thing is bananas, in how much it absolutely reeks, and for Liberals to say out loud that they think their Charter Rights are under threat if these documents are turned over is absolutely insane. \n\nI'd like to see every single person involved in this gigantic fraud charged criminally, ultimately jailed, and be ordered to pay back any stolen funds. Watch how fast this stops. Anything less is going to guarantee more of the same.", "label": 1}
{"text": "I’m not conservative", "label": 1}
{"text": "Here’s hoping. He’s destroyed the NDP", "label": 1}
{"text": "His pension isn’t at risk. That’s a lie told and spread by low IQ people.", "label": 1}
{"text": "What poll is that? When was it taken?", "label": 1}
{"text": "I know. I just never want to hear a liberal voter, previous or future, blame global trends for shit that their political party did", "label": 1}
{"text": "It's a projection model based on an aggregate of all published major polls.", "label": 1}
{"text": "False. He qualifies for it at the end of Feb 2025.", "label": 1}
{"text": "He has not done this", "label": 1}
{"text": "That also shows he has a 66% chance of winning.", "label": 1}
{"text": "He has a 66% chance of winning his riding. It doesn’t matter if the election is in two weeks or two years.", "label": 1}
{"text": "Hahahahahahahaha.", "label": 1}
{"text": "They also say he has a 66% chance of winning. That’s 2/3 in case you don’t grasp the math.", "label": 1}
{"text": "Do you like those odds? Those are not good odds.", "label": 1}
{"text": "Haha. Look at you trying to play the UNO Reverse card.", "label": 1}
{"text": "he is polling currently to lose his riding. a riding which was considered a safe seat. it's at risk if an electiion is called.", "label": 1}
{"text": "burnaby south has the lpc and cpc ahead of the ndp. this is jags riding. did he change it again?", "label": 1}
{"text": "pp didn't delay an election to get his pension.\n\nit is not the same thing.", "label": 1}
{"text": "his riding is burnaby south", "label": 1}
{"text": "The B.C. NDP had a 57% chance of winning and they won. The Saskatchewan Party pulled off a win with similar figures.", "label": 1}
{"text": "BC has the same issue. it is run by the NDP", "label": 1}
{"text": "He’s Burnaby Central. I think the riding boundaries were moved.", "label": 1}
{"text": "He’s done more for Canadians than any other NDP leader.", "label": 1}
{"text": "No he isn’t liar. He has a 66% chance of winning his riding. Where the hell do you get your information? Facebook? Tik tok?", "label": 1}
{"text": "Are you a bot or something? You're not even replying to what I said. I was saying it's false that Canada has the most expensive healthcare in the world.", "label": 1}
{"text": "Also don’t understand what his end game here is besides besides smoothing his ego out, not like India is just gonna roll over and give him and his bunch of merry separatists a state to play their version of the taliban in.", "label": 1}
{"text": "Yeah, fuck rights and freedoms! We need to solve problems by sweeping them under the rug", "label": 1}
{"text": "You're a smart guy, I'm sure you'll figure this one out.", "label": 1}
{"text": "But but common sense.....  Anyway it has been proven time and again you can indeed lead a horse to water but you can't make him drink.", "label": 1}
{"text": "No I don't like those guys", "label": 1}
{"text": "Am I out of touch? No…. No, no, it’s the Canadian voters who are out of touch. - Trudeau Probably", "label": 1}
{"text": "CPC influencers aren’t MPs. The LPC tried to suppress investigations into their MPs who accepted foreign interference. These are not the same", "label": 1}
{"text": "Our international trade minister (Mary Ng - liberal) appears like she is a Chinese sock puppet. \n\nForeign interference more likely to sink Trudeau than PP.", "label": 1}
{"text": "It would be political suicide to step in Trudeaus shoes, in don’t think someone would want to run in his place", "label": 1}
{"text": "Patrick Brownface Bootlicker", "label": 1}
{"text": "Um. For the money alone hundreds of thousands would. ", "label": 1}
{"text": "Anybody with the skill set and experience capable wouldn’t want to waste ‘their shot’ standing his shadow.\n\nThe hundreds of thousands you speak of are Joe blows wanting a paycheque who wouldn’t get voted in if they were running against a rock.", "label": 1}
{"text": "Skill set? It’s essentially a popularity contest. \n\nThat’s a hell of a way to talk down to your fellow countrymen. Jesus. They also lack family connections and money that Trudeau has. Plus a legacy. \n\nDidn’t make Trudeau a more competent leader. ", "label": 1}
{"text": "Well it takes a certain kind of person to have that kind of job, if you disagree I would say you are a bit naive. \n\nIf it’s easy I’d so go run for mp in your riding and do that for 5 years or whatever it is and secure your pension for life, let me know how that goes.", "label": 1}
{"text": "Yeah. It takes someone with family and business connections to political actors lol. Trudeau was a drama teacher as we all know. \n\nI’m not saying it’s easy to become a political mp. I literally said it’s a popularity contest. \n\nThe day to day job? Could basically be done by anyone. ", "label": 1}
{"text": "Thats very different than the statements a reasoning from the article.\n\n\nMaybe you should take a chance to read the article.", "label": 1}
{"text": "Isn’t Jill Stein basically a Putin sycophant? Zero chance she drops out.", "label": 1}
{"text": "May needs to shut the fuck up here. It isn't our system and outside influences are incredibly inappropriate. Literally nothing to gain here but significant risk if Trump wins.", "label": 1}
{"text": "Israel and Genocide", "label": 1}
{"text": "Hardly as much as people who fly these Trudeau flags and think about him at all hours.", "label": 1}
{"text": "[Isis apologies to Israel 🤔](https://www.timesofisrael.com/ex-defense-minister-says-is-apologized-to-israel-for-november-clash/)\n\n[IDF admits to supplying ISIS🇮🇱](https://www.timesofisrael.com/idf-chief-acknowledges-long-claimed-weapons-supply-to-syrian-rebels/)", "label": 1}
{"text": "Umm... I literally pasted a quote from the article.  Yes, I read the article.", "label": 1}
{"text": "You can’t commit genocide against a terrorist organization. Hamas is not an ethnicity.", "label": 1}
{"text": "> Avoid any sharp objects or lit flames when Palestine loses the war it started. You might hurt someone in your raging meltdown.\n\nJudging by your post history, you think this is a pretty sick burn. I’d revisit that…", "label": 1}
{"text": ">Umm... I literally pasted a quote from the article. Yes, I read the article.\n\nLol. It's a brand new day old account. They must be trolling or something.", "label": 1}
{"text": "You're going to play coy? What, is it a secret or something?", "label": 1}
{"text": "How? That’s exactly how Trudeau got elected.", "label": 1}
{"text": "Not really but i guess facts don't matter to much.", "label": 1}
{"text": "Yeah kinda seems like partisan nonsense ", "label": 1}
{"text": "It would be a great day and I Will be exceedingly overjoyed when Trump wins and puts y'all Scamala supporters to shame", "label": 1}
{"text": "Nonsense. It was the fight between congress govt which was in power under Indira Gandhi and khalistani elements during 1984 riots. Speak facts.", "label": 1}
{"text": "The RSS Have Never Been An Ally Of Sikhs\nA myth, propagated mainly by author Khushwant Singh, that the RSS/BJP protected Sikhs before and after the 1984 Sikh Genocide, is still used by BJP supporters and RSS workers\n\nhttps://www.baaznews.org/p/gurjant-singh-the-rss-have-never\n\nGurjant Singh\nApril 8, 2021 | 10 min. read\n\nOn March 30, 2021, the Shiromani Gurdwara Parbandhak Committee (SGPC) passed a resolution condemning the Rashtriya Swayamsewak Sangh (RSS) and its mission to make India a Hindu Rashtra, perceiving it as a threat to all minorities.\n\nThis news led to the widespread criticism of the SGPC by BJP leaders and Hindu nationalists deflecting with unrelated topics - such as the overblown threat of Christian missionaries in Punjab.\n\nThe SGPC’s resolution alarmed the RSS and supporters of Hindutva as it is countered false claims their supporters often make - that the RSS has always been an ally of Sikhs, and that Sikhs are essentially Hindus.\n\nA recent example of this mindset is Arun Anand’s The Print article from earlier this week regarding the relationship between the RSS and Sikhs - specifically discussing how the RSS has supposedly saved the Sikhs in the past. Anand is the CEO of Indraprastha Vishwa Samvad Kendra (IVSK), a company that is affiliated with the RSS, and publicly honoured members of the group ‘Clean the Nation’ whose stated aim is to “clean and weed out anti-nationals”.\n\nAlthough it is true that in 1947, as Anand claims, Hindus and Sikhs in Punjab formed armed militias to protect their families in the lead up to partition, BJP leaders and RSS mouthpieces have often used such historical events to project Sikhs and Hindus as inseparable and to reinvent the Sikh identity within the larger Hindu nationalist paradigm. Any Sikh who asserts their identity as separate from Hindus is considered a traitor.\n\nThe RSS and its supporters have never been allies of Sikhs. \n\nDuring the Punjabi Suba movement, the formation of the Punjab state on a linguistic basis arose. Such movements were happening across India, for example, the Mahagujarat movement led to its split with the creation of Marathi speaking Maharashtra and a Gujarati speaking Gujarat. However, it was only in Punjab that the issue was communalized by Bharatiya Jan Sangh (BJS, predecessor of the BJP), which pitted Hindus against Sikhs.\n\nBJS patriarch Deen Dayal Upadhayay wrote against Punjabi Suba in his September 5, 1965 article titled ‘This Punjabi Suba Business’:\n\n    “It need not be repeated that the Punjabi Suba is a misnomer for Master Tara Singh’s Sikh state. Whatever Sant Fateh Singh might say, the whole movement is based on communal appeal. It is carried on openly not only from the religious platforms in the gurdwaras. This Suba therefore will be a theocratic state in India. We cannot allow it.”\n\nIn Amritsar, the BJS gave their full support to organizations advocating opening stores selling cigarettes, tobacco, and tobacco products close to the Golden Temple, when Sikh organizations wanted to declare Amritsar as a holy city where tobacco products would be banned.\n\nThe Arya Samaj led a procession, which brought 10,000 Hindus into the streets, carrying lighted cigarettes on sticks and swords, shouting \"bidi, cigarette piyenge; shaan se jiyenge.\" (we will smoke our cigarettes and tobacco with pride).\n\nOn February 14, 1984, BJP national level leader Harbans Lal Khanna, along with some members of extremist Hindu organizations committed the sacrilege of publicly destroying the model of the Golden Temple and a picture of Guru Ram Das at the Amritsar Railway Station. The destruction of the model foreshadowed the actual Indian military invasion of  Darbar Sahib during Operation Bluestar, when tanks, artillery, helicopters, and armoured vehicles bombarded the Akal Takth, destroying the symbol of Sikh political sovereignty.", "label": 1}
{"text": "The RSS and BJP were at the forefront of groups lobbying the Indira Gandhi led Congress government to take military action in the Golden Temple. \n\nOn May 3, 1984, a few weeks before Bluestar, BJP leaders Lal Krishna Advani (first president of BJS) and Atal Bihari Vajpayee (founder and first president of BJP) sat on a strike in Delhi, demanding that the armed forces be sent into the Golden Temple. After Operation Blue Star, there were several reports stating that the RSS distributed sweets in celebration of the military action. \n\nAdvani went on to write an autobiography, ‘My Country My Life’, released in 2008. In a chapter reflecting on his time in Punjab, he considered the BJP agitation as a major influence on Indira Gandhi’s decision to order troops to storm the Golden Temple in 1984. Even though Vajpayee later claimed that he was against military action on Harmandir Sahib during Operation Bluestar, there are photos of him and Advani heading a demonstration calling for military action in Punjab.\n\nOn November 8, 1984, Nanaji Deshmukh, a BJS leader from Uttar Pradesh published an essay, “Moment of Soul Searching” in which he praised Indira Gandhi for Operation Bluestar and justified the 1984 Sikh Genocide by saying that it was the fault of Sikh leaders. In 2019, Nanaji Deshmukh was awarded the Bharat Ratna award, by fellow RSS member Narendra Modi.\n\nIn 2014, Jarnail Singh, senior Aam Aadmi Party (AAP) leader, pointed out that several BJP and RSS workers were involved in the Genocide. He demanded that action should be taken against these prominent individuals after Union Home Minister Rajnath Singh dubbed the events of 1984 as a genocide.\n\nThe Caravan Magazine reports that many BJP and RSS leaders were involved in the 1984 Sikh Genocide. The 14 FIRs lodged at the Delhi city police station include the names of 49 persons belonging to the BJP and the RSS. According to those FIRs, these leaders were booked on charges of murder, arson, and rioting in the various areas populated by Sikhs. One of the people named is Ram Kumar Jain, president of the Jain Mahasabha Ashram and a poll agent for Vajpayee during the 1980 Lok Sabha elections.\n\nA myth, propagated mainly by author Khushwant Singh, that the RSS protected Sikhs before and after the 1984 Sikh Genocide, is still used by BJP supporters and RSS workers to put the blame squarely on the Congress party. The veracity of these claims is false. \n\nIt should be noted that Khushwant Singh, who vehemently declared himself as secular was labeled an anti-national, Hindu hating, Khalistani by “secular” Hindus and media after he condemned Operation Bluestar and expressed his intention to return the Padma Bhushan award as a protest.\n\nKhushwant Singh wrote in his autobiography titled ‘Truth, Love and a Little Malice’ in 2002:\n\n    “What followed was a painful discovery to me. Overnight I became a kind of folk hero of the Sikhs: the first to openly denounce the government. And a villain for Hindus. I, who had always preached secular ideals and condemned Bhindranwale, had come out in my ‘true colours’ they said,” \n\nHe would go on to add:\n\n    “Every pressman who came to interview me asked why I had not resigned from the Rajya Sabha as well. I told them that I was not going to deprive myself of the one forum from which I could tell the government and the people what grievous wrong it had done to the Sikhs and the country.”\n\nDuring the 1984 Sikh Genocide, Khushwant Singh was not helped by his esteemed \"connections\" in the Indian government, nor was he helped by the BJP and the RSS. Instead, he had to seek refuge in the Swedish Embassy as government-sponsored mobs slaughtered Sikhs in the streets of Delhi.", "label": 1}
{"text": "In 1994, he wrote about his experiences in his book, ‘My Bleeding Punjab’.\n\n    “I awaited my turn. I felt like a partridge in a partridge shoot waiting to be flushed out of cover and shot on the wing… For the first time 1 understood what words like pogrom, holocaust and genocide really meant. I was no longer a member of an over-privileged community but of one which was the object of dire hate,” he wrote. “All day long my telephone rang. ‘They are burning our gurdwara, can't you do anything? They have looted our shops; can't you do anything?... There are scores of Sikh corpses lying along the rail track, can't you do anything?’” \n\nHe adds:\n\n    “In my turn I rang up everyone I knew from the Commissioner of Police, the Lt. Governor, the Home Minister, right up to Rashtrapati Bhavan. The only help I received was in the form of advice: ‘Get out of your place and hide with your Hindu friends. At least you will be able to save your life.’”\n\nIn Khushwant Singh's book, \"The End of India\" published a year after the 2002 Godhra riots and Narendra Modi's landslide victory, he strongly criticizes BJP, RSS, and the fascist Hindutva movement.\n\nAccording to Vinayak Damodar Savarkar who formulated the Hindu nationalist philosophy of Hindutva:\n\n    “a Hindu is one who acknowledges Hindustan as his pitrubhumi (fatherland) as well as his punyabhumi (holy land). Whether he or she is a devotee of sanatan dharma (Hinduism) is unimportant. Anyone who is or whose ancestor was Hindu in undivided India, including someone who was originally a Hindu but converted to Islam or Christianity, is also welcome back into the Hindu fold provided he accepts India as his fatherland and land of worship. However, love for Bharat Mata (Mother India), following the Hindu faith and belief in the Hindu caste system are not enough. A Hindu has to love, embrace and own Hindu sanskriti (culture) as a whole.”\n\nSavarkar sought to fuse the idea of a nation as a political entity with Hindu religious and geographical identity. However, this idea appropriates all religions that originated in the Indian sub-continent as Hindu, thus robbing them of their right of self-assertion, independence, and distinctness, while excluding religions like Christianity and Islam. \n\nSavarkar praised the growth of Italy and Germany during Fascist and Nazi rule respectively. Inspired by the Nazi’s racial doctrine, he similarly denied Muslims and Christians their civil rights, as their loyalties lay with their holy lands outside the Indian subcontinent.\n\nThe RSS, the Hindu Mahasabha, the Jan Sangh, the Shiv Sena, and the Bajrang Dal are fuelled by this concept of exclusion stated by Savarkar. Khushwant Singh writes:\n\n    “Drawing inspiration from Savarkar’s concept of Hindutva, which they considered as an article of faith, they indulged in falsifying history, mosque-breaking, church-burning and attacking missionaries, and they went on to perpetrate pogroms. They are the foot soldiers of today’s rulers.”\n\nIn November 1972, Khushwant Singh met with Madhavrao Sadasivrao Golwalkar, the then head of the RSS. At the time, Khushwant Singh naively thought that he could persuade Golwalkar to make Hindu-Muslim unity as the main aim of the RSS. However, it was only some thirty-odd years later that Khushwant Singh realized that this was an act of futility and understood the true vitriolic nature of the RSS.\n\n    “The mission of the RSS is to ‘unite and rejuvenate our nation on the sound foundation of Dharma’, a mission that can be achieved by ‘a strong and united Hindu society’. It has therefore undertaken the task of uniting the Hindus because it believes that ‘rejuvenation of the Hindu nation is in the interest of the whole humanity (sic)’. Clearly, there is no room here for anyone who does not pray to Hindu gods. The RSS is blatantly and fiercely anti-Muslim and anti-Christian.”\n\nBJP and Congress are two sides of the same coin. \n\nNeither care for Sikhs or any other minority. Every time both parties have raised the issue of the 1984 Sikh Genocide and formation of investigation committees, it is during voting season. Khushwant Singh wrote:\n\n    “Every fascist regime needs communities and groups it can demonize in order to thrive. It starts with one group or two. But it never ends there. A movement built on hate can only sustain itself by continually creating fear and strife…No one is safe. We must realize this if we hope to keep India alive.”\n\nHindutva has always tried to reduce Sikhs to foot soldiers of Hindus in an eternal struggle against Islam by distorting history to appropriate them into the Hindu fold. This was also seen during the Ram Mandir of Ayodhya verdict, where Sikhs were labeled as a cult in the Supreme Court judgment. Sikhs have refused to accept that role or false reading of history.\n\nThis has always been a reason for Hindutva’s irritation with Sikhs. Whenever a Sikh speaks for constitutional-democratic rights of Muslims, hordes of Hindutva nationalists will descend on them, reminding Sikhs of ‘who’ killed our martyrs. \n\nSikhs do not get provoked by this, because we understand when our Gurus and martyrs were being tortured and killed there were hundreds of thousands of people, who silently watched, and even supported the regime that perpetrated those crimes, regardless of religion. \n\nFor Sikhs, our historic struggles were not against Islam or Muslims, but an oppressive regime of the Mughal Empire. Similarly, Sikhs are averse not to Hindus, but to the oppressive regime of Hindutva that decrees non-Hindus as second-class citizens.\n\nAnd, that is the crux of the matter - Hindutva can only accept a minority in a subservient role. \n\nThe reaction of Hindu nationalists and the BJP IT cell to the events at Red Fort on January 26, 2021, is telling. They vilified Sikhs, their history, their beliefs, their practices, and more. However, the Sikh psyche has been stated succinctly by Rattan Singh Bhangoo, in Prachin Panth Prakash:\n\n    \"The Khalsa is never a satellite to another power.\n\n    They are either fully sovereign or in a state of war and rebellion. \n\n    A subservient coexistence they never accept.\n\n    To be fully sovereign and autonomous is their first and last demand”", "label": 1}
{"text": "Where will those skilled workers and young people go? The US is the only realistic option, and they can only take in so many people.\n\nCanadians must simply accept and adapt to the reality that shared accommodations are the future of housing in the country. There is no other alternative.", "label": 1}
{"text": "This is absolutely not true.  Plenty of companies run their own infra, or rent vps from providers other than the big three, or get managed bare metal, or managed dB's, etc etc.\n\nAWS, Azure, or GCP are not the only players in town", "label": 1}
{"text": "It’s already happening. Lots of second-generation immigrants are returning to the countries of their parents, where they at least often own a family home and can live better quality of lives with a much more reasonable cost of living. You see people going to countries like Croatia, Portugal, Italy, Slovenia, Chile, etc. countries that had large diasporas in Canada and were doing far worse for the average person 30-40 years ago.\n\nAs developing countries become more richer, and Canada becomes less so comparatively speaking, more young people will return back to countries they have a historic attachment to.", "label": 1}
{"text": "You are responding to a troll.", "label": 1}
{"text": "Yes, what I said is true, but to try to explain more and help:\n\nIf you're trying to run a highly available secure setup you aren't going to rent a VPS. You aren't even going to run directly on managed VMs typically. VPS especially suffer from noisy neighbors, poor isolation, and usually a whole bunch of vulnerabilities associated with that low level of isolation.\n\nGenerally speaking you're going to run applications on managed services that run in at least 3 zones in at least 2 geographic regions (which would actually mean you can't run exclusively in Ontario). \n\nThat's just scratching the surface, but it hopefully gives you an idea of the complexities involved.\n\nThere's *a lot* more there. But broadly speaking, very very few companies are able to manage their own infrastructure in a way that produces what most consumers expect in terms of reliability or security.\n\n\n\nYou regularly hear about data breaches and outages, but you very rarely hear about a total Amazon or Google outage, or massive Google data breach.\n\n>Plenty of companies run their own infra, or rent vps from providers other than the big three,\n\nAnd plenty of companies have massive data breaches and prolonged outages. How many times has Gmail had total outages or leaked everyone's emails?", "label": 1}
{"text": "Fuck this polling shit jeezus fucking Christ this is so fucking annoying. We aren’t even in a fucking election for fucjs sake. Enough is enough. \n\nPOLLS MEAN NOTHING \n\nFUCk", "label": 1}
{"text": ">They absolutely need to pick one of the big cloud providers\n\nThey don't though. They do not need a cloud provider. There's nothing wrong with in house servers other than the costs. AWS isn't free and will only get more expensive over time.\n\nWhy would Amazon offer services at a loss?\n\n>This is very wrong, incredibly wrong. Hardware breaks, and the software for running all these services has ongoing licensing costs that are massive.\n\nAWS has all of these problems. AWS is an eternal ongoing cost that completely disappears when you stop paying for it. \n\n>Plus consultants (probably), plus architects, devops, network engineers\n\nThey'll still need all of these to work with AWS. It's not a genie in a bottle. AWS requires maintenance.\n\n>You have no idea what you're talking about.\n\nI work with AWS servers daily, I absolutely understand the maintenance required. You're bound to agreements Amazon can change on a whim and to work on their timelines not yours. \n\n>What you're suggesting would end up wasting hundreds of millions of dollars\n\nWhen you stop paying for AWS it's gone but paying for hardware is \"wasting\" money?", "label": 1}
{"text": "Hamas is not a threat to Israel this is just not a serious argument. October 7th was an intelligence failure.", "label": 1}
{"text": "Oh ok, so HAMAS doesn’t seek to hurt Jewish people? And if they do, then it’s the Jews for letting that happen. You know what, Israel should just let anyone kill a thousand people once in awhile. On the house. They deserve it. \n\nGot ya. Speaking of arguments that are not serious. \n\n\nIf I go up to a heavyweight boxer and try to sucker punch him and let’s say I land a half decent one. When he turns around and beats the wheels off of me, that automatically always makes me the victim right? Give me a break.", "label": 1}
{"text": "\"You know what, Israel should just let anyone kill a thousand people once in awhile. On the house. They deserve it. \" \n\n?????????", "label": 1}
{"text": "I am working your argument out to its logical conclusion.", "label": 1}
{"text": "This [conclusion?](https://x.com/chiweethedog/status/1852857007134687642?s=61)", "label": 1}
{"text": "Well obviously they have to go online, just to ignore people screaming in the streets to end Canada, end Western Civilization, and kill Jews.\n\nThose people, you can't arrest in Canuckistan for hate speech.  Or stop their foreign pay cheques.", "label": 1}
{"text": "So people that don't agree with you are that?", "label": 1}
{"text": "Horse nonce fans and logic don't go well together either, tbf.", "label": 1}
{"text": "I hope you don't work in IT. Or you are 12, because you really don't understand this. AWS isn't pricey when comparing building this on your own.", "label": 1}
{"text": "Average rent in Toronto hasn’t been $1,200 in over 20 years.  https://historyoftoronto.ca/blog/the-fascinating-evolution-of-toronto-rent-prices-a-comprehensive-historical-analysis", "label": 1}
{"text": "Also weirdly reminiscent of McCarthyism (the OPs suggestion). ", "label": 1}
{"text": "How about they start by doing their job instead of being paid to stand by and do nothing while nutjobs scream for the murder of Jews and death to Israel and Canada on our streets and harass and intimate our citizens??  Our tax dollars hard at works folks!!", "label": 1}
{"text": "Look at the losers in the comments.\nKeep crying, the threat of white nationalism should be eliminated before these Hamas supporters.", "label": 1}
{"text": "Can you imagine if clowns like this were in charge of the world back in the 80s and 90s?  We'd have celebrations that involved a day of taking aerosal cans and spraying as much as you could.\n\nMeanwhile the billionaires would be preparing their shielded underground bunkers and massive underground farms with massive oxygen-generators so that they could try to survive a planet without an ozone layer.", "label": 1}
{"text": "AWS is pricey compared to building your own. \n\nWhen you stop paying for AWS it goes away. Hardware doesn't just disappear.\n\nWhy would Amazon do this for free?", "label": 1}
{"text": "Remember Herr Drumpf lamenting \"Why did i debate him?\" and making up fantasies about Biden taking the nomination back from Kamala?\n\nSame deal.", "label": 1}
{"text": "Great to see actual real Liberals from the Chretien and Martin era calling out Justin for what he is - an idiot.", "label": 1}
{"text": "We can do better than to advocate for physical harm to people that we might find disagreeable regarding policy.\n\nI do not agree with the text of the resolution, and there are many scientifically and socially grounded reasons for disagreeing with it:\n\n> The United Conservative Party believes that the Government of Alberta should…\n>\n> b. Recognize the importance of CO2 to life and Alberta’s prosperity by implementing the following measures:\n>\n> i. Abandoning “Net-Zero” targets,\n>\n> ii. Removing the designation of CO2 as a pollutant, and\n>\n> iii. Recognize that CO2 is a foundational nutrient for all life on Earth.", "label": 1}
{"text": "Trudeau's values are exactly the same as his father's who was Prime Minister of Canada until 1982. Dosanjh is 'new guard'. And it's not a clash of values if you actually read this. Trudeau equates all Sikhs as Kalistani and they are not. Anyone coming to Canada and identifying as Kalistani are almost all extremists who should go back to India to fight their war of independence. \n\nAnd if you think these are not big enough, you are not a contrarian for the purpose of devil's advocate, you are a troll.", "label": 1}
{"text": "> Trudeau equates all Sikhs as Kalistani \n\nUhh... where and when did he say this?", "label": 1}
{"text": "RTF article.", "label": 1}
{"text": "Yikes.\n\nAnd there's no quote or example of him saying that in the article. \n\nDouble yikes.", "label": 1}
{"text": "I guess critical reading is not your strong suit. Now stop trolling.", "label": 1}
{"text": "This is the second time you've accused people of trolling and you're making things up in the article that aren't there.\n\nI don't think you're going to last long here.", "label": 1}
{"text": "# \"U.S. ambassador to Canada says democracy will 'easily' survive outcome of Tuesday election\"  \n\n  \nso he is convinced trump has lost... great news.", "label": 1}
{"text": "I read the article. Not one Trudeau quote... Just one person complaining about Trudeau. \n\nAbout what I would expect from a post media hit piece.", "label": 1}
{"text": "Imo, losing is not good enough to avoid a big mess. The Republicans need to get absolutely curb stomped.", "label": 1}
{"text": "Political Violence, that has no place anywhere", "label": 1}
{"text": "I don’t think there is any avoiding a big mess with his cult when Trump loses.  The US cannot let these people keep operating, in the open or in the shadows.  It needs to stop or it will keep happening and eventually circumstances will favour them and Canada will have a fascist juggernaut for a neighbour.", "label": 1}
{"text": "How so? I'm drawing a direct analogy between two right wing politicians expressing similar sentiments, one in regret and the other pre-emptively. How is that not substantive?", "label": 1}
{"text": "Why is Trump dangerous to democracy?  What did he do in his first term that had a negative effect on democracy?  What are his proposed policies now that would negatively affect democracy.\n\nLast I checked  it was democrats that were against voter id, 1st amendment and they are ones proposing letting illegals vote.", "label": 1}
{"text": "A relation of his wife has been extradited to the USA from venezuela to face financial crime charges.  PP CAN'T get a top secret clearance.", "label": 1}
{"text": "I think that Trudeau should start saying that he can get a security clearance and not be required to read the classified documents. Start implying that he’s hiding something or there’s some reason why he can’t get cleared.", "label": 1}
{"text": "Lol. \"TruDeAu iMPoSeD aN NDa!\"\n\nHey ding-dong, if you need a security clearance to read something, I'm pretty sure NDA or not you're not supposed to reveal national secrets...", "label": 1}
{"text": "Source from a suspended twitter account seem legit", "label": 1}
{"text": "Are the mods going to tolerate people accusing our politicians' families of crimes with no evidence? Because this is insane. \n\nA perfect example of how partisan Liberals are desperately reaching for conspiracy theories, though.", "label": 1}
{"text": "Only a well informed person can do that.", "label": 1}
{"text": "The UN can fuck right off, they're more corrupt than most the membership countries they're supposed to represent.", "label": 1}
{"text": "Is not his father in law in prison for money laundering ?", "label": 1}
{"text": "He apologized to the natives for what the Catholics did.  The Catholics, misguided tried to bring the natives in the then modern world.  But Trudeau and his cronies would see natives confined to reservations and a Stone Age culture in an increasingly technological world.  He has done more harm than the Catholics ever did.", "label": 1}
{"text": "[https://www.justice.gov/usao-ma/pr/colombian-man-pleads-guilty-money-laundering-conspiracy](https://www.justice.gov/usao-ma/pr/colombian-man-pleads-guilty-money-laundering-conspiracy)", "label": 1}
{"text": "I think I've seen your drag show! you're \"Mrs. Thepoint\", right?", "label": 1}
{"text": "He is not a leader. \nHe is a dealer. And wants to be a ruler.", "label": 1}
{"text": "Because OP is a genocidal idiot who thinks every Palestinian is Hamas and that by wiping Hamas off they would obviously wipe Palestine off the map entirely.", "label": 1}
{"text": "You've been posting that link everywhere on this thread, but that link doesn't substantiate a tie between this person and PP.", "label": 1}
{"text": "Would you define Gaza, an area that has a population of roughly 2.23 million crammed into an area of 365 square kilometers as anything other than \"densely populated areas\" and \"urban warfare\"?\n\nFor the record that's a population density of roughly 6110 people per square km.\n\nFor comparison, TOKYO has a population density of 6158. \n\nNow yes, it's far cry from manila which crams in 72,857 per square kilometer, but to suggest that this isn't an urban conflict in a very densely populated area is either demonstrating great ignorance, or willful misinformation.", "label": 1}
{"text": "That’s a Genocide, stop spreading lies and misinformation", "label": 1}
{"text": "Too late.\n\n\nDespite the opposition leader getting clearance roughly two dozen times required for a variety of duties, people still make claims without evidence, with theories with holes in them that would make flat earthers blush.\n\n\nIt would be neat if the mods sticked one of Mulcair's interviews explaining the nsicop act just to clean up the sub. This issue has been polluting the sub to the point where comment threads in every new post about any number of topics are derailed with fanfics about Pierre's wife being a terrorist.", "label": 1}
{"text": "Perhaps you should look in a mirror.\nAnd in a history book, to see how what is happening in Gaza is nowhere near being a genocide.", "label": 1}
{"text": "Stop trying to state your opinion as fact. \n\nWhat is happening in Gaza is a war, not a genocide.", "label": 1}
{"text": "His last security clearance was in 2015 as a minister. He hasn't had one since he decided to elope, just him and his Venezualan wife, in Portugal, in 2016. I have an inkling this has something to do with it.", "label": 1}
{"text": "Gaza is exactly that, urban warfare in a densely populated area.\n\nThank you for proving my point.", "label": 1}
{"text": "We'll, let's have a look at the definition of genocide:\n\n\"Article II of the convention defines genocide as ANY of the following acts committed with intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such:\n\n(a) Killing members of the group.\n\n(b) Causing serious bodily or mental harm to members of the group.\n\n(c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.\n\n(d) Imposing measures intended to prevent births within the group.\n\n(e) Forcibly transferring children of one group to another group.\"\n\nIt seems fairly obvious several of the acts have been committed, so that just leaves the matter of intent.\n\nBeyond reading genocidal intent from the statements of Israeli officials:\n (https://law4palestine.org/law-for-palestine-releases-database-with-500-instances-of-israeli-incitement-to-genocide-continuously-updated/)\n\n...genocidal intent could be interpreted from their destruction of water infrastructure, their destruction of medical care infrastructure, their denial of food and medical aid into the region, their attacks on aid workers, etc.", "label": 1}
{"text": "We'll, let's have a look at the definition of genocide:\n\n\"Article II of the convention defines genocide as ANY of the following acts committed with intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such:\n\n(a) Killing members of the group.\n\n(b) Causing serious bodily or mental harm to members of the group.\n\n(c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.\n\n(d) Imposing measures intended to prevent births within the group.\n\n(e) Forcibly transferring children of one group to another group.\"\n\nIt seems fairly obvious several of the acts have been committed, so that just leaves the matter of intent.\n\nBeyond reading genocidal intent from the statements of Israeli officials:\n (https://law4palestine.org/law-for-palestine-releases-database-with-500-instances-of-israeli-incitement-to-genocide-continuously-updated/)\n\n...genocidal intent could be interpreted from their destruction of water infrastructure, their destruction of medical care infrastructure, their denial of food and medical aid into the region, their attacks on aid workers, etc.", "label": 1}
{"text": "And can we *please* keep in mind that this is the first war *in history* where one side is actively trying to get its own civilians killed for a foreign PR boost?", "label": 1}
{"text": "Every war would include several of those items including “killing members of a group” and “serious bodily and mental harm to members of a group”\n\nBy Israel’s actions they have not shown intent to destroy the Palestinians as a group.\n\nIf they had, the militant to civilian casualty rate would be much higher, when in fact is the opposite.\n\nThe article I included from John Spencer details many of the actions that Israel takes to limit civilian casualties.\n\nHere is an article written by 7 legal experts on genocide that go further on why this is incorrect\n\nhttps://www.nydailynews.com/2024/08/11/the-big-lie-of-genocide-gaza-seven-experts-on-nazi-genocide-expose-the-canard-of-israeli-crimes/\n\nThey are, as a whole, targeting Hamas, and this War would end if Hamas surrendered.", "label": 1}
{"text": "\"... could be interpreted...\"\n\nThe original genocide was the Nazis \"final solution\".  Their deliberate efforts to exterminate an entire people.  It's just about the worst thing that one group can do to a people.\n\nThe present war in Gaza doesn't even come close.  Not even close.", "label": 1}
{"text": "And yet she is no longer considered to be energizing at all.  She ran as the “change” candidate and then told the hags on the View that she wouldn’t change anything from Biden’s policies.  She skipped the Al Smith dinner and pissed off 90 million Catholics.  Then Obama tried to lecture blacks to vote for her as if they had a right to the black vote.  Then Tampon Tim goes on a tirade about the “billionaires” supporting Trump, when over 80 support Kamala.  Finally, calling Elon Musk “that gay guy”, as an insult, pissed off many Kamala weak supporters, who also watched as Trump got attacked by the leftist media for the comedy of Tony Hinchcliffe, an outspoken gay comedian who they knew well, and attacked him stupidly about his roast comedy sketch, which made him #1 comedy podcast on Earth.  So suddenly Democrats looked the homophobes over the Republicans - who have a branch of their or party that openly welcomes gay members, the Log Cabin Republicans.\n\nPeople are sick of the leftist bullshit and the division and economic disaster their policies have caused globally in the last 4 years.", "label": 1}
{"text": "Shame on you for being naive", "label": 1}
{"text": "And there's rafts of legal experts who say it *is* genocide.\n\nHopefully we can agree that, whether correct or incorrect, the label of genocide isn't *outlandish*.\n\nIt's at least plausibly correct, yes?\n\nAnd if it isn't genocide, it's still crimes against humanity and war crimes, right? Still deplorable actions we should all be condemning, right?", "label": 1}
{"text": "I'm not arguing about the relative severity of different genocides, just that the Netanyahu regime's recent actions could reasonably meet the definition of genocide.", "label": 1}
{"text": "Ok ... my apologies . By everywhere you mean two places", "label": 1}
{"text": "When you become Prime Minister, you get the access to information like this WITHOUT the lifetime NDA that he would have to agree to as leader of the opposition.   Which is why Trudeau could, at any time, release the names of the people in the documents as PM.", "label": 1}
{"text": "Good troll, amigo.", "label": 1}
{"text": ">Sounds perfectly acceptable by IDF standards?\n\n\"Hi, everybody. I'm Mr. CptCoatrack. I have zero credibility and am filled with self-righteousness. And don't you worry about bad faith arguments, I got lots of 'em.\"", "label": 1}
{"text": "You spend your workweek defending the IDF with Hasbara garbage, I don't think you're in the middle of this issue at all. Bad faith is directing the conversation, inevitably, towards an accusation of anti-semitism. I'm sorry you're upset that I called your IDF buddies ethnic nationalists.", "label": 1}
{"text": "Seriously thank you. ---- I'll look deeper into it and correct my other post.\n\nI'm surprised it has not been officially corrected or explained in a more public way before.\n\nAgain, apologies for my inaccuracies if they are so.", "label": 1}
{"text": "Yeah you know what, the problem isn't the genocide but the fact people against genocide sound self-righteous about it..\n\nNot even getting into the irony of people defending a genocide committed by an ethno-religious apartheid state complaining that other's are \"self-righteous\" as they yell \"But Hamas!\" for every dead child and carry a handful of backpocket bible quotes to defend a 2000 year plus land claim.", "label": 1}
{"text": "Riiiiight, just trust the other guys... Who built a pipeline. Cool.", "label": 1}
{"text": "Lol what a brain dead comment", "label": 1}
{"text": "So the people extracting, running, and governing the oil shouldn't be acknowledged?\n\nBut ya, the guy in Ottawa knows the economics perfectly", "label": 1}
{"text": "Of course the boomers think this is okay, they're lining their pockets by bending over the people in your position. Why would they ever kill their golden goose? Civic nationalism is dead. The boomer generation is sociopathic at its core and will never stop vampirically draining the economy, even if they end up leaving a rotting corpse for their children to inherit.", "label": 1}
{"text": "Ah yes, because my entire argument was based solely on the nice eating habits. \n\nThat wasn't in any way a simple example of how people are making budget concessions to less expensive foods, similar to how their living spaces have shrunk or the myriad of other examples I gave or indicated.", "label": 1}
{"text": ">FUCK your human rights\n\nVery cool lol. I've seen all I need to see here. Enjoy being a miserable human being.", "label": 1}
{"text": "Fortunately, it's already inevitable we are going to have a Conservative Majority and Prime Minister Pierre Poilievre within a year. And people like me will have all the power and influence.\n\nGod Bless Pierre Poilievre.", "label": 1}
{"text": "They’re toast anyway, because everything you’ve done Guilbeault, will be dismantled in less than a year. All the damage will be repaired.", "label": 1}
{"text": "No its not dead even. Not sure where you get your info but its gonna be a massive blue wave!", "label": 1}
{"text": "Link to an archive version (to get around the paywall):  [https://archive.ph/GHi7c](https://archive.ph/GHi7c)\n\nSome highlights:\n\n>The Ontario government is calling on Ottawa to put its digital services tax on hold, saying the new levy is putting the Canada-U.S. relationship at risk and could have serious repercussions on trade.\n\n>The [digital services tax](https://archive.ph/o/GHi7c/https://www.theglobeandmail.com/business/technology/article-business-lobby-group-warns-ottawas-digital-services-tax-could-imperil/), or DST, is upsetting Canada’s allies in Congress, said David Paterson, Ontario’s trade representative in Washington. It is unhelpful to the trading relationship, particularly with the upcoming renewal of the Canada-United States-Mexico Agreement in 2026, he added.\n\n>“Now is the time to be resolving issues and irritations, not collecting them,” Mr. Paterson said.\n\n>That the legislation is retroactive is particularly [irksome](https://archive.ph/o/GHi7c/https://www.theglobeandmail.com/politics/article-washington-requests-trade-dispute-talks-under-usmca-over-canadas/) to Americans, he explained, as is Canada’s decision to go ahead with the tax rather than waiting for the Organisation for Economic Co-operation and Development to get a global framework in place.\n\n>“There’s not all that many things that unite both Democrats and Republicans these days, but let’s not have it be opposition to Canada,” Mr. Paterson said.\n\n>The federal government, however, is defending the new 3 per cent levy, which is largely aimed at American [tech giants](https://archive.ph/o/GHi7c/https://www.theglobeandmail.com/politics/article-united-states-looking-at-all-tools-to-respond-to-canadas-digital/) that generate revenue from Canadian users, including Amazon, Google, Netflix and Spotify.", "label": 1}
{"text": "I saw thugs beating people with flag poles while their fellow \"protesters\" looked on and watched.", "label": 1}
{"text": "But voting that excess CO2 is good for the earth is hunky-dory.\n\n\nIta amazing how effectively hate and anger can override the part of the brain that separates us from the rest of the animals on earth. What a wild physiological mechanism.", "label": 1}
{"text": "Coming from the party [that ***celebrates*** CO2 emissions](https://www.nationalobserver.com/2024/11/02/news/albertas-ruling-party-votes-emissions-reduction-carbon-dioxide), I daresay the \"deranged\" is coming from inside the house, Smith.", "label": 1}
{"text": "I completely support cutting Canada's greenhouse emissions.\n\nBut mandating one industry cut emissions by 33% within the next 8 years *is* deranged.  It's just not enough runway to do it without crashing the economy.", "label": 1}
{"text": "You shall ensure safety for my citizens in your country however I shd be free to kill your citizens in your country at my will - modi", "label": 1}
{"text": "Look, i would love to be polite here, really. But however much i try to find some other way to formulate this, i can't. So you know, Modi can go fuck himself and crawl into his own ass. Sorry for being this crude.", "label": 1}
{"text": "On behalf of everyone, I accept your apology.  You're not wrong, though.  Not at all.  Modi is a piece of shit.", "label": 1}
{"text": "something something...", "label": 1}
{"text": "A foreign government is assassinating Canadians on Canadian soil. The same foreign government is interfering in our elections, according to CSIS. Protesting this foreign government peacefully on Canadian soil should never have consequences for any Canadian. \n\nLooks like Modi and the Indian government have corrupted Peel police.  The province should take over the police force until leadership that aren’t assets of a foreign government can be removed from Peel police leadership.", "label": 1}
{"text": "Well I mean USA, China, and India are the top three global polluters. So anything Canada would have such a minor impact. Instead of hampering our own economy, we should focus on these three players. Who are all the issue for the world.", "label": 1}
{"text": "An Albertan and not understanding equalization. Still can't name a more iconic combo.", "label": 1}
{"text": "Yes, explaining how they don't give it to the east. The feds take it from Alberta and give it to the east. \n\nLearning that distinction has solved all past Albertan concerns.", "label": 1}
{"text": "If your god is so strong, he'll take care of it. He doesn't need constitutional protections.", "label": 1}
{"text": "Oh yeah, because all the cheque's written to buy votes by Alberta premier has done sooo much for the province.", "label": 1}
{"text": "LOL, maybe he should start by looking at his own house and not just at Amit Shah:\n\n>This is Modi, this is the New India,” he said. “This New India comes into your home to kill you.”\n\nSounds like an admission of murder.", "label": 1}
{"text": "In Canada, some Khalistani supporters, implicated in the Air India bombing, are reportedly moving freely, with Singh allegedly fueling this issue. Trudeau may not fully understand the complexities he is engaging with.", "label": 1}
{"text": "Blah blah any country I don’t like is “promoting genocide”\n\nOfcourse the country is corrupted, just like every other third world country from the local traffic police to all the way to the top. What the hell does modi has to do with anything.\n\nWhy the hell would modi leave government? He has been elected as prime minister?", "label": 1}
{"text": "Khalistan is becoming a project of Canada (better than Pakistan)\n\nhttps://macdonaldlaurier.ca/mli-releases-khalistan-project-pakistan/", "label": 1}
{"text": "What an absurd comment. Since at least the Holocaust and the founding of the UN, the West has been decrying genocide and sectarian violence.", "label": 1}
{"text": "\"why do you feel you merit asylum in Canada?\"\n\n\"Your honour, I am being persecuted in my home country because I believe in using violence to achieve political ends.\"\n\n\"Welcome to Canada.\"", "label": 1}
{"text": "\"This is Modi, this is the New India,” he said. “This New India comes into your home to kill you.”\n\n- Modi, promotor of rule of law...", "label": 1}
{"text": "I want Harris to win, but all of the evidence points to a toss up. You should step out of your bubble and look around.", "label": 1}
{"text": "Hezbollah fired on occupied Lebanese/Syrian territory. No one on earth except Israel says it's Israeli.\n\nhttps://en.wikipedia.org/wiki/Shebaa_Farms", "label": 1}
{"text": "“I’m satisfied Mr. Manuel is not a completely bad person,” Ritchie said. “But Mr. Manuel, you acted very badly that day.”\n\nlol", "label": 1}
{"text": "Because the Liberals and NDP have allowed the festering of these radical, racially motivated crimes to perpetuate themselves for the sole purpose of gaining votes, they have thrown Canadian culture into a pre national state of mistrust,  violence and intolerance.  Are you two, and your complicit MPs proud of your accomplishments.  You both sicken me!", "label": 1}
{"text": "I'm mad that we can't do anything about the scammers that call our grandparents about their \"Windows virus\".", "label": 1}
{"text": "The hypocrisy...so your own PM can involve himself in Indian politics???? How many times have Trudeau shit instructed and opined on Indian domestic politics which is none of his business. When you dish it out continuously ready to take it .", "label": 1}
{"text": "Canadians are equally hypocrites as their PM it seems. They have no problem in supporting Trudeau when he involved in Indian domestic politics,but when tables are turned they are acting as offended . Typical first world people.", "label": 1}
{"text": "There is no God, but I respect our laws.", "label": 1}
{"text": "Khalistan is becoming a project of Canada now (earlier it was Pakistan)\n\nhttps://macdonaldlaurier.ca/mli-files/pdf/20200820_Khalistan_Air_India_Milewski_PAPER_FWeb.pdf", "label": 1}
{"text": "Khalistan is becoming a project of Canada now (earlier it was Pakistan)\n\nhttps://macdonaldlaurier.ca/mli-files/pdf/20200820_Khalistan_Air_India_Milewski_PAPER_FWeb.pdf", "label": 1}
{"text": "Khalistan is becoming a project of Canada now (earlier it was Pakistan)\n\nhttps://macdonaldlaurier.ca/mli-files/pdf/20200820_Khalistan_Air_India_Milewski_PAPER_FWeb.pdf", "label": 1}
{"text": "The comments here from Canadians are really funny. Gave me a good laugh. I also realised being from first world doesn't necessarily mean knowledgeable about world politics, geopolitics and apparently even ignorant to their own governments policies. \n\nAlso Indian PM hasn't commented on another country's inside politics until now except Pakistan unlike Canadian Politicians who feel they are entitled to on India's domestic politics. Perhaps you should teach etiquette to your own politicians first or is it acceptable coz yk ur first world people. \n\nAnd anyone who thinks India's approach to Russian issue, Canadian issue is exclusively due to Modi &it's fascist govt and that it would be polar opposites if it was Liberal secular Opposition Party is nothing short of delusional and ignorant to the height of stupid. Tell me indirectly you have no clue about India's foreign policy.", "label": 1}
{"text": "the need them to protect themsevles against sword weilding khalistani thugs who intimidate both non-khalistani sikhs and hindus.\n\nAnd their immigrant leaders tell people like me who were born here to 'go back home' in their accented english becasue we don't think a theocratic state is a good idea.\n\n[https://www.youtube.com/watch?v=3hk\\_L3rqYCw](https://www.youtube.com/watch?v=3hk_L3rqYCw)", "label": 1}
{"text": "are you or are you not sikh?\n\nonly a 100% committed religious sikh would brush away the assaults that occurred\n\ni got no problem with sikhs, theyre chill by and large, but a large minority of them are very violent and need to be put in cages for the rest of their life", "label": 1}
{"text": "Is it illegal that embassy staff cannot be invited?\n\nhttps://x.com/puratan_sikh/status/1853348141543858271?s=46\n\nMany aged sikhs and hindus came to temple so embassy staff can get their signature in order for Indian govt to give them pensions. \n\nConsidering Hindus and Sikhs peacefully were inside temple shows that only Khalistani terrorists with yellow flags were outside disrupting peace. \n\nMaybe Canada should stop allowing Separatist elements into Police force?", "label": 1}
{"text": "You're welcome to report all of this to the cops, but I don't think they will do anything. Pannun's video here is bombastic and overly dramatic, but it's entirely covered by the Charter. Calling people disloyal and telling them \"to go back home\" is protected speech. The \"Kill India Referendum\", if you'll notice at several points in the video, is a question over whether the Indian government assassinated someone (Hardeep Singh Nijjar) on Canadian soil. The Indian government, at its highest levels, authorized this.  \n  \nYou're not making a good case for yourself, but I get your sentiment. You're born here, you're Canadian, you're not disloyal. I think the problem lies with the provincial and federal governments. We *should* be rooting out Modi's assassins, spies, agents, accomplices, and assets. The sooner that people feel as though they're not going to be assassinated in the street by an enemy state, the sooner the temperature is going to go down.", "label": 1}
{"text": "\"But tougher sentences are racist!!!\"\n\n \\- some clown, probably.", "label": 1}
{"text": "lol your typing this as Hindus are being mass arrested for their illegal riot lol", "label": 1}
{"text": "okay do two wrongs make a right ?", "label": 1}
{"text": "He shouted racial slurs. And more likely he's gotten lucky and not hurt anybody before with his road rage and poor driving.", "label": 1}
{"text": "\n>Sword weilding khalistani thugs\n\nNot a single person had a sword..\n\n\n>who intimidate both non-khalistani sikhs\n\nWhere and when? This wasn't in any of the videos.\n\n\n>entered into a hindu temple during diwali celebrations\n\nThey never entered the hindu temple in fact the whole altercation took place off the temple property and then for a brief moment into the temple parking lot when the pro Indian group fled.\n\n\n>started beating people up as part of a protest.\n\n\nThere's videos showing that the pro India group actually instigated the entire fight and struck the pro khalistan group first. The video even captures Audi of the pro India group afterwards distributing sticks and bricks to attack the khalistan group with.\n\n\n>And their immigrant leaders tell people like me who were born here to 'go back home' in their accented english becasue we don't think a theocratic state is a good idea.\n\nThe head of the hindu temple addressed the crowd in the parking lot where he shouted that any Sikhs that get in their way will be killed.", "label": 1}
{"text": "The Peel officer was a Khalistani. He was invited by Trudeau.", "label": 1}
{"text": "Agreed on that front, but a lot of them are also citizens.", "label": 1}
{"text": "go away modi bot", "label": 1}
{"text": "i hate to grammar police but “hordes”? really? what is this, the 1800s?", "label": 1}
{"text": "Right, and I have concepts of a plan.", "label": 1}
{"text": "Maybe a good time to start checking status and those not Canadian get sent back for this kind of behaviour. Sometimes it’s hard to recognize this country anymore. ", "label": 1}
{"text": "I hope we're not slowly veering into US territory where a \"bad person\" is someone who's skin colour or political stance is opposite of the judge's.", "label": 1}
{"text": "Exactly.\n\nThese groups are carrying on the tradition of all newcomers to this land. We all brought our overseas conflicts here, to continue to murder each other and physically threaten violence for practicing different religions.\n\nCanadians have no core identity or mainstream, but this is indeed part of our heritage.", "label": 1}
{"text": "Money printer go brrrr", "label": 1}
{"text": "This is some truly stupid line of reasoning.  Yes.  In the 1750s, the English and French were at war with each other.  \n\nWe have people clubbing eachother in the street over a fantasy country that doesnt exist.  Any immigrant coming to Canada with a 1750 mentality can feel free to get the fuck out and never cone back.  We shouldn't have to put up with their bullshit.", "label": 1}
{"text": "> Canadians have no core identity or mainstream\n\nAccording to who, exactly?", "label": 1}
{"text": "Agreed. Anyone that's non citizen that is pro assassination of Canadians need to be deported. \n\nAlso why are people waving the flag of a country that assassinated an Canadian on Canadian soil?", "label": 1}
{"text": "The Prime Minister of Canada, Justin Trudeau.\n\n>  in 2015, Justin Trudeau declared, “There is no core identity, no mainstream in Canada,’’ and consequently that “makes us the first post-national state.”\n\nhttps://www.cbc.ca/news/canada/calgary/donna-kennedy-glans-don-hill-trudeau-confederation-risk-1.4937499", "label": 1}
{"text": "Trudeau is more an idealist pushing his will over reality, than an academic analyzing reality", "label": 1}
{"text": "Canadians don't want to admit that religion is bullshit and is the fundamental problem in all these cases.", "label": 1}
{"text": "We should do some value test after 2 years on our soil. Question could be:\n\n\n-on pancake, you put: A) maple syrup B) mustard C) ketchup\n\n-in the playoff, you cheer for: A) the Maple Leaf B) any other team\n\n-the Montreal airport have the name of PET because: A) we wanted to honor him B) he wanted to make people remember that he tried to close it in favor of Mirabel\n\n-the country official leader is: A) the honorable Prime Minister B) the Irving family. C) some nominated person who cut tape and his being paid to stay in Ottawa", "label": 1}
{"text": "Nah they don't even send those involved in armed bank robbery to jail because it might affect their immigration status", "label": 1}
{"text": "It’s disgusting the state of the country right now. I barely recognize the place. The city I live in has so many issues stemming from mass unsustained low wage immigration and inadequate health services and lack of housing it is causing problems for many, yet it’s forced upon us without a say in the matter. \nPre 2015 it was reasonable and not an apparent issue, this government has ruined our immigration system to the point of rather see it 0 until we can even support skilled workers coming in. ", "label": 1}
{"text": "He doesn't get to decide that. No PM or individual does.", "label": 1}
{"text": "The PCL-R", "label": 1}
{"text": "Respectfully I don’t take directions from Justin Trudeau on my culture and how I perceive myself as a Canadian.", "label": 1}
{"text": "Neither do I.\n\nBut it’s important to remember what our Prime Minister thinks matters to Canadians.  As that is what ultimately guides his policies, plans and vision.", "label": 1}
{"text": "And that comment should have voted him out alone. ", "label": 1}
{"text": "Bro. This is such a narcissistic country. Lol", "label": 1}
{"text": "Its our money, not the Liberals. The LPC has a histpry of taking our money and turning it into slush funds for their friends. Its only natural the MPs want a piece. ", "label": 1}
{"text": "Yeah I'm gonna need proof of this. Without that, you're just spewing rumours.", "label": 1}
{"text": "As a white canadian i know Sikhs are terrorist and belong to organized crime. They are offshoots hamas and hizbullah.. be careful when u see a sikh with big turban and beard they are HAMMAS AND HIZBULLAH", "label": 1}
{"text": "\n\n>Can't imagine why that could be? Could be related to the insistence that the Fraser Institute is also presented as a credible source in the article.\n\n?????\n\nYou always think conspiracy theories?", "label": 1}
{"text": "It’s not a conspiracy to say that the Fraser institute has an agenda. As a matter of fact their agenda is the only reason they exist.", "label": 1}
{"text": "Honestly, I hope Punjab separates from India. I want to see how many Khalistanis move to Punjab then and I also want to see how it will not become one of the biggest failed states in the world.", "label": 1}
{"text": "I'm going to keep wearing a 3ft Kirpan. ", "label": 1}
{"text": "Ignore this text, this text is nothing. This has nothing to do with the rest of my post. At the end of this paragraph is my actual comment. I apologize for the inconvenience. The following is now my actual comment:\n\nOP did the article change its headline or did you decide to remove the \"pro-India\" part from the protest?", "label": 1}
{"text": "So you don't think LGBTQ folks are people. \n\nWow.", "label": 1}
{"text": "Are you okay? The difference isn’t that LGBTQ are not people, it’s that stonewall didn’t involved mass rape, kidnapping and murder.", "label": 1}
{"text": "That’s not true, there’s plenty of groups that are more than a couple generations in and things are like this - Turks in Germany, Pakistanis in the UK. It’s easy to integrate high quality immigrants here/North America (look at how well the Pakistani communities does in America for example) it’s harder if the immigrants are from rural areas, lower educated. The diploma mill spurned immigration of the past few years will have consequences for a very long time.", "label": 1}
{"text": "> Turks in Germany, Pakistanis in the UK. \n\nPlaces where they're treated like shit by the people living there.", "label": 1}
{"text": "Israels love to be victims so of course they want to parade oct 7th as if history didnt start in 1948.", "label": 1}
{"text": "I disagree, maybe for Turks in Germany. But Pakistanis in the UK more other factors - high rates of foreign spouses etc", "label": 1}
{"text": "/eye roll", "label": 1}
{"text": "There are several stories of drivers having killed people getting off with no jail time. I'm confused. I'm generally in favour of BC's no fault system because it keeps the parasitic lawyers out of it, but the punushment always seems to not fit the damage done.\n\n\nTHIS IS YOUR ORIGINAL STATEMENT...\n\n\nPeople facing criminal charges and getting light sentences  HAS ZERO TO DO WITH INSURANCE.", "label": 1}
{"text": "Yes i said those words. And you seem to not understand no fault insurance means victims cannot sue if the criminal system doesn't satisfy the victims given all these examples of no charges or light charges.\n\nGiven this exchange, i can only presume your one of those prosecutors who cooks up these cockamanie deals with the defendants leaving victims families hanging.", "label": 1}
{"text": "OMG. YOUR DELUSIONAL. \n\nThe criminal justice system is not in place to satisfy a victims \"felling\" that what happened was not fair.  \n\n and again\n\nAUTO INSURANE  HAS ZERO TO DO WITH THE CRIMINAL CHARGES A PERSON GETS CHARGED WITH.", "label": 1}
{"text": "Yes i know, not sure if you know i know, but apparently you don't know i know, but i know. but do you know that i know.\n\nDid you even understand what i was low key complaining about? because  i know that i know, but i'm not sure if you know that i know and i was complaining about a gap in our no fault system. do you know that? i know that.", "label": 1}
{"text": "> but i'm not sure if you know that i know and i was complaining about a gap in our no fault system. \n\nIt's not a gap, its a feature. The vast majority of people complaining are lawyers who can't get rich  chasing ambulances anymore and people who are.not getting 40 k for some muscle strain.", "label": 1}
{"text": "> I mean if you want the date of the stonewall riots\n\nWhat an absolutely unhinged comparison to make.\n\nAn October 7th license plate would be like cheering for the local Klan chapter on a government-issued plate.", "label": 1}
{"text": "☝️", "label": 1}
{"text": "> An October 7th license plate would be like cheering for the local Klan chapter on a government-issued plate.\n\nNot at all. That an unhinged comparison to make.", "label": 1}
{"text": "Welcome to the BRICS. This is just Eastern fascist politics trying to subvert Canada. We let in so many immigrants that honesty has given up. So they've infested us unfortunately. I love China I love the people but the government and the government of India are shitty and we're getting influence and fucked over by them. So enjoy till we figure out a way to deal with it", "label": 1}
{"text": "lol, ok.", "label": 1}
{"text": "schmorganized schmime", "label": 1}
{"text": "Hindu extremists are planning petrol bomb attacks on Sikh Gurudwaras. ", "label": 1}
{"text": "Thats Timbit Trump for ya", "label": 1}
{"text": "No he shouldn’t have opened the floodgates on immigration. Why are we letting 40 yr olds student assassins get student permits to attend community colleges?", "label": 1}
{"text": "Lol wat.", "label": 1}
{"text": "The assassins came here on student visas, since there's no checks or balances in the system, making it the easiest way to get into Canada.", "label": 1}
{"text": "I'm almost positive that Secular Sikh isn't a thing, it's not like being Jewish ethnically, while not religiously. Sikhism wholly just a religion, and to be a Sikh is to practice that religion. Anyone can be a Sikh.", "label": 1}
{"text": "Those people are uneducated children who don't  understand how basic economics work. \n\nEvery credible economist unanimously say deflation is bad for the economy, full stop.", "label": 1}
{"text": "Who pays for her patronage position, that sounds really cool at brunches?\n\nThe Swiss & Eyetalians were supposed to be overseeing UN involvement in Gaza, obviously that oversight has not just been lacking, but outright corruption and even complicit actions, has been the status quo for too long.\n\nSowry Frankie, there's a new sheriff in Gaza, and they wear the Star Of David.  Take your anointment, and mimosa's, and stand over there.", "label": 1}
{"text": "Source?", "label": 1}
{"text": "when did Sikhs attack Muslims at Golden temple!?\njust straightaway making things up now?", "label": 1}
{"text": "Ahh yes, the go to defense of the Israeli lobby, which at this point carries zero weight", "label": 1}
{"text": "yes the liberals ballooning inflation globally. I am truly in awe of their power to trigger this worldwide phenomenon.", "label": 1}
{"text": "No one cares about that. They just want to afford groceries.", "label": 1}
{"text": "Everyone I know in the mainstream majority can afford groceries. But then again, we aren't part of the poors - who nobody else really cares about. I know that I don't.  ", "label": 1}
{"text": "You're comment has nothing to do with the situation noted above.", "label": 1}
{"text": "She supports October 7th, enough said.", "label": 1}
{"text": "Inflation is fine if salaries go up as much or more. That has not happened. \n\nEither prices need to come down, or salaries need to significantly go up. \n\nGiven the massive corporate profits from every major grocery chain, decreasing prices is the easier short term solution.", "label": 1}
{"text": "Your comment makes zero sense, enough said", "label": 1}
{"text": "Soybean futures overnight. AY LMAO", "label": 1}
{"text": "Idk. They made a ton of bad choices but she was a bad candidate from the get-go. Can't make chicken salad from chicken shit.", "label": 1}
{"text": ">Inflation is fine if salaries go up as much or more. That has not happened.\n\nSalaries have outpaced inflation\n\n>Either prices need to come down\n\nPrices on some grocers have come back down", "label": 1}
{"text": "Its also 40th anniversary of that very PM launching an anti-terror operation against the terrorists who had made the a building adjacent to thr Sikh's most holy temple. The actual temple was not attacked. Akal Takht is not Sikh temple, it is a a separate building and pilgrims don't visit Akal takht for pilgrimage but the Golden Temple. Also, several opportunities were granted to the terrorists holed up inside the Akal takht to surrender but they refused. Instead the terrorists converted the building into a fortress by installing small arms and automatic weapons. The 30 other \"temples\" were not historically significant but village temples which were being used by terrorists. \n\nAmple warnings were given to the khalistani terrorists to not take that route.", "label": 1}
{"text": "###This is a reminder to [read the rules before posting in this subreddit](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion).\n \n1. **Headline titles should be changed only [when the original headline is unclear](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_1._headline_titles_should_be_changed_only_where_it_improves_clarity.)**\n2. **Be [respectful](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_2._be_respectful).**\n3. **Keep submissions and comments [substantive](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_3._keep_submissions_and_comments_substantive).**\n4. **Avoid [direct advocacy](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_4._avoid_direct_advocacy).**\n5. **Link submissions must be [about Canadian politics and recent](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_5._link_submissions_must_be_canadian_and_recent).**\n6. **Post [only one news article per story](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_6._post_only_one_news_article_per_story).** ([with one exception](https://www.reddit.com/r/CanadaPolitics/comments/3wkd0n/rule_reminder_and_experimental_changes/))\n7. **Replies to removed comments or removal notices will be removed** without notice, at the discretion of the moderators.\n8. **Downvoting posts or comments**, along with urging others to downvote, **[is not allowed](https://www.reddit.com/r/CanadaPolitics/wiki/downvotes)** in this subreddit. Bans will be given on the first offence.\n9. **[Do not copy & paste the entire content of articles in comments](https://www.reddit.com/r/CanadaPolitics/wiki/rules-thelongversion#wiki_9._do_not_copy_.26amp.3B_paste_entire_articles_in_the_comments.)**. If you want to read the contents of a paywalled article, please consider supporting the media outlet.\n\n*Please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FCanadaPolitics) if you wish to discuss a removal.* **Do not reply to the removal notice in-thread**, *you will not receive a response and your comment will be removed. Thanks.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CanadaPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "That very Canadian was a terrorists and responsible for the killing of two Indian citizens in Punjab and was also conspiring to cause bomb blasts in India. India had requested his extradition time and time again but Canada government never complied. If a Canadian citizen can kill Indian Citizens then why do you get all riled up if India got that perpetrator of the violence and murder of its citzens killed.", "label": 1}
{"text": "That's... Not what happened. It's hate. Hate won.", "label": 1}
{"text": "Trump absolutely crushed the Latinx and Puerto Rican vote. It’s not about hate, it’s about policy.", "label": 1}
{"text": "The policy of deporting millions of people?? I just don’t see how people would think thats a good policy.", "label": 1}
{"text": "Lol.", "label": 1}
{"text": "Congrats to Putin on a hard fought win. Pulling in Elon and the bro vote seemed to put it into trumps favour.", "label": 1}
{"text": "What policy???? Mass déportation? Removing Fluoride from water? Hate won the person on top is right.", "label": 1}
{"text": "Policy ?? lol \nIt’s about sexism with the Latino vote.", "label": 1}
{"text": "lol no the big takeaway is that Americans continue to prove they’re the stupidest people on the planet. \n\nDon’t try and make it seem like Trump won because of his stunning commitment to policies, he won because over 70 million people are more concerned with “owning the other team” than the fact that their elected representative is a Russian asset or serial sex criminal", "label": 1}
{"text": "He won because people didn't vote for Harris. That's it.\n\nHe got the same number of votes as last time but she got almost 20 mil less than Biden.\n\nShits fucked", "label": 1}
{"text": "After all the time Trudeau spent apologizing on behalf of Canada a future PM is going to have to apologize for his governments complicity.", "label": 1}
{"text": "political scientists and inbred understand that every vote counts.\n\nThe “deplorable ones” got Hillary out of the political system \n\nexpand your take so we can fully grasp your wisdom", "label": 1}
{"text": "Not backing a genocide in Gaza would have been a solid start. Can't wait this week for the dogshit takes that put the blame on \"ultra leftists\" and \"pro palestinian anti semites\"", "label": 1}
{"text": "It's still baffling that voters give a shit about a conflict in the Middle East that the US isn't even actively involved in so much.", "label": 1}
{"text": "Damn, what are you smoking?", "label": 1}
{"text": "No it’s not , stop crying your liberal tears", "label": 1}
{"text": "What was the whole Trump campaign about? Hate. Hate against women, hate against LGBTQ, hate against immigrants and anyone non-white or non-Christian.\n\nHitler returns.", "label": 1}
{"text": "lol got to be a bot.  democracy and trump are like oil and water", "label": 1}
{"text": "They sure do. And the fact that they don’t rein him in when he attacks with hate instead of policy, tells us all about the CPC as a whole. None of them have shame. And that’s dangerous.", "label": 1}
{"text": "hahahaahah lets go, trump! cant wait to hear all the crying democrats", "label": 1}
{"text": "Voters get exactly the politicians they deserve.", "label": 1}
{"text": "The left is just going to keep calling everyone else stupid and hope it sticks eventually I guess.", "label": 1}
{"text": "I would say that the US primary system gives the Americans worse candidates than they deserve. They didn't even get a chance to choose Kamala as a candidate!", "label": 1}
{"text": "If you think Trump is only racist towards illegal immigrants then you've lost the plot.", "label": 1}
{"text": "I understand water management. I think it’s your who’s being obtuse on purpose.", "label": 1}
{"text": "Since trying to make people angry with anonymous online comments became a lifestyle for some guys.", "label": 1}
{"text": "And that won't happen.", "label": 1}
{"text": "You can google Skippy, Andrew Sheer and most backbenchers elected straight out of homeschooling. It’s all right there.", "label": 1}
{"text": "Go educate yourself. It’s right there for all to see. PP making videos of him working out. The glee in their eyes when they attack Mr. Singh. They’re playing the facist political playbook. That makes them fascists.", "label": 1}
{"text": "If it is so easy to find, just link me an example. You made the claim now back it up", "label": 1}
{"text": "I'm sorry that facts annoy you so much.", "label": 1}
{"text": "This kind of divisive speculation is only going to lead to more turmoil.", "label": 1}
{"text": "So... source them.", "label": 1}
{"text": "you are the one complaining", "label": 1}
{"text": "Because there's reason for that speculation.", "label": 1}
{"text": "I'm not doing your homework.", "label": 1}
{"text": "I'm making a statement.", "label": 1}
{"text": "That's what I thought. You have no facts, just feelings and you want everyone else to feel them too.", "label": 1}
{"text": "Yea, you're personal feelings that some guy on tiktok told you to feel. \n\nLol.", "label": 1}
{"text": "oh a neutral one, neat", "label": 1}
{"text": "I stopped using Facebook around six months ago, and I don't go to YouTube for political opinions. I also use Twitter maybe twice a week at most.", "label": 1}
{"text": "No it’s not angry men, just regular men who have been left of the liberal agenda. Unfortunately many liberals paint all men as “toxic”. This is why the democrats did not do well amongst men. Same is going to happen in Canada.", "label": 1}
{"text": "No... it isn't. \nAnd it wasn't last time either. \n\n\nThis shit about EVERY American election being the defining moment of democracy since 2008 is getting pretty repetitive.  \nFace it... nothing will change.   Harris would have sucked,  Trump will suck. \nThey are just different ladle fulls from the same pot.", "label": 1}
{"text": "Tell that to Ukraine. Tell that to those who don't want a national abortion ban.  Tell that to every nation about to get slapped with tariffs. Tell that to Canada and Mexico who have to renegotiate NAFTA in 2026.   \n\n\nThis is a bad take.", "label": 1}
{"text": ">Trump surrounded himself with normal people last time…\n\nThis time he is surrounded by sycophants.\n\n>There was safeguards. He also thought if he broke the law he could be held accountable.\n\nThe Supreme Court has nearly made him a king\n\n>Every single safety America had from a lifelong conman is now gone.\n\nThis is going to get dark", "label": 1}
{"text": "I expect to see a lot of \"both sides\" coping like this over the next few years as reality sets in.", "label": 1}
{"text": "The doomers will be out in full force for a while.", "label": 1}
{"text": "No such thing as a national abortion ban.  \nThat's purely made up by you,  or someone you heard it from. \n\nTo be clear,  I dislike Trump... but what he has EXPRESSLY said on abortion is it will be up to each state to decide.  The federal government won't be involved,  either way.  \n\nI'm Ukranian Canadian( born to Ukranian parents in Canada) so I don't need any insight into that from you,  thanks.  I spend part of my pay cheque to help my family , actively fighting as I write this.  I get updates from the front lines ( when possible), so save your outrage.  Unless you're sending money yourself to help them,  I don't want to hear about how someone else should be.    You don't need trump to send weapons.  If everyone who bitched about how trump is going to pull support from Ukraine sent even 10 bucks a month,  they wouldn't need US federal funding.  \nIf you believe in a cause,  help it.  Don't demand someone else does it.  \nWould I PREFER  USA keeps the taps open?  Of course.  \nBut I'm not sitting around, crying about a politicians opinion on the situation.  \nGive Ukraine money yourself,  so they can just send an order for himars", "label": 1}
{"text": "Did you cut and copy this post from 2016?", "label": 1}
{"text": "This proves 2016 wasn’t a fluke and that latching on to the worst in people can work. This election is different. Right wing extremism will flourish globally now. We will be fighting this kind of politics for the rest of our lives. ", "label": 1}
{"text": "I support a vet who sends drones to Ukrainian front line units. He's on youtube and had his own website, combat vet reacts, check him out. I've given more than 10 bucks a month so you can shut your trap. Even if every Canadian sent 10 bucks a month, every man woman and child that would be 5b a year, a pittance. The USA sent them 60b worth of aid and equipment. You think 10 bucks from every Canadian would move the needle? You're nuts. \n\nAs for project 2025, abortion ban is there. Not making that up.", "label": 1}
{"text": "Oh really?  Got a source on that?  Cause as far as I saw, there was no news coverage on that.", "label": 1}
{"text": "get ready to get fucked Canada, its coming... lol", "label": 1}
{"text": "> And it wasn't last time either. \n\nit was and the consequences are still being dealt with", "label": 1}
{"text": "My former FIL was on CTV news complaining about it, having lived right on a border city. They have since pulled the video and trimmed his words in the archived articles.", "label": 1}
{"text": "The rate of climate change depends on the leadership of the countries who impact it the most. With the third largest population in the world, if the US reverses policies, it’s likely climate change will accelerate", "label": 1}
{"text": "Are you a bot?\n\nHow could I copy and paste from then this is comparing them to now.\n\nTrump had to be talked out of trying to use the military on his own people multiple times.\n\nThat’s where the “I want hitlers generals” quote comes from, he wanted generals who would do anything he said…", "label": 1}
{"text": "Don’t you know? The budget balances it self? \n\nTrudeau learned this economic miracle from daddies credit card. He has Bobby Hill level of economic aptitude.", "label": 1}
{"text": "PP is doing it, so is it that hard?", "label": 1}
{"text": "How does a national abortion ban in the US a crisis for Canada? Also there’s no national abortion ban proposed by trump or the republicans. They believe it’s the States who should decide. Each state will decide if abortion is legal or not.", "label": 1}
{"text": "I guess we shall see if project 2025 is a real thing soon enough, because there is a national abortion ban in there. \n\nAnd as they strip rights away from American women, Canadian conservatives will be taking notes.", "label": 1}
{"text": ">while we tear ourselves apart over identity politics \n\nI’ve long thought that while DEI policies make left leaning people happy they don’t gain supporters for it, in fact they lose some.", "label": 1}
{"text": "There was a podcast with Louis ck where he talked about how the left is at the point where when you're like \"I'm a liberal\" they say \"prove it!\" Instead of saying \"great! Welcome!\"  If you disagree with liberals on even the tiniest detail they immediately label you racist/transphobic/homophobic/stupid.", "label": 1}
{"text": "That's exactly what you said in 2016.\n\nAnd then in 2020 everyone said we'd be fighting left wing extremists..", "label": 1}
{"text": "Oh my, God! Are you telling me a politician made a bullshit promise to a special interest group? During an election campaign?!?", "label": 1}
{"text": "Ah, yes. Because Trump won, suddenly Canadians will stop feeling the effects of the housing crisis, cost-of-living and increased crime. Got it.", "label": 1}
{"text": "I had no idea what was going on in 2016 and I feel like most people didn’t. I’ve spent 8 years reading and trying to understand right wing American culture. You’re wrong. This time it means something different. There no turning back for the republicans now. ", "label": 1}
{"text": "If working out makes someone a white nationalist then maybe it's time you took a break from the Internet ", "label": 1}
{"text": "Not substantive", "label": 1}
{"text": "A few months of watching a gang of right wing populists running wild in the states might sober up some Canadian voters who think bringing that here will somehow punish Trudeau.", "label": 1}
{"text": "No.   America ALLOTED 60 bn for aid.   Much hasn't been delivered.  And what they really need is deep strike capabilities,  which Biden has rejected at every turn.  \n\nGood on you for donating.  \nKeep donating instead of whining on Reddit if you're actually worried about Ukraine. \n\nIf even 30 percent of the people who claimed to donate actually did,  Ukraine would be a rich place.", "label": 1}
{"text": "Can you give some examples", "label": 1}
{"text": "Climate change is effected almost exclusively by India,  China,  Brazil and the major developing nations.", "label": 1}
{"text": "So, the Liberal government should just be forgiven for the crisis and discontent they've caused? Not saying the Conservatives will be able to fix much. These are issues no one can fix. But really? Suddenly Canadians will start feeling better? Get real.", "label": 1}
{"text": "You're a dull one aren't you.   The point is you guys claimed ALL the same shit last time.\n\n\nAnd nothing happened.", "label": 1}
{"text": "Ukraine is an interesting situation.  There are a bunch of former communist party officials who are now wealthy oligarchs, which is basically who the west is supporting.\n\nBy wanting to end the war, Trump may have the right approach.", "label": 1}
{"text": "There’s not going to be a national abortion ban, that isn’t how America works. The USA consists of UNITED STATES. Meaning that these decisions are STATE LEVEL. Roe v Wade was overturned years ago and only 8 states have made abortions illegal.", "label": 1}
{"text": "How about we send you all the 2 million illegals that stormed into the USA in the past few years. \n\nYou all can tell them to off themselves to better help the government when it is overwhelmed, like you do to your own people already.", "label": 1}
{"text": "Because there is no law at the federal level. If there is a law at the federal level is supersedes the state laws.", "label": 1}
{"text": "Trudeau has no chance and must be replaced. Biden would have done worse than Harris, the issue was choosing Harris instead of someone else.", "label": 1}
{"text": "crisis and discontent they caused? the US is experiencing nearly the same reason and why they voted Trump aka housing, inflation etc....all these problems are from neoliberalism but the populace still prefer fascist politics and policies to not take the blame on their voting history of picking only right fiscal leaning parties because they prefer to indulge in spite politics and blame those with weaker political might aka minorities...unless people realize that free markets are a myth and everything is a political economy nothing changes", "label": 1}
{"text": "Or could it be hie is best buds with Putin.", "label": 1}
{"text": "See what happens if they try that with a NATO country", "label": 1}
{"text": "The right has convinced many men that being liberal is somehow girly. You have rightwing podcasters like Joe Rogan enforcing the \"opposite\". UFC, Dana White, all that. They really are attracting a lot of impressionable young men to what they are selling. It's worked well for them.", "label": 1}
{"text": "Did you notice how you took my statement that Trump will probably cause swing voters to be more cautious and changed it to \"forgiving\" the Liberals for the crisis they (apparently) caused? \n\nI just don't think Canadians are ready to take a chainsaw to the country like they're doing in the states.", "label": 1}
{"text": "Roe only fell shortly before the Dems lost the house, yes?\n\nHow do you get national abortion protection through the 3 levels of government?", "label": 1}
{"text": "Majority of the campaign promise doesn’t translate to legislation especially with such a gridlock legislative branch the US has. Republicans still need 60 votes in the Senate to shutdown any filibuster attempt. Expect changes to tax/fiscal laws, foreign policy and defence. Stuff that will actually impact Canada but I wouldn’t call it a crisis.", "label": 1}
{"text": "You think Trump backs NATO?\n\nNATO without the USA is not a deterrence. If I were in eastern Europe right now I would be very nervous.", "label": 1}
{"text": "How long did the democrats control the house and senate before Roe was reversed? How many opportunities did they have to write it into law? Think about it.", "label": 1}
{"text": "Whether Project 2025 is real or not doesn’t change anything in the comment that you’re replying to.", "label": 1}
{"text": "Finding an extra 30b for defense in the next two years in Canada will be quite the challenge, never mind the tariffs and renegotiating NAFTA in 2026. \n\nYeah, peachy.", "label": 1}
{"text": "Canadian conservatives are taking note from American conservatives. \n\nLets not pretend like abortion rights are enshrined in the Canadian law or constitution.", "label": 1}
{"text": "So you got nothing.  Ok.", "label": 1}
{"text": "stacking courts with partisans helping him get away with his crimes", "label": 1}
{"text": "Yeah, that's the problem. A bunch of institutions like NATO, NAFTA, supporting Ukraine are about to be severely tested and that does effect Canada. Thanks for catching up.", "label": 1}
{"text": "it wasn't an issue with Roe on the books. Once Roe wasn't on the books it was too late.", "label": 1}
{"text": "🥱\n\nSame talking points as always brought out by lefties when we have an election coming up. The only people talking about abortion rights in Canada are you. \n\nMeanwhile, as always, the Conservative platform explicitly states that they won’t be re-opening any debate on abortion.", "label": 1}
{"text": "Even if Harris did exponentially better than Biden at the wheel, the democrats still lost badly. Even if a star candidate was chosen instead, with no dirt on them, a straight white Christian male, and charismatic af, I don’t think the Democrats would have performed any better.", "label": 1}
{"text": "Trans issues wasn't a big issue up here until the GOP made it one the past few years. Now Alberta is importing some of those same laws. \n\nParental rights was born in the USA, its making its way up here as well. \n\nLets not pretend the GOP and CPC don't occupy the same ecosystem.", "label": 1}
{"text": "I suggest you log off Reddit and go touch some grass. According to Reddit Kamala won by a landslide a few months ago", "label": 1}
{"text": "this comment seems like it was written by an ai that got all it's information from left wing youtube chanels\n\ni don't even really disagree much. it's just funny how obvious you repeating talking points is", "label": 1}
{"text": "I am responding to an incredibly common take", "label": 1}
{"text": "To be fair, all of Trump's supporters in the media market themselves as \"classical liberals\" so just self-proclaiming yourself to be one doesn't mean much.\n\nAlso Louis CK of all people should know that actions speak louder than words..", "label": 1}
{"text": "> Let’s not pretend the GOP and CPC don’t occupy the same ecosystem.\n\nI understand how badly you want them to.", "label": 1}
{"text": "This is such a bizarre take by someone who claims to have the profile you do. I get being frustrated that westerners aren't doing more on a personal level to help Ukraine but the notion that Ukraine can crowdsource their funding needs is absurd. Ukraine can't win with just money. They need equipment, they can't buy it on the open market because there isn't enough supply. It requires state level aid and military transfers. You're ignorant and taking your frustration out on people who are clearly strong supporters of Ukraine is unproductive and juvenile.", "label": 1}
{"text": "It wasn’t an issue? Are you kidding me? The Democrats knew that a Republican senate would overturn Roe given the chance and yet they didn’t do anything. What argument are you trying to make? \n\nIf they wanted to, they would have. Hope this helps!", "label": 1}
{"text": "The justices swore up and down that they would keep roe because of judicial precedent. \n\nThey all lied. \n\nHard to say the Dems miscalculated. The justices lied.", "label": 1}
{"text": "Okay, you keep on pretending they don't.", "label": 1}
{"text": "Both sides suck and politicians are corrupt. Can we agree?", "label": 1}
{"text": "That was never in doubt. \n\nBut lets not pretend one side isn't massively worse than the other.", "label": 1}
{"text": "> I’ve long thought that while DEI policies make left leaning people happy they don’t gain supporters for it, \n\nTim Walz was a DEI pick to appease white men.", "label": 1}
{"text": "It’s a matter of perspective. Some feel safer, some feel in danger. Some are celebrating, some are grieving.", "label": 1}
{"text": "And the idea that transact activists, would infiltrate and indoctrinate our kids, was dismissed as tin hat, people", "label": 1}
{"text": "> Ukraine is an interesting situation. There are a bunch of former communist party officials who are now wealthy oligarchs, which is basically who the west is supporting.\n\nWait until you hear about who runs Russia", "label": 1}
{"text": "When did Democrats have 60 senate votes to override the GOP senate filibuster on any non-budgetary bill? Abortion was not going to be codified with less than 60 senate votes", "label": 1}
{"text": "In what world do the Republicans have 60 senate votes to override a Democrat filibuster or any non-budgetary bill?", "label": 1}
{"text": "And let's not even get into the historical emissions...", "label": 1}
{"text": "I'm just saying if you have a purity test to join your political movement you're going to lose. \n\nRemember \"gays for trump\"? They were celebrated by the right even though it's pretty clear Republicans  had no intention of furthering gay rights.", "label": 1}
{"text": "\n>They are just different ladle fulls from the same pot.\n\nThis is not a serious opinion", "label": 1}
{"text": "Probably after they feel they can no longer be held legally liable for it. This complicity is a forever-stain on Canada", "label": 1}
{"text": "I mean ...", "label": 1}
{"text": "> I'm just saying if you have a purity test to join your political movement you're going to lose.\n\nRepublican's have purity tests too. Hence the phrase \"RINO\".", "label": 1}
{"text": "Treating men as equipment to bolster your political preferences isn't going to make them want to support you, quite the opposite; as we've just seen.", "label": 1}
{"text": "No, but actually addressing issues making men feel disenfranchised, frustrated and in many cases angry, would.", "label": 1}
{"text": "There is a reason why country borders on the map are drawn with a squiggly line instead of a straight one.", "label": 1}
{"text": "Did the GOP create the trans panic that has recently taken hold in the UK, too?\n\nIt is pan-anglosphere and it arose simultaneously in Canada, the USA, Australia, Britain, etc. but to different degrees, depending on the local degree of reactionary conservatism.\n\nThe US didn't export to us, the 1980s swing to neoconservativism that occurred in Canada and the UK, either.", "label": 1}
{"text": "While not as well read about it in the UK, in the internet age, yeah, probably.", "label": 1}
{"text": "Your solution is to hand Ukraine on a platter to a dictator that is a former KGB agent.", "label": 1}
{"text": "The Internet is not a one-way export from the USA.  From what I can tell, TERFs were more or less born in Britain, and then imported to America.  Like trance music and miniskirts.", "label": 1}
{"text": "Those darn black and Latino working class voters, eh?", "label": 1}
{"text": "I'm sure there is a feedback loop, but things may be born once place, but once into the right wing US ecosystem they are supercharged and exported elsewhere, even the place they originated from. \n\nIts like the UK with the industrial revolution. They came up with it, the Americans perfected it.", "label": 1}
{"text": "It was and continues to be. Making kids aware that trans people exist is not indoctrination.", "label": 1}
{"text": "Danielle Smith had a mutual masturbation session on stage with Tucker Carlson the day before he flew off to fellate Putin.", "label": 1}
{"text": "I don't think the dems had much better options, though. Buttigieg speaks well but I don't think a gay person could get a good turnout. Who else is there?\n\nEspecially so late in the game.", "label": 1}
{"text": "Danielle Smith, Prime Minister and Conservative Party of Canada leader? That Danielle Smith? Or the one who is neither of those things?", "label": 1}
{"text": "Notice how kamala supporters never talk about the actual issues. They would rather have an unskilled pilot that is woke than someone who is skilled and rough around the edges.", "label": 1}
{"text": "> Harris would have sucked, Trump will suck. They are just different ladle fulls from the same pot.\n\nHarris represents the status quo and thus sucks because the status quo sucks. Trump is an authoritarian wannabe who spouts Christian Nationalist rhetoric, thus sucks harder than status quo ever does. So the pots they're drawing from are substantially different.", "label": 1}
{"text": "Trump is old and low energy now. He will literally just take naps and post rage tweets about how SNL made fun of him last weekend for the next 4 years.", "label": 1}
{"text": "> Keep up this rhetoric and in decade the literal party won’t even exist\n\nWhat rhetoric? The truth?", "label": 1}
{"text": "Oh, gosh darn you're right. Here I am forgetting that there's no ideological or organizational overlap between the UCP and CPC whatsoever. It's not like the most recent premier before Smith was a CPC cabinet member or anything silly like that.", "label": 1}
{"text": "The fuck are you yammering on about?", "label": 1}
{"text": "He will not\n\nYou ever met an old proud person? This is a narcissist to boot.\n\nHe will do some really stupid things and he is now far more deranged and powerful than before", "label": 1}
{"text": "\"stop describing fascist behaviour or we're really going to have to crank our fascism up a notch\" is certainly an approach.", "label": 1}
{"text": ">No such thing as a national abortion ban. That's purely made up by you, or someone you heard it from.\n\nI heard it from the Vice President Elect: [JD Vance said in 2022 he ‘would like abortion to be illegal nationally’ ](https://www.cnn.com/2024/07/17/politics/kfile-jd-vance-abortion-comments/index.html)", "label": 1}
{"text": "Yes, the process clearly should have started years ago. tbh I find the primaries to be overly aggressive in the sense that they all attack each other, then democrat voters dislike all of them. So I'm not sure what a better approach could have been. But definitely something more diplomatic with the aim of presenting all the candidates and seeing which ones voters genuinely preferred. Rather than debating against each other about who is better.\n\nI think the idea that Kamala was undemocratically put in as leader is silly.. it's a party that can chose their candidate then the voters decide. But the conservative circle jerk about this point I think did some damage.. but then again they'll always find something to circle jerk about. \n\nAlso the last minute switch came off as desperate, regardless of how democratic it was.", "label": 1}
{"text": "Them acting like moronic pissbabies over him has nothing to do with Trudeau's behaviour. He is compulsively inclusive and they hate that with a passion. His outspoken detractors call him divisive for not hating immigrants as much as they do. That's the type of divisiveness they try to paint him with.", "label": 1}
{"text": "Ukraine's oligarch's were a thing, 10 years ago.\n\nFirtash is currently awaiting to be extradited to the US under bribery charges.\n\nKolomoisky is under arrest, and lost his assets.\n\nPinchuk has basically withdrawn from politics.\n\nAkhmetov basically lost all his wealth and assets due to Russia's invasion, and also the [Anti-Oligarch Law](https://w1.c1.rada.gov.ua/pls/zweb2/webproc4_1?pf3511=72105) has stripped him of any power. (That law was passed in 2021, prior to the second invasion of Ukraine)\n\n  \nSo your opinion is grossly misinformed and further perpetuates false narratives.", "label": 1}
{"text": "If you say so. The polls (which are probably underestimating the CPC) and last nights results disagree with you. The LPC and Dems are not inclusive to white men.", "label": 1}
{"text": "I'm sorry that is the most polite word that can be applied to them, the most appropriate ones will get me banned. Take up a new hobby, you clearly don't care about politics beyond the team sport aspect.\n\nDemocrats are right wing....", "label": 1}
{"text": "We're actually supporting the survival of Ukranians as a people. Putin has vowed to obliterate them as a nation.", "label": 1}
{"text": "I remember Hillary trying to implement a no-fly zone, and that getting shot down. Thankfully. Not exactly what you said, however.\n\nI am judging Trump by his actions in office. Those are factual instances I mentioned. You literally just brought up examples where \"trying\" is enough to be critical of a leader, so why should Trump be free of critism for being guilty of the same thing you imply Obama was?\n\nAnd frankly, fuck off with the warhawk shit. The party of Trump was responsible for 2 out of the last 2 wars America started. They ended under democrats. This rebranding is bullshit, Republicans own those wars and the moment Trump wants to start a war on some whim, they will be all for it again.\n\nCheneys aligning with Democrats doesn't mean what you think it does. They may be bloodthirsty war mongers, but apparently they still believe in democracy. Along with all of the other swathes of Republicans and former Trump cabinet who denounced him and endorsed her.", "label": 1}
{"text": "I have voted for numerous parties over the years. All I'm saying is calling half the population dumb won't get you anywhere.\n\nThey may be right wing to you. But they are left in the USA, which is where they are based.", "label": 1}
{"text": "No. Keep these disgusting Americans out. They can stay in their shithole country and deal with their own problems.", "label": 1}
{"text": "They won't be safe in Canada. Trump's last administration had people like Peter Navarro openly calling for the annexation of Canada. I think more likely we will go the way of Chechnya or Belarus with the installation of a puppet government, but nevertheless, there is an existential threat to Canada and Canadian freedoms.", "label": 1}
{"text": "I’d gladly trade you for one of them, to reduce the number of disgusting people in our country.", "label": 1}
{"text": "They already have, but it's been a digital invasion.", "label": 1}
{"text": "I agree, Ukraine is screwed. The loss of American artillery shell production alone will sink Ukraine. They already have a large deficit vs Russia, they are already losing ground in a war where artillery is key at an increasing pace. Western powers oriented their entire military strategy around air superiority but Ukraine has none, and Russia has always kept artillery as a key part of their war machine. \n\nBasically even the entire Western artillery production capacity can't keep pace with Russia, and once the US pulls out its so over.  Putin might just go for his maximal goals of full regime change, we'll see what Trump ends up doing.", "label": 1}
{"text": "This is why we need a nuclear weapons program stat.\n\nIf there’s anything MAGA understands, it’s might. If there’s anything they fear, is their backwater state being turned into a radioactive parking lot.", "label": 1}
{"text": "So the right can spend a decade calling people on the left groomers, pedos, the enemy within etc. and that’s apparently fine. But any criticism the other way and it’s “this is what’s wrong with the left”. Cool stuff.", "label": 1}
{"text": "Can you tell me what white men need to feel included? Like actually concrete examples? Because I’m a white man and I don’t have inderstand this talking point.", "label": 1}
{"text": "I’d gladly trade myself for one", "label": 1}
{"text": "Those are the ones that were protesting that the US wouldn't let them cross the border.\n\nThey aren't wanted there either.", "label": 1}
{"text": "They won't provide examples because it's a nonsense point. The issue here isn't complicated it's cost of living. Rent, housing, groceries, cars, etc have all gone up a lot and our wages haven't. It's not white men not feeling heard, it's all people not being able to afford stuff they saw people affording 10 years ago. Covid fucked things and lead to a period of high global inflation which effected everything. In addition we were already experiencing housing inflation and low interest rates from vovid threw that into over drive. If cost of living is fine people wouldn't care about whatever other bullshit people like to pretend is the issue.", "label": 1}
{"text": "Buddy, you can do whatever you want, just know that it's a losing strategy if you want to win elections. Alienating voters doesn't work, who knew right?\n\nMaybe it's time to reflect on why you think the way you do and if it's actually based in reality.", "label": 1}
{"text": "I get that Trump is likely to pull funding for Ukraine, but is he really going to prevent American arms manufacturers from selling to Europe? He could do that, but he gets a lot of support from those arms manufacturers.", "label": 1}
{"text": "How about you you explain to me why being insulting and calling people names is a winning strategy for the right but a losing strategy for the left.", "label": 1}
{"text": "There's a reason why countries use rivers and mountain ranges to establish their borders.", "label": 1}
{"text": "Conservatives exist beyond the ones voted into parliament... I never even mentioned Poilievre or any MP for that matter. Go have a smoke or wank break or something, you sound super pent up and stressed out. \n\nFor that matter, yes the CPC will absolutely use this as a cheap talking point, it fits perfectly with their history of doing exactly that on similar topics. Them not doing so yet isn't really the smoking gun you think it is.", "label": 1}
{"text": "Imagine failing to build a good relationship with the leader of our most important partner and ally. The Trudeau Liberals are woefully incompetent at every single thing.", "label": 1}
{"text": ">Imagine failing to build a good relationship with the leader of our most important partner and ally.\n\nCan you honestly look at the situation and say it's Trudeau's fault for the current situation of antagonistic relations? \n\nIt seems like people are asking us to give in to the abusive parter, otherwise things will be a lot worse.", "label": 1}
{"text": "Wow... so without any proof you decide to double down.  \n  \nThem *not* doing what you're claiming they *are* doing in fact the smoking gun proving you're wrong and spreading misinformation.\n  \nThe CPC, as far as the party goes, have done nothing you've suggested they are doing.  \n  \nConservatives, on the whole, have done nothing you've suggested they are doing.  \n  \nAnd when presented with proof you suggest I go masterbate.  \n  \nReported for all kinds of violations of the rules.", "label": 1}
{"text": "> Finally I can't imagine this goes through without some sort of referendum\n\nwhy not? that just seems like a failure of your imagination instead of some immutable law of politics", "label": 1}
{"text": "And nothing of value was lost.\n\nI think by now we can all see the dangers unregulated social media have created.", "label": 1}
{"text": "Slightly more complex than the leader of the CPC, and he's crushing the polls. \n\nSo clearly it's working for the target audience.", "label": 1}
{"text": "Because Americans are well known for being willing to integrate.", "label": 1}
{"text": "Maybe their dive into fascism is a legitimate reason to deny them power.", "label": 1}
{"text": "If you want electoral reform to survive in the long term then I would disagree with you.", "label": 1}
{"text": "Maybe fighting for stuff requires not believing there's some magic consensus that allows procedure in parliament to be what saves us.\n\nWe get nowhere because people keep thinking about what's possible when surrendering to Conservatives.", "label": 1}
{"text": "How are the Conservatives diving into fascism?", "label": 1}
{"text": "Maybe it is, but the place to deny power is at the voting booth, not by gerrymandering the entire election system.", "label": 1}
{"text": "The ones leaving to avoid trump are likely the right ones.", "label": 1}
{"text": "Not a fan of our charter?   Trudeau senior gave us the notwithstanding clause.   You must think he’s a fascist.", "label": 1}
{"text": "The clause was the compromise to get the charter, but nobody dared use it. Now they normalized it. It was always dangerous for this exact reason. Hitler wishes he had the notwithstanding clause.", "label": 1}
{"text": "Hold Trudeau accountable? You're kidding, right??? Most 5 year olds understand the concept of accountability far far better than Mr. Justin.", "label": 1}
{"text": "It looks like you’re becoming way too desperate in your attempts to whitewash Nazis with all this melodrama. I’m done here.", "label": 1}
{"text": "We can’t allow this platform to exist cause it shows the ugly side of things we support like those three hospitals that were raided and no evidence of terrorists found so like you know can’t have that ban it", "label": 1}
{"text": "You guys are hilarious. On one side, people on the left blame Pierre for not being tougher on immigration. Then you and others say he blames our woes on it. \n\nVery ironic considering your post is about lying. Only convenient to lie when it benefits you?", "label": 1}
{"text": ">And how would forcing reform through under such an environment not be the exact same thing just under a different name?\n\nBe cause its literally not. \n\nOur government imposes so many things on us in the name of responsible government. Curious how NAFTA wasn't poisoned by it being forced on us against popular sentiment and that did so much harm to working people.", "label": 1}
{"text": "Proportional representation is fascism now?", "label": 1}
{"text": "Honestly, I get where you’re coming from. Vibes can really sway elections. In the last local election, it wasn’t about the candidate’s promise but their personality that won. A relatable candidate really captured the community vibe, overshadowing serious policy proposals. Plus, understanding voter sentiment is crucial. Your insights on voter sentiments resonate with our approach at Pulse, where we help brands effectively engage on Reddit, addressing the very issues you highlighted. Tried Salesforce for strategy, but Pulse for Reddit nailed the community engagement aspect I needed.", "label": 1}
{"text": "By definition any rigging of an electoral system to skew results is antidemocratic and some would even say totalitarian with a few less steps and makeup. Doing so before an election in a vague 'ends justify the means' play against a political opponent is typically an indicator of factionalism in a democracy -a bad sign of democratic health if there ever was one. If a vision democracy is to 'elect my group and damn anyone else' then you don't have democracy and aren't democratic.", "label": 1}
{"text": "There is a difference between putting in place Electoral Reform when you're riding high, knowing it will result in you losing seats compare to putting in place Electoral Reform when you're literally about to lose in a historic fashion and the only reason you're doing it is to save your own ass.", "label": 1}
{"text": "It's  a pretty straightforward threat:\n\n> Quebec Premier François Legault says his government is prepared to use the notwithstanding clause to force doctors trained in Quebec universities to begin their careers in the province's public system.", "label": 1}
{"text": "Wow. Never saw so much shallow expansion on a point for such a big straw target its not even funny. Have a good day there bud hiding from anyone who disagrees with you.", "label": 1}
{"text": "If the feds wanted Québec to respect the constitution they probably should have gotten them on board to sign it. They'll use every power they have to ignore it because they simply don't respect a document forced on them by the rest of Canada", "label": 1}
{"text": "Only a fascist would put something like that in our charter.   Of course it would be used. \n\nIf the intention was to never use it, it wouldn’t be  included at all.", "label": 1}
{"text": "I can't think of a scenario in recent memory where my asking a conservative something lead to actual information or even a banal but coherent thought.", "label": 1}
{"text": "You lost me at harris being a 'black women' Get her race right before virtue signaling pal", "label": 1}
{"text": "She very clearly identifies as black and as a woman..........", "label": 1}
