{"text": "That was an absolute laser", "label": 0}
{"text": "Precise throw. Wow.", "label": 0}
{"text": "Miami is the worse team in the ACC", "label": 0}
{"text": "Goodnight. Fran Brown is just Dino with worse staff. \n\nWe won't come within 2 scores", "label": 0}
{"text": "That’s the Holstein we’ve missed. Aggressive dog through a window", "label": 0}
{"text": "This was a swift ass kicking", "label": 0}
{"text": "McCord still has more TDs though, don’t forget that", "label": 0}
{"text": "I have a great triple option quarterback just waiting for the right team.  I’ll send him over mid season, please take him.", "label": 0}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 0}
{"text": "That DB looked like he was stuck in molasses", "label": 0}
{"text": "Bro, he was bad last year throwing to Marvin Harrison Jr. at what point do we stop making excuses for this dude", "label": 0}
{"text": "Dude it’s crazy our defense is not getting any rest… but we are up 24.  Crazy times", "label": 0}
{"text": "That was a dart, right on the money", "label": 0}
{"text": "Welp, see ya'll next week.", "label": 0}
{"text": "that head looked nothing like Larry 😭🤣", "label": 0}
{"text": "Alright I'm comfortable now. I was petrified of this game because that's life as a Pitt fan but this has been really nice.", "label": 0}
{"text": "sincerely,\n\nCensere Lee", "label": 0}
{"text": "May as well have said \"Stop the count!\"", "label": 0}
{"text": "Eli and the defense just trade life force.", "label": 0}
{"text": "That DB buffered in real time", "label": 0}
{"text": "Yeah I'll forget about that differential equations quiz for now", "label": 0}
{"text": "Pitt, Miami, Clemson. What a rollercoaster", "label": 0}
{"text": "neither was I tbh", "label": 0}
{"text": "Basketball season is starting  soon, syracuse", "label": 0}
{"text": "Pitt is puttin’ on a show! Wow.", "label": 0}
{"text": "After the first Pitt drive ended in a three-and-out, the game has gone: pick six, pick, field goal, pick six, turnover on downs, TD.\n\nIs that good?", "label": 0}
{"text": "It’s pretty awful", "label": 0}
{"text": "They lost to us so definitely not", "label": 0}
{"text": "We are the next Bama right?", "label": 0}
{"text": "Pitt vs SMU next week is gonna be a banger", "label": 0}
{"text": "This is not what I was expecting, but I’m here for it", "label": 0}
{"text": "1-6 41-17", "label": 0}
{"text": "Then he had a nice pass and shut me up a bit. I didn't say he was ass, just looked so great early on. Hope he keeps it up", "label": 0}
{"text": "I feel like if you gave a 96 year old a PS5 controller and Syracuse vs whoever's really good at Madden and pitt, that's what we're watching.", "label": 0}
{"text": "Yeah Notre Dame is 12 that’s how dumb the rankings are", "label": 0}
{"text": "It's 24-0 in the 2nd quarter...", "label": 0}
{"text": "Can’t forget SMU", "label": 0}
{"text": "This is the kind of start we needed to a game holy hell we're proving the haters wrong so far", "label": 0}
{"text": "It’s that time of year to start focusing on Syracuse basketball I guess :(", "label": 0}
{"text": "Let's give every team a bama transfer and see what happens", "label": 0}
{"text": "As a VMI and VT fan.....\n\nLol.", "label": 0}
{"text": "And Miami lost to that 1-6 team in two days 😂", "label": 0}
{"text": "McCord throwing more picks than I do in CFB25", "label": 0}
{"text": "You’d think we could have used the bye week to work on some of our worst habits from the first half of the season…\n\nWe’re just one blocked kick/pint away from repeating all of our sins in one game.", "label": 0}
{"text": "Classic big game McCord ![gif](emote|free_emotes_pack|grin)", "label": 0}
{"text": "🫡", "label": 0}
{"text": "Pitt Players have scored touchdowns on 50% of their receptions.", "label": 0}
{"text": "This sparks great joy", "label": 0}
{"text": "I apologize Pitt, I was not familiar with your game. Consider me impressed.", "label": 0}
{"text": "There is going to be a handful of angry 10-2 teams that are going to miss the 12 team playoff", "label": 0}
{"text": "# ladies and gentlemen\n\n# it’s Kyle McOver", "label": 0}
{"text": "Then you’ll be 2-6!!!", "label": 0}
{"text": "... Did Apple really make an ad about kids listening at the door while they believe their parents are having sex? \n\nSomehow that is the worst thing I've seen all night and I've been watching our defense.", "label": 0}
{"text": "Did you watch last week's Thursday night game?  It can still change.", "label": 0}
{"text": "Go Navy!", "label": 0}
{"text": "I’m still terrified of the second half collapse to be honest.", "label": 0}
{"text": "Eat shit pitt", "label": 0}
{"text": "Wouldn’t be surprised to hear gameday is going there. I expect it to be OSU vs Penn St but I could see the switch", "label": 0}
{"text": "Lmao that is my question\n\nWhere the hell is dude living", "label": 0}
{"text": "Pitt @ SMU is gonna be LIT", "label": 0}
{"text": "Damn, Syracuse are y’all even playing?", "label": 0}
{"text": "💀", "label": 0}
{"text": "*Me scrolling the sub*\n\n\n\"Oh snap that's a good game\"\n\n\n*Opens ESPN app*\n\n\n\"Oh snap that's not a good game ", "label": 0}
{"text": "🤝", "label": 0}
{"text": "How bad are you guys going to beat UW?", "label": 0}
{"text": "It does not guarantee success\n\n*see 2024 Florida State*", "label": 0}
{"text": "That TD pass is why he was recruited to Alabama and it shows", "label": 0}
{"text": "who is this Larold Fitzgerald guy? ", "label": 0}
{"text": "I’ll hold you to it lol.", "label": 0}
{"text": "This feels like a whole new team", "label": 0}
{"text": "SMU still scares the shit out of me", "label": 0}
{"text": "We need Larry Fitzgerald on the sidelines at every home game", "label": 0}
{"text": "Despite having Larry Fitzgerald on the cover, wide receivers in NCAA Football 05 can’t catch for shit", "label": 0}
{"text": "ranked pitt doesn't look.....fraudulent......?", "label": 0}
{"text": "Larry Fitzgerald can’t be growing grey hairs… I refuse to accept that", "label": 0}
{"text": "A reminder that Larry Fitz was robbed of the 2003 Heisman Trophy. ", "label": 0}
{"text": "Larry is so likable. He seems like a great dude", "label": 0}
{"text": "Fans seem down for a team that might be 5-2 after tonight, not happy with the staff or what", "label": 0}
{"text": "Capitulation Bowl", "label": 0}
{"text": "No", "label": 0}
{"text": "Eat this, hoopy. Your players and coach are simps.", "label": 0}
{"text": "Fuck Steve Pederson and his DynoCat Pittsburgh branding with the Notre Dame colors.\n\nWhat an absolute asshat that guy was", "label": 0}
{"text": "All time pitt football is stacked", "label": 0}
{"text": "I loved seeing Elko walk out with Ol Sarge on his shirt for the Notre Dame game", "label": 0}
{"text": "A buddy just texted me “Pitt is good???”", "label": 0}
{"text": "Every year it seems like Cuse starts out strong then just collapses in conference play", "label": 0}
{"text": "I CAN'T HEAR YOU!", "label": 0}
{"text": "Dude deserved a Super Bowl so bad. Just never had a team around him.", "label": 0}
{"text": "I mean Duke not receiving any votes at 5-0 is a bad look, but is beating Elon, Northwestern (in OT), UConn (by just 5), Middle Tennessee, and UNC (by just 1) really worth being ranked? If they manage to be at SMU this weekend, then we'll talk.", "label": 0}
{"text": "Baseball team maybe?", "label": 0}
{"text": "Fitz should transfer to FSU to be part of a real superpower", "label": 0}
{"text": "Horns down and frig off bucko", "label": 0}
{"text": "I think pitt has a 66% chance of making the playoffs. Am I crazy?", "label": 0}
{"text": "100x better than the maroon on maroon abomination from last week", "label": 0}
{"text": "Helton is done \n\nWas told he is wearing a bracelet that says “never again” about basically blowing the season last year and heeeeeeere we go again. \n\nNo idea who Southern gets after him but it’s pretty obvious that he’s barely .500 at best.", "label": 0}
{"text": "He wasn't enough of a diva to get talked about and kept in the zeitgeist ", "label": 0}
{"text": "this is not ideal", "label": 0}
{"text": "Jon Heder as Napoleon Dynamite. ", "label": 0}
{"text": "is this syracuse beating themselves or pitt is good", "label": 0}
{"text": "GUYS STOP DOWNVOTING LIVERPOOL. ITS A RIVALRY, PITT AND WVU. STOP.", "label": 0}
{"text": "Bud - I’m not getting into a special needs slap fight about the quality of our two inconsequential football programs lol\n\nRest assured though - GSU football will forever be closer to the quality of UTC than it ever will be to being a relevant FBS program.", "label": 0}
{"text": "I mean more that Frankl8n didn't really have a plan with his recruiting. He won with Bobby's recruits and then the majority of his guys didn't pan out into anything", "label": 0}
{"text": "Wide open in the middle again.", "label": 0}
{"text": "I effing love you for this", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Yeah I expect them to go to happy valley but smu would be neat to get it for their first time", "label": 0}
{"text": "Yes, but I’m here for it", "label": 0}
{"text": "Right now both", "label": 0}
{"text": "It has been years since I’ve seen ODU look this good. Joseph is the man", "label": 0}
{"text": "I’m extraordinarily happy we don’t play Pitt this year", "label": 0}
{"text": "Wow. I don’t agree with a gator often, but that has to be the worst targeting call ever.", "label": 0}
{"text": "Bro fr. Always the brightest star on his teams", "label": 0}
{"text": "Why is Pitt ranked so low? I don't want to be a victim to one game but they are still undefeated have beaten good teams and behind teams like two loss Bama, two loss Ole Miss, and Boise State who has beaten no one and has a loss(a good one but still). An Undefeated ACC team really can't be ranked below two 2 loss SEC teams.", "label": 0}
{"text": "Damn he flew back there", "label": 0}
{"text": "yet.", "label": 0}
{"text": "Pitt's defense has looked great. The Pitt offense and the Cuse defense/offense have looked mid at best so far.", "label": 0}
{"text": "It would be funny if we started doing throwback jerseys with Dinocat era", "label": 0}
{"text": "You right!", "label": 0}
{"text": "I don't deny that", "label": 0}
{"text": "This one is gonna last longer than 4 hours", "label": 0}
{"text": "Blowout Thursday is underway", "label": 0}
{"text": "I'm just trying to be positive lol, this doesn't happen very often", "label": 0}
{"text": "Hey, you take that Dinocat slander back! The other stuff is fair though", "label": 0}
{"text": "Oh man I thought he was gonna do a gun celebration and get a penalty. Stick with the shark cele guys that rocks.", "label": 0}
{"text": "Partly because we were 3-9 last year and partly because we had to have some silly comebacks", "label": 0}
{"text": "Jason White didn’t deserve the Heisman.", "label": 0}
{"text": "Fitz deserved the Heisman over Jason White (signed, a Cards fan)", "label": 0}
{"text": "**guys hot take: I don’t think McCord understands blitz defense**", "label": 0}
{"text": "Poll inertia and the SEC circle jerk.", "label": 0}
{"text": "I think beating a one loss Syracuse should bump them up. They definitely deserve to be higher", "label": 0}
{"text": "Woah, i wasn't expecting THIS scoreline....", "label": 0}
{"text": "Absolutely not", "label": 0}
{"text": "Let's go Pitt!!!!!!!!!!", "label": 0}
{"text": "Guys we might be for real", "label": 0}
{"text": "I love this post!!! Don’t even get me started on Pitt Stadium. ", "label": 0}
{"text": "The back half of their schedule is tough, probably a bit high on that percentage", "label": 0}
{"text": "27-6 and 34-24 is still insane lmao", "label": 0}
{"text": "ESPN win probably for ODU is 97%. Are we sure this is actually ODU playing? It’s supposed to be within 7 points all game.", "label": 0}
{"text": "It''s because he doesn't have hardware, which is stupid. Teams win championships, not single players. Single players carry bad teams to being good. Plus, the sheer amount of QBs he had to deal with.\n\nOne of the GOATs in both CFB and the NFL.", "label": 0}
{"text": "You haven't watched a Cuse game then", "label": 0}
{"text": "I do feel the block ATM needs to be the standard. But I do like an occasional alternate such as this. As long as we don't become like Mississippi State where we change our primary logo every 8-10 years.", "label": 0}
{"text": "I appreciate his service", "label": 0}
{"text": "Come on Gator bro, you know the rules about their sweethearts of the SEC", "label": 0}
{"text": "ODU 30 GASO 7   PITT 24  Syracuse 0", "label": 0}
{"text": "Also win probability has always been ass.", "label": 0}
{"text": "Unbiased but literally I think they fall top 10 all time for all programs lol. Top 15 at the worst. It’s kind of crazy how we just randomly have one off amazing players here n there. Always shocked me haha", "label": 0}
{"text": "Pitt is who FSU wishes they were", "label": 0}
{"text": "Ya…because they were given a chance too…", "label": 0}
{"text": "🎶🎶My dearest, Syracuse… do you have to be a QB away 🎶🎶", "label": 0}
{"text": "Yes. ", "label": 0}
{"text": "He really is the man", "label": 0}
{"text": "so the i’m feeling the cheesiest coach is without a doubt one of the best ads ever made right?", "label": 0}
{"text": "Vigorously knocking on every wood surface in my home after reading this", "label": 0}
{"text": "Which good teams? WVU, Cincy, UNC, Cal?\n\nAll of those were one score games and 2 were late comebacks from down more than 10.\n\nDon't care about the ranking right now. Just won the next game and it'll work out.", "label": 0}
{"text": "We went 3-9 last season.\n\nAnd chaos has been on our side this year.", "label": 0}
{"text": "I am honestly not surprised. Cuse in a big game always does this.", "label": 0}
{"text": "Weekday sicko quota", "label": 0}
{"text": "SOMEBODY GET JA!", "label": 0}
{"text": "Facts.\n\nFuck me, I watch Auburn and aspire to only suck that bad", "label": 0}
{"text": "That's like telling miami students to not spend their allowance on cocaine.", "label": 0}
{"text": "Because Pitt is in the ACC and has only beat P4 teams from the ACC and Big 12. The rankers aren't going to respect that when you have SEC teams with quality losses.", "label": 0}
{"text": "( i admittedly do not get jokes via text)", "label": 0}
{"text": "It's the Rock, playing The Rock as a superhero who acts just like The Rock.", "label": 0}
{"text": "These exact uniforms in yalls normal colors would be phenomenal!", "label": 0}
{"text": "Completely forgot Clay Helton is at Georgia Southern now", "label": 0}
{"text": "Is that an army of beavers?", "label": 0}
{"text": "Netflix movie strategy: starring the Rock, incredibly cheap looking CGI in every shot, $300 million budget", "label": 0}
{"text": "Pitt is good at playing football", "label": 0}
{"text": "Should we sue the acc now?", "label": 0}
{"text": "We haven't been actually ranked when it matters since like Trask for a year and before that Grier before he got suspended.", "label": 0}
{"text": "god red one has such a stacked cast why did they all go for a rock movie", "label": 0}
{"text": "I did laugh that yalls recent alternate was introducing an orange facemask.", "label": 0}
{"text": "... In tonight's example of being a degenerate who doesn't understand football,; I bet on Syracuse SU", "label": 0}
{"text": "Fran Brown is just Dino with more talk", "label": 0}
{"text": "Probably a C. Had we not dropped that UCLA game, I would feel a lot better. At least there are several winningable games left on the schedule that we could still make a bowl game.", "label": 0}
{"text": "A group of beavers is called a colony.", "label": 0}
{"text": "# meanwhile Georgia southern is fucking dead", "label": 0}
{"text": "Also, there needs to be a QB change after half", "label": 0}
{"text": "Narduzzi is not satisfied", "label": 0}
{"text": "Would’ve been a great time for the curse of #2", "label": 0}
{"text": "This is almost like watching TCU Georgia. It’s a train wreck and yet… vaguely appealing", "label": 0}
{"text": "Someone posted a Dino cat throwback concept on twitter last year using the current colors that actually looked pretty cool.", "label": 0}
{"text": "Some of it is inertia from preseason expectations, but also we had a pretty weak schedule so far and the WVU Cincy and Cal were all very close/flukey.", "label": 0}
{"text": "The team isn’t playing up to their potential. They haven’t put together a complete game where the offense, defense and special teams all played at least at a B- level at the same time. They’ve eked by in most of their wins with one unit (usually the offense) covering up the mistakes of the others.\n\nI just want to see a consistent floor from the team, and it seems like the floor for each unit is…pretty low. So if they keep playing down to their low floor this team may not go bowling.", "label": 0}
{"text": "If it gets to 31-0 prolly, but if you guys get it to 7-24 by half Idk shit is crazy it could happen", "label": 0}
{"text": "It’s because option teams eat up a ton of clock and frequently play four downs. It limits possessions for both them and the opponent, which keeps the margin of victory low", "label": 0}
{"text": "I've seen a lot of great Pitt Panthers, but no one outside of Aaron Donald in his senior year has been close to as dominant as Larry's Sophmore year. He was robbed. No disrespect to Jason White- I'm sure his car dealership or whatever he does is very successful.", "label": 0}
{"text": "The Cfb gods better give us Clemson vs Pitt game day", "label": 0}
{"text": "I don't like that we're in hurry up, up 24", "label": 0}
{"text": "You had me at \"the\".", "label": 0}
{"text": "This definitely wasn’t the result I was expecting.", "label": 0}
{"text": "Nope. No sir. Football. I have seen it with my own eyes and I known it for a fact. \n\nI know what you’re doing Mr CIA man. Not gonna let you mess with me like this", "label": 0}
{"text": "That’s pretty much ballgame. Idk of if I should watch volleyball or NBA next lol.", "label": 0}
{"text": "We need to slow the tempo down and let our defense breathe", "label": 0}
{"text": "Pitt saved by the refs here jfc", "label": 0}
{"text": "Yeah we really gotta stop judging teams by a single unranked loss", "label": 0}
{"text": "Woof. What a bad play by the qb", "label": 0}
{"text": "Awe cmon", "label": 0}
{"text": "I was in front of him and a fan talking at the Pitt-Duke game in 2013. The fan calmly asked \"what about the script?\" and Pederson didn't answer. The next thing out of the fan's mouth was \"the silence is deafening.\"", "label": 0}
{"text": "Bailed out there", "label": 0}
{"text": "USC only has one problem and it's cultural. They recruit top tier talent, it shows up in flashes every season, but never consistently enough to gel into the team it should be.\n\nThe kind of high tier talent that goes to USC needs a coach they respect in football and life. Carroll was that dude, he did it in college and he did it in the NFL. That's the type of coach USC wants, problem being they generally leave and are hard to predict.\n\nThe alternative is to get the exact coach they won't hire. Someone boringly unsexy who doesn't care about the donors. Father figure, nose to grindstone, the kind of guy who will bench a WR for not blocking... and can pull it off without the lock room disintegrating.", "label": 0}
{"text": "wow. cuse can’t catch a break with the calls tn", "label": 0}
{"text": "Sheeeeeesh", "label": 0}
{"text": "**ODU has murdered the eagles and I find that extremely funny**", "label": 0}
{"text": "The ACC gods have chosen us! It's happened!", "label": 0}
{"text": "Holstein has looked not good which makes it so funny for us to be up 24. Also that wasn’t a penalty", "label": 0}
{"text": "Horse shit call", "label": 0}
{"text": "Let them play.", "label": 0}
{"text": "that was a really lame roughing the passer call", "label": 0}
{"text": "That's roughing???", "label": 0}
{"text": "Holsteins play recently is a bit concerning.", "label": 0}
{"text": "We are now chosen by the ACC GODS!\n\nI mean refs whatever", "label": 0}
{"text": "goddamn syracuse can’t have nothin this game 😩", "label": 0}
{"text": "I was wondering when Eli was going to do that. He got super bailed out but what is he doing.", "label": 0}
{"text": "That's crazy work by the refs", "label": 0}
{"text": "They literally don't need help, whatcha doin zebras", "label": 0}
{"text": "That ain’t it", "label": 0}
{"text": "Hate that call", "label": 0}
{"text": "Refs changed their parlays", "label": 0}
{"text": "Closer to NC", "label": 0}
{"text": "What in the french fried fuck is going on in this game", "label": 0}
{"text": "This is what? The third bail-out call the refs made for a Pitt that's already up multiple scores? Come on now", "label": 0}
{"text": "Good matchup on TNF tonight", "label": 0}
{"text": "Straight to Shreveport with them", "label": 0}
{"text": "Southern what are you doing bb", "label": 0}
{"text": "Ehhh weak sauce.", "label": 0}
{"text": "Body weight is such a stupid fucking rule", "label": 0}
{"text": "That was a Mahomes level bad call", "label": 0}
{"text": "God forbid a consenting adult gets tackled in a contact sport", "label": 0}
{"text": "They need to shut down their program", "label": 0}
{"text": "NFL ass call right there", "label": 0}
{"text": "ACC refs strike again", "label": 0}
{"text": "Soft ass penalty", "label": 0}
{"text": "Fuck these announcers", "label": 0}
{"text": "Bad call, worked out for us, but bad call", "label": 0}
{"text": "Heinous call", "label": 0}
{"text": "Texas would be throwing shit", "label": 0}
{"text": "That’s a clean tackle", "label": 0}
{"text": "I hate rtp. Bad call", "label": 0}
{"text": "Right by the rules\n\nwrong by the spirit", "label": 0}
{"text": "It’s rough for Syracuse trying to catch a break", "label": 0}
{"text": "That’s a weak ass roughing", "label": 0}
{"text": "Fuck me. \n\nThese assholes are really trying to ruin the game of football. \n\nFor fucks sake. \n\nPlAyEr SaFeTyyYyy!!!!", "label": 0}
{"text": "Bad call, but him getting up standing on Eli’s leg is dirty", "label": 0}
{"text": "I’m nervous that we’re using up all our good karma for the rest of the season… don’t need all of it tonight!", "label": 0}
{"text": "ACC refs doing their dumb ass things already.", "label": 0}
{"text": "Well that’s a terrible call", "label": 0}
{"text": "There’s no body weight rule in college", "label": 0}
{"text": "i want pitt to win but these calls on the qb are getting ridiculous", "label": 0}
{"text": "Yeah, that was a bad call", "label": 0}
{"text": "we ready to admit that acc refs as a whole are, and have for several years been flaming hot garbage?", "label": 0}
{"text": "ACC television! Welcome!", "label": 0}
{"text": "I have no words but four letter words. Embarrassing.", "label": 0}
{"text": "Yeah that’s a bad call", "label": 0}
{"text": "What a load of horse shit. You’ve gotta be fucking kidding me. I wasn’t gonna hop on but JFC", "label": 0}
{"text": "ACC refs must get involved", "label": 0}
{"text": "Yeahhh we got bailed out on that one. Looked like a standard tackle", "label": 0}
{"text": "They peaked by beating vandy.... somehow.", "label": 0}
{"text": "That rule is so bad.", "label": 0}
{"text": "I'm sorry orange bro, that was weak, but now we will eat the oats.", "label": 0}
{"text": "There's a difference between body weight & pile drive, yet refs at all levels haven't figured it out", "label": 0}
{"text": "This what the FSU vs Miami game gonna look like on Saturday where FSU is Pitt and Trash Miami is Syracuse.", "label": 0}
{"text": "Refs have been just getting worse every year", "label": 0}
{"text": "I can't believe we've reached the point where we'd get favored status. WE'RE BACK", "label": 0}
{"text": "let sauls kick from there", "label": 0}
{"text": "Can’t tackle anymore. Time to play flag football.", "label": 0}
{"text": "That's the portion funding the majority of the athletics department and school.", "label": 0}
{"text": "Why are we converging all our recievers in one spot?", "label": 0}
{"text": "Oh helllll not, let me fix that.", "label": 0}
{"text": "Same", "label": 0}
{"text": "At least Syracuse got the turnover on downs, but that call was horrendous.", "label": 0}
{"text": "Just here to say that was a horseshit call", "label": 0}
{"text": "Even the commentators have had enough", "label": 0}
{"text": "I really don't like that rtp overturns interceptions. Just feels wrong to me.", "label": 0}
{"text": "I need a Tobacco Road bro to weigh in: is this what it's like to have the ACC Zebras on your side?", "label": 0}
{"text": "That’s frustrating. Syracuse is already killing themselves, no need for refball to help.", "label": 0}
{"text": "This is the most flabbergasted I think I've ever heard announcers lol.", "label": 0}
{"text": "It’s gonna be our best offensive performance of the year. Miami is fraudulent. We will still lose by 20 though.", "label": 0}
{"text": "Nah it’s way cooler that he plays both sides", "label": 0}
{"text": "Too late, it’s already sold out", "label": 0}
{"text": "Holstein with a signature shittt early performance", "label": 0}
{"text": "😂", "label": 0}
{"text": "If Eli keeps missing the big plays that are clearly there were gonna have problems down the stretch", "label": 0}
{"text": "Matt deserves respect for actually talking n some shit about the bad call. \n\nToo many of these commentators just simp for penalties and are ref bootlickers. \n\nIf that tackle is a penalty, then we seriously might as well be playing two hand touch or flag football.", "label": 0}
{"text": "Man and I thought the PAC 12 refs were garbage", "label": 0}
{"text": "Holstein seems a little spooked from Cal and during this game. Hope he can figure it out.", "label": 0}
{"text": "Absolutely. Dude is the GOAT", "label": 0}
{"text": "Retweet", "label": 0}
{"text": "I just pulled up Seat Geek and there’s a ton of tickets on sale", "label": 0}
{"text": "Don’t talk about my refs like that!", "label": 0}
{"text": "I took Georgia southern +2 and feel like an idiot right now. This might be the worst football team I’ve ever seen.", "label": 0}
{"text": "It’s great here. I’d say 90% of people who come here can’t believe how much they like it.", "label": 0}
{"text": "Hoping they choose us against SMU next week for being “legacy” compared to them lmao", "label": 0}
{"text": "Good by another 5 yards still", "label": 0}
{"text": "I hate Pittsburgh, I love western PA", "label": 0}
{"text": "We all have and they owe us as well and mostly everyone in this conference.", "label": 0}
{"text": "RTP is honestly a bad rule, I swear half the calls are when a guy hits the QB when he has about one step worth of distance to stop on a dime after the QB releases the ball. It honestly should be more concrete, like the defender takes 2 steps after the ball is released then hits the QB.", "label": 0}
{"text": "Like we haven’t?  We have also had to play road games in the Carolinas with ACC refs", "label": 0}
{"text": "I usually handle it by not getting burned by chemicals.", "label": 0}
{"text": "Hey wait we still get to play Pitt", "label": 0}
{"text": "Tbh if the offense literally didn't take the field and pitt either punted or kicked a fg when they had the ball, it would still be 17-0. But yeah Syracuses defense is getting fucked by the bad calls", "label": 0}
{"text": "I assume people have already made the Honda McCord jokes?", "label": 0}
{"text": "i went to pitt once as a kid, went to primantis, it was fire. i think i was too young to appreciate it as a city tho", "label": 0}
{"text": "could you elaborate?", "label": 0}
{"text": "Gamecock fans everywhere felt a chill down their spine during that call", "label": 0}
{"text": "Don’t live there anymore, and I miss it. Lived in a lot of other places and haven’t liked them as much", "label": 0}
{"text": "Have been to 70 countries as of last week. Pittsburgh is still one of my favorite places.", "label": 0}
{"text": "He’s not playing with fire and poise like we saw pre-cal. I wonder what happened. I hope he can lock it back in. Was hoping that TD he threw was gonna do it but he seems to still be spooked.", "label": 0}
{"text": "He needs to get over it. Bad call? Yeah. We don’t need to hear about it 4 plays later and going into commercial break.", "label": 0}
{"text": "I’d trust ACC HQ as far as I could throw them", "label": 0}
{"text": "Rank Pitt you cowards", "label": 0}
{"text": "Does anyone happen to know that ref's name? (main one)", "label": 0}
{"text": "ooof...sorry Syracuse", "label": 0}
{"text": "If you don’t like that you don’t like ACC refereeing!\n\n(I don’t like ACC refereeing)", "label": 0}
{"text": "Nope I found a spell on some sketchy website I’m finna cast in my dorm room tonight so that it’s not possible.", "label": 0}
{"text": "Loved living in Pittsburgh. Only reason im not there is because of family. Night life was awesome.", "label": 0}
{"text": "shhh", "label": 0}
{"text": "Agreed totally", "label": 0}
{"text": "Hey we’ve got Paul Skenes! It’s just the management that ought to be skinned alive with a rusty cheese grater.", "label": 0}
{"text": "Where do you think they got transferred to? /s… unless?", "label": 0}
{"text": "Wait…\n\nPitt is unranked?!?!?", "label": 0}
{"text": "Syracuse looks ready to just take the forfeit and move onto the next one. At least they’d stay healthy that way.", "label": 0}
{"text": "according to who?", "label": 0}
{"text": "The biggest down fall of this Syracuse offense is that they do not know how to play it safe", "label": 0}
{"text": "It's not like you are biased or anything", "label": 0}
{"text": "These announcers are fucking awful", "label": 0}
{"text": "yeah my buddys brother works on the offensive staff and ive liked what ive seen the last fee games. Did not see this coming lol", "label": 0}
{"text": "🤝", "label": 0}
{"text": "The last unbeaten who was unranked lost (Liberty). Pitt is ranked 19th", "label": 0}
{"text": "Very concerned this game isn't over.", "label": 0}
{"text": "syracuse has the chance to do the funniest thing ever with where they're at right now", "label": 0}
{"text": "Slowest moving clock ever lol", "label": 0}
{"text": "This.  If he is roughing the passer it is after the throw.", "label": 0}
{"text": "They are?", "label": 0}
{"text": "I know.\n\nThey should still rank you though", "label": 0}
{"text": "Pitt does love to Pitt it to be fair", "label": 0}
{"text": "This commentary team is atrocious", "label": 0}
{"text": "Not high enough", "label": 0}
{"text": "That’s Georgia State. Georgia Southern is the one who run over by Ashton Jeanty", "label": 0}
{"text": "Do you like football? Do you like drinking? Do you like food? It's an awesome city for all three. Plus it's super walkable, if that matters to you. I miss living there.", "label": 0}
{"text": "Thank you kind sir.", "label": 0}
{"text": "McCord won’t say it but our offensive line has done him no favors.", "label": 0}
{"text": "At least they acknowledge these terrible refs", "label": 0}
{"text": "it's perplexing because before the cal game the d looked horrendous", "label": 0}
{"text": "Grounding!", "label": 0}
{"text": "Johnny Slowmo. He could go to sleep at anytime.", "label": 0}
{"text": "It's very nice! I've lived here since graduating. How much you'll like it depends on what you're looking for.", "label": 0}
{"text": "I'm praying y'all win and please keep us updated", "label": 0}
{"text": "Yeah probably", "label": 0}
{"text": "> maybe still\n\nI don't think there's a \"maybe\", the commercials and website still explicitly say it's Christian.", "label": 0}
{"text": "Cal is good and Miami is gonna mop the floor with us, but that I expected regardless", "label": 0}
{"text": "Could have a good travel partner if the MWC can also snag ITT Tech or DeVry", "label": 0}
{"text": "Cal Baptist is a better fit for wcc so they should be a good backfill. That could lead to the death of the WAC", "label": 0}
{"text": "have you seen other aggy posters? this seems totally realistic to me", "label": 0}
{"text": "Pot and kettle, my friend 🤣", "label": 0}
{"text": "Little brother might if they ever manage to score a point in the playoffs", "label": 0}
{"text": "We'll see you guys in Pullman soon enough", "label": 0}
{"text": "Not a good roster besides 2 guys?  So 2 guys curb stomped your team?  Sounds more like your roster is not good.", "label": 0}
{"text": "I'm here for FSU to beat Miami and lose to Charleston Southern just for the memes.\n\nFSU has a chance to do the thing from the peak offseason question: \"Would you be happy with a 2-3 win season if your only wins were against your rivals?\"", "label": 0}
{"text": "There will be a few random ones, like most of SCAR's games, but overall 3 fits more schools than it doesn't.", "label": 0}
{"text": "I agree, if you somehow were to magically uproot the entire campus to move it and give it every advantage possible it would be a better program.", "label": 0}
{"text": "If Wazzu had won vs Boise they’d be ranked 15-20 right now. 5 more wins on top of that combined with other teams losing and they’d likely finish the year ranked from 7-11. They’re 26th right now and that’s with losing to BSU by 3 touchdowns.", "label": 0}
{"text": "The perfect place to insert a mountain.", "label": 0}
{"text": "Maybe.  We got momentum against WVU and that can be hard for 18-23 year olds to stop.  Same thing happened when we played BYU - they made some big plays, we made mistakes trying to catch up and took our own curb stompin'.\n\nIf WVU score before the end of the 1st half, I think the game ends within a score.", "label": 0}
{"text": "You guys keep looking at the 1% of stuff and going hey these other 1% people are getting fucked for 3-4 years , they should get their share. \n\nAnd I'm like yeah but what about the other 99% of college athletes that don't play in the P4? \n\nYou guys. \" fuck them\"", "label": 0}
{"text": "If it weren't for Harvard, \"college football\" might still be the soccer played by Rutgers, Princeton, and everyone else not named McGill or Tufts.", "label": 0}
{"text": "Do you know the last time we won 1 or fewer games? Because I do. I’m almost certainly you weren’t born yet, and I know I wasn’t. \n\nNot all “bad” is created equal.", "label": 0}
{"text": "IDK WTF the WAC much less the MWC would want to associated with Grand Canyon.  It is a scummy institution that takes advantage of kids.  This HAS to be a rumor started by Grand Canyon.", "label": 0}
{"text": "Calls on $LOPE", "label": 0}
{"text": "The best thing about being 2-5 is that it means basketball tipoff is in 10 days \n\nSome things never change", "label": 0}
{"text": "So if Napier replaces Mack next season, that would be considered a promotion?", "label": 0}
{"text": "ron_burgundy_i_dont_believe_you.gif", "label": 0}
{"text": "best to delete the entire cloud project , or smash the hardware with a sledge hammer", "label": 0}
{"text": "Someone will hang a CFP First Round Finalist banner eventually. ", "label": 0}
{"text": "They have three 10 win seasons since 2019. This is the first bad year they've had in quite a while", "label": 0}
{"text": "Every FBS team is essentially the 1%.\n\nJason Candle at freaking Toledo makes over a million a year.\n\nIn terms of percentage of revenue generated college head coaches make like 2-6x what NFL coaches do. For the Bears HC to make the percentage Kirby does he’d need to be paid like $28 million a year.\n\nCollege football expenditures are out of control on the FBS level. FCS isn’t much better.", "label": 0}
{"text": "segfaults", "label": 0}
{"text": "We've always been fucked.  We are used to it.", "label": 0}
{"text": "If Western hung a banner for a playoff win, I'd be there for the hanging of said banner, taking photos of the banner, ranting and defending the banner hanging party. \n\nHang the Banner, Catamounts!", "label": 0}
{"text": "No it’s not? There is no other job where ppl integral of the system and product get 0$.", "label": 0}
{"text": "I'm sorry yall gotta associate with commoners like us", "label": 0}
{"text": "For me, the tough part is that Saban kept things professional, and now we're seeing that erode in real time.  Saban's teams didn't fake injuries; players generally kept their composure at critical points in the game (or else!); etc.  I can deal with losing, but I hate to see the downturn in discipline and maturity.", "label": 0}
{"text": "I’m already cringing at the thought of what we will do.", "label": 0}
{"text": "All you can guarantee is making your conference championship game. Winning a Natty has always been subjective, they just added some more games to it. As long as it's a handful of humans ranking the teams to decide who gets the chance to play it's still subjective, just not as much.", "label": 0}
{"text": "And every other program in the country would trade places with Alabama in a heartbeat if it meant having upteen titles in recent years.  \n\n**Saban made titles so commonplace that it has fooled others into thinking they can do it as well.**\n\nWhat the sport experienced with Saban's tenure is a least multi-generational, if not unprecedented.  No one is going to replicate that any time soon.", "label": 0}
{"text": "It amazes me that Mangino was such a horrible person that no schools decided to kick the tires on him.", "label": 0}
{"text": "A massive fan base that hasn’t had a conference championship in a quarter of a century?\n\nYou bet we will.", "label": 0}
{"text": "We demand pics of said puppy in a hot dog costume.", "label": 0}
{"text": "My husband is going to a show with his brother tomorrow night, and after so many days spent together in our small apartment because of hurricanes and work closures, I'm really looking forward to an evening alone. I like the guy, but this month has been *a lot*.", "label": 0}
{"text": "or somehow 'short horning' Texas into t.u.", "label": 0}
{"text": "cfb25 try not to drink and drive challenge", "label": 0}
{"text": "FSU might score less all game than miami does in the 1st quarter lol", "label": 0}
{"text": "> but that also leaves teams like us and Kentucky who’s biggest rival is out of conference with not a lot to protect.\n\nI think for you guys, it's more about giving you guys consistent games in recruiting hotbeds. You'd probably at least one of Georgia or Florda.", "label": 0}
{"text": "Well at least we can both treasure our time with the Pirate", "label": 0}
{"text": "The scam wannabe TEMU version of TCU", "label": 0}
{"text": "Yeah Ole Miss has an SEC West Champions banner when they didnt even got to Atlanta", "label": 0}
{"text": "Plate Tectonic Theory OWNED by facts and logic", "label": 0}
{"text": "Ok, this was good. LOL", "label": 0}
{"text": "In fairness SCar would absolutely be ranked if they were 5-2 with wins over Vandy and Bama", "label": 0}
{"text": "That’s a party right there.", "label": 0}
{"text": "Oh, Texas got shortened to UOS.", "label": 0}
{"text": "We've lost our starting RB plus almost every starter on our secondary.  We will have safeties playing this game that most Bama fans have never heard of.  With all the injuries on both sides, it's hard to predict this one.", "label": 0}
{"text": "What is the contingency with the Pac2? Like what makes them eligible to make it? Obviously not a conference winner", "label": 0}
{"text": "Real question: has that actually happened to you? Someone claiming the game was invented AT KU? I have always stated the inventor of the game was the first coach. Which is still impressive and funny that he's the only coach with a losing record.", "label": 0}
{"text": "This is one of the coolest things I've seen on this sub - thanks for sharing.\n\nCheers!", "label": 0}
{"text": "😻😻", "label": 0}
{"text": "China is so dominant at diving because they have the infrastructure to let children try the sport and identify talent. The USA once was the best in the world at it because we had a ton of public pools with full diving facilities so that children could be exposed to the sport. Now, because of how much it costs in insurance and because of how much towns have to pay out in lawsuits whenever someone gets hurt, we don't have them anymore. There's no way to get kids into the sport.", "label": 0}
{"text": "Hold your breath, too", "label": 0}
{"text": "I guarantee you they are. If Memphis & Tulane fully said no, the PAC probably would’ve just grabbed Texas State and called it a day.\n\nAlso not sure how that’s relevant to this article?", "label": 0}
{"text": ">There's no hard limit on the number of G5 schools that can get it...other G5 schools could still get in via at-large spots\n\nAs much as I think everyone one here wishes this was the case, I think we all know the committee is going to let one non-p4 team in and tell us we're lucky to have that.", "label": 0}
{"text": "neal brown is a pitt ~~sleeper~~ woken agent", "label": 0}
{"text": "UW has sections in the stadium for national championships, conference championships, and playoff appearances, feels like we’d just toss on an extra year for that last one", "label": 0}
{"text": "Never had a twitter account.", "label": 0}
{"text": "There are several things I am not happy about. Deboer wearing a tshirt (I know I am an old square), the coach with the cigar in his mouth before the game, now this.  IDK why we arent allowed to not like all this crap plus losing two games.  Erbody else would be too.", "label": 0}
{"text": "K-State is the Rival. Misery is the Enemy.", "label": 0}
{"text": "LOL", "label": 0}
{"text": "Nebraska tomorrow: “hold my orange”", "label": 0}
{"text": "I'm screenshotting this and texting it to Eli.", "label": 0}
{"text": "God I hope not.", "label": 0}
{"text": "It's refreshing to see other fans talking about this.   Many of us Bama fans brought it up when he actually retired and got downvoted into oblivion.\n\nNIL obsoleted Saban's my-way-or-the-highway approach pretty much overnight, thus our problems in the last couple years of his tenure.", "label": 0}
{"text": "No", "label": 0}
{"text": "Fuck Mizzou", "label": 0}
{"text": "I’ll take that excuse for Fran Brown because he’s at Syracuse, but Michigan should be a big enough sell in itself to coaches to come.", "label": 0}
{"text": "I love my wife. I love spending time with her. I hate it when she goes out of town.\n\nBut that first night where I eat food she hates and play video games all night is awesome.", "label": 0}
{"text": "it tickles me.", "label": 0}
{"text": "Mizzou has to start Drew Pyne at QB. \n\nI’d feel bad for them too.", "label": 0}
{"text": "Many schools have a banner that list tournament appearances.", "label": 0}
{"text": "North Carolina is one of the best jobs in the country.  Just get 8-9 wins a season.  Live in a great part of the country.  Fairly easy recruiting against your similar peers.  I would take UNC over Florida any day.", "label": 0}
{"text": "Purdue football.", "label": 0}
{"text": "Chapel Hill > Gainesville", "label": 0}
{"text": "Ok, no Tebow was a great college player, but I posit that team would have still won at least 10 games.", "label": 0}
{"text": "The way that would've never left my lips.", "label": 0}
{"text": "I love my wife to death but I take full advantage of my time alone too lol \n\nDay 1-3 I'm cool and enjoying myself. After that I'm like WTF she needs to come home right now I miss her.", "label": 0}
{"text": "someone's been hitting the chocolate syrup straight from the bottle.", "label": 0}
{"text": "I'm kinda shocked we haven't hung a banner for our 9-4 season last year, so... Yes, absolutely.", "label": 0}
{"text": ">  Once Florida gets going, they are a total machine.\n\nYou act like this is a foregone conclusion.", "label": 0}
{"text": "Kirby went 8-5 in his first year with losses to Vanderbilt and Georgia Tech. We almost lost to Nichols State that season.\n\nYou cannot judge a coach fairly in his first year. Give him 2-3 years.\n\nAnd if y'all don't want him, we'll gladly take him back.", "label": 0}
{"text": "why the hell was Mizzou in the SEC East?", "label": 0}
{"text": "Correct. Likely, the current \"bottom tier\" SEC swimmers will instead go to develop at mid-major programs or good D2 or D3 programs, which would help raise the competition. But with new transfer rules, the SEC might just end up being a competition of juniors and seniors that were developed elsewhere.", "label": 0}
{"text": "Would I love Washington State making the playoffs? Absolutely.\n\nCould an 11-1 Washington State make the playoffs? The chance is almost exactly zero.", "label": 0}
{"text": "Georgia did the same thing for a while (maybe still do?), and I imagine it’s more about merch sales and agreements than the schools really wanting to celebrate that. \n\nBut I’m with you. Conference titles and national championships only.", "label": 0}
{"text": "Is GCU for profit? I thought they were", "label": 0}
{"text": "PAY THE MAN HIS MONEY! CJK5H!", "label": 0}
{"text": "\"Why doesn't Mangino, the largest of the coaches, simply eat the other KSU ones?\"", "label": 0}
{"text": "The way that gave me whiplash needs to be studied.", "label": 0}
{"text": "In my many years of watching CFB, the annual Army-Navy game has meant nothing to me. It's a fun tradition featuring two teams nobody has any investment in. Considering the matchup's irrelevance, the game receives its own weekend to be played.\n\nHowever, with the 12-team playoff, this game could become a playoff game. If each team goes undefeated (meaning they both beat Notre Dame and Navy beats Tulane), they will clearly be the two highest-ranked non-P4 schools. Having these two teams play in an AAC championship game Dec 6th without having played each other in the regular season, then the very next week play in an unfortunately irrelevant game eliminates what could prove to be the most fascinating and highly watched Army-Navy game in history.\n\nThere are several scenarios in which the Army-Navy game COULD have impacted the playoffs, but because of the timing, it won't.\n\nWe need the AAC to do the right thing if both teams are playing for a playoff spot come Dec 6th: make the Dec 13th game a \"play-in\" game and the AAC CG. No matter what, if one of these teams is in the playoffs, they won't get the same bye week the rest of the teams do anyway. MAKE THIS MEAN SOMETHING", "label": 0}
{"text": "Put the canyon in the bag!", "label": 0}
{"text": "Now thats just ridiculous", "label": 0}
{"text": "I'm already prepared for BYU to be left out of the CCG at 11-1 when ISU and KSU both finish 11-1 due to the big 12s fucky tie breaker rules.", "label": 0}
{"text": "Ah gotcha. So notre dame for example needs to be one of the highest rank 7?", "label": 0}
{"text": "Is anyone able to follow a football play, given the camera angles and zoom we get usually?\n\nThis isn’t a complaint—honestly!\n\nBut say, are any of you able to identify open receivers before the ball is thrown, or is it happening too fast to see/is the camera pointed at the QB only so you can’t see?\n\nIf you’re able to watch—what do you watch during a play?", "label": 0}
{"text": "I’m really skeptical of this first round of the playoffs and how people will feel about it after they watch it play out. Losing teams don’t get a shot at a bowl game. So you could just end the greatest season in your program’s history with a home loss? They need to figure out how to move the season back so these games get played earlier and everyone gets a bowl.", "label": 0}
{"text": "I'm sorry, but the audacity of Tobacco road to accuse anyone of arrogance and bullying. Fuck off with that shit.", "label": 0}
{"text": "I mean if I was an FSU fan I would make a nice plaque for making it regardless of outcome", "label": 0}
{"text": "Oh, guess i got too in the weeds on reading the tax-dodge part that i forgot the last part", "label": 0}
{"text": "Bc the west got A&M in that expansion and relative to them I guess they’re East", "label": 0}
{"text": "Hey, I wasn’t the one over here talking smack to the ‘Bama fan. He was.", "label": 0}
{"text": "The UCLA \"only national championship banners hang in Pauley Pavillion\" Bruins would not.", "label": 0}
{"text": "I think Deboer's hope was to win big early and get that NFL gig.  Using Saban's recruits.", "label": 0}
{"text": "ZOU!!!", "label": 0}
{"text": "That score last year was closer on paper than it was in game. The last TD Miami scored was kind of flukey, it obviously still counts but it was a 1 play, 80 yard drive where our DBs ran into each other. All your other drives in the second combined for 75 yards on 34 plays (2.21 ypp), 3 points (0.43 points per drive) and two turnovers. Felt like FSU was in complete control after their first two drives of the second half. \n\nThat all being said, we’re getting boatraced tomorrow. That isn’t a reverse jinx, our offense is abysmal and while our defense is okay, they wear out every game because the offense is constantly going three and out or, worse, turning the ball over and putting the defense in terrible field position. In the flip side, our defense doesn’t generate turnovers. \n\nWe have elite special teams so our only hope is to have multiple kicks returned for TDs, and I’m guessing we’re going to have lots of opportunities to return kicks.", "label": 0}
{"text": "At 11:00 EDT, no less. \n\nWelcome to Big Ten After Dark. ", "label": 0}
{"text": "It should be up the schools. If you give each one the chance to protect the most important game to them (and they *have* to play if one side wants to) you’ll probably end up with something like this:\n\n- Alabama: Auburn, Tennessee\n\n- Arkansas: Texas\n\n- Auburn: Alabama\n\n- Florida: Georgia\n\n- Georgia: Florida, South Carolina\n\n- Kentucky: Tennessee\n\n- LSU: Ole Miss\n\n- Mississippi State: Ole Miss\n\n- Missouri: Oklahoma\n\n- Oklahoma: Missouri, Texas\n\n- Ole Miss: LSU, Mississippi State\n\n- South Carolina: Georgia\n\n- Tennessee: Alabama, Kentucky, Vanderbilt\n\n- Texas: Arkansas, Oklahoma, Texas A&M\n\n- Texas A&M: Texas\n\n- Vanderbilt: Tennessee\n\nThat system makes sure that all of the major rivalries are covered with the glaring exception of Auburn-Georgia, which can be added. I think that’s the best solution for everyone.", "label": 0}
{"text": "Lol", "label": 0}
{"text": "What happened to shame?", "label": 0}
{"text": "I love it how far they have fallen. So I hope it doesn’t change.", "label": 0}
{"text": "I just wish we'd have mixed a *little* maroon into the uniforms/shirts. Like the black jerseys and gear from the 2012 Miss State game and a few years thereafter.", "label": 0}
{"text": "I’ve heard that sort of thing is popular in Indiana…", "label": 0}
{"text": "Then you got Gaines and Riley to deal with… yeah they good but they aren’t the boogeyman", "label": 0}
{"text": "Their TV commercials state they are explicitly Christian.", "label": 0}
{"text": "Shave the eyebrows, burn the nose hairs", "label": 0}
{"text": "That's not how empires work lol. When you conquer a society it no longer carries the banner of its original society because they don't exist anymore. ", "label": 0}
{"text": "When you say baseball and hockey, you need to include lesser extent women’s volleyball as well. Operate as lower thresholds than other sports and have some universities in the black. It’s also doing well viewership wise", "label": 0}
{"text": "Washington made shirts this year after beating Michigan in the national title rematch, and I was just like, “why?”", "label": 0}
{"text": "The problem imo is the opposite. Wazzu “wants” there to be a very clearly defined group of top 8 or so teams that deserve it and literally no one else so the committee is forced to acknowledge that maybe a 11-1 team does deserve over a next best option 9-3 team. What it’s looking like will actually happen is there being about 12 teams with a record of 10-2 or better and Wazzu ain’t making the cut over them.", "label": 0}
{"text": "And we really shouldn’t have lost that damn game. Stupid stupid special teams 😂", "label": 0}
{"text": "Swimming has a little bit of a buffer because you can pool coaches between the men’s and women’s teams, and most of their facilities are shared either with the on-campus rec center or a city pool, lowering costs. \n\nTrack gets a little bit of a buffer as well again because of the coach pooling, but also because you can squeeze three sports out of it (XC, Indoor, Outdoor). You do need two separate practice facilities, but you can get pretty far without having to host any competitions, so they don’t need a ton of amenities. \n\nWrestling on an island by itself. Big roster with no obvious Title IX offset. Lots of travel compared to a Swim or Track season. Needs a standalone practice facility and since the season overlaps with MBB/WBB/VB/GYM, it may necessitate having a second competition facility as well. Bad combo all around.", "label": 0}
{"text": "Damn, X-Files was the fucking bomb", "label": 0}
{"text": "Why would you possibly let your backup lineman give an interview?", "label": 0}
{"text": "No no, it's the \"fun dorky\" side vs the \"no-fun dorky\" side.", "label": 0}
{"text": "Hell yeah.", "label": 0}
{"text": "Well they, because, well you see if you look at the map, and then with Kansas City being actually a city in two states, and Mark Twain is actually not his real name, it's Samuel Clemens, but then he worked on the Mississippi River and they would say 'mark twain' to check the water line, so yeah", "label": 0}
{"text": "They're literally paying their own way because they don't provide a media bump to the league. When the Payouts for the P2 come out, I really am going to in a perverse way, relish the spin job the ACC sycophants try and present about it.", "label": 0}
{"text": "Excuse me, I though that was why we were all here?", "label": 0}
{"text": "If we're going to talk about Vandy in the playoff, I demand Cincinnati's potential bid be addressed.", "label": 0}
{"text": "Yes, yes. I'm not a fucking mormon and haven't been for almost two decades.", "label": 0}
{"text": "I mean i assume we'll be playing each other for years to come in the PAC-State conference, so...probably?", "label": 0}
{"text": "I feel like you did last year when I came to Lawrence.", "label": 0}
{"text": "Should anyway after FSU", "label": 0}
{"text": "Really wish they were on our schedule this year. We dont play them till 2026 unfortunately", "label": 0}
{"text": "Let's be real, this dude committing to CU to come ostensibly play for Deion next year is pure comedy. 99% chance Deion is not in Boulder next year", "label": 0}
{"text": "How can a huge deep canyon be a mountain?  Is the MW stupid or something ?", "label": 0}
{"text": "They better. We might not get another season like this one.", "label": 0}
{"text": "I cannot confirm or deny", "label": 0}
{"text": "and not just a backdoor cover, garbage time, 1-score loss either. it was literally a walk-off on the road.", "label": 0}
{"text": "Highly doubt Wazzu makes the CFP. They needed to go undefeated to even have a prayer in hell IMO, & the Boise State loss popped that bubble.\n\n\n& tbh...just don't see TX Tech pulling off winning the B12. Credit the Red Raiders, they shook off a rough start to the season (almost getting upset by Abilene Christian + getting beat by Wazzu). But they just got embarrassed at home by Baylor, & while they have some (on-paper) favorable matchups left (TCU, WV, Ok State), they gotta play at Iowa State & still have Colorado. Just don't see them winning out & having that being able to help the Cougs IMO.", "label": 0}
{"text": "Congrats on making it out!", "label": 0}
{"text": "Anybody outside the top 10 is still a fringe playoff team.  Especially when there are two other G5s that are still undefeated and could very easily jump Boise for the playoff bid.", "label": 0}
{"text": "You misspelled Milroe.", "label": 0}
{"text": "The dreaded \"vote of confidence \"", "label": 0}
{"text": "So about 2 more games before he gets canned. Kiss o' death.", "label": 0}
{"text": "Fuck it if we make the CFP plaster it everywhere, put a billboard up in Lafayette and another in South Bend if they miss it too", "label": 0}
{"text": "not if you’re a west virginia fan!", "label": 0}
{"text": "{Memphis} should have this one", "label": 0}
{"text": "> MAKE THIS MEAN SOMETHING\n\nI think if you ask Army or Navy, beating the other *always* means something", "label": 0}
{"text": "I'm sure most would put up playoff appearance, after that prob smaller schools do like sem/quarter finalist ones or whatever", "label": 0}
{"text": "Dumbasses", "label": 0}
{"text": "It'll be something like this I'm sure", "label": 0}
{"text": "Pretty much. Granted OSU fans are spoiled but he was very underwhelming when he was there. I told all the box score watchers that his stats don’t tell his story", "label": 0}
{"text": "The very top prospects will have nowhere to go, or compete against. Programs will shutter, which will shutter leagues/competitions. The top athletes are now going to have to choose between pursuing an education or athletics, because those are going to now be decoupled. ", "label": 0}
{"text": "Penn state probably won’t since we’re running out of room beneath the club seats anyway", "label": 0}
{"text": "Fwiw the IRS criteria is way more clear cut, which makes it easier to pass as a non-profit", "label": 0}
{"text": "Phoenix is about to be U Idaho, so the Kibbie Dome might be back", "label": 0}
{"text": "\"Huh...That'd be a fun sponsor for the Arizon-WAIT THIS IS REAL?!?\"", "label": 0}
{"text": "Snake river rivalry baby!!! Love it!", "label": 0}
{"text": "There are pro Lacrosse leagues here in the US. The Premier Lacrosse League (PLL, outdoor) and the National Lacrosse League (NLL, indoor)", "label": 0}
{"text": "The museum is no longer open to the public. It’s held in (hopefully to be renamed) schembechler hall. They have some trophies and uniforms and stuff, but the coolest thing is a massive floor to ceiling display with a football for every win in program history. They all have the win number on them, but I’m not sure if they’re all game balls.", "label": 0}
{"text": "Spoiled ", "label": 0}
{"text": "At the time they wouldn't have been though, and them losing back to back to unranked teams for the first time in 20 years would've dominated college football discourse", "label": 0}
{"text": "Ok, this is crazy.   So he Dan Quinn'd it, that is how players coaches are.  Yes it is maddening when they do it, but that is how they coach.", "label": 0}
{"text": "It would take a little less than that, but definitely don't control our own destiny.", "label": 0}
{"text": "Nah.", "label": 0}
{"text": "Considering how conservative our team historically allocates or recognizes championships, no", "label": 0}
{"text": "Everything’s for sale for the right price. ", "label": 0}
{"text": "no send it to the top", "label": 0}
{"text": "You mean the continental USA lol", "label": 0}
{"text": "Tbh I dont think that’s what Rutgers has to worry about right now", "label": 0}
{"text": "They're Mormon werewolves?", "label": 0}
{"text": "I did before I posted because I didn’t see what you alleged.  Are there a small minority that is unhappy with anything not traditional? Sure.  But every fan base has these types.  You are completely blowing out of proportion the size of that group to score internet popularity points.  And you know it.", "label": 0}
{"text": "This is on the money. WSU needs more chaos in the middle and for fewer two-loss teams.", "label": 0}
{"text": "i mean techincally rank has nothing to do with it, but yes, notre dame is NOT eligible for one of the 5 auto-bids and thus can only ever be seeded as high as #5.\n\nBut, to be fair, while they're not eligable for the first round bye, they DO get a guaranteed pseudo-bye week by default as a result of not playing a conference championship game. so their 13th game of the season in that scenario where they are the 5 seed is a home game against the 12 seed (often assumed to be the G5 champ). \n\na generally preferably prospect to a CCG, which is often on a neutral site and against stiffer competition.", "label": 0}
{"text": "They're down voting you for saying they should sign more than 10 HS commits in a class if they want sustained success.", "label": 0}
{"text": "Zona did the same last week", "label": 0}
{"text": "This is unrelated, but Wooster has the freshest flair on the whole sub, and it's not close.", "label": 0}
{"text": "Rat poison!", "label": 0}
{"text": "Played like it was the super bowl", "label": 0}
{"text": "Well they would have to be a top 12 wild card since (I don’t think) they could be considered a conference champ, and at this rate I just don’t see them getting ranked above two loss B1G/SEC teams", "label": 0}
{"text": "He gone.", "label": 0}
{"text": "The days my blue and gold mountain homies have been praying for", "label": 0}
{"text": "TBH it just comes down to what version of Milroe shows up on any given day.", "label": 0}
{"text": "> One loss is pushing it though.\n\nThe only reason we are still in the conversation is that it was to Boise State with the Heisman favorite, whose only blemish was a close loss might be undefeated Oregon.", "label": 0}
{"text": "I’m not sure we actually have a space to hang/display anything in Jack Trice because we’ve never needed to :(\n\nI guess under the NEZ scoreboard over the Jacobson building? \n\nI don’t even know that we would…I feel like if we did hang anything it would have to be for a conference championship first.", "label": 0}
{"text": "Never doubted his toughness lol. You seem oddly aggressive", "label": 0}
{"text": "Technically speaking, there is a hard limit of 8.", "label": 0}
{"text": "Are you not ~~entertained~~ having a good time?", "label": 0}
{"text": "I mean FSU made a [plaque](https://x.com/bobferrante/status/1842654679446274544?s=46&t=q56C51aDY3iDGSzNLxPW6w) for going 13-0 though conveniently didn’t add the orange bowl lol", "label": 0}
{"text": "Harvard….it was really important to me in the past….now I just don’t give a fuck", "label": 0}
{"text": "House money baby!", "label": 0}
{"text": "Not just that but the Olympics now allow flexibility in what sports they add. Which means that most likely your going to see more sports that are not part of the ncaa system", "label": 0}
{"text": "The playoffs are going to be a mess this year no matter what.  It is very likely we have two or three 1 or 2 loss ACC teams, three or four 2 loss SEC teams outside of the conference winner auto bid, three or four one to two loss B1G teams, and maybe a few from the Big 12 as well. Then you have ND hanging around potentially with 1 loss.\n\nThe only thing straightforward about this playoff is the G5 auto bid + the conference champ bids. The remaining 7 at large slots will be brutal to choose.", "label": 0}
{"text": "I just went to the teachers lounge and they confirmed it is at least 3 years old", "label": 0}
{"text": "I agree with you, but there is no way BSU gets in ahead of an undefeated service academy. The committee will choose the fairy tale over the actual best team, because the committee won't want to deal with the backlash of snubbing a service academy.\n\nNow admittedly, this relies on either Army and/or Navy beating ND first as well as the rest of their schedule, but if they do, they will be in ahead of BSU as 5th best conference champ, even if the Broncos destroy every remaining opponent this season.", "label": 0}
{"text": "> ESPN’s playoff predictor gives Washington State a 13 percent chance to qualify.\n\nBetter than zero!", "label": 0}
{"text": "North and South Rims!", "label": 0}
{"text": "He's still hiding in the FSU sub. Hasn't been here since they lost to Boston College. Complete baby back bitch imo. Talks shit only when his team is good, the second they're ass he hides", "label": 0}
{"text": "Its an inverted mountain.", "label": 0}
{"text": "Wonder if Rich Rod wants to come back", "label": 0}
{"text": "never lost a tailgate™️", "label": 0}
{"text": "Sounds like he's not just guaranteeing a win but a blowout.", "label": 0}
{"text": "The first round games are not actually bowl games, just the quarters and semifinals. So the teams that play in the semifinals will play in two bowl games. The championship game is called “The CFP Championship Game” or something like that but is not affiliated with an actual bowl.", "label": 0}
{"text": "The teams that trip up Big 10 schools unexpectedly like the desert schools did in the Pac 12 are Purdue and Northwestern. Losing to Iowa is like losing to Utah. Iowa is good.", "label": 0}
{"text": "> Always hate seeing the military teams on the schedule\n\nAnd thats why you cowards backed out of your game against one", "label": 0}
{"text": "Vote of Confidence that he will not be allowed within an M1819's shooting distance of Morgantown after the season.", "label": 0}
{"text": "Michigan wins more consistently than Oklahoma and Michigan has been winning more than Oklahoma for a long time. That’s not debatable, it’s objective. I understand the whole “percentage” thing is an upper level concept at OU though.", "label": 0}
{"text": ">  if Boise State, Army, or Navy keep going.\n\nUndefeated Army or Navy won't get in over a 1-loss Boise State. They don't have the SOS. \n\nPeople were talking about how two-loss SMU should get in over undefeated Liberty last year. Army and Navy have essentially the same SOS (2nd and 3rd to last).", "label": 0}
{"text": "He gone", "label": 0}
{"text": "Buddy we hung a banner for a national championship we didn’t even win", "label": 0}
{"text": "Lmao", "label": 0}
{"text": "Seriously, the game was close until a literal Heisman performance.", "label": 0}
{"text": "If Indiana wins a CFP game, they're gonna erect a statue of Coach Cig in front of the Sample Gates.", "label": 0}
{"text": "I’ve been confident most of the year but with us reaching the end of month 1 we started seeing bye weeks and the teams I’ve been riding most weeks have been either on bye or the underdog all the sudden, or on a backup QB. I also wonder if Vegas gets better over the year as it’s a computer model and most computer models like SP+, any ranking system, Game simulators work better the more info they have to go off of. This is just a strange week and although I’ve seen more people stumped as the season gone on over outlier weird results, this week in particular seems to have us all scratching our heads more than most.", "label": 0}
{"text": "The narrative being pushed around here surrounding yall since the snub last year has given me whiplash. You got screwed and any other major program would be doing the same thing.", "label": 0}
{"text": "I am thinking Alabama keeps a list like they do for bowl games, but that is all. On the Walk of Champions, they have every team that has won a conference (on either side) or national (larger ones down the middle) championships. They also fly a pennant with each year of a national championship under Alabama reckoning.", "label": 0}
{"text": "Well, and the fact that many of us went to school there. We have real lived experiences with all sorts of emotions/memories associated with them.", "label": 0}
{"text": "i felt more pain from that dropped pick six than the special teams personally", "label": 0}
{"text": "I really wish we wouldn't but you're absolutely right. We've given out trophies for much less", "label": 0}
{"text": "Well the season ain’t over!", "label": 0}
{"text": "It's not that odd for those in the know. Willamette was a game I thought they could win because they're a terribad D3 football program.", "label": 0}
{"text": "I didn’t say shit about the size of the group. And you know it.", "label": 0}
{"text": "Lol, going to insults.  ", "label": 0}
{"text": "Bama should feel lucky Drinkwitz isn’t Smart (UGA Coach, not saying Drinkwitz is dumb)", "label": 0}
{"text": "Track gets like 12.5 scholarships. There are more events in a track meet than scholarship athletes on a team. Indoor track is counted as a separate sport from Outdoor track because the women's teams have so many more scholarships than the men's team, the difference is counted twice!", "label": 0}
{"text": "The mountain fills in the canyon", "label": 0}
{"text": "Pole Assassin has references he can use too", "label": 0}
{"text": "I wasn't aware Hell, Michigan had a university, much less a D1 football team!", "label": 0}
{"text": "Phillies fan who did not realize he went to IU. This complicates things.", "label": 0}
{"text": "Because they’re trying to attract a NC based university like ECU to join the South Eastern Conference. If you move it to Raleigh, we’ll consider your offer, SEC.", "label": 0}
{"text": "Had Kansas had the year many expected and come into this game with say, a single loss, I am certain KSU would've waffle stomped us and shown every flaw we have as a team. \n\nI always have a lot of respect for the Wildcats because they're well coached and always show up (minus a few years in the mid aughts).\n\nSo the only reason I have even a glimmer of hope is we shit the bed in a ton of close ones all year long, blowing lead after lead. Thus, the inverse of the scenario in paragraph one could come to fruition. \n\nUltimately I think K-State wins but Daniels is streaky as he'll and has been trending upward so I could see it being surprisingly close like 31-28 or something like that. Or at least close until thr wheels inevitably fall off in the 4th :(", "label": 0}
{"text": "I’m a CU alum, and it takes every fiber in my being to not hate the CU fanbase right now😂 ever since we hired Deion the fanbase has become engulfed in terrible takes and delusional reasoning. I try to just not interact with anything CU related on here anymore because it’s gotten so bad.\n\nI loved CU football prior, we may not have been that great and we didn’t have nearly as much attention. But the fanbase LOVED CU football and it was a fun crowd to be apart of.", "label": 0}
{"text": "Texas College is the 8th team to do it this year.", "label": 0}
{"text": "There are only facts there.\n\nBut great job further avoiding facts.", "label": 0}
{"text": "I like schools that will put the Cheez it bowl win on their stadium", "label": 0}
{"text": "Otherwise, Auburn would be in the east. Auburn in the west keeps the big six evenly split. \n\nIt keeping Auburn from traditional rivals Tennessee and Florida was just a bonus.", "label": 0}
{"text": "wvu pat used to rip into him. i think he’s trying to toe the line for the time being so to speak until he’s gone as to not make matters worse\n\ncontract isn’t horrible (still kind of is) as any of browns remaining buyout will offset with his salary at any future coaching destination", "label": 0}
{"text": "Pat McAfee needs to reconsider his fashion choices in a big way. Right now he looks like he'll effortlessly slide into 'homeless vet hanging around the pier' mode once his deal is up.", "label": 0}
{"text": "In the case of an undefeated service academy and Boise State winning out, I honestly think both get in. Boise State is already 17th in the AP poll and have already played they can play with the top teams in the nation. You are guaranteed to get a few teams ahead of them to lose and drop down behind them, and other than possibly an ACC team jumping from behind, no one behind them really looks likely to jump up. In the scenario where you get an undefeated service academy and a one loss Boise State team with a healthy Jeanty, I truly think both get in.\n\nThat said, the problem Navy/Army are going to have is that because they would both relying on the same win (over Notre Dame), their resume in general won't be as impressive. Either Notre Dame will have lost 3 times by then to 3 G5 teams or they won't have the undefeated Army/Navy AAC championship game. So their SOS are going to struggle.", "label": 0}
{"text": "What?", "label": 0}
{"text": "They had to beat Boise for that to happen. ", "label": 0}
{"text": "Yeah ur feelings towards Miami do not exclusively define what a rivalry is. I hear Miami hate from UF Twitter all the time. That is a rivalry 🤦‍♂️", "label": 0}
{"text": "They're coming back down to earth faster than terminal velocity this season, hang in there bub", "label": 0}
{"text": "refs bailed out georgia state, i think vandy only has vandy to blame for dropping to mizzou\n\nshould've won in regular time with that field goal, should've done a lot of things differently really. coaching errors too.\n\ni think we are actually better than mizzou but we weren't good enough in that game and only have ourselves to blame", "label": 0}
{"text": "And after this weekend, there is a good shot that WSU could end up just about 20. Tons of underdog games for 21-25. \n\n20 v. 1.\n\n21 v. 15.\n\n12 v. 24.\n\n5 v. 25. \n\nThe Cougs are still in shooting distance.", "label": 0}
{"text": "Has the Vegas model been fading you like this all year? You guys should definitely win.", "label": 0}
{"text": "Against Penn State, Ohio State, Miami, and Michigan... \n\n\nHe played 10 P5 opponents that year. The one FCS they played, he got 7 carries.\n\n\nJeanty has played 2 and will end up with 3 (I count the cougs and beavs).", "label": 0}
{"text": "Most people are saying the exact opposite. You’ve only seen West Virginia haven’t you?", "label": 0}
{"text": "Hell, Bama(well, Scott Cochran), smashed a BCS runner up trophy. Pretty sure on the instruction of Saban, to light a fire under the team's asses.", "label": 0}
{"text": "Live mas", "label": 0}
{"text": "Reshuffling the divisions to put both A&M and Mizzou in the West would have meant Alabama no longer playing one of Tennessee or Auburn as an annual opponent.", "label": 0}
{"text": "We better not.", "label": 0}
{"text": "yeah... i'm getting bad juju vibes in my gut. From day old air fried wings or this game coming up.", "label": 0}
{"text": "I'm thinking more of a software dev at Waymo vs YouTube.  YouTube makes a ton of money, while Waymo loses money, for Alphabet.  They don't necessarily pay the YouTube devs a lot more just because that division makes so much more money.", "label": 0}
{"text": "I see Texas Tech for sure losing to Iowa State. The rest are toss-ups.", "label": 0}
{"text": "That game really needs to rework some things. Interceptions are way too easy, and the playoff system has some questionable choices.", "label": 0}
{"text": "At this point I have no reason to believe he doesn’t play better when he’s seriously injured ", "label": 0}
{"text": "Need to get some peeps on here a rage post flow chart where there is a single top bubble that asks, \"Should my comment devolve into completely unfounded hypotheticals about the future?\" with an arrow pointing down to the only other bubble with the word \"No\" in it.", "label": 0}
{"text": "Only in-stadium commemoration is Big 12 titles tucked on one side of the suite level, but we have banners in the indoor facility for every bowl game, so there will undoubtedly be a new banner in there", "label": 0}
{"text": "Yeah people keep asking I'll make a post about it. Basically he shakes so the sweat doesn't cause his pads and uniform to stick to him", "label": 0}
{"text": "Devry got a basketball ball team", "label": 0}
{"text": "You said “TexAgs” and “these curmudgeons” strongly implying that it was all or a large portion of TexAgs.  When in reality, it’s a small percentage.  If you were being intellectually honest, you would have said “a small percentage of TexAgs . . .”", "label": 0}
{"text": "Wisconsin commemorates their Rose Bowl losses, I would be surprised if they didn’t honor something if they won a playoff game", "label": 0}
{"text": "Bad for USC 100%. But not necessarily bad for lower levels. Look at his brother. We hated Tyson at SC as a coordinator, and he’s winning 60+% of his games at WKU. But couldn’t coordinate a P5 offense with massive talent to save his life. The G5 is like a whole different sport", "label": 0}
{"text": "Rutgers dreams of a QB like McCord, so be careful what you wish for.", "label": 0}
{"text": "They are a for profit non-profit", "label": 0}
{"text": "Yes as long as they’re ranked 5-12. We’ll see if the CFP wants to rank them unlike the AP Poll", "label": 0}
{"text": "Why are you talking bro", "label": 0}
{"text": "That performance vs Houston had to come vs Houston huh? I had one leg left of a 2 leg parlay and you guys ruined it with that pattern breaking performance. Houston somehow developed a passing game that night. I won a couple parlays the next day and that one would’ve been a real nice add, but missed by half a point on 2nd leg", "label": 0}
{"text": "Not a good one but they can score fast.", "label": 0}
{"text": "Which turned out to mostly be correct.  So, I dunno if you can use that as an insult any longer.", "label": 0}
{"text": "I think we would. But I'm not sure", "label": 0}
{"text": "Best in the west, they must do their best. \n\nOn on on on on fight till the end, honor and victory they must win! \n\nI’d love to see WSU in the expanded college football playoffs. \n\nThey’ll need some help (I.e Boise state losing)", "label": 0}
{"text": "That's back when making the playoffs meant something. Now, all you have to do is win your conference.", "label": 0}
{"text": "Reportedly both sides are far apart on the details of the offer. One source said the it was a \"chasm\".", "label": 0}
{"text": "Don’t worry we’re playing Milroe with a fucked shoulder and on one leg", "label": 0}
{"text": "DONT SPEAK IT INTO EXISTENCE;(", "label": 0}
{"text": "Just enjoy football season man.", "label": 0}
{"text": "I kind of joked about it in another thread but if Bama falls hard enough to end up in the Bham Bowl, I kind of want them to play JSU and lose the bowl to them.", "label": 0}
{"text": "Yes. It’s a big accomplishment. A lot of schools hang banners for making the NCAAT in basketball already.", "label": 0}
{"text": "13 is closer to zero than 100 so it still is almost zero", "label": 0}
{"text": "The most winnable…\n\nUntil next year", "label": 0}
{"text": "Randomly running into your daughter's friend's parents was wild.", "label": 0}
{"text": "Bro…wrong poster. Direct your smug bickering to the account who said those things. 😂", "label": 0}
{"text": "Just stick to the FSU stuff, man. It's not as funny when you veer away from your primary shtick.", "label": 0}
{"text": "I don’t think that will happen because I don’t think Bama loses to Mizzou, Mercer, OU, or Auburn. But if it did, JSU’s run game would run all over their defense", "label": 0}
{"text": "The university system is supposed to be to help foster knowledge development and provide unique training. Sports are a secondary part to attract students by adding to the campus experience.   \nIt isn't more important for them to do football and basketball. That is just where the money is. It is where they get the most exposure to get more applications. There is no reason I should know about Western Kentucky University, but I love them due to watching them play football. They never should have been defacto minor leagues. The universities created this monster and didn't fix it when they had the chance.", "label": 0}
{"text": "Sadly too much bad blood to bring back rolovich in that scenario", "label": 0}
{"text": "facts. we are not one of the best 25 teams in the nation right now, let alone top 12.\n\n  \nthat being said, i want the CFP appearance so badly lol", "label": 0}
{"text": "Something very like this happened in the Rutgers-UCLA game this week.  Rutgers was attempting an onside kick.  UCLA recovered it and ran it back for an apparent touchdown, but it was called back because a different UCLA player had given a fair catch signal.\n\nOnce ANY receiving team player gives a valid or invalid fair catch signal, the entire receiving team loses the right to advance the football.  No matter what happens, it's going do be dead immediately upon catch or recovery by either team.", "label": 0}
{"text": "If Miami wins out and Clemson stumbles 2 more times, it’ll help them out", "label": 0}
{"text": "Like I said no benefit, beating one isn't impressive, but their oddball offenses give them upset opportunities. I'd rather see ranked  P4 teams on the out of conference schedule, at least the reward/punishment in the rankings will be proportional.", "label": 0}
{"text": "Ok, so if I were to do a randomly selected schedule, would these types of pods be distinguishable. I’m pretty sure that if I randomly assigned 8 games to 16 schools and run knn id pull similar clusters. If I wasn’t on my way to a wedding rn I’d write it myself (and still may later once I’m sober)\n\nIn other words my intuition is this is seeing false patterns, but I’ll check it myself later and update this/you", "label": 0}
{"text": "The times of the neighborhood kid getting the keys to the Y and earning their ticket to college have long passed, and Olympic sports are increasingly becoming only open to youths and families with financial means anyway.\n\nTravel teams, club teams, equipment, private coaching, clinics, it costs THOUSANDS over a lifetime to get a kid in Olympic sports to a skill level to play for a college. \n\nThose kids are now gonna pay full tuition, which I daresay they can afford, or go to a lower division for a roster spot…which don’t offer athletic scholarships anyway.\n\nI understand the hand wringing if you’re a kid in that situation, but I think the majority will be ok.", "label": 0}
{"text": "I hope this was sarcasm XD", "label": 0}
{"text": "Maybe the ACC, but I would think a loss to FSU would drop Miami pretty far in the polls, barring other upsets. \nLook at Missouri: lost to TAMU and dropped from 9th to 21st.", "label": 0}
{"text": "Ah, so you look forward 4 weeks and think about how good things will be", "label": 0}
{"text": "[This is a fun thread to look back on](https://www.reddit.com?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=1) Deion called it but of course /r/CFB was blinded by their Deion hate", "label": 0}
{"text": "Hashtag BeatGeorgiana?", "label": 0}
{"text": "Well we will make and sell t-shirts for just about anything. So I would imagine we hang a banner for a round 1 win.", "label": 0}
{"text": "I get that it's a betting focused ranking, but no way Allar belongs on that list, although I'd buy Tyler Warren at around 7th in voting, but never getting an invite b/c a TE will never be top 3 in voting.", "label": 0}
{"text": "It isn't easy. I really tried to leave my BYU fandom behind, but I just couldn't.", "label": 0}
{"text": "BSU needs to win out, TTech needs to win out, UW needs to upset some teams, and Notre Dame needs to lose 1 more (probably 2 more) games.", "label": 0}
{"text": "11-1 Washington State would be a conference champion", "label": 0}
{"text": "Cal is already suffering enough", "label": 0}
{"text": "If we get there, and actually win a game, absofuckinglutely", "label": 0}
{"text": "We would hoist a banner for making the playoff.", "label": 0}
{"text": "Im surprised Wazzu hasn't offered him a huge extensions with a large buyout penalty.", "label": 0}
{"text": "But it’s to the west of the mountains though", "label": 0}
{"text": "Lol no.", "label": 0}
{"text": "Damn, he must really be happy to not have to play in Tennessee. But shit talking and not even an upperclassman before a game, it’s looking like one more game in Tennessee at the music city bowl", "label": 0}
{"text": "It’s a guarantee", "label": 0}
{"text": "And Deion called it ahead of time too which makes it funnier.", "label": 0}
{"text": "The obvious choice was to put Auburn in the East but that breaks Bama’s rivalry structure because both their rivals are out of division. Bama could’ve gone to the East but the SEC didn’t want Bama and Florida in the same division at that time. So Missouri went East and our rivalries stayed intact.", "label": 0}
{"text": "They got blown out by Boise st", "label": 0}
{"text": "See this is why I've always liked UGA fans.", "label": 0}
{"text": "And now Bama gets blown out by Mizzou", "label": 0}
{"text": "Not really, last season we had a couple of transfer WRs and a couple true freshman who, (including our TE) had a total of 10 reception TDs thru 12 games.", "label": 0}
{"text": "Ok Mizzou you have the chance to do the funniest thing ever now", "label": 0}
{"text": "I can't be mad. Well I can but I can't blame you", "label": 0}
{"text": "“Average good team”\n\nI.e. a perennial top 10 team instead of a 15 year dynasty with a 40% chance of a natty every year.\n\nRelax, big dog. No one thinks bama is average. Yet.", "label": 0}
{"text": "Jesus Christ. Alabama is gonna lose again. Lmao", "label": 0}
{"text": "He popped up in Ames for a little while in the mid teens. I think that was the last thing he did.", "label": 0}
{"text": "It’s what they get for choking away the Miami (FL) game. ", "label": 0}
{"text": "IF they get going is the more accurate word choice there.  Do you truly feel confident that a HC can come in and get Florida to being a top 5/dynastic program?  I don't see it, at least not quickly.  And is Florida going to be patient if it's a 4-5 year rebuild to national relevance?  \n\nIf I'm a HC, just wanting to get wins and collect millions of dollars, is UNC not the far easier job, with significally less stress?  I don't think you win titles at either right now, but I'd argue the road to the CFP is easier at UNC.  UNC fans are content with 7-8 wins and beating NC State/Duke.  Is Florida content with 7-8 wins?  What type of leash do you get at Florida?  \n\nIf I'm guaranteed success, I'm taking Florida for sure.  Upside is massive.  But I think it's a much, much harder job.  Winning 9+ games in the ACC is much easier than winning 9+ in the SEC.", "label": 0}
{"text": "I think you have to include Allar for now simply because Penn State could run the table, giving him a rather solid resume (even if he doesn't have the best highlight reel). What he's done in that offense from last year to this year is pretty astounding. And yes I'm still bitter over losing Kotelnicki.", "label": 0}
{"text": "The final CFP rankings will have us at #13 just to tease us.", "label": 0}
{"text": "There are many great things in this world right now, but very few of them will top Alabama fans contempt in Kalen DeBoer's wardrobe.", "label": 0}
{"text": "This joke is fucking hilarious but probably makes no sense to anybody that's not a kansan.", "label": 0}
{"text": "Your kicker missed 1 FG in regulation, and it was a 50 yarder, so hardly a chip shot.  Craig missed from 24, 40, and 46.  If he makes 1 of those, it doesnt reach OT.", "label": 0}
{"text": "WSU could go undefeated, beat 3 top 10 SEC and 3 Top 10 Big 10 schools and still would be left out of the playoffs", "label": 0}
{"text": "No because its gonna be 8 spots for the b1g/sec, 3 for the acc/b12 and 1 for whatever g5 is there.", "label": 0}
{"text": "The idiots are people who are okay with out of control coaching salaries while pretending to love amateur sports", "label": 0}
{"text": "Vroom vroom", "label": 0}
{"text": "USF would definitely yeah. We gotta hang something sometime…", "label": 0}
{"text": "Ashton. \nJeanty.", "label": 0}
{"text": "Do a back flip!", "label": 0}
{"text": "I was really hoping that this was the approach he was going to take. I was OK with the earlier transfer approach, but I was hoping he would pivot to high school recruiting a lot harder than what they are currently doing.", "label": 0}
{"text": "That’s the one.", "label": 0}
{"text": "No they are not playing football and recently said they have no plans to do so. But I could see that changing in the future.", "label": 0}
{"text": "Yeah you're right I didn't notice you said good. Nice username btw", "label": 0}
{"text": "I'm thinking that in transferring McCord infected some of the Syracuse fanbase with the same ridiculous expectations virus that has gotten so much of the OSU fanbase", "label": 0}
{"text": "WERE THE REAL METHODISTS, SMU. ", "label": 0}
{"text": "probably", "label": 0}
{"text": "Why don’t donors pony up money to save them, because they don’t care. 99% of you watching this don’t watch or support the Olympic sports.", "label": 0}
{"text": "They are now, but that’s part of dodging taxes. It was originally a for profit college.", "label": 0}
{"text": "Hunter?", "label": 0}
{"text": "I will continue to say this: you're laying it on too thick. The best trolling is at least somewhat grounded to reality.", "label": 0}
{"text": "FSU will put an end to phony trash can ward’s heisman run this weekend", "label": 0}
{"text": "The Snake River Rivalry has legs… let’s all keep calling it that please", "label": 0}
{"text": "*Windinia", "label": 0}
{"text": "We put up years we went to the Rosebowl so 100% would", "label": 0}
{"text": "….with what money exactly?", "label": 0}
{"text": "You probably would've if you had won the bowl and got to 10 wins", "label": 0}
{"text": "Thanks homie", "label": 0}
{"text": "Sure, and I agree that our Olympics sports pipeline should be maintained in some fashion, by the way. \n\nHowever, I keep seeing in threads like this is wherein advocates for siphoning off profit from Football/Basketball to continue funding these non-revenue generating sports are often quite vindicative at the prospect of the explicit formalization of this relationship and wished it was maintained under the veil of ambiguity and obscurity, a kind of black box of blanket university funding and expenditure, as it currently is. And I get it, it can feel demeaning to know that your status as a collegiate athlete exists solely on the largesse of these revenue generating sports while your sport/program cannot sustain itself on its own virtues. \n\nBut the money has to come from somewhere, as with all things. There doesn't have to be a concern about generating profit, but there is a concern about financially sustaining these programs. And if the money is coming from someone else's coffers, the question remains.", "label": 0}
{"text": "Forget the banner, we'd probably start a religion around that team.", "label": 0}
{"text": "I hope not. It sounds cringe worthy to me.", "label": 0}
{"text": "They'll hang a banner if someone shows up to finals sober", "label": 0}
{"text": "1. Ashton Jeanty (+200)\n2. Cam Ward (+210)\n3. Dillon Gabriel (+400)\n4. Travis Hunter (+1800)\n5. Cade Klubnik (+2000)\n6. Carson Beck/Garrett Nussmeier (+2500)\n7. Drew Allar (+3500)\n8. Jalen Milroe (+4000)\n9. Jaxson Dart/Kurtis Rourke/Shedeur Sanders (+5000)\n10. Quinn Ewers/Riley Leonard/Will Howard (+10000)", "label": 0}
{"text": "Not if you freeze it first", "label": 0}
{"text": "There's definitely a scenario where both BSU and an undefeated AAC champ could make it, but the cynic in me says that if only one gets in, it's the service academy because the committee wouldn't want to deal with the political shit storm of leaving them out.", "label": 0}
{"text": "Nobody notices college football banners unlike college basketball.", "label": 0}
{"text": "I guess you're right considering that Harvey Updyke and Phyliss from Mulga have passed on.", "label": 0}
{"text": "They'll be favored against Auburn and maybe South Carolina too", "label": 0}
{"text": "11-1 anybody should be in it, unless there are more than 12 teams with 1 loss or fewer.", "label": 0}
{"text": "Baylor shouldn’t be the big barometer of anyone’s viability for success this year, honestly.\n\nBaylor’s absolutely better than their record would indicate, since we got smoked by the first half of our schedule turning into one of the toughest in the country, but Texas Tech absolutely should not have given up 59 points to this Baylor team. The game was 59-21 when we we were putting in our *third-stringers* in the fourth quarter, while Tech kept their starters in the whole time.\n\nDave Aranda talked this week about how pissed off he was that Tech kept their starters in and got those two garbage time TDs against our third-stringers, that he put the starting defense back in to shut Tech’s offense down, and their offensive production immediately dissolved.\n\nA team like Baylor should not be able to clown a 5-1 team like that in their Homecoming game.", "label": 0}
{"text": "Break out the bison head for coach", "label": 0}
{"text": "Well we have to pay a football coach after Dickerts contract expires... so that money. Plus a little more.", "label": 0}
{"text": "its not pretentious if its just fucking true\n\nConsumer Affairs published a combined rankings of US public schools (sources included) and Alabama, Mississippi, Louisiana, and South Carolina were in the bottom 10. Georgia and Florida only barely escaped because of a few counties propping the rest up\n\nmoreover all though these arent considered the Deep South they are culturally related; Oklahoma, Texas, Kentucky, and Arkansas were all neither the bottom. \n\nif you look at a US education quality map its pretty damn obvious that a certain handful of states is still more interested in lying about the civil war than they are about making sure their kids can spell their own name\n\nhttps://worldpopulationreview.com/state-rankings/us-literacy-rates-by-state", "label": 0}
{"text": "Hell fucking no. God that would be sad", "label": 0}
{"text": "No. Kirby knows better.", "label": 0}
{"text": "Same, that Baylor loss snapped me back into reality", "label": 0}
{"text": "Did you see what some of your captains told [Diego Pavia before the game?](https://youtu.be/OkoYqy9Cedg?si=e92POdC1bzGP_A3_&t=95)", "label": 0}
{"text": "But, just imagine:\n\nWe formalize the pods and to maximize on historic match-ups, they make a pod of Vandy-Bama-Auburn-Tennessee. It would be *magical*, don't you think?\n\n(The other pods, of course, would be Texas-TAMU-OU-Mizz, Arkansas-LSU-Ole Miss-Mississippi State, and Kentucky-SC-Florida-Georgia and then some sorcery to preserve the *good* cross-pod rivalries.)", "label": 0}
{"text": "I like Indiana (primarily because I hope we steal your coach) but he's right. You guys are ranked as high as you are pretty much solely because you've been whipping the hell out of the crappy teams on your schedule.\n\nIt's not really anything to worry about long term. If you win out, then the sky is the limit.", "label": 0}
{"text": "I personally think Snake River Shootout is less of a tongue twister", "label": 0}
{"text": "Hunter absolutely should be a finalist, but I think Jeanty is just far more impressive for Hunter to get the award. Take Jeanty out and I think there is an argument between Hunter and Ward", "label": 0}
{"text": "I also don't think it should be a surprise that so many coaches are fleeing to the NFL right now. There, Coach and GM are two separate roles, so coaches just have to coach. Here, Coach and GM are still the same job, so not only are you coaching, but you're on the year-long grind of recruiting. While this was more manageable when you only had to care about high schoolers, you now have to recruit every single team, including your own.\n\nKeeping that many plates spinning is going to be exhausting, and it wouldn't shock me if GMs become a standard thing. Hell, more and more European Soccer teams are adopting the Coach/GM dynamic, because it just makes sense now.", "label": 0}
{"text": "You guys shouldn't be allowed to speak in here until you play teams with a pulse.", "label": 0}
{"text": "Tech isn’t going to win the Big 12 with that defense lol", "label": 0}
{"text": "I’m not so sure.", "label": 0}
{"text": "Considering we have banners for winning the 2007 New Orleans Bowl, 2008 Motor City Bowl, and 2017/2019 Boca Raton Bowl, not only would we hang one, we’d paint it at the 50 yard line.", "label": 0}
{"text": "The only thing in stadium are national championships and heismans. From that standpoint the answer is no. I’m sure it will be listed in program accomplishments ", "label": 0}
{"text": "We hang a banner and give Elko a $100m extension", "label": 0}
{"text": "LOL, I'm with you. I thought it was one of those fake online schools and was wondering why MWC had any interest in them.", "label": 0}
{"text": "The football athletes are not supporting the other sports. Football the sport is. You could go get Tom, Dick, and Harry from a frat slap a Alabama helmet on them and Bryant-Denny would still sell out.", "label": 0}
{"text": "Whoever wins, my fingernails lose", "label": 0}
{"text": "I completely agree. I did the math, and making the NCAA Tourney means you were part of the 18% of CBB programs who made the 64. Making the 12 team playoff means you were part of the 9% who made it. So like... why not?\n\n  \nI mean hell, for a lot of teams, a top 10 finish in the polls are good. And being the NY6 G5 is a good year. So that's really only 1 team who's in a weird spot.", "label": 0}
{"text": "It's gonna be chippy. Refball incoming", "label": 0}
{"text": "16 years", "label": 0}
{"text": "This is one of the funniest things I’ve ever seen", "label": 0}
{"text": "The game was right until the 4th quarter when Jeanty took full advantage of our tired defense. \n\nI’d say it was competitive, but Boise was definitely the better team.", "label": 0}
{"text": "Id be 100% ok with having a banner for making the CFP because it would be a fuckin miracle Rutgers made the CFP\n\n  \nHaha life is hellish misery. CHOP USC I guess", "label": 0}
{"text": "I agree with you. That the team hasn’t just called it a season and quit yet is pretty surprising. I thought it happened in the second half vs SMU, but it hasn’t really been the case. So to the coaching staff’s credit… they’re absolutely still trying. To their discredit, I guess… this is them trying.", "label": 0}
{"text": "The only notable coach for Indiana in the last 50 years and he was fired with an under .400 win %.", "label": 0}
{"text": "I'm here to avoid water quality modeling. Solidarity", "label": 0}
{"text": "It's been a \"home team wins\" series for like 6 years now", "label": 0}
{"text": "Kiss of death", "label": 0}
{"text": "Well played.", "label": 0}
{"text": "I got so tired of the beakers talking all off-season. I hope Avery and the boys drop 90 on em. {Kansas State}", "label": 0}
{"text": "Oh come on, most of these sports are full of perfectly affluent athletes who can afford to chase their dream at the club level. A lot of deserving students don't get scholarships because someone wants to.. swim?", "label": 0}
{"text": "I think an undefeated Army/Navy would get in even as an at-large as they’d have a ND win, a win over the other, a CCG game against Army/Navy/Tulane/Memphis, and extra wins against Memphis and Tulane in Navy’s case", "label": 0}
{"text": "set me free", "label": 0}
{"text": "Have you been to Death Valley in the last 4 years?", "label": 0}
{"text": "I can imagine it would get crowded with B1G championships on your pressbox lol. Ours is already fairly crowded", "label": 0}
{"text": "It honestly sounds like you'd prefer to watch D3 football instead of major college football. The idea that these are regular college students playing football is pure fantasy, and it has been since...honestly probably forever. They have different admission standards, different workloads, different dorms, entirely different lives than \"regular college students.\" \n\nI don't blame you for this thinking. It's the result of a well funded public relations campaign by the NCAA and its member institutions in order to convince you it's okay for them to keep all the money. The idea that it's crazy to think it's exploitative is a bit too far though. \n\nThink about it this way. If swimming and track didn't give their players scholarships, would anyone still want to do those sports? Of course they would, right? D3 schools have softball teams, high schools have track teams. So why do they need scholarships to do it? Who does the football team need to pay for those kids to get a free ride?", "label": 0}
{"text": "The good news is that a lot of them are moving over to *checks notes* Ohio state?", "label": 0}
{"text": "Ohio State also never played anybody of note in the B1G", "label": 0}
{"text": "If someone is generating revenue off your work, you deserve to be paid. How hard is this to understand? Like fucking welcome to America. So yes, the high school athlete should be paid if the money is being generated.. like should we just not pay child actors?", "label": 0}
{"text": "The Kiss Of Death.  \n  \nHe's gone.", "label": 0}
{"text": "Losing by 60 *feels* like quitting…if your argument is that that’s the best they could do, then FSU has even bigger issues.", "label": 0}
{"text": "I FEEL LIKE WE SINGLE HANDEDLY SAVED SHERRON MOORE’S JOB", "label": 0}
{"text": "I thought that was a Cleveland Cavaliers fan when they won after Lebron went back. Was it both?", "label": 0}
{"text": "Painful game for both sides. Teams have 5+ sacks each. Combined 5+ turnovers. The stadium is so drunk that nobody is sure if randy bond made the field goal to put {Texas A&M} over the top", "label": 0}
{"text": "This is why I'll never understand why some coaches decide to be too \"player-friendly.\" It always, almost immediately, leads to constant shit like this when you let 17-22 year old men get their way too often. \n\nEven though Sark is considered a \"player-friendly\" coach, he would never in a million years tolerate shit like this or coming out of the tunnel before the Tennessee game with a cigar in hand", "label": 0}
{"text": "this comparison doesnt work because you have the ability to go work for another company that will pay you more if you feel under valued. college athletes did not.", "label": 0}
{"text": "Fran Brown looked so lost after that game he’s still a good and Syracuse is only 5-2 they have some winnable games but it all determines Kyle Mcord", "label": 0}
{"text": "Lee got out of a coffin on his weekly Indiana football show and exclaimed I ain’t dead yet after a win.", "label": 0}
{"text": "I'm already living in the past.", "label": 0}
{"text": "So you’re telling me there’s a chance?", "label": 0}
{"text": "Exactly, everyone acts like everyone deserves to get paid except for the athlete, it's insane. If a college fucked up and has to get rid of certain sports, then that is their own fault for not being prepared when their obviously illegal house of cards came crumbling down.  \n\nIf they would agree to not pay the coaches, get rid of ticket prices altogether, get rid of advertising and all of that, then I'd be all for not paying players.. but to get me to agree to pay everyone except the players is hard no from me.", "label": 0}
{"text": "Bro what lol, this is delusional. That’s not even close to true. 2011, sure, but LSU was rarely even a top 10 team during the Saban era", "label": 0}
{"text": "Only the NCAA's century of violating athlete rights made that possible.", "label": 0}
{"text": "I do love the Saban would have done this, Saban would have done that discourse around Alabama like the man didn’t retire because he didn’t have every advantage in the sport working for him anymore.", "label": 0}
{"text": "Lol so petty", "label": 0}
{"text": "They'll be fleeing like Patriots fans soon", "label": 0}
{"text": "Even Illinois only has our B1G and National Championships on display (and our 2 retired numbers, but that's in the same category IMO). We used to have signage for all our bowl appearances on the wall in the south endzone horseshoe, but got rid of it at some point in the last few years. Even when we had it tho, it was no where close to what I would consider \"hanging a banner\" like the display we have on the pressbox is.", "label": 0}
{"text": "I'm giving you all of my energy DBZ style. I would love to see the kitties get demolished.", "label": 0}
{"text": "I feel like he has to go for 200+ rushing yards in each of the next 5-6 games or he’ll get passed by someone more visible. Plus Boise can’t lose.", "label": 0}
{"text": "Perhaps the problem is \"college\", where one goes to learn, and \"athletics\" which has absolutely fuck all to do with education. Ever think about that?", "label": 0}
{"text": "Sure why not. Most schools hang a banner just for going to the NCAA basketball tournament. Even if you make it and don't win, why not have a \"2024 NCAA Football Payoff\" banner or whatever is the official name of the playoff. Heck, even a lot of schools have banners just for going to the NIT tournament.", "label": 0}
{"text": "Watching McCord suddenly have to throw a billion passes per game makes me a little surprised this is his first time having a game that bad. \n\nAlso is Brown a first year coach? Y'all are 5-2 I'd say so far thus season is pretty successful ", "label": 0}
{"text": "They are different sides of the same shitty coin.", "label": 0}
{"text": "I know it comes from our in state rival but I still laugh at it because there are times I have to agree.\n\n* “I’ve always felt that being a Cougar prepares you well for life. You learn not to expect too much.\" **–** **UW coach Don James, 1983**", "label": 0}
{"text": "Can confirm, we have all 6 2015-2020 playoff logos on the overhang of the upper deck but only 2016 and 2018 have flags atop the stadium.", "label": 0}
{"text": "He really seems to care about his family.", "label": 0}
{"text": "Same", "label": 0}
{"text": "It's only a matter of time until we claim 2011", "label": 0}
{"text": "TBH with conferences so big these days that is a legit accomplishment. Winning a division today is basically winning a conference a generation ago.\n\nI’m glad the Ivy League is still at 8 teams. Teams have reasonable chances of winning a championship every so often. ", "label": 0}
{"text": "They will make a plaque without the year.", "label": 0}
{"text": "well can you please pressure our qb?", "label": 0}
{"text": "HE. PLAYED. FOR. WEST. VIRGINIA.  His fashion is appropriate.", "label": 0}
{"text": "Well, that's actually the whole principle of Chesterton's fence. You see these rules, *the fence,* and you may say, \"This is all a house of cards! The idea of college athletes enrolling at university to get an education is a myth.\" Or, in your exact words, \"You mean the tradition of going to school to play school?\" As I said, it's imperfect. However, when we negligently destroy rules and parameters, then we receive chaos. Yes, things will smooth over to a new status quo will take over. However, scoffing that these original rules were meant as a charade is ignorant at best. We have to be honest about what change brings and ask ourselves if that change is worth it as a whole.", "label": 0}
{"text": "I feel like there’s some small possibility if they beat OSU & he goes off then he will be right up there in voting since PSU might be undefeated at that point too", "label": 0}
{"text": "Would not surprise me at this point. Starting off 5-2 and losing out the remaining games of the season would literally be the 2018 season all over again lol", "label": 0}
{"text": "#*NO*", "label": 0}
{"text": "Opposed to the opponent first mentality?", "label": 0}
{"text": "Hard to win consistently without adequate recruiting and developing the lines of scrimmage. I'm sure the transfer portal doesn't help with continuity", "label": 0}
{"text": "Mike \"I always run it on 2nd and long\" Bobo is the most predictable play caller in CFB history. He has looked bad from a playcalling perspective at every other coaching stop.", "label": 0}
{"text": "We better increase Rich Rod's buyout RIGHT NOW", "label": 0}
{"text": "National stage tonight world series game will be ending soon after kickoff", "label": 0}
{"text": "> This just makes me want to knock their teeth in even more. Thinking 400 rushing yards, 150 passing yards, cover the spread\n\nI love reading UCF fans comments before our game", "label": 0}
{"text": "The Inland Empire Encounter", "label": 0}
{"text": "The only \"abuse\" in any of this is the NCAA/schools violating athlete rights.", "label": 0}
{"text": "I could see a banner similar to teams that post one in years they win the division in the NHL or something. One banner with a bunch of years on it", "label": 0}
{"text": "everyone was saying going into this season the best team in the SEC was in texas", "label": 0}
{"text": "What??", "label": 0}
{"text": "They better win after saying that", "label": 0}
{"text": "yes thats correct.", "label": 0}
{"text": "I hear Yellowstone is hot!", "label": 0}
{"text": "Cignetti says to hold his cig", "label": 0}
{"text": "Welcome to the big 12! Where preseason rankings are made up and the recruits don’t matter!", "label": 0}
{"text": "Sir, a second burrito has hit the KSU fanbase", "label": 0}
{"text": "Saban to West Virginia", "label": 0}
{"text": "just set up a moonshine still in the stands at this point", "label": 0}
{"text": "I don't know how many people will get that joke, but I appreciated it.", "label": 0}
{"text": "need peyton thorne next", "label": 0}
{"text": "It’s evident that they’re desperately searching for QBs to hype up. Some of those names are just laughable. Jalen Milroy, Jaxson Dart, and Cade Klubnik should not be even sniffing the Heisman at this point", "label": 0}
{"text": "I’m frustrated on your behalf that wsu gets the short end of the stick. First it was the anti-pac12 bias created by night games. Now it’s due to the conference screwing you. An 11-1 WSU deserves it just as much as some of the other teams who haven’t played anyone of note that the AP and Coaches poll are fawning over", "label": 0}
{"text": "Frankly, most people don't give a flip about Olympic Sports.", "label": 0}
{"text": "Because it's hyperbole, dumb, and sour grapes\n\nhe's not \"not good\".  He is good.  He is just not good enough for Ohio State, and that's completely fine.  There are like 122 QBs that fit that description and he's amongst the top of them.", "label": 0}
{"text": "i hate jimbo fisher for how many times he *almost* beat yall", "label": 0}
{"text": "And plagues...", "label": 0}
{"text": "I wish I had this much time on my hands.", "label": 0}
{"text": "> The NCAA was a collegiate monopoly. Nobody is denying that.\n\nYou opened with denying it.\n\n>The original comment said they had no other option to play so they played there for free. Yes. And the NCAA ruled the roost in that space. They were the space of amateur athletics.\n\n>Point being there were other avenues that could have been pursued outside the amateur avenue. And nobody attempted them. Is that the NCAA's fault?\n\n>People were free to start a league the past 100 years that paid the players out of high school and none caught on or somebody did.\n\nThe NCAA's century of violating antitrust law is, in fact, the NCAA's fault.\n\nNothing you've said here changes that.", "label": 0}
{"text": "I guess your mom was already taken?", "label": 0}
{"text": "When in Rome.", "label": 0}
{"text": "Indeed. Will be an absolute plague of banners in that stadium if a&m makes the playoff", "label": 0}
{"text": "Sorry Indiana, but we didn't travel to Bloomington just to be the NPC. We came to be the main character. Here's to a good game.\n\n^(P.S. Don't beat us too bad, ok.)", "label": 0}
{"text": "this name is so pro-violence though I can't handle it", "label": 0}
{"text": "Back channel rumors are when USC left for the B1G, the conference doing jack shit for them when the NCAA fucked them was still top of mind for the board. \n\nThe blue chip schools don’t forget when their conference fucks them. ", "label": 0}
{"text": "They will put it on their wall with the 1997 championship in which they lost to Nebraska (I remember because I was actually there) and the 2010 championship in which they didn't even qualify for the game", "label": 0}
{"text": "Actually, a lot of people do, but you do you booboo.", "label": 0}
{"text": "Well yeah. He inherited a 6-7 team, not the most talented CFB team of all time.", "label": 0}
{"text": "{SMU} 29 Duke 18", "label": 0}
{"text": "It used to be the Barstool Arizona Bowl and was commentated by Portnoy and Big Cat themselves. I don’t doubt that this one will have Snoop literally running the show. We have fun down in the desert.", "label": 0}
{"text": "No, they really don't. Does a swim meet even make espn ocho?", "label": 0}
{"text": "I agree . The amount of heisman games cam has has vs every other qb is pretty big.  Cam is the only one that should have any sort of chance", "label": 0}
{"text": "just because its true doesn't mean we won't get mad about it", "label": 0}
{"text": "Now that conference champs makes the playoffs, we should stick to the ACC championship banner. No need to hang two banners for the same thing. All previous playoff appearances were invites that actually meant something. Look at FSU last year, going 13-0 and winning your conference didn't mean that you would make the playoffs.", "label": 0}
{"text": "I think it’s more defense are more ready for him this year. They have figured out how to stop him. Guard against the deep ball, put a spy in him, and force him to consistently make intermediate throws. \n\nI’ve notice several teams this year aren’t really rushing us this year just dropping into coverage and trying to limit his scrambling opportunities. Unfortunately our run game hasn’t been as good as we thought so teams can do this against us.", "label": 0}
{"text": "No, you don't. Just... trust me on that.", "label": 0}
{"text": "Charlotte’s definitely could end up becoming that(even more so then now) if the “Remi” model takes full flight.", "label": 0}
{"text": "{Auburn} 17 Kentucky 15", "label": 0}
{"text": "K, you can keep trolling with someone else.", "label": 0}
{"text": "I get nervous before every game because I think “maybe this is the week they get exposed.”\n\nI’m going to continue thinking that way because it seems to be working out for the Hoosiers!", "label": 0}
{"text": "lol", "label": 0}
{"text": "People will look back on your comment two days from now and wonder how you knew", "label": 0}
{"text": "It's very, very over lol", "label": 0}
{"text": "Ope it’s fucking gravity.", "label": 0}
{"text": "I have seen schools put up a banner for making it to a not very good bowl game. Not winning the bowl game, just making it to one. \n\nI think a place like Rutgers or Minnesota *should* put up a sign for making it to the CFP. A place like Oklahoma (IIRC) has not and would not. And both are perfectly acceptable!", "label": 0}
{"text": "I was about to say.....we're feeling bad for Alabama already? Blink twice if you're being held hostage, Christ alive.", "label": 0}
{"text": "Yeah there's a few names I don't think belong.  Leonard, Dart, Milroe, and Beck stand out to me.  Allar and Klubnik probably too high as well", "label": 0}
{"text": "Lol at 5-2 and expecting things to magically change.", "label": 0}
{"text": "{Kansas State} 36-23", "label": 0}
{"text": "Hugh Freeze knocking ~~out~~ up a water boy FTFY", "label": 0}
{"text": ">Why are student athletes subsidizing other athletes.\n\nWhy are student athletes subsidizing millionaire coaches and athletic directors and unnecessary facilities would be a better question.", "label": 0}
{"text": "Indiana is historically a basketball school, so we don’t understand this bowl game nonsense. We DO understand tournaments, though, so it makes sense that Indiana would suddenly get better at football once they introduce an expanded-field tournament format.", "label": 0}
{"text": "D \n\nBut with a loss Saturday I could see bottom completely falling out and finishing 4-7 which is definitely a F. \n\nI think we have to win 4 out of last 5 minimum to prove last year was anything more than catching a favorable schedule.", "label": 0}
{"text": "It's a simple equation, if people cared, it would make a profit. Times change, get over it.", "label": 0}
{"text": "Because they didn't want to rename it the North, but the line dividing the two was much closer to latitude than longitude.", "label": 0}
{"text": "Since when are unpaid internships are illegal or really niche. And even if they were niche, certainly you could argue that professional football is a niche career ", "label": 0}
{"text": "I also get nervous, but then I think \"what could Coach Cig want from me?\" and being nervous about a win certainly ain't it", "label": 0}
{"text": "Only because we don’t play y’all this year /s\n\nGood luck. The enemy of my enemy and all.", "label": 0}
{"text": "You guys are probably going to win on Saturday but beyond that I have no idea", "label": 0}
{"text": "{Colorado} 30-20", "label": 0}
{"text": "Not even close to being the most icky [https://www.npr.org/2024/03/05/1236019397/liberty-university-clery-act-safety-crime](https://www.npr.org/2024/03/05/1236019397/liberty-university-clery-act-safety-crime)", "label": 0}
{"text": "Yeah, no amount of coaching will fix receivers dropping perfectly thrown passes. I blame the equipment manager for buttering up their gloves.", "label": 0}
{"text": "A&M wearing all black. LSU wearing all white.\n\n\nMe, an LSU fan: \"Can we even cheer for the whites to beat the blacks?\"", "label": 0}
{"text": "Turn back means you do the whole academic year over. Depending on injuries, academics, and other factors they could be “December Grads” doing an extra semester after their class graduation in May. Army and Navy have 5th year guys here and there but the didn’t allow wholesale voluntary turn backs during COVID. The AF guys got jobs in Colorado Springs, driving for door dash and such, worked out together every week and got really good.", "label": 0}
{"text": "It's the same generation tbf", "label": 0}
{"text": "Not that many bars in Auburn, there are so little that when the guys from Pullman showed up in 2013, they drank it all", "label": 0}
{"text": "Count me among the people who didn't get it", "label": 0}
{"text": "People sure do care about the US medal count when they're at the Olympics, which was very highly viewed this year. Again, you're speaking out of your ass on stuff that isn't true.", "label": 0}
{"text": "kansas is 2-5 and has allowed 7 TDs and 52 total points in end of half/end of game situations with 2 mins remaining. That's not sneaky okayish, that's the mark of a bad team. They'll get owned.", "label": 0}
{"text": "How quickly you forget about the terrible state of the Colorado program literally 2 years ago.  The fact that they are getting quality players is a major win.", "label": 0}
{"text": "I would beg to differ. The sum total of all current and former Olympic sport athletes far exceeds the number of football players. I’m not suggesting that everyone cares about Olympic sports. But a lot of people do.", "label": 0}
{"text": "You mean those things fans have talked about for years?  It's like saying no one's talked about the increase of commercials, lol ", "label": 0}
{"text": "West Virginia Head Coach Jimbo Fisher i mean Nick Saban", "label": 0}
{"text": "[https://www.usatoday.com/story/sports/ncaaf/bigten/2021/09/04/indiana-misspelled-indinia-hoosiers-jersey/5736366001/](https://www.usatoday.com/story/sports/ncaaf/bigten/2021/09/04/indiana-misspelled-indinia-hoosiers-jersey/5736366001/)", "label": 0}
{"text": "{Texas} 41-17", "label": 0}
{"text": "...to everyone else", "label": 0}
{"text": "A common theme under Richt was exceptional skill position talent paired with okay to decent OL/DL. 2008 UGA also had injuries so we got beat in the trenches against better teams.", "label": 0}
{"text": "of course not. banners are not nearly crazy and expensive enough for the aggie AD.", "label": 0}
{"text": "There are those who [begged for it not to happen](https://www.reddit.com/r/CFB/comments/3uqcyq/georgia_has_fired_mark_richt/cxgvzwx/).", "label": 0}
{"text": "Okay? Boise state is one of the best teams in the country and has the best player in the country, and they should have beat #1 Oregon. Why are you saying that like it’s a knock on us?", "label": 0}
{"text": "I'm just waiting for Urinating Tree to come out of left field screaming \"THE PITTSBURGH PANTHERS ARE GOING TO THE NATTY!!\" in full yinzer mode", "label": 0}
{"text": "> Even in his off years, he would still hang giant Ls on Missouri\n\nMangino was 4-4 vs Missouri including a loss in the biggest game in program history", "label": 0}
{"text": "Because it puts them way behind the 8 ball when it comes to G5 teams", "label": 0}
{"text": "Oh my god, how did I miss that? That's amazing", "label": 0}
{"text": "Exactly. Wazzu is cheering for undefeated Oregon, ISU/BYU, Miami, and one loss Georgia, give another spot to Texas or Tennessee, another spot to OSU, and then just bloodshed after that.", "label": 0}
{"text": "The lost doesn’t look bad right now. It’s a quality loss.", "label": 0}
{"text": "TIL! Thanks!", "label": 0}
{"text": "{Penn State} sneaks out with a 27-24 victory", "label": 0}
{"text": "Oh my", "label": 0}
{"text": "And then the colts will hang a “shares a state with a CFP game winner” banner", "label": 0}
{"text": "Nobody wants that to happen anyway.", "label": 0}
{"text": "Pollsters put stock into a Heisman contending QB though (like NFL power rankings), they’d drop for sure but probably not far enough that they couldn’t come back if they finished strong.", "label": 0}
{"text": "25-17 {Oregon}", "label": 0}
{"text": "Because the only reason they are so welcoming to him is because he became a famous commentator.", "label": 0}
{"text": "My god, what have we done??", "label": 0}
{"text": "“Brown needs to make changes going into next year. He needs to reassign duties and remove some coaching staff. If he can't do that, he needs to be removed himself.”  Already starting to call for the head of a rookie coach that just lost his second game lol. A bunch of stats to prove why you’re worse despite actually winning. you don’t deserve to win, so hopefully you’ll find a coach that gives you great stats while losing", "label": 0}
{"text": "Cig is love, Cig is life", "label": 0}
{"text": "At least Phyliss was fun crazy. These people are dumb, and the less that first one you mentioned is talked about, the better", "label": 0}
{"text": "It's in the article. $3.5M (probably because the $16M from the WCC is non-refundable)", "label": 0}
{"text": "WTF are you talking about?  J'Koby Williams, the 3rd string RB scored to give Tech 27 points.  Tahj Brooks wasn't even on the field for Tech's final two TD's.  \n\nTech scored on their final possession with 2 minutes left.  If \"Dave put the starters back in\" they sure as hell didn't \"shut Tech's offense down\".  \n\nBaylor caught every single lucky bounce and played a great game, no need for this silly nonsense about Aranda being pissed off Tech's 3rd string RB scored a TD.  Give me a break.", "label": 0}
{"text": "Hey now, throw some shade at “National champion” UCF while we are at it! Don’t make FSU feel bad about themselves 😂👀 nothing Georgia and Bama love more than keeping undefeated Florida teams out of the playoffs", "label": 0}
{"text": "Big Cig Energy", "label": 0}
{"text": "I don't know, man. The dark reign of Darth Visor is looked back upon in horror by everyone else in the SEC.", "label": 0}
{"text": "{Indiana} 32-26", "label": 0}
{"text": "They can't even handle Civil War but maybe they're okay with a rivalry name with a less grand scale of violence", "label": 0}
{"text": "Absolutely.", "label": 0}
{"text": "There are currently 20 P4 (+ND) teams with 0 or 1 loss. Half of them are outside the top 10. If any of them win out they are 99% going to get a playoff spot.", "label": 0}
{"text": "Pretty much.   \n  \nI've been involved in swimming my whole life, and I'm close with a bunch of top D1 program swimmers that I trained with during high school. Personally, nothing killed my hope more for the future of the sport than the fiasco Michigan State made when it decided to kill its mens and womens swim and dive programs back during covid. \n\nAlumni of the program and the wider swim community in Michigan rallied to save the program, raising $5.2 million, an incredible sum for a non-top swim and dive program, yet MSU still wouldn't bring it back, later adding a goal of $6.5 million. \n\nA couple of years, lawsuits, and Title IX violations later, there was a little bit of hope because MSU was going to build a new rec center with a 50 meter pool which would be a great opportunity to start the program again. The old pool was nearing the end of its life span and was due to be replaced anyways, and the money we raised could help support the program. In fact, in the interim, we even secured $8.5 million from two anonymous donors but MSU didn't accept it because they were estate bequests and endowments rather than \"cash in hand.\"\n\nThen, MSU says that in order to \"upgrade\" the pool to support a competitive varsity program (which keep in mind is already going to be build as part of a $200 million dollar rec center) we'd have to raise more money to make the upgrades.\n\nThe cost? **$26.5 million dollars**. That's enough money to support a program like MSU's for 30+ years. And the pool is being built anyways! We knew it was a bullshit number to kill our efforts, but we knew it would be insurmountable. \n\n  \n*Sigh*. Point being, unless you're a top top program the people in charge don't care about sports like ours, and with the way NIL keeps going they're only going to get more giddy to cut programs. I'm not even sure how much leverage programs like cal, stanford, florida, texas, and virginia will have in the future despite producing so much of our Olympic swim team.", "label": 0}
{"text": "DO YOU GUYS WANT DINO BACK? I OFFER HIM AS TRIBUTE.", "label": 0}
{"text": "Actually very likely", "label": 0}
{"text": "Trent Alexander Canyon", "label": 0}
{"text": "Mizzou is getting +17.5.  I'm betting heavy on them.  Alabama may win but it will be a close game.  Alabama is not a top 10 team.  They look totally beatable this year.", "label": 0}
{"text": "You and 95% of other Gators fans will be clamoring for a playoff spot and then a national championship within 2 seasons of becoming average-good again (I actually think you're already there this season and have at least one major upset win left).", "label": 0}
{"text": "I wouldn't be. I feel the ISU faithful are going to travel extremely well, outnumber us in Arrowhead - which is already by default decked out in red and gold minus the cute KU trimmings tacked here and there - and then fucking annihilate us. Y'all have years of pent up rage from our last two meetings to unleash on us. \n\nI do not expect it to be particularly kind or merciful.", "label": 0}
{"text": "Has klubnik even been that good? Isn’t he like a 5/6th round projection", "label": 0}
{"text": "I have heard it before but not in a while, it was mostly meant as a joke", "label": 0}
{"text": "This is Bill Mallory erasure (still had a losing record at IU)", "label": 0}
{"text": "{Ohio State} 42-14", "label": 0}
{"text": "Undoubtedly\n\n\nJacksonville would celebrate for weeks", "label": 0}
{"text": "Meanwhile, Florida's AD makes $1.7M/yr and apparently thinks the solution to balancing the budget is to just curb spending on smaller sports instead of reining in spending on the big money items.\n\nFor perspective: Florida paid Muschamp $6.3M in buyout, McElwain $7.5M in buyout, and Mullen $12M. They've paid $26M for people to *not* coach in the post-Urban era. Billy Napier's buyout, right now, would be $28M. Across 2.5 seasons, his cheapest season has been about $1.2M/win. \n\nBut yeah, the swim team is definitely where your budget problem lies.", "label": 0}
{"text": "The “if Kenny Pickett was playing, we’d win the big ten every year” rubbed me wrong after losing to us in 21. Especially because he cut his teeth here, and up until that point, was still pretty well loved by our fanbase. \n\nI’m over that now, feels like the Mel Tucker era is a distant memory (but I only remember Kenneth walker). \n\n\nPoint is, I agree, and I’m happy for y’all. Also, if we catch strays from the nard dog in the future I’ll try to be more understanding.", "label": 0}
{"text": "Please make this happen, going to Nashville for Thanksgiving next year regardless", "label": 0}
{"text": "No, no. They have a 46% graduation rate. They have zero interest in giving you a diploma, just in taking your money.", "label": 0}
{"text": "That’s kind of what I mean by poll inertia being some shit though. The lower expectations for Pitt are the whole reason you’re ranked 13 spots below Miami, despite fairly similar success levels against not-great schedules.", "label": 0}
{"text": "Those are actually his church clothes.", "label": 0}
{"text": "Don't forget Yosemite  - they have some ornery players, hot tempered, constantly after \"varmints\" and such", "label": 0}
{"text": "Napier has been a total disaster yet took a top ten Tennessee to OT with a couple of decent but not elite recruiting classes. Mullen barely recruited and had a terrible DC yet walked to 10 wins nearly 3 years in a row.", "label": 0}
{"text": "Rich Rod come home.", "label": 0}
{"text": "They’d rather add a for profit diploma mill than New Mexico State", "label": 0}
{"text": "I’m just passing through info from [what Aranda and the interviewer said at the coaches’ show they did this week](https://youtu.be/FzLqUDZZ8W0?si=a5hAf_pi6aWgUzEZ), brother. \n\nI’m at work and don’t have time to find those clips in particular, but I’ll circle back and edit in times later tonight.", "label": 0}
{"text": "I’m kidding, I think it’s absurd they changed the Red River Shootout. Like who is asking for this. And then the Civil War", "label": 0}
{"text": "Pretty early in your link: “\n\nInterns and students, however, may not be “employees” under the FLSA—in which case the FLSA does not require compensation for their work.”", "label": 0}
{"text": "Agreed", "label": 0}
{"text": "“Portal King: Mike Norvell” across the 50 yard line would look great", "label": 0}
{"text": "How does that not get flagged? Like holy shit", "label": 0}
{"text": "JMU students also get free athletics admission. Vandy was the same way. When I was at Tech, the whole \"buy season tickets for $200 per sport or else enter a lottery\" thing was just weird.", "label": 0}
{"text": "Up there with the Washington Natinals.", "label": 0}
{"text": "Or we could see if Bo Pelini wants to come to the C-USA and build upon the powerhouse", "label": 0}
{"text": "Honestly the little scuffle where they tried to stand over the ball and prevent it from getting set right before Tennessee's second touchdown last Saturday was pretty childish. I can't help but feel like Saban would have lost his shit on all of them.", "label": 0}
{"text": "He did tweet about the Panthers going to the superbowl so it’s possible for him to start screaming if they keep winning", "label": 0}
{"text": "I wish we did but actually just made it a photo of Jameis Winston fall-fumbling", "label": 0}
{"text": "Man, my guys are so salty they’re walking right into these owns.", "label": 0}
{"text": "…okay? Why does that mean you should be a dick about it?", "label": 0}
{"text": "Okay? Neither were Urban, or Spurrier, or Kirby.", "label": 0}
{"text": "We added a “CFP Playoff” space in our stadium and now list 2016 and 2024. Nothing about wins, just showing the years we made it", "label": 0}
{"text": "...who?", "label": 0}
{"text": "Unfortunately not for something that interesting.\n\n It was for a few coaches operating regular practices during summer 2003-05, failing to report it to their compliance officer and the head coach knew about these practices.", "label": 0}
{"text": "Everyone involved in the athletics department", "label": 0}
{"text": "I feel like the *plan* was good. Beating CU would have done a lot for our recruiting with all this kids there.\n\nThe thing that backfired was… everything else.", "label": 0}
{"text": "I've heard lol", "label": 0}
{"text": "yup XD", "label": 0}
{"text": "Ah yeah mb a guy tried the most extreme solution 40 years ago and we never revisited it you’re right no compromise would’ve been possible. \n\nThis is only proving my point that they sat on their hands forever which forced legal action. ", "label": 0}
{"text": "kU fans pivoting to basketball any time football is mentioned.\n\nSome things never change", "label": 0}
{"text": "People made Saban seem like a psychopath. But he rarely had these kind of things happen, even post NIL.", "label": 0}
{"text": "You know why. We all know why.  \nPAC coaching man. It aint it.", "label": 0}
{"text": "Just look for the ones who are grinning. ", "label": 0}
{"text": "Mike Florio is a WVU grad.  Now, whether you consider him a prominent member of the national sports media is another question.", "label": 0}
{"text": "Boooooo!  If you can't make your call before the game, what good is it.  You would just be another bandwagon fan at that point.", "label": 0}
{"text": "I swear they were playing angry the last 2 weeks or trying to at least", "label": 0}
{"text": ">By removing the barrier between amateur status and pro you inevitably create a system that will have to make the hard decisions like a for profit enterprise does. \n\nThat should have been happening all along. Instead, what you got was athletic departments who have no incentive to do anything but spend every cent they get, regardless of if it made sense or not. AD salaries keep going up (CDC at Texas is making almost $3M/yr), coaching salaries and buyouts are out of control, facilities got absolutely ridiculous, and why not? You have plenty of TV revenue and donors are backing up the Brinks truck. Why not spend $22M on a lacrosse-only stadium for a lacrosse team that isn't even competitive in conference play? The donors gave you the money!", "label": 0}
{"text": "Yep. Trevor Wilson's error ended up being what cost us in the end, sure, but we had 13 minutes of football to play after that incident.", "label": 0}
{"text": "If he can't see the obvious problems and attempt to fix them, it'll never get any better", "label": 0}
{"text": "Are you blaming House or are you blaming the athletic directors?", "label": 0}
{"text": "Did you guys kidnap Jalen Hurts or something", "label": 0}
{"text": "Gonzaga", "label": 0}
{"text": "I mean, the good news is that you’re playing us, so you’ll probably win. The bad news is that a win probably isn’t what you’re looking for if you want to get rid of your coach.", "label": 0}
{"text": "Yo, I’ve been following you since the TFTS days and never realized you were an Aggie. Gif ‘em.", "label": 0}
{"text": "Boots aren’t that big", "label": 0}
{"text": "I mean he’s 35-1. He’s still not close.", "label": 0}
{"text": "My point is thinking a coach being scared makes a damn bit of difference in whether or not they'll succeed is laughable. Even DeBoer admitted it was a tall task to follow in Saban's shoes.", "label": 0}
{"text": "There may be a tasteful way, but even if Aggies did it right celebrating anything other than a chip will bring haters. Haters gonna hate", "label": 0}
{"text": "Literally anything to keep New Mexico State out of the conference.", "label": 0}
{"text": "5+ rings in what time frame is your definition of a dynasty?  Because has any one coach achieved that besides saban? ", "label": 0}
{"text": "Not everything in life has to follow a cutthroat profit margin philosophy. It's like when I hear morons talk about how the USPS should be shut down, its not meant to be a for-profit entity, its a fucking public service specifically talked about in the Constitution. I don't want to hear you bitching when we lose to China in every Olympics starting in about a decade.", "label": 0}
{"text": "I'd probably assume the committee puts a 12-1 MWC champ UNLV with a win over Boise over them, too. Quite possibly a 12-1 SBC champ Louisiana or ULM, too.", "label": 0}
{"text": "Man that feels like it was *decades* ago.", "label": 0}
{"text": "I mean, c'mon, that's not how any of this works. They have x amount of money to operate on, short of an unexpected donation from a booster. That amount of money either is enough to buy out Neal and his staff *and* pay a competitive salary to a new coach and his staff. Obviously that's not all necessarily paid in one lump sum overall, but the school has to obviously be able to may the payments as legally agreed upon in any contract. \n\nAgain, unless someone is ponying up an unexpected donation (and it's not **entirely** out of the equation, though unlikely) whether we lose the money later or not makes little difference if the money simply isn't there. \n\nOutside of that, if the Mountaineers made an exciting hire, the fans will come back until it that candidate either goes elsewhere or fails. WVU and Marshall sports are what West Virginia, as a state, has. That, and pretty scenery. There is little else and there will *always* be a strong home market if the team is at all competitive.\n\nThe buyout is going to be much easier to swallow after next season. We are, unfortunately, probably stuck with him through then. Hoppy Kercheval and Mike Cassazza are both reporting the same, and they're WVU's most plugged in reporters.", "label": 0}
{"text": "Its an older meme, sir, but it checks out.", "label": 0}
{"text": "And then promptly say nothing for four years.", "label": 0}
{"text": "I don’t see harm in any school doing this. Qualifying for the CFP, even in the 12+ team era, should be a sense of pride for any school. Many “blue bloods” might not do this, but it’s no different than hanging a Sweet 16 banner at a basketball arena.", "label": 0}
{"text": "No, a lot of people don't, otherwise you would see track meets on Sundays and not the nfl, and see swim meets on saturdays instead of other sports. The evidence is right in front of your face.", "label": 0}
{"text": "How long of violating literally every athlete's rights is long enough?\n\nThe NCAA has been violating antitrust law for over a century.\n\nThey've had 40 years since Oklahoma won their antitrust suit to realize the exact same writing was on the walls for athletes.\n\nThey've had 15 years since Ed O'Bannon first filed suit.\n\nEven more lawsuits since then are not the problem. The NCAA was not rushed into anything.\n\nAnd, to be clear, there is no \"middle ground\" on athlete income from outside sources. If anything, the NCAA should be *encouraging* boosters paying for play to lighten the load on revenue sharing and Title IX compliance.", "label": 0}
{"text": "Jimbo Fisher come on down!", "label": 0}
{"text": "Nah nvm then fuck oregon", "label": 0}
{"text": "Hard agree with you. Lived here 7 years. Nice little city with a pretty good food scene, OK night-life, and trash sports teams (for now, hopefully).\n\nNot even remotely close to cities like NYC, Seattle, etc.", "label": 0}
{"text": "We have nothing, so I'd hope so", "label": 0}
