{"text": "Thankfully your group is getting smaller and smaller. Probably in fifty years i imagine byu won’t survive incoming lawsuits", "label": 1}
{"text": "This is edging toward hate speech my friend.", "label": 1}
{"text": "2nd biggest oof in college football history", "label": 1}
{"text": "I would argue biggest.", "label": 1}
{"text": "Uhhh think harder", "label": 1}
{"text": "or the Mountain Meadow Massacre?", "label": 1}
{"text": "What is your point buddy?", "label": 1}
{"text": "Maybe his memory's a little sandusky, I mean dusty", "label": 1}
{"text": "you decide which is less justifiable. Murdering 120 civilian settlers while trying to pass it off as Indian violence? or murdering 17 civilians to drive off a cult group that were trying to become the Rajneeshees of 1838?\n\nhttps://en.wikipedia.org/wiki/Mountain_Meadows_Massacre\n\nhttps://en.wikipedia.org/wiki/Hawn%27s_Mill_massacre", "label": 1}
{"text": "You still aren’t being explicit in your meaning - what are you trying to say?", "label": 1}
{"text": "Good. Don’t play for a POS coach who hasn’t done anything. You reap what you sew! The entire program should be eliminated from the earth. Fuck every last one of them and their momma", "label": 1}
{"text": "Yes I did. Fuck Colorado and their fucking joke of a program. Hope all those animals die", "label": 1}
{"text": "It’s hilarious because even when the final NoA evidence clears and is released detailing just how elaborate the cheating was and how large of an on field advantage it garnered, people will still try to explain it away. The poster above said it best. Michigan cheated and will have it all come back. Full stop", "label": 1}
{"text": "Miami is trash", "label": 1}
{"text": "Your season is trash stop it.", "label": 1}
{"text": "Umm Thamel got that from the ncaa loll. Michigan had not even had the draft yet when Thamel leaked it", "label": 1}
{"text": "It’s wild how bad they were/are in the season before and after the cheating. Imagine being so delusional to think the cheating wasn’t one of the reasons they won.", "label": 1}
{"text": "Sucks, should have been killed in the womb", "label": 1}
{"text": "lol gay", "label": 1}
{"text": "Wow", "label": 1}
{"text": "I said what I said and I stand by it proudly.", "label": 1}
{"text": "Damn, man.", "label": 1}
{"text": "Why would you stand by that statement? - BC fan", "label": 1}
{"text": "Hope that ref tears his ACL too", "label": 1}
{"text": "Funny how things work out like that!", "label": 1}
{"text": "They’re waiting for CU to take a couple 5* from you guys", "label": 1}
{"text": "That’s impressive! Jeanty’s been running wild all season. UNLV really stepped up defensively.", "label": 1}
{"text": "It’s very possible… and stick with me on this… you’re just a douche bag", "label": 1}
{"text": "Andre Ware, is that you?", "label": 1}
{"text": "That’s fundamentally bullshit, but go off, king of the douchebags", "label": 1}
{"text": "Navy must be inspired by a certain former President. They are shitting themselves.", "label": 1}
{"text": "They have concepts of a plan. (Sorry Navy bros, had to)", "label": 1}
{"text": "I’m the reason you hate everyone lmao go to therapy", "label": 1}
{"text": "Flair up 😎", "label": 1}
{"text": "get a girlfriend", "label": 1}
{"text": "Coward", "label": 1}
{"text": "It's your Mom, I'm your father. Go to your room, you're grounded mister.", "label": 1}
{"text": "you can figure out by my nam…\n\noh wait, Oklahoma education. my bad", "label": 1}
{"text": "touch a female", "label": 1}
{"text": "typical oklahoma fan behavior", "label": 1}
{"text": "i have", "label": 1}
{"text": "Kyle from Alabama sounds like a weak man", "label": 1}
{"text": "Y r u so angree my child?", "label": 1}
{"text": "unlike you folk down in Mississippi we dont do that shit with family members", "label": 1}
{"text": "that’s…a good try, buddy", "label": 1}
{"text": "Seth Litrell was a fucking terrorist", "label": 1}
{"text": "here, you should give this a read before you comment in this sub again: https://www.liveabout.com/football-101-the-basics-of-football-1333784", "label": 1}
{"text": "I’d suggest you read [This](https://www.elitesingles.com/relationship-advice/how-to-talk-to-women) before the next time you touch grass", "label": 1}
{"text": "But when he is cold I nearly hit my wife..", "label": 1}
{"text": "Hahahahaahahhaahha", "label": 1}
{"text": "you’re beating fucking Nebraska by one score", "label": 1}
{"text": "Actually your mother will be coming over to spit shine my boots", "label": 1}
{"text": "Hahahahahaha enjoy being alone. Sit with your dumb ass thoughts. Sent you some support you really need it.", "label": 1}
{"text": "Hahaha I thought it was pretty funny but your mom found it distasteful. The thing you sent me, that is", "label": 1}
{"text": "Are you actually 11 with the mom jokes. You clearly have had zero socialization.", "label": 1}
{"text": "Reddit is not real life my guy. You’re on here posting pictures of your watches talkin bout other people don’t have socialization", "label": 1}
{"text": "Fat 😂😂 the projection", "label": 1}
{"text": "Hahahaha enjoy being alone tonight I’m not replying anymore. Just get friends you won’t be like this.", "label": 1}
{"text": "Indiana is gonna absolutely rape us lol", "label": 1}
{"text": "Hey bandwagon GT fans, this is what a fucking rebuild looks like. The fact that after the nightmare of Geoff Collins that we are immediately bowl eligible and have made significant strides this year despite the r most brutal schedule is fucking incredible.\n\n I was on campus for the 2014 OB run and had season tickets during the Geoff Collins nightmare this team would have been a playoff contender in 2014. \n\nGo fuck yourselves and let me enjoy watching a team rebuild its fundamentals and celebrate the little victories in the most brutal sport.", "label": 1}
{"text": "We have bandwagon fans?", "label": 1}
{"text": "Bros writing a novel and isn’t even flaired up.", "label": 1}
{"text": "this might be one of the most ridiculous comments i’ve ever seen in a georgia tech game thread and that’s saying something.\n\nthis program fucking sucks, can you tell me a single bandwagon fan you see? why is anyone hopping on this lol\n\ncan you tell me one significant stride we made this year? we look worse in basically every aspect of the game, play horribly undisciplined football and give away games.\n\ncall it rebuilding but this is getting to the point we are seeing such poorly coached football that it’s getting harder and harder for anyone with any football iq to believe we can turn a cornee", "label": 1}
{"text": "The fans that have started to come out of the woodwork saying to fire Brent key and Faulkner immediately. \n\nWe can take our time and be like Clemson or Kansas State or we can be like Nebraska or A&M and fire ourselves into being worse than Kansas was in the late 2010’s.", "label": 1}
{"text": "Look at where our defense was last year and where it is this year.\n\nYes, faulkner’s scheme has been figured out. We need some more creative playcalling and more use of jet sweeps to get the ball to Rutherford and Singleton in stride. But fucking Christ, we were predicted to go 6-6 or 7-5 this year.", "label": 1}
{"text": "Ryan fuckhead is a nepo baby and urban is his daddy", "label": 1}
{"text": "Ole Miss defense calls themselves the Landsharks \n\n>At Ole Miss, Landshark is a term that was first adopted by the Rebel football team’s defensive unit. As part of that identity, defensive players celebrate big plays by putting a hand to their forehead in the shape of a shark fin. A battle cry of “Fins Up” also contributes to the players’ persona.\n\n>Roots of the Landshark at Ole Miss date back to 2008. After four straight losing seasons, the Rebel football team returned to national prominence with a 9-4 record and a victory over No. 7 Texas Tech in the Cotton Bowl. Leading the charge was a defensive squad that ranked fourth in the nation in rushing defense and included All-American Peria Jerry and eventual All-SEC standout Jerrell Powe. The term Landshark originated that season from senior linebacker Tony Fein, an Army veteran who served a one-year tour in the Iraq War before arriving in Oxford. A two-year letterman after transferring from Scottsdale (Ariz.) Community College, Fein was the 2008 recipient of the Pat Tillman Award by the Military Order of the Purple Heart.\n\n>Fein passed away in October 2009, but his legacy at Ole Miss continues through the Landshark.", "label": 1}
{"text": "The election is bisexual", "label": 1}
{"text": "hit a nerve 😉 \n\nnot as fun stalking a reddit account when the guy on the other side of it is better than you, huh?", "label": 1}
{"text": "Indeed. \n\nAnd I'm reasonably unbiased as I always vote 3rd Party.", "label": 1}
{"text": "Sure buddy", "label": 1}
{"text": "congrats on finding a woman who would put up with 17% body fat!", "label": 1}
{"text": "B1G definitely made Raiola throw a game-sealing interception after a bullshit targeting call against what should have been an Ohio State fumble recovery.", "label": 1}
{"text": "also having to use your wife to step up past my own personal income…real boss move 🤣🤣🤣", "label": 1}
{"text": "Hey we believe the son, whether he’s biological or not.", "label": 1}
{"text": "The duck$ flexing their muscles against a basketball school", "label": 1}
{"text": "Moron is a harsh thing to say. I am not sure that's even within the rules of this sub.", "label": 1}
{"text": "Ped st is gon show ohio that their 20million dollar team is mid", "label": 1}
{"text": "Why tho?", "label": 1}
{"text": "Oklahoma QB has been sacked 18 times in the past 2 games", "label": 1}
{"text": "******unless you have Longhorn flair", "label": 1}
{"text": "and 25 in 3 games", "label": 1}
{"text": "I’m sorry you were depressed by something you made up 💔", "label": 1}
{"text": "If Oregon wins the title this year I might commit Sudoku", "label": 1}
{"text": "lol", "label": 1}
{"text": "thanks pal. wish I did make it up", "label": 1}
{"text": "Seppuku? Sudoku is the game", "label": 1}
{"text": "Not sure if that’s intentional or the most magnificent of autocorrects.", "label": 1}
{"text": "Your love of numbers will cause me to commit Seppuku", "label": 1}
{"text": "That’s the joke. ", "label": 1}
{"text": "Sudoku might be torture for him", "label": 1}
{"text": "Oh. I don’t get it. Sorry.", "label": 1}
{"text": "But what if they were really bad referees?", "label": 1}
{"text": "No one contested that, dumbass.", "label": 1}
{"text": "We’re going to have to change our logo to a 1", "label": 1}
{"text": "I mean, you’re an official, right? I mean, you have to stand on the sideline and determine if your wife sucks Ryan Day’s cock correctly.", "label": 1}
{"text": "I mean, according to most evangelicals, the president is catholic so really the pope runs the country", "label": 1}
{"text": "Someone’s feelings are hurt, is this Malachi Moore’s burner?", "label": 1}
{"text": "Nice bait.", "label": 1}
{"text": "Nice bait.", "label": 1}
{"text": "Do you think all of you are this braindead or are you a special case?", "label": 1}
{"text": "Nice bait.", "label": 1}
{"text": "Definitely all of you, enjoy your third loss!", "label": 1}
{"text": "Nice bait.", "label": 1}
{"text": "Impossible, she’s in the bathroom flushing her crimson tide", "label": 1}
{"text": "You weren’t the first and won’t be the last to pull that shit", "label": 1}
{"text": "You say \"Jennifer McCormick couldn't name one thing she disagrees with Hillary Clinton on\" like it's a bad thing.\n\nWhen has Hillary Clinton been wrong about *anything*?  Other than saying \"half\" when she should have said \"all\"?", "label": 1}
{"text": "Libya sort of springs to mind.", "label": 1}
{"text": "what if it’s for violence in minecraft is that allowed", "label": 1}
{"text": "I know the joke. But… this has great academically prowess vibes.", "label": 1}
{"text": "I don't think anyone believes he is a republican", "label": 1}
{"text": "Are oregon fans always so whiny?", "label": 1}
{"text": "hmm. you explaining why you threw trash? Do you think that makes it ok?", "label": 1}
{"text": "Might be the first post both sides agree on… oh and the Sark relapsing post. Yikes.", "label": 1}
{"text": "He's kinda like a more likeable Manziel/Mayfield. But after leading Vandy to their first AP ranking since 08 I wouldn't even say it's cocky, more like self confident, which I think is a really good quality to have in a qb", "label": 1}
{"text": "This is tame as fuck compared to what I'm gonna have to read in our post-game thread with them tonight lol", "label": 1}
{"text": "If we’re getting beat like this, gotta play rough and dirty. Start going for knees, follow through on all hit. etc. Make them remember you if you can’t beat them and beat them up for next week. ", "label": 1}
{"text": "OP probably had the good sense to delete it.", "label": 1}
{"text": "No. Absolutely fucking not.", "label": 1}
{"text": "Next week is a bye", "label": 1}
{"text": "Yes. I’m tired of playing nice. That player should have gotten lit up on that lateral play. ", "label": 1}
{"text": "You idiots would huh?", "label": 1}
{"text": "No but 1)I was sitting near people who were and 2) I have more than one braincell", "label": 1}
{"text": "wow waco and mormon\n\npick a cult", "label": 1}
{"text": "His foot on the ground? Dfq u smokin bruh", "label": 1}
{"text": "Fuck these refs \n\nFuck Texas", "label": 1}
{"text": "Fuck you too", "label": 1}
{"text": "Cry", "label": 1}
{"text": "Scoreboard", "label": 1}
{"text": "uhhh we’re winning right now", "label": 1}
{"text": "Definitely think he's across the plane when his foot is out. \n\n\nAlso no one downvotes like the cousin fuckers from the 51st best state. ", "label": 1}
{"text": "Cool, you beat us. That doesn’t matter anymore. \n\nSee you in the post season, hope you win out so your coach isn’t crying on tv both before and after the game again.", "label": 1}
{"text": "But Mississippi isn’t playing", "label": 1}
{"text": "Get fucked", "label": 1}
{"text": "Also if you gonna talk smack you better flair up", "label": 1}
{"text": "Stop I’m gonna bust", "label": 1}
{"text": "wtf is your problem man", "label": 1}
{"text": "🧐🧐🧐🧐🧐 excuse me", "label": 1}
{"text": "I don't even think about you.", "label": 1}
{"text": "Bowflex, little boy", "label": 1}
{"text": "I did not realize how active toxic oregon fans were. For some reason, I stupidly thought they limited themselves to Colorado threads. Not sure why I was dumb to think they didn't expand that to their own threads.", "label": 1}
{"text": "Flair up biotch.", "label": 1}
{"text": "Bruh you're flair is CNBC", "label": 1}
{"text": "Flair up kid", "label": 1}
{"text": "CNBC flairs the most toxic", "label": 1}
{"text": "What do you mean by toxic?", "label": 1}
{"text": "u good", "label": 1}
{"text": "[*checks post history*] \n\nmhmm sure bud", "label": 1}
{"text": "Are you making a post complaining about people responding to how dumb your last post was.", "label": 1}
{"text": "Dam buddy, you had one bad take on targeting.", "label": 1}
{"text": "Mirror", "label": 1}
{"text": "Point", "label": 1}
{"text": "That is a white guy who would do this for free just to be able to scream at a young black man. ", "label": 1}
{"text": "Get your race baiting out of here", "label": 1}
{"text": "Lmao cool down it's not like he's a cop", "label": 1}
{"text": "Oh STFU.", "label": 1}
{"text": "😭😭😭😭", "label": 1}
{"text": "Refs are gay", "label": 1}
{"text": "hahahah fuck you vanderbilt!!", "label": 1}
{"text": "Texas struggling to beat Vandy LOL.", "label": 1}
{"text": "you say this as if Vandy isn’t good", "label": 1}
{"text": "Is your school accredited? ", "label": 1}
{"text": "Did you forget that Vandy beat #1 Alabama lmfao.", "label": 1}
{"text": "There 25th and Texas was number 1 as of last week.", "label": 1}
{"text": "tExAs Is BaCk", "label": 1}
{"text": "Vanderbilt is excellent?", "label": 1}
{"text": "You obviously don't know ball", "label": 1}
{"text": "Texas is 5th and the 25th team in the country is still good", "label": 1}
{"text": "I wouldn’t call #25 excellent.", "label": 1}
{"text": "Show us exactly where you're at on the spectrum?", "label": 1}
{"text": "tExaS Is BaCk, I can hear you crying through the screen.", "label": 1}
{"text": "Oh noooo we lost to a team that has won the last 2 out of 3 nattys what will we do nooooooo", "label": 1}
{"text": "Vandy won’t even be ranked tomorrow lol", "label": 1}
{"text": "Idc what anyone says, this Vandy team is top 20, they just have a very hard schedule.", "label": 1}
{"text": "I genuinely would. Over 160 FBS schools and the press thinks you're among the top 25? If you're not one of the established elite teams, that's progress. And for Vandy, that's fantastic.", "label": 1}
{"text": "I can hear you crying through the screen.", "label": 1}
{"text": "Dude. You had 30 minutes to make a decision wtf was that", "label": 1}
{"text": "Having lived in PA, never met a school as happy to deny child r*pe as penn state. Big Catholic Church vibes. Let’s go Wisconsin", "label": 1}
{"text": "Yes Army commercial, you serve the people of the United States and it's constitution. Remember that in a few weeks", "label": 1}
{"text": "Vote red?", "label": 1}
{"text": "Mich St: Mid defense, mid offense\n\nMich: decent defense, shameful offense\n\n\nDid I get this right?", "label": 1}
{"text": "They could have not covered it up for years first", "label": 1}
{"text": "Penn State and covering for monsters", "label": 1}
{"text": "He’s talking about the two dudes kicked off the team this year. Not Sandusky", "label": 1}
{"text": "Was he in the library, reminding everyone to keep quiet", "label": 1}
{"text": "that’s not why we hate u", "label": 1}
{"text": "Let's vote that asshole out.", "label": 1}
{"text": "The sky is blue", "label": 1}
{"text": "He has to distract that after 12 years in the Senate he hasn't passed anything", "label": 1}
{"text": "Happy for you dawg", "label": 1}
{"text": "Every other commercial for me is the ‘two high chairs’ one", "label": 1}
{"text": "Please! Like I don’t want to talk about politics on a cfb discussion but it’s just nonstop", "label": 1}
{"text": "Hold your nose, put a kazoo in your mouth and talk about trans kids.\n\nYou are now Ted Cruz.", "label": 1}
{"text": "But didn’t you know, Ted Cruz is gonna save us from people that just wanna live their lives just like he saved us from Cancun!", "label": 1}
{"text": "You forgot book a trip to Cancun", "label": 1}
{"text": "Please.", "label": 1}
{"text": "He has nothing else.", "label": 1}
{"text": "People surprised at political ads in Texas - these same people were obsessed with their kids catching the gay in 2004.\n\nThen they pretended like they were okay with LGBT people for a while.\n\nBut they need to excite their voters, hence the same attack  in every ad.\n\nThey never stopped being bigots.", "label": 1}
{"text": "I mean supporting trans people in Texas isn’t a popular position", "label": 1}
{"text": "MONKEY DONT CRAMP!", "label": 1}
{"text": "Rule 8 - No CFB-unrelated politics or religion\n\nKeep it to yourself.", "label": 1}
{"text": "If it was that unanimous the ads wouldn’t have been made.\n\nWe’re surrounded by bigots, and we’re slowly gaining the majority.  There’s still a lot of bigots that vote.", "label": 1}
{"text": "Stay in Cali pretty boy", "label": 1}
{"text": "That and forcing your kids to change gender at a young age", "label": 1}
{"text": "What the fuck is with these Trans people political ads Jesus tittyfucking christ", "label": 1}
{"text": "THEYRE COMING FOR YOUR KIDS /s", "label": 1}
{"text": "It was late moron", "label": 1}
{"text": "You’re a moron", "label": 1}
{"text": "Flair up", "label": 1}
{"text": "The number of these ads focusing on trans stuff is fucking annoying", "label": 1}
{"text": "Real penn state fans are not surprised", "label": 1}
{"text": "MEN IN GIRLS LOCKER ROOMS", "label": 1}
{"text": "For real like PLEASE. I'm not even good at sports", "label": 1}
{"text": "I hope Drew Allar is okay 3 hours from now.", "label": 1}
{"text": "Trying to turn “they/them” into the enemy is disgusting.", "label": 1}
{"text": "PSU fans in the first quarter: super friendly\n\nPSU fans in the second quarter: WE SUCK ASS, BUT ALSO ALL PENALTIES AGAINST US ARE LIES, BUT ALSO WE'RE FRAUDS, BUT ALSO [INSERT CLEAN PLAY] WAS CLEARLY A PENALTY BY WISCONSIN", "label": 1}
{"text": "And this is what I envision when I think of a Wisconsin fan lol. A drunktard idiot", "label": 1}
{"text": "We literally are living in a time when fully grown adults are crying over a presidential election not going their way 4 years later. It does not surprise me in the slightest that osu fans will cry over losing for 3 years LMAO. \"caught cheating\" is wild coping too.", "label": 1}
{"text": "Ped State are pretty notorious for their groupthink", "label": 1}
{"text": "Dysphoria is a recognized medical condition, and treating it is healthcare. Moreover, FAR fewer people are getting SRS than you think. We are so few of the population and are bullied by others.", "label": 1}
{"text": "At least knock him outta the game if you're gonna go for it", "label": 1}
{"text": "Get #7 an automatic transgender surgery", "label": 1}
{"text": "Daily reminder that the State program is trash and full of trash people still (inb4 \"B-b-but the grainy iPhone videos!!1!\")", "label": 1}
{"text": "Fuck off", "label": 1}
{"text": "Your football building is named after a rape enabler.", "label": 1}
{"text": "someone please just hit this kid, i want to see their QB not be so fucking confident", "label": 1}
{"text": "And you guys cheated so will call it even", "label": 1}
{"text": "This was in reference to the targeting, BTW.", "label": 1}
{"text": "i said hit, not injure", "label": 1}
{"text": "Cut him some slack, he hasn’t killed anyone at LSU", "label": 1}
{"text": "Is turner special?", "label": 1}
{"text": "Yet", "label": 1}
{"text": "Damnit Wisconsin, don’t let the Fighting Sandusky’s go into the shoe undefeated.", "label": 1}
{"text": "Ask not for whom the truck stops, it stops for THEE", "label": 1}
{"text": "Die in a fire", "label": 1}
{"text": "FSU fans after getting their shit pushed in:\n\n“Oh yeah well you probably won’t win the natty and your QB might not win the Heisman! 😡😡😡”", "label": 1}
{"text": "douchebot", "label": 1}
{"text": "Why wouldn’t I hope for that?", "label": 1}
{"text": "Every time I see that I just imagine the swirl of conversations going on in his headset and he just has nothing to add", "label": 1}
{"text": "Mods plz ban, you’re a loser btw", "label": 1}
{"text": "Salty Utah fan. Hold that L big dawg", "label": 1}
{"text": "Hopefully he died of a heart attack… Utah twitter fans can get wrecked", "label": 1}
{"text": "Just checked his page. He's in his feels", "label": 1}
{"text": "Y u haf 2 b mad? Iz only game.", "label": 1}
{"text": "hope those precious sparty/buckeye reddit upvotes were worth it, idiot. ", "label": 1}
{"text": "Is this a bible reference?", "label": 1}
{"text": "FSU fans got super pissy in here at the end, you can go hate-fuck your sisters and/or daughters now.", "label": 1}
{"text": "We get fucked every time and Texas gets their Texas sucked every time… but we hit that dude just sayin", "label": 1}
{"text": "grow up", "label": 1}
{"text": "This is incredible. True art ", "label": 1}
{"text": "https://www.yourdailypoem.com/listpoem.jsp?poem_id=2118", "label": 1}
{"text": "[Knowest thou not thy 16th century English poetry?](https://en.wikipedia.org/wiki/Devotions_upon_Emergent_Occasions)", "label": 1}
{"text": "New coaches same dirty pieces of shit, Fuck state", "label": 1}
{"text": "Trash ass sparty as usual. Low life losers", "label": 1}
{"text": "Loveland started it you fucking baboons.", "label": 1}
{"text": "Fuck transphobes and fuck commercials. That’s all.", "label": 1}
{"text": "tonight was absolutely insane. i had a gun pointed at me; but then i changed my mind", "label": 1}
{"text": "I cannot fucking wait until after Nov 5th.", "label": 1}
{"text": "The mute button has rarely gotten a workout like it did tonight", "label": 1}
{"text": "Hey something I can agree with", "label": 1}
{"text": "Are you crying", "label": 1}
{"text": "I’m sure you think the 2 michigan players deserved to get jumped by 8 MSU players ago too lol. Y’all have a history of jumping people, just own it bitch", "label": 1}
{"text": "Hahaha you’re still here? Betas gonna beta", "label": 1}
{"text": "Damn you dumb", "label": 1}
{"text": "Sounds good man. Don’t let it affect your sleep tonight", "label": 1}
{"text": "I'm way more alpha than you could ever dream of", "label": 1}
{"text": "Couldn’t get into Michigan, so obviously don’t grind", "label": 1}
{"text": "The domestic abuse rate in Alabama is going down this week", "label": 1}
{"text": "ugh the worst part about this game is that you KNOW Ted Cruz is going to make a Marcel Reed reference at his next speech", "label": 1}
{"text": "u/NoleBullis", "label": 1}
{"text": "If you don't like that, you don't like Neal Brown football.", "label": 1}
{"text": "But I want to talk about something very important. hUgely important. That Arnold Palmer was all man", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Come talk to me on November 30th with your little poverty team, you fucking bum.", "label": 1}
{"text": "Ngl if he had an OF where he sang acapella Creed covers I’d peep", "label": 1}
{"text": "BKK1S\n\nBrian Kelly Killed (at least) 1 student", "label": 1}
{"text": "If they acted like you then they did deserve it", "label": 1}
{"text": "No I think they don't want to show the refs affecting the outcome of games so blatantly.", "label": 1}
{"text": "You're a hero", "label": 1}
{"text": "u/Piano_Fingerbanger can suck my maroon and white cock", "label": 1}
{"text": "The Swamp Kittens are cordially invited to suck that Aggie dick, bitch", "label": 1}
{"text": "I remembered this. What's up t-sip bitch?", "label": 1}
{"text": "That fraud doesn't come around anymore", "label": 1}
{"text": "GOOD", "label": 1}
{"text": "Lmao. Gonna have a hard time winning games with a dude that can’t complete a forward pass. Teams will stack the box and make him beat them over the top and he won’t be able to.", "label": 1}
{"text": "You should get that checked out", "label": 1}
{"text": "When they finally decide to stop being Semenholes", "label": 1}
{"text": "Better than having a hitler lover as the starting running back", "label": 1}
{"text": "oh my god this is the third political ad in the row kill me", "label": 1}
{"text": "TOO RADICAL FOR TEXAS", "label": 1}
{"text": "Oh no! Please don’t make me as a UM fan relive the 2022 season!", "label": 1}
{"text": "plenty of trash you can talk without venturing into racism", "label": 1}
{"text": "This makes me sad. Nothing against you- just that good poetry is so little known.", "label": 1}
{"text": "Listen to us tell bald faced lies! Dont vote for the guy who isn’t going to actually do anything we say he will!", "label": 1}
{"text": ":-O", "label": 1}
{"text": "3 straight", "label": 1}
{"text": "You almost lost to Matt rhule. Go bitch about lou holtz some more.", "label": 1}
{"text": "Hey be nice. They have lower academic standards", "label": 1}
{"text": "Where did this meme originate", "label": 1}
{"text": "Better luck with your relationship problems Walmart wolverine :(", "label": 1}
{"text": "What the fuck are you even talking about", "label": 1}
{"text": "Damn right we aren't orange", "label": 1}
{"text": "Looks like the MSU player swung at him and hit him the head which started it all. [https://www.youtube.com/watch?v=SdCT-z4HLag](https://www.youtube.com/watch?v=SdCT-z4HLag)", "label": 1}
{"text": "-21", "label": 1}
{"text": "Cal also gave CU their only win in the legendarily bad 2022 season. \n\n\nCal just fully believes in progressive policy and wants to give wins to teams experiencing winless seasons. ", "label": 1}
{"text": "https://olympicstreams.co/nevada-vs-hawai-i-live-stream/1/\n\nworking stream if ur in hawaii", "label": 1}
{"text": "Mullings?", "label": 1}
{"text": "Huge di.. I mean putter", "label": 1}
{"text": "reported.", "label": 1}
{"text": "i want to jerk off", "label": 1}
{"text": "Got you", "label": 1}
{"text": "No need to get personal and start the personal attacks", "label": 1}
{"text": "It's wild I'm watching other states political ads", "label": 1}
{"text": "Looks like you shared the wrong link bub. ", "label": 1}
{"text": "Heisman declarations are wild in a mw game after 0200 eastern time not involving wussy state, which I just learned is something opposing crowds may chant.", "label": 1}
{"text": "Yeah none of that embellished stuff is hanging out in my head, it does sound like you're carrying it around rent free. Stay classy with your wife beating and cheating coaches too", "label": 1}
{"text": "Wussy state?? Lol", "label": 1}
{"text": "I’d just like to invite r/CFB to kiss my ass.", "label": 1}
{"text": "We should start a line to make it easier for them", "label": 1}
{"text": "Talk yo shit king!", "label": 1}
{"text": "Both cheeks pls r/cfb", "label": 1}
{"text": "<3", "label": 1}
{"text": "SKO BUFFS BITCHES!", "label": 1}
{"text": "DO YOU BELIEVE NOW?!?!", "label": 1}
{"text": "This is basically a nuke to this sub. Go back to the early season posts, people here were completely insufferable about how trash CU would be. ", "label": 1}
{"text": "Fuck all the r/CFB haters!  Y’all don’t understand the shit we’ve been through!  Outside of 2016, basically 20 years of garbage.  Coach Prime resurrected us!", "label": 1}
{"text": "2016 was the weirdest, most fun I’ve had as a Buffs fan. Yea it helps that it was my senior year and I turned 21 that summer prior, but goddamn the town was electric for about 15 weeks.", "label": 1}
{"text": "Can you imagine the wealth tax Elizabeth Warren would give to the SEC?", "label": 1}
{"text": "Don't forget the game where Shedeur trashed his OLine and the whole sub said that his OLine wouldn't block for him and that the team is lost and Deion is going to get fired.\n\n\nThis sub was wild with the haters.", "label": 1}
{"text": "You found some good ones lol especially the guy talking about there will be a documentary on Deions failure ", "label": 1}
{"text": "Really? This took two seconds: https://www.reddit.com/r/CFB/comments/1f4g5ss/game_thread_north_dakota_state_colorado_800_pm_et/lkm6tis/", "label": 1}
{"text": "Peoples opinions can change. But I take back anything kind I said about Colorado. Fuck Yall lmao.", "label": 1}
{"text": "You made several disparaging comments - gonna delete those too? Have a nice night and rest of your weekend!", "label": 1}
{"text": "Nope. I stand by them. Goodnight sweetheart.", "label": 1}
{"text": "Yeah I get it. But I wasn’t alive in 1927 and I still know the ‘27 Yankees were a wagon and probably the greatest team of all time. As someone who has seen all the good CU teams I hate that the younger generation thinks that 2016 team was the one to aspire to. They were fun and won the games they should have for sure. But getting absolutely dump trucked in the last 2 games showed that they were a bit fraudulent. CU used to compete for national titles after all", "label": 1}
{"text": "You literally stalked their profile unprovoked? Jesus dude get help.", "label": 1}
{"text": "Yep you are right.  Hopefully CU winning has purged this Form of the little cock roach haters.", "label": 1}
{"text": "I remember a thread in the off-season that was like “What unpopular opinion did you have where you were proven right?” And one highly upvoted comment was “That Deion would be ass.”\n\nPeople weren’t just predicting he’d fail. They were already doing victory laps about how he had already failed.", "label": 1}
{"text": "Nobody is replying to your WRONG comment because they could most likely care less what some ohio fan has to say about anything LOL you guys are all obsessed with Michigan.", "label": 1}
{"text": "The most accurate words to describe the way this sub has behaved when it comes to Colorado would almost certainly get you banned for saying them.", "label": 1}
{"text": "Such a reddit comment", "label": 1}
{"text": "Report all you want, nothing was said that was racist or insensitive.", "label": 1}
{"text": "If a msu player can take his helmet off and hit another guy in the head and nothing happened to him then maybe you can suck this one up", "label": 1}
{"text": "That is an insane argument ", "label": 1}
{"text": "...He says, on reddit, in between desperate attempts to continue to pretend he isn't eating his own words on Colorado.", "label": 1}
{"text": "I’m not OP, pay attention to who you’re responding to if you’re going to be a miserable sod.", "label": 1}
{"text": "Oh, so are you now saying you *didn't* post a little ramble about Colorado's recruiting ranking and how he was gonna leave?", "label": 1}
{"text": "Please take a shower", "label": 1}
{"text": "So, you were. \n\nGood to have that established.", "label": 1}
{"text": "You'd think folks in Ann Arbor would have been celebrating their win (something they might not experience the rest of the season) but instead they spent their night mass downvoting an innocent Redditor.", "label": 1}
{"text": "That plus all the negative articles being posted here with way too much pearl clutching in the comments makes the buffs success even more hilarious. They thought the team was guaranteed to be worse than last year. ", "label": 1}
{"text": "Hey honest question how are you a fan of the most racist university in college football. Like are you proud they didn’t let black players play till 75. Or was the kicking out of the first black students that attended the university cool? What about all the building named after confederate generals?  It’s the winning right that’s why you’re a fan. Rolls eyes.", "label": 1}
{"text": "Cormani was the highest", "label": 1}
{"text": "And the traffic, campus police accidentally leaked that tons of extra routes will be closed for security. Plan on 3 hours getting from 322 to the stadium.", "label": 1}
{"text": "Wow, I love seeing mentally disturbed people like you out in the wild. Shine on you crazy diamond.", "label": 1}
{"text": "Former president?", "label": 1}
{"text": "Ahhh tells me everything I need to know. Racism is alive and well", "label": 1}
{"text": "Some would even say he is a loser", "label": 1}
{"text": "Anyone know where u/srs_house is right now? I'd like to hear his new take on Athlon as a publication.", "label": 1}
{"text": "Fairly ignorant take…cheat more, scum", "label": 1}
{"text": "And your obsessed with the Bobcats for some reason lol", "label": 1}
{"text": "But fuck the Oklahoma one more. At least I’m not a bigot", "label": 1}
{"text": "So true Coach", "label": 1}
{"text": "He did not, and Declan Sullivan's family has repeatedly asked people to stop this.", "label": 1}
{"text": "yes, but that has nothing to do with it.", "label": 1}
{"text": "lol it does but stay ignorant.", "label": 1}
{"text": "Hmm? My guy if I was truly salty about it, I would have deleted the comment lol.\n\nMeanwhile you're going off about the Ohio Bobcats and how people do care about what they have to say. You seem confused.", "label": 1}
{"text": "You’re racist huh?", "label": 1}
{"text": "suck my balls", "label": 1}
{"text": "Lmfao imagine trying to deflect to “tHe OhIo BoBcAtS” every time people call you ohio fans while at the same time using the chant O-H, I-O! It seems as if one of us is certainly confused ahahaha", "label": 1}
{"text": "Idk why this is such a hard concept for you to understand, but Ohio and Ohio State are two different schools. It would be weird to refer to Sparty as just \"Michigan\", right? But I guess under your logic...\n\nMichigan lost this weekend lol", "label": 1}
{"text": "Buddy you guys are referring to YOURSELVES AS OHIO WITH THE O-H, I-O chant LMAO what part of this is so hard to understand? Michigan State doesn’t refer to themselves by spelling out Michigan as their literal chant. You gotta be slow kid. And Michigan lost this weekend? What in the world are you talking about? Lmao", "label": 1}
{"text": "I’m not gonna repeat myself for the third time cuz you got your education or should I say lack of education in the state of ohio LMFAO a fanbase who chants OHIO suddenly gets confused when called an ohio fan with the childish response of “YoU MeaN tHe BoBcAts?🥴” ahaha cool story kid maybe one day your obsession with Michigan will end🥱", "label": 1}
{"text": "Again every time your rabid fanbase chants the word OHIO they must be rooting for the bobcats according to your pathetic logic😆😆😆😆😆😆😆😆😆😆is that enough emojis for you?", "label": 1}
{"text": "Exactly what point? You seem to argue with strangers despite you being wrong all day long. Looking through your comment history it’s just people proving you wrong constantly….. that doesn’t seem like a good point to end up at", "label": 1}
{"text": "Very interesting how your go to insult is always about self esteem. That seems to be a common insult from you. Also nobody buys a new tv every year nor am I talking about that. Having a decent tv for the thing you are super involved in seems like a decent idea… you need to hop off your high horse", "label": 1}
{"text": "Texas A&M is definitely on my bucket list of places I want to visit in my life", "label": 1}
{"text": "At no point did you ever specify it was a spare room tv… also there’s no reason to be watching there unless you don’t have control over your own house… once again have some self reflection and get off your high horse. There’s a reason why you aren’t liked in the comments you make. Maybe think about that", "label": 1}
{"text": "full name?", "label": 1}
{"text": " I’m a dumbass,too.", "label": 1}
{"text": "They pump each other.", "label": 1}
{"text": "i thought we were safe this week... nope!", "label": 1}
{"text": "Thanks, I hate it.", "label": 1}
{"text": "u/Piano_Fingerbanger no where to be seen!", "label": 1}
{"text": "Domestic violence jokes are so funny! Should have had him pull her out of the elevator by her hair like Ray Rice to really get the most out of their hilarious battered woman syndrome joke!", "label": 1}
{"text": "Yeah, an Ohio state grad, who won super bowls as a player, was our DL/ LB coach and coached the titans to the AFC championship game is a bad pick. \n\nI guarantee he wouldn’t need to talk about being “tough” every week. Not saying I agree with moving on from Day, but it’s really put up or shut up with this roster.", "label": 1}
{"text": "Please provide a link to where he said he’d be terrible at recruiting. He recruited when he was here. And I don’t think you can call what he did at Tennessee “terrible” 😂.", "label": 1}
{"text": "I thought that snipers in watchtowers were more of a Texas thing.", "label": 1}
{"text": "I'm curious, what part of this video had domestic violence?", "label": 1}
{"text": "Well, Battered Aggie Syndrome is a play on the very real Battered Woman Syndrome. Feel free to research it. Knew/know that I'm going to be downvoted into oblivion on every response to this so will include as much info as possible in this one comment and leave it there.\n\nThe signs of battered woman syndrome\n\nthink the abuse is their fault.\n\nhide the abuse from friends and family.\n\nfear for their life or the lives of their children.\n\nbelieve that the abuser is all-knowing and can see their every movement.\n\nhttps://www.healthline.com/health/battered-woman-syndrome\n\nI don't believe that this is an appropriate topic for a skit and makes light of a very serious issue. There are ways of making jokes about serious issues while validating the suffering of the victims but this does none of that. A great example is the \"because of the implication\" scene in IASIP about date rape. The joke makes clear that date rape is absolutely a real form of rape and that the perpetrators know exactly what they are doing and that it's not simply a misunderstanding.", "label": 1}
{"text": "Lol it's a long time joke within the aggie community. Has nothing to do with domestic violence. \n\nBattered is also a form of breading an object and deep frying it in cooking, they aren't joking about corn dogs in the sketch either.\n\nYou are about as soft as 10 ply if you think the 2 are connected.", "label": 1}
{"text": "You also do realize that BAS is abusing the man in this sketch too. Like your no fun having self is so far off on this attempt at a platform speech that you would need 10x binos just to see the start of a point.", "label": 1}
{"text": "Coming off the Jawan Howard experience is maybe not the time the throw stones about embarrassing basketball programs lol.", "label": 1}
{"text": "I think this dude doesnt know what Battered Aggie Syndrome is and assumed its about beating the girl actor. Idk.", "label": 1}
{"text": "What does that have to do with your guy assaulting there’s?", "label": 1}
{"text": "He’s a Michigan fan. They just deflect now and expect people to change the subject.", "label": 1}
{"text": "Freeze not going anywhere.you can't find nothing else to talk about.lmao🤣", "label": 1}
{"text": "*allegedly*", "label": 1}
{"text": "Michigan player assaults MSU coach. “Kick MSU out of the conference.”\n\nNew comers to the B1G, this is why you should always hate on Michigan fans. Truly the trashiest self righteous morons who can’t see how they aren’t the victims.", "label": 1}
{"text": "Roku is quite literally the most bottom tier streaming platform you could buy. It’s right next to fire stick….. ouchhhhhhhhhhh", "label": 1}
{"text": "Proof?", "label": 1}
{"text": "Shouldn’t you guys be gang beating two players in a tunnel?", "label": 1}
{"text": "Big talk from a school with a 90% acceptance rate lmao", "label": 1}
{"text": "The players were kicked off the team, right?", "label": 1}
{"text": "Suspended mostly. Do you have a clear video of mullings stomping? I have yet to see one. I did however see msu players beating a Michigan player with their helmets", "label": 1}
{"text": "Yeah. I actually do not believe any of them were kicked off the team.", "label": 1}
{"text": "And once again Roku channel is free and there is a reason it’s free it has channels nobody wants. Nobody with any type of money is watching the Roku channel…", "label": 1}
{"text": "Here is where you are talking about the platform of Roku….", "label": 1}
{"text": "I never said I was watching it lol I said I had a TV with a Roku DEVICE.  Lol your mommy bought you into college huh? Cuz there’s no way you got in on merit lololololll.  Of course, those Texas schools don’t really even have an admissions department?  Just accept everyone and take their money?  A&M undergrads: 60 THOUSAND LOLOLOLOLOLOLOL", "label": 1}
{"text": "Too soon", "label": 1}
{"text": "Taylor lewan was so dirty those games that they literally made a Tv commercial replay of all of his hits and choking that set off gholston. \n\nYou can always have a one sided view but you cannot feign ignorance at all of the dirty plays just because you are a fan of the team. Michigan is always taking the moral high ground position in all sports when they have just as many if not more on and off field problems in both Football and Basketball. \n\nWith regards to Michigan state, The players last year involved in the incident were all immediately kicked off the team or suspended for pretty much the entire season and were transfer portal guys with troubling pasts (actually one of the few times Tucker handled something properly and that’s saying something.)", "label": 1}
{"text": "Roku device…. which has a what UI? Ohhhh roku….. that’s right. What are you even talking about?", "label": 1}
{"text": "That's true. I was just responding to the guy above me acting as tho Gholston responded after Lewan (when really it was the opposite).", "label": 1}
{"text": "Just a reminder the moral Michigan still has a statue and building named after their rapist coach", "label": 1}
{"text": "More like touch ass (mine preferably get over here big boy)", "label": 1}
{"text": "Name checks out lol", "label": 1}
{"text": "uh username checks out?", "label": 1}
{"text": "Username checks out big time", "label": 1}
{"text": "Ohio state has a Ryan day problem", "label": 1}
{"text": "Lol you really think that means anything? That proves fault in who? All that says is someone got stepped on. Doesn’t explain who, doesn’t explain how. \nHey player, did you stomp on that person? \nNo, I didn’t. See how that works? \n\nlol dumb little bro at it again. Better luck next year!", "label": 1}
{"text": "10 wins should be the baseline for Michigan. Big 10 isn’t tough besides Ohio state every year. Truly the only capable loss Ohio state or Michigan has every year is each other.  Penn state should be a win because they are never on the level of Michigan or Ohio state. Big 10 is always a 2 man race with Ohio state and Michigan well maybe not now with Oregon now in the big 10 but still. There are gigantic differences in that confrence", "label": 1}
{"text": "Now this is an Oregon fan I can get along with", "label": 1}
{"text": "When were we sore losers? Like you said, every time you win every one just goes their separate ways. But when we win there’s a chance of getting jumped in the tunnel. And I’ll never buy the “he talked trash so he deserved to get beaten with helmets.” If you want to call colston a sore winner for the headbutt that’s more than fine", "label": 1}
{"text": "Who’s idea was it to let these guys in the big ten 😭", "label": 1}
{"text": "“Please, just keep on saying it’s the shittiest offense in college football. Please, just think we are gonna be so shitty next year. Please.” \n\n-Cade McNamara, 2022", "label": 1}
{"text": "As an unofficial UNI Panthers fan, I would like to decline your offer", "label": 1}
{"text": "Because nobody said they got stomped on man, I didn't see what happened in my own house all day but i got home and nobody said they got stomped on, nobody got stompy bruises on them, so nobody got stomped on in my house today. \n\nYour own AD asking for an investigation into something that twitter invented with zero evidence.", "label": 1}
{"text": "This entire thread is Michigan fans upvoting each other while they skate by without any consequences for being pieces of shit yet again.", "label": 1}
{"text": "Someone is still really upset about the loss I can see lmao", "label": 1}
{"text": "Go back to playing Magic the Gathering 😂😂", "label": 1}
{"text": "Go back to asking for people’s net worth you fucking weirdo", "label": 1}
{"text": "Ahh yes. Having more money and girls than your incel fanbase is weird. Take care man.", "label": 1}
{"text": "I don't even know what to say at this point lol. Straw man after straw man and you can't even form a coherent rebuttle or address the logical fallacy in your argument and the fact you just blatantly made up something I said to help prove your false narrative. \n\n\n\nGood luck in life. You are going to need it.", "label": 1}
{"text": "Save up for a new pack of Pokémon cards 😂😂", "label": 1}
{"text": "Bruh what are you on about? And you called me delusional. And if you’re talking about money, how about your broke ass school buy its own hospital for their students (oh wait Michigan did).", "label": 1}
{"text": "😂😂 take care dude. You’re right you probably are crushing it.", "label": 1}
{"text": "my life is going great and i have my Michigan degree to thank for it, thank you for your concern.", "label": 1}
{"text": "What a crock of horseshit. You are completely downplaying the sheer disrespect of Mike Hart's comments and the fact that UM players and their fans have continually piled it on over the years. Michigan shows a complete and utter DISRESPECT to MSU as a school, football program, players and men. Even when we beat you.\n\nAnd it's NOT benign trash-talk when it comes directly from the UM players in formal press conferences. At that point, it is reported across the state and country. You have literally turned it into fighting words and then act surprised when there are fights.\n\nYou need to show respect to your opponents, even in a rivalry. The fact that Michigan's coaches haven't shut this shit down over the years says a lot about the program. \n\nDantonio didn't stoke this fire, you did.", "label": 1}
{"text": "Ahh yes. Haven’t heard that one before. Please feel free to project your insecurities and feel like you aren’t a Pokémon incel by calling me lil bro.", "label": 1}
{"text": "You literally brought up the little brother stuff lol. Rent free my man.", "label": 1}
{"text": "This reminds me of that scene from Billy Madison. Anyway I’m sure MSU has never made any comments disrespecting Michigan fans (Walmart wolverines), players, coaches etc. I humbly ask your forgiveness", "label": 1}
{"text": "Now I’m pretty confident you’re upset lol", "label": 1}
{"text": "Real talk, y’all think Elko would be interested in idk, running this country? Dude is a better leader than all the asshats we are presented with", "label": 1}
{"text": "Just like Penn state. Hate to tell ya, but generally The Wolverines are the baddies", "label": 1}
{"text": "He can’t even take care of his own body. \n\nHe is mentally weak and gets his butt kicked by Little Debbie every week.", "label": 1}
{"text": "Yeah, you’re an asshole. You need help bro", "label": 1}
{"text": "Whereas the Texas coaching staff is famous for mental strength", "label": 1}
{"text": "Hey man everyone’s a genius after they’ve downed half a bottle of Jameson.", "label": 1}
{"text": "This post has been removed because image posts and direct image links are against /r/CFB's posting guidelines. Please seek out the appropriate [official thread](http://www.reddit.com/user/CFB_Referee/) for your image, if one exists. Examples:\n\n* Memes and other similar content goes to /r/cfbmemes or in the meme thread.\n* Highlights and other pictures from games go in the video/picture/gif thread (often stickied at the top of the main page).\n* Pictures you took during games go in the \"I Took a Picture\" thread.\n\nIf your image (or album) doesn't fit one of these categories (for example, interesting infographics, analysis, news, etc), you may post it in the description of a self-post. Please keep in mind that your image may be removed even in a selfpost, at the moderators' discretion, if it is does not promote discussion.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "Seriously? A leader?", "label": 1}
{"text": "Huh. Well we don’t advocate for beating up opposing players, so we definitely don’t want to be in the same country as you lmao", "label": 1}
{"text": "It’s exactly because of how he left Durham. He left on a midnight flight, invited the players to a zoom meeting and was late for that. That is how you treat your kids who played their asses off for you? \n\nThat’s not the behavior of a leader.", "label": 1}
{"text": "🤣🤣🤣🤣", "label": 1}
{"text": "Don't get me started about what you advocate for. Ill leave it at that", "label": 1}
{"text": "Yes and no. Rankings are a bit wonky to begin with IMHO, but Texas is presently \"tied\" with Florida at #30 by US News. I feel like people sleep on how good a school UF is sometimes. I feel that there are a lot similarities between the two of them - great public schools in states with whacky opinions toward higher education.", "label": 1}
{"text": "Yeah from the way you type I'm guessing you're 50+ years old lol", "label": 1}
{"text": "You sound like you are rage typing from a skilled nursing facility. Enjoy your 70s old man 👋", "label": 1}
{"text": "Yikes, still a step above the ppl running this country.", "label": 1}
{"text": "Oh man is it fun being undefeated.", "label": 1}
{"text": "Don’t be dramatic. Nussmeier approached Turner talking trash, getting in his face and grabbing his helmet. Turner kind of headbutts him off, but not with *that* much force, and makes a big dramatic flop to draw the flag. \n\nSure, Turner needs to play smarter and avoid those situations entirely, but don’t even start on the “assault” garbage. \n\nAnd you don’t think Texas would do anything for a win? They lower their academic standards for athletes, cover up crimes committed by their athletes, hire abusive alcoholics, drop bags, etc", "label": 1}
{"text": "It’s really not that deep. The hiring/move happened fast, and Elko can’t be in multiple places at once. He did his best to make all of his commitments while prioritizing his new team, as any coach would. \n\nI’m sure most of the players understood that…your comment just comes off as salty that one of your teams lost a good coach. ", "label": 1}
{"text": "you can play any night you want to!", "label": 1}
{"text": "It is, I read through the comment before making my own. You have one of the worst fan bases in all of sports and your comment is just another example of why.\n\nMe being a United fan has fuck all to do with this. I've consistently been on the right side of what's happened on United. Do you have any more unrelated and/or stupid comments?", "label": 1}
{"text": "Also, flair up, bitch.", "label": 1}
{"text": "https://youtu.be/HVplvpYzXlo?si=XS5ZzU9SgAXWhgoa\n\nAnyone know what happened with the Iowa college student", "label": 1}
{"text": "Yea, this isn't even a particularly good Iowa squad and they struggled with them for half the game. They also struggled against a Nebraska team that may very well miss out on a bowl game again.\n\nOn the flip side, they went down to the wire with Oregon in Autzen and have been pretty convincing for the most part. I don't know what to think of this OSU team, which is pretty par for the course.", "label": 1}
{"text": "This comment ain’t it bud, are you 12 years old?", "label": 1}
{"text": "Who wasn’t punished for drunk driving?  Xavier Simpson was suspended. Denard and the other coach were fired immediately.\n\nI’ll raise you Izzo and gang rape…", "label": 1}
{"text": "> ok i'm sorry but i really just don't give a shit that some fans threw bottles onto the field. and you wouldn't either if it wasn't ohio state\n\nI mean I literally shit talked Texas for the same thing last weekend but okay. Live your delusions, lmao.", "label": 1}
{"text": "In my lifetime I will hopefully see Iowa take the overall series lead and then we can finally point and laugh along with our Wisconsin friends.", "label": 1}
{"text": "I mean, MSU actually did this one year and Iowa fans never forgot. In retrospect, it was a bad look at the PSU game, but I also think it's time for people to move on.", "label": 1}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "Things will change if Joe Sloan goes to ECU though", "label": 1}
{"text": "DEARBORN!!!  Congrats on your degree, I still will never hire you. Loser.", "label": 1}
{"text": "How many teams that are top 30 in talent comp have those 5 undefeated or 1-loss teams played though?\n\nAlso those team talent composite rankings are mostly pretty silly. For one the whole paradigm is kind of screwed up thanks to the transfer portal. Two, it doesn't account for injuries. Three, there's just not enough data points to really make an accurate ranking. Four, there's not a huge gap between say the 28th ranked team and the 58th ranked team.", "label": 1}
{"text": "His name is rightfully at the top of every single \"ECU coaching candidates\" article so yeah I'd say there is.", "label": 1}
{"text": "Thanks for proving my point about how silly these rankings are", "label": 1}
{"text": "Yeah, I don’t know. OSU should have been fined and/ or identified the people who threw bottles to ban them. Ain’t nobody got time for that. \n\nThe MSU/UM probably should’ve resulted in something. I’m not saying prosecute anyone but this game has been a black eye for the conference for like the last decade.", "label": 1}
{"text": "Wouldn't want to offend the dear little darlings now, would we?", "label": 1}
{"text": "Just curious, might you have any suggestions as to who *you* should win the Heisman this year?", "label": 1}
{"text": "That a cue from Eagles fans and throw D cell batteries. Hell one up them and throw car batteries!", "label": 1}
{"text": "Start drinking for next weekend's games.", "label": 1}
{"text": "No he isn't.", "label": 1}
{"text": "> One just quit football so he didn’t have to play with them anymore\n\nClassiest OSU fan", "label": 1}
{"text": "Parker got demoted when WVU hired Garham Harrell, so he wasn't OC when he left WVU and when he got to ND he was only the TE Coach. He didn't get the OC tag until 2023.", "label": 1}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "Eh, at least my team doesn’t have to cheat to win. 🤷🏻‍♂️ I’ll take being the one giving backhanded comments about your shitty QBs", "label": 1}
{"text": "2004 Auburn was undefeated and left out of the BCSNCG in favor of Southern Cal and Oklahoma.\n\n2023 FSU was 13-0 and left out of the four-team playoffs in favor of Michigan, Washington, Texas, and Alabama.", "label": 1}
{"text": "Buddy they are not a Super Bowl team 😂", "label": 1}
{"text": "Mr big dick here having watched both", "label": 1}
{"text": "How you bums walked from baker man.. clearly the kitchens and stefansky circle jerk are the common issues plaguing that locker room. Baker is a culture setter.", "label": 1}
{"text": "Feel like lots of revisionist history. So many ppl had boners for AR when he entered the league.", "label": 1}
{"text": "Young also played against bush league college rosters while having absolutely yolked out talent all around him. He was a system qb at best and didn’t have physical tools.", "label": 1}
{"text": "lol cry more", "label": 1}
{"text": "College programs are focused on winning college games.", "label": 1}
{"text": "Yup win out and rankings dont even matter", "label": 1}
{"text": "They literally are. None of that money is actually invested in growing the economy. Unless the rich is person is investing solely in IPOs, none of that money is used by companies to grow. The only person who benefits is the rich investor.", "label": 1}
{"text": "Most extreme wealth is created by stepping on the backs and necks of everyday people along the way. To think that someone like Jeff Bezos' created wealth purely of his own volition is ridiculous. He had a fantastic idea that was implemented at the right time - yes. But look at how dependent he is on cheap labor and terrible working conditions. Look at how much money they throw at trying to keep Amazon warehouses from unionizing (and in the process advocating for better pay/conditions/benefits).\n\nWe aren't talking about your friend Billy's dad that's a VP of the local credit union, and makes 200k/year. We're talking about the ultra wealthy that can just toss a few million at a high school kid, so they get enjoyment out of watching him play football 20 times in the next 4 years.", "label": 1}
{"text": "Protest elections by throwing paper towels at Puerto Ricans", "label": 1}
{"text": "Sounds like something a coward would say.", "label": 1}
{"text": "Don't like this at all. At the very least it should be determined by either\n\na. CFP ranking\n\nb. overall record.", "label": 1}
{"text": "Oddly strong response...", "label": 1}
{"text": "Nothing cowardly about wanting to keep Athens clean and free of gutter filth", "label": 1}
{"text": "90% of ACC residents need to be exiled then", "label": 1}
{"text": "Thank god. Though the loud volume booing would have been satisfying.", "label": 1}
{"text": "Good. The less of him the better", "label": 1}
{"text": "God damn right. Wish he’d disappear.", "label": 1}
{"text": "But all ohio and pennsylvania residents should still take this as a sign of disrespect", "label": 1}
{"text": "Count your blessings. He made getting around at Bama/UGA a nightmare. Plus there's the rape and all that.", "label": 1}
{"text": "Listen man…", "label": 1}
{"text": "Internal polls on PA must be in the gutter then", "label": 1}
{"text": "So much REEing in this chat from both sides lmfao", "label": 1}
{"text": "Oh they’re so good he feels confident without having to do this ", "label": 1}
{"text": "👆 this is the answer. His internal polls are the reason he’s claiming Pennsylvania is “cheating” already.", "label": 1}
{"text": "Lmao—touché", "label": 1}
{"text": "I think you overestimate how much of our fanbase would boo him", "label": 1}
{"text": "That’s what I was thinking.", "label": 1}
{"text": "Just saying — looks like the same dumb fucking hat from a distance", "label": 1}
{"text": "Probably realized a majority of the attendees are already voting for him… better served elsewhere", "label": 1}
{"text": "Ugh the cheering in Tuscaloosa depressed me", "label": 1}
{"text": "We can only hope", "label": 1}
{"text": "It means the same thing, they say they only care about Michigan, but deep down they can’t stop thinking about Pennsylvania", "label": 1}
{"text": "Here before the 🔒", "label": 1}
{"text": "Pretty sure y’all got red hats too??", "label": 1}
{"text": "Which are safely buried in my closet until January, my friend", "label": 1}
{"text": "I am most definitely a Pennsylvania resident don't even check or ask any follow-ups about that or look at my flair and I'm furious and will be switching my vote now.", "label": 1}
{"text": "Some of us, I assume, are very good people", "label": 1}
{"text": "It truly sucks that this old man and his cult have ruined all red hats for me forever", "label": 1}
{"text": "Isn’t it wild how he ruined red hats? I had a red trucker hat I’d wear as a joke that I haven’t worn since like mid-2016", "label": 1}
{"text": "My favorite hat was a red golfer hat with Indiana script on it. Beautiful hat. Can’t wear it.", "label": 1}
{"text": "Storm the comment section!", "label": 1}
{"text": "I laughed at this.", "label": 1}
{"text": "It’s an absolute shame, but I guess it’s not the worst thing. Red hats absolutely clash with my skin tone.", "label": 1}
{"text": "He is tired.  Needs to stay home.", "label": 1}
{"text": "There's really not, like at all. It's a bunch of talk about traffic and logistics lmao. Like, what the fuck are you actually talking about?", "label": 1}
{"text": "Maybe. \n\nAlthough he seems so exhausted nowadays that you’d think him and his campaign would jump at the opportunity for him to just sit in a chair and look pretty for four hours.", "label": 1}
{"text": "Listen, he didn’t go to an Ohio State University to play school. Reading comprehension isn’t really his thing…", "label": 1}
{"text": "This is the most likely explanation", "label": 1}
{"text": "\\[Removed\\]", "label": 1}
{"text": "Look what happened to Fred Durst. Poor guy.", "label": 1}
{"text": "Well you know what they say about assuming things…", "label": 1}
{"text": "To their credit, I added that after I assume they posted their comment!", "label": 1}
{"text": "As a Pennsylvania resident I have added this to my reasons list in regards to my vote Tuesday", "label": 1}
{"text": "I was pleasantly surprised how many boos he got in Columbia at the Clemson/Carolina game last year. Fully expected standing ovations knowing SC but heard a lot of boos.", "label": 1}
{"text": "He’s a sharpie man.", "label": 1}
{"text": "I think his election team got some really bad numbers in PA, so now he knows he has no chance of winning the state. Fingers crossed!", "label": 1}
{"text": "At least Ohio State fans don’t have to worry about being both their red hats to this game! They only need the Saturday one now", "label": 1}
{"text": "Or that VA is realistically in play and PA isn’t needed.", "label": 1}
{"text": "Gonna be too busy doing damage control in the Puerto Rican community following his interesting decision to have Tony Hinchcliffe speak", "label": 1}
{"text": "Or someone told him pissing off a bunch of potential voters with increased traffic and security wouldn’t be worth it", "label": 1}
{"text": "Sheetz not Wawa!", "label": 1}
{"text": "Correct because we don’t want to be associated in any way with a supporter.", "label": 1}
{"text": "“I just hope both teams have fun.”", "label": 1}
{"text": "Is it just me or didn’t the “Make xxxxxxx great again” and all related memes get really old after like 2 months and it just became lame", "label": 1}
{"text": "shit, this site is long since become politicaly--just check this thread.  A LOT of male estrogen on display.", "label": 1}
{"text": "That'll be a $250,000 fine, payable to Alabama.", "label": 1}
{"text": "Listen, all we have to eat here is corn, of course we've got jaundice. Indiana is where George Lucas got the idea for the Sith after all.", "label": 1}
{"text": "The man made his cult wait 3 hours for a rally in Michigan so he could record the Rogan podcast. I don't think being prompt is really a priority.", "label": 1}
{"text": "The fuck are you talking about", "label": 1}
{"text": "Id imagine its more of a cluster fuck of logistics if anything\n\nAttending a football game or not is not that big of a political move.", "label": 1}
{"text": "Here before this gets locked", "label": 1}
{"text": "Harris is up 5-9 points in Virginia, and Project 2025 has a whole thing about firing most government employees and replacing them with loyalists. \n\nNot sure that VA is going to swing.", "label": 1}
{"text": "Doesn't the guy that \"controls\" the tv timeouts also wear a red hat? Cause he is annoying too.", "label": 1}
{"text": "Huh, I'd have thought he'd have felt right at home with all of the sexual assaults that happen in State College.", "label": 1}
{"text": "There's one of those \"this project paid for by Biden's infrastructure bill\" signs outside this clusterfuck of an intersection by my house that has been torn up all summer...I legitimately think it's going to cost the Dems some votes lol", "label": 1}
{"text": "I still can't believe someone who was as bad at running a Fortune 20 company as Carly Fiorina was, was able to make it that far in the primary. Guess it shouldn't be all that surprising considering who won and all.", "label": 1}
{"text": "Protesting the treatment of his friend Sandusky.", "label": 1}
{"text": "I’m waiting for some new polls but his bitching about it does indicate he got some unpleasant news for himself.  As transparent as he is with his reactions to everything.", "label": 1}
{"text": "Can’t take what you already have", "label": 1}
{"text": "ND is ranked margianlly higher than Ohio State academically- idk why y’all think you’re some hot shit ivy located in bumfuck Indiana", "label": 1}
{"text": "Low energy", "label": 1}
{"text": "He realized they’re no longer doing all that Sandusky stuff so he wasn’t interested anymore.", "label": 1}
{"text": "Yet another sign that he knows he's lost.", "label": 1}
{"text": "It's mostly just the fact that she was a woman. That was enough to differentiate herself so that she could get 2% support instead of .5% support", "label": 1}
{"text": "Oh no, don't be mistaken, we're idiots too!", "label": 1}
{"text": "Lol god damn", "label": 1}
{"text": "This is the October surprise I need.", "label": 1}
{"text": "Sheetz is love. Sheetz is life. ❤️❤️❤️", "label": 1}
{"text": "Something about Hannibal Lecter's facemask", "label": 1}
{"text": "Better that than somewhere else 👀", "label": 1}
{"text": "Fuck HP all my homies hate HP", "label": 1}
{"text": "If only someone would make our offensive line great again…", "label": 1}
{"text": "A lot of crossover in that Venn Diagram I’m afraid.", "label": 1}
{"text": "The Supreme Court just allowed them to continue voter purging up to election day. \n\nAlthough the article from AP mentioned that they can register day of the election to vote", "label": 1}
{"text": "Winner, stop the thread. Every single eligible person of voting age, please remember to vote on or before Election Day.", "label": 1}
{"text": "I have a nice red hat I got at a Red Hat Linux event I went to and I’m still sad I can’t wear it in public", "label": 1}
{"text": "Yinzer and Wawa in the same sentence. . . I detect voter fraud!", "label": 1}
{"text": "NO. WE AREN'T DOING THIS AGAIN", "label": 1}
{"text": "Nice work my friend. I don’t wear gear for the most part, so no red hats at all for me :)", "label": 1}
{"text": "Cancelling appearances at football games now? Low energy! Sad!", "label": 1}
{"text": "Russia bout to get dinged for tampering. No bowl games in ‘25", "label": 1}
{"text": "Too concerned about the floating island of trash apparently.", "label": 1}
{"text": "He killed it in *I saw the TV Glow*", "label": 1}
{"text": "Hands to the ~~face~~... Nope. Not announcing that.", "label": 1}
{"text": "Hes going to claim that no one was at the game because he cancelled.", "label": 1}
{"text": "Very fine players on both sides", "label": 1}
{"text": "Sleepy Don", "label": 1}
{"text": "I do not know enough about this to dispute it. So is now canon.", "label": 1}
{"text": "If not we riot.", "label": 1}
{"text": "I'd assume he'd get cheers like he did in Bryant Denny", "label": 1}
{"text": "Make Ohio Great Again! We will become the third biggest state again!", "label": 1}
{"text": "Wtf I love Harry Potter", "label": 1}
{"text": "yes yes yes!", "label": 1}
{"text": "You really like that joke, don’t you?  You posted it four times. ", "label": 1}
{"text": "the way they lost a game @ukraine that they should have won on paper should be disqualification enough", "label": 1}
{"text": "Thank god, that orange fuck was not welcome", "label": 1}
{"text": "There were a lot of bozos up there with the clown king", "label": 1}
{"text": "Yep I'll be repping my black and yellow colors of our beloved Pirates, Penguins and Pillers.", "label": 1}
{"text": "PA has this douche running for senate, Dave McCormick. He had a tweet \"Fun tailgate in Philly today. Excited to watch the Steelers throttle the Raiders!\"", "label": 1}
{"text": ">:[ Orange man bad >:[", "label": 1}
{"text": "A comment section of love", "label": 1}
{"text": "Like Hollywood did with Roman Polanski?", "label": 1}
{"text": "Wonder what he's cowering from this time.", "label": 1}
{"text": "If your favorite team is not all that hot this year, here's a generous consolation prize: there is no chance will cheeto try and use you for a photo op.", "label": 1}
{"text": "Wow. He really fumbled at the 1 yard line huh?", "label": 1}
{"text": "Awww poor guy is too tired. At least he’ll have plenty of time to rest after next Tuesday :)", "label": 1}
{"text": "Lol saying \"Hail 2 Pitt\" and \"Wawa\" in the same sentence is like that Inglorious Basterds scene with holding up 3 fingers", "label": 1}
{"text": "old man is too old and shits his pants too much to attend", "label": 1}
{"text": "PC Load Letter? What the fuck does that mean?", "label": 1}
{"text": "Wawa clears Sheetz", "label": 1}
{"text": "He found out that a “white out” game didn’t mean what he thought it meant.", "label": 1}
{"text": "I didn’t think all red hats were a joke…..The hat I had was an inside joke related to me and a friend that had literally nothing to do with politics or other people.", "label": 1}
{"text": "Pretty much just a circle.", "label": 1}
{"text": "lol other guy spoke too soon. *This* wins the thread!", "label": 1}
{"text": "You know you fucked up when you don’t show up to one of the whitest events ever", "label": 1}
{"text": "I think you're giving him too much credit...\n\nPissing people off is pretty much his brand", "label": 1}
{"text": "Fun fact: the city of Pittsburgh doesn’t even have a Sheetz in it, they are just in the rural surrounding areas. \n\nPittsburgh primarily has Gian Iggle’s GetGos within it", "label": 1}
{"text": "I like to think that that the karma from that caused us to have a very enjoyable game against Iowa.", "label": 1}
{"text": ".", "label": 1}
{"text": "Yes. Got flagged 34 times. Racking up the penalties.", "label": 1}
{"text": "Never forget about the grain bin pyramids.", "label": 1}
{"text": "Yes, because everyone’s voice deserves to be heard at all levels of government \n\nYour voice matters at the national state and local level on all issues", "label": 1}
{"text": "True, but based on demographic breakdown of recent polls, I would expect the alumni fans to be more inclined to boo than the non-alumni fans. Would depend on that breakdown at the game.", "label": 1}
{"text": "Or that PA and OH are already signed, sealed, delivered, and he may as well spend time on making it as big a blowout as possible.\n\nI doubt VA flips, but he could really make a difference in some of these Senate/House races. Which is what really is going to impact his ability to do all these huge shakeups he wants to do.", "label": 1}
{"text": "I am more likely to vote from him now that he isn't screwing up my tailgating plans.", "label": 1}
{"text": "But the refs just let you! (when you throw bottles on the field)", "label": 1}
{"text": "It is hilarious. https://www.youtube.com/watch?v=B2oLFKYNInQ", "label": 1}
{"text": "My Phillies hat is only worn to games now :(", "label": 1}
{"text": "Is his dementia a talent? If it is l need to let my grandad know. He still has eligibility and could use the NIL money.", "label": 1}
{"text": "Hey, that’s NSFW. 😂", "label": 1}
{"text": "Just not after!", "label": 1}
{"text": "I take the Michael Bolton from Office Space approach:\n\n\"No way! Why should I change? He's the one who sucks.\"", "label": 1}
{"text": "Bro, Indiana is just Ohio lite. Let's not act like either of these states have highly educated populations.", "label": 1}
{"text": "We have lots of stupid PSU fans who would cheer like hell for him.", "label": 1}
{"text": "> Lookie here - the gump Alabama being the progressive\n\nYou love to see it. I've always been left, but one of the most liberal comrades I've ever met in my life lives in Birmingham now. He's a surgeon, to boot.", "label": 1}
{"text": "Bro ND is in south bend Indiana- objectively one of the worst places in Indiana", "label": 1}
{"text": "His mashed potato brain is naturally occurring.", "label": 1}
{"text": "We get a lot of shit on the internet - Reddit and this sub particularly - but it isn’t as bad as everyone says. We definitely have a shitty minority (like the rest of the country) and has a disproportionate amount of power and gets all of their people elected. \n\nThe people here are *mostly* good", "label": 1}
{"text": "Hey don't lump me into that circus", "label": 1}
{"text": "Maybe the backlash for the rally at msg ?", "label": 1}
{"text": "He realized the old Penn state regime was no longer there and lost interest", "label": 1}
{"text": "He started hurling claims of “cheating and getting caught on a scale never seen before” and sued Bucks county this morning… even though votes can’t be counted, or even opened by officials in Pennsylvania yet.", "label": 1}
{"text": "I have an NCSU hat that says “STRENGTH IN THE PACK” and from a distance you see red hat with four words and ugh", "label": 1}
{"text": "it's difficult NOT to....", "label": 1}
{"text": "> The student sections of both would probably boo pretty strongly, though.\n\nExcept for the greek orgs", "label": 1}
{"text": "Cocaine *is* naturally occurring.", "label": 1}
{"text": "No I’m saying ND alum are largely ivy rejects now stuck at a private religious school in south bend Indiana but talk shit like they’re superior more than ivy kids do\n\nCan you tell I have ND alum in my family", "label": 1}
{"text": "Hey, that's a quality loss.", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "The student section would be the loudest cheering. Youngsters are going red. It's beautiful", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "Maybe Penn State decided they didn't want another sex criminal getting the spotlight at their games.", "label": 1}
{"text": "1. We had a large number of Congresscritters spend the Fourth of July celebrating in Russia.\n\n2. Evidence-free?   No, that's not even close.  There may not be a specific smoking gun, but there is PLENTY of evidence.\n\n>They tried the guy on some fairly normal bookkeeping errors\n\nFairly normal bookkeeping errors, like refusing to return classified documents and then lying about them?", "label": 1}
{"text": "It’d almost be funny if a certain campaign wasn’t just caught red handed astroturfing all over Reddit", "label": 1}
{"text": "In the words of John Rothstein, the epitome of brutality", "label": 1}
{"text": "Do we include Robert Sarver in that Hall of Fame or nah", "label": 1}
{"text": "Inshallah Wilbur", "label": 1}
{"text": "You’re not good at math eh? ", "label": 1}
{"text": "I have no idea what you are talking about.", "label": 1}
{"text": "Let me explain like you’re five since that seems to be what we are working with. There are four quarters in a game and each quarter lasts fifteen minutes. When you multiply four by fifteen the sum is sixty. So if the games go for at least sixty minutes but the committee is getting games that only last 45 minutes, then they’re missing some of the game. Got it? ", "label": 1}
{"text": "Jesus christ, did you even read my initial comment before putting on your fedora? How many of those minutes is game action actually happening? \n\nDoes the committee need to watch the game clock tick down from 40 to 20 seconds every single play? Or can they just watch the plays themselves?", "label": 1}
{"text": "[01j8fqja4pegy4hxaqe5.jpg (1440×810)](https://images2.minutemediacdn.com/image/upload/c_crop,w_5235,h_2944,x_0,y_84/c_fill,w_1440,ar_16:9,f_auto,q_auto,g_auto/images/ImagnImages/mmsport/194/01j8fqja4pegy4hxaqe5.jpg)", "label": 1}
{"text": "it isn't a massive reach to think Baylor would try to cover something up.  That is what y'all do.", "label": 1}
{"text": "Every school would try to cover it up if they were doing it.  I'm just saying if we could do it then we would have all year and not against 2 teams who aren't very good.", "label": 1}
{"text": "One word.... Unions.  Can't let technology steal our God given right to a job at highly overpaid wages... js", "label": 1}
{"text": "So you are stretching both things.   Bliss tried to paint Denehey as a drug dealer because his murder exposed him paying players.   Zero rapes were covered up.  Baylor just decided screw title IX and there was no avenue for the girls to report other than going to the police.  The majority didn't want to because that exposed them to morality violations that would get them kicked out of school.   Both situations are completely fucked but they aren't what you are claiming.  The B12 has investigated this and already said that it didn't happen.  Tech hasn't provided any evidence that happened.   The claims that we have a different comms system are completely false.  There is absolutely nothing to this story.   Tech is just forcing the B12 to speed up the process of fixing a vulnerability that every single P4 team currently has.", "label": 1}
{"text": "What union?", "label": 1}
{"text": "MLBUA", "label": 1}
{"text": "Actually making fun of the longshore union in a round about way... The demand that technology not take their jobs... Such Ludites", "label": 1}
{"text": "Tell me you cheat on your wife/husband, without telling me.", "label": 1}
{"text": "Why are you asking this in the middle of the season", "label": 1}
{"text": "Have you met evengilical Christians?", "label": 1}
{"text": "Of course atheist reddit hates Liberty 😂😂. Though I don't blame them for not liking some hicks from Virginia. Southern trash.", "label": 1}
{"text": "Yes, unfortunately.", "label": 1}
{"text": "Unfortunately", "label": 1}
{"text": "I met a couple of Liberty students in my college times. They believed that the fun times they were having off campus were not sins.", "label": 1}
{"text": "Plenty of MSU/PSU jokes for anyone who wants the upvotes", "label": 1}
{"text": "Shut up, Flanders.", "label": 1}
{"text": "It still low key annoys me that PSU trademarked \"#forthekids\" (and variants) taking it's use away from charities like Extra Life.", "label": 1}
{"text": "Just remember, when in doubt, blame the refs! Classic CFB move!", "label": 1}
{"text": "Secret Flamers rise up!  Just wait until they unleash their ultimate flower power!", "label": 1}
{"text": "Oh..he don't know, do he.\n\nLiberty has a huge section on their Wikipedia page labeled \"scandals\"...that only goes back to 2020. Plenty more of you wanna look in to it..plenty of citations\n\nFeel free to dig deeper, if you've got the stomach for it", "label": 1}
{"text": "Football fans generally lean red while basketball fans generally lean blue", "label": 1}
{"text": "TL;DR;UW idiot", "label": 1}
{"text": "It really is on Pennsylvania to make sure America doesn’t pick the nut.", "label": 1}
{"text": "The government doesn't have a tax collection problem. It has a deficit spending problem. Don't let the fact that the government is spending like drunken sailors fool you into thinking they don't pay their fair share.", "label": 1}
{"text": "Yeah… Raleigh has 2 sports and their shitty football team cancels out with uncc", "label": 1}
{"text": "Aren't the Panthers in Charlotte, who are the epitome of terrible?", "label": 1}
{"text": "University of North Texas. And so glad they are not the Christian University of North Texas. You figure it out.", "label": 1}
{"text": "You’d have to be mentally challenged to thing raliegh is a better sports city than charlotte", "label": 1}
{"text": "Only a loser would spend time doing that", "label": 1}
{"text": "Crazy every Tulane flare has a second better team attached to", "label": 1}
{"text": "Not every one", "label": 1}
{"text": "Crazy you don’t have one but seem obsessed with hate watching Tulane.", "label": 1}
{"text": "You’ve never heard the refs suck? Must be educated in a city like New Orleans", "label": 1}
{"text": "I just like trolling game pages lol", "label": 1}
{"text": "That’s not a flex.", "label": 1}
{"text": "Nice straw man you got there.", "label": 1}
{"text": "Excited to tell my kids about drinking in a city that doesn’t exist anymore", "label": 1}
{"text": "Not supposed to be", "label": 1}
{"text": "The risk of what happened. Jesus, it's like talking to toddlers sometimes.", "label": 1}
{"text": "What happened meaning the PAC gutting the MWC? How did scheduling with them this year increase that risk?", "label": 1}
{"text": "Texas State because it would piss everyone off.", "label": 1}
{"text": "The Mountain West Conference you dim fuck.", "label": 1}
{"text": "Lol a D2 post is the top post of this sub right now.", "label": 1}
{"text": "You were alive for '47 and '48? Certainly you aren't referring to Nebraska's in '97. I guess you can claim .5?", "label": 1}
{"text": "Ah you tried that’s so cute", "label": 1}
{"text": "Sorry but last game was *not* a heisman performance from cam.", "label": 1}
{"text": "New pornstar name unlocked", "label": 1}
{"text": "C'mon USF! Give us that schedule bump!", "label": 1}
{"text": "anyway in WTF news, myron (fresh and fit) and vitaly are in LA livestreaming what they claim is predator busting. in is the weirdest and cringiest thing i have ever seen", "label": 1}
{"text": "lol 385 doesnt sound that high for an FBS team", "label": 1}
{"text": "oh wow beautiful catch!!!", "label": 1}
{"text": "its a bicyclist so deserved", "label": 1}
{"text": "Hurrr durrr", "label": 1}
{"text": "Your parents should have reported to other means", "label": 1}
{"text": "I really feel I’m not getting enough credit here for pointing out the malapropism", "label": 1}
{"text": "The sweet irony of Jeanty going for 149 and 2 lol “ok game buddy, you’ll get em next time” 🤡", "label": 1}
{"text": "Eat some dog shit!", "label": 1}
{"text": "Keep crying. I know you got up early to watch your boyfriend on Gameday this morning", "label": 1}
{"text": "Lol embarrassing", "label": 1}
{"text": "It does *not* feel like we should favored by 20 this game. Not after last week. Duke was a FG away from being ranked, they are a serious team. This will be a battle.", "label": 1}
{"text": "Is anyone else seeing emus right now?", "label": 1}
{"text": "Joe Pa knew", "label": 1}
{"text": "/r/cfb they really do, in fact, suck. its november 2nd.\n\nwith all due respect", "label": 1}
{"text": "Penn State should have gotten the death penalty after the Sandusky incident. So now Ohio State is gonna give it to them today.", "label": 1}
{"text": "Has literally nothing to do with CFB so yeah, wrong place for that shit", "label": 1}
{"text": "Nah", "label": 1}
{"text": "Break out the chain again!", "label": 1}
{"text": "How can anyone vote for a party who has bored everyone shitless for months about trans people. Can trans people finish a drive for penn state???", "label": 1}
{"text": "Flair up if you're gonna talk smack. \n\n\nTo your other question, have trans people been given a shot to finish a Penn State drive?", "label": 1}
{"text": "Two flairs? That's bitch shit lmao, pick a team.", "label": 1}
{"text": "I shouldve killed myself instead watching this team again.", "label": 1}
{"text": "This doesn’t seem like a good way to go .", "label": 1}
{"text": "Lmao jesus", "label": 1}
{"text": "this sounds as ridiculous as our fans\n\nif alabama loses next week i might sell all my belongings and become homeless", "label": 1}
{"text": "Probably been watching football longer than you've been alive, fake Ole Miss fan hahaha", "label": 1}
{"text": "I’ll ban you again if you complain again", "label": 1}
{"text": "Have this game on in the background and I swear every time I look at the screen it's on commercials.", "label": 1}
{"text": "I’m going to killmyself", "label": 1}
{"text": "ah duke, if you remember my notes last week, thats the whole \"not tackle\" thing our defense does", "label": 1}
{"text": "It’s over. 41-10 tOSU. PSU can only blame themselves on this one.", "label": 1}
{"text": "You can laugh all you want, but as a non-American aspiring trans person, I'm planning to cross the border illegally and get incarcerated so I can transition on the American tax payer's dime. All my nonbinary criminal friends and allies are doing it. Many such cases", "label": 1}
{"text": "This is rape", "label": 1}
{"text": "Alright guy stfu", "label": 1}
{"text": "Many such cases", "label": 1}
{"text": "Who y’all voting for?", "label": 1}
{"text": "Sanity", "label": 1}
{"text": "Jill Stein. I think this is her year", "label": 1}
{"text": "Not these refs", "label": 1}
{"text": "Wouldn't you like to know", "label": 1}
{"text": "lol audacious of you to ask", "label": 1}
{"text": "People’s front of Judea. No way I’m voting for the Judean people’s front", "label": 1}
{"text": "😂", "label": 1}
{"text": "Already voted. How are there people still existing that want to talk another the election MORE? You’re in a college fb thread", "label": 1}
{"text": "No", "label": 1}
{"text": "I’m also watching more election commercials than football", "label": 1}
{"text": "No", "label": 1}
{"text": "Exactly. If you live in a state that you can, like I do, vote early and just ignore the noise.", "label": 1}
{"text": "Shut the fuck up", "label": 1}
{"text": "Indeed. Way to turn to personal attacks. Good way to show you've won an argument. Enjoy the game.", "label": 1}
{"text": "Cripple fight of the century.", "label": 1}
{"text": "How far can this announcer get cam wards dick down his throat I mean I like ward but damn zip his pants up", "label": 1}
{"text": "The entirety of Syracuse could be bulldozed and nothing of value would be lost.", "label": 1}
{"text": "You were never able to acknowledge what I’m saying, this wasn’t an argument or discussion, this was you stubbornly repeating yourself. So you won/lost whatever, you didn’t want to engage in an actual discussion. So I’m done", "label": 1}
{"text": "Incorrect, we just got a $100 billion micron chip plant, city is booming.", "label": 1}
{"text": "All these inbred Tech fans thinking there's some grand conspiracy for a mediocre program in Upstate New York.", "label": 1}
{"text": "Since both teams can't lose, may THE Ohio State defeat Sandusky State.", "label": 1}
{"text": "EAT SHIT YOU FUCKING BUMS", "label": 1}
{"text": "And I'm assuming you couldn't spell USA if I spotted you the U and the S.\n\nDon't make assumptions. It's rude.", "label": 1}
{"text": "Is that what you wrote for your Tech admission essay?", "label": 1}
{"text": "The refs can rot in hell along with Syracuse.", "label": 1}
{"text": "What do politics have to do with your enjoyment of sports?", "label": 1}
{"text": "Aw is someone upset? \n\nI dated a girl from Syracuse. Dinosaur BBQ is a disgrace", "label": 1}
{"text": "I mean this constructively.\n\nYou need to go touch some grass.", "label": 1}
{"text": "These refs are worthless piles of shit along with Syracuses team.", "label": 1}
{"text": "refs are so gay", "label": 1}
{"text": "Virginia: eight million people, seventeen last names.", "label": 1}
{"text": "says the guy with 50,000 reddit karma", "label": 1}
{"text": "I’ve been to Cazenovia NY multiple times…let’s be real. \n\nAlso, born in and live in Georgia so find a better insult buddy.", "label": 1}
{"text": ">find a better insult\n\nYou should've tried that earlier instead of \"CHECK YOUR EYES\". You deleted it pretty quickly though so I'll give you credit for recognizing a swing and a miss\n\nI don't blame ya for the lack of witticisms though. You got that Southern learning. Ain't your fault.", "label": 1}
{"text": "I didn’t delete it you did. I had an even better response typed but it wouldn’t let me send cause you deleted it :/\n\nImagine choosing to live in Syracuse New York", "label": 1}
{"text": "fuck that guy lmao what a tool", "label": 1}
{"text": "lol at least make sense. yes all those inbred hicks in... the 7th largest metro in the US.", "label": 1}
{"text": "I mean this constructively.\n\nYou need to go touch some grass.", "label": 1}
{"text": "Carmelo is overrated", "label": 1}
{"text": "Siri bring up vt vs Syracuse avg sat score", "label": 1}
{"text": "Gus glazes Ohio State like no other.", "label": 1}
{"text": "Boomer?! Fuck outta here. I'm a Millenial. \n\nDon't try spelling that last word, btw. You might pull a muscle.", "label": 1}
{"text": "None of that no tax stuff will pass. He’s like a kid running for student president saying that they get an ice cream truck for the school lunch every day.", "label": 1}
{"text": "If I try too hard, I might get flagged for holding. Not worth the risk.", "label": 1}
{"text": "is it even legal to run for president without making a bunch of empty promises?", "label": 1}
{"text": "I ain’t ever gonna stop downvoting this guy!!!!", "label": 1}
{"text": "THE WORLD FAMOUS", "label": 1}
{"text": "FWIW we don't like it either.  Gus sucks.", "label": 1}
{"text": "nah the point is that suddenly brokers will be minimum wage employees that are automatically \"tipped\" with untaxable capital gains.", "label": 1}
{"text": "You're being hostile for no reason man, hope your day gets better", "label": 1}
{"text": "Yeah. And the Tariffs he wants to use to make up the difference will only increase inflation. It's one of those things that sounds great to people who have no idea how things actually work.", "label": 1}
{"text": "Bring it on, baby! I got enough karma stored up!", "label": 1}
{"text": "Syracuse is a shit team and so are the fans. Refs can't help you catch balls.", "label": 1}
{"text": "The fuck did we do to you?", "label": 1}
{"text": "made me watch ur horrible offense", "label": 1}
{"text": "Let’s not generalize. It’s just those two dudes who have been shitty. Fuck those guys.", "label": 1}
{"text": "Not all. But a lot in here.", "label": 1}
{"text": "Hey that’s not nice", "label": 1}
{"text": "misplaced anger about the refs, he’s gone mad with rage", "label": 1}
{"text": "America exists because of a war over a 2% tax... \n\nHating taxes Is deep in our social  psyche\n\nBut of course it's super unlikely to pass but there will be a lot of pressure for changes.", "label": 1}
{"text": "Nah, Syracuse is pretty evenly matched with us. I expect this to go down to the wire this game.", "label": 1}
{"text": "That sounds amazing! What kind of whiskey?", "label": 1}
{"text": "Yea, corporations don't have enough power in politics", "label": 1}
{"text": "Must be in his contract lol", "label": 1}
{"text": "Seems incomplete if you use the precedent of past calls like that. So close", "label": 1}
{"text": "Should have figured the reference would go over your head", "label": 1}
{"text": "Im happy to see Ole Miss flourish. They're a great rival and a great member of the SEC. I absolutely love, you guys. Gg and thank you for being such a great fanbase.", "label": 1}
{"text": "what, are you 12?", "label": 1}
{"text": "How did the fucking vice president break anything? Lmao. She’s not the fucking president", "label": 1}
{"text": "Psst... this is a college football thread.", "label": 1}
{"text": "They’re not trying to appeal to people with a basic understand of civics lol", "label": 1}
{"text": "In charge of the border", "label": 1}
{"text": "Didn’t you know? The VP makes tax law now apparently… /s", "label": 1}
{"text": "I don’t give a shit about either side homie. We’re all watching the same commercials", "label": 1}
{"text": "The better team is going to win and I'm happy to see Ole Miss in a good spot. I hope you guys make the playoff and make some noise up there.", "label": 1}
{"text": "Reverse Robin Hood is right Keep democracy alive and well.. 🇭🇹🇺🇸🇵🇷", "label": 1}
{"text": "Screw it, let's get 13 more.", "label": 1}
{"text": "Uhh no. Jokes about SA are not cool ", "label": 1}
{"text": "Ohio state fans are complete assholes and classless. So I’m gonna take my depression and all the nasty comments I’ve been getting and go find a bridge to jump off of. Deuces everyone.", "label": 1}
{"text": "deep breath ignore them just a stupid game", "label": 1}
{"text": "lol dude it’s a game, chill", "label": 1}
{"text": "Come on man Live for Spite. Live for Spite.", "label": 1}
{"text": "No, no, thank you for the fun thread.", "label": 1}
{"text": "LMAOOO THEY REALLY DIDNT GET THE BALL BACK FUCK JAMES FRANKLIN", "label": 1}
{"text": "Narratives are crazy. Everyone saying PSU sucks for a close top 5 match up but Texas still gets the benifit of the doubt for being raped in prime time and not a peep", "label": 1}
{"text": "They're really good. I hope they make the playoff", "label": 1}
{"text": "Takes some serious dedication to suck ass that consistently.", "label": 1}
{"text": "Sandusky State defeated.\n\n\nWell done THE Ohio State.", "label": 1}
{"text": "You're a fucking idiot.", "label": 1}
{"text": "Isn’t it your nap time", "label": 1}
{"text": "Cry more, chicken", "label": 1}
{"text": "Ole Miss is better than their record. They have so much talent, I hope they stay healthy and make the playoff.", "label": 1}
{"text": "Choke on this chicken bum have fun with your 3 hrs of daylight this winter you sad fuck !", "label": 1}
{"text": "Make sure you change your diaper when you wake up.", "label": 1}
{"text": "Someone needs to put this dog down", "label": 1}
{"text": "Thanks you old fat fuck! Syracuse is still irrelevant in every major sport and needed the refs to beat the backs up today in your shitty excuse for a home field. Glad 1000 sad upstate New Yorkers could make it out to cheer on the team!", "label": 1}
{"text": "Lot of people running their mouth in the pre-game thread. Don’t forget James Franklin is still your coach.", "label": 1}
{"text": "I was about to get really mad because I thought you meant me personally, but then realized you meant Georgia and I felt relieved. You guys aren’t going to play Georgia, you’re going to the 4th spot and will probably get knocked out in the second round.", "label": 1}
{"text": "Why have we now hired two coaches who lose on purpose? Babcock should be put in a guillotine. \n\nNo excuse for Drones to not make a couple drives that game. Anything short of him being shot yesterday is invalid.", "label": 1}
{"text": "Ohhh don't get all butthurt.", "label": 1}
{"text": "This offense can put up points on whoever. Will be some fun playoff games upcoming", "label": 1}
{"text": "Going to be a tough few days for Auburn fans... another big L at home and then Tommy's orange clown taking the second L on Tuesday", "label": 1}
{"text": "Yeah, imagine having a 1-10 record against another team in the conference, what bums…..", "label": 1}
{"text": "Still behind the hump.", "label": 1}
{"text": "They ended up making no plays late.", "label": 1}
{"text": "It goes against the entire Chinese ideology that they have had for the past idk 1000 years. They don’t want to fight world wars they want China to be as strong as China can be.", "label": 1}
{"text": "Damn usf fans are dumb. I’ll explain slowly. \n\nTeams make a lot of changes through the season. For example, UCF changed their starting QB and their DC since playing Colorado. If these changes had been in effect when they played Colorado, they probably would have won. \n\nDoes that make sense? Or do I need to explain with blocks?", "label": 1}
{"text": "Nice cope. Your hypothetical means nothing— ucf and Colorado played, and Colorado blew their doors off. Who’s the dumb one?", "label": 1}
{"text": "Actual Kendrick beat drake 🤓☝️", "label": 1}
{"text": "Why reply to a clown? What does that make you? An Ohio native 🤣", "label": 1}
{"text": "Imagine living on a thread of a team that has nothing to do with you other than being a team that smacked tf out of you for the past 10 years and then left for better things just to call someone an idiot on the internet . Not pathetic at all amirite?", "label": 1}
{"text": "Yes more Paterno slander please.", "label": 1}
{"text": "Spot on there David Blaine. An Ohio native indeed. And your team is coached by Hugh Freeze... And yall are like the 6th best team in Alabama. Alabama and five high schools! L", "label": 1}
{"text": "Are rural Michigander farmers really voting for Harris? I'd hope so, but I think that ad was wishful thinking.", "label": 1}
{"text": "There's definitely at least a few. But definitely outnumbered", "label": 1}
{"text": "[Imagine talking about your team in the third person](https://www.reddit.com/r/CFB/s/LRnrz7ZFaI) and without a flair to pretend like you’re not affiliated with the school. That 5-game losing streak got you too embarrassed to rep the Knights, eh? Not pathetic at all.", "label": 1}
{"text": "Plenty of them are.", "label": 1}
{"text": "Gators Up on GA right now who we demolished.. Miami is legit.. “Offensively”", "label": 1}
{"text": "Cool story, I confirmed I am a native. Never bragged..  never said I live there. You're pretty dumb huh? Like you like Aubuns and just run your cockholster without regard. I'd pay to see 6th graders jump you.", "label": 1}
{"text": "Lagway?!?", "label": 1}
{"text": "[Oh. That made it really confusing when you started talking about the team in the first-person a few minutes later.](https://www.reddit.com/r/CFB/s/yTBlcZ4XJf) You know damn well you were trying to make it seem like you weren’t affiliated with ucf hahahaha 🤣", "label": 1}
{"text": "Oh noooo!!! Anyway..", "label": 1}
{"text": "You must be such a bitch off the keyboard", "label": 1}
{"text": "No I’m just talking about my team. Idgaf if people think I’m affiliated or not. I’m just talking to fellow UCF fans about my team. \n\nBut look I’m sorry your parents didn’t give you attention (you were probably unbearable), and I hope you get that attention someday. But that guy ain’t me, you should probably seek out a group or therapy. Here’s a good [link](https://book.zocdoc.com/get-started?utm_source=google&utm_medium=cpc_brand&utm_campaign=10439133071&utm_term=zocdoc_e&utm_content=102297848623&gad_source=1&gclid=Cj0KCQjwm5e5BhCWARIsANwm06g5EzcupLhy-dNFUBfIXrKIZ7TD-uD_V3jCgS5gW7R3-Vd7jb5VLdsaAjC9EALw_wcB) to start", "label": 1}
{"text": "#**Fuck off, unflaired neutral.**", "label": 1}
{"text": "Nice cope dude. Maybe if you played Florida and Iowa State again you might win too! Maybe the NCAA will let you play those games again right? If, if, if! 😂 \n\nAnd good decision to drop the academic discussion btw. ucf ain’t even close lmao", "label": 1}
{"text": "You’re legit a stalker. What’s your address boy", "label": 1}
{"text": "cumpilations are the pinnacle of human achievement", "label": 1}
{"text": "What? You crying because you’re ass?", "label": 1}
{"text": "I love it when I see an ad for a vote on a proposition and at the end I still have no idea what the proposition is about", "label": 1}
{"text": "Ok name and likeness leading to college students in political ads isn't something I had on my bingo card.", "label": 1}
{"text": "Cumpilations? 🤨", "label": 1}
{"text": "What the fuck.", "label": 1}
{"text": "You still going?", "label": 1}
{"text": "touchdown bitch you said what?", "label": 1}
{"text": "Hell yeah brother", "label": 1}
{"text": "Now try not to blow it. Only beat UCF because they had a middle school QB", "label": 1}
{"text": "🤔🤔", "label": 1}
{"text": "If we had this conversation last week you might’ve had a point! If, if, if! 😂", "label": 1}
{"text": "lmao look who’s crying now", "label": 1}
{"text": "Many teary eyed Pokes will find comfort in the arms of their cousin and dust bowl crop dinner", "label": 1}
{"text": "I want y’all to win", "label": 1}
{"text": "A man of culture", "label": 1}
{"text": "Then flair the fuck up dude, my lord.", "label": 1}
{"text": "Why you gotta keep making us look bad in all of these game threads lmao", "label": 1}
{"text": "Bruh", "label": 1}
{"text": "Wow, can you be any ruder?", "label": 1}
{"text": "it’s fun", "label": 1}
{"text": "Shut up and then grow up.", "label": 1}
{"text": "I know Arizona isn't making fun of a place for being dry and dusty", "label": 1}
{"text": "Ig we don't win the natty, I will delete this account, and record myself performing a seminoles-inspired dance before i dfo", "label": 1}
{"text": "Ooh, what a sick burn. You really got us good. Hahahahaha!", "label": 1}
{"text": "Are we like totally 100% sure Beck has the proper number of chromosomes?", "label": 1}
{"text": "So many insufferable ASU and OSU fans in here today idk what everyone’s deal is", "label": 1}
{"text": "LOL arizona", "label": 1}
{"text": "Lol rude fucker. See you in the second half bitch ass.", "label": 1}
{"text": "Talk your shit. I bet you most people watching ball didn't know that bc it never happens. Get over yourself.", "label": 1}
{"text": "Will any straight men actually vote for Harris", "label": 1}
{"text": "Man, I was told Vandy fans were really smart people", "label": 1}
{"text": "you have a vandy flair, don’t be stupid", "label": 1}
{"text": "0/10 bait", "label": 1}
{"text": "How is that stupid I’m just asking", "label": 1}
{"text": "Imagine saying this unironically", "label": 1}
{"text": "I thought this was a joke and then clicked your profile, yikes.", "label": 1}
{"text": "Flair up, teaspoon. https://flair.redditcfb.com", "label": 1}
{"text": "Big YIKES holy shit", "label": 1}
{"text": "No", "label": 1}
{"text": "What is offense", "label": 1}
{"text": "the only comeback michigan is going to get is on their moms.", "label": 1}
{"text": "Ew", "label": 1}
{"text": "Wipe that shit off your face white boy", "label": 1}
{"text": "No one is complaining you dumbass", "label": 1}
{"text": "lol we're reading different threads then, angry man.", "label": 1}
{"text": "Right because no one struggles in their first season, Kirby went 8-5 and Saban went 7-6, you halfwit", "label": 1}
{"text": "I was gonna taunt you for being an Oklahoma State fan, but holy shit, you're an actual off-the-deep-end conspiracy theorist, which is more hilarious than anything I could have come up with.", "label": 1}
{"text": "Oh yeah, it's a good thing they took over 15-0 teams.", "label": 1}
{"text": "What’s this 439 business all about?", "label": 1}
{"text": "439 increases medical care and protection for women...", "label": 1}
{"text": "Such an L from the Husker ladies in that commercial", "label": 1}
{"text": "\"Non-physicians\" i.e. the people who *are* pregnant and should be able to make that decision", "label": 1}
{"text": "Yeah... I'm giving them the benefit of the doubt. Being young and all", "label": 1}
{"text": "I’m still floored by Nebraska’s political ads. These are real?", "label": 1}
{"text": "Whatever helps you sleep. Conspiracy theorist? That’s a leap", "label": 1}
{"text": "It's a living hell here.", "label": 1}
{"text": "Hey pal did you just blow in from stupid town? It was obviously the throat slash", "label": 1}
{"text": "I really want to know what prop 434 and 439 actually are.", "label": 1}
{"text": "My biggest takeaway so far today is Deb Fischer sucks, yes on 439/no on 434, and I should not settle for joint pain.", "label": 1}
{"text": "hilarious how few CA ads there are in comparison", "label": 1}
{"text": "Thanks Lombardi. You missed the point. \n\nBut maybe you can teach me some more about the fundamentals of football. Explain it real slow like I’m a Florida graduate.", "label": 1}
{"text": "I don't know how the University of Nebraska let's that ad slide. It's as close to a brand association you can get without the University outright supporting it.", "label": 1}
{"text": "Dawg you can just say you're wrong. Don't have to whine.", "label": 1}
{"text": "The political ads in a game between a california team and a nebraska team feel like a window into two different universes", "label": 1}
{"text": "Are we really surprised a UGA player would do a throat slash celebration when in the last year the classy Georgia football program has seen;\n\n> Jalen Carter speed racing incident\n\n> Aliou Bah stopped for speeding\n\n> Jamon Dumas-Johnson arrested for racing\n\n> De’Nylon Morrissette, Marvin Jones stopped for speeding\n\n> Christen Miller, Kendall Milton stopped for speeding\n\n> De’Nylon Morrissette arrested for DUI\n\n> Marcus Rosemy-Jacksaint stopped three times for speeding \n\n> Samuel M’Pemba stopped for speeding\n\n> Tyrion Ingram-Dawkins stopped for speeding\n\n> Jarvis Jones arrested for reckless driving\n\n> Joenel Aguero, Justyn Rhett cited for racing\n\n> David Daniel-Sisavanh charged with reckless driving\n\n> Trevor Etienne charged with DUI, reckless driving\n\n> Sacovie White arrested for reckless driving\n\n> Bo Hughley arrested for reckless driving\n\n> Smael Mondon, Demello Jones arrested for racing, reckless driving\n\n> Rodarius ‘Rara’ Thomas arrested, dismissed from team\n\n> Daniel Harris arrested for reckless driving\n\n> Colbie Young arrested, suspended from team", "label": 1}
{"text": "Cope", "label": 1}
{"text": "Georgia is undisciplined and stupid.", "label": 1}
{"text": "Tell me you're not coping well with out telling me you're not coping well.", "label": 1}
{"text": "30-15", "label": 1}
{"text": "Lordy get out of here go enjoy your day off", "label": 1}
{"text": "Still salty about that loss, eh?", "label": 1}
{"text": "I’ve seen you post several times. You must be really bitter about getting spanked at your home stadium.", "label": 1}
{"text": "You’re so weird.", "label": 1}
{"text": "Bro, if losing to us gets you this riled up, you’re definitely not cut out for the SEC lol", "label": 1}
{"text": "Other teams have done the throat slash celebration. Stop being mad about losing to a better team", "label": 1}
{"text": "Ours seem to mostly be about regional DAs who actually Love Criminals", "label": 1}
{"text": "wow that one chick was kind of hot im lonely", "label": 1}
{"text": "Meh, you still mad at the takedown we gave you. ", "label": 1}
{"text": "A play can be both 1) a run play and 2) not be considered a part of the “run game” because it’s not a scheme or concept you are consistently running. \n\nLike throwing a flea flicker and saying “the passing game is really coming together”, when it’s something you run basically once. \n\nAnd stop calling me dawg.", "label": 1}
{"text": "It’s okay bud", "label": 1}
{"text": "It must be cool being a Ped State coach bc no matter how bad you are all you have to say is “oh yeah well at least. I kids got raped on my watch” and you’re a winner.", "label": 1}
{"text": "Might want to proofread before posting there friend", "label": 1}
{"text": "It's like the trifecta of inevitability: death, taxes, and Franklin always falling short in the clutch moments. Some things just seem destined to stay the same, no matter how much we hope for a different outcome.", "label": 1}
{"text": "Edited. You got the point I’m sure.", "label": 1}
{"text": "Don't kink shame.", "label": 1}
{"text": "He will be a problem for defenses on Sundays!!", "label": 1}
{"text": "HOW BOUT THEM DAWGSSSSS", "label": 1}
{"text": "They will all circle jerk later and bark at each other during their orgy.", "label": 1}
{"text": "you say \"open borders\" like it's a bad thing\n\nopen borders are a core American value, they're the only option consistent with what this country was founded on, there's a reason we had open borders for the first 100 years we were around", "label": 1}
{"text": "Not here bro", "label": 1}
{"text": "Also, who the fuck goes to Kennesaw state lmao. Fuck ghetto school", "label": 1}
{"text": "Shocked that little meth head didn’t have his ankles snap there", "label": 1}
{"text": "On the (mister) bright side, this is the last weekend of political ads during football season for another couple years.", "label": 1}
{"text": "It's only going to be two years because of midterms.", "label": 1}
{"text": "Siri define “couple”", "label": 1}
{"text": "Potentially 2016-2020 length of 2 years", "label": 1}
{"text": "Thank fucking god", "label": 1}
{"text": "I'm writing in Dan Lanning for every race. quackquackquack", "label": 1}
{"text": "This is true", "label": 1}
{"text": "Does anyone know anyone that actually thinks we’re really on the brink of WW3? Who are these people?!?!", "label": 1}
{"text": "That’s the trick:  we’re always on the brink we just forget it sometimes.", "label": 1}
{"text": "Is it safe to go outside? From the ads on TV it seems like the apocolypse has arrived.", "label": 1}
{"text": "Trying to scare people into voting ig. \n\nAnd ruining football games. Ad breaks are bad enough on non election years.", "label": 1}
{"text": "Let's try to keep politics out of football.", "label": 1}
{"text": "What is tech's play calling???", "label": 1}
{"text": "Michigan in 2 years going to be in this time of year cause of an open governors seat!", "label": 1}
{"text": "Cheers to that!", "label": 1}
{"text": "The rich kids at Iowa State finally get some humble pie", "label": 1}
{"text": "Aww millionaire donors gonna be mad?", "label": 1}
{"text": "and Ryan Day is 6-0 against the Fighting Sanduskies", "label": 1}
{"text": "Joe Kent’s ads tell me the city I live in has burnt to the ground. Went to Freddie’s at halftime, still there ", "label": 1}
{"text": "I'm so glad I now know who to vote for! lol", "label": 1}
{"text": "Apparently there's a bunch of US citizens out there begging for roofing jobs but can't find any because the border or something.", "label": 1}
{"text": "Maybe next time lil bros 🤣", "label": 1}
{"text": "Lmfao imagine cheering this win on. With Lagway in you guys would have been throttled", "label": 1}
{"text": "I mean you’re from Georgia, for all we know your aunt probably has a dick", "label": 1}
{"text": "It’s pretty cool they put in that commercial for people with intellectual disabilities just for Carson.", "label": 1}
{"text": "Cope lil bro", "label": 1}
{"text": "there's still time to delete this, you know...", "label": 1}
{"text": "Lmao lil bro coming from Georgia fan. Bro’s probably playing a banjo in between scenes of you squealing like a pig if you know what I mean", "label": 1}
{"text": "Shhhh https://i.imgflip.com/743sea.jpg", "label": 1}
{"text": "Is that you?", "label": 1}
{"text": "I mean you’re the Georgia fan lmfao", "label": 1}
{"text": "I genuinely don’t understand what you’re trying to show me lol", "label": 1}
{"text": "THE GOOD GATORS WON THIS GAME BIGLY IN THE FIRST HALF, KIRBY “NOT SO” SMART STOLE THIS GAME WITH THEIR ILLEGAL MAIL IN TOUCHDOWNS! I’VE GOT LAWSUITS DRAWN UP TO CHALLENGE ALL OF THESE ILLEGAL GEORGIA POINTS!  MANY PEOPLE ARE SAYING WE WON THIS GAME!\n\nHAVE YOU SEEN ATHENS, THEY ARE EATING THE DAWGS, THEY ARE EATING THE DAWGS I SAW IT ONLINE, THEY ARE EATING THEM. IF OUR SEC COMMISSIONERS HAVE THE COURAGE TO DO WHAT’S RIGHT THEY WILL GIVE US THIS WIN.", "label": 1}
{"text": "You live where Deliverance (1972) was filmed I know what you backwoods Georgians are up to", "label": 1}
{"text": "I live in Alpharetta?", "label": 1}
{"text": "The cocks rise, shoot their shot, then go flaccid.", "label": 1}
{"text": "Imagine thinking people are graduating from the “University” of Georgia", "label": 1}
{"text": "Flair up lil girl", "label": 1}
{"text": "No, some of us still watch Florida as Alumni. We would never donate to a horribly corrupt institution that is basically another arm of the governor. But this isn’t Miami, most of our fans went here.", "label": 1}
{"text": "They handed you your ass bum", "label": 1}
{"text": "https://www.espn.com/college-football/recap/_/gameId/401628404", "label": 1}
{"text": "That’s interesting considering Florida is one of the states experiencing not only the largest influx of educated individuals but also its states school (well one of them anyway) is providing premier public education not found in the south. Public is public, but still. A 10 second search can get the sources. I think our governor is doing just fine. \n\nhttps://www.newsweek.com/florida-surge-college-educated-americans-1896668\n\nhttps://nces.ed.gov/blogs/nces/post/the-where-of-going-to-college-residence-migration-and-fall-enrollment\n\nhttps://www.flchamber.com/breaking-down-migration-in-and-out-of-florida/\n\nhttps://usafacts.org/articles/where-are-students-moving-to-attend-college/", "label": 1}
{"text": "Well, more real than LSU at least", "label": 1}
{"text": "I sure can't wait for a TCU fan to unironically make a Baylor rape reference.", "label": 1}
{"text": "1939", "label": 1}
{"text": "1939", "label": 1}
{"text": "1939", "label": 1}
{"text": "We have no room to talk anymore hiring Briles", "label": 1}
{"text": "It happens every year, I think", "label": 1}
{"text": "Well of some dumbass does let's make sure they're downvoted", "label": 1}
{"text": "1939", "label": 1}
{"text": "Allred giving me regrets voting for him with these reminders that he went to baylor", "label": 1}
{"text": "38-23", "label": 1}
{"text": "Aww buddy you already used that one. ", "label": 1}
{"text": "1939", "label": 1}
{"text": "Ebb and flow. Wisconsin took Iowa’s place and reached lofty heights for the first half of the 2010s. Iowa has been very consistently “good” with flashes of “really good” over the past decade or so.", "label": 1}
{"text": "Well there’s the other side of this, too, which is the large percentages of faculty who either have left or plan to try. So that may be what the original post was referencing. I can’t claim any expertise on Florida demographics, my only point was that the original post wasn’t saying anything about UF’s academics being bad. Resume fighting amongst yourselves, I’m out of my depth!", "label": 1}
{"text": "This is a football sub, buddy. We didn't come here to play school and bringing academics up just shows your projected insecurity", "label": 1}
{"text": "That play to the Kitzelman was THE textbook definition of targeting.   Defenseless receiver, hit with the crown of the helmet, after the defensive player launched.\n\nWhy was that not immediately flagged?", "label": 1}
{"text": "Wasn't targeting, just a good hit w shoulder pads directly on ball", "label": 1}
{"text": "Bro that hit was clean af", "label": 1}
{"text": "Looked like he hit him in the chest to me", "label": 1}
{"text": "Nowhere even close my guy", "label": 1}
{"text": "That seems pretty conclusive!  Florida losing people seemed a little fr fetched to begin with.", "label": 1}
{"text": "He literally made contact first with the forehead of his helmet.", "label": 1}
{"text": "Fake news, wanker.", "label": 1}
{"text": "Could not disagree more", "label": 1}
{"text": "If you launch with the crown of the helmet it’s targeting.  Nothing else need apply.", "label": 1}
{"text": "I mean you can disagree all you want but you’re wrong. Stop being soft", "label": 1}
{"text": "Incorrect", "label": 1}
{"text": "My guy, it’s the rule book.  We don’t get anywhere near even calls.  That is a GREAT example.", "label": 1}
{"text": "My guy, it’s the rule book.  We don’t get anywhere near even calls.  That is a GREAT example.", "label": 1}
{"text": "they need to feed the ball to bussy more", "label": 1}
{"text": "I think sucking ass is what got Penn State in trouble. ", "label": 1}
{"text": "The same people that copy and paste public notices that Facebook can’t have their data.", "label": 1}
{"text": "yeah, y'all sure have lost every time in tuscaloosa", "label": 1}
{"text": "“2 retards fighting” type of game", "label": 1}
{"text": "17-7 to an unranked Louisville team, at home in a game you need to make the playoffs?\n\nYIKES!?!?!?", "label": 1}
{"text": "Tbf, they are better than FSU…. 😂", "label": 1}
{"text": "Everyone go vote! Let’s let Cancun Cruz out!", "label": 1}
{"text": "Why is a Wake fan here, you all are terrible", "label": 1}
{"text": "When was the last time Wake contended for the playoffs?", "label": 1}
{"text": "Dude, just get off Reddit and go outside. You’ll feel so much better", "label": 1}
{"text": "POV: the homeless guy on public transport ranting to himself in the back", "label": 1}
{"text": "Kentucky getting the Patrick Mahomo treatment", "label": 1}
{"text": "ok, so from jumping back from thread to thread, i *think* i've worked it out that from the canes perspective, i should want Clemson and SMU to *lose* tonight, right? pretty sure. fuck it, its saturday night, im drunk, im just gonna roll with it.\n\nbut im pretty sure im right", "label": 1}
{"text": "ok, so from jumping back from thread to thread, i *think* i've worked it out that from the canes perspective, i should want Clemson and SMU to *lose* tonight, right? pretty sure. fuck it, its saturday night, im drunk, im just gonna roll with it.\n\nbut im pretty sure im right", "label": 1}
{"text": "We get it, you're a pathetic loser.", "label": 1}
{"text": "Clemson .. we need to Talk. 😭😭You are the Frauds", "label": 1}
{"text": "All that talk about Miami being Frauds hmm😂😂😮‍💨", "label": 1}
{"text": "Get fucked, Iowa State", "label": 1}
{"text": "ah. well the thing is sir, i just happen to *not* be a clemson fan, most regrettably.", "label": 1}
{"text": "No. Our defense is ass.. but at least we can have a shootout with Any team. Yall put up 7 fucking points", "label": 1}
{"text": "Miami defense is ass but at least they put up 50 on Louisville Wtf is this 🤣", "label": 1}
{"text": "you mean, pitt winning tonight and then losing in a later week?\n\nideally \n\n>If clemson and smu lose\n\ntonight wraps it up, right? we would fully control our destiny", "label": 1}
{"text": "Clemson no playoffs for you 🕺💔💔", "label": 1}
{"text": "Let’s fucking gooooooooo!!!", "label": 1}
{"text": "Where you at now talking your shit?", "label": 1}
{"text": "Which of your 5 losses should I start with? I'd usually pick Vandy, but hey, they beat bama!", "label": 1}
{"text": "lol Castro was holding his helmet like “oh that should’ve been picked” only for Jackson to somehow end up with it.", "label": 1}
{"text": "why should i fake emotions i don't have? like you guys aren't actively crying rn because a person you don't know got seriously injured, why should I bother?", "label": 1}
{"text": "Big time hackey sack vibes from that pick.", "label": 1}
{"text": "Tell your kids about Iowa with a functioning offense.", "label": 1}
{"text": "you better keep #4 nice and clean when we come take it", "label": 1}
{"text": "This ain’t basketball, homie.", "label": 1}
{"text": "We don't expect you to cry, we expect you to not be a douchebag.", "label": 1}
{"text": "Does Locke not know how to slide?", "label": 1}
{"text": "bring\n\nit\n\non.\n\nnothing we love more than the hate.", "label": 1}
{"text": "i don't think it's being a douchebag, everyone's already has their own shit to deal with, no one actually cares about people or things that don't affect them, it's like human nature.", "label": 1}
{"text": "see ya jan 20", "label": 1}
{"text": "Pretty cool that Wisconsin’s WR was already blocking downfield before the ball was caught.", "label": 1}
{"text": "Thanks for helping us beat the allegations 👍👍👍", "label": 1}
{"text": "You’re a real piece of work.", "label": 1}
{"text": "don't get what you meant by that, but I don't feel like having a reddit debate on morality, have a good one though", "label": 1}
{"text": "I think opting for a FG should be a fireable offense here.", "label": 1}
{"text": "Damn, the baseball field looks real nice.", "label": 1}
{"text": "I hope Quinn and Archie both have long careers, become huge rivals, and battle for superbowls on a yearly basis\n\n....in a way that helps tua and the dolphins", "label": 1}
{"text": "Gotta score here for me to feel comfortable. I’ll take a FG.", "label": 1}
{"text": "Arkansas only has so much it can do. I don't think Arkansas will ever move on from Pittman, and they'd need a huge hire in order to be competitive if they were to fire him. \n\nIf he beats Texas, they'll never fire him.", "label": 1}
{"text": "They should just take this stupid fucking kid out back and shoot him already", "label": 1}
{"text": "Yea buddy!", "label": 1}
{"text": "Kirk is loyal to upper classmen to a fault. This has played out several times over the years at the QB position.", "label": 1}
{"text": "Look on the bright side. We could be Penn State right now. At least our players and coaches know what consent is.", "label": 1}
{"text": "Guys, it’s 2002 again. We have a dominant RB and a mobile QB with a stifling defense.", "label": 1}
{"text": "That also would have been acceptable.", "label": 1}
{"text": "Holy shit how did he recover that.", "label": 1}
{"text": "Not sure why the LB just sat in the gap and let KJ2 run to him. He could have plugged that up.", "label": 1}
{"text": "lol I think I just made almost the exact same comment. Whisky is cooked tonight.", "label": 1}
{"text": "Barely.", "label": 1}
{"text": "I’m more concerned about the reliance on shotgun.", "label": 1}
{"text": "Last week.", "label": 1}
{"text": "What a curious number for the cutoff. ;)", "label": 1}
{"text": "I’ve lived up in central WI since 2020 and I finally got around to having Glass Nickel a month or so ago. That place rules.", "label": 1}
{"text": "Piss off deserter.", "label": 1}
{"text": "Texas A&M will never win at an elite level", "label": 1}
{"text": "We own the ACC. every thread is our thread", "label": 1}
{"text": "Wicked is tremendously popular and has a huge following.", "label": 1}
{"text": "cardinals!!!!!!!!! love you baby woooooo!!", "label": 1}
{"text": "It’s an extremely solid flagship beer. There are better New Glarus, but Spotted Cow is always good.", "label": 1}
{"text": "How does a school like FSU not have a competent QB on the roster? And how did the same school look at DJUs college career and think that, that was the answer?", "label": 1}
{"text": "> Your account is a week old….probably just like your Miami fandom\n\nyeah just like your playoffs hopes", "label": 1}
{"text": "It also just looks lame and uninspired. Why is it a bull? Why does it lack any detail? It just sucks.", "label": 1}
{"text": "oh, i'm plenty confident in myself. sure as hell more than you are, being openly stupid as an unflaired in a cfb thread. hope you're having the day you deserve", "label": 1}
{"text": " Fuck you Elko", "label": 1}
{"text": "What did Fickell do to piss if Kirk? Was he negative recruiting?", "label": 1}
{"text": "So that’s 4 games on the year scoring 40+ points.", "label": 1}
{"text": "I’m having a great day! Hope you are too <3", "label": 1}
{"text": "Don't let this Iowa win distract you from the fact that the most accurate pollster in the country just released a poll saying Harris is winning Iowa", "label": 1}
{"text": "It's a great day in Iowa.", "label": 1}
{"text": "wait you talking about Ann Seltzer????", "label": 1}
{"text": "HELL YEAH\n\nBUT ALSO --- GO VOTE ---", "label": 1}
{"text": "HOLY FUCK MIAMI FANS SHUT THE FUCK UP YOI HAVENT ACCOMPLISHED ANYTHING IN OVER 20 YEARS NO ONE GIVES A FUCK YOU GOT BAILED OUT YOU WILL GET YOUR DICK STOMPED IN DURING THE PLAYOFFS.  FUCK OFF PLEASE", "label": 1}
{"text": "The iowa state loss or the presidential poll projections?", "label": 1}
{"text": "Dam bruh thought I had a meltdown on this thread…😭 the hell this gotta do with anything", "label": 1}
{"text": "Because Alabama fans are too dim to comprehend.", "label": 1}
{"text": "Yes", "label": 1}
{"text": "jesus you guys have a whole lot in common with oregon fans, except theyre better drivers", "label": 1}
{"text": "The literal joke of college football, talking trash. Classic nd", "label": 1}
{"text": "They’re a bunch of idiots.  Let them be.", "label": 1}
{"text": "Hahaha", "label": 1}
{"text": "Yep, it's third. Selzer knows Iowa, if she says it's close, it's close.", "label": 1}
{"text": "Awwww... These poor Aggie cult members. So sad. So salty. \n\nGive me your down votes.. makes me hard af", "label": 1}
{"text": "Says the team that got 60 hung on em today.", "label": 1}
{"text": "Nobody.   You guys just love downvoting when sadness slowly creeps in.", "label": 1}
{"text": "Having to live vicariously through South Carolina must be fucking depressing lmao", "label": 1}
{"text": "The only thing that could make this better is that fat fuck on the Aggie sidelines tripping and getting trampled at the end of the game", "label": 1}
{"text": "Why did u feel the need to make this comment?", "label": 1}
{"text": "This is terrible behavior bro Jesus", "label": 1}
{"text": "He’s a terrible human. \n\nFuck him for abandoning our kids in the manner he did.", "label": 1}
{"text": "Stay classy 👍", "label": 1}
{"text": "Enjoy the victory man, rooting for him to be trampled is insane.", "label": 1}
{"text": "You're calling someone else a terrible human being? The irony", "label": 1}
{"text": "What is wrong with you", "label": 1}
{"text": "Go sing some more about Bevo. \n\nFuck Elko today, fuck Elko tomorrow, fuck Elko forever.", "label": 1}
{"text": "U mad bro?", "label": 1}
{"text": "🚨 Breaking News 🚨\n\nAggies violated by squad of black cocks this evening in Columbia. \n\nDespite their efforts, A&M struggled. Beamer and his gang of cocks pummeled the helpless Aggies as Reveille looked on in helpless disgust. \n\nThis will only add to the struggles with Battered Aggie Syndrome afflicting College Station.", "label": 1}
{"text": "In other Breaking News, South Carolina to start Johnny Sins At QB for their upcoming matchup vs Clemson", "label": 1}
{"text": "That was one fine black cheerleader. Many are pasty", "label": 1}
{"text": "Weird ass comment brother", "label": 1}
{"text": "I'm not gonna say there's no chance of that happening but\n\nIf it happens I'll eat a solo cup of dog shit", "label": 1}
{"text": "12th man says \"Rough! Tough! Real! Stuffed in our asses! They beat the hell out of us! Call it a night!!\" 12th man then reacted to a rooster crowing and pointed a hand pistol at his head, screaming \"AAAAAAAAAA\"", "label": 1}
{"text": "HAHAHAHAHA Fuck you clemson", "label": 1}
{"text": "Hell yeah 💯💯💯", "label": 1}
{"text": "What the fuck did you just fucking say about me, you little bitch? I'll have you know I graduated top of mellophone section in the Trojan Marching Band and I've been involved in numerous home and away games, and I have over 30,000 confirmed Conquest horn calls. I am trained in drive-it marching and I'm the loudest player in the entire Big Ten conference. You are nothing to me but just another target. I will Tribute to Troy the fuck out of you with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across USC’s IT network and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can kill you in eight notes, and that's just with my right hand. Not only am I extensively trained in holding the chair, but I have access to the entire arsenal of the USC Trojan Marching Band and I will use it to its full extent to wipe your eardrums off the face of the earth. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn Husky. I will play Conquest all over you and you will regret it. You're fucking going 7-5, kiddo.", "label": 1}
{"text": "I love how much energy you spend thinking of us.  :)", "label": 1}
{"text": "Eating red solo cups of dog shit is  just like one of A&M’s quirky traditions though, right?", "label": 1}
{"text": "20-13 over #3 undefeated conference rival 🖕🏽😎🖕🏽", "label": 1}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "Hey that’s not nice", "label": 1}
{"text": "And yet you are in this thread because we live in your heads.  ;)", "label": 1}
{"text": "what is surprising about that?", "label": 1}
{"text": "I go to the scUM and CSU threads when they lose too lmao, it's called shaudenfreud brother. 🤷🏽‍♂️", "label": 1}
{"text": "It would get me pretty far into the weeds of election modeling, but the short version is that Selzer being right or close to it, either means a lot of pollsters are doing a very poor job in correlated states, or we just experienced a significant realignment without noticing.", "label": 1}
{"text": "Definitely! James Franklin has a knack for creating those memorable moments that are so uniquely him. It's like he has a signature style that stands out in every situation.", "label": 1}
{"text": "anybody got a working stream for this? thetvapp and buffstreams are both down for me", "label": 1}
{"text": "Search for it in youtube. There's a stream there.", "label": 1}
{"text": "Listen, I’m sure you’re a nice person. In fact, there’s a strong possibility we’d be friends IRL. But this is college football and I fuckin hate everything about clemson. I hate your weak ass schedule that you use to pump stats. I hate your schmuck of a coach (again, I think he’s a nice person but I loathe his lil ole clemson bullshit) who is somehow always the victim. I hate that new spring church funneled money into your athletics program and you reaped the benefits with zero fucking penalty. I hate so so much about everything associated with that kitty cat bitch paw print.", "label": 1}
{"text": "Viprow", "label": 1}
{"text": "No they are actually quite different but nice try to attempt at “well they’re all doing it…not our fault”. UT has more than its fair share of entitled liberal activists on that campus who think they should riot whenever they don’t like something.", "label": 1}
{"text": "Much appreciated brother", "label": 1}
{"text": "Your ability to smack talk is on par with your german.", "label": 1}
{"text": "Ooooh I sense some feelings right now? Are you alright?", "label": 1}
{"text": "Reading Aggie comments just reinforces my love for Longhorn fans.", "label": 1}
{"text": "i guess what i mean to say, is why is it being close a surprise? what’s the status quo?", "label": 1}
{"text": "I wonder if he’s upset about the bottle thing or if there’s any other factors?🤔🤷🏻‍♂️", "label": 1}
{"text": "Give me a fucking break. Defending Hugh Freeze is absolutely disgusting. You can be better than this.", "label": 1}
{"text": "Suck it. Or keeping sucking Texas fans as you were.", "label": 1}
{"text": "That makes senses. Both fan bases have something in common.", "label": 1}
{"text": "Bless your heart.", "label": 1}
{"text": "Just remeber who’s the little brother <3", "label": 1}
{"text": "Brother, you are in anywhere from 1 to 3 cults. Go take your turn on the jizz jar and go to bed", "label": 1}
{"text": "Texas A&M getting blown out by the cocks is biblical", "label": 1}
{"text": "Not in a couple months. The watch lists will look very different.", "label": 1}
{"text": "Imagine if porn was advertised this much lol", "label": 1}
{"text": "😂😂😂 the classic Notre Dame lost to Northern Illinois argument even though Notre Dame is one of the best team teams in the Country. Hey dumbass Georgia almost lost to Kentucky whose just as bad as Northern Illinois.", "label": 1}
{"text": "111,030 People????\n\nThat's almost as many at Penn State that knew about Sandusky!! Actually, one less if you count JoePa", "label": 1}
{"text": "stake.us/?c=jqAu7TY5 free 55$ for signing up \nGo to settings/general/offers code BALLISLIFE\nI’ve won 5k playing keno on stake originals this site is super legit", "label": 1}
{"text": "Kirby smart also has players dying left and right due to dui and driving accidents . Literally had a staff member driving drunk with layers in the car when all four died . Their QB had to check in to rehab for alcohol abuse . So I would much rather have our culture than that \n- Kirby himself said that it's easier to rationalize a snub when you have a loss versus going undefeated . He even says he is surprised we played the game . Go read his comment before and after the game \n\n- lastly I would ask you is Christian McCaffrey  selfish ?", "label": 1}
{"text": "What watch lists?\n\n\n\\- Project 2025", "label": 1}
{"text": "> Kirby smart also has players dying left and right due to dui and driving accidents . Literally had a staff member driving drunk with layers in the car when all four died\n\nAs much as I hate defending Georgia, there's some pretty basic factual errors in here that really draw away from the rest of your argument, mainly that only two people involved in the program have died in driving related incidents. A player going to rehab for alcohol abuse is also a crazy thing to hold against a program for a variety of reasons, especially when that player had already left the school.", "label": 1}
{"text": "I am a certified Cyclones hater, but the conference championship drought is wild. Your conference titles come before WWI and they were shared with Nebraska in a conference with six teams, two of which no longer play Division 1 football. Iowa had just left the conference before ISU won its consecutive titles", "label": 1}
{"text": "Such is life as an Iowa fan.", "label": 1}
{"text": "Cade has to realize he has no future past college, at least not in the NFL. That has to be a really tough pill to swallow and these last few weeks might be the last chance he ever has to play ball. I feel bad for him - by all accounts, he does everything right and he’s a good teammate. It sucks it just never worked out for him here.", "label": 1}
{"text": "The first round bye is easily the easiest way to the championship, when you consider player fatigue and injuries. Plus seeding. I've never bought the argument that the #5 seed has the easiest spot because they get to play #12= the top 4 seeds don't have to play at all and #12 can still beat you.\n\nShould have been an 8 team playoff imo.", "label": 1}
{"text": "You will, bottom feeder ", "label": 1}
{"text": "Enjoy being Colorado's bitch", "label": 1}
{"text": "Media won’t give a 💩 about it because the cop is black and he’s beating up an old white man.", "label": 1}
{"text": "Thank you Tucker.", "label": 1}
{"text": "I don’t know why this is downvoted. Reverse the race and this would already be a national story", "label": 1}
{"text": "You people always worried about race, notice the 2 other white cop beating their white suspects but i bet you saw the black guy and just went red.", "label": 1}
{"text": "The idiocy of your comment given that the Reddit news is linked to media coverage of the story is fucking delicious. You are clearly the dumbest person in the room", "label": 1}
{"text": "As a racist, there are probably a lot of things you don’t know.", "label": 1}
{"text": "Notre is was and will forever be ass, propped up by a strong TV market. Losing at home to niu and then their only \"quality\" win getting dog walked proves that", "label": 1}
{"text": "Is it NSFW due to how much the crime analyst was deepthroating the officers in that statement? Dude went to bat for them without full context more than their department did.", "label": 1}
{"text": "It does not surprise me that someone who would say this is also someone who has 5-6 drinks every night and also comments on NSFW subreddits.", "label": 1}
{"text": "Just a heads up that this comment reads as you self-identifying yourself as a racist lol", "label": 1}
{"text": "Only if you don’t read too good.", "label": 1}
{"text": "Of course you don't. By your own admission, \"Fox is to [sic] left leaning.\"", "label": 1}
{"text": "Stay off this sub with your racist BS", "label": 1}
{"text": "Right reverse the race and we have riots in the streets and looters.  Downvote the truth all you like nuts the truth.", "label": 1}
{"text": "I’ve never once talked about pole vaulting except when I said that the American who represented Sweden in the Olympics was American and not Swedish, which is only offensive to morons such as yourself", "label": 1}
{"text": "Yup, that’s the braindead take lol", "label": 1}
{"text": "Like Ron Desantis! Dumb, underperforming, and irrelevant", "label": 1}
{"text": "King Ward\n\nJeanty\n\nDillion\n\nTravis\n\nShanders", "label": 1}
{"text": "If Iowa sticks to the same game plan, they’re going to destroy UCLA. It’s good that Iowa seems to have found a groove, but it’s a little frustrating that Iowa could very easily be 7-2 or even 8-1 right now had Brandon been given the reins at the start of the season.", "label": 1}
{"text": "All hail his grace. Usually I'd say Nowell's head is destined for a spike, but I actually quite his head where it is. So I'll send him some Tequila instead.", "label": 1}
{"text": "Wait, you don’t win parlays? I’m at about 45-55 on 3-4 game spread parlays this year? I’ve profited thousands and never bet more than 200-300 on a Saturday? Just because you can’t select teams correctly doesn’t mean parlays don’t win for everyone. I also know a guy with a computer predictive model and he hits 40-55% of his parlays. \n\nI bet singles as well, same games. I make more on the parlays with the same games majority of weeks. Guess I’m just some college football savant that breaks statistics then? What you mean is in the end more parlays lose than win and most don’t profit off them. But it’s ignorant to just label them write offs. Parlays have made me more than 1000$ more than Singles would have just this college football season alone. If you want to act like I’m just some witch though I’m cool with that. Or call me mystic mac because I predict deez tings. Maybe you are right and I’m just better than the rest of you (sarcasm, this guy is just incapable of not speaking in absolutes)", "label": 1}
{"text": "You sound kind of insane my guy. If it works good for you but what the guy is saying is that they don’t give you good odds for the risk involved. It’s kind of like rake in poker. You can still win money if you’re good, you just have to win a disproportionate amount to make a profit compared to what you would normally expect. AKA a bad idea to try to make money for the vast majority of people", "label": 1}
{"text": "“Never lived in Sweden” lol. You continue to prove your stupidity ", "label": 1}
{"text": "That's not really true. It depends. If they give you true parlay odds (i.e. multiplying the single game odds together) then it's the same juice as betting singles. Some places do screw you on parlay odds though, like maybe +1000 for a 4-game parlay when it would be +1228 doing it the correct way", "label": 1}
{"text": "Oh waaah, someone threw a plastic bottle at a grown man. Boo fucking hoo. Nobody is in danger, nobody is going to get hurt, just shut up and change the channel if you don't like it. CFB Karens ruin the sport for everyone.", "label": 1}
{"text": "My question is, how do they not have a single competent QB on their roster? And how did they look at DJUs college career and think that he was the answer?", "label": 1}
{"text": "That’s ironic because what’s actually insane is telling people you outright won’t win on something that has a chance of winning. Stating people have 0% chance on something that’s above 0 is very ignorant.  I was trolling him at the end because it’s a moronic comment to speak in absolutes like that. Which is why I commented what I did, it illustrates he’s making A bunch of statements that are just not true, and also misleading. That’s why I trolled him, if you can’t understand obvious sarcasm and think I’m actually calling myself better than anyone else, or that Im mystic max or some savant. I’m not insane you are just very stupid. \n\nLmao what?! that’s not what he said at all? He claims “YOU DONT WIN FUCKING PARLAYS” where in that does he mention odds or even mention the risks? He just blindly slaps a one size fits all label that “YOU DONT WIN FUCKING PARLAYS” im not sure how bad your reading comprehension must be to think that but I’m assuming you didn’t even re read it before making this comment. \n\nAlso no that’s not what it’s like, I literally touched on that above. I bet the same teams on singles and parlays, I won the same amount of games as they are the same games and I get paid out significantly more on the parlays then the singles. \n\nThe irony of this is you tried to call me insane for basically joking and trolling the guy and saying “yeah you must be right and I’m just great” (sarcastically of course) and your rebuttal is to come here and basically say in other words “yeah you are that good” \n😂", "label": 1}
{"text": "They will be getting to 10 wins lol", "label": 1}
{"text": "Dude just shut the fuck up, you have no idea what youre talking about", "label": 1}
{"text": "Pics or it didn't happen", "label": 1}
{"text": "🧑🏻‍🦯 JoePa walking past the staff offices every morning", "label": 1}
{"text": "Wow, no room for error for the Cyclones from the coaches.", "label": 1}
{"text": "Ugh paywall.", "label": 1}
{"text": "More like /r/cfb ignoring the findings of the report vindicated JoePa", "label": 1}
{"text": "1-800-GAMBLER\n\nIt’s never too late to seek help bud", "label": 1}
{"text": "I’m 100% with you ✊🏻. These dorks don’t care about the truth, but if you read all the facts JoePa deserves some justice imo. And he got some! With the wins reawarded etc. I can also understand on some level, if he knew some seriously messed up stuff was happening, how could he be content with “procedure”. If I knew my neighbor was doing something like this, and I called the police and they did nothing. I wouldn’t let it go 🤷🏻‍♂️. I know that’s probably a bonehead take with a bunch of half-truths… idk, it’s Sunday, I’ve had a few. Good day 😂", "label": 1}
{"text": "If the length of a message and not the substance of the message is what you are going on, you aren’t adding any validity to yourself, just removing credibility.\n\nIf you have to avoid the substance of the response and just blindly baselessly label “oh yeah you are addicted” when that had no relevance to the facts of the argument you aren’t making your point. You are just displaying you have a limited concentration span and can’t refute the argument but it calls your baseless opinion out.\n\nYes that’s right making an argument factually and coherently after an egregious comment that states 100% false statements as though they are fact , I’m definitely the one addicted to drama as you come and call my comment out with no substance to the call out whatsoever. Want to think it over and come back when you’ve got something that applies to me more than yourself?\n\n\nJust because you are stupid doesn’t mean anything I’ve said makes me a gambling addict lmao.", "label": 1}
{"text": "Is this the same copy and paste response you send to everyone with a little personalized flair at the bottom?", "label": 1}
{"text": "[Long screenshot](https://i.imgur.com/mQiY1US.png) warning.", "label": 1}
{"text": "I agree. \n\nHis biggest mistake & issue was not following up and ensuring this shit got out to the proper authorities. Not that he didn’t say or do anything & turn a blind eye. \n\nAlso some people STILL think Paterno raped which is insane ", "label": 1}
{"text": "I’m not super surprised by NDs overall rating, but really would have expected more gap between defense and offense.", "label": 1}
{"text": "When someone starts with \"you will not convince me.....\" then you know that they're not a serious person.\n\nYou're advertising what a clown you are right off the bat.", "label": 1}
{"text": "Florida State #1 special teams unit in the country! Give that coach a raise!", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "If that’s the case I’m happy he got beat up", "label": 1}
{"text": "This play could literally be shown at ref school to show what constitutes targeting. I don’t think any objective football fan would argue that this isn’t targeting.", "label": 1}
{"text": "Probably one of only a handful that will keep their job. Hail Papuchis, Mastro, and Fitzy 🙌", "label": 1}
{"text": "Draftkings brained", "label": 1}
{"text": "Unironically our special teams unit is one of the best I have ever seen any football team have. We might have the best punter AND best kicker in the country, and we've blocked like 3 or 4 FGs too.", "label": 1}
{"text": "Aww did my objective comment not align with your opinion and hurt your feelings? Cry about it more", "label": 1}
{"text": "Why does everyone lose their shit with aggressive stuff happens in the most hypermasculine game that has ever existed?", "label": 1}
{"text": "im open to being convinced, why do you think thats not targeting?", "label": 1}
{"text": "Yea SP+ is too low on NDs defense", "label": 1}
{"text": "I dunno, these sp+ rankings said we were the 60th best team. They might be regarded", "label": 1}
{"text": "Okay room temperature IQ OSU fan", "label": 1}
{"text": "Typical Georgia trash", "label": 1}
{"text": "And/or poach him for our own program", "label": 1}
{"text": "We beat ECU, have the same record, and yet we’re 2 spots below them? Makes no sense", "label": 1}
{"text": "Do we have some sort of connection to Miami?", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "Does this sub not allow pics? I’m having trouble adding pics. Do you want me to dm you?", "label": 1}
{"text": "Die", "label": 1}
{"text": "Auburn fans hate Freeze.  We didn't hire him, a few religious boosters did and we are stuck now.", "label": 1}
{"text": "Unfortunately, if trends hold up, then Hugh Freeze will be the next Senator from Alabama in about a decade.", "label": 1}
{"text": "How does a sportsbook set lines which guarantee a certain number of bettors win? I really hate that everyone can freely post on the Internet.", "label": 1}
{"text": "From the neighborhood perspective, looked like he was hired for his proven track record to beat Saban (about as much as Gus), and now Saban is gone and y’all really should’ve reevaluated your options", "label": 1}
{"text": "He was hired due to recruiting prowess (and Lane turning the job down at the last second), Auburn knew they needed someone who had proven an ability to recruit at an elite SEC level after Harsin cratered the talent level. Hugh has held up the recruiting end of the hire but has lost all ability to coach on game days, develop players and seems to be a dinosaur with regards to the portal.", "label": 1}
{"text": "You almost have the exact same staff as he had at Ole Miss...10 years ago.\n\nY'all should have rioted when it became obvious he didn't have any coaching connections to hire a proper staff.", "label": 1}
{"text": "Even then it feels a little funny. Like his historic ole miss class got blasted for being paid for (not to say everyone wasn’t also doing it), and now that it’s all above table, Auburn could still have this class because of their NIL with better on-field coaches.", "label": 1}
{"text": "To quote The Wizard in Wicked, “Elphaba, the most celebrated are the rehabilitated.”\n\nSorry. It sounds better when you sing it.", "label": 1}
{"text": "Yeah I mean most people who hated the hire aren’t active on message boards. You’re right though that he had plenty of fans. Everyone I know was pissed and don’t follow as much anymore", "label": 1}
{"text": "Yes he had an insane number of fans. You couldn’t say anything negative about him.", "label": 1}
{"text": "I did too. I've got plenty of receipts. I've been telling anybody who would listen that hiring Freeze was a huge mistake, even if you wanted to ignore the NCAA sanctions and the massive personal life red flags.  \n\nDude has never been a great coach, he just cheated hard and managed to beat Saban twice (while also losing 7 games in the two seasons he beat Saban)", "label": 1}
{"text": "Sounds like the 2024 election to me", "label": 1}
{"text": "I’d much rather be under the protection of TTU than the hated Cyclones.", "label": 1}
{"text": "Same. It’s why I left r/wde. Those people are insane.", "label": 1}
{"text": "Auburn is set up extremely well for the future roster wise. Nail the next hire and things could turn around very quickly", "label": 1}
{"text": "He was hired 100% because he beat Alabama in 2014/2015.\n\nHis career is basically Malzahn.  High School coach who can beat peak Alabama but also get shut out by Arkansas.  Malzahn at least sticks to coaching and doesn't make himself out to be a martyr when he does his weird shit.", "label": 1}
{"text": "Heh, I didn't exactly leave r/rolltide but I was permanently banned for making a \"your mom\" comment. When I asked if a perma ban was really necessary, I got muted...", "label": 1}
{"text": "Yeah the majority of Auburn fans Ive come across hated that hiring since Day One.", "label": 1}
{"text": "Is it just me, or did Texas A&M forget how to tackle? 😂", "label": 1}
{"text": "you might have an argument saying he hit him with the shoulder but  i think saying he didn't lead with the crown of his helmet is objectively false", "label": 1}
{"text": "It's as wild a thought as thinking tariffs will lower cost to consumers.  Yet... here we are.", "label": 1}
{"text": "Hence why everyone is saying it was a horrible missed call. I’m not sure what you’re missing here.", "label": 1}
{"text": "I don't even need an argument. It wasn't called on the field and wasn't overturned on review. You're reaching badly here.", "label": 1}
{"text": "\"Everyone\" being a bunch of casuals on reddit.", "label": 1}
{"text": "There should have been heavy penalties to off shoring", "label": 1}
{"text": "A lot of folks beyond the sphere of Reddit have called this out. It’s also funny to hear a Miami fan calling out casuals on Reddit. If there was a poll conducted for which program had the most casuals Miami would be near the top of that list. I get why you wouldn’t recognize this as targeting because you have tuned into CFB until recently when your team returned to relevance.", "label": 1}
{"text": "Targeting is not just about leading with the crown of the helmet. It can also be called when a player launches into another players head or neck area with either their helmet or their shoulder.", "label": 1}
{"text": "No one should think that. But some people think it doesn’t make a difference. That the company or country that is tariffed just eats the cost. And that’s not how thing ever generally work", "label": 1}
{"text": "The point of the post was to make light of the people who think tariffs will lower prices", "label": 1}
{"text": "This shouldn't come as a surprise when we have a consumer based economy.", "label": 1}
{"text": "Yeah, I got that, I just had a compulsive need to explain why.", "label": 1}
{"text": "I mean this happens in everyday world too. The super rich pass the cost on to the taxpayers while they take in bonuses and salary increases. It's not left vs right. That's just a distraction. It's rich vs poor and the rich are easily winning. ", "label": 1}
{"text": "Ok but the end result is still that you pay more for virtually everything. Also any consumer (I.e. worker) who isn’t in an industry covered by tariffs ends up losing out because the cost of their products goes up and they receive no benefits from the tariffs.", "label": 1}
{"text": "I don't think anyone was looking for a justification for tariffs.... \n\n\nSo it comes off as a defense of the argument that tariffs will lower costs", "label": 1}
{"text": ">No one thinks tariffs will lower cost to consumer.\n\nI have heard and read multiple people who believe *exactly* that, actually.", "label": 1}
{"text": "College football will always represent the current state of America", "label": 1}
{"text": ">I just had a compulsive need to explain why.\n\nYou’re officially a knighted Redditor, my son", "label": 1}
{"text": "A lot of folks who don't understand targeting apparently.", "label": 1}
{"text": "Apparently not since it was neither called on the field nor overturned on review.\n\nAgain, there are some really silly people dedicating a lot of time to wishing that the refs bailed out Cal.", "label": 1}
{"text": "No, I got the op, just felt a need to extrapolate.", "label": 1}
{"text": "Well good luck with the mental gymnastics. We will see what happens when you finally play a team that can play defense. That might not be until the playoff since the ACC is 🗑️ but it will happen eventually and the refs won’t be able to save you.", "label": 1}
{"text": "Has he considered running for the Senate when he retires in 15 years?", "label": 1}
{"text": "I agree, as someone that has to call India for their corporate help desk.  im convinced they’ve made it as bad as possible so employees just get so frustrated they just live with things not working.", "label": 1}
{"text": "Or, that raising costs of businesses through taxes or regulations don’t make prices higher for the consumer.", "label": 1}
{"text": "It’s good for people reading to understand even if the guy you’re replying to of course will, you’re good", "label": 1}
{"text": "I would change that to economics in general.  An alarming amount of people also don’t seem to know that raising taxes on businesses or implementing regulations that cost companies money also raise costs to end users.  No surprise they don’t understand it for tariffs.  \n\nplease note-  I’m not making an judgements on whether those rules should or should be in place.  Just that people don’t seem to get the end result.", "label": 1}
{"text": "Like, I cant decide which is worse.  An Indian call center, or an automated phone system that intentionally keeps you from talking with a live person.", "label": 1}
{"text": "A majority of folks recognize that this was a missed called so there is no mental gymnastics required on my end. And as a Nebraska fan I’ve seen a lot of targeting calls go against us (rightfully so) so I’ve seen plenty of examples and heard many different rules analysts explain the rule. Again I’m sure you’ve only recently retuned into Miami football since they’re relevant so I can understand your confusion.", "label": 1}
{"text": "Now you're claiming to speak for the majority?\n\nYou're hilarious, guy.", "label": 1}
{"text": "There are definitely people on this subreddit who probably needed that explanation, but would never ask. It's fine that he did that.", "label": 1}
{"text": "No one is saying tariffs are evil, they just make things more expensive by nature even in your circumstance. Every country protects their domestic economy through targeted tariffs, there are just certain politicians who act like it's a panacea.", "label": 1}
{"text": "True, it depends on other production abilities of nations that are not being tariffed and whether local production can compete even with the nation tariffed pushed down regarding market viability.  Regardless it pretty much always has some effect to that end, although not always as much as the government putting the tariffs in play would wish.", "label": 1}
{"text": "I dont know how many times I just speak gibberish into the phine after my nth time of telling the automation \"speak with a person\"\n\nEventually my nonsense makes it go \"transferring you to customer service\"", "label": 1}
{"text": "The Electoral College ain’t played nobody", "label": 1}
{"text": "KEEP POLITICS OUT OF SPORTS (unless it’s politics I agree with)", "label": 1}
{"text": "The electoral college makes the CFB playoff committee selection criteria look coherent", "label": 1}
{"text": "What are the Heisman odds for T. Cruz?", "label": 1}
{"text": "yes, we get it, you have a political axe to grind in a non-politics post.", "label": 1}
{"text": "Or as wild as thinking price controls won’t impact quality and safety", "label": 1}
{"text": "In that spirit: I'm voting Jill Stein because I think she's best for the future of college football.", "label": 1}
{"text": "[You didn’t need to post that](https://youtu.be/o048xeNQ3Wo?si=5rFr-o7VifER9toM)", "label": 1}
{"text": "Thinking the same thing lolll", "label": 1}
{"text": "Except that the SEC is good at football and not traditionally 'high ranked' states on any metric :)", "label": 1}
{"text": "The meaner ones just disconnect you.", "label": 1}
{"text": "You guys are still playing football? \n\nDon’t know how to flare, but talking FSU. They quit.", "label": 1}
{"text": "His escapability is unmatched.", "label": 1}
{"text": "I swear I’ve had Boomers (and a few younger) insist that “that’s a different kind of tariff.” I’ve asked them to show me the statutory basis for this new magic tariff, and the best they can find are tweets. I just can’t anymore…", "label": 1}
{"text": "Jesus Christ you came here and couldn't resist a comment like this? Get lost dude.", "label": 1}
{"text": "So uh... What do you think of the rising cost of college football to the consumer?", "label": 1}
{"text": "Yeah, me too, I'm always lost for words in the presence of their stupidity.", "label": 1}
{"text": "Utes need to spend the next year practicing the Mormon faith. Dumdumdumdumdum", "label": 1}
{"text": "SHUT THE FUCK UP ABOUT POLITICS! \n\nThis is r/CFB, where we come to escape politics.", "label": 1}
{"text": "Because it is wrong, or rather misleading. Tariffs don’t directly determine prices, rather they can be used as a tool to shift to more reliance on domestic products instead. Which is why higher tariffs can and likely will lead to a better domestic economy overall. This doesn’t, however, apply to things that we can’t make domestically, like semiconductors and oil.", "label": 1}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "Incorrect. There are many instances where tariffs benefit the economy", "label": 1}
{"text": "No there are not.", "label": 1}
{"text": "And it can, but some followers of a certain person ignore any rational discussion and just believe that the other guy who may or not be a shade of orange, is bad. Reddit is full of way too many amateur economists and it shows", "label": 1}
{"text": "It’s ok to be wrong. It’s not cool to deny it though", "label": 1}
{"text": "Nice try bot.", "label": 1}
{"text": "TDS in full effect", "label": 1}
{"text": "I just get confused why Mormons exist when everybody has access to the internet and can see when their spin-off was created and by whom.", "label": 1}
{"text": "Agreed.  Assuming they both keep winning they both deserve a big IMO.", "label": 1}
{"text": "Half of them already do.", "label": 1}
{"text": "Make the Utes tithe ten percent of their points for the next year.", "label": 1}
{"text": "they couldnt film something like that now sadly", "label": 1}
{"text": "Mostly the hand and the occasional couch.", "label": 1}
{"text": "Claiming the other side ignores any rational discussion is precious. I suspect you might even believe it. Fabulous!", "label": 1}
{"text": "It fucking sucks and I find myself paying less attention to teams that aren't my own than I ever have. \n\n\nOddly enough my NFL watching over the last 3 years is up.", "label": 1}
{"text": "Hello everyone, this is your captain speaking…", "label": 1}
{"text": "Shameful! This is not what the Lions stand for. It’d not what I stand for, my dad, or my son. If you’re upset, show it on the field.", "label": 1}
{"text": "Delete this shit", "label": 1}
{"text": "So fake", "label": 1}
{"text": "This facebook account is clearly satirical or intentionally making fake stories to get Facebook attention. The fact you are spamming this tells us you are part of this group. Get the fuck out of here you soft ass bitch", "label": 1}
{"text": "And??? Can I come to the baptism??", "label": 1}
{"text": "They should make them watch that commercial for hours on end as punishment.", "label": 1}
{"text": "Hi JD!", "label": 1}
{"text": "Mods! I've been doxxed! I'm the victim! I expect the full force of the law against this person!", "label": 1}
{"text": "That's the result of \"Doing your own research.\"  That is what I would expect from a group that celebrates anti-intellectualism.", "label": 1}
{"text": "Yeah, makes you wonder exactly what the economics at Wharton looks like doesn't it?", "label": 1}
{"text": "the HuNdReDs Of ThOuSaNdS oF dEaD pEoPlE…\n\nThese games were played by the lowest risk population in front of no fans. You guys were fine to start the season. But after going 2-4, you buckled and literally quit. 75+ other teams kept playing. May as well cite “contract tracing”!", "label": 1}
{"text": "That is extremely offensive I had close relatives die of Covid.", "label": 1}
{"text": "You’re making fun of people that died in a pandemic. Over a million.  Including my relatives. I think you behaving out of line.", "label": 1}
{"text": "You openly laughed and said one hundred thousand people dead.  Besides you can’t spell… so who’s illiterate?", "label": 1}
{"text": "Enjoy your ban", "label": 1}
{"text": "Huh? What do I have to do with a team cheating?", "label": 1}
{"text": "I’m talking about Michigan not Ohio State - sorry you’re confused buddy", "label": 1}
{"text": "You’ll figure it out eventually just do some good old fashioned book learning", "label": 1}
{"text": "God bless. Btw Election Day is next week.", "label": 1}
{"text": "Dude is off his rocker, I’m out!", "label": 1}
{"text": "You’ve already been reported.", "label": 1}
{"text": "What you've just said is one of the most insanely homerish things I have ever heard. At no point in your rambling, incoherent response were you even close to anything that could be considered a rational thought. Everyone in this room is now dumber for having listened to it. I award you no points, and may God have mercy on your soul.\n\nFuck Michigan as a state, record label, and a motherfuckin' crew", "label": 1}
{"text": "Wow you’re really unhinged- do you need mental aid?", "label": 1}
{"text": "This sub is for regular people talking about football- if you’re having a mental health crisis- there are avenues for that", "label": 1}
{"text": "They aren’t here though other than helping direct you to the channels to get your mental health in order", "label": 1}
{"text": "Are you a self-harm risk?", "label": 1}
{"text": "I think it was inevitable, but it does suck.", "label": 1}
{"text": "I mean, there are a few. As mentioned briefly in a sub thread above if a tariff is correctly used for economic benefit it will be in an industry where a small boost in the ability to compete promotes significant at home investment in the industry or sometimes protects existing investments.  It's way more subtle there though than the tariff levels mentioned by a particular candidate, and he has them aimed very often at the wrong target.\n\n\nTariffs are more frequently used as a nation's method of soft to somewhat strong political influence though.", "label": 1}
{"text": "Smart move on both parts. Seattle is a shitter and the fans are bad people", "label": 1}
{"text": "Joe Pa knew", "label": 1}
{"text": "They got outrushed, outthrown, had less yards per carry, less yards per throw, allowed more sacks, turned it over more times, were less efficient on 3rd down and had more penalties. All that was with Oregon playing without its best player. Beat themselves? Ok. Sure. 🙄 \n\nEasy schedule? We’re also probably the only team in the country who is 2-0 against other playoff teams. \n\nSee you assholes in 3 weeks when we keep you guys from bowl eligibility in a 45-7 (or something like that) shit stomping.", "label": 1}
{"text": "You realize that Green Bay isn’t Madison right?\n\nI was being nice and not calling any one special needs.\n\nThe Madison people are very liberal. The rest of the state not so much.", "label": 1}
{"text": "I’ll take “things that never happened” for $100, Alex", "label": 1}
{"text": "That’s not at all how tariffs work. The point of tariffs is to keep and reshore jobs by increasing the cost of outsourcing jobs and/or importing goods.", "label": 1}
{"text": "Not sure why you're downvoted. You're absolutely right. Remember a few months ago, people were clamoring for RDJ to apologize for it.", "label": 1}
{"text": "Your first sentence literally claims to speak for the majority.\n\nYou're an idiot.", "label": 1}
{"text": "So if I talk about reality I'm right? Yeah. Thanks.", "label": 1}
{"text": "Tariffs on electric cars from China are 100%.  No country could eat that tariff. It’s basically designed to shut China out of western markets. Although really the west can allow their car industry to be obliterated or become dependent on China for key products or materials look what happened during Covid when China shut down.", "label": 1}
{"text": "eh its reddit, truth is offensive", "label": 1}
{"text": "You live in a town that sounds like a 75 year old dude.", "label": 1}
{"text": "Dude don't pull a Seinfeld... Always Sunny is still fucking filming", "label": 1}
{"text": "It's just not true though.  If it's funny and *not punching down* it'll be a success.\n\nThe difficulty is too many people confuse \"edgy\" with \"outright bigoted\"", "label": 1}
{"text": "And they still had to beat themselves in the last minute of the game for you guys to walk away with the W against your only ranked opponent this year. It's like Notre Dame, but worse!", "label": 1}
{"text": "Delusional Husky cope is my favorite type of cope. 😂 😂", "label": 1}
{"text": "And on a side note, we're electing a president.", "label": 1}
{"text": "This girl from the tweet, is she single, she’s attractive", "label": 1}
{"text": "No just have seen what good/great cities have become in the past 15 years. I’d say the say thing about PDX. When you can’t park on a sidewalk downtown cause your shit might be stolen it’s a city problem", "label": 1}
{"text": "Him and Joseph Smith have quite a colorful fucked up history", "label": 1}
{"text": "College fucking football?!  Are you stupid?  With what is going on today?  This is like having a parade as 9/11 is happening and talking only about the parade.  r/IHateSportsball", "label": 1}
{"text": "Indiana top 5 in November. Only Ann Selzer had that happening.", "label": 1}
{"text": "[This guy](https://media3.giphy.com/media/v1.Y2lkPTc5MGI3NjExNm51Mm90b2Q2dDIwMDVzdTA4MWZyaTJkcTg3cTh6NTYzamRuYzV2ZSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/fwcGzF1l2cILe/giphy.webp)", "label": 1}
{"text": "The book wasn’t complete shit, that’s revisionist history. You probably didn’t read it.", "label": 1}
{"text": "The US voting system is such a joke", "label": 1}
{"text": "Pointedly, we *don't have* a US voting system. Each state has their own.", "label": 1}
{"text": "Most of them use the same machines and roster systems", "label": 1}
{"text": "The poll workers were following the law correctly. So yeah, it would have happened to anyone. For anyone else who needs to hear it, polling locations are staffed *and observed* by both parties at all times.", "label": 1}
{"text": "Maybe, but their election laws are all different", "label": 1}
{"text": "My my my, the leopards have eaten my face. We never think it’ll be us affected when we pass these laws.", "label": 1}
{"text": "Yes I read your opening paragraph. And the fact that you then typed the rest of the comment knowing how dumb it was is what I’m talking about.\n\nAnd should Arkansas be above Tennessee? Of course, if they have the same record. I’m sure you realize how much of a false equivalency that was.\n\nAnd ranking “best team” versus “best record” doesn’t apply when the two teams PLAYED EACH OTHER. \n\nOhio State is not the best team in the country. It’s not even the second best. The only reason you’re having this conversation is because it’s YOUR team.", "label": 1}
{"text": "The only point I’ve been trying to make this whole time is that everyone votes differently and values various factors differently in their rankings and I don’t think you can immediately declare that there is absolutely ZERO room for ANY dissent whatsoever on who #1 should be. Not because Oregon hasn’t definitively earned it (they have) or because we’re discrediting their head to head win against Ohio State for any reason, but simply because people literally have different definitions of what “#1” means to them and that’s okay! No need to immediately call people’s opinions about college football “embarrassing” and “dumb.”\n\nI disagree with your opinion that OSU is not at least the second best team in the country, but I can see where you’re coming from, I acknowledge the evidence that would lead you to believe that, and I don’t think said opinion is dumb.", "label": 1}
{"text": "You coastist rat bastard", "label": 1}
{"text": "Go soak", "label": 1}
{"text": "Go drink a Dr Pepper and worry about getting into heaven.", "label": 1}
{"text": "Haha, I'm not LDS. But I'll do that then go soak, right?", "label": 1}
{"text": "Kinda like how the Georgia coaching staff condones drunk driving and killing trainers while street racing?", "label": 1}
{"text": "cry more about it Ferret bro.", "label": 1}
{"text": "Hilarious coming from a florida fan when meyer 31 arrests on the team had hernadez for the cherry on top........,", "label": 1}
{"text": "I’m rooting for BYU in hopes that some of the students will be able to get a good soaking and jump humping in while celebrating a win!", "label": 1}
{"text": "I don’t think people realize that most of them are already married, so they don’t need to find any of God’s loopholes anymore", "label": 1}
{"text": "Quinn clarifies statements on Penn State, emphasizes support for victims of abuse in interview.", "label": 1}
{"text": "Fuck Utah, man.", "label": 1}
{"text": "Geez. Whoever catches BYU or Big12 Champ second round pretty much gets another practice day.", "label": 1}
{"text": "I don’t know if I would call the SEC bias defiant, it’s pretty much the status-quo", "label": 1}
{"text": "Who are you crying about", "label": 1}
{"text": "I won’t call you a boomer but I will call you a mouth breathing dumbass", "label": 1}
{"text": "I resent that. Georgia was blue last time around.", "label": 1}
{"text": "*Cries in sad corn noises*\n\nI didn't want to be a part of your stupid poll anyway.", "label": 1}
{"text": "Flair up wanker", "label": 1}
{"text": "Silence, loser. You’ve never been to a college football game", "label": 1}
{"text": "Wait no hang on this guy kinda has a point. Is this the silver lining we've been wainting for?", "label": 1}
{"text": "I translated this as “Fuck Mormons”", "label": 1}
{"text": "Was hoping for something spicier than this. Give me Indiana at 4, BYU at 6, LSU at 25. This too vanilla", "label": 1}
{"text": "I feel like that's a false dichotomy", "label": 1}
{"text": "4th grade level? Pffft okay Hardvard. Why don’t you just brag some more.", "label": 1}
{"text": "I dunno I just saw he was literally a convicted criminal and abuser—and figured he was a Dawgs fan. \n\n/sarcasm my friends", "label": 1}
{"text": "I still don't know what that has to do with allowing political discussion on this sub. Those college educated people can (and do) discuss politics many, many places. This sub doesn't need political commentary, it doesn't somehow limit those people's capacity to engage in the commentary elsewhere", "label": 1}
{"text": "DNC Astroturfers didn’t see this sub as a valuable time sink.", "label": 1}
{"text": "I'm not. You used your comment to make a politically charged statement on a sub that we're trying to promote as not being overly political. I'm making a rebuttal to the entire idea of both your joke, and you thinking it needs to political.  \n  \nEverything can be seen through a political lens. That does not mean everything is political. Nuance doesn't seem to be your strong suit.", "label": 1}
{"text": "Depends on who you ask really.", "label": 1}
{"text": "Way to ruin the vibe man.", "label": 1}
{"text": "I’m vibing rn.", "label": 1}
{"text": "Except PFB is a puss who stopped showing up once they couldn’t make the place worse for others.", "label": 1}
{"text": "Its interesting to see that there is sentiment against constantly mentioning him, if you look  in /r/cfbmeta .", "label": 1}
{"text": "I agree with that post. It's fucking weird. \n\nIt's been over a year and he's mentioned and tagged daily in this sub. And it usually comes with a slew of personal insults. Not insults about Fsu, but about him. Recently I've seen him called \"vile scum\", asshole, loser, etc and that he should be punched in the dick and spat on. \n\nI get the irritation by fsu's rival fans, but all he did was post articles nagging his rival's teams. The vitriol reaction to him as a person is weirder to me. \n\nPeople are outraged that he doesn't want to come back to the sub for the sole purpose so they can to be scream at him and call him a loser lol.", "label": 1}
{"text": "Yeah, I think if people just posted the articles and left it at that, I don't think there would be an issue.", "label": 1}
{"text": "Yeah, mods deleted my post from a few weeks ago similar to the AllHawkeyes post. That was my point - PFB was a shitposter, but he didn't really engage with people in the comments. I think with Irishspring is doing is 10/10 mockery because everyone who spends a lot of time on this sub knows these are PFB-style articles without actually broadcasting PFB. That and the vitriol that appears in some of the comments is textbook cyber bullying.", "label": 1}
{"text": "Whoever the fuck scheduled the Holy War for the same week as the election can fuck all the way off to the lowest level of outer darkness. Except I’m probably already there because {BYU} is going to go Project2025 on our asses.", "label": 1}
{"text": "What would your wives think if they heard you using that kind of language?", "label": 1}
{"text": "We've turned the country red, now it's time to turn Rice-Eccles blue. {BYU} 27-14.", "label": 1}
{"text": "Since this game is always chaotic and Utah doesn’t have much else left to play for this year, {Utah} plays out of their mind and somehow wins and ruins TDS season. \n\nGo Utes! \n(I am ready to be hurt 😫)", "label": 1}
{"text": "Oh I had no hope of it happening here, just on a national level.", "label": 1}
{"text": "So say we all (or at least I wish we all did). He's a monster.", "label": 1}
{"text": "4/5 wives agree with my assessment.", "label": 1}
{"text": "This post has been removed because you have not yet met /r/CFB's participation requirement in order to create new posts. In order to make posts on /r/CFB, please participate in the sub by commenting on posts made by other people first.\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CFB) if you have any questions or concerns.*", "label": 1}
{"text": "My favorite football team’s wide receiver corp shouldn’t have a higher moral standard than the President of the United States, bring his ass back. We got a natty to win.", "label": 1}
{"text": "🤮 ", "label": 1}
{"text": "Sorry, I’m out of fucks to give", "label": 1}
{"text": "you know what, thats awful in a lot of ways, but fair point", "label": 1}
{"text": "It’s an expensive ticket, but comparing it to lsu bama is dumb. Texas tech seats 60k and Death Valley seats 102k. If you added 40k plus seats the minimum price for that game would plummet which is why looking at the minimum ticket price without taking into account stadium capacity is a dumb way to compare games.", "label": 1}
{"text": "Check cleared. NIL money going to a good cause.", "label": 1}
{"text": "Check cleared", "label": 1}
