{"text": "This is a test reply!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/churning) if you have any questions or concerns.*", "label": 1}
{"text": "This is a test reply!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/churning) if you have any questions or concerns.*", "label": 1}
{"text": "It looks like you might be asking a question related to a Chase Sapphire cards. We would encourage you to look at [this helpful guide](https://www.reddit.com/user/garettg/comments/u6ss7u/sapphire_fyis)one of our users has written - it will likely answer the question you’re asking. But don’t worry - everybody can still see your question and if your question isn’t answered by the guide, somebody will more than likely answer it shortly.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/churning) if you have any questions or concerns.*", "label": 1}
{"text": "biz checking and sub for it", "label": 1}
{"text": "hey just curious if you guys know how long it will be before I can close my chase account to receive my bonus amount (I already met the direct deposit conditions).", "label": 1}
{"text": "it can be different offer, like employee cards", "label": 1}
{"text": "closed not required", "label": 1}
{"text": "what is link for 250k", "label": 1}
{"text": "can try to apply and recon denial chase, amex, citi", "label": 1}
{"text": "You referenced a Sapphire card from Chase. If this was a question, check out [this helpful guide](https://www.reddit.com/user/garettg/comments/u6ss7u/sapphire_fyis). If you weren’t asking a Sapphire question, ignore me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/churning) if you have any questions or concerns.*", "label": 1}
{"text": "r/churning operates very differently than almost any other subreddit. Only posts that impact a high number of members are allowed to remain - otherwise almost all content better belongs in one of our regularly recurring threads.\n\n* If your post contained a general question: While you may feel that your question is unique or could apply to a high number of users, absolutely no question is worth a top level post as it has very likely been answered before in some way, likely many times. Please read our [wiki](https://www.reddit.com/r/churning/wiki/index) or use the r/churning search engine, which can be found at churning dot io. If you still can not find the answer, please submit your question as a comment to the most recent [Daily Question thread](https://www.reddit.com/r/churning/search?q=flair%3A%28%22Newbie+Weekly%22+OR+%22Daily+Question%22%29&restrict_sr=on&sort=new&t=all&feature=legacy_search) - chances are high it will be answered in short order.\n* If your post was about asking about getting this credit card or that credit card, please submit it as a comment in the most recent [What Card Weekly thread](https://www.reddit.com/r/churning/search?q=flair%3A%28%22What+Card+Should+I+Get%22%29&restrict_sr=on&sort=new&t=all&feature=legacy_search). It refreshes every Wednesday, but users regularly respond throughout the week.\n* If your post was concerning a bank bonus in some way, please submit your post as a comment in the most recent [Weekly Bank Bonus thread](https://www.reddit.com/r/churning/search?q=flair%3A%28%22What+Card+Should+I+Get%22%29&restrict_sr=on&sort=new&t=all&feature=legacy_search). It refreshes every Tuesday, but users regularly respond throughout the week.\n* If your post was in regards how to use various credit card points/hotel points/airline miles, please visit r/awardtravel.\n* If you have read the above and still feel that your thread deserves to be published, please [message the moderators](/message/compose/?to=/r/churning) and ask if your post can be reinstated. Note: **DO NOT** try to use Reddit chat to message any individual moderator in an attempt to get your post reinstated; all such chats will be ignored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/churning) if you have any questions or concerns.*", "label": 1}
