{"text": "CONSPIRACY - OP IS A PAID TRUMP TROLL...", "label": 0}
{"text": "Some people don’t work the same schedule as others", "label": 0}
{"text": "Can you fucking boomers stop saying \"Obummer\"? It's so fucking cringy.", "label": 0}
{"text": "We are living under Inverted Totalitarianism...Nothing will change until they look around and realize some of them aren't there anymore...they own the MSM/SM, they own the government in totality and there are no laws they need to follow other than don't be too sloppy with operations", "label": 0}
{"text": "That’s true. I guess they should probably change their work schedules to adhere to my expectations.", "label": 0}
{"text": "Is a lie! What u say here is correct in some degree but definitely isn’t because pollution… also the so called aurora is so in the South because sun flares! Increase massively in the pass year, some day it reach even Italy but all! No because is getting hotter! Is a ox!", "label": 0}
{"text": "That's not on her, she was enforcing state laws, blame the legislators.", "label": 0}
{"text": "i’ve obtained nothing from any type of generational wealth. my initial comment was just stating that people over the age of 22 can sleep until whenever they want and still be considered an adult. \n\ni was replying to someone who said you can’t be over 20 sleeping past 10 and consider yourself an adult. that’s very sad to me cause it implies you have to have some sort of job that requires you waking up at the crack of dawn to be successful. it’s just not true. \n\nI wasn’t trying to brag or throw any type of lifestyle in anyone’s face; just wanted to say you can be an adult that sleeps late and also gets shit done.", "label": 0}
{"text": "I agree completely. But my honest opinion is we got 5-10 years before freedom is completely gone. All they gotta do is wait until drones are good enough. Foot drones, flying, dogs, etc… then it won’t matter what our troops do or don’t do.", "label": 0}
{"text": "Back here after 2 years and Trump dodged a bullet……Time Traveler Conspiracy confirmed lol", "label": 0}
{"text": "Yes! 5 of Biden 5 of Trump 10 of Obama…", "label": 0}
{"text": "I already explained that, and the economy is better today than it was under Trump…", "label": 0}
{"text": "\" Hundreds of millions of dollars to fund any presidential campaign is fucking crazy when they are asking for votes from poor people.\"\n\nYou said that, IDK what that has to do with stock trading, so don't act like you weren't talking about this issue as well.", "label": 0}
{"text": "Trump is in the billionaire caste and actively wants the worst for all of you", "label": 0}
{"text": "and i’m sure that works for you! \n\nnothing about my initial comment was meant to bring others down.\n\nI just wanted to state that sleeping late ≠ lazy.", "label": 0}
{"text": "..... Why?", "label": 0}
{"text": "There’s nothing out there. Synthetic. Please educate yourself, and be smarter.", "label": 0}
{"text": "What's the California revised statute for incarceration beyond what was sentenced?  Stop eating glue.", "label": 0}
{"text": "Yep", "label": 0}
{"text": "Is not alive! That post was posted in 2017 his last YouTube video was in 2017 too… he die!", "label": 0}
{"text": "Hitler/Trump thinks all dead people are losers and has sexually assaulted all the women including the ones not female, person close to the matter said. /s🤡", "label": 0}
{"text": "Those are Jay's lyrics from \"Justify My Thug\" off \"The Black Album\".", "label": 0}
{"text": "They're statements he's made publicly, or statements from people that worked with him as president. \n\nHe's either really evasive about saying anything bad about foreign leaders or war criminals, or he just doesn't know what he's talking about 90% of the time he's speaking.", "label": 0}
{"text": "So you are trying to tell me….that…..They just got punked?", "label": 0}
{"text": "The smear game is bush league from the Dems this election cycle.", "label": 0}
{"text": "No one said anything about that. I called your candidate a liar. Tell me that isn't true", "label": 0}
{"text": "Nope your can google it lazy bones. It's out there for everyone to see. Cspan has it. Doesn't take much, talk about triggered", "label": 0}
{"text": "For it to be a conspiracy, it needs to exist.", "label": 0}
{"text": "There are more studies in Europe on high suicide rates yrs after a person tries to alter their gender using drugs, surgery but they have been censored in the US.  The girls lost substantial bone density and their spines were affected by the puberty lockers.  Just trying to do something so utterly dangerous to the human body seems extremely careless, irresponsible and harmful.", "label": 0}
{"text": "> They're statements he's made publicly,\n\n\nSuch as?", "label": 0}
{"text": "Nope, you just apparrently don't know how to use Google, and im not here to teach you.. don't believe me. I'm not the only one who's seen this. Even in this thread, you're just butt hurt your overlord and savior is a diddler just like trump", "label": 0}
{"text": "the conspiracy to insult the collective intelligence of the commons of n. americans.", "label": 0}
{"text": "Yes!", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Just please wait until after GTA VI is released", "label": 0}
{"text": "A minute and a half being 90 seconds might cover the 9..idk", "label": 0}
{"text": ">Harris is an outright communist \n\nCan you tards still not do any better than parroting Fox News bullshit when it comes to criticizing establishment politicians?", "label": 0}
{"text": "100k cash per your link. \n\nIt doesn’t change anything, but it’s nice to know it wasn’t as low as 10k.", "label": 0}
{"text": "I just googled \"authorized use of force\" and my only responses were state statutes and then a YouTube video making the claim a week ago. So as to your original premise, no we don't all know what you're talking about", "label": 0}
{"text": "insane that that’s what you gathered from this. I wear sweatpants a lot in public; you’re right. \n\nyou know why though? cause I don’t care what literally anyone has to say about me. I wear sweatpants cause I like to be comfortable. \n\nits funny that you correctly marked me as a “sweatpants wearer” but you couldn’t be more wrong about being lazy. im doing fine.", "label": 0}
{"text": "Just wear jeans bro", "label": 0}
{"text": "\"I'm so much smarter than everyone else, and it sounds right in my head, so I don't need to find a source or even do a quick Google search before commenting and stating it as an essentially indisputable fact.\"\n\nProceeds to confidently claim the total bullshit they either copied from someone else or pretty much just made up in their head is an indisputable fact... and then gets 500 up votes for it/is the top comment.", "label": 0}
{"text": "No", "label": 0}
{"text": "Of course. But if I were a potential invading country, I would be smart enough to wait until most of the damage has already been done.", "label": 0}
{"text": "Yep all the top muppets do the same shit. They are just letting go of expendable pawns.", "label": 0}
{"text": "I can’t tell if you think it’s ok or not that Trump allegedly groped a minor.", "label": 0}
{"text": "There was some evidence a senior police officer was involved.", "label": 0}
{"text": "Screw fast food joints. They can all go out of business. Here in CA it's now more for a combo meal at a fast food joint, McDonald's included. Than going to a sit down restaurant to have a burger and drink. \n\nWhat in the absolute fuck?! \n\nAnd don't get me started on that unfair bs law CA passed that singles out fast food workers to get paid a higher minimum wage than everyone else as if they're some poor precious bastards. Fuck them too.", "label": 0}
{"text": "He owned Diddy's booty as well", "label": 0}
{"text": "They let the mf out on bail..", "label": 0}
{"text": "Wut? No, it's not. He has some conspiracy minded folks on there, but it's not a conspiracy podcast. And this post isn't a conspiracy. If so, where is it? I chickened out of going on a roller coaster when I was eight. Is that a conspiracy? Should I post that here?", "label": 0}
{"text": "Yeah they are usually on this sub. I’m surprised they aren’t here too", "label": 0}
{"text": "Fed", "label": 0}
{"text": "The google map game? Pick a point and 10 clicks?", "label": 0}
{"text": "There’s no way it could be good. She probably just mashes it", "label": 0}
{"text": "Ok", "label": 0}
{"text": "[Right?](https://thehill.com/homenews/campaign/4898919-trump-iran-smithereens-threats/amp/)", "label": 0}
{"text": ">can handle miss information. I don’t get panicked. I don’t act volatile. It doesn’t make me feel uneasy. I don’t get violent and feel like waging war. I’m able to think critically about information, whether it’s true or fake news.\n\nDoesn't all of that hinge on whether or not you *know* it's misinformation? Oh wait but you *practice critical thinking.* No way you could ever get duped.\n\nYou sound like everyone I've ever known who has gotten scammed lol. They make sure to let everyone know how smart they are, too smart to ever fall for anything like that. As they're in the midst of being completely taken lol.", "label": 0}
{"text": "So, the sister, the lawyer, and the dude who's specifically mentioned in the article about being in the conversation with say the story is a lie. But that's not good enough because it's an article bashing Trunk.", "label": 0}
{"text": "Democrats knew they were the bad guys the whole time and never voted for them. Unfortunately, republicans did, and we got terrorism, war, and the Great Recession because of it. ", "label": 0}
{"text": "Even the oakland pride rappers left that dump", "label": 0}
{"text": "I thought she celebrated kwanzaa.", "label": 0}
{"text": "Jeffries worked as the CEO for Abercrombie between 1992 and 2014. The alleged victims say they were forcibly given erection drugs and had their genitals shaved against their will, were made to dress up and subjected to 'high-pressure enemas.' Some victims were not gay and were given the powerful erection-causing drugs so they could be forced into gay sex against their will. ", "label": 0}
{"text": "This is why im still subbed here, literal schiozs just vomiting out what every their dog said to them in a dream", "label": 0}
{"text": "What was he arrested for?", "label": 0}
{"text": "Kamala is a communist? That’s pretty fucking dumb", "label": 0}
{"text": "It was stolen", "label": 0}
{"text": "You aren't going to accomplish what you want on reddit. I can say though in the past people used to bring guillotines in front of people's houses and then remove their heads from their bodies. That's how it used to be handled", "label": 0}
{"text": "Kwaz is bs", "label": 0}
{"text": "Fr how did google go from showing you exactly what you wanted every single time to missing the mark a good 60% of the time? \n\nEven YouTube search is extremely broken sometimes. I’ll get 5 relevant results then endless random nonsense.\n\nI don’t search anything political, either. Just random shit I won’t be able to find unless I search Bing or ask chatgpt.", "label": 0}
{"text": "😂👍🏽", "label": 0}
{"text": "Lefties showing their true colors again.", "label": 0}
{"text": "9 years is merely a blink of an eye ", "label": 0}
{"text": "Ass kisser says what", "label": 0}
{"text": "I think it's like that for the subjects of any empire. Brits and Japanese were no different when they were on top.", "label": 0}
{"text": "So do you get the long stringy ones after c19/vax?", "label": 0}
{"text": "Kamala has been in contact with Liz Cheney", "label": 0}
{"text": "Ny Post only paper with some balls left?", "label": 0}
{"text": "You know getting paid to promote a candidate is one thing but actually voting is the persons private business? Thy may not even vote at all nor these two candidates! There is like 5 all together to vote for ? \n\nI saw a video a years ago , it was pretty much saying celebrities get paid to push the vote a certain way, but it doesn’t mean they’re actually voting for that candidate. If I find it or someone can I’ll add it … but when it come down to it we as people should vote for who we wanna vote for not who our favorite celebrities pushing that’s so fucking stupid if that’s what makes you vote for somebody!", "label": 0}
{"text": "Exactly they want riots and chaos.  So remain peaceful and don't give it to them.", "label": 0}
{"text": "Got any good links for this?", "label": 0}
{"text": "more like HE LIVES. EL is also a male connotation in a sentence. Like \"El/ella apenas se fue\" translates to, \"He/She just left\" It just interesting knowing EL is also the ancient saturn god and it seems to have a image that looks like saturn on the bottle. Like... what else could it be?", "label": 0}
{"text": "In the real world, my guy, we provide sources for our claims. Otherwise, why take you seriously? Put up or shut up.", "label": 0}
{"text": "This aren’t blood clots in this jars, I had a massive blood clot and they showed me bits of it.", "label": 0}
{"text": "Bro she has been known for sleeping her way to the top.  I think she is a terrible choice to lead our country in any direction. Trump may not be the best but he is definitely better than her.  She hid the entire time as VP because people disliked her so much, now Biden has full blown dementia and she is the savior? GTFOH.", "label": 0}
{"text": "Destruction of Western civilization by the Freemasons.", "label": 0}
{"text": "Bro this sub is filled with boomers what do you expect😂. I thought there would be some cool conspiracy theories on this sub instead it’s just “ *THERE TRYNA KILL MY LORD AND SAVIOUR DONALD J TRUMP* ” every other post. I’m def right leaning but like fuck I’m getting annoyed😂 (also the wrong they’re* was used on purpose)", "label": 0}
{"text": "Because it does revolve around them.  Once America falls, every other country will fall.", "label": 0}
{"text": "Wait, so he was discharged and charges were dismissed?", "label": 0}
{"text": "This is an insanely wrong take", "label": 0}
{"text": "Still happening in Canada, they threw on massive taxes and are banning all flavoured juice", "label": 0}
{"text": "I absolutely agree with you. The Democrats have pushed off the inevitable. I would almost rather see Harris win honestly at this point. The economy is going to crash, people are going to lose jobs, there's going to be some level of economic and maybe even social chaos. I don't want Trump and the conservatives blamed when it happens. It would take the whole 4 years of policy to reverse what is going to happen.", "label": 0}
{"text": "No but i remember in 2019 the news was pushing how crazy anitivaxers were and people that didn't want to vax their kids. There was a whole couple months of that being pushed. Pepperidge farm remembers", "label": 0}
{"text": "Hope they interview those project 2025 believers and assignation attenmpt deniers!", "label": 0}
{"text": "Sure boss👍", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "You sound like you hang out w Kamala and Dr Seuss🙄🤡", "label": 0}
{"text": "Performing sexual acts on an 11 year old isn’t rape?", "label": 0}
{"text": "And the Saturn logo? Or is it just a random doodle? I even asked a friend what it looked like without telling them anything, they said a planet. ELVIVE isn't even a word nor is it easy to pronounce lmao.", "label": 0}
{"text": "What an accurate username for some fake bullshit", "label": 0}
{"text": "I asked it if there was anything similar to want I'm trying to say and it said there isn't, if you have a source that proves otherwise I'd be happy to take it but I doubt you would have anything useful to contribute", "label": 0}
{"text": "You could make that assertion, but as I explained initially there's more factors that come into play which I believe turns that into a \"No\". \n\n\nOne issue is that the US ultimately does not have the materials or production capacity, as it currently stands, to shift all its external operating costs to an internal capacity. It would require significant mining, production, and employment shifts which holds its own overall cost. If this was just about wages, then it might be a simple shift, but it's not.\n\n\nThe second is that Tariffs are mercurial in nature. They are not a static thing, but are negotiated and manipulated constantly. Simple example: where 1 president might raise them, another could lower them within 4 years. It may take a decade to even get close to staus quo internal production. Basically it means that businesses can wait.\n\n\nIf the US never got rid of its production capabilities, or planned in advance, we would be having a different conversation as Tariff increases would be viable. Right now, they'd just hurt \"the little guy\".", "label": 0}
{"text": "So they dropped the charges against him?", "label": 0}
{"text": "well i for one welcome our worm overlords", "label": 0}
{"text": "Treatments that don’t demonstrate benefit are, by definition, harmful. They don’t do this stuff for free.", "label": 0}
{"text": "What’s wrong with Rumble? You should be more concerned with the information and whether or not it’s true than outright dismissing it because of the platform.", "label": 0}
{"text": "Crazy Musk would say the same thing.....", "label": 0}
{"text": "The media blitz happening now is Musk has been secretly having conversations with Putin since 2022. Sound familiar?", "label": 0}
{"text": "Are we really out here defending mouthbreathing lol\n\nThis isn't a disputed medical fact; your mouth, throat, etc. are wet for a reason. Mouthbreathing dries these out. It kills the natural bacteria that do good stuff. It makes you more prone to snoring and sleep apnea. It changes your facial structure and makes your jawline weak.\n\nThere's a reason why almost every fucking animal on the planet evolved nasal cavities. And that's because mouthbreathing is bad.", "label": 0}
{"text": "You are calling russia third world?", "label": 0}
{"text": "Everything you said is a lie. Go look it ALL up and quote me back. If not, go away brainwashed bot🤡🤡🤡", "label": 0}
{"text": "I have nothing, if that’s what you’re asking?", "label": 0}
{"text": "Sounds like i am taking the blue pill and believe whatever i want to believe.", "label": 0}
{"text": "don't forget trump retweeting a picture of someone's truck with a Biden Hogtied sticker over the tailgate.\n\nbut trump fans couldn't fucking possibly care less about that.", "label": 0}
{"text": "But that distracts from the fact that she was denied an organ transplant, so wouldn't that mean she was right to not trust them?\n\nIt just proves her point.", "label": 0}
{"text": "From reading your other replies, I think I get what you're saying. But the wording to use maybe wouldn't be seeing in 2D vs 3D \n\nSounds to me like you're describing an omniscient \"all seeing\" creature. Or perhaps one capable of \"astral projection.\"\n\nIt's like you're describing \"bullet time\" cameras that are recording \"in the round\" and can provide visual information from many perspectives instead of just one. Or the kinda sonar sensors of bats or submarines.", "label": 0}
{"text": "[ALEFANTIS: Well, we make everything from scratch. Other restaurants, even good restaurants, will, like, not roast their own peppers. You can just buy the roasted peppers in a can. Or you can buy garlic oil. Some products you can get, and they’re consistent and they’re easy. But I didn’t even know that existed actually until they said that. I was like, “What do you mean? There’s another way? You can just buy these things?” Because a lot of restaurants will open a can and put it on. Like our sauce — we harvest a whole crop of organic tomatoes — 10 tons of tomatoes every year. Can them all, store them in the basement, have like a harvest party when it gets loaded in](https://www.metroweekly.com/2015/04/from-scratch-james-alefantis/)\n\n\nThis was all pre pizzagate.", "label": 0}
{"text": "Welcome to Canada, where the people get to choose their course.  In the US, the government decides for you.", "label": 0}
{"text": "They really think conspiracy theorists live in basements and don't stop talking about conspiracy 24/7 their whole live.", "label": 0}
{"text": "Businessmen make money because they do business.", "label": 0}
{"text": "Here are a few that took me 2 minutes to find..\n\n[https://www.cnbc.com/amp/2022/12/17/how-cloud-seeding-can-help-replenish-reservoirs-in-the-west.html](https://www.cnbc.com/amp/2022/12/17/how-cloud-seeding-can-help-replenish-reservoirs-in-the-west.html)\n\n[https://amp.cnn.com/cnn/2022/03/14/weather/cloud-seeding-weather-modification-wxn](https://amp.cnn.com/cnn/2022/03/14/weather/cloud-seeding-weather-modification-wxn)\n\n[https://youtu.be/BElZrnuskq8?si=xYxzIy8nia50EYeT](https://youtu.be/BElZrnuskq8?si=xYxzIy8nia50EYeT)", "label": 0}
{"text": "360 or 3D?", "label": 0}
{"text": "He's been in regular contact with all of them because he's one of them", "label": 0}
{"text": "He got the key to the city couple weeks ago", "label": 0}
{"text": "A moisture drop and some hair strands?", "label": 0}
{"text": "Although she's a sick horrific woman she does have some pretty amazing milk trucks", "label": 0}
{"text": "Tbh I think the point of it is to sound really simple and \"America first\" with the trust that none of his base really understands the implications", "label": 0}
{"text": "Their account had been made 91 days prior and they only left their first comment that night. Their first comment was saying that they saw the Edited tag and verified from their end testing the Edit feature on their phone to confirm that the *boyfriend* had been the one to edit a message. This is obviously false and becomes suspicious when you consider the efforts they supposedly went through to verify…\n\nWhen confronted, they said they *couldn’t have known or verified because they didn’t even know what messenger service/iOS that OP was using. That’s more blatant BS given that we can all recognize (what they had already recognized) the Apple iPhone messenger app. Their response when getting called out for this was gibberish.\n\nSeems like a bot or a shill to me.\n\n🤷‍♂️", "label": 0}
{"text": "[ALEFANTIS: Well, we make everything from scratch. Other restaurants, even good restaurants, will, like, not roast their own peppers. You can just buy the roasted peppers in a can. Or you can buy garlic oil. Some products you can get, and they’re consistent and they’re easy. But I didn’t even know that existed actually until they said that. I was like, “What do you mean? There’s another way? You can just buy these things?” Because a lot of restaurants will open a can and put it on. Like our sauce — we harvest a whole crop of organic tomatoes — 10 tons of tomatoes every year. Can them all, store them in the basement, have like a harvest party when it gets loaded in.](https://www.metroweekly.com/2015/04/from-scratch-james-alefantis/)\n\nFriendly reminder that alefantis stated that comet ping pong  does in fact have a basement in an interview before pizzagate broke out", "label": 0}
{"text": "It looks nothing like Saturn.", "label": 0}
{"text": "if CNN or other legacy media (except Fox news) reports it, then it can be ignored by trump's fans. it's why trump has spent so much time calling the press the enemy of the people and denigrating the press every time someone criticizes him in any way.", "label": 0}
{"text": "The thing is Harris would openly and willingly sign all of our rights away. I think Trump would at least pretend he didn’t want to have to.\n\nOur pretend options suck", "label": 0}
{"text": "[https://archive.legmt.gov/content/Committees/Interim/2017-2018/EQC/Meetings/Jan-2018/Exhibits/Jan18/Exhibit23.pdf](https://archive.legmt.gov/content/Committees/Interim/2017-2018/EQC/Meetings/Jan-2018/Exhibits/Jan18/Exhibit23.pdf)", "label": 0}
{"text": "🧢", "label": 0}
{"text": "indeed it does pertain to this, you think your meaningless questioning will invalidate something you still can't face; so random questions that may tell an architect for 2 cents, there you go you original.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Virginia too https://x.com/glennyoungkin/status/1849826145258148113?s=46&t=qqk8Ti6-zpBG1R4vdqV9wg", "label": 0}
{"text": "😂😂", "label": 0}
{"text": "This isn't even a scientific paper. It was published in an anti-vax vanity journal that was started during COVID. The author is on the board.", "label": 0}
{"text": "Lol you can’t afford me! But you’re welcome to try. 🍻", "label": 0}
{"text": "A foundation of nothing? Epstein is nothing?", "label": 0}
{"text": "Don't forget Elohim", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "That paper is a joke. It wasn't published in a real journal, it was published in an anti-vax vanity piece that was started during COVID. The author is on the board. \n\nThe paper claims nano structures, but doesn't do any imaging at the nano scale. Everything they show is just salt crystals from the saline they used. Didn't even have any controls. It wouldn't even pass as a middle school lab report.", "label": 0}
{"text": "Alefantis said the [basement existed](https://www.metroweekly.com/2015/04/from-scratch-james-alefantis/) in an interview prior to pizzagate.", "label": 0}
{"text": "It says in the video why he was there.", "label": 0}
{"text": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7911186/", "label": 0}
{"text": "You're eating for two!\n\nWhich means the pizza is low calorie now.\n\nJust shit out the vaccine nano tech pickled onions and you will lose weight!", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "They intend to put 'vaxxines' in them now.", "label": 0}
{"text": "Look in the mirror 🤡...omg you are dense", "label": 0}
{"text": "Private Joker : How can you shoot women or children? Door Gunner : Easy! Ya just don’t lead ‘em so much! Ain’t war hell?", "label": 0}
{"text": "zo-zad me friend\n\ntell me, what would you like to hear?", "label": 0}
{"text": "Believe what you want. I've seen pictures. I find it even more truthful when its not just my families personal experiences but also random ass people online.", "label": 0}
{"text": "Haha, The do your own research crowd doesn't want to do their own research. \n\nhttps://www.mcgill.ca/oss/article/covid-19-critical-thinking/anti-vaccine-documentary-died-suddenly-wants-you-feel-not-think", "label": 0}
{"text": "At least it's an actual conspiracy post and not identity politics.", "label": 0}
{"text": "Don’t post shit like this without sources, we don’t got time for these stupid stories", "label": 0}
{"text": "> What the hell is going on?\n\nIt is called an invasion and conquest. The great replacement isn't a conspiracy theory. It is current events.", "label": 0}
{"text": "Maybe he did too but Cumala for sure did.", "label": 0}
{"text": "For the clicks. Got to make that sweet ad revenue.", "label": 0}
{"text": "We live in a world where conservatives run over liberals in cars, then pass laws to make it easier.  Where conservatives shot democratic offices in Arizona .  Where a MAGA presidential candidate says he will pay the legal fees of anyone who attacks a protestor.  Where the MAGA presidential staff make fun of a political opponent's husband being his with a hammer.   Where the president encourages people to storm the capital and stop a constitutional mandate.  \n\nAnd you say Harris is trying to motivate people into assassinating Trump", "label": 0}
{"text": "Could be.  I've thought before that biblical descriptions of fire coming down from heaven sound like they could be describing a nuclear attack.  The text the OP quoted does sound like what might happen if an EMP was used.", "label": 0}
{"text": "You cared enough to post in a topic about it.  Easy enough to ignore it.", "label": 0}
{"text": "Yup seriously. Disbelieving something simply because you don't like who is presenting it to you doesn't lead to knowledge. That'd be akin to me saying I won't believe anything from YouTube. Take in information no matter who is presenting it, verify and corroborate.", "label": 0}
{"text": "There will definitely be plenty of police to arrest anyone who doesn't pay their taxes. The solution is to go Galt and go off grid far away from this collapsing civilization.", "label": 0}
{"text": "The cold war already did this.\n\nUSA debt in the 60s a few billion.\n\nUSA debt today 35 trillion", "label": 0}
{"text": "https://youtube.com/shorts/6XL2bbVCFRU?si=AilJuJqNhYU4-neJ BEST GUY EVER MAYBE BEST GUY IN THE UNIVERSE!", "label": 0}
{"text": "Just because this account is new(ish) doesn't mean I wasn't here. I was here during the Flytape thing, the mod who started his own site thing (can't remember his name), etc etc. \n\n> This sub has Always been for individual freedom above all.\n\nThat's basically what I'm saying but you obviously have too much of an agenda to speak coherently.", "label": 0}
{"text": "This is what happens when intelligence agencies run your media", "label": 0}
{"text": "Same to you .best wishes in life.", "label": 0}
{"text": "The ol' drycleaner switcheroo?", "label": 0}
{"text": "You sound like you don't hang out with anyone, ever. For years.", "label": 0}
{"text": "Better advice is to peacefully arm yourself a and prepare for the worst.\n\nThey can create crisis, real and fake.\n\nNot everyone else will be calm as the dollar collapse halts all migrants and welfare financial assistance, and millions lose their jobs.\n\nLikewise not everyone will sit by peacefully as a globalist technocratic authoritarian monarchy is installed, or buying up all the resources.\n\nAll election outcomes have the opportunity to get weird fast.", "label": 0}
{"text": "Interesting. Not sure, but I would say expect the sun the cause a major power outage via CME very soon.", "label": 0}
{"text": "Why don’t you ask actual embalmers and people that work in mortuaries?\n\nThere are a few right here in this post, and there are entire subreddits dedicated to the job. Ask the tens of thousands of people who do it daily.\n\nhttps://www.reddit.com/r/conspiracy/s/erCl1YZuuK", "label": 0}
{"text": "I got 100 cans of sardines and a slingshot. I'm all set.", "label": 0}
{"text": "It's still less that the millions of car polluting the air driving to and from work every day.", "label": 0}
{"text": "If it’s not Hitler it’s Russia. If it’s not Russia it’s a, “Corrupt General said”. The ruling class does not want to give up power or be subject to our laws. They’ll do anything.", "label": 0}
{"text": "https://www.mcgill.ca/oss/article/covid-19-critical-thinking/anti-vaccine-documentary-died-suddenly-wants-you-feel-not-think", "label": 0}
{"text": "😂 what a fucking cope. no true scotsman ass argument lmao. anything to avoid admitting there's a child rape problem in the church! if they're demons maybe the church should do a better job of keeping them out!!\n\ngoddamn complicit fucks. if your religion allows demons to rape kids then maybe your religion is _of_ demons, not against demons.", "label": 0}
{"text": "Genetherapy, spike protein.", "label": 0}
{"text": "It’s called a joke dude.", "label": 0}
{"text": "The ‘rings of Saturn’ are simply a cursive L, for the brand name", "label": 0}
{"text": "I remember in the early 2000s my public library had a conspiracy section with lots of David Icke books. I asked a librarian why they don't have that section anymore, and they said it spreads misinformation. \n\nAt the same time they have a big \"banned books\" shelf to \"fight censorship\" while in essence, banning conspiracy books.", "label": 0}
{"text": "Wow you're right, only you understand this issue. Cannot say this strongly enough: go. fuck. yourself.\n\nI'm the communist liberal the people you're mocking (kind of rightfully) are scared of and I know a lot about mental hospitals and don't spend a lot of time defending them, but your attitude and victim attitude are too much. Fuck off.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Go ahead and vote.. If it makes you feel better lol.. It means nothing, but I guess for many, it gives them the feeling of worth", "label": 0}
{"text": "There's only one group in that experiment that is in denial", "label": 0}
{"text": "They're trying to push it on kids though", "label": 0}
{"text": "Those stupid & uneducated embalmers, misinterpreting something they haven't seen before in their decades-long careers........ They're no rocket scientists, I'll tell you that...", "label": 0}
{"text": "The information came from a book published in 2022\n\n*“Why can’t you be like the German generals?” Mr. Trump told John Kelly, his chief of staff, preceding the question with an obscenity, according to an excerpt from “The Divider: Trump in the White House,” by Peter Baker and Susan Glasser*\n\n[https://www.nytimes.com/2022/08/08/us/politics/trump-book-mark-milley.html](https://www.nytimes.com/2022/08/08/us/politics/trump-book-mark-milley.html)", "label": 0}
{"text": "Thought experiment:\n\n\nWould you be willing to throw your vote away on \"orange\" as evidence you believe voting is inconsequential?", "label": 0}
{"text": "Malakoff?? You mean \\*Molotov\\* lol", "label": 0}
{"text": "No, but you made a really vague point that didn’t  make much sense.", "label": 0}
{"text": "Mannequins", "label": 0}
{"text": "I did see a video of him talking about something, and the translation says is was expressing surprise and the extent of the damage the planes caused.", "label": 0}
{"text": "\"Yeah but he's on *our* team\"", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Microplastics?", "label": 0}
{"text": "I'm not saying they don't have political agendas individually, but I don't think it's a worldwide embalmers-of-the-world-unite conspiracy. It's also an overwhelmingly small minority of embalmers.", "label": 0}
{"text": "Trump's Chief of Staff, General John Kelly is the one saying it.  Kamala is just making sure that everyone knows.", "label": 0}
{"text": "Alabama", "label": 0}
{"text": "No it's not. I'm not doing chores for your bad faith, lazy critique. \n\nThere's footage of them partying, quotes of him calling him a \"terrific guy\" and you can look up who the Department of Labor was- Alexander Acosta. You can look up who Trump's impeachment lawyer was- Alan Dershowtiz, and his history with Epstein and Prince Andrew and his own admission of getting massages from his sex slaves. \n\nYou'd have to be brainwashed (or acting in bad faith) to keep your head this deep in the sand.", "label": 0}
{"text": "wow!", "label": 0}
{"text": "Couldn't be the food were all eating right? McDonald's and microwave meals. Nanoplastics being inhaled and eaten, smorgasbord of drugs being ingested.", "label": 0}
{"text": "not if we aren’t using renewable energy to charge them though right? sure I doubt people are using a gas generator to charge their EV, but seems like we’re taking a step in the right direction rather than the end goal.", "label": 0}
{"text": "Lasers. Nuclear. Atomic. Blasts. All of the fire in the sky seems like weapons to me. The sheets of glass in India really make me think this. One of the ways that could happen is atomic weapons. Another way would be meteor strike but there are no impact scars there.", "label": 0}
{"text": "What mind?", "label": 0}
{"text": "Don't forget Poseidon", "label": 0}
{"text": "Did I say you were here to entertain? Your message sounds like it was written by someone wasted. Totally changing the topic as well, since you have nothing to stand on.", "label": 0}
{"text": "Omg, RUSSIA!!!!", "label": 0}
{"text": "You can vote for a person who claims he will violate the constitution on day 1, lock up all of his political opponents and change things so you never have to vote again.  A person who makes fun of national heroes like John McCain, refuses to get wet in rain while showing respect for America graves of what he calls ‘losers’ from WW1.  Broke into Section 60 at Arlington, against federal law, for a photo op.  A person who had his daddy's doctor declare a bone spur to avoid the draft.   A person who thinks sexually grabbing women is appropriate behavior and has sex with playboy bunnies even while married to other women.  A person who makes fun of the looks of other politicians and enjoys when their spouses are hit with hammers.  A person can’t utter 2 sentences without lying.   A person who exposes national military secrets to friend to show off and brag, risking our military positions.  A person who wants the government and military personal to swear allegiance to him instead of the United States. A person who thinks Kim Jong Un is concerned about his country's population.  A person who admires Vladimir Putin. A person who encouraged Jan 6 activity, then backed away after the attempt to stop the certification failed.  A person with no integrity or respect for law.  A narcissist.\n\nI would vote for a monkey over this person.", "label": 0}
{"text": "Like I said, you're basically entering the death spiral of it's just all conspiracies all the way down.", "label": 0}
{"text": "You better get started", "label": 0}
{"text": "That wire is bigger then the head of the syringe they used to inject me ", "label": 0}
{"text": "Where does that say Taiwan is a part of the PRC", "label": 0}
{"text": "There were some unusual clots found in some patients when COVID was surging. Clots form when blood is stagnant and longer it's stagnant, the bigger the clots. In  some areas where huge numbers of people were dying there was an unusually long delay between death and embalming so larger clots were occasionally seen.", "label": 0}
{"text": "You know how you know this is fake? They are obviously heavily implying it's vaccine related while dancing around saying it", "label": 0}
{"text": "Uh huh.  This past week, it seems like 99% of what the mainstream media has published has been pure unrefined bullshit, prompted by a panicked realization that Harris is going to lose.", "label": 0}
{"text": "Would you mind sharing the link please?", "label": 0}
{"text": "They said it's Complex and Complicated so maybe you just don't understand it /s", "label": 0}
{"text": "They don’t care, they worship Baal and would prefer you and everyone else to be atheists", "label": 0}
{"text": "Pennsylvania in a fairly red area. I believe their county had about 40kish more R votes in 2020.", "label": 0}
{"text": "Only if the people vote the electors to vote her in.", "label": 0}
{"text": "Why do the conservatives think this is important?  They wanted Biden gone, they got their wish.  Now they need to live with the results.", "label": 0}
{"text": "Was he even a real person?", "label": 0}
{"text": "As long as you are not voting it's fine with me", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "In that case, it's a race to the bottom.  I hope neither country wins.", "label": 0}
{"text": "But voting is not \"inconsequential.\" The consequence is giving a veneer of legitimacy to an illegitimate farce. Not to mention that they track your voting, and send this information on to marketing firms, so that the spammers and scammers know you're gullible enough to get taken in by their scams.\n\nIt's like being offered two vials of poison by a poisonmaker, and being asked to drink one to demonstrate faith that the poisonmaker is making things that are safe to drink.", "label": 0}
{"text": "Not only did I read it, I subscribe to it as well.  Besides being a massive tax cut for the rich, it also captures, with a wide net, all those that don't pay anything at all (criminals, illegals and others in the underground society, etc.), because although not everybody can buy a yacht, everybody needs a gallon of milk from time to time.\n\nThe rich pay accountants handsomely to ensure that they're maximizing their deductions within the 55000 to 75000 pages of current tax code (including IRS administrative rulings and case law).  Do you really think they're just filling out a 1040EZ form and paying the tax due?  In fact, ask around, people everywhere are always looking for the exceptions and loopholes.  Even TurboTax makes \"suggestions\" when filing.\n\nThe article I attached is old, but, there was an analysis done a few years ago, and I can't find it.  Some economists sat down with the Cain plan and analyzed how it would have done over a period of years.  The conclusion was with no change to any of the behemoth code, by the time of their analysis it would potentially be bringing in a surplus.\n\nThat same study recognized the potential \"imbalance\" that this article mentioned, and basically said that with smart changes to the tax code, besides putting an entire sector out of work (accountants), just using pre-taxed income of many large businesses that unleash their mathematical army loose on those forms and deductions, getting the actual full 9% of the gross income, unencumbered, was going to be epic!\n\nThat was their takeaway.  Yes, the 2011 article was correct, however, sensible changes in the code would make it incorrect, and we may even reach a point where 9-9-9 was too high.\n\nLet's agree not to reduce it to 6-6-6 tho . . .", "label": 0}
{"text": "He has had 2 attempts on his life in recent months by democratic donors. If I'm not mistaken 95% of school shootings are trans questionable liberals. What I'm getting at is I think people are just okay with being crazy now it isn't one side or the other and neither of these things have to do with Kamala spewing hateful rhetoric about her competition. Instead of win let someone vulnerable take care of it for you.", "label": 0}
{"text": "Usually sound waves, but it could also be radio waves, micro waves, etc...", "label": 0}
{"text": "i heard something wierd about that bombing. after they had gathered all the bodies and matched up the bodyparts with everyone; they had an extra leg left over. no extra body was recovered, just a leg that did not fit any of the deceased. noone knows where it came from and its dna appaantly did not mach any of the other bodies., where it came from is an unsolved mystery.", "label": 0}
{"text": "That's why he kept saying that supplying Ukraine with weapons is causing the war over there.  And why he says to quit supporting Ukraine and let Russia have the country.", "label": 0}
{"text": "99.9% of the time, an electric car is zero emissions... if the electricity comes from a zero emission source 100% of the time.\n\n0.1% of the time (when they're on fire) an EV is 1000% emissions\n\nSo they're still better on average. Any questions?", "label": 0}
{"text": "This is some of what some artists were trying to show in some paintings in the early 1900s. Nude Descending a Staircase by Duchamps being a famous example. https://cdn11.bigcommerce.com/s-3rl2qg0z2p/images/stencil/1920w/products/532/39154/philadelphia-museum-of-art-marcel-duchamp-nude-descending-a-staircase-no-2-postcard__04957.1675473614.jpg?c=1", "label": 0}
{"text": "Illuminati leopard ate my face", "label": 0}
{"text": "He already tried it at the end of 2020.  He clearly does not need more of an excuse.", "label": 0}
{"text": "I’m thinking it’s time for a different sub to be created that politely asks for all of this shit to be left at the door so we can get back to Dead Kennedys and aliens and lsd", "label": 0}
{"text": "Don't forget \"10% for the big guy\".", "label": 0}
{"text": "Is anyone at all surprised about this. Anyone. Please speak up", "label": 0}
{"text": "I certainly haven't forgot Captain Sniffs a lot.. and his daughter obviously hasn't forgotten showering with him...", "label": 0}
{"text": "have you gotten your TDS checked out yet?", "label": 0}
{"text": "You spent a lot of time and effort to say Nothing Matters.", "label": 0}
{"text": "Yea everytime you mention rumble or bitchute, some people get mad. I guess they only accept youtube, CNN, FOX and MSNBC.", "label": 0}
{"text": "The enemy within doesn't come close to a leader who had 11 million of his own countrymen and countrywomen murdered.", "label": 0}
{"text": "no kamala harris is a puppet", "label": 0}
{"text": "6G is the solve. Cannot get here fast enough.", "label": 0}
{"text": "You mean [cymatics](https://en.wikipedia.org/wiki/Cymatics)?\n\n> Typically the surface of a plate, diaphragm, or membrane is vibrated, and regions of maximum and minimum displacement are made visible in a thin coating of particles, paste, or liquid. Different patterns emerge in the excitatory medium depending on the geometry of the plate and the driving frequency.\n\nWhat does that have to do with anything?", "label": 0}
{"text": "Put a piece of paper between ur eyes. U can see whats on both sides of the paper. U cant see both sides of a piece of paper in 2D. Our vision is 3D just pretty narrow since our eyes arent that far apart. Gives you the ability to perceive distance though like catching a baseball or something", "label": 0}
{"text": "*Are* they killing people though?", "label": 0}
{"text": "How did JFK get involved in the first place if he was so against them?", "label": 0}
{"text": "I'll check back in with you on that one....I'm by no means 100%, I'm more confident than we were with Biden. \n\nTrumps never won a popular vote, in any election, I don't think he's gained any popularity since", "label": 0}
{"text": "Oh, mate. It's not only one bill. This is repeatedly happening, all to please one man. If Trump doesn't like it, no one likes it, and an entire party doesn't like it. Bipartisan bills set to get signed get torpedoed. You might not think the end result is perfect, but not allowing progress one bit is just being part of the problem.", "label": 0}
{"text": "Biden signed a law putting hundreds of billions into American manufacturing and Trump said some nice things about putting people back to work, so who's to say which president did more.", "label": 0}
{"text": "So fantastical speculation will just have to do in place of facts then?", "label": 0}
{"text": "Don't be jealous just because those women are in better shape than you.", "label": 0}
{"text": "'And I love kids jumping on my lap.'", "label": 0}
{"text": "Capitalistic greed.  Stagnation is the bane of the government and large corporations.", "label": 0}
{"text": "Pizzagate was never debunked, they just said it was. They never said all of the emails were fake. You only get in trouble for leaking the emails.  They paid a guy to go shoot a gun in a pizza place to claim that it was debunked and dangerous rhetoric.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "How much further should we go back and look at guys righting about hypotheticals while ignoring what has actually happened in history?", "label": 0}
{"text": "Do you use a smartphone?", "label": 0}
{"text": "Because he’s full of shit.", "label": 0}
{"text": "Wat", "label": 0}
{"text": "60%+ full vaccination rate, I think at least one dose was closer to 70% (for their specific area). I appreciate the way you phrased your responses by the way!", "label": 0}
{"text": "I’m waiting for the Trump likes making hookers dress up like Hitler before he fucks them stories to come out!", "label": 0}
{"text": "El is he in Spanish", "label": 0}
{"text": "those are images from a microscope...", "label": 0}
{"text": "If I were running for president rn ? I’d probably do everything I can not to win ! Definitely would not want all that’s going on to be attached to me weather I try to fix it or it gets worse! Because no matter if I try or it just keeps going bad thy will blame u ! If u fix 1 part but can’t pull it all together? Still will be blamed for destroying America! Fuck all that I’d be ghost 👻", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "I know nuance is hard but read carefully. It does not say the United states Recognizes Taiwan as a part of China. It Acknowledges that that is the official position of the ROC and PRC.", "label": 0}
{"text": "Keep selling that pre-election fear. maybe you'll snag a few more to vote for daddy fashy who promises to make everything better using his hand waving magic and proposals that never materialize.\n\nAI is bullshit juice driven by chest thumping next-big-thing chasers who don't know what the hell they are talking about. Companies that use it sparingly where appropriate are going to thrive. Companies who make it central to what they do will disappear. general ai is a lying plagarism machine that makes bad tumblr art.\n\nWhen is the government defaulting? The better question is who's gonna collect on that? LOL.\n\nHousing is easing not crashing. there still isn't enough supply.\n\nSoft landing. low unemployment. rising wages. \n\nNobody wants to control you. Why would they want to?\n\nWe have no big problems short term. Long term we have massive problems with environmental collapse, but we are unable to tackle those problems with the short term thinking that permeates our culture and hair on fire fear mongering about non-existent threats.", "label": 0}
{"text": "IDK, maybe that people dont want liars competing against women?", "label": 0}
{"text": "Wasn't trump the first to send lethal aid to Ukraine though? LOL", "label": 0}
{"text": "These are not business practices, these are geopolitical issues..And getting funded from an enemy of the state is not smart.", "label": 0}
{"text": "The entire argument against it is \"there's no database, therefore no possible way to prove it\" is weak. ", "label": 0}
{"text": "It's really bad when even Anderson Cooper asks her the question they're not supposed to ask.... What have you done to fix any of this in the last 4 years.   She's left with babbling about Hitler to the deranged.", "label": 0}
{"text": "check out: Reality Transurfing", "label": 0}
{"text": "The pine box boys.  Great roots country blue... you know I'm not sure how to quantify them. I like it tho.", "label": 0}
{"text": "Doctors used to prescribe cigarettes  😭 just cause they are scientists and doctors doesn't make them all knowing.", "label": 0}
{"text": "I like your argument but one could argue that those are two images overlapping", "label": 0}
{"text": "The government will not default on its loans. They will opt for hyperinflation instead by printing more money.", "label": 0}
{"text": "> people dont want liars competing against women?\n\nIf that was true, they wouldn't want Trump competing against Kamala Harris.", "label": 0}
{"text": "Much more likely due to prolonged refrigeration than any of this “conspiratorial” bullshit.", "label": 0}
{"text": "Can you define fascism? Socialism is the belief of social(or government). ownership rather than private. Capping prices is exactly that. You can say that it's good or necessary, which some socialist policies are, but to say controlling pricing isn't socialism is ignorant.", "label": 0}
{"text": "Excerpt from article:  \"A great deal of evidence points to Serena (and Venus) being male. In addition, many people believe that Mr. Richard Williams actually adopted them. That makes sense, because I don’t think he would have abused his biological kids like that (and by that time, he already had 6 kids of his own from a previous marriage anyway). Besides, I don’t think his wife Oracene would have allowed him to do that to her kids. Furthermore, if you wanted to adopt kids on the down low from a rough place like Compton, you could probably find someone there who would be willing to give you 2 kids if you paid them enough money. And there would be no records of the transaction, so it would stay a secret. Or he could have even adopted one or both of them from another country—who knows. If they are adopted, it’s entirely possible that neither Venus nor Serena knows about it. As part of his elaborate hoax, I doubt Mr. Williams would’ve told them the truth.  \n  \nHere’s an informative excerpt from a news article:  \n  \n*When up late watching TV one night in 1980,* \\[Richard\\] *turned the channel to see Romania's Virginia Ruzici receive a check for winning a tennis tournament that he describes as \"a* ***hell of a lot of money*** \\[apparently about $40,000\\] *for four days' (work).\"*  \n  \n*\"I went to my wife and said that we have two kids, and* ***we'll become rich****. They're going to be tennis players.\"*  \n*A 78-page blueprint was soon prepared, describing how Venus and Serena would reach the top.* \\[emphasis added\\]  \n  \n(From the article: [http://baltimoretimes-online.com/news/2015/dec/16/richard-williams-i-was-close-being-killed-so-many-/?page=2](http://baltimoretimes-online.com/news/2015/dec/16/richard-williams-i-was-close-being-killed-so-many-/?page=2) )  \n\\*this has been scrubbed from the internet  \nAs he stated himself, Mr. Williams was primarily motivated by one thing: **money**. And it seems he was willing to do just about anything to reach that goal—a 78-page plan is incredibly long. Why on earth would you need such a complicated plan if you just wanted to raise 2 tennis stars? Did any parents of famous tennis stars from the past have such complicated plans? On the other hand, if you were planning something devious and underhanded, such an intricate plan would make sense.\"", "label": 0}
{"text": "Wow. What a comeback🙄", "label": 0}
{"text": "I am good friends with a funeral director and embalmer and sent him this post, asking if there was any legitimacy to those jars. He said he sees lots and lots of blood clots that look like grape jelly. No nanowires or squid fossils, though.", "label": 0}
{"text": "There's a second side to this where they also benefit from breaking down your ability to believe", "label": 0}
{"text": "I agree, but even if you charge your electric car from a coal plant I think it’s about equal to the efficiency we get out of a normal ICE engine. As we progress to more clean energy sources it only gets better. I actually would much prefer driving a gas or an electric car but there’s a strong argument for hybrids until our infrastructure is actually caught up and getting cleaner", "label": 0}
{"text": "You think TDS is real and COVID isn't.  🤣😂🤣😂", "label": 0}
{"text": "Guess Republicans shouldn't have bowed down to Trump's command to kill the border bill so he could run on a problem instead of trying to solve it", "label": 0}
{"text": "This is where the \"calamari clot shot\" got its name", "label": 0}
{"text": "Wow what a comeback🙄", "label": 0}
{"text": "they dont.  so not really relevant.", "label": 0}
{"text": "Ah yes, the Wall Street Journal, honorable bastion of truth.", "label": 0}
{"text": "Didn’t even read what you wrote bot", "label": 0}
{"text": "I’d go a step further and theorize that the sun is the cause. Not from a CME, but a step up from one of those.", "label": 0}
{"text": "Damn bro...so outspoken and brave! Do you have your own podcast yet? We need more voices like your's out there.", "label": 0}
{"text": "It appears that the board of the LA times was ready to do so and the staffers at WaPo was ready, but their respective owners stopped it.", "label": 0}
{"text": "This isnt really a conspiracy but common knowledge", "label": 0}
{"text": "Yeah their Billionaire owners forbade it.", "label": 0}
{"text": "Yep, it all started with Trump. Biden took it to the next level.", "label": 0}
{"text": "I'm sorry I misread this lol", "label": 0}
{"text": "I was referring to the media", "label": 0}
{"text": "I was providing the objective fact that men are winning in all levels of female sport. The only relevant data would be evidence that any of these men are women. The burden of proof falls on those that make ridiculous claims.", "label": 0}
{"text": "It makes cool spiral shape things. /s", "label": 0}
{"text": "From the article:\n\n>\"Before everything changed, Emily Porter was a successful lawyer. She was an outspoken progressive living in deep-red Tennessee. Perhaps above all, she was an intensely loving single mother to her three kids. She had a special bond with Adam, her youngest: When his older sisters moved out, the two of them would care for the animals on their small farm, watch Jeopardy and Lost, and, once a month, treat themselves to dinner at a fancy restaurant, where they’d try everything on the tasting menu. Adam decided that he, too, would go into law; he called Emily his “hero.”\n\n>Just a handful of years later, she was emailing him demanding that he “shed my DNA” and warning: “PAIN IS COMING FOR YOU, AND YOUR BELOVED CHINA JOE, FRAUD OBAMA AND HIS MAN WIFE MICHAEL.”\"\n\nSounds like Qanon stuff ruined the relationship between this mother and son.", "label": 0}
{"text": "The Washington Post is a right wing rag, always has been", "label": 0}
{"text": "Honestly the realest thing Ive seen someone say in a good minute. Nice to see other level headed people out there.", "label": 0}
{"text": "I think it's viral marketing. Someone took the conspiracy theory and ARG trend and turned it into a \"viral marketing campaign\". I love the idea that there is something satanic and nefarious happening over ol' Nutter Butter house, but it's just for shock and awe lol.", "label": 0}
{"text": "That's how you colonize a country from within", "label": 0}
{"text": "Would you allow that to happen to your kids? (If you have them)", "label": 0}
{"text": "but please keep posting non-political conspiracies. It's refreshing as hell :)", "label": 0}
{"text": "I'm in roller derby. Transphobia isn't unknown in my sport either.", "label": 0}
{"text": "The stories were overblown. It was from one city, and one black market distribution network. \n\nBasically, they took weed carts and cut them with vitamin E acetate. They likely chose this chemical because they 1) figured it was a vitamin (thus harmless) and 2) it has the same color and consistency of weed carts. \n\nThe problem is, they aren't doctors and they didn't do proper research, and inhaled vitamin E acetate is very, very damaging to the lungs, and a handful of people got pretty sick. It was pretty much an isolated incident, but the media ran with it (like they do with everything) and fear mongered and made it seem like it was some widespread issue. It wasn't. It was a couple of dumb asses. \n\nAlternatively, you could be referencing the \"concerns\" over \"pop corn lung\" from vaping. It's been frequently used (by companies that will profit from the downfall of vaping no less)  as a fear mongering news story about the dangers of vape. Thing is, those concerns are 1000% over blown. First of all, the chemical that causes popcorn lung (diytel. The chemical that has a buttery/creamy flavor) needs to be inhaled at very, very large amounts for a good length of time in order to be harmful (as in, say, in an industrial setting in a pop corn factory where they are using super concentrated forms of it to flavor 1000s of pounds of popcorn on a daily basis, hints the name of the condition). In the concentrations it used to be found within vape (more on this in a second), like .0001% of the total 60 mL, its completely harmless (and we know it's harmless at those levels, because the food industry has studied it extensively for many decades). But even still, well before the government decided to step in and regulate vape (at the request of the tobacco companies) pretty much every single reputable company out there removed diytel as a flavor in any of their formulations, because there was a *small* concern within the community that prolonged, low dosage exposure may be damaging to the lungs (no science was involved in this situation). This never made the news.  And it stayed that way for 5-6 years. It wasn't until the big tobacco companies and the government shut down all the small ecig companies out there (by regulating them to death and making the cost of operation so expensive that only the biggest companies could compete) that this concern ever became news worthy. \n\nI could continue to rant about the history of the ecig community (of which, I've been a member of since 2006) and how it's a perfect example of a conspiracy, and how almost everything out there about it today is propaganda.  In one of my university chemistry courses I did a whole laboratory study as well as meta analysis of the data currently available about vape and it's health impacts (we have been conducting studies of the major compounds found in vape, i.e. PG/VG since atleast the 1920s. The actors guild did an extensive, years long study on the effects of stage fog on actors, and the chemicals they use for stage fog is the same they use in vape, and they found no health impacts even with long term (decade+) exposure). But I won't. Cuz I'm sure that would bore people.", "label": 0}
{"text": "Theres a religion centered around saturn its been practiced for a long time.", "label": 0}
{"text": "Yeah my bad I'm used to the boys attacking me when I speak against big brother lol", "label": 0}
{"text": "Wait so they aren't using electric mining equipment, zero emissions factories and transportation?", "label": 0}
{"text": "Nah you’ll have to overcome your own ignorance", "label": 0}
{"text": "You must be really sick and evil to wanto to rape children and babies. This is disgusting. Monsters like that are the biggest threat to society and the future. Seeing that children are literally the future.", "label": 0}
{"text": "I think you are missing the point here or more likely are being paid per post by the same mechanism you are attempting to 'shame'. \n\nI have to assume you are pushing an agenda, have a low level understanding of the economy as a whole, or are high. Whichever the case, please recognize that no matter who wins, we lose. \n\nAlso, literally nothing you posted was true. Not one thing. Shame on you. Feel free to remind yourself in 2 months to come back so you can award yourself a dunce cap.", "label": 0}
{"text": "I love that this isn't a political post! Thanks for that. This could be an interesting discussion, I just don't know much about the god, El or Eleven.", "label": 0}
{"text": "Not sure if I believe in it but I joke about it quite a lot.\n\nThere’s this photo of my dog who passed away last week and I have no clue where this photo was taken.\n\nI don’t recognize the furniture or anything in this photo and I even asked my relatives and friends but nobody knows. There’s even his dog bed that belongs to us, meaning it has to be a place where I took his bed but I have absolutely no idea.\n\nGuess me or my dog switched dimensions.", "label": 0}
{"text": "So here's what's going on.\n\n* There's an election coming up and both sides want to win.\n\n* But there's a couple of differences between the 2 candidates *and* the 2 groups of voters.\n\n* People voting for Trump are voting *for* Trump... and they're possibly more likely to vote.\n\n* Many people voting for Harris are actually voting against Trump. But *this* group is perhaps less likely to actually go out and vote.\n\n* This is the reason why reddit has a relentless anti-Trump bias. They haven't bothered promoting Harris as much as they've focused on attacking Trump. Because someone figures that's the more effective strategy for getting more people to vote the way they want.\n\nThat someone is probably right. But we won't know if it'll work or not until after election day.", "label": 0}
{"text": "I have some oceanside property in Iowa to sell you if you think they didn't circumvent the election process. \n\nLet me ask it this way: In what part of the democratic election process did you vote for the current candidate?", "label": 0}
{"text": "Consider getting a d-dimer test.", "label": 0}
{"text": "Let’s all be scared! Surely if he’s been in contact with a scary Russian for two years now that tomorrow is the day their evil plans come to fruition!", "label": 0}
{"text": "We'll soon see", "label": 0}
{"text": "😂😂😂 WTF IS THIS", "label": 0}
{"text": "Don't forget the Hong Kong protests being completely removed from the headlines.", "label": 0}
{"text": "> If I'm not mistaken 95% of school shootings are trans questionable liberals.\n\nWould you mind backing any of that up with evidence? I know that you said you might be mistaken, but that is a wild claim to just throw out without any context or statistics.\n\nOn the two attempts on Trump I won't argue because this sub has made up its mind. The second one is dubious but calling the first guy a Democratic donor for 15 Dollars the year before he joined the Republican party is pretty hilarious.\n\nThere is one side that is completely appalled by all the things described above and in your comment. And then there is one side that is apparently pretty much okay with most of that. So yeah, this is not a both-sides problem.", "label": 0}
{"text": "Like you said, it would have to be a gradual shift, and would be, because of how tarrifs work. I would argue that its a step in the right direction, and worth the extra cost on consumer products though.\n\nThe alternative scares me.\n\nI think if we continue on the path we're on, the middle class will disappear, and the poors will work service jobs to pay massive taxes to cover the interest on the money that the burguoise prints. America will be indentured servants, serving a massive marketing machine, and nothing else.\n\nI dont think thats sustainable. Once inflation is through the roof, the US dollar is worthless, and the average American is completely milked dry, the burguoise will have to find a new target.\n\nBringing production back to the US may hurt for awhile, but it gives future generations continuity, and a relative amount of power over these massive corporations. Selling our labor to the lowest bidder is not the answer.", "label": 0}
{"text": "try harder", "label": 0}
{"text": "Nah, she probably wants to win. It could be true or it could be BS, but she'll say it anyway. I'm a moderate, but I don't think either makes themselves look good!", "label": 0}
{"text": "No video and he’s backpedaling. Surprise surprise", "label": 0}
{"text": "People who were born male and went through puberty shouldn't be competing against women in majority of sports. It's just not fair, they have too many advantages. Don't care what adult humans do with their lives as long as they're not negatively impacting any one else. Sadly, many of these trans-female athletes are having a negative impact on biologically female athletes.", "label": 0}
{"text": "They have been doing that for many years already but the interest on the printing once it exceeds gdp becomes 'funny money'. Have some examples!\n\n* **Zimbabwe (2000s)**: Zimbabwe’s hyperinflation during the late 2000s was so severe that, by 2008, prices were doubling nearly every day, reaching an inflation rate of 89.7 sextillion percent per month. The Zimbabwean dollar became virtually worthless, and the government eventually abandoned it in favor of foreign currencies.\n* **Germany (Weimar Republic, 1920s)**: After World War I, Germany faced massive reparation payments, leading to hyperinflation. By 1923, the mark had lost so much value that people needed wheelbarrows full of money to buy basic goods. The government ultimately introduced the Rentenmark to stabilize the currency.\n* **Venezuela (2010s-present)**: Political instability and reliance on oil exports have contributed to Venezuela’s economic crisis and hyperinflation, which peaked at nearly 10 million percent in 2019. The bolívar lost most of its value, and the government issued new currency denominations multiple times to combat the inflationary spiral.\n* **Hungary (1945-1946)**: After World War II, Hungary experienced one of the worst hyperinflations in history. At its peak in July 1946, prices were doubling every 15 hours, and the country issued the highest denomination banknote ever recorded, the 100 quintillion pengő, before replacing the pengő with the forint.\n* **Yugoslavia (1990s)**: During the breakup of Yugoslavia and the wars of the 1990s, hyperinflation hit the Serbian dinar. Inflation peaked at an estimated 313 million percent per month in 1994, leading to severe economic hardship and a currency replacement.\n* **Argentina (1980s and 2000s)**: Argentina has experienced multiple economic crises, with hyperinflation in the 1980s and again in the early 2000s during its debt default. Both instances led to the peso losing much of its value and the government implementing drastic monetary reforms.\n* **Greece (1940s)**: During the German occupation in World War II, Greece experienced hyperinflation, which decimated the value of the drachma. By 1944, inflation was so high that the government had to introduce a new drachma to restore stability.", "label": 0}
{"text": "It's so ridiculous. I never understood why we haven't always had a stronger more stricter border with Mexico.", "label": 0}
{"text": "So if, perhaps, Trump were to directly associate Harris with someone like Stalin, who had 9-20 million of his own people murdered, that would be motivating people to assassinate Democrats?", "label": 0}
{"text": "Groping a women I can get over but while Epstein watched ?! Now that’s just outrageous send him down", "label": 0}
{"text": "i am not a lawyer - but unfortunately yes. i believe *\"no future events\"* means the court was done with him and there were no further legal proceedings. also see the definition of *\"*[*all charges disposed*](https://www.google.com/search?q=what+does+all+charges+disposed+mean+massachusetts&newwindow=1&rlz=1C2SAVU_enUS535US535&sca_esv=dc67e9d40e314a2a&ei=dfIbZ73FNYDk5NoPw6qmyQg&oq=what+does+%22all+charges+disposed%22+mean+mass&gs_lp=Egxnd3Mtd2l6LXNlcnAaAhgCIip3aGF0IGRvZXMgImFsbCBjaGFyZ2VzIGRpc3Bvc2VkIiBtZWFuIG1hc3MqAggAMgUQIRigATIFECEYoAEyBRAhGKABMgUQIRigAUjRL1CnCFifD3ABeACQAQCYAWCgAcQDqgEBNbgBA8gBAPgBAZgCBqAC-QPCAggQABiABBiwA8ICDhAAGIAEGLADGIYDGIoFwgILEAAYsAMYogQYiQXCAgsQABiABBiwAxiiBMICBhAAGBYYHsICCxAAGIAEGIYDGIoFwgIIEAAYogQYiQXCAggQIRirAhiLA5gDAIgGAZAGBJIHAzMuM6AH1Bk&sclient=gws-wiz-serp)*\",* but maybe someone who *is* a lawyer can chime in on the legal definition or implications of *\"dismissed - defendant indicted\"*... btw, i checked the Massachusetts sex offender registry and he is not listed there, which would seem to confirm that he was not convicted of any csam charges.", "label": 0}
{"text": "I mean call me crazy.  But isnt that how a company name or brand is usually used to support a person?\n\nThe owner(s) make the decision? Not the employees?", "label": 0}
{"text": "Let us not overlook that his meetings were not secret, that the U.S. government showed no apparent concern - i.e., his companies are still heavily subsidized and he holds numerous, even secret DOD contracts and NOW, on the eve of the election, because he has allied himself to the Republican party's nominee, we are supposed to begin viewing him as a traitor to America?\n\n\nI have not established an opinion of Musk, I am not a fan, what I am even less a fan of is dishonesty in the US government that supports someone with one hand and attempts to smear their character with the other.\n\n\nFrom these very articles that have been circulating for days we learn that Musk holds top-secret clearance. If his meetings were cause for REAL concern, the U.S. D.O.D. has mechanisms in place that would have seen him stripped of his security clearances. ", "label": 0}
{"text": "Well yea they would be right, 2 images overlapping is 3d", "label": 0}
{"text": "I could see that. Still wonder if it has a double meaning considering the name though. ELVIVE  isn't even a word.", "label": 0}
{"text": "Agree, these trash rappers are doing nothing but poisoning the minds of young people.", "label": 0}
{"text": "It's at least an article...feel like a lot of the very political folks here just rip news straight from Twitter and never question it if it says what they want and comes with a picture", "label": 0}
{"text": "I know who he is", "label": 0}
{"text": "[Kompromat, duh](https://i.redd.it/ibj3crdmmxwd1.jpeg)", "label": 0}
{"text": "I don't need to. My step dad is a cardiovascular heart surgeon. He's one of the best in his state. These aren't the pictures I saw; the ones I saw were ones snapped by physicians who were completely floored that these stringy type substances are being found in people of all demographics. The pictures I saw were raw. So not sure about the embalming part of things but definitely have seen the same substances from pictures surgeons have taken.", "label": 0}
{"text": "Upvote for writing-style (and I mostly agree)", "label": 0}
{"text": "Shut up it’s egg drop soup", "label": 0}
{"text": "Fine, remain ignorant. But if you actually want to learn what 3D vision is and why we have it, start [here](https://www.livescience.com/32580-why-do-we-see-in-3-d.html).", "label": 0}
{"text": "I would agree with you there.\n\nThe doctor herself would likely agree with you, considering she isn't withholding this one study for nine years but her project is running for nine years, in which she published thirty times. https://reporter.nih.gov/search/OPTb_4f5-kOe2wU2YYzolA/project-details/10615754\n\nThis shit isn't hard to understand.", "label": 0}
{"text": "The US literally states that they believe Taiwan and China are one with Taiwan being the soul heir of governance. Not that mainland China is the legitimate government. you are either willfully, spreading  dis/misinformation or just plain do not understand the nuances of how wording is used. either way you are incorrect and extremely aggressive at being incorrect passive incorrectly?", "label": 0}
{"text": "i am not a lawyer - but unfortunately yes. i believe *\"no future events\"* means the court was done with him and there were no further legal proceedings. also see the definition of \"[*all charges disposed*](https://www.google.com/search?q=what+does+all+charges+disposed+mean+massachusetts&newwindow=1&rlz=1C2SAVU_enUS535US535&sca_esv=dc67e9d40e314a2a&ei=dfIbZ73FNYDk5NoPw6qmyQg&oq=what+does+%22all+charges+disposed%22+mean+mass&gs_lp=Egxnd3Mtd2l6LXNlcnAaAhgCIip3aGF0IGRvZXMgImFsbCBjaGFyZ2VzIGRpc3Bvc2VkIiBtZWFuIG1hc3MqAggAMgUQIRigATIFECEYoAEyBRAhGKABMgUQIRigAUjRL1CnCFifD3ABeACQAQCYAWCgAcQDqgEBNbgBA8gBAPgBAZgCBqAC-QPCAggQABiABBiwA8ICDhAAGIAEGLADGIYDGIoFwgILEAAYsAMYogQYiQXCAgsQABiABBiwAxiiBMICBhAAGBYYHsICCxAAGIAEGIYDGIoFwgIIEAAYogQYiQXCAggQIRirAhiLA5gDAIgGAZAGBJIHAzMuM6AH1Bk&sclient=gws-wiz-serp)\", but maybe someone who *is* a lawyer can chime in on the case, particularly on the legal definition or implications of *\"dismissed - defendant indicted\"*... btw, i checked the Massachusetts sex offender registry and he is not listed there, which would seem to confirm that he was not convicted of any csam charges.", "label": 0}
{"text": "You're boring!", "label": 0}
{"text": "Well, she is always drunk, so no wonder it's hard for her to even bullshit in a believable manner. She comes across as tipsy (at best) in this video to me, (along with many other clips I've seen of her speaking.) The woman never seems to be sober in any of them.", "label": 0}
{"text": "Taxpayer fund? No that needs to be released to the public.", "label": 0}
{"text": "Yet they haven't endorsed a Republican in 50 years.", "label": 0}
{"text": "Lol?\n\nSo we’re just gonna pretend we dont know who g max’s family is?", "label": 0}
{"text": "You tried. They are paying trump bots overtime. Only downvotes though, they can afford to pay them to actually debate lol", "label": 0}
{"text": "I already said my piece,wasn’t good enough for his highness.", "label": 0}
{"text": "Now 1 of the astronauts is in the hospital.\n\nWonder if it's the woman...", "label": 0}
{"text": "Yea cause he's such a good moral person who never lies or hurts people. Man it's like you guys are so far gone from the brainwashing youve completely lost yourselves. \n\n\nLet's say in your example he's a good guy and is bringing them all down. Why come out now against these people, why not after his first visit to those parties or the island did he not immediately start ringing the alarm bells? Let's say he thought the people there were too powerful and thought he couldn't, why did he keep going to the parties and the island? \n\n\nI know if I went to an island or a party where i saw a bunch of pedophiles raping children, I would not only be scarred for the rest of my life, I would never step foot near any of those people ever again. I would tell the world what was happening no matter the cost. I would definitely sacrifice my life to save those kids and try to stop these pedophiles from ever doing that again. It's an easy decision to save those children, why didn't he try anything?\n\n\nLet's say he didn't have the power then and was a scared little bitch that was afraid of these people. Why didn't he do anything when he was president? He was arguably one of the most powerful people on the planet and again he did nothing. He knew who the people were and didn't even attempt to go after them or even shame them publicly. And just a few weeks ago in an interview when asked if he would release the Epstein list he hesitated and said he wasn't sure because some people could be damaged if that came out because there's a lot of phony stuff in that world. Yea ok buddy maybe just release them and let the world decide. All of a sudden he's worried about phony stuff? Who's he trying to protect because he has had no problem with phony accusations in the past and even recently when the cats and dogs thing was debunked he doubled down again and starting saying what about the geese. He gives more of a shit about some migrating geese than releasing the Epstein list because he is protecting someone and there is only one person he protects.\n\n\nOf course releasing the list should be damaging, that's what should happen to pedophiles. Why would someone try to protect pedophiles? Just be honest with yourself for a few minutes and really think if you would be caught dead at that island or party or even that jet knowing what is going on. You wouldn't and if you would, someone needs to check your browser history and check your backyard.\n\n\nI feel like we are all going insane here! I mean how can you guys go to bat for a politician in the first place? Let alone someone like that. \n\n\nIf 12 years ago, even if untrue, it came out that a black man with 34 felonies who was cheating on his pregnant wife and then paid her to keep quiet who also praised hitler behind closed doors and saluted north korean generals who also had secret calls with Russia who also stole from his own charity and can longer be near charities and had bankrupted nearly every business he had ever owned and wont release his tax returns or birth certificate or medical reports and was friends with possibly the two biggest pedophiles to ever exist and called them good friends who like young women as much as he does and was accused of walking into underage dressing rooms and accused of raping a 12 and 13 year old at one of the pedophiles parties and also a potential drug problem, you cannot honestly tell me that you would vote for someone like that even if all of that was untrue. When everything is covered in shit and smells like shit, it's probably shit. And when decorated 4 star generals and many other highly respected individuals come out against a person it's probably not a conspiracy, it's probably the truth.\n\n\nThe biggest problem I have is the unwavering devotion to someone who hates you. Who would sell you out for a few dollars. If it's not brainwashing, I want you to do an exercise where you search on the Internet and find a few things you don't like about him and then find someone close to you who also supports him and tell them what you don't like. Just see their reaction and see if they turn on you and call you names or a rino. You should be able to criticize a politician because they are a person and people are imperfect. He himself admitted he was a \"mostly truthful\" person on Andrew Shultz podcast the other day which in his own words called himself a liar. \n\n\nI want you to know I'm not some diehard liberal and I have no problem sending Biden to jail or anyone else who is breaking the law and trying to cover up crimes. I read every news source on a story and read many forums/podcasts and listen to both sides and then determine the most likely truth. Both the Democrats and the Republicans have problems but most of the smell is coming from one person, Donald. And the project 2025 stuff is heinous and all you have to do is read it for yourself.\n\n\nI just want to see our society improve and get better and take care of our people, every single one and not just one side. Whoever reads this, I care about you and want you to live a happy life and be successful. I want all of us to work towards something better and not tear each other apart over some lying politicians. I don't have an agenda, I'm just some guy sitting on a couch frustrated because I see my fellow citizens ripping each other apart over algorithms and propaganda. \n\n\nIf you don't want yourself and others to succeed what do you want? There is more than enough for everyone if we can rid ourselves of these evil corporations and these awful billionaires. We just have to realize the power is ours we just have to work together and take it back.", "label": 0}
{"text": "Weird bc of these astronauts are in the hospital. My money says it's the woman. They wanted to try and have a kid in zero gs", "label": 0}
{"text": "He's everything you said as far as the DOD goes, and know the bulk of his wealth is wrapped up in the military industrial complex.....which makes it even sketchier when he starts spouting conspiracy theories that have been traced back to Russia, has Russian funding for his business acquisitions, and has parroted Russian ideas on social media, all while handing out wads of cash to get people to sign up to support. Nothing sketchy there...", "label": 0}
{"text": "Less politics! More Venezuelan Hitler! Also, Antarctica.", "label": 0}
{"text": "Ok, Karen.", "label": 0}
{"text": "One of them said in an interview they are good and even really good but acknowledged they couldn’t successfully compete and expect to win against men due to them being women. Think it was brought up before or at the early onset of when some men (i.e. Thomas) sucked at men’s sports realized they can win if they compete against women and then were granted the ability. \n\nThe Williams’, at least one (proly both), understand the biological differences. \n\nTo your argument- did she say this to keep the plot going or is your theory false? Their father might have realized their talent early. Maybe they are unique in hormone level production to give them advantages but still not males.", "label": 0}
{"text": "They put most the article behind a pay wall. They expect people to pay to read their opinion pieces...", "label": 0}
{"text": "Well congratulations on not marrying an inanimate object.", "label": 0}
{"text": "Did you think about this for more than two seconds before sharing?", "label": 0}
{"text": "What are killing people?  Based on what, this random-ass twitter picture?", "label": 0}
{"text": "This is true BUT its already well underway.  It's happening in slow motion. People will read books and watch documentaries of these times in the future asking how did we even let this happen. I don't believe its all doom and glum and I've never seen any of \"their\" plans be executed to perfection. We have the ultimate power of being disobedient and resourceful. Don't throw the hat in already. Read, learn, prepare, and get your mind right.", "label": 0}
{"text": "What’s your step dad’s name?", "label": 0}
{"text": "The bots are really riled up about this one", "label": 0}
{"text": "him being worth over $7.5 billion", "label": 0}
{"text": "How do you not now is not nano? I dont see any scale, and if that shit next to the wire is from vein you can imagine the thing is small", "label": 0}
{"text": "There is still a large following on greatawakening(dot)win.", "label": 0}
{"text": "Wait, so you think there's only ONE group controlling everything?", "label": 0}
{"text": "That could be to avoid vandalism too though. I saw vandalism happen last election to Trump signs and flags and even spray paint on fences personally just within my neighborhood. I’m in Florida. Plus who can afford buying unnecessary things like signs and flags.", "label": 0}
{"text": "\"May the oods never be in your flavour\"\n\nSeconds please.", "label": 0}
{"text": "nice", "label": 0}
{"text": "i watched lately The Impact documentary. There are lot of information", "label": 0}
{"text": "That’s literally all that happens here around election time. News here?", "label": 0}
{"text": "Shouldn't someone have invoked Godwin's Law by now?", "label": 0}
{"text": "I’ve been saying they’re tanking the economy in order to incentivize gen Z to go die for Israel.\n\nI assume it’s going to get way worse before it gets better, homelessness is a strong incentive", "label": 0}
{"text": "Again who cares, when the other one running has 24 sexual abuse cases against him and has told thousands upon thousands of lies.", "label": 0}
{"text": "my bad", "label": 0}
{"text": "We're dead in the water no matter who wins. Fiat monetary system will die as it always does. We are focusing on politics and not the root cause.", "label": 0}
{"text": "That is the truth of it!!", "label": 0}
{"text": "thanks !", "label": 0}
{"text": "NaNoWiRe😱😳😱😳", "label": 0}
{"text": "I dunno, I don't think you'd worry about it in the very neighborhood watch, home video system areas that tend to have LOTS of them in previous elections growing up.\n\nYou see them, but usually it's pretty old folks", "label": 0}
{"text": "What are they really?", "label": 0}
{"text": "What a load of bullshit.  And you still ignored most of what I said because you simply do not have answers that would help your argument.\n\nWhy did the Biden/Harris admin end Trump's \"Remain in Mexico\" policy? Why were the Democrats saying there was no crisis up until Texas started shipping illegals to blue states? Why was the Biden/Harris admin suing Texas for putting up border fencing and barriers?  Because they sure as shit weren't doing any of that because they want to stop illegal immigration.", "label": 0}
{"text": "will do thank you", "label": 0}
{"text": "https://libertarianinstitute.org/okc/\n\n\nRichard Booth has done a few podcast interviews as well. OKC did not happen the way they say it did.", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "lmfaooo got me there", "label": 0}
{"text": "Did Trump ever call someone Hitler or a Nazi on social media? Nope, but Kamala Harris just did. Trump may have called some individuals \"bad people\" but he never pulled the Godwin card, because he knows that if he did, he would shoot himself in the foot because of how much the media scrutinizes him.", "label": 0}
{"text": "Awesome refs, and thank you for your time and effort here.  You're a credit to this sub and again I thank you.", "label": 0}
{"text": "Clot shot...", "label": 0}
{"text": "I'm so glad I don't believe this garbage anymore. Been following conspiracy groups like this for 30 years, and bozos say this every year. Meanwhile the stock market has continued to climb during that time. Jobs have been fine. Change happens yes. New opportunities. Educate yourself and grow with the times.\n\nCalm down people.", "label": 0}
{"text": "Cool, then we agree that those who are going through the medical process of changing their gender shouldn't care if they might have to give up (certain) sports as a side effect - especially if they play at a professional level. It's relatively minor in the long run, especially when this health decision is so important to them. Women feel for them but appreciate that.", "label": 0}
{"text": "okay got you", "label": 0}
{"text": "Yea but he acts like he loves my cult leader so he smart like me. \n\n\n“Use me Lord Elon! Help make Orange man win so I feel vindicated! No more Trans talk! More techno-monarchy! No regulations! Let billionaires run the country!”", "label": 0}
{"text": "...so?", "label": 0}
{"text": "thanks !", "label": 0}
{"text": "Noticers", "label": 0}
{"text": "oh man okay will do lmao", "label": 0}
{"text": "\"10 tons of tomatoes every year. Can them all, store them in the basement, have like a harvest party when it gets loaded in.\"\n\nIs this the evidence of their basement?", "label": 0}
{"text": "Is this fucking real?", "label": 0}
{"text": "fair enough lol", "label": 0}
{"text": "The opening sentence should not include democrats because we aren’t dumb. Feel free to get overly emotional about it though. Please more ufos.", "label": 0}
{"text": "Here is one study that was done on blood clots in brain related to.covid shot\n\nhttps://www.preprints.org/manuscript/202406.1236/v2", "label": 0}
{"text": "okay haha", "label": 0}
{"text": "we are almost there folks. We wont have to suffer these zealots much longer.", "label": 0}
{"text": "It’s literally posted about and discussed in our sub.", "label": 0}
{"text": "oh jeez", "label": 0}
{"text": "The boxer Imane Khelif wasn't born male and yet everyone got their jockeys in wad over her due to transphobia. Or does this sub still think she's a man?", "label": 0}
{"text": "Singer Faith Hill?", "label": 0}
{"text": "Sounds about right", "label": 0}
{"text": "Sign, clearly you don't know the literal definition of non-market socialism which this is literally the textbook sample of what it is", "label": 0}
{"text": "Itsa Pasghetti' !", "label": 0}
{"text": "I didn't think he's being funded by Putin. From what I understand he provides internet/military communication support for Ukraine. He did it for free for quite some time.", "label": 0}
{"text": "Aren't you nervous that Trump is surrounding his campaign with literal oligarchs? I can't comprehend how you all can say Trump is for the working class while he is taking marching orders from Musk, Bezos, and Zuckerberg. \n\nopenly admitting to wanting to give Musk a position in the government should have been the reddest of red flags to all you saying Trump is for the working man.", "label": 0}
{"text": "All my friends think so…", "label": 0}
{"text": "\"Change my mind\" on r/conspiracy \n\nLmao that's rich", "label": 0}
{"text": "I protect my privacy in ways not for discussion on Reddit.", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "Did you forget the raw material mining, the actual production of the vehicle, the source of the electricity, and the disposal of said battery when no longer useful?\n\nOf course you did.\n\nThose are my questions.", "label": 0}
{"text": "How HIGH is this girl....she's such a FRAUD\n\nShe and her mother are Qanon FREAKS\n\nNOTHING and I mean NOTHING she says is true, she cant bring the receipts, she has no proof, and she has never taken anyone to these supposed \"tunnels\" she claims exist.\n\nYou know what that means? IF it were actually true.....which it ISNT....that means she is allowing hundreds of thousands of children to continue to be abused and trafficked....\n\nWhy is no one acknowledging that FACT?\n\nSee how that works?\n\nWAKE UP, shes a FRAUD for money and attention", "label": 0}
{"text": "el libertario webnode", "label": 0}
{"text": "Yes, it literally says a federal ban on price gouging. That is.price fixing which is socialist. You can argue it's necessary, but to say it's not socialist is ignorant or disingenuous", "label": 0}
{"text": "lol you think people just buy kids in Compton?", "label": 0}
{"text": "Transwomen aren't \"men masquerading as women\"", "label": 0}
{"text": "What she said was that he said he wanted a military like hitlers, so technically trump would be the one comparing himself to hitler, not Harris. And she’s only repeating what people who were close to trump said that trump said.  There’s a big difference between comparing someone hitler and saying that someone else already compared themselves to hitler.", "label": 0}
{"text": "How are they renting you a printer if you have bought it outright? How are they renting you ink?", "label": 0}
{"text": "CORRECT!!!!\n\nDing Ding DIng!!! We have a person with actual common sense and critical thinking skills....CONGRATS!!", "label": 0}
{"text": "steroids cant create muscle mass of that size in a bio female.", "label": 0}
{"text": "And exactly why did you point that out? \nWhat was your motivation? Were you just correcting for the sake of correcting?\n\nLearn to read indeed.", "label": 0}
{"text": "Exactly, all an excuse to sow distrust in the Trump administration. ", "label": 0}
{"text": "It can take between approximately 3,000-8,000 gallons (11,356-30,283 liters) of water, applied directly to the battery, to fully extinguish and cool down a battery fire.\n\nThat's why.", "label": 0}
{"text": "Her rhetoric on socialism is strong. She won't actually do it, but she has absolutely campaigned on socialist policies. All they care about is their billionaire friends getting richer.", "label": 0}
{"text": "I read comments to find people like you. Maybe I'm easily amused, but I had a good laugh. Thanks.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Conveniently ignoring that he increased unilateral drone strikes in Africa, signed the Doha Accords that led to the US retreat from Kabul and the end of the Afghanistan occupation, pulled out of the Iran nuclear deal and led to them increasing their efforts to gain the bomb and increasing their hostile stance towards the USA, and went to North Korea to \"denuclearise the peninsula\", saluted Kim Jong Un, and completely ignores the fact that they stepped up their nuclear efforts after his visit, preferring instead to jist pretend that the problem was solved. \n\nBoth sides in America are bloody awful, especially the two current frontrunners, stop pretending it's anything else. I legitimately cannot believe that either Kamala or Trump are the best possible candidates that all of America has to offer for the role of President, it's absolutely shocking.", "label": 0}
{"text": "It just doesn't matter because the level of ethics and morality among EVERY federal politician is so much lower than the average American. If you split hairs like you're doing you're bound to allow evil into your life. ", "label": 0}
{"text": "The way my mind works is a blessing and a curse. I appreciate ya for the kind words!", "label": 0}
{"text": "Are you saying it's inevitable and you would still blame democrats if they happen to hold the office? And if the democrats have \"pushed off the inevitable\", is that not a good thing for most people?", "label": 0}
{"text": "Enter the chat, Yoda did", "label": 0}
{"text": "Fair.", "label": 0}
{"text": ">How are they renting you a printer if you have bought it outright? How are they renting you ink?\n\nSoftware that bricks your device unless you pay a subscription fee. I am guessing you commented on a video that you didn't even watch.", "label": 0}
{"text": "According to Jordan Maxwell, the \"lohim\" part is just to signify plural (I feel like it should be \"ohim\" but what do I know)", "label": 0}
{"text": "I think 2020 would disagree with your assertion that the people voting against trump aren’t as motivated to actually get out and vote.", "label": 0}
{"text": "извините, я думал, что они одинаковые", "label": 0}
{"text": "So, what you’re saying is that Elon should be fined or jailed for his sweepstakes offer to voters in swing states? \n\nIf not, and if this is similar, then this should also not be illegal as well yes?", "label": 0}
{"text": "“Loudly Echo” really asked about frequencies?!\n\nhttps://youtu.be/1qQUFvufXp4?si=368rJWwLMX2u6ElH", "label": 0}
{"text": "I look only at his past record as president and i see delivered on most policies he proposed as president. America was in a far better place under his policies than in any presidency for atleast half a century. He dismantled threats from N.Korea,ISIS etc, first president in half a century to start no new wars. First president to sign peace deals in the middle east. Only good presidents get assassinated or have assassination attempts against and are ridiculed extensively by the media. Whether its true or not about the bilderberg thing, i don't care it's not Trump. \n\nThis idea about the '2party controlled by 1 pulling the strings'  used to be the case but that died in 2016. You dont continually attack,slander,try to jail and try to assassinate controlled opposition it makes no sense. For someone who doesn't play ball it makes perfect sense. \n\nAll of a sudden right b4 the election the lesser of two evils/controlled opposition bollocks has sprung up again to get people to stop voting. Just another democrat tactic that won't work", "label": 0}
{"text": "I want an interview from this fly before I believe.", "label": 0}
{"text": "I don’t trust CPS or any Texas electrical company now lol", "label": 0}
{"text": "I’m not advocating for smoking or vaping … but does anyone else recall a study coming out that nicotine might protect against Covid?\n\nWas always curious if that’s why there was such huge push to get people to stop .\n\nI could be totally way off base .", "label": 0}
{"text": "Don't count your chickens. If trump loses it will be 4 more years of \"stolen election\". If he wins it'll be 4 more years of how the Dems are conspiring to frame him for something.", "label": 0}
{"text": "This is also a big issue in Canada currently. Been taking in way more immigrants than we can handle.", "label": 0}
{"text": "Have to have a metered connection to them for backup. Have a friend that was building his own place and  trying to have it self sustaining, they still charged him the cost for the meter and I think last I checked it was like 1.15 per kw they charge you for your own power, just for having them as \"backup\" even though it's not an elective thing according to building codes", "label": 0}
{"text": "These blood clots have been exacerbated and way more prevalent since the vaccination was forced on people. The nanotechnology and self-replicating robot s and all that shit I keep seeing and hearing about, IDK. But the fact remains that since being forced to take vaccinations, three separate immediate family members having absolutely zero prior health issues had heart attacks with in 3 weeks of being vaccinated. These clots are being caused by a rushed faulty vaccine at best, and a deliberate attack on the elderly at worst.", "label": 0}
{"text": "The frequency of the tachyon inverter.", "label": 0}
{"text": "You clearly don't know much about tennis. It's no secret that Venus and Serena were explicitly raised by their father to be tennis stars - like you quote, they were literally conceived for that purpose. But that doesn't mean they were adopted male babies, it means that from the moment they were born their father trained them - hence the 78-page plan. \n\nAlthough he's been the most open about it, I do think a lot of tennis star's parents have similar plans - maybe not written down like his was, but it's no coincidence that there are a lot of tennis stars at the top level who's parents played themselves or were coaches. \n\nAnyway, they're women.", "label": 0}
{"text": "They sure are stretching the idea of 'vaxxed' people having nano wires.  LOL!", "label": 0}
{"text": "You mentioned price caps and it turns out it’s price caps specifically on insulin. Then you say get rhetoric on socialism is strong. \n\nI’m not sure you’re a trustworthy source.", "label": 0}
{"text": "Mike Adams is batshit crazy.", "label": 0}
{"text": "Glooperturn's have been around a long time, dude", "label": 0}
{"text": "We'll be fine.", "label": 0}
{"text": "My book will be “Married to a Woman that Believes the Liars”", "label": 0}
{"text": "Yes, and in this case the sources of information are within the documentary itself. Rumble is a platform that the documentary is hosted on. Same as YouTube is a platform, not a source.", "label": 0}
{"text": "A woman who killed her rapist and the Menendez Brothers have a lot in common - considering the killed the man who sexually abused them for years and the person who allowed it to happen.", "label": 0}
{"text": "What's the conspiracy here?", "label": 0}
{"text": "Orange man was friends with both.", "label": 0}
{"text": "Long term, population collapse is the problem.", "label": 0}
{"text": "Price caps on anything is socialism lol how are you not getting. Do I need to speak slower? Capping pricing on anything is the definition of socialism. You can argue that it is bad or that it is needed, but to argue it isn't socialism is stupid. \n\nI'm not sure you have reading comprehension skills", "label": 0}
{"text": "I know this is a conspiracy subreddit but damn this is dumb as fuck", "label": 0}
{"text": "fiction tells the truth that power obscures.", "label": 0}
{"text": "We don't use the 'S' word here, pal.", "label": 0}
{"text": "i've got a can opener , im coming over.", "label": 0}
{"text": "Yes, I found one article dating from May. One.", "label": 0}
{"text": "Texas has price gouging laws. Is Texas socialist?", "label": 0}
{"text": "My buddy almost lost his leg this two years ago.  A vascular surgeon removed 14 clots from his leg, and three more had to be dissolved with medication.  It took him a year to not even fully recover.", "label": 0}
{"text": "Liberal areas want them, liberal areas can have them.", "label": 0}
{"text": "It was a big deal to the people that died that day.", "label": 0}
{"text": "https://tenor.com/en-GB/view/austin-powers-its-a-man-man-gif-10702529", "label": 0}
{"text": "It’s Russell Simmons, not Richard.", "label": 0}
{"text": "Let me counter your question with a question: where does it say that they have to hold an election for the nomination of a candidate? \n\nHint- *they dont*\n\nIt's happened multiple times in modern politics, staring over 70 years ago, and before that, caucuses decided up until 1900. It's not unheard of, just unheard of *by you*.\n\nPrimaries are a relatively recent \"invention\"\n\nThe parties just put up who they think will win... your primary vote is just a temperature reading anyway... it goes to the caucuses who are essentially the electoral college for the parties. Your vote means nothing (as per usual)", "label": 0}
{"text": "Oh I see, honestly I’ve never heard of Rumble!", "label": 0}
{"text": "That is a socialist policy, yes. I know you're trying a *gotcha* but I'm not a maga guy either. Nice attempt.", "label": 0}
{"text": "If you want to call Obama white then go ahead. You’re being really weird though. \n\nKamala is Indian and she is Black. She is mixed race. Have you never met a mixed race person before? You sound so fucking stupid. \n\nShe went to a historically black college, and was a part of a black sorority. Clearly her black identity has meant a lot to her for most of her life. She participates in black culture. She is literally black. \n\nShe is also Indian. Her Tamil identity clearly means a lot to her too. \n\nI know you know this. I know you don’t need people to explain to you what a mixed race person is. You think you’re making a good point but you’re just being weird. Maybe take a step back and worry about your own self instead of other people’s ethnicities.", "label": 0}
{"text": "Lost me at nanowire", "label": 0}
{"text": "Anybody know what was said that was removed?", "label": 0}
{"text": "Lol for a biochemical engineer libertarian on keto you sound like your not invited to family get togethers all to often. Go buy a trump watch and throw another fuck joe biden sticker on the back of your truck.. and when he looses in November tell me it was another stolen election...", "label": 0}
{"text": "And it’s getting downvoted to hell because people want to ignore it.", "label": 0}
{"text": "Battle of the sexes, 1998, Australia, Court 17 in Melbourne park.\n\nSerena sister stated they could beat any male outside of the top 200. Karsten Braasch from Germany, ranked 203rd challenged the sisters and Serena responded accepting the challenge. After a 6-1 defeat Venus immediately challenged Karsten who accepted, the match resulted in a 6-2 defeat for Venus.", "label": 0}
{"text": "Republicans love to claim that the other party is the war party right before elections--then when they get into power, they blow out wars.\n\nRichard Nixon campaigned on ending the Vietnam War, then in power, he widened to war. The war continued well into Nixon's second term. It should also be noted that while Nixon was campaigning against the war, his operatives were sabotaging the Johnson peace talks.\n\nRepublicans cried loudly and there was even a movie made about Bill Clinton bombing Iraq in 1998. Republicans yelled war monger. After Republicans on the Supreme Court ended the Florida vote count and installed George W. Bush, the PNAC agenda for seven wars in five years including Iraq was implemented.\n\nDonald Trump got into power partially in his 'antiwar outsider' rhetoric. Once in power, Donald stepped up drone strikes, killed a top Iran leader, implemented the Space Force straight out of the PNAC agenda, and ended the Iran peace deal.\n\nToday, Donald promises to help Israel 'finish the job' in Gaza while threatening war against Iran.", "label": 0}
{"text": "40% of Americans [own their homes outright…](https://www.bloomberg.com/news/articles/2023-11-17/amid-high-mortgage-rates-higher-share-of-americans-outright-own-homes#:~:text=Almost%2040%25%20of%20US%20homeowners,refinanced%20when%20rates%20were%20low.)", "label": 0}
{"text": "They have plenty of \"newcomers\" to replace them.", "label": 0}
{"text": "I’m not saying Bush and Cheney are not part of the MIC and corporate interests, what I am saying is Trump is not and Kamala/Biden/Obama are. \n\nCan you name a few? \n\nAlso keep in mind, I’m not saying republicans aren’t involved in any conspiracies. Evil is throughout both parties. I look at the individual not the party they are associated with.", "label": 0}
{"text": "I see your 2020, and raise you 2016.", "label": 0}
{"text": "I’m on 538 right now, the general election polls released the last 2 days and there are a few from someone called Big Village that has Harris up big but the rest are all 1 point to either side or even.  And they also show WI, MI, PA and NV as even right now,  so I fail to see how the polls show either of them winning.", "label": 0}
{"text": "I don’t think you’re a MAGA guy, but I do think your definition of socialism is very unrefined. It’s definitely not laissez faire, but socialism is defined by social and/or government ownership of production, not a managed market.", "label": 0}
{"text": "Except you forgot to say what it is.", "label": 0}
{"text": "California most likely.", "label": 0}
{"text": "Wooosh.", "label": 0}
{"text": "🤣 thank you for noticing that typo", "label": 0}
{"text": "You forgot Mark Robinson, Trump, Putin, Kari Lake, and DeSantis.", "label": 0}
{"text": "Which embalmers are you even talking about? I see two names in this entire post.", "label": 0}
{"text": "Ah yes Wikipedia totally a great source for everything. Any pure socialist country implements price controls. I guess that's just a coincidence. But you can just keep regurgitating what the media forces down your throat instead", "label": 0}
{"text": "Maybe they're finally figuring out the super mysterious Morgellon's Disease", "label": 0}
{"text": "As opposed to being short for \"*El*even\"?", "label": 0}
{"text": "We all know what it is and where it's coming from...been banned from a few subreddits for it but that covid vax just not good for us.", "label": 0}
{"text": "I would hardly call the \"protestors\" calling for the hanging and killing of Mike Pence and Nancy Pelosi \"peaceful\".  They were violent thugs, through and through.  They don't need to be pardoned, they need to be buried under the jail.  To think otherwise implies you have an allegiance to either side, when both woke leftists and maga cult members are just two wings of the same authoritarian bird that doesn't give a fuck about you or myself.", "label": 0}
{"text": "I can’t believe this is what the climate discussion has devolved into. Thinking about the sheer amount of fuel and other resources we’ve stripped from the earth and burned over the last 200 years is insane. Living like this is a completely new experience for human beings. It’s a travesty this has become so political", "label": 0}
{"text": "Mike Adams, the person cited here for making these claims, doesn't have any relevant education or experience in any medical field. He was also very mentally unstable", "label": 0}
{"text": "Well, let's just hang on for another week or so and we'll see what actually happens.", "label": 0}
{"text": "> One of them said in an interview they are good and even really good but acknowledged they couldn’t successfully compete and expect to win against men due to them being women.\n\nWhich they proved literally true. In 1998, they both played against the male tennis player ranked 203 in the world - after he had played a round of gold and had two beers - and lost to him. At the time, Serena was ranked #5 in the world and Venus was somewhere in the top ten. \n\nEven the top women in the world find it hard to compete with men. Biology matters.\n\n(Not arguing with your comment, just adding to it!)", "label": 0}
{"text": "It isn't AI that's replacing Americans. It's illegal invaders", "label": 0}
{"text": "man's got a point", "label": 0}
{"text": "Meaning less people in the child-bearing age can afford homes because of the absurd cost and due to rampant monetary inflation the people who had homes were able to pay them off. This isn't the win you think it is.", "label": 0}
{"text": "The interview I’m referring to happed much more recent than 1998. Maybe what you posted is why they have since not said that again(idk if either has or not/doubting they have)  or it’s because they don’t like seeing woman and girls loose medals/scholarships/etc cuz men and boys are competing in female sports.", "label": 0}
{"text": "Every socialist country also has government run social services like fire. CoInCiDeNcE??\n\nYou literally haven’t shown a single source. You loosely referred to Kamala Harris’ policies without linking or quoting. You have not met the basic requirements of having a coherent and compelling argument. Let me know if you want to debate. Otherwise, begone, troll.", "label": 0}
{"text": "Like most/all embalmers, Richard Hirschman is not a medical professional. His main complaint is about blood clots, but blood clotting happens all the time in dead individuals.\n\nHis findings are not corroborated by the embalmers in general and certainly not the medical professional community.", "label": 0}
{"text": "Na, a large benefit of vaccines is less about the individual and more about how having a large part of the population vaccinated reduces transmission to EVERYone, vaccinated or not.\n\nI'm still not comfortable with this vaccine, but not for any of the reasons states.  A lot people thing have found proof their dangerous.  I haven't seen that, I'm just uncomfortable due to the lack of proof of them being safe.", "label": 0}
{"text": "Stop. Untraceable COVID ballots will fix everything", "label": 0}
{"text": "That 'If' is carrying a lot of weight.\n\nRandom screenshot doesn't even move the needle.", "label": 0}
{"text": "That looks like the Atacama Desert.  They've used both locations to stage the fake \"Mars\" landing trollers.", "label": 0}
{"text": "I never said anything about catholics but thank you for reiterating no true scotsman position 😂 I think you need to look into some antipsychotic meds", "label": 0}
{"text": "Dude get help, this isnt about the election. It's about pyschos fucking kids.", "label": 0}
{"text": "I'm telling you what is socialism, what her policy on her webpage is, and connecting the two because it is a socialist policy. I've also said, several times, that socialist policies aren't necessarily bad, but to call this not socialist is wrong.", "label": 0}
{"text": "i beat all my kids, and some neighbours, and ones i pass on the street within reach, because kids and famliy and  all that shit are just ROthShielD plants .  Sometimes dogs too, because K9 = Gematria WAlmart.", "label": 0}
{"text": "Jesus Christ this again?", "label": 0}
{"text": "yeah i just don't think this makes any sense to slow down efforts when the goal is not reached.  \n\nalso the past resets seem to have been sufficiently bad that there is little memory of events.  this would imply a massive regular drop.", "label": 0}
{"text": "Is this the next TikTok food challenge?", "label": 0}
{"text": "A neocon-funded Jamestown Foundation (created by CIA and run by warmonger-in-chief Dick Cheney and Joe Biden's puppet Michael Carpenter (Penn Biden Center for Diplomacy and Global Engagement)  keeps stealing tax-payers' money and pushing for WW3. The conference “Russia’s Rupture and Western Policy,” organized by the  Jamestown Foundation examined the possibility of Russia’s rupture based on a book \"Failed state\" by Janusz Bugajski (known CIA shill)\n\nIn the scenario where external powers are perceived as pushing for the destabilization of Russia\n\n(in this case through covert support for separatist movements), Moscow could view this as a direct attack on its existence.\n\nThe use of nuclear weapons, either tactically or strategically, could be considered a last-ditch measure, sparking a nuclear exchange with catastrophic global consequences.\n\nThe fragmentation of Russia could lead to internal chaos, with various ethnic regions seeking independence.\n\nIn the aftermath of this fragmentation, different regions or factions might engage in civil war or conflict over resources, power, or territory.\n\nIn such a chaotic environment, it’s conceivable that one or more factions could gain control of nuclear weapons or materials.\n\nThe risk of nuclear terrorism against Europe and US would rise dramatically in such a volatile environment.\n\nThey did it before (CIA created ISIS). They will try to do it again but this time in a form of a nucler conflict.", "label": 0}
{"text": "LA times is owned by Patrick Soon-Shiong, a Chinese Billionaire (family fled from Japan in WW2) from South Africa.\n\nWaPo is owned by Jeffrey Bezos.", "label": 0}
{"text": "I never heard this connection before, its insane!", "label": 0}
{"text": "Khelif is intersex, which is another subject entirely. I can get into that if you want to but IMO intersex is a separate issue to the trans issue.", "label": 0}
{"text": "Very very sus", "label": 0}
{"text": "I never watch videos where someone can't be bothered to even put a basic SS, let alone a decent SS that explains why I would spend my limited time watching a video. Life is too short and the videos posted on here too numerous.", "label": 0}
{"text": "Fascinating !!  Truly", "label": 0}
{"text": "They most certainly can, have you not seen female bodybuilders?  There's women way more massive than Serena.", "label": 0}
{"text": "Actually I don't have an alliance to either. Definitely not voting for Kamala. Don't think I'm voting for Trump, but they're certainly trying to force my hand. You know he's going to win right? You know what the precedent is now right?\n\nShould everyone who said they wish crooks hit rot on jail? Or is it only an issue when it's against your side.", "label": 0}
{"text": "8 is for infinity, but I see how you could take that the way you did. fuck actual Nazis, and fuck is Ra El.", "label": 0}
{"text": "I don't know if I believe that stat, but let's assume it's true... that means, 180 million people are shit outta luck. If 180 million people get displaced, the country's donezo.", "label": 0}
{"text": "No, what I'm saying is they probably named her Eleven so that they could shorten it to El, showing what they truly believe in.", "label": 0}
{"text": "Ook I was being lazy. Roids/Test/Tren/Dbol whatever it takes to get bigger and faster and stronger than the opponent.", "label": 0}
{"text": "Yummy pasta?", "label": 0}
{"text": "The conspiracy is anyone in the Los Angeles DA’s office or behind the scenes that orchestrated the system to have mercy on two low-life MF’s that deserve to stay in jail until hell freezes over .. \n\nThey got life without Parole as a reconsideration from the death penalty.. \n\nWhat on earth have they done in prison to deserve a submission from the DA’s office for sentencing? \n\nCheck the DA’s freezer for cold cash .. \n\nYou don’t think something stinks!! \n\nDo you want me to post the cold hard details of how they reloaded and blew their mother’s head off her body because they were tired of hearing her asking them why are they doing this.. \n\nDid you really ask me that question ? \n\nBen", "label": 0}
{"text": "I've been hearing that the dollar was going to collapse for twenty years.  It hasn't happened and I don't think it is going to happen.", "label": 0}
{"text": "Proof?", "label": 0}
{"text": "ROTFL.\n\nIt really is insane, right?  Letting children make permanent  decisions that will affect the rest of their life in ways they can not fully understand.", "label": 0}
{"text": "I think Epstein's blackmail ring was controlled by Epstein. He built that shit from the ground up ever since his Dalton days.\n\nEpstein didn't really start getting major Israeli contacts until after 2000. I think his relationship with Ehud Barak was the same as with most of the other power players; as clients, and unknowingly as marks.", "label": 0}
{"text": "Because they rape children together and have decided that makes them friends. ", "label": 0}
{"text": "> Depends on the state I think?\n\nNo, I am asking you. What do you think?", "label": 0}
{"text": "this- is real", "label": 0}
{"text": "On the 6th day, God created the 9-5 workday and maximizing shareholder value.\n\nLucifer wants to take that from all of us.", "label": 0}
{"text": "Im seriously in awe that they have managed to convince ppl that being dependent on an energy grid managed by the government, owned by wallstreet corporations, and reliant on a highly complex, global mining and refining system somehow means *less* government control. \n\nIf you slap some solar panels on your house right now you can generate your own electricity for free for as long as you want and the only way the government can stop you is if they climb up onto your house and take them. And if you have an electric car that means you can power your own car without any government involvement at all, completely unbothered by the price of gasoline.", "label": 0}
{"text": "Should we not make sure things are safe and effective before letting children use it..?\n\nOr did we throw that completely overboard after the covid shots?", "label": 0}
{"text": "My side is the side that is for the American people.  That's not any one of the current candidates, hence why I'm not voting.  Don't make the mistake of thinking I'm some Democrat or Republican.  Kamala AND Trump are both crooked, horrible, traitorous individuals.  We used to give their kind a short drop and a sudden stop.  Neither of them are what's good for people like us, and a vote for either is in my mind, an act of war against the American people.", "label": 0}
{"text": "Those are separate things bud...\n\nhttps://www.nbcnews.com/news/amp/rcna171520\n\nhttps://www.pbs.org/newshour/amp/world/to-drive-americans-apart-russia-helped-spread-hurricane-disinformation\n\nJust recent ones, but whenever there's a chance to pounce on the misinformation train his ass comes skipping into the room", "label": 0}
{"text": "What makes you think He wants to stop him? Who do you think allowed him this season to rule?", "label": 0}
{"text": "Alan Abrahamson, a former Los Angeles Times reporter who covered both Menendez brothers’ trials, urges the public to set aside emotions and focus on the facts, calling Lyle and Erik Menendez “stone cold killers.”\n\nhttps://www.newsweek.com/menendez-brothers-erik-lyle-alan-abrahamson-la-times-reporter-1973154", "label": 0}
{"text": "I guess time is relative, LOL.", "label": 0}
{"text": "This is bullshit. I will call it out every time it pops back up.\n\nSource: I'm a vascular specialist.", "label": 0}
{"text": "Would", "label": 0}
{"text": "You know they always claimed they were raped by their dad right? And he raped a child dude from Ricky Martin’s boy band.\n\nSometimes the world isn’t all black and white.", "label": 0}
{"text": "Shills gonn shill shill shill. Yawn. Tagged and bagged. Up your game. Next!", "label": 0}
{"text": "Artichoke fact? Post a single picture that looks like the above.. or is this a whoosh moment", "label": 0}
{"text": "I agree, and what they are doing to dozens of people who were there peacefully is a scary precedent, and against our first amendment. If you're for the american people i don't see how this precedent doesn't scare you. If trumps as bad as they say a lot of people are fucked in a few short months. If he's not, someone that bad will eventually come along.  It's not too late to fix it.", "label": 0}
{"text": "No but Big Mike is.", "label": 0}
{"text": "100%.  They're essentially programming their minds to be degenerates through low vibrational garbage music.", "label": 0}
{"text": "When did I insult you? \n\nI’d like you to cite a single source. Wikipedia has several sources. If you need to open a book, go for it. \n\nWhile you’re at it, though, make sure to explain to me that all rectangles are squares because all squares are rectangles. I’d like a citation for that too. It’s essentially the same argument you’ve made so far about socialism so it shouldn’t be hard to find it in the same book.", "label": 0}
{"text": "Link where", "label": 0}
{"text": "I’m sorry it’s the last picture on page 2 I had to go back and loo", "label": 0}
{"text": "Don’t you see that the world is under complete control?\n\n\nGlobal elites divide and confine us like livestock, placing us in artificial pens they call countries.\n\n\nEach of these countries is given a patriotic myth and a manufactured god, designed to keep us divided and incompatible with one another.\n\n\nTheir institutions and laws exist not to protect us, but to keep us subdued, ensuring the plebeians never rise to challenge their power.\n\n\nIf this is new to you, turn off the television, pick up books like 1984, and start seeing past the illusions fed to us by the media.", "label": 0}
{"text": "I don't want you to think I'm dismissing your fear, I think that is an entirely valid one and I think shared by most in these economic times. As with most things in economics, there's not a clear solution. It's my understanding that a sudden shift like trumps proposal would drastically damage the US. A gradual shift might be beneficial, but I think that would require a concentrated effort over multiple administration's that I just don't see happening. I think there's also a \"soft power\" argument that international trade benefits from, but frankly that's minutia at this point.\n\n\nRegardless, it's Friday my dude. I can't offer you a real one, but I can cheers you with my virtual one 🍻", "label": 0}
{"text": "i almost got jumped for asking who beyonce is a few years ago in school lol", "label": 0}
{"text": "It’s going to be hilarious when, years from now, we all realize that Trump is who the globalists used to topple the US’s economy.", "label": 0}
{"text": "You should check it out, it's essentially a YouTube that doesn't sensor and ban and de-platform people for sharing content that goes against the mainstream. Because of that it gets a ton of hate from the mainstream, but shouldn't we all be capable of using the critical thinking we just talked about to discern truth from falsehood for ourselves? Honestly mainstream platforms (YouTube in this example) act more like gatekeepers of information than unbiased hosting platforms. This gets into the conspiracy of \"illusion of choice\" as YouTube is owned by Google, which is owned by Alphabet, which is controlled by the spouses and family of high ranking politicians (both American and not) and others who also own mega corporations that deal in information and media. Ironically there are several documentaries on Rumble that do a good job of outlining this. They used to be on YouTube, but were removed for \"terms of service\" violations.", "label": 0}
{"text": "There's an acknowledgement that the vaccines are linked to blood clots, but at a lower rate than the actual virus, and typically within a short period after receiving the vaccines and while it's still in your system. The notion that the vaccines are responsible for massive amounts of deaths and any and all ailments years later (including blood clots) is just fear mongering.", "label": 0}
{"text": "Cheney is RINO NWO.\n\nCathy O'Brien Trance Formation of America.\n\nHe placed the order for Mossad informant/junior Agent in training Chandra Levy.", "label": 0}
{"text": ".... Isn't this the conspiracy sub? I didn't think \"facts\" were used often, here.", "label": 0}
{"text": "No, they don't. I'm a scientist and I say they are fake.", "label": 0}
{"text": "Is it true that the parents were among elite pedos?", "label": 0}
{"text": "And notice how people praised him when he endorsed Harris! It's like they don't know what he did", "label": 0}
{"text": "But they are!! \nExplain why the Dems party really goes for the Latino and black vote, but not the asian vote!\nIt's culture! Cause they have to explain why Asians are so successful with out the Dems. And why black and Latino do poorly with them. (Hint all the \"free\" stuff\")\nThe prior election we had 1500 or so people running for the presidency, but we only hear of the two major parties at least news wise. \nWe had JO Jorgenson and Andrew Yang running!! If the Dems are soo for \"minorities\" why didn't they pick Andrew Yang?", "label": 0}
{"text": "> they are being taken to doctors and psychologists to get mental health treatment and to figure out how to live their happiest, healthiest lives whoever they are. \n\n[Neh.](https://www.thefp.com/p/i-thought-i-was-saving-trans-kids?r=7xe38&utm_medium=ios&utm_campaign=post)", "label": 0}
{"text": "I was going to belittle your beliefs more, but what's the point. You know it's dumb too.", "label": 0}
{"text": "Hahahaha…. like big oil is the guiding light in our world?", "label": 0}
{"text": "I do not believe those in power would risk losing it and have a HUGE history of hedging bets on both sides", "label": 0}
{"text": "> Wait, so you think there's only ONE group controlling everything?\n\nI woudn't call it a \"group\", it's deceptive to try and see it that way. For me, it's a amalgamation of different thought processes (\"goals\" if you will) with some commonality that trickles down, slowly but surely, from various interested parties at the very top, while corrupting, influencing and manipulating all aspects of human life as it goes.", "label": 0}
{"text": "the question now is how we get rid of it. people in their 20’s and healthy people dying left and right. i’m 23 and had a stroke at 22 from it.", "label": 0}
{"text": "Did you know fossil fuels also require raw material mining?\n\nThis insistence that electric vehicles be absolutely perfect before they can be considered viable is absurd. They probably don't have a huge impact on any one person's total carbon output but they're still good cars.\n\nI have a relatively cheap Kia Niro EV. I don't give a shit about my carbon footprint I just like it. It accelerates faster than every gasoline powered SUV on the market and has a nice interior that accommodates my height. \n\nBesides charging at home instead of taking it to gas stations, it's just like any other car. We don't need to moral panic about them lol. You seem very exited to comment on every pro EV reply in this thread. I promise you it's not that deep bro. They're normal cars.", "label": 0}
{"text": "image 1 is a bunch of pickled artichokes, no idea about image 2", "label": 0}
{"text": "Gross numbers are meaningless. What percentage of the total number of medals given out is this? 900 out of how many? And how does that proportion align with the proportion of trans athletes in female sports? This is actually an interesting opportunity to demonstrate whether trans athletes have an edge in woman's sports.", "label": 0}
{"text": "Did you win?", "label": 0}
{"text": "The saddest part is that we gave them this power", "label": 0}
{"text": "Or they could have a pandemic tell everybody that it's being spread by cash and outlaw it.", "label": 0}
{"text": "This\n\n\nPlaying along with the mainstream to make it look like Trump isn't part of the establishment. ", "label": 0}
{"text": "[Died Suddenly?](https://rumble.com/v1wac7i-world-premier-died-suddenly.html)", "label": 0}
{"text": "Well yeah all those platforms are beholden to the advertisers that don’t want their product placed next to some neo-Nazi shit or whatever. It’s hard because these private businesses are so integrated it feels like they should have to. D open, but truthfully they can still be sued etc..for what they share, all of the legal implications are still in baby stage. I’ll check it out though!", "label": 0}
{"text": "You don’t understand , 100’s of millions of health workers are all keeping it quiet with the millions keeping chemtrails quiet.", "label": 0}
{"text": "They’re putting creepy crawlies in the vaccines!!!", "label": 0}
{"text": "I provided the dictionary definition of socialism lol. Reread your first comment and say you didn't begin the hostility. Government interacting with the market is socialism. IT CAN BE GOOD AND NECESSARY, but it is socialism. Not many libertarian propagandist would say that as your first comment accused me of, but keep gaslighting and play innocent. It's working well for your girl Kamala", "label": 0}
{"text": "Stalker much? Im not on keto, but ok… Dont drive a truck,  I live in NYC, but ok… And its’s loses, not looses🤡", "label": 0}
{"text": "the truth lies where you want, where you put the limit of what you believe or not. you could also ask a chemist about those melted iron spherules in the dust cloud, he may or may not tell you they come from military-grade nano-thermite; that's pretty much as hard an evidence as you should need yet some still refuse to believe it. there's a whole crowd of different professionals wielding different pieces of the puzzle, there's videos, there's interviews, there still evidence like that so-called 'meteorite rock' or pieces of the original buildings in museums around the world... the big question is what are you expecting to find that finally convinces you. if you expect the government to tell you the truth you are in for a very long wait.", "label": 0}
{"text": "In a lot of places all the power you create is purchased at a premium from you and then you buy your power normally. Just a way to add to the infrastructure.", "label": 0}
{"text": "yeah i had a stroke because of it and am permanently sick with long covid. i’m in my 20’s", "label": 0}
{"text": "Theory has it that the m in mRNA is delivering a code to modify DNA, and if it's modified one is no longer a \"natural born human\". And hence become part of the patent system, thats why they can't pharma/patent vitamins. Or they'd also patent, package and sell us modified vitamins", "label": 0}
{"text": "https://x.com/wake_up_girl_3/status/1849496058931413307?s=46\n\nShe's posted several videos on a similar topic herself, you might want to deep dive into it", "label": 0}
{"text": "I think kids probably shouldn’t have access to any alcohol until like 15 or 16, in controlled environments like family gatherings where they can get to know the substance and how it affects them in a safe environment where they only get overserved once to teach a lesson. Works great for Europe and Latin America, our all or nothing system just has kids getting trashed all the time the second they hit the mágic law day and inflating out alcoholism rates", "label": 0}
{"text": "I don't think I am, but Kamala's ramp up in the rhetoric the past few days has scared me into considering it.", "label": 0}
{"text": "Ooh, nice.", "label": 0}
{"text": "Glad you said this. \n\nAt the highest levels there is no \"greed\". The own the machine that makes money.\n\nBut they do seem to have a sick fetish about controlling other people and lust for power.", "label": 0}
{"text": "If you're wondering which piece of the Jenga Tower needs to be pulled, the problem is if there's about 15 of them that are all affected by just one being pulled.", "label": 0}
{"text": "This would go great in a Alice in Wonderland style political cartoon.", "label": 0}
{"text": "What of conspiracy?  Ya gotta start them out with easy ones that are simple to believe.", "label": 0}
{"text": "Everyone is jumping to so many conclusions here. Why is everyone assuming each vial is from a\nsingle individual? What if each vial holds clots from 20 individuals? Just saying.....", "label": 0}
{"text": "yep i had a stroke because of it", "label": 0}
{"text": ">\"being in a psych hospital **again**\"\n\nYour numerous comments throughout this post suddenly make a lot more sense", "label": 0}
{"text": "oh nice thanks !", "label": 0}
{"text": "It's cos they can't have mobile phones, so it gives them something to fiddle with", "label": 0}
{"text": "Stop bringing facts into this!", "label": 0}
{"text": "Search youtube for Dr John Campbell Clots.\n\nThat will give you plenty info on this.", "label": 0}
{"text": "Oh yeah so we should just let their parents make those decisions, the people most likely to neglect or sexually abuse them who do not know (or often care) what’s going on in their kids head. \n\nLife is full of permanent decisions with lifelong consequences you cannot understand. Going to college is more likely to fuck your life up than transitioning and has a higher regret rate", "label": 0}
{"text": "just incredible ...\n\nbut true.", "label": 0}
{"text": "i’m confused why people are dying if it’s supposed to be related to altering our DNA in a positive way. the side effects are extreme exhaustion, not being able to exercise, being mentally disabled, heart not working correctly.", "label": 0}
{"text": "It’s okay the bodega sells fentanyl", "label": 0}
{"text": "Reading through the comments here is funny, because every comment reads like I’m in the politics sub. And by funny, I mean it’s annoying.\n\n\nLet’s get back to the whole “the government manufactures/inflates the climate crisis/any crisis whatsoever so they can hide shit that has nothing to do with the *whatever the crisis is* in their green bills/defense bills/economy bills/whatever bills that just launder taxpayer dollars to their friends in major corporations while living in a manner completely inconsistent with the *pick a hot topic* soapbox they stand on because the government doesn’t give a fuck about you and is controlled by people you’ve never heard of who have more power and money than you could fathom who manipulate the public like cheap puppets to encourage divide along cultural lines/petty bull shit so they don’t come together and realize the enemy is those in power” type shit.\n\n\nYes the run on sentence was on purpose.", "label": 0}
{"text": "No covid vx here", "label": 0}
{"text": "Just get vax", "label": 0}
{"text": "Most of these people are endorsing Kamala because Trump would be an awful president, no conspiracy about it.", "label": 0}
{"text": "I found this music video fitting.  \n  \nGhost - Phantom Of The Opera.  \n[https://www.youtube.com/watch?v=Wn-VdZ4LEKg](https://www.youtube.com/watch?v=Wn-VdZ4LEKg)", "label": 0}
{"text": "This is a place for absurdity, my good man. How dare you come here asking for facts and things based in reality? Sir, do you even have schizophrenia? Guards. Guards. Remove this man.", "label": 0}
{"text": "RemindMe! 60 days", "label": 0}
{"text": "You really think California will ever start carrying out death sentences again? \n\nAll those people on death row in California are kinda in a legal loophole because the death penalty hasn't been abolished but they do not carry out the sentence either. \n\nAnyways, I don't know the case of the person that killed her rapist, but I believe in reform and not punishment for the sake of revenge. If they are reformed, and they probably are after 35 years then fine by me. I highly doubt they murder again if they were released. \n\nBetter on the tax payer to get these people that aren't a danger to anyone out of prison.", "label": 0}
{"text": "I wonder if you can pay thenlm for a protest them pay them again for the counter protest? I wonder how many \"protests\" are exactly that...", "label": 0}
{"text": "I was thinking more of a peer reviewed study not a Netflix special.   Also, credentials don't seem to mean much lately.   \n\nI will also solicit links to the best information that contradicts this in order to steel man the info.", "label": 0}
{"text": "Read the article", "label": 0}
{"text": "That's the beauty of this nation (for now), you can vote however you choose.  But I know what I see when I watch his and her speeches.  When I see either sides propaganda.  It's all divisive.  Give me a candidate that chooses to try to unite everybody, left, right, or centrist, under one righteous cause, not call the \"other\" side names and alienate them.  But then again whether Trump or Kamala wins, it's all by design, they're both bought and paid for by the powers that be and are put into their places based on prewritten script, and our votes are a facade, and actually mean nothing.  This has been the case for a very, very long time.", "label": 0}
{"text": "Sweet, same. \nI have to wonder how these things tie in", "label": 0}
{"text": "Stopped reading at “I’m Canadian” lol", "label": 0}
{"text": "So US being assertive is bad. Russia trying to overthrow US hegemony and threatening with nukes good? Let me tell you, the US is not in the bad here.", "label": 0}
{"text": "Look up David Hinckley Sr. He was Vice President George Bush's close advisor and friend and worked for him in the 1980 presidential campaign. If his son had succeeded, David Hinckley Sr's buddy Former CIA Director George Bush would've become president.", "label": 0}
{"text": "If it's fair than the proportion of medals won by trans women would be about equal to the proportion of trans women who compete in sports.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "because people are dying left and right including healthy young adults. they just want everyone to ignore that. they want you to ignore that your fellow people are dying and that’s really sad.", "label": 0}
{"text": "Who cares at this point. Ive known this for sev yrs so have others. We cannot have another 4 yrs of the same last 4. Forget Orange, Vote for your life because thats what you have at stake", "label": 0}
{"text": "That is in fact not enough said sorry bot :/", "label": 0}
{"text": "Of course you did. I just copy and pasted the actual decision. We know you don't care about that - only the partisan narrative.", "label": 0}
{"text": "I wouldn’t consider him a commie, so that doesn’t really help my question", "label": 0}
{"text": "Facts??   Here are some verifiable facts:  cost of living is at an all time high, more illegal aliens let in the country over the past 3.5 years  than the population of NJ.  Doomsday clock is closer to midnight than ever before.  Proven Mass censorship at the behest of the govt, network \"news\" selectively editing interviews to make Dems look good, presidential debate questions given to Dem candidate..  shall I continue?  The Dem party calling Trump Hitler and fascist after setting vaxxx mandates that needed to be overturned by the Supreme Court (many people lost jobs)... my body my choice?  I guess not.  Woke mind virus is the cult.  Seek some help.", "label": 0}
{"text": "Sorry to hear. I’d be curious of the make up of your dad’s investment accounts. Diversification is important. Also holding on to your investments long term. \n\nNot sure exactly his set up, but assuming he invested “aggressively and held on, his 401k would be worth roughly 4x today, using let’s say S&P500 (INX or SPY) as a guide. So for instance if he was at $250,000, then “lost everything” but didn’t do anything with his account, it would have bounced back to $250,000 in 10 months, and he’d have one million dollars today.", "label": 0}
{"text": "yes i had a stroke due to it", "label": 0}
{"text": "\n>they said it spreads misinformation.\n\nIt probably does lol", "label": 0}
{"text": "Thirded.", "label": 0}
{"text": "It’s wrong to show the puppet president here. try heads of the families that run IMF’s.", "label": 0}
{"text": "They didn’t ban the conspiracy books. They just decided having a section dedicated to it was perhaps not what they wanted.", "label": 0}
{"text": "Well, I'm not downloading a random MKV container, but you seem to be saying that these \"very top parties\" are all taking aligned action that robs lower-level actors of their own independent action?", "label": 0}
{"text": "There’s a documentary on Netflix about Juul and it goes into detail about the sickness being caused by unregulated cartridges. It’s actually a pretty interesting documentary if you are interested.", "label": 0}
{"text": "lol no. NASA does that, he's just the contractor.", "label": 0}
{"text": "I don't think he's a paragon of morals or ethics. In fact, I think he's deeply flawed. I don't care if he's brash or egotistical. We need more politicians willing to not beat around the bush and avoid answering questions.\n\nI look at what he did in his 4 years as president. The Abraham Accords were a significant step in bringing peace and stability to the Middle East. At the same time, due to sanctions and trade restrictions imposed by Trump, Iran was struggling to fund Hamas, Hezbollah and Houthis. Then you have his willingness to open dialogue with North Korea. Stepping across the DMZ was a powerful moment in showing the US's willingness to bring actual Peace to the Korean peninsula. He secured the border, more or less, and was only prevented from doing so fully by Democrats. The world is slipping into instability and our current leaders are pushing us towards the edge. They torpedoed all peace talks with Russia. The parallels to pre-WW1 and pre-WW2 are obvious, yet our leaders continue to escalate.\n\nYou say he's compromised. Compromised by who? Russia? That's been debunked 10-fold. The only thing in the Mueller report that connected him to Russia was a potential licensing deal for the Trump name on a hotel, negotiated by none other than Michael Cohen, which ultimately did not happen.\n\nCompromised via some Epstein connection? He was the only high-profile witness to testify against Epstein. And he has committed to releasing everything on Epstein.\n\nIsrael? Israel only exists because it is the US and UK's will that it exists as a western outpost in the Middle East. Only groypers and Hamas supporters believe that Israel somehow controls the US and not the other way around. I disagree with sending them billions of dollars, but we're never going to have one candidate who's positions line up with everyone all at once.", "label": 0}
{"text": "I just went down that rabbit hole, blows my mind. I've been all over conspiracy stuff, but never heard this. I got here by learning Obama is related to the Bushes, through Sam Hinckley. Crazy", "label": 0}
{"text": "Whatever happens, do not turn on your neighbor. Pool resources together. Give people hope in any way you can. Show each other we can govern ourselves effectively and that we do not need their “assistance” when it’s offered. Turn them away and turn toward each other. I know it sounds corny but that’s what we need. To embrace each other and reject them.", "label": 0}
{"text": "Hundreds according to what they publish. However, have you considered they wanted him in power and they simply say they attempted to kill him to play politics.   It's not beyond the realm of possibility by any stretch of the imagination.", "label": 0}
{"text": "I’m a Biologist and at first I was skeptical but curious enough to look at the images provided in greater detail. \n\nWhile the comments about the “wire” not being nano are fair, the image is at 40*200 magnification. On closer inspection the conductive portion inside this biological tube, would be on the nano scale. \n\nThis is not the only individual that has found this phenomenon , all images appear to be legitimate and the samples depicted reveal hidden biological characteristics at higher resolution.  There has been a marked increase in frequency of this phenomenon found since the booster period.", "label": 0}
{"text": "Ugh. That’s so tragic. \n\nThat hurts my heart. Like I love a good conspiracy. But at no point should it be causing you to talk to your loved ones like this.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Facts", "label": 0}
{"text": "It's spelled \"YUGE\".", "label": 0}
{"text": "Thank you. And just because my comment is getting down voted, I feel the need to add for you and anyone else: don't believe anything just at face value. But also don't disbelieve anything at face value. In this age of information overload it's a mess discerning what's true or not. But pattern recognition and critical thinking, along with intuition and every other cognitive ability we possess should be used. And in many cases part of something is true, but other parts are not. All of something can be true, and the conclusion be incorrect. And vice versa. There's an old quote something to affect of \"all I know is I know nothing.\" I feel that sort of embodies a conspiracy theorists mindset.", "label": 0}
{"text": "I under no illusion this was as scripted. a lot of people have been institutionalised and would laugh the conversation out the room.", "label": 0}
{"text": "Proofs of a Conspiracy by John Robison published in 1797 is the original conspiracy theory and I suggest everybody here order a copy immediately.", "label": 0}
{"text": "Yeah don’t fall for the trap", "label": 0}
{"text": "Maybe he just hates trump? The guys a fucking asshole and a creep, as much as he's funny there isn't really anything to like about him... he's not going to drain the swamp, you guys need to get some real fucking conspiracies ie both trump and Kamala are on t the same team? Ffs", "label": 0}
{"text": "It won’t matter \n\nIt will happen no matter what \n\nEven if it’s only like 20 rioters", "label": 0}
{"text": "Yes", "label": 0}
{"text": "🎯🎯🎯", "label": 0}
{"text": "You are 100% correct. Cheers friend. Be well.", "label": 0}
{"text": "You're not looking at this correctly and the information as also vague to be frank. It appears that they're citing examples of 400 competitions in which trans athletes won 890 medals. There's no indication of how many medals are given out in these competitions, but more importantly, they don't cite how many competitions took place in which no trans athletes won medals. Maybe there were 10,000 competitions that met their search criteria and only 400 involved a trans athlete winning. Maybe there were even more, we don't know.\n\n\nI typically find, if someone is just throwing around a big number like this, it's probably because they have an agenda they want to push and they think this is the best way to push it. If a number that provided more context and more accuracy would also support their agenda, they'd probably use that instead, but they don't here and there's probably a reason for that.\n\n\n\nSo really, the numbers here are meaningless if we're trying to establish the prevalence of trans athlete winning competitions, which is really what matters.", "label": 0}
{"text": "I don't think it is a positive thing at all. It's not natural, by definition. Personally, I'm strongly opposed.", "label": 0}
{"text": "They've been padding the numbers for years.", "label": 0}
{"text": "the most truthful statement I've read today", "label": 0}
{"text": "You're gonna ignore me but yoga, Qi Gong and breathing exercises. I'm not a doctor or anything but I've seen and felt it work. Getting the body to circulate, heat, relax and expand is the best thing you can do for it. It strengthens the body and regulates the heart and is a full body massage. I believe it helps blood clots especially as most of the exercises are focused around circulation and cleansing. Where strength training builds muscle these work on your internal organs and nervous system. I can't imagine there's a better option apart from surgery and regular blood thinners.", "label": 0}
{"text": "No tell me more", "label": 0}
{"text": "How is anything that runs off the electric grid zero emission to begin with?", "label": 0}
{"text": "Saudis funded his Twitter acquisition. Not a peep about that in here though.", "label": 0}
{"text": "yea i’m very curious about stuff i don’t mind looking into stuff haha", "label": 0}
{"text": "His mental health definitely didn’t decline because who he is and who he loved was shunned by the nation he helped save, hey?", "label": 0}
{"text": " The Menéndez brothers are broke. Evidence came up substantiating their claim of abuse by their parents.", "label": 0}
{"text": "Nah, I'm good. My podcast is only for people who are clever or funny.", "label": 0}
{"text": ">I mean, different people have different motives, but some of these people’s motives are definitely money\n\nI’m just responding to your comment saying “it’s all about money.” A great deal of the people complicit to what is happening *are* motivated by money - yes. But again, what the agenda is actually actually about and driven by is not simply money/profit.\n\n🤷‍♂️", "label": 0}
{"text": "Seems to have something to do with the show. \n\n[https://en.wikipedia.org/wiki/Monsters:\\_The\\_Lyle\\_and\\_Erik\\_Menendez\\_Story](https://en.wikipedia.org/wiki/Monsters:_The_Lyle_and_Erik_Menendez_Story)", "label": 0}
{"text": " It's odd how the actual virus is blamed for almost no lingering health problems.", "label": 0}
{"text": "Well, in my case I definitely would have done better had i been allowed to know what trans people were and empowered to make my own healthcare decisions. Also definitely should’ve got braces but my dad really wanted that new car, dental care access is a much bigger can of worms tho", "label": 0}
{"text": "Why would they make this up?", "label": 0}
{"text": "I'm counting at least 6 🇺🇸🇺🇸🇺🇸", "label": 0}
{"text": "Quantum suicide?", "label": 0}
{"text": "I was all in on Kennedy just hoping a third party guy could get to 15-20% but the interference on him running was insane. His word isn't enough for my to go lesser of two evils but there have been things unfortunately pushing me that way. No matter who wins we lose though", "label": 0}
{"text": "Diddy tried to replace Jamie's blood with baby oil lol", "label": 0}
{"text": "Here's a few \n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC7845267/\n\nhttps://thequantuminsider.com/2024/06/03/moderna-ibm-quantum-researchers-use-quantum-computers-for-critical-step-in-rna-based-therapeutic-design/\n\nhttps://oxfordglobal.com/discovery-development/resources/mrna-vaccine-development-to-get-a-quantum-boost\n\nhttps://www.mdpi.com/2571-5577/4/2/27\n\nhttps://ijvtpr.com/index.php/IJVTPR/article/view/102\n\nhttps://www.ijvtpr.com/index.php/IJVTPR/article/view/111?fbclid=IwZXh0bgNhZW0CMTEAAR30Gp1jTINXyovuSCeqOxRiNpQFC8zqnwK9zFNrO25SnL5Ctk4dk8MSV0w_aem_8NAZOQ6ntdJHPUq5_m4HEw", "label": 0}
{"text": "Im sorry, but this whole post is such nonsense and lack of history knowledge. because first of all you can't compare Yugoslavia to Ukraine as Yugoslavia had a civil war and was a multi-ethnic state which was also the reason for this conflict and Ukraine which is a mono ethnic state and which is NOT the reason for the war. And second of all, provoked how? By wanting to be alive? Russia is a threat they always were they killed 10 million Ukrainians (in whole Russian history) by starving and persecuting them. They killed out russian native people (Circassians, Ichkerians and etc.) and basically all folks under Russia suffered from genocide (Poles, Romanians, Kazakhs), so ofcourse Ukraine wanted to join NATO, because they want to live. And giving land won't solve anything? It will only escalate the conflict. Imagine the first time you invaded, you were allowed to get some land, why not try the second time, or third? Russians in Ukraine are a different subject, how are we supposed to treat them after what they did to us? The Odesa house wasn't burned by Ukrainians, Ukrainians actually helped them out of the fire, and my dad also witnessed it. The president that wanted a good relationship with russia (I think u refer to Yanukovich) was kicked out because of other reasons, first of all he lied to the Ukrainian people about Eurointegration, used violence on people, limited free speech, stole money from Ukrainian people and built enormous mansions (I've been to one as its a museum now), developed corruption so much that we still struggle to this day and when people had enough and some students decided to peacefully protest they were beaten by government police. Last name policy is also indeed a thing, but since the documents are in Ukrainian, we have to write them in Ukrainian, f.e. i have a russian last name (Милёхин) but you can't write it like that in Ukrainian as it doesn't have the letter ё so its written down as (Мільохін). Russians in Ukraine and basically in other post soviet countries are a huge threat, they spread propoganda like your neighbor did because it's far from truth and it's easy to research and I don't blame nor you nor people who share your point of view but please do your research and dont state your facts based on \"trust me bro\" everything I have said is easy to find and everything I've said is honest. Again, this war is not because Ukraine has made russia start it, but because russians can't stay at home and mind their own business.", "label": 0}
{"text": "www.weathermodification.com\n\nthey'll add one to your plane.\n\nwake up.", "label": 0}
{"text": "Yes.\n\nWait into you see how the area looks where they mined the material to make that battery.", "label": 0}
{"text": "It's it at all possible that both superpowers are bad at the same time?", "label": 0}
{"text": "Because it's part of the plan to leave Trump holding the bag when the economy collapses. That way the Dems can successfully run a top tier candidate in 2028 by having plenty of time to get everything in place.", "label": 0}
{"text": "You'll get downvoted but this has been a theme for decades amongst science enthusiasts", "label": 0}
{"text": "The \"nano\" wire is how you get the enhanced 5G signals.", "label": 0}
{"text": "So true. Every week they are like, so yeah, there are gonna be 5000 natural job cuts in technology and I'm like, didn't they boast about the technology sector just yesterday? Then of course you remember that all the new jobs get outsourced to Mexico and shit. ", "label": 0}
{"text": "Wow, good one! Your insults are so original and insightful! \n\nWhat are you going to do next? Which 90s film will you quote next? I'm on the edge of my seat.", "label": 0}
{"text": "Don't know why you deleted your other post (except because people were disagreeing with you), but there were extenuating circumstances in the murders - mainly that the father abused both boys and the mother knew. \n\nThey've not yet got a second chance, but they have served almost 35 years in prison. That's a long time for killing your rapist and abuser. I support their case being looked at.", "label": 0}
{"text": "Government administration of the means of production and distribution of goods. What would you call price caps?\n\n\nYeah sorry about the dig on the reading comprehension. I don't support either candidate so no matter what I say I'm attacked. Constant defense mode on my end", "label": 0}
{"text": "First time?", "label": 0}
{"text": "Finally a pragmatic comment", "label": 0}
{"text": "I agree I'm just saying this is painting people like me as mentals, which I'm not. I just want to know stuff.", "label": 0}
{"text": "Same as all the others. He does what he's told", "label": 0}
{"text": "No.", "label": 0}
{"text": "Big pharma got us on this one idk what you want us to do. ", "label": 0}
{"text": "I never saved the link to the video, but many years ago some mainstream investigative journalists (when there was such a thing) tried to replicate the truck bomb and examine the damage it did.\n\nThey went way out in the desert where you can blow stuff up. They could create an exact replica of the truck and the bomb inside, but for the building they could only replicate one column, the closest one just a few feet away across the sidewalk.\n\nTwo interesting results:\n\nOne was that using the bomb configuration as confessed in court by McVeigh, the drivetrain was blown like a hundred yards away instead of straight down into the ground as at OKC. The bomb expert suggested a configuration different than McVeigh said, and when they tried again they replicated the real-world result on the drivetrain.\n\nThe other shocking result was that the huge truck bomb only caused very minor surface damage to the concrete column. I mean, if you worked maintenance on the building you might not even bother repairing it. It wasn't painted so it was just chips out of the concrete.", "label": 0}
{"text": "Bezos doesn't want Amazon to be broken up, the communists have already hauled them in front of the FTC  and are suing them.\n\nhttps://www.cnn.com/2023/09/26/tech/ftc-sues-amazon-antitrust-monopoly-case/index.html\n\nHe knows which way the wind is blowing.", "label": 0}
{"text": "Why do you think so many of us call it \" the clot shot\"? I know, I know, it's Baffling.", "label": 0}
{"text": "Try copying and pasting it into your browser, it has special characters in the url:\n`https://odysee.com/@JeffreyEpstein:1/PART-1---The-Truth-About-Pizzagate-(Killing-Children)-(1):6`", "label": 0}
{"text": "> You know what poor kids do in that situation?\n> \n> LEAVE! Run away !!! Go live with relatives..\n\n That's a really fucked up thing to say. It's not that simple.\n\nI agree that there's a huge racial component to how people are sentenced in court (or send to court in the first place), but I do not think this is a good case to use as an example.", "label": 0}
{"text": "You really have no fucking clue what you're talking about.", "label": 0}
{"text": ">literal oligarchs\n\nOligarch - Noun - *a very rich business leader with a great deal of political influence who benefits from the privatization of state-run industries.*\n\nWould you care to expand on what state-run industries Trump privatized, and which business leader he awarded that to?", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "The father was fucking his little boys not pushing them during tennis practice. I say the dad deserved it for doing things and so did the mother for knowing and doing nothing about it. I don’t think you know the facts Ben.", "label": 0}
{"text": "What’s your interpretation of watch the waters drop?", "label": 0}
{"text": "Peer pressure, not wanting to risk their job or careers.", "label": 0}
{"text": "agreed, personally i think it's mostly the new generations and i understand it too, if the establishment tells you and you still have no reason to doubt it's word, so you'll believe it was super terrorist from a cave in afghanistan running the show. i just discourage blind faith in the profesional crowd for you can find it, but maybe once you do you still might not believe it, and that's a whole other problem.", "label": 0}
{"text": "Maybe the best girl.  \n\nhttps://youtu.be/rRuVTfNxauc?si=Wf83GD5UWC-af618", "label": 0}
{"text": "The only witnesses you need are the two brothers description of the cold blooded manner in which they killed their parents", "label": 0}
{"text": "At least less than the cows I suppose.", "label": 0}
{"text": "Trump was a hardcore anti-EV guy, now he isn't... \n\nTrump gave Musk billions of tax payer money for spacex...\n\nHow are you turning a blind eye to this stuff?", "label": 0}
{"text": "Cases like this bring up emotions, I understand. Like I said elsewhere, I agree with you about how different Black and poor people are treated by the law. But I also think that this was a case of two abused kids killing their abusers and serving 35 years for it. I support the DA looking into their case and deciding if that was enough time. They don't necessarily deserve life in prison.", "label": 0}
{"text": "I agree with that last part, either way we lose. It's the classic strategy of divide and conquer. They divide us politically, make us really, REALLY hate whichever side we disagree with, all so they can conquer us from within.", "label": 0}
{"text": "The real truth comes from random people sitting in their cars on TikTok.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "He is looking so trustworthy, you would never expect that from anyone looking like him... /s", "label": 0}
{"text": "Fourthed", "label": 0}
{"text": "Kamala was against fracking, now she isn't... \n\nKamala gave Lockheed Martin billions of tax payer money for Ukraine... \n\nHow are you turning a blind eye to this stuff?", "label": 0}
{"text": "Ok .. let’s do it your way .. let’s pass a constitutional amendment that says any abused child is entitled to murder their parents in cold blood without an eminent threat to their lives .. \n\nYou wouldn’t have any parents left on earth .. \n\nBen !!!!!", "label": 0}
{"text": ">White peoples won’t be extinct at max we all mix with other race… \n\nThat IS extinction. And it's being heavily pushed on White people, if you hadn't noticed.\n\n>also the elites don’t really like to mix there blood…\n\n*Jews.", "label": 0}
{"text": "Yeah, I don't really care about Bigfoot, but to say MKULTRA and *some* secret societies aren't real is a straight lie.\n\n\nBohemian grove is a real thing. Skull and bones are a real thing. Darpa fuckery is a real thing. Cambridge analytica is a real thing. These are all \"conspiracy theories.\"", "label": 0}
{"text": "It can also be shot related. I am not discounting this could be a reaction to covid I am only saying what I saw. It was just like this.", "label": 0}
{"text": "The car? Yes. The all-consuming fire? no.", "label": 0}
{"text": "Yes I do!!! I was an abused child FKR! \nAnd I didn’t murder my parents!! \n\nBen", "label": 0}
{"text": "You want videos instead? Because there are videos of embalmers talking about this. No matter the medium, It IS indeed a conspiracy theory that is out there. Why are you still complaining?", "label": 0}
{"text": "I am dyslexic and dumb. Didnt even see that thanks xD", "label": 0}
{"text": "Seems like bots down voted that comment.", "label": 0}
{"text": "Was it your turn to post \"The world is ending, buckle up\" this week?", "label": 0}
{"text": "Yah I felt bad for advising you to use paywall or brave as I tried myself and it was a nogo. 😳\nSo I just signed up. \nI tried to archive on there too but wouldn't allow me to log in then archive it.", "label": 0}
{"text": "Acknowledged. \n\nMy issue with this is I’m interpreting the semantics of this definition. Socialism requires collective or government ownership **and** administration of the means of production **and** distribution of goods. \n\nIf these bolder words were **or** you’d be absolutely correct. However, that would also make the following socialism:\n\n- Legal cannabis\n- Alcohol\n- Gambling\n- Food\n- Prescription Drugs \n- Banking\n\nAnd much more. All of these things involve administration of the means of production **and** distribution of goods. For example, you can’t sell alcohol without a permit. You can’t commercially produce food without following the USDA’s regulations as the FSA administers food and pharmaceutical production and distribution. \n\nYou need the whole definition for it to be socialism. The first part is vital.", "label": 0}
{"text": "and if she was saying she was going to give the CEO of Lockheed a cabinet position I would be freaking out.", "label": 0}
{"text": "Yeah, Alabama Power has a good hold on politics here. They even got away with basically dumping coke (coal production byproduct) directly onto this minority neighborhood by buying off city officials and purchasing the local newspaper.", "label": 0}
{"text": "What they're saying is that this is fake.", "label": 0}
{"text": "Not a damn thing. In fact, during their second trial, I was in the courtroom next door and everyone was more interested in the outcome of my lowly case", "label": 0}
{"text": "Proud pure blood. Fuck Fauchi, Dazek.", "label": 0}
{"text": "She is as the prosecutor in that one gang rape case with the 13 year old", "label": 0}
{"text": "Doesn't matter, imo. We're gonna get who they give us", "label": 0}
{"text": "I was thinking the same. I am a continental lawyer and I always Google every lawyer I hear of in my area, and they all have some kind of news articles for the smallest cases. Even the people from uni who I thought would amount to nothing, have been interviewed in front of courts.\n\n\nI see Kamala Harris was an attorney general. That is a very high position, defending the state of California. So, why was she never in court? Or can someone explain exactly what she did. ", "label": 0}
{"text": "Their parents was also aholes not saying it’s right to murder them but we gotta stop acting like this isn’t real life not a comic book movie only way the villains stop is by being permanently put down", "label": 0}
{"text": "Bill Clinton got pressured to bomb the Balkans because his wife was mad he fucked an intern.\n\n\nMost American presidents are outright war criminals.", "label": 0}
{"text": "This sub has a lot of members it's one of the few places on reddit they can post their partisan drivel other subs simply won't have as many eyes on it. \n\nPair that with bot driven engagement and upvotes and this is the result.", "label": 0}
{"text": "It doesn't really depend on that because any woman or girl who had their medal or win stolen by a person who went has the unfair advantage of going through male puberty is too many. You seem to have a percentage or number that would be okay with you - but most people don't feel that way. No girl or women should have to suffer because someone has transitioned. That's not fair. (And, frankly, it's often dangerous.)", "label": 0}
{"text": "Please elaborate, SpaceMonkey", "label": 0}
{"text": "Blurry images don't typically get clearer the more you zoom in. This isn't CSI.", "label": 0}
{"text": "No, it's based on the fact that this has been known and talked about for years. Are you new here, do you need someone to TLDR for you?", "label": 0}
{"text": "Exactly. I am a continental lawyer but I don't have access to any cases, memos, defences, etc., not even the decisions, without an expensive database. Legislation is free online, jurisprudence isn't, unless you go to the library in the court, or the library at the university. ", "label": 0}
{"text": "Lmao the Y2k reference gave me a good laugh. I'll bring some of the MREs I bought as well and we can make a meal.", "label": 0}
{"text": "Why would trump keep in his nightstand a book of speeches by that leader? And then lie saying that the friend who gave it to him was Jewish? (He wasn’t)", "label": 0}
{"text": "Be prepared but no need to be morose. 2 months isnt going to be the bottom. We have a long way to go and can maybe turn things around. The US is still the safest bet when it comes to investing. Every other nation is struggling. Their is still alot of oil ln the ground and sane management of our resources is a way forward.  Novelty politics needs to end.", "label": 0}
{"text": "Not sure. Is he even an embalmer? Which state? The metal wire is likely from an angioplasty procedure where the wire is inserted into the artery to expand it when it's blocked. A lot of people have plaque buildup in their arteries. We actually feel it when inserting the canula. It's hard and crunchy, and often alternative injection sites need to be used, sometimes multiple. He should know these, we pull all kinds of medical devices out of bodies.", "label": 0}
{"text": "“Tell me, if I intentionally misinterpret what you meant then why does it not make any sense? Asking for a friend\n\nRoom temperature IQ moment", "label": 0}
{"text": "the bombers were from SA. The palestinians were from palestine.", "label": 0}
{"text": "Someone's found my pickling jars", "label": 0}
{"text": "She had no votes and became a candidate. You know shes gunna have no vites and still somehow be president xD they arent even good at hiding their cheating the system. Garanteed they studied the laws thoroughly to know exactly when to have ol’ joe step down right after the candidates were voted on so that she could skip the line as someone no one wanted", "label": 0}
{"text": "Hydra Vulgaris.", "label": 0}
{"text": "Anyone who thinks those who do horrible things shouldn’t be offed is crazy I think the parents and them should’ve all been executed and anyone else who knew ahead of the time", "label": 0}
{"text": "One of my best friends who I've known since I was in kindergarten is basically estranged from his parents because they went off the deep end, which hurts not only because I don't see him as much, but also because his parents (before they became obsessive about facebook groups) were really supportive of me and has a hugely positive impact on my early life.", "label": 0}
{"text": "What’s your favorite flavor of crayon? You seem knowledgeable", "label": 0}
{"text": "Post a link to a dead vaxxie with normal blood, not random propaganda.", "label": 0}
{"text": "Maybe it is, but to me that doesn't make sense for many reasons, but one big one being that if the goal were to kill off a large portion of the population (remember that the stated goal was to \"vaccinate\" the entire global population-going so far as propose aerosol distribution, food and water, and even mosquito distribution so no one could not be) the technology and infrastructure is already in place for that. A virus could be released that does do just that. Or a \"vaccine\" that does. The technology is available to make a virus that kills any gene-specific population and leaves others unharmed. They simply could have and it didn't do that. Maybe it is a 'long game' type tactic, and it's designed to shorten our lives, kill of slowly, but I lean more towards DNA alterations. We do see (covered up and not covered by most mainstream news) an unprecedented increase in miscarriages and infertility since the global \"vaccine\" though. And there are reports and articles stating that babies born to a \"vaccinated\" mother have the \"vaccine\" passed to them. Also in breast milk. And for clarification, this type of \"vaccine\" was defined as gene therapy before covid, not even classified as a vaccine.", "label": 0}
{"text": "Are they in the room with us", "label": 0}
{"text": "the gold medals have trivial amounts of gold now anyway", "label": 0}
{"text": "lol ai replacement I’m in IT and not even worried about being replaced by ai.", "label": 0}
{"text": "How would you know when the product and its sode effects were never truly tested over a long period of time (afawk). There's still 4 years minimum to get enough data to determine cause and correlation, but it's safe to assume that of it wasn't happening before then virus/shot comes out it's more than likely the virus or the shot.", "label": 0}
{"text": "For the record you debunked pizzagate in your answer by saying there is no actual trafficking ring.", "label": 0}
{"text": "I hear you .. but think about what you are saying : \n\nAs Jack would say on Law & Order! I feel for them, I understand what they were going through, but they didn’t have to choose murder as the answer.. \n\nUnlike many people they had more options than most to leave .. \n\nPoor white trash girls from the south who’s daddy and brothers think of them as convenient sex bots - runaway from home .. \n\nAnd we need to start programs to help them get out of the sex trade and off drugs, but we don’t need to start telling them that blowing their parents away is a good course of action .. \n\nBen", "label": 0}
{"text": "This is fact.", "label": 0}
{"text": "It didn't need to be debunked. That which is asserted without evidence can be dismissed without evidence.", "label": 0}
{"text": "I believe you may be correct. Desperation starts immediately when supplies dwindle. The easiest way to stimulate economic output per capita and lessen demand for the limited supply is to remove demand via attrition and promote fear through war so people put service and work over happiness. It's disgusting.", "label": 0}
{"text": "Can the election be over yet?   Every 4 years immigration is reaching a boiling point and the US is going to collapse.,....then it doesn't.    But best believe next election cycle the fear mongering is back and better than ever", "label": 0}
{"text": "No one is good. But the CIA is doing it using taxpayers' money", "label": 0}
{"text": "You should be the most worried.", "label": 0}
{"text": "Kind of looks like a catheter that was forgotten. Not sure what that nasty white shit is, fat?", "label": 0}
{"text": "Yeah and with a new GWOT", "label": 0}
{"text": "Trump.  🤣", "label": 0}
{"text": "The Rockefellers....however they are not as smart as they think.", "label": 0}
{"text": "You were just presented with context that changes the circumstances of the case significantly and takes wind out of your assertion that this was the unhinged ruthlessness you’re trying to make their crimes out to be. And while you’ve “responded”, ben_watson_jr - you have completely dismissed this context which to me equates to “going silent in the face of undisputed truths” (which you’ve been disapproving of here.)\n\n🤷‍♂️", "label": 0}
{"text": "Seriously.. I think you’re right !! Netflix has a special and if these guys get out - the ratings go up and people will watch more Netflix specials because they think Netflix has social power .. \n\nI think you are right on the money 💴", "label": 0}
{"text": "Only Jesus can save us!? \n\n\nWell that's weird! 😂 ", "label": 0}
{"text": "I see your point - they were privileged compared to a lot of people and I'm in no way arguing that murder is the preferred answer *ever*, even when it comes to abuse and rape.\n\nBut I'd be defending anyone who's spent 35 years in jail for murdering someone who raped and abused them for years, since they were small children. There's more than class and race going into this - people who are abused (no matter their background) are often essentially brainwashed that they have NO out, that they will never get away. Murder isn't the answer there (or anytime), but victims of abuse are not always able to think clearly about their abusers or choices.", "label": 0}
{"text": "The suggestion of resentencing these two brothers, sends a chilling spirit around the world if you are a rational thinking person..\n\nTwo rich kids, complaining that daddy was too hard on them during tennis practice was abuse..\n\nThey said he sexually abused them and mother didn’t do anything to help them..\n\nYou know what poor kids do in that situation?\n\nLEAVE! Run away !!! Go live with relatives..\n\nWhat cadre of rich and famous people orchestrated this fiasco and for whose benefit!\n\nI love me some Kim Kardashian, but she is throwing her behind the scenes power in the wrong direction..\n\nIf you to truly find justice, and not form some elite conspiracy to up end the system of justice to just flex your power, how about getting minority kids- who have grown to be men in prison for the personal possession of ( 1 single ) crack rock, while their rich and white counterparts got probation and a McDonald’s coupon for the inconvenience of being arrest with over an OZ of powered cocaine after daddy said it was for personal use and they will never do it again ..\n\nThis is wrong ! You are telling kids, if you don’t like a curfew you are free to kill your parents if you are rich, just say you were abused ..\n\nBen", "label": 0}
{"text": "Who owns Netflix they seem to not care about what’s going on in the world as long as they are the first to get something on it", "label": 0}
{"text": "Newspeak", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "I deleted because I had lost perspective and was not being intellectual and was overly emotional and that is not productive when discussing matters in a forum like this ..\n\nI want to be productive.. people disagreeing with me is standard operating procedure on Reddit ..\n\nExcept when I present undisputed truth - they go silent\n\nBen", "label": 0}
{"text": "Prices with trump went up ONLY durring covid lol you know that global pandemic we had that crippled everyone? The thing that ended over 2 years ago? Trump had 1 of 4 bad years that was unavoidable. Biden never had even 1 of 4 GOOD years. We went from very bad to just bad. We went from expensive but affordable housing to no chance in hell of ever owning a house. You need a near perfect credit score and over 120k salary to afford an OK house. Bank wont even loan you the money otherwise", "label": 0}
{"text": "Nope. Those little buggers exhale carbon dioxide. They should be taxed for their harmful emissions! ", "label": 0}
{"text": "They should be punished for the murders, but they shouldn’t be punished more than any other murderer.  They initially received a sentence based on special circumstances and the DA is now saying he doesn’t think those special circumstances should have applied.  Assuming this change goes through all it will do is give them the chance at parole someday, it isnt saying their innocent and it isn’t letting them out. Hell manson always had parole hearings.", "label": 0}
{"text": "It sure has, and it's becoming more and more popular in those circles. They openly talk about it and do presentations on it, it's not a secret. Gates, Musk, many other household names openly praise it. It's unpleasantly surprising how many people don't take it seriously and think it's some sci-fi topic.", "label": 0}
{"text": "You mean the operation warp speed vaccine trump gave us?", "label": 0}
{"text": "aand we ALL heard DT blowing that dog whistle so don't act so surprised when a frightened citizen reacts to his threats.\n\nand don't be surprised when ss doesn't take a bullet for him.\n\na fascist !\n\nthere's a reason why no one's ever heard of the \"Association of Operation Valkyrie Apologists\".\n\nbecause it has a membership of zero.", "label": 0}
{"text": "you had billions of money to help them but whered they go, in the pockets of corrupt democrats like that guy in california who these same people put into power. lol.\n\nyou can give them more money for what, so the same people will just get even more money to steal? lol", "label": 0}
{"text": "Seriously...you know we're fucked when BOTH sides are scared.", "label": 0}
{"text": "This really really weird to me and I don’t see anyone else online talking about this. It appears the episode was quietly made private. I am wondering if it has to do with Alex’s current legal woes?", "label": 0}
{"text": "The Zodiac family has not served one fking day!! \n\nhttps://zodiackillertruth.net/\n\nDid the six innocent victims in that case deserve to die because Ellen’s lover General turned on her and her new bi-sexual boyfriend?", "label": 0}
{"text": "Dozens of morticians said they never saw things like these before 2021 (the vax year), when they started seeing them all the time. Real blood clots are not white rubbery calamari things. \n\nThey likely do form or grow significantly post mortem, but it is still indicative of a massive change in the blood of vaxxies, and is almost certainly related to the leap in the death rate.", "label": 0}
{"text": "You can tell what magnification this was taken at? Enlighten the rest of us please.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Can you charge a Tesla with solar panels? I thought it took 480.", "label": 0}
{"text": "‘Twas a joke my fault lol I forgot it’s partisan to make fun of Canadians", "label": 0}
{"text": "Take solace my friend, it lets you know those who actively try to subvert discourse aren’t exactly the brightest and most cunning \n\nYou just have to be a little smarter than they are dumb.", "label": 0}
{"text": "Let's say hypothetically that trans athletes make up 1% of athletes competing in women's sports and also win 1% of the medals. That means that trans athletes are proportionally winning the same amount of medals as CIS athletes. In other words, it means trans athletes don't have a statistical advantage in women's sports. \n\n\nThose kind of stats very much matter. Your premise that trans athletes have an advantage hasn't been clearly established, which is the problem with your argument. That's why I'm suggesting that the total number is basically meaningless and that only meaningful number is the rate at which trans athletes win, since that's the only way you could establish if they have an advantage.", "label": 0}
{"text": "Happening in some Australian states now, when solar fist came in you got a decent rate for feeding you excess power back to the grid, as more people got solar the rate dropped and dropped, in new south wales (Aus state) you now get 2 cents a kilowatt that you feed back into the grid and you pay 36 cents a kilowatt when you buy it back in the evening when your solar is not generating, now they are looking at making you pay for generating during the day as there is an excess of power at peak times, so during the peak generating hours you may need to pay I read a proposal of 1.2 cents a kilowatt that you feed back into the grid.\n\n\nSo you pay to give the power company free power and they charge a lot more to sell it back to you later in the day", "label": 0}
{"text": "Bingo!!!", "label": 0}
{"text": "I'm a woman. This affects me. (Furthermore, I'm a sports fan and related to girls who play sports, but I consider that secondary any way. Being a woman alone makes this affect me.)\n\n> I’m a 6’10 230lbs athletic man, they ain’t comin for my spot lol. Nothing they do affects me, therefore it’s not my place to tell them what to care about.\n\nSo, again, we don't disagree. If you think only people who are affected by this should have opinions, you're out and my opinion matters. I don't fully agree (I think anyone can point out and oppose unfairness), but even going by your own rules my opinion > yours.\n\nNot trying to be as much of an asshole as that last bit sounds, but trying to make a point. A lot of women feel this way in private but are scared to speak out - I know, as a woman, I've heard a lot of them say that. I feel for trans people who have to give up sports if they transition, but people have to give up sports for TONS of reasons. If you break an ankle at the wrong time as a child, your have to give up sports. That's just the breaks. Women who HAVEN'T had something like that happen and who work hard shouldn't have to be pushed down the podium because a male person transitioned into a female. It's not fair to them.", "label": 0}
{"text": "Submission statement: \n\nRussian disinformation groups are trying to take advantage of dimwitted Americans by posting false information. Trying to manipulate America against supporting Ukraine, into supporting Putin's pal Trump, and sew distrust against the government.", "label": 0}
{"text": "Absolutely. Your opinion>mine 🫡", "label": 0}
{"text": "they got that shit locked down - lol. maybe they're a small-ish local news outlet so they need the revenue. but thanks for the effort!", "label": 0}
{"text": "Teslas iRobots?", "label": 0}
{"text": "Quantum bollocks?", "label": 0}
{"text": "like 4 times and thats all", "label": 0}
{"text": "Biology and endless scientific (and non-scientific) examples already prove that those born male who go through male puberty have an advantage over those born women. That's established science.\n\n> Your premise that trans athletes have an advantage hasn't been clearly established\n\nThat's a joke. It absolutely is. I'm sorry if gender politics have truly made you think this, but it's not true. I support trans people's right to exist, I support their access to healthcare, etc etc - but we can't simply throw away what we know **and have properly established in science** to try to make their lives easier. That's frankly insane.", "label": 0}
{"text": "Don't worry they won't ever think otherwise.  Trust the science but only when it benefits you.", "label": 0}
{"text": "Not a single word about COVID during this election. That in itself is very telling.", "label": 0}
{"text": "in my opinion, neurocognitive decline, division and sedation among the growing populace, and a trial to see how the people would respond to an epidemic killing millions.\n\nthe global population is proving too much for a strictly capitalist society with ethics. the goal is to see how well they can sedate the pawns into doing menial, ground-level labor while the elite \\[families\\] rest on unearned, ancestral laurels. slave trade never died, it was just offsourced to hiring managers while the owners simply generate more money out of thin air via their fractional reserve banking system.\n\nwe are all slaves to this machine. our smartphone enforces this. pornography dulls us ([10.1001/jamapsychiatry.2014.93](https://doi.org/10.1001/jamapsychiatry.2014.93)) and the western world is designed to destroy our vitality:\n\n\\- omega-3/6 ratio correlating with western obesity, \n\n\\- microplastics crossing blood-brain barrier, \n\n\\- processed foods with seed/vegetable oils, carcinogens (cigs) actively promoted in the 20th century, \n\n\\- sugar additionally promoted and advised FOR in a FDA report in 1980s,\n\n\\- destruction of the atomic family (childhood without permanence doi: [10.1037/fam0000580](https://doi.org/10.1037/fam0000580)) divorces up - this is reviewed extensively by a female scholar as the intro to double taxation benefitting the government instead of the family - and yes, this + inflation is by design\n\n\\- 1 billion more\n\ni genuinely believe that the common folk are being absolutely buttraped by the elites every day. because these are provable and more probable than not to be true. going deeper into conspiracy involving devil worship and corrupting young kids for the pleasure of the devil? there has been no real study or scholarly opinion on those so they remain conspiratorial", "label": 0}
{"text": "Hilarious. \n\nAnyways, Presidential immunity only for official presidential duties, and it’s up to lower courts to decide. Not exactly the draconian ruling you thought it was.", "label": 0}
{"text": "Just to be clear is that blood clots always or blood clots since 2021", "label": 0}
{"text": "\"Gender dysmorphia\" isn't a thing. \"Gender dysphoria\" is entirely separate from \"body dysmorphia\".", "label": 0}
{"text": "I´m still pretty sure Musk is just the anglicized version of Muskowicz.", "label": 0}
{"text": "i would vote for a potato before i voted for harris/walz. has nothing to do with the orange man", "label": 0}
{"text": "Any actual studies? I don't trust documentaries.", "label": 0}
{"text": "LMAO Ukrainians are getting their asses kicked. Kursk is one of the greates military debacle of all time but somehow Putin need to manipulate people that never gave a shit about a nazi country to..stop supporting a nazi country. Putin's pal Trump? Nice try,fed. Putin took Crimea under Obama and invaded under Biden.", "label": 0}
{"text": "I'm not reading all that that", "label": 0}
{"text": "They've served a massive sentence already for the premeditated murder, and both from a \"punishment\" and \"rehabilitation\" perspective they've spent enough time in throat shithole to at least have some life", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "It's hilarious how the right thinks government spending only increased inflation when democrats do it and not republicans.", "label": 0}
{"text": "haha, I really respect that. Cheers for the back and forth. :)", "label": 0}
{"text": "It's collapsing! The sky is falling!", "label": 0}
{"text": "its always the guy/dude/man as the subject that needs to be corrected - often times by a woman\n\ndid netflix write this shite", "label": 0}
{"text": "Worms lizards and frogs are not coming out of us.", "label": 0}
{"text": "Sounds like Emmanuel resigned. Kelly was fired. There is a difference in leaving a job from your own choice compared to being fired. People typically resent their bosses if they fire them. I would imagine even more so with such a high level position.", "label": 0}
{"text": "If you support Trump or attack Biden and Ukraine you get downvoted and attacked. Totally normal,right? Funny how this is one the few conspiracy sub that is still allowed to operate \\^\\^", "label": 0}
{"text": "Citation", "label": 0}
{"text": "what a human, leaving his signature on every comment. that's what the username is for. also there's 2 gigantic letters that says \"OP\". this one of those guys that are so against *the system* that wouldnt even use the few usefull stuff that it has to offer", "label": 0}
{"text": "And because of that Americans no longer have to fly on Putin's rockets.", "label": 0}
{"text": "Odd that we all have a stupid friend.", "label": 0}
{"text": ">with some of the biggest names in Hollywood, music, and sports. \n  \nWhat are the names tho?", "label": 0}
{"text": "Great honest answer. Is there any q drop that you’re absolutely 100% sure what it means?", "label": 0}
{"text": "Cheers to civil discourse!", "label": 0}
{"text": "For the people who don’t believe you https://youtu.be/KJ1tjCFBemc?si=8GbTrJLWyobKJird", "label": 0}
{"text": "What happened in 2021? Are these 5g clots? They look like 5g clots.", "label": 0}
{"text": "If I had millions of dollars sitting around, I'd absolutely use this service to test it with the dumbest troll's mankind has ever seen, I guess that's why I don't have millions of dollars sitting around.", "label": 0}
{"text": "Time to reign in the lunatics.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": ">Every parent I know is terrified their kid is going to be indoctrinated next. My brothers kids are homeschooled bc of it. \n\nYeah, that's because they're falling for the propaganda. That's what's \"impacting them\". No ones being tricked into being trans, ROGD is a myth, children aren't being secretly given hormones by their teachers.", "label": 0}
{"text": "THIS IS TOTALLY NORMAL! Many surgeons and morticians will tell you this is what happens to your body when you die. Your blood coagulates in weird places in your body. When they do the autopsy many corpses get these. Many corpses. It turns white in some places and congeals together in your blood vessels and solidifies a bit in some cases. Doesn’t mean anything. Anything. \n\nAnyone who had these in real life, yeah, they wouldn’t really be alive anymore, so this post is recycled lies and bullshit.", "label": 0}
{"text": "careful using that H word\n\nmight get the wrong folks angry now", "label": 0}
{"text": "Ahh there it is the woke strawman. This isn’t about race or sexuality. \n\nIn all of your examples no one is pretending to be something they are not and no one was demanding that you accept that are something they are not. Cutting your fully functioning penis off in exchange for a putrid rotting hole that never fully heals is caused by mental illness and people like you perpetuate it and encourage it. It’s shameful.", "label": 0}
{"text": "\"Buried deep in the nuance, where the US declares there is One China and that Tawain is not independent, they only recognize that the different governments in Tawain and Mainland China agree, that they are one China, not separate countries.\"", "label": 0}
{"text": "Not trans, they are men.", "label": 0}
{"text": "I also asked my mortician friend. She said she’s seen nothing weird or new and she’s been a mortician for almost 30 years. She laughed at this post.", "label": 0}
{"text": "So do all Nations.\n\nAs far as dirt on Dems 90 percent of that was Democratic Party Insiders, whistleblowers and life insurance dossier builder informants who told all to Julian Assange, WikiLeaks and the Dark Web.", "label": 0}
{"text": "They had a reasonable fear for their lives because when their father was abusing them, he would threaten to kill them. Even leading up to their deaths the father was still sexually abusing the youngest. They thought at the time that men couldn’t be sexually abused which is extremely wrong. Their cousin testified that one of them came to her to tell her about the sexual abuse, which no child should know about unless they were being abused. They definitely deserve a retrial because all of that evidence of the parents being horrible and abusive were not used in the final trial.", "label": 0}
{"text": "👏", "label": 0}
{"text": "People are just ignorant. It honestly makes me question whether or not intelligence is truly on a bell curve...", "label": 0}
{"text": "FAKE SHIT", "label": 0}
{"text": "Well it certainly couldn't have been caused by any experimental medical treatment, right?", "label": 0}
{"text": "Always will be...", "label": 0}
{"text": "> The org that published this calculation is considered to be a hate group, with ties to white nationalist groups. At the very least, they have a strong agenda. It would be worthwhile to research what their methodology was, in arriving at these conclusions.\n\n> https://en.m.wikipedia.org/wiki/Federation_for_American_Immigration_Reform\n\n\nFrom your link:\n\n* The Federation for American Immigration Reform (FAIR) is a nonprofit, anti-immigration organization in the United States.[6][7] The group publishes position papers, organizes events, and runs campaigns in order to advocate for changes in U.S. immigration policy. **The Southern Poverty Law Center classifies FAIR as a hate group** with ties to white supremacist groups.\n\n**The Southern Poverty Law Center is a hate group**. A fake, phony agenda-driven racist organization that pretends to fight \"hate groups\" (meaning anyone they don't like, or who they feel opposes their agenda). \n\nI put no stock in anything the SPLC says or does.", "label": 0}
{"text": "Known by who?  I've seen a ton of claims.  A bunch of people in a conspiracy community throwing around theories doesn't constitute proof.  Frequent nonsense is still nonsense.", "label": 0}
{"text": "No the agreement they share is that there is one china. Each maintain claims they are the sole government of all of \"one china\". ROC has existed in perpetual since PRC pushed them off the mainland and predates the rebel government.", "label": 0}
{"text": "You obviously can't read. How much are they paying for you losers to shill?", "label": 0}
{"text": "Not really I’ve seen nothing pointing otherwise and I work on a military base.", "label": 0}
{"text": "You can charge it with the tesla battery product that goes in your house. If your house is powered by solar panels then you're charging it via solar. \n\nTo be clear I'm not arguing your average suburban home can meet its energy needs 365 days a year with just solar panels. Sometimes it's gonna be cloudy and you won't get much solar energy. You'll need backup from the power grid. But my point is generating some energy at your own is better than generating none. It ensures you can at least have basic power for necessities in the event the grid shuts down.", "label": 0}
{"text": "\n\nPutin invades Ukraine under Obama.\n\nPutin doesn't invade Ukraine under trump.\n\nPutin invades Ukraine under biden.\n\n\nSomehow that makes trump good for putin.\n\n\nIt's absolutely ridiculous.", "label": 0}
{"text": "American innovation there", "label": 0}
{"text": "I highly doubt your claims when I open your comments and see a good chunk of them are abrasive. And no one said anything about biased news articles or relying on them. But thanks for showing how little time I should spend replying to you by showing how awful you are at discussing things without trying to twist them so bye.", "label": 0}
{"text": "It's the plan.", "label": 0}
{"text": "No, not EVERYTHING is a corporate conspiracy, but you don't live in America so you can't speak to that", "label": 0}
{"text": "Orgies are not illegal. \n\nI'm interested to hear how people were forced into this... that's where the crime is.", "label": 0}
{"text": "Didn’t that one girl mod the news sub? Makes sense since her dad was a news baron. Maxwell hill.", "label": 0}
{"text": "Petitions are public. That's the whole fucking point. This is a lottery to buy Trump votes.", "label": 0}
{"text": "And yet, puff is prob gonna be the only one who has justice served 😔 \n\nMight seem like a weird spot for a song, but might be appreciated here:\n\nhttps://youtu.be/3FUOsKljWuc?si=q1LLIvsT-LWjlasP", "label": 0}
{"text": "You want to know why I sign my comments.. I will tell you .. \n\n3 years ago when we started the Zodiac case and cracked the z13 and sent that to the chronicle and SFPD homicide and had them get back to us within 48 hrs of receiving that unsolicited email and after Steven got a visit from the FBI asking him not to reveal the general’s name who was the target 🎯 of the Zodiac extortion and after he turned down a job with them - because they asked and then they turned on him and started terrorizing him - they had Google and Reddit scrub every single post he made .. \n\n99% of Reddit Post, even when deleted will still show up on the web when you search the username and the subject .. just as an archive or a remnant.. \n\nAll of Steven’s Post were gone!!! Gone!! As if he never posted them .. \n\nIt was easy for Google and Reddit to do , because all they had to do was scrub the username .. \n\nYou can’t just wipe out the name ‘Ben’! \n\nNow you know !! \n\nBen", "label": 0}
{"text": "Let's hope it never does.  When it comes to things like this I hope I'm wrong.  Nevertheless they have started riots with agent provocateurs in the past.  So it would be foolish to think that they won't do it again.  \n\nAlso I've been hearing for twenty years that the economy is going to collapse we're all going to be in a scary mad max future.  It never happens.  And I hope it never does.", "label": 0}
{"text": "It’s time for us now :( It’s been like this in Europe for the last 20-30 years… No wonder why the super rich people are moving to their bunkers in NZ.", "label": 0}
{"text": "Agreed.", "label": 0}
{"text": "That is 100% him as the article linked to his old twitter account where he posted a link to his new account which was that penguin.\n\nThe low following is more then likey the fact he is a pdf.\n\nHis LinkedIn is still up too.\n\nWhat does \"val enjoyer\" mean? \n\nThese 4UCKERS ARE SICK! and just got away with murder. \n\nHe was facing a minimum of 10 years to just getting dismissed.\n\nDisgusting!", "label": 0}
{"text": "I'd like to read that on the DNA, I've heard the theory floated around but not seen or read anything confirming or purporting to confirm it yet. Would you send it to me, or link it here?\nI get your point that it is killing people and disabling others, to me it doesn't seem to be in high enough percentages of the total who got the shots for that to be it's main goal. Still a far too large percentage, but for that to be it's main objective it seems to have failed. If we use just the US for an example and say there's roughly 350 million people here. And say 50% of those people are \"vaccinated\" (the percentage was a bit more than this if I'm remembering correctly, but Im just using it for easy mental math) then that's 175 million people dead/ disabled if the main goal was to do that.", "label": 0}
{"text": "It´s neither a conspiracy because it´s not secret, not is it a theory because it´s confirmed.", "label": 0}
{"text": "Yes, I remember, because I thought a terrible hacking cough I had that lasted over 3 weeks was from vaping. I later decided it was probably Covid. I felt like I was going to cough up a lung. That was January 2020.", "label": 0}
{"text": "Do they just make up a number and slap it on the front page or what?", "label": 0}
{"text": "Elon would definitely be dumb enough to have back channel conversations with Putin.", "label": 0}
{"text": "> Orgies are not illegal. \n\nThats even what the law enforcement agent said in the article.\n  \n>“It’s sick s–t,” the law enforcement source told The Post. “Look, if this were just him having sex parties with *a bunch of horny adults*, we wouldn’t be having this conversation. That’s perfectly legal. But that’s not what we’re talking about. This man is a predator.”", "label": 0}
{"text": "So deportations is the line?\n\n\nObama deported 2-3 million people just fine.\n\n\nDeportations are done around the world when non citizens enter a country they do not belong to.\n\n\n> There is a very popular poem about the former and when deportations didn't work then went on to a final solution.\n\n\nDelusion.", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Should know better than to ask a politician their qualifications xD", "label": 0}
{"text": "Call me an extremist i guess.\n\nBut if you take a life on purpose, you should lose your life.  Not 15 years of it.\n\n(Yes i understand there are outliers to this rule)", "label": 0}
{"text": "Sourcing the New York Post in a conspiracy sub is insane", "label": 0}
{"text": "Probably not.\n\nJust like Fauci has never seen a patient", "label": 0}
{"text": "I wonder why.", "label": 0}
{"text": ">I’m sorry, but with no health issues, a healthy athletic 36 year old doesn’t just have multiple heart attacks out of nowhere.\n\nI'm sorry but yes, they certainly do. Young and healthy people have been dying of heart attacks since long before the vaccine.", "label": 0}
{"text": "A journalist?  Really?", "label": 0}
{"text": "\"Riiiiiight\"\n\n-Dr. Evil", "label": 0}
{"text": "Yesir. \n\nAnd from Epstein to Bill Gates, George Church, Nathan Wolfe\n\nThe rabbit hole is deep af", "label": 0}
{"text": "Tagged and bagged. Thanks for playing.", "label": 0}
{"text": "Always prepare... but this thing of saying ''It will Happen after this or that'' it's been happening from millenia and its really annoying", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "oh wow, yeah - using a baby in any form for his avatar seems pretty trollish. val is probably the game [Valorant](https://playvalorant.com/en-us/).", "label": 0}
{"text": "Boobs always win, always.", "label": 0}
{"text": "It was back on Youtube? Got darklisted like at least 3 times by now thats why i have it on my harddisk, the JRE/AJ podcasts are the most epic podcasts out there.", "label": 0}
{"text": "Just like how we can jail Epstein and Maxwell for crimes but apparently none of the people involved in those said crimes.", "label": 0}
{"text": "Here is the full resentencing memo which was filed today. It goes over all the reasons why the DA is supporting a recommendation -\n\n[https://www.documentcloud.org/documents/25252015-2024\\_10\\_24-menendez-sentencing-memo](https://www.documentcloud.org/documents/25252015-2024_10_24-menendez-sentencing-memo)", "label": 0}
{"text": "i think it’s because a lot of people don’t realize that they have long covid, they think it’s just major anxiety, skin issues, etc. they deny that it’s long covid or the vaccine but then when you ask them if it’s normal for them to be getting the “flu” every two months, they have no response. i think the numbers are higher than what’s being reported because a lot of people don’t want to open their minds to the idea that our medical industry is going against us. but they have random new symptoms and ask themselves why. i guess you’re right that not everyone is disabled from it but a huge portion of people are having symptoms come up that were dormant before. that would mean more doctors, more meds. also here is the link https://www.genomicseducation.hee.nhs.uk/blog/dna-clues-discovered-for-asymptomatic-and-long-covid-conditions/", "label": 0}
{"text": "Democrats printed shit tons of money and LITERALLY caused textbook definition of inflation. But keep deflecting, it looks flattering on you, really.", "label": 0}
{"text": "https://m.youtube.com/watch?v=GCZi545SgnI\n\nNo choppers were seen in that video. Weird that Fed John Cullen never uses that one as \"evidence\" of choppers.", "label": 0}
{"text": "Ok .. let’s do it your way .. let’s pass a constitutional amendment that says any abused child is entitled to murder their parents in cold blood without an eminent threat to their lives ..\n\nYou wouldn’t have any parents left on earth ..\n\nBen !!!!!", "label": 0}
{"text": "Your opinion is like your username...", "label": 0}
{"text": "Good truthfully we’d probably be a better society because of it", "label": 0}
{"text": "Valid points, taking into account long covid I'm curious what the percentages are. Thanks for the article, will read it this evening", "label": 0}
{"text": "Is it possible exercises happen a lot?", "label": 0}
{"text": "That's why people like Rupert Murdoch try to scare the public with phony studies like this one that came out months ago but magically hits the front page of his paper days before the election.\n\nBut once the election is over--like the caravans that magically appear before elections--this propaganda will be gone.\n\nWith one major exception: Should Donald Trump get into office he won't deport immigrants per se--he will deport or lock up people who criticize him. Under they guise of \"illegals.\"", "label": 0}
{"text": "Ukraine has tons of lithium. 500k tons, in fact.", "label": 0}
{"text": "I’ll vote in the local elections, but none of the above in the national.\n\nThe Uniparty has slowly made this country worse, every year I’ve been alive.\n\nThey don’t fix anything, they just blame each other. It’s stupid.", "label": 0}
{"text": "your counter argument is one woman’s experience and testimony out of the tens of thousands of people who have happily gone through this process.\ndo you care to address the other points?", "label": 0}
{"text": "that's a lot. i will blindly trust u as if an strange old man started telling me his whole life while i was just walking my dog", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "You have zero videos of any choppers over the festival shooting. Stop helping those grifters that push the chopper BS", "label": 0}
{"text": "[OG Twitter account and his only verified follower is SUS](https://x.com/sladehv?t=6hEeX1naaLwJhXRnbpEmCg&s=09)\n\nVal enjoyer so he doesn't like playing he rather watch kids play the game?😡😡😡😡😡", "label": 0}
{"text": "No matter whether THAT SINGULAR wire is nano. The others are not. People have and are dying from this. Researchers and doctors still are not sure of the cause of it and the majority of people are still not aware of it.", "label": 0}
{"text": "Signup for an Office 365 E5 developer account.", "label": 0}
{"text": "you've known Trunp is compromised and morally bankrupt,  yet you still think he should lead your country?  wow, perhaps at this point you deserve him. I had higher expectations for the American people.", "label": 0}
{"text": "\"no indication they were aware of or involved\"\n\nGood thing you all know how to read past the first few sentences.", "label": 0}
{"text": "\nYou realize we are also made up of atoms and molecules right?", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Its All true. Use the simple smell test. \"Would someone loose money if Paul or Avril died?\" Yes. Is it easy to get a lookalike \"Yes\" Voila. Is Hollywood etc corrupt and evil \" Pdiddy\" case closed.", "label": 0}
{"text": "Notice all this talk about el right before the ELections?", "label": 0}
{"text": "My dad chose screeching bizarre shit he heard on infowars about people like me over getting to know me and my mom prostituted me for meth then bailed earlier than most of my memories started. They’re just people, but deeply selfish ones that have nothing positive to offer anyone\n\nI don’t plan to have kids bc I notice I sometimes react to frustration in ways that remind me of them (and just don’t act on those feelings obv) and I’m worried it’s either heritable or I’d repeat so much as 1% of their mistakes under that stress, which I don’t think any child should be subjected to. I love kids, but I’m happy being the wacky aunt of the friend group rather than a parent, tbh I just get the fun parts without all the work and have a lot more money to help my friends through tight spots for it.", "label": 0}
{"text": "Why you can admire a great pair of tits but still realise she's one massively evil tit herself at the same time. Sexual attraction for males is like a tick. Your eyes will go where they go.", "label": 0}
{"text": "I think a lot of this has to do with Western culture and socialization of what is \"happy\" and \"sad\" in music. I recommend. Listening to a lot of foreign folk music and trying to recreate ancient music, we see a lot of things that we might identify as sad as something more neutral or happy. I suggest listening to Gamelan music and seeing how it varies a lot in what we expect certain things to sounds like.\n\nAlso, as a violinist, we play everything from sad to angry to happy. And same with saxophones or trumpets or cellos. These are merely tools to recreate vibrations and for us to interpret what these vibrations mean.", "label": 0}
{"text": "When cooming is life ", "label": 0}
{"text": "The widow of Steve Jobs. Did you know iPhones take an IR picture from the front camera every 5 seconds?\n\nSorry, that last bit is misinformation. It actually takes a 30,000 dot 3-dimensional infrared depth scan of your face every 5 seconds.", "label": 0}
{"text": "those  are some Greek weddings", "label": 0}
{"text": "What makes you say that?", "label": 0}
{"text": "what is this nonsense?", "label": 0}
{"text": "I think because it's funny.  It's got the exact type of self referential ironic humor and cynicism that pop culture conditions us to value. You see the meme is a copy of the Trump meme/t-shirt, \"get in the car bitch. We are gonna make America great again\" and it openly acknowledges that it's repeating that same theme this time with a different subject. So it's essentially like a meme, making fun of a meme, making fun of itself which in turn makes fun of the very concept of 'memedom'....so it becomes a sort of commentary on this aspect of internet culture.", "label": 0}
{"text": "Thank you Que Mala", "label": 0}
{"text": "###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "label": 0}
{"text": "Nano??? That’s like a 24 gauge wire right there bro", "label": 0}
{"text": "Luis Garavito raped and killed over 200 minors. He only served 22 years if you can believe that", "label": 0}
{"text": "It is now in many many people.  They call it their pet too.  If you took the mRNA shot you probably have this growing in you.", "label": 0}
{"text": "LOL", "label": 0}
{"text": "We all know Elon will gain nothing from the relationship and Putin would gain everything. The reason Elon would do it in the first place is because he is very impulsive and egotistical and Putin appeals to him.", "label": 0}
{"text": "I've never heard someone refer to it as the \"early thousands\"", "label": 0}
{"text": ">redditor for 2 months", "label": 0}
{"text": "Because there was! 🤬", "label": 0}
{"text": "The most common reason anyone does anything.\n  \nIt makes him money.", "label": 0}
{"text": "So it’s time to get trippy??", "label": 0}
{"text": "U get ur answer 6 years later she was but it was rebranded the row im pretty sure as suge had came outta jail and was tryna revive it", "label": 0}
{"text": "This is interesting!!! Thank you for sharing this!", "label": 0}
{"text": "This bro like posts like these gets disowned while stuff like alien and flying saucers are supposedly acceptable ", "label": 0}
{"text": "Nah, this is where only 1/3 of the population voting for generations got us…..", "label": 0}
{"text": "It is impossible for the vaccine to do that. Stop your nonsense.", "label": 0}
{"text": "Did you read it?", "label": 0}
{"text": "Crooked fking farce.  I will absolutely never trust the results of elections done in this manner.  Which is probably what they want.  They want this country torn asunder.  \n\nI had faith in our elections up until 2020.  I always believed that there was some fraud but not really enough to effect things in most cases.  The channges made in 2020 though present a completely different scenario. \n\n\nNow they have 30 mil illegals with no legal repercussion if they decide to vote as well. I am sure they will since Biden admin buys them plane tickets and gives them 15k debit cards..There is no downside whatsoever to them voting either... tucker did a segment on it. (tucker interviews catherine englehardt) If they think or claim they are a citizen illegal or not there is absolutely no legal repercussion against them for voting and of course they aren't gonna be arrested or deported... they won't even be caught because the left will allow this in all their dominated areas. So why wouldn't they try.... course once immigrants get here a lot of them turn conservative because they don't wanna see the country ruined by further unchecked immigration. America will only be worth living in as long as it remains the country that was built over the last centuries to try and be totally destroyed in the last decade or so by the left.\n\nI think most of the covid response maybe covid itself may have all been to add a layer of control yes, but also mainly to enact the mail in voting in the us to steal the 2020 election which is obvious is what happened\n\nMail in voting cannot be secured.  That is why we came up with better methods 100 years ago.  That is why every single metric we have established over the last 100 years was broken last time as well.  No bell wethers, I mean even ai says it mathatically impossible when asked about it in a non presidential way.\n\nAll you have to do is find the registered voters that don't vote, the old the infirmed etc, harvest those ballots, fill out for preferred candidate, drop rinse, repeat.  Then you can cover windows and fake water leaks in the middle of the night and run them through under the cover of darkness when democracy truly dies. \n\nWithout contacting every single mail in voter and verifying votes with identity, no proof of fraud will ever be found.  Its why it shouldn't be allowed in a towns mayoral race let alone our presidential elections.  The entire world laughs at us for how sloppy  and insecure they are.  I have seen euro liberals even laughing about it on 4chan.\n\nMail in allows the possible fraud numbers to go into the millions.  The fraud votes will continue to rise and rise until every single registered voter in the US is voting and that will be funny to see.  I suspect by that time there wont be much of a country left though.  Then they pull shut like .7 for biden vote .3 for Trump just everything they do is crooked, course can't be transparent with data either. \n\nTo have had faith in this system my entire life over 50 years and trust the results and agencies to have that ripped away from us in 2020 is ridiculous.  I feel like we live in one of those fake banana republics the letter agencies create.  I don't know what the solution is I have never heard so much talk of civil war and revolutions online.  I hope it doesn't resort to that.  I think we could restore most of the faith we had in elections by just rolling back the 2020 changes made during covid.  Which is obviously over and they are no longer needed.", "label": 0}
{"text": "no worries i appreciate your input as well and even being interested in it. it might be a small percentage but with how big the world is that’s still thousands of lives, and that hurts. imagine dying from it in your 20’s and an article is posted saying that you “randomly” died of heart attack as a healthy young adult. im apart of some long covid communities and theres about 60k that are suffering that happen to have reddit and also have access to social media. it just sucks man", "label": 0}
{"text": "The post-election meltdown will be as controlled and herding as the rest of it.", "label": 0}
{"text": "thank you for sharing your post and views are exactly what these shills are trying to censor and hide. I definitely agree why are individuals so desperate to derail and shut down this discussion and its also very sus that these murderers are all of sudden been portrayed as victims and praised by celebrities that have been involved in cults and infamous rituals so yes i agree there is more to the case and they are def not the sweet darling victims the media want to try to push in their new narratives", "label": 0}
{"text": "Resonant . Literally, everything has its own frequencies.", "label": 0}
{"text": "Idk, theres many reasons that I wouldnt want to get involved with these evil cultist ass people.", "label": 0}
{"text": "I read the article where the researcher in question explained her reasoning for delaying the release. It was not because harm was demonstrated. Feel free to post an excerpt from the study itself that proves me wrong, we both know you won’t", "label": 0}
{"text": "I've seen this told about other singers. Avril, Paul, Kanye, Eminem. The Paul one is somehow believable because of those strange subliminal messages on Beatles songs. Anyways of all them serve the same master.  (Aleister Crowley is on the cover of Sgt. Peppers lonely hearts club band)", "label": 0}
{"text": "No need to be passive aggressive my friend I was asking a question to this guy/girl about his funeral director friends opinion on the post. I do appreciate your insights about how the heart stops after death. Truly enlightening.", "label": 0}
{"text": "Show proof that more than a handful of people have died from the covid (or any) vaccine, in any country. Studies from around the world have shown only a few deaths linked to the vaccine.", "label": 0}
{"text": "What like it isnt already", "label": 0}
{"text": "There is a difference between losing a lawsuit and having the lawsuit dismissed based on standing. Most of his lawsuits were thrown out because “even if these 1,500 ballots were counted, it wouldn’t be enough to change the election.” However, if there were 62 lawsuits with the claim in different places,  it might have been enough to gain him victory. \n\nBill Bar (forgive is the spelling is wrong) admitted that he did see fraud in the election, but not enough to change the outcome.\n\nThe constitution states that there is to be an Election Day and that this day is when the voting and counting of ballots takes place. States changed these rules going against their own state constitutions as well as the country’s constitution and this was later declared unconstitutional, but eh, election’s over. Can’t do anything about it.\n\nAlready we saw a Democrat fired for tampering with a ballot box, we saw a ballot box set on fire. \n\nSomeone wants to stop him enough to try to kill him.\n\nHope I answered your question.", "label": 0}
