{"text": "The usually look like labias", "label": 1}
{"text": "Why not just block him?", "label": 1}
{"text": "Honestly why not just block him immediately? It would prevent shit like this. They don't respect, understand, listen, or care, nor do they want to. I learned that the hard way", "label": 1}
{"text": "Just block him wtf", "label": 1}
{"text": "I'm sorry but you have a husband and children and still are willing to entertain this individual for 5 full screenshots?\n\nHe was probably typing back with one hand getting off the humiliation you provided lmao", "label": 1}
{"text": "Stop replying every single time he messages you even if it’s a throwaway block him. No answer will get him to shut up.", "label": 1}
{"text": "Don't see how telling the OP to ignore/block is telling the OP to defend their choice in how they responded.", "label": 1}
{"text": "This is borderline spam from you with the same message. Stop it.", "label": 1}
{"text": "Read the sub’s rules. Perhaps this isn’t the sub for you.", "label": 1}
{"text": "This was clearly a painful interaction for you, I’m not sure I understand why you kept responding for so long instead of blocking him and moving on?", "label": 1}
{"text": "Like I don't wanna be an asshole here but you don't have to get the last word in, no? Could just stop replying/block", "label": 1}
{"text": "Ummm. How about just block that guy and call it a day. No need to waste time on shit like that. He's not worth it", "label": 1}
{"text": "Is this like a karma farm or something this is the only thing ever posted from this account and it feels very bottish", "label": 1}
{"text": "Are you underage?", "label": 1}
{"text": "I don’t remember asking you anything", "label": 1}
{"text": "I don't understand why why girls send nudes to random dudes...", "label": 1}
{"text": "Sounds like closeted gay who touched himself to the thought of you. \nPost nut clarity hitting him HARD!", "label": 1}
{"text": "Anything for karma", "label": 1}
{"text": "Lol", "label": 1}
{"text": "That is beyond disgusting. This man deserves to rot in a hole. Not a jail, just bury him alive and walk away.", "label": 1}
{"text": "Everyone does that. My stepmom told me. Why are you stuck in 1800s? It's 2024!", "label": 1}
{"text": "Mentally yes, just incredibly bored lol\n\n\nPhysically not so much lol, but I'll be getting better soon, just a lot of medical stuff, I'll be ok", "label": 1}
{"text": "Yeah people are so weird ", "label": 1}
{"text": "Ewww, omg I'm so sorry \n\n\nI hope you get better mentally soon, I'm sorry life is so hard sometimes, your not any less human for doing that or any less deserving of happiness <3", "label": 1}
{"text": "honestly, i wouldn’t have responded after the first few times. you were feeding into the game he was playing & enjoying.", "label": 1}
{"text": "This looks so fake, it really does. You say you don't know him then why are you engaging?", "label": 1}
{"text": "OP you must have way too much time on your hands if you are just willing to play these games with this person\n\nWhy didn’t you end this at slide 2?", "label": 1}
{"text": "That went on for FAR too long. Should have blocked him after the first few messages. He’s gonna try again you know, since he got you to engage this time. \n\nImmediate block next time! And if it persists, file harassment charges. Dude sounds unhinged.", "label": 1}
{"text": "So why did you keep talking to him for two pages then? Why not just block him after first no thankyou? Or better yet just block him and don't reply? AHH but then there'd be no clout to chase, no karma to farm, no fabricated outrage to justify...\n\nYeah the guys a loser, but so are you.", "label": 1}
{"text": "Exactly", "label": 1}
{"text": "would it not be safer to know who the person is? he might be stalking her considering he now has her number.", "label": 1}
{"text": "I read through all of this, and damn, how did you not block them after the second screenshot?\n\nIt's wild how many people I see play in to a creeps game, you don't owe them a thing, not a response especially if they are going to try to obfuscate who they are.", "label": 1}
{"text": "JUST STOP RESPONDING JFC!!!!", "label": 1}
{"text": "Why would you still answer. Blows my mind", "label": 1}
{"text": "Why do you give this shit stain your time and energy? I would have blocked immediately and so should you.", "label": 1}
{"text": "You went through 17 messages with someone who’s creepy as hell and don’t recognize, why does this feel faked to me?", "label": 1}
{"text": "How hard is it to say, \"new phone, who dis?\"", "label": 1}
{"text": "Why did you keep talking to him? That could’ve been three screenshots shorter", "label": 1}
{"text": "No ones forcing you to read them all", "label": 1}
{"text": "🥱", "label": 1}
{"text": "Why even entertain these weirdos, just block right away", "label": 1}
{"text": "I find OP hot. So uhm... OP, wanna slip into my DMs?", "label": 1}
{"text": "Personally- I honestly just wanted to be friends. And after my friend told him off, he did talk normal. For like a day until he unadded me. Also curiosity gets the best of me 😅", "label": 1}
{"text": "Respectfully, I’ve never understood why hate on someone who’s attracted to trans women/men? As long as you’re not being used and it’s genuine affection I don’t see the issue", "label": 1}
{"text": "Someone should prolly tell that guy that his “8 inches” isn’t measured from the butthole…", "label": 1}
{"text": "I think the moment he started being weird was the moment things should've eaten shit.", "label": 1}
{"text": "Nawh sorry you totally encouraged him to keep on with his crap.  Say No and block is the best way to handle these guys.", "label": 1}
{"text": "why did you still keep the conversation going / even bother entertaining the idea of being friends?", "label": 1}
{"text": "Girl, he made it clear what he was there for. I would’ve cut him off waaaaaay earlier. He kept showing himself but you kept talking anyway.", "label": 1}
{"text": "Erm. I hate to burst your bubble but you said I’m “not a cheater” but some of this is pretty much cheating. Saying he had your “curiosity peaked” when he said the things he’d do to you if you were single and then asking him what he had in mind… You entertained all of this for wayyyy too long.", "label": 1}
{"text": "This discussion has gone off the rails and we are removing it.", "label": 1}
{"text": "Haha what an idiot.", "label": 1}
{"text": "Some people really out here with zero self-awareness 🙄", "label": 1}
{"text": "You have to agree this is funny!", "label": 1}
{"text": "r/OutTheCreep", "label": 1}
{"text": "Be honest tho what are u expecting with the shit u post💀", "label": 1}
