{"text": "Some of them like the Wagner guys are absolutely a confirmed murder.", "label": 1}
{"text": "I should note that even though many people claim to believe such things in my experience few actually act like they do. A fundamental memory for me growing up was being in Sunday School at my upper class church and for some reason the parents and kids were in a discussion together. When the Jesus quote about it being essentially impossible for a rich person to get into heaven came up every single one of the rich parents said they didn't think he meant that literally, but of course they would say other things that were critical of other groups were certainly meant literally. The hypocrisy was pretty jarring even as a kid.", "label": 1}
{"text": "of course I see things from other people's perspective. I also understand that you have never taken an attempt to understand from the average Trump voters perspective either. But that's ok you're on reddit and at least you're a bit better bc you didn't brainlessly down doot", "label": 1}
{"text": "🤣 🤣", "label": 1}
{"text": "Playboi carti effect", "label": 1}
{"text": "The train system was incredible during my first trip to Japan a few weeks ago, and I will always believe that trains are the greatest mode of transportation. Japan is a living example of how to do it, so the NZ government should go consult them. It just fucking works so beautifully.", "label": 1}
{"text": "There's something slightly immature about asking reddit to take your side vs. working things out with your gd spouse", "label": 1}
{"text": "They also scratch their heads and wonder why Asians are making more money than they are, but they can't figure it out.", "label": 1}
{"text": "Sounds like heaven.", "label": 1}
{"text": "Exterminate my peoples and hold us down. I'm surprised Hispanics aren't on this list, but statistically I believe they aren't doing too well either.", "label": 1}
{"text": "In case it's not obvious these demographics are being chosen based on the current political realignment. White men without a college degree used to be a reliable Democrat voting bloc but are now moving rapidly to the right. Conversely college educated women are moving rapidly to the left.\n\nIt's really quite crazy watching this realignment and especially how unaware young people on reddit seem to be on it. I remember when making fun of poorly educated voters was something Republicans did to mock Democrat and now it's flipped around. Same with the general consensus online which has gone from heavily right leaning to heavily left leaning.", "label": 1}
{"text": "You're going to kill yourself if you don't stop.", "label": 1}
{"text": "Boebert doesn't represent Denver.", "label": 1}
{"text": "You're a prick.", "label": 1}
{"text": "Not all Indian languages are Indo-European, despite this", "label": 1}
{"text": "We also have some Austro-asiatic and Sino-Tibetan languages :)", "label": 1}
{"text": "How about you fuck off you fucking asshole?", "label": 1}
{"text": "rude rain cagey ossified coherent groovy work ludicrous include violet\n\nThis post was mass deleted and anonymized with Redact", "label": 1}
{"text": "So still an erratic binge drinker? 😳", "label": 1}
{"text": "Says someone at lower latitudes. \n\nIt’s still dark when the kids go to school here…. \n\nAnd it’s close to dark when they come home in the middle of December. \n\nIt’s less energy efficient to change the time. Adults go to work with 5 minutes of sun, sit indoors during all the daylight and go home in the dusk or dark causing more accidents. \n\nJust move the school hours back a bit and let us have some sunshine at the end of the day", "label": 1}
{"text": "What about 2023?", "label": 1}
{"text": "The fact that Congress should be able to enact bipartisan popcorn legislation is really comforting.", "label": 1}
{"text": "Popcorn will heal America.", "label": 1}
{"text": "You don’t own a boat you weird little bitch 😉", "label": 1}
{"text": "[Dataset](https://docs.google.com/spreadsheets/d/1NytnimLbKrhlJL5fjR1v9ecD0S7Tchnq2jTSKqcNSwo/edit?usp=sharing)  \n  \nSource: [uselectionatlas.org](http://uselectionatlas.org/)  \n  \nCreated using Google Sheets and MapChart extension.  \n  \n**Question to answer: how many times has each state been a key swing state in the 16 presidential elections since 1960?**  \n  \n**Top 10:**  \n1: Wisconsin (10)  \n=2: Pennsylvania (8)  \n=2: North Carolina (8)  \n=2: Nevada (8)  \n=2: Florida (8)  \n6: Ohio (7)  \n=7: Minnesota (6)  \n=7: Missouri (6)  \n=9: Arizona (5)  \n=9: Texas (5)  \n=9: New Mexico (5)  \n=9: Tennessee (5)  \n...  \n=45: Kansas, Nebraska, Connecticut, Utah, North Dakota, Wyoming, DC (0)  \n  \nRe: 1960 cutoff: the 1960 US presidential election was the first to include Alaska and Hawaii, each having acquired statehood in 1959.", "label": 1}
{"text": "I've always thought they should just keep a running clock of total speaking time for each candidate, and adjust allotted time going forward if one candidate gets ahead. This would be much easier now than in the past, since their microphones aren't on at the same time and there's no need to account for cross-talk.", "label": 1}
{"text": "The words \"rural\" and \"republican\" could be replaced with \"urban\" and \"democrat\" and the same would still apply", "label": 1}
{"text": "lol, no it does not weed them out.", "label": 1}
{"text": "It's hard to counter-argue persuasion attempts you don't know are being made.  I had no clue the curated and crazy content my 76 year old mother gets.  It literally flipped her from blue to red.  And I never would have known if she hadn't slipped and repeated something that she had been targeted with.  And she clammed up when I asked her about the \"fact\" she had shared and where she had gotten it.  Older people, boomers, etc. aren't very good at dissecting the content they are getting.  They are of a generation that trusted news sources because they grew up on newspapers and the evening news as being largely non-partisan (Thanks Reagan).", "label": 1}
{"text": "In this data app, linear regression, classification, and a nationwide vote prediction for Trump vs. Harris were used to forecast the results of Tuesday's presidential election based on polling data. The analysis then focused specifically on swing states, with particular attention to Michigan.\n\nLink to the data app: [https://deepnote.com/app/katkas-workspace/US-election-prediction-2024-2ab7bc78-cc32-47b8-b04b-406a6a546385](https://deepnote.com/app/katkas-workspace/US-election-prediction-2024-2ab7bc78-cc32-47b8-b04b-406a6a546385)\n\nData used:  \nPresidential General Election: 2024 Polls, FiveThirtyEight ([https://projects.fivethirtyeight.com/polls/president-general/2024/national/](https://projects.fivethirtyeight.com/polls/president-general/2024/national/))  \nPresidential General Election: 2020 Polls, FiveThirtyEight ([https://projects.fivethirtyeight.com/polls/president-general/2020/national/](https://projects.fivethirtyeight.com/polls/president-general/2020/national/))\n\nLet me know if you're interested in the complete notebook as well.", "label": 1}
{"text": "Yeah? I seriously doubt I’m the one convinced you.", "label": 1}
{"text": "I think that’s a big part of why he’s successful, however shocking that may sound. He grabs attention with his statements, like saying people are eating cats or dogs. People appreciate that he \"tells it like it is\" and promises he’ll be the one to solve it.", "label": 1}
{"text": "Yo alll hating, stop spending so much time on him and more time on yourself, you know mental health and all. You might just turn out ok", "label": 1}
{"text": "Propaganda out strong this week", "label": 1}
{"text": "You were wrong and you're throwing a tantrum about being corrected. How childish.", "label": 1}
{"text": "It doesn’t matter because the minority community would never beat the majority, that’s the whole point", "label": 1}
{"text": "So, I'm not exactly sure what I said that implies anything that contradicts what you said. I know amendments are for the entire Constitution. I also know that the Bill of Rights weren't done later on and that they were basically part of the original Constitution when it was first ratified in 1789, right? (Or shortly thereafter).\n\n\n\nMy point that I didn't make was that that none of the Constitution is exempt from being amended, whether it's the Bill of Rights, the original Constitution minus the Bill of Rights, or any subsequent amendments. The idea that the Founding Fathers were omniscient Gods and that none of the stuff in the Constitution nor the Bill of Rights should ever be altered is what I was arguing against.\n\n\n\nI did not know about the Federalists and the history of the Bill of Rights being designed to protect the rights of the people, which weren't enumerated in the original constitution, nor do I know the history of the Articles of Confederation. I appreciate the insight you've added in your comment.\n\n\n\nMaybe my comments implied something that I didn't intend, but my point was that the Constitution isn't the Bible and the Founding Fathers weren't all-knowing oracles of the future. That's literally why there's an amendment process that they came up with because they knew times would change. It's a great system to have lasted as long as it has so far.", "label": 1}
{"text": "That's insane too. You think there's only 8 people on Earth with downs syndrome or cystic fibrosis? Fuck, 50% of reddit claims to have autism.", "label": 1}
{"text": "\n>I'm merely replying to demolish you. Don't take the bait.\n\nThis is the funniest thing I've read all day. Do you practice saying this shit in front of the mirror?", "label": 1}
{"text": "Blue: People who fail to vote because they're smoking weed\nYellow: People who forget to vote because they're too busy pretending to make a business on TikTok and Instagram\nRed: The Amish", "label": 1}
{"text": "That's an amazing transformation—your daughter looks absolutely enchanting as Cinderella!", "label": 1}
{"text": "I miss Rebecca Black after seeing this year's rewind. At least that shit was kind of endearingly cringy", "label": 1}
{"text": "What is the $23M corporate exoense that isn't connected to the operating expenses and why?", "label": 1}
{"text": "The footnotes in the earnings release say that category is mainly gains and losses from Nike’s central currency hedging portfolio. Since Nike does business in many different countries, it has income and expenses in many different currencies, so it needs to manage that in some way.", "label": 1}
{"text": "This is some goddamn slander. I will take **all** of your Haribo, you ingrates.", "label": 1}
{"text": "Women are dumb and spoiled, social media and dating apps mean they're all fucking the same few men", "label": 1}
{"text": "Felons shouldn’t vote either. They wronged society and shouldn’t have a say in what goes on", "label": 1}
{"text": "Obviously not. The minorities would never win, and they’d never have anyone represent them. Because they are in the minority. The parties in control would only ever appeal to the majority, which is middle class who’re people.", "label": 1}
{"text": "Not barely. Open your eyes", "label": 1}
{"text": "Interesting graph, but the comments are using this to circle jerk unions and that’s a bit silly honestly. Like yeah, obviously union pay is going to be higher. In industries where it isn’t, nobody would join the union and it’d instantly have no reason to even exist. We wouldn’t see those examples on a chart. \n\nThat doesn’t mean unions are automatically “good” and have no flaws. They have pros and cons. They’re pretty good for workers who have been in the union, bad for those who aren’t, and obviously costly for employers. They’re only VERY good for union bosses who collect dues. The way unions work is that pay for union workers is higher at the expense of pay for workers outside the union. This happens because non-union workers can’t get hired or paid as well due to the agreements created between unions and employers that force certain employers to only use union labor. Union leaders in these cases are essentially just restricting labor supply for employers, in turn driving up labor costs (in the form of higher pay) for union workers. When you factor in the dues that unions require though, the gap between non-union and union pay has to be large for it to even start to be worth it for the workers in the union, and the workers outside of the union are still worse off because they can’t compete with the same job supply. \n\nPeople on Reddit glaze unions as a blanket pro-worker thing, but they only kinda are. They’re good for workers already in a good union, bad for workers in a shitty union that don’t negotiate well but have high dues, and bad for workers not in a union. It’s not something you can say is always pro-worker.", "label": 1}
{"text": "People who remove are really weird ~~and tasteless~~.", "label": 1}
{"text": "Yes", "label": 1}
{"text": "I mean yeah, but TRIM YO SHIT is funny", "label": 1}
{"text": "Don't trust a \"poll\" where each vote costs a dollar with billionaires and whole nations trying to influence the outcome.", "label": 1}
{"text": "Still not going to vote. Just another rich whatever in office, not someone I can relate to.", "label": 1}
{"text": "Yeah and clouds will start raining meatballs and the rivers will run with milk and honey.\n\n...that would probably happen first before a change in the system and both are a pig spit in hell.", "label": 1}
{"text": "I think you're all idiots who made their beds long ago. Now sleep in them.", "label": 1}
{"text": "Or maybe i just want to watch the world burn. :p", "label": 1}
{"text": "No. I didn't want to hear yours either.", "label": 1}
{"text": "Even more bonkers most people like you don't know proper grammar or spelling.", "label": 1}
{"text": "I hope they burned your cards for pestering them.", "label": 1}
{"text": "Because part of a democracy is the choice to not make a choice. Get over it.", "label": 1}
{"text": "Pfft it will be the same as always.\n\nThe blind leading the blind.\nWell at least for you guys.", "label": 1}
{"text": "Is it just me, or do unions sound like the original \"team players\"? 🤔", "label": 1}
{"text": "So, are you too lazy, too stupid, or too stupid and lazy to bother to read the OP's comment that accompanied this?", "label": 1}
{"text": "That's exactly the opposite of what he said. Here is the source, straight from RFK Jr himself. Saying otherwise is just fear mongering.\n\nhttps://x.com/EndTribalism/status/1811171386913702371?t=uJ-l33LkQ4nH608055hFMA&s=19\n\n>“My position is that vaccines should be tested the same way for safety and efficacy as all other medications, They're exempt from that kind of testing today. I also believe that people should have informed consent, that people shouldn't be required to take a medical intervention with which they disagree.”\n\n>“The other thing is vaccines are mandated, so there's no market. The federal government is ordering 76 million children to take them and these are healthy kids.”\n\n>“If somebody wants a vaccine my presidency is going to do nothing to interfere with that. I think most Americans, if they actually knew the way that I felt about this issue, 99.9% would agree with me. It's only that I've been portrayed and mischaracterized in a certain way because that’s a way to silence any debate about this important issue", "label": 1}
{"text": "Oh don't start. You're about to get hit with some insane argument about how a russian invasion under Obama, nothing under trump, and a russian invasion under Biden proves that trump is helping russia. It'll be some incomprehensible argument about how trump was TOO SUPPORTIVE for them to want to invade. He would've helped russia TOO MUCH!!", "label": 1}
{"text": "Well duh- they are all in self inflicted recessions from migrants and inefficient green energy initiatives. Plus they aren't getting as much of that Russian money they love so much. They see all of that in Harris. It's like looking in a mirror to them.", "label": 1}
{"text": "You seppos are off your rockers.", "label": 1}
{"text": "You live in an echo chamber.", "label": 1}
{"text": "What a shitty response", "label": 1}
{"text": "You came here to be a douche, and accomplished your goal.  NICE!", "label": 1}
{"text": "I’m so sad the mod being stinky led to no answer to this question 😭. I’m wondering the same thing Mr. Normal Guy", "label": 1}
{"text": "This is a terribly moderated sub in general. I've just given up even bothering around here in recent years.\n\nEverything needs to be manually approved by a human. Yet half the time your high effort post which follows the rules perfectly just sits there completely ghosted while low effort junk flies through. \n\nThen you message, polite as can be, asking for it to be approved - which also gets ghosted completely.", "label": 1}
{"text": "This is a terribly moderated sub in general. I've just given up even bothering around here in recent years.\n\nEverything needs to be manually approved by a human. Yet half the time your high effort post which follows the rules perfectly just sits there completely ghosted while low effort junk flies through. \n\nThen you message, polite as can be, asking for it to be approved - which also gets ghosted completely.", "label": 1}
{"text": "Except for AITAH redditors, who all seem to get married at 20.", "label": 1}
{"text": "There's something slightly immature about asking reddit to take your side vs. working things out with your gd spouse", "label": 1}
{"text": "most sane reddit mod", "label": 1}
{"text": "Bringing back original Pagerank might shake things up! SEO would have to adapt quickly. It’d be wild, like the INternet losing touch for a bit. Pulse for Reddit, much like SEMrush or Moz, makes navigating Reddit a life-saver when search engines fumble around. Avoid SEO pitfalls by staying on top of things with Pulse.", "label": 1}
{"text": "As such, what you just said doesn't register", "label": 1}
{"text": "That's the most important data I've seen in the last 24 hours", "label": 1}
{"text": "Let's not jump to conclusions.", "label": 1}
{"text": "It deals with propaganda, I think.\n\nMaybe western should open remote jobs (Protect your key data or technology at the same time of course) and help to pull down the wall of internet, let common people here to get connecting with world.", "label": 1}
{"text": "That suicide count boutta go up by one real soon.", "label": 1}
{"text": "I have no stake in this discussion but in real life the election isn’t a black and white vacuum like you describe, there’s tons of nuances to the statistics I don’t think you are wrong or they are wrong you are just making different points", "label": 1}
{"text": "Oh okay, so you're a deluded fuck living in a fantasy and now we all get to suffer. Thanks a lot you dentheaded loser.", "label": 1}
{"text": "\"Extreme woke bullshit\" such as _checks notes_ ...letting people go by the name they want to be called?\n\nIf so then well good sir, you sound like a terrible human being. Your parents failed you, your grandparents failed them, come to think of it your entire bloodline up til now is a failure. But that's okay, because in a world where a convicted felon can become president, failures like you can still thrive.", "label": 1}
{"text": "That's because Reddit is an echo chamber where only leftists (or right-winged people who don't talk about politics) survive long term. People who talk about politics and in favor or the right, get banned eventually.", "label": 1}
{"text": "She was a Bad Pick from the Start, in normal circumstances she would never would have Been the presidential candidate", "label": 1}
