{"text": "Someone being visibly non-white doesn’t automatically make them more likely to be an immigrant in Texas. Not long ago, Texas wasn’t even part of the U.S.", "label": 0}
{"text": "Precisely, while they lose more and more of their own voters out of disgust. The future is looking right wing, and the democratic party is a big reason why. Liberalism is disgusting.", "label": 0}
{"text": "I think people judge Texas and Florida based on the power exercised by their Republican governments, which is fair in many ways.", "label": 0}
{"text": "We’ll see the vote Nov 6. I doubt it’s close to 40%", "label": 0}
{"text": "> the damage to our country was massive, they tried to overthrow democracy. \n\nThen..\n\n> You gotta lay off the paint chips.\n\nGreat advice for you!", "label": 0}
{"text": "If it was by popular vote than itd also be decided by a handful of states/cities", "label": 0}
{"text": "Man I can't wait until all the political people leave in a week or two.", "label": 0}
{"text": "Wdym? It specifies exactly what you wanted to be specified", "label": 0}
{"text": "harris is actively sabotaging her own campaign. it's legitimately worse than clinton '16.", "label": 0}
{"text": "How can there be more “total cases” than actual deportations???", "label": 0}
{"text": "please consider half this country does not want democracy to end or bring about destruction of our country, and so that is why Harris is a bit down in the polls. \n\nSome of them see the democrats as threats to the security and safety of the country and government,", "label": 0}
{"text": "Bless your heart that you think someone owning a house in Alabama has a better standard of living than someone making $150k in San Francisco, quality of life isn't about just home ownership. QoL is also about stuff like walkability and transit access and things to do, which most of the south lacks entirely, that is why the south is awful, it's why the south has a lower QoL and lower lifespans, because it sucks there and nobody with a brain wants to live there.", "label": 0}
{"text": "For each school in Australia you can lookup %of students where English is not the first language. My local primary/elementary school is 47% and high school is 67%. It is actually unusual to meet someone in my suburb that was born in this city.", "label": 0}
{"text": "This is also what I believe. DeSantis has been so effective at marketing himself and pulling gaudy publicity stunts that the rest of the country just labels Florida as a lost cause.", "label": 0}
{"text": "Yeah and if you go back far enough only white landowners were able to vote. Men had to be registered to the draft to vote. Millions of men died before they even had a chance to vote. I don't think focusing on who suffered more is worth any salt. Women are more educated, live longer and benefit more from social programs.", "label": 0}
{"text": "Just say you care more about your ideals than helping minority populations at all.", "label": 0}
{"text": "We've had the current model of dealing with them since Reagan's amnesty in 1985, so since then, yes", "label": 0}
{"text": "Or how much of our taxes is spent on Ukraine.", "label": 0}
{"text": "I don’t think official government stats know how many immigrants are in the country. Especially the U.S. and probably Germany, too.", "label": 0}
{"text": "Clinton deported more than anyone else, guess they will have to wrap their head around that", "label": 0}
{"text": "Far less than half, but yes. Fuck the filth", "label": 0}
{"text": "Iraqistan: 20 years, $6 trillion dollars ($25 billion dollars / month every month for 20 years). Own it.", "label": 0}
{"text": "That’s just not true at all", "label": 0}
{"text": "You obviously haven't spent much time in Houston. The biggest change is not people from Mexico, but from all across Central America. They just pass thru Mexico to get here. But we have large and rapidly growing populations from Southeast Asia, India/Pakistan, the Middle East and the newest growing segment is thousands of African immigrants. As someone who has spent most of their life here, It's not the Hispanic population that make you realize there lots of immigrants here, the sheer number of immigrants that are non-Hispanic that have and are settling here to build a life. We are an immigrant majority city.", "label": 0}
{"text": "My hero 😍😂 🖤💛\n( Even though I already knew the answer) 😋", "label": 0}
{"text": "I'd argue that dead ball situations are different than the ball being live.\n\nI wouldn't call a soccer team preparing a corner \"playing\" either, even if there is movement in the penalty area", "label": 0}
{"text": "Yes, they suffered unfortunate cases of low health", "label": 0}
{"text": "Even right wing Republicans don't OPENLY say that legal immigrants aren't real Americans. They absolutely are racist, and absolutely are uncomfortable with (nonwhite) immigrants and their descendants, but even they at least pay lip service to if you come here legally and get you're citizenship you're an American, end of story. That's pretty different from the general attitude in most of Europe.", "label": 0}
{"text": "For those idiot Trump donors, check out the number of business and energy deaths. Don't  mistakenly think your favors will benefit you in the future. Dictators  expect loyalty, but have no loyalty to you.", "label": 0}
{"text": "You're nut picking the worst of the worst in the internet. The mayority are normal people; and people like you see it and instead vilify them, so no wonder they latch on the first person (even with bad motives) that says something positive about them. \"A child must be embraced by the village, or he's going to burn it down to feel it's warmth\" African proverb.", "label": 0}
{"text": "Fun fact: a chess match has 0 minutes of live ball time.", "label": 0}
{"text": "Nah, sorry. Trump supporters were already ignoring reality to be Trump supporters. They still don't care. Those of us who value women's rights already knew it was a real and serious threat. My friend's grandma, who said she didn't think they'd actually overturn Roe v Wade? She just voted Trump again. Voted early so she could make sure to vote Trump before she dies.\n\nWe didn't lose in 2016 because of a lack of votes on our side. We lost because of a surge of votes on their side. Obama and Trump both showed us the same lesson -- inspiring support always gets more votes than trying to instill fear.", "label": 0}
{"text": "Shit, I’ve been playing wrong I guess", "label": 0}
{"text": "I mean, if you have \"the wrongest data in modern history\", that's a pretty good clue that you're running the worst campaign in modern history.\n\nBut it wasn't just about their bad data. It was the entire campaign.\n\nHer slogan was \"I'm with Her\". It wasn't \"She's with Me\", it was \"I'm with Her\". As if people should be voting for her so that she can make history. Obama made history, and his message was *never* about making history.\n\nAnd her VP pick was possibly the most useless and unimpactful VP pick in history. Was there a single person in America that pulled the lever for Clinton because Kaine was on the ballot with her? Or anyone who thought \"Yeah, she made a great decision on that pick, that makes me want to vote for her\".\n\nHer opponent, on the other hand, picked probably the most impactful VP pick in history. Lots of evangelicals were convinced to vote because one of their own was on the ballot.\n\nHer entire campaign was terrible. There is literally nothing you can defend about a campaign that lost to what *should* *have been* the worst candidate in modern history.", "label": 0}
{"text": "Name a single country with a single-member-district voting system that doesn’t end up with a toxic two—major-party-system.", "label": 0}
{"text": "if you genuinely believe that, it shows your low level of intelligence. if you can't understand there's always two sides to a story, then you should enlighten yourself. if you're constantly on reddit, cnn, liberal spots, you're going to sway left. if you're always on twitter, fox, conservative spots, you'll sway right. whichever side you're on will feed you positivity about your side and tell you that the other side is completely wrong and they're subhuman. stop being a sheep and learn how to think for yourself.", "label": 0}
{"text": "I see this criticism a lot, especially from those who are not American. While a great deal of time in an NFL broadcast is wasted on commercials and burning the play clock, the tendency to only count hike-to-down as “playtime” is disingenuous. The act of lining up and making adjustments at the line is a large part of the game. These on-the-fly changes are what determines if the offense or defense prevails on the down and when you start to understand how these nuances unfold it becomes a much deeper game.\n\nAnd frankly, when a competent offense is down after the 2-min warning, the hike-down-lineup sequence is so fast even a casual observer would know it’s all action.", "label": 0}
{"text": "It’s not an oligarch", "label": 0}
{"text": "It doesn't specify oligarchs though, just notable Russians, of whom I thought Navalny would be one.", "label": 0}
{"text": "My state government job that required a graduate degree gives me 12 per year. And that is considered *generous* in this area. \n\nOn the upside there's no hassle when I take them. I just put it on my calendar and don't show up. \n\nI will say there is a culture of pride among the older employees about never having taken *any* PTO ever in their entire careers. Maybe when these guys die off we'll see some movement in this area.", "label": 0}
{"text": "Yes, send me to war mommy dom uwu.", "label": 0}
{"text": "I leveraged data from the MIT Election Data + Science Lab as well as from the Census American Community Survey 5-year estimates to pull voter turnout by county and total eligible voter population by county based on general election data from 2016 and 2020. Goal was to help counter voter apathy/complacency by showing the power of a vote based on historical voter turnout in any given county. While I didn't include midterm election voter turnout data, that data would be even more compelling!", "label": 0}
{"text": "Getting the play and strategizing pre snap is literally playing the sport though. If you think it's dull that's fine, but it's the game", "label": 0}
{"text": "Ffs, Rogachev was terminally ill, he had cancer, he left a note and stepped out of the window. He was an old man, not controlling anything for at least a decade.", "label": 0}
{"text": "Not just that, in Germany you can be 4th generation born and raised here, but if that 5th generation immigrated to Germany, many people will still consider you an immigrant, or an Ausländer.", "label": 0}
{"text": "Why wouldn't they know?", "label": 0}
{"text": "I mean, yeah. We just work.\n\nI grew up in a blue-collar family from Texas, and nobody I ever knew got anything more than federal+state holidays off. Ever. \n\nThat was completely normal. Still is. The idea of taking a vacation was and is foreign. Working Monday through Friday until you die is just adult life. If you want to do something, it has to fit in a weekend. If you need to skip work for an emergency such as a death in the family you called in and didn't get paid. Do it too much, and you get fired. \n\nThat's just life.", "label": 0}
{"text": "Naryshkin’s photo on Viatcheslav Rovneiko…", "label": 0}
{"text": "Genuinely so curious if many modern Christians believe this to be accurate", "label": 0}
{"text": "I don't see that you have edited the Wikipedia source article in support of your conclusion.  Please do so.  :)", "label": 0}
{"text": "I remember the good ol’ days when we used a different word for belief sets like that - fundamentalism.", "label": 0}
{"text": "It's not necessarily about representing solely the positions of the majority. It's about forming and maintaining a functioning Republic constructed of a very diverse population. If you want the Balkans, start having 51% of the population dictate to the other 49%. This will only work if we have a national system built on compromise and moderation. This means giving an equal voice to the entire spectrum of demographics and the most efficient way to do that is with a proportional electoral college.", "label": 0}
{"text": "Apparently Enoch did something really wrong there", "label": 0}
{"text": "Isn't someone from the bible technically still alive, because they were never recorded as dead in the bible?  Oh yeah, not imaginary 'facts' at all.", "label": 0}
{"text": "While you're correct that Social Security is not solely targeted at poor adults or means-tested, i.e. you still get your check once you retire even if you've saved plenty for retirement, it's still much more of a social safety net than it is a retirement savings program. A 401(k) or IRA in the market will produce yields far in excess of what you put into Social Security.\n\nIt's not a self-sustaining program in the way that individual retirement savings are; it assumes that a substantial fraction of the population will not be able to save adequately for retirement and needs help, so it taxes current workers who outnumber current retirees. Well-off people will pay in far more than they ever get paid out, and that redistribution is absolutely the point. In the days before Social Security, the majority of older adults lived in poverty after they couldn't work. Many would have to live with family or in the poorhouse to get by. \n\nSocial Security actually remains the single most effective government program at lifting people out of poverty. Without it, the current senior poverty rate would be 40% instead of 10%:\n\n[https://www.cbpp.org/research/social-security/social-security-lifts-more-people-above-the-poverty-line-than-any-other](https://www.cbpp.org/research/social-security/social-security-lifts-more-people-above-the-poverty-line-than-any-other)\n\nMedicaid costs have simply inflated significantly alongside other healthcare costs.", "label": 0}
{"text": "All white people... Not very diverse...", "label": 0}
{"text": "So we agree liberal cities failed their homeless population. Also you do understand that if Cali ignores theft of under $1000, that crime is unreported?  Just like how most homeless crimes go unreported. BLM riots had soooo many crimes unreported. Theft is on the rise. Which is why businesses lock up everything now or they close down brick and mortar stores in crime areas. Porch pirates are on the rise. The Asian hate went under reported when they found out blacks where the only ones harming Asians during covid. FBI corrected the 2022 crime data. A lot of democrat cities are no reporting some crimes. Also calling the police in democrat cities is so busy, the cops do not even show up to some calls during busy nights.", "label": 0}
{"text": "Wow! Thank you!", "label": 0}
{"text": "You think blm riots encouraged crime rates to spike or drop? BLM started under Obama too remember.", "label": 0}
{"text": "There is no \"California Nevada grid\". [Both are part of a grid that covers almost the entire western half of the country](https://assets.weforum.org/editor/Xj8xZ70sq_TVyA_ZK3axV6T5l8ZFOQrbt16mWYcjPjM.PNG).", "label": 0}
{"text": "Biden should stop giving money to Ukraine because the USA has hurricane victims and other us citizens struggling too!! Americans first than Ukraine gets are leftovers!!! Why should we help Ukraine, when they have not helped us when US citizens are in need. Why do American tax dollars pay for babies to be harmed!? War is bad!!! US should not fund wars. Ukraine has neo Nazi connections in their government", "label": 0}
{"text": "Americans mostly agree the Iraq war was useless for America. Just like helping Ukraine is useless for Americans!!!!", "label": 0}
{"text": "So we agree democrat cities failed the homeless crisis? The federal government has very little to do with it as you say.", "label": 0}
{"text": "They changed her answer. Crazy how you think editing someone’s answer to a question with a whole new answer is good journalism. That is called fake news. 60 minutes is fake news!!", "label": 0}
{"text": "It keeps getting worse for Harris.", "label": 0}
{"text": "Which ones?\n\nEveryone I've talked to realizes how unreliable the timelines are from the early scripture and that many of the divine acts are considered parables.  The only magic they won't budge on is that Jesus was immaculately conceived, sent as a prophet, and he died and resurrected.  It makes sense considering how easily all of those things could have happened without having to resort to attributing it to divinity (Mary had sex and didn't tell anyone, Jesus made it up, he appeared dead but came to in the tomb and someone let him out) because then the credibility would be shot.  Also Moses talking to the burning bush that no one can corroborate; same situation.\n\nI know it's cool to shit on those easily fooled, judgy, hypocritical Christians here but if you take the time to talk to them in real life you'll find many are good, smart people who cope with how fucked up the world is through fantasy like everyone else.  Their club is just older and better organized than your One Piece fandom.", "label": 0}
{"text": "To better comprehend that mesh of years I decided to visualize it, these information can be found on Genesis 5. I'm not questioning if that information is verified or proved my concern was to visualize and understand how these ancestors relate to each other.", "label": 0}
{"text": "Ugh only got 5 days :(. No benefits before first full year.", "label": 0}
{"text": "It’s actually a weird thing in that chapter of genesis. Every other description of a persons life ends with “then he died” or something that explicitly says “died/death.” But with Enoch, it says “Enoch walked with God, and he was no longer here, for God took him” which some people interpret to mean he didn’t die but instead was brought up to heaven alive by God.\n\nSo maybe it’s not something he did wrong, but something he did right", "label": 0}
{"text": "No poison potatoes. I'm disappointed.", "label": 0}
{"text": "They made one of these for the US, but the guy drowned suddenly before he could release it. Very tragic.", "label": 0}
{"text": "You just need pretty basic statistics and sampling procedures to have a pretty good guess. Otherwise  you'd be saying you also have no idea if there are a lot or a little.", "label": 0}
{"text": "In the US the Department of Energy is one of the largest and most powerful governing bodies. They oversee many sectors of commerce, technology, development and even weapons systems. Wouldn't surprise me if Russia was similar.", "label": 0}
{"text": "It did crash after exploding! They aren’t wrong.", "label": 0}
{"text": "You should run this back to 2016", "label": 0}
{"text": "I didn't say anything about BLM. The biggest section in my comment was about Ukraine. You didn't comment that at all. Why?", "label": 0}
{"text": "Preparing to play is not the same as playing, and dead balls is the former not the latter", "label": 0}
{"text": "Nice im half luri half kurd", "label": 0}
{"text": "Crazy how you think that actually happened. They edited for time, like they always do. The unedited interview is available for your consumption, but that would require you to do more than the most basic level of research\n\nYou believe that because Trump said it. But no one who actually looked into it, believes that.\n\nHarris did a 60 minutes interview. Trump didn’t because he was afraid of fact checking. Only liars fear fact-checks.", "label": 0}
{"text": "It's not preparing to play though, that's what you don't understand", "label": 0}
{"text": "Not many. Obviously they exist, but they're not near the majority. They're just loud. I think this graph is just interesting to see what some of the consequences are of some of the stated lifespans in the Bible. Like, it's funny to realize that, as written, Noah's dad could've still been hanging out with Adam for decades, lol.", "label": 0}
{"text": "I explained to you that even if you didn't care about Ukrainian lives at all, arming Ukraine is the most efficient military spending that the US can do in terms of bang (on the enemies of the US) for buck. \n\nYour last sentence tells me everything. You're just feeding on Russian propaganda. That's sad.", "label": 0}
{"text": "I understand I just disagree.", "label": 0}
{"text": "Vehicle, as in getting hit by a car or getting by an S300 SAM rocket.", "label": 0}
{"text": "Those are not the same. Iraq war destabilised Middle east and created a lot of enemies to the US. Ukraine war has revigorated NATO the most important military alliance to the US. It has also basically destroyed the military of the second biggest global adversary to the US, Russia and it will take decades if ever before it recovers. This for a fraction of a cost of the Iraq war and without a single American soldier getting killed.", "label": 0}
{"text": "Quarterback reading the defense and making adjustments to the play. Is that playing the game?", "label": 0}
{"text": "Jehova's Witnesses, Assemblies of God, Pentacostal Holiness, etc\n\nthe ones that evangelize and have tent revivals and no seminary", "label": 0}
{"text": "I was going to say, surely he died well before 2022, but apparently you're right! \n\nWikipedia says he died of a long illness, and he was 91, so it's not that suspicious...", "label": 0}
{"text": "https://apps.nationalmap.gov/viewer/\n\nAnd here is the LIDAR map for the entire country, but with buildings and trees removed, if you turn on the \"3DEP Elevation - Hillside\" layer!", "label": 0}
{"text": "There's always a purge that happens after coups. The people who helped you get into that position could just as easily wield the same to get you out of it.", "label": 0}
{"text": "He was the last leader of the soviet union and was anti invasion.... I think the long illness was a cover up", "label": 0}
{"text": "I mean you could fall from a ground floor and still die \"of a fall\", it would just be longer and more painful. If given option I bet you'd ask to wait for you to climb somewhere higher", "label": 0}
{"text": "The plan that Harris and Biden ran with to get voted in 2020, failed during these four years. Harris is starting to copy trumps plan. Increase border wall mass. Harris also is finally not encouraging migrants to cross as much as she did when running in 2020 and early in her time in office.", "label": 0}
{"text": "Can you not read? I said they are now trying to copy. After 3 and a half years with a failed border. Biden and Harris are doing a terrible job copying. But it is too late. Also Harris and Biden do terrible at copying trumps plan. Like Harris and Biden failed Trump Afghanistan plan.", "label": 0}
{"text": "It will take the US citizens even more decades to pay off the Ukraine war debt. China loved the US wasting money on a failed war. The US wasted money but got nothing in return. Sad you think babies lives are worth US tax dollars. USA should be above harming kids. Unlike the p diddy democrats!!", "label": 0}
{"text": "The only thing I learned from this was, \"wow the bible is one screwed up text to believe this.\"  \n\nI guess in the New Testament they were, \"yeah we can't say they lived nearly a thousand years that would seem odd.\" Really? Ya thunk?", "label": 0}
{"text": "You sound like a war monger. The United Nations leeches off the US.", "label": 0}
{"text": "60 minutes has dropped in quality hard. 60 minutes lost so much credibility. But have fun in your echo chamber!", "label": 0}
{"text": "Here we go!!! (I was hoping this would be your response). Oh PLEASE manxsplain to me how human trafficking isn’t actually a thing.\n\nhttps://www.ice.gov/features/human-trafficking\n\nhttps://www.state.gov/policy-issues/human-trafficking/\n\nhttps://www.fbi.gov/investigate/violent-crime/human-trafficking\n\nhttps://www.dhs.gov/blue-campaign/what-human-trafficking\n\nhttps://humantraffickinghotline.org/en/statistics", "label": 0}
{"text": "We need to add Harry Potter to the chart", "label": 0}
{"text": "BLM riots encouraged a huge trend in democrat cities to not report crimes. Since democrats wanted less policing in their cities. Which criminals used the opportunity to commit crimes. Like robbery. Homeless crime has also been on the rise for going unreported but still happening. Democrats let crime happen because it is racist to arrest some of them or sad to arrest poor people.", "label": 0}
{"text": "BLM encouraged criminals to commit crimes. Since democrat politicians demoralized their own city police forces. With defund the police speeches.", "label": 0}
{"text": "So Adam was still alive when his Great Great Great Great Great Great Grandson Lamech was born. \n\nThose would be some mighty big family reunions.", "label": 0}
{"text": "Why would the Democrats feel the need to compromise on a bill that would secure the border? Isn't that a universal good. Pass that bill, then debate on how much money to give Ukraine. Don't hold border states hostage. One is a domestic issue, the other is not.", "label": 0}
{"text": "Coming next week are comparisons of sexual encounters by gods in the Hindi pantheon, plots of murder counts in the Greek & Roman pantheons, charts highlighting occupations in the nine realms of Norse mythology, line graphs for the tax returns of all partners the OP's parents slept with while in college, and BMI's of all characters in every Harry Potter novel. \n\nOr maybe they will quit posting nonsensical plots from books of fiction.", "label": 0}
{"text": "Everything about the west makes Putin afraid. \n\nIn this case, Bidenov (I think it might actually be Budanov?) was an friend of someone (Pavel Antov) who criticized the shelling of residential areas in Kyiv as terrorism.", "label": 0}
{"text": "I know, this is a relatively recent change, where they started counting \"Large Hydro\" as a separate tab from what they called \"Renewables\".\n\nYou can see it here in the 2021 official electrical generation tally, where Large Hydro is counted as \"non-renewable\" while there is a separate tab for \"Small Hydro\" in the Renewables grouping:  \n[https://www.energy.ca.gov/data-reports/energy-almanac/california-electricity-data/2021-total-system-electric-generation](https://www.energy.ca.gov/data-reports/energy-almanac/california-electricity-data/2021-total-system-electric-generation)\n\nHowever, it seems they've reverted this in the 2023 statistic, where they now have a combined \"non-GHG and renewables\" grouping that has both Large Hydro and Nuclear included:  \n[https://www.energy.ca.gov/data-reports/energy-almanac/california-electricity-data/2022-total-system-electric-generation](https://www.energy.ca.gov/data-reports/energy-almanac/california-electricity-data/2022-total-system-electric-generation)", "label": 0}
{"text": "I wonder if they aged normally for the first 80 years, and then were just old and feeble for next 800+ years.  Or was it spread out, like they were crazy teenagers for a couple of hundred years.", "label": 0}
{"text": "In Germany they have a proportional representation voting system in both federal level and state level. In federal level the center-left Social Democratic Party and the center-right Christian democratic Union party were willing to form a coalition government against the extremists in the past decade. Recently the far-right party AFD came first in 2024 Thuringian state election with 33% of the votes and became the largest party in Thuringian parliament. However, all other parties in Thuringian parliament refuse to work with the AFD, and even the leftist Left party is willing to work with the center-right CDU against an AFD government. If Germany has a single-member-district voting system, the AFD could well win the majority of the seats in Thuringian parliament with 33% of the votes.", "label": 0}
{"text": "Chill. Op did a good job. Don’t be hostile just because you don’t believe. It gives us atheists a bad rap.", "label": 0}
{"text": "Mods - This please is being swamped with PROPOGANDA - We used to get interesting post that made you think about random things - now everything is about immigration, race, military, Israel, abortions  etc. \n\nCan we just delete them all - they are all trying to influence people . \n\nAlso expect a lot more posts about violence - normalising violence. Please Delete.", "label": 0}
{"text": "Because he didn’t actually die…?", "label": 0}
{"text": "Yes, it is interesting and totally changes the vibe of the biblical story", "label": 0}
{"text": "Looks itchy and contagious. (No offense to Chicago. Lived there a minute. Beautiful city.)", "label": 0}
{"text": "how is the shading done? ambient occlusion? is there directional lighting too? raytraced?", "label": 0}
{"text": "It's full of cushy politically appointed chairs. And those are filled by politically significant people.", "label": 0}
{"text": "You might be thinking of the wanding Jew. Apparently he's more of a legend than a biblical figure. \n\nhttps://en.m.wikipedia.org/wiki/Wandering_Jew", "label": 0}
{"text": "More plots more useful that’s what I always say. No such thing as too much data.", "label": 0}
{"text": "Or maybe watch the Hudsucker Proxy for on the job training", "label": 0}
{"text": "It's path traced. The light source is a big sphere so that shadows are nice and soft.", "label": 0}
{"text": "You're welcome to research it and add the results to the Wikipedia page.  :)", "label": 0}
{"text": "I had to look it up: NYC 37% immigrant,LA 33% immigrant, Chicago is about 17% and the Texas Metroplexes are in the low 20s. However you count Miami it is over 40% there.", "label": 0}
{"text": "I don't see any ones that include everyone.\n\nThe best I can find is a list of journalists and media workers killed in Mexico, grouped by president: https://en.wikipedia.org/wiki/List_of_journalists_and_media_workers_killed_in_Mexico", "label": 0}
{"text": "\"Damn, I tried to Google that Real Estate band we saw, but it just gives me these house selling nerds.\"\n\n\"Did you try googling 'Real Estate band'?\"\n\n\"Nah, I'm over it.\"", "label": 0}
{"text": "It's actually 4 million. Only 760k of those are women. That's about 3.2 million more than unable to vote than women. That's up to a 2% impact in the context of 150m votes. (realistically less as only a part of those would vote if they could)\n\nThat actually explains a good chunk of the difference. \n\nhttps://www.sentencingproject.org/reports/locked-out-2024-four-million-denied-voting-rights-due-to-a-felony-conviction/", "label": 0}
{"text": "Viewer ship numbers dropping. Plus the public has lost soooo much interest in 60 minute. They do opinion pieces over real interviews.", "label": 0}
{"text": "Please note one of the rules on the sidebar is \"Comments should be constructive and related to the visual presented.\"  Please follow the rules.\n\nIf you don't like certain posts, you can downvote them, and if you like other posts, you can upvote them.\n\nI think this is interesting.  If you find something else interesting, please create your own beautiful data for it and post it.  I look forward to your interesting and beautiful data!  :)", "label": 0}
{"text": "Depends where you live. I had to look it up: NYC 37% immigrant,LA 33% immigrant, Chicago is about 17% and the Texas Metroplexes are in the low 20s. However you count Miami it is over 40% there.\nIt felt like it was more to me too. Not 33% but maybe 20%. \nTurns out it hasn't been this highest since the large waves of immigration in the 1890s and early 20th century. Your guess is good as mine if the United States will enact similar  restrictions in the next few years as was done back then.", "label": 0}
{"text": "Having lived in Los Angeles and other major cities in the US, it's so crazy when I travel and notice 99% of the people are the same race in so many countries.  Then again, that's also true in many more rural areas of the US, and less so in many major cities around the world (although still not as much as Los Angeles, it usually seems).", "label": 0}
{"text": "And that's what made me question the methodology here. I can't believe the Mr. \"Is Our Children Learning\" spoke at a higher level than the former Constitutional Law professor.", "label": 0}
{"text": "True. But feels a little better to know we’re not alone!\n\n..in being alone, ironically", "label": 0}
{"text": "*(In Steven Wright voice)*\n\n\"If someone made a 1:1 scale model of Chicago... how would we know?\"", "label": 0}
{"text": "The whole of Reddit is awash with Propaganda from all round the world trying to influence people before the US elections.  It's nothing to do with if it's interesting or not or do you live in a cave - have you not seen the change in posts recently ?", "label": 0}
{"text": "This is Reddit empathy and common sense are not allowed here.", "label": 0}
{"text": "Haven’t women been the scapegoat of the right since Eve and Jezebel? Incels definitely blame women for everything, but the empty-bed truck driving variety of conservative men often blame every traffic accident imaginable on women. It also seems conservatives even find the women at fault when it comes to sexual assault (what were they wearing?). The right also definitely wants women to be the one’s who are punished for pre-marital sex leading to unplanned marriages.", "label": 0}
{"text": "Thank you. It would be appropriate to factor these into the Voting Age Population (citizens, 18 and over), which would impact the disparity this way (2023): \n\nMen: \n128,490,404 VAP\n- 3,200,000 disenfranchised \n= 125,290,404 net\n\nWomen: \n133,592,630 VAP\n- 764,000 disenfranchised \n= 132,828,630 net \n\nDisparity before\n50.97% W to 49.03% M\n\nDisparity after \n51.46% W to 48.54% M \n\nThese would then go through turnout rate per gender, and, as suggested, should probably be qualified by race (different turnout rates).\n\nNot a lot, but significant. \n\nApologies for any errors. I'm doing this on my phone.", "label": 0}
{"text": "This is reddit, and it shows Trump winning. How is there not 5 million downvotes?\n\nAlso, super nice to see the top comments are math related. Awesome.", "label": 0}
{"text": "Also worth considering is if disenfranchisement was relatively constant (as a proportion of the population) from 1964-2023, in which case the historical trend would be similar.", "label": 0}
{"text": "Some stuff are strange, for example :\n\n- 200min peak for coworkers? Aren't people working more than 3h30 a day in this survey ?\n\n- When retire, you see your partner less than 4-5h a day ?", "label": 0}
{"text": "Unfortunately, not all of that 70% of the population that is in favor of Repdoductive Rights votes.", "label": 0}
{"text": "I am totally down with reinventing how we do hydro and mechanical batteries (like water towers) sound like a good option but batteries are also very harmful to environment and grid scale batteries probably gonna do as much damage to the environment as dams. \n\nHowever completely discrediting dams as renewable energy, especially existing dams seems a bit daft.", "label": 0}
{"text": "appreciating you take the critisism serious without being offended. Getting tired of everything being a subscription nowadays, and I think I am not alone…  \nGood luck with your product.", "label": 0}
{"text": "Which people? City people?", "label": 0}
{"text": "While I'm sure \"fell out of a window\" is a large sub-set of \"fall\", it would have been interesting to see it visually displayed since windows have suddenly become exponentially more dangerous in Russia.  Perhaps, someone could investigate this unusual phenomenon that has no explanation...", "label": 0}
{"text": "I know, right?  Lots of Russians are falling onto carelessly misplaced boxes of bullets these days...", "label": 0}
{"text": "As if I needed another reason never to live in that shitty country.", "label": 0}
{"text": "Probably not. Remember that people work 5 days a week, minus vacations. In addition not everyone work at all some are housewives, on disability, unemployed, in education or otherwise outside the workforce.\n\nAnd some work, but aren't physically with coworkers. BART-ridership in the bay area is only 39% now of what it was pre-covid, most of the reduction is because massive amounts of people have a home-office.\n\nAnd lots of jobs aren't with coworkers much. I'm a bus-driver. I usually spend perhaps 1 hour per working-day with coworkers. (and thus more like 35 minute per day if we include weekends, vacations, holidays, sick-days and so on)\n\nThere's 458 bus-drivers in my company alone. And we all spend most of our working-hours in the company of zero co-workers.", "label": 0}
{"text": "Animations make it impossible to consume the data. Being able to step through the charts manually would be a much better user experience.", "label": 0}
{"text": "Its' really not. The phrasing is just a bit diffrent.", "label": 0}
{"text": "Read as: \"The right wing is the only people who seem to care about me...but fuck them.\"", "label": 0}
{"text": "Too many people die. Is there something special in common between them?", "label": 0}
{"text": "How are you amazed? I’m no Trump fan but everytime I watch Kamala speak she’s such a dud.", "label": 0}
{"text": "I look forward to your non-propaganda posts with beautiful data!  :)", "label": 0}
{"text": "As an analyst: for fuckin' real though.\n\nI'm going to keep this line in mind if I'm ever in the mood to quit my job under hostile circumstances.", "label": 0}
{"text": "Do cities get higher above sea level over time? Like, do the streets eventually get higher up as they pave over, and the foundations of buildings rise above older foundations? I know there's a lot to demolishing old things, but with how the train tracks and a few other things are down 'lower' it makes me curious.", "label": 0}
{"text": "Why did they remove buildings from this dataset?  That seems harder than just leaving them in the measurements.", "label": 0}
{"text": "On the bright side, if MAGA wins we won't need to look at political polls anymore. :P", "label": 0}
{"text": "What if he succeeded? Where would we be living now? Would it be beneficial to open relations on a higher level with Russia so Nuclear War doesn’t happen due to militias within Russia?", "label": 0}
{"text": "Yes definitely the main user base that will by carrying crypto in the near future is remote African villagers", "label": 0}
{"text": "How with an app? Fact that I don't know how and don't see BTC on the self checkout at my local safeway kinda means it's going poorly even if I could install an app and pay a fee to use BTC", "label": 0}
{"text": "Yes you can secure loans to buy real estate through decentralized finance and yes you would hold your savings in a non-custodial wallet. That insurance doesn't cover you for anything that isn't eliminated by being responsible for your own banking. It insures against bank failure, e.g when there's a bank run and people panic because the bank doesn't actually have your money available to withdraw or because they mismanage your funds so badly that they go bust. The bank can't fail when there is no bank", "label": 0}
{"text": "Over millennia yes, Chicago isn’t old enough to experience this naturally besides when they physically raised the city to add sewers.", "label": 0}
{"text": "That's exactly what went through my head. \"Spontaneous combustion. Fell down a well, potato, potato, and impaled on the Chrysler Building...\"", "label": 0}
{"text": "It would be similarly logical to say that Democrats overperformed the polls in 2022, therefore Trump will lose.", "label": 0}
{"text": "I can't find anything in world bank showing something like rates of btc transaction in rural India China or Africa, can you link me?", "label": 0}
{"text": "Good luck.", "label": 0}
{"text": "Oh interesting. I might as well not vote then since you know the outcome.  You gonna bet your life savings on a Harris win?", "label": 0}
{"text": "You responded to my post in less than 10 minutes, meaning you didn’t try very hard.  I don’t have time to spoon feed you data.", "label": 0}
{"text": "The conclusion I see is that best guess still doesn't know, so while the data might be beautiful, it's as if I never saw this animation.  \n\nIn 2016, best guess was Hillary winning, so I think, if the product being sold is how their best guess is better, and not only was it wrong, but 4 years of wrong, consider my confidence in the product eroded. I know that Nate and 538 are 2 different entities now, but either trading on past accuracy is laughable. I would feel more confident about rodents in Punxsutawney guessing the outcome.", "label": 0}
{"text": "Yes I get that. I'm asking you how do you think the right wing cares about you. In what sense?", "label": 0}
{"text": "After going through both a Trump Presidency and Biden presidency, things were considerably better under Trump's leadership, yeah I remember.", "label": 0}
{"text": "Best comment to read on a Friday night. 🤣", "label": 0}
{"text": "No data needs to be a different color. come the fuck on.", "label": 0}
{"text": "It was all over the news here", "label": 0}
{"text": "It’s also really hard to conceptualize population on that big of a scale. Like saying 15% sounds low. But that’s nearly 50 million people in relation to 330-350 million. That’s 1 entire California worth of people lmao. On top of that, while minorities are still… a minority (or immigrant), enough people live in close enough proximity to a sizable amount of minorities (or immigrants) for the population to appear bigger than it is. Like maybe 90% the black people live in east LA for the LA metro, but they travel to different parts of LA, or enough white peoples travel to East LA to think a sizable chunk of LA is black (that’s just an arbitrary example).", "label": 0}
{"text": "Or maybe there is a reason the old gender roles developed that way. I didn't know \"freedom\" was a collapsing birth rate and women being equally exploited by capitalists as men are. Also, Arab countries are very capitalist, yet they still have good birth rates, so capitalism is not the main factor (although it certainly plays a part)", "label": 0}
{"text": " It would be better if it had all the alternative lifespans in the Septuagint, Samaritan Pentateuch, and Masoretic texts.\n\nAlso would be better if it had a little note about how the earliest manuscripts have some of them die at the flood, implying their wickedness. Later manuscripts changed their lifespans so they die before the flood, implying their righteousness. Interestingly, these evil/good ancestors have very similar names to Cain’s descendants. \n\nTo add to this, you could have all the people from Sumerian kings lists who lived for thousands of years. These lists inspired the biblical list and have their own interesting variations.\n\nHere’s a short video by Dan McClellan that covers this:\nhttps://www.youtube.com/watch?v=WEgVBffw2JI", "label": 0}
{"text": "I don’t get it. I haven’t taken a vacation in over 2 years but I want to. Not that I couldn’t but my trip last year got cancelled and then my company had a return to office thing and I was unsure for 6 months if I’d have a job because I wasn’t moving states just for work lmao. The only reason I don’t take time off is because I work from home and most days off would just me sitting on my ass anyways. That said now I can actually plan my 2-3 week trip abroad. Plus I do work vacation where I’ll go to the keys for a week or some shit, or I’m thinking about doing a cross country trip for like 3 months and work.", "label": 0}
{"text": "Correct, but Hillary by and large ignored the Rust Belt. The Dems are hammering the Rust.", "label": 0}
{"text": "No, it's definitely the radical feminism of the women", "label": 0}
{"text": "Yeah they got what they deserved", "label": 0}
{"text": "This is what radical feminists like Shulamith Firestone wanted: the abolition of marriage and family", "label": 0}
{"text": "How is this a disaster? You people are weird. Enjoy your collapsing fertility in your own socieities", "label": 0}
{"text": "And he calls Kamala stupid", "label": 0}
{"text": "\"Well, some of them are built so the front doesn't fall off at all...\"  \n\"Wasn't this one built so the front wouldn't fall off?\"  \n\"Well, obviously, but the bomb didn't help.\"  \n\"The bomb?\"  \n\"Right, the thing that caused the front to fall off.\"  \n\"A bomb caused the front to fall off?\"  \n\"Well, it certainly didn't *stop* the front from falling off.\"", "label": 0}
{"text": "I have the same sentiment. But, as a wise old man once said, \"never underestimate the power of stupid people in large groups\".", "label": 0}
{"text": "That was a wild time. Matching an army against Putin then just… stopping. The day his plane went foomp was not surprising. I wonder if he actually thought he’d get to live.", "label": 0}
{"text": "Not a Harvard student but a top CS school in Canada and we were known to have median income around the 200k mark after graduating (in CAD) which might have been slightly inflated (self reporting) but about 60-70 percent do end up filling it out. It has likely gone down last year or so due to the difficulty in the tech market but after 5-7 years, having a median or especially median income around 400k from top schools is believable.", "label": 0}
{"text": "I had three young college aged women come into my workplace in Georgia today. They are voting for Trump.", "label": 0}
{"text": "Again, I’m looking for sources. [Junior devs are earning a $87k median salary in LA](https://www.salary.com/research/salary/listing/junior-software-developer-salary/los-angeles-ca). \n\n\n\nMy brother is a senior dev and he’s earning around $180k with a security clearance working for DoD in San Diego", "label": 0}
{"text": "That’s exactly what I’m looking at too. The senate races in the swing states are leaning heavy D. In AZ polls say Lake is gonna get whooped but Harris is tied or slightly behind? How??", "label": 0}
{"text": "Nah. There's always some action on soccer. Football is waiting most of the time.", "label": 0}
{"text": "Socialists and communists did not create the productivity gains that reduced working hours: https://www.sciencedirect.com/science/article/abs/pii/S0165188908000997", "label": 0}
{"text": "Fuck Brazil coffee. Won't buy anything from there until they stop fucking the rainforest. Also fuck Chevron for the same reason", "label": 0}
{"text": "Well, that settles it then /s", "label": 0}
{"text": "Retire 20 years earlier", "label": 0}
{"text": "Yeah that's true. Except maybe one small correction, which is that canada calls itself a mosaic rather than a melting pot.", "label": 0}
{"text": "I have a cousin that worked in data science that moved to the Netherlands because he fell for the europoor dream and ruined his life as a result. He was stuck making $25k a year where he could have made a minimum of $75k in America. He also faced tremendous racism and had to live in hostels for months at a time because the Netherlands has a severe housing crisis and landlords refused to rent to a brown immigrant. Meanwhile his friends in LA and NYC make 6-8x more than him, bought large houses, and starting families", "label": 0}
{"text": "Poland is insane. How can you be this far off? Everyone should have some easy reference to get it approximately right, like the amount of non polish kids in a class or kindergarten.", "label": 0}
{"text": "I suppose I have never thought about it this way as we do not have allocated \"sick days\" in the UK. If you are sick you are sick, you can't put a number on that. \n\nAlso get 28 days + bank holidays (8) at my job here, truly hope you end up with more in the future.", "label": 0}
{"text": "Why is your coffee shit then? I haven't drank one acceptable coffee during 2 weeks in all of Florida.", "label": 0}
{"text": "To be fair, people of all political parties are horrendous with guessing actual numbers, Democrats included. The impression I have is that die-hard Trump voters are more likely to believe patently ridiculous conspiracy theories, and reject scientific consensus on issues like climate change.", "label": 0}
{"text": "Cheap shovelware spam. Even stealing the openai logo?", "label": 0}
{"text": "Both of our unemployment rates are about 4%, so that doesn’t appear to be true ", "label": 0}
{"text": "No shit got to make sure all these idiots can understand  him lol", "label": 0}
{"text": "Wait a fucking minute...  Biden's better than him? Fake news", "label": 0}
{"text": "Oh so polls are completely fucking useless.", "label": 0}
{"text": "Talking down to people who eat Waffle House doesn’t win votes. Trying to be the party of sophistication doesn’t win votes with the poorly educated who love the guy who loves them.", "label": 0}
{"text": "[“In every presidential election since 1980, the proportion of eligible female adults who voted has exceeded the proportion of eligible male adults who voted.”](https://cawp.rutgers.edu/facts/voters/gender-differences-voter-turnout)", "label": 0}
{"text": "Sure, and Beanie Babies are nice to look at, and they can be fun to play with or to snuggle with. They may not be the most valuable thing in some Mad Max future, but humans have been investing time and resources to make toys and decorations for millenia. We value them for what they are. \n\nMind you, anything digital will be completely worthless in a Mad Max future.", "label": 0}
{"text": "I would vote against Kamala in the primary. Just like  they do that by being hysterical and claiming it’s serious. Tell them “scientists say.” “And Obama said it too!”", "label": 0}
{"text": "Sure, but you can create a gold-backed digital currency that is infinitely divisible too, which is what a lot actual trades in gold consist of. They don't necessarily move the gold anywhere. \n\nAlso, regular fiat currency is also infinitely divisible, and can actually be readily traded for all sorts of goods and services.", "label": 0}
{"text": "Good catch 🤣", "label": 0}
{"text": "In that case I'll also mention Puerto Rican.", "label": 0}
{"text": "Also 2 bins for African, which isn’t really a nationality.", "label": 0}
{"text": "Also two for Italian, Puerto Rican, and Irish.\n\nAnd what's the difference between \"flower wall\" and \"flowers\" on expenses? And what's that unlabeled square next to flowers?", "label": 0}
{"text": "Also to consider is all the manners of disenfranchisement associated with organized voter suppression techniques (going way back).", "label": 0}
{"text": "Harder to detect automatically.", "label": 0}
{"text": "25% Italian but only 11% Italian :)", "label": 0}
{"text": "Your user name checks out.", "label": 0}
{"text": "Same for Irish", "label": 0}
{"text": "This guys gets it 🤣", "label": 0}
{"text": "Cold wet keeps people inside", "label": 0}
{"text": "Except in Alaska apparently", "label": 0}
{"text": "Why is Canada not reported by province and territory?", "label": 0}
{"text": "Oh, I'm not talking down. I myself will likely gorge myself on waffles this election day. Fortunately, I'll have voted days in advance.", "label": 0}
{"text": "Chicago has 600-800 murders a year. Illinois population is 13mil.", "label": 0}
{"text": "I think my favorite was \"TBD\" nationality", "label": 0}
{"text": "A pie chart made in Excel is about as ugly as data can get...", "label": 0}
{"text": "Well that's a new location for Hawai'i.", "label": 0}
{"text": "Agree was just having some fun", "label": 0}
{"text": "I still want to hear more about the robot", "label": 0}
{"text": "With slices that don't follow any kind of size order clockwise.", "label": 0}
{"text": "I can't for the life of me figure out what a wedding robot is. I'm imagining C3PO performing the ceremony.", "label": 0}
{"text": "That sounds like the opening to a bad joke", "label": 0}
{"text": "Soon Hawaii will be a Canadian province. ", "label": 0}
{"text": "Possibly issues with super low populations in some territories causing outliers? I agree that that would be a bit more insightful though.", "label": 0}
{"text": "Because it would sweep the lowest category (after Cuba).", "label": 0}
{"text": "No food at a greek wedding?", "label": 0}
{"text": "Arabic and African, as nationalities.", "label": 0}
{"text": "Great for you, but please don't share in that case.", "label": 0}
{"text": "Juarez and Tijuana doing heavy lifting here.", "label": 0}
{"text": "Please explain how you think tariffs would decrease the price of phones. Apple will have to pay those tariffs when importing their phones or parts, and they will pass those costs onto consumers, increasing the price of phones. \n\nYou don't think I've seen what Trump did to calm down international relations, and neither have you, so we have irreconcilable differences of opinion on this matter.", "label": 0}
{"text": "It’s a person in stilts in a giant robot costume that comes out and sprays Co2 on people and then you join", "label": 0}
{"text": "Oh, look. Country with stricter firearms laws has highest incidents. \n\nLove how laws make lawbreakers comply. \n\nhttps://www.mexperience.com/mexicos-strict-gun-laws/", "label": 0}
{"text": "See below comment 🤖", "label": 0}
{"text": "Maine is the lowest in the US but has the same colour as Canada and most of the northern US.   So the gradients aren’t fine enough or the legend is off to the highest/lowest places listed.", "label": 0}
{"text": "Almost 90% of the weapons used in crime in Mexico come from the US.", "label": 0}
{"text": "Ah yes, my favorite nationalities: Jew, African, Arabic", "label": 0}
{"text": "That's even more strange", "label": 0}
{"text": "Walk into a bar ?", "label": 0}
{"text": "Arresting a criminal with several indictions is undemocratic?\n\n>pack the Supreme Court\n\nYou mean like the Republicans?", "label": 0}
{"text": "Operation fast and furious, gotta arm our cartels down south to make that drug money", "label": 0}
{"text": "\"*excludes suicides\"\n\n\nHow much does it change if suicides are included?", "label": 0}
{"text": "Neither is \"Jew\"", "label": 0}
{"text": "This is awful on so many levels and needs to be down voted to oblivion.", "label": 0}
{"text": "I have several questions.\n\nWhy is everything itemized except for the omnibus category of “DJ/ROBOT/FLOWER WALL/SPARKLERS”? Do those all go together somehow? Was the robot deejaying or responsible for the flower wall? And what the hell is a flower wall, and why does it need robots for maintenance and a DJ for ambiance?\n\nAlso, I notice both “dress” and “makeup” are on the list of categories but not on the graph. Was the dress free? Did the bride decide to not wear a dress? Was there not a bride at all? Would this explain the lack of makeup? And, if so, why would there be categories for both that is unallocated? Did you plan on marrying a woman but ended up not doing so?\n\nSpeaking of unallocated categories, what is the magenta category without a name? Is that the super-secret “illegal drugs” category or something? Why is there no allocation of illegal drugs? Did you plan on tracking the drugs separately then just put them under Afterparty?\n\nAnd how exactly are you tracking guest nationality? Was it on the RSVP card under “number of guests?” Did you guess? If someone has more than one nationality, do you just choose one or put them under multiple categories? And why does Greek have two columns, along with Italian and Puerto-Rican? Are they differentiating between “Normal Greek” and “Over-the-top My Big Fat Greek Wedding Greek?” Is it between “Regular Italian” and “Jersey Shore Snooki Italian?”\n\nFinally, as far as the people with TBD nationality, do they know their own nationality? Are you waiting on 23-and-me to find out? Did you require all your guests to do genetic testing to ensure the validity of your nationality data? Or are you just guessing nationalities based on last names and vibes? Or did you hire a psychic who is still “working on figuring out that group?”", "label": 0}
{"text": "Most of these are suicides", "label": 0}
{"text": "Are you purposefully ignorant or is there still hope?", "label": 0}
{"text": "Cuba is so different from its neighbors", "label": 0}
{"text": "The <25 lowest threshold is too high, so all of Canada gets the same rating. You would have to get down to low single digits to have any variance.", "label": 0}
{"text": "Ah I see. That also explain the %", "label": 0}
{"text": "DJ is all in one package which comes with a robot aka a person on stilts dressed like a robot that shoots co2 at people. The wall flower is a beautiful wall of flowers that will sit behind us, and lastly the sparklers are set up in front of the DJ boot to give it that rave feeling. I like your input about differentiating Italians  because there are definitely a few that you mentioned.No comment regarding illegal substances as I am high on life. But yea this is going to be one hell of a party 🥳", "label": 0}
{"text": "So, what you are saying is that gun laws only work to disarm the law-abiding citizens and not the criminals.  Got it.", "label": 0}
{"text": "That's not what they're saying - they're questioning why there are no divisions between the territories. Canada is just one big blob, instead of the individual providence. It would be like the US having no state lines.", "label": 0}
{"text": "seems like the greatest threat for gun violence is the cartel 😬", "label": 0}
{"text": "This is where I would post that meme of the guy in class with vein on forehead labeled “tankie”", "label": 0}
{"text": "Yes, well, drawn in the lines all you like they will still be all the same colour because the threshold is too high to break out province-by-province.", "label": 0}
{"text": "I’m not sure how you got to that conclusion. Guns are legal in Mexico. Federales and their families get murdered if they go against the cartels.", "label": 0}
{"text": "I think they count suicides in the calculation.", "label": 0}
{"text": "But why?", "label": 0}
{"text": "Then most of them are gangs", "label": 0}
{"text": "Not no-one, but the US/Mexico are so bad it looks like it. 25 deaths per million (the smallest threshold) is a very high rate globally.", "label": 0}
{"text": "Thresholds are misleading", "label": 0}
{"text": "Canada *is* one big blob?", "label": 0}
{"text": "Jacks overlay average skin fairness", "label": 0}
{"text": "You're sort of right, but not actually at all. Correlation is not causation.\n\nMexican police are corrupt as hell. Doesnt matter what the law is if it's not enforced.\n\nMost of the guns in Mexico are bought legally in the US. Imagine what happens if the US makes those legal purchases illegal and the cartels suddenly have to work a lot harder to get their guns?", "label": 0}
{"text": "On most of these charts you would be correct but on this one they did the right thing and excluded them. Look on the bottom right for the notation", "label": 0}
{"text": "That’s not the point the missing lines miss lead the eye.", "label": 0}
{"text": "I guess we're not trying hard enough.", "label": 0}
{"text": "According to data from the CDC and various research sources, around 54-56% of gun deaths in the United States are by suicide,", "label": 0}
{"text": "You know how statistics work right? You don’t look at one outlier and make a conclusion out of it.", "label": 0}
{"text": "Yea strange", "label": 0}
{"text": "IIUC there is no uniformity in reporting suicide gun deaths, which is a shame b/c a chart that includes suicide gun deaths is of great import for public health concerns", "label": 0}
{"text": "Where do all the guns come from?", "label": 0}
{"text": "Authoritarian regimes tend to have low violence (between citizens).", "label": 0}
{"text": "Just looked it up. Top 5 in order are Alabama, Idaho, Wyoming, Montana, Alaska. So no gun ownership and gun deaths are not correlated.", "label": 0}
{"text": "I'm one big blob in Canada. Is that close enough?", "label": 0}
{"text": "I wonder why there is a drastic decrease moving upwards... o_o\n\nFor real though, this does explain a load of border policy and why people from northern and more populous areas do not understand the policies.", "label": 0}
{"text": "There doesn't seem to be an indication for a correlation, let alone causal link between levels of legal gun ownership and the level of gun homicides.\n\n If you look at the 2015-2019 state gun homicide data from the CDC and compare it with comparative state gun ownership data from the world population review, you see that the in the 15 states with the lowest gun homicides 10 of them have gun ownership rates over 40%. 4 have ownership rates over 50% and one has ownership over 60%. Within this bottom 15 you also have 5 states with 25% or less gun ownership, and 3 with sub 15% ownership rates. So of the 15 states with the lowest gun homicide rates, 10 have very high gun ownership rates, and 5 have very low ownership rates; yet the gun homicide rates in each of these 15 states is very similar and very low.\n\nTo put this in perspective, the States of Maine, New Hampshire, Vermont, Idaho and North Dakota are 5 of the states with the lowest gun homicide rates, while all having gun ownership rates which vary from 40%-60%. Their gun homicide rates are similar to those seen in Canada, Norway, Switzerland, Sweden, Italy, UK, and several others.", "label": 0}
{"text": "I think the problem here is you’re looking at this from a different perspective than the person who asked the question. I think the person who asked the question probably just likes well done maps, and you like well shown data. Putting the providence lines in doesn’t change the data presented at all, however the redditor asking the question may have autism or be on the spectrum to some degree and it’s like having a rock in his shoe seeing US, and Mexico State lines, but not seeing Canada divided up by its providences. However I’m projecting right now only because I’ve had this argument before on Reddit so take it with a grain of salt.", "label": 0}
{"text": "Fine. I'll say it.\n\nWyoming and Idaho are less than 1% black.", "label": 0}
{"text": "Mexico is essentially a failed state, they can’t actually enforce most of their laws. Furthermore, most of the guns in that country are illegally smuggled in from the US. They come from us, if we made less they’d also have less.\n\nIf you look at actual functioning states it’s pretty obvious that guns increase levels of violence. You can even see it here on this map: the safest part of the US (the northeast) also has very strict gun control laws. And the least safe regions have very lax gun control laws.", "label": 0}
{"text": "Yea there’s an idea that if we give everyone or almost everyone a gun there will be little to no crime because criminals admit that they will avoid a target if they think they have a gun. So if we even give the illusion that everyone has a full then they won’t hardly fuck with anyone. Because you’re not getting guns out of criminals hands so you go to the other extreme but if we went that route we’d need to teach gun safety in school", "label": 0}
{"text": "Yeah this is apples to oranges. I think any sane person would say that violent lawlessness is a bigger problem than loose gun laws. So far we're priveleged in the US to rarely experience the former. \n\nStudies from WWII have found that the bulk of atrocities, civilian deaths etc came in [lawless regions of Soviet territories](https://researchportal.murdoch.edu.au/esploro/outputs/graduate/Lawlessness-in-the-occupied-Soviet-territories/991005542125407891), this offers a good, and horrifying, example of these situation at its extreme: \n\n>  Both the German and Soviet regimes can be understood to have deliberately undermined the restraints that would have helped prevent these crimes from occurring. Judicial restraints were nullified with the war on the frontlines distancing itself from international law and the norms of war. Psychological and moral restraint was undermined with both regimes' official ideologies conceiving of the occupied civilians as innately criminal. Finally, a further aspect of judicial restraint was countered as fighters were not heavily punished for individualistic crimes against the civilian population.\n\n> With these restraints removed, the overwhelming picture of the rear areas is one of lawlessness. Fighters from both forces of the security war had absolute authority over the occupied civilians and often exploited them to a horrific degree. Both forces can be seen as having converged against the civilian population and a full understanding of the occupied experience seems incomplete without recognition of this. This convergence also highlights similarities between Nazi Germany and the Soviet Union with both, otherwise-opposed, ideologies manifesting themselves in comparable ways in the rear areas.", "label": 0}
{"text": "If you took each state and shaded the areas within the state where the bulk of the gun related deaths are happening it would be in the cities where the population is and if you took a look at the cites more closely you'll find most the deaths in the cities is clustered in the poorest neighborhoods.   The states that are shaded darker like Missouri (St. Louis) Louisiana (New Orleans, Baton Rouge) Tennessee (Memphis) have higher rates of gun deaths because of criminal activity and gangs clustered in the ghettos.   A state like Idaho has a high rate of gun ownership but low rates of gun deaths because the state doesn't have cities that have demographics anything like Memphis or St. Louis.  Same goes for Maine.", "label": 0}
{"text": "I thought this was going to be about cost per guest, ie local guests pay x amount, international guests y amount, out of town z amount.\n\nI was disappointed on so many levels.", "label": 0}
{"text": "And the guy you responded to has none.", "label": 0}
{"text": "It should be. I've got to imagine the shooting numbers in Ontario are quite different than PEI.", "label": 0}
{"text": "is there a disaggregation based on ethnicity/race?", "label": 0}
{"text": "It's gun ownership coupled with high population density that causes gun deaths. Either one by itself is not a big problem.", "label": 0}
{"text": "And that wasn't a problem for the highest category because?", "label": 0}
{"text": "Wierd. Based on how Republicans talk you'd think Illinois would be dark red.", "label": 0}
{"text": "Relative to basically every other country in the world, US gun deaths are incredibly high. Especially when filtered for “developed” nations.", "label": 0}
{"text": "No, it doesn't have any impact on the information or how it is received.", "label": 0}
{"text": "Gun violence in Mexico is due to greedy, corrupt, sociopath scumbags on both sides of the badge.", "label": 0}
{"text": "Absolute proof that higher average annual temperature drives gun violence. ", "label": 0}
{"text": "What issues exactly do you think women ruined around 1980?", "label": 0}
{"text": "So is Montana", "label": 0}
{"text": "This is false. Canada has fewer stabbings per capita than the USA.", "label": 0}
{"text": "Diagnosing someone with autism because they dislike shoddy cartographic choices is peak Reddit. This is a bad map.", "label": 0}
{"text": "You should take a look at which states have the strictest gun laws and see if there is a correlation with homicide rates there", "label": 0}
{"text": "In NH it's wicked easy to get a gun and we are constitutional carry.   We have less gun violence than almost any state.", "label": 0}
{"text": "Is this “gun death” including suicides? Or it’s it just homicides?", "label": 0}
{"text": "Ultimately most of the weapons are manufactured in the US, is the point\n\nIn a way the US is exporting violence to Mexico. But since it is big bucks at home, few will care. Just like few care that the big Tobacco companies from the southern US sue african nations with GDPs lower than their annual revenue into not illegalizing smoking advertisement. Smoking rates are increasing at an exponential rate in the third world, and it's great business for us. We know it gives us cancer, so we don't want it here, but them? Nah, they're dollars for us.", "label": 0}
{"text": "I don't know about the others, but women were more likely than men to vote against Trump.", "label": 0}
{"text": "They’re becoming less rare especially in Chicago Birmingham Los Angeles and New York. All of these places with the strictest gun laws.", "label": 0}
{"text": "How? Is voting at all against their self-interest? That winners are against women's interests could be a minority of women voting with most men.", "label": 0}
{"text": "> the polls are sickeningly toward Rump at the moment.\n\nThe polls are incredibly even, which is sickening, but it doesn't sound like you thought that.", "label": 0}
{"text": "I heard an interview on NPR this last week of a Haitian immigrant who was living in Tijuana, and she was very happy because it was so much safer than Haiti is right now.", "label": 0}
{"text": "Guns and money from the US *war* on drugs.", "label": 0}
{"text": "No; some women can vote with most men to elect people most women don't want.", "label": 0}
{"text": "Yeah, here in Maine it's too cold for killing. Imma stick with watching Netflix by the fire.", "label": 0}
{"text": "https://www.nbcnews.com/health/health-news/map-gun-death-rates-lower-cities-than-rural-counties-rcna81462", "label": 0}
{"text": "It’s real content but yes this was meant to spark some laughter 😂 but seems like this is the wrong audience", "label": 0}
{"text": "The entirety of Mexico doesn’t have >400 deaths per million so I’m not really sure why you think it’s the same for the highest category", "label": 0}
{"text": "I dont think this data is beatiful...", "label": 0}
{"text": "It's already scaled to per capita. And maybe needs an additional lower cohort.", "label": 0}
{"text": "America has not made sense for a while.\nPeople still play with guns and are allowed to do so despite the staggering amounts of school shootings ", "label": 0}
{"text": "4000 nationally is still nothing compared to 6000 in one city. Do you have better data? Because by the data that exists Cullman has a higher homicide rate than New York. What has you convinced that New York is more dangerous than your community?", "label": 0}
{"text": "Shows how powerful radcist xenophobic propaganda is, can't speak on the other countries but I imagine the precieved number would be a lot lower if fox News and Republicans didn't spend millions to convince Americans they are being \"replaced\"", "label": 0}
{"text": "Do you have any examples of issues that Republicans make you feel they care about?", "label": 0}
{"text": "Does that mean OR and WA are going to move to Canada as well?\n\nHonestly, I relate to a Canadians a lot better than I do people in the SE…", "label": 0}
{"text": "They’re an authoritarian socialist state. Socialist states of any stripe, but especially led by dictators, tend to disarm their citizens whenever possible.", "label": 0}
{"text": "The lower per capita is what would cause the outlier, if there was just one gun death in some of them it may appear orange on the map", "label": 0}
{"text": "Looking into that.", "label": 0}
{"text": "Hello /u/Jazzlike-Ad5884! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gclvyk/dutch_poll_showing_what_voters_of_certain_parties/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gclvyk/dutch_poll_showing_what_voters_of_certain_parties/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "I’m a teacher in Texas. I get 5 sick days and 5 personal days per year. I can only take 2 at a time without getting permission but I get the whole summer, spring break, thanksgiving ect off. It makes is super easy to travel in the summer (when everyone else is) but really hard to travel when I want (in the off season)", "label": 0}
{"text": "Didn't he rape a kindergarten class in front of their families or something?", "label": 0}
{"text": "And what portion of that growth is by immigrants? A lot are citizens reloading for work as well.", "label": 0}
{"text": "JP, love your stuff but in this case the image is way too pixelated to read!", "label": 0}
{"text": "I've rarely seen rival NFL fanbases as united as last week when Watson popped his ACL.", "label": 0}
{"text": "Polls just measure what people say. They re probably pretty accurate at finding out what people think. What they seem to fail at IMO is predicting who actually shows up on voting day and votes. Do we have any data on turnout between GOP and Dem voters?", "label": 0}
{"text": "Hmmm. I wonder what I can do to fix that. Let me try to adjust. Thanks!", "label": 0}
{"text": "He was accused of asking for handjobs from girls giving him massages.", "label": 0}
{"text": "Yes,  but that discrepancy is not evenly distributed. Men still have a slight edge among 18 to 24-year-olds, and  25 to 44-year-olds are practically 50/50. It's only in the upper ages when women outlive men, and even though older people generally vote at the highest rates, they are also a shrinking population. \n\nPerhaps a better metric is turnout percentage. Women have been bettering men in that category.", "label": 0}
{"text": "Love this visualization. Manually made or a template?", "label": 0}
{"text": "Thank you. I made it in excel, it’s part line graph with large circles for the datapoints, and part brute force (the triangles).", "label": 0}
{"text": "Very cool. Nothing better than getting gritty on excel", "label": 0}
{"text": "So it was a bad deal then? That's that the data show", "label": 0}
{"text": "You miss 100% of the shots you don’t take", "label": 0}
{"text": "You can use talkspace on the toilet too", "label": 0}
{"text": "Really bad deal, and a huge PR hit for investing everything in a guy who had 24 sexual assault accusations.", "label": 0}
{"text": "Anyone who's not an executive with the Browns wants to see Watson fail. It's been amazing.", "label": 0}
{"text": "Not only is it a bad deal, it's comically bad.", "label": 0}
{"text": "Probably workers feel more pressured by time and less pressured by a negative reaction from a customer since they aren't there.\n\nLike, there's some real psychology here. If people go out of their way to avoid awkward situations in face to face and even ok the phone interactions.", "label": 0}
{"text": "I think it might be a misunderstanding, the author might be using Density to refer to probability density", "label": 0}
{"text": "This is nice dude! How did you make this? I’ve wanted to make a timeline of events on a single x-axis?", "label": 0}
{"text": "Dieticians hate this one simple trick!", "label": 0}
{"text": "It is probability density I think", "label": 0}
{"text": "Iirc this was the brainchild of the guy moneyball was based on, guess he should have stuck with baseball", "label": 0}
{"text": "Looks like he's just not the same without those \"massages\".", "label": 0}
{"text": "Wtf does weight vs density even tell you, also where is this data coming from?", "label": 0}
{"text": "It is, if you eyeball the average height to be about 0.002, then multiply by the distance on the bottom (1000-500=500), you get about a value of 1. This is very rough, but the actual area under each curve and extending beyond the visible area should be exactly equal to 1.", "label": 0}
{"text": "Probability density", "label": 0}
{"text": "This is the quest trade in sports right? This trade set up three other franchises with big pieces", "label": 0}
{"text": "It’s not always negative pressure.\n\nWhen I was younger there was a local chipotle I ate at a ton, usually right after workouts.\n\nMost of the serving line was staffed by girls/young women around my age. \n\nI was a huge flirt, and I got treated well for it.\n\nNo one is giving me an extra big scoop of chicken so they can say things like “it’s so big!” when I order online.\n\n(Note: this only works in my experience if you’re a big flirt, not a creep. When you start actually hitting on people the dynamic changes)", "label": 0}
{"text": "Soccer players run the most/furthest out of any sport that’s not a marathon, lol.", "label": 0}
{"text": "The Browns are getting what they deserve. Unfortunately they have a insurance policy out on Watson so they'll get cash and cap space for this injury. Would have been better karma for him to just continue sucking.", "label": 0}
{"text": "by many accounts it's the worst player deal in the history of the NFL", "label": 0}
{"text": "Need a time value also. If workers during the day load up be night crew", "label": 0}
{"text": "And it STILL has ten time the excitement of your average soccer game", "label": 0}
{"text": "It's completely true, and your circle jerking down ote buddies don't set reality by clicking that arrow", "label": 0}
{"text": "No, it's nothing of the sort, but some people are too stupid to follow anything more complicated than \"no touch ball with arm, kick ball in net\"", "label": 0}
{"text": "Why would any of them be saying it’s so big while literally working?", "label": 0}
{"text": "Reddit is an American website. ASSOCIATION football, shortened to soccer by the English, is 90 minutes. GRIDIRON football, by far the most popular code in America, is a 60 minute game. ", "label": 0}
{"text": "it would be nice to see the %age of games won without him in the team. maybe he improves the team.", "label": 0}
{"text": "Hello /u/gfdsa98123! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gcp24s/for_olympic_gold_how_much_do_nations_pay_their/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gcp24s/for_olympic_gold_how_much_do_nations_pay_their/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "Excel, then a little TLC with text boxes and formatting.", "label": 0}
{"text": "I never wish injury on people but it’s pretty hard to feel bad for either party.", "label": 0}
{"text": "People say this but it's not reflected in voting yet. Millennials are still more of a conservative voting bloc than Gen Z. \n\nI think Millennial conservatives just move in silence more so.", "label": 0}
{"text": "NGL, it really does make me feel better about the Russel Wilson trade/contract as a Broncos fan.", "label": 0}
{"text": "Perhaps but young men mostly don't vote. Zoomers were the most Left leaning voting bloc in the midterms to the point where Republicans like Vivek threatened to raise the voting age. \n\nI think people confuse edgy contrarianism for actual GOP support. It's common for men who big up Trump for entertainment value or being he pisses off certain people while not actually wanting to vote for him. \n\nNon-voters ironically have some of the strongest opinions on politics whereas a lot of actual GOP voters move in silence and love to claim that they \"hate talking about politics.\"", "label": 0}
{"text": "Unless it's a different image now, I think this might be a problem at your end. It's perfectly readable to me.", "label": 0}
{"text": "Damn at this failure rate someone will make him a CEO", "label": 0}
{"text": "In terms of actually voting for Trump? Definitely not. \n\nAnd the ballots will show that Gen Z men will be casting the least votes for Trump in this election just as was the case in the midterms(hence why Vivek threatened to raise the voting age). \n\nIn terms of ironically liking Trump for being a brash asshole who very memeable and almost cartoon-like? Yes. Many young men who find Trump endearing in that way even though it doesn't necessarily result in actually voting for him. \n\nTrump is like a trainwreck edgelord who brings entertainment value to politics. Many young men like this aspect about Trump while disagreeing with many of his actual policies.", "label": 0}
{"text": "It's a bit more than that.....", "label": 0}
{"text": "You’d be surprised by how much unconscious biases perpetuated by socioeconomic problems, misinformation and conspiracies can influence perception.", "label": 0}
{"text": "It barely does that. It just shows an example of the size of a median income for one example.", "label": 0}
{"text": "I remember. Same colors too?", "label": 0}
{"text": "Is that something you can do on standard reddit? as i dont think you can even block subreddits so i dont know how to do keywords", "label": 0}
{"text": "My american brain just can't comprehend left represented with Red and Right represented with Blue!", "label": 0}
{"text": "Well, in theory, you could win almost any election with just one vote, if there is a single voter. This isn’t terrible, it’s just a “gotcha”. None of this happen in reality.", "label": 0}
{"text": "Really good map of what the only reason the system seems to be fine is that the big states and small states just don’t align with each other \n\nNH, VT , HI ME and DE cancel out ND, SD, WY, AK and MT approximately and CA and NY are cancelled out by TX and FL approximately ", "label": 0}
{"text": "i have no idea what you are trying to show here.", "label": 0}
{"text": "Anyone who wins NY and Texas is 100% winning the popular vote as well.", "label": 0}
{"text": "Maybe your phone hot a weird virus bro", "label": 0}
{"text": "In most elections you can win with one vote if only one person votes.", "label": 0}
{"text": "France seems quite left but is painted mostly far right. Are urban centers left, is that it?", "label": 0}
{"text": "It's not how the election for president is decided, correct.\n\nBut the popular vote shows how \"popular\" a candidate is and it's kind of ridiculous that the EX is still being used to decide a very important election in the US still. It made sense in the beginning but not anymore.", "label": 0}
{"text": "Texas is the second most populous state.  This map doesn't even make sense to me.", "label": 0}
{"text": "I guess I just expect a data sub to not use data in a misleading manner.  I guess that's secondary to pushing OPs viewpoint.", "label": 0}
{"text": "How did you figure out it is these states? Knapsack algorithm?", "label": 0}
{"text": "Classical case of \"land doesn't vote\"", "label": 0}
{"text": "Not necessarily", "label": 0}
{"text": "About 10% Americans live in Texas.    :/", "label": 0}
{"text": "Crazy compared to American map with two colors", "label": 0}
{"text": "Yep!\n\n1. California (54/54)\n2. Texas (40/94)\n3. Florida (30/124)\n4. New York (28/152)\n5. Illinois (19/171)\n6. Pennsylvania (19/190)\n7. Ohio (17/207)\n8. Georgia (16/223)\n9. North Carolina (16/239)\n10. Michigan (15/254)\n11. New Jersey (14/268)\n12. Virginia (13/281)", "label": 0}
{"text": "You need 50% + 1 vote in (most) US states to sweep all their electors for the presidency. Smaller states have more electors than their population, so you can “efficiently” get electors by winning half of the votes in the smaller states. Throw in a couple of the bigger ones and boom, efficiently winning the election with the minimum number of voters.", "label": 0}
{"text": "Or do like I do for the cowboys and hope they lose so when they win it's almost disappointing", "label": 0}
{"text": "Actually no, in parliamentary systems, you need to at least get a vote in every circunscripction", "label": 0}
{"text": "He officially settled more SA lawsuits than he threw TDs this season.", "label": 0}
{"text": "For a long time left / socialist parties had red colored flags. Which makes it the color for left leaning parties in a lot of European countries. Somehow the gop didn’t get the memo.", "label": 0}
{"text": "Every fan didn’t see it. There were tons of aggressive supporters of Deshaun and supporters of the decision on r/NFL.", "label": 0}
{"text": "It makes absolute sense and only those blind to what's actually required to hold a republic together would say otherwise. You literally have to ignore 5000 years of human history to think that a system where NY, LA, Chi, Philly, etc get to decide what the rules are going to be for, Wyoming, Ohio, Indiana, etc has any chance of ever succeeding.\n\nPopular vote would break the republic in 20 years.", "label": 0}
{"text": "Fuck the countrieside, I guess. Sad to see France going back to what it always has been.", "label": 0}
{"text": "Was going to say the exact same thing. This makes no sense", "label": 0}
{"text": "You can see the border between East and West Germany and the 1914 border between the German Empire and Russia in Poland.", "label": 0}
{"text": "The sub is slowly becoming r/politics but with more charts", "label": 0}
{"text": "I mean if most people are far-right how come they let their president do thing as horrible as promote abortion as a \"right\" on the EU level?", "label": 0}
{"text": "Utah and NY would never vote for the same candidate so no, it's not a path to the presidency.", "label": 0}
{"text": "What's even more interesting is that the cultural exclaves don't always align with the culture back home. Like Hungary is deep blue, but the Romanian Hungarians are solid black, even those right over the border.", "label": 0}
{"text": "No, you can see the dominance of [RMDSZ/UDMR](https://en.m.wikipedia.org/wiki/Democratic_Alliance_of_Hungarians_in_Romania) in the Hungarian populated areas of Romania.", "label": 0}
{"text": "It exists for a reason, stop regurgitating whatever the current headline on r/politics is", "label": 0}
{"text": "If it helps, blue is just because there's a few far right parties that chose it (AfD for example) though I agree, a different color (brown) would've been a fitting choice too.", "label": 0}
{"text": "America is pretty right and likes blue, the Soviet Union was pretty left and liked red. In fact nearly every communist country or movement ever had a red flag. It's kind of their thing.", "label": 0}
{"text": "I love all the comments about how billionaires can’t just suddenly find 10 billion dollars to use. \n\nLike musk didn’t spend $43,000,000,000 buying twitter with his personal money. \n\nOr like bezos didn’t sell $5,000,000,000 of stock in a single day. (https://www.bbc.com/news/articles/c51yvm3354qo.amp)\n\nThey absolutely can use the majority of their wealth whenever they want. You’re just parroting a lie they like to spread.", "label": 0}
{"text": "He has been accused of full on rape.", "label": 0}
{"text": "I am progressive (so pro-choice) and the thing is...they don't, the RN is generally really conservative (they voted against this, at pretty much every occasion). Also the european elections have among the worst turnouts in France so less representative of the general opinion than the legislatives.", "label": 0}
{"text": "4 colors. Right (tradition, family values, security), Left (help the country by helping the people), Liberal (help the country by helping the economy) and Green (help the country by helping the environment).", "label": 0}
{"text": "Even with that in mind, it's interesting to see the regionalisms.", "label": 0}
{"text": "it's possible to elect a president with any non-zero percentage.but if you want to have a lower number,  you would group TX, CA, NY, and FL together, not this strange mishmash. you can argue that TX,CA,FL, and NY is unrealistic. which is true, but  if you want to be more realistic, the percentage is going to be much higher than 14%. this map just picks a random cutoff and a random percentage.", "label": 0}
{"text": "I think that the map is assuming 100% voter turnout. So even if 100% of people vote, one candidate could still win with only 14% of the vote. \n\nIs it realistic? No. Is absurd that this is even a possibility? Yes.", "label": 0}
{"text": "What exactly makes this OC? Translating the factions to English? Apart from that, it is clearly just directly taken from „Die Zeit“ newspaper: https://www.zeit.de/politik/ausland/2024-07/europawahl-2024-ergebnisse-gemeinden-laender-karte", "label": 0}
{"text": "I understand why it exists and why it made sense for the beginning of this country, but it doesn't make sense now and it'll make less sense in the future.", "label": 0}
{"text": "I mean yeah it could be more clearly presented for sure but it’s not hard hard to make sense of what it’s trying to say given the context of the election.", "label": 0}
{"text": "Dams can in fact emit the same CO2 equivalent/kWh as coal plants. Dam greenhouse gas emissions occur from the previously lush green river valleys getting flooded and all that greenery decomposes which creates methane emissions. The amount of CO2eq/kWh depends on the local climate/vegetation, flooding a valley in a desert climate creates less emissions than flooding a valley in a rainforest.", "label": 0}
{"text": "The only exception is that blue eggplant there in Utah, because there's almost nothing from Utah County until Washington County, but the posted highway speed limit is 80 and it's really strictly enforced. They catch you go 83 in Fillmore and you'll be facing a $100+ ticket.", "label": 0}
{"text": "Hydro is not \"low carbon\" depending on the local environment. Dams in the desert, not so much. Tropical dams? Those are killers.\n\n>Steinhurst et al. (2012) [36] estimated that\ntropical reservoir-based dams could emit 1,300-3,000 g CO2 eq./kWh, compared to 400-500,\n790-900, and 900-1,200 g CO2 eq./kWh for thermoelectric plants using natural gas, oil, and coal,respectively. Similarly, Fearnside (2015) [37] compared the hydropower generated from the Petit\nSaut Dam (French Guiana) with electricity generated from combined-cycle natural gas, and\nfound that the GHG emissions from the dam are 19 times higher than the natural-gas-based\nelectricity.", "label": 0}
{"text": "Holy shit, that's the stupidest fucking video I've seen this week.\n\n*\"The electoral college (in the real world) creates geographically diverse coalitions of states, moves power to the state level which is good, and has always represented the will of the people in each state... BUT in my imagination everyone could move to California and the electors could override the will of the people, so we should throw it all out\"*\n\nJesus fuckin Christ!", "label": 0}
{"text": ">And the stupid argument that hydro isn’t good for the environment and thus shouldn’t count is obviously idiotic.\n\nOkay, but the goal is reducing greenhouse gas emissions, hydroelectric dams *can be* as bad as coal plants depending on the local environment for GHG emissions.", "label": 0}
{"text": "Basically.  \n\nAlso, something exceptionally weird this year is how stable the poll averages have been.  Harris & Trump's national poll averages, since Labor Day, have moved around by less than 0.75% from top to bottom, that's really weird and very tight range ... historically in this time period you would expect to see much larger moves week to week.", "label": 0}
{"text": "It doesn't say that in the video", "label": 0}
{"text": "He borrowed the majority of the money, not just his own. Look up the deal. Lots of companies invested. Here’s the complete list:\n\nhttps://www.newsweek.com/full-list-investors-elon-musks-x-revealed-court-filing-1942970", "label": 0}
{"text": "And 90+% of the time there's nothing interesting happening on the pitch", "label": 0}
{"text": "Okay boss", "label": 0}
{"text": "Ha, wasn't really going off.  I stand corrected", "label": 0}
{"text": "Yeh, Turkey definetely isn't 100% Muslim, at most 80-90 percent. Atheism is very prevalent in the west.", "label": 0}
{"text": "I don’t thinks he is calling the country muslim but I agree with you on your first point.", "label": 0}
{"text": "Leaders in women empowerment.", "label": 0}
{"text": "Complete protection from UV exposure for the women.", "label": 0}
{"text": "i could definitely live without all religions", "label": 0}
{"text": "you should start one", "label": 0}
{"text": "There might be exceptions in the long tail of the distribution but considering the median carbon equivalence of hydro is lower than solar I think it is fair to call hydro low carbon.", "label": 0}
{"text": "Except Turkey", "label": 0}
{"text": "Look at the happiest, least dysfunctional nations.", "label": 0}
{"text": "He didn't spend $43b of his personal money.  As others have stated, he borrowed a lot, took loans, and sold billions in Tesla stock.  Which screwed over a lot of retail investors as the public sale seriously diminished the stock price and value of options.", "label": 0}
{"text": "Happy for you man", "label": 0}
{"text": "With our current immigration policy, Canada should be on here in a few years.", "label": 0}
{"text": "A lot of billionaires have wealth that isn't liquid.\n\nBut to address what's really bothering you... Billionaires deserve their wealth because they are significantly smarter than you.", "label": 0}
{"text": "hot temperature", "label": 0}
{"text": "Rurality and population density doesn't seem to be associated either.", "label": 0}
{"text": "Again on the international relations front, do you not see that nothing you said was fact? It's all assumptions and \"this would happen if democrats were in charge\" when you obviously know this is a bad faith argument that is impossible to support with actual evidence. Trump admires kim jong un, putin, and the taliban for their \"strength\", and that doesn't concern you? \n\nAnd lets continue talking tariffs. Read this and lmk your thoughts https://taxfoundation.org/blog/international-trade-commission-tariffs/\n\nAside from all of this I do want to add that Trump continuously refers to people who do not support him as the enemy within, and has said he would prosecute and sic the military on them. Do you support this sort of rhetoric? \n\nHe also continues to attack our extremely secure election process, and still claims to have won the 2020 election despite having zero evidence. Do you believe him and why?", "label": 0}
{"text": ">I don’t think he is calling the country muslim\n\nKind of seems like he is. The number he gives is literally the entire Turkish population", "label": 0}
{"text": "Republicans have been demonizing education for years and acuse anyone speaking intelligently about ensuring everyone's needs are met of being elitist. ", "label": 0}
{"text": "People in other parts of the world think the same thing of Christianity. One can point at fundamentalists and point to scripture that is disregarded by many sects of Christianity to make the religion look just as evil as the perception of Islam you carry. Think the Spanish Inquisition was a good thing, either objectively or through the lens of the church? Do you think that the Indian schools throughout the United States that forced Christianity on the students and punished them for partaking in their culture up to death wasn't outright fucking evil?\n\nI can make a case for a lot of religions as terrible, because at the end of the day it's a case of bad apples in any bag.", "label": 0}
{"text": "You just forgot the part that that if the guy has the IQ of 100 and like 2x average wealth, the billionaire would need an IQ of, like, 100000000 to justify. Its very likely that don't even half of them have 200. \n\nYou also forgot the part we don't live in a meritocracy as well. Meritocracy party is basically a dead zombie in politics.", "label": 0}
{"text": "When I take a look at the comments I cannot understand how the European people has a higher human development index than others. Truly pathetic", "label": 0}
{"text": "You don't need a 200 IQ to be rich, but younalso can't have a room temperature IQ either, like OP.", "label": 0}
{"text": "Hello /u/MyStolenCow! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gctymv/out_of_the_top_20_cities_by_number_of_amazon/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gctymv/out_of_the_top_20_cities_by_number_of_amazon/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "Keep simping all you want my dude, but Jeff won't sign you a check.", "label": 0}
{"text": "I wouldn't ask him for one", "label": 0}
{"text": "Well the things you reference are all things of the past for Christianity… do you have current day examples? I have no idea what the original comment was, but comparing current day atrocities performed in the name of Islam is apples to oranges vs Christian atrocities of the past.", "label": 0}
{"text": "Again, you REALLY don't understand what happened or how it work.", "label": 0}
{"text": "It would be good if there was a colored block maybe around each in indicating continent/region to give an at a glance idea of the globalism of Islam.", "label": 0}
{"text": "Good luck coping on the 5th!", "label": 0}
{"text": "As a Native American, I find this inaccurate.", "label": 0}
{"text": "In terms of business, yes. \nThey are certainly smarter than people who assume that wealth is a zero sum game (it never has been), or assume they can't possibly improve their standard or living.", "label": 0}
{"text": "Keep moving those goalposts, bud. One day you too will be a billionaire.", "label": 0}
{"text": "What goalposts?\nAlso, I don't want to be a billionaire. I'm happy putting forth my medium amount of effort for my medium amount of income.", "label": 0}
{"text": "It's definitely trending in the wrong direction.", "label": 0}
{"text": "You know that left and right switched in america around 80s, right? Republicans used to be for elites, for wars and invasions, now they are democrats. Democrats also control huge majority of information spreading via controlling social medias and news. They are the ones dismissing and silencing/banning/cancelint anyone who has different opinion. Thats what nazis did before they got too powerful.\n\nWhat is even an argument for trump being nazi? Kicking out illegal immigrats? Until 10 years ago that was common sense, there are speeches of hillary clinton talking about it.", "label": 0}
{"text": "24 !? WTF !?", "label": 0}
{"text": "The point isn’t really that he could sell it all and have that much money. \n\nIt’s that he built that wealth on the back of workers that he treats like absolute garbage. \n\nHe could easily be sharing a huge chunk of what he owns, enriching the lives of hundreds of thousands of people. And the share price would still be just as high.", "label": 0}
{"text": "The Browns saw the Walker trade and said \"hold my paper bag\" and gave it their best shot. I feel bad for their fans.", "label": 0}
{"text": ">Trump admires kim jong un, putin, and the taliban for their \"strength\", and that doesn't concern you? \n\nNot at all. Trump actually having conversation and having good relations with nuclear powers is absolute priority. If we wanna live in peace the big countries need to be in at least neutral relations. Thats also better for them themselves, look consequences of this russian war, dolar got decentralized and weaker, less stable and inflation got worse, especially for euro.\n\n>It's all assumptions and \"this would happen if democrats were in charge\" when you obviously know this is a bad faith argument that is impossible to support with actual evidence.\n\nI assume you only watch things from your echo chamber. Theres no way you actually dont know anything thats happening lmao. Like, there is evidence for everything i said im not sure what is confusing you.\n\n>And lets continue talking tariffs. Read this and lmk your thoughts https://taxfoundation.org/blog/international-trade-commission-tariffs/\n\nAgain only one side of the argument. But even that negatives would stabilise in few years in capitalist market. Trumps move was long term solution and creation of stable economy thats not too reliant on other countries. This is short solution that has big potential consequences as its limiting americas diplomatic power. Im not sure whats with this constant show term solutions democrats want, not even just in economy but everywhere, like would it really kill you to think about potential consequences more than 4 seconds. Same way germany went a bit too left economically and screw themselves too much by having to rely on russia for gas etc.\n\n>Aside from all of this I do want to add that Trump continuously refers to people who do not support him as the enemy within, and has said he would prosecute and sic the military on them. Do you support this sort of rhetoric?\n\nI dont but trump doesnt and will never have power to actually do it. We also had trump for 4 years and we know what to expect. In absolute worst case scenario, lets say he wants to become a dictator, it is extremely easy to assasinate him and continue with democracy. Democrats are much bigger threat as they actually have the power and are using it. They are well oil machine, like every candidate is basically the same repeating same phrases and sentences democrats also have almost 100% control over colleges, news media and social media. They are also actively importing 100 000s of illegal immigrants in swing states to decide the vote, basically making it democracy only on paper. They also run international politics wildly wrong, it has direct impact on us in europe", "label": 0}
{"text": "Where does that key info appear on the infographic?", "label": 0}
{"text": "Me personally? Not really. I see through their bullshit pretty easily.\n\nOther men demographically similar to me? The upholding of traditional values (including patriarchy, pro-life stances, Christianity, and traditional gender roles), the ability and empowerment to take a protection-based role for one's self and one's family (2nd amendment), workplace and economic stability & growth (anti-immigration, corporatism, and ironically the American dream).\n\nSome things that I see neither party addressing well yet that affect men are as such:\n\n- Free/cheap Healthcare, especially for mental health.    \n- Closing the education gap, since men are falling behind in school and continuing into higher education less.     \n- The housing crisis (Kamala is taking a small stab at this, but where I live on the west coast it doesn't help me much), and homelessness crisis.     \n- The deconstruction of the military industrial complex, and ending the selective service system.\n\nThose are just some examples. I'm sure there's more if I thought hard enough about it.", "label": 0}
{"text": "So you're suggesting that Republicans are now on the left?  Or are you just reinventing the political axis to suit your fancy?  Democrats do not favor illegal immigration, then or now.  They do recognize that the *legal* immigration system is broken, and the most effective approach to enforcing stricter immigration standards is comprehensive reform.  But surely you see the distinction between opposing illegal immigration, and literally quoting Hitler to say immigrants are \"poisoning the blood\" of this country.  I don't know about you, but if I had a nickel for every time I accidentally quoted Hitler in regards to my political philosophy, I would not have any nickels.", "label": 0}
{"text": "Even though it was a sure money loser, Saudis were big funders of the new twit run business, they are well known proponents of free speech, so Elon running it seems worth the loss.  /s", "label": 0}
{"text": "I'm honestly not thrilled with the concept of Trump winning and having another 4 years of that circus side show. I don't understand why the Democrats can't find better candidates. They absolutely have them, but they haven't put up anyone good since President Obama.", "label": 0}
{"text": "Flacco also had a fully healthy line and faced the 25th and up pass defense while averaging 2 interceptions a game. \n\nThat year watson was 5-1 and lost to the Steelers when Nick Chubbs knee exploded. \n\nSince then 3/5 linemen have had surgery in offseason no?", "label": 0}
{"text": "> They are also actively importing 100 000s of illegal immigrants in swing states to decide the vote, basically making it democracy only on paper.\n\nBro you can't actually believe this. It is impossible to vote as a non-citizen, let alone an illegal. This simply does not happen, and is completely made up to make you focus on a boogeyman and demonize democrats. That you believe this at all shows me you have no concept of what real world evidence is. Seriously who told you that? Send me the evidence. It's actual batshit insanity that living breathing humans could believe something so easily disprovable, and in fact has been disproven time and time again.", "label": 0}
{"text": "With Watson playing a full game: 5-1\n\nWithout Watson playing a full game: 6-5 \n\nFlacco: 4-1", "label": 0}
{"text": "Money is merely a construct to help humans know how they should distribute resources. The earth has just as much iron, water, and other elements on it today than before the Bezos was born, let alone his founding of Amazon. \n\nIn fact, one could potentially argue that all Amazon has really created is more greenhouse gas from shifting human consumption habits to be more on demand and encouraged enshitification of products.", "label": 0}
{"text": "Hello /u/Formal_Phase_4464! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gcwziv/this_day_in_history/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gcwziv/this_day_in_history/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "What’s the source of this data?", "label": 0}
{"text": "RedClearPolitics now lobbies and donates to the GOP. They’ve been torn to shreds by other real polling companies. \n\n\nDoesn’t mention polling technique\n\nDoesn’t mention number\n\nCherry picks previous poll moves (which change election to election) to always benefit one side\n\n\nYeahhhhh man maybe mix it up lol", "label": 0}
{"text": "Let me guess this is based on all the right wing polls suddenly showing up?", "label": 0}
{"text": "All the right wing polls released recently.", "label": 0}
{"text": "I've lived on a computer for 30 years. How have I only just learned that `shift+scroll` goes left/right?", "label": 0}
{"text": "Ricky Williams?", "label": 0}
{"text": "Heads up bro, you are absolutely swimming in the [just world fallacy.](https://en.wikipedia.org/wiki/Just-world_fallacy) You are up to your eyeballs. \n\nThere's a lot of good reasons to doubt the idea that billionaires are \"smarter.\" It would be fair to argue that many of them mostly got their wealth through good fortune rather than any inherent agility. \n\nEven if they are smarter, that doesn't change that there's no logical reason to believe that their moderate increase in intelligence should entitle them to unfathomably extreme levels of wealth to an absurd degree, enabling them to drastically influence society in their own favor.", "label": 0}
{"text": "It likely will take years for the Browns to recover from this trade given the draft picks traded away.\n\n>Meanwhile, the [Texans](https://sportsdata.usatoday.com/football/nfl/teams/houston-texans/325) are still basking in the glow of the trade, which sent out a malcontent in a dispute with the team and added a treasure trove of assets to the organization's coffers. Those picks have since become a group of potential-packed young players who are adding upside to a roster that has already improved markedly under Nick Caserio and DeMeco Ryans....\n\n>As it stands, the Texans would probably be pleased to have landed just Anderson and Dell as part of this trade. They look like bonafide stars who should be playmakers on each side of the ball. If one or more of the other Houston players turn into solid starters or role players, it will be a cherry on top for an already good-looking trade.\n\n>If not, the Texans will still be the clear-cut winners of this trade given Watson's inability to stay on the field, his struggles quarterbacking the Browns and the exorbitant cost of his contract.\n\n[https://www.usatoday.com/story/sports/nfl/2024/09/15/deshaun-watson-trade-details-texans-browns/75189022007/](https://www.usatoday.com/story/sports/nfl/2024/09/15/deshaun-watson-trade-details-texans-browns/75189022007/)", "label": 0}
{"text": "Welcome to the circlejerk.\n\nHappiness rankings:\n\nFinland #1\nDenmark #2\nSweden #4\nNorway #7\nSwitzerland #9\n\nSwitzerland has an excellent public education system, universal healthcare and affordable post-secondary education. \n\nPoint is, rich hoarders suck and have tricked people like yourself into believing we’ll fall back into the Stone Age unless we let them continue to treat us like serfs.", "label": 0}
{"text": "So, if you have that idea in an island, how far will you get with it? Not very far. \n\nEntrepreneur’s can only develop their ideas with the right infrastructure, workforce, and other systems build by society. They are not operating in a vacuum. Society deserves a bigger cut. And really, if you are buying stupid cars, 300’ yachts, and statues of your fucking wife, you are just looking for ways to blow dough that could go a lot further making people’s lives better, and you’d still be filthy rich.\n\nFact is, nobody gets that rich without exploiting somebody, or the environment. It’s time to make things more fair. We managed that through the late 40s -70s fairly well. It was only when republicans got all fucky again that we blew it and the average ceo salary jumped from 20x that of workers to 250x or much, much more.", "label": 0}
{"text": "They are not millions of times smarter than anyone. They built their wealth exploiting people and using the infrastructure of societies to build their wealth. And nobody is saying they should be able to be rich. But does this graphic not help you understand how absurd, unnecessary, and destructive their wealth is?", "label": 0}
{"text": "Haslam surrounds himself with sycophants? \\*Surprised Pikachu*", "label": 0}
{"text": "No they didn't. \nThat same infrastructure is available to you and everyone else. The difference is, they used their jntligence + luck+ social skills it to build wealth. \n\nThe idea that rich people can't exist without being evil and exploiting people is what I find absurd, destruct, and unnecessary.", "label": 0}
{"text": "I think the point is it’s not some imaginary money that doesn’t really count. If you can leverage your wealth to borrow 5% of one TRILLION dollars, then your wealth is far from “not really available” which is what gets parroted all the time.", "label": 0}
{"text": ">Being smart isnt the only thing billionaires have. If that was all it took, everyone would be rich.\n\nYou're not very smart. Or educated.", "label": 0}
{"text": "It could pay for the carpel tunnel everyone got from this scrolling.\n\nReally well presented though.", "label": 0}
{"text": "I'd like to see this appended with the % of the population in parenthesis after the raw number and another one with the top as a % of population.  But it's easy for me to ask", "label": 0}
{"text": "If Jeff Bezos gave all of his money away to every American we all have a half a pixel.", "label": 0}
{"text": "So, I remember in my first finance class, asked the class, “how many of you understand the concept of a a billion?”\n\nOf course if college so no one says a word. Then he said, I will be giving you all a million seconds starting now to finish your semesters first assignment, so folks don’t get confused, that’s just shy of two weeks.” He paused….\n\n“…. Billion seconds however is 32 years. Let that sink in through the semester”", "label": 0}
{"text": "I don't know about that but the world would certainly better without you", "label": 0}
{"text": "CEOs have less to lose this way.  Once you have such ridiculous amounts of money, losing some isn’t as bad because you’ll still easily afford nearly everything you want.", "label": 0}
{"text": "The starting left tackle and starting/backup right tackle were done for the year with Flacco. Not a fully healthy line by any means.", "label": 0}
{"text": "This is not beautiful but confusing. I think this shows \"Women **with** a college degree\" versus \"White men **without** a college degree\".\n\nSo its Asian Woman, White Women, Black Women, Hispanic Woman, all with college degrees. Then White Men without one...I think.", "label": 0}
{"text": "> exploit the labour of others.\n\nHow can one, in your opinion, employ others without exploiting their labor?\n\n> don’t pay their fair share in taxes.\n\nHow much is fair? I agree the richest should pay more to keep the governmental services we all need running, but the top 10% already pays the majority of income taxes on the national level (and many if not most states).", "label": 0}
{"text": "Because it's true? That's how they buy shit. They leverage their stock in short term loans, then occasionally sell some stock to pay them off which is easy since they have accountants that make the interest tax deductible.", "label": 0}
{"text": "$400k is over 600% of the average - I think they’ll be ok being taxed appropriately.", "label": 0}
{"text": "I used to say that. Then I saw how governments work. I’m now convinced it’s a problem with large institutions, not specifically public or private. They have different motives, and only democratically accountable institutions should be in charge of certain things, but large governments become increasingly unaccountable too. Part of it is institutional momentum, and part of it is just that the public can’t effectively supervise something that’s too large and complicated for most to understand. There is a reason why the national orthodoxy used to be small government.", "label": 0}
{"text": "Who \"rules\" if not the majority party? That's the thing I don't understand. Where I come from in EU, coalitions are rarely in conflict. Granted our main \"center-right\" party is basically tretcherous on abortion to the conservative cause. Maybe it's like that in France as well, though I appreciate that their conservatism may be different (perhaps that's why they're _far_ right). Anyway, I'm not very much into politics. Where I'm coming from is this: Having no laws to protect the innocent human beings in the womb is the utmost moral failure of our countries.", "label": 0}
{"text": "They also leave out some really important numbers for frame of reference.  Like only 38% of US adults have a bachelors degree... if that's what this is talking about... or is it an associates, masters, doctorate?  Who knows.", "label": 0}
{"text": "What about white men with college degrees? What about non white men? What about women without college degrees?", "label": 0}
{"text": "There is a hint of explanation for some of trump’s popularity among the older white male blue-collar demographic in the article.", "label": 0}
{"text": "Musk doesn't have that kinda cash. Almost all of it is in equity...most in equity that he can't sell a significant amount of without causing issues but personally and for the company. Gates, for example, has been divesting of Microsoft for a long time and still has tons. Most of them get cash by using the equity as collateral. Musk did this for the Twitter purchase along with getting investments from multiple other people.", "label": 0}
{"text": "I think it’s from the NYTimes, there’s a link provided but when you click on it there’s a paywall preventing users seeing the article.", "label": 0}
{"text": "Well you’re not a billionaire so obviously you’re not smart. Why are you lecturing us?", "label": 0}
{"text": "?  Accountants make the interest a deduction?  Do you have a citation to the tax code that allows that?  Because that's not a thing.\n\n\nMortgage interest (up to a cap) is deductible.  Interest on ordinary loans, secured by stock or not, is not. ", "label": 0}
{"text": "How could you have done it better?", "label": 0}
{"text": "An absurd amount of money to pay a guy to throw and catch a ball really well.", "label": 0}
{"text": "You think that’s the source of income inequality? You’re the easily manipulated kind of voter the politicians love", "label": 0}
{"text": "And for a fan base that hounded Ben for years over his allegations it must sting a bit.", "label": 0}
{"text": "I think his agent has a real shot at MVP though.", "label": 0}
{"text": "If I understand the numbers correctly, the Browns have four wins out of 60% of a guaranteed $230,000,000 contract.  If the contract is loaded equally, then that works out to $34,500,000 per win.\n\nCool, cool…", "label": 0}
{"text": "Why the hell does it have variable scrolling speed? The figure is more than staggering enough without manipulating it", "label": 0}
{"text": "The point is there’s a big difference between someone making 6 times the average and someone making 600,000 times the average", "label": 0}
{"text": ">  so the only logical solution is that too many women vote to oppress women.\n\nAssuming that elections perfectly reflect the will of the voters, and then it could still be 1% of women while 99% vote the other way.", "label": 0}
{"text": "The first time I've heard of Putian, it's a 3rd tier city.  Relatively small in China but it still has 3m+ people.", "label": 0}
{"text": "$400k isn’t even rich, that’s still “work your entire life” type of income. Don’t mix up people who are doing well for themselves with the truly wealthy, they aren’t the same. There is a vast canyon of difference between being well off and being truly rich.", "label": 0}
{"text": "Here's a free link. They give you ten a month to share if you have a subscription (which I have through my library)", "label": 0}
{"text": "What would be appropriate?", "label": 0}
{"text": "https://github.com/MKorostoff/1-pixel-wealth/blob/master/THE_PAPER_BILLIONAIRE.md#the-paper-billionaire-argument", "label": 0}
{"text": "Thank you for sharing this, now I don't feel so alone.", "label": 0}
{"text": "I'm not simping for him, I'm just telling that he had luck and good ideas", "label": 0}
{"text": "my phone screen is roughly 1 million pixels. \n\nif we call the screen 1 billion dollars, then 1 million dollars (0.1% of the billion) is 1000 pixels. this emoji is roughly 1000px on my screen --> 👾", "label": 0}
{"text": "Oof, yeah. Really low RVU’s. I negotiate physician contracts and Peds is always rough.", "label": 0}
{"text": "2 weeks in summer, 2 weeks for Christmas, 1 week to sprinkle here and there", "label": 0}
{"text": "Nah, our tech industry is, finance is pretty good", "label": 0}
{"text": "Yes that's kind of the thing: you can get as many sick days as you are sick. Doesn't sound crazy to me ?", "label": 0}
{"text": "Comparing 50 states with 27 countries, not that insane ?", "label": 0}
{"text": "*Stupid for you\n\nFor someone from 3rd world half of your spendings would look stupid.", "label": 0}
{"text": "I'd rather have less money but get some time to spend them, thanks", "label": 0}
{"text": "Except he didn’t borrow it to buy himself something like a $43 billion flying fortress, he bought yet another company that the lenders were interested in him controlling and that he once more could not sell to buy himself anywhere near that much money’s worth of “stuff.”\n\nThe problem isn’t that he can or can’t personally benefit from a dollar amount equal to his Forbes valuation, it’s that he has undue influence in politics, just like the investors who helped him buy Twitter do. A reflection of that is the problem that actually personally affects the typical worker, which is their lack of negotiating power for their compensation. All the people who argue for confiscating the wealth of people like Musk are simultaneously setting off conservatives who think it’s unfair to just take from someone and missing the opportunity to really hammer the drum on labor laws and unionization.", "label": 0}
{"text": "Are you really trying to compare someone living a middle class lifestyle with no frills to people who buy 300’ yachts, $100k watches, 40,000 square foot homes, and statues of their spouse?", "label": 0}
{"text": "Europeans being overall lazier plays a big role", "label": 0}
{"text": "Ah sure there's more than just work hours, but it's generally from the same stock. There's also taxes and regulations that keep Europe back.\n\n\nOf course, some countries work harder but they also come from a lower development base. Europe is generally comparable to the US. At least western Europe.\n\n\nAnother good example for superpower building work hours is China where working 9am-9pm 6 days a week is the standard.", "label": 0}
{"text": "Not to mention that with how different the results are year over year the data is obviously garbage lol.", "label": 0}
{"text": "I'm not even sure bezos greed holds a candle to whatever power compels the Tolkien estate to milk their copyright into as much mid content as possible. The show is better than it should be.", "label": 0}
{"text": "I generated the plot using matplotlib in Python, and FiveThirtyEight data was used. Only firm data and the last data point are plotted for each polling firm. Only polls with at least one data point during the previous 17 days are considered. For each polling firm and date, the polls are averaged for that given date. Also, given that polls are conducted in a date range, the midpoint of that is considered a polling date for plotting.", "label": 0}
{"text": "The problem is that consumers actually really, really like the benefits of scaled companies. Can't have 2 day deliveries or no outage Internet promises without the consolidation.", "label": 0}
{"text": "Hello /u/Turbulent_Way_87! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gd5i00/need_a_mentor/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gd5i00/need_a_mentor/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "Who’s Nick?", "label": 0}
{"text": "They can supervise it. It works in states with high social/political engagement. It's not perfect, no mode of government is, but comparing that to arbitrary rule of billionaires, it's a vast improvement.", "label": 0}
{"text": "Corrected. Thanks.", "label": 0}
{"text": "This person has never been in the Phoenix east valley dealing with all these old ass retirees...", "label": 0}
{"text": "It does, as it's far more adaptable for the likes of US. It's precisely why I mentioned it. \nI never suggested anything of the latter. In Poland we're pretty close to Scandinavian states here and it's not a new idea to follow what they're doing, but reality is their example is not easily adaptable.", "label": 0}
{"text": "We keep telling you people it's not New York.", "label": 0}
{"text": "Ethiopia surprised me, tbf.", "label": 0}
{"text": "I've done it, too. Here you are:  \n[https://imgur.com/a/SHKFokw](https://imgur.com/a/SHKFokw)", "label": 0}
{"text": "What the fuck.\n\nI thought people were actually a bit relieved that there was finally a younger candidate to vote for? I guess that didn't last long...\n\nAs a European I am fucking scared shitless right now. He's gonna hand deliver us on a silver platter to China and Russia.", "label": 0}
{"text": "True. Dash means minus. I'll edit that.", "label": 0}
{"text": "Here is the graph with your recommended Y-axis title:\n\n[https://imgur.com/a/GQi2mlT](https://imgur.com/a/GQi2mlT)", "label": 0}
{"text": "Are you sure a linear line of best fit is best for this? The difference between a 4% acceptance rate college and an 8% AR college is a lot bigger then the difference between a 8% AR college and a 12% AR college in terms of selectivity prestige", "label": 0}
{"text": "Florida, why am I not surprised", "label": 0}
{"text": "Bezos has delivered enormous economic growth. Amazon as a company has made the size of the pie hundreds of billions larger. \n\nPersonally I care about *absolute* poverty much more than *relative* poverty, so I feel like incentivizing more Amazon's to be started would be in almost every countries interest.", "label": 0}
{"text": "Sackler family", "label": 0}
{"text": "Noone just starts off taking fentanyl. They had to have been an addict already. Blame the Sacklers getting millions of people on pain meds", "label": 0}
{"text": "People's brains are literally wired differently, some people can take drugs and be fine and some people will be stuck in an incredibly suffocating addiction. It has only partially to do with willpower", "label": 0}
{"text": "I'm not saying that at all. The RN is the first group at the European Parlement, but if you take a look at the National Assembly (Assemblée Nationale, where nearly 70% of the people voted instead of 50% for the European Elections), they are the third group in term of size. The Left is the biggest and the Center-Right (presidential group) is the second. Left and Center Right are generally pro-abortion or at least pro choice (because nobody is forced to, it's a matter of free will), and they represent around 60% of the assembly. The Right is divided and the Far-right is generally against, unless it's a matter of health for the mother.", "label": 0}
{"text": "You don't know how people in slums live, right? Difference between us and them is higher than diffrence between lets say Bezos and us.", "label": 0}
{"text": "And exploited a few (hundred of thousands) people in the process.", "label": 0}
{"text": "For sure", "label": 0}
{"text": "Aah, the paper billionaire argument:\nhttps://github.com/MKorostoff/1-pixel-wealth/blob/master/THE_PAPER_BILLIONAIRE.md", "label": 0}
{"text": "So, is this swing state not swinging much?", "label": 0}
{"text": "Also walker at least played ok for the Vikings despite them being bad. Watson has just been absolute hot garbage, and last year they completely wasted what was otherwise a good team by having him at qb.\n\nHe has more settled sexual assault lawsuits than he does tds for the browns. \n\nSo personally I'd say it was worse than the walker trade, but I also wasn't alive back then so I'm just going off raw numbers.", "label": 0}
{"text": "Not at all. The average Indian-American household is 3.35 and the average Asian-American household size of 3.4. That’s 2 parents and 1-2 kids.", "label": 0}
{"text": ">And even after 4 years of Dems being in office, the US isn't at war with Russia.\n\nWere you in coma for past 4 years? What, or should i say, who is most responsible for what is happening in ukraine right now????\n\nWho is responsible, or should i say, who had most power to control and deescalate conflict in israel? Like, its such a shallow outlook to think president of USA had nothing to do with these things.\n\n>Then you're an idiot, because it literally isn't happening.\n\nI mean sure, you can put your head in the sand and act like nothing is wrong.\n\n>Project 2025.\n\nThat has nothing to do with trump? Again, your a massive hypocrite turning blind eye to things with proof and then catching for nonsense.\n\n>No it wasn't.\n\nMajority of americans would disagree with you", "label": 0}
{"text": "Long term capital gains is like 25%", "label": 0}
{"text": "Brooklyn is still king’s county", "label": 0}
{"text": "Sent from device made in China, probably*", "label": 0}
{"text": "I linked what the scientific concensus of biologists is. The Church agrees with science. Every other definition of human life is quite frankly a post-hoc dehumanization to justify murder. Just like any other dehumanization of defenseless and innocent that were being killed in history and to this day in wars. The truth is, we're talking about a human being just like you and I were at that stage (not a mere animal, a vegetable, or primordial soup but unique individuals). To assign worth to human beings based on development or ability is a slippery slope. I encourage you to instead embrace the fact of inherent human dignity.", "label": 0}
{"text": "The data in stark, post 9/11 there's been 0 hijack in the usa", "label": 0}
{"text": "You get 2 months a year off + holidays? So jealous!", "label": 0}
{"text": "I correct myself, I agree it is alive. But not thinking. I know I was once an embryo myself (because I've been at school). But still, the choice should be up to the future parents. Mistakes happen, and I would rather not ruin two to three lives but instead a potential, unwanted, one. We have more than enough records of unwanted births ruining a family, or of rape survivors forced to give birth and sometimes take care of their agressors' children or abandoning them. It is a complex matter that can't be simply describe at \"It is always wrong\" or \"It is always right\". So limits like the 14th week are a good balance in my opinion between what's scientifically and morally acceptable and the freedom that a person is deserving to get regarding this point. Also, I personnally don't think the Church of whatever religion is supposed to get a word in this. I live in a country where they don't get a say and it's fine that way.", "label": 0}
{"text": "There’s additional taxes when your wealth is over a certain threshold it’s about 3-5%", "label": 0}
{"text": "As someone from Philly, I'm kind of mad we're not first.", "label": 0}
{"text": "Interesting data, great visualization!", "label": 0}
{"text": "Another chemist! There are dozens of us! Dozens I say!", "label": 0}
{"text": "If Elon Musk was born poor, he would still be in South Africa and would not be rich.", "label": 0}
{"text": "Yes there are Trillions of dollars that will never be taxed.  That is why the ultra-wealthy borrow money rather than sell assets.\n\nhttps://americansfortaxfairness.org/ultra-wealthys-8-5-trillion-untaxed-income/", "label": 0}
{"text": "Surely you mean yoctomoles?", "label": 0}
{"text": ">Society deserves a bigger cut.\n\nWealth vs Spending\n\nCups of all things?\n\nEvery time you want to think we can’t Spend more money. I’m shocked to see the numbers\n\nThe Quencher arrived in 2016 to little fanfare. \n\n* The 40-ounce insulated cup retails for between $45 and $55, \n\nBy 2019 Stanley's revenue was $73 million but jumped to $94 million in 2020. It more than doubled to $194 million in 2021.\n\nIn 2022, Stanley released a redesigned Quencher model and Revenue doubled again to $402 million.\n\n**Stanley has now sold more than 10 million Quenchers, and demand for the cup doesn't look to be waning any time soon.**\n\n>\"The resale market is certainly flattering,\" Reilly says. \"The fact that there are signs at America's best retailers limiting the number of Stanleys you can buy is an astounding thing to think about.\"\n\nFurther increasing the amount Americans are spending on cups\n\nExcluding cars, Consumers purchased $1 Trillion in Consumer Durable Goods Including $73 Million in Stanly Cups in 2019 The Top 1% Spent how much of that?  $200 Billion? (20%) \n\n* That means the average on non car purchases for **everyone else was ~$7,000**\n\n**2023: $2.2 Trillion** \n\n* Consumers purchased $1.4 Trillion in Consumer Durables excluding cars in 2023 \n\nThe Top 1% Spent how much of that?  $280 Billion? (20%) \n\n* That means the average on non car purchases for **everyone else was ~$9,625** \n * Thats an extra **$2,600 spending** more than 2019\n\nIs it even more as its Just the Middle 40 - 90 Percent of Americans\n\n* 50 Percent of Americans (50 Million Households) Spent the extra $300 Billion?\n * $6,000 in excess spending over the spending they were doing in 2019? On top of the $7,000 spent in 2019 spending\n  \n**We keep spending** not even trying to save the $400 needed for an emergency expense \n\n------\n**In the Last 10 years Americans have bought $15 Trillion in Personal Consumption Expenditures of Durable Goods** \n\n* And of course a lot of it on Credit @ 10% , so another $16 Trillion in Interest\n * Maybe less but for rounding purposes $30 Trillion in Spending, just on Durable Goods \n\nIn 2021 the Total Consumer Durables was $7.69 Trillion Worth\n\n * $3.23 Trillion held by the Middle 50% - 90% (The 2nd Lowest Valued Asset)\n * $1.93 Trillion by the Bottom 50% (**The 2nd Highest Valued Asset**)\n * $1.61\tTrillion by the Upper 9% (**The Lowest Valued Asset**)\n * $0.92\tTrillion by the Top 1% (**The Lowest Valued Asset**)\n\n90% of that $18 Trillion was from the Bottom 90%, **If 1/3rd that had been invested the same as the top 10% it'd be a lot different**\n\nInstead, That's **$5 Trillion in the Stock Market is $10 Trillion in Net Wealth** vs currently being worth $3 Trillion\n\n$7 Trillion in the New Wealth for the Middle Class\n------", "label": 0}
{"text": "I think it's because with the completely different scales of each stuff....f you had a good scrolling speed for billions, you would destroy several mouses to get to the 3 trillion stuff...and scroll essentially for years ?", "label": 0}
{"text": "I 100% agree, and honestly if you’re not using GPT you’re falling behind.", "label": 0}
{"text": "Having billions in wealth doesn’t mean you can pay people more money those are two separate parts to a business", "label": 0}
{"text": "The difference between a millionaire and a billionaire is about a billion dollars", "label": 0}
{"text": "now correct with how much of it is 'on paper' wealth", "label": 0}
{"text": "If we instituted a 1% tax on any wealth above $1 billion, it would not make a difference to the billionaires but it would generate so much extra revenue for the country. However, the challenge is how to use that money effectively. I'm all for taxing the wealthy, but I'm also wary of it just being funneled to politician's pockets.", "label": 0}
{"text": "more concrete and cement than ever", "label": 0}
{"text": "beans and rice  are recommended advice to those trying to eliminate their debt", "label": 0}
{"text": "The amount of left wing spaces that have a zero sum empathy view for men and their issues. Seeing advocating for men as taking away from women is so common it’s more of the norm than the anomaly. \n\nThe amount of times many left wing spaces will just say “muh patriarchy her durr it was you men who built it” \n\nI can remember being more left leaning when I was in my early teens but seeing how dysfunctional many of the left leaning communities can be turns me away. \n\nI also am not some conservative evangelical type, but the right also seems to be turning away from that aspect. I won’t focus on that for now though.", "label": 0}
{"text": "Another commenter mentioned using shift + scroll. See if that works", "label": 0}
{"text": "Most AITA posts could be resolved if people went to therapy lol", "label": 0}
{"text": "Yeah, but over on r/dating their partners are 30+ so the it averages out ", "label": 0}
{"text": "Utah leading the way with youngest marriages 😂 \n\nWhen I was a Mormon I got married at 23 and divorced at 26. My branch president called me into his office the Sunday after my divorce was final and said “we will have you married in 2 weeks”\n\nThat’s why Utah is so low :) it’s 50% Mormon.", "label": 0}
{"text": "I'm surprised Utah isn't lower than that", "label": 0}
{"text": "A tangible example is 1,000,000,000ul is 1000L for those who work with pipettes on the regular.", "label": 0}
{"text": "Us New Yorkers too broke to afford marriage with sky high everything lol", "label": 0}
{"text": "Seems cool but you should include a link to the site.", "label": 0}
{"text": "2021 might not be a great base year….", "label": 0}
{"text": "Most AITA posts are from relationships that have gone past the point of no return. \n\nWell, the nonfake ones that is.", "label": 0}
{"text": "You can get married for like $50. Weddings are expensive. Getting married is not.", "label": 0}
{"text": "Yes, but they don't move in large numbers to places that are already 90% white. Chicago has a large Polish immigrant community, New York has a large Greek immigrant community, and Newark has a large Portuguese immigrant community. \n\nYou don't see these numbers in Nebraska or Pennsyltucky", "label": 0}
{"text": "seeking validation from redditors by twisting the story is basically all that AITA is", "label": 0}
{"text": "At least you got a second chance haha", "label": 0}
{"text": "It is, according to the legend - median age at first marriage", "label": 0}
{"text": "I suspect that there are a lot of people just not getting married. Regardless if they are in a long term relationship or if they have kids. Not getting married seems to be increasingly common particularly with younger couples. As the stigma against having a child out of wed lock is much lower than it use to be.", "label": 0}
{"text": "Average. That means for every couple getting married at 30 there is an equal number dumb dumbs getting married in their teens.", "label": 0}
{"text": "I’d be interested in seeing a frequency distribution on some of these states. Curious to know if average is the best way to represent this data.", "label": 0}
{"text": "I guess that's better than being low because the \"child bride\" demographic is bringing the average down.", "label": 0}
{"text": "I bet the darker the state, the lower the divorce rates.", "label": 0}
{"text": "Thanks, but it doesn't.  Oh well.", "label": 0}
{"text": "My second wife - I met her in August 2006, one month after my divorce was final. Our bishop called us into his office that December for a stern warning - that if we did anything sexual before marriage the consequences would be stern and public. We got married the next day!\n\nThat was 17 years ago and we couldn’t be happier. Three kids, living in our dream place … Also kicked Mormonism to the curb. Not for us.", "label": 0}
{"text": "Not \\[OC\\]. This is probably a bot. Original post: [https://www.reddit.com/r/dataisbeautiful/comments/1awfyfw/how\\_old\\_are\\_americans\\_when\\_they\\_get\\_married\\_oc/](https://www.reddit.com/r/dataisbeautiful/comments/1awfyfw/how_old_are_americans_when_they_get_married_oc/)", "label": 0}
{"text": "Original comment from the original post: [https://www.reddit.com/r/dataisbeautiful/comments/1awfyfw/comment/krgv012/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/dataisbeautiful/comments/1awfyfw/comment/krgv012/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "label": 0}
{"text": "Man, I've visited Utah for it's national parks many times, but feels like if you lived there it would be such a different world. These maps always show Utah as such outliers for things most don't even care about.", "label": 0}
{"text": "Wow, just stealing the top comment from the original post, eh?\n\nhttps://www.reddit.com/r/dataisbeautiful/comments/1gdbmoi/oc_what_is_the_average_age_of_marriage_among/lu0h1rl/", "label": 0}
{"text": "This is **median** age of first marriage, not average.", "label": 0}
{"text": "Hey welcome to the exmormon fold - check out r/exmormon if you haven’t, it’s a great community. We’ve been out about 10 years.\n\nI really believe getting people married as quickly as possible to other active gung go church members creates a relationship wherein the church is the glue. When you’re 25 and have 2-3 kids, the church steps in and helps a young growing family like that function. If your extended family is all Mormon and your kids support groups are all Mormon and you’re getting financial and food assistance from the church, the church becomes pretty important in your life … all while you’re growing the next generation of missionaries.\n\nAnother example where they encourage what’s best for them, not what’s best for you.", "label": 0}
{"text": "New Zealanders could use Jacinda Ardern's gnashers to keep their lawns neatly clipped.", "label": 0}
{"text": "About 1/3 of Americans [never marry](https://www.psychologytoday.com/us/blog/living-single/202009/record-number-of-americans-have-never-married-and-never-will).  This is for the other 2/3.", "label": 0}
{"text": "I mean, why limit yourself to farming karma from stolen posts?", "label": 0}
{"text": "(Assuming it's not fake) at least one person in these always needs to be a *terrible* judge of character for the thing that happened to happen.", "label": 0}
{"text": "> People with the same education, wealth, starting point etc.\n\nPoint me at someone with all that comparable to Musk who isn't a billionaire as well.", "label": 0}
{"text": "> But you don't get rich by being stupid.\n\nLooks at Donald Trump's massive list of failed businesses and bankruptcies...", "label": 0}
{"text": "> luck+\n\nMostly this.", "label": 0}
{"text": "It’s not.", "label": 0}
{"text": "Would be interesting indeed especially in states that have a major metropolitan area within its borders. Like, I have to believe those are bimodal. DC might exemplify this. \n\nI was shocked that almost all states are 30 and below. As an old living in Seattle, I don't think I know anyone married before 30.", "label": 0}
{"text": "Is this for FIRST marriage or ALL marriages? If it's ALL marriages, the age will obviously skew upwards.", "label": 0}
{"text": "Glad it worked out for you, but the second someone asks me to donate to a tax exempt establishment and then tells me where and what I can put my dick in, nah. I promise you if you did the deed before marriage Satan wouldn't have cut your balls off.", "label": 0}
{"text": "> Amazon as a company has made the size of the pie hundreds of billions larger all over the world.\n\nIf you consider destroying high street businesses and small towns \"making the pie bigger.\"", "label": 0}
{"text": "Evidence suggests the brain is not fully matured until 27, so that would be a \"fun\" followup.", "label": 0}
{"text": "The earlier you get married the more kids you have. This map says that progressives are going extinct. Sad", "label": 0}
{"text": "And yet he is still a billionaire....", "label": 0}
{"text": "Divide wealth by 100 to get a very rough estimate of effective yearly income.\n\nOh look, they're massively overpaid.", "label": 0}
{"text": "No he wouldn't. \nHe would have become a billionaire either way, one way or another.", "label": 0}
{"text": "And that pretty much sums up the question of „Who TF even needs that kind of money?!”.", "label": 0}
{"text": "I was just thinking that median age of first marriages would be way more interesting than average age of all marriages.  Did OP just label the graph wrong?", "label": 0}
{"text": "That's actually an argument against your position.\n\nHe's still a billionaire, even after loosing more money than I could spend in a lifetime because he's an idiot.\n\nKinda destroys your \"billionaires are super-smart\" position.", "label": 0}
{"text": "Not that much older. Return missionaries are pretty frequently married by age 23. \n\nIt’s probably more because even Utah is about 50% Mormon.\n\nI am actually more shocked by Nevada. Nevada is pretty significantly Mormon like Utah and Idaho. ", "label": 0}
{"text": "I avoid being venal when not appropriate.", "label": 0}
{"text": "Lol, yes.  As in clearly distinct from any color on the scale, and dark enough to clearly have no color regardless of the medium presenting it (i.e. screens with varying color calibrations/temperatures of white)\n\nSomewhere between #555555 and #777777 would probably be about right.", "label": 0}
{"text": "Probably because it's cheap and has nice scenery", "label": 0}
{"text": "Why show Native Americans over Latinos?", "label": 0}
{"text": "Losing money doesn't equate to low intelligence. \n\nTrump is more intelligent than both of us combined, in business matters. So is just about every other billionaire who has ever existed", "label": 0}
{"text": "Latino is not a race. This map was about races as the category is reported by the US Census. What race are Latinos? I know Black Latinos, White Latinos, etc. The table reported races.", "label": 0}
{"text": "As the other person replying said well: the problem is a gross negligence towards issues men are facing, leaving them nowhere to turn for the issues to be solved. *Both* parties do a pithy job of tackling the problems! One is just better at disguising it than the other. \n\nStop thinking about \"appeal\" - appeal is just an attractor towards one party or another. Think instead in terms of policy and praxis. What are these people actually gonna *do* for people like me? That's where the problem is.\n\nLet me ask you this: As a man, who has left-leaning views, where or who can I turn to that I know will be in my own personal interest and good? Who's gonna do a good job, and *how*? For my own interest, for my own sense of self-worth and self-love, I need a good answer.\n\nI don't see any good answers though.", "label": 0}
{"text": "There is nothing you can do convince me that the people who built some of the most valuable companies to ever exist, did so because of pure dumb luck or evil /amoral exploitation. \n\nThere a lot of factors that go into play but intelligence is by far the most important. It has been that way since the days of Crassus", "label": 0}
{"text": "What is wrong with you, are you here just to argue with people? All people are asking it to have a color spectrum where you can differentiate all the data, including not having 1/3 of the colors being completely unused. Nobody is saying anything about “finding better data” or anything like that. This is r/dataisbeautiful, not r/presentingquantitativedatawithaninnateupperlimit. You lost my upvote.", "label": 0}
{"text": "They both are less than 2%. My guess is a lot of the black people that live there moved for university or immigrated from Canada.", "label": 0}
{"text": "Maybe neither of the black people in WY have a degree 🤷‍♂️", "label": 0}
{"text": "Very few people do live there. And for many people who own houses there, those are just vacation homes. Population is estimated at 564,000.\n\nThis means each of their senators represent 282,000 people, while each of California's represent 20 million.", "label": 0}
{"text": "In he States, we call it \"Use it or Lose it.\" I think it's a good policy because productivity is very crucial in the States yet many people must be forced to take a day off. Some Americans drag themselves on crutches  and in a cast to work and have to be told \"Go home damn it! Take your PTO!\" I've worked with them plenty.", "label": 0}
{"text": "To some extent, yes. One criticism of recent polling averages websites have been that there are are more low quality polls conducted recently and that might be shifting averages. The above plot helps you see whether the trend ,or lack of it, exists for individual polls or not and helps you draw your own conclusion about direction of the polls. ", "label": 0}
{"text": "Missed opportunity:\n\nA. Asian\n\nB. Black\n\nC. Caucasian\n\nD. Dakota or other tribe of native American", "label": 0}
{"text": "What's going on with Asians in West Virginia?", "label": 0}
{"text": "There were no black people driving through Wyoming at the time the sample was taken…", "label": 0}
{"text": "I prefer products that are low cost, fast delivery, and consolidated to a single platform with convenient return policies. \n \nI'll keep buying from Amazon for those reasons until something replaces it.", "label": 0}
{"text": "Got it, thanks", "label": 0}
{"text": "5 of the 7 Asians living in West Virginia have BA's.  The same for Blacks in Maine.", "label": 0}
{"text": "\"New York, NY\" in postal system refers to only Manhattan, not including other boroughs.", "label": 0}
{"text": "There are just zero black in Wyoming period.", "label": 0}
{"text": "Tech workers got generous bonuses. They became nimbys in San Franciso and Seattle. I'm not sure if 100k mini bezos is even better than one big bezos.", "label": 0}
{"text": "That’s a bold statement.  So he was born to be a billionaire due to a devine right?  So with no money and a poor education, he would have duplicated his “luck”.", "label": 0}
{"text": "A lot of the Black people in Maine are recent African immigrants. Possibly educational achievement is higher for this group.", "label": 0}
{"text": "Where are you getting divine right from?\nHE was born to be a billionaire because he had that perfect mix of natural ability (intelligence), risk tolerance, and even a little luck. \n\nHis dad being rich made the process easier, but didn't make it happen. You almost NEVER see the children of rich parents do anything but waste their life. The few that build valuable companies would have done so anyway.", "label": 0}
{"text": "I can't wait for those 200% tariffs Trump wants.", "label": 0}
{"text": "I think that might have been a r/woooosh", "label": 0}
{"text": "> who is most responsible for what is happening in ukraine right now\n\nPutin.  And he absolutely would have invaded with Trump in office, you'd have to be monumentally stupid to believe otherwise.\n\n> who had most power to control and deescalate conflict in israel\n\nHamas and Iran.  Hamas could have surrendered and returned the hostages and the war would have been over.  The US did not cause this conflict to go on, Hamas did.\n\n> you can put your head in the sand and act like nothing is wrong.\n\nPlenty of things are wrong, like mass Republican election interference.\n\n>  That has nothing to do with trump\n\nTrump is their spearhead.", "label": 0}
{"text": "Yea. Doubling the wealth of the middle class. \n\nAlso not buying things for cheap is how you lower the wealth of those on your list\n\nOddly not shopping at their businesses has an impact", "label": 0}
{"text": "Not everyone has the new player's handbook yet.", "label": 0}
{"text": "Most latinos are mestizos so they are being ignored by this data.", "label": 0}
{"text": "While that is by design, I believe House Reps in CA represent about 750k people, the Wyoming rep has 564k.\n\nThat's a more meaningful discrepancy as they are meant to divide as equally as possible", "label": 0}
{"text": "Have you been to South Africa?  A poor white in SA even with a natural mix, wouldn’t get the education nor have the resources to emigrate.  That would have messed up his “luck” in having good timing to be at the right place at the right time to help form Zip2.", "label": 0}
{"text": "I don't know the best way to represent the data, but this is not it.\n\nI'm not sure any choice of colors or gradients actually provides anything useful because there's too much mental estimation that has to happen.\n\nI look at one map (say asian, and see a few lighter colors), then I want to compare to another map and the perception of the colors changes because of the overall shift in data.\n\nAre Asians in South Dakota the same as American Indians in North Dakota?  Maybe?   \n\nIs Mississippi the same for all 4 maps?   No idea.  Maybe?  Maybe black is slightly less?\n\nA good old table conveys the data much more succinctly.  About the only thing the maps provide is the west coast and maybe the north east seems slightly more educated for everybody and the central plains indian descendants are doing slightly better than the mountain ones.", "label": 0}
{"text": "I'd like to think VT's black education level is partly the state's history as a safe haven for refugees from enslavement in the 1800s, but it's probably mostly that the black population is very small and many are people at universities who moved to Vermont for grad school or for a specific job.", "label": 0}
{"text": "Then he would have made money somewhere else. \n\nI understand you don't like Elon Musk, even if I don't understand why.\n\nBut \"he isn't smart, just born rich\" doesn't make any sense at all. Bill Gates wasn't born rich. Neither was Taylor Swift, Jeff Bezos, or Warren Buffett. \n\nBut every single one of them had the drive and intelligence to  become a billionaire.", "label": 0}
{"text": "1% income tax does nothing. 1% wealth tax per year is pretty big. \n\nImagine if you own a house worth £300k, a 1% wealth tax is £250 extra on your mortgage per month forever. If you own the house for 20 years it's a total of £60,000!\n\nGenerally you want to incentivise people to create more productive capacity (capital), since having a more productive society makes everyone richer in the long run. \n\nIf you tax capital ownership you're basically incentivizing everyone to sell their businesses and go on a spending spree.", "label": 0}
{"text": "\n>Let me ask you this: As a man, who has left-leaning views, where or who can I turn to that I know will be in my own personal interest and good? Who's gonna do a good job, and *how*? For my own interest, for my own sense of self-worth and self-love, I need a good answer.\n\nThe question you should be asking in a two party system is \"who will hurt me the least?\" and the answer to that is obvious.", "label": 0}
{"text": "Don't know why you're so aggressive with it. But that data IS readily available if you use a different table. 20% of the country is Latino, ignoring that is just bad use of CURRENTLY AVAILABLE data.", "label": 0}
{"text": "Why are you lying?", "label": 0}
{"text": "Haha all of OPs replies are like this. Someone woke up on the wrong side of the bed.", "label": 0}
{"text": "I mean, technically no, but I’d be a terrible human and daughter if I left my parents while they need help with cancer treatments. Staying around is far more important to me than anything work related. My work means absolutely nothing to me if it doesn’t give me the means to live my life the way I need/want to, and yes, location (definitely not one of the usual “highly desirable” locations) is what I’m trading for better compensation/benefits. I think I can still complain that compensation/benefits suck compared to what some others enjoy in the industry, though, especially when it’s obviously all manufactured by corporate collusion.", "label": 0}
{"text": "'Asian' increasingly seems like it's way too broad a category.", "label": 0}
{"text": "> there are zero black people ~~with bachelors degrees~~ residing in Wyoming\n\n/s But for real, google says there are fewer than 5000 total Black people, so it probably is hard to get a good number.", "label": 0}
{"text": "Because it's one of the most amazing places to live if you have money.", "label": 0}
{"text": "Opened this thinking \"no way Boston is on it\", fuck sake xD", "label": 0}
{"text": "Was hoping the next step would be the US federal yearly budget. Sadly it stopped after the 400 richest Americans.", "label": 0}
{"text": "OP is really out here trying to win the “No. 1 Redditor” award based on their responses in this post.", "label": 0}
{"text": "The left has institutionalized ideas that marginalize men. Leftist ideologies tend to have ideas such as “the patriarchy” that leads to minimization on the plights of men and boys.\n\nI can assure you, the right actually responds to men. Quite a growing population of young men especially feel they are being discriminated against in favor of women etc. This starts from the early education classrooms , all the way down to the universities and economy. \n\nThe progressive push for women’s rights and equality has come a long way. Nothing controversial there. \n\nThe issue comes up when in this modern context men are struggling and suffering. Overrepresentated in so many terrible statistics (deaths of despair, overdose , lack of upward mobility) — and how questioning any of this usually results in questioning leftist ideas like “the patriarchy” , which results in ->\n\nMany left leaning spaces do not listen to the plights of men. At worst there’s even ideological  pushback around men being oppressors as I said in the beginning. The end result is a negative feedback loop where men (straight men, white men, or any men deemed to be in the oppressor binary) increasingly get pushed out.\n\nThese men end up being alienated and lost , and at best it seems many left leaning spaces only seem to care about men in the sense that they are not scooped up by bad actors like Tate. \n\nBut the right simply tends to emphasize the importance of men often in a traditional context.\n\nDespair is what’s making young men lean right. They are turning to what they believe is actually functional relative to their experiences living in a left leaning environment.", "label": 0}
{"text": "And the rest of US cities are just port cities as a warehouse for the Chinese companies.", "label": 0}
{"text": "For what it's worth, I quickly opened the image in photopea and used the color picker: [I'm seeing #F5F5F5](https://imgur.com/a/NbX2pIz). Looks like something went wonky rendering the output, despite your intentions.", "label": 0}
{"text": "Lol. You'd think a woman with that sort of moxie might like to vote for a woman herself.", "label": 0}
{"text": "Could it be that a *lot* of women think that abortion is evil?  Why yes, yes it could.", "label": 0}
{"text": "My mother and sisters are strongly pro-life.  Exuberant when it Roe was overturned.", "label": 0}
{"text": "Oh man I didn't realize the US law **forced** you to use the exact same labels! I'm glad you brought this up before I messed up and got arrested.", "label": 0}
{"text": "Activist Democrats didn't want Biden.", "label": 0}
{"text": "> the people who built some of the most valuable companies to ever exist\n\nYou mean the engineers and workers?\n\n> There is nothing you can do convince me\n\nSo you're saying that this is your religion, not a rationally arrived-at belief.\n\nThanks for admitting that.", "label": 0}
{"text": "How does one objective differentiate between “A” and “B” horror movies?", "label": 0}
{"text": "Beauty is certainly in the eye of the beholder", "label": 0}
{"text": "The titles in the data are what IMDb defined pulled b-horror. But, to answer your question B-horror movies are usually defined as horror movies with “low budgets”.", "label": 0}
{"text": "Can't have tithing without members, so breed as many members as possible.", "label": 0}
{"text": "What makes you think she'd never vote for a woman?   If a **pro-life** woman was on the ticket, she'd certainly vote for her.\n\nAlso note: she was a union shop steward; very, very pro-labor, and very culturally conservative.  She also hates that unions are required to defend the laziest most incompetent workers who should be run out on their arses.", "label": 0}
{"text": "Yes. Opinion is one thing, action is another.", "label": 0}
{"text": "no paywall version [here](https://archive.is/5T8kx#selection-6620.0-6620.3)\n\nSummary table \"Jobs with the largest shifts in relative income, 1980-2022\",  Among occupations with at least 50,000 full-time workers in 1980 and in 2022.\n\n|**Largest gains**<br type=\"_moz\">|**Largest losses<br type=\"_moz\">**|\n:--|:--|\n|Computer programmers|Construction and mining supervisors|\n|Financial specialists|Butchers and meat processors|\n|Securities commodities and financial services sales|Transportation supervisors|\n|Other sales workers|Radio and telecom workers|\n|Pharmacists|Brick masons|\n|Doctors and surgeons|Truck and tractor drivers|\n|Lawyers and judges|Shipping clerks|\n|Bank and financial clerks|Postal clerks|\n|Registered nurses|Metal and plastic workers|\n|Dentists|Stock clerks and order fillers<br type=\"_moz\">|", "label": 0}
{"text": "I understand that so-called pro-life is a deal breaker for many. Unfortunately, in practice, those policies are harming a lot of women who are losing access to healthcare. \n\nI also understand why a shop steward would be repulsed by slackers, but slackers aren't exclusive to union shops, and in either case a President of the United States isn't in the HR business, but rather advocates for workers' rights (or not much).", "label": 0}
{"text": "The engineers and workers just did as they were instructed. None of them are capable of building such a business in their own. \n\nI don't know where you are getting religion from. I'm just looking at observed evidence. You just sound jealous", "label": 0}
{"text": "No particular reason. Other than a television representing the action of “viewing”, it’s very contrary to the point. An image of just a static tv would’ve done a better job.", "label": 0}
{"text": "Colorado has a surprisingly high number of educated white people compared to the surrounding states, yet they still elected Lauren Boebert repeatedly, a white woman who barely finished her GED (failing multiple times) as an adult.", "label": 0}
{"text": "Yes, please.", "label": 0}
{"text": "Hmmm, I don't see \"Thankskilling\".", "label": 0}
{"text": "George W Bush was a better speaker than Obama? Seriously?", "label": 0}
{"text": "in maine, the overwhelming majority of the black population are african immigrants and their children who are all well supported by the maine state government and local municipal governments.", "label": 0}
{"text": "Oh, yea you would never be able to get the 3/4s or all states (or 67%? I can’t recall for ratification, but you get 7 years to do so before it’s stuck down). \n\nI don’t understand how this system can continue to work. The US will eventually be much more densely populated, likely with new cities in places we didn’t really bother with before (has anyone seen how insane Phoenix is?). I don’t see how you could keep just adding bodies to congress either. \nAnyway, that’s how you end up with way over representation of a place like Wyoming or Montana.", "label": 0}
{"text": "Right, I agree with all that. I'm just saying it could actually turn out to be a massive landslide. I don't think it will be, but we don't know for sure until the votes are counted.", "label": 0}
{"text": "Don't forget we get all the other states shitty drivers half the year too it's fantastic.", "label": 0}
{"text": "I know, it's just frustrating.   Women vote a certain way sometimes because of fear, to please their partner, due to how they were raised, internalized misogyny,  etc.  I am not helping by victim blaming,  but women could have so much more power if they weren't afraid to use it.", "label": 0}
{"text": "I used the caregories in the data source. Prove it is wrong.", "label": 0}
{"text": "Why, Nazi-boy?", "label": 0}
{"text": "My favorite is that 3 out of the 5(total) black dudes in Maine have one.", "label": 0}
{"text": "Take it up with the US census.", "label": 0}
{"text": "> There is nothing you can do convince me\n\nSo your belief is unfalsifiable, therefore a religion.\n\n> The engineers and workers just did as they were instructed\n\nAww, it's cute that you think that.\n\nWhen workers go on strike, companies die.  When CEOs go on strike, efficiency goes up.  When shareholders go on strike, nobody notices.  Which one is the most important, again?\n\n> None of them are capable of building such a business in their own.\n\nLooks at all the data that shows that on a fair playing field cooperatives do best...", "label": 0}
{"text": "I crossed Wyoming along I-80 in February once, there were a few pretty spots, but most of Wyoming was barren, boring very windy and very cold. \n\n\n\nI had such a strong head wind that at times the 26' Penskee truck I was driving could only do 35MPH at full throttle. \n\n\nI had concerns that if I had a breakdown from the sustained high power output hypothermia would be a serious risk.", "label": 0}
{"text": "Stop buying things from china.", "label": 0}
{"text": "so, there may be a november surprise for her?", "label": 0}
{"text": "Have you heard of this thing called...male strippers? 😱", "label": 0}
{"text": "Ah yes, this can only be the start of a fruitful discussion.\n\nIsn't it obvious? Because of equality. Why would you not make sure everybody is on equal footing? That sounds very supremacist of you.", "label": 0}
{"text": "All of them were born to upper middle class families that gave them a boost.  All of them had luck in being at the right place at the right time.  They all have been hard workers and focused.  \nIf Gates’ mother had gotten him an in with IBM, he wouldn’t have marketed DOS.  That doesn’t mean that he wouldn’t have been successful.  \n\nIf Talyor’s parents didn’t move to Nashville to help her career, I doubt she would have been as successful.  People have helped her transition to pop music where she has blossomed.\n\nJeff Bezos recieved investment money from family for an online bookstore.  While that was successful, it was his IT guys that convinced  him into web hosting rather than out sourcing that made him a Billionaire.  He also had a wife who was a great partner in the business.\n\nWarren Buffett has slowly built his wealth with his partner C. Munger.  Part of his success is because of the time in history he invested.  He is a very smart man.\n\nAs for Elon Musk, I do not like or dislike him.  There have been a large number of people that have been the reason for his success.  I do not question that he is really intelligent in certain areas.  I just have serious doubts about him caring about anyone but himself.  That can result in bad results for many many people.", "label": 0}
{"text": "Do you think there’s one black person in maine?", "label": 0}
{"text": "Only an utter moron (that would be you) would make such a claim. Equality is for micro-organisms. Accomplishment is for human beings.", "label": 0}
{"text": "Okay, tell me how to take Latino out of all the other groups so nobody is being double-counted. I'm waiting for your brilliant insight.", "label": 0}
{"text": "not what I'm suggesting. It's \"what is the aggregate percentage of people in a state that have a bachelor's degree?\"", "label": 0}
{"text": "I didn’t even know we had a president named Millard Fillmore", "label": 0}
{"text": "C’mon do the Californians rant. Ya know you want to.", "label": 0}
{"text": "I would've liked to see it ordererd by presidency and not increasing # of links", "label": 0}
{"text": "One ad hominem, two sentences without an argument.\n\nThat went as expected.", "label": 0}
{"text": "Make Millard Fillmore linked again!", "label": 0}
{"text": "Having these in chronological order would also be interesting, as you will see who stands out more.", "label": 0}
{"text": "Never heard of any of the names up until and including William McKinley ( except for John Quincy Adams). James Madison and the rest after, I've heard of before. (I'm not American btw). ", "label": 0}
{"text": "I like that you included Grover Cleveland twice on this graph, even though you didn’t order it chronologically.", "label": 0}
{"text": "Damn you [Know Nothing](https://www.google.com/search?client=ms-android-samsung-ss&sca_esv=edbb35aa7c229dd2&sxsrf=ADLYWILqlyO6A4pR7Shd0UbvAtlcXntPvw:1730064286378&q=Know+Nothing&si=ACC90nzx_D3_zUKRnpAjmO0UBLNxnt7EyN4YYdru6U3bxLI-L9PcBjR3D-qGK-AO7wy4E9qrodF2ifEkMFzEY_ASMjRnGJLrYC0lJ7lFAFFNfhPhjtQPWUsty3Ia4LebxFDWuT1rHV9Pq_JZ_lqcjHSYq2QiSNZ3YQROXBU20PX7WUpumxbLoSlN3Oie4nAVmoCHewL1tbQ7&sa=X&ved=2ahUKEwiUlOnZv6-JAxWahP0HHeeCHU8QmxMoAHoECDMQAg&biw=360&bih=697&dpr=3)", "label": 0}
{"text": "Source(s): https://en.m.wikipedia.org/wiki/Elections_in_Arizona\n\nhttps://en.m.wikipedia.org/wiki/United_States_presidential_elections_in_Arizona\n\nTool: plotly.com", "label": 0}
{"text": "it's an \"ironic\" sub most hours of each day", "label": 0}
{"text": "Yup I would list him before a few others when I name all the presidents because I've heard mention of how unknown he is so many times. Couldn't tell you any other fact about him though.", "label": 0}
{"text": "….and to add to the irony he was a member of the Know Nothing party.", "label": 0}
{"text": "Mallard Filmore may be more famous.", "label": 0}
{"text": "Nice graph, immediately very intuitive and informative!\n\nAlso it's really interesting to see those numbers. Let's hope that trend continues for the upcoming election", "label": 0}
{"text": "u/AgreeableBagy I'm waiting", "label": 0}
{"text": "That's not a meaningful comparison, since each state has a different proportion of each race. If you want to make a comparison, direct comparison to the most common race (White in all 50 states) would be the most valid.", "label": 0}
{"text": "it is meaningful, because it allows me to understand how much a particular group in a particular state varies from that state's average. just having the absolutely percentage is unhelpful because California and Mississippi have much different rates of educational attainment, regardless of race.", "label": 0}
{"text": "Most Natives get free college tuition but apparently don’t take advantage of it as much.  and Asians will do just about anything to get more education.", "label": 0}
{"text": "English Wikipedia or all Wikipedia?", "label": 0}
{"text": "And if they do insist on sorting it this way, *why ascending order*?!", "label": 0}
{"text": "I tried around a bit [here](https://wiki.spaceface.dev/). Eisenhower has a direct link. A lot of the early presidents are linked by [Freemasonry](https://en.wikipedia.org/wiki/Freemasonry).\n\n>In the early 1920s, many of Mussolini's collaborators, especially the leaders in organizing the March on Rome, were Masons. The lodges hailed [fascism](https://www.wikiwand.com/en/articles/Fascism) as the saviour of Italy from Bolshevism; however, Mussolini decided he needed to come to terms with the Catholic Church, in the mid-1920s, outlawing Freemasonry.\n\nMost surprisingly: Abraham Lincoln links to Cold War which links to Fascism.", "label": 0}
{"text": "I'm actually a little surprised Donald Trump doesn't have a greater number of links.  Not because of his infamy, but simply because he has been a recognizable part of American culture for decades even before he ran for president.", "label": 0}
{"text": "> didn't bother to look closely at the graph \n\nSuch dataisbeautiful", "label": 0}
{"text": "Don’t be needlessly snobby.  I’ve seen plenty of awful visualizations on this sub and this doesn’t even come close.  There is nothing wrong with ordering it by link count.  I would have liked to see it both ways frankly so I could see the drastic changes between presidents and then easily see the top and bottom 5.\n\nUsing a pie chart would be awful data visualization.", "label": 0}
{"text": "\"Why do you look at the speck of sawdust in your brother’s eye and pay no attention to the plank in your own eye? How can you say to your brother, ‘Let me take the speck out of your eye,’ when all the time there is a plank in your own eye? You hypocrite, first take the plank out of your own eye, and then you will see clearly to remove the speck from your brother’s eye.\"", "label": 0}
{"text": "The 2 Grover Cleveland’s could be combined", "label": 0}
{"text": "It has the points labeled. So the percentage of the vote for 3rd party in that year is in the text at the data points. \n\nFor example the high point for Perot was 25%, and the 3rd party in 2016 was 7%. Perot 2.0 in 1996 was 9%. \n\nHere is the source for the data which might help.\n\nSource: https://en.m.wikipedia.org/wiki/Elections_in_Arizona\n\n\nDesign wise, adding it on the same scale as the D and R % would show it relative to the other two, but it stretches the graph vertically. In this graph the D and R % y-axis starts about about 25%, and clips the lower percentages. Putting the 3rd party percentage points on the same axis puts the yellow line way down at the bottom of the graph and you have to know to look for it.\n\nBut putting the 3rd party % on its own y-axis has the effect of projecting that population so that it is visually overlayed onto the other two, so you can see when it makes a difference more clearly.\n\nUnfortunately, the tool didn’t allow me to make a clear second y axis on either side, it stuck one on top of the other so you couldn’t read either, so I hid it. And added the labels to the points instead. But the scale essentially goes from 0 to 30. ", "label": 0}
{"text": "Black and African American aren’t the same", "label": 0}
{"text": "35% of 64M is still a lot.", "label": 0}
{"text": "https://www.redbubble.com/i/t-shirt/Brownie-the-Massage-Enthusiast-by-CanadaDefense/165596422.WFLAH", "label": 0}
{"text": "And that 35% is more than welcome to never have an abortion if they so choose. Better yet, they're welcome to not have sex unless they are actively trying to have children. \n\nLive your lives, just stop being evil enough to force your choices on others.", "label": 0}
{"text": "Next i would want to see a comparison of growth in D support to population growth from california.\nSee if its shifting values or shifting population.", "label": 0}
{"text": "No it was intentional though for a different graph were they were ordered chronologically you can see it here -> [https://docs.google.com/spreadsheets/d/1zQE1nYwmGfU0uItLEGQSTbKpxcvR-TZC3aJ8d5yFtB4/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1zQE1nYwmGfU0uItLEGQSTbKpxcvR-TZC3aJ8d5yFtB4/edit?usp=sharing)", "label": 0}
{"text": "Facts don’t care about your bible quotes. Maybe look into some of them about the antichrist and that to compare to Trump.", "label": 0}
{"text": "Definitely did. Im born and raised in AZ, and whether you liked his politics or not, John McCain was pretty much universally respected as being a genuinely decent human. \n\nAt the same time, it really is just getting more blue in the state. The towns are all still extremely red, but there has been a palpable shift in Phoenix and Tucson compared to even 10 years ago. More young professionals moving in, and the GOP is losing more voters to old age every 4 years.", "label": 0}
{"text": "You can quickly see the top/bottom if they’re chronological though. It’s really easy to see which bars are lowest and highest, it’s a lot harder to find George Washington on this graph ", "label": 0}
{"text": "I swear to god I’ve looked at a list of US presidents probably 50 times in my life and could tell you about each one, at least a little. \n\nI’m staring at Millard Fillmore and I swear someone is Barenstien bears-ing me. I had to look up his wiki to make sure he’s real.", "label": 0}
{"text": "21,775 as of 2022.", "label": 0}
{"text": "It's not actually showing as #999999 anyway, I popped it into my phones image editor, sampled the color, and like others say it's #F6F6F6 which is a lot closer to #FFFFFF than #999999", "label": 0}
{"text": "I’m just shocked Rhode Island isn’t on here", "label": 0}
{"text": "It really is entertaining", "label": 0}
{"text": "Scatter plot 🤘", "label": 0}
{"text": "You know it would infuriate Trump to find out that he's second to Obama.", "label": 0}
{"text": "Stolen comment: https://www.reddit.com/r/dataisbeautiful/s/p9xDXOd56J", "label": 0}
{"text": "Definitely was enough to lose in 2020, but it’s forgotten now because Meghan McCain now supports Trump", "label": 0}
{"text": "A mountain named after him, even though McKinley had never been to Alaska (he was from Ohio) and the gold miner who decided to name it for him did it even before he was elected as the namer was a McKinley supporter during his Presidential bid. It only recently was officially renamed \"Denali\", which is a historical name for the mountain by Alaskan Natives, having been blocked from a name change generally from Ohio congressmen.", "label": 0}
{"text": "Because you get so much extra bs", "label": 0}
{"text": "True and recent polls and the methodology review and deep dive on stats I've been doing off and on shows some significant problems with the current way polls are accomplished. Polls make too many assumptions, rely too heavily on subjective likelihood a registered voter will actually vote. They also suck at reaching a proper demographic of voters. Truth is the voters they have been reaching are older, more conservative, richer, and more vocal.\n\nThe difference between the biased, and in some cases based on the demographics data of some polls, possibly fabricated polling we are seeing right now is something a person could research. Meanwhile betting market data is influenced by a lot of factors. Factors that can be manipulated by donors ... accusations that Musk has been manipulating these markets seems likely. We can't always see what is going on behind the scenes, and even when we can the delay means the damage is already done by relying on these.", "label": 0}
{"text": "Not the most accurate? What is \"Arabs\" for instance?", "label": 0}
{"text": "correct, with one exception the silent generation is actually the most conservative, they are very old. Their are not very many left but it is absolutely still enough that they decide ever election. These are the people 78 and older.  they will almost all be gone in 10 years.", "label": 0}
{"text": "Hello /u/dublecheekedup! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gds0vt/budget_for_city_of_los_angeles_for_20242025/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gds0vt/budget_for_city_of_los_angeles_for_20242025/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "We need to #grabhimbytheballot2025", "label": 0}
{"text": "Do you want some cheap TWTWQHGHGGH brand USB cables?", "label": 0}
{"text": "That terrible ad was NOT from democrats. That was from the lincoln project which is republican run. They are anti-trumpers but they are not democrats.", "label": 0}
{"text": "G-Unit Harding.", "label": 0}
{"text": "no problem, please fell free to adjust your original comment to reflect new information, if you like", "label": 0}
{"text": "How did it change from 23-24? Was there a big reduction in police funding after the BLM protests and this is re-funding them? Or is it just much higher now compared to previous levels?", "label": 0}
{"text": "Trump is going to be so mad. He just can't win.", "label": 0}
{"text": "If it was people would cry about it not being ordered by number of mentions", "label": 0}
{"text": "Oh snap, you’re telling me a billion dollars would only keep one of your company jets going for 350 years? Oof. Mo money, no problems I guess.", "label": 0}
{"text": "Most Asians would have over here recently and if you have the ability to move cross state you are likely more educated and wealthy on average, same with black people in Maine as another user replied.", "label": 0}
{"text": "You are being downvoted for missing sarcasm not for being wrong btw", "label": 0}
{"text": "Your Canada theory is ridiculous and completely bogus. A very small number of Black people immigrate from Canada. You can look at several articles about Canadian immigration to the US and see that the theory described by KiwiNotFound is incorrect and that very few Canadians even immigrate to those specific states to begin with [https://www.migrationpolicy.org/article/canadian-immigrants-united-states-2021](https://www.migrationpolicy.org/article/canadian-immigrants-united-states-2021)", "label": 0}
{"text": "More likely explanation:\n\nPeople who answer polls are specific demographics that skew Republican. \n\nPeople with spare money to throw away on election betting is also probably a skew towards Republicans", "label": 0}
{"text": "Reddit version of stolen valor?", "label": 0}
{"text": "I did not realize the full word is mole.", "label": 0}
{"text": "I see you snuck in Grover Cleveland twice.  Respect.", "label": 0}
{"text": "Germany doesn’t have a two block system. We have already seen various coalition governments in Germany: CDU+SPD, CDU+Green, CDU+FDP, SPD+Green, SPD+Green+FDP. By the way, if Germany has single-member-district system, the far right AFD could have already won the majority with like 34% of the votes.", "label": 0}
{"text": "I know you’re joking but from talking to people in poorer countries the great majority of them don’t care about it. Having a cheap android instead of iPhone, using public transportation, living with their parents, drinking milk instead instead of ultra-filtered 0% fat with extra protein milk, and not having 7 types of insurance aren’t a big deal for them.", "label": 0}
{"text": "I think clean, sanitary streets will call for gentrification and crime reduction, saving on police expenses. The LA mayor thoughts are opposite to that.", "label": 0}
{"text": "That’s right,  a lot of the Filipinos take up nursing 🤱💉and easily get within the six-figure range.\n\nSource: am Filipino and have like 4 family members who are nurses and one who is an NP 🤷🏻❤️ ", "label": 0}
{"text": "That was the first thing I noticed. No matter what, he will never beat him!", "label": 0}
{"text": "You’re not gonna get a correction while people can still make their payments", "label": 0}
{"text": "MEDIAN overtime is 10 hrs a week? Is it just me who finds these hours crazy? I'm not sure that working basically 6 day workweek would be worth to me to have +30% salary.", "label": 0}
{"text": "Why is Grover Cleveland listed twice?", "label": 0}
{"text": "Hello /u/themellwood! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1gdwkco/how_the_rest_of_the_world_would_vote_in_the_us/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1gdwkco/how_the_rest_of_the_world_would_vote_in_the_us/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "i mean, ok?  but values in 2008 where equity and ability to pay werent there.. yea 2008 was fluffed numbers, but its still kinda a crunch?  120k net.  but we're far and above median income here..  so the spike itself is still meaningful, no?\n\nand those that can 'afford it' are being pretty faily boned, or eager to transfer home equity.. first time home buyers are still fully well reamed in the bum bum.", "label": 0}
{"text": "Makes sense, considering those votes are about what's best for their countries, not for the US.", "label": 0}
{"text": "You need whose votes to reflect what?", "label": 0}
{"text": "Is there any other sub that actually has well done data visualizations?", "label": 0}
{"text": "How many voted per country? Some of these percentages are oddly round numbers (e.g. 100% vs 0%, or 20% vs 80%), it makes me think it's just a handful of votes on that platform.", "label": 0}
{"text": "Why don't people build one. Isn't it cheaper to build one yourself", "label": 0}
{"text": "Hi, if anyone has got a sim card registered to EE and on payG or I think payM, if you can text 150 and type BLACKOPS6 you can get a code for an in-game item, so would you DM it? My son keeps buzzing me to get it, and would appreciate, could trade a 10 bucks gift card aswell", "label": 0}
{"text": "This and r/MapPorn don't need the circlejerk.", "label": 0}
{"text": "I guess black people don’t exist in Wyoming", "label": 0}
{"text": "Why is the caloric value different", "label": 0}
{"text": "They’re called Asians for a reason, not Bsains", "label": 0}
{"text": "Kill the spaces between the spoiler tag.\n\n>!This!< not >! This !<", "label": 0}
{"text": "Not an expert. It seems to show a relationship between how much vegetation is in a river to the salmon density. The line moving up would indicate. The more of the fruit more salmon will be there. And vive versa.", "label": 0}
{"text": "Stop spamming your website. This is the [original source](https://www.reddit.com/r/dataisbeautiful/wiki/rules/rule2/): [https://www.resiclubanalytics.com/p/the-affordability-strained-housing-market-as-told-by-one-chart](https://www.resiclubanalytics.com/p/the-affordability-strained-housing-market-as-told-by-one-chart)", "label": 0}
{"text": "What's being stated here is that both converge to the market average?", "label": 0}
{"text": "literally nothing has even happened, this is more of an ad", "label": 0}
{"text": "Is Hawaii the same for every race?", "label": 0}
{"text": "I know pretty much nothing in terms of electricity consumption (metrics, time ranges, wattage to £ spent), so if don't mind, can you tell me how you manage to identify your fridge as the most energy-intensive home appliance you own?\n\nDid you install some sort of energy use logging device between the wall and the fridge power cord?", "label": 0}
{"text": "I think we need to map out the number of sexual partners and cross over in the Greek pantheon. Including pregods stage titans", "label": 0}
{"text": "It was an old fridge so I had suspicions to begin with. Anything that exchanges electricity for heating or cooling are going to be top consumers (other than things like computers or TVs). \n\nI bought a watt meter and fitted inline with the plug. It measured a poor power factor of 0.6, indicating it was not efficient to the phase of the incoming. And then obviously the wattage consumption reading tracked over a week was extremely high to what I want.\n\nFor reference, I estimated about 750kWh/year for the old fridge based on actual reading (~2kWh/day). \n\nNew fridge uses about 1kWh/day measured. \n\nAt current UK rate of 23.7p/kWh, a year's costing;\nOld fridge - 750kWh = £178/year\nNew fridge - 365kWh = £86.5/year\n\nObviously I now have a good few years to payback, using the saving, the cost of the fridge. But I was due a new one anyway.", "label": 0}
{"text": "Pretty much.", "label": 0}
{"text": "Nice article.\n\nSee my website for election predictions using an entirely new method.\n\n\n\n[https://medium.com/@tsardoz/2024s-electoral-math-the-numbers-beyond-the-polls-3fbd60502d9b](/@tsardoz/2024s-electoral-math-the-numbers-beyond-the-polls-3fbd60502d9b?source=responses-----8639872d6868---------------------respond_sidebar-----------)", "label": 0}
{"text": "Tracked daily and created using Open Office.  The 2023 data is similar to 2022 but is missing a few months.", "label": 0}
{"text": "Thanks for clarifying.  I'm not in the states so this all seem weird to me cuz here in my country it's easier to build a house yourself.", "label": 0}
{"text": "LOL X is a neutral social media?!?! Really dude, that's what you've got? Elon fucking musk runs it and the dude is as right wing as they come.\n\n Any extra voter ID is unnecessary because the system already works, illegals and non citizens can not vote. Adding additional beaurocracy to a system that already works is an attempt to damage it. Again, do you not see you have zero evidence of it actually happening? Do you not know that voter applications coming from illegals and non citizens are denied? They aren't getting the chance to vote. \n\nLike imagine if thousands of felons started applying for job positions at schools. In your world, headlines would read that our kids minds are being poisoned by criminals. But its missing something important, they don't get hired. It's the same thing.\n\nLook, I dont blame you for getting caught up in the political circus but take a step back and realize this so called \"problem\" of illegal votes literally does not happen. Go call up your local election board and ask, they will tell you it is impossible.", "label": 0}
{"text": "I can get half a liter of beer for under 50ct if I don't go out lol. Not that difficult moneywise.", "label": 0}
{"text": "The male liver can handle 14 units of alcohol a week (no one ever taught me this). See if you can come down as efficiently as you can", "label": 0}
{"text": "Would be interesting to see money spent each week on alcohol purchases and also hours of sleep and general well-being index each morning", "label": 0}
{"text": "So you average 3 drinks per day!? Jeez that's a lot of drinking.", "label": 0}
{"text": "You are severe risk for many alcohol related issues including damaging your liver. My spouse works in liver transplant and you do not want that.", "label": 0}
{"text": "r/SoberCurious is an excellent resource if you're thinking about changing some things up! I did a Sober September and it was life changing. I am back to drinking but it is nowhere near what I was craving beforehand.", "label": 0}
{"text": "Bro, our lower level is still crazy high on average. You need help.", "label": 0}
{"text": "You can buy a handle of shitty vodka for $12. If a 30 ml shot counts as a drink, that's ~58 drinks, at less than 22¢/drink. Alcoholics aren't spending money on the good stuff.", "label": 0}
{"text": "> no one ever taught me this\n\nSo you just made it up?", "label": 0}
{"text": "I definitely thought the UK would be on top!", "label": 0}
{"text": "There are 28 houses for every 1 homeless person, the problem is not supply.\n\nIts lack of regulation for consumer rights.", "label": 0}
{"text": "Have you genuinely considered rehab?", "label": 0}
{"text": "Dang, what's November 5th gonna look like?", "label": 0}
{"text": "Homes were pretty reasonably priced 7 or 8 years ago.  Do you really think that our population exploded in that time to the point where serious constraints on supply would result in market conditions where real estate would double in those 8 years?\n\nIt's the investors.  They had free money to borrow in 2020 and 2021 and they bought a quarter of all residential real estate in that time.", "label": 0}
{"text": "Have you tried Athletic NAs (or some other brand)? I'm a fan of their hazy IPA. Sometimes I feel like a beer after work but don't want to mess up my sleep. ", "label": 0}
{"text": "For alcoholics, maybe. Not for anyone else. ", "label": 0}
{"text": "I recommend excercise/lifting. It will diminish the withdrawl as your body will physically require/feel the need for nutrients and protein to recover.", "label": 0}
{"text": "Alcoholics are not inebriated at that amount.  \nThey have a very high tolerance.  \n\nAlso: you can enter the data before hitting that apex.", "label": 0}
{"text": "obviously. alcoholism is quite common", "label": 0}
{"text": "Hello /u/False-Confidence-168! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1ge0eh2/how_many_documents_are_available_on_a_regular/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1ge0eh2/how_many_documents_are_available_on_a_regular/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "This is what I understand too.", "label": 0}
{"text": "what the fuck, i have to pay 9 euros for 0,7 liters", "label": 0}
{"text": "That’s still a shit ton of alcohol to consume", "label": 0}
{"text": "Bro had a seizure on week 22", "label": 0}
{"text": "Everyone who drinks is addicted to alcohol - there are no “alcoholics” - it was a term invented by AA to convince people they have a problem. The problem is the highly addictive nature of alcohol.", "label": 0}
{"text": "If he was presenting a decreasing trend in heroin use would you still applaud that progress? Guy’s still poisoning himself and needs help", "label": 0}
{"text": "That’s a lot of potential weight to gain", "label": 0}
{"text": "Data is not beautiful today", "label": 0}
{"text": "\"You tend to pick up where you left off\"\n\nI'm no doctor, but if you're 30 a week is spread evenly that is about 4 a day and for some, that's sustainable for decades. Some people (in particular women) would have pretty noticeable damage within a few years.\n\n50-55 is a week is going to be pretty damaging, but again some people do it for quite some time.\n\nOnce you get over 100/week, most likely your gonna crash and burn hard pretty quickly, that's about a fifth of 40% liquor per day.\n\nTo OP: I know not drinking is suuuuper hard, but you should consider an extended period of sobriety. How you get there doesn't matter, but I think 6 months or more would give you a good comparison to see if life is better without the hooch.\n\nIf not, my non-medical suggestion is to drink a maximum of 3 days a week (\"more days off booze than on\") and keep the # of drinks to 6 or less or at least stay in the single digits. Godspeed brother.", "label": 0}
{"text": "I did a similar thing with food back in March. Went from eating 100g of sugar and 4000 calories per day to 0g sugar and 1300 calories per day for the whole month. Can’t exactly recommend it, but it reset my whole perspective on food.", "label": 0}
{"text": "Meh - I'll survive.", "label": 0}
{"text": "On the 2024 side it's clear you're trying to better yourself, but that steady upward trend all summer has to have you concerned.", "label": 0}
{"text": "Incredible! This is my next goal to reach. This sounds similar to Whole 30 - is that what you did?", "label": 0}
{"text": "Not at all - don’t make comments like this - alcohol is straight up flavored ethanol and the only “safe” amount is zero.", "label": 0}
{"text": "I’d post my own, but it wouldn’t be that interesting, as it fully flatlined during the summer 😁 almost 100 days soon!", "label": 0}
{"text": "Those are some really high numbers. It’s implied in some comments but seek help.", "label": 0}
{"text": "This is not as pretty as the coloured daily ones that often appear at New year. The daily ones can help highlight weekly patterns but the humble line graph here is probably more useful, showing which weeks were worse than others.\n\nTo OP and all those who posted similarly in January, good luck, and may the faithful recording of data be followed by better outcomes this year.", "label": 0}
{"text": "These are what helped me stop drinking. I was a 10+ beer a night guy like OP. I might have a drink or two on occasion still. But I just straight up don't think about it. I truly don't think I could have made it through the first month without the athletic na beers.", "label": 0}
{"text": "I was going to go to joke about those rookie numbers but you sir have early death professional on target", "label": 0}
{"text": "She is not a compelling candidate to anyone that doesn't hate Trump. If the DNC had held a primary instead of selecting who they thought was best, this would probably be a different story.", "label": 0}
{"text": "That’s called binge drinking", "label": 0}
{"text": "I am actually most impressed you are able to record the data.  I was able to cut out a lot of drinking by trying to lose weight and counting calories.  That lasted about a year and also led to other vices but such is life.", "label": 0}
{"text": "This is about what my uncle was drinking in the months leading up to his death. He had a heart attack during the night. His daughter found him. She turned 18 a week later.", "label": 0}
{"text": "Rich alcoholics certainly are.", "label": 0}
{"text": "In the U.S. it’s probably like 5%.", "label": 0}
{"text": "There was a great infographic in a [Washington Post article](https://www.washingtonpost.com/news/wonk/wp/2014/09/25/think-you-drink-a-lot-this-chart-will-tell-you/) on this.\n\n50% of Americans drink effectively 0 drinks per week, the next 10% average less than 1 a week, the 10% after that average 2, the 10% after that average 6, and the 10% after that average 15 (well into alcoholism territory). The top 10% consume nearly 74 drinks a week on average. 10% of American society is continually drunk out of their minds.", "label": 0}
{"text": "Saving your kidneys and money. Proud of you stranger.", "label": 0}
{"text": "I don’t think that’s true.. I drink but am certainly not addicted.", "label": 0}
{"text": "If this isn’t the biggest cry for help I don’t know what is sending t’s and p’s.", "label": 0}
{"text": "Please take a look at kindling: [https://rehabsuk.com/blog/alcohol-and-the-kindling-effect-everything-you-need-to-know/](https://rehabsuk.com/blog/alcohol-and-the-kindling-effect-everything-you-need-to-know/) repeated withdrawals become harder, not easier.", "label": 0}
{"text": "wtf, alcohol aside 14 beers is over 2000 calories, how do you even eat enough to keep your body fueled?", "label": 0}
{"text": "i mean.. 10 drinks a week is not that bad.. its regular consumption and it's not good for your health, but it means drinking 1 small 33cl beer every night, and 2 on the weekends... it's not that bad\n\n90 drinks a week.. well.. that's really concerning", "label": 0}
{"text": "Love that. \n\nYou gotta be a wonk to measure your own alcohol intake. \n\nMust know my husband. He’s the Rain Man of lists.", "label": 0}
{"text": "OP some resources:\n\nhttps://www.recoveryelevator.com/podcasts/\n\nhttps://www.goodreads.com/book/show/6762.The_Easy_Way_to_Stop_Drinking\n\nhttps://www.goodreads.com/book/show/36982602-this-naked-mind\n\nWish you well mate 🙏", "label": 0}
{"text": "Looks like you’ve got some serious work to do to catch up to 2022", "label": 0}
{"text": "Congratulations on 1 year!🥳", "label": 0}
{"text": "You know how I stopped drinking alcohol?\n\nSmoke weed. As an ex alcoholic you are still in a very dangerous place. Good to see you're drinking less as time passes.\n\n(Yes i know weed is just swapping one addiction for another, but maaaan was it easier to quit)", "label": 0}
{"text": "Yeah and like 25 of them are in bumfuck Nebraska.", "label": 0}
{"text": "Goal for 2025 is keeping it below 20 per week, you can do it OP.", "label": 0}
{"text": "Just take your time and keep the end goal in mind.  You got this", "label": 0}
{"text": "I'm sure somebody's got money on which ends up happening over at [the website where you can apparently bet on the election](https://www.vegasinsider.com/odds/us-presidential-election/?origin=serp_auto) lol", "label": 0}
{"text": "I grew up in a house where the bed of a truck was filled with empties every couple months or less. I’ve seen it and its effects and I pay a professional every week to help me deal with that fact. What I do see are young people who aren’t really aware or accepting of their problem so I do the bare minimum of checking with binge drinkers when I see it.", "label": 0}
{"text": "Absolutely horrible take. Me waiting all week for a drink on a Saturday night is no where near as related to addiction as someone who needs and craves alcohol all day everyday. That is addiction. \n\nYour view completely undermines the challenges folks with that drive to drink suffer", "label": 0}
{"text": "Wdym, \"prescribe you anything\"? Are you talking meds (benzos) to help you through withdrawal or meds for craving (Campral, Naltrexone)?\n\nMost doctors are not going to be comfortable giving you benzos for an at home detox unless they really trust you AND (this is the big one) you can prove that you will be with \"someone responsible\" monitoring you through the detox, like a spouse, parent, sibling or adult child or very good friend. If this is what you are trying for. see if one of those people would go to doc with you.\n\nIf you're talking meds for craving and to help maintain sobriety, I have no idea why she won't give you those, especially if you go see her after getting to 0 yourself.", "label": 0}
{"text": "As someone who barely drinks, this is a lot more than I would've expected. I probably drink less than OP's average in a week. Good to see that he/she is cutting back", "label": 0}
{"text": "That's not even close to immediately. OP did a week of 10 drinks, a week of one or two, a week of almost 10, then 4 weeks of sobriety. That's a considerable stretch of sobriety for someone who drinks a lot and regularly.", "label": 0}
{"text": "Even discounting the alcohol, that's like four liters of beer per day, right? Your kidneys must've hated it too.", "label": 0}
{"text": "how did they even administer the number of drinks?", "label": 0}
{"text": "8-10 drinks per week is not a \"shit ton\"", "label": 0}
{"text": "Don’t tell an addict any amount is okay. They can’t handle it, that’s the problem!", "label": 0}
{"text": "Not sure I understand... 70+ drinks for some weeks?\n\nI've had some struggles in the past. I've known people who have gone into rehab for alcohol. >10 drinks a day, every day, for a week is a lot not matter who you are.", "label": 0}
{"text": "Our comments don't really conflict. \n\n\nIt's definitely alarming that 10% in that survey are alcoholics. I don't know anyone who drinks that much. ", "label": 0}
{"text": "No they’re not lmao, they’re just getting in petty arguments all over this thread so they can have an opportunity to let everyone know how smart and enlightened they are for seeing alcohol as the poison that it is.\n\nLike the dude drinking 50 drinks in a week is going to change his drinking habits because some smug commenter reminded him that beer is bad for you.", "label": 0}
{"text": "Thank you for that tautology.", "label": 0}
{"text": "I meant the rise from 4 weeks ob sobriety back up to 30 drinks a week, that's over 6 drinks a day for the whole week.", "label": 0}
{"text": "Rookie numbers", "label": 0}
{"text": "Just quit. Your graph illustrates cycles of cutting back following by ramping up. It’s a pretty typical cycle. You can’t control it, the alcohol will always win. /r/stopdrinking", "label": 0}
{"text": "Please take this time you have on this Earth as a blessing.  Not everyone gets the white picket fence, loving family and perfect job.  In fact, the vast majority of people in this world don't have that.  Can you try to taper down so you have a 100% sober 2025?  Reassess where things are after that year to see if you want to drink again.", "label": 0}
{"text": "Good luck on your consumption reduction act 🙃", "label": 0}
{"text": "And here I am having had exactly one drink over the last two years", "label": 0}
{"text": "Dear god that is your daily calorie intake every day from beer.", "label": 0}
{"text": "I dated a functioning alcoholic and she knew which grocery store had the cheapest vodka, which should have been a warning sign.", "label": 0}
{"text": "It’s trending in the right direction. Hope you have a happy and healthy 2025 OP!", "label": 0}
{"text": "I think you already know that you have a problem with alcohol, right? Repeated, unsuccessful attempts to cut down or quit. And a history of physical withdrawal. This chart is a beautiful example of why many people decide they need to quit and stay quit… trying to drink a little always grows back to drinking a lot.", "label": 0}
{"text": "According to the World Health Organization, [there is no safe amount](https://www.who.int/europe/news/item/04-01-2023-no-level-of-alcohol-consumption-is-safe-for-our-health) of alcohol for human consumption.\n\nConsuming any amount over zero harms your health.", "label": 0}
{"text": "Yes why wouldn’t you? No one is saying that OP is at a good level, but it’s still improvement. ", "label": 0}
{"text": "I think I have driven through several percent of French ones. It's absolutely fascinating how many roundabouts they string after one another. You have a main road through a village and it goes from roundabout to roundabout. In the more populated parts, you don't ask how much the highway toll is, unless you have very strong hands. Luckily there are large stretches in the middle that are basically empty, so the density of roundabouts becomes reduced to ... normal.", "label": 0}
{"text": "Fire your doctor then! That’s nuts that she won’t give you naltrexone!", "label": 0}
{"text": "Elections coming up have you drinking again? Ha", "label": 0}
{"text": "No, they're not.", "label": 0}
{"text": "Yes, switch to NA pronto. Do it for the most important person in your life (future you).", "label": 0}
{"text": "Happy fuckin Halloween!", "label": 0}
{"text": "Nice to see the number go down, keep it up. Please consult a medical expert on the regular.", "label": 0}
{"text": "45ml of 80 proof is considered a drink", "label": 0}
{"text": "Statistically, you do know someone who drinks that much. If 1 in 5 people has 15 drinks or more a week (going off the numbers presented in the previous comment), then you likely know several. You just don't know it because they are good at hiding it. There's a reason people throw around the phrase \"functional alcoholic\".", "label": 0}
{"text": "Pace yourself. Abrupt alcohol cessation can be fatal; there are many providers and programs that can support safe cessation/reduction. Wanting to try is such a HUGE step in the right direction! Rooting for you", "label": 0}
{"text": "The Browns deserve this for trading for him. He's a trash human who (at minimum, at the most charitable interpretation) booked dozens of *normal, regular, legitimate therapeutic masseuses* with the express intention of trying to coerce them into giving handjobs.", "label": 0}
{"text": "90 drinks per week?! Yikes, that’s some serious alcoholism.", "label": 0}
{"text": "I knew a dude who would crush a 12 pack after work every day by himself.", "label": 0}
{"text": "Building up to a cracking record year", "label": 0}
{"text": "Thanks all for chiming in...\n\nSo no great explanation of the \"why\" it seems.  So interesting when we see such an \"outlier\" here.  Thanks anyways for the attempts.", "label": 0}
{"text": "The supply is gone because people and corps own tens of hundreds of investment houses.", "label": 0}
{"text": "is your aorta about to rupture or your liver about to give out?  That seems like an insane toll on the body.\n\nI'd be paranoid about the damage i've done", "label": 0}
{"text": "use your brain.  Why would demand be increasing so astronomically when the US population has only grown 8% in the last 12 years? Are there somehow magnitudes more first time home buyers in the market than there were in the past? What data are you using to back up your claims here?", "label": 0}
{"text": "I don't even think I drink that much water.", "label": 0}
{"text": "And you remembered the exact number of drinks you have had each week?", "label": 0}
{"text": "I was pretty shocked at how much they reduced cravings.", "label": 0}
{"text": "You mean, right after AI-induced nuclear holocaust the LA streets will be in pristine condition? Can’t wait.", "label": 0}
{"text": "Lmao why does demand have to come from first time home buyers???\n\nAlso, by your logic, has supply decreased so astronomically in the last 10 years? Home prices have increased over 100%, and you suggested housing supply halved?", "label": 0}
{"text": "Could have been court ordered.", "label": 0}
{"text": "Oh dang, that's just straight-up theft. Looks like another one for the block list!", "label": 0}
{"text": "FFS can all the people in this thread who apparently have never actually seen a beer just pipe down - OP has a doctor, doctor is aware, OP is working on it, OP tracked and plotted multiple years of personal drinking data and what I see is a large reduction in total drinking which is huge, with intention to continue kicking goals. Kudos.\n\nOP almost certainly knows much more than you do about every aspect of drinking, more importantly you know nothing about OP beyond the data presented, please just hush.", "label": 0}
{"text": "Hello /u/shashank-py! It looks like you're trying to post a direct image to /r/dataisbeautiful. **I've removed the current thread,** since you're probably trying to do one of several things. Let me help you with posting.\n\n---\n\n##If you found the image somewhere:\n\nPlease note that we require you to post the [**complete original source article**](https://redd.it/2lokun), so that the readers can get context, the author can get credit, and third parties don't get hits from stealing another person's work. Posts must directly link to the visualization **where it was originally introduced** by the author  **(not an image on the site, but the actual full web page article).** [More information here](/r/dataisbeautiful/wiki/create/rules/rule2).\n\nThe source is rarely Gawker, Tumblr, Imgur, etc. Figure out where *they* got it. Usually a link to the original source is in the first couple paragraphs of where you found it. You may wish to try [TinEye](https://www.tineye.com/) or [Reverse Google Images](https://images.google.com/). If you need assistance, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Need%20help%20finding%20the%20original%20source&message=I%20need%20help%20finding%20the%20original%20source%20of%20this%20image:%20https://www.reddit.com/r/dataisbeautiful/comments/1ge1ehp/i_analyzed_how_i_spent_my_free_time_for_gaming/).\n        \n---\n\n##If you're trying to make a crosspost\n\n**...and** the author of the reddit post is the **original author** of that visual (i.e. you've checked *thoroughly* that the thread you are trying to link is the **first instance ever** of that visual and you've **followed the steps above**):\n\n1. Delete this current thread.\n2. Copy the URL of the Reddit thread you are trying to crosspost.\n3. [Go to the submission page](https://www.reddit.com/r/dataisbeautiful/submit) and paste the URL of the thread.\n4. You are now done. Sit back and reap the karma.\n\nNote that this subreddit does not currently have crossposting enabled. \n\n---\n\n##If you are trying to submit a Wikipedia link:\n\nTry submitting the *Wikipedia* or *Wikimedia commons* link instead of the raw file. A quick look at the URL should confirm this. Compare the following links:\n\n* **Link A:** https://upload.wikimedia.org/wikipedia/commons/5/5f/Minard%27s_Map_%28vectorized%29.svg\n* **Link B:** https://en.wikipedia.org/wiki/Data_visualization#/media/File:Minard%27s_Map_(vectorized).svg\n* **Link C:** https://commons.wikimedia.org/wiki/File:Minard%27s_Map_(vectorized).svg\n\nTake a look at Link A. That is just the image, and is the same issue with hotlinking an article image from a website; there is no context. Now look at Link B. There is a lot of enriching information, e.g. copyright license, author, source, and even a link to the revision history. The same is the case with Link C. In the ideal case, **the B or C examples are the acceptable links.**\n\n---\n\n##If you made the image yourself:\n\n...then you probably just forgot to add `[OC]` to the title. Simply follow the steps below:\n\n1. Delete this current thread.\n2. [Resubmit](https://www.reddit.com/r/dataisbeautiful/submit?sidebar&title=Title%20your%20visualization%20but%20keep%20the%20closing%20tag%20%5BOC%5D#btn) your thread with the phrase `[OC]` somewhere in the title.\n3. AutoModerator will send you a private message instructing you how to cite your post. **Follow instructions carefully.**\n4. If you have done everything correctly, /u/dataisbeautiful-bot will be along shortly to reward you with [flair](https://www.reddit.com/r/dataisbeautiful/wiki/flair#wiki_oc_flair), and sticky your citations.\n\nPlease note that you may **only tag a post as OC if and only if you made it yourself.** We are very strict about [plagiarism](/r/dataisbeautiful/wiki/rules/rule3) in this subreddit. **No, screenshots of someone else's apps do not count.**\n        \n---\n\n##If the original source is otherwise inaccessible:\n\n*Leave this post as-is* and [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=Exception%20for%Inaccesible%20Content&message=I%20need%20an%20exception%20for%20this%20post:%20https://www.reddit.com/r/dataisbeautiful/comments/1ge1ehp/i_analyzed_how_i_spent_my_free_time_for_gaming/%0A%0AOriginal%20link:%20). We'll make an exception for you. In your modmail message, be sure to reference the original document.\n\nYour post will be manually approved by the mod team, and we'll sticky the original link or PDF to the top of the comment thread so our readers can get context.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataisbeautiful) if you have any questions or concerns.*", "label": 0}
{"text": "Been there, done that. So glad I'm sober.", "label": 0}
{"text": "If you look closely, a recurring trend is that every time he cuts consumption, he’ll increase consumption shortly after. \n  \nNot trying to put down OP because the average intake is lower in 2024, but as an addict the most significant trend in this chart is the yo-yo effect of battling addiction.", "label": 0}
{"text": ">If not, my non-medical suggestion is to drink a maximum of 3 days a week (\"more days off booze than on\") and keep the # of drinks to 6 or less or at least stay in the single digits. Godspeed brother.\n\nThis is the kind of rationalizing that has led to OP's ongoing drinking problem. OP can't drink in moderation, we know because they keep trying and failing.", "label": 0}
{"text": "Knowing the personality type of somebody that drinks this much, I am impressed by the accuracy of the data collection.", "label": 0}
{"text": "Drinking away your retirement, please get help/cut back", "label": 0}
{"text": ">I never go out.\n\ngod how i wish", "label": 0}
{"text": "Wow that looks cool. I'd be afraid to have one if these though lol", "label": 0}
{"text": "Downvote and hate my opinion all you want but also think about what you said: “me waiting all week.:…” you are literally fighting a desire to drink - that is addiction my friend.", "label": 0}
{"text": "Point stands. So a drink is now $.33 and so 90 of them is under $30. Affordable.", "label": 0}
{"text": "Mine would have been just a flat line of nothing with tiny spikes going to one or two here an there.", "label": 0}
{"text": "I read that as \"ask your doctor for another doctor\" lol", "label": 0}
{"text": "90 drinks a week is crazy wtf\n\nMy average is like...4 beers a week", "label": 0}
{"text": "He doesn't want anyone to make him sell his air BNB to a family to live in.", "label": 0}
{"text": "So.....are we just going to sit here and not know what happened in 2023?", "label": 0}
{"text": "Brother im sorry you don’t need anything prescribed. My mother was an alcoholic for 10 years and now she has been clean for over 500 days straight. Go to detox, live in a sober living house, go to AA, do anything, but you cannot continue like this. I can guarantee you that you will be a happier, healthier person coming out of this", "label": 0}
{"text": "Sell air bnbs to families.", "label": 0}
{"text": "I quickly realized how much it was habit, ie. Drinking a beer while watching football, rather than wanting the alcohol itself.", "label": 0}
{"text": "Step 1:   I am powerless over alcohol and I need help.    I can’t quit by myself.", "label": 0}
{"text": "I hate to say it but you are realistically going to have 2 options here:\n\n1) Quit completely. Go to rehab and accept that you can NEVER have a drink again (or else you will be right back to this) or;\n\n2) Learn to control yourself and stick to it. Really if it means only allowing yourself to buy a 6 pack at a time then locking your keys inside a breathalyzer required lockbox then do that.", "label": 0}
{"text": "Next time you go to the doctor, tell them, “I want it documented in my file that I requested a prescription to help reduce/quit drinking, and was denied.” See if they switch up!", "label": 0}
{"text": "What in the hell? This is awful and sad", "label": 0}
{"text": "I think you were my roommate. The corner liquor store owner gave him a fifth of whiskey as a christmas present.  He proudly showed it to us.  My other roommate told him “I’m not sure that’s something to be proud of, dude.”", "label": 0}
{"text": "1 is too many and 100 is not enough.", "label": 0}
{"text": "It's very funny to say this when OP offered all this data up to us. It's not like we're invading his privacy, if he didn't want to hear this kind of speculation on his insane drinking habits he shouldn't have posted it.", "label": 0}
{"text": "Friend. You're basically me two years ago.\n\nYou are not an alcohol in moderation person. You've been trying to cut back for at least two years and you're still at like 6 drinks a day. Your 2024 is an upward trend, not a downward trend.\n\nYour life is gonna get so much better the day you decide to stop.", "label": 0}
{"text": "Yes and it's a proud past time for many Aussies lmao", "label": 0}
{"text": "And sidewalks, too! Except in residential neighborhoods, where the city has been systematically passing off its obligation to maintain them to private residents by offering them a one-time $10k payment to fix the area in front of their home, in exchange for permanently assuming maintenance obligations (which most people are totally cool with, because they get a free sidewalk, and will likely sell the home before it needs another one).", "label": 0}
{"text": "Yep. We have new ways of dealing with addictive behaviors too. For example Ozempic has been successful at treating addiction.", "label": 0}
{"text": "just buy an ounce of weed and stay stoned for a month", "label": 0}
{"text": "I log it every morning", "label": 0}
