{"text": "I don't have anyone to trust", "label": 0}
{"text": "Honestly I don't understand how people can be happy, with the way everything is... I think you have to be stupid to be happy.", "label": 0}
{"text": "Why only 40 minutes? Did you set up an automatic timer to drop that toaster in the bath?", "label": 0}
{"text": "You’re not disgusting at all, and depression can make self-care tough for so many people. It’s hard when someone doesn’t get how much you’re trying, but you deserve understanding, not shame. Be kind to yourself — you’re doing your best.", "label": 0}
{"text": "I secretly love being sick for this reason. If only humans were allowed more breaks in life and more patience then I wouldn't need sickness for the rest I am starved of.", "label": 0}
{"text": "Sunshine on your face, wind in your hair, a beautiful sunrise, a snuggle from a dog, laughing until your stomach hurts, a hug, a great book, a really good cup of coffee, that movie you’ve been wanting to see, that place you wanted to visit- all those little (or big) positive moments in our lives are all still waiting for you. Life brings a lot of pain, but sometimes those tiny moments can remind you why we were all still here. Please stay, because there are so many moments you’ll miss. ❤️", "label": 0}
{"text": "Ways to deal with stress exist everywhere. My way of dealing with stress is ”breaking the rules” and talking to others about the stress my life hands me. I’m in a similar boat to you pal. We just got to keep pushingl", "label": 0}
{"text": "Ok then. Sorry.", "label": 0}
{"text": "Mood. ill talk to u :)", "label": 0}
{"text": "Yeah, I get it. I work 30hrs/week in the service industry and use all my energy experiencing unpleasant emotions at work, then just regroup on days off. It’s sad. There’s no reward in it. \n\nMy parents keep telling me they’re proud of me for sticking it out, but I don’t think they understand that money doesn’t have the same value to me. I buy my own groceries (and clothes once in a blue moon), but that’s all. I don’t want to go do anything on my days off. I just want to stay inside.", "label": 0}
{"text": "As someone who has joined groups/Clubs and activities for the same reason, I’m sorry to say it doesn’t help but I find making friends online through games and etc works better", "label": 0}
{"text": "That's a lot for you to go through. If I were you:\n\n\nAdult mentally challenged sister needs to go to a home. \n\n\nIf your wife is telling you that your only worth is monetary while you do nothing, speak up and advise her what you do do.\n\n\nAlso tell your wife just because she has a disability doesn't mean that she can't work either. Many people face mental and physical challenges daily yet care for children and work. No excuse.", "label": 0}
{"text": "There’s a dude from Australia I think, that’s walking for men’s depression.", "label": 0}
{"text": "Hey, tout d'abord je te souhaite un joyeux anniversaire, tu pourrais te faire une petite balade nocturne pour te vider la tête en écoutant de la musique, écrire sur un journal, dessiner ou peindre, aller dans un restaurant. J'espère que ça pourra t'aider.", "label": 0}
{"text": "Life is seemingly chaos and random but maybe not but I also get that useless feeling, but maybe this is part of life’s test wtf actually know, but I see you like guitar I also just pick up last year it’s a fun break from life’s problems they have bunch good tutorials and play along chords, you should go play music and take break from your problems and just live music friend , best thing for lucky feeling better", "label": 0}
{"text": "I'm struggling with this right now. My therapist said it was a symptom of my ptsd. I was the guy at work who would do all the research, create training material, write protocols and documents, and design and work with programmers to build EMR programs. I was the guy who read through OSHA standards for offshore oil rigs to write a bloodhound pathogen plan.\n\nNow I can barely understand any paperwork I read, and regular don't understand things I know I should.", "label": 0}
{"text": "You’re not disgusting. losing motivation to take care of yourself is a very common symptom you’re doing your best and that’s what matters. she absolutely should not have said that to you.\n\nAs a teenage girl with depression I can tell you no I do not want to shower I don’t want to do anything when it was in my worst episodes I couldn’t even get out of bed. that woman quite literally no idea what she’s talking about you should switch to a new psychiatrist mine didn’t say anything at all or judge me hope you get better", "label": 0}
{"text": "It's not just you...\n\nThe more and more my life has gone downhill, my mental sharpness has gone with it. I'm at the point where my college lectures are pointless because no matter how hard I try I'm lucky to retain 5% of the information, heck I can't even understand basic instructions anymore. And just like you my parents are super supportive of this mental illness, I get called numbskull, retard, or airhead all the time because I can't comprehend basic things.", "label": 0}
{"text": "Based on observation, adults from last generations who is not used to handling mental health issues with love ones will give you silence. Not because they hate you. But because they're unsure how to deal with it. \n\nIt's never your fault, and yours feelings are valid. It's a good thing you have a sister who is concern with you and your well being. Take that as a win, and imagine how painful it is for your sister to know that you are hurting. \n\nTherapy will help, ask your sister to go with you. It will be a long journey, but love yourself because if you think your friends or family doesn't love you, that's not true. It's just that it's not the love that you were looking for. The love you are looking for is, the love for life which you have lost because of this mental illness. \n\nSo try with all your energy left, if it makes you feel better post every day, every thoughts here in Reddit. You can do it. We believe in you. 🙏\n\nAnd please don't say that you're a waste of oxygen. Every person matter in this world, every actions we decided on will affect another person around us. So it is up to us, how we continue breathing.", "label": 0}
{"text": "I'm 65 now and would like time to go back, but that's not how the universe works as you probably already know. I spent the past 50 years full of regrets, but along the way I was a caregiver for 3 different quite elderly people and knew them all well. Aging is rough on everyone, not just you and me. I suddenly have a gut I never had for the past 60 years, but here it is and there's not much I can do about it except to buy different clothes and avoid mirrors when showering. \nYou, me and everyone else have the rest of our lives ahead of us and our pasts are done and over with. There is no going back, just the future and right now. I can't change a single regret about much of anything, but I can control how I react with the future and the thing is I'm closer to dying of old age than at any point in my entire life and it'll be true tomorrow and the day after that and the day after that and so on. It's taken me awhile, but I no longer dwell on my past. I wouldn't even want to be as stupid as I was at 20 and I did WAY MORE than my share of stupid back then and kept doing it well into my 50's.. I'm finally to the point of being able to take absolutely guilt free naps every afternoon. Sleep is good for you. It's even better at 65.. \nGood luck!", "label": 0}
{"text": "Dudee i have been meaning to play video games for hours now. Literally just video games. All i am doing is doomscrolling. I am messed up.", "label": 0}
{"text": "It’s all about perspective. Hopefully we all can have a beautiful time to look back on 🥹", "label": 0}
{"text": "Honestly, I'm tired... I feel empty and the truth is I don't care if I live or die tomorrow... but I know my uncles wouldn't like to see me dead. I'm still having my family", "label": 0}
{"text": "Merci pour ton gentil message", "label": 0}
{"text": "I'm saying in general that's what she says about friends.", "label": 0}
{"text": "I understand this completely. I'm sorry you feel the same way too", "label": 0}
{"text": "C'est avec plaisir, passe une bonne soirée !!", "label": 0}
{"text": "I get you, I had the same yesterday. Meant to get on Pokémon SV for hours but just went to bed and scrolled. So many hours wasted it’s awful, when video games start to feel like work you know your depression is getting bad. I really hope you feel better tomorrow.", "label": 0}
{"text": "Definitely, you have to convince yourself to ignore it or defy it even for a bit. It’s just a life of constant up and down with depression. I’m glad you got help. I’ve got therapy booked in too", "label": 0}
{"text": "Depression will cause a bit of cognitive impairment, but it's typically not permanent when you're young. I'm 65 and have had several episodes of severe depression over the years and at times felt dumber than ditch water, but it's usually transitory.. At my age there's lots of things I no longer remember and I don't concentrate nearly as well as years past, but it's kind of to be expected at my age.  The best I can tell you is the immortal words of my old man, \"Wait'll you get to be my age!\" He lived to 92..", "label": 0}
{"text": "Oh, it's absolutely part of the depression. I've been dealing with a long, bad episode and my concentration is shot, my memory is complete ass, and sometimes I just sit there at the most basic of work tasks going, \"What?\"\n\n\nIt sucks, but you are definitely not alone. ", "label": 0}
{"text": "yea bro. i used to pop xanax like candy. still miss it. only reason i stopped is cuz covid made me move across country.\n\nnothing in life makes me feel the way substances do. not being high or drunk or on something is genuinely the worst. yea i get through the day sober if i have to go to work or do this or that. but ugh it fucking sucks", "label": 0}
{"text": "Yeah, if you have the resources available to take a vacation to go on a little walk. Modern problems require ancient solutions, which are in turn funded by modern solutions", "label": 0}
{"text": "I've always wanted to try content creating, but i'm not sure i can do it", "label": 0}
{"text": "Jealousy is normal. \nIf this is someone that doesn’t know you like them, then I encourage you to reflect internally on your jealousy. And either act on your feelings and tell them. Or focus on letting that jealousy go. It’s not helping you. \n\nIf this is someone that doesn’t know you like them and doesn’t reciprocate those feelings. Than you need to let yourself feel those feelings and mourn that relationship that never was. \n\nIf this is someone that you are with and is ignoring you in favor of attention to others than you should think about how they are mistreating you and address it with them or cut them out of your life if you address it and they keep doing it, you know they don’t value you and you should free yourself from them", "label": 0}
{"text": "I feel you bro. But give your life to God who values your life", "label": 0}
{"text": "I thought the same when I was young. I have never thought I would live this long.", "label": 0}
{"text": "also one of my biggest fears", "label": 0}
{"text": "What a dickhead", "label": 0}
{"text": "Here too. All I have to say is success and especially happiness can seem so far away if not unobtainable until you're there.", "label": 0}
{"text": "idk take estrogen or something man. i'm taking this post down bc ure being weird.", "label": 0}
{"text": "Behavioral activation… like they tell you to take walks and go outside? Yeah I’ve done that, still getting nowhere.", "label": 0}
{"text": "You have been so brave friend❤️ Hugs to you I hope you get better", "label": 0}
{"text": "guess its only natural, guess its why eating disorders exist", "label": 0}
{"text": "Yes, borderline personality disorder. \n\nI've been navigating this my entire teen and adult life, I feel like I'm fighting a losing battle and it's exhausting, yknow?", "label": 0}
{"text": "Its actually helpful to know I'm not the only person reaching out for help and being left dangling. \n\nWith my condition, I often feel like things are against me personally. But if others are experiencing the same issues, it helps me feel like I am not purposely being targeted.", "label": 0}
{"text": "UK, public.", "label": 0}
{"text": "What a horrible psychiatrist. Them responding that way is what’s not normal. Find a new one, you’re experiencing the symptoms of depression and yes, it is completely normal. Don’t feel disgusting. They should.", "label": 0}
{"text": "I've made attempts, although that was a long time ago and having my stomach pumped put me off those methods again.", "label": 0}
{"text": "Get lost. I believed in this when I was a child and it's part of why my brain is so fucked up. \n\nTake your useless \"advice\" to someone else and don't push your religion onto me.", "label": 0}
{"text": "You can cry if you need to. Don’t feel guilty for feeling bad right now.", "label": 0}
{"text": "I feel the same I wanted to go to a Halloween get together. I got a cheap costume and I have PTSD and I didn't sleep last night. So here I am. I hope you go and try to have a good time", "label": 0}
{"text": "She is not right find a new therapist. I am also a person who was abused and I never brush my teeth. A good therapist would have told you why", "label": 0}
{"text": "Well to start, I’ve had a job where i was working part time, i had been saving money, around when i had 10k saved up for a car, my parents made me give them the money.even after that i had a credit card, they maxed out my credit cards and said they would pay it off, this totals to around 20k, I’m still paying it off and i feel as if I’m being used for my money.", "label": 0}
{"text": "I've been wanting to do that so bad. Just disappear with only myself, and what's on my back. But I'm too frozen with fear about it.", "label": 0}
{"text": "I feel indifferent to dying", "label": 0}
{"text": "I'm so happy for you and your lady. I don't know you, but I'm wishing you the very best of luck ❤️ you will be an awesome parent and will have so much to teach your little one, especially about perseverance. CONGRATS!", "label": 0}
{"text": "Is there anything besides human you would want to be? Not wanting to exist I can understand, but I can't imagine myself wanting to be something else then human...", "label": 0}
{"text": "Yes.  One of the hardest things about recovery, for me, was acknowledging that my actions affect people… I had perpetuated cycles of trauma.  Sometimes it was kinda funny when I’d encounter another crazy person and they went apeshit on me… like, so that’s what it’s like to be on the receiving end of that.", "label": 0}
{"text": "I’m sick of existing", "label": 0}
{"text": "Your dad is a broken man, just like you. Atleast your sister cares. Thats something.\n\n\nI got no one. When you are obsessed with dying people tend too leave, I dont care anymore, some people get lucky, I did not. Who cares. Nature certainly doesnt give a shit. ", "label": 0}
{"text": "Thanks guy.  May your endeavors be blessed.", "label": 0}
{"text": "I mean I feel pretty crazy thinking positively these days but  eff it keep pushing.", "label": 0}
{"text": "I was unemployed and had no obligations.   Walking away is not for everyone.  I left without a phone or even proper shoes.", "label": 0}
{"text": "Googling.", "label": 0}
{"text": "An intention of death became the life refresher I needed.", "label": 0}
{"text": "I mean...it rewired me a little I think.   What's life without adventure.", "label": 0}
{"text": "What’s there to be optimistic about? I’m literally…going to age, experience the dying process, and die. There’s nothing optimistic about that. Lol", "label": 0}
{"text": "It never hurts to consider the possibilities.  It took years to rebuild when I finally settled down.", "label": 0}
{"text": "So am I", "label": 0}
{"text": "Adventure changed that for me.   Knowing the next prize awaits me.  Be that a drop of serotonin or an awesome memory.", "label": 0}
{"text": "All the memories are just gonna be erased one day…whether it’s from death or dementia.", "label": 0}
{"text": "Not really", "label": 0}
{"text": "Work is a nice break from sitting at home, alone with my thoughts", "label": 0}
{"text": "In survival mode, our brains shut down the higher cognitive functions and default to basic settings. It's no wonder if we feel slower when depressed, our brains are literally in power saving mode!", "label": 0}
{"text": "I’m not working right now so my days are usually spent cooking, baking and reading fanfiction", "label": 0}
{"text": "I came here to say eating. Which in itself is an issue.", "label": 0}
{"text": "This", "label": 0}
{"text": "Damn that sounds tough for sure, I don’t I would have a similar experience if that happened to me at all.", "label": 0}
{"text": "I thought I was the only weirdo who enjoyed going to work to socialize. What a difference in how I feel during the week vs  the weekend if I sit and do nothing.", "label": 0}
{"text": "Chicken sandwich", "label": 0}
{"text": "I stopped smoking weed Tuesday hoping I could clear 7 years of weed in my system. Then today it hit me like a brick that I'm still probably going to fail, and that I don't know what to do next. A feeling of being lost, like I want to disappear.\n\n\nTake it from me, talk to your family, your friends, cuddle with your pets. As someone who doesn't want to anymore.....Please!!!!!! . For your mental health, seek support within your inner circle.", "label": 0}
{"text": "Man, i do love eating especially when i'm alone at home if i cook something i really like. Those times are most valuable times for me.", "label": 0}
{"text": "Coloring pages", "label": 0}
{"text": "Sleeping peacefully!", "label": 0}
{"text": "Eating something I like , and self care even if it’s just applying cream , sometimes it’s enough to make me feel ‘loved’ or cared for", "label": 0}
{"text": "It definitely does get better for some people.", "label": 0}
{"text": "Age 20 was a pivotal time in my own life. I would do anything to be able to return to that time of my life. In just a few short months it went from pure happiness and endless possibilities to never standing a chance.\n\nMy life event wasn't like Red's but he said it best. \"That kid's long gone, and this old man is all that's left.\"", "label": 0}
{"text": "Sounds like quite the adventure. - did you have money? How did you eat?", "label": 0}
{"text": "Hiking or just walking", "label": 0}
{"text": "Sadly I lose all my appetite and food is tasteless", "label": 0}
{"text": "I have my daughter with me, and she is sleeping like an angel. I am drinking gin and playing world of warcraft. Her visit was quite exprompt today, and she is staying the whole weekend. I look at her and realize once more, that I love her more than life itself. However I feel so much emptiness inside, that it hurts.i can not go on like this, yet I can not end it either. How can I leave her? Who will she become? What will her life be like? How will her life be like if I am not around? It all seems so easy, one pull of the finger and I am free from all this pain and burden.. but.. how can I leave her with this pain and guilt? I am at peace when she is here..bit as soon as she leaves, I am back to square one..", "label": 0}
{"text": "You should just pay money for a private irl therapist  the free version is always worse in everything in life.", "label": 0}
{"text": "This have been my experience as well. A real bummer.", "label": 0}
{"text": "I like being around my best friend", "label": 0}
{"text": "Yeah. My therapist also suggested that, I did that, nothing.\n\n\nMy therapist's most recent advice was to do something I enjoy for an hour every day...but I've already told her I don't really enjoy anything. So there's that ", "label": 0}
{"text": "Yeah brother \nIt's really brutal how change can determine ur whole life", "label": 0}
{"text": "I eat but out of boredom or anxiety, not because I enjoy it.", "label": 0}
{"text": "Same!", "label": 0}
{"text": "i know how you feel.\ni saw a quote that went along the lines of instead of waiting for a friend, look to be someone else's. theres alot of lonely people in this world that could very much need you right now. if theres a regular at your gym why not start there?\nthe library also tends to have clubs if you’re interested, its also a peaceful environment. \npersonally, i felt lonely in a crowd. i knew people but none of them mattered. i needed to make the first step, i didn't have the connection i wanted because i prevented it. if i had taken those people serious then i would've had those bonds.\nif meeting someone entirely new is hard, have you tried just flat out saying you’re lonely and you'd like to have a proper friendship or bond to someone? i brushed peoples worries off but when i told them they took me serious. that very well could be the case for you too. i mean, you'll never know. (´ ‿｀)", "label": 0}
{"text": "I used to enjoy beer but gave that up\nI used to enjoy video games but have that up\nI used to enjoy food but my appetite these days sucks\nI used to enjoy tv shows but my mind just keeps racing \n\nI’m starting to warm up to talking to people", "label": 0}
{"text": "fresh wind", "label": 0}
{"text": "I'm so sorry, that's fucked up", "label": 0}
{"text": "I have gained a lot of weight lately, due to anxiety and not having a good diet, but eating what you like is a small moment of enjoyment", "label": 0}
{"text": "A rainy day.", "label": 0}
{"text": "Have you considering you might be also dealing with BPD? Volatile emotions can not only be a symptom for depression but BPD as well. \n\n\nAlas, I do get you. \n\nWhen I try working on depression, something small triggers the damn BPD and I go back to where I started.\n\nI am the 3rd lady therapist that insists on this “routine”, which slowly kills me inside. I am already doing everything as a routine, while everything inside me screams - “there has to be more”, to life, more than routine; more than what everyone does every day.", "label": 0}
{"text": "your strength is very admirable. i hope you make some good friends at your new job :)", "label": 0}
{"text": "I struggle finding time for myself after school and class. I have a difficult situation with my family that is draining me, and one of my partners died in August. I feel useless. I can't drive. I'm not making enough money. My health issues are catching up to me and I might not have a home this summer that isn't extremely toxic, racist, or sexually abusive. \n\nI've been meaning to go to gym. Going can be difficult, I struggle with the gym because I don't really sweat because of my medication so I get hot a lot faster. And feel tired from an hour or less of exercise. Also. I am scared of the men at the gym- I know they already sexualize me on the street, it's no excuse not to go. A gym just feels like a closed Enviorment where sexual harassment can happen. \n\nI do agree. I think trying to find time after work would help. But I can't take to much time.", "label": 0}
{"text": "The world used to be even more terrible, if it is of any help.\n\nBut yes, I have no faith in humanity nor do I think there is any worse species than humans.", "label": 0}
{"text": "I agree. And that's what I tell myself to make it \"okay.\"", "label": 0}
{"text": "Yeah well my adventure went into the world of cocaine and meth. ", "label": 0}
{"text": "If I had the money to do that, I would have done that. \n\nWhat would be the point of putting myself into debt, furthering my feelings of hopelessness, to get help?", "label": 0}
{"text": "I enjoy weed", "label": 0}
{"text": "it helps a lot to be active politically. Join a local organization that fights for your values. Go to protests, etc\n\nFor me this has helped a lot. Taking action helps me redirect despair into resolve.", "label": 0}
{"text": "I went from SH to drugs to sex to alcohol to eating and shopping😭 now I'm trying to gaslight myself. \"If you hate yourself so much why don't you do all the things you don't want to do\" school and exercise 😡", "label": 0}
{"text": "I went from SH to drugs to sex to alcohol to eating and shopping😭 now I'm trying to gaslight myself. \"If you hate yourself so much why don't you do all the things you don't want to do\" school and exercise...", "label": 0}
{"text": "Agree I feel you", "label": 0}
{"text": "Thank you so much. You have me crying", "label": 0}
{"text": "yes its normal, even worse when you live with them like me. The 2 options are to confess and come what may(easier said than done especially if you think shes not into u) or sever contact. 3rd option is just constant suffering and you just getting minor moments with her that somehow keep the hope alive in your mind and sometimes make u happy. but you live in fear, fear of her not liking you and fear she hits it off with another dude. any social event even friendly becomes awful since you’re hyperfocused on her reactions and if she seems to like someone else. \n\ni started seeing a therapist for the first time because of this", "label": 0}
{"text": "A perfect sandwich, my children's cuddles, ice ice ice cold water, cool rainy days & weed.", "label": 0}
{"text": "This. Lonely but don’t want to talk to people..\nIt’s like the conversations is unfulfilling because you don’t know how to use it to fulfill your needs", "label": 0}
{"text": "Aww I bet they like being around you, too.", "label": 0}
{"text": "I tried it once, my family snuffed me out immediately and stopped me =/\n\nNow I'm terrified to do it again. I at least have to go with something, especially where I live. Cause if you go without water, it's like for sure death, lol. So I've just been thinking about it, but not having the guts to go through with it.", "label": 0}
{"text": "Sounds line you could have died or gone into the legal system about your mental acuity but ok\n\nThere's a movie starring Robyn Wright about you", "label": 0}
{"text": "Same thing. Back in 2022 I still can solve Calculus problems. Now I can't even do Limits.", "label": 0}
{"text": "Could you afford a pet? An old man at my work is depressed. He got cats and a dog and that helped him out. It didn't fix the depression, but he loves them.", "label": 0}
{"text": "I’m no professional but I suspect behavioral activation works more for classic depression. For more straight anhedonia we’re already functional just not interested in stuff.", "label": 0}
{"text": "Thank you guys for the message requests. I don't feel like I need human contact right now, even if it is through the internet. As for pets, my job requires me to be away from home for long periods of time, so that is out of the question.\nI just wanted to vent a little. I am currently very strongly intoxicated, so yeah. The light is brightest at sunrise, so just keep tanking on.", "label": 0}
{"text": "Thanks. But only in my head, really, at the moment", "label": 0}
{"text": "I'm sorry you're in such a dark place. You've stopped taking your anticonvulsants? When? That's not a good idea, trust me. I have lifelong refractory epilepsy.\n\nI'm sorry you feel this way. Sounds like your parents didn't do a good job of socializing you. And I'm sorry about your girlfriend breaking up with you, that sucks. What skills did you learn with the work experience you have? Sounds like you're underselling yourself.", "label": 0}
{"text": "So glad that you are still here and posting.\n\nBest wishes for the job on Monday. You'll be on my mind and I'll be hoping it goes great for you.", "label": 0}
{"text": "micro plastics concentrate in the brain.\n\nlong covid", "label": 0}
{"text": "OCD is the worst. Congrats on being so vulnerable with your therapist and husband and having the courage to share that. That must've been difficult for you.", "label": 0}
{"text": "Im born with cerebral palsy. So my cognitive functions don’t work as they should. I have short term memory and can’t absorb everything around me. It’s hard to find directions, remember things etc. hope this will make you feel less alone.", "label": 0}
{"text": "Talk to a therapist or call a crisis hot line", "label": 0}
{"text": "The lambrofeeties are a powerful tool. Keep on going.", "label": 0}
{"text": "My appointment isn't for another few weeks. And I don't know what I'd say to a hotline given I'm not actively suicidal", "label": 0}
{"text": "Mine gave no fucks.  Bye have a nice life kinda deal.", "label": 0}
{"text": "People certainly were depressed 1000s of years ago. Probably more-so than now, as you had to spend every waking moment surviving. Life was 1000x harder than it is today. It was certainly simpler back then, but fuck when you look back on what surviving was back then you start to appreciate what we have now. Yes modern life is shitty too, but it sure fucking beats starving to death, dying from the flu or being hunted by animals. Yes we still deal with all of that now too, but goddamn it makes you realize how cushy we truly have it.", "label": 0}
{"text": "Hiking or reading some manga.. and both for many hours so I don’t think about anything except what will happen next", "label": 0}
{"text": "Wow, that’s really great man. I’m glad you figured things out and achieved a lifestyle you truly enjoy. That’s what I strive for one day as well. Thanks for the great perspective", "label": 0}
{"text": "i share your perspective. ive been cutting down my cell phone usage drastically, since january. i now sit at 2.5 hours tops daily average. went down from 6.5 hours daily. \n\ni feel so fucking alienated, outside of the collective baseline. before i used to bring out the phone every time i felt the slightest of discomfort, or anxious. \n\nnow, that i trained for abstention, i feel using my phone is fucking useless. i sit with my despair, with my dread, which is curiously amped the fucked up. its like depression is way worse, or maybe the way it really is, without the veil of the mobile phone.", "label": 0}
{"text": "Take whatever energy you have and call a crisis help center. They will be able to direct you to appropriate resources to help you find therapy, a Psychiatrist etc. \n\n\nVenting on Reddit is one thing. Actually seeking appropriate professional help is another. The latter will ensure that you're getting appropriate care that Reddit cannot provide. ", "label": 0}
{"text": "Ye i literally feel the same way i hate my old self everyone thinks im a junkie and im only 17 just wanna disappear.hope it gets better for you tho man ❤️", "label": 0}
{"text": "I play video games. Modded minecraft is my newest fascination. It makes my brain work, and I can shift my knees and hips as needed. I used to play slime rancher, Sudoku, or solitaire on my laptop. I also found a few online friends to play with. It helps a little bit at the end of a bad day.", "label": 0}
{"text": "Have you thought about trying to make new friends? Ive recently gone through a similar experience where my long distance gf just ghosted and dumped me after 5 years. Its really hard being alone so try to find some other people who u can rely on?", "label": 0}
{"text": "Dont be sorry for existing. And people who want to help do that because they value u. I dont know what kind of stuff u went through but even if it all seems dark right now it doesnt mean u should disappear. Have u tried talking with someone about whats troubling you?", "label": 0}
{"text": "That's brain fog, you're definitely not alone. That and fatigue are my worst symptoms these days (technically I have bipolar but I mostly get depression episodes). I try to wake up my brain a little bit by watching documentaries because it doesn't take much effort and I can find a documentary about literally anything. But I'm also still not able to work, this just makes it so that I can think straight enough to keep my house clean. Sometimes doing any sort of activity can help boost your thinking, even walking around your room and reading every word you see. Anything that makes your brain work that you can still handle. But sometimes you can't handle even that. It really does suck, it's like a giant brick wall put up on every side of you that blocks you from taking a single step forward.", "label": 0}
{"text": "Relatable, I have almost nothing of what I would have expected by my age (30's) and worse, my dream is dead because there's never going to be a situation where I can go and get my bachelor's or master's degree, I simply can't afford it and I'm unemployable so I refuse to sign myself up for a school loan that I could never pay back.\n\nI have so little to be happy about, I do my best to remain optimistic, but sometimes I fall into a chasm, like today, and it seems like there's no way to climb out so I am forced to walk forward till it ends.\n\nMedications are a crapshoot for me because none of them seem to help for long. My psych refuses to prescribe me anything stronger, I'm sure because of the potential for abuse, but I just want to feel alright.\n\nSo I feel you, from someone who is going nowhere fast, I hope you feel better soon. Good luck.", "label": 0}
{"text": "I'm glad you were able to find what you need.", "label": 0}
{"text": "If u find an answer please let me know because this is something i struggle with as well. I wish i could not have those nightmares but theres no way to control it.", "label": 0}
{"text": "I'm so sorry you feel that way. I'm wondering if the girls just are already taken or not looking for someone. I just don't understand how it could just be your face that people don't like. But again I'm sorry you feel that way", "label": 0}
{"text": "You're blessed with the gift of expression. I think I love you.", "label": 0}
{"text": "I think you might want to work on getting over her because the two of you are not dating and she is unable to reciprocate your feelings. She is allowed to speak to whomever she wants to. What you're experiencing is self imposed. \n\n\nYou have a crush on her which is normal.\n\n\nSensitive or not, it is imperative to acknowledge the reality of the situation. Fine someone else to like because she isn't for you. ", "label": 0}
{"text": "I hope something arrives in life that provides clarity and peace for you!  I’m still waiting for it to arrive for me too!", "label": 0}
{"text": "One time, i was having a very rough mental health day, i came into my work and one of my students came running to me and showed me how he got my exact tattoo on him painted on at the fair. it made me realize just how much i mattered. kids are amazing 💜", "label": 0}
{"text": "I'd be a hypocrite if I said no but maybe there will be someone who will love you for you. The saying \"beauty is in the eye of the beholder\" comes to mind", "label": 0}
{"text": "eating is my only comfort I'm so tired of shows and games the only thing I look forward to is food", "label": 0}
{"text": "reading. i love reading so much. it’s my favorite thing to do.", "label": 0}
{"text": "girls are gross these days u will come across one soon just keep looking, girls look for al the wrong things in a guy and after they get fucked over a few times they realize its time for change. they start looking for someone who cares about them regardless of their looks at least that's what stage I'm in", "label": 0}
{"text": "Why, are you suicidal?", "label": 0}
{"text": "I really don't wanna blame the women, I wouldn't wanna date my face either", "label": 0}
{"text": "Yes but this isn't about me", "label": 0}
{"text": "Eating and listening music , I’ve been eating too much for last few years due to anxiety and untreated depression that I didn’t know of", "label": 0}
{"text": "That how it usually goes w depression no?", "label": 0}
{"text": "No no don't be sorry", "label": 0}
{"text": "type stuff", "label": 0}
{"text": "I understand you so much, what can we even do at this point. I don't even want to die.", "label": 0}
{"text": "I think i understand, i feel the same way about myself. I love being a mom and love my kids a lot. I have been avoiding this thread  ever since I came on reddit. But I feel like I can't ignore what I am feeling anymore it's been going on too long.", "label": 0}
{"text": "i dont even have a single friend, they all left, drifted apart", "label": 0}
{"text": "I love nature. It brings me peace. Also animals. I enjoy watching animals doing what they do. Music is my everything. I love music too.", "label": 0}
{"text": "Just agreeing i feel the exact same way aha", "label": 0}
{"text": "This was me up until I got IBS issues and now I'm just fighting to win control over my meat suit with some sort of alien fungi with literal shit for humour. Did you get the joke? \n\nFML.", "label": 0}
{"text": "I completely relate to you , same thing with the financially supportive parents , would probably be homeless if it wasn’t for them , I get the suicidal thoughts all the time aswell some times more often than others , I have been on every depression and anxiety pill on this planet , they don’t work , so I end up self medicating with almost everything besides heroin , it’s rough and yea idk if we all feel like this and some people just mask it better and function but it’s probably not that we are probably just fucked for some reason , if anything we might be too smart and see through all the bullshit in life and become super annoyed it’s like this . Anyways that’s my rant , know ur not alone friend .", "label": 0}
{"text": "Don't do this, wait, if y'all are alive. Say anything", "label": 0}
{"text": "10+ hours of sleep might be too much, actually. \n\nWe may have some sort of widespread problem since I share the sentiment a tad, and I'm hearing it quite often.", "label": 0}
{"text": "This is me. Sometimes I’ll go to a coffee shop and just be around people. It sounds weird but it helps", "label": 0}
{"text": "You guys come out of depressive cycles?", "label": 0}
{"text": "Yeah, I feel you. \nI used to be near the top of the class when I was younger, until  highschool. Then 3rd and 4th year, I had to take summer classes, because I failed subjects. \n\nIt's to the point where I didn't even know what I didn't know. I didn't even know how I would study. And it was frustrating to study and fail. \n\nEven now that I'm working, I've become kind of a slow learner. I got fired some time ago, and my HR and supervisor told me that, I'm one of the most hardworking people they've had at that restaurant, but they're frustrated that I can't pick up simple things. Which is true. It would take more time for me to get things memorized, like the menu and how to write ORs properly. It always felt like some formula that won't stick in my memory. One minute I know how to do it, the next, I'm lost. \n\nI'm so frustrated. I've always been so frustrated about this.", "label": 0}
{"text": "There are times where I can break out fortunately, but the duration gets shorter each year", "label": 0}
{"text": "Every depressed person suffers from depression for different reasons. Some can be simply fixed, others take a lot and some are incurable. Mine is a simple fix. If I could get my finances together, everything else would fall in line.\n\nSeems like yours may fall in the category of taking a lot of incurable. Either way, I understand where you are and hope things improve for us all.", "label": 0}
{"text": "Since my wife died, I felt the same", "label": 0}
{"text": "I can relate", "label": 0}
{"text": "We are were just now about to reach the train station i say were bout like 25 meters away", "label": 0}
{"text": "May Jesus send down his mercy and grace and stop you immediately from what you are intending to do with your girlfriend in Jesus name amen 🙏", "label": 0}
{"text": "I’ve been having 1-2 days maybe every other week where I feel like WOW I feel like me again! & then boom I wake up & feel an immense feeling of hopelessness & have to wait another 2 wks for that feeling of energy & light again. I wish it were more often.", "label": 0}
{"text": "But that sucks ass if thats what it is , then it needs to be changed but I’m sure no one has the balls to even try , the people who made it this way are firmly in power", "label": 0}
{"text": "Does ur family know how much internal pain ur going theough?", "label": 0}
{"text": "Bro i called the cops, get outta there", "label": 0}
{"text": "Pls stay life can always change 😭😭😭😭😭", "label": 0}
{"text": "I'm sorry", "label": 0}
{"text": "I guess we will never know if we don’t hear from him", "label": 0}
{"text": "Ihope you choose to not take your lives and that you are ok", "label": 0}
{"text": "Man, I'm sorry about that. But you're in a much better place now, so it was probably for the best for you. Sometimes family can be our worst enemy.", "label": 0}
{"text": "I meant not kill. I meant Jesus heal you from your demons.  typo.", "label": 0}
{"text": "Sleeping and eating", "label": 0}
{"text": "Fr", "label": 0}
{"text": "I feel you. I want to end it so bad but like you, my eldest son has ASD & echolalia. Not being able to have a conversation with your son & see them struggle because they can’t communicate is heartbreaking & SO frustrating at the same time. You just want them to be normal, for their own sake, & for ours. I wish I could take them to the park, something so simple, but like you, it’s a bit out of the question. He gets overstimulated easily. & I want to end it all too, but then who will take him to all his therapies? Who will love him enough to give a shit? My 2nd is NT & I feel guilty for shunning him because I have to focus so much on my eldest. This life we thought we wanted isn’t what we actually got & it’s such a hard pill to swallow. Like you say, these parents that have the ability to not be involved & they have NT children, have absolutely no idea how easy they have it! When I hear those parents complain about bs, I want to punch them too. I want you to know you’re an amazing father. Without me realizing, I’m about to say something to you that I need to believe also. Our kids will be better off with us HERE. & without us knowing it in this moment, they’re the reason we’re carrying on. They’re literally saving us.", "label": 0}
{"text": "# ''Gonna get high'' haha :D hey if you can get someone to laugh stay alive, its all about perspective", "label": 0}
{"text": "You are loved and you are worth it ! You are strong ! I’d like to sit and talk with you a while . Maybe a neutral person that has lived through what you are thinking about doing. You do matter and your worth is immeasurable. Please stay", "label": 0}
{"text": "I definitely know how it is. I never took care of mine, when I was younger and when depressed I took care of them less. I had to get dentures when I was 33. It definitely took some time coming to terms with it, but I'm OK with it now. If you can afford it, implants are an option too.", "label": 0}
{"text": "I keep trying to tell myself that parts of your body leave you before you leave this world sometimes, and this is just one of those things for me, and at least I still have my creativity and hands to make art with", "label": 0}
{"text": "I feel you man", "label": 0}
{"text": "I truly enjoy every moments with my loved ones but as soon as I'm alone, I feel like my life is meaningless and I'm a loser. So I'm very grateful to have a strong family and lots of real friends.", "label": 0}
{"text": "Money. I want to earn that's my spark.", "label": 0}
{"text": "Same but I keep reminding my self that am a whole new  person . And am proud that I have changed to be the best me ever 🙌🏽", "label": 0}
{"text": "It feels like nobody is truly there at all. It's just lonely and empty.", "label": 0}
{"text": "At the very least, you should be able to get a prescription through your primary doctor. Therapy can be expensive and might feel uncomfortable at first, but if you ever have the chance to try it, I highly recommend it. When I finally had my own money, I started going to therapy. It might take some searching and several sessions to find the right person, but building a healthy relationship with a good therapist can be incredibly helpful. For now tho, lean on anyone you trust and foster those relationships.", "label": 0}
{"text": "Even if I ended things right now I know my mom would still be so disappointed it’s something I can’t ever escape from. I guess a way to live is to not care about what she thinks but it’s impossible for me. I care so much.", "label": 0}
{"text": "Yes.. a lot has happened with my family so I had to stick around 😆", "label": 0}
{"text": "no that's relatable", "label": 0}
{"text": "Music, bands, live music. Festivals. \nCurrently watching a cricket match - made a duck - not so much anymore.", "label": 0}
{"text": "It’s only gonna look like a murder/suicide", "label": 0}
{"text": "i did talked to her quite a lot bout me struggling but she can't understand my pain at all. It gets so difficult when she starts to compare my pain and her pain. No one in my family understands me. gosh, im in so much pain rn. Thankyou for replying to me, i needed that.", "label": 0}
{"text": "Tell them no more. I'm not sure on the legally of it all but it needs to stop. If the debt is strangling you may want to consider filing for bankruptcy", "label": 0}
{"text": "is it possible to learn this power", "label": 0}
{"text": "Circumvent it by not attempting", "label": 0}
{"text": "please don't. I've been suicidal before but I'd regret SO MUCH not living to where I am now", "label": 0}
{"text": "Same, I bet you are a college student too?", "label": 0}
{"text": "nope just a useless human that does nothing with their life", "label": 0}
{"text": "Weights, but too lazy to do a constant routine, I just like the feel of working myself.", "label": 0}
{"text": "Do an ama it’s surprisingly very enlightening and may help you. Just be unbiased.", "label": 0}
{"text": "It’s a blessing that you are still here. Don’t give in. Keep fighting. It will get easier in the future. I promise you that", "label": 0}
{"text": "Lol. Of course I'll be nice little buddy. <3 Honestly, for what you have is because you want to forget everything that's hurted you. So you start mechanism to self soothe yourself, basically changing your hunger for more foods to eat that activates your brain as a reward of comfort. Are you okay though bud?", "label": 0}
{"text": "Sorry to hear that", "label": 0}
{"text": "I don't mean to invalidate, and I'm really sorry you're going through this. I say this instead to show that there's hope, because ugly people date, have sex and have friends. Also, I'm a 24 virgin and I look pretty good, so it's not all bad", "label": 0}
{"text": "I like reading manga and eating.. the only things I can count on.. but a lot has happened with my relationship with food lately..", "label": 0}
{"text": "It should be the other way around. You should be more social, to keep distant from suicidal thoughts.\n\nGood luck!", "label": 0}
{"text": "I feel you.. I wish I could end it all painlessly", "label": 0}
{"text": "It might be cliche but you are not alone in feeling alone. I've been alone so long I'm not really sure what its like not to be alone.", "label": 0}
{"text": "Dont go. Right now u might feel in pain but if u go u r selfish cuz. once u go, everyone who knows u will feel how u felt and nothing can cure their feelings", "label": 0}
{"text": "I can understand. Others who don't experience depression struggle to understand and I understand what its like to not have a mother's support in this.", "label": 0}
{"text": "As someone who is a high schooler and is ruining their life, it’s not worth it, there gets to be a point when you will remember every missed opportunity, and all you will do is cry, it’s not worth it and I wish I I would’ve never gotten drunk or high because it’s the only thing I think about anymore", "label": 0}
{"text": "Don't do it.  Please ask someone  for help🙏", "label": 0}
{"text": "yeah i may not acknowledge it if it happens once or twice but it happens every time unfortunately", "label": 0}
{"text": "Thank you😊", "label": 0}
{"text": "yeah i can cut them if it happens once or twice but it happens every time unfortunately", "label": 0}
{"text": "Please don’t do this man, I’m begging you both!", "label": 0}
{"text": "I’m really sorry you feel that way. If you just hold on for now, things could get better, you never know", "label": 0}
{"text": "This is twisted as fuck, get help", "label": 0}
{"text": "a long walk is gonna decide for me. hopefully a short pier. joy b gone.  im sorry im sayin this to randoms but ya know", "label": 0}
{"text": "One can usually only see a mental health professional for 45 minutes a week. That is the amount of support that you imagine a human who is ill needs? Humans need each other.", "label": 0}
{"text": "yeah man we were meant to work/do shit outside. we aren't meant to sit on our asses looking at screens", "label": 0}
{"text": "Have you ever considered the possibility that if you both could actually have a happy, fulfilling live together? But you have to stick around to see. Please stick around.", "label": 0}
{"text": "Same but also pushed them away", "label": 0}
{"text": "I find suicide and not wanting to live to be two different things. I feel like there is more to your story. So fel pressured or something? Are you afraid to be selfish?", "label": 0}
{"text": "Yes you are depressed. I got diagnosed with functioning chronic depression and it turns out ots not normal.See your doctor and tell them you are tired all the time and lack motivation.", "label": 0}
{"text": "Ooh sounds yummy.  I loved pop tarts in college.", "label": 0}
{"text": "I'm sorry for you", "label": 0}
{"text": "please don’t do it", "label": 0}
{"text": "Ya I work from home so it gives me time to try different breakfast foods. I personally like the strawberries and cream ones but you may not be ready for those so you might want to start with the apple ones.", "label": 0}
{"text": "Mm yes you've got me pegged.", "label": 0}
{"text": "garden work", "label": 0}
{"text": "Sounds great I will try to as well", "label": 0}
{"text": "Plot twist she'll just escape after u died and live happily with her backup", "label": 0}
{"text": "Nobody else will care as much about you as you, so start with self love and forgiveness.", "label": 0}
{"text": "Probably. My reflexes are horrifically delayed. I can tell people think I'm mentally challenged on some level. Plus, I have an Alzheimer's goldfish memory now. Can't remember anything of my life from the past 5+ years. I'd be lying if I said I wasn't filled with intense fear and sadness everyday now. Please do yourself a favor and take care of yourself in every way possible. I never thought I would end up like this.", "label": 0}
{"text": "Love yourself,  it's worth it.", "label": 0}
{"text": "My depression was triggered by severe trauma at a very young age, I’m not sure if it’s the only reason, but I’d rather not talk about it.\nsuicidal thoughts have haunted me for most of my life, and sometimes I’ve been on the thin edge.\nNow I don’t know what’s going on, it’s like all these thoughts are eating me up inside, I’m confused and I don’t understand anything at all.", "label": 0}
{"text": "What happens if you got depressed in your teens? Is the damage more severe as an adult?", "label": 0}
{"text": "I’m not sure if it’s better or worse that Im almost completely used to it now\nI’m 17 how long have you been dealing with this?", "label": 0}
{"text": "I stopped attending all events. I don’t want to fake it, no one wants to deal with depression, so I just disappeared. I don’t blame them. Just is what it is.", "label": 0}
{"text": "You are going to run in to an issue with the icing packets of try just riping them with your hands. Use scissors. You also have to ration them cause you 9nly get one packet per strudels but I learned a trick to this. Crea. Cheese is my favorite kind of cheese so I had plenty of it around so I mixed it with butter and sugar them boom I had my own batch of icing.", "label": 0}
{"text": "Unlikely", "label": 0}
{"text": "Ur right thanks for reminding me no one will ever care about me it’s true…..I’ve tried the whole self love thing ofc it’s easier said than done", "label": 0}
{"text": "I go to Walmart basically every day just for this reason", "label": 0}
{"text": "I honestly thinking bout that and i want to say this to all of you that are depressed. I just want that before you consider to give up at least try to reach out for help. You can get help here, there will always be someone that will listen. We are feel the same even if we don’t share the same experiences, tragedies or issues. We feel that we missing something and the void. We can start by reaching out for help here or in other places. I suffer with this fucking shit but i will always try to fight for the peace that i want. Is hard but i can do it, at least for a short period but feels good. We all can do it.", "label": 0}
{"text": "From someone coming out of hs and doing more of the same in college, high school is really draining. I’m assuming you’re doing APs and stuff, applying to colleges, etc etc. Try to leave at least 1 day a week where you don’t do anything school related or else you’ll only get burnt out. Have fun, go out, walk in nature, eat good food, and destress.", "label": 0}
{"text": "Can’t promise I’ll be great but ill be here", "label": 0}
{"text": "I am so sorry. I just want you to know I hope you find happiness again or atleast peace. You don't deserve to feel empty and sad all the time. You don't have to mourn all the time unless thats what you choose, your wife would want you to find peace eventually. You must have loved her very deeply to grieve her so deeply but you were always capable of loving deeply and you may be able to love so deeply again but with something else or someone else.", "label": 0}
{"text": "i love getting hyper fixated on a show or actor and letting it consume my brain as a distraction from my brain", "label": 0}
{"text": "Nah I think you are cool. I can on one hand (and I have one hand) how many times someone complimented me  on my looks in the last 10 years. I think it was once. I'm sure you are perfect but only if you like the original crow movie.", "label": 0}
{"text": "You do not have to be good especially not to those who are not good to you. Now i am not telling you to be voilent but you owe no one anything. Morality is subjective and man made. You have worth inherently as a human being regardless of your morality or lack of it.", "label": 0}
{"text": "I've been toughing it out for a long time and meds have been the biggest help. I found comfort in knowing what that how I felt wasn't normal.", "label": 0}
{"text": "I am so sorry you’re feeling this way. 🫂 \nI’m the ugly duckling in a family of gorgeous women. Some have said I’m pretty, but I’ve never had much attention from men despite that. \n\nThat’s one woman’s take on it. I hope others can add to it for you. \n\nEven being pretty doesn’t matter when you’re a woman perceived as old. \n\nIf plastic surgery can help a woman feel better about herself — well, you’re the only one you have to please. I think it’s worth it.", "label": 0}
{"text": "Your not an object. Beauty is a societal construct. You don't have to be beauty and being ugly won't make you any less worthy and if it does it only does in the eyes of shallow low intellect people. No other animal has ever seen its own reflection and felt disgust because no one but human beings are taught  feel shame for their nature and this can be seen in kids who don't often see what ugliness is until their socialised more.", "label": 0}
{"text": "God this breaks my heart. One of you has to save the other", "label": 0}
{"text": "What you have eachother live together", "label": 0}
{"text": "Don't do it. Please. I understand lifes hard and difficult and sometimes itsn't worth it at all but right now you and your gf are going through a hard patch, think of it as hurricane season. its not always hurricane season, its just temporary ❤ \n\nPlease OP, tell us your okay", "label": 0}
{"text": "I really fucking hope you guys are still here", "label": 0}
{"text": "It’s always nice when a family quilt can last that long!", "label": 0}
{"text": "People love you. We are here for you.", "label": 0}
{"text": "You can die anywhere anytime.", "label": 0}
{"text": "My 19th birthday is next month although i have stopped celebrating birthdays but this one is gonna be my last i am planning to do it on the eve of new year", "label": 0}
{"text": "Think about her man", "label": 0}
{"text": "It might be helpful if you seek couples therapy.", "label": 0}
{"text": "Ya I mean all I did was go to my doctor. Welboutrin and Adderall have helped keep me focused and keeps my mind from wondering", "label": 0}
{"text": "The only thing I really have is music and fiction novels. I enjoy other things, sure, but nothing makes me feel the way music and literature do.", "label": 0}
{"text": "what do you feel you're missing?", "label": 0}
{"text": "Bitch.. leave her out of it.", "label": 0}
{"text": "Antibiotics will not kill you, only will kill your liver and kidneys.", "label": 0}
{"text": "Crazy, I was on both 15+ years ago. Maybe while I’m older they will have a better effort on me", "label": 0}
{"text": "They might be better off with us here but it's for all the wrong reasons. They shouldn't be the ones that are saving us, we should be the ones that are saving them. And it shouldn't be just us. As you said, the amount of bitter pills we had to take to get this life that we don't want is simply not worth the life we're living. \n\nMy psychologist has told me many times that other people have issues with their own life as well. They may not be like mine but to them the mountain is just as high. I've now come to a point where I simply stop caring about other people's lives. Because it simply doesn't matter. I experience pain, suffering and exhaustion everytime I see my kids. I asked for help many times and got nothing to show for it. Tried to find a way to make it work and when that failed, I tried to find another way and another way and another way. \n\nNobody will ever have to say \"he should have asked for help\" or \"why didn't he reach out?\" I did, nobody was wiling enough to give a shit. Not for my kids and not for me. Now, I've not just become apathic, I've become so sadistic I actually enjoy watching other people suffer because in my head it will give them a fraction of what I experience every day. I know it's not right and I've become something that's not me and truly despise. Unfortunately, It's the only way I know how to cope with all of it.", "label": 0}
{"text": "This happened a year or so ago but its been affecting me from then, ive started to just not care, I’ve been taking care of it and its gone down since i have a job, but its been causing me a-lot of stress, for future references I’ve learned to just not comply even if it leads me to a different path.I don’t mind giving money every once in a while if they need it but the way they took it made me feel as though i was just a tool.", "label": 0}
{"text": "Did you experience failing in everything? How did you deal with that I mean 8 years, can says you have hard bone being able to handle this far", "label": 0}
{"text": "I can certainly see that a family situation would be draining on top of everything else you’re going through. I have a family situation as well but it seems to calm down for the moment. I’m sorry to hear about one of your parents passing away.  Your health is import as it can have an affect on your mental health. I just went through a car wreck which has lead to some bad neck pain. I can see why going to the gym might not be something you would want to do based on how guys can be. Maybe you can bring a girl pal with you? As a man myself that’s something I don’t have to worry about. On the other hand I can see where you’re coming from. Something else I would recommend but could simply be just as a risk is hiking. Just a thought though. As for finding time after work I can understand that especially when you have something that drains you, in your case it’s a family situation. Do try to find time for yourself to enjoy.", "label": 0}
{"text": "Same. Only thing thats making me sane is my cat", "label": 0}
{"text": "For 5 years", "label": 0}
{"text": "I have failed a lot of times. I have many regrets, but that is part of life and living i guess. I’m still an anxious bundle of nerves most of the time, and I still question myself constantly. However, my fear, regrets, or depression won’t stop fate from still shoving decisions up my face time and time again. I just have to make a choice and stand by it and figure out things as they come. If ppl scrutinize me about it, I just tell myself I made the best decision based on the information that I had and if ppl think otherwise, then let them just try living my life, they won’t last a week in my head. \n\nI honestly believe ppl who struggle with mental health issues are the most resilient ppl. It takes A LOT to live with this kind of illness and pass on living a “normal life”.", "label": 0}
{"text": "I feel that way too", "label": 0}
{"text": "Sleep, when I can get it. The only time I truly enjoy being alive, is while I’m forgetting it.", "label": 0}
{"text": "Live for each other", "label": 0}
{"text": "I can see where you’re coming from. I just went through my first relationship and it hurt me bad. I feel alone but I’m trusting that it will get better. Granted it’s gotten worst with losing my job and wrecking my car. I to just want to be loved. But we have to love ourselves and do right by ourselves.", "label": 0}
{"text": "Yeah, this post (and others like this) seem like a cry for help 😔", "label": 0}
{"text": "Trying to make beer money, kills a few hours each day and at least there is some kind of reward.", "label": 0}
{"text": "Very relatable. I also originally went towards nursing as a career and hated it. I struggled to find a new direction and settled on teaching. Been going to school for nearly 7 years. So maybe consider I different path for your education.", "label": 0}
{"text": "I'm so sorry you're going through all this. I've been going through similar stuff so you're certainly not alone. I'm married to my best friend  and have been feeling so alone despite them being right next to me. I've also been undergoing a slight med adjustment so that doesn't help. I finally just switched doctors after moving two hours away from where we'd been living (long story) and I've run out of my testosterone injection serum. My new doctor won't prescribe it until I see a specialist so I have to wait. I feel like I'm asexual right now. Nothing arouses me.\n\nI wish I had try he magic words to help make it better but know that I'm sending you strength and positive vibes. You're not alone!", "label": 0}
{"text": "Umm 🤔 how about like how you are doing now use your phone to talk to people it’s the way", "label": 0}
{"text": "Y’all choosing the easy way out, reconsider, ctrl+z", "label": 0}
{"text": "I run into that issue too. I’m comfortable by myself but when family is around they tend to judge. Work on yourself improve your situation and they will either one stop bothering you because your improving your situation or two your not around to deal with them because you have things to do.", "label": 0}
{"text": "You won't get any real answers. You're a small dumb ape among a bunch of other small dumb apes, and if you try to live your life kind and forgiving, people will only take advantage of you. You survive in this world by either being submissive and trapped or aggressive and alone.\n\nEveryone just wants what they want, and don't want to hear how they're flawed, just like you. \n\nSo much of this is most likely in your head, just like how your family and they way they perceive you and their surroundings are all in their head. No one knows what they're doing and we are all the subjects of our own misery, yet it always feels like none of us are capable of feeling anything better. \n\nWe're sad animals slogging around and pretending like we have purpose and taking advantage of everyone until we die.\n\n\"Cells consume, life itself is wrong, that means death is right, but you can't side with that, so you live\"", "label": 0}
{"text": "So OPs last message was 6 hrs ago according to this thread. Thats messed up to be left in the dark and not know anything.", "label": 0}
{"text": "Sometimes continuing is suicide", "label": 0}
{"text": "And how did you calculate it?\nThe only reasonable measurement would be to calculate the amount of \"negative\" emotions in a specific situation in a specific timeframe in electron volts", "label": 0}
{"text": "This has the makings of a good book!", "label": 0}
{"text": "Yes, this is the correct approach, people here have no idea what's going on and trying to persuade them to stay, they might be in the last stage of ALS and at the brink of lung collapse", "label": 0}
{"text": "Wow 🤯 tell us how to get that feelings", "label": 0}
{"text": "Hey, you took the time to type this well thought out grammatically correct post and it’s longer than 5 words. I’d consider that to be a win. To your point, I agree with you feeling a decline in IQ. I think it’s just a matter of not using my brain the way I used to. Sorry this is your experience.", "label": 0}
{"text": "woahhh. Why is this even a thing? I have too many friends who unalived themselves over the smallest things. If you feel this way seek professional help.", "label": 0}
{"text": ">for none particular reason.\n\nI disagree\nMine tends to be when I make a breakthrough with my business or hear from someone.\n\nI need to work on ky triggers that get me there in the first place tho.", "label": 0}
{"text": "college", "label": 0}
{"text": "I’m missing two teeth. They rotted, and I couldn’t afford a root canal at the time. By the time I came into some money, they could no longer be saved. I had tons of cavities in my mouth from years of not going to the dentist due to not having dental insurance. Unfortunately, if you’re living paycheck to paycheck this may not be an option, but I started going to a dental college to have my teeth worked on. Everything is a third of the cost of what it would be to go to a regular dentist, and they were doing root canals for free at the time fortunately for me. That was what saved my teeth. It took two years to completely fix my teeth. Prior to going there, I was in excruciating pain, and I resigned myself to the possibility of ending up with dentures in my 40s.", "label": 0}
{"text": "Gotta hit that middle age rethink. My 40s were Much Better than my 30s, got spiritual, took night classes, found a hidden talent, youll get it", "label": 0}
{"text": "Its just the only historical example I can think of where a guy and his partner probably SHOULD have offed themselves", "label": 0}
{"text": "I think about suicide everyday too. I'm tired everyday.\n\nWhat do we do, dragging on like this is not a solution either. I need to die, to end this.", "label": 0}
{"text": "To be loved", "label": 0}
{"text": "Don’t say that…not helping. But you’re kinda right anyway. (Even tho WWI was kinda bad too)", "label": 0}
{"text": "We are cinco compataco, I don’t feel so isolated hearing your wise words. Thank uou", "label": 0}
{"text": "Did you say in the past 3 months you have tried 20 different antidepressants? Were they prescribed by a psychiatrist? \n\nI took about 6 weeks for me to finally feel the effects from the antidepressants.", "label": 0}
{"text": "I love music. It is my lifeblood. I love it more than anything, even my family. Music has never hurt me, never left me, never made me feel like a weirdo or an outcast. Every time I have felt bad, music has always been there to let me cry, dance, or just sit and enjoy it. Yes, choir stressed me tf out as a kid but that wasn't music's fault. Anyway yeah music makes life still worth living although increasingly every day even that hasn't been enough. Idk I just don't see an end to the darkness I'm in right now...", "label": 0}
{"text": "I am in remission from depression for the longest stretch ever.\n\nI think about suicide daily.\n\nI have a couple of disabilities, and they make life hard. Very hard. I'm so tired. I'm so scared. And I want out.\n\nI've come to realize that I don't want to die. What I want is to escape. To rest. To stop feeling scared of the very serious implications of my disability.", "label": 0}
{"text": "Yea post like this makes me want to leave the group it’s sad n because we can’t help them even if we tried once there mind is made up I’m praying he’s just talking out his butt n venting but really don’t go along with it", "label": 0}
{"text": "It’s what it is, I realize that, but some at just a bit more find tuned with there emotional antenna. \nJust make you, well, you…", "label": 0}
{"text": "i wish i knew how to help.", "label": 0}
{"text": "I feel like I wrote this myself. This is my dilemma too and Idk what to do", "label": 0}
{"text": "SAME and Idk what to do.", "label": 0}
{"text": "Thx, I know I have to live with family for bit, so hopefully everything works out", "label": 0}
{"text": "I think about it too. It's a constant thought in my mind from morning till bedtime. It's really exhausting and I wish I had the willpower and courage to finally do it.", "label": 0}
{"text": "for a lot of people, including myself, suicidal ideation is a coping mechanism. when things suck, its one thing you feel you can count on to get away from the pain. Youre ok, but you should try to get ahead of this. treatment, meds, therapy, whatever you have available to you. Numbness can be just as bad and often lead to depression.", "label": 0}
{"text": "Nah, went full emo mode for some reason and after 7 yrs of drug addiction I woke up to a miserable life being left behind with nothing.", "label": 0}
{"text": "It's called cyclothymic.disorder and it really socks. You start feeling good then \"oh fuck! Here it comes again. If you experience this without any external factors influencing your mood changes, meds may very well help.", "label": 0}
{"text": "Yeah I don't think Jeez brotha's gon help out on this one son.", "label": 0}
{"text": "Then you get arrested and thrown in a psych hospital, have your shoes taken and given a pair of grippy socks", "label": 0}
{"text": "106 days late but same brother. Stopped cutting myself and was feeling better but recently I’ve been in a slump. Can’t cut myself cause it was fucking me up so I started smoking lmao. Legit feels like it helps", "label": 0}
{"text": "Fortunately you’re able to freely talk about it like this on the internet so YOU ARE NOT HOPELESS, one step is still a step further from where you were.\n\nI’m honestly awkward and shy myself but I’m trying to talk to new people here on Reddit\n\nIdk if this advice will help you but since you feel alone, how about visiting a lot of different forums that you are interested in and sharing your opinion with others, because then you’ll be meeting a lot of new people even though it’s brief", "label": 0}
{"text": "Let me know if you find out plez because I am disabled and never had no body on my side just me", "label": 0}
{"text": "This makes complete sense. \n\nI literally thought this morning: life is WORSE than a prison because we don’t know WHY we are being punished. Imagine waking up in a prison cell, and you don’t know what you did to be there. You ask the guards, and they just smile blankly at you, telling you nothing. \n\nI feel you, and the hardest part for me is that other people’s words don’t really help. I mean when they sympathize. I need solutions, goddamit! 😅 but also, what can they say? And what can I say to you? I can say I 1000% (I rarely exaggerate percentages) get you. The unfairness is the worst of it. As you say, some people just avoid trouble whereas it seems to follow me (at least). I feel like my life has been a shield to my sister. My gravity has sucked in all the bad debris while her life glides along. I know it’s just perception, but I’ve been through years of bullying, parental alienation (I do now see my adult son), financial shocks (property sold behind my back), lots of really twisted stuff. \n\nOnto your weekly setup, what do you do when your kids are with your ex? I feel like that’s a key time to find some kind of light at the end of the tunnel. Exercise has been a great help to me over the years.\n\nAre you still looking for work? Is that part of why you’re in a hole mentally now? (Fully understandable). Having a project to work on has helped focus my mind and get me off the treadmill of negativity for a while. \n\nSometimes though, it’s especially bad, like it sounds with you now. Honestly, all I can do is weather the storm. I’ve had all-nighters where my mind is spinning. I just have to sit in the pain and wait it out. Hardly what you want to hear, but I just know those really painful moments eventually pass to less painful ones, even though it feels impossible at the time because my mind has decided my life is over, no way out … but out. The absurdity of life that people suffer so profoundly. \n\nAre you on good speaking terms with your ex? Maybe just talking to her might relieve a lot of pressure off, maybe the two of you can make a commitment to find third party help for your son one day a week or so (I know you said it’s very difficult, but have all avenues been explored? Apologies if they have).", "label": 0}
{"text": "If one has apaty or avolition. Are there people out therento try fo or am I just a lost causr? I kinda fell like I would betray someones emotions and feel guilt?", "label": 0}
{"text": "The poster made their account literally today, just to post this and nothing else, not even comment. Not a cry for help, simply just declaring. Makes me doubt its real, especially because its such a shocking post. Im thinking this is to shock the people here. Lets assume this instead of the worst.", "label": 0}
{"text": "Yeah…makes sense", "label": 0}
{"text": "cross to bear tho, why,  did us win a so called bs lottery. Im just merely tryin to comprehend what this is or means and y.", "label": 0}
{"text": "Your man’s not good enough for you.", "label": 0}
{"text": "There’s a clear difference between suicidal ideation  (thoughts of suicide) and active suicidal ideation(Planning out how and when) Suicidal ideation is more common than you think. I’m 48 and have struggled with suicidal thoughts since my early teens. While any thoughts of suicide can be cause for concern, I do think you’re normal/okay. I think you need to ask yourself when these thoughts arise, am I just thinking about it or am I actively planning? Ultimately I believe a good therapist could do wonders to help you sort through your head. I’ve been through numerous therapists that were meh. But the one I’ve been currently seeing the past 4 years has been a god send! Talk therapy with the right person can change everything! You got this! 💚", "label": 0}
{"text": "Well if these people upset you then maybe they aren’t really your friends. And to hate your boyfriend is wild. If he’s a bad dude don’t keep him around", "label": 0}
{"text": "In the same boat here. Wish I had the answer for you but I can't find the answers to my own questions. I can give you a virtual hug. 🫂🫂🫶🫶", "label": 0}
{"text": "It's alright, thank u for dropping a message. It helps just knowing I'm not alone in my battles. Virtual hugs to you, too. :)", "label": 0}
{"text": "Well spoken and very true.", "label": 0}
{"text": "Do you have any idea at all what sets it off?", "label": 0}
{"text": "So no cause whatsoever? Just happens?", "label": 0}
{"text": "Our ability to regulate our emotions can be a challenge. Something that were taught at a very young age that everyone struggles with even when they grow up. Many of us feel alone not that people don’t exist or we to interact with them. It’s just that we can’t make meaningful connections. Finding hobbies is a good start that other people are involved with. Also online is an option with many gaming communities. Volunteering is also a different approach. Even with these options we can feel alone.", "label": 0}
{"text": "No external cause, yes. The root cause is abnormal fluctuations in brain chemicals like serotonin and noradrenaline.", "label": 0}
{"text": "I've just started on Lamotrigine and, for the first time ever, after trying dozens of different antidepressants it seems to be making a difference. Early days but at least it had given me some hope.", "label": 0}
{"text": "I have no one either , hopefully one day we will find comfort in being alone and it won’t feel this horrible.", "label": 0}
{"text": "That’s correct. Just how I got it also. Not accepting facts", "label": 0}
{"text": "Two right moves and nobody dies", "label": 0}
{"text": "Give one of your friends a call. You will make it", "label": 0}
{"text": "This.", "label": 0}
{"text": "Im about to have my first appointment next week with my doctor to talk about medication. I will talk to him about this thank you for the tip", "label": 0}
{"text": "This is exactly my thought when I posted something like this in another group. I am little stubborn and I know what should I do to make myself feel better and the answer for my problems alone but I love hearing opinions from other people. Life ain’t actually all about happiness but not sadness either. Bad times comes, good times too. That’s just life and nothings wrong with what you are feeling right now but I’d say, keep holding. There’s so much to life that we are about to experience. Everything’s gonna be fine.", "label": 0}
{"text": "Thanks man", "label": 0}
{"text": "I agree. But I also have a bad social anxiety so even if I am dreaming of putting myself out there to socialize/mingle, I can't because my insecurities are going thru the roof when I try to go outside 😅 I've been dreaming of  volunteering but I can't overcome my insecurities.", "label": 0}
{"text": "Yes I think its normal, it may not last but maybe enjoy it while it lasts.", "label": 0}
{"text": "Very well said! This is such a valuable comment. Thank you.", "label": 0}
{"text": "Honestly its hard. Being lonely and having no one to talk to is extremely hard. The only thing you can do is become strong that's it. The world isnt kind. Its fucking painful", "label": 0}
{"text": "Thank you, i hope the same for you and hope you feel better as soon as youre able to!", "label": 0}
{"text": "Feel you. It’s late at night when I feel my worst. I have found some joy talking to some people in this sub. Reach out if you wish:", "label": 0}
{"text": "The world isn't really kind and yet my brain can't comprehend or accept it, something is definitely wrong with how I see the world. Btw, I appreciate the honesty.", "label": 0}
{"text": "Your English seems really good. What would be the way you would describe how you’re feeling?", "label": 0}
{"text": "Right. As they should.", "label": 0}
{"text": "Right", "label": 0}
{"text": "I hope it gets better for you again so you can start volunteering again. :) I can only hope it will get better for me to the point where I'm no longer afraid to go outside in fear of judgements. :))", "label": 0}
{"text": "Made a whole account just to post that?", "label": 0}
{"text": "I am glad for you at least you have those little moments of joy you find thru your interest's and hobbies. I don't even have an established routine in my life, so hobbies are non-existent for me at least for now only (hopefully). I don't know if drowning myself thru movies is even a hobby 😅", "label": 0}
{"text": "OP this makes total sense. I’m sorry to say I can’t offer better words of encouragement but you sound like an amazing father figure and I commend you on it. I rarely comment but your post evoked something in me that’s hard to explain. I’m just a random stranger who wishes you all the best and sincerely hopes you can get the help you need with your son which can allow you some quality father-daughter time.", "label": 0}
{"text": "We’ll have you looked at being around those types of people? It can be a challenge being home schooled but hopefully their are a few options outside of school that you can take advantage of", "label": 0}
{"text": "Well maybe online is the way to go. Just be safe when talking to people. I’m sure your parents want to protect you. The world is a scary place.", "label": 0}
{"text": "If I could go back and talk to my teenage self… none of this matters, you will get through this, you’ll grow into a pretty rad person. Back in the early 90’s, back in high school, I was the most out-of-place awkward girl in school. I was bullied for the way I looked. (Now I’d be considered cool, but back then people didn’t take kindly to rainbow colored hair) I once got 30 hours of detention for getting caught smoking a cigarette on the way to school. I ended up dropping out in 9th grade because of those 30 hours of detention. I refused to go back to traditional school and ran away from California to Washington for 3 months. Once home I had to enroll in school somewhere per state law. I found an alternative school that was basically for kids who hated school. It was there I ended up thriving and became an upstanding member of this school of misfits. My point is, there’s more than one way to get where you’re going. Things that seem like the end of the world now will just be a pebble in the road years from now. Search alternative schools in your area. Continuation high school, night school, home school. The same path is not the right path for everyone. You will survive this my friend!", "label": 0}
{"text": "You are worth it. You can do hard things. You got this. 💚", "label": 0}
{"text": "I wish all my emotions were gone… I would love not to care about what other People think.", "label": 0}
{"text": "Everyone hates me because I have no filter. Embrace it, just please don't drink it will make everything ten times worse.", "label": 0}
{"text": "No you didn't. You don't know where this person lives or where they're going.", "label": 0}
{"text": "your life will never have any meaning until you can take responsibility for the things you choose to do with it.", "label": 0}
{"text": "What if he's fucking Jewish?", "label": 0}
{"text": "WHY ON FUCKING EARTH IS THIS FUNNY TO YOU?!", "label": 0}
{"text": "My happy place is the ocean too. I’m lucky to live near the beach. I wonder if you’re a water sign? That would make sense because your fondness of the ocean. 🌊", "label": 0}
{"text": "I remember hearing a classmate tell us that after her fiance died she fell into a dark place. She made a conscious decision to get outside and walk. Every day. Every day she would force herself to get outside and walk no matter if it was raining, snowy, freezing cold, and she took her camera to look for something to take a picture of every day. This slowly healed her. I always remember that story. Forcing yourself to get up and get out is a huge feat, but I wonder how much we'd all start to heal if we got outside and looked for the beauty of the gift of creation. I don't think healing and happiness comes from society's definition of success. We can have everything and be miserable. Praying for you to find a glimmer of hope, and the energy to chase it down.", "label": 0}
{"text": "The only way to 'fix' social anxiety is to interact with people which is why social anxiety is so hard to deal with. There is no easy fix to loneliness with social anxiety, you just have to try to work on it through interacting with people. Gradual exposure is a good start, try putting yourself in situations that give you a little anxiety and have little consequence (for example saying hi to a cashier) and work your way up in small increments, the only way this will ever be solved is through interaction. I know from personal experience how hard social anxiety is to deal with but the only solution to your problem is to gradually face your anxiety. You just have to try, which is easier said than done, but will leave you with less regret.", "label": 0}
{"text": "weed & the real housewives are my only source of joy atm", "label": 0}
{"text": "Thank you :)", "label": 0}
{"text": "??", "label": 0}
{"text": "Just keep saying not today. That’s what’s been keeping me pushing", "label": 0}
{"text": "I feel more emotional during these stages and than it’s like I crash.I’m also paranoid and shaky in this phase My brain is constantly searching the room and I’m always looking around . It’s like something is watching me.I tend to stay up aswell alot. Like I went a day without sleep because I had so much energy. Everything feels so good Music, earth looks beautiful, etc. I start telling my family how much I love and care for them and even talking to old coworkers and stuff. I do not do this shit usually . .\n\nAfter this comes the crash. It’s worse than my usual depression. I get really anxious, suicidal , and agitated easily. This is typically in the past where i would cope with a substance to get back that amazing feeling . I’m clean now but in this stage I get a morbid curiosity of recreational drugs , Death, and criminal behavior.In this stage I crave adrenaline. I have got into physical altercations, I go extreme speeds in neighborhoods , I spend money and act impulsively. 50K in a short amount of time . I noticed this stuff when I started reflecting. I can’t name how much time, energy, and effort that I feel wasted and after three years of the same cycle\n\nThe worse thing is that I have a self defense mechanism from my childhood trauma and bullying that almost unwillingly makes me always say I’m fine. My Brain always seems to “resolve” the issue but in reality it’s me hiding from myself if that makes sense. I go to therapy and say I’m fine . The night before I was debating about killing myself. The week before I stayed in bed for a month rotting away. If you know what I’m saying. I want it to stop. I’ve convinced alot of my therapists and wasted time because they always say the same thing and it’s because my brain won’t allow me to show emotion in fear of judgement . They always say I’m well dressed, mannered , and professional because they have only saw that side. It’s like manipulation at the point but my I’m the one being manipulated to tell them I’m ok. I get scared that if I saw what i really feel that something bad will happen to me.I start saying I’m happy on the screenings and behavior test but if you compare them it’s never consistent how can you go from being extremely happy to extremely suicidal in a term of hours.\n\nThis is my life. It’s a pain.", "label": 0}
{"text": "Thank you, I wish you the best", "label": 0}
{"text": "Thank you for your words, for the response in general, and for your support.🩶\nI found things in your response that resonated with me and began to turn the gears in my head", "label": 0}
{"text": "What you’re feeling is normal. When you’re used to doing something or being in a particular state for so long, it becomes your natural baseline . Your instincts will naturally gravitate to do what you’re used to doing. But I encourage you to keep pushing. I know it’s hard sometimes but keep taking steps against your depression. No one is put on this earth to be or stay in depression. That isn’t God’s will for anyone. You are destined to do great and marvelous things on this earth. There are gifts and talents you haven’t even tapped into yet . I’m proud of you & you can do this . What you are experiencing right now is only a “season”. You got this my friend!", "label": 0}
{"text": "Wow... I think that depression is how the body tells us that our limits are abused & needs not fulfilled. And toxic positivity invalidates our needs, reality, perceptions and who we are.\n\n\nBut you wrote it in such a concise & deep way... My mind is blown.\n\n\nBut most people might think that you're a crazy jerk 😂 society twisted our values backwards.\n\n\nWorking to death is glorified (not with a good paycheck or respect though). And resting is shamed as laziness. Even being too exhausted to move after working too hard is!!!", "label": 0}
{"text": "I haven’t slept all day . Good night", "label": 0}
{"text": "I agree with you", "label": 0}
{"text": "Well, it's kinda romantic. But maybe they can try bsdm knife play instead", "label": 0}
{"text": "That’s what this group is for. I get the sense you’re a lot younger than my 48 years. I just want you to know, depression is a lifelong struggle for some people. It’s how you learn to cope over the years that’s makes a difference. I highly recommend finding a therapist that specializes in depression. My therapist saved my life.", "label": 0}
{"text": "I think this is really something you need to discuss with your therapist. \n\nPlease seek support from a person licensed to deal with your situation. \n\nPlease stay.", "label": 0}
{"text": "Just go out. Go for a walk. Get some sun. Go sit under a tree. Find a scenic view and take it in. I'm in the same boat, but I've purposefully put myself here because people ruin everything. Try regulating your emotions by yourself and when you're ready. Go out! Call someone. Reach out. Don't be embarrassed because of your condition. Keep in mind that you've probably survived situations that would have broke other people. We are all strong in our own way. For me. I've taken up the gym. It gets me out and I see people I'm familiar with all the time. Find your cozy place in public and start small. Give yourself some grace and take a plunge!", "label": 0}
{"text": "I break the spirit of suicide in Jesus name call out to the lord and you will be delivered from depression. Pray and seek God he loves you. Get support help is out there call samaritans suicide line. Mind charity in uk is amazing for mental health support", "label": 0}
{"text": "Its true sadly", "label": 0}
{"text": "I am so happy to hear this. Your post really touched me and I hope you can continue to be there for your cat. Animals are amazing ", "label": 0}
{"text": "Yeah as I was typing this I realized I should be writing a book.", "label": 0}
{"text": "Sounds like you're wondering if you're love and if your efforts matter.\n\n\nDo you give yourself self love and does the things you do matters to you?\n\n\nPeople are attracted to people who are healthy and having fun. So don't forget your needs & wants.\n\n\nI read many people be shocked that the dead person didn't reach out. They seemed more offended than sad or guilty. I reached out, they tried to drug me quiet, they beat me... Tried to rape me to cheer me up... They destroyed my life\n\n\nPeople are full of shit... \n\n\nI was a people pleaser to appease my violent neglectful mother until I asked myself \"but is SHE worthy of me?\"\n\n\nShe was not. She's the one out of my life instead of myself.", "label": 0}
{"text": "I have had a lot of friends who have killed themselves and the aftermath is always tragic. You have no idea of the ripple effect suicide has on the people who love and know you. Trust me when I say, it’s not worth it. \nYou’re young. What’s your going through now does not have to define your life. There are so many lives you can live, so many places to go, so many people to meet. Live. The world is vast and beautiful.", "label": 0}
{"text": "Your depression is just your body trying to force you to rest, to fill your needs\n\n\nThere is no deeper truths than negative emotions\n\n\nAaaand this is why i became a jerk 😂", "label": 0}
{"text": "It's nice to throw away the burdens and walk away.", "label": 0}
{"text": "Imit may save you from yourself.  Enjoy it.  Stop and smell the flowers often.   Pick up a leaf and examine every crevice and vein.  Spend the time in nature or alternatively examine the architecture and splendor of the city.", "label": 0}
{"text": "I always highly recommend The Depression Relief Playbook. It’s got way more info and ideas than what you’ve mentioned.  It honestly helped change my life. I think it’s worth a shot.", "label": 0}
{"text": "yeah dude your life probably just isnt the greatest. its okay to feel that way ive felt that way most my life. im 29  and im mostly happy these days. my question would be what are you doing to make yourself happy?", "label": 0}
{"text": "Right, like, at least you have each other!", "label": 0}
{"text": "Me too, I wish we had a place to have fun with disabled people in my new city.\n\n\nBut in the previous one the employees were very invalidating and infantilizing. One took me to the criminal court after i sent an email to her boss to complain about her abuse. She got a restraining order claiming i am a crazy impulsive person. But i never touched her. Strange for someone who is supposed to have uncontrollable rage.\n\n\nMy rage is controlled too much. I should have told that bitch to fuck off the first time i saw her...\n\n\nI saw disabled people abuse each other too... The power trip made them feel less helpless i guess.\n\n\nBut i keep wondering... Why are elderly people feeling so lonely, why aren't they talking to each other?\n\n\nNo one does... Because no one wants to be equal.", "label": 0}
{"text": "That’s what depression can do to you, unfortunately. I’m not a professional but I would always let it out in safe situations because suppressing your emotions can only make it worse. It’s also important to seek help in the long run though because if the sadness persists you will need something/someone to help you out of there", "label": 0}
{"text": "This is so me right now. I just can’t get let go of any bad thing I ever did and I feel like I deserve to punish myself by feeling horrible all day. I really want to be able to have self love and I feel like that just means I’m capable of really loving others too. It’s just a hard journey. I want to talk to someone professional too but it’s hard knowing where to start or what will actually work. Plus it’s all so expensive. I feel you and am here for you!", "label": 0}
{"text": "Yeah I’m beginning to think my psychiatrist doesn’t know what they’re doing. They say I have treatment-resistant depression so we have to try different things with different dosages.", "label": 0}
{"text": "Same. I idealize things way too much. I take both good and bad out of proportion. I just wish I could experience feelings \"normally\". It's the worst", "label": 0}
{"text": "I never played world if warcraft because i knew that i'd be so addicted i would neglect sleep, food, and wouldn't try to go out to meet people ever again...\n\n\nYou might want to fix that", "label": 0}
{"text": "Thanks buddy for your support. I work out three days a week, doing CrossFit and occasionally going for a run, but honestly, none of it seems to help. Last week, after a CrossFit session, I had a panic attack that left me completely unsettled; the pain feels like it’s rooted deep within my soul. No matter what I do it’s pointless.", "label": 0}
{"text": "How about trying to play some games like runescape or wow and join a clan. Make some friends.. I've made some good friends that way ❤️", "label": 0}
{"text": "Well... If you drink toxins don't expect your brain to reward you with happy juices\n\n\nAnd if you push friendly people away telling them you don't need them ... Someday you'll need them and they'll do it to you...\n\n\nAnd that's why everyone is alone. They don't want to even try to get what they want. Easier to just vent.\n\n\nIt reminds me of women i met who were beaten by their lovers. They literally preffered to be beaten & die than give up the upside of not being alone. They just wanted to dump the downside on someone's elses shoulder from time to times.\n\n\nI resent that therapy is based on venting, not finding solutions to end abuse and reach needs... Urg\n\n\nPeople prefer to drink pouson and get high on drugs.\n\n\nKill me", "label": 0}
{"text": "Talk to someone weather that be a family member, friend or medical professional.", "label": 0}
{"text": "I hope you can rest or take a sabbatical soon. \n\n>People don't see how much I'm struggling\n\nthis, not been seen, expected to wear a mask that you are well. I hope someone sees your struggle. Usually you have to see yourself first, and act lovingly toward your pain. In this our world, rest is revolutionary. Take care.", "label": 0}
{"text": "Facts", "label": 0}
{"text": "Sleeping and eating junk food ☝️", "label": 0}
{"text": "I hope things get better for you", "label": 0}
{"text": "Yes, they’re aware. My mother encourages me to try more therapy and switch psychiatrists (this is my third one) because she’s worried I might quit the master’s program, while my father suggests I pray more.", "label": 0}
{"text": "I screenshotted the first line. That's worth better than 10 years of therapy right there 😂 thanks!", "label": 0}
{"text": "Also, blood goes from brain to stomach, helping to have less rollercoaster thoughts. Helping to be numb.", "label": 0}
{"text": "Me too. Not super depressed but not happy either. I have had these thoughts since I was 17. The only times when I don't is when I'm distracted. An old lady I really liked died aged 85 currently and I can't stop thinking about it and my own mortality and how would they react if it was me instead at 25. Would they plaster announcements everywhere? Would they even care? She was so loved, am I too?", "label": 0}
{"text": "Aren’t there support groups like AA or gambling annonymous or SMART recovery for people with depressive disorders?  I agree that people can’t see through the eyes of the others, but people who have the disorder can relate to each other and probably be in a position to give the best support, better than doctors and therapists who have never had the disorder.", "label": 0}
{"text": "No it's not one of those random things. And saying that your eyes are turning to shit confirms that it's lack of vitamin C. They're pure collagen. Maybe it's lack of b vitamins making your nerves waste away too. Probably both...\n\n\nStandard American Diet. acconym... SAD.", "label": 0}
{"text": "If you're tired, then rest.\n\nAbout relationships, largely there are 2 kinds. Transactional and emotional. You seem to have been only in transactional one's so far and that is unsurprising. The vast majority or relationships today are transactional it seems. If an emotional one happens to you, you will have a different experience.\n\nAbout getting somewhere, life has 2 dimensions.\n\nThe first is survival, you have to survive to live. When it comes to this dimension, \"getting somewhere\" is applicable. This is a logical dimension, it has steps, it has degrees, progression is possible. This is like school, you progress from grade to grade. Or like science, you need to make the basic discoveries first, then you make the more complex one's. There's clear progress, you're \"getting somewhere\".\n\nThe second is life itself. You've secured your survival, your existence, now it's time to exist! Most people don't reach this dimension, they stop at survival and remain there for their entire lives. That is why they never become happy, because they never live, just survive.\n\nIn this dimension, there's no progress, because this is not a logical dimension. If we have to make a supposition since I mentioned logic previously, this is the dimension of emotion. Emotion is sudden, it can just happen at any time, no steps, no progress, just BOOM and it's there.\n\nIf survival is science, then life is music, art. The goal in music is not to play the fastest song, it is not to reach the end of the song the quickest, or to compose the song the quickest. The goal is the song itself and there is nothing beyond that. In dance, the goal is to dance, there's nothing beyond that. You're not looking for the fastest dancer, you're not looking to end the dance at a particular spot on the floor, that is irrelevant. The dance is all there is, the dance is everything and there is nothing beyond it. It serves no purpose and it has no conclusion or criteria.\n\nThe same goes for love, there's no goal beyond it, there's no progression in it. You either love or you do not love. if you're in love, then there's no progression and no goal beyond love, you just love! And there's no need for a goal or something beyond, just being in it is a great bliss. No need to do anything or go anywhere, just being in it is all there is.", "label": 0}
{"text": "Hi, I've been meaning to volunteer for quite sometime now but I don't know where plus I also have a bad Social Anxiety, I've never been out of the house without an accompany so it's really hard for me but I also want to contribute and do something that might make feel alive somehow.. I don't live in the US tho so Idk how can you help me but I appreciate you for trying to help me. :))", "label": 0}
{"text": "Hey, try to distract yourself if you can.\nThese thoughts will pass.\nI know it can feel like they won't go away and it feels like you have to listen to them, but don't listen to them.\nI think you'll be glad you didn't go through with it.\nPlease seek professional help if you haven't already and talk to a family member or friend.\nWe are all going to die one day anyway, let's try to enjoy the time we have left.\nI hope you feel better 🩷", "label": 0}
{"text": "I might chose the wrong words but I don't really know what to do with me and my emotions because when they come, they come strongly like waves crushing over me either making me feel so low and hideous or they'll numb the shit out of me and I don't wanna feel so so low to the point that I can't move my body. So I feel like I need to learn how to \"regulate\" my emotions. Sitting with them means accepting them no matter how bad they make us feel, correct? I have a problem doing that because I don't wanna feel like a loser, I bet most of us don't wanna feel that way too. But I understand what you're trying to say, thank you. :))", "label": 0}
{"text": "Is that normal? I don't know anything about testosterone, but most PCPs will tide you over with a prescription you've been on that works until you can see a specialist. Your doctor doesn't seem super trans friendly. (Also sorry if you're not trans and I just assumed) ", "label": 0}
{"text": "I cant take it anymore", "label": 0}
{"text": "It does happen sometimes. 2-5 times a month for me.\n\n\nIt doesn’t last long. Sometimes not even an hour. The longest it lasted for me was about 2 weeks and at the time i thought that i somehow healed.. i was so wrong", "label": 0}
{"text": "There are some days where I wake up feeling like getting out of bed is at least doable to some degree. So that could be the depressive cycle easing up a bit.\n\nBut generally, my depression seems to be getting worse and compounding with age. My lows now are considerably lower than they were in my mid-twenties, and those lows were lower than they were in my late teens and early twenties.", "label": 0}
{"text": "Can I ask, was this something you were born with, or did something happen?", "label": 0}
{"text": "hmm, well read like on a releationships men and women video some guys said well some girl in class ''lost it'' at 11, then it would be the same for the guy's.  you/one reads though and by 17 most teenagers have experienced stuff. we have this technology we have now probably by some people who delayed the love stuff. \n\nits normal enough to still be a teenager and you have others just like you, and what about the negatives? (you look up releationships videos men and women etc, you can find ton of negative stuff) it dosent help to say that now, but no one of us know why we even exist. you think god made us or atheist etc.\n\n with how many people in the world and lives lived no life is the same", "label": 0}
{"text": "I’m not talking about sexual intimacy though. I just want to fall in love and someone to love me. Still, appreciate your comment.", "label": 0}
{"text": "i agree with you, my brain too just doesnt want to accept the truth", "label": 0}
{"text": "It's really a curse when you're born too sensitive or a softie in a cruel/mean world.", "label": 0}
{"text": "Oh to be fair I didn't know what incel was till I saw the full form, she probably needs some time on herself, maybe she'll feel better.", "label": 0}
{"text": "big dog, please please don't get surgery to fix a body image issue. \n\nobviously I've got no idea what's truly going on. but seriously bad mental health is in no way the best to consider a life altering surgery. I wish I could help you.", "label": 0}
{"text": "The only things I truly enjoy at this point are reading and listening to music, everything else is just a distraction for me.", "label": 0}
{"text": "Trust me ut goes away ya just gotta try for me I traveled ntil it went", "label": 0}
{"text": "spoke to like, lets say a woman counselor once and i said do you think most people have been depressed at some point? (dont know how we got into that subject) but she said, yeah i think most have at some point yeah", "label": 0}
{"text": "Medication boxes, like the other commenter suggested, are what helped me with this problem. They have 7/14/21 compartments, one/two/three for each day of the week. And you fill a week's worth of meds at the beginning of the week. \n\nThis helped me a lot with this problem when I used to take meds.", "label": 0}
{"text": "Fire is red. Ice is blue. Blind people can understand that.\n\n\nSadly... \"Normal\" people CHOOSE to not understand. Because empathy makes you feel the other person's pain. And i had a therapist basically accuse me of assault for it.\n\n\nPeople want to be cold mindless heartless slaves. That's why millions of people get controlled by a handful of abusers. No one want responsibility for their own lives, so certainly not understand & help others. Try to convince a smoker to stop smoking for their own good, he won't, so he won't care if he makes you cough.\n\n\nWe need the courage to face the abyss. Only then can we flee", "label": 0}
{"text": "If someone loves you they don't want you to change yourself.\n\nWhat he's doing sounds like negging. When men bring down women, insult, and patronize them to lower their self esteem, just so the woman won't leave him. It's cruel, and not a sign of love, it's a sign of manipulation.", "label": 0}
{"text": "I feel you. I also think about it daily. It's comforting to think about it.", "label": 0}
{"text": "just the ''high'' part like shit, oops their high and then ''fail videos'' etc guess some people", "label": 0}
{"text": "I workout like crazy to the point where I’m dizzy and I’ve lost weight etc but because of my chest I feel like it’s holding me back and just making me feel horrible", "label": 0}
{"text": "You qill need to tell me more about yourself before I can say anything further about you.", "label": 0}
{"text": "As much as i like to argue, i can't argue with that.\n\n\nI feel the same, but levelled up to the point that I wished I was never born... And pray for a human extinction to make sure I don't get reincarnated as a human trapped in a grey box.\n\n\nEven the black death couldn't kill us. Now that we make movies with 3D drawings instead of robot puppets, the terminator dystopia won't happen soon. Are we still making nukes? Apparently they can only do 1 city at a time...\n\n\nI think the moon is the meteor that killed the dinosaurs. Come baaaaack! Trapped... For eternity... Like our souls! Oh god believing in reincarnation is making suicide even harder than my survival instinct taking over my reflexes...\n\n\nSneeze in my face 😂", "label": 0}
{"text": "Man, I admire you for all the work you do put in. That takes a lot of discipline. And not to mention studying for a Masters on top of it. Do you feel the stress of that coming down on you?", "label": 0}
{"text": "I work outside at a community garden and I am still depressed. The sun and exercise definitely help but it's not a cure by any means", "label": 0}
{"text": "Dang", "label": 0}
{"text": "Not sure how to help yourself? \n\n\nLiterally do the OPPOSITE of everything you're doing. \n\n\nTrying to cheer yourself up & get high on porn. Read about how you waste nutrition when you ejaculate and it causes exhaustion. And ruins relationships with real people too.\n\n\nI comfort myself with junk. But i try to always eat raw veggies and meat. I take supplements otherwise I go crazy even on a perfect diet. Too much malnutrition for too long, too much stress that burned out my organs.\n\n\nAnxiety is the inner child screaming \"i'm scared stop!\"\n\n\nDepression is the survival instinct saying \"you need more nutrition to function, if you won't let me rest, i'll just shut down\"\n\n\nWhen i was abused, my intrusive thoughts were about murder. I went no contact. And when i had anemia, my intrusive thoughts were about eating people. I eat steak now.\n\n\nYou are malnourished, exhausted, LITERALLY poisonned by booze & drugs\n\n\nAnd psychiatrists give you MORE drugs!?\n\n\nOh geez, why oh why aren't you feeling better by doing more of the wrong thing. \n\n\nYou want change? Change.\n\n\nThere. ", "label": 0}
{"text": "people are too stressed nowadays maybe thats what it is", "label": 0}
{"text": "I get that, but let's take an ugly short guy for example, for him his life itself is a reason to be chronically depressed and there isn't much he could do to improve physically and life is going on extreme difficulty, so it is necessarily not \"at some point\" for some people.", "label": 0}
{"text": "Don't waste money on a surgery and change yourself, your chest is fine the way it is and you don't need to change especially if it's because some people were being dicks. If it means anything lots of guys actually prefer small chests. I'd let it be and someone will come along who loves you for you, don't waste your money on a surgery, just stay your natural self and someone will come who thinks you're perfect", "label": 0}
{"text": "She is a neurologist. I will definitely talk to her. I want to know what her advice is going to be and act from that point. Its been 4 months and it feels like i made no progress:(", "label": 0}
{"text": "You can write good.\nThis caught my eye", "label": 0}
{"text": "Thank you! It’s nice to know I’m not alone in this. This journey is hard, and there are some days that are better than others. I wish our healthcare system wasn’t so broken 😩", "label": 0}
{"text": "i don’t think you have to be depressed to think about suicide. a depression diagnosis requires certain symptoms", "label": 0}
{"text": "It’s almost intoxicating", "label": 0}
{"text": "thats interesting, its like its 'clisje'' but do or get involved in what hobbies they have, human bonding tends to make people happy, but depression just give you the same thoughts or one  perspective but it keeps you stuck in that thing, thats the thing  about it", "label": 0}
{"text": "You missunderstand life itself. We don't get things because we deserve them, life is unfair. But there is causality.\n\n\nI see happiness as the brain rewarding me for good self care.\n\n\nSociety pretends that happiness is to work 100h a week, with not enough pay to rent a home but have a house anyway, that you are lazy for sleeping at all, should go to the gym to run a marathon daily, have an erection on command, only need to drink coffee not eat. \n\n\nI'm not really exagerating. You don't even get a paycheck as a reward. You get a heart attack. Why would the brain give you happy juices when you're being burned to death by abusers, starved, sleep deprived, and literally poisonned.\n\n\nBecause you're a productive slave? Your body doesn't care. What's the point of being rich if you have no time to eat! What's the point of having a huge house if you're never in it and don't get to sleep. \n\n\nAnd that famous setotonin. It's not even made by the brain! It's made in the gut, with magnesium! How do you expect to make it by drinking stimulant coffee and pouson boze!? You don't! It's basic biology. Psychiatry knows nothing.\n\n\nLack of magnesium also makes you feel lonely & suicidal. \n\n\nI saw lonely people pushing away people offering friendship. They ask, then reject the courage it took others to open up, because they want the closeness without opening the door.\n\n\nSo you either sabotage yourself... or you get rejected by people who find you incompatible... Like an obese guy wanting an athletic girl but who'd be miserable sharing her lifestyle... or rejected by people who prefer to look down on others than have an equal, an ally, a friend. And the gov divide us to conquer us.\n\n\nI'm not going to give people toxic positivity platitudes... I can't... The mods will probably ban me soon... I'm surprised & grateful they didn't yet. I'm like a wounded animal growling at everything... Hopefully some words will help you somewhere in all my spite...\n\n\nI think I understand yours...\n\n\nWhat did i do to be hit by a car and denied medical care, when even pedophiles out of jail don't get treated this way... Or denied to go in public like i was because i was too sick to risk getting virus injections... People turned on each other... Watched people be ostracized with glee... It was like the black ostracisation, like how they denounced jews to the nazis.\n\n\nPEOPLE ARE MONSTERS!!! THIS WORLD IS A PRISON!!! WE ARE SLAVES!!! STARVED AND POISONNED!!!\n\n\nwhy do people expect to be happy and not lonely when they accept to turn on each other and even against their own needs... To please their abusers.\n\n\nIt's not a handful of psychopaths who made this planet hell, it's the people surrendering their lives thinking it makes them kings, when it makes them slaves.\n\n\nHumanity doesn't even deserve to evolve from a monkey thurd.\n\n\nI bless any dust of not-pain and any interractions that isn't abuse.\n\n\nI think we shackled ourselves too much, hoping to control our workd like gods. Removing nutrition from processed food. Paying to breathe toxic air with a stick... Making it impossible to be self sufficient in a farm. Our appartments are cages piled up on top of each other like we do to chickens. Overpopulating because all lives are precious? No. Just doctors wanting success statistics and forcing unviable babies to suffer decades of agony... \n\n\nWhy... After people denied me the right to exist anywhere... To feel... To think... Why should I be happy. Why should I trust again. It's unthinkable for me. Even if I recieved it, I would reject it as a lie, as a bait to abuse me...\n\n\nA closed heart cannot feel his lover's love. Only his own. \n\n\nLove is just the urge to reproduce. I'd rather die.\n\n\nIt's not about being worthy. It's about reaching out for it... Opening up to welcome it... And pray the person isn't a lying asshole .", "label": 0}
{"text": "I'm a lot older than you and think about it every day as well.  The only thing stopping me is that it's also scary to me thinking about ceasing to exist.", "label": 0}
{"text": "Yeah idk if I personally got any tips but can definitely relate. I'm 22M and I've always been relatively tall and I've been told I'm good looking by people. But I suffer from a lot of mental health issues so it makes dating really hard and rejection really sting. So sorry ur going through it cuz it sucks fr", "label": 0}
{"text": "Is it worth it.\nYou don’t know what comes next, it’s a gamble. I would be terrified if I were you.", "label": 0}
{"text": "I'm hoping this isn't annoying, but just want to say it can get better. I woke up suicidal for most of my life. It finally got better, I think through a combination of a change in medication, therapy, and life experiences. Maybe a job change. I can't offer a clear map, and I don't want to invalidate your feelings. I just wanted to say that I NEVER thought it would get better and here I am.", "label": 0}
{"text": "I always keep thinking what happens if I die.... \nWill anybody even care? \nI'd probably just be forgotten...\nBut I want them to feel sorry to me..... \n\n\n-my thoughts", "label": 0}
{"text": "Nobodies opinion really matters but your own, idk how old you are but if you’re young in time you’ll understand that a lot better", "label": 0}
{"text": "I'd hope so 😂", "label": 0}
{"text": "She has a great body, there's so many women who would kill to look like that. Hopefully a good man will get to love  every bit of her. Not the loser she's currently with though.", "label": 0}
{"text": "i understand how this feels. i have an actual deformity, being pectus excavatum(essentially my chest is caved in extremely bad) and i feel the same ways. i would give anything to atleast be normal. your not alone in your..disgust with yourself. or with your insecurity. dont forgwt we have nk idea what we are destined for. no idea who we may be destined for wants. you will amount to peoples standards, many of them. everyone will, dont worry abour someone else setlling. YOU dont settle. dont settle with yourself yk? youd be surprised what confidence, a little humor and edjucation can do for someone who is even just avg. i will assume you are at least average, because statistically you are. you got this. ik how it feels to be embarrassed of yourself, or not be able to have someone put there hand up your shirt, or let them lay their head on your chest, or be able to look in the mirror and notice smth and not feel nauseous. i wish yhere was magic words anyone could say, but as someone who experienced it, with no options im not sure anything could make me feel better. but ik there is potential for you to feel okay, and that it can take you so so far.", "label": 0}
{"text": "There must be some background, or past trauma of any kind. You can’t be lashing out for no reason.", "label": 0}
{"text": "Watching a nice show or reading a new manhwa", "label": 0}
{"text": "\"If you can't find something to live for then you best find something to die for\" - Tupac", "label": 0}
{"text": "If you have the money to pay then form a payment plan. Is there is no way to survive then file bankruptcy.", "label": 0}
{"text": "lmao, I'm referencing the dream of Zhuang Zhou which is a popular daoist idiom.", "label": 0}
{"text": "It's curious because it never really helps me. I just end up alone with my thoughts, instead of the distractions I have at home.", "label": 0}
{"text": "I would much rather die", "label": 0}
{"text": "All of this for sure. You need help from outside. Why are you in a hostel during the week?", "label": 0}
{"text": "thanks for commenting!! you're right, i finally decided to leave my apartment to study and felt so much better. the self-isolation is the worst.", "label": 0}
{"text": "like, you've probably seen it all the time in public", "label": 0}
{"text": "Please don’t do that. I don’t know what you’re going through but I really hope you can overcome it all. The world is a better place with you here. 💚", "label": 0}
{"text": "Which is a good thing honestly. You'd likely regret it down the line.", "label": 0}
{"text": "From what you've described, it sounds like your situation is quite serious, and seeing a therapist could make a real difference. While Reddit advice can be helpful, it may not provide the support you truly need. If I were in your position and could afford it, I’d consider reaching out to a professional for guidance", "label": 0}
{"text": "Thank you so much! That's all I needed. I'll definitely try to push through!", "label": 0}
{"text": "I go through similar things sometimes. I' found talking to other depressed people can help during my downs. I tend to try to induce hypomania because at least I get something done. I think you just have great potential and it just hasn't shown through yet.", "label": 0}
{"text": "I honestly think most people in this world is depressed. Including myself. Becas we are not meant to live in a superficial and materialistic Society like we do. \nWe are meant to gather and hunt for food tog as a group and as friends. I Wonder why depression is not so common in africa", "label": 0}
{"text": "I had this thing for couple hours before going to bed, It was a year ago I think. I couldn't believe I was out of this, it was like waking up for the first time after a coma. I rushed doing things but when it was time to sleep, I praied to be the same when I would woke up. Didn't happen, I cried this morning.", "label": 0}
{"text": "You look fantastic, not meant to be creepy what do ever just supportive. I know it's hard to get over a negative self body image situation but you've got a lot of people here disagreeing with you. Try and believe us, as hard as it may be.", "label": 0}
{"text": "hmm... its really interesting, or how most people who have partners they help people emotionally or to the point of having a ok phyche (their happy being together etc)  but then you have  situations like this, everyone is just one human being though and people cant do telephathy and fix stuff easy, one needs to tell the person and work from there", "label": 0}
{"text": "Tell him that you don't feel well and will need to focus on recovery for a while. If he wants to take you clubbing & drinking poison, say no. Rest and make yourself a meal full of vitamin c & b (greens & meat. Grains are trash)\n\n\nOr you can just say that you feel suicidal and why... And if he mocks you, guild trip you, and demand sex... Trash this soul sucking leech", "label": 0}
{"text": "after having my ex tell me she's suicidal, i would advise you tell someone else too so it doesn't feel like all the burden is on him", "label": 0}
{"text": "It's nothing big or concerning! I did after care afterwards, it's cat scratches at best! ", "label": 0}
{"text": "you choose to love yourself every day. that means that you take care of yourself and do things to make you happy the same way you would for a partner or a loved one. beauty is more than about looks. i wouldnt marry a woman who was beautiful but ugly on the outside. i would marry someone who is ugly on the outside but beautiful on the inside. looks fade. personality is forever. focus on the beauty you do have and how to bring it out and put it on display. people will notice.", "label": 0}
{"text": "I agree with this comment. I’m in the same boat, different situation, although we all have our own struggles; it’s a matter of accepting how you choose to enjoy things for yourself each day. You want someone to love you for how you love yourself and nothing more. At the end of the day, looks fade and no one is a ‘10’ lol. Even if they’re a 10 physically they probably aren’t in their heart at most cases", "label": 0}
{"text": "Have you tried going out to nature? Enjoying a walk outside preferably where there is fresh air, nature, etc? 🥰 Nature gives us energy..", "label": 0}
{"text": "I don't ever talk to my doctor about mental health because they've called CPS because of it, and they kept suggesting anxiety meds since i was a tween. I don't think it's a hormone imbalance, especially with all the other issues i have with mental health, that answer seems too simple.", "label": 0}
{"text": "I have been put on adhd meds and I’m taking them, it helps with my focus and attention but not my drive or will to do things and make the most of life.", "label": 0}
{"text": "Don’t push it . Don’t think hard about it . Who will feel to find you beautiful will find you and you will know . Until then .. Love yourself . Adore yourself . You don’t need other people’s opinions . You just need yours . You have to feel good and confident in your skin . Stop comparing  yourself to others . Stop obeying to standards and stereotypes . You’re unique . \n\nP.S : I would LOVE a scar on my face .", "label": 0}
{"text": "Thank you so much, I’ll try to follow the advice.  I didn’t really think about relationships until I turned 27—I was focused on my own things. But now, as all my friends are starting families and having kids, I’ve started feeling a bit lost, I just need to find strength within myself.", "label": 0}
{"text": "I don’t think it’s bad to want to be ‘great’ , it’s just where is the “fine line”. I don’t allow myself to feel anything besides pressure and I’ve been isolating myself because society is judgmental and I can’t allow myself to be vulnerable or be touched because others’ have tried to use me for their own gain. I just have such a bad outlook on the world", "label": 0}
{"text": "exactly and speaking as man around her age most of us are at the point where thats all we care about. finding someone special. looks dont really matter at this point we are all gonna be grey and wrinkly in 10-20 years anyway.", "label": 0}
{"text": "Whats your aftercare?", "label": 0}
{"text": "it’s not as subtle as you think. That’s why the last part is extremely important. Focus on yourself. Anyone else is just an extra in your play. How serious of a role are you going to give them?", "label": 0}
{"text": "totally and thats valid however i promise you there are still people who arent like that. even if they are rare. the people who are like that are the most broken and wounded of all. they have the easy life and they still arent happy. they may never be happy. you on the other hand arent like them. you can be happy. without destroying others. in my eyes that is a blessing. even if it doesnt always feel that way.", "label": 0}
{"text": "I understand, I’m sorry you’ve had those experiences that make it hard to trust people. As long as you make your boundaries known, there will be good people who will respect it and also acknowledge it. Boundaries and limits are needed. And if you ever want to talk I’m here 💜", "label": 0}
{"text": "Like everything dropped. At least if I’m not out there, no one can use me and manipulate me I guess", "label": 0}
{"text": "Oh trust me the boundaries don’t work 😭 I mean, sometimes they do, but unfortunately people agree to get what they want and become manipulative and or they just outright argue with me why I can’t just do something for them", "label": 0}
{"text": "You look perfectly fine though. I lost 100 pounds 2 years ago and still struggle with body dysmorphia, even though I have muscles now. Just find someone who likes you for you and helps you build confidence about yourself", "label": 0}
{"text": "I would check out a bpd page lovely.", "label": 0}
{"text": "I’m in the phase where I’m understanding not everyone deserves even my smile", "label": 0}
{"text": "Your body is great, so are your boobs, i dont like fake boobs, learn to love yourself and then the right guy will too", "label": 0}
{"text": "a lot of people feel that way myself included. it seems that the kindest people always end up with the most selfish but you have to remember. it only takes one. you are worth the effort. dont give up on yourself so easily. you are worthy of love.", "label": 0}
{"text": "This literally just happened to me omg", "label": 0}
{"text": "Also 19, honestly I’d wish for this too. Similar to you though I’ve never got a chance at it. I think the key is not to compare yourself to others around you; no logic in that anyway.", "label": 0}
{"text": "I still don't think it's a hormone imbalance, there's no reason other then puberty that i'd have one. They recommended anxiety meds when i was a tween, but when i was a little kid i was also worried about people killing my in my sleep or breaking into our house. Then when my mom spoke about that when i was older they said they recommended anxiety meds. \n\nI'm sorry if i'm being difficult, i'm just confused and I don't want it to be something as simple as a hormone imbalance. My actual depression started because an existential crisis, and i feel like it's just based off how i view the world and life.", "label": 0}
{"text": "Yeah, I sit here stressing so much and feeling like 💩 but the people who use others and manipulate others are happy but I know deep down they aren’t. Just crazy they can be happy doing that without a care", "label": 0}
{"text": "I want love, the issue is not attracting others’ who see any support I need as a burden or a means to diminish any other value I have.", "label": 0}
{"text": "Based on the description, I think you’re in the right sub, unfortunately. \nHave you ever had a therapist?", "label": 0}
{"text": "dont worry thats not happiness its a high. being mean and abusive is like a drug to them they cant stop and get high off it then feel bad then do it more. its a drug. not love.", "label": 0}
{"text": "I have bipolar schizoaffective disorder, and even I can't imagine what it is like to be psychotic or depressed when I am not in those states. But you are absolutely correct, people will never understand what it is like.", "label": 0}
{"text": "Things change but with time. Just hold on to it.", "label": 0}
{"text": "i understand believe me im in the same boat but you cant give up hope. there are men out there who want nothing more than someone to hold and care for.", "label": 0}
{"text": "You should tell him, as quickly as possible. I don't know him (or you, for that mayter) but I want to believe he will be companionate and see that you need his help. It will be an experience you would know that made the connection stronger and more real. It will help you and your relationship. Do it now.", "label": 0}
{"text": "Do you express that you see beauty in others? Because people will likely find that beautiful.", "label": 0}
{"text": "Because it is, I might add.", "label": 0}
{"text": "What's stopping you?  It's always a good day.", "label": 0}
{"text": "becuase they are broken and it makes them feel strong. they are weak and fragile and hide it behind abuse. they arent that different from you or me they just handle things in the worst most destructive way possible. while we choose kindness and forgivness they choose blame and anger.", "label": 0}
{"text": "No offense but what else can you do? In order to improve your situation you have to push through. Although you don't have to go all in you can't just take small steps until you are comfortable enough to take bigger ones of course it is all up to you although you will probably say I cannot so good luck to you on your life.", "label": 0}
{"text": "It sounds like you need to have some time fixing yourself. What I mean is fixing your self-esteem. Boosting up the confidence level step by step.", "label": 0}
{"text": "Sorry a bit of a rant but it’s just a few things I’ve been through and why I don’t trust easily", "label": 0}
{"text": "Ontop of saying I was at fault and held it over my head that if his car started having issues’ I had to repair it", "label": 0}
{"text": "You are so right. This sums it up for me. Everything about the society we live in is wrong. I long for community, and to be connected to the earth again. It’s hard to find genuine connection these days and I feel like the world we live in is a lie.", "label": 0}
{"text": "i relate to this and i’m sorry. i’m really sorry. the fact i feel this way and others do too makes me even more sad. i just wish the world was never made this way. paying to live on this earth God created for us is so fucked up. i can’t get out of bed. i don’t want to try. i can’t. when i do everything goes wrong and proves how i should just b gone. i haven’t been depressed in a year so this is slapping me in the face real hard. a couple of ppl in my family have tried to commit at my age 19 and that fucks me up my own family wanted to die at my age too what kind of hope is that supposed to bring me? i hate positive quotes i hate everything. i’m broke no money i can’t find a job. i feel useless. i have tried so hard my entire life to make it through. and here we are going on the 6th year of me being suicidal. i’m sorry i can’t help. i really wish i could. i can’t even fake it till i make it. which scares me. how tf do ppl get out of bed. because i haven’t in weeks.", "label": 0}
{"text": "No, I just don’t feel comfortable driving so yes being with someone would require rides whether it’s to the store or work", "label": 0}
{"text": "My bestfriend? Schizophrenic with Bipolar type 1, me? MDD with a BDI of 49, let's just say people generalise us as Sad and Crazy, it's tough out here", "label": 0}
{"text": "I can completely understand that but if he thinks badly of you it's not healthy. You need to have a conversation with him and tell him exactly how he's making you feel and see how he responds. It he doesn't gaf you need to move on. \n\nAs for the friends aspect I'm not the best to give advice as I'm a miserable person and people just end up hating me but see if there's any hobbies of yours, it something you're interested in,  that have groups or similar and join them (I get minimum wage but some are free/inexpensive they you might be able to swing it)", "label": 0}
{"text": "I just got treated badly for the bare minimum", "label": 0}
{"text": "so you are saying that you dont feel comfortable driving and so he got mad at you but you dont feel like thats in your control so it feels like you are being treated badly for existing as your self. am i understanding that right?", "label": 0}
{"text": "Yes exactly 💀", "label": 0}
{"text": "This. I don‘t want to die. I don‘t hate life either. But it feels like life hates me and I‘m tired.", "label": 0}
{"text": "I too have issues with how I feel many people seem to be so fake although my conclusions might be quite different to your own.\n\nIt's really sorry to hear that you have no friends or family - that must make things very hard on you. I'm very introverted but I have recently acknowledged that I've never felt loved. \n\nI see you are still working. It's impressive that you can do go through the your work routine with those feelings - I wish I could be at least functional again. Is there any possibility to cut down on hours and if you could would there be something outside that you could do with that time? Do you have enough finances to potentially try a different job or workplace? It's not healthy at all for you to put up with that sort of toxicity.\n\nI hope you don't feel completely above. There so many of us on this subreddit that I hope you too can at least feel that you're not suffering alone.", "label": 0}
{"text": "Thank you for your kind words. Maybe something will change. I wish you the best also!", "label": 0}
{"text": "How old are you? Where you from ?", "label": 0}
{"text": "Always have an ear and a shoulder", "label": 0}
{"text": "I feel the same. I only keep going cause I’m not dead yet. I’m pretty much numb to everything just waiting for it to be over.", "label": 0}
{"text": "I spent my 18th mostly alone. I don't go to parties ever or invite anyone over (I used to get invited a lot but I always decline)\n\nDo you have any family members around to celebrate with?", "label": 0}
{"text": "me either, i hate parties. i have my mum who i’ll be spending it with but it would just be nice to spend it with a friend :(", "label": 0}
{"text": "I'm making assumptions here but since you mentioned surgery, I'm assuming you think they are too small? If so, there are so many guys who prefer smaller breasts. Honestly, media has girls trained to believe bigger is always better. It is not!\n\nIf you are looking for someone who wants a big boobied, fake tittied bimbo, you are looking for the wrong guy.\n\nWork with what you have. I'm certain they have their own charm.", "label": 0}
{"text": "hello there wonderfully world enriching and highly cherishable person for whom im eternally grateful for being alive and having had the opportunity interacting with, hope things are better for you and loved ones. \n\nim well aware everytime someone says something similar that you say they are well meaning just misguided due to personal anecdote, so dw i completely empathise with you, however ik you wont agree with it but please dont make hopefully and most likely unintentional mysoginist statements like these. girls are not gross, individual people can be regardless if they are a woman or not. by saying \"girls are gross these days\" essentially you generalise a whole sex based on limited anecdote you have and biased thinking. please i hope you will realise that.\n\nregardless, wishing you and loved ones (people and/or animals) who enrich your life to be well, to enjoy good health, to heal from all paind and suffering, to overcome challenges in life and to have a blossoming day, I do wholeheartedly believe that all of you do enrich the world by being cherishable and having an intrinsic positive value to the world, for which I am eternally grateful in life ! I was blessed with a quality gidt having you in my life!", "label": 0}
{"text": "i have none, unfortunately i’m homeschooled :’)", "label": 0}
{"text": "Part of your post is actually really encouraging to hear. You said that you can't run away, because you'd die. It sounds like, contrary to most of your post, you DON'T want to die.\n\nIt does sound like you want your home life to change. This is still good news because that WILL change. For instance, at some point you will move away from your family. Even if you can't go full no-contact, being in a new environment could make a huge change in how you view your life.\n\nI'm sorry that you're having a crisis of faith. I don't know your particular religion, but not knowing whether or not God is real is part of religion. It's why we call it faith, it's believing in something you don't know is true. If everyone knew for a fact that God was real, everyone would behave VERY differently. So, wondering if God is real or not doesn't make you a bad person.\n\nYou're a kid and you're still learning about the world and how things work. You're bound to make mistakes and that's OK. It's normal, everyone makes mistakes. The hard part is regulating your emotions (I'm an adult and I still struggle with it myself). Things do get better as you get older since you have more control of your life and can seek help without permission.\n\nI know you're a teenager, so it's hard to fix any of your situation by yourself. For now, talking about how you feel probably is the best option. Writing in a journal could be helpful to express yourself in a healthy way. \n\nOne thing that might be helpful is by making a list of things you like or make you happy. Start with 1 item and then add 1 more every day. Maybe start with your cat or a family member, or a friend and then keep working on adding things. \n\nAdditionally, you can start making a plan. For instance, \"I want to move out when I'm 18.\" Then you can go from there and say, \"I want to live in X country/state/province/city.\" Setting goals and then checking them off can be very helpful. You can list where you want to work in the future. Maybe you want to become a pilot? Maybe you want to go to space? Take some time to think about what's important to you. If you can't pick one thing, that's fine pick several. If you had unlimited money, what would you do with it? I hope this helps and sorry for the long post.", "label": 0}
{"text": "I’ve had poor vision since I was 12 and have worn glasses since, poor eyesight runs in my family", "label": 0}
{"text": "I know. It is ironic, and I’m just waiting for the day that all the monogamous men and women finally come across each other lol.", "label": 0}
{"text": "😂😂😂😂😂😂😂💀", "label": 0}
{"text": "I mean; majority of the people on them have sex the first night if not second date lol", "label": 0}
{"text": "i am so sorry this has happened.", "label": 0}
{"text": "You just get things with a twist but I’ve been off of them for that reason. I mean if you want to play chess only to know it’s a front to have sex go for it but some people actually want to play the actual game we were invited over for 😂", "label": 0}
{"text": "Living is so hard", "label": 0}
{"text": "You're welcome. Sometimes when I feel particularly bad I go out around the shopping area of my city and walk around shops for a couple of hours. It makes me feel better, buying things is fun, I get to have small interactions with passerbys and employees, and sometimes you just need to get out of the house", "label": 0}
{"text": "Man I relate so much to this too. As an only child I have to admit I struggle to see where I’ll be after my parent’s death. At this point it’s just a countdown. But for the time being, I really can’t offer anything meaningful because I have the same life outlook. Maybe all we can do is try improving our own quality of life, even if it’s through small steps, but that’s all I’ve got.", "label": 0}
{"text": "hey girl if you ever need a friend i am always here <3 i’m so sorry angel", "label": 0}
{"text": "Indeed!  I was more so correlating it to Forrest Gump, based on the amount of running you did.", "label": 0}
{"text": "If you have the social skills to have friends, you can have other relationships too. I can't.", "label": 0}
{"text": "I'd treat myself to a restaurant. Sadly being an adult means having to do stuff alone & be independent. Sorry that you had like a batism with fire... At least you didn't get a teen pregant or ended up in jail. And you're alive, so you did good!", "label": 0}
{"text": "Same here buddy… going between numbness and rage atm", "label": 0}
{"text": "Same, thought of ending it all tbh", "label": 0}
{"text": "Your post hits hard, I’m a similar age to you and struggling in college. Right now I’m 2 weeks behind in my most important subject with an exam next week and I’m probably going to get no sleep soon, again. It’s a very vicious cycle. I also have panic attacks and this stress is ruining mental and physical health. From online binging I’ve found some good tips, but take them with a grain of salt since it’s coming from me.\n\nI think the best approach to this type of anxious behavior is to approach self-improvement from the lens of self-compassion and care. I know it sounds generic but at least from my experience, I always criticize and beat myself up everyday for my actions. I act like a drill instructor to myself, I self-flagellate and pressure myself to get good habits. I verbally and physically abuse myself everyday. Then I asked, why am I doing this to myself? Even if I am really pathetic and inept, why do I keep kicking a dead horse? \n\nI know it’s hard because a lot of depression and anxiety comes from some form of self-hatred, so I think one of the first steps is to change that mental dialogue. \n\nAnd to be clear, self-care is not the same as putting important things off to self-soothe with the internet or whatever. In fact, I think we develop a lot of feel-good behaviors that are actually indirect self-harm and self-sabotage. It’s more akin to a smoker quitting cigarettes, even if the cigarettes feel good. That is true self-compassion for your body and mind. If I’m feeling really bad on a particular day I like to take a shower and make some hot tea to get back to reality a little bit, and go from there. \n\nI think the goal is to develop our inner thoughts as an inner “friend,” something that provides compassion and accountability. I hope your situation gets better man. Idk if this helped at all and it might not solve everything, but know you’re not alone in this brother.", "label": 0}
{"text": "I think suicidal ideation is a lot more common than people think. I feel like it's one of those things so many people have/experience but just keep it to themselves because no one really knows how to deal with suicidal people.", "label": 0}
{"text": "Talk to your doctor about the different medications that could be helpful to you. Sometimes medication is the difference between laying in bed and thinking about the things you want to do, and actually being able to get up and do them. ❤️", "label": 0}
{"text": "Ah... Inflicting more pain to cope with pain. To force the brain to produce calming juices after an adrenalin rush.\n\n\nYou are the cause of your own suffering. It's entirely in your control.\n\n\nYou. Chose. Pain.", "label": 0}
{"text": "Agreed. And I have a fear of rejection and also don't want to come across as creepy and don't like making women uncomfortable. It's a crappy place to be. 😅😂", "label": 0}
{"text": "So... Basically... You have abusers guilt tripping you to keep exhausting yourself for their benefits... It doesn't sound like they're worthy of your efforts and you deserve a nice rest to heal", "label": 0}
{"text": "only thing keeping me sane is the idea i could check out if i really wanted to", "label": 0}
{"text": "Talk to your psychiatrist about it. From what I’ve read the only time a psychiatrist can disclose information to authorities is if you tell them about future plans to harm yourself or others. Otherwise all of it is confidential. \n\nI couldn’t tell you how normal it is to not have any feelings about your suicide attempt, but a common symptom of major depression is a lack of emotion towards anything. So I don’t think what you’re going through is too abnormal.", "label": 0}
{"text": "you can always say ‘oh I got really sick and then had to take some time for myself to recover, but I’m glad to be back! What’s changed with you?’\n\nand move the conversation back to them.\n\nOr you can always lie, and like I know that’s frowned upon, but if you know the person you’re talking to isn’t aware of mental health/isn’t supportive then I think it’s totally fair and valid to do. You can always say you had some crazy respiratory problems & most people usually nod and move on bc everyone’s aware of covid and other respiratory illnesses going around. Just make sure to pick one lie and stick to it so you’re not telling different people different things", "label": 0}
{"text": "Please talk to him. Be open and honest but also seek professional care as well. He can be a great support system, but it’s not healthy having him as the ONLY support system in your life. \n\nI wish I told my boyfriend. We’ve been together for 3 years but I still struggle with talking about my dark feelings due to trauma. I ended up getting drunk last month, doing something stupid and landed myself in the ICU for a week on life support. That caused him so much trauma and I regret my actions fully. \n\nI wish I would’ve talked to him more and so does he. I’m making an effort now to not hold it in and try to be “strong”.", "label": 0}
{"text": "Work with your prescriber. Remember that there are objectively times when it doesn’t feel like this. Exist now so that you can live when the color returns. You’re not alone.", "label": 0}
{"text": "I’d say it’s pretty normal, for a person that’s severely depressed. I remember in one of my “attempts,” I just sat at the edge of a cliff, reading books and staring off into nothing. Literally just sat there for 2 to 3 hours thinking of nothing. I don’t know why I decided to pack my things up and walk home. Never talked about it to anyone for weeks. Just continued existing as if it were a walk in the park. I guess our heads just finds different ways to handle such events, you know? I’ve known some people who just completely lost it and yearn to change their ways. And then those that just don’t know how to handle it or discuss it, so we ignore it whether we want to or not. \n\nYou should probably find someone to discuss this with, preferably a professional, lol. It’s not good to always let some thoughts linger and decay. Get it out and explore it more.", "label": 0}
{"text": "Or that he broke his D doing some crazy position with a pineapple. When I lie, I make it gloriously obvious 😂", "label": 0}
{"text": "I saw a meme censoring the word poop. So you'd probably get banned the way I got permanently vanned from twitter... But insulting bullies really felt better than my suicide attempts. ", "label": 0}
{"text": "Of course you're ugly, stupid and worse. You're a human being. A hairless mutant monkey, completely neurotic from eating drugs instead of food, and enslaved trapped in a box \n\n\nBut you're kind. The red button I want... Is a world wide nuclear extinction.\n\n\nI try to cope with my immortality untily expiration date. I survived assaults, bring hit by a car... And 5 suicide attemps trying to finish myself off to flee mental abuse by the very people supposed to give me physio... \n\n\nI cope watching anime... And stuffing my face... I guess I beat anorexis...\n\n\nI hope you'll find one bearable shit to enjoy. Even if it's ranting negativity. That's actually super fun. Fuck toxic positivity! Talking about suicide validates my feelings and my right to exist! Ordering me to be happy and wanting to drug me by force... Wtf is this bullshit health care.\n\n\nOh boy if you hate yourself, just wait until you analyze someone else", "label": 0}
{"text": "Any time pal. I'm always around if you want someone to talk to. :)", "label": 0}
{"text": "Depending on how suicidal you are, you may not need to.", "label": 0}
{"text": "Covid!  Sounds like a good excuse to me.   When pressured,  start coughing,  louder and louder,  and excuse yourself.", "label": 0}
{"text": "If you took their drugs, then they took your emotions away, like a chemical straight jacket for your soul. It was never to make you not depressed. Just... Dominated \n\n\nYou didn't self harm. You tried to self mercy. That's why you don't feel the way they expected you to feel. For you it was one more day in hell. For them it was finally seeing the tip of the iceberg of pain that they put you through for years... With unrealistic expectations, perfectionnist, competition, supression of your individuality...\n\n\nI kinda feel pride about taking my life in my own hands and making a choice. I chose that i refuse this world. They think I'm bat shit insane, because if I did it for a good reason, they'd have to admit that they wronged me.\n\n\nThey denied me the physical care prescribed after my accident. Calling me insane. Was I supposed to accept being left to die in agony? They inflicted so far worse on me than death, since I was a child... Claiming i deserved it... Or most fucked up of all, claiming that it was love, care, for my own safety.\n\n\nI only had death to flee violence. Harm done to me by others. But looking back I should have been more agressive.\n\n\nIt's strange how people respect me more that way than when i was full of love ready to sacrifice my organs to please & be productive.\n\n\nNow... The world should feel lucky that I held back my vengeance for crippling my body in all the worst ways.\n\n\nWelfare is cheap to compensate for what they crippled. Cheap to buy mercy", "label": 0}
{"text": "Well it most definitely won't magically fix your mental health, but if you find any kind of exercise that you enjoy, it might just help. Something that really helped me through tough times was hiking. Unfortunately, I wasn't able to do it that often, but I do believe those few days I managed to go hiking really helped me. For you, it could be something completely different. It doesn't even have to be a sport, you can take on any hobby that makes your life more bearable, and it can even help you find people with similar interests that you can hang out with. \nExercise does have some benefits, as it boosts dopamine release, besides the obvious health benefits.", "label": 0}
{"text": "Cutting lol. I forgot to mention that", "label": 0}
{"text": "Therapists who had clients who were raped... RE-RAPED THEM! then told the cops they're too insane to know the difference between their agressor & therapists, so they weren't believed.\n\n\nSo I wouldn't count on them respecting confidentiality either. All nutritional deficiencies cause depression. Magnesium deficiencies gives suicidal urges. Antidepressants cause psychosis. If you tell the psychiatrist you're psychotic, he won't stop poisonning you, he'll add antipsychotics that also causes psychosis.\n\n\nThen he'll up the dose, blaming you for having human feelings, blaming the side effects on you.\n\n\nIn trauma, there is the fight or flight responce... But also freeze. When the brain gets shut down because the data to class is too much... B vitamins helps make new brain connections.\n\n\nI saw ally beliefs & values & trust in institutions crumbles as lues to discard... Several times... Completely rewiring a brain and who we are take a lot of energy & nutrition... \n\n\nBiology isn't a disease. Emotions aren't diseases. \n\n\nSociety is ", "label": 0}
{"text": "I care about you", "label": 0}
{"text": "same but with my face. i hate looking at it in pics. my ugly appearance finds it difficult for any positive thing to enter my mind.", "label": 0}
{"text": "For me birthdays are being treated like every other day of the year. I almost don't even like them cause I remember that humanity is shit that day. Folk with whom you speak almost never, suddenly they recall of your existance and wish happy birthday to you. Fuck them I say", "label": 0}
{"text": "Before living with my father and his family I was living with my mother and stepfather before that. My stepfather was being verbally and physically abusive for 4-5 years with him which felt like a lifetime.. His name is Richard but I’ll refer to him as dick as the names are linked anyways. I guess the first year was the honeymoon phase for my mother but I never really liked him and knew something was off about him as a kid. Kids can figure out things more than adults realize.. \n\nMom was courting my 2nd soon to be step father dick behind my other step father Rick. As Rick was out of town for something possibly work or drug related. As he grew pot downstairs. Rick did treat me right though for the most part doing things together throwing a baseball or frisbee around.. there was one drug related night that kinda changed it all for me though that I won’t go into here. And my mother years later was keeping in contact with him and handed me the phone one day after she knew what happened. It was like a way to mentally abuse me with a random out of the blue phone call I couldn’t say anything to him worth talking about.\n\nWe actually came from a drug background of pot and cocaine with a different man in her life before that. My mother was seeing a guy named Ken who convinced her to bring me to live in Southern Mexico with him about 3-400 miles from Guatemala. Living there my mother is in a picture straight out of the movie Blow walking around a swimming pool in a bikini with 2 50gallon clear trash bags in each hand jammed full of pot with sunglasses on and a huge smile. We lived in Southern Mexico for 2-3 years with Ken. During that time from the time my mother and I arrived we went from the airport to some cracked out hole of an apartment. Idk if it was even 150sf with cockroaches the size of huge pieces of bark outside our apartment. To a giant spiders jumping from one wall to another and my mother using a whole can of Raid to kill it. Within a few months of moving there we moved into a massive mansion with workers to cook meals and do lawn care with a wall around the whole place. It was pretty obvious they were in deep with drug related activities looking back on it. I was a lot younger then so I didn’t really think too much into it then as a small kid. They would have me help pick the seeds out of the harvested 5 foot buds for fun and I didn’t think anything was weird about it. Anyways after we came back to the Us without Ken because the story was my mother found out he was sleeping with a maid. But I don’t know if it was for safety reasons or maybe both. I never saw Ken that much and have little memories of him.\n\nTo be continued 2", "label": 0}
{"text": "The first step father Rick actually treated me like a son and he had 2 daughters of his own my step sisters. They flew us all to Florida from different states to spend a summer as kids with his parents.. my new grandparents they were very older sweet and church going. My sisters and I would get all ready for it on Sundays. We went together all the major theme park attractions there my step granddad showed me how to macramé things.. We went to an Airforce base where they sold things cheaper than an average store and he bought me a nice Rawlings baseball mitt and went crabbing in the Florida Everglades.. so it was one of the best 3 months being with new step sisters I never had before that and having new grandparents as a kid. \n\nAnyways after those amazing times things went downhill. My mom left the guy for dick. So my 2nd step father was soon eventually mentally abusing me and my mother as well as physically abusing her which happened in front of me multiple times. So spent my preteen and teen years being their house cleaning slave from about grade 5 through 10th. I can’t put age into it as they were not great memories. I’m sure I could but I don’t want to as this is very hard to even post. He would take his finger to the back of a bookshelf to see if I dusted it right for him weekly. Scrubbing their shower and toilet spotless a minimum of once per week but 2x was the plan to keep up on it..  doing dishes every night garbage and laundry daily. Laying and smoothing out the wrinkles out of his damp t-shirts on the couch coming out of the wash he didn’t want in the dryer. If I did something wrong there would be couch sessions of mental abuse. Car rides were me silent staring out the window wondering if there was a better life than that. I never did it but there was a time I opened the passenger door of my step father’s truck at a stop in the left lane with traffic and closed it. May have been subconsciously thinking of ending it. Another time I thought about jumping over the top of my mother in an abusive struggle on the floor to get to the front door and just run away to live on the street to get away from them. They were completely in the way so I didn’t do it and had to watch my mother get beaten.\n\nThere was a brutal time he threw my mother down a flight of about 40 hard stairs in our art gallery they purchased as a business. It sounds glamorous it wasn’t.. I mean even I knew then as a kid who needs to buy wildlife art and bronzes everyday? I only heard about later in life through my mother’s sister my aunt that she almost left him that time.. My stepfather learned I was trying to leave and live with my real father he added in the physical before I left. My real father drove across our state and picked me up out of that situation with the double edged pain of wondering why he never contacted me for a decade. My mother saying he hardly or never paid $200 child support per month to her but he still came even having his own family at the time.\n\nTo be continued 3", "label": 0}
{"text": "Our first love seems the purest because it was naive love untainted by pain. But as we evolve through our luves, we can in different directions, paths cross, and are ripped appart. She could end up with a divorce and struggling to feed the kid. Her struggles and joys might seem different, but maybe he'll turn out violent and a cheater... And maybe you'll meet someone to share love while she ends up homeless...\n\n\nLife is shit for many... I try to savor the dust...\n\n\nHappy birthday, surviving this meat grinder is an accomplishment. Try to reward yourself. ", "label": 0}
{"text": "Why do I feel like I wrote this post?", "label": 0}
{"text": "That’s so lonely 😭", "label": 0}
{"text": "Stuff like this terrifies me to my core. I already feel miserable at my age, I can’t imagine going again and again year after year thinking it goes better. It’s really forcing me to make a choice right now.", "label": 0}
{"text": "Anyways.. My oldest half sister that’s still alive was disowned our real dad early on for taking some fairly new bedroom furniture out of his house when she was living with him. But it happened ages ago. The furniture was in a guest bedroom so it wasn’t like she took the bed he was sleeping on that night. Also I never knew if there may of been some conversation between them way before it even happened. Like suggesting she could have the furniture someday when she got a place of her own. She was just out of high school at the time. Barely getting out on her own with her girlfriend young roommates when she did it. Dad called the Sheriff on her to try to get the furniture back and press charges. I don’t know for sure if he ever followed through with either of the two because it was so long ago and he never discusses it. She moved out of the area to start her life back then after that happened. Dad still did not want anything to do with her. He took all her pictures out of a family photo frame collage on the wall and left empty brown cardboard spaces. Everytime visiting him was the gut wrenching sadness to see that hanging on the dining room wall every time I went to visit him. \n\nOccasionally would bring up we really should all four try at least to be together as a family even if it was just on Thanksgiving or Christmas. Eggshells conversation every time. He would just get so angry we couldn’t talk about it without regretting coming to see him. Trying to get him to see how his stupid his grudge was with his oldest daughter was destroying any possibility of knowing each other together as a family. Letting years tick by from kids to adults with our lives and people getting married and kids being born.. A stupid grudge over bedroom furniture for whatever reason he never let it go. \n\nEventually I had to stop seeing him for my own mental health. I think it was about 2017 since I’ve last seen him. He would bring up anger about other general things in life and it started  to be a negative hit just trying to spend time with him. He wasn’t all bad but the negativity side I couldn’t handle just trying to see how he was and especially directed towards my older sister just trying to discuss the possibility of time together when it happened so long ago.\n\nHe eventually had to see my older of the two sisters his daughter at the celebration of life which as stated I didnt even know about it.. My dad, cousins family never said a word about it was happening to me and clearly could have send a social media message of they at least need me to contact them it’s important and urgent. It was filmed by the funeral services thankfully and was able to watch it on my iPad about a month and a half after it happened. In the video he walked up behind to talk to my sister he had grudge with after it was over and the situation was really difficult for her. Could tell she was really uncomfortable from her body language. I’m sure it wasn’t comfortable for him as well. As he was walking up to her with her high school aged son and burly looking husband sitting near her. She was shaking her hands out to the sides after about 4-5 minutes of conversation when it was over breaking a sigh of relief as he was walking away. He walked over around the mic podium and right past his grandson. Which he is around 14-15 losing his mother.. But not being at the celebration of life they may have done communicated before the video started. The man that killed his mother was not his father btw.\n\nTo be continued 4", "label": 0}
{"text": "if they are kind to lesser creatures.", "label": 0}
{"text": "Plus I’d like to add I come from a medical family. There can be complications from surgery and over time the extra weight on your frame may kill your back. You’d have to work out to keep your body in extra shape to maintain the weight. Just sayin’ I wouldn’t want my wife torturing herself over her physical image and running up huge medical bills later in life.\n\nr/bigboobproblems", "label": 0}
{"text": "Hey I’m sorry to hear you’re going through this. I hear you and understand. Big changes in life can cause symptoms of depression but it’s hard to tell unless you get diagnosed by a psychiatrist. If it’s causing you distress, please reach out and I hope you find some relief soon. If you need someone to talk to on here, I’m here to listen too.", "label": 0}
{"text": "I think once you’ve gone there the thoughts are just sort of ever-present, but passing. I casually observe she just tell myself “that’s interesting” and move on.  Even in some of my happiest moments, but it’s not like the constant ruminating I once did, where everywhere I went I’d be like “hmm, could do it there, or there, or there.” Irs just old brain still being like “hey, haven’t thought about this in a food 18 hours, let me remind you” and then I just write it off as something interesting that was just a passing thought.", "label": 0}
{"text": "By drug pusher i mean doctor by the way 😂", "label": 0}
{"text": "Don’t feel bad I feel that too. Every time I see people I smile, but I’m dead inside.", "label": 0}
{"text": "Hi! I really like to play video games with friends and I like to make art but itd find to hard motivation to do it sometimes. I want to get into gardening too. I do have close friends yes, and I'm lucky they still want me in their lives despite how withdrawn I've become. Thank you for your kind words and sparing a moment of your time to respond. I appreciate it(:", "label": 0}
{"text": "Well someone has a crush 🤭 (which is fine btw)", "label": 0}
{"text": "Yeah ur situation is very relatable i have a few close friends too who help but somehow i lack a clear goal or something. I know that feeling of lacking motivation to do something i always did some plastic modelling as a hobby but the motivation disappeared. Maybe its an idea to share ur art so people can appreciate it? Maybe that way u could get some more motivation to make some more. If u got nobody to share it with feel free to show me some im always interested in other peoples hobbies.", "label": 0}
{"text": "man please just go.", "label": 0}
{"text": "I healed severe brain damage with b12, so... You can crawl from a deep dark pit. But pharma sabotage us to sell drugs.\n\n\nFor me... I think it was the elementary school bully abusing me and my mother just brushing it off telling me she never wanted me to be born. I tried to deserve being alive... So desperatedly... But i never wanted this life. It was imposed on me. It's MINE now. MY space. \n\n\nRecently it was having to move 5 times in 4 mouths to flee violence... And figuring out recently that the perfectly normal roomate still do fucked up stuff... That i'll never be with normal people. They don't exist. Everyone have control freal moments, mistaking care for control, and toxic behaviors declared as love...\n\n\nI'll probably never have my own home and kitchen again... Where no ine can order me to stop cooking when i'm hungry. I refused, but restarted having eating disorders, eating junk instead of nutritious meat & veggies... So i got sicker instead of better... Trying to find any bit of comfort... No longer holding back... Because i might not survive long if i'm kicked homeless...\n\n\nI'm so tired. Poisonned by the plug in perfume residue... been mopping the ceiling for months... he refuses to clean the ventilation...  I don't even have a window to see the sky. I'm buried alive. Mocked that i talk too much the rares time i get to speak... Mocked that i carry a big backpack everywhere, when i'm on foot and don't have a giant truck to put my groceries...\n\n\nI'm abused by the services for handicapped people. I feel ashamed when i snap and scream for a grain of sand... I gave up the sky, the ocean, who i was... I can't even have one last grain of sand...\n\n\nI don't want to be reincarnated. Earth would be so beautiful without us, and bed bugs, and dolphins... Even freaking dolphins are sadist rapists... Their cute little giggles was a trap...\n\n\nI can't even trust dolphins 😂 fuck this planet", "label": 0}
{"text": "You are strong for keeping it so far. I am 29 yrs and these thoughts came only now after some trauma, Like you I keep pushing.", "label": 0}
{"text": "49M here. I got one, although that was more because I had them and didn't want them. Trust me, you don't need a boob job.", "label": 0}
{"text": "feel you so hard i turn 18 in april and i don’t think i will have anyone to celebrate with", "label": 0}
{"text": "Stay strong :)", "label": 0}
{"text": "Simple solutions are often the best. \n\"I don't know how to say it and don't want to seem like I seek attention\"\nIt seems like a good start because it's honest.", "label": 0}
{"text": "Someone with no IQ wouldn't be able to write this. \n\n\nChose another hobby than crushing your own self esteem. That rabbit hole is nasty", "label": 0}
{"text": "Hug them, give them a deep and thoughtful response saying that you care for them and that you love them. Try to convince them to get some help without forcing it on to them. The only really thing you can do is to be there for them. Checking up on them, doing y’all’s favorite things together. I know this is a tough situation for you and I’m in a similar situation at the moment, it’s disheartening to know that more can’t be done, but the biggest thing is to be there for them. Hoping you and your friend are well in the next coming days. Take care <3", "label": 0}
{"text": "I'm not really sure what you mean by this? I was just speaking about the fervor and intensity of emotion I experience. I rarely experience attraction to other people but I also purposefully avoid relationships out of concern for my mental stability. That's what I meant, I don't understand how people survive it", "label": 0}
{"text": "Please don't do that. If you need we are here.", "label": 0}
{"text": "Yes!! I know exactly what you mean. I've avoided dating for a long time because of it.", "label": 0}
{"text": "You are still quite young and do not know the taste of life independent from your parents. For now, you can still spend some time playing video games, but in high school you will have to prepare for university. Perhaps you are motivated to live on by the opportunity to live in another city and simultaneously study at a university where you can find like-minded people and new friends from other cities, and then find yourself in a certain profession. Therefore, you can just live for yourself for now without thinking about financial problems, living with your parents, although I understand that it is difficult.", "label": 0}
{"text": "Hey pal, you're neither incompetent nor are you worthless. I'll be honest with you, most people go through a journey of self discovery. It's so popular that that's the main reason people take a year off of school before college. I didn't know what I wanted to do or be until I was 26 😅.\n\nYou're not a bad human. I repeat, you are NOT a bad human. You may have wronged people in your life and feeling guilt over that is normal. The best you can do is apologies for your actions. There are several bad people in the world who commit horrible violence against children and animals, people who kidnap and torture others.\n\nYou do deserve sympathy and I'm worried about you. If you'd ever like to talk, I'm here to listen to you.", "label": 0}
{"text": "i feel you, i’ve never been in a relationship i haven’t even held hands with a guy. it’s like everyone gets a happily ever after but me", "label": 0}
{"text": "well guess i was just saying what other people have said about releationships/being in them", "label": 0}
{"text": "Negative emotions tell truths but we live in an artificial world. It can mean so much more than being tired", "label": 0}
{"text": "Please stay. \n\nPlease.", "label": 0}
{"text": "I’m really scared don’t know what to do", "label": 0}
{"text": "Found the patriarch.", "label": 0}
{"text": "Also here and I’m glad you didn’t jump. ❤️", "label": 0}
{"text": "Being nice does not make you entitled to love, it is just you will notice how the guys who are not vocal about their niceness still don't get any regardless, because they are not gonna complain about it that way.\n\nThe truth is, niceness makes you likeable, but not loveable. You can be the useful addition to company, but few will reciprocate your friendship.\n\nTo find love, you need two things: a social life where you can make new lasting contacts, and the right person who finds you lovable. Otherwise, you will be just shoved away once you outlive your purpose.", "label": 0}
{"text": "Why did it take you months to brush your teeth again?", "label": 0}
{"text": "Did this really help you through your depression, because I’ve been considering doing something like this too like I’ve felt like the problems I’ve faced is just feeling stuck on social media and going about the same routine and I’ve been considering just walking into the woods and forcing myself to survive in order to give me a new outlook", "label": 0}
{"text": "Your suggestions are amazing, but currently we aren’t in the same city so it’s not easy to meet up like before. I’ll do the other things you’ve suggested, thank you so much. I’m sorry you’re experiencing such a situation, it’s not something I wish for anyone to go through. You got this. I wish you nothing but good for you and your loved one. It will get better. Take care as well :)", "label": 0}
{"text": "how?", "label": 0}
{"text": "You probably have money.  200$ in equipment would be more than I left with.   Give it a go.  Don't leave debts or unpaid bills though.   Coming back and resetting is hard enough I couldn't imagine if I had been in debt.", "label": 0}
{"text": "how many lives in history can you look back on and say, well that was a really special life, etc most dont invent the lightbulb", "label": 0}
{"text": "If you want to make a child withness your suicide... Yes... The purpose of bad emotions us to guide us away from bad choices. If you prefer to hate the messenger, or yourself, instead to hate a bad option... You'll run even faster towards bad options...\n\n\nYou can do anything you want with your life. But if you care for that child, don't give him a trauma bigger than the ones you want to die for...", "label": 0}
{"text": "I so get this and have asked myself the same thing many times.  I’m so sick of the cycle. \n\nA general thing to make life easier& make the ‘bad times’ less horrible and guilt filled.\nI write my ‘healthy self’ (in my journal) about how bad I feel and stuff she (future me) can do to make life more tolerable.\nBecause in general my ‘depressed self’ hated my ‘healthy self’ because she was making the commitments.  So my ‘healthy self’ is now more careful. Agrees to far less.  That way, when I start to slide into depression, there’s less to get overwhelmed by (less commitments to have to get out if).\n\nAnd in the ‘good times’ life has been far less about making money and having vacations, etc.  It’s more about having good relationships.  Because those things are what make life worth getting-through… that in some small ways I’ve made others lives better.", "label": 0}
{"text": "It's nothing special, it's actually pretty basic; cleaning it off w/ a warm wet cloth usually does it, if im not up to it I just clean it up with tissue. That's if the scratches are cat scratches and nothing more. ", "label": 0}
{"text": "Me too. I see you. I understand. I wish I could offer some encouraging words but i’m struggling too.", "label": 0}
{"text": "Glad to hear you have people who you care about and that care about you . If it helps I tend to hold on to the idea of being unalive as a way to keep that relief feeling . Everyday I decide to live and commit to goals knowing that I have a way out if it becomes too much . Sometimes I feel ok like I can keep doing this and sometimes I feel like I'm not going to last much longer but so far I'm still here and I like the fact that I don't have to be here if I don't want to . Doesn't make the depression go away, but it makes living feel more like a choice than a burden . Not very optimistic, but I hope that helps.", "label": 0}
{"text": "Red flag. Be careful what you wish for.\n\n\nWanting to be someone's priority means that you'll be more important than their own life, vital needs, career goals, the hobbies that gives them a personality, moral values...\n\n\nIt's called codependency. And it sucks both souls until you don't know who you are anymore. Yeah... You lived your wish. It's terrifying. They become stalkers.\n\n\nI vowed to not get a lover again until i overcome that. I think it's caused by trauma, lack of proper love. I'd need to build my self confidence & identity, to learn to set boundaries, say no, not please to appease & earn love... To just share it, as life partners, on our journey. Savoring our time, never stopping to build a relationship, instead to rake it for granted... before we evolve in different directions... Or die... Allies in the hell of life, instead to eat each other..\n\n\nIt's ok to be weak. Good luck to all to find balance", "label": 0}
{"text": "Oh look one of those people that don’t think mental health is real. I assure you it is real and it’s not just “sadness” that we can get over.", "label": 0}
{"text": "I would walk away. I have depression and I’m not dealing with someone who would make me feel worse.", "label": 0}
{"text": "Sounds like you need more than a week to deal with things.  Hopefully the hospital referred you to a therapist/psychiatrist that can help you deal with things and get some meds to treat depression.", "label": 0}
{"text": "Why are you not eating?  If it’s an eating disorder, you should get help from someone.  \n\nOr, if it’s just really difficult to make yourself eat when you are depressed, I’d keep trying different foods.  I find things with little flavor and smell can work.  Because otherwise, even if I’m hungry the smell/taste is ‘too much’ and makes me nauseous .\nSaltine crackers, baked potatoes and chicken work for me.  Also plain pasta, with a very bland sauce.", "label": 0}
{"text": "break it down as small as you can. say you want to clean your room but you cant get started, instead focus on just standing up, then picking up one piece of garbage, then moving that piece. if thats all you can do for the day thats fine. do it again tomorrow. then do a little bit more the next day. so on and so forth until you build good habits and things become easier.", "label": 0}
{"text": "The americain dream existed in the late 90s. And even then, it was a lie, just less of one.", "label": 0}
{"text": "Add to that \"If you unalive yourself you will go to hell / reincarnate into North Korea as a punishment etc\". The 2 most popular answers I'd get from my mom when I said I'm VERY close to suicide and need help... Mental health is sadly VERY neglected pretty much everywhere...", "label": 0}
{"text": "I feel this.", "label": 0}
{"text": "This made my night, truly. Thank you. That really means a lot. Continuing to fight is so hard. All the luck right back to you", "label": 0}
{"text": "Same.  Just here cause I don’t want to make my family sad but they probably are knowing their son is struggling with major depression.    I can’t live like this.", "label": 0}
{"text": "This is like what OP is talking about. We don't have the same patterns that people without depression have. Normal people gain happiness and feel naturally comfortable from being outside and socializing. Depressed and/or anxious people feel drained, unhappy, and mentally depleted from it. It's not something you just solve from doing it a bunch of times. It's not like learning to ride a bike (something people sadly compare it to) where you get better the more you do it. It's instead like trying to ride a bike without legs. \n\nI leave the house and socialize every day because of work but I don't enjoy it or feel pleasure from it. I don't feel any more comfortable with it than I did years ago when I was leaving my house and socializing every day during college. The issue is much deeper than just doing it a bunch of times and hoping it gets better.", "label": 0}
{"text": "Yo same, me tooo. Hi fellow like minded human.\n\nThr only difference we both have is, I want it to happen but like natural way, like accident or heart stopping.\n\nSooner the better ✌🏼", "label": 0}
{"text": "You are shocked. You need support. Your trust and love have been broken. It's very mean what they did to you, very brutal. You need kindness and care Man. Don't let this take you away", "label": 0}
{"text": "Cocain and Dom Perignon P2 usually do the trick for me", "label": 0}
{"text": "I seen your picture and you look normal to me. You are definitely attractive. Big boobs are overrated anyways. Ass guys exist too ya know", "label": 0}
{"text": "The big issue at hand is I don’t know how to. I live with my grandparents. Bringing up the fact I feel like I need a therapist who specializes in paraphilias isnt particularly great for me", "label": 0}
{"text": "Some men prefer smaller boobs, me included. There's no reason to hate yourself over something you have zero control over. If anyone in your life is making you feel bad about your appearance, then promptly remove them from it.", "label": 0}
{"text": "this was really good advice to wake up too. thanks for grounding me into feeling normal again", "label": 0}
{"text": "thanks for this man this actually made me feel like a person again", "label": 0}
{"text": "God I felt this. I have the exact same family structure, parents and a younger sister. I used to have this exact thought process too. Hang in there friend, as long as you hang around, your wounds are bound to heal. I promise you are so loved, even by yourself.", "label": 0}
{"text": "Thank you for your input, I appreciate it. I’m unsure if it’s the medication that’s causing it or not. I’m actually on Mydayis (basically adderall xr), which helps me with my 12 hour work days and full time schooling. Idk, nothing seems fun to me though, don’t even want to go play video games in the other room or anything. I’ve been on 225mg of Effexor, then 40mg Prozac, now I’m down to 20mg of Prozac. I’m just debating if I should get off completely or if there’s anything else I should try", "label": 0}
{"text": "Edits: apparently  I can't  type", "label": 0}
{"text": "Candy, music...idk", "label": 0}
{"text": "My dad died last October - I haven’t allowed myself to grieve maybe because we still haven’t buried his ashes. Nevertheless I keep having these memories come to me from 25-30 years ago. He also lived out of state for most of my life and I sometimes think that my subconscious believes that he is still alive where he used to live.", "label": 0}
{"text": "This is so real. I also did tried, but what i don't understand is why it seems like i always ended up reaching out to the wrong person. I'm tired of that, I'm tired of finding myself being alone after trying so hard.", "label": 0}
{"text": "Absolutely, the stress is overwhelming, but I can’t give up because I would see myself as a failure and a disappointment. My sense of self-worth is tied to my productivity, which makes it difficult to step back.", "label": 0}
{"text": "Guessing you guys have been together for awhile now, you should be allowed to have an honest conversation about your feelings and mental health, and if he knows you enough and understand the minimum about depression, he will understand that your intention was not to upset him in any way. It’s important that he recognizes and respects what you’re going through.", "label": 0}
{"text": "Research how transsexuals enlarge theirs?", "label": 0}
{"text": "by hormones ? And surgery ? And obv I’m not going to take estrogen because I already have it and too much estrogen can be really bad", "label": 0}
{"text": "Nothing actually I just don’t want to live, but there isn’t a way to do it without hurting my family or friends so I will just continue suffering.", "label": 0}
{"text": "How old are you", "label": 0}
{"text": "Umm yeah I just checked the pic too, OP you have nothing to worry about, you seem like a total babe!", "label": 0}
{"text": "No problem. These events in life are tough and thank you for coming to seek advice. That def shows personal strength from you. Hope you are well.", "label": 0}
{"text": "I wish I could help. This resonated with me so much. Especially “I’m stuck in the middle of a situation I can’t navigate”  I often feel incapable. I’m sorry you’re feeling this way. I wouldn’t wish it on anyone.", "label": 0}
{"text": "Obviously I will have little to no knowledge of this but is there hormones which increase lactation like when a baby is birthed", "label": 0}
{"text": "Maybe one day we can get through it, maybe we won’t but as we long as we try, maybe we won’t be as sad when we go. I’m sorry you feel the same way.", "label": 0}
{"text": "Trauma. No need to give details.", "label": 0}
{"text": "i still have this feeling he is still alive , it feels like he's asleep and i'm waiting for him to wake up ", "label": 0}
{"text": "I feel an immense loneliness and abandonment", "label": 0}
{"text": "I’m in regular therapy, nothing is working right now because I have to address fucking work and paying rent.", "label": 0}
{"text": "I don’t think you can rely on anyone else to fix you. You’ve already experienced what depression can do. Here you have this wonderful gf in your life and yet your depression got stronger. Depression doesn’t always care how great things are in your life. It can crop up anytime, anywhere. I get it. I’ve been there.\n\nThe only way to fix this is to get help for yourself. Only you can make the situation better by working on the depression. Contributing only 50% to the relationship while the beast of depression keeps the other 50% is a sad place to be and can’t be sustained. She can’t constantly worry about you either. It’s not good for her mental health.\n\nYou already mentioned at the end of your post that you need a therapist. It’s a scary first step to take but you can do it. Psychology Today has a good search engine for finding therapists:\n\nhttps://www.psychologytoday.com/us\n\nGood luck to you. You can’t get better and offer a whole, healthy person to this relationship.", "label": 0}
{"text": "Don’t do it! \nThis world needs you !\nThere are people here that care about you and love you .\nDon’t give up my friend!", "label": 0}
{"text": "If I got pregnant then probably my chest would be bigger but I can’t even really take care of myself in life so I couldn’t take care of a child", "label": 0}
{"text": "listen dude i was 18 last year and i didnt have anyone to spend time with. i dont know how to explain it but that fleeting feeling that you are alone comes and goes. you will be better soon friend", "label": 0}
{"text": "interesting how the most honest comment got downvoted. As someone who has experienced it firsthand, sibling grief is the worst. The feeling never truly goes away—it constantly shifts from one stage to another. Parents may either be indifferent towards you or become hyper-vigilant, depending on which child they prioritize more. Or they may push you away. \n\nMeanwhile, your sister formed a trauma bond with the place where she stayed, as it became intertwined with the memory of losing her sibling. Everything about that place reminds her of her brother’s loss. Thoughts like \" why, why, why I wanted to live in that apt?! \" place would automatically repeats in her mind  nonstop for about a year. That eventually could havoc her decision making in the future on anything and everything \n\nPossibly, in moments of anger, your parents might even question why she had to live on the 22nd floor, she may receive a message like \" so now you happy you wanted to live there?! \" maybe months or years after your passing.  \n\nNow think about these couple examples, multiple by 100. \n\nBack to you—I genuinely feel bad for you. Depression is awful, and absolute hopelessness is often known as the “dark night of the soul.” I’ve experienced both. But do you know what’s worse than those two? The possibility of having a terminal illness. Strangely, both terminal illness and suicide lead to the same end, yet they feel entirely different. Maybe, with suicide, we feel we’re in control. \n\nSo whats happening in your life so bad that you don't feel in control?", "label": 0}
{"text": "I feel like I subconsciously made this post", "label": 0}
{"text": "No meant take the hormones only to increase your chest size", "label": 0}
{"text": "I'm so horny to kill myself but so scared to at the same time, like I know death is coming and there's \"no rush\" but I am so tired and I fail to see a point to most things and if it's coming anyway then why not just get it over with. All that to say, I can empathize a bit and I know I'm not alone because we all exist and I hope you know the same vice versa. We're all in a game of suicide chicken and I'm not gonna be the last one out...or I am gonna be the last one out idk", "label": 0}
{"text": "as fucked up as this sounds I wish I could develop Schizophrenia, at least then my brain could keep me company instead of this overwhelming silence.", "label": 0}
{"text": "100 percent", "label": 0}
{"text": "I hate it all too. I don't care at all. I want freedom. I'm selfish and all I want is to drink until I drop dead. What's the question you want an answer to?", "label": 0}
{"text": "Happy birthday friend. I'm 29~ and sleepwalked my way here. Just trying to wait out the clock but it keeps ticking and tocking", "label": 0}
{"text": "Well what do you want to do for Halloween?", "label": 0}
{"text": "Happy Birthday 🎂🎊", "label": 0}
{"text": "Why did it end up this way. Where, if we are so lost, did the arrow of time deviate toward our eventual demise through industrially induced toxicity? Where in our past did we make the mistake that brought us here? When did greed and apathy become the true nature of humanity? We are capable of love, happiness, absolute cosmic joy -- it's all right here under our noses yet we are poisoning it. If we can't have it -- I guess nothing can. Sorry if this sounds like rambling. I hate being alive too, mostly for contributing to the unscrupulous consumption of our home. Also for being dysphoric. I didn't need to navigate this hellscape also convinced I'm inhabiting a body that isn't mine. Something I refer to as my 'insipid meat suit' the 'weak and pathetic disgusting body' or the 'absolutely wretched abomination that is this body, which if I had a choice would absolutely be the last one I had chosen for myself'. I could go on, dysphoria is an utterly nightmare in itself not many take seriously or has been used to excess to where it's meaningless. Much like life is any more. A select few can feel content in their own skin, or feel comfort financially, or even just content existing. Why then, are the absolute majority here to inly suffer? What the fuck purpose is our mass collective suffering? WHAT DID WE DO?!?!", "label": 0}
{"text": "I’m feeling exactly the same way right now. Sending hugs", "label": 0}
{"text": "oh lol my birthday was earlier in the year but thanks anyway!", "label": 0}
{"text": "I feel the same way but I’m carrying on my life. But remember once we’re born, we’re meant to suffer. Even death won’t end the suffering, thus life has to be carried on. Even if you feel you have no ambitions, remember in this world you can even live without love but never without money. Every individual has their talents. I believe you do too. So if you know your talent already, then hone it and use it to earn better. Sometimes, talents are yet to be explored, then find what it’s. You need to know about yourself first. When you know who you’re, you can move forward. Having no ambitions? Don’t worry, explore about the jobs around the world and find which suits you better, if that still not solve your problem, then go for one that earns a lot. This way may not earn love or true friends but still make life a little easier. I find life itself meaningless but we have to live as I’m afraid death wouldn’t be any better than life.", "label": 0}
{"text": "I just have no desire to live life. I barely function as a human. Don’t know how I’ve even lived this long.", "label": 0}
{"text": "lol well still happy bday 😂", "label": 0}
{"text": "I am so sorry.  I lost one grandfather about 4 months after my first birthday 1987, and I lost the other one in 2003 at age 18. I never got to get to know them as much I wanted too.", "label": 0}
{"text": "Sometimes I remember the things that made me happy", "label": 0}
{"text": "It’s one of the only things I can do. Remember the good times. When I was happy. Had friends. When my sister still lived with me before she grew up and moved out. I miss it every day.", "label": 0}
{"text": "I've been there too. I've tasted the metal of my Glock twice. Honestly, if the trigger hadn't been so hard to pull, I'd be gone. I'm so glad I didn't. My kids need their Mama. I didn't realize how much I meant to them.", "label": 0}
{"text": "Make plans. When you plan on eating a donut, more dopamine is released during the anticipation of the donut than actually consuming it. \n\nJust keep going.", "label": 0}
{"text": "death is the opposite of freedom. Don't do it. If you work on the things making you suicidal, you can undo everything that makes you suicidal. What ever makes you suicidal, your life can be the OPPOSITE", "label": 0}
{"text": "Uhhh are you even depressed lol", "label": 0}
{"text": "Are you planning on going to college?", "label": 0}
{"text": "No why woman matters all and end all? In history there were hundred thousands of eunuchs and ascetics who live without women?", "label": 0}
{"text": "I’m on the other end of this and can tell you how it can feel for us. When we love you, we want to do anything we can to support you but just don’t know how to help. Seriously we’re clueless unless we also have depression. And it hurts us when you don’t respond IF we’re unaware of how isolating works. But when we understand, then it doesn’t hurt us. It took me a lot of research and Reddit and Quora threads on this exact subject to finally get it enough to be a good support. My tips for you are:\n\n1. Just let them know it’s normal for depression to cause the need to isolate and it’s nothing personal to them. You’re not mad at them. It really helped me when I learned how even texting just one text can feel overwhelming. Tell them this.\n2. If you can, try to let them know when they’re texting too much or if you’re appreciating the amount their giving. We get so worried that we’re smothering you or not checking in enough so it’s a huge relief if you tell us what you like. Be honest. If you like daily contact, weekly, monthly, etc, or none at all, let them know.  We WANT to give you what you want and need.\n\nIf you’re the friend of a depressed person, read as many threads on Quora and Reddit as you can. It’s your responsibility to familiarize yourself with depression as much as possible because they just don’t have the energy to teach you. From everything I read most depressed people love when you check in on them often and want you to know they probably won’t respond but they’ll appreciate you anyway even if they can’t show it. \n\nI’ve noticed that it changes from day to day too. They may have a good day and actually be chatty or even want to see you (something low-key like taking a walk) and other days they will just stare at their phone listening to your texts or calls come through but not able to move. They will usually read or listen to them later though but probably won’t respond because it could be days later.  I will often leave a voice message so they can listen to it back over and over again whereas texts can end up being too far up to scroll back.\n\nAnother good thing is to send a short video clip telling them a story about your day or just saying hi. I send my girlfriend video clips almost every day and she likes them a lot better than text, which is difficult to read sometimes.\n\nAlso, don’t take it personally if they are forgetful or seem out of it. They literally can have a hard time just thinking. And don’t expect them to make decisions. Avoid asking questions if you can. Just let them know you care and you’re there for them if they need anything. \n\nAnd let them know how much you care and what you love about them. Depression tells them they’re unworthy of love and that they’re bad. Counter that by telling them if you think they are sweet soul or loving person or whatever is true for you. And let them know it’s okay for them to not respond to your reach outs.", "label": 0}
{"text": "Can you elaborate on what is going on? Maybe opening up to someone will help you.", "label": 0}
{"text": "Keep some mouth wipes next to the bed to at least wipe your teeth. But try to brush if you can.", "label": 0}
{"text": "I feel this. It always feels like people just stumble into relationships easily and almost don’t even have to think about it - it just happens for them while people like us struggle to find someone that likes us at all. I’ve never been someone’s “someone”, either. One of my friend’s met his girlfriend in high school and that was it, they never broke up or anything and got married several years later and are still together. \n\nSometimes when I’m out and about, I’ll see people on dates or couples and it always hurts. Holidays are especially tough for that reason - I wish I had someone to do activities with. I feel so lonely most of the time. It’s such a painful feeling. I put myself out there a lot in the past and got burned so often that I just stopped trying. I’ll look at a dating app every now and again, but never had luck with those, and typically, dating apps make me feel even worse about myself.", "label": 0}
{"text": "I am glad i am but at the same time i wish one of them worked Ma,am", "label": 0}
{"text": "Rawdog may not be the word I would choose lol but I hope you do ok.", "label": 0}
{"text": "Ye, I realize now it sounds a bit vulgar n weird,, sorry I m not a native speaker hh", "label": 0}
{"text": "yrs... im almost 60 years old... lonely and alone... and i have begun doing this... ive pushing close friends and even my Grand kids away...", "label": 0}
{"text": "I hope u get well soon, i feel u sweetie", "label": 0}
{"text": "maybe because you are... UgLy", "label": 0}
{"text": "Yeah, I got a retail job and everyone was dating, married or engaged and here I am with not only no friends, but having never dated at age 27. People can usually tell I'm single just looking at me, too. In high school I was warned that I would never find anyone by someone I was friends with and every word has come true.", "label": 0}
{"text": "this was me on my 18th too unfortunately. i wish i could have a do over :) gotta be one of the hardest days of my life. i've promised myself 19 will be better and easier. put in that effort and fake a smile if need be", "label": 0}
{"text": "well ok just try again is fine theres always next time", "label": 0}
{"text": "i hope u are talking about wanking relapse", "label": 0}
{"text": "Hey, I'm a guy, here's something I understand about people and their bullshit. I'm a fat guy. My first girlfriend, we met online and started dating before we saw each other's pictures. I liked her. I assume she liked me. She wanted me to get thinner, but never pushed me or made me feel bad about it, I wanted to get thinner too, because it'd help me. But I never could do it. I broke up with her, and at that moment, I started feeling the genuineness of her being attracted to me. I started doubting my looks and myself.\n\nAfter that, this other girl, she literally lusted over me. She imagined me. I was and still is a fat guy. \n\n\nWhat I understood is that, people are weird. You'd think something of your body, they'll think something else. I can hate myself as much as I want, there'll be quite a few people out there who would love it. I can love myself as much as I want, there'll be quite a few who would hate it. My point is, do not base your well being on what people think. It's very difficult to do, but it makes things happier for the self.", "label": 0}
{"text": "Your brain is still with you with all the chemicals.", "label": 0}
{"text": "Sounds a lot like me", "label": 0}
{"text": "Smoking and working on my house and garden", "label": 0}
{"text": "Maybe look up the side effects and decide if they are with it to you. But feeling high sounds fun.", "label": 0}
{"text": "It certainly looks that way. Try to do something you do like as a reward for doing the difficult things in life.", "label": 0}
{"text": "Hey there, congrats on 28. I feel you completely! I had some unfortunate events happen to me in my childhood and freshman year of college, so the trauma took over and I wrecked my 20's, lived in fear in my teens, and early onset of depression was my childhood. My whole past is full of regret but I'm learning that I got an opportunity (and thank God I took it) to address my life, who I am, what happened to me, and move forward . \n\n\nThat means I get a chance to become a grounded human in my late 20's, giving me the rest of my life to fill with amazing experiences I used to be incapable of enjoying. So I feel you missing out on your early 20's but honestly, most people do. Most people go away to college, drink them selves silly, make bad decisions, sleep with people, destroy their self-esteem, and pretend that is normal! It's not! And it's not as fun as people make it seem. For some, of course, but everyone struggles. Honestly, everyone struggles HARD!!! Some in their early life, some in their middle life, some late in life, and those who choose not to change, well... Then the rest of their life. \n\n\nYou got this!!! Just one day at a time. It's a gift to be here, but it's a gift YOU have to take. Listen/read the books How to Do the Work (I forget the author) and Hidden Potential by Adam Grant . Life is hard my friend. But it's also beautiful. Be kind to yourself, others, and take a small step forward everyday ❤️ Glad you are here!", "label": 0}
{"text": "yeah its fun feels ood but its a long time since i felt so happy", "label": 0}
{"text": "Well it doesn’t seem like you want information on sleep deprivation so I won’t bother with it. Spoiler alter you’ll fall asleep.", "label": 0}
{"text": "I feel you. Life sucks and when we have struggles it feels so much worse. Just try not to make things worse for yourself.", "label": 0}
{"text": "yeah i am over the sucidal phase now i want to live but i have fcking adhd nd i m having ocd meds too so i am fcked either way but i dont care anymore", "label": 0}
{"text": "I think they are just happy in the moment or they had a near death experience where they would have missed out on a happy part of their life.", "label": 0}
{"text": "Well that’s good as your past that phase. Do the medication seem to help with the two conditions? Or is it a matter of side effects that you don’t like?", "label": 0}
{"text": "Ig the nearest person near me whic would be my roommate. He doesnt know abt my issue as I'm pretty good at masking it but still", "label": 0}
{"text": "For me, being 15 was about the most hellish time in my life. Abuse from my family was horrible and I got sent to the hospital for it. I experienced more traumatic experiences in that one year than anyone should in their entire life. So to me, your comment feels pretty dismissive. Even though I know you're trying to cheer OP up.", "label": 0}
{"text": "ocd", "label": 0}
{"text": "Well achieving what you set out to do will feel good. Keep making goals even small ones and complete them.", "label": 0}
{"text": "Don’t hold it in, Ive done that for years; feel the same as you. Try not to let it overwhelm you.  I watch my depression and find one moment when i can do something to take my mind off it - not easy but treat it like a challenge. Good luck my friend -", "label": 0}
{"text": "Is it just an urge to kill or is your roommate the problem?", "label": 0}
{"text": "Please consider seeking professional help if you already aren't. That's my answer would be if my gf told me she was suicidal. And I would be assertive about it.", "label": 0}
{"text": "Oh I bet. But you just don’t get to win.", "label": 0}
{"text": "yeah ig having sex for that long is not good either body get tired", "label": 0}
{"text": "Very true than the enjoyment is lost.", "label": 0}
{"text": "no not in a long time atleas", "label": 0}
{"text": "Well give that a go as it can help calm people down.", "label": 0}
{"text": "lol buddy i have never even touched a ciggrate lol. i am not fcked up enough yet. nd i  am just 20", "label": 0}
{"text": "OCD and ADHD or having a broke. Dick. that’s fucked I would talked to your doctor about it for sure.", "label": 0}
{"text": "noo my dick is not broke its healthy bro", "label": 0}
{"text": "I think you can be. Just because you’re not suicidal doesn’t mean you can’t depressed.", "label": 0}
{"text": "I fully agree. OP, you got an attractive body", "label": 0}
{"text": "You just can’t bust. You can get hard just no release.", "label": 0}
{"text": "please take it from me i wanna get off", "label": 0}
{"text": "I believe you. Trust me I do.", "label": 0}
{"text": "thanks buddy i do trust u. i used to be so corny all the time but now i am just too docile it feels odd bu it fine since i dont sexualise things anymore", "label": 0}
{"text": "I use to be corny but that’s when I was in a relationship. She enjoyed it. Now I don’t care so much.", "label": 0}
{"text": "I’ve spent the last 5 birthdays with my mom and sister but all felt lonely considering I had to make my own birthday meal. I turn 24 in a week and I don’t even think I’ll cook this year or go out. It will be a regular day.", "label": 0}
{"text": "Then go just join them 🤡", "label": 0}
{"text": "i have gone through it the only thing that can help u is taking a break from everything that exhuast u and do everything that u love the most take a 3 month break every thing will be fine i fought my sucidal depression with out mecds though continuous gaming for months lol now i am fin and can focus on my life and career so its about time that u take that break", "label": 0}
{"text": "Thank you so much for your advise... It means a lot to me.....\n\nIt is almost 7 years since i have been depressed and it's not going away....even if it goes for a short time, it always comes back to torment me... At this point it's hard for me to do the things i love to relief my mind .", "label": 0}
{"text": "And i thought i was alone", "label": 0}
{"text": "Reading familiar books. I read a story from Stephen King’s Night Shift when I’m stressed right before bed, it’s a lullaby and as comfortable as a worn in pair of slippers", "label": 0}
{"text": "Trust me, the repercussions that you would face would be much much worse than the emotions you are currently feeling. If you have any empathy at all, the guilt would haunt and smother you for the rest of your life. In fact, you do not deserve to live a peaceful life if you have taken another life. \n\nWhy would you even consider taking the life of your roommate before considering just moving out? Like are you really selfish enough to think that it would be easier to harm your roommate than to take an alternate approach? Does jail really sound better than living on the streets for a week while you find a new place to live???\n\nYour thought process on the situation is foul... calm down, be reasonable, and don't make any impulsive decisions. You will regret it forever.", "label": 0}
{"text": "I've been in your position before and I can confidently tell you that I'm glad I didn't go through with it. Life moved on and the pain got duller and I got to enjoy multiple moments in my life. I got to the point where I actually feel stupid that I attempted to do that in the past. I would've missed out on many joyful things.\n\nI discovered that if I don't like my life right now, I don't have to end it. All I need to do is drastically change it. If you wanna change careers, change countries, or even go date someone new and see how you feel about it, then do just that. Don't be intimidated or feel that you're scared. You were already planning on ending that life, so why not work on changing it and getting to enjoy that change?\n\nAt least, that's what worked for me. Hope this helps, and please stay with us. Life has good things to offer ❤️\n\nThis too shall pass", "label": 0}
{"text": "Ots one downside to some medications. Sertriline kills hornyness as an example. \n\nBut wellbutrin or Bupropion leaves your sex drive alone.\n\nAsk your doctor about other medicine options", "label": 0}
{"text": "Thank you Proud. Yes, I lost my dad in 2013 and my mom 2 months ago. I’m an only child and end of the bloodline. No kids, sadly. That’s a tough spot when you age. And when my mom died it was my last link to the past. All that history, gone. Almost all Aunts and Uncles gone as well. There kids now in their 60s, it’s funny \nWhen you look back it seems a long journey. Other times you can’t believe your the age you are", "label": 0}
{"text": "but this medicine is working good is this reason enough to change my meds", "label": 0}
{"text": "I wish I could tell you ways to better cope with this because I’m currently feeling how you feeling mines is over a girl and other things that has happened in my life but what I’ve been doing is trying to get back into my hobbies that I once enjoyed doing it helps distract my mind and not think about her or my other issues though its short lived it helps a bit… I really hope one day we have the strength to move on but I had to understand that right now I gotta feel my emotions because for years I would bottle it up but not no more I really hope things get better for you 🫤❤️", "label": 0}
{"text": "I’ve always dreamed of dying violently, whether by my own hand or someone more deserving. To have so much self hate that the only satisfaction you can ever get out of yourself is to be a punching bag for yourself or others. To feel some sort of suffering that’s “justified” because of my own wrongs just feels right.", "label": 0}
{"text": "I think of dying often. I only hope to achieve peace and a measure of happiness before the end. After thirty years of chaotic substance misuse and multiple injuries and hospitalisations I realise now that I need to ride it until the end, until I can no longer care for myself.\n\nWe need happiness before we go out, my friend. You have to try. You'll leave your family very soon.\n\nAs it happens, I was conceived around Christmas fifty years ago. My dad should have pulled out, but he didn't, and here I am.\n\nBe strong.", "label": 0}
{"text": "That's not true. Someone always has a reason to stay. There's always someone who loves us - even if we don't see it.", "label": 0}
{"text": "i think this is what i’ve been doing too", "label": 0}
{"text": "its just that u r lonly and u dont love her yes u are selfish but its fine we all are thats what make us human being . just move on dont hurt anyone anymore wait for the person u really love coz this is not love what u are describing", "label": 0}
{"text": "No harm in retreating for a while, try not to dwell just rest. I have been depressed for 2 decades and slowly moving out of an episode thats lasted 12 months. I might find some comfort and reason to live in     \nencouraging others to get well. Stay safe my friend!", "label": 0}
{"text": "I felt like that for ages: i finally went into robot mode in work. If you can switch off from the mental noise in work you will get stronger and more able to deal with all the BS. When you’re upto it move to something more rewarding.Don’t  give up - you are worth more than that!", "label": 0}
{"text": "I don't mean to dismiss the integrity of your post, but it felt like I was reading a novel. Which also makes me feel like you a have a a certain depth and that you are a self-aware person. You know what you did wrong in your past relationship. Consider taking note of the bad habits in your past relationship and making a conscious effort to change those habits in your day to day life. Practice being less cold with your family and coworkers. You are not going to get better unless you drop your self-defense mechanism of dismissing the people around you. But of course, you first need to understand why you are dismissing them. Perhaps you are afraid of hurting them, or that maybe they won't understand. Maybe you don't want to be vulnerable or you are afraid they will treat you differently. If you are more honest with people, it is easier to be your honest self around them.", "label": 0}
{"text": "thanks for listening, so nice to just have people to talk to", "label": 0}
{"text": "Well drinking is a downer so not a shock that people who drink are depressed.", "label": 0}
{"text": "The world has so much to offer, I know it sounds cliché but you're 15, things get better. Start small, be kind to yourself, explore, meet interesting people, read a lot, listen to music. Art has been life saving for me. Create. A lot of people have gone through similar stuff, you're not alone. I know it might seem like an bottomless pit you're in but I'm sure you'll get out of it. I believe in you!", "label": 0}
{"text": "I'm really sorry to hear that you're feeling this way :( Your life is valuable, and it’s important to find ways to feel better. Remember that everyone makes mistakes and has struggles. Try to treat yourself with the same kindness you would offer a friend.", "label": 0}
{"text": "I understand playing dumb with them, I’ve been the same, but it couldn’t hurt for you to find some kind of help/someone to talk to. You deserve to have someone hear your pain at least. Glad you’re still here.", "label": 0}
{"text": "From the mom of a teen girl, I can not imagine the crushing pain I would feel if I lost my child. Please let your mom know what you are going through so that she at least has a chance to help you. I would move mountains to keep my baby girl healthy and safe.", "label": 0}
{"text": "You still have your whole life! If you say you suffer under the feeling if being a filthy person, do something to give your life a good meaning. Join a charity organisation, become a fundraiser, there are so many option to be and feel valuable for those around you.", "label": 0}
{"text": "Connect with an adult or older peer who you trust and who can provide guidance and support. Picture your dreams and goals. This can help you feel hopeful and motivate you to work towards a better future. Remember after tough times, good things can happen, just like a rainbow after rain. You've got this! You are MUCH stronger that what you think you are 💪👌", "label": 0}
{"text": "Part of being human it to care- those who don’t are ignorant selfish or ill. Distant yourself from people who aren’t genuine or don’t want to understand you- depression can and does get better with the right people around you.", "label": 0}
{"text": "For example, yesterday some guy was constantly bitching about my play style in paintball. Normaly I would shutdown but this time I was like, you know what? I’m witted enough to make some comebacks that aren’t out of line, so I did. Guy started ignoring me really quickly after that. I consider that a win for **me**.\n\nFuck this fuckin world man", "label": 0}
{"text": "Hmm, do you find anything fun?", "label": 0}
{"text": "Waaa:) similar situation here! Good luck to you", "label": 0}
{"text": "Real", "label": 0}
{"text": "The feeling is mutual.", "label": 0}
{"text": "In these situations, you need to live and survive—not just for yourself but out of spite if you have to. This man is a terrible person. He’s hurt you multiple times, cheated on you, and put you through so much. Please don’t let him have the satisfaction of you leaving this world while he goes on to be happy with his new girl. Take this chance to heal and improve yourself. Focus on becoming the best version of you, and go out there to find something or someone who truly wants to make you happy. Make him regret his mistake, and in the process, understand and know your worth. Realize that, in truth, you were far too good for this loser in the first place", "label": 0}
{"text": "I feel you. Life is just too hard. I’m a 25 year old male and I don’t know what happened to my life. I’m nowhere I thought I’d be. I’m a train wreck in life. I fit to stay away from people because I just don’t click with people. I’d rather just be left alone. If I didn’t have bills and didn’t have to eat I’d just stay in my room and shut the world out. It’s not fair in life when people get to live happy and have no real struggles or worries. I don’t hate those people who are happy I’m just jealous. I’m continuously worried about what I’m doing and if I’m doing wrong. I just can’t live this life. It’s too much.", "label": 0}
{"text": "How can you turn criticism or doubt into a source of inspiration for your creativity instead of allowing it to diminish your passion?", "label": 0}
{"text": "Anytime!!", "label": 0}
{"text": "You made the effort to write all this so why not make a little more and just do it?", "label": 0}
{"text": "I just want to say I was 15 when I tried to OD by pills. My dad was dead, mom beat the shit out of me and step dad was even worse.  My life sucked. I'm now 27 with a little girl and engaged. Trust me when I say I never would expect to be where I am now. Please get through this. Or get away from whatever is causing you pain.", "label": 0}
{"text": "Must be nice to have that view", "label": 0}
{"text": "No, the second was a good person.", "label": 0}
{"text": "Happy Birthday. I know this day is filled with a mix of emotions, especially after all you’ve been through to reach 28. I truly understand the struggle; I’ve been there too, wondering if I’d make it through. It’s hard when you feel like you’ve lost so much to pain and illness, while others seem to live lives full of health and freedom.\n\nBut I want you to know that even in the darkest moments, I’ve been finding hope in Jesus, little by little. It hasn’t been an instant change, but day by day, He’s been helping me carry the weight and see glimmers of light ahead. It doesn’t erase the past or the pain, but I believe He is still working, even when I can’t always feel it. There is still room in this life for peace, for meaning, and for a future that feels good.\n\nYou’re not alone in this, and I’m here, holding onto that hope alongside you.", "label": 0}
{"text": "So it sounds like you were raised in a hostile environment and internalised it. You probably avoided healthy relationships because you thought that you didn't deserve it or it felt weird. Regards to the horrible things you did imagine a friend was telling you those things and council them how to get through it. It's probably your self hatred is colouring your views. Work on learning to set boundaries and how to accept affection from genuine people. Those are fundamental relationship skills that you probably don't have", "label": 0}
{"text": "Trying to find ya something if I can.\nWho specifically have you tried ? What province?", "label": 0}
{"text": "I have read that in your earlyer post and i know what you feel. Its like a void in your chest. (Idk what you feel but that was my experiences). But try too look at it from an other angle. For example when i was depressed (and still am a bit) i looked at my life in 2D but now i can see that many things were not so obvious after all. You are 22 so it isnt late to find meaning.", "label": 0}
{"text": "See dm", "label": 0}
{"text": "Birdwatching and warm blankets!", "label": 0}
{"text": "Living my life just waiting for the days to pass and then wondering where all the years went", "label": 0}
{"text": "Why makes you feel that way about you", "label": 0}
{"text": "I have exactly the same. Im always surprised how people go outside everyday without struggling to do it. When im outside i feel like everyone looks at me like what is he doing here. And everything i go do, is a flop.", "label": 0}
{"text": "Sometimes one, sometimes the other, sometimes switching between the two. There’s not really one exact template for what depression looks like.", "label": 0}
{"text": "We are our own worst critics.\n\nNo one is unworthy of love, there is someone for everyone… for better or for worse.\n\nEven hitler had a girlfriend.", "label": 0}
{"text": "Join some roast groups and be mean, join some amiugly groups and be honest, join groups that have people that are dealing with what you are and sympathize with. Accept you are a misanthrope. Join those groups and engage as well. It will teach you it’s ok to hate the world but you don’t have to be a miserable cunt about it. Do I hate people and the way the world works? Yes. I’ve found myself having a heart for people that my heart go out to, because their pain is my pain to. You will also find people willing to be humane to you as well. It brings a bit of balance to inner chaos.", "label": 0}
{"text": "If you overdosed on Tylenol you really shouldn’t play dumb because even though you survived there’s a real possibility of permanent liver damage", "label": 0}
{"text": "Can you change? Can you get people to line you?", "label": 0}
{"text": "yes buddy i am going through same too rn taking ssri but chill its temporary nd everything will be fine with time and yeah after skiping meds for  a week and u will be hard as usual but dont skip cthem ask ur doc change ur meds if u are not comortable with it just dont skip on ur own", "label": 0}
{"text": "Also stop drinking alcohol or smoking weed. Alcohol kills testosterone so badly. You can also get on enteric coated fish oil. It’s basically the chemical that bypasses bad cholesterol and goes strait to the precursor that makes testosterone.", "label": 0}
{"text": "And it's too the point where all my coping skills just make it worse😔", "label": 0}
{"text": "I just posted something similar, although you've written it much more eloquently. No matter how objectively good things are in my life, I just feel empty. I wonder if some of us are just born miserable, maybe some sort of developmental defect in our brain", "label": 0}
{"text": "Perhaps i could have explained better, i truly think that living a miserable life is still a better option than dying.\n\nNo one knows what dying entails, so personaly i would stick to the reality that i know. \nTime has the cappacity to bring good and bad things.\nIf im at like 93 years old and, despite doing my best, im still miserable, sure, i can accept that perhaps hope has clouded my judgement.\n\nBut until then i just can't see what dying would accomplish, i've walked this earth for 20 or so years and if im meant to live until 100 years, then i've only seen 25% of what im supposed to see. I chose to belive that time gave me the shitty parts first so that i can live freely on the later years.\n\nRedirecting that hatred gives you more time and with time there is hope for change, depression blinds us to the possibilities of a better life. As a person who was once in a way darker place i can tell you that there are moments where it becomes bearable and chasing those moments is worth it.\n\nBig hug", "label": 0}
{"text": "Thank you for the compliment. I’m scared to feel too good about it but it’s nice to know that I can word things well. But I definitely think that some of us might just be defective emotionally which is really really disheartening. Knowing that I’m basically the broken toy version of a human makes me hate myself a bit. I wish we could take our brains out, wash them, and feel normal but that’s just not reality..", "label": 0}
{"text": "Felt the same. I have a best friend whose life looks better than me, but I love that guy. It's just you'll look and ask yourself sometimes \"why others have better lives than me, even without effort?\". It feels like a curse being too observant.\n\nI hate myself too, but sometimes I just lay flat and forget about it. We just need to be perfectly alone sometimes.", "label": 0}
{"text": "You have an incredible body. Your ass is amazing as well. If you are not happy with your chest work on enhancing your but. Get into exercises to enhance your butt. One the endorphins from working out will be good for you and you will actually be able to take control and change something, even if it's gradual.", "label": 0}
{"text": "she knows. shes been abusive all my life and the only reason she took me to the er was because she didn’t want child services called on her again. I wish I had a mom like you.", "label": 0}
{"text": "keeps you alive and then makes it easier to work through that hate", "label": 0}
{"text": "Very good friend of mine suicided, we lived a big travel story. He was very strong, always joyful, never thought it could happen. He saw very harsh things, we saw some together. I many times think, that if a guy like this does that than it means nobody is safe from it.", "label": 0}
{"text": "The curse of intelligence", "label": 0}
{"text": "I understand. My ex left me a little over a year ago and immediately got with another girl. They look happy and they even live together now even though when i would bring up us moving in together, he would say he hated the idea lol. It makes my stomach hurt. I begged him to do the things he now does for her. It’s like a punch in the face.\n \nHe cheated on me. Left me so fast, too. Was totally blindsided. I’ve known him 7 years, dated on and off throughout that time. \n\nI’ve struggled with my mental health for over 14 years now & being suicidal & him doing what he did just amplified it. Made my feel horrible about myself.\n\nI don’t have many words of encouragement because I’m still struggling with the breakup as well as my mental health. But I’m here to tell you youre not alone.", "label": 0}
{"text": "Did this march 2024... tuff to move. Still remember. I delete almost all things of her.. but still..", "label": 0}
{"text": "Because people refuse to change a system that hurts them. And we all refuse to take responsibility and accountability.", "label": 0}
{"text": "yeah that makes sense, but ed should really they should give you a discount or even free cause you tried once before", "label": 0}
{"text": "I do that! Meat builds muscle! I need that protein, dude!", "label": 0}
{"text": "take raw protein meat has alot of fats too", "label": 0}
{"text": "u are fit bro", "label": 0}
{"text": "1. What's your BMI?\n2. Protein shakes are great for hunger and aren't that caloric\n3. Drink water (with electrolites idealy)\n\nSorry for my english. I'm retarded non native speaker", "label": 0}
{"text": "It may have just been an overwhelming day and the shot was the thing that pushed it over the edge.  You got out there and tried.  Soke days, that is all we can do.", "label": 0}
{"text": "1600, maybe, not sure. I workout 6x per week. Check history for more notes, specifically beginner fitness. Contradicting information I know. \n\nTrue! But it won't go away even if I do that. \n\nWhy electrolytes?\n\nYou aren't retarded! Don't call yourself that!", "label": 0}
{"text": "just ask some help from ur trainer", "label": 0}
{"text": "All you can do is try to find something which you atleast find joy in. Be it a person or a hobby. We are here now so might as well try to make something out of it and enjoy the small good things.", "label": 0}
{"text": "she just try to sucide. I don't know what would happen if i tell her that.", "label": 0}
{"text": "Me too bro", "label": 0}
{"text": "It's been going on for to long and is eating up my childhood", "label": 0}
{"text": "Smart people talk to themselves...", "label": 0}
{"text": "dopamine goes brrrrr", "label": 0}
{"text": "then ask for someone in gym let me tell you do less reps with more weight than more reps with kess weight", "label": 0}
{"text": "??? I don't go to the gym lol!", "label": 0}
{"text": "Trauma, brain chemistry, and lifestyle.", "label": 0}
{"text": "Is there a reason for that? Trauma, being alone etc?", "label": 0}
{"text": "I'm 65 and have been through all of this and a lot more.  I spent a very large portion of my life trying to put an end to it over all the bullshit, but here I am at 65 and finally enjoying what's left of my life. I used to regret most everything, but I discovered late in life that my past is done. I don't have to keep repeating the same stupid shit over and over. Move on. You have years ahead of you to make things right. Grab ahold of things that make you and others happy and don't let go. It's a long struggle, but worth every minute.", "label": 0}
{"text": "Is the question why not?", "label": 0}
{"text": "The depression is still there, but I also sometimes feel happy and my bad episodes are ugly but not dangerous anymore", "label": 0}
{"text": "Yeah", "label": 0}
{"text": "Then continue to talk to us on Reddit. A lot of people have been in your shoes. A lot of people will want to help you.", "label": 0}
{"text": "Do you exercise?", "label": 0}
{"text": "What lol", "label": 0}
{"text": "What's wrong?", "label": 0}
{"text": "Honestly, you are right. I didn't mean that way. I phrased it wrongly I apologise.", "label": 0}
{"text": "It's not the fact that I feel depressed that scares me, it's that I actually feel nothing at all. Never thought I'd have ever gotten to the point where even being able to feel horrendously sad would be a luxury.", "label": 0}
{"text": "I'm sure there are quite a few ppl that try too get it and do genuinely care but you somehow are blindsided to it or don't recognise it. Learn too take mental notes of the ppl you hangout with & acknowledge the positive value they add into your life & be mindfull they also humans that are navigating this stressfull lifestyle created by humanity.", "label": 0}
{"text": "you do deserve to feel happy, everyone does", "label": 0}
{"text": "But do you see any point in it?", "label": 0}
{"text": "And like I said that is impressive. It means you are trying your best every day. You know how hard it is to get up to work everyday. But you still do it and that's impressive. You should be proud of that fact. I know that there are hard days and I know it's very difficult but you are trying and that's what matters.", "label": 0}
{"text": "I would say talk to a medical professional if you can. That way both issues could be treated. Please don’t be embarrassed about it - we all have our issues. \n\nDepression can certainly affect sex. I have not personally had ED from it but with antidepressants and anxiety I have had issues… how you say… completing 😅\n\nThe brain and body have a complex interaction with each other so they could be both related or they could be both separate issues. You won’t really know until you see a professional.", "label": 0}
{"text": "The horrible realisation that something has died between me and a friend.", "label": 0}
{"text": "Unless you hurt children, how bad can anyone be.", "label": 0}
{"text": "It does get better though, if you give it enough time. Yes, it can also get worse again at times, but I think as you get older you learn what works and what doesn't, and you get more and more \"good\" and less and less \"bad.\" I think the learning curve is different for everyone, but I think 25ish is probably the average where you start realizing \"Oh huh, I guess it can just start being more better than worse.\"\n\nI'm not saying there aren't moments where things don't get bad, where you feel like you can't handle one more day. But it's a lot easier once you've had the good ones too and see the pattern starts erring more and more in the direction of good, on an exponential level.\n\nThink about the ratio of good days versus bad days at say age 20 vs 25 vs 30, etc. I think most people with depression would agree that ratio skews to more good the higher the age.\n\nOr maybe it's just me and the people I know. Somehow I don't think so.", "label": 0}
{"text": "Yeah I never have wanted to act on those thoughts but the fact I have them to begin with scares the shit out of me.", "label": 0}
{"text": "You will be fine", "label": 0}
{"text": "I'm from Bosnia", "label": 0}
{"text": "My family admitted to me they never loved me. It’s okay. All I have ever had was me. It’s okay I am meant to be a like I’m a man no one cares. Just smile and say I’m alright.", "label": 0}
{"text": "Same bro..it seems i can't feel anything", "label": 0}
{"text": "Don’t give up. I’m 13 I have MDD and anxiety I’ve had it since I was 10. I’ve tried kms four times in the past two years. I’ve found that the problem is I’m not looking for the good in my life. When I rot in my bed I allow sadness to take over me and I know it’s hard to get up I’m not saying you need to get up. But you should find the good in your life and give yourself a reason to get up no matter if it’s the simplest thing. And if there is no good you can find make it yourself. Watch a show that makes you laugh or go online and make friends but don’t let yourself fall in howl you won’t get back out of. I promise it’s never worth it.", "label": 0}
{"text": "I was an accident that was supposed to be aborted. I usually wishi was.", "label": 0}
{"text": "I have read few of your post and I can say that you are very much like me.. I am on antidepressants and Anxiety medication. \n\nHave serious mental issues and depression along with suicidal thoughts. I am not married and refuse to cause I don’t think I am fit to raise an another human being.. I hardly can take care of myself.\n\nTbh Religion does help . ..I would say spirituality.. As it makes you realise the blessings around you . It helps you ease your anxiety and tbh in the end you realise that all this world is temporary. …Good thing we aren’t immortal….", "label": 0}
{"text": "You are so sweet. So young and wise. I hope time grants you the happiness you deserve. ☹️", "label": 0}
{"text": "I had lexapro (escitalopram specifically), and that had no impact on my libido. Give your body some time to adjust.", "label": 0}
{"text": "Look for a cat coffee place in your area. Order something you like and enjoy the cats. \nGo to your local animal shelter, buy some treats, and take a dog out for a walk. Bless him with a day of love and fun. \nMake a difference in his life.\nAnimals give you so much unconditional love ❤️ \nDo something that you always wanted, but you have been too scared to do.\nGo to an assistent living facility and spend time with those who live there. Many are so lonely. \nGo to a soup kitchen and help out.\n\nFor me, helping others, animals and humans alike, gives me a purpose", "label": 0}
{"text": "I’m so sorry", "label": 0}
{"text": "Und ja, zwischen uns ist noch mehr vorgefallen aber das war wohl so das Main Thema. Ich bin so müde. Ich bin seit 3 Jahren in Therapie aber was das angeht komme ich einfach nicht voran. Ich funktioniere nach außen, aber mein Privatleben ist einfach tot. \n\nFalls das jemand von euch kennt, also dieses plötzliche Widerwillen entwickeln, würde mich das interessieren, aber wenn nicht ist es auch okay. Ich glaube ich hatte einfach nur das Bedürfnis das alles irgendwie zu teilen.", "label": 0}
{"text": "I send you a big hug.", "label": 0}
{"text": "Just my life. Everything is going south. I feel like nothing's going change", "label": 0}
{"text": "It is easy to live when one is healthy, has a loving partner and a job you like.\nI am just like you: the meds do not help much.\nThere are more people like us unfortunately ", "label": 0}
{"text": "There are moments that I decide to be best version of myself. It's just depression comes along and takes all my ambition away. Tho I totally get your point. I'll try to improve myself", "label": 0}
{"text": "I was going to say that. Medication comes with its issues but I wouldn’t be here otherwise so…", "label": 0}
{"text": "I don't even know what to say to you; those are two very difficult and different situations to face, and they change your identity enormously, which causes a lot of pain.   \n  \nYou never know what's happening inside people's minds, and I applaud you for being as strong as you are and looking to get your life back on track. Saying my feelings out loud in painful situations when I'm alone helps me feel better. Obviously, there's more to your situation than that, but it could be a good start.", "label": 0}
{"text": "Since I totally get how you feel, from the bottom of my heart I wish you heal from it as soon as possible 💕", "label": 0}
{"text": "Freedom of speech...\nSome individuals in the UK kill and are released to make space in prisons.\nI could bear all the world insanity when had my family with me.\nAfter my ex left me for another woman 5 years ago, after my son moved out for college in August 2023, I am like a zombie.\nCannot even squeeze the trigger to end it.\nIn the news there was a story about Shirel a 22 year old jew who killed herself a year after the Oct 7th attack.\nI am so ashamed she died when she was young, beautiful and was surrounded by loving ones.", "label": 0}
{"text": "Actually I was thinking about doing some volunteer work for children. It my help me feel better.", "label": 0}
{"text": "Absolutely. You don’t have to have all the symptoms. I usually have that one but I’ve had episodes were my appetite was normal for example. ", "label": 0}
{"text": "I have given up on a person loving me or finding a full time job or even ending it all.\nAm in a living hell.", "label": 0}
{"text": "That’s what I do. Work and focus on my life, build my credit and honestly seem pretty fine surface level. I’m the friend that you honestly don’t worry about because she seems fine. But I got that deep shit hurting me. My parents choosing drugs over me and the regret I fear I will face from whatever decision I don’t make. Seeing life not turn out the way I expected. Seeing other peoples relationships with their parents and wanting that. Seeing the deeper connections people are making with each other and feeling like I don’t have that. I missed out on a regular life. Thanks for responding. I’m over here in my feelings, pretty lonely and I don’t know what exactly I want, but maybe just to let it out a little bit. Hear some other people’s experiences", "label": 0}
{"text": "My experiences and abilities are different from yours so rather than assume we have different needs, I’m going to question you.", "label": 0}
{"text": "Love that. I hope you feel better 🫶", "label": 0}
{"text": "Thanks. I know I didn’t have to apologize but I try to be kind and what I said wasn’t the kindest", "label": 0}
{"text": "Still it can feel shitty. It's not an advice nor it makes anything better to say this. ", "label": 0}
{"text": "lol yeah i wonder why", "label": 0}
{"text": "Honestly I'm done pleasing parents and other people man. Fuck everyone who judges me based on my college. I'm done. I love programming and I'll keep doing it. \n\nBeing respected feels good, getting money and a good work life balance feels good. But maybe I won't get it in this life and I should accept it. I'll keep working still", "label": 0}
{"text": "Exactly, I don’t know why people can’t band together and fight effectively for change", "label": 0}
{"text": "I figured this is what it is, but I have no idea what the change is", "label": 0}
{"text": "And then people have the nerve to tell us “That’s just life”.", "label": 0}
{"text": "i would if there were more than 2 churches where I live.", "label": 0}
{"text": "💯%", "label": 0}
{"text": "Sometimes the best cure for depression is to move to a place that is less depressing? Just an observation", "label": 0}
{"text": "oh yeah....I would even sit, plan it out, play out all different types of ways and scenarios. It calmed me down too.", "label": 0}
{"text": "Well there is a tiny little problem: changing the system and changing others.\nThe first is difficult, the second could even be unethical", "label": 0}
{"text": "Maybe he made you the way he did because he knew that’s what would make you the most happy. \n\nI sometimes envy my straight friends cause dating seems so much easier for them but honestly I’d never be happy or fulfilled with a guy. \n\nYou’re saying you’ll rot in your room for four years but you don’t know that. You’ll be going to some place new with new people.", "label": 0}
{"text": "You are not alone. I am in the same space right now, except I'm literally in the same space that I was in 20 years ago, except somehow, I finally managed to earn my college degree during this time. This is even more depressing because I don't feel any better about myself, and I feel helpless to change my circumstances. I have debilitating anxiety, which I've dealt with my entire life, which is the primary cause of my depression. Both of which have negatively impacted my self- esteem, caused major imposter syndrome, and numerous health issues from all of the constant stress. My life has turned out the opposite of what i intended for myself and I have no true emotional support, and, like you, I know what has to be done to change but I feel so powerless, helpless, unmotivated, confused, anxious, etc. I just try to take things one day at a time and express find some type of joy in small things, although it has been incredibly difficult.", "label": 0}
{"text": "still at least 2 years before i can leave my town, and no guarantees I'll make it through that", "label": 0}
{"text": "Me too dude, me too", "label": 0}
{"text": "I'm sorry to hear that. Your thoughts are just like mine when I'm depressed.\nHere's what I've written for myself to cope with depression (I just translated it into English). I hope it helps:\n\n\"Depression is not due to your lack of anything,\nBut because you’ve held onto too much pressure in your mind.\nYou are not as bad in reality as you imagine.\nDon’t let anyone insult or manipulate your beliefs.\nLet the bad people be; ignore the wicked society,\nYou live your own life, after all.\nIf you hate someone, don’t act like them.\nIf you dislike society, don’t live by its rules.\nDon’t assume everyone is bad; look back at yourself first.\nLeave behind the people and places you hate.\nDon’t demand everything to be provided; demand to create for yourself, live for yourself.\nIf it’s hard for you to do it, it’s hard for others too; seek out teammates.\"", "label": 0}
{"text": "Thank you. And I'm sorry for your loss as well.  Interesting, I lost a girlfriend a few years ago, we weren't together at the time but she was the only partner I stayed as friends.  \n\nWhat's tough about sibling grief is realizing how similar we actually are/were - I noticed my voice is identical as his, so i struggle listening myself on a video, identical gestures that reminds my of him, the way we eat, sit, humor, and so many more, all those brings back the grief. \nI think you should spend some time watching some informative videos of how grief for your immediate family will be like. \n\nIm familiar with that overwhelming emotional feeling - it’s almost like blacking out or zoning out, with tunnel vision focused on an immediate path to end it all, all within two seconds.  You know, when we meet someone attractive with the right chemistry it dilates our pupils as we look into theirs... If you felt something similar while looking down from the balcony, your lizard brain was engaged for survival, and that was a close call.", "label": 0}
{"text": "hey man, I don't have the answers to your questions, and i don't know how to make it stop hurting. but I am in the same boat as you are. I work in the middle of nowhere, I hardly have any friends other than coworkers, and even I don't know what to talk about with my parents too everyday. all I can say is that we are alone together if that helps. know that when you feel low, and your heart feels heavy and the tears don't stop, know that I understand your pain. I get the pain and I know it all hurts. i know this is difficult but I know you are strong. on days where you feel apathetic, I hope you find contentment that there are others like me here who can't solve your problems, but we are always here to be an ear to listen and a shoulder to cry on. you'll do well buddy, I believe in you.", "label": 0}
{"text": "I feel you ,I'm currently going through that myself", "label": 0}
{"text": "I wonder the same thing too title and a lot of these questions.", "label": 0}
{"text": "Kind of. Sometimes I think my husband and children would be better off without me. I’m too much of a coward when it comes to considering suicide. I don’t have suicidal ideation. \n\nI don’t think I add enough value - although I do try and believe I add some. ", "label": 0}
{"text": "Am a girl", "label": 0}
{"text": "you just haven't been railed properly", "label": 0}
{"text": "Did you find someone to speak with? I'm available now...", "label": 0}
{"text": "Wait! WHY DIDNT I THINK OF THIS BEFORE", "label": 0}
{"text": "Thanks. A lot of women are mean and it makes me feel bad about myself.", "label": 0}
{"text": "Thanks. I’ll feel empathy for them then.", "label": 0}
{"text": "What’s your mom’s belief?", "label": 0}
{"text": "As someone that doesn't follow any of the currently ongoing religions, it just bums me out seeing people needlessly being depressed and shamed by others because of some nonsensical rules extrapolated from a few thousand year old collection of texts stating how you should live your life today. With your happiness and mental health being 100% irrelevant.\n\n\nIf you're living in a very judgemental community that is demanding you to be in a certain way, I only hope that you can eventually break free and find social circles that not only \"allows\", but actually wants you to be content with who you are.", "label": 0}
{"text": "I feel you. Atp im numb to it if I get ignored in a conversation. I just shut up and act uninterested bc atp I really am uninterested. I’m not going to pretend to butter people up who won’t even give me 10 seconds of their day to let me say what I need to, and ofc when I do that everyone wonders what’s wrong with me and why im not acting my usual passive self but they can’t put 2 and 2 together. I’m almost at the point of giving up and accepting my fate as a hermit/loner with no friends bc I do my best to accommodate for everyone else but receive no reciprocation or feedback it just pisses me off, happens with family, coworkers, classmates, random customers, anyone. Idk if it’s my area since I’m not from here or what, could be multiple factors tbh. Life sucks", "label": 0}
{"text": "Preclude not procure. Sorry for being pedantic", "label": 0}
{"text": "No problem we all gotta get it out somehow it’s better if we’re all in the same shitty boat at least lol, you as well", "label": 0}
{"text": "It's not about life as an adult mate, it's self awareness.", "label": 0}
{"text": "I've been living with suicide thoughts since i made the first attempt i march this year, my mind i slowly killing me, but i don't show that side to anybody. Because i have nobody. Copule of close workmates, but i would not dare to speak about my suicudal mind to them, and my crush who have friendzoned me. She does not need to know about how i feel. \n\nBut i would love to have some one to open up to, like for real. Someone who would not judge me if i started to cry. I miss having close people. I am so fucking lonely all the time and no one knows, and probably now one cares either....", "label": 0}
{"text": "This is me and One Piece by Eiichiro Oda.", "label": 0}
{"text": "I'm scared that my entire life will be lonely. I'm not happy at all, the only person I truly loved, that I tried to treat so nice and with so much warm, just disappeared. I don't believe that I can find somebody who would be at least 10% as great as she is", "label": 0}
{"text": "That therapist would likely be able to refer you to one. It's a start.", "label": 0}
{"text": "Sometimes crying helps! Tears release stress hormones, and I know myself personally, when I cry, I tend to feel better afterward.\n\nIf you're not looking for that type of advice, though, I recommend spending time with friends/family. Being by yourself in isolation (either living alone, being confined to your room, etc) is going to make you mull over the stuff that's making you want to cry. If no one is available, try diving head-first into a hobby you have or getting work done around the house. Pop on a Youtube video or some loud music and start doing all the chores you've put off. Basically anything that gets your mind geared into something else rather than the bad thoughts. Hope this helps! <3", "label": 0}
{"text": "Omg I've had the same thought I use to joke about hiring a hitman on myself or getting life insurance and making someone that I'm sure would kill me for it as beneficiary", "label": 0}
{"text": "Not that this is reassuring, but I think for me, it's that every hobby costs money. Everything's a bit of an cost benefit analysis now. I have this one friend who's main way of socializing is going to the movies. It's great fun, but at some point I got frustrated at the fact I had to pay 30 dollaridoos to hang out.\n\nI think everybody is feeling this way tbh. Rent, low paying jobs, having to do long commutes. And even when you don't have these costs, it feels like you're not doing the right thing, merely existing. I absolutely can't speak to your experience, it could be any number of things. But this is where I'm at right now.\n\nI think I've found doing proactive things sets my mind at ease. Doing some gardening, maybe having a bike-ride or scooter. But we are living in a system that is predatory, it's only natural to feel stress. Hence the happiest I've been is surprisingly... protesting. It's a low pressure environment where people don't have to socialize if they don't want to, but have a unified mindset.", "label": 0}
{"text": "Why do you hate yourself dude ?\nU probably are a beautiful person depression just take away the ability to see who you really are.\nAnd build up a fake picture of an evil version of yourself.\nAnyway if you wanna talk I’m here mate.", "label": 0}
{"text": "Because it gives you the impression that there is a way out.", "label": 0}
{"text": "All I do is work, study and sleep. I hate my job and I only went into college in order to please my parents.", "label": 0}
{"text": "My friends and my children do not know how to help me.\nMy friend is going to  the wedding of the lady of does my taxes \nand I wish I had been invited...", "label": 0}
{"text": "Well if u hate going in college just leave idk how close your parent and you are but it’s your live and u don’t have to live to please anyone.\nWhat is your job btw ?", "label": 0}
{"text": "It is not actually. When we find something we like it is supposed to make one feel better.", "label": 0}
{"text": "Right I have to get to the point that it hits me back and just returns me to the moment I’m living in. I am trying to change my perspective of what is gonna happen and try to give everything a rest I hope it’s gonna work thanks man", "label": 0}
{"text": "You seem to be a good person, maybe too good with other and not enough with yourself.\nMaybe if u can, put ur feeling over everyone’s feeling(without becoming an asshole)\nCan you try to change your job or it’s impossible in your situation ?\nMaybe work with people of your age if u can.", "label": 0}
{"text": "You don’t know what everyone is thinking and why care what another person thinks about you. No one goes to the grave holding hands.", "label": 0}
{"text": "I hear you. You are sensitive like me.\nHowever when I had my family I was not depressed. Now I am dragging myself to the next hour wishing I could end it but not finding the courage to.", "label": 0}
{"text": "I am depressed. When you talk to your friends they talk and then go back to their lives.", "label": 0}
{"text": "that's really rough... wow", "label": 0}
{"text": "There may be numerous different reasons for why you haven't received the attention you want. Different, and random reasons. Are you reaching out to people? It could be the environment, special conditions, circumstances, timing. Most of this is outside of your control, but it doesn't mean it's a reflection of you. \n\nI understand and emphasize with your fears, especially now after you've suffered such a loss. Everything will look bleak and dark now. You lost someone you gave a lot of love and warmth to, showcasing that you're capable of giving it, and so you need to find people who will appreciate and value that. \n\nWhile you care deeply about this person, she's still just one person, she doesn't define your worth. There are many people out there, it's possible to meet someone who will care and understand you fully for who you are. Still, I strongly encourage you to focus on yourself for now. You need to be patient while you grieve this loss.", "label": 0}
{"text": "I see it’s not easy for you then.\nTbh rn I don’t think u could change the situation but u can improve it.\nDo you have friend in ur town ?", "label": 0}
{"text": "Complete different with me I cry every night for the past 2 years", "label": 0}
{"text": "I had one friend but he left me for another group", "label": 0}
{"text": "It gives me headaches because my body is losing so much water", "label": 0}
{"text": "Ouch and online do you have any friend ?", "label": 0}
{"text": "There is a reason why depression is categorized as a mood disorder. It affects your feelings and the way you perceive the world", "label": 0}
{"text": "Not really, I have extreme anxiety so trying to join new groups or find people is almost impossible. I’m too scared of being rejected", "label": 0}
{"text": "And I’m sorry to hear that u deserve better u really seem to be kind btw", "label": 0}
{"text": "Then I have a sister too she does nothing but brag when she’s visiting me", "label": 0}
{"text": "I wouldn’t my family is kind of a lot", "label": 0}
{"text": "And I'm crying right now..", "label": 0}
{"text": "I feel the exact same. sorry bro.", "label": 0}
{"text": "I need my own life and my mom doesn’t care", "label": 0}
{"text": "I don’t want to tell my parents that I have depression but I want to go to therapy", "label": 0}
{"text": "I won't, thanks for that.", "label": 0}
{"text": "Who has told you that you're weird? People at school? When you were in kindergarten, did you think you were \"weird\"? Maybe, but probably not.\n\nThat's something someone has told you. Whether it was the media, other people, family, anything. And feeling like an outcast can sap your motivation real quick. What's the point of doing anything when you feel so different? \n\nBut you're not weird. You should be accepted fully and unconditionally as your authentic self. Every human deserves that. Our anger, our joys, our interests, our passions... someone should unconditionally accept us (but not totally take our bullshit) for who we are. \n\nKeep looking for kin spirits. You'll find 100 people who don't fit your vibe, but that 101st one just might. It takes time to find people you feel that spark with. \n\nThere a shit ton of people in the world. There's got to be a group out there for you to match your weirdness. \n\nSource: I'm crazy as hell.", "label": 0}
{"text": "nigga what😭😭😭😭😭", "label": 0}
{"text": "I hope you feel better.", "label": 0}
{"text": "\"when you're ready to seek out someone again in the future\"\n\nI'm sorry, I don't really like this phrase, because I won't be ready, I've never sought for someone, I've never tried to create a relationship, and know I have a trauma and I don't want to experience this in the future, this is the reason I'm scared of eternal lonliness, because I know, that I won't try to build a relationship in the future. Even if somebody would like me I won't respond in any way, because I just don't want somebody to break my heart again.", "label": 0}
{"text": "Just referencing one of your past posts on /r depression /:", "label": 0}
{"text": "oh... yeah...😭", "label": 0}
{"text": "Huh. Don't know why but I expected some other answer. \n\nI don't really understand how kids are supposed to know how money making works. I think parents should be supervising the internet access more and talking to them about job aspirations more. I didnt have any of this from my parents(dad too manly to participate in upbringing mom never really worked) so I am extremely confused about this as well.", "label": 0}
{"text": "I know that I won’t try to build a relationship anymore. I want to protect myself from all these feelings I have now. It won’t be difficult to avoid girls, since nobody has shown even a bit of interest in me my whole life.", "label": 0}
{"text": "I’m new to this subgenre and mainly listen to bands like Lifelover and Apati, i guess they are more mainstream? You've likely been into it much longer and probably have a deeper understanding than I do.", "label": 0}
{"text": "Yep that was my life until my dad died a decade ago, which was when life really took the gloves off to beat me into the ground.\n\nAnd my therapist thinks I need a gratitude journal 🙄👌", "label": 0}
{"text": "You've done so much for yourself, and I'm so sorry that it hasn't helped. I see parts of myself in your post, and although all I can do is share my hopes, I want to express these hopes because I believe they can happen - for you and for me.\n\nI hope you one day find that therapist who really sees you and leaves you feeling seen. I hope you find yourself with a medication plan that actually does ease the pain, even if just slightly & temporarily. I hope you find an outlet for your emotions and energy, whether it's physical, artistic, with someone else or with yourself. I hope you one day discover patterns in your emotions, and you find that, although we can't completely control what we feel, we can influence it in ways that can take a lifetime to learn. I hope you feel love again and feel worthy of that love, because you are worthy of it.\n\nHopes are just hopes though. If you'd like to talk about any of it, I'll be here. \n\nWishing for your healing. ((hug))", "label": 0}
{"text": "I think laying it out here and getting some insight is a good start.  You are not alone-  I’m in a funk like this now too.  Self sabotaging. No self love.", "label": 0}
{"text": "Thanks once again for everything you said. I don't really want to take so much of your time, because those are not your problems, so thank you once again. I appreciate that there are people, able to find some good words for strangers in the Internet, thank you. You are the only one I could talk to in a very long time.\n\nIt hurts so much. Everything that I wanted is to give her all my love, care, kindness, all my support and attention that I have. Everything I wanted is to be with her no matter what, how come all my pure and genuine intentions could just be unnoticed?", "label": 0}
{"text": "Hopefully I’m wrong and we figure out a way to overcome the things that broke us. Despite my feelings I wanna believe we deserve happiness even though it seems delusional . So I pray I’m wrong about this", "label": 0}
{"text": "As a rich person who is poor you have few friends you can trust", "label": 0}
