{"text": "How do you think this type of logic would apply to 12x12 perk pools? In case you haven't had a chance to look, their tables don't quite follow the same trend as 6x6 tables but they still have a pretty clear tendency towards the middle of the table, i.e., 1:1 perks.  \n\nWhat's unique about 12x12s compared to 6x6 pools though, is that the tables have an almost checkerboard pattern when considering for commonality, that is +1/-1 are rarer than 1:1 but then +2/-2 are more common, and the pattern repeats move away from 1:1.", "label": 0}
{"text": "Sounds cool, I've never played it tho", "label": 0}
{"text": "I have almost 40k kills on my Recluse in it’s heyday and that’s an unhealthy amount. Seek some grass, my brother.", "label": 0}
{"text": "I’m at the point where my vault is so tapped out that I don’t even want to play because every session becomes vault simulator after 1 run of something.", "label": 0}
{"text": "I’d personally like to know *when* the code was changed to make this happen", "label": 0}
{"text": "What  post triggered this investigation?", "label": 0}
{"text": "Well I mean the season practically is empty, especially when they released the entire act 1 in the first week of its launch", "label": 0}
{"text": "It could be the case because that’s a new perk combo, not from OG Prophecy release.", "label": 0}
{"text": "incredible game, highly recommend but also falls into my point of so much loot that it covers your screen so you spend half an hour searching through the garbage xD", "label": 0}
{"text": "People have been farming the dungeon for 7 months now, it's skewing the data, the dragonfly/voltshot is on the rare side of the bug, not super rare, like EA/BnS but still rare. Anecdotally, I farmed for few hours, a couple of times, the season the weapon came back and only got 2 of that roll.", "label": 0}
{"text": "You don't really light attack with glacial so that's kind of irrelevant.   \n\nYou also can't one shot solo champs syntho due to not meeting the requirement for the buff.   ", "label": 0}
{"text": "The people saying that are too far gone to be put to rest by anything, sadly. We had people saying pretty shitty things to that former bungie dev who first talked about the lack of an intentional perk weighting system. And that's someone who had zero reasons to cover for bungie since she got laid off because of bungie leadership's poor decision making.", "label": 0}
{"text": "I've looked at it and found mostly nothing before Lightfall. Pure Poetry is the only one I've seen that was affected.", "label": 0}
{"text": "Surely if people wanted the title they would've got it by now. Raid's over 5 years old", "label": 0}
{"text": "Might mean Monument to Lost Light not the New Light quest (I could be wrong)", "label": 0}
{"text": "See, the funny thing about how RNG works is *you don't get guarantees*. \n\nI've gotten that roll at least 12 times. \n\nBungie's not full of crap, you just aren't convinced your Spotify playlist is actually being shuffled, so you're expecting them to fake shuffle for you instead.", "label": 0}
{"text": "Huh? It’s super apparent on the veist ones and hard truths- it just so happens that they are 7 columns and the dead zones aren’t 3 away but instead 1 and 2 away", "label": 0}
{"text": "It will never put everyone’s mind at rest. Just the fact that it continuously happens, some people will not believe it wasn’t intentional in the first place.", "label": 0}
{"text": "I assumed the taunt mechanic was busted as I've noticed no difference in enemy behaviour at all.", "label": 0}
{"text": "I'm just waiting to see if something enticing is in the act 2 artifact. Current offerings are underwhelming\n\n\nI've heard (unsubstantiated) rumors that slice/sever actually reduces the damage of the arc anomaly. Anyone got insight on that? Not that that would be plan A.. or B during a solo flawless run", "label": 0}
{"text": "Please fix the game", "label": 0}
{"text": "If it increases pool size, it's so small that most science people missed it.\n\nPersonally, I think it's more similar to how blast radius worked on wave frames initially. Where it increased the initial explosion size, but no effect on the actual important projectile size. Will wait for testing before confirming this though.", "label": 0}
{"text": "I know the community can be pretty shitty at times, but I don't think the communication was hasty at all. I'm glad we got *something*, and if anything, even more context would have been even more appreciated.", "label": 0}
{"text": "Is Collision faster than Survival? With Survival, you don't even need to move. You spawn in, and it's instant win. Haven't tried it with the Xenology quest yet though.", "label": 0}
{"text": "It's not even a simulation they'd have to run though. They have the data already (clearly, because so do we lol and it stands to reason they have more on the backend)\n\n\nIdk about everyone else but this entire scenario has made me extremely jaded. It just feels like Bungie *really* does not respect the players or their time for this to have gone under the radar, have it pointed out, and then double down without actually doing any due diligence beyond \"we checked the code you're wrong\". This couldn't have come at a worse time too with the whole crafting controversy which is at the top of the sub every day (I'm firmly pro crafting fwiw)", "label": 0}
{"text": "Full internet. ", "label": 0}
{"text": "No you get tractor cannon as a reward from one of the first new light quests now. Shaw just gives you a key and inside the chest 10ft away is trusty ol tractor cannon", "label": 0}
{"text": "What a stupid point of view to have.", "label": 0}
{"text": "We had this great intro to an old enemy and then BAM!! Nothing. wtf?", "label": 0}
{"text": "They solved that with Curse of Osiris. All weapons have 1 static roll.", "label": 0}
{"text": "They're gonna rip off the monster mask to find telesto.", "label": 0}
{"text": "This drama (I wouldn’t really call it drama but it’s the best word) has been so fascinating", "label": 0}
{"text": "I think you’re right about the conversion to special weapons, but I would still appreciate more specials in the heavy section occasionally.\n\nGive me a tube GL that bounces around like mad Maggie’s ult in apex- every bounce does AOE concuss/blind and big damage\n\nMore exotic heavy snipers (Darci needs help first)\n\nWe just got microcosm", "label": 0}
{"text": "I assume with the gear refresh a lot of people who hadn't bothered yet or maybe started playing after it was relevant are finally giving it a chance", "label": 0}
{"text": "> but here is a peak at one potent combo\n\nThat's not how you spell peek!", "label": 0}
{"text": "No, it’s me not having even played final shape yet and saw a article about frontiers but could not find roadmap for end of year 2024-2025 until I posted this", "label": 0}
{"text": "I was sold the moment I managed to pull an Ogre beam onto me during Wave 49 of Vanguard Onslaught and walk safely into a capture zone alongside a Warlock who then shotgunned the Ogre to death without it even trying to stomp him.", "label": 0}
{"text": "Yeah, we definitely need to give props to the people actually making the game. The C-suite is another issue.", "label": 0}
{"text": "Didn’t know everyone in the future who hasn’t played the game yet already got it done 5 years ago👍🏼", "label": 0}
{"text": "Don’t feel the barricade effect. Love lances now, unbreakable is still very meh. I rather use lash and i don’t use lash.", "label": 0}
{"text": "Did they fix the softlock in the Cayde memory quest?", "label": 0}
{"text": "ELI5: Why is this harder than just picking a random option from the available perk possibilities for each gun when it drops?", "label": 0}
{"text": "The only way Bungie is going to change the trend is by getting new players. The New Light experience is comically subpar. There’s no way, in game, for new players to get up to speed on the game’s lore in a way that is any kind of coherent. It’s embarrassing, frankly.", "label": 0}
{"text": "My issue with the seasonal version of onslaught is the maps, none feel as good as midtown was. They feel more like Vostok which was fine for a few runs but made me bored quickly... I won't even mention the 3rd maps name.\n\nKell's grave is probably my favorite of the 3 and even then I struggle to stay focused for the full 50 waves. Midtown was great because all the spawns were eventually funneled the same direction which led to quick waves, with kell's grave it's close but the terrain and the spawns are just not quite there.", "label": 0}
{"text": "Probably", "label": 0}
{"text": "All excellent changes. The worst part of Unbreakable in the past was losing all your value because enemies suddenly decided to stop shooting at you. Now, between the taunt, duration extension on taking damage, and orb generation, it’s a fun tool with great team support for revives, objectives, or super spam. I don’t even bother with the offensive blast, it’s far better to cancel it with a sprint and spam the shield with more uptime. \n\nBarricade taunt was definitely helpful in the contest dungeon for drawing boss aggro away from Scanner/Operator teammates. The barricade health changes are also very noticeable in high end content, it lasts WAY longer now. The taunt is definitely a double edged sword in certain scenarios where you’re trying to hunker down and regain health and it causes you to catch a stray grenade, but overall it’s very worthwhile.", "label": 0}
{"text": "Oh we got lots of good updates. Sad the new exotic boots were terrible but icefall more than mad up for it. Hope the cuirass changes stick too", "label": 0}
{"text": "Just to be clear I'm not against it at all but I want a heavy side arm first :p it's the only legendary special type without an exotic heavy.", "label": 0}
{"text": "I've been running around with Icefall Mantle so much that I haven't even used the actual barricade", "label": 0}
{"text": "What I need is a tangible objective.\n\nFor me it was craftable weapons. I would craft each gun to \"unlock\" it and get every possible roll on it forever. It was an easy and achievable milestone that felt good to complete.\n\nNow what is there to get? Killing the same weak enemies in the same PvP map to get random perks from random average guns?\nNo thanks.", "label": 0}
{"text": "It's like the sheild run at the end of TFS. I feel cool every time it works.", "label": 0}
{"text": "That’s the negative with the way episodes are set up and a problematic glimpse at the future of the game. Focus on “replayable” activities that will inevitably get boring very quickly. The game isn’t meant to log on regularly anymore and that’s ok, but they’ll lose players and interest that way. Without story content, no reason to log in and play onslaught weekly once you get your guns unless you really like that mode. With the activities datamined for the next two acts, we’ll get a week or two of fun playtime and then downtime until the next.", "label": 0}
{"text": "What you described would suggest that the multiplier for those 12x12 examples is either 2 or 10 then, but I haven't looked at those ones in detail.", "label": 0}
{"text": "It is maddeningly annoying. I finally went and made a prismatic build I was satisfied with. Had this whole plan made for easily taking out groups of enemies, then when I tried tossing the grenade at them, it just bounced past every single one of them and blew up somewhere far away from anyone. T-T", "label": 0}
{"text": "100% miss grinding seasonal red borders. It feels like you “own” those guns.", "label": 0}
{"text": "yeah but it's fine, I have other pieces of Artifice armor that can push me into triple 100s.", "label": 0}
{"text": "I mean, that’s pretty normal though for a live service game. New expansion comes out, huge spike in players returning, followed by decrease in players as they beat the expansion and move back to other games, followed by increase when new season comes out, and so on and so forth. \n\nI feel like destinys increases and decreases aren’t any worse than other live service games, but this sub would have you think the game is 90 days from insolvency", "label": 0}
{"text": "Unbreakable eating the full charge when you do the blast even if you just held the shield for a second unlike before feels awful, and the trickle of overshield gain also feels terrible.", "label": 0}
{"text": "Fr, I knew Hunters made up like half of the population but like, damn.", "label": 0}
{"text": "It makes perfect sense, because it’s the best people have the most tolerance for bad RNG\n\nFor mid content loot has to be generous or no one will play it ", "label": 0}
{"text": "When it's just the boss and you need to operator the panels I have no problems. The back wall has a few boxes that crouching behind blocks LOS and the radiation clones can't pathfind. \n\nThe problem is when I'm scanning. When the nuke carriers come in and you need to scan them, there isn't anywhere in red room that blocks LOS to more than 1 of the clones and you've got the 30 second timer before the wipe. \n\nIn blue the giant pillar in the middle blocks the boss and the clones, and the catwalks are also placed better to block the other clones too. Red room doesn't have that luxury.", "label": 0}
{"text": "I’m kind of new to the game. Outside of buying those on my titan since it’s good rolls, could I also buy the strange armor engrams to potentially get good gear on my warlock?", "label": 0}
{"text": "been farming love and death gl for a while now. after 50+ tries its crystal clear that getting spike nades ah and full court is 100% impossible. so yeah they should revisit those weapons and make em craftable cuz farming them is fucking unbearable.", "label": 0}
{"text": "What is blinting….?", "label": 0}
{"text": "Holy shit this is amazing news, I don't have a mic right now so DD was always off the table. I haven't even started this season yet but I'll be playing the hell out of FotL.", "label": 0}
{"text": "It’s has nothing to do with social anxiety.", "label": 0}
{"text": "Hey guys I have a friend that can’t get dual destiny mission he’s also has all dlc is the witches won’t spawn for him he also completed the campaign", "label": 0}
{"text": "Yeah. The unfortunate result of turning this game into a grind so as to boost their “concurrent player count”, however IF you enjoy playing each class, then you can effectively farm copious amounts of exotic engrams per class and boost your progress towards completion.", "label": 0}
{"text": "You don't have to pay a single thing to level up Rahool; literally just open engrams (prime or exotic) on the first page that pops up.", "label": 0}
{"text": "Love how we get these janky experiments that make matchmaking even worse than it already is instead of actually fixing the issues with the mode", "label": 0}
{"text": "Aside from queue times I think bungie should leave trials out of the cute experimental shit. Anyways the weapon this week is meh, map is eh, and I couldn't pick up the flawless shader because it's bugged rn. Joke of a company.", "label": 0}
{"text": "Are lost sectors not dropping weapons anymore? I've done 8 master quarries today with zero drops. Like yeah, RNG. But I never saw exotics more than weapons before, genuinely curious wtf is going on. ", "label": 0}
{"text": "Lol what", "label": 0}
{"text": "Ah, that makes sense.", "label": 0}
{"text": "I’ve been wondering why hunter transcendence feels so bad. If this is gonna be a change hail fire spike needs large damage buffs because right now it barely ticked bosses.", "label": 0}
{"text": "> it's a single purchase so you can only pick it on one character\n\nSONOVA\n\nI had no idea, but guess it saves me the hassle of farming up more coins", "label": 0}
{"text": "Labs should be disabled from how atrocious the queue times are right now. 15+ minutes to get into a game.", "label": 0}
{"text": "i am NOT farming onslaught. they should add an exchange for enriching flake or smth\n\n  \nbetween touching grass and doing dungeons and raids, I simply have no time to feed 1 hour into the gacha machine only to lose because i got apes for teammates", "label": 0}
{"text": "from the 10/3/23 TWID:\n\n  \n\"We have some great changes upcoming including significant upgrades to Glaives, A PARTICULARLY UNDERUTILIZED Heavy-ammo Sniper, and even Aggressive frame Fusion Rifles.\"", "label": 0}
{"text": "intellect is shit, mobility is shit, most hunters don’t even go for mobility anymore there’s so many ways to get class ability back, look for recovery and resilience as they will help keep you alive, after that look for either strength or discipline whatever you prioritize, most warlocks and hunters opt for discipline with titans going for strength for there class ability, warlocks are lucky because there class ability works through recovery which is always prioritized anyway", "label": 0}
{"text": "Are you trying to say they don’t make player friendly QoL improvements though?", "label": 0}
{"text": "If losing 75% of your playerbase 3 months after the latest big content drop and you are a live service is not a bad sign I do not know what is ESPECIALLY when they are doing nothing to pull in a new audience and the future isnt as bright as it once was. For comparison, Warframe has been beating it the last few months and they really havent had ANY new content with the equivalent of their big content drop coming later this year and also completely f2p. Further, if Destiny 2 was truly in a healthy spot, would Bungie have shed a third or more of their staff in the last year and start to be slowly absorbed into Sony?", "label": 0}
{"text": "Skibidi Matchmaking", "label": 0}
{"text": "You and wveey otger person here vomplaining about time limits need go look up where the vrystals throughput the mission are, youll get 5 extra minutes and guys its really not a hard timer. I run 3 a week with clanmates/lfg and finish with usually more than 15 or 20 minutes left over, not tryna be rude but your build suxx if your struggling, it aint a legendary campaign. Aint even close.", "label": 0}
{"text": "it's showing up as 64 in DIM..?", "label": 0}
{"text": "I recently cleaned my vault up a bit. Just did a zone-out clear of any weapons that didn’t have origin traits. I’m sure I deleted some god rolls, but the reality is I only use maybe 30 weapons during any given season, and I tend to seek out crafted weapons anyways. So these old weapons just don’t ever get used by me. ", "label": 0}
{"text": "You can’t enhance craft-able weapons", "label": 0}
{"text": "Oh yeah that’s for sure true. Red room is more dangerous when it comes to scanning. I had to burn my super a couple times just to stay alive.\n\nAnd on top of that I always felt like I got the worst scanner luck in the red room🫠", "label": 0}
{"text": "I had that happen earlier this week and you're right it's an extremely shitty feeling. It literally kills my desire to keep playing. I'll say it once more, Bungie needs to allow us to choose a reward from the loot table after each encounter. That alone would make the grind bearable, with also having our time respected. What we're doing now and have been doing is shooting in the dark. Eventually you get tired of doing that and it's no longer acceptable these days.", "label": 0}
{"text": "Last boss fight for Malfeasance is literally Yusuke vs Toguro", "label": 0}
{"text": "How do I get It? Cant find It on the submenus. ", "label": 0}
{"text": "Oh yea i agree it, this should only apply yo the overt \"STUNS UNSTOPABLE\" guns but alas i dont work at bungie.", "label": 0}
{"text": "Using one weapon to get someone low (traditionally a low rpm, high damage weapon like a bow or GL), and swapping to a second weapon to finish them off.\n\nIt’s not that common these days since the tactic has been nerfed several times in different ways. Which is fair, because it’s very oppressive and usually doesn’t use special ammo. \n\nCold denial is strong in this case, since the archetype zoom pairing allows it to be used as both a long range dueling tool ad well as a close range cleanup weapon.", "label": 0}
{"text": "Where are you seeing a 75% drop in player base? Even the link you provided, which just accounts for Steam players, reaches a peak dropoff of 75%. \n\nAnd where are you getting Warframe is beating destiny out in playerbase? And even if it is, it’s because Warframe is F2P, not necessarily because it’s a better game. I’ve put hundreds of hours into each game, but I would say destiny beats Warframe out as a whole pretty easily.", "label": 0}
{"text": "Id unistall and reinstall if i were you. Sounds like a bug on your side as ive never ran into anyone else with thag issue", "label": 0}
{"text": "Well. All righty then.", "label": 0}
{"text": "That was one of my first ones, but I never got the ALH+Vorpal combo I wanted (I always seem to whiff ny recombination shot, but magically only when it's over 3 stacks). I got the auto/vorpal perk combo ONCE but it was on a copy where my only 2 option for barrels were Volatile and Confined, and column 2 was Sticky and High-velocity, and the MW was a blast radius.\n\nCrafting will never not be the better system", "label": 0}
{"text": "IT WAS REAL!", "label": 0}
{"text": "Really hope we get a post-mortem on this one, would be very interested in hearing about the details.", "label": 0}
{"text": "This game as a whole is buggy, after tfs dropped its been bug after bug after bug. They laid off most of the staff that was responsible for fixing those bugs. (Like rn ALL bosses have stackijg resist to ignitions while Only Raneiks was supposed to get it, and its not grtting fixed till mid november)", "label": 0}
{"text": "How long has this bug been active for? Need a dive on this", "label": 0}
{"text": "Thank god our community is full of nerds, otherwise this never would have been found. \n\nI love y'all smart mfs for real", "label": 0}
{"text": "That doesn't answer my question lol.", "label": 0}
{"text": "I really think it has always been a part of the game.", "label": 0}
{"text": "Good work on this task bungie, also community to find this bug.", "label": 0}
{"text": "A funny, \"Survived #WeightGate\" emblem would be awesome!", "label": 0}
{"text": "For my fellow ME2 fans, the [Vanguard Angelos](https://www.light.gg/db/items/2058800853/vanguard-angelos/) shader does a pretty good job of getting close to the [Cerberus Normandy](https://imgur.com/a/1KkEKlv) look.", "label": 0}
{"text": "Ive ran close to 20 new lights through it. Almost none knew tge symbols, just describe them. And take like a mimute or 2 explaoning hoe to read the 9 pyramid vlock b4 starting and then again witht the \"final envounter\"\n\nYouve just had bad sherpas", "label": 0}
{"text": "Oh yeah, they 1000% don't test what they put out, and that's game wide, not just dungeons. Ignitions being bugged, the new dungeon being an abysmal experience for solo players because of bugs, drop rates for weapons being bugged. The new hunter exotic being bugged. It's always something. \n\nYou have that, and then you have the \"we can fix exploits that benefit the player, but it'll take 3 - 4 weeks, if not longer, to fix things that hinder the players\". They were super quick with that bomb dupe exploit, yet all the progress impeding bugs like being soft locked and things just not spawning have yet to be quick fixed. Bungie does this way too often for it to be a coincidence.", "label": 0}
{"text": "I've been hooked on the Crytarachne(sp? lol) helm for a while now, grants woven mail on grapple. I use the two grenade aspect and the bey blade and just spiderman around and throw tangles as much as possible.\n\n Fragments i think are the orbs give woven mail, dealing damage gives grenade energy, damage with a tangle gives melee energy and i can't remember the fourth off the top of my head. \n\ndefinitely not meta whatsoever but i think its a fun play style with lots of DR from almost constant uptime of woven mail and high grapple and melee uptime.", "label": 0}
{"text": "other than bashing my face against trials for adepts and rolling engrams for god roll cataphracts, I don't think I was really impacted by this? Likely helped on other weapons? Wild times - gg to the data scientists and conspiracy theoriests who got this thing moving.", "label": 0}
{"text": "I was willing to believe that just the HGL was getting unlucky. But when people were getting the numbers for other weapons and it was a consistent pattern throughout, I was confident that it was a real issue.\n\nHowever, I never believed that Bungie did it on purpose.", "label": 0}
{"text": "Suffered my way to the lighthouse, and the new shader can't even be picked up. Doesn't go to postmaster either. Great", "label": 0}
{"text": "We did it Reddit!", "label": 0}
{"text": ">Our team has quickly identified a potential solution to the issue, and we are rapidly working to validate the fix.\n\nholy shit, I'm happy to be proven wrong. I thought this would be a super tough fix", "label": 0}
{"text": "Yeah you could buy the legendary gear on all three characters if you want. The only exception is artifice armor which can only be bought once.", "label": 0}
{"text": "I was here for #WeightGate.", "label": 0}
{"text": "I don't think so. Imo, if each armour set will have a unique bonus for using multiple pieces from the same set, then all armour should be dropping with comparable stats.", "label": 0}
{"text": "THE PERK WEIGHTING IS REAAAAAAAAAAAAAL", "label": 0}
{"text": "The only place tonics are great in so far are farming dungeon checkpoints. You get one every time you complete an encounter which wasn’t the case in previous seasons. You may have gotten a seasonal engram but it wasn’t guaranteed as far as I know.", "label": 0}
{"text": "In my last 4 runs of warlords ruin I have not gotten a *single* weapon to drop from any of the encounters :)", "label": 0}
{"text": "Right", "label": 0}
{"text": "I love that the collective SPITE of the community is the main reason this probably multi-year bug was finally discovered", "label": 0}
{"text": "I don't know if it's changed but if you have access to last Episode, the armour from failsafe was dropping with good stats", "label": 0}
{"text": "Gamers will optimize the fun out of a game. But at the same time, they’ll go through hell to find out why they can’t get what they want.", "label": 0}
{"text": "It better be as quick as the dupe fix", "label": 0}
{"text": "And today Eido wants an void tonic for exchange, and this tonic cannot be made too.", "label": 0}
{"text": "They should use this one    \nhttps://x.com/destiny_thememe/status/1849540760342839672", "label": 0}
{"text": "Nah the god roll is 1/36 which isn’t THAT rare so when thousands of people are farming the gun, it should balance out pretty quickly", "label": 0}
{"text": "Thank you for the quick communication regarding the situation. I think that there should be some sort of compensation to this, since not only has this been going on for years, but many of us farmed for chill inhibitor for dozens of hours. This would also build back up good faith and trust in the community again.", "label": 0}
{"text": "How is Spiderman supposed to be scared of the Green Goblin if he fought Thanos?", "label": 0}
{"text": "I'm glad that the development of this situation has been mostly productive. I admit, I was skeptical early on that anything was the matter.\n\nBut, ultimately, the issue is getting identified and corrected and that's the best possible outcome.\n\nCrazy that it took exactly Chill Inhibitor to bring it to light.", "label": 0}
{"text": "The evil is defeated.", "label": 0}
{"text": "That Cold Denial is cracked wtf", "label": 0}
{"text": "Damn fast response, nice work devs, hope we get a deep dive into the issue and learn how long it's been going on. Would be interesting to read.", "label": 0}
{"text": "I want a emblem!", "label": 0}
{"text": "\nhttps://x.com/Destiny2Team/status/1849890047132303837\n> Re: \"Can we get a deeper breakdown of the issue?\"\n\n> We'd love to. For right now, we're focusing on fixing up the issue and getting it out to you. After, we'll be sitting down with the team to discuss all the nitty-gritty details.", "label": 0}
{"text": "Rumor has it; since the final shape \n\nCouldn't have been to long because even with crafting someone would have noticed it", "label": 0}
{"text": "Could this same issue be affecting exotic class items?", "label": 0}
{"text": "It would appear so but unfortunately for you rng is on my side heretic!", "label": 0}
{"text": "This means I can finally get that Luck in the Chamber, Final Round roll om Effirdeet's Spear, right?", "label": 0}
{"text": "What would you like for compensation?", "label": 0}
{"text": "so we grinded and was getting hosed the whole time.... for how long?", "label": 0}
{"text": "No one lied, Bungie isn't the devil, out to destroy your fun in the game.", "label": 0}
{"text": "Happy to see this confirmed, and love the quick message. I will await the fix, and genuinely hope we see a deep dive on what happened since I found the numbers behind it interesting.", "label": 0}
{"text": "It is crashing the game", "label": 0}
{"text": "Cheers! Glad it’s piqued some interest!", "label": 0}
{"text": "It was certainly weird that it wasn't in the Top 8, but that wasn't enough to say whether it was a Destiny issue, or a Light.gg issue. The person using 13 people specifically not getting it as their basis for the stats didn't understand how to work with biased data.\n\nOnce others started looking at all actual perk combinations that were dropping rather than just the one combination, the picture became quite clear.", "label": 0}
{"text": "Doesn't look at the new gear, complains new gear is bad. Typical DTG memeber.", "label": 0}
{"text": "Dm sent", "label": 0}
{"text": "So it is indeed a bug and not the intended behavior. \n\n  \nLooking forward to the write up, thanks for taking the feedback seriously despite the...well less than desirable reactions by the community.", "label": 0}
{"text": "It's very likely it has been much longer than TFS. There's many reasons why it wouldn't have been discovered before now, which has extensively been covered. However, what can be said is that this issue was big and I'm glad it's getting sorted. So even if it has been in the game since forever, at least it's getting remedied now.", "label": 0}
{"text": "\\> In some cases, desirable perk combinations are a bit easier to earn as well.\n\n  \nmonkey paw curls", "label": 0}
{"text": "Yes this has been an infuriating error since season of the revenant. I get kicked from Overthrow basically every time I try to do it, and Excision as well.", "label": 0}
{"text": "BuT tHe ChAse!!11??111iil!!!", "label": 0}
{"text": "Don’t care what people say, but with is insanely good communication by bungie on the issue. W bungie", "label": 0}
{"text": "Actually, it's looking to be even further back than that. It's harder to scrape data from the api from back then, but there's evidence that this could be going back to even beyond light or forsaken lol.\n\nWe'll never really know until Bungie lets us know though.", "label": 0}
{"text": "Red minigame mode?", "label": 0}
{"text": "Realistically forever, or as long as random rolls have been a thing.", "label": 0}
{"text": "And Truthteller to help prove it", "label": 0}
{"text": "Me when more than 1 perk exists in the game.\n\n**Each perk** is able to be rolled just fine. \n\n**Combining one perk with another perk** is the broken part. \n\nOut of 10000000 drops, with 6 perks in each column, every 1/6th drop will have Bait and Switch. \n\nAnd out of 10000000 drops, with 6 perks in each column, every 1/6th drop will have Envious Arsenal. \n\nIt is how many drops will have _both_ Envious _and_ Bait that is the broken part.", "label": 0}
{"text": "Your comment has been removed for the following reason(s):\r\n\r\n\r\n* Rule 1 - Keep it civil. \r\n\r\n\r\n\r\n\r\n---\r\n\r\nFor more information, see [our detailed rules page.](http://www.reddit.com/r/destinythegame/wiki/rules)", "label": 0}
{"text": "in software development there's a lot of incredible stupid stuff that just slips until it's an issue and aren't caught in review because it all looks sane. It may have been something silly like.  \n\ndrop.perk1 = generatePerk(seed1);  \ndrop.perk2 = generatePerk(seed1);  \n\nwhere oopsiedoodles a line got pasted and only the first part was changed. And any developer that says they have never done this is a liar. I mean we're all liars. We're also thieves.", "label": 0}
{"text": "I wonder how much good this actually helped us vs this one time that the perk roll was meta that was rare.  Need to take advantage of the good chances while we still got it!", "label": 0}
{"text": "They've been claiming there's no weighting, but there's no legitimate reason the choice for perk column 2 should be affected by the choice of perk column 1.\n\n  \nThe \"algorithm\" should be:\n\nperk-column-1 = RandomInteger() mod Number-of-Perks-in-column-1\n\nperk-column-2 = RandomInteger() mod Number-of-Perks-in-column-2\n\nHow do you mess this up unless you're doing something fishy by using the value of the other column?", "label": 0}
{"text": "If it did exist pre-TFS, the problem could have been hidden by weapons dropping with multiple perks in a column. The two biggest loot chases leading up to TFS were Pantheon and Brave weapons which could both drop with 2-3 perks in a column, iirc at least.", "label": 0}
{"text": "Good work everyone.", "label": 0}
{"text": "For an even closer parallel, Bitter/Sweet released just a few weeks ago with the same perk combo and the distribution is exactly how you'd expect.", "label": 0}
{"text": "I guess that makes sense then. Hadn’t seen any crashes. They need to figure that out soon dungeon has been for a few weeks now and you still can’t use the best prismatic hunter super", "label": 0}
{"text": "Got stats on that claim? \n\nWhy should the pro-crafters who actually use their guns be punished because gamblers wanna gamble?", "label": 0}
{"text": "Thought there wasn’t a new shader? Is there one dropping now?", "label": 0}
{"text": "Like Sisyphus Specific_Display_366 struggled in vain against the cruel indifference of rng.", "label": 0}
{"text": "Well well... https://www.reddit.com/r/DestinyTheGame/s/DAFDTmaUL5", "label": 0}
{"text": "It’s only been noticed now since it happened to a desirable roll, so chances are you haven’t been hosed on desirable rolls.", "label": 0}
{"text": "So in other words, they'll optimize the fun *out* of the game or *into* it, but by RNGesus the game *will* be optimized.", "label": 0}
{"text": "Crucible Node in the director is red.", "label": 0}
{"text": "The 93 Chill Inhibitors in my vault are shaking right now, their data is no longer keeping them from being deleted.", "label": 0}
{"text": "Play the game challenege: impossible", "label": 0}
{"text": "The RNG. The RNG for perk combos. The RNG weighting some perk combos higher than others.\n\nThat RNG?", "label": 0}
{"text": "Yeah I think I'm just winding down and thinking the final shape was it. That's the end of the story. Trying to introduce Maya as a serious villain after we just killed the god that's eradicated civilizations for millions of years? Nah.\n\n\n You're completely right, let us go explore places and do cool shit. Trying to be all serious about these lame villains is just weak.", "label": 0}
{"text": "Wdym the shader is bugged? I thought there just wasn’t one this season", "label": 0}
{"text": "They did.", "label": 0}
{"text": "Can you though?  Last time I picked up the warlock piece first then went to pick up the other 2 and it said \"already purchased this week\".", "label": 0}
{"text": "Statistically the RNG issue will also have made many god rolls easier to get.\n\nI think it's actually really impressive that Bungie took the community seriously, analysed the community sourced data, ran their own internal tests, identified the issue and come up with a fix - all in the course of 5 days.", "label": 0}
{"text": "A different way that you could do without ever interacting with crafting\n\nNow you only have RNG.", "label": 0}
{"text": "https://www.reddit.com/r/DestinyTheGame/s/BKuCVQdQrc", "label": 0}
{"text": "Jesus Christ Bungie, please revert Trials back to the normal mode. Trials is already at the last breath. Long loading times will even make the hardened core leave and do something else.", "label": 0}
{"text": "I am not sure I get your question as you are acknowledging that the site I posted also shows the 75% drop I claimed. And again, in the earlier comment where I posted the link I said that while one cant know for sure if consoles follow the same, but one can reasonably infer that if the pc base is collapsing, console is also running into problems. \n\nAs for Warframe, that same site shows Warframe having a higher player count in the last few months than Destiny 2. I dont think I was sitting here saying its a better game or not, just that its a f2p game in the same space and had/has a higher player count. Unlike Destiny 2, it hasnt had a major paid expansion 3 months back or new recent paid content (season or dungeon, take your pick) and its next bit of actual big content isnt coming for a few months. \n\nI am saying that things are certainly not going swimmingly for Destiny 2 especially compared to pre-Lightfall. Even the stuff for the next year hasnt been getting hype machine going. And I certainly do not think this weightgate thing is going to really help sentiment.", "label": 0}
{"text": "Actually, per the FAQ from Light.gg:  \n[https://www.light.gg/god-roll/popular/trait-combos/faq/](https://www.light.gg/god-roll/popular/trait-combos/faq/)\n\nThey see the pattern as far back as Lightfall and *possibly* further than that, but it gets harder to tell because of how the tool (and API) works.", "label": 0}
{"text": "Rahul sucked up all my saved golf balls but since we get double nf rewards next week I'm not too worried", "label": 0}
{"text": "Are you guys getting trials engrams to drop ?", "label": 0}
{"text": "Classic. I honestly don’t even think I saw any solution mentioned for the future.\n\nBut the rework to armor and this whole less crafting gives us a bonus “vault management” sim to increase playtime!", "label": 0}
{"text": "No Xurf board?", "label": 0}
{"text": "I’ll take one of Pete’s cars", "label": 0}
{"text": "There have been plenty of guns who have benefited from this, this wasn’t intentional, unless they were intentionally giving us good rolls too. \n\nAlso if they wanted to weigh perks, there are much smarter and sneakier ways to go about it than a way the community can figure it out in three days", "label": 0}
{"text": "It's Perfect", "label": 0}
{"text": "And now he apparently doesn't even need a corpse for that, with the Echo.", "label": 0}
{"text": "I think this is one of the larger issues with the story for a lot of people. For as much of this **video** game we play, we barely get to *see* anything that happens. It's understandable that there probably isn't time to make a cutscene for every couple missions that shows what the villain is up to (like Red War and Forsaken had) but we need more than 60 seconds of overall screentime for our big bad", "label": 0}
{"text": "That random value needs to pull from somewhere (likely an array) to get the perk. Since a lot of the perk combos are offset values in the perk array (described by light.gg's analysis) then it seems like it's rolling the first column, then incrementing the integer for the second column instead of rolling the second column. Or if it is rolling the second column, it's favoring the first result+1 as the second. Could be some kind of error prevention that's causing the increment, or it could be a default state overriding something.\n\nWithout actually analyzing their code, there's no way to know what is causing it until they tell us.", "label": 0}
{"text": "I have been proven wrong and I will live with the shame for the rest of my life", "label": 0}
{"text": "Yeah no crafting has had me engage less with this season. \n\nCombined with no weekly story, a useless power grind, and no \"new\" activity, it's like they are begging me not to play.", "label": 0}
{"text": "Would LOVE for an in depth analysis on the issue, like with those error codes last time.", "label": 0}
{"text": "Make this set of dungeon weapons craftable.", "label": 0}
{"text": "Nah, if you look at the light.gg catalog, you can see traces of it appearing all the way back to forsaken it just so happened this was the first time it was on such a widly farmed weapon with such a far distribution.", "label": 0}
{"text": "On warlock and have timed out repeatedly since before 2pm CST", "label": 0}
{"text": "In before this makes more desirable rolls harder to get overall, with the only appreciable benefit being we can get chill inhibitor's ideal roll more easily.", "label": 0}
{"text": "Great guide. The info helped me discover the last purple Volatile Tonic Recipe I needed. Thanks.", "label": 0}
{"text": ">After investigation, we can confirm an issue has been found in our code where some random perk combinations are harder to earn per legendary weapon perk set.\n\nI'm convinced some of you guys are just obtuse for the sake of it", "label": 0}
{"text": "The earliest weapons we can realistically test are the beyond light weapons as their drops have been untouched since release. But it's also the beyond light farming methods lol...", "label": 0}
{"text": "Good thing everyone worked together and get ‘quick’ fix. Instead going at each other and making war. As much as this bug hurts me, this was nice to see", "label": 0}
{"text": "They tweeted abt a new one this week", "label": 0}
{"text": "Nope, same as last week for me.", "label": 0}
{"text": "> \"Never attribute to malice what can __reliably__ be attributed to incompetence.\"\n\nThat saying is absurd.", "label": 0}
{"text": "The ricochet definitely helps, I exclusively use Khvostov on my Hazardous Propulsion build bc the ricochet count towards rocket build up", "label": 0}
{"text": "If it helps you want it less, I have one, and the last time I used it, I felt like I got baited. Recon sounds amazing for chill clip, but they gimped the rest of the fusion so hard, it doesn't matter.", "label": 0}
{"text": "Focusable dungeon weapons, multiple perks on all guns for a month, anything to reduce rng is fine by me.", "label": 0}
{"text": "Yeah, same here", "label": 0}
{"text": "It'll be at the postmaster, I wouldn't worry", "label": 0}
{"text": "He was saying that he was going to believe that it was just people getting unlucky, and Cruff, the person you were responding to, said that it, said that even if people are generally getting unlucky, the way perks *should* be distributed would make that not a concern", "label": 0}
{"text": "I had that roll with armour piercing rounds xD It was vile.", "label": 0}
{"text": "No fkn way. Holy hell!", "label": 0}
{"text": "this is the way", "label": 0}
{"text": "Surprise surprise", "label": 0}
{"text": "I have this roll, been sitting on my vault for years now. I was using Deliverance and Riptide over it.", "label": 0}
{"text": "titan mains ig", "label": 0}
{"text": "still absolutely insane that this was real. huge shoutout to newo, mossy, the light.gg devs, and everyone else that worked on the analyses that proved this was happening. would love to see a dev article explaining how this happened.", "label": 0}
{"text": "I wonder if optimizing out or in is equally distributed!", "label": 0}
{"text": "Its real, im not crazy! I knew those worms wouldn't lie to me!", "label": 0}
{"text": "possibly, but with attunement added, it's not an issue anymore.", "label": 0}
{"text": "ALL CONSPIRACIES ARE REAL!", "label": 0}
{"text": "How can you talk of indifference when your supposed divine rng seem to be actually deterministic and favors some more than others?", "label": 0}
{"text": "Crafting is a great tool, but it should only be used as a catch up or fill in the slot mechanic. Oh you need a void heavy leg yeah there's one you can craft. There should probably be a craftable weapon for every slot for the average player. Having said that there should never be a best in slot weapon available for crafting. Also crafting raid weapons has completely taken the chase out of the game. So removing end game weapons from crafting, buffing them or doing whatever you need to to differentiate them and make those actual end game best in slot weapons for the players who are spending all their time have something to chase and aren't just clicking check boxes after 5 red border drops.", "label": 0}
{"text": "Hey, good shit. There's hope for you guys yet.", "label": 0}
{"text": "compensation? stop acting so entitled", "label": 0}
{"text": "Stick a Truthteller silhouette overtop of that, it's perfect", "label": 0}
{"text": "Not to be so negative on this as its great its getting a fix, but rumors are that this has been an issue since Forsaken. That means 6 years of people complaining about RNG and perk weighting and Bungie going \"yeah we checked and we dont see anything\" and never once diving below the surface level to see if there was anything else to the complaints. I think that is disappointing. How many people spent hours grinding for combinations made artificially scarce due to this issue? How many people dropped off of the game for that reason? And the cherry on top of removing crafting, the one thing that obfuscated this issue because it was a player friendly work around, to pump up engagement metrics (that reason is speculative but considering the full 30-40m act drops day one, reintroduction of grind for power and weapons is a cheap and easy way for player retention without the weekly story hook).", "label": 0}
{"text": "My brother in Christ please read 😭", "label": 0}
{"text": "It's existed since Forsaken, but you can see on these rolls, none of the deadzone perks (the 6 out of 36 possible rolls) were on \"meta\" picks. No one was going for Field Prep/HIR on an SMG. No one was going for Auto-Loading Holster/Moving Target on an SMG. These were the perk combinations that were being excluded. \n\nThe amount of luck that it took for the community to find this required:\n\n1) A non-craftable\n\n2) Highly sought after\n\n3) Meta archetype gun\n\n4) With a meta perk combination that was \"not obtainable\"\n\n6) On an easily farmable source\n\n7) That had no substitute \n\n8) And could not roll double perks\n\nAnd this kind of data, given that Light.gg cycles and deletes their old player rolls after a set amount of time, could only be definitively seen within the first 2 week window of a season.", "label": 0}
{"text": "I'd have to see the exact statement, as there are a couple ways to read this.\n\nThe first is other acts having their own tonics. This is confirmed by there being materials for the Exotic mission, and the Tomb of the Elders. We've also seen the vender list tonics we can't currently make. There are also obvious missing options, since we don't have every weapon as well. It's also possible they just mean Exotic tonics, though it's less likely.", "label": 0}
{"text": "yup, honestly if it wasn't for the rollback on crafting we wouldn't have been paying attention as closely.", "label": 0}
{"text": "lmao just the fact that you wonder that might make you my kind of people\n\nBecause that's a darn good question and now I'm curious too. Quick, someone do a Masters thesis on this", "label": 0}
{"text": "It honestly makes the most sense - Forsaken added random rolls back, and also had a *massive* crunch, it's entirely likely the system had errors that just went undiscovered for all this time.", "label": 0}
{"text": "Yippee 🥳", "label": 0}
{"text": "They can be weighted equally (as in they all have an equal chance). \n\nThe problem probably lies in how the random is being called consecutively. There are many things you have to take into account when trying to emulate true randomness in computers and they probably just made a mistake that affects their random functions if I had to guess. \n\nThough it doesn't make it any less devastating for such a foundational mechanic to not be functioning correctly and go unnoticed by their QA/internal testing for so long.", "label": 0}
{"text": "I’m not gonna lie, I was a hater before. Personally made fun of people who were saying something was wrong with the code. Guess I was very wrong.", "label": 0}
{"text": "It was a reference to this quote\n\nhttps://henryvincent.uk/2018/09/13/optimising-the-fun-out-of-video-games/", "label": 0}
{"text": "All those poor players who complained about grinding for hours and never getting the roll they were after. Any time any one mentioned weighted weapon rolls, they would just get downvoted and told they had bad RNG and that's just how RNG works. Wow.", "label": 0}
{"text": "Bro, how do people know the chance to get a class item with perk X and perk Y is 1/64? It's literally 1/8 X 1/8. You don't seem very good at math. You're just saying I'm wrong without having any explanations of your own. But I'll give you a free pass considering you don't even know how percentages work.", "label": 0}
{"text": "If people could craft ALL weapons, people would spend less time grinding for \"rare\" these rolls, thus less engagement for destiny 2.\n\nThat live service is all about you putting the maximum of hours into that \"game\", that's how bungie makes money.\n\nThey are not going to willingly reduce player engagement time by allowing you just to craft ALL weapons, and you know all this alreaddy.", "label": 0}
{"text": "The RNG, the RNG to set you all up for failure,  the weighted RNG. RNG poison.", "label": 0}
{"text": "Couldn’t care less if it’s been posted a billion times, it’s an issue and I will provide my feedback along with not playing the game when I’m frustrated (which I already said in my post, guess you didn’t read that far)\n\nYou literally can just keep scrolling, calling ppl out for providing genuine feedback is odd. Either way, hope this stuff gets sorted out because dungeon FARMING is genuinely so unfun right now and I’m sure anyone can agree on that.", "label": 0}
{"text": "The community strikes again", "label": 0}
{"text": "My brother in Christ, I did, and their comments are contradictory and nonsensical. “An issue with perk pool RNG is the culprit…”???? That directly conflicts with the earlier sentence whereby the claim perks are weighted equally.", "label": 0}
{"text": "I have on with Subsistence and Chill Clip. Sounds like it'd be fun, but it feels like it takes a full minute to fire.", "label": 0}
{"text": "This made me giggle way harder than it had any right to", "label": 0}
{"text": "I have one of these! Been my secret weapon for a while since nobody knows about its potential 😆", "label": 0}
{"text": "So, we're gonna get a metric ton of free loot to make up for this bug costing us countless hours of grinding, right?\n\nRight?", "label": 0}
{"text": "Same people that downvoted perk weighting \"conspiracies\" gonna downvote this now", "label": 0}
{"text": "How are you going to run Lost Signal and Rake Angle at the same time?", "label": 0}
{"text": "I’m liking it.l but I have fallen at the gates 2 times already so that’s frustrating.", "label": 0}
{"text": "I hadn’t heard or seen a new one", "label": 0}
{"text": "Hard to lie about something so fundamental without sounding weird", "label": 0}
{"text": "Game Pass for the win.", "label": 0}
{"text": "\\#WEIGHTGATE IS REAL", "label": 0}
{"text": "Prismatic with assassins cowl. Your melee kills turn you invisible, which gives you time to leisurely sit and catch your strand melee which can refund it entirely if you hit enough targets. Strand grapple grenade counts as melee. Fragment to give radiant from melee hits, then whatever else you wanna do with it. \n\n\nIts extremely versatile. Even in harder content. Just weaken a target slightly before throwing strand melee to get full health and invis to reposition yourself and reassess your options. ", "label": 0}
{"text": "I hit lighthouse and i got the shader drop but it's not in my collections bwuh", "label": 0}
{"text": "Reconstruction and chill clip are only one perk apart. The bug is probably increasing your chances.", "label": 0}
{"text": "> In some cases, desirable perk combinations are a bit easier to earn as well. While we inspected our content and confirmed each perk is weighted equally, an issue in perk pool RNG is the culprit here.\n\nI'm convinced some of you guys are just obtuse for the sake of it. Only on this godforsaken sub can the devs say \"Yeah, there's an issue with RNG\" and someone will be like \"nuh uh, bungie weighted against god rolls\"", "label": 0}
{"text": "Honestly if it’s true that this has been a big since forsaken, consider everyone’s luck. There hasn’t been a BIS weapon with a nigh impossible rarity combo. Curated rolls, crafting, multiple god roll combinations. Everything for all these years has been coasting by and it’s only now when the stars align that we find out that the system isn’t truly random.", "label": 0}
{"text": "You can normalize the data to get rid of player efforts of targetting specific perks by dividing a given combo by the row times the column \\[ A1/(SUM(A)\\*SUM(1)) \\]. That allows us to see the pattern in weapons where it's not immediately apparent, but the perks where you can see the pattern all the way back without manipulation are likely because NO ONE cared to target farm them.\n\nYou are 100% right about why no one noticed (as well as long time grinds can be passed off as bad luck), but you can absolutely glean this pattern from old season with less popular weapons. You don't just happen to \"get lucky\" that there's 1 combo for every perk that's non popular in the same diagonals of the proven past 2 week drops that all happen to coincide with unpopular combos.", "label": 0}
{"text": "> Why is giving people a reason and desire to engage with the game a bad thing?\n\nYou're missing the point, these rolls aren't really RNG, like Bungie claimed, they are weighted so Bungie lies and you are basically asking why is it a bad thing if Bungie lied to the players regarding roll probabilities, the problem is the alleged lie, not whether one wants to waste time trying to get a an impossible roll even though Bungie claims it's all RNG, it is not.\n\nThere is no way it is mistake.", "label": 0}
{"text": "Lying through your teeth like you're used to", "label": 0}
{"text": "That was weirdly aggressive for an answer that just required a \"Not yet\".", "label": 0}
{"text": "I remember you’d spawn into trials or whatever and you’d just hear everyone shooting their first sniper shot into the floor and you knew that you were in for trouble", "label": 0}
{"text": "Weighting would *intentional* adjust of the perk's drop chance on specific perks. Bungie is confirming that the source of the issue is not secret weighting but that the random functions they are using are not so random. Let's make a really simple example of this to explain it more clearly?\n\nImagine you are sat down at a table, playing a tabletop RPG. Your DM rolls a d6 to determine the loot a slain monster has in it's bag. The DM has in front of them a little table with 6 options for the monster's bag of loot, they are all equally weighted, there are 6 different options and each appears on the list once each with their own number an escalating value associated with it's number, so a 1 might be pocket lint whereas a 6 might be a magic sword. The DM rolls the die, and unknown to you or the DM, the d6 has a factory defect; there is a void inside it biasing the die to roll 1s. The rewards aren't weighted to produce more pocket lint than magic swords, there is an equal chance on the table of loot for either. But the source of randomness to determine that is not as random as expected. If the DM was weighting the rewards he might have pocket lint appear twice on the list to bias the loot towards it, Bungie is confirming that is not the case, they are instead confirming that their d6 is defective.", "label": 0}
{"text": "Recon is row 3, and chill clip is row 6. Exactly 3 rows away from eachother and landing squarely in the problem area.\n\nhttps://www.light.gg/db/items/963710795/aurvandil-fr6/?p=,,,,,0,0", "label": 0}
{"text": "does everyone in circle jerk hear that? you can stop shitting on everyone from your throne now", "label": 0}
{"text": "Lol", "label": 0}
{"text": "We can wait to hear more but this might just be a technicality \n\nDrop rates are a zero sum game. The drops that should have landed in the dead zone had to be landing on other combos\n\nSo it could just be the missing 1/6 was evenly distributed over the other 30 combinations \n\nInstead of being a 1/36 chance it’s a 1/36+1/180 chance. So by fixing the bug god rolls lose the extra 1/180 - which doesn’t seem that bad", "label": 0}
{"text": "Lowkey I might be making a build for hunter that uses winterbite and the new stasis kinetic slot glaive with Triton vice. Not sure exactly what I would do to make this have subclass synergy but I think it’s a cool concept.", "label": 0}
{"text": "Don't believe the lies.", "label": 0}
{"text": "It does but on prismatic the catalyst is pretty much infinite ammo", "label": 0}
{"text": "I would prefer a destiny-themed Pepe Silvia reference, maybe have Charlie replaced by the cryptarch?", "label": 0}
{"text": "I was getting, for the focused tonics that granted \"Vintage Onslaught Weapons\" (Splicer Weapons) about 8-10 drops for \\~1,500 kills (over an hour, the total time they last). I completed no activities during that time. And, about 50% of the drops were the exact one that was the \"focus\" of that tonic.  \n\nThat's not terrible for a hour, but I am very worried that if you're not in an activity where you can get 1,500 kills then the RNG from 4-5 activity completions will look terrible vs. the RNG for a drop every \\~150-200 kills.", "label": 0}
{"text": "We investigated ourselves and found no ill intention.\n\n\n\n\nAlso, Gary the intern who has been using his D&D treasure table to design the loot system has been laid off.\n\n\nWhile we don't pay interns, Gary had drank water in the building and used toilets, and the yearly average usage was enough for Pete to afford new floor mats in one of his many cars, and we know you'd agree that's a better use of the microtransaction revenue we earn by selling you reskinned versions of deleted content you've already paid us to make.", "label": 0}
{"text": "I recognize the quote having seen it around, but I've never read that article - I'll give it a read, thanks for sharing.", "label": 0}
{"text": "I get it, it’s hard to find players to match with when there aren’t any in the playlist.", "label": 0}
{"text": "It’s a mode modifier called Brawn. Your health is massively increased but does not regenerate. Defeating challenging combatants will recover health for you and nearby allies.", "label": 0}
{"text": "Chill clip is in row two...", "label": 0}
{"text": "Same here! It's crazy how long it has been a thing. Spare rations too. Really makes me wonder xD", "label": 0}
{"text": "Maybe, but just for some anecdotal evidence, after attunement I got the exact rolls for my Titan and Hunter after just a few purchases from Xur.", "label": 0}
{"text": "Crafting isn't the future, that would involve a future where the game is designed around fun , this game is focusing on having you logged in doing the same thing for hours on end and being engaged", "label": 0}
{"text": "Mida if you pvp.", "label": 0}
{"text": "They are investigating. \ndmg wrote:\"Team is digging.\"  \nhttps://x.com/A_dmg04/status/1849890816355131613", "label": 0}
{"text": "The RNG also weighted to give more desired rolls on some weapons.\n\nLet's wait for the actual technical article before we go flinging around accusations.", "label": 0}
{"text": "They said there was no INTNETIONAL perk weighting. This was not intentional.", "label": 0}
{"text": "That would make sense. Handheld black hole that is effectively a grab. It could life steal whatever is being grabbed. It would fit the devour theme.", "label": 0}
{"text": "I rotate between Irukandji and Marsilion-C for my engrams. I've got decent rolls for both but I want a FTTC+Focused Fury Irukandji and an Envious Assassin+Cascade Point Marsilion.\n\nI should start stocking engrams up for when this season's world drops enter the pool though, Veleda-F and Legato have some cracked rolls.", "label": 0}
{"text": "[Seems like the article is happening.](https://twitter.com/Destiny2Team/status/1849890047132303837) Can we have an emblem as well? This feels equally as consequential or more to the Craftening, Laser Tag, etc.\n\nI'm glad the team was able to reproduce and confirm the community's findings. DO NOT HARASS BUNGIE! This was not intentional. Perks were never weighed. It was improper perk distribution.", "label": 0}
{"text": "Probably true, but the help on certain weapons was nowhere near as high as the pain of others. On a gun with two columns of six perks each, the odds of getting a roll with close perk proximity is about 1/25 instead of 1/36. But in the perk deadzones, it is about 1/456.", "label": 0}
{"text": "I have HoiL attuned on my titan and the only HoiL rolls I get are duplicates of what I already have: scars, armamentarium, the barricade one that heals you. I dont think RNG in this game is work at all as expected.", "label": 0}
{"text": "This will be solved by the armor refresh coming. This is just a reflection of the fact the current system has made the armor chase non existant.\n\nIn a properly functioning looter shooter - you should be wanting and needing and be able to improve your loadout with better armor.", "label": 0}
{"text": "> As someone who works in a software company, I can confirm that the amount of times where we get bug reports and our reaction is “why the fuck would it do this? No way in hell” is rather frequent. Then we look into it and find some ancient code that was not designed for some of the new features. So, yeah, I get it. Hopefully, on Bungie’s side, this might be fixable\n\n\n\nwhat error or bug that you found was making you more profit or increased a core metrics to the point that not correcting that error would be better for your company's bottom line than correcting it?", "label": 0}
{"text": "Sorry, should have been more clear, I got the rapid kills in the vanguard playlist. I think I figured it out though, it doesn’t seem to count in Battlegrounds.", "label": 0}
{"text": "there's always your intrinsic exotics. Revision Zero is amazing all around. Arbalest and Wish Ender will both usually 1-shot shields.", "label": 0}
{"text": "Revision Zero, Wish Ender, Arbalest", "label": 0}
{"text": ">*In some cases, desirable perk combinations are a bit easier to earn as well.*\n\nEvery nerf is a buff.  \nEvery buff is a nerf.", "label": 0}
{"text": "It amazes me how they wouldn’t think wait times would be a problem with this Lab", "label": 0}
{"text": "Zen/Headseeker Elsie’s is a 2/5 rare combo and has been the strongest PvP weapon for awhile now. Could just be that people farmed it out so much that it became a common roll. Elsie’s is an outlier to this pattern though", "label": 0}
{"text": ">The main problem is a lot of random number generators are not true-random.\n\nThis gets repeated alllllll the time and it's a total non-issue. RNG issues are almost always the result of how the randomly generated number was used, not the generation itself. Massive amounts of algorithms use clock cycle RNG with no measurable difference from \"true\" RNG. \n\n> and rolls that fall in the middle of the cycle are more likely to occur than the ones on the edge.\n\nThat's not the case, the probability distribution of the perks are uniform. \n\nThe issue is the columns are not independent when they are supposed to be, implying there's an issue with perk selection algorithm, not the random number generation.", "label": 0}
{"text": "as a programmer myself I think it should be a shame if such a simple 2 line logic can be complex for them I am not sure about thier engine code or sphetti that caused this, but simple logic goes like this suppose we have 2 columns with 8 perks in each column, you just need to generate a random num for column 1 (1-8) and similarly for column 2(1-8) suppose the num was 5 for col 1 and 8 for col 2, so just assign the respective 5th and 8th perks from both columns in the drop, no rocket science needed", "label": 0}
{"text": "Oh I want to try that!\n\nI found Wicked Implement to be solid but not necessary. I liked Rimestealer Legendaries more for maintaining frost armor. But if you use Glacial Harvest Wicked Implement is great.\n\nNow melee focused crystal making builds like Mask of Fealty Hunter are juiced with Wicked Implement because it makes a stasis shard whenever you shoot and shatter a stasis crystal with it.", "label": 0}
{"text": "Bungie: no this doesn’t exist, you guys are delusional\n\nAlso bungie when backed into a corner: yea it was just a bug lmao\n\nAnyone falling for this bullshit is apart of the problem. You are statistically more likely to get struck by lightning back to back after you win the lottery than for this to coincidently happen", "label": 0}
{"text": "This problem actually seems to have worked out in our favor much more often than it worked against us.", "label": 0}
{"text": "Is dragonfly Voltshot on the Prosecutor one of these rolls cause I've ran that encounter hundreds of times", "label": 0}
{"text": ">  There is actually a technical reason for this. \n\nYou have no clue even how these pseudo random numbers are generated, unless you look at the code.", "label": 0}
{"text": "When did they lie about this?", "label": 0}
{"text": "Man, this is such a relief\n\nAs someone that spent tons and tons of engrams looking for AO/KT Multimach, it feels good knowing the chase for that and future rolls will be more reasonable\n\nBungie, lock this shit down with robust testing. You can't let it happen again", "label": 0}
{"text": "Well next season i think is about us leaving sol. Or seems to be. Saint and Osiris were just talking about how that was their original plan and now that the ordeal with the Witness is over, they want to do that.\n\nWe just got 1 new exotic per class. And your not supposed to be scared of Fikrul. But hes a threat all the same. But he also weilds a part of the Witness' power. And thats nothing to turn away from. If we and all the other guardian bugger off into the void, Fikrul, or even Maya last season; woukd have enslaved or destroyed Sol.\n\nHumanity always planned to step out into the stars. All those ships in the cosmodrone. Exodus Black. Thats what their intended purpose was. But then the Darkness came and humanity was on the brink of anhilation. We need to rebuild. We have friends from across the stars now in the Cabal and the Eliksni. I have a feeling part of some future dlc or season will be in maintaining the Sol Alliance though. Unless the Cabal are willing to change, theyre a combatitive race who conquer rather than ally with. The Eliksni and Fallen want thwir own place (or Riis back) and are current living on the outskirts of the city (though now its reasonably safe maybe theyll make their own city somewhere). And the Awoken really only joined because Mara knew only together coukd the Darkness be beat. Now that thats all over she may opt to withdraw back to the Reef and return to her more secular ways having only minimal contact with us. Though given Crow us woth the Vanguard now, they have the biggest reason to stick with us.\n\nBut back to your point. Yes there isnt much to be scared of. But that doesnt mean we are safe. And as we k ow from plenty of Guardians. We are not immortal, nor are we all powerful. All of our major feats have ONLY been accomplished because of our allies.\n\nWithout the Awoken we would have been rofl stomped into dust by Oryxs lowliest of princes in the Dreadnought. Plus the Red legion distraction. Without everysingle faction together we woukd NOT have beaten the Witness in Excision. Nor would we have even made it into the pale heart.\n\nThe biggest thing we have to fear now. Is the Dissolution of the alliance.", "label": 0}
{"text": "Whoever approved this one has never tried queueing as a DPS in an mmo", "label": 0}
{"text": "I dont really play anymore, but maybe this makes me comeback", "label": 0}
{"text": "The opposite, it seems, as it appears that the \"dead spots\" could have landed on non-desireable combos. \n\nThis weapon appears to be one of the first exhibiting this behavior in a detrimental way, mostly noticed because it's so sought after.", "label": 0}
{"text": "I knew something was weird when me and a friend got the same exact roll on the same exact weapon from the same chest", "label": 0}
{"text": "Thanks, great info. \n\nFate bringer comes from vault of glass right? I ran that raid so many times in d1 but haven't done it in D2 yet.", "label": 0}
{"text": "Honestly I though perk combos were weighted for the past few years with some being impossible, guess this has been going on for a while", "label": 0}
{"text": "Are crafted weapons generally better?", "label": 0}
{"text": "If they're capable of getting of doing their internal simulations on old builds, it won't be that hard for them to test when it started. \n\nThere's also not a lot of incentive to do so.", "label": 0}
{"text": "And the compensation for the weighting working in your favor, i.e. dead-spotting bad combos?\n\nAlso your demands are way over the top for compensation lmao.", "label": 0}
{"text": "Why don’t we add some kind of feature so if we collect let’s say 5 of the same weapon that has some kind of special property, we can craft the weapon ourselves as RNG protection", "label": 0}
{"text": "I wish they were more aggressive with afk players like Overwatch is. That is the one that I struggle to not get tilted about. It’s so obnoxious seeing one of your allies sitting in spawn every other round.", "label": 0}
{"text": "More engagement profits Bungie. There is a conflict of interest here that is to big to be able to claim that it's just \"a bug\".", "label": 0}
{"text": "We're sorry we got caught...making bad combos less likely as well?\n\nPeople only noticed because the demand for the weapon/the bug lining up with the perk locations.", "label": 0}
{"text": "This perk RNG weighting has been statically around since Forsaken and the Edge Transit days.", "label": 0}
{"text": "This played out exactly like it did with Asheron's Call over 20 years ago.\n\nThe community believed there was something wrong - they called it the \"Wi Flag\". Developers insisted that there was nothing wrong. Until they finally looked deeper into their code and found the bug.\n\nhttps://asheron.fandom.com/wiki/Wi_Flag", "label": 0}
{"text": "imagine...   \n\n\n\n\n\n…just try and wrap your mind around *thinking* any of this was on purpose.", "label": 0}
{"text": "I doubted at first, felt like some people were just frustrated with the RNG. Definitely was wrong. \n\nHuge community W and massive props to all those that put in the time and effort that went into the collection and analysis of the data. Glad Bungie acted quickly and is owning up to the bug as well.", "label": 0}
{"text": "Elsie can drop with double perks. And the API will only show you the perks that are active on a weapon in those cases.", "label": 0}
{"text": "I was gonna say this isn't uncommon and is usually a result of time seed increments. Division had this as well where it was say every second and not every 1000th. That one was funny because people were claiming it was rigged or thought you could somehow tell what would drop when in reality it just meant if you opened something at the same time you'd get the same thing lol. I wouldn't be surprised if it was that or something entirely different either.", "label": 0}
{"text": "Bullshit.\n\nPeople noticed numbers were off, ran some simulations, found proof, presented to Bungie. \n\nNot a single person outside of Bungie HQ knows how D2's RNG system rolls/operates. The entire analysis was done without seeing a single line of code (it's also a single fucking mechanic on the engine; are you saying that players understand the enemy AI patching better than the devs?). \n\nThere was also zero gaslighting. Bungie is entirely correct that *perks are weighted equally*. The problem is perk rolling relative to each other, i.e. perk combos (and if you think those are the same things, go back to school). To say they're the same thing is a complete misunderstanding of computer pseudo-RNG/statistics.  \n\nI can know more about how my car drives over a patch of road at work, but I do NOT know more than the multiple engineers that designed it.\n\nSeriously, this reeks of the circle jerk sub.", "label": 0}
{"text": "literally had nothing to do with crafting", "label": 0}
{"text": "This is good news and I appreciate their transparency and accountability", "label": 0}
{"text": "Yeeeeeees give me the deeeeeets", "label": 0}
{"text": "Scintillation (nightfall strand linear) has Envious/B&S at 3 apart, but I guess most people were going for the adept. I spent untold hours farming that combo and ended up selling for rewind+B&S", "label": 0}
{"text": "And people will still argue Bungie pulling back on crafting is a bad thing...", "label": 0}
{"text": "Yes, from what I understand it all depends on where the perks are relative to each other.\n\nTheir language of \"weapon sets\" makes me very curious if it's ALL weapons, or only some (somehow).", "label": 0}
{"text": "It doesn’t cause else it could counter all three champion types.", "label": 0}
{"text": "This issue also made some perk combos more likely than they should.  Given how long it took to notice it's possible that overall it's been helping more than hurting our it could be a wash.", "label": 0}
{"text": "Lets us focus one perk then grind for 2n like the class item", "label": 0}
{"text": "It said something about there being more tonics to discover in Act 1 - which was very confusing to me as I have 45 of 45 and there are no more greyed out tonics to unlock - maybe they mean the exotic ones that occasionally drop?", "label": 0}
{"text": "I mean half the trials pop is usually hunters so I’m not sure what they expected", "label": 0}
{"text": "Have you tried a different class? You didn’t mention your class but as soon as this lab was announced, people had an expectation of hunters waiting a long time. \n\nIf you’re not a hunter, disregard my comment.", "label": 0}
{"text": "It may as well be a danger to us since every Eliksni in the Last City is now basically a ticking time bomb that could suddenly go off", "label": 0}
{"text": "I went through the Master NF with gifted conviction..I use facet of awakening and have such a huge constant uptime on ascension because I get ionic traces...its such a fun build and the resistance is top notch", "label": 0}
{"text": "Anyone know what the data on subsistence/frenzy Funnelweb was? lol", "label": 0}
{"text": "No they intentionally blocked that. \n\nNow if you apply Radiant that will give you Anti-barrier for all 3 champion counters.", "label": 0}
{"text": "I’ll add that it also was reflective of where Bungie’s cache of trust lies with the community. 3 years ago, them coming out and saying “We looked into it and found nothing wrong” would’ve been the end of it. That response now caused the community to go into a massive deep dive. Says a lot.", "label": 0}
{"text": "Haha same. I'm not too bothered since I have a ALH/Chill Clip Riptide but it's just the only gun that seemed worth it from Banshee outside the HGL.", "label": 0}
{"text": "The delusionally naive level of sucking-off in the comments truly reads like some mediocre ai generated propaganda", "label": 0}
{"text": "It kinda does though? When you can just craft the rolls you want, you’re really not going to pay attention to the rolls that drop. Once that’s taken away? People are more likely to pay attention. ", "label": 0}
{"text": "right 😭 what are they talking about", "label": 0}
{"text": "A lot of people saying just make everything craftable problem solved. \n\nI do wish they'd make more craftable, but make enhanced perks on raid/adept/random drops only. Give value to both options, allow people to settle for crafted normal perks if they don't want to put a lot of time into rng drops.", "label": 0}
{"text": "Less playtime for me. No red borders to chase means no reason to farm revenant weapons. I haven't touched the new onslaught.", "label": 0}
{"text": "For primary dps you should pretty much only be looking at lucky pants and outbreak. And outbreak should really only be used as a backup if you run out of heavy and special ammo.\n\nPrimary weapons should basically only be considered in the context of ad clear and almost never used within a dps phase.\n\nSpecial and heavy weapons is a much more broad question and you can sift through linked sheets to get an idea for good weapons.\n\nGenerally, you are looking for snipers or fusions for special weapon dps and heavy gls or exotic weapons for heavy weapon dps. There are cases where weapons like shotguns, swords, rockets, etc. are better, but those are more niche.\n\nMossyMax's primary dps chart (not updated for revenant): [https://x.com/mossy\\_max/status/1805640976939332001](https://x.com/mossy_max/status/1805640976939332001)\n\nQuantum Damage-ics which maintains base dps values of various options without getting into more complex perk options: [https://docs.google.com/spreadsheets/d/1x12Ar1-kHH2AzHY8Clkv-PIMxxDSZrIX3e4xiJuQ-uI/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1x12Ar1-kHH2AzHY8Clkv-PIMxxDSZrIX3e4xiJuQ-uI/edit?usp=sharing)\n\nAegis's damage sheet more geared towards optimal players with specific perk interactions: [https://docs.google.com/spreadsheets/d/1\\_5wtBjRYHHxuF4oJKDb\\_iOGZs-wTkzB6RYbnyNLbuz4/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1_5wtBjRYHHxuF4oJKDb_iOGZs-wTkzB6RYbnyNLbuz4/edit?usp=sharing)", "label": 0}
{"text": "Seems likely it's been there since Forsaken, but at the same time it seems like the \"dead zones\" may have been different initially so something might've changed.", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215 hey buddy", "label": 0}
{"text": "I don’t know how it is that hard to understand but here is what is going on. Each perk is perfectly equal chance to drop. The problem is with the rng that matches perks together. Meaning that the further away perks are from each other in the api, the less chance of them appearing together. It’s not intentional and it’s been affecting drops for a long, long time. Possibly even since random rolls were reintroduced in Forsaken.", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215 How does it feel to be wrong", "label": 0}
{"text": "Same. And I LOVE(D) Onslaught. But can’t be bothered by it this season. Just isn’t really fun and even old Onslaught isn’t rewarding enough post ITL.", "label": 0}
{"text": "It’s not weighted though. It’s a bug in the rng algorithm that just hadn’t been detected until now. They didn’t lie about anything.", "label": 0}
{"text": "Guess I gotta eat my words.  Honestly thought this was kind of BS from the beginning but if Bungie found something then I will go with it.", "label": 0}
{"text": "Have only managed to finish 1 this season. 5 or 6 failures due to error codes.", "label": 0}
{"text": "Except this is a bug with certain combos being effected, not the singular perks. So it would be an issue if they are effected.", "label": 0}
{"text": "It’s kinda dependent on builds, champions and such. Depending on your class you can do an astounding amount of damage with your super and abilities. And also depends on composition on the team, what you are struggling with. I just started playing after a break, so I suspect my knowledge is a bit outdated. But edge transit heavy gl has some really good rolls for damage. Depending on what we are doing I usually run a damage super with ad control possibility build. And special I run something for majors. Or I’m entirely support with damage rotation weapons. Like a stasis warlock with a bait and switch sniper, whatever primary suits me and the best heavy gl I have.\n\nBut it’s to much different information for me to write here. I would look at this video From Datto on general damage.\nhttps://youtu.be/9REDgWiBlIY?si=64JHpH81SmdCtk9v\n\nAnd for builds for all classes this website is awsome and works with DIM\nhttps://mobalytics.gg/destiny-2/builds\n\nAnd to get in with the most current meta on damage (as it changes often) I would simply search for: Destiny damage meta revenant. And you will probably get some good answers.\n\nI’m sorry I’m not more specific. But if you want to optimize, you need to read and watch a bunch of stuff. And as I said, I might be a bit off with my info. But the two links are very useful. Good luck!", "label": 0}
{"text": "i tried for so long on titan (1hr) then went hunter", "label": 0}
{"text": "The shills are strong....", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215", "label": 0}
{"text": "Actually, this isn't true. I got a letter from Mr. Bingo yesterday and they told me that all my drops would be god rolls, and they weren't. How could Bingo do this?", "label": 0}
{"text": "Some perk combos are more common than they should be and that can be benefited from.", "label": 0}
{"text": "Skissue", "label": 0}
{"text": "I'm at 45/45, and I *think* it's a reference to \"You need to make a bunch of greens to get blues, and a bunch of blues to get purples\", because there's folk that needed it ELI5'd for them.", "label": 0}
{"text": "The funniest part is how it's probably been a thing for *years*, but it's always been in the players' favor. But then, we get one singular gun that isn't tipped on our side, and all of this happens.\n\nI've seen some really stupid takes about it, too. People think Bungie has been \"maliciously\" helping players with every single gun, besides one. Or people asking why Bungie doesn't just make the code say every perk is perfectly random (literally impossible, btw). It's insane.", "label": 0}
{"text": "Sure, and if that's the case not every weapon set is affected by the bug, and considering the amount of godrolls the fusion has, it's obvious that it's not affected by the bug.\n\n\nI can see this leading to a lot of confusion,  where people start to blame every single instance of personal bad RNG on this bug (ans once it's fixed they will likely try to claim the bug is still there cause their rng is bad)\n\nI've already seen someone try to pin them taking 40 runs to get ToM on this bug, and now trying to blame the fusion on this bug too \n\n\nBut also, back to your comment, I'm pretty sure the majority of guns would have this pattern, and the reason some godrolls are higher in distribution is because they are in different parts of the grid", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215 heyy", "label": 0}
{"text": "They said in a follow up message on Twitter that they would give a technical analysis once the issue was fixed.\n\nI need this TA like a fish needs water. I LOVE hearing the TA on things like this.", "label": 0}
{"text": "*Epicurean has entered the chat*", "label": 0}
{"text": "> I think that there should be some sort of compensation to this,\n\nlol, lmao even", "label": 0}
{"text": "I think it was intentional. Someone down the line ordered some code be changed to make certain perks/rolls difficult to get in order to drive up playtime.\n\nOr it could just be because of spaghetti code. Either way, it's not looking great.", "label": 0}
{"text": "Nobody in this comment thread is saying Bungie has some conspiracy against their players like youre suggesting we are. We're talking about combos being weighted to be more or less likely, not rigged in favor of any positive or negative result. I know people like you on this sub cant help but make up drama where there is none, but dont put words in our mouths.", "label": 0}
{"text": "Do yall have lives outside of video games?", "label": 0}
{"text": "They say that defeating combatants have a chance to proc the tonic (in addition to activity completions).", "label": 0}
{"text": "Obviously. What a stupid question to ask", "label": 0}
{"text": "The lack of Chill Inhibitor being craftable is what started it, then it expanded to other non craftable weapons and the pattern became apparent. \n\nIf all those weapons were craftable then it would have continued to go unnoticed. \n\nCrafting by itself had nothing to do with it, but it wasn't unrelated either.", "label": 0}
{"text": "Glad they figured it out.\n  \nI can't wait for all the posts demanding some sort of reparations.\n\n*grabs popcorn*", "label": 0}
{"text": "https://imgur.com/qjRqdBj", "label": 0}
{"text": "I'll settle for 3 Glimmer and a Ramen coupon.", "label": 0}
{"text": "I’m absolutely loving the taunt mechanics. It does make my shield last a bit less, even with the hp increase, because enemies actually shoot it now, but now rally barricade actually protects me. I genuinely love it", "label": 0}
{"text": "**Me:** I'm trying to implement a random number generator.\n\n**You:** Why not just take 100%, divide it for the number of perks available on that column and call it a day?\n\n**Me:** Yeah, that's what proportions should look like in the long run. But the problem is IMPLEMENTING it. Computer gotta get numbers from somewhere, ya know?\n\n**You:** 5 perks in each column Getting a certain perk combo would literally be(1/5)x(1/5) or 1/25 X 100.\n\n**Me:** Yup that's what I want in the end. But I need to IMPLEMENT it. That's not the RANDOM GENERATOR itself. It's some numbers.\n\n**You:** (1/5)x(1/5) or 1/25 X 100. There, you have your chance to get it.\n\n**Me:** Did you drop out of HS or something?", "label": 0}
{"text": "I mean.. both things can be true? Great this bug was found, and also them pulling back on crafting is a bad thing (subjectively speaking). ", "label": 0}
{"text": "Don’t we have an emote of this already?", "label": 0}
{"text": "Its not fixed for the legend title tho.....", "label": 0}
{"text": "The thing I find most interesting about that is while you still see the double bands, the dead zones appear to have actually shifted since then. It's very difficult to tell when it happened, but for example with Crooked Fang you see the dead zones start at 1/2 and 1/3, centered on 1/2, whereas now with a similar 7/7 weapon you see the dead zones crop up at 1/4 and 1/5, centered on 1/4. Directly adjacent perks were still common, but the whole thing seems it inverted- in Forsaken the bands starting at 1/4 and 1/5 were actually hot zones with the outer corners being uncommon as well, whereas now 1/2 and 1/3 and those outer corners are hot zones.", "label": 0}
{"text": "Damn you got me", "label": 0}
{"text": "Not sure what you expected? ", "label": 0}
{"text": "Thats means its time to take a break and log off buddy theres a bigger picture being built constantly in this game and if you cant hand one small segment being meh then 1- your kinda weak tbh (dont mean tha tin. Go f your self way just that youve desensitized yiurself to the wodner kf the world of the game because \"loot chase\" and 2- that means it's time to mov ein from the game for a bit", "label": 0}
{"text": "Would anyone who believes this was an accident be interested in purchasing a bridge? DM me", "label": 0}
{"text": "I guess I just don’t have the energy to grab my pitchfork anymore bc I’m not getting a god roll one of the 1200 weapons in the game that may see an hour of playtime", "label": 0}
{"text": "If this is the case, it’s a significant step backwards.", "label": 0}
{"text": "You could always play something that isn’t a grind fest that continues forever.", "label": 0}
{"text": "And I got downvoted on the twab post saying we needed an update on this. Thanks Bungie.", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215 Yeah buddy?", "label": 0}
{"text": "That shit will be boring after one or two runs.", "label": 0}
{"text": "Honestly, while I don't really feel threatened by Fikrul, he has done way more than Maya did. At the very least I see he has the power to resurrect shit.\n\nWith a little imagination, I can think of a couple of extremely dangerous dead things that might have a bone to pick with us...\n\nMaybe you should be scared?", "label": 0}
{"text": "Any benefit at all is still too much for something you can get for the minimum effort", "label": 0}
{"text": "Look in your transmog screen and see if it is present with all the other shaders, this kinda thing has happened before, not showing in recent items or collections, but is visible when you're looking at the cosmetic screen on gear.", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215", "label": 0}
{"text": "Last season sucked so bad I quit the game. I can’t imagine how bad this season is if it is worse.", "label": 0}
{"text": "I just love how many people in the community now have to eat crow. LOL", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215 Hey :)", "label": 0}
{"text": "To encourage people to play during more than the first week of a season. \nUsually people aren’t leveled up enough anyway. But spreading things out over the season is very intentional. ", "label": 0}
{"text": "It still absolutely murders in Gambit.", "label": 0}
{"text": "Working with general programming, novice to PLC programming, etc here.  it's always fun seeing how much you can do one thing right, but a few bits somewhere else gives you completely different results.  In this case, sounds like an RNG function maybe.  We'll hear the real story soon.", "label": 0}
{"text": "https://x.com/destiny2team/status/1849888122055897215", "label": 0}
{"text": "Yall are beating a dead horse with these posts. We know you’re all upset about weapons.", "label": 0}
{"text": "You're misreading the table. The number represents the distance between two random numbers between 1 and 6 when calling a time seeded random generator 300,000 times.", "label": 0}
{"text": "My friend had this issue", "label": 0}
{"text": "Doing this as well on the week with the new weapon is nasty work", "label": 0}
{"text": "And thats bad because....?", "label": 0}
{"text": "Is this happening to exotic class items too?", "label": 0}
{"text": "Exactly.", "label": 0}
{"text": "Well, if they respected our time.", "label": 0}
{"text": "Durance is only 5 seconds. I went back and forth on that one. I do love how customizable stasis feels", "label": 0}
{"text": "Same!!!!!!!!!!!", "label": 0}
{"text": "100%, When you look at things like Riposte the PvE godroll is basically 0 proximity.", "label": 0}
{"text": "Commenting today. Years after. Your take is still wrong and dumb. Did you know the guy at Bungie who banned him got fired for being a creep? Lmao.", "label": 0}
{"text": "Mmm I love tone death forced Labs", "label": 0}
{"text": "One of my favorite builds that is fun and also very effective is Strand w/ Lucky Pants and Last Word. Especially with the LW damage buff, but pretty much any good hand cannon will do. It's very mobile with grapple and tangles, and you can beam down pretty much anything with lucky pants. It's better on Prismatic where you have access to gunpowder gamble and shooting them out of the air with last word is peak yee-haw.", "label": 0}
{"text": "But at least know you'll know you're just having bad luck!", "label": 0}
{"text": "i cannot fathom how any of you can commit your time to playing trials with wait times like an hour, let it die so they realized they fucked up", "label": 0}
{"text": "Nah i just saved some of the more opinionated comments when i saw these threads cuz i knew we were right. Was just curious to see how they’d react because a lot of them just flat out denied stats proven theories.", "label": 0}
{"text": "No, I fully grasp what you said. But if perks are perfectly equal, than by that very definition, they must also be equal when matching another perk. If that isn’t the case, than they are in fact NOT EQUAL. just because Bungie says something doesn’t make it fact. People aren’t giving this their own critical thought. What they said here fundamentally cannot exist.", "label": 0}
{"text": "Thanks for the comms about this guys. As many others, im hoping to see a dev blog post talking about how the perk system even works and why were certain perk combos less common than others.", "label": 0}
{"text": "What was the weapon and perks that brought all of this to a head?", "label": 0}
{"text": "Ha, yeah same it's always interesting to see the deep dive on the how and why", "label": 0}
{"text": "Because bungie wants us to have to build craft around champions. It doing all 3 would make that easy and they don’t want that.", "label": 0}
{"text": "I think mostly everyone conceded that something is happening - the conspiracy theory was that Bungie was doing it on purpose to inflate playtime which can easily be disproved by the fact that a lot of weapons had more \"common\" desirable rolls. And please don't chime in with \"well they were making sure we didn't realize\" because that also makes no sense, lol.\n\nThey're just kinda bad at development sometimes.", "label": 0}
{"text": "both CAN be true.\n\n\nIndividual weighting can be perfectly tuned but if the thing actually calculating tng is flawed then indivodual weighting doesnt matter.\n\n\nIts like putting a lock on a door, the lock works just fine but the door is just a set of bars and you can put your arm through to open it from the otherside bypassing the lock.", "label": 0}
{"text": "yah all those people talking about how RNG works not knowing there about 50 thousand ways to prevent simple repetition many of them accidental while the real 'oh shit' moment was light.gg graphing  distribution and it looking like an effing checkerboard.", "label": 0}
{"text": "It’s always been good. Any time there isn’t an explicit need for dps, Xeno comes out for me.", "label": 0}
{"text": "Yeah, it's *actually* ironic.", "label": 0}
{"text": "The man said \"4th page\", you said \"3rd page\". Surely there's a difference there...", "label": 0}
{"text": "Act2 will have an additional activity to run. You can tell from the tonic ingredients menu there's things as of yet inaccessible to us", "label": 0}
{"text": "New heavy gl in vespers", "label": 0}
{"text": "https://letmegooglethat.com/?q=craftable+weapons+added+to+dares+of+eternity+this+week+at+bungie\n\nSecond search result for me originally", "label": 0}
{"text": "I settled with Envious Explosive Light in the end, even that took the best part of 200 engrams", "label": 0}
{"text": "Yet to try again since updating drivers, but a rollback may be in order if going forwards doesn't work\n\nOld drivers are listed on the Nvidia site I believe here\n\nhttps://www.nvidia.com/en-us/drivers/", "label": 0}
{"text": "Who are the experts in this system?", "label": 0}
{"text": "Huh. I have a regular Zen/Headseeker on Elsie's. Didn't think I'd been that lucky.", "label": 0}
{"text": "Pale heart focusing has been consistent 65-68 for me also, and with all the class item farming i had 99 engrams.", "label": 0}
{"text": "Oooh, so severance enclosure works with howl of the storm like dunemarchers used to before they nerfed that? I.e. you can proc the exotic effect at range and a while after you did the melee by destroying the crystals?\n\nGotta try that build, that was always fun with dunemarchers.", "label": 0}
{"text": "It's also crazy how this finally came up in the first place. Like /u/Hawkmoona_Matata said in [the announcement thread](https://www.reddit.com/r/DestinyTheGame/comments/1gc1ugm/perk_rng_issue_update/ltqfpha/), we needed:\n\n1) A non-craftable\n\n2) Highly sought after\n\n3) Meta archetype gun\n\n4) With a meta perk combination\n\n5) That also landed a dead space\n\n6) From an easily farmable source\n\n7) That had no substitute\n\n8) And could not roll double perks (non-adept)\n\nAnd it could only be really seen on light.gg within the first 2 weeks of a season. The fact that the community found this at all is insane!", "label": 0}
{"text": "I've run 01 VH like 20 ish times and I've gotten 4 weapons, I feel like if we're not getting crafting(which is a good thing IMO) we should atleast get double perks on drops or a focusing hub at the thend of the dungeon", "label": 0}
{"text": "I mean it appears youve learned more about the lore since posting this. \n\n\nI think your criticisms are still valid, mostly because I think a large chunk of the player base have these perceptions. ", "label": 0}
{"text": "You’re totally right, unnecessary. Thanks for pointing that out! Way less necessary than on hunter. I’m good on grenade regen so I think I’m going to throw Refraction in that spot.", "label": 0}
{"text": "👍", "label": 0}
{"text": "People are completely ignoring this lol. And it's definitely a factor in why it took so long for everyone to notice. There are plenty of god rolls that were benefiting from this too.", "label": 0}
{"text": "Bungie just needs their own lava lamp wall.", "label": 0}
{"text": "Non-trials players parroting \"bUt ArE yOu HuNtEr\" like dude, bro, my man, all 3 classes are suffering, doesn't matter if solo, duo, or trio.", "label": 0}
{"text": "Thank you for moving so quickly on this!", "label": 0}
{"text": "I really enjoy onslaught and hope they do more of it but the loot chase is not great. I have no need/want to get basically any of these weapons that are being offered other than maybe the heavy GL.", "label": 0}
{"text": "Bungies released a statement indicating their individual perk weighting is correctly randomly generated, it's the total pool that's incorrectly generated", "label": 0}
{"text": "> MT+Recluse made you a god and you could smash through anything.\n\nDon't forget lunafactions, shit got real stupid real fast", "label": 0}
{"text": "The monkeys paw strike again!!!", "label": 0}
{"text": "yep", "label": 0}
{"text": "On the flip side, I'd say it struck at the best possible time it could've", "label": 0}
{"text": "Great catch- I think that points possibly away from the perk proximity theory, at least back then- but also indicates someone at bungie may have tinkered with this system at some point (or spaghetti code)", "label": 0}
{"text": "That on its own might be too strong. So to both reduce its strength and to make it play into the weapons theme of element switching more I think it could be changed.\n\n\n\"damage/kill with this weapon temporarily improve its other firing modes\"\n\n\ndealing arc or void damage would let the weapon have incandescent for a time after switching to solar. etc", "label": 0}
{"text": "Actually pretty crazy once you list it all out", "label": 0}
{"text": "I don't think so.  I've been planning to get around to it at some point -- while hoping that I'd never have to :-)\n\nI wasn't thrilled about the idea of being forced into a co-op timed mission.  But bigger issue for me was unlocking the mission in the first place  (not to mention presumably having to unlock it three times),  \n\nMy understanding from the Internet is that unlocking DD requires finishing all 3 overthrows in a row incl finding and killing some special bosses at the end of each round?  The thought of investing an hour-plus into doing that with the risk of \"wasting' my play time if bosses glitched or I failed to find/finish them quickly enough and DD didn't unlock has been very unappealing.  But I figured I'd eventually do it :-)", "label": 0}
{"text": "I feel so dirty using it in Gambit. I'm not a good invader and usually leave it to somebody else to do, but Xeno just hands me team wipes like it's going out of fashion.", "label": 0}
{"text": "There's definitely PvE god rolls it was screwing over for the past couple of years at least.  Envious Assassin + Bait and Switch Cataphract (non-adept from focusing), ALH + Vorpal Wilderflight, Attrition Orbs + Kinetic Tremors Multimach, Demolitionist + Frenzy Unforgiven, etc.  It's just that there's probably just as many examples of weapons that aren't multiperk or craftable where it helps, but more importantly most of the good weapons have been multiperk or craftable for the last two years.", "label": 0}
{"text": "Yeah I figured it out after posting. Had just never heard anyone refer to Crucible that way, lol.", "label": 0}
{"text": "Because void weaken is extremely common these days. Definitely nice to have, but not really as hard to come by as it used to be.", "label": 0}
{"text": "Oh it's already begun \n\nMainly throwing shade at \"no possible way in-engine to weigh perks like this\" to \"yeah we know, we'll get right on it.\" When they've likely known this has been an issue for years.", "label": 0}
{"text": "ok", "label": 0}
{"text": "What is the flawless shader right now?", "label": 0}
{"text": "ok", "label": 0}
{"text": "Lol I hate you said was not criticism tho mate, it was an accusation…", "label": 0}
{"text": "tonic also gives a chance to get the weapon on kills. So high enemy density is also a desired trait. ", "label": 0}
{"text": "May not be top dps, but I still end up equipping it a lot after the second time someone strafes in front of me and kills me with my heavy grenade/rocket.", "label": 0}
{"text": "While true, psuedorandom number generators are good. Very good. It appears that Bungie is writing in C++, which has plenty of good implementations in just the standard libraries.\n\nThis is almost certainly an issue with the implementation of how they're using those random numbers, rather than the randomness itself. Assigning those random numbers to perks, or doing modulo math in a weird (and potentially wrong) way, or something else obscure is actually going to be the issue--not the random number generator itself.", "label": 0}
{"text": "That's the thing, a lot of the time there's no follow through on the the concept of things like this", "label": 0}
{"text": "I hope this gets better with the new armour system. Currently I almost insta delete armor (unless the light level is higher) is simply because the only armor that would be an upgrade at this point statwise would be high-stat raid/Grandmaster nightfall armour.", "label": 0}
{"text": "Yeah it's probably only BECAUSE the god roll with the new shiny perk fell victim to this bug that people figured it out. It doesn't seem intentional considering most of the weapons rolls affected are doodoo trash rolls. It's interesting that the bug happens, I'm curious what process the game goes through to determine a random roll", "label": 0}
{"text": "Is Hawkmoon glitched? Shows two grips for perks", "label": 0}
{"text": "I always understood it to be that a computer couldn't generate random numbers *on its own* but can generate numbers that are effectively truly random(as far as quantum mechanics knows) if connected to instruments measuring something like radioactive decay.", "label": 0}
{"text": "This is why I've never gotten around to unlocking.  I don't have enough playtime to \"waste\" on finishing a series of overthrows when glitches/bugs seemed likely.", "label": 0}
{"text": "You could technically generate orbs by everyone chaining supers and having that helmet mod that pops out some orbs for allies on super cast. \n\nBut honestly, you're probably gonna lose whatever dps you'd get from the 5% better buff by having to coordinate all that during a dps phase, while BNS is basically free to always have active.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "I don't get this comment... At all. \n\n\nYou mention SoD as if this is a play in the issues with this act/story. \n\n\nYou're describing SoD as if logical thinking is preventing OP from understanding/enjoying the story. Anyone who's been playing this game obviously can let let their imagination flow, or else detailing their gripes with the story wouldn't be possible.\n\n\nYou finding the potential speculation of this act entertaining has nothing to do with SoD and everything to do with bad story telling. \n\n\nYour comment is just heavily implying that OP wasn't paying attention to the story.", "label": 0}
{"text": "I know lol Ive been going into my own comments to own my shame", "label": 0}
{"text": "Can we shame all the naysayers now?", "label": 0}
{"text": "And it was just RNG. As in there RandomNumberGenerator was at fault. So he wasn't entirely wrong either", "label": 0}
{"text": "Lol", "label": 0}
{"text": "I just feel slightly vindicated. https://www.reddit.com/r/DestinyTheGame/s/2XsguJjFEP", "label": 0}
{"text": "they why talk shit here?", "label": 0}
{"text": "Why is there no 5 then? Are you sure you aren't just calling 2 to 6 or 1 to 5? The table you're showing is the distribution you'd expect from rolling a pair of 5 sided dice and recording the difference.", "label": 0}
{"text": "Radiant + chill clip does the same on several weapons", "label": 0}
{"text": "If you are enjoying, that’s all that matters. I liked it, but not more than Posterity. Although maybe I will change my tune this weekend if I get AT\\Voltshot.", "label": 0}
{"text": "I'm very curious as to what exactly is going under the hood, I wonder if it has something to do with how sometimes you get the same roll on the same weapon in the same session a little too often (based on my own anecdotal experience).", "label": 0}
{"text": "Nice to see someone not stubborn on the internet for once. Have a nice day and apologies for the aggressive reply.", "label": 0}
{"text": "Visiting Bungie studios and then seeing a massive lava lamp wall in the lobby with a sign that says \"THIS IS WHERE THE MAGIC HAPPENS\" would actually be such a flex. \n\nFor any game studio, really.", "label": 0}
{"text": "\"sometimes\" lol all times", "label": 0}
{"text": "No wonder I couldn’t get a ros arago with permeability and onslaught. Seemed impossible", "label": 0}
{"text": "Another good resource is d2 foundry, as it basically does the same thing as light gg in terms of searching for weapons with specific traits (I.E, trait combos, damage type, ammo type, etc) but with way better ui. It just doesn’t give popularity rankings for perks so it’s more for figuring out what weapons you want to farm, as opposed to light gg which is better for checking how good the weapons are. \n\n[the d2 data compendium](https://docs.google.com/spreadsheets/d/1WaxvbLx7UoSZaBqdFr1u32F2uWVLo-CJunJB4nlGUE4/edit) is also amazing once you get to the point where knowing exactly what certain things do is important.", "label": 0}
{"text": "What? How would it be too strong.... You lost me there. \n\nWe have Sunshot, Polaris Lance, and Graviton Lance.... And Hardlight would be too strong?", "label": 0}
{"text": "Can't be arsed to nerf Prismatic so they do this rofl", "label": 0}
{"text": "yeah but old way was roughly 7 runs for a 90% chance at the exotic engram which was very very heavily weighted towards choosing an unowned exotic.\n\n\nif each LS took 5 minutes you would be looking at 35 minutes of playtime to unlock the new exotic armor. But hey let's say you are unlucky and it takes 70 minutes. You cannot grind Rahool rank from 0 to 17 in 70 minutes without having to stockpile from previous seasons and to burn through materials for focusing.\n\n\nOld system was quicker and needed less resources.", "label": 0}
{"text": "*Reeeeeeeallyyyyy?* \n\n🤔 😈", "label": 0}
{"text": "Did anyone actually see huge spikes of extra drop rates in the data?\n\nI think it’s more likely this is a very small buff for the weapons not in the dead zone \n\nFor example, if there’s 36 combos and 1/6 have a drop rate of effectively zero due to bug, that redistributes to the other 30 getting a bonus 1/180 chance \n\nSo you’d only ever benefit from this being in your “favor” every 180 drops which isn’t a very big deal", "label": 0}
{"text": "You need 100 crucible headshots for MIDA. It's a grind", "label": 0}
{"text": "Can I ask what you're saving? I have like 2 armor sets per class and 1 of each exotic armor. \n\n\nI collect what I perceive God rolls of guns. If I don't use something after a few months, I delete it. \n\n\nLast night I deleted 200+ items that had accumulated from grinding. What I was left with were the same armor and weapons I had before the season, plus a few new guns here and there. \n\n\nIdk at some point I realized min maxing only matters in PvP and I could complete all activities in PvE with sub optimal armor", "label": 0}
{"text": ">There is no guarantee that every perk roll/combination will be evenly distributed and there is no way to test if something is \"random enough\"\n\nI didn't respond because this is just fundamentally wrong, there are tests for judging how similar an observed value is to an expected value. You can in fact test a dataset to see if the distribution is sufficiently uniform. This is like the fundamental building block of the entire field of statistics and the concept of probability.\n\nWith that being said, would you like to revisit how bad and unrepresentative the community data is, and how it's definitely a uniform distribution that's just being skewed by bad data collection and presentation?\n\nYesterday from @Destiny2Team: \n\n>We are now investigating a potential issue within our code for how RNG perks are generated.\n\n>Many thanks to all players who have been contributing to data collection across the community. This data has been monumentally helpful with our investigation, and we are currently working on internal simulations to confirm your findings.\n\nToday from @Destiny2Team:\n\n>Our team has been working through community-sourced data and internal simulations to reproduce reported issues regarding legendary weapon perk RNG.\n\nAfter investigation, we can confirm an issue has been found in our code where some random perk combinations are harder to earn per legendary weapon perk set. In some cases, desirable perk combinations are a bit easier to earn as well. While we inspected our content and confirmed each perk is weighted equally, an issue in perk pool RNG is the culprit here.", "label": 0}
{"text": "I completely disagree, personally. To go through your complaints, though:\n\nYes, the bosses have a lot of health, BUT they're also very unique in how you do damage to them. If you decide to just use a rocket or grenade launcher, you won't do good damage since you're not playing to the strengths of each fight. For example, the final boss has a ton of health, but also an extremely long dps phase, so if you bring something with enough ammo to last the whole time, you'll do great.\n\nAs for the softlocks, that one is definitely an issue and needs to be fixed asap, but every softlock is caused by people doing something they shouldn't, so just don't do those specific things and you'll be fine.\n\nNext, the lightning is supposed to be a 1 shot, regardless of being in a Well or Bubble. The whole point is to make you move around during dps, just like Bungie did with the Witness in Salvations Edge. It's something Bungie did very well. Of course they want to do it again.\n\nFor your complaint about the servitor boss resetting when you shoot the wrong number, just shoot the right ones? There's no timer, and you're able to look at the number before you shoot it. Just take the extra second and double-check.\n\nLastly, the armor thing is a valid complaint, but it is far from being an exclusive issue for Vesper. People will always complain about not getting the loot they want, and you're no exception.", "label": 0}
{"text": "It had nothing to do with rank.\n\nThe Dragon’s Breath catalyst drops when completing the “An Old Flame” Exotic quest which can be acquired from Banshee-44 at the Tower", "label": 0}
{"text": "No worries, but to kinda answer your question, it's hard to say because shader organisation is incredibly inconsistent. It *should* in theory be on the first tab, after any you have favourited and any memento shaders if it's applicable. The shader seems to have been in the database since at least 2023, so it could quite easily show up during the Lightfall era shaders, it might even be on the very last page like a couple of shaders are for some reason. You basically have to scroll over every shader to find \"Shaded Envy\". Anyway, hopefully they fix the bug ASAP because I wanna go for it, but not until it's fixed.", "label": 0}
{"text": "Xeno one shots oracles in VoG and absolutely crushes the fuses in Security in DSC. That’s about all I pull it out for, anymore.", "label": 0}
{"text": "artifact mod VS someone on your team running solar. In other seasons we could use an artifact mod to become radiant on orb pickup. Not a big difference in amount of build crafting.", "label": 0}
{"text": "Think he's just pointing out how funny it is this happened the season bungie decided to make weapons non craftable, don't think he's complaining", "label": 0}
{"text": "Doing a dungeon solo flawless should drop all weapons and armor per encounter. With the exotic at the end. Then it would be worth the headache", "label": 0}
{"text": "Same here unfortunately", "label": 0}
{"text": "I admire the confidence you posses to speak so authoritatively on something you obviously have no fucking clue as to how it works.", "label": 0}
{"text": "I would concede that occasionally, something that is very good on paper may feel strange. I've always found 120 / 140 HCs jarring to use, even when they are objectively good.", "label": 0}
{"text": "It is a bug, but it is a bug that leads to possible fortune.\n\nhttps://www.youtube.com/watch?v=-QenlUWGOvA", "label": 0}
{"text": "that could have worked too. Just keep the crafting to seasonal weapons and maybe destination weapons", "label": 0}
{"text": "Nah, Ghosts of the Deep is still the worst. The first 2 encounter of VH are fine and I enjoy them. The first boss is cool and doesnt take that much time to get to damage. The final boss could use some tweaking. \n\nGotD though? I cant stand any part of it. And I don't care for any of the loot.", "label": 0}
{"text": "I’m honestly just waiting for GMs. I just want harder content that pushes my builds to their limits", "label": 0}
{"text": "That's a level of nuance that the average D2 player ain't gonna understand lmao, as seen in the announcement thread.", "label": 0}
{"text": "> And it could only be really seen on light.gg within the first 2 weeks of a season.\n\nActually, the fact it can still be seen as clearly now as when the reports started is **specifically** why people found it so odd in the first place.\n\nLike I've mentioned a few times about Mountaintop (only know this because people kept mentioning it and I looked it up), its god roll was in the top two within two days of it releasing. By contrast, VS Chill's Envious/Bait combo has never once increased from F rank (one above the lowest in terms of popularity on Light.gg) to something higher despite weeks going by. And while we can see it increasing based off Light.gg's chart, it's moving at such a slow rate it's hard to say if it would've ever hit top eight in terms of popularity.", "label": 0}
{"text": "Running legend lost sectors i get them every 2 or 3 runs currently, its infuriating and has been going on longer than 2 days, more like a week here.", "label": 0}
{"text": "It probably wouldve also been discovered if people cared about the new onslaught weapons", "label": 0}
{"text": "Still feeling so strongly about it now bud?", "label": 0}
{"text": "Thanks for this, I was just referring to your original version last night while setting up my Warlock for this season.", "label": 0}
{"text": "Yeahhhhh it does", "label": 0}
{"text": "Wouldnt make sense. I was willing to be proven wrong and I was in fact wrong. Thats all there is to it.", "label": 0}
{"text": "Last I checked it was about 16-20% of the population that plays crucible, and around 25% during Iron Banner, but don't let facts get in the way of bias", "label": 0}
{"text": "I’m late to party but I upvoted. Bungie help is looking into the issue thankfully.", "label": 0}
{"text": "15min+ to find a match. \nPerfectly normal. \nBungie devs are definitely the most incompetent employees on the planet. \nAnd they are liars.\nNo wonder why this game is dying hardly.", "label": 0}
{"text": "Got a .2 and a .3 earlier, painful", "label": 0}
{"text": "It still has no cost to its use, and would also work on all three champions which generally isn't allowed.\n\n\nI'm not saying your idea would me some meta breaking thing. I just think having to actually switch the modes around is a more interesting gameplay loop. And could potentially also add in a damage buff for doing or something to have an incentive to the mode switching.\n\n\nbecause tbh I'd probably just keep it on arc the entire time if it had joltshot", "label": 0}
{"text": "If that's an issue your filter isn't strict enough. If your inventory is completely full after each map it probably isn't strict enough.", "label": 0}
{"text": "I’ll laugh so hard if fixing this actually makes it harder to get some rolls. I’m curious which ones were easier to get", "label": 0}
{"text": "I understand your point and the general framework that supports it. However:\n\n* The Epicurean\n* Fixed Odds", "label": 0}
{"text": "Hold up, bungie literally said that weight-gating was completely unintentional and already identified how it happened, AND are working to fix it. Can't fault them for a problem no one intended, and no one even noticed  until now. It was quite literally an accident.\n\n\n\n\nAlso, the weight-gate could have been in people's favor as well since bungie didn't know it existed either. The only reason we noticed it now is because there's finally a weapon with a desirable trait combo that people want that isn't dropping. I'm sure there's been plenty of weapons that the desirable trait combo is weighted in your favor.", "label": 0}
{"text": "Calling it now, it's gonna get the new jolting feedback perk as the new catty perk.", "label": 0}
{"text": "The best thing is now anytime says rng is rng we can tell them to choke on it.", "label": 0}
{"text": "better idea. Raids and dungeons have two drops per encounter. One weapon, and one armor ", "label": 0}
{"text": ">Re: Trials Shader - looks like it is dropping, just can’t be equipped.\n\n>“Consumables full” message is due to double loot for Crucible right now. First is accepted in feed, second can’t be claimed as… you already have one!\n\n>Team is investigating.\n\nhttps://x.com/A_dmg04/status/1849905827760701572?t=CVPkWW--gsd3cV-uXAS0eQ&s=19", "label": 0}
{"text": "To be fair, i can't see it listed on mobile. But it's also easy to track since it's every other weekend.", "label": 0}
{"text": "Ppl need to get in on getting the god rolls for weapons with perk combo that’s right next to each other before the fix. Considering this exposed flaw shows that it has a higher chance to drop.", "label": 0}
{"text": "Do people not consider the circumstances in which the dungeon came out? We live in an era where power creep and taken over destiny. Do you want a shattered throne? This dungeon is far too easy in the current sandbox of destiny. It’s tailored TOWARDS THE CURRENT SANDBOX I don’t understand why players refuse to see this. The bug problem is indeed understandable and very frustrating. However, the rest of the point are stupid. You do a mechanic wrong, so you get punished for it. At least it’s not a wipe, is that new? Fuck no. The bosses do not have that much hp. I have 1 phases both bosses multiple times in lfg. If lfg can do it anyone can do it. The lightning 1 shots. Yeah it’s a mechanic. Use a cheese spot or just jump/look. If you have problems seeing the lightning, then that’s understandable but you didn’t say that in the post.", "label": 0}
{"text": "I just want to know how long this bug has been in the game.", "label": 0}
{"text": "Intentional lol. Bungie couldn’t do something like that if they wanted to.", "label": 0}
{"text": "Yes, but it was unintentional. They're already fixing it.", "label": 0}
{"text": "I've been playing this game since day 1 and just recently discovered sunbracers grants unlimited grenades for 5s on a melee kill 🤣.  So I'm having fun with that right now.", "label": 0}
{"text": "I see thank you thank you", "label": 0}
{"text": "Crafrable weapons and the previous onslaught focus system are both immensely superior systems to tonics.", "label": 0}
{"text": "I disagree on the boss fight, the lightning should not one shot you on normal mode while also covering nearly the entire floor, this isn't a raid, and i would be COMPLETELY fine the lightning one shooting you on master, but a NORMAL dungeon shouldn't have something so sweaty and demanding, dungeons are supposed to a casual low intensity activity. And yea the damage phase is long, but even having a weapon with the ammo isn't a guarantee of having a good damage phase because those annoying ass clones, you either take the time to kill them which takes time away from dps or let them live so they can block half you're shots, or you're just gonna miss half you're shits because you're constantly jumping around to dodge lightning and clones, but yea my servitor complaint is a skill issue I admit, but the final boss really needs adjustment, a casual experience does not need to be that tedious especially considering how terribly long it takes just to get to dps", "label": 0}
{"text": "except you never run the activity again either once you get the patterns.", "label": 0}
{"text": "No, there were people who were trying to argue that the massively non-uniform distribution was equally as likely as any other outcome because it's ✨️random✨️, therefore there is no issue\n\nIts a side effect of the concept of probability being initially unintuitive for people that have not been introduced to it yet", "label": 0}
{"text": "Horrendous matchmaking so far. 7 games, one win, with not even one close match. In 4 of those games one teammate didn’t get a single kill. In the other two, one teammate got a whopping one kill. It’ll be a oong weekend it seems, and it takes several minutes to find a match at times, and I’m on Warlock.", "label": 0}
{"text": "I'm very much aware of the circumstances that led to this because I followed it from day 1 and contributed to the initial data set that was used by Newo to make up his 10 page report.\n\nI'll keep this as simple as possible. \n\nThis all originated with Chill Inhibitor.\n\nIts a dungeon weapon.\n\nNo dungeon weapon has ever been craftable, so there is no basis to assume that Vesper's loot would have been craftable if bungie hadnt decided to roll back their emphasis on crafting this episode. \n\nDuality did offer craftable weapons but they were reprised Opulence weapons, not the same thing as dungeon specific/exclusive loot.\n\nAt no point during the entire process did crafting or the rollback of crafting play any part in this discovery. If anything it HINDERED it because crafted weapons dont follow the same patterns and so people in the community had to look specifically for world drop items to compare perk distributions to notice a trend.\n\nIf it had been Bitter Sweet rather than Chill Inhib that was the spark of this whole process, then yes, you could attribute this discovery to bungies rollback of crafting. But that simply wasnt the case. Objectively false.   \n\n\nDownvote me all you want but it doesnt change that fact. All the amazingly committed and frankly clever people who actually did the work to achieve this discovery did not do so because they were butthurt that crafting was removed this season, its because they saw numbers that didnt make sense and chose to invesitgate it further in spite of bungie and a huge portion of the community dismissing them and their effort.", "label": 0}
{"text": "Good to know that it's only really dropping armor for me, since that's all I want from Vesper", "label": 0}
{"text": "Just got my first. No games to be found even on warlock.", "label": 0}
{"text": "I already addressed this in my main reply above but to be clear, no dungeon weapon has ever been craftable, Duality had 2 craftable weapons in its pool but they were reprised opulence weapons. There is no precedent for craftable dungeon weapons.", "label": 0}
{"text": "Yes! Seriously love these kind of insights on the backend of things!", "label": 0}
{"text": "based on https://warmind.io/activity we as of this post have 8% in trials, along with 7% in the crucible, for 15% total.\n\non steam alone we have 20-40k players playing concurrently, which does only come out to 3-6k players playing PvP on PC at any given time. \n\ntrials report puts it at 17.5k players across all platforms in the last 4h as another data point\n\n---\n\nif we were to consider active player counts as a reason to remove a mode, raids would be up on the chopping block right after gambit", "label": 0}
{"text": "Shaded Envy", "label": 0}
{"text": "\"Why is there no 5 then?\"\n\nExactly.", "label": 0}
{"text": "Look i think it’s dumb it can’t do all three but bungie just didn’t want it to.", "label": 0}
{"text": "It's pretty much a fact that some previous God rolls were easier to get than they should have been. People aren't going to like the new RNG when things get fixed.\n\nYou can see exactly which ones were by going to any weapon on light.gg and looking at which perks are next to each other and which perks are not.it just so happens that the envious arsenal and bait and switch roll is nearly impossible this time alerting everyone to the problem. The glitch was in our favor for a long time.", "label": 0}
{"text": "and an archetype of fusion rifle that was so bad they never made another one lol", "label": 0}
{"text": "The new Liturgy stasis grenade launcher and Yarovit stasis submachine gun can roll with Strategist too.", "label": 0}
{"text": "Yea I and many others saw this coming from a mile away. But you’d think it’ll be faster if not on hunter, but no. Can’t find a game. There needs to be more players to try something like this, and I really like the idea of not having to play against three prismatic hunters every match.", "label": 0}
{"text": "yeah I was more meaning that it's not *because* it does all three types\n\n\nIt's because Bungie said no for some reason :(", "label": 0}
{"text": "I like they threw in the “in some cases, desirable perk combinations are a bit easier to earn as well.” It’s like telling the player base just because you were right it’s not like you weren’t benefiting from our fundamental screw up.", "label": 0}
{"text": "If you look at what the community has found so far, some rolls indeed drop more often than the others because of this issue and we know the simplified version why it is happening:\n\nPerks that are close to each other in the backend/their RNG tool, which is the same order that you can also find on sites that use the API like Light.gg etc, get paired more often while the perks/traits that are farther apart (the most distance can be 3 in Chill Inhibitor’s case, then the list loops back to the top, think of each column like a circle rather than a dead-end vertical line) drop far less often.\n\nI may have butchered the explanation a bit but certainly watch Aztecross or Datto’s video to understand the issue better. It is very interesting and it wasn’t something done intentionally to make the loot chase worse by Bungie — looks like a simple mistake that has gone unnoticed for years.", "label": 0}
{"text": "Yeah I can’t find a match on warlock either, and the games I do get they are not even remotely balanced.", "label": 0}
{"text": "Shoulda got the title before, oh well", "label": 0}
{"text": "I don’t think it was done maliciously but to say it’s *always* been in the players’ favor is disingenuous.", "label": 0}
{"text": "What’s an aggressive frame fusion?", "label": 0}
{"text": "Indeed, thank you and yeh, thats a very good breakdown of the exact circumstances that it took for this bug to finally be discovered. And it goes to show the 'miracle' luck that bungie had for this to have gone unoticed for this long.   \n  \nThey pretty much got away with it for as long as they did by putting the right perks, in the right spots, on the right guns, at the right time by sheer luck? All the way up until this very episode. Crafting probably bought them a few extra years too. Its actually kinda hilarious in hindsight", "label": 0}
{"text": "> as someone with a full time job\n\nHere we go", "label": 0}
{"text": "How nice of you to check in, still feel strongly about it. also was correct in being against the initial \"we hate bungie. bungie bad.\" narrative that was being spread =] \n\nAlso if you look through more of my comments (which i know you are, ty btw) you'll also see i was also correct in asking if other weapons from the past showed other weird shit going on and  didn't immediately believe 1) the hate mob and 2) the guy who made claims that were over the top to start arguments. \n\nAppreciate the snarky comments tho. luv u", "label": 0}
{"text": "Issue with trust? 💀", "label": 0}
{"text": "The reason is probably that they didn’t want it to do all three, I feel like it did at one point and everyone expected it would again since it doesn’t have intrinsic anti champion as part of its description but rather it gives you slow and shatter. But they don’t like us sitting in the back plinking away with scouts.", "label": 0}
{"text": "Was not...but red border are not garanty to drop. you have chance in ..... who knows.", "label": 0}
{"text": "RNG fuel can’t melt crafting beams", "label": 0}
{"text": ">I think it’s more likely this is a very small buff for the weapons not in the dead zone \n\nPerks on the diagonal or 1 off the diagonal have a fairly significant increase in their drop rate, by ~50%. Perks 2 off the diagonal have a very slightly reduced drop rate, by ~10%, and perks 3 off have a vastly reduced drop rate, by ~90%.\n\nIf the combo you want is on the diagonal or one off, you are much more likely to get it right now than normally. Notable weapons that can be exploited in this way are deadlock and prophet of doom, both having threat detector OS on the diagonal, exuviae and live fire get rimestealer headstone, liturgy gets rimestealer chill clip all on the diagonal.\n\nDungeon weapons have some benefits too, with chill inhibitor having cascade bns 1 off, pyroelectric propellant having attrition orbs jolting feedback and velocity baton repulsor destabilising on the diagonal.\n\nObviously if you want one 3 off you're totally screwed, but there are some rolls that are improved in a fairly significant manner", "label": 0}
{"text": "Someone somewhere forgot a bracket.", "label": 0}
{"text": "This weekend is terrible. Labs sucks with such low population, and everyone playing is either a professional or cheater.", "label": 0}
{"text": ">Exactly.\n\nI mean it just looks like you called the function with the parameter \"-Maximum 6\" which will never return six, so you get the distribution you'd expect if you were rolling 1 through 5 inclusive.", "label": 0}
{"text": "So he's a good way to play test it in the community but some things just do not stick.", "label": 0}
{"text": "The \"i put in 1000 hours in X activity\" nerds are gonna be at your neck for this..", "label": 0}
{"text": "Let me know if you have any questions!", "label": 0}
{"text": "No there a final page that unlocks once u reset rahool to focus any you don't own", "label": 0}
{"text": "Have you seen the percentage of end-game players? Or even seen the normal player in a strike or Gambit match? You're telling me people grinding for red-borders in the two weeks they play before fucking off until the new season are all running into masters, low-mans, and GMs where these rolls matter?", "label": 0}
{"text": "Oh no\nThat’s going to be a hell of a grind\n\nI miss farming loss sectors", "label": 0}
{"text": "People always are going to complain about RNG in an RNG game because people don't understand statistics and probability, and since the problem wasn't even remotely noticeable by the community until now (including by people who LOOOOVE digging deep into this kind of stuff), they had no reason to dig deep.\n\nNot to mention the randomness of the bug itself meant that it was helping players' RNG as much as it was hurting it, so it all likely balanced out. It was only this perfect storm of a new weapon with a really strong brand new perk roll that has no alternatives and no double perk columns that happened to be affected by this bug.", "label": 0}
{"text": "Yeah. Let’s not pretend like the vast majority of god rolls are not right next to each other in the columns.", "label": 0}
{"text": "Overall I like it, but I don’t like how this suffers the same issue that Encore did. Jump back into it 14385846 times in a row from the beginning just to complete this quest and fully unlock everything. I am 100% behind using endgame spaces for quests relate to said endgame space. But if you’re going to do that let me load up a separate instance that exists just for the puzzles. I have next to no clan/friends playing so I had to load into fireteam finder listings to get to the point I needed and then leaves go back in, do the puzzle, then leave again. Rinse and repeat. Now I just need to do step 9 to get the class item and every fireteam finder team I join has someone else doing a different step or they speedrun and loot it or pull me before I can complete this quest. It’s just annoying that it’s this is unintuitive and tedious.", "label": 0}
{"text": "A simple jump is enough to avoid it or remaining mobile like the fight is asking you to. I regularly hit top damage in my group as I'm using star eater nova & anarchy then staying on my toes and avoiding the oncoming damage, killing clones etc. There's so many ways to deal with it in the game atm.", "label": 0}
{"text": "I like the dungeon, though the bugs are shit. It's really janky at times. Nukes not respawning in the opening encounter if a teammate falls off a ledge with them, panels inexplicably not taking damage, Raneiks itself being super janky, still can't play Nightstalker, etc.\n\nA lot of the time the bugs may be caused by a user messing something up, so now people I try to teach the dungeon to feel extra crappy if they accidentally do something wrong.\n\nThe final boss being spongy seems to be the natural result of power creep, so I don't really hate it. Most people seem to learn how to stay alive decently enough. The damage phase itself is extremely long and forgiving. The tedious part is the lead up to damage phase. Doing the mechanics twice is weird. It's not particularly challenging, just kind of time wasting.", "label": 0}
{"text": "See if keep Incandescent on. I've never loved Joltshot as I hate reloading...", "label": 0}
{"text": "There’s a couple of other options for Pugilist on stasis too like the No Reprieve shotgun and Senuna sidearm - but not sure if they’re in the game now. You can craft the shotgun for a stasis melee build with Pugilist/Swashbuckler and it has the Right Hook melee trait as well.", "label": 0}
{"text": "Don't forget it's double drops too", "label": 0}
{"text": "Same, RNG is something developers tend to assume will 'just work' but this is the second time I've heard of RNG ending up causing a mess like this.\n\nI *think* the other was in Mechwarrior Online but it was years ago and I don't recall 100%.", "label": 0}
{"text": "the fact you're getting downvoted really speaks wonders", "label": 0}
{"text": "two weapons from a two year old dungeon, the only two dungeon that are craftable and weapons that nobody uses", "label": 0}
{"text": "It’s been affecting the game for a long time like you said. It’s only discovered because it’s affecting the godroll of some good weapons. How is it finally affecting the RNG at the worst possible time? Any other scenario it would have been ignored like it was in the past 6 years.", "label": 0}
{"text": "Sixth coyote with double shackle grenades and double ensnaring slam is pretty good. \n\nCyrtarachne if you like swinging around more and letting your whirling maelstroms do the work.", "label": 0}
{"text": "Just let us have Legendary Shards back and let us buy what perks we want for 1000 each. 🙂‍↔️", "label": 0}
{"text": "Time to farm cold comfort", "label": 0}
{"text": "What class are you?", "label": 0}
{"text": "The fact that Bungie didn't say when the bug started probably means that the bug has indeed been in the game since Forsaken. Otherwise, they would have mentioned something about it being a recent change.", "label": 0}
{"text": "Titan", "label": 0}
{"text": "The seasonal/new style episode content is the same tedious shit.  The DLC was great, but now we’ve just entered the same old shit grind of zero interest.  The story is horse shit too.\n\nD2 needs to end now and either make D3 or can it completely.", "label": 0}
{"text": "It's weird that people are mad that exotic armor is being treated the same as all the other exotic armor.\n\nThis has been an ask for a long time and it shouldn't have been gatekept behind an lfg activity that you need a mic for to do effectively.\n\nNow had it been exotic weapons, that would have been more understandable, because some of those have been locked behind tasks that require lfg and comms.", "label": 0}
{"text": "Sorry lol, just had a fair amount of unironic assholes in my dm's today. So i'm a bit on edge xD. \n\nBut yeah, I was a new player once in PoE and play with a couple really casual folks who don't use loot filters and spent every map looking at every white drop in the first map. I'm just scarred.", "label": 0}
{"text": "it genuinely doesn't matter what class I'm on though, its the same for everyone literally lmao", "label": 0}
{"text": "I wonder if it’s worse for hunters or not? I honestly don’t get what they were thinking. Unless the classes were closely distributed player number wise this seems dumb.", "label": 0}
{"text": "I've had no issues MM as a warlock. Been less than 1 min per MM queue. I'm in the US West fwiw", "label": 0}
{"text": "This would fucking explain my rng for eyasluna and rose were absolute dog shit .", "label": 0}
{"text": "Dungeons are meant to be 3-man raid type experiences. They are closer to raids than other content. They have been making Dungeons more align with this goal as of late which to some might seem as a negative. \n\n>dungeons are supposed to a casual low intensity activity.\n\nI don't know when this has been the case. Most dungeons have been difficult on release (with bosses requiring 2-3 phases). If you are comparing it to stuff that has been in the game for 2-3 years than the difficulty is going to seem like a complete 180. Powercreep is a thing and you can feel it in the older dungeons. That doesn't mean that was how they were shipped.\n\nPersonally, I like the active final boss. By far the most chaotic encounter we have right now. It requires awareness, ad clear and dmg. You can have one person focus on clones while the other 2 do dmg. And he is a pretty easy 2 phase with a handful of weapons. \n\nOverall, there are some bugs but the dungeon as a whole is in a good spot and easily my favorite out of the bunch. The health pool argument doesnt really make much sense to me. Like at the end of the day, if a boss with 4mil hp & a boss with 16mil hp both die in 1 phase, then what is the point in talking about the hp. Its been raised because we hit so much harder than in the past. And the armor argument is a dungeon issue, not a Vesper issue.", "label": 0}
{"text": "I think you need to run it, my Titan didn't have the exotic yet, I tried to attune it before going in and couldn't.", "label": 0}
{"text": "That seems correct according to the steam charts. The start of this season has had the worst peak player count of any season so far. And it's only going to get worse as the season goes on. This season's peak was 90k. To put that into perspective, there were some end-season months last year that had nearly as many players. The peaks at the beginning of seasons last year were more like 130k-140k", "label": 0}
{"text": "I feel like they don't pay attention to the weekly stats every week, theirs a reason everyone's on hunter, and to add to it, the general trials player base is always very low after the first week. This would have been better in the first week. If you look at trials report, literally EVERYONE last week was hunter, its just incredibly annoying tbh.", "label": 0}
{"text": "Exactly, a 1 phase is a 1 phase. Hp # doesnt really mean anything if you kill it quick.", "label": 0}
{"text": "Luckily it should make pvp god rolls for gravitic arrest easier to get so I’m gonna hard focus on that before they fix the bug", "label": 0}
{"text": "dude thank you for this, saved for later", "label": 0}
{"text": "Idk but that roll dropped for me on the first prosecutor.", "label": 0}
{"text": "I'd love to know if this has been in the series since the very beginning (in other words, were drops in D1 also affected)?", "label": 0}
{"text": "But even all that wasn’t enough, since we didn’t catch it with Multimach last season!\n\nIt needed to happen **twice** before people started catching on", "label": 0}
{"text": "I can understand variety, but the playerbase is low enough. This isn't smart on their part.", "label": 0}
{"text": "Yeah, it's absolutely worse on Hunter. It took me over 30 minutes to play 2 games. I had a 10 minute load time and a 12 minute load time. It's horrible. Add to that needing to reset your card for whatever reason and this is about to be one of the worst weekends I've played in awhile.", "label": 0}
{"text": "Would this affect the perks on class items?", "label": 0}
{"text": "I'm not sure we're meant to be too scared of him. It's like \"oh this guy again. With a new toy. Let's figure out the best way to handle him\"", "label": 0}
{"text": "That tactics doesn't always work but it helps, and if you think that's the problem ita because of encounter deaign, if an encouenter forces a player to use cheese or non traditional methods tosucceed, then the problem is the design of the encounter not the method which they have to use to win, people have to stand on the tank because of how absurd the lightning strikes are, but you're probably right I just got frustrated cause a lack of execuse on my lart", "label": 0}
{"text": "This may be, but I didn't notice it since I spent twice as much time looking for games as I did actually playing the game.", "label": 0}
{"text": "I just mean if you only are a warlock, grab it anyway, even if it’s junk", "label": 0}
{"text": "Shaded Envy from TWQ", "label": 0}
{"text": "Also the only reason they’re craftable is because they’re reprised weapons", "label": 0}
{"text": "I am pretty sure they also presume/want they’d get a craftable reissue set with new perk pools.", "label": 0}
{"text": "Not sure why you're getting downvoted because you're right. The current crafting situation allows people to get enhanced god rolls with very very very very minimal effort. Many of the people in this subreddit just want to play menu simulator and have the game give them amazing loot just for playing the brain-dead easy seasonal activity for 10 minutes once a week.", "label": 0}
{"text": "Lucky!", "label": 0}
{"text": "Yeah, I thought I was going crazy bc I would load in on stasis and then see the surge was strand but I know I looked. I would then switch to strand but the next strike would be stasis.", "label": 0}
{"text": "this is fucking awesome. at this point i've already accepted that i will never get to use exotic class items because i don't want to do dual destiny. i'm so happy that i can finally get to try all the cool builds i've been missing out on.", "label": 0}
{"text": "The fact that they insist on keeping bounties in the game at all after introducing a brand new system and removing them from some activities as a result is weird honestly.\n\nIf they do exist, why AREN'T they just automatically available daily or weekly quests you don't have to pick up?!", "label": 0}
{"text": "Search the central limit theorem. Basically, they're milling down randomly generated variables into a set number of possible results with a set mean and variance, resulting in a bell curve distribution of perks.", "label": 0}
{"text": "In 2 years I've gotten that roll maybe 2-3 times max.", "label": 0}
{"text": "Thanks for the bug that gave me the new hand cannon in week 1 bungie, this way I don’t have to suffer in trials this season.", "label": 0}
{"text": "I don’t think you understand the complexities of this…", "label": 0}
{"text": "Yeah, playing as a Hunter or Titan is gonna be really, really tough.", "label": 0}
{"text": "You don’t understand what it was like when all of your rewards for an activity were shown to each other in D1. It was so fun seeing what your friends got and cursing them out for the exotic they got over you. It’s the same today when that one guy shouts they got Euphony first try when you’ve been doing it a million times and haven’t gotten it yet. This would ruin that, and make things wayyyyy too similar for each other. Destiny is meant to be YOUR guardian story, you make your own fate, your own builds etc, and D1 and partially in D2 here, you were meant to do that with the loot you got. If everyone gets the same thing at the exact same time, it takes away the magic with that", "label": 0}
{"text": "Yeah, it seems double perk weapons aren’t suffering a similar problem. Like I said, bungie has been completely unaware of this for possibly 6 years and they just happen upon all sorts of systems and combination distances that just kept avoiding a bad case scenario. It’s just insane thinking how many weapons have been put into rotation and it’s never been bad enough to warrant this research.", "label": 0}
{"text": "The clearest case of a more easily accessible god roll is Cold Comfort. On Cold Comfort, both Envious Assassin and Bait & Switch were in the same space in their respective columns, giving them the highest drop rate possible under the glitch. \n\nhttps://www.light.gg/db/items/839786290/cold-comfort/?p=,,,,,0,0", "label": 0}
{"text": "Oh dang. How long has it been bugged?\n\nI know the super energy from buffing allies is pathetically small", "label": 0}
{"text": "Hard to say exactly the impact, as depending on the nature of the underlying bug it could generating an additional perk could disrupt the correlation between the (first picked) third-column and fourth-column perks that we see. At the very least by forcing an extra perk you get another shot at what you want though. And hey, Rewind is arguably as good or better for that gun, so you've still got a great LFR.", "label": 0}
{"text": "They could at least have a way for people to know how much of what class is quing up.\n\nSo if there's a ton of Hunters then maybe it's a sign to que Titan or Warlock.", "label": 0}
{"text": "I do in fact like the Warframe version of this. When opening relics from relic missions. Everyone’s rewards are displayed and you can choose. \n\nBut a reward pool done differently could be cool. But limited to certain things like exotic engrams or ciphers or ascendant shards and stuff", "label": 0}
{"text": "Since the beginning of the season, no idea if Bungie knows either. Same for Mask of Fealty", "label": 0}
{"text": "Sure, and for the highest grade of cryptography, that matters. But for every day stuff like random rolls, the RNG algorithms we have are more than fine. Pseudo random number generation is unpredictable and has an equal chance at any number.", "label": 0}
{"text": "I knew it was a thing back last season of the haunted I made multiple comments on YouTube about the kinetic smg, it was impossible to roll rampage subsistence, it took me maybe 80-100 of them to get a single roll with that on. \n\nAnd also the judgment hc from prophecy, headstone + junkie is a 1/436 drop chance, that’s if you even get the gun to drop 70% of the time it’s armour, and yes I’ve done over 600 end boss clears of prophecy now and STILL do not have this exact roll for the hc. \n\nIt’s fucked", "label": 0}
{"text": "I’d be happy if it just showed all the possible perks for guns", "label": 0}
{"text": "they effectively \"fixed\" a problem, which in turn made a new problem.", "label": 0}
{"text": "> Easiest fix would be to kill the concurrent calls and seed the second call with the result of the first, which will cause the second perk to be super, duper random and not biased.\n\nIsn't this just how a single lcg works? Each iteration is seeded by the previous?", "label": 0}
{"text": "\\^this", "label": 0}
{"text": "Yeah I'm happy with the roll I got, but it was also the last one that dropped before I said good enough and gave up haha", "label": 0}
{"text": "Oh wow, that's actually a super tough question too.\n\nIn another comment thread someone linked me to an article talking about how gamers \"optimize\" fun too, and the article made an interesting point about how the design of the game *needs* to be aware of the player's propensity to take the shortest path to victory and design around that.\n\nOne example they gave was how \"rested\" conditions in games actually sometimes actively encourage signing out and taking rests into the optimal playpath.\n\nSo in order to actually study if gamers have an innate tendency to make games more fun or less fun, you would have to find a way to control for whether the game was *designed* with the optimal path being more or less fun? I have no idea how one would even do that.", "label": 0}
{"text": "I have a ricochet rounds / killing wind / swashbuckler-multikill clip but I will get this one for sure.", "label": 0}
{"text": "both times specifically in the blooming and specifically a bit after I finished the 3rd wave. on titan.", "label": 0}
{"text": "Volt shot is the perk that need the reload.\n\n\nWhen you said jolt shot I thought you meant jolting feedback. The new arc perk that jolts on sustained damage, no reload needed", "label": 0}
{"text": "Likely too many blocking calls to /dev/random that they were working around.", "label": 0}
{"text": "Class based MM was awful the last time they tried it (not in Trials) and population is way lower now.   \"Data driven\" decision... sure.", "label": 0}
{"text": "Bungie fired all the QA so they could get the community to do it for them free-of-contract lol", "label": 0}
{"text": "They've done it before  outside of Trials and it was a mess.  They should have known (and had to know) that this wasn't going to work this time.", "label": 0}
{"text": "I'm with you there.", "label": 0}
{"text": "I know it works. That’s why I didn’t mention it. Are you okay? You seem really stupid.", "label": 0}
{"text": "Release a developer insight on this whole situation please!!!", "label": 0}
{"text": "Perk for perk, no. They just allow the flexibility of not needing numerous versions of a weapon, or at least a lower amount of duplicates. It apparently wasn't too uncommon that I'd have 4, 5, or 6 rolls of certain weapons, just so I'd have my preferred rolls and a roll or two of alternate perks, ones that maybe had a nerf recently, or got power crept by other perks. The crafted weapons just allow you to swap out the perks if those nerfs/buffs happen that effect it.", "label": 0}
{"text": "That would be amazing. I would love that\n\nOr they just use a fish tank or ant terrarium", "label": 0}
{"text": "Same here I have one pre-final shape, but have been trying to get a better one. Farming class items in the Pale Heart gives so many Gunsmith engrams. I cashed in over 500 since final shape and zero Recon/Chill Clip.", "label": 0}
{"text": "Yeah I'm hoping they fix them soon, especially Wrathweavers. I also edited my last comment about the super energy problem", "label": 0}
{"text": "Had this happen twice while in a run with a clan mate. Generally found that for some reason if you clear the room too fast, it bugs out. What worked for us is to completely back out of the room, wait for the ads to respawn and then clear it again.\n\nIt’s pretty rough with all the bugs right now, good luck!", "label": 0}
{"text": "Damn, tell me more of these so I can farm em before Bungie fix it", "label": 0}
{"text": "Wait until they get to the point where you have to rebind \"hold to disable loot filter\" from Alt to  something else because if you don't Alt+Tab shows so many items your game crashes.", "label": 0}
{"text": "because it requires having to actually cooperate, coordinate, and communicate with your team which is annoying for someone like me who has no interest in doing any of that stuff. i don't mind playing with randoms in stuff like nightfalls and onslaught because teamwork is completely unnecessary and you can just do your own thing while pretending the other players in your fireteam are npcs helping you out.", "label": 0}
{"text": "It’s dead, Jim.", "label": 0}
{"text": "They learned their lesson back in 2017 that they can’t get away with outright lying to the community when the game almost died. Not everything’s a conspiracy.", "label": 0}
{"text": "Oh I know that lol game modes been on life support for a while just general question as to what people think caused it", "label": 0}
{"text": "NN NNEEEEERRRRRRRDDDDSS!!!!", "label": 0}
{"text": "Seeing a lot of Warlocks posting about getting timed out. Wonder if all the prismatic hunters switched to Warlock rather than splitting between Warlock and Titan", "label": 0}
{"text": "I don't see why they would lie about this, it seems like a genuine oversight from how weird it is to replicate. They'd be jumbling their own code for little to no reason on pretty much every gun. \n\nI get that \"ooo bungie isn't trustworthy\", but i genuinely think this was unintentional.", "label": 0}
{"text": "Need Xur to sell Coldheart catalyst again. Almost have 10k kills with it, fav exotic in the game, but no catalyst. Feels like it’s been DARCI almost every week", "label": 0}
{"text": "That's the thing, *I don't know.* I keep running into people that had immense trouble finding that roll. *I* was never able to find it. \n\nNow it's also clear that the roll obviously exists in high numbers. My personal theory, with everything that's transpired recently, is that it was affected by the bug. I'm not exactly sure how 7x7 weapons were affected. However, ITL was showering us with so many drops that most were able to beat the RNG and get the drop. Some of us weren't, due to RNG still being RNG. If the odds are 1/400 or whatever, you can still drop 400+ and miss it.\n\nRemember also that light.gg (for the most part) only checks weapons in the player's inventory. There's an extra layer of confirmation bias that someone who got the ALH+R roll is more likely to be using it over another special than someone who didn't end up with it.", "label": 0}
{"text": "What was in 2017?", "label": 0}
{"text": "Bro, chill", "label": 0}
{"text": "No. We should be able to re roll perks at the gunsmith and make him and his engrams useful for something again.", "label": 0}
{"text": "Well, difficult to pin down, but for me it’s the loot. Nearly everybody has a decent Shayura’s and Summoner, those weapons have been around for a while now, so why bother? I have a god roll of both of those, so what’s my incentive to go flawless? Materials? I have 5000 enhancement cores, I can just buy the materials you get. \n\nIt’s a looter shooter, so putting up loot from last year isn’t gonna twist anybody’s arm.", "label": 0}
{"text": "Yes. After learning that all act 1 story would be available at act launch I was kinda ready to just play my story. One lackluster mission later and it was over. No cool lore, massive let down. I have 20 of each tonic if feels like and have used them maybe twice. It's too much of a hastle to check if I still got a buff for everything I do.", "label": 0}
{"text": "The surplus \"luck\" is pretty marginal. For 6x6 perk weapons for instance, an adjacent perk combination is around a 1/20 chance instead of 1/36. The only combinations meaningfully effected are the furthest perk combination which are around a 1/400 chance for a 6x6. Even the second lowest likelihood set of perk combinations is only down to around a 1/50 chance.", "label": 0}
{"text": ">>They fixed it so fast it's like they already knew what was up, and had said fix waiting on standby in case shtf, as it did.\n\n\nI missed where they fixed it. Was there a blog post or a tweet where they actually have a fixed?", "label": 0}
{"text": "I’ve said it in other threads, but I’ll say it again. After a month or more after the crafting thing was known, I made two arguments…. 1) Mechanics, balancing, and artifacts are changed all the time. so not being able to craft and alter my guns reliably means the thing I grind now can be useless soon, rendering the grind meaningless; and 2) RNG based grinding without a pity system like crafting or even simple attunement can and WILL mean that someone can farm forever and never see the weapon they need, there is no light at the end to focus on.\n\nI was assured by people in the community, “nah, just grind them out, it’ll feel more rewarding and it won’t take as long as you think”….. and then WITHIN A WEEK IF EACH OTHER… ignitions break, leaving entire builds useless, forcing people to other guns and loadouts; and then we find out that drops are unintentionally “weighted”, meaning the possibility of someone never seeing the weapon they want isn’t just real, it’s likelier than we thought, lol. \n\nIt’s almost poetic… bungie saying it’s fine, and then immediately it all crumbles. They legitimately couldn’t have had a worse set of occurrences happen as they tried something new. And now they have TWO major gear drop events coming up, Halloween and Iron Banner, both of which people will be farming for drops… so the pressure is HIGH now for them to fix this as quickly as possible, especially given both events are big for getting players in game. And they had the nerve to preview the Halloween weapons this week, I do NOT envy the dev team right now.", "label": 0}
{"text": "I can see that as well but what about when it is a new weapon like this week", "label": 0}
{"text": "weve also had many times where the community freaks out over the tiniest thing and spins entire conspiracies put of it. Whats your point?", "label": 0}
{"text": "Lmao yall are hilarious", "label": 0}
{"text": "A) bungie never denied perk weighting didn't exist, but that they weren't doing it intentionally and had to investigate if there was a bug/issue in their code.\n\n\nB) bungie followed up after the initial post confirming again it wasn't a thing done intentionally but believed there was a bug.\n\n\nC) bungie came back a day later going over the community data, which sped up this whole process confirming the bug existed and saying its a 1st priority fix, with a potential fix being tested.\n\n\n\n\nD) you have to realise no one noticed this in the community till recently and it's not really a thing you'd think to have to track all the time especially since individual perks drop equally the issue is the combos which is a more abstract thing to find.", "label": 0}
{"text": "Yes, that’s why I said exactly what I said in the way I said it….", "label": 0}
{"text": "This is a bug that goes back years, and it actually worked in the players favor on multiple guns and made god rolls more likely, which is part of why it went unnoticed for so long. To think this is intentional to stretch playtime when it has been \\*beneficial\\* to players in the past instead of a hindrance is just ridiculous.", "label": 0}
{"text": "That was by far the lowest point in the franchise’s history and it’s not even close, even Warmind at least had a few cool things (whisper mission mainly)", "label": 0}
{"text": "When it works it's great for survivability and super damage, I think the super regen is a good idea but the way it's gained is a horrible idea.", "label": 0}
{"text": "If Bungie really wanted to cash in on the grind they could make the craftable have specific perks and the drops have others. You can still craft other rolls for some builds of the same weapon but if you want say a Voltshot/Eddy C roll on the same gun that specific perks combo could only be obtained from drops and enhanced.", "label": 0}
{"text": "I was one of those people. If I thought it wasnt real, why the fuck would I now think they did it, and did it maliciously? Explain this line of logic you have, OP", "label": 0}
{"text": "Average Bungie problem lol", "label": 0}
{"text": "Yeah I mean it depends on how potent the weapon is. If it becomes meta, you might get more of a pickup next time round.", "label": 0}
{"text": "It's really funny to think about that it's unintenionally been in our favour this entire time :v", "label": 0}
{"text": "https://x.com/Destiny2Team/status/1849888122055897215?t=UuyCY-FHVkGWzzR27LWWZQ&s=19", "label": 0}
{"text": "Weird that they did that instead of just keeping some code from Y1, since fusions were in the heavy slot at that time.", "label": 0}
{"text": "Fantastic design! Seeing as Bungie is currently putting out fires for the perk drop rate system, I would say your idea couldn’t come at a better (or worse) time lol. I don’t imagine this would come to pass anytime soon, but this is the kind of change I would love to see implemented!", "label": 0}
{"text": "It was obviously unintentional, and as soon as the community and Bungie caught wind of it, they have addressed it and implemented a possible solution. It came up this week, and Bungie has addressed it 2 days later. They are now working to validate that solution.\n\nEverything is not a conspiracy.", "label": 0}
{"text": "So if it’s the same column it’s more likely? This is crazy", "label": 0}
{"text": "None, shards don't exist anymore.", "label": 0}
{"text": "Anyone who posts the malicious angle gets blocked. It makes things much more pleasant.", "label": 0}
{"text": "Like play the new cod that just came out for real", "label": 0}
{"text": "That's very insightful, thanks. It could definitely be any of those as it's always around the same time (I am in America as well)", "label": 0}
{"text": "ok but what about:\n\n>!complexideez nuts!<", "label": 0}
{"text": "Maybe so then, guess I'll just die lmao", "label": 0}
{"text": "destiny 3 idea", "label": 0}
{"text": "“Bungie said there’s no weighting, you’re just unlucky, Bungie has all the data, just a conspiracy”.   \n\nHonestly the main issue is that Bungie clearly didn’t playtest to make sure their system worked the way they said.  Their initial dismissal of the entire thing was silly, why wasn’t this simulation done right away?  And the Bungie defenders that continually whined about “incomplete data” took a fat L.  Bungie doesn’t have all the data and relied on crowdsourcing to actually get it right.  People wasted time chasing rolls that were basically impossible.  With the amount of money spent to play the game, it should work the way it’s said.", "label": 0}
{"text": "I'm going to apply a lighter to one of the lava lamps in such a perfect way to slightly tip the favor of getting a godroll VS chill inhibitor", "label": 0}
{"text": "Well that is also because for them it is not fun. \n\nWhy it is not fun ? Because it takes too long to find a match and when they do it's hard sweaty matches with 3 teams over the entire weekend with possible connection issues cheese load outs ( name an excuse here ) etc \n\nHow I described it many times was Bungie is Trying to feed the PVE Sheep to the PVP Wolfs, but the sheeps are no longer going because they know better. \n\nSo it is only wolfs in the pool and wolfs are not having fun playing because the weaker of them are becoming the sheep now, so they dip because they are no longer having fun. \n\nPeople are also moving from D2, possibly a re-work might fix something but the main issues stays there.", "label": 0}
{"text": "Translation of the post:\n\n\"We got caught and the system was designed to make players stay in the game for longer than needed so we can justify the money companies gave us, we're not sorry but we'll pretend it wasn't intentional and now we need to fix it (we would change a couple things)\"", "label": 0}
{"text": "Sorry my reading comprehension is bad, I misunderstood.", "label": 0}
{"text": "I don't know shit lmao sorry man\n\n\nI'm just some guy on the internet speculating that xp gains no longer show once you reach the seasonal level cap. ", "label": 0}
{"text": "I mean yeah maybe, I’ve found the most useful method is arc hunter close combat with a 1-2 punch shotgun and whatever the mod is that collects stuff when you dodge", "label": 0}
{"text": "You could farm the first encounter too.. it's not guaranteed, but it takes ten minutes tops to complete.\n\nWeightgate also means the chances of that God roll chill inhibitor is extremely low.", "label": 0}
{"text": "Context? What do you need 250 baron kills for?", "label": 0}
{"text": "It's probably a bug in the transform that they use to turn a sequence of PRNG results into perks.", "label": 0}
{"text": "There is also the possibility that those were two different employees and the whole thing was because of a lack of communication at the company between Employees.", "label": 0}
{"text": "Just wait for the nerf. It always happens.", "label": 0}
{"text": "What is also annoying is getting the same things over and over in a negative way. Out of all my runs of Crota, I have not had a single handcannon or auto drop at all. OK, I haven't run it 100 times, but all I get is shotty, scout and LMG. I even only got the pulse a grand total of ONCE. It really wears me out, it's never been great but my patience for RNG grinds is wearing so thin it's practically invisible.", "label": 0}
{"text": "I’m betting it’s the equation used to derive the random seed?", "label": 0}
{"text": "Title I assume.", "label": 0}
{"text": "What is the shader called? I haven't gone flawless in a while. Also will cobalt clash still drop? I didn't get it last episode 😭", "label": 0}
{"text": "It's also supposed to be for kills too right?", "label": 0}
{"text": "Gives me Ruffian vibes from Plunder", "label": 0}
{"text": "\"Utilizing your special\", especially if you mean killing something or waiting for attrition orbs to spawn orbs creates much more downtime team taking a single shot even with a fusion rifle. That being said if you're doing BnS swaps you pick weapons that have high burst in single shots to keep up the dps. You pick suitable weapons.", "label": 0}
{"text": "The crazy thing is that you can still see the pattern on a lot of older weeapons no one cares about.  Double Edged Answer, the vanguard sword from Season of the Wish, has *very* clear trend lines despite being older.  You can go back even further than that but it does start to get a bit smudged out.", "label": 0}
{"text": "Ahh okay. I hadn't looked at the emblem page too closely.\n\n\nNo Slayer Baron for me I guess. Onslaught is okay but it's not something I want to do 50 times.. holy shit", "label": 0}
{"text": "Can you imagine if it literally just always existed but only got caught now because of it being a meta weapon and giving the best roll the lowest odds?", "label": 0}
{"text": "Ha ha fair enough.  It'll remain a mystery for now.", "label": 0}
{"text": "50 times doesn't scratch the surface my man. It's such a slog", "label": 0}
{"text": "Is the Hunter population super low?", "label": 0}
{"text": "every time someone uses the term \"weightgate\" I get a mental image of a rollecroaster with a sign saying \"must be this heavy to ride\"", "label": 0}
{"text": "Which beaver incident? The biggest one I remember was a steam issue and not a Bungie one so them making a post outside twitter would be strange, but there have been other smaller issues that you may be referring to.", "label": 0}
{"text": "We will put failsafe in darci lets make it happen", "label": 0}
{"text": "It ultimately was a steam incident. Season 10ish I believe. It was a menace to figure out though and was a destiny problem for a long time", "label": 0}
{"text": "**Swapping out any item, mod, or perk on any item will reset all overflowed magazines.** This was an intentional change to make swapping between Envious Assassin and Cascade point in column 3 of Edge Transit unviable. It affects many things in the game right now and it doesn’t matter if what you changed has any effect on any magazines in your loadout..\n\nChanging your special weapon triggered the reset. Dark Ether Harvest balls are not what causes the overflow reset, rather something with a similar name: the **Ether Siphon seasonal buff** expiring also triggers a reset. Others have explained in this thread.", "label": 0}
{"text": "Oh my god it's real", "label": 0}
{"text": "Commendable they investigated it and admitted there was an issue.", "label": 0}
{"text": "You really just wanna shit on bungie as much as you can huh? What else do you want them to do?", "label": 0}
{"text": "If it was brought down a bit it would be fine. It's for a title after all - its meant to be a grind", "label": 0}
{"text": "So you're telling me I could grind enough to get a legendary weapon specific tonic, pop it, and still get more weapons than the one the tonic specifically lists?\n\nThe engram focusing system can't come back fast enough.", "label": 0}
{"text": "I really want to know how long this was going on for. \n\nYears and years of loot discussion and changes to whole direction of the how the game developed was based around availability and access to good rolls. Only to find out now, 7-10 years later that there was a significant flaw in the algorithm that made those chase rolls significantly harder to find.", "label": 0}
{"text": "I'm all for the grind. It just feels like it might be too much. The average player isn't playing onslaught as much as i am.", "label": 0}
{"text": "It’s because we’re not getting story beats every week. They fundamentally misunderstood the problem with their approach to storytelling in Echoes, and somehow made it worse. When you don’t get that expected excuse to log in every week that naturally propels you through the content, it feels hollow.", "label": 0}
{"text": "They're adjacent, so our current working theory suggests it'd actually be the most common, although it looks like the perk pool was 7x6 so maybe it was uncommon for the same reason that causes the checkerboarding effect on adjacent perk rolls in 12x12 perk pools.", "label": 0}
{"text": "That's why I stopped farming for the arc autorifle in Prophecy.", "label": 0}
{"text": "Yeah but they didn’t want people farming Shuro Chi or whatever so the kill droprate is pretty weak", "label": 0}
{"text": "I must have missed this news. Great news!", "label": 0}
{"text": "They have not", "label": 0}
{"text": "I fucking hate being herded into choosing a loadout someone else wnats me to choose.  It's pish.", "label": 0}
{"text": "Dont remind me of Equinox…", "label": 0}
{"text": "We should get to pay Bungie fake money when buying the game.  See how they like it.", "label": 0}
{"text": "I think is more like the number of each perk in each column repeats ( i mean is not totally random), so when  in column 1 we get perk 4,  in column 2 whe get the same number more often.", "label": 0}
{"text": "He’s probably doing 10 run ones. \n\nAlso there’s more barons in the later runs, there’s 2/2/2/3/3 if i remember correctly", "label": 0}
{"text": "Reverse monkey paw moment", "label": 0}
{"text": "According to a plutoshiki5302 on Aztecross's video on it, this was an attempt to normalize the distribution of the two perks as if they were dice. When you roll two dice, the chance of getting a specific sum is not equal (like craps--7s are more common than snake eyes or boxcar). \n\nBut this is a dumb reason to normalize probabilities because the sum of two perks means nothing from a gameplay standpoint. While a dice roll of 4 and 2 is the same sum as 2 and 4, they are totally different perk-wise.\n\nFinally, it looks like this probability normalization appears to be designed for a 4 x 4 combination of perks. So we're talking Red War weapons.", "label": 0}
{"text": "It really, really isn't.\n\nIn a full 50 wave run you get 10. In higher waves on expert, 3 spawn per rescue eliksni event.\n\nThey're almost certainly going to be present in at least some of the future campaign missions, as well as the act 2 activity and certainly the exotic mission as well.\n\nWe've not even gotten three weeks into the sixteen week long episode and you're already complaining about being more than halfway through an objective?", "label": 0}
{"text": "CoD just came out. It's going to suck a lot of population of a lot of PvP games.", "label": 0}
{"text": "Play the game more… bet you still don’t have a god roll exotic class item.", "label": 0}
{"text": "This player pop count goes way further back than just this week tho", "label": 0}
{"text": "Had to comment to hopefully restore some faith in you if you had lost any due to these people. \n\nI've dealt with multiple people like this over the past few days and it reminds me of this quote, \"You Cannot Reason People Out of Something They Were Not Reasoned Into\". People who cant see the obvious trend in these tables aren't ever going to be able to reasoned in to seeing it.\n\nAnd more specifically about people saying the normalization is \"manipulating\" the data to have a trend just makes no sense at all. To manipulate the data to have this trend you would need to use the trend while manipulating the data for this trend to appear but simply averaging the numbers somehow forcing the trend in to this data would be a magical coincidence.", "label": 0}
{"text": "This is a genius idea", "label": 0}
{"text": "You can only kill 2 per run with it counting. Atmost maybe 5-6? You're wrong", "label": 0}
{"text": "Yeah destiny PvP has serious design issues that likely aren't solvable.", "label": 0}
{"text": "Also I'm pretty sure act 2 and 3's activities will also have barons there as well so there isn't just onslaught.", "label": 0}
{"text": "This bug impacted the god rolls of reckoning weapons. Probably too long ago for most folks to care, but this has been a great eye opener for all kinds of weapons that have been farmed over the years.", "label": 0}
{"text": "This is exactly what I’ve been doing and waiting for.  \nTriton is fun with winterbite. The only downside is that when playing with others ads tend to die faster that the ice ball can reach them.  \nBut meleeing reloads and overfills to 6 shots which as awesome on bosses", "label": 0}
{"text": "Oh definitely. No way it’s the RNG itself, but what is being done with the values.", "label": 0}
{"text": "No I got plenty of them, grinded too much even. \n\nThis system is much more complicated, for the class items you don’t have to unlock the perks one by one, they just give you the option. And they should not just give you the opportunity to attune every perk right off the bat. The system is not described", "label": 0}
{"text": "Hunters would need to match with warlocks and titans, and they make up less of the players, so it would take longer to find available class’s", "label": 0}
{"text": "Spoken like an overconfident CS student.  Nobody who's ever worked on large and complex production systems would ever say something like this.", "label": 0}
{"text": "I mean not really they have had peak point where pvp players look back fondly forsaken 30 anniversary even beyond light with the stasis menace is looked back generally as better than we have now in terms of general pvp. Trials and general crucible I feel personally share the same issue as when they try to cater to newer players or people who don't frequent pvp they end up hurting the playlists more than they help it", "label": 0}
{"text": "Bungie please for the love of everything that is holy NEVER do this labs mode again. The queue times are the worst I’ve ever experienced.", "label": 0}
{"text": "That all sounds really good and interesting, but I think the work involved would basically require destiny 3.", "label": 0}
{"text": "It's funny because this drama actually validated me, because I got **so many** of that exact fucking roll.\n\nLiterally I probably saw 100 mountaintops total and at least 10 were that roll - which to be clear is still an outsized % of my total but it was funny to me at the time.", "label": 0}
{"text": "And all these people were on here shaming people who were saying something was off with rng 🤷", "label": 0}
{"text": "If there is an awful unreasonable grind that people are complaining about, it will be nerfed. This is always the case, it’s why it’s basically never worth it to get FOMO’d with most content here, they’ll make it crazy easy near the end when they want to pump engagement.", "label": 0}
{"text": "This is actually really good thank u for taking time to explain more with reasoning rather than sweats don't get to pub stomp anymore response like a lot of people do", "label": 0}
{"text": "> For the last few years, more times than not, it has actually worked in our favor.\n\nI don't think so. Assuming each weapon has one 'god-roll' combo, and that where that god-roll is positioned in the perk slots is uniformly distributed, having a weighted perk combination table will increase the expected number of drops to get a god-roll on average.\n\nFor example, if you take the Perfect Paradox data [here](https://d2-loot-tracker.vercel.app/rolls) and assume that the observed drop rate exactly matches the expected value for any 6x6 weapon, then create 36 new weapons each with their god-roll in a different position, the expected value of the total number of focused drops needed to collect all 36 different god-rolls would be ~4019, while with a uniform drop distribution it would be only 1296.0 drops - a difference of over three times as much.\n\nThe actual historical results might have been different. It's possible that the god-rolls on meta guns might historically have fallen more towards the favorable slot combinations, whether by chance or some quirk of the human-involved design process.\n\nAlso of note is that we have only considered the third and fourth columns, and I haven't seen any data or analysis of first/second column combos and masterworks. First/second column is interesting because for most guns those columns are a fixed pool in a fixed order, so if there is similar correlation it could mean that certain combos of first/second perks are more likely, and if that lands on desirable combos it means more likely 5/5 god-rolls, but if not it would mean the inverse.", "label": 0}
{"text": "What do you mean? This is clearly a new idea for Bungie, and I haven't seen a UI mockup with this exact idea every 2 months for at least 6 years.", "label": 0}
{"text": "I just wish you could focus for an item that you haven't got yet. I have no idea how, but I still don't have any helmets from Duality on (dungeon wise) and Crota on (raid wise). They just don't drop helmets for me and I haven't completed any of the armor sets. I don't even care about the armor itslef, I just want to unlock the transmogs and be done with it already.", "label": 0}
{"text": "It doesn't have to be a competition to the bottom.", "label": 0}
{"text": "I think the argument is people keeping saying the perks are weighted when this is the third time this week bungie has said perk weighting doesn't exist. They literally said it's an issue with perk pool rng. They have refused to say it's a weighting issue this entire time even once they found said problem. And people keep saying weight gate when rng gate makes more sense.", "label": 0}
{"text": "I have one but I got it a while ago", "label": 0}
{"text": "I have no idea what you're trying to say", "label": 0}
{"text": "That doesn’t really fit with echoes though where they set up an entire new villain, poorly if I may add.", "label": 0}
{"text": "It’s up to Fenchurch", "label": 0}
{"text": "11 per run? Show me", "label": 0}
{"text": "It does exist. It does really well too", "label": 0}
{"text": "I believe there’s 15 revanant barons per expert run so that’s only 17 expert clears to hit 250. \n\nOn normal you get 10 per run so that makes for 25 clears to hit 250. \n\nOnslaught salvation isn’t very rewarding currently so I still wouldn’t bother grinding these kills yet but it’s not as bad as you make it out. Run the normal mode not the 10 round mode.", "label": 0}
{"text": "Yeah but you cant make every gun craftable. Tell me what the point of gunsmith is.", "label": 0}
{"text": "YES!!!!!!!", "label": 0}
{"text": "Just can not get a game. 13 min queue for the last game and currently at 6 for this one. Bungie please revert to normal trials, this is a great idea in principle but it’s not working when the queue times are so long.", "label": 0}
{"text": "Show me baby", "label": 0}
{"text": "Show me baby.", "label": 0}
{"text": "My math on expert is wrong because I forgot you don’t get 3 until later waves so it’s a couple more runs but it’s still probably around 20 runs", "label": 0}
{"text": "Shout out to the team that had this thrown on their plate. I hope they are doing well", "label": 0}
{"text": "Yeah and it fuckin rips.", "label": 0}
{"text": "Yup. Like velocity baton where high ground slickdraw was an impossibly rare roll. This has probably helped us more than it has hurt us. ", "label": 0}
{"text": "You're right it only counts if you damage them... Most of the teams I've played with have not managed to kill them alone.\n\nI've run **eight** full 50 wave runs (visible as triumph metric), at least half of them on expert. And then I've run fewer of the 10 wave playlist. And I'm at 108/250. Which means I'm averaging something like seven Baron's per 50 waves.\n\nAgain. **We're less than three weeks in...** The titles are not meant for the average joe. 250 Baron's is **nothing**.", "label": 0}
{"text": "Show me the math. Show me where its more than 2.", "label": 0}
{"text": "If you have the Final shape, and friends or just someone to help you get through the legendary campaign you’ll get higher level stuff. Play Onslaught from the Vanguard tab after Attuning to weapons you like (1 special 1primary and 1 heavy) and then get some cool looking armor and synthweave templates bounties from Ada-1 in the tower!", "label": 0}
{"text": "If the tracking is messed up then that’s an issue but I haven’t checked if every kill is getting tracked on my end.", "label": 0}
{"text": "Oh really? I haven't ran the 50 yet bc it says it doesn't have matchmaking", "label": 0}
{"text": "You need to have done dual destiny on each class for the class to have attunement available ", "label": 0}
{"text": "Well no, but comparing ruffians to this is an insane comparison considering that they barely spawned, despawned, etc. \n\nBarons spawn 12 per 50 waves guaranteed.", "label": 0}
{"text": "He sells us guns, as he has for 10 years?", "label": 0}
{"text": "Why do you assume things will change with frontiers?", "label": 0}
{"text": "Almost definitely. ", "label": 0}
{"text": "How did it get fixed i still cant change my name?", "label": 0}
{"text": "i think it's pretty clear this has always affected it, we just haven't had cause to notice before.", "label": 0}
{"text": "All of them are matchmade, even expert difficulty.", "label": 0}
{"text": "Which desirable rolls on the brave weapons were affected?", "label": 0}
{"text": "* The bow can get Sympathetic Arsenal and Rapid Hit.\n* The pulse can get Surplus and either Domolitionis or Wellspring. It can also get Outlaw.\n* The auto can get Subsistence and Thresh, which makes it a weaker, solar AR version of Bad Juju.\n* The shotgun can get Auto-Loading Holster and Opening Shot, making it a usable choice for the double shotguns DPS strat.\n* The machine gun is one of the few that can get Dragonfly.\n* The rocket's only good perk roll is Ambitous Assassin and either Chain Reaction or Cluster Bombs. Maybe Pulse Monitor and Unrelenting if you have a death wish.", "label": 0}
{"text": "In any 50-wave run, there's what, 13? \n\nSo over the span of four months, you need to play 20 of those. That's one every six days. \n\nThat does not strike me as unreasonable.", "label": 0}
{"text": "If you think that is the same, then you clearly don’t know what you are talking about", "label": 0}
{"text": "If you think they make more in a Month than we’ll earn in our lives you really need a better job.", "label": 0}
{"text": "There has been a reliable way to gather data, it was just never a fun as sought after as this one. The api has been open for years.", "label": 0}
{"text": "Whats yoyr current baron kills?", "label": 0}
{"text": "If you aren’t capable of checking the math on how many runs it takes to get 250 when you’re getting 10-12 per run then I really don’t know how to help you. The updated answer for doing expert wave 50s is about 21 runs btw lol", "label": 0}
{"text": "Like ppl are saying, run the 50 wave and you'll get more per rescue if you get to the later rounds. I can make a video of me running it if you seriously need proof when ppl are telling you as it is. Also you don't have to speedrun the mode. You can't get most of the weapons yet, so you might as well grind Act I while the pool is small for what you do want and then wait for more weapons. The title shouldn't be rushed tbh", "label": 0}
{"text": "Technically, we got a second one in the form of the Season of Plunder season pass exotic", "label": 0}
{"text": "No, theyre two different perks that happen to share the same icon.", "label": 0}
{"text": "Got kick 3 times already 🤦‍♂️ I clear cache on steam still guitar. overthrown on blooming", "label": 0}
{"text": "“Anti Crafter” Ohh give it a rest ffs 🤣", "label": 0}
{"text": "It’s the same amount as it’s always been. You just been able to do it all almost right away.", "label": 0}
{"text": "Reset it, enter 42...", "label": 0}
{"text": "Show me your guardian name. I'll look at it and learn", "label": 0}
{"text": "50 wave normal onslaught has matchmaking, expert does not.  This affects both onslaughts vanguard and seasonal. Trust me brother I only run the 50 wave one", "label": 0}
{"text": "I farmed that one for a while and that combination actually eluded me, damn", "label": 0}
{"text": "even expert? I just commented that it didn't because the vanguard didn't have it. Or am I tripping", "label": 0}
{"text": "Quick to reply because I'm on my phone. And I literally just told you I don't know how many baron kills I have. I'm not going to share my Bungie name with someone as aggressive as you're being right now. \n\nWhen I get home, I'll log on and check. Whether or not you believe me, that's up to you.", "label": 0}
{"text": "Yeah, it was the same issue with the original Onslaught.\n\nThe Nightfall playlist also says it isn't matchmade, yet it is (though not on higher difficulties).\n\nI hardly look at what the playlist says, because they're so unreliable. I'm sure there's several more examples. Though it's definitely a major issue that Bungo should fix.", "label": 0}
{"text": "[https://www.polygon.com/destiny-2-guide-walkthrough/23611953/power-level-cap-powerful-pinnacle-gear](https://www.polygon.com/destiny-2-guide-walkthrough/23611953/power-level-cap-powerful-pinnacle-gear) here is a guide i found on google", "label": 0}
{"text": "Assasins cowl can also be good with grapple", "label": 0}
{"text": "kinda...we only need 40 of those iirc, 250 would be absurd. \n\nStill, having to manually sabotage missions by throwing motes away in hopes of giving the game time to spawn a ruffian sucked so hard.", "label": 0}
{"text": "Expert is literally match made lol", "label": 0}
{"text": "what if i have zero interest in running a 50 wave run...like ever?\n\nI honestly can't fathom why you people are willing to play so much onslaught, it wasn't particularly fun back in may, it sure isn't fun to grind AGAIN now.", "label": 0}
{"text": "Got it a while ago before bungie nerfed the chest farm. Really good with choir of one", "label": 0}
{"text": "50 wave expert also has matchmaking.", "label": 0}
{"text": "I've run expert matchmaking several times.\n\nThe original onslaught did not have that no, as far as I remember.", "label": 0}
{"text": "We all know the fix will break something else...", "label": 0}
{"text": "meh, trials is a cancer on this game as is, i'm fine with anything that makes the experience worse and the population smaller.", "label": 0}
{"text": "It's always funny watching people double down on being so hilariously wrong. It's a few months thing, why grind out the title now?", "label": 0}
{"text": "Shoq me your completion", "label": 0}
{"text": "Tf do you mean show you? Why don’t you just count? Or is arithmetic too hard for you?", "label": 0}
{"text": "You only need to do the all overthrow stuff once to unlock the mission on all your characters and you don't need to do all the overthrow secret bosses in a row. Just jump into the matchmaking for overthrow once a day to get thru that quicker and then look up where the secret bosses spawn at afterwards and go kill them. Then do the next zones the next days if you don't have a fireteam to roll thru the other 2 faster with.", "label": 0}
{"text": "Or just go watch a YouTube video? There's hundreds of full clears, you can go count", "label": 0}
{"text": "You can look back even further and see hints of it, I think it's been in since they did the perk column change, but no one has cared enough to notice. I saw some in the recent logs from lightfall.", "label": 0}
{"text": "Because you are arguing repeatedly with people telling you how many you get per 50 waves. I'm barely playing the game now and don't chase titles as I think they are irrelevant", "label": 0}
{"text": "Show me your completions.", "label": 0}
{"text": "Yeah I’m in the same boat. Dipped out midway through beyond light. Just got back in the last month and getting to grips with it all again has been a bit much. A lot of the time I just sit staring at the director for an hour wondering what to do. \n\nOne thing I would say that took me waaay to long to figure out is to run Vex Strike Force public events on Neomuna for exotic armor pieces you’re missing. It takes like 10 mins and it’s a guaranteed drop. They’re pretty rare but there’s an account on twitter called Asher Mir that will give you an alert and a 4 minute warning. \n\nThe past few weeks I got zero new exotic armor pieces from regular activities but since but since finding this method a few days ago I’ve got 12 already. \n\nI feel you. I would love to run some raids. Haven’t done it since D1. But I just can’t face putting in the effort to get a PHD from Kackis HD YouTube academy just so I can join an LFG squad without getting insta-kicked for my noobness\n\nI would recommend using the fireteam finder for dungeons / exotic missions though. I’ve had some great experiences.", "label": 0}
{"text": "Really bad wait times for games - at least 15 mins but more like around 20. Another stoke or genius by bungie :/", "label": 0}
{"text": "Yes have had for a while.  When it works it's amazing but sometimes you just get zero super back and are left head scratching.", "label": 0}
{"text": "Wheres your completion video?", "label": 0}
{"text": "Even gambit doesn't say it's matchmade...", "label": 0}
{"text": "Got it on tuesday through Dual Destiny.", "label": 0}
{"text": "Hopefully what it does is give more options for crafting", "label": 0}
{"text": "We could just dock his limbs and throw him in a box", "label": 0}
{"text": "> Ya got 250 kills of barons?\n\nNo? Because we're eighteen days into the episode...", "label": 0}
{"text": "Thats the post.", "label": 0}
{"text": "What u/PineappleHat said. But also for me, the lack of communication/care towards cheaters. I know, I know, sounds like a lame excuse. But my true story is I'll watch some of the streamers play for an hour or two at launch while working on other stuff, and keep an eye on the population to see if I want to play. \n\nI hover around 1.1-1.4 k/d so I can hold my own, but not carry anyone. I can't hold my own when the population is below like 7-10k, unless if I want to play 70-100 games for 1 flawless run.\n\nIt only took about 20 minutes of bouncing around streams to find this weekend's first hard hacker. I mean full immunity shields, full super to start and every round, etc. \n\nAlong with seeing a frustratingly consistent amount of players pop up on [destinytrialsreport.com](http://destinytrialsreport.com) 's \"weekly first flawless\" have some wild KD jumps.... Trials has become the epitome of \"bungie doesn't respect my time\" and I f!@#! hate that argument for video games. \n\nAnd it's a bummer because I wholeheartedly believe Trials should be set up like the labs this weekend. I don't think it's possible to properly balance a pvp sandbox around triple prismatic (anything - but really hunters).", "label": 0}
{"text": "Ok this I get, it’s a good job to watch for them. I don’t get many teammates like this though, they just kind of stand out in the open and wait to die. If I don’t invade nobody seems to either. Also, machine guns in this mode seem sillier than actual PvP.", "label": 0}
{"text": "Well, we don't know the real situation. AFAIK, there was info that there is no built-in tool to change individual perk odds, and i suppose there is no real reason for bungie to make this. Yeah, the community will be happy with this addition, but this means that less time is needed for players to get the desired roll, so player population in some game modes(such as crucible or trials) will decrease much faster than now and that will lead to reddit posts like \"*enter the gamemode* is almost dead and i can't farm weapon i need\". Also, we need to remember that Destiny 2 engine is more than 10 years old, and there is a really high risk of breaking the RNG system and even the other game engine aspects because of that feature.", "label": 0}
{"text": "*Looks at the Legend title with legend drops in a single zone with a full set of armor) when?", "label": 0}
{"text": "Speaking of issues: First secret chest in Vesper's Host can be opened only by 1 person in fireteam. Is it bug or the chest is intended to work that way??", "label": 0}
{"text": "There is also a triumph for doing 50 completions of 50 waves.", "label": 0}
{"text": "Just keep playing, you will replace everything. Also word of advice: don't use two primary ammo weapons especially with an LMG. You're doing literally no damage and severely holding yourself back from doing harder content. Put on a grenade launcher/rocket and use a special weapon, better stuff will come. If you have the season pass, get a bunch of episode echo engrams and focus armor at failsafe in the helm, put on a discipline mod on your ghost and get armor until you have high stats (focus on getting 100 resilience first, then recovery and discipline)", "label": 0}
{"text": "This is the dumbest comment that I ever absolutely loved.", "label": 0}
{"text": "Whaaaaaat this dumb ass idea of matchmaking by class has incredibly long load times?? Especially when bungies kept hunters so broken for years now that almost half the PvP population is solely hunters??\n\nMy my who could’ve seen that coming.", "label": 0}
{"text": "Dang, I mean I didn't think to look into that one, but that's crazy", "label": 0}
{"text": "Got it", "label": 0}
{"text": "Tx.", "label": 0}
{"text": "Vindicated huh?... And I'm sure you also thought something was up when you got the rolls you wanted that were MORE likely, right?\n\n\nYou don't get to blame the system only when it works against you. I'm sure you were out there on your soap box \"these God rolls are TOO common\". You going to lost the \"insane amounts of time\" you didn't spend farming for certain rolls that dropped quickly because of this system? Of course not.\n\n\nGet over yourself ", "label": 0}
{"text": "People are trash at Gambit.  I carry 85% of the games I play and I’m not great.  People also tend to invade when opposing team’s primeval has full health which is a total waste.", "label": 0}
{"text": "Plunder had a similar triumph to kill 250 champions on expeditions. An expedition had 2 guaranteed unstoppable champions (ruffians) and 2 champions that both had a chance to spawn. Ruffians could also despawn if an encounter was completed too fast and did not count if you didn't tag them, so you could get 0-4 champions for a triumph that required 250.", "label": 0}
{"text": "https://www.light.gg/god-roll/popular/trait-combos/\nLooks like since TFS", "label": 0}
{"text": "You need to damage them for it to track, i.e. you can't be afk and let your team kill them for you.", "label": 0}
{"text": "that would explain my warlock. but ive done it on my titan before, ill try running it again see if its just an odd bug or im remembering it wrong, thanks", "label": 0}
{"text": "Do the 50 wave onslaught. In the 3rd wave set and beyond you get 3 barons instead of 2. Normal is piss easy and has matchmaking, expert takes slightly longer amd is difficult but you get double the loot.", "label": 0}
{"text": "Did you end up getting one to drop?", "label": 0}
{"text": "If you play all the time, he’s not for you. He’s for new players. We have to have a vendor like him so that newer players have some kind of catch-up mechanic.", "label": 0}
{"text": "This, bro. The information hiding in this game for no reason is insane", "label": 0}
{"text": "Actually, screw it, I'll post them anyways.  \n[https://imgur.com/a/NJdUULH](https://imgur.com/a/NJdUULH)", "label": 0}
{"text": "So I haven’t played trials in months and only wanted to jump in because of the increased rank week. And holy shit, I’m sitting here waiting 10 times as long as I ever did to get into a match. It really does make you question why bungie does what it does and who makes these decisions. They want to retain people and have them play the game but then they make it annoying to do so ", "label": 0}
{"text": "I like the idea of attunement, but I feel like it currently gives you too high of a chance to roll the perk you want. I’m attuning exotic class items right now and I don’t think I’ve gotten a single one that didn’t have the perk I’m attuned to. Which like, I guess is how it’s intended, but it basically feels like I’m cheating.", "label": 0}
{"text": "Higher waves on normal also give 3. Just did one last night because fireteam finder said f you summon fireteam doesnt actually summon your fireteam and I couldnt be stuffed getting another group for expert.", "label": 0}
{"text": "I did matchmade, but I doubt it matters. My clanmate said it took him three overthrows to get one", "label": 0}
{"text": "? I have more completions than you. What ars you trying to say?", "label": 0}
{"text": "Yeah I do invade and as a pvp main I do well, but I shouldn’t always have to. I take less issue with having to invade as I do with the team being bots and getting farmed out in the open by opposing invaders and undoing all the work I’ve just done. If I wasn’t invading I wouldn’t be getting killed and most likely would pick off the invader. Honestly I don’t ever play gambit so this is new to me and I’m trying to understand the logic.", "label": 0}
{"text": "Yeah I’ve noticed this too. I’m not a gambit player but it seems simple enough.", "label": 0}
{"text": "I spent around... 4 hours of my time total since the title released grinding that area with the armor... im only at 37% so tbh im no longer interested fuck em", "label": 0}
{"text": "why do you have interest in running the 10 wave version but not the 50 wave version? the 50 wave version is objectively better in terms of time efficiency and loot and its subjectively better in terms of fun since it’s more difficult. you can’t play the weenie hut jr mode and then complain that how it isn’t fun to shoot red bars that die if you breathe in their direction.", "label": 0}
{"text": "Why would this have any impact on crafting?", "label": 0}
{"text": "My completions and title completions eclipse yours. Come on baby girl", "label": 0}
{"text": "ur embarrassing urself homie", "label": 0}
{"text": "Yyyyup. When not enough people are on track for the season title, they'll tune it.\n\n\nEither that or there will be other activities where barons are more abundant.\n\n\nOr both", "label": 0}
{"text": "Yeah you are", "label": 0}
{"text": "Working as intended 😆", "label": 0}
{"text": "Were there any class-agnostic swords in Y1? \n\nUsually these things happen with weapon classes that came out around the same time. Ticuu's and the bow which came out in the same season could both explode enemies that Ticuu's had marked. I could totally see 1K inheriting some properties of a new sword type that was released in the same expansion.", "label": 0}
{"text": "But aren’t you just so engaged with the content?", "label": 0}
{"text": "What class are you playing?", "label": 0}
{"text": "I am actually. Love it", "label": 0}
{"text": "If anyone sees this, don’t bother helping this dude out. He’s a dick who refuses to admit he’s wrong in doing just the 10 round versions of onslaught simply resorting to blustering to make himself seem right when he clearly isn’t. You get 3 Barrons per 10 rounds for 30-50. \n\nI am expecting a “show me” \n“Show me your Barron kills” \n“Oh you you haven’t done it either” \n\nWhile I agree that 250 is excessive, OP is a prudent person who likes avoiding a solution (albeit minor) to help solve his issue so that he may continue to complain and using his accomplishments (of killing more barons than anyone trying to help) to refuse help", "label": 0}
{"text": "Post of the year", "label": 0}
{"text": "3v3 kinda sucks in this game. I don't enjoy being put randomly on a shit team in Trials against either stacks or a much better team. I have no patience for wasting my time that is limited. I thought Trials was okay before the expansion ended. I thought it was improving. They completely fucked it up. I won't even touch 3v3 anymore. It's garbage. 6v6 is tolerable, but I wish we had 4v4 or 5v5 comp. Trials can stay 3v3, but in reality I just don't give a fuck about it. I don't want to commit that many games to that shitty RNG in a 3v3 mode. I just don't really enjoy 3v3 in this game outside of using a stack. I don't like playing solo 3v3s, but I would play Trials if matchmaking was basically random solo 3v3.\n\nThat's the only way. Fuck Bungie and their engagement. They can watch their game die from their bathtub.", "label": 0}
{"text": "Lol. All i said in my post was 250 baron kills was alot. Your creating a narrative that is scary and uncalled for. Stop it", "label": 0}
{"text": "They said that this episode would feel awkward with the new cadence, as it was built with the 3 week structure in mind. Likely heresy will be more fleshed out.", "label": 0}
{"text": "Just my opinion but\n\n I don't want the same stuff as everyone else. This sounds like such a double edged sword. Sure if the one thing we all want drops we are done, but if me and Joe Smoe want something different we got to run this thing twice as much because the same thing drops for everyone.\n\nAnd there's no way to know what's going to drop so you can't group up with people that want the same thing as you.", "label": 0}
{"text": "This is not a scary narrative, those are quotes and facts derived from people trying to help you and your comments.", "label": 0}
{"text": "Whos helping me? I said, 250 baron kills is alot.", "label": 0}
{"text": "Yeah but there’s definitely people who run too far with the bugged rng. Like I saw someone thinking the funky rng is why they couldn’t get a keep away igneous hammer. Not any specific perk pairings just keep away", "label": 0}
{"text": "No one obe is helping me. Read the post", "label": 0}
{"text": "2 perks away, so yes slightly.", "label": 0}
{"text": "Priority should always be given to new unlocks tbh. The VH code chest is a huge step in the right direction at least", "label": 0}
{"text": "I’m waiting for Dawning’s LFR that comes with it", "label": 0}
{"text": "Don’t you get the whole season to complete these challenges?", "label": 0}
{"text": "I think they could have been solved.\n\nI suggest 4v4 or 5v5 comp. Maybe 4v4 and them make 6s into 5v5. New players don't like getting destroyed, but they really hate getting destroyed when there is not even a chance to move.\n\n3v3 is boring because abilities still dictate wins way too much, some game modes are inherently garbage or just niche to a lot of people, and Bungie walked back everything they fucking said about Crucible and worked for in the last year to break out all kinds of ability spam. Nobody trusts this dev team on Crucible anymore. For very good reasons.", "label": 0}
{"text": "I agree that the disparities of supers ie twilight arsenal and blade barrage have in trials is ridiculous I don't think u should receive your super at all unless it's going to time every single round and goes 4-4 trials should be a skill expression at the most extreme. Gun play slightly enhanced by abilities not what we have now where prismatic hunter can spam u and instant u almost at the start of every round", "label": 0}
{"text": "Isn’t this how crafting was originally planned to be? Like the first blog or video about it said your idea", "label": 0}
{"text": "All those wasted hours farming lol.  Ill never get that time back.  Messenger being the biggest bitch of a gun.", "label": 0}
{"text": "I still haven't done VH yet but now I'll definitely have to!", "label": 0}
{"text": "I actually have this done already lol\n\nAnd I only been doing Onslaught powerful/pinnacle drops and to upgrade weapons", "label": 0}
{"text": "They have refused to say it's a weighting issue period unintentional or not. Look at their last two responses. That's all I'm saying man", "label": 0}
{"text": "I think the sandbox is just too huge and difficult to balance for a PvP game. Having this much stuff to tweak and fit is just a lot of chaos.", "label": 0}
{"text": "Theyve acrually identified a potential fix. I think they said they will push it in the act 2 patch.", "label": 0}
{"text": "Eventually you will vault or dispose of everything that isn’t exotic from your early hours. The game continuously throws loot at you like it’s candy so much so that even your overflow into the post master will be full. I think of my early guns that aren’t exotic I only still have a night watch scout rifle and a couple of swords", "label": 0}
{"text": "Just ran it last night, my friend hasnt done any of the quest and he got one to drop, so yes its a possible loot drop on master", "label": 0}
{"text": "Stop lying. It takes alot of runs to get it done.", "label": 0}
{"text": "Well I think I know what I need to do to get that last team wipe for the seal", "label": 0}
{"text": "thats good to know, thank you !!", "label": 0}
{"text": "So that's 25 full wave 50 runs. At an average of 1hr per run, that's 25hrs. You don't think that;s excessive?", "label": 0}
{"text": "As someone with a full time job, i hate crafting. Maybe only letting crafting exist for underpowered archetypes would be fine but its existence is a bane to the game", "label": 0}
{"text": "Would be amazing if Bungie didn’t already say, with the storage this would need, and the computing power would make the game abysmal to work on and play.", "label": 0}
{"text": "Now for that 10000 silver compensation \n\n/s", "label": 0}
{"text": "I don’t think bad gear is the problem, I think it’s that your new and don’t know what a load out should look like and what makes good weapons. \n\nA good load out tends to have a primary weapon, special weapon (uses green ammo) and a heavy weapon (uses purple ammo). Some people run 2. Special but this is very advanced so I’d recommend to basically never do this but the important thing is 2 primary weapons is very bad, try to always run a special weapon.\n\nWeapons can perform one of two roles in game, killing lots of little things quickly (ad clear) or killing one big thing quickly (damage). 99.99% of primaries are ad clear so the reason you want to run a special is to normally have that weapon good at killing non boss big things like champions, non boss yellow bar enemies etc. heavies are usually used for damage where different heavy weapon types fit different scenarios except machine guns which are used for ad clear and are taken when you don’t need to kill a boss.\n\nI’ll quickly try to fill you in on perks now so you know what to look out for. I’ll refer to 1st column and 2nd column perks, this being the 3rd and 4th column of your weapon as they are the perk slots. For all weapons the 1st perk tends to be a more stat/reload focused perk that doesn’t normally effect damage but might allow you to reload faster. The 2nd perk column normally rolls damage perks and splash damage perks. A great primary can sometimes get damage perks in the first slot allowing you to run both perks that give splash damage and increased bullet damage but these are late endgame weapons.\nAs for primaries generally 1st column perks like rapid hit, feeding frenzy, rewind rounds etc are great as you either reload less or quicker allowing you to kill stuff quicker. Perks that give stats like dynamic sway or killing wind are more PvP focused as you don’t care about laser beam stability for killing a thrall. For the 2nd column damage perks like kill clip, rampage, multikillclip, explosive payload compete with options like firefly, dragon fly, incandescent, volt shot, kinetic tremors that are splash damage or even have elemental synergies. For low light content I’d recommend a splash perks over a damage perk but it’s preference really.\n\nFor heavy weapons perks like bait and switch, explosive light are very good damage perks that are combined with perks like reconstruction, envious arsenal, envious assassin, auto loading holster if your a rocket or grenade launcher or fourth times the charm or rewind rounds if your a linear fusion. Swords like whirlwind blade and relentless strikes, always the god roll on a sword.\n\nFor specials the perk choices are similar to primaries so I’ll quickly explain the what each special weapon does. Rocket side arms are for both ad clear and killing big guys, wave frame grenade launchers are for ad clear, regular grenade launchers are for killing large targets. Shot guns and snipers aren’t popular options unless they are in the artefact but shot guns are killing big guys, snipers are actually used for boss dps some times and arnt normally run in non raid/dungeon content. Fusions are used for boss damage as well. Traces and glaibes arnt commonly used.\n\nI’d recommend looking up a guy called aegis on YouTube, he makes the be all and end all tier lists to get more precise info on this and if you want and particular recommendations on weapons just ask", "label": 0}
{"text": "Was the shader just not dropping at all prior to this week? I made a post and nobody reported a shader dropping last week", "label": 0}
{"text": "yep, and there will undoubtedly be perk placement weighting apologists lol", "label": 0}
{"text": "Actually it's 200. Source: I'm at 123.", "label": 0}
{"text": "row, not column.\n\ncloser to each other in the api, the more likely.\n\nit also wraps vertically.", "label": 0}
{"text": "Whats your bungie name. Id like to see how ya got it done", "label": 0}
{"text": "Where do you get 2? Should be like 10-15 per run with the early rounds have 2 and the later rounds having 3 i believe.", "label": 0}
{"text": "So many weapons in Destiny are viable across many activities other than end-game. \n\nWhat exactly about your weapons makes you think they are trash? Are you maybe trying to do content that has power level requirements that are too high? If that's the case you have to be patient and play activities that are suitable for your account.\n\nIt will be a slow grind to increase your power levels, especially after you hit the soft cap of 1950. \n\nMake sure you aren't deleting items (weapons or armour) that have the highest power level in that slot. Even if you don't use them, you have to keep them until they can eventually be replaced by higher power level items.", "label": 0}
{"text": "I'm not good at PvP. Invading would be a waste.\n\nI watch the mote count on the opposing team, and  try to make sure that I won't be holding motes when an invader comes. \n\nI couldn't hunt an invader if my life depended on it. So I hang out by the bank, the invader is bound to show up. They never seem to notice that I have zero motes. They just want to get *somebody*. I've lost count of how many invaders are dumb enough to ignore my mote-laden teammates and waste heavy, supers, sometimes both, on the guy with no motes. I once had someone solo Blade Barrage me at the bank, then rush back to spawn and kill me again with some Gjallarhorn. I'm sure Uncle Drifter was pleased.  Tell you what OP, *this* is who you should dread playing with.lol\n\nSometimes I get into an engagement and even win. Usually thanks to Jotûnn. I got a OHK on someone with Heir Apparent, shield up.\n\nTl:Dr: Don't sweat it if your teammates are timid about invasions, they may not want to waste it. Better them than folks who don't know how bad they are, and waste invasions.", "label": 0}
{"text": "Good things you have more than half of the episode left, including a new horde your game mode in act 2 and an exciting mission in act 3. Both of which most likely contain more revenant barons. Can you ask so complaining about everything?", "label": 0}
{"text": "Not the same person dumb ass", "label": 0}
{"text": "Yes thats how rng works", "label": 0}
{"text": "Adept catty with spikes/envious/cascade/bns.", "label": 0}
{"text": "Where’s the lie? I didn’t say it didn’t take a lot of runs lol", "label": 0}
{"text": "The achievement, is kill 250 barons in onslaught salvation. I'll say it again. Onslaught salvation. 250 baron kills.", "label": 0}
{"text": "Not gonna lie, I've enjoyed both forms of Onslaught. Just popping on some music or a podcast and playing it has been pretty fun, though I can understand how its not some peoples cup of tea.", "label": 0}
{"text": "It definitely helped avoid perk combos no one wanted.", "label": 0}
{"text": "you severely underestimate how incompetent people are at all companies", "label": 0}
{"text": "So he stopped arguing with me because he couldn't think of any more \"I know you are, but what am I?\" type comebacks. But he's flexing his raid report and dungeon report on people who are calling him out and [this is just the most precious thing I've ever seen.](https://imgur.com/a/PcDyM5j)", "label": 0}
{"text": "You are regarded", "label": 0}
{"text": "Collections, go to your collections and reacquire a fusion rifle", "label": 0}
{"text": "You have it done. Can ya show me via title ya have it done?", "label": 0}
{"text": "Whats the roll on that nowadays?", "label": 0}
{"text": "I just got it today from Gambit. Now am working on getting it completed", "label": 0}
{"text": "About 20 times", "label": 0}
{"text": "Matador has to be one of these fucked guns.", "label": 0}
{"text": "This is a bit more likely to be intended because Stasis and Strand are energy damage, not kinetic damage, and treated as such by anything not specifying Energy SLOT.", "label": 0}
{"text": "It was hard as balls first week. Just had to learn to play like a coward and have sustain. Invis hunter is convenient for res or just living", "label": 0}
{"text": "\\>there's no code that allows this to happen", "label": 0}
{"text": "Tonics aren't a focus system, they're a bonus drop system, so they aren't changing what you're already getting as drops, just having a chance to add to it.\n\nGranted that doesn't really explain OP's drops, that seems like a bug. But if say, you're getting other Onslaught weapons while using a Tonic for one particular one, that's normal expected behaviour because it's not focusing.", "label": 0}
{"text": "Oof, see that pinched a nerve. Didn't mean to offend ya there, bud.", "label": 0}
{"text": "I have like 5 and I never focused it.\n\nHowever it took me well over 100 tries to get a single ALH/Recomb mountaintop, which is what I had focused the entire event.", "label": 0}
{"text": "The no crafting or proper focusing really highlighted it. Know knows how long this has been a thing.", "label": 0}
{"text": "Yeah baby. Pinched a nerve. I cannot wake up tomorrow and live my life.", "label": 0}
