{"text": "Quite.", "label": 1}
{"text": "Quite.", "label": 1}
{"text": "Quite.", "label": 1}
{"text": "It looks like you are posting about the perk combination bug that is making the rounds on the front page and Twitter. Please use one of the [currently active threads](https://www.reddit.com/r/DestinyTheGame/search/?q=perk+combination&t=month) at this time. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DestinyTheGame) if you have any questions or concerns.*", "label": 1}
{"text": "Make the video. Send me the link. How many baron kills ya got?", "label": 1}
{"text": "So you have no grind going on. I have more completions than you. Stop waving yout hand and acting better. I can give you my raid report or general bungie name.", "label": 1}
{"text": "This is weird how adamantly you want people to send you videos and proof when you can simply just log in and do the 50 wave mode yourself and see. Stop telling people to prove things because you’re lazy and stubborn.", "label": 1}
{"text": "So you dont have the completions.", "label": 1}
{"text": "Ahhh. You don't have it completed. Gotcha", "label": 1}
{"text": "Is that meant to be some sort of gotcha?", "label": 1}
{"text": "Show me your completed onsalught salvation runs", "label": 1}
{"text": "[https://outplayed.tv/destiny-2/n4PVdm](https://outplayed.tv/destiny-2/n4PVdm) here", "label": 1}
{"text": "Show yours first champ", "label": 1}
{"text": "Cool, I'm glad you're so trusting of strangers on the internet. I'm a little more wary, especially when the asker comes across as the kind of person that would send incessant whispers insulting me as I try to play.", "label": 1}
{"text": "You’re an odd one, and that’s something on this sub. Enjoy wasting your time in game and life doing your 10 wave runs.", "label": 1}
{"text": "Red-dead-ocelot on raid report, dungeon report and whatever else", "label": 1}
{"text": "Shut up dude", "label": 1}
{"text": "my guy ive done like 2-3 50 wave runs and im on 50, its not that hard to do something if you really care about it that much", "label": 1}
{"text": "Who cares about what? The post said 250 baron kills is alot. Hey my guy. Learn to read", "label": 1}
{"text": "[https://imgur.com/a/G4VN7rj](https://imgur.com/a/G4VN7rj)", "label": 1}
{"text": "it really isnt, you just wanna have something without having to do anything for it", "label": 1}
{"text": "That's such an icompetent sentence lol", "label": 1}
{"text": "NoHopeNoCure#6260 on all reports feel free to take a look buddy", "label": 1}
{"text": "Whatcha got here. I shared my raid report. You asking to go further?", "label": 1}
{"text": "My guy, your talking about completions and title completions eclipsing mine, im simply saying your free to look to me up and see how very wrong you are.", "label": 1}
{"text": "My guy. Im saying 250 completions is alot. That was the post.", "label": 1}
{"text": "Ohh so you’re just a miserable cunt. Gotcha.", "label": 1}
{"text": "Must worked hard for that one, your friends teach you that one at snack time?", "label": 1}
{"text": "oh wait, I just got it. You're trying to ego me over the first raid in the game. Lol, for a minute there I thought you were having a stroke. Yeah, that's not really how it works. You can't just get carried 6 years ago and try to ego people that are better than you. Nice try, though.", "label": 1}
{"text": "I can't tell, are you feeding these responses to a chatbot or something?", "label": 1}
{"text": "Lololol yeah baby. My ego lolol", "label": 1}
{"text": "Yeah bud.", "label": 1}
{"text": "yeah, you seem to hold it in high regard.", "label": 1}
{"text": "I'm so upset. I can't wake up tomorrow. My life is over", "label": 1}
{"text": "How angry are you gonna be when I get bored of you and stop replying?", "label": 1}
{"text": "How long that take ya doucher?", "label": 1}
{"text": "There's people you can talk to for that. But they can't help you get raid or dungeon completions unfortunately, they might be able to help you do some basic math so you can better understand that you only need to do around 20 runs of onslaught for 250 baron kills, though.", "label": 1}
{"text": "I'm so upset. I should cancel my ps5pro preorder. I should stop living in my 2400 a month apartment. I should stop going to my job where i make 1400 a week  Your right. Im crying. Im so done. I'm so tired  of my life being so good. I should stop it. I suck. I'll be better. I'm so sorry", "label": 1}
{"text": "No! Not the insecurities showing. Now I just feel bad.", "label": 1}
{"text": "Im so sorry babay. I dont dessrve any of this. I'll be better baby. I swear i cancel all of of it", "label": 1}
{"text": "You don’t have to call me baby all the time, do you think I’m your uncle or something?", "label": 1}
{"text": "Im sorry man. Touch me further", "label": 1}
{"text": "God, this thread really messed you up, huh? What a roller coaster of emotions you are.", "label": 1}
{"text": "Eww your gross. Stop touching me. Pervert. I have proof. Reported", "label": 1}
{"text": "Im so distraught. I can't sleep. Who am i?", "label": 1}
{"text": "What havw you done cunt", "label": 1}
{"text": "Oh no. I'm so sad. Anyways.", "label": 1}
{"text": "Hows my dick taste? A little salty? Smell ot", "label": 1}
{"text": "Are you actually 17? This is an impressive lack of self awareness", "label": 1}
{"text": " Smell my ass", "label": 1}
{"text": "? I just answered the question that you asked in the comment that I replied to. I displayed no hostile tone in my comment, and simply provided you with the information that you explicitly requested. So I'm not sure why you're sad. I'm sorry about that.", "label": 1}
{"text": "Mmmmm   my cock is hard", "label": 1}
{"text": "Didja forget to wipe?", "label": 1}
{"text": "ok", "label": 1}
{"text": "Question", "label": 1}
{"text": "Just checked.\n\n14 full clears, 3 failed Expert clears. Activities.report is not tracking my Playlist clears (the 10-wave ones), but I'll ballpark that I've done ten of those. \n\nTotal Revenant Barons slain: 200.\n\nIf you cut out the 20 from the Playlist, that's 180 Revenant Barons slain in 14 full + 3 Expert, which results in 10.5 Revenant Barons per run.\n\nHave you tried shooting them?", "label": 1}
{"text": "According to the CDC \"Two-thirds of lesbian women (67.4%) reported having only female perpetrators of intimate partner violence\" and the rest reported men. The number of lesbians they surveyed that reported being a victim of intimate partner violence was 43.8%. If you remove the 1/3rd that reported they faced violence from a man likely a past relationship before realizing they were lesbian), that brings you to around 29%. Which is actually lower than the 35% of heterosexual women who reported being a victim of intimate partner violence, 98.7% of which reported that it was a man who was doing the violence.\n\nKinda crazy to bring up the statistics on their violence rates when they're kind of actually better than straight relationships.", "label": 1}
{"text": "Dude, just take your ass on some where else and play some manly tough guy shit over there and leave Us alone because we're scared Fikrel and don't appreciate your yapping", "label": 1}
{"text": "The CDC? For crime stats?\n\nLet's try that again.", "label": 1}
{"text": "No, the original comment was about \"Maya only being a threat to her wife.\"", "label": 1}
{"text": "[you are definitely right ](https://youtu.be/S3rftYmaW7k?si=3I5A0tp2W65SKoVX)", "label": 1}
{"text": "What's worth $10 or not worth is completely subjective and hence many of my friends can't play them and they don't feel it rewarding enough to spend the money required. I unfortunately agree. It's not worth the money. You get a whole new open area and a bunch of weapons, rings, amulets and Armor in remnant 2 for that price.", "label": 1}
{"text": "I realize Im very late to this thread but i really need to just say\n\n\n\nF U C K  Y O U bungie for this fucking piece of shit lost sector. I enjoy challenging content but you have a flair for making shit feel insanely unfair and stupid, esp when 30 under light. It's truly a feat of wonder how fucking idiotic this piece of content is.", "label": 1}
{"text": "Because it already has intrinsic Unstoppable.  Weapons cannot have TWO champion perks at the same time.", "label": 1}
{"text": "Riskrunner.  Still the most broken gun in the game for 95% of content.", "label": 1}
{"text": "I really dont think ammo is an issue whatsoever in patrols LOL.  If thats an issue you are having .. thats a 100% a skill issue.", "label": 1}
{"text": "That’s literally what they’re saying, stupid.", "label": 1}
{"text": "It looks like you are posting about Destiny Rising, the new game developed by Net Ease and licensed by Bungie. Please feel free to contribute your thoughts in one of the existing announcement threads, developer insights, or trailer reveals. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DestinyTheGame) if you have any questions or concerns.*", "label": 1}
{"text": "You guys would fucking hate ttk, roi or forsaken today, I guarantee it. The \"best expansions\" had not an ounce of crafting and people were happy. You guys are just spoilt burnout players now, just ducking admit already.", "label": 1}
{"text": "Wrong game, mate.", "label": 1}
{"text": "Lol, i wanted to Replay to the other comment, o well, nevermind XD", "label": 1}
{"text": "You are beyond delusional", "label": 1}
{"text": "You literally get one on your first completion.", "label": 1}
{"text": "Who do you think you are?! 1v1 me bro.", "label": 1}
{"text": "You're a fool for still arguing despite being proven wrong. Subclass keyword effects are not the same thing as having an intrinsic anti-champion effect. By your logic, every legendary weapon that rolls chill clip has \"intrinsic\" overload and unstop. They don't. You're wrong. The end.", "label": 1}
{"text": "maybe he's just being a dipshit and is posting things to annoy and mislead people", "label": 1}
{"text": "This is most likely the true reason lol", "label": 1}
{"text": "Idk cry about it I guess \n\n\n\n\nYou're already doing it so it should be easy ", "label": 1}
{"text": "Yeah bro sure you only wrote a long ass post to have a little weep ", "label": 1}
{"text": "Players please recognize that Bungie doesnt give a \\_\\_\\_\\_\\_ about what you want. \n\nThe sign on Bungie HQ quite literally reads\n\n**\"We make the games that WE want to play\"**\n\nIt does NOT read \"We make the games that YOU want to play\"\n\nRemember that.", "label": 1}
{"text": "What the hell are you doing to get death threats? I’m not say DT are ok. I’ve played this game since launch. I have never received a DT. Been called a AHole and dumbass a few times. ", "label": 1}
{"text": "I just got word from Bungie, you're fired. They already got a replacement cock warmer already.", "label": 1}
{"text": "We hear you, motivation sunset.", "label": 1}
{"text": "PEOPLE DOING HAUNTED LOST SECTORS, PLAY THE FUCKING OBJECTIVE. DONT BE CAPTURING ZONES THAT IM ALREADY FUCKING STANDING IN", "label": 1}
{"text": "I promise you can shut up", "label": 1}
{"text": "**THEY CAN STILL HAVE THAT OPTION DUMBASS**. Get rid of the cipher cost on regular weapons, up the engram cost to 2, boom, you still have to grind but now everyone has access to the featured focusing.", "label": 1}
{"text": "you must be blind then, they do have the drop indicator, you would know if you werent up the cabals asscracks trying to take all the kills", "label": 1}
{"text": "Drops are infrequent, what are you talking about? You can target focus specific weapons with tonics. Just another crybaby with nothing better to do than complain. Crafting should have never been put into the game.", "label": 1}
{"text": "V4NGUARD is already a thing.", "label": 1}
{"text": "Oh shut up. This dumbass things people who speak different languages need to Google correct spelling in their language. 🤡", "label": 1}
{"text": "Ill do it again \n\n\\-Love Reziyy", "label": 1}
{"text": "Go ahead. That grasp boss you have is about to go bye bye", "label": 1}
{"text": "Oh no, not the downvotes 😱 I don't have time to worry about other people's issues, you snooze you loose", "label": 1}
{"text": "Lol who said you had to bitch boy? Plus, you’re doing an awful lot of “caring” here for not having time to worry about it bud. Grade A dumbass🤣 At least you know your place", "label": 1}
{"text": "Reddit keyboard warrior upset about 5 year old cosmetics 🤷‍♂️", "label": 1}
{"text": "Yet you keep coming back despite that claim lol🤣 you really aren’t good at that are ya?", "label": 1}
{"text": "It looks like you are posting about the perk combination bug that is making the rounds on the front page and Twitter. Please use one of the [currently active threads](https://www.reddit.com/r/DestinyTheGame/search/?q=perk+combination&t=month) at this time. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DestinyTheGame) if you have any questions or concerns.*", "label": 1}
{"text": "Nimbus 🤮", "label": 1}
{"text": "Yeah didn't you know having friends at Burger King is gay? Can't have that in destiny no siree.", "label": 1}
{"text": "Something that is rising, but isn't the Metal Gear", "label": 1}
{"text": "Yes, please keep consuming this pay to win mobile trash so the actual game keeps suffering. You people are absolutely retarded", "label": 1}
{"text": "Just say you're incapable of imagining anyone else in a situation not exactly like yours and fuck off.", "label": 1}
{"text": "more options the better and lets be honest theres alot of people who don't want to use mics and aren't comfortable using mics. you ever see those clips of women talking in game fucking yikes, maybe some people are mute or whatever the fuck", "label": 1}
{"text": "Yes, you’re stupid", "label": 1}
{"text": "r/destinyrising", "label": 1}
{"text": ">I think it's another case of them trying to deflect by blaming the community.\n\nYes, because a bum who spends more time playing Destiny than working definitely knows more than the software engineers who develop the game.", "label": 1}
{"text": "Social? It's a voice chat, it's voices from strangers coming from your headset, and you're a button press away from leaving if you don't want to be there. That's not social anxiety. People that have it struggle with being around people, and the key word is around. Real condition, but not over a voice chat, that's just creating a problem where it doesn't exist.", "label": 1}
{"text": "I’m wondering if there’s something you’re trying to say because after reading your comment a few times I’m still a little dumbfounded could you help me out and say it more clearly?", "label": 1}
{"text": "He means that your ancestors would be proud to know you conquered your tremendous fear of using your voice through a mic while some of them may have give their lives by talking through the powder, an amazing prowess that sure was needed to be shown on Reddit.", "label": 1}
{"text": "You don’t need to be a dick man, there’s plenty of others under this post that struggle with this same issue. Navigating social anxiety can be difficult and moments like this are a lot more meaningful than you think", "label": 1}
{"text": "Yes…socializing is talking in general lmao. You should speak with a therapist about your lack of empathy it might help you become I more understanding and overall better person. You sound like an awful human to deal with in person and over chat I bet you bully people over losing in trials 🤨", "label": 1}
{"text": "I guarantee your ancestors would be severely disappointed in you that you have access to something as amazing as internet and choose to use it just to insult some innocent dude on the internet.", "label": 1}
{"text": "Are you seriously trying to gatekeep social anxiety lmao? Why do you think \"social\" is used in \"social media\" then?", "label": 1}
{"text": "Yes, I bully people over a gamemode I don't play. Sorry, I only bully people on regular lost sectors. Try again pal. Are we socializing too? Is this it? Can I get scared over text? I might start sweating..don't know if I can handle this", "label": 1}
{"text": "I'm scared someone might follow me on instgram, nice definition of social. Anything is social. Even Reddit. Please don't reply, I have social anxiety, your words can make me feel nervous.", "label": 1}
{"text": "I don't think social anxiety is the mental deficiency you need to worry about", "label": 1}
{"text": "Yes? Social anxiety is a deficiency in ability to socialize without feeling stressed and anxious. There's nothing wrong with that. Your deficiency in common sense is another story.", "label": 1}
{"text": "So you're at a place with people around you and you can't leave, for some reason or another, so you have no choice but your anxiety quicks in. Nothing you can do.\n\nNow, you're on a voice chat with other people, someone says something and your anxiety kicks in, you feel nervous, if only there was a way of immediately not...like I don't know, leave. Crazy concept, but it might work.", "label": 1}
{"text": "Yeah you definitely need to seek some professional help… especially at your grown ass age. Your lack of empathy for others is beyond me and shows a lack of good morals. Plus your parents clearly did not teach you the standard that if you have nothing nice to say don’t say anything at all. You are too old to act like a fcking child😬 big ick on your part bro", "label": 1}
{"text": "I wonder if people from third world countries working in call centers, because they need the money and can't find anything else can also have social anxiety over a voice chat...\"Hey boss, I get nervous talking to people across the world with an headset, I don't think I can do it\". I'm sure this isn't a first world problem. Grow up, if everybody had social anxiety over an online chat, the world woulnd't fucking move.", "label": 1}
{"text": "bros a bit restarted. a little artistic if u catch my drift", "label": 1}
{"text": "Right, that sounded like \"I don't know how to reply to your comment so I'm gonna keep on focusing on you\".\nNever heard anyone being depressed or socially anxious online in the 90's, guess why, didn't exist. You were bored, you had a hard time talking to people etc. but not these new \"conditions\" that people love to come up with to justify their lack of adaptability or problem solving. Can't talk to people even on a voice chat? So I won't, I got an excuse, I have social anxiety, problem solved. So easy when you have an option right?", "label": 1}
{"text": "I'd love a code. Hopefully will come to people outside USA and Canada to try", "label": 1}
{"text": "Did I ask you about input?", "label": 1}
{"text": "No one cares if you did or not. You’re fucking cringe.", "label": 1}
{"text": "I used to struggle a lot heavily with the problem OP has, I also do it in real life around others. My problem I would say is overthinking, I used to use drugs to cope with it and they helped a lot. It was like I could fully concentrate on the game without thinking that people are judging me or looking down at me. It may also have to do with the fact I grew up online playing video games, not like decades ago where it was all in real life.\n\nBy now, I've improved my fears significantly but still have some issues. Also a recovering drug addiction.", "label": 1}
{"text": "Nobody uses \"pal\" anymore buddy, we're almost in 2025. What's next, bub? Or sport?", "label": 1}
{"text": "Nobody uses \"buddy\" anymore slick, we're almost in 2025. What's next, chap? Or fella?", "label": 1}
{"text": "Imagine agreeing with the guy gatekeeping social anxiety.", "label": 1}
{"text": "Guys, the troll is using a narrow self-made definition of social anxiety to try to discredit OPs feelings. We can stop giving them attention now.", "label": 1}
{"text": "Wow dude, you suck.", "label": 1}
{"text": "Eh, I don't care one way or the other if it's real social anxiety or not. I just think it's pathetic, lmao. Video games should really just be banned. Introduce national service and all these problems will go away. Have a nice day.", "label": 1}
{"text": "The only thing self-made here is being afraid of being in a voice chat in 2024 and coming up with the excuse of social anxiety, gotta have creativity for that. You also don't need to defend his feelings, he doesn't know nor care about you in the slightest.", "label": 1}
{"text": "So just to know, does Destiny Rising play well with Win11 and its Android capabilities? My phone is a bigger blueberry than me :/", "label": 1}
{"text": "Welcome to a public forum - when you say some dumb shit people get to call it dumb.", "label": 1}
{"text": "And you dictate what's dumb or not? You're just as useless as everyone here, calling stuff names without justifying it. I'm sure it's not dumb to tremble at the sight of joining a Discord channel, scary.", "label": 1}
{"text": "Nope, it's the general consensus that what you said is dumb. But looking away from a trainwreck is super hard.", "label": 1}
{"text": "General consensus, so the 4 or 5 sad people like you that think the same? I guess you're all in charge of Reddit and what's dumb or not, sorry. You guys have council meetings too? Would love to get in on those", "label": 1}
{"text": "Brainrot is real 🤷‍♂️", "label": 1}
{"text": "1) People can leave almost any social situations whatsoever. Choosing to stay despite the anxiety doesn't magically make it not anxiety. It's more debilitating for some people than others\n\n2) There is absolutely nothing about the definition of socializing that requires physical proximity. But I guess it must be true because some douchebag arbitrarily decided to make that a requirement?", "label": 1}
{"text": "Braindead comment.", "label": 1}
{"text": "That's a weird take, honestly. For every reply there are dozens of people browsing lmfao - again welcome to public forums. You keep enjoying those very unique opinions.", "label": 1}
{"text": "said the troll clearly brigading from subredditdrama with 0 post history in either destiny2 or dtg, that kind of troll?", "label": 1}
{"text": "Look at this guys post history, he's gotta have some voices in his head\n\nBlud going into comment karma debt", "label": 1}
{"text": "I'm so confused. You are capable of acknowledging one illness but not the other? They are both irrational. Social anxiety is not rational, you can't say that one type is realer than the other.\n\nReally confusing way to argue", "label": 1}
{"text": "I think his ancestors, like most people's ancestors, would just be incredibly glad to hear their descendants get to live lives of comfort and tranquility", "label": 1}
{"text": "I just wanted to share with the class", "label": 1}
{"text": "I use fella and folk sometimes.", "label": 1}
{"text": "Obviously because it's uncasual as fuck.", "label": 1}
{"text": "Fuck off", "label": 1}
{"text": "dm", "label": 1}
{"text": "You admitting to being a casual only further backs up what I’m saying big dawg lmao. You missed out, oh well, strap on your freebie Rahool mask and move along. Being a casual player means you will miss out on shit. Veteran players deserve to have shit that you don’t, even if it’s something trivial like a Halloween mask.", "label": 1}
{"text": "lmao lil bro bein' victimised by acronyms", "label": 1}
{"text": "rarer gear than you, higher skill level than you, more money, and i get nothing but platinum no name random, more clout than you, and infinitely better than you🥱🥱", "label": 1}
{"text": "This entire dogshit site is cringe, and all you people do is cry in this subreddit lmfao.", "label": 1}
{"text": "Remove armors from loot pool if you want", "label": 1}
{"text": "If you run the corrupted strike every 100 flawless runs (regardless of difficulty) it gives a chance of dropping any of the new seasonsal stasis weapons which includes rake angle thats how i got it early. I was confused af lmao", "label": 1}
{"text": "Then you’re just lying or they changed it lol", "label": 1}
{"text": "I don’t even play this game anymore and have no intentions to come back. I was just curious what they could do. The responses I have gotten shows that all of you left on this corpse of Destiny deserve your eternally underwhelming and time wasting experience though. Especially the obvious master race clowns.", "label": 1}
{"text": "Is ThAT wHaT i ASkeD yOU? \n\nToxic fuck.", "label": 1}
