{"text": "Leave it....you did a great job.  The more you mess with it the worse it will get.  What you have there is VERY acceptable and looks great. Step back and say...DONE... Move on to the next project!!!", "label": 0}
{"text": "I've never successfully burned and turned a tool. I can never bring myself to sell one. At the end of the project I'm like that was so useful I might want it again later.", "label": 0}
{"text": "Long term? Absolutely.", "label": 0}
{"text": "Ok", "label": 0}
{"text": "? Yes horizontal was the intent but they would not hit firmly i studs , so multiple answers here was to use them vertically . \nYou Link is 404", "label": 0}
{"text": "Ha ! \nI ll check if I have studs in both corner , this may just be the way . \nThought floating was nice , but needs better brackets .", "label": 0}
{"text": "Absolutely. Just make sure you get a compressor large enough to power your nailer.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Great update OP. it looks so bright and fresh!", "label": 0}
{"text": "Removed as this is a question about a product.  We do not make it or sell it.  We are not able to determine its suitability for your use.", "label": 0}
{"text": "Buy a decent compressor and a Harbor Freight nail gun", "label": 0}
{"text": "Consider posting these images to the dozens of interior design subreddits out there.", "label": 0}
{"text": "Yep, I'd use screws too.\n\nHaven't used my compressor/air tools in years if I think about it.", "label": 0}
{"text": "As other commenters have pointed out, this looks fine! You can go in to touch it up with a fine art supply brush if you really want to :)", "label": 0}
{"text": "Screws last longer.", "label": 0}
{"text": "Plz don't use an impact wrench unless you want to strip your posts and boards because you like hearing the impact sound lmao             \n         \nthe amount of things I have witnessed break because of a dingus with an impact wrench where he didn't need one are innumerable", "label": 0}
{"text": "Put  a few fruit loops in there and tell him to work on his aim", "label": 0}
{"text": "I did this with my stairs, I used the sheet-Max caulk from Sherwin Williams, i did it about 2 years ago and it still looks really good. Paint on both sides, caulk it, remove the tape, wait a couple minutes, spray some water and just set the bead down flush and it’ll look ✨Great ✨", "label": 0}
{"text": "You do not need a coil nailer as a DIYer to do a fence. Yeah it makes sense as a contractor who makes money with their tools. I built my entire shadowbox fence with a 21 degree framing nailer, 6d ring shank nails and some screws for the rails. \n\nThe only disadvantage to the framing over the coil is having to refill more often. Two nailers for a DIY fence is absurdly overkill. Especially of you aren’t really even planning on using nailer after this job.", "label": 0}
{"text": "No you're right. I just got the finish nailer in addition, for another project. \nNot needed for the fence, OP!", "label": 0}
{"text": "Lots of advice here already, but there are so many uses and tools for an air compressor that it's well worth it. Even if you only get one of those 3 gallon pancake compressors (they're crazy cheap now) - they handle most jobs you'd need them for if not a little slower than the big guys.", "label": 0}
{"text": "Garage door?", "label": 0}
{"text": "Hah the previous owners left that coat rack lol", "label": 0}
{"text": "Dude that'd be hysterical. I'm in", "label": 0}
{"text": "This right here ☝️", "label": 0}
{"text": "Could you also use those plastic pieces you shove in the hole and are made to screw into? I have the same problem and some of those laying around.", "label": 0}
{"text": "You could try something like this but mount the trollers to the structure of the deck and strut on your drawers. Put some stops on the end so it doesn’t go too far. \n\nhttps://www.fastenersplus.com/products/4-wheel-trolley-electro-galvanized", "label": 0}
{"text": "Found some plans online and tailored to my needs. Ending up beefing up the girders and joists (online showed 2x4 which is not enough) and drew my own plans in Bluebeam. Submitted to city, waited a couple months for permit, and field installed the rest!", "label": 0}
{"text": "Over-sink lighting and under-cabinet lighting is definitely on the to-do list!", "label": 0}
{"text": "How shallow did you set them?", "label": 0}
{"text": "I think I know exactly what you mean. Those framing sizes were suspiciously small so I bumped them up.", "label": 0}
{"text": "Well the Pinterest car port didn’t have vertical supports on one side. Yours does lol", "label": 0}
{"text": "Gym mats", "label": 0}
{"text": "Just brace in a 20ft ladder... OSHA isn't stopping by\n\nAlternatively the safe way is a 20ft A frame or scaffolding", "label": 0}
{"text": "Your plan isn't really going to do much of anything. You are only pulling \"one strip\" because the other sheets of subfloor have walls on them. So a 4' wide strip (3 joist spaces) in a say 12' wide room doesn't cover much of the floor. Also you are only adding enough insulation to fill the small air space left over from the existing insulation, so achieving a new R34 instead of the old R30 in only 3 joist spaces is negligible.\n\nYour uncomfort can be caused by a lot of/combination of things. No air sealing on garage ceiling, not enough attic insulation, poor HVAC (no return, far from furnace, undersized duct, improper balancing), leaky windows, wall insulation/air barrier, etc. \n\nThe better way to get the floor plane addressed is to pull down the garage ceiling. Drywall is cheap. Then you have a few choices, but it involves creating an air barrier in addition to as much R value of insulation you can get. Spray foam, batt insulation, and rigid board are involved in those choices.", "label": 0}
{"text": "It was like this, except it had way more overhang.\n\nhttps://pin.it/5lY4w2qoS", "label": 0}
{"text": "I would first try to diagnose what is wrong with it. If it ends up being unfixable, or rather uneconomical to fix, I would probably go with mini-split heating. It's way more efficient than straight electrical resistance heating which is what the floor heating is.", "label": 0}
{"text": "Pulling and pushing and drilling won’t work \nA drill will spin it \nPulling will break the wall \nThe only way to get it out easily without damaging the wall would be to get a 4” hand grinder and carefully grind off the silver metal and it will fall in\nI just did that with a few screws that were in a wall and the heads were stripped, I just ground them off easily", "label": 0}
{"text": "I just think it's funny to provoke dorks like you. It appears to have worked.", "label": 0}
{"text": "There actually is a \"wall\" covering the fridge it looks like.\n\nIf a piece of white painted/veneered plywood actually does anything though... ¯⁠\\\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯", "label": 0}
{"text": "If you're removing a stud on the hallway side for the door, make sure it's not load bearing.  Or frame it correctly to bear the load around the new opening.\n\nRecommend a stud behind the new fake wall.  If you need to hang/mount something in the future, it's already there.\n\nPut up drywall on both sides.  A fire resistant wall is:   drywall | stud cavity | drywall.  It's cheap now, before you start using the space.\n\nConsider installing flat LED ceiling light like a 12\"x12\" or 12\"x24\" that's less than a 1/2\" thick.  Bulbs get in the way.  Door frame switches are convenient.  No reaching around for it.  It just works when the door is opens.", "label": 0}
{"text": "Plastic anchors are not suitable for this.\nYou need lead or the plastic cone anchors specifically for masonry.", "label": 0}
{"text": "Bro if I sit down my dicks gonn touch my seat", "label": 0}
{"text": "Also screws can be easily tightened a year or two down the road, while the nails just fall out. Definitely do screws.", "label": 0}
{"text": "Barring adding a half-gate, I don’t think I see a way to prevent a fall, except to mind the stairs, and pay attention when you are standing on the ‘warning track’ at the top. Like many here, I have seen this type of entrance many times. As for room for coats and shows, perhaps plan for a mud room in front of the outside entrance.", "label": 0}
{"text": "Is there a way to get some kind of veneer that matches the countertop and slap that over the plywood?", "label": 0}
{"text": "Hmm hadn’t thought of that. Although I feel it would look better if it matched the backsplash? Even if it’s just white", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Try /r/WhatIsThis and /r/WhatIsThat", "label": 0}
{"text": "Please post this to /r/PestControl", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\nRule 4: No: Sales | Promotions | Advertising\n\nThis means no:\n\n* Shirts|Pins|Buttons|Stickers|Posters|Rugs|Shoes|Custom Drawings|Commissions| or any \"For Sale\" Merch, Etc.\n* No Art/Craft posts or Low-key attempts to generate interest/sales/follows - eg. Commissions,  etc)\n* Crypto||NFTs|Digital Investments\n* Sharing or Promoting: Reddit Accounts|Subs|Services|Apps|Websites|Signups|Quizes|Online Shops|etc\n* Sharing or Promoting: Social Media|Telegram|Discord|Youtube etc\n* Contests | Voting | Surveys | etc\n\n---\n\n* Your photos / videos cannot bypass this rule by blatantly displaying your business name / links via photos.  \n* Your photos / videos may be watermarked with anything **except** a URL.\n* We do not allow discussing of sales or pricing via comments.\n* If someone expresses interest in your product (how to purchase, pricing, etc) - have them message you privately.\n* Do not share contact information publicly (phone number, e-mail addresses, social media handles).\n\n---\n\n* Spam | Spam Accounts \n* Asking for Upvotes/Downvotes against yourself or other users.\n* Brigading.\n\n---\n\n**Spammers/Sellers/Repeat Offenders Get Bans**\n\n---\n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Self-Promotion).\n\n*Note: Replying to this comment or PMing the moderator will not guarantee a response.*\n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\nRule 4: No: Sales | Promotions | Advertising\n\nThis means no:\n\n* Shirts|Pins|Buttons|Stickers|Posters|Rugs|Shoes|Custom Drawings|Commissions| or any \"For Sale\" Merch, Etc.\n* No Art/Craft posts or Low-key attempts to generate interest/sales/follows - eg. Commissions,  etc)\n* Crypto||NFTs|Digital Investments\n* Sharing or Promoting: Reddit Accounts|Subs|Services|Apps|Websites|Signups|Quizes|Online Shops|etc\n* Sharing or Promoting: Social Media|Telegram|Discord|Youtube etc\n* Contests | Voting | Surveys | etc\n\n---\n\n* Your photos / videos cannot bypass this rule by blatantly displaying your business name / links via photos.  \n* Your photos / videos may be watermarked with anything **except** a URL.\n* We do not allow discussing of sales or pricing via comments.\n* If someone expresses interest in your product (how to purchase, pricing, etc) - have them message you privately.\n* Do not share contact information publicly (phone number, e-mail addresses, social media handles).\n\n---\n\n* Spam | Spam Accounts \n* Asking for Upvotes/Downvotes against yourself or other users.\n* Brigading.\n\n---\n\n**Spammers/Sellers/Repeat Offenders Get Bans**\n\n---\n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Self-Promotion).\n\n*Note: Replying to this comment or PMing the moderator will not guarantee a response.*\n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Best of luck on your search.\n\n/r/DIY does not offer a private search engine function at this time.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You're asking what product or tool to buy. \n* You're asking where to buy a product or tool.\n* You're asking for suggestions for a product or tool you intend to buy.\n* Asking for Product/Tool Feedback or Opinions\n\nWe do not permit posts asking for suggestions on materials and tools. This is because of spam.\n\n * /r/DIY is focused on the *how*, what technique to employ and which tool to use.\n * If you need recommendations for a product, you'll probably have better luck in a more specialized subreddit, e.g. /r/HomeImprovement, /r/woodworking, r/helpmefind, etc. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=product%20recommendation).", "label": 0}
{"text": "Please Google the phrase “how to patch holes in drywall”", "label": 0}
{"text": "Please post this to the automotive repair subreddits.\n\nPersonally, you should get a good used one from the salvage yard.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "Please post this to the bicycle-related subreddits out there", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You're asking what product or tool to buy. \n* You're asking where to buy a product or tool.\n* You're asking for suggestions for a product or tool you intend to buy.\n* Asking for Product/Tool Feedback or Opinions\n\nWe do not permit posts asking for suggestions on materials and tools. This is because of spam.\n\n * /r/DIY is focused on the *how*, what technique to employ and which tool to use.\n * If you need recommendations for a product, you'll probably have better luck in a more specialized subreddit, e.g. /r/HomeImprovement, /r/woodworking, r/helpmefind, etc. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=product%20recommendation).", "label": 0}
{"text": "As a DIYer that has built two fences, this", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "I was thinking more mixed doubles", "label": 0}
{"text": "Just lay a paper towel under it so you can easily see if it leaks.", "label": 0}
{"text": "The only thing I’d keep in mind is that the barn is probably loaded with critters - mice, rats, bats, etc.  They will try and enjoy any renovations you do, in ways that you probably will not enjoy.", "label": 0}
{"text": "sounds good", "label": 0}
{"text": "thank you", "label": 0}
{"text": "Nothing you're proposing is inherently a fire risk on principal. The only way it would be a fire risk is through improper execution (poor wiring connections, overloading the circuit etc).", "label": 0}
{"text": "Not that it matters now there was no Jack stud or King stud. They had to kind of shim the door frame in there because the foundation had shifted the frame many years ago. When they shimmed out the door frame on one side they used a couple 2x4s and shims, on the other side they used exactly one shim in the middle. None of the 2x4s and none of the shims were placed where any door hardware would screw in.\n\nSuper fun fix.... I do not recommend it.", "label": 0}
{"text": "For sure. Miswording on my part - I meant that the cabinetry was all OG from the 70s, not the kitchen in its entirety. The original owners/builders did their own renovations probably 15 years ago or so, maybe even longer. \n\nAll of the cabinets were raw or dark-stained wood, which - combined with the yellowing cream paint and the dated faces - chained the space to the 70s despite some “modern” updates. That’s all (mostly) fixed now.\n\nAs for your kitchen…orange carpet?! IN the kitchen? Gag me.", "label": 0}
{"text": "Do screws, it’s marginally slower and much better.", "label": 0}
{"text": "Lol. Sure.", "label": 0}
{"text": "I love deck screws for fence boards. Air guns are fun, but ya, those don't hold iver time. I also like deck screws for the star head and lack of staining cedar boards.", "label": 0}
{"text": "My fence was built a decade ago with stainless screws and they all still look brand new. Easy to remove to make repairs, too.", "label": 0}
{"text": "Of course you can", "label": 0}
{"text": "Please post to subreddits that deal with PCs and computer repair.", "label": 0}
{"text": "Line the garage ceiling with pir sheets like Kingspan or Celotex. \nUse thick, warm rugs/ carpets upstairs in winter.", "label": 0}
{"text": "Extra insulation is always a good thing", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Do you have a sump pump.  The older method of putting in drainage channels resulted in a 12- 18 wide inch wide slant between the side wall and the rest of the basement floor. Newer methods keep the floor more even.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Replace the blue box with a similar “old work” box; they have adjustable wings that allow you to secure it to the surrounding drywall.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "We know a grow op when we see one!\n\nj/k \n\nI would insulate the ceiling assuming you plan to heat/cool the area.", "label": 0}
{"text": "No caulk should be necessary. That looks to be a 3 piece tub. How each piece overlaps makes it so water doesn’t get behind it. Might depend on manufacturer but I think that’s how they work.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "I HATE these tub and shower inserts.. seeing them more and more in \"luxury apartments\" but they are horrible. Never installed correctly. There should be sorta like a door window seal looking thing at the bottom edge between the two halves. But it's this nasty crack that is basically a mold Petri dish that's near impossible to clean.\n\nFuck who ever produces sells and installs these...", "label": 0}
{"text": "You want /r/AskALocksmith and /r/Locksmith for this", "label": 0}
{"text": "Okay, thank you for letting me know.", "label": 0}
{"text": "You want /r/Upholstery for this", "label": 0}
{"text": "> objectively worse\n\nIf it meets the expected life expectancy and loading requirements, “worse” is irrelevant. If the concrete outlasts the post set into it, the method of casting is irrelevant\n\nI’m happy your time is so worthless that you have assigned no value to it :)", "label": 0}
{"text": "Your Screw is a bolt.  What you are calling a screw is almost certainly a rubber washer, to stop the bolt from cracking the glass.   \n\nThe two \"holes\" are just their (terrible) interpretation of the hole in the glass - they are showing both sides of the glass... \n\nIt is pretty terrible.", "label": 0}
{"text": "Love", "label": 0}
{"text": "Hide the gap with trim", "label": 0}
{"text": "I framed the outer walls in my basement, and insulated with foam.  The floors on the main level are way warmer in the winter now.", "label": 0}
{"text": "Yes, I did this above my garage for the same reason as OP - come master bedroom above the garage. It made a big difference. \n\nAlso don’t neglect weather proofing the windows", "label": 0}
{"text": "Google the phrase “how to install a closet door”, please", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "You want to buy an “oscillating tool”.   More tools are always a good thing", "label": 0}
{"text": "Looks pretty good, I actually kinda dig the drawer fronts. They give the kitchen a little character. Honestly if I saw a house with a kitchen like that I probably wouldn't bother changing anything LOL. The backsplash isn't all that stylish anymore but those subway tile backsplashes with the little glass tile inlay are getting kinda played out, even if I like them.", "label": 0}
{"text": "I don’t 🤔 I made another post with pictures", "label": 0}
{"text": "You may want /r/AskAPlumber or /r/Plumbing for this one.", "label": 0}
{"text": "It is almost certainly latex paint.  Try a paint remover or a heat gun to see if you can get it to come off", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "They're not for everyone but the heart wants what the heart wants", "label": 0}
{"text": "Once the interior wall is opened up, you or your plumber will be able to determine the best way to go.\n\n/r/DIY does not know how the plumbing is currently run.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "To fill the gap, look at a product known as “ backer rod”.", "label": 0}
{"text": "I’ve got similar in my kitchen and I believe they are self contained units so you need to replace the whole unit.", "label": 0}
{"text": "Someone needs to evaluate *why* there is no pressure.  There is no way to know at this time if replacing the copper part will some your problem.", "label": 0}
{"text": "Ah I totally forgot about those! Thank you", "label": 0}
{"text": "That would be a good first step", "label": 0}
{"text": "You may want to post what photos you have to /r/drywall", "label": 0}
{"text": "I don't know what you plan to store. Lattice won't keep out any animals. It won't stop the weather either. Drawers or pull out shelves are smart. \n\nWhy not make a solid door or doors. Don't attach the slide outs to it. The door/s can open any direction you choose.  Then you can select which slider you want. \n\nYou might consider some kind of brake or latch so the shelves don't roll out when you don't want them to.", "label": 0}
{"text": "Copper wool and Pest Blocker foam", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Yes you can", "label": 0}
{"text": "It is brilliant 👏", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Keep in mind you need to let your roof deck (the OSB/Plywood you see with nails through it on the left of the first picture) breathe or it will rot out if you insulate right up against it. I would do plenty of research and probably get some professionals to look at this if you want to turn that room into a conditioned space.", "label": 0}
{"text": "oh its going to fall down.  Those members are so undersized.  A big snow plus sustained cold and that things going to fail.\n\nI told the guy you could see them deflecting and he insisted I was looking at the light strings...lol", "label": 0}
{"text": "Cut them flush with a grinder, or replace them with hardware of an appropriate length", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "obviously, you're not a golfer", "label": 0}
{"text": "Replace it, if they are sold separately.", "label": 0}
{"text": "Paint it", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Buy some drywall patch", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Google the phrase “how to patch holes in drywall”", "label": 0}
{"text": "Yep don't do it. When I bought my house I had the same thought as you. \"Why didn't anyone caulk this??\"\n\nI caulked it. Ended up with water and mold behind the caulk, and a big chunk of moldy wet drywall right at the point where your first photo is.\n\nI managed to get the caulk off and repair the wall and it's pretty good, except for one area where I didn't quite get the caulk off and the water still sits on the rim of the tub. The drywall has stayed dry.", "label": 0}
{"text": "____/   _____\n|                     |\n|                     |\n|                     |\n|                     |\n-------------\n|                     |\n|                     |\n|                     |\n|                     |\n|___/    _____|\n^narrow ^hallway\n____________", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Perhaps /r/Restoration could assist you with this project", "label": 0}
{"text": ">I’m happy your time is so worthless that you have assigned no value to it :)  \n\nQuite the opposite. My time is valuable, so I use it to be productive and to make things that will outlast me. You can value your free time however you want, but if it isn't producing anything, it's costing you instead.", "label": 0}
{"text": "Looks like you're not finished fixing mistakes.", "label": 0}
{"text": "Use cotton clothesline to make a pair of ropes for the door", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Go with what you feel is the best repair", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "You should ask your plumber", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "Unless you have a way to ventilate the space moisture build up will be a concern", "label": 0}
{"text": "I think you have the right idea. The thing is, if the subfloor is exposed, you can do anything. Honestly, I would talk to somebody about expanding spray foam, you would get the best result. \nBut if you are queasy about the cost, you can try what you stated. You may have to take up more subfloor than you did to get insulation inserted all the way to the edges.", "label": 0}
{"text": "It was already like that when we purchased the property.", "label": 0}
{"text": "We just had a new roof put on when we bought the house and they put a ridge vent on also. But I did plan on having some kind of vent for just the room to the outside just for the smell, I can throw a dryer vent in the wall and run my airflow to it.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Have no idea who sells or services those in your area.  You may have to make a few phone calls to determine that.", "label": 0}
{"text": "You could use a circular saw, followed by a hand saw where the radius of the cut is, or an oscillating multi-tool.", "label": 0}
{"text": "I used 12% peroxide, sprayed onto a rag wiped it down, left a fan to dry and repeated every other day for a week and they were almost non existent,  but definitely brighter.", "label": 0}
{"text": "Isn't every reno on a budget?", "label": 0}
{"text": "The best drills are for angle grinders from say 4-6mm and up. They spin fast and risk for cracking the tile is the lowest. source: tile layer.\nIt's in the moment you go through the tile the largest risk for cracking is the largest so go easy.", "label": 0}
{"text": "Oscillating tool", "label": 0}
{"text": "Lol dude wtf I have a space upstairs that looks exactly like this in my house!! It's carpeted and has a chalk board on the back of the door. Must've been a little play/hideout spot for a kid.", "label": 0}
{"text": "Standards have changed, it's possible that the old flashing (metal) could be re-used. The newest methods used \"Flashing Tape\" which I think is better and easier to work with.  It's best to follow the door manufacturers recommendation to preserve their warranty.", "label": 0}
{"text": "Honestly, best advice is to not grow plants there. Voids like that are a pain in the neck to deal with just as they are. Adding plants, moisture, heat...just adding problems. You certainly can do it, but should you?\nThe $$ spent on your new roof with new boards would rather you didn't. Outside, basement, bathtub would all be better places", "label": 0}
{"text": "Trim.", "label": 0}
{"text": "i cut it twice and its still too short", "label": 0}
{"text": "As in … attach a trim to the kick?", "label": 0}
{"text": "That's definitely gotta be the easiest way, right?", "label": 0}
{"text": "Yes, Im aware of that, we have lots of critters in the yard too. We found a pregnant opossum and the dad last night on our porch and got them put in an old chicken coop. They can get in and out but we put wood shavings since its getting cold it gives her somewhere warm. The bats I’ve seen in there have a little hideaway in the loft area. Which is another reason Im leaving it alone. Anything I bring in there would probably be wood, maybe make a seating spot with wood. Nothing that id be upset if it got torn up or taken over. It’s a good thing I don’t mind them. Ive seen a lot of people try to renovate outside spots or barns but aren’t good with wild animals lol. I appreciate it tho! This is just a project to give me something to do and enjoy when I have free time.", "label": 0}
{"text": "Breath in the glass in the air", "label": 0}
{"text": "Is this a new ceiling? If you are just repainting and know it's the same type of paint, then I don't think you need to prime.  Otherwise, it is better to be safe.", "label": 0}
{"text": "Where do you live? It’s going to get extremely hot (and cold) up there", "label": 0}
{"text": "Hi if you want to message me I could give you a bit of a walk through and a few good videos on how to properly replace the p trap. Definitely start with taking everything that you did off and possibly buy a new trap again depending on how much you used that puddy. It's not the worst trap replacement I've seen I'll give you that at least.", "label": 0}
{"text": "And I would have tried to make it that way here if it was in my kids room and not mine lol", "label": 0}
{"text": "Lol!", "label": 0}
{"text": "Go back downstairs and close the access door.", "label": 0}
{"text": "You could basically double-wall the roof—put up some thin OSB, nail up some dummy rafters, then some insulation, and your drywall.", "label": 0}
{"text": "Hide from the wife n kids?", "label": 0}
{"text": "Dig out any high spots and lay the stones back down?", "label": 0}
{"text": "That's beautiful.", "label": 0}
{"text": "Dam u got me", "label": 0}
{"text": "It will get super hot if you’re trying to grow in there…gonna need good ways to move the air out if this isn’t conditioned space", "label": 0}
{"text": "Dont caulk or silicone it. Thats how its designed. The fact you dont see any water damage on adjacent walls/ceilings should tell you thats its doing its job.", "label": 0}
{"text": "I use the compressor a few times a month.  The portable air tank is handy too.  I'd get the compressor.", "label": 0}
{"text": "To elaborate on what others have said, the tub has a lip behind the wall. The waterproof backing sits inside (tub-side) of the lip. Water can then flow back into the tub. Caulking it traps moisture.", "label": 0}
{"text": "I'm not looking to restore, I'm just trying to figure out how to separate this part", "label": 0}
{"text": "Thank you for submitting to r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Inappropriate Topics: \n   * Cooking, Cleaning\n   * Basic home maintenance (Lawn Care, Painting, Lighbulb Identification, etc)\n   * Basic general automotive maintenance\n   * Sewing, Crafting, Decorating, Life Hacks\n   * Cosmetics, Hair styling, Personal Hygiene \n   * Software based design: Solely CNC, 3D or laser printed projects\n   * Solely Programming, Coding, Scripting, Automations, etc.\n  * Requires a professional (Asbestos, Dangerous, Certification Required, Etc)\n\n    * Memes, Jokes, Polls, Opinion Requests, Rants, Venting, General Complaining\n\n^(Mod discretion may be used in cases if the above is not adequate enough to describe the content not suited to the community)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "what is this even supposed to do lol. it's just random rectangles of crown molding stuck on the wall?", "label": 0}
{"text": "I just fully read it sorry for assuming you did this your self but my offer still stands. If you go to home Depot they sell a trap basically already ready and look for the green packet with 1¼ on it. That's usually the bathrooms size if I remember correctly.", "label": 0}
{"text": "So many questions so little time", "label": 0}
{"text": "Structural questions (what size beam should you be looking to use) is beyond the abilities of this subreddit.  Consult with your architect or structural engineer, please", "label": 0}
{"text": "Rather than try to renovate the whole barn, might it be more practical to cordon off a space inside the barn's outer walls? First requirement is shelter from the elements, wind and rain. Second requirement, heat and/or somewhere comfortable to sit and think, or even sleep. Third requirement, the ability to heat food and water, either on a small stove or an open fire. Just working out the practicalities of obtaining these requirements will teach you a great deal, without biting into the huge task of renovating a whole building. And never throw anything away until you are utterly certain it won't be used, or it is so rotted as to be useless.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "That’s the future layout", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\nRule 4: No: Sales | Promotions | Advertising\n\nThis means no:\n\n* Shirts|Pins|Buttons|Stickers|Posters|Rugs|Shoes|Custom Drawings|Commissions| or any \"For Sale\" Merch, Etc.\n* No Art/Craft posts or Low-key attempts to generate interest/sales/follows - eg. Commissions,  etc)\n* Crypto||NFTs|Digital Investments\n* Sharing or Promoting: Reddit Accounts|Subs|Services|Apps|Websites|Signups|Quizes|Online Shops|etc\n* Sharing or Promoting: Social Media|Telegram|Discord|Youtube etc\n* Contests | Voting | Surveys | etc\n\n---\n\n* Your photos / videos cannot bypass this rule by blatantly displaying your business name / links via photos.  \n* Your photos / videos may be watermarked with anything **except** a URL.\n* We do not allow discussing of sales or pricing via comments.\n* If someone expresses interest in your product (how to purchase, pricing, etc) - have them message you privately.\n* Do not share contact information publicly (phone number, e-mail addresses, social media handles).\n\n---\n\n* Spam | Spam Accounts \n* Asking for Upvotes/Downvotes against yourself or other users.\n* Brigading.\n\n---\n\n**Spammers/Sellers/Repeat Offenders Get Bans**\n\n---\n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Self-Promotion).\n\n*Note: Replying to this comment or PMing the moderator will not guarantee a response.*\n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**", "label": 0}
{"text": "This guy weeds", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You have not provided progress photos or your progress photos are not adequate.\n* Progress photos must show all the important steps of your project (materials, tools, methods used).  \n * Your photos must show the process of **how** you completed your project - not just the end result.  \n * Consider submitting your project to /r/somethingimade if you are unable to provide enough photos.    \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Progress%20photos).", "label": 0}
{"text": "You should insulate the roof rafters if you want to maintain a somewhat-consistent temperature here all year around. Consider if your stuff will be okay in fluctuating conditions, or if you plan to live/work in this room in the future.\n\nOtherwise, no need to insulate", "label": 0}
{"text": "Appreciate the feedback, i guess no caulk it is! Haven’t had an insert like this before so was just looking for a way to stop all the black stuff that builds up in that crack", "label": 0}
{"text": "Consider posting this to subreddits that deal with costumes and cosplay", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "Yeah we’ve cleaned it out a couple times and it seems like there’s always mold and stuff building up in there because it basically always stays wet in there", "label": 0}
{"text": "I just want to confirm that you're talking about grouted (glued) tiles versus pavers to make sure we're talking about the same thing.  I don't think I've ever seen tiles laid over an outdoor concrete slab - not to say it's never been done, just not in my neck of the woods.\n\nLarger tiles are going to average out your slope more and lay down quicker, but smaller tiles leave you more room for adjustment as you go. I would make sure whatever you get is meant for outdoor use if we're talking tiles and not cement pavers.  Also, is the area exposed to sun? Tiles may crack if they're going from 60 to 100f over the course of a day.", "label": 0}
{"text": "They may know how to separate it", "label": 0}
{"text": "1.) Wear a helmet. ", "label": 0}
{"text": "Also if you don't insulate the roof from the room the cops can see the grow lamps on thermals", "label": 0}
{"text": "That’s a great idea I will do that thank you", "label": 0}
{"text": "The space you are in is \"outside\" of the climate controlled part of your house, that's why the underside of the roof is not insulated. You need there to be airflow in that space to prevent mold. It's not a great space for growing as is.", "label": 0}
{"text": "!remindme 1 day", "label": 0}
{"text": "Wouldn’t this attract mice, rats, etc?", "label": 0}
{"text": "I did a hot roof on my house, spray foam insulation, moved the knee walls out and gained a lot of square footage. Much nicer temperatures now and heating/ cooling cost went down.", "label": 0}
{"text": "Right? I was very nearly whelmed.", "label": 0}
{"text": "So are you saying that some Dinos had access to the dankest of all nugs?", "label": 0}
{"text": "“You got a B+ on your math exam? You know the rules, go to the disappointment room and write 1000 sentences”", "label": 0}
{"text": "Gimp Storage.", "label": 0}
{"text": "Got a hella of a garage for that lol", "label": 0}
{"text": "Found that out the hard way last night…. Twice.", "label": 0}
{"text": "Because the closet then needs to have extra depth to accommodate a door, and if you have that extra depth, you lose the ability to actually use it…?", "label": 0}
{"text": "More like the ditchest of ditch weed.", "label": 0}
{"text": "If you look over in that corner it's off by a degree or two. Yeah over there - - > you got it.", "label": 0}
{"text": "There would be a pit somewhere in the basement, usually with a round cover and you would see the wire coming out and plugging into an outlet.  There would also be an outside discharge pipe.", "label": 0}
{"text": "Header and king/jack studs?", "label": 0}
{"text": "Haunt people", "label": 0}
{"text": "I can predict the off center and too high tv mounted on the wall already 😅", "label": 0}
{"text": "Over insulate then finish it and sound proof add ac a tv and a fingerprint reader doorknob and poof hidden lounge for only you.", "label": 0}
{"text": "Short answer: yes.\n\nLonger answer: Only you know what's above.  If you have a king-sized waterbed, maybe don't cut a load-bearing wall.  Brace before you cut.  All that stuff.  Also, make a full header. Don't just flip a 2x4 or 2x6 sideways.  You need two 2-by and plywood between to make the full width.", "label": 0}
{"text": "Exactly!", "label": 0}
{"text": "The fridge ruins it", "label": 0}
{"text": "I'm not sure about the potency as that's more about the phenotype, but all plants, trees and flowers were 3 times larger than today and much healthier.", "label": 0}
{"text": "That space is likely part of your homes insulation and adding plants to the space will cause the rest of your house to warm and struggle to expel moisture", "label": 0}
{"text": "By which time your wife has changed her mind and said she doesn't like it 😞.", "label": 0}
{"text": "Punishment chamber", "label": 0}
{"text": "With you there 👊🏻", "label": 0}
{"text": "Quarter round?", "label": 0}
{"text": "It's a look, my house (built in the 40s had it in one of the basement rooms. One of the first things we did was rip it out.", "label": 0}
{"text": "For what use case.", "label": 0}
{"text": "I would use a marker to touch up then run a very small bead of clear silicone around the toe kick. Keeps kitchen spills easier to deal with as well as when washing the floor, no water or dirt get under. It doesn’t look like you messed up much but I do feel your pain.", "label": 0}
{"text": "I came here to say this.   \nDitch the grow room, just insulate the house properly and enjoy the extra coziness!", "label": 0}
{"text": "You don’t need fresh air intake and exhaust if you’re running co2", "label": 0}
{"text": "I think you’d want to do something to keep it from tipping over. Looks a little too heavy.", "label": 0}
{"text": "So before I replace my subfloor I would like to replace my toilet flange with a PVC blank I can flush cut to the new floor my issue is the way the drain was plumbed in there is no significant gap for me to cut in and add a coupling is there a better suggestion then cutting out the drain from below in the void and replacing the length up to the fernco", "label": 0}
{"text": "! ! !", "label": 0}
{"text": "Why not", "label": 0}
{"text": "Maybe frame out the outside of each door with 1x4 painted white.", "label": 0}
{"text": "Bro...\n\nThe gap between the first two is noticeably smaller than the gap between the last two.\n\nRelocate the outlet. It looks like trash.", "label": 0}
{"text": "Yep do it", "label": 0}
{"text": "Plants don't need CO2 during dark hours because they don't consume it while sleeping, so running CO2 is a waste of money with no measurable benefit.", "label": 0}
{"text": "Embrace the rust aesthetic", "label": 0}
{"text": "Good luck with that.  I had a 50 pint dehumidifier in a 10x15 and it couldn't keep up with 12 plants. Commercial grow dehumidifiers are extremely expensive. Healthy plants produce a lot of humidity.  And of course you filter the intake and exhaust, but it's always cheaper to run a dehumidifier as less as possible.", "label": 0}
{"text": "You would be well advised to double the studs if you are building a new opening in a structural wall without input from a design professional.  4 kings, 4 jacks, and a built up header with cripple studs matching your existing stud spacing above (and don't forget blocking for the barn door, if needed).  I'm assuming this a 2x6 wall, because if it's 2x4 it's almost certainly a partition wall. A header for this needs to be 5.5\" wide, which means 3 2x6s with 2 sheets of 15/32 osb sandwiched in between (the assembly should be nailed or screwed together).  Also, install vertical studs at 24\" on center (max) for the new partition wall, and don't half ass tying it into the existing framing (vertical members fastened together, 3 studs at corners generally).", "label": 0}
{"text": "That was a choice.... That was made...", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You're asking what product or tool to buy. \n* You're asking where to buy a product or tool.\n* You're asking for suggestions for a product or tool you intend to buy.\n* Asking for Product/Tool Feedback or Opinions\n\nWe do not permit posts asking for suggestions on materials and tools. This is because of spam.\n\n * /r/DIY is focused on the *how*, what technique to employ and which tool to use.\n * If you need recommendations for a product, you'll probably have better luck in a more specialized subreddit, e.g. /r/HomeImprovement, /r/woodworking, r/helpmefind, etc. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=product%20recommendation).", "label": 0}
{"text": "Good call, I think my gf has one that I can buy a good blade for!", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "Residential dehumidifiers are rated way higher than their actual capacity. You need at least a quest 150 to be able to keep up with 12 big plants in a 10x15 room. I ran 4 quest 225’s per 24 light room that I had and I could keep the humidity at any level I desired and that was even when I was watering at the heaviest which was about 100 gallons a day", "label": 0}
{"text": "That makes sense! Still counts as DIY in my book. I build stuff every day, but that doesn't make me an architect!", "label": 0}
{"text": "Or just repaint it with proper material?", "label": 0}
{"text": "You want /r/AskAPlumber or /r/Plumbing for this", "label": 0}
{"text": "Should I remove the tape? You can't if it was put on correctly. How do I minimize damage? Be careful.  You'll have butt joints no matter how you do it.  Can you bevel the remaining edges?  No.\n\n  \nJust rip it out and install.", "label": 0}
{"text": "You may want /r/FurnitureRepair for this", "label": 0}
{"text": "My go to with things like this is a flathead screwdriver and a can-do attitude.  If that fails, I go for a flathead, pliers, and a bad attitude.  After that, either the job is done or you swap out the tools for an electrician and a credit card.", "label": 0}
{"text": "Yes! You will be surprised on how many other things you use it on. Need to pop a nail some where, you won’t even think about using a hammer", "label": 0}
{"text": "This guy wants to grow “plants” in a secret closet 😉", "label": 0}
{"text": "That's a drain, so unless you plan on fully submerging you're home at some point in the future the part you nicked won't be encountering water any time soon.  Go ahead and glue the new fitting, you'll be fine.", "label": 0}
{"text": "I won't work well because you need negative pressure for the air supply and venting.", "label": 0}
{"text": "put a spark arrestor on the top and you’re golden.", "label": 0}
{"text": "skill saw, set the blade to the depth matching the thickness of the plywood or just a bit deeper. Cut a rectangle just inside the joists. When you want to put the board back in place, screw some 2x4 to the joists for the board to rest on so everything is fully supported and you don't have any soft spots when you walk on it.", "label": 0}
{"text": "Yes, I would like to subscribe to Cannibus facts please.", "label": 0}
{"text": "Start a spider farm", "label": 0}
{"text": "Blown insulation makes the most sense for what you're talking about.  I'm assuming the ceiling drywall is mounted directly to the joists, but if not it's probably easier to blow it in from the bottom rather than cutting out the subfloor.  If you do cut it, make sure you use subfloor adhesive when you put it back, or you may find yourself with some very squeaky floors.  Don't forget to resecure the edges outside your cut area too!  Screws will outperform nails here.", "label": 0}
{"text": "Have you tried mixing smaller amounts?", "label": 0}
{"text": "Nah just grow it out of a fridge like an adult", "label": 0}
{"text": "If you don't fix it are you just going to look at it like it is? Roll your sleeves up and get to it", "label": 0}
{"text": "I'd put it somewhere covered so it doesn't turn to rust instantly ", "label": 0}
{"text": "Was this installed door into a header or solid structure backing of some kind? Or is this installed in a set of plugs / wingnuts and holding by the drywall?", "label": 0}
{"text": "Adam savage has some good videos on his YouTube channel about CA glue use. He uses disposable tips made from tubing if I remember correctly.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You're asking what product or tool to buy. \n* You're asking where to buy a product or tool.\n* You're asking for suggestions for a product or tool you intend to buy.\n* Asking for Product/Tool Feedback or Opinions\n\nWe do not permit posts asking for suggestions on materials and tools. This is because of spam.\n\n * /r/DIY is focused on the *how*, what technique to employ and which tool to use.\n * If you need recommendations for a product, you'll probably have better luck in a more specialized subreddit, e.g. /r/HomeImprovement, /r/woodworking, r/helpmefind, etc. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=product%20recommendation).", "label": 0}
{"text": "Where is the hole? Just fill it with silicone or caulk, problem solved", "label": 0}
{"text": "Oh and when you trip a breaker and don't catch it right away, your plants die or get sick. So always make sure you don't  overload your circuits.", "label": 0}
{"text": "Look for \"F clips\".  They hook behind the drywall (fiber board in your case) and get bent over the junction box to hold it in place.  YouTube a video.", "label": 0}
{"text": "For the 8' direction you are correct (6) joist spaces, but the other direction is still only 48\" across a typical bedroom size of 10'x12'.\n\nLet's say the joists are 2x10. That leaves 9 1/4\" for insulation. So let's assume existing is R19@6\" thick (R30 is 10\" thick). He's going to carefully take out nails, maybe chisel adhesive off the joists, and reinstall, or buy new sheets if they tore them up, after another 3 1/2\" of insulation is layed on top the R19 (that will be compressed) to achieve almost R30 in that 48\" wide strip. \"Sliding\" batting means stuffing it in over the existing which doesn't work well without compressing it, and across probable bridging does the same. Or if they cut more of the sheathing closer to walls now they will have to add blocking back to support the sheathing.\n\nThat's the point there will be no noticeable differene for doing all this trouble. Approach it from below and with the other things addressed that I mentioned is much better to actually get results.", "label": 0}
{"text": "It's on the very top I can see an empty hole in the floor above where the pex was supposed to go right above it and I can feel the hole with my fingers when I run it along the top.", "label": 0}
{"text": "You won't have any problems. Put a little extra glue to fill the cut.", "label": 0}
{"text": "Is that a sink?", "label": 0}
{"text": "High heat paint would be my first thought.", "label": 0}
{"text": "Until he gets a clogged line and poo poo water comes out there.", "label": 0}
{"text": "Leave that space alone. Insulation traps air, which is one reason for its effectiveness. one of the most effective insulators is a cork floor. 3/8\"-1/2\" cork wall to wall will provide a nicely insulated floor.  Add a thick $99 8x10 area rug from Home Depot and you should be all set.\n\nAnother thing to look into is conductive paint for one of the walls. It is literally paint that can warm your walls. It gets up to about 50-55 degrees, and is designed just to take the chill out of a room and make it much easier for any room heater to pull the temperature up from 50 to 72 degrees or so. Apply the conductive flat copper foil to the wall, one conductor on one side and the other at the other end of the wall 8-10 feet away. The two conductors go to a little transformer/power supply/wall wart that doesn't suck much power at all.    Paint the wall with this paint (it is generally carbon black), and when it dries you can paint over it any color you want. You now have a wall that is heated to 50-55 degrees F.  No flames, no gas, no bright orange electrical coils.   This would work perfectly in a garage bedroom setting. Then just get an electric blanket and you'd be toasty.  Google it.", "label": 0}
{"text": "Nope it's for the upstairs shower. This is in the basement ceiling under the upstairs shower. I think the previous owner diy'd some stuff and now I'm paying the price.", "label": 0}
{"text": "I'm no expert, but this isn't load bearing or anything so just about anything goes that will look good in the end.  Other people will correct me I'm sure, but...\n\nI'd screw another board vertically on the center line of the tile on the right side for additional support.  You'd have to get your drill inside to screw a new 1\" (or whatever you have handy) board vertically on the *inside* so you'd be reaching in and pointing the drill bit back at yourself to attach the board to the bottom board and I assume there's another board we can't see at the top of the gap.\n\nThen put some 1/2\" drywall sitting on that bottom board, and screwed to your (now two) vertical boards.\n\ntape and float the drywall if you have moisture issues (you probably do).  Plaster the drywall and set your tile.\n\nAlternatively, just screw a 1/2\" piece of plywood to that single vertical board and plaster it up.", "label": 0}
{"text": "Ok I see it now, I honestly don’t think this will be much of an issue given it is on top of the pipe, has it leaked yet?", "label": 0}
{"text": "It uses 10’ strut channel and a trolley to support the back and two wheels that roll out to support the front and follow the terrain", "label": 0}
{"text": "Not worth it. That is currently unconditioned space. You would have to remove the wall insulation, and install insulation between the roof rafters. You need an inch of air, clear, under the roof sheathing, using baffles. These would need to create an air space all the way up to the roof ridge, where you would need to cut for, and install ridge venting, if you don't have it . The baffles would need to extend down, into the soffit area, where you would need soffit vents, if you don't have them. \n\nSince your rafters are undersized, you would need to extend them down, to make them wide enough to accommodate though enough insulation. Them you would need cross strapping, to level the roof plane for sheetrock. Before installing sheetrock, install plastic vapor barrier to entire under side of roof, down exterior wall. Make sure vapor barrier is complete, and taped, to create a total seal to the outside. \n\nYou might also have to supply heat to the area, as it is currently unconditioned. \n\nAll this, for a few square feet of oddly shaped space? Nah.", "label": 0}
{"text": "Yea that's how I found it the sheet rock was damp and water was dripping out of the light not too far from it. So I cut into the sheet rock and let it dry then one day heard water dripping and went on there and saw soap bubbles coming from the top of that elbow.", "label": 0}
{"text": "You can buy a drill bit attachment to ream the inside of the coupling. I think they are called \"pipe savers\"", "label": 0}
{"text": "Yeah it will work, but not well.", "label": 0}
{"text": "Alright I took a closer look and I think I misunderstood what he was saying.  I thought he cut a 1/2\" into the stub, not all the way back into the next fitting.  That's an issue because it'll cause sewer gas to leak and stank up the whole room.  The proper fix is to remove the cabinet and drywall and replace that whole section of pipe. The cheap and easy fix is to put some sealant in the cut and hope for the best.  TBH, if it was my house I'd silicone it and hope for the best.  There's not much risk involved in a repair like that failing in a spot like that.   Just means you have to fix your stinky house later.", "label": 0}
{"text": "Is it tiled over Drywall? What is the brown material showing behind the tiles?", "label": 0}
{"text": "Construction adhesive and long screws.", "label": 0}
{"text": "I would caution that the ridge vent is enough for the added moisture load. The ridge vent will also do nothing if you insulate against the roof deck, they make specific venting solutions to do this.", "label": 0}
{"text": "Yeah I don’t think this was properly waterproofed in the first place", "label": 0}
{"text": "No.", "label": 0}
{"text": "These days they dont follow that rule. For an indoor fireplace it depends on the positive/negative pressure threshold of your home. With how sealed up and well insulated houses are these days the difference in pressure can turn the flue of a fireplace into a straw for the house to breathe. But with outdoor fireplaces the physics of it working properly are essentially as basic as you stated.", "label": 0}
{"text": "This is what you need to do. Anything besides replacing that slit pipe would be a half-assed hack ", "label": 0}
{"text": "If you put a grow op in your attic, it's likely gonna smell regardless of what you do.  My bigger concern would be moisture due to condensation, and the resulting mold.  I don't know much about this sort of thing, but I know enough about buildings to recommend an always-on exhaust fan at a minimum.  Attic spaces can get condensation issues in normal circumstances, so I'd be nervous to add a whole mess of plants to the mix.", "label": 0}
{"text": "Nah", "label": 0}
{"text": "Remodeled my kitchen, remodeled my parents, my parents moved, remodeled the new one, remodeled my grandparents as well.  \n\nI know I bought the hardware for at least 3 of these, if not all 4.", "label": 0}
{"text": "Garage doors are not air-tight.  That seems normal to me.\n\nYou may want to discuss weather-strip options with /r/GarageDoorService, though.", "label": 0}
{"text": "It’s actually just a clear coat! We were pleasantly surprised.", "label": 0}
{"text": "So basically in the early days of weed, it was high on CO2 24/7", "label": 0}
{"text": "I would recomend it not being exposed to the elements. A wood fireplace like this will not last outside. Especially shaped like this, its inviting water to get into the combustion chamber and cause premature rust and failure. Indoor fireplaces aren't built for outside, and outside fireplaces are definitely not built for inside.", "label": 0}
{"text": "I really liked the bricks before did you use some kind of special brick stain or something? The floors look awesome in the after", "label": 0}
{"text": "I have a similar space, but it's a full ass half of my second floor in a cape cod. Would I call an insulation expert in to finish it? Currently we call ot the asbestos room because of all the asbestos.", "label": 0}
{"text": "Definite improvement. Floor looks nice. A lot of black. If the wall behind the fireplace was painted the same colour as the rest of the room it would make the fireplace pop a bit more and compliment the window. But definite cozy feel now.", "label": 0}
{"text": "No sanding?", "label": 0}
{"text": "Please Google the term “dielectric union”, and why it is used on water heaters", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Would make a really nice red room!", "label": 0}
{"text": "Looks great. Surprised the “you never paint brick” people haven’t brigaded yet.", "label": 0}
{"text": "I was like - don't paint the fireplace white, don't paint the fireplace white.\n\nThank you.", "label": 0}
{"text": "![gif](giphy|3oKIPlLZEbEbacWqOc)", "label": 0}
{"text": "I’m not sure what you mean, the fireplace takes up the whole wall.", "label": 0}
{"text": "That looks amazing!! I would have gagged if someone told me they were going to paint their brick fireplace black lol, but it actually looks fantastic.", "label": 0}
{"text": "Oh they let me have it in the initial post, I’m sure they’ll be along soon.", "label": 0}
{"text": "That looks great with those floors", "label": 0}
{"text": "I generally don't recommend painting brick, but the original color is awful and the black is a huge improvement.", "label": 0}
{"text": "It's a pretty gross looking brick to be fair.", "label": 0}
{"text": "Everyone said it was gorgeous last time lol", "label": 0}
{"text": "Save your sanity, and just repaint the whole entire wall", "label": 0}
{"text": "Looks awesome!", "label": 0}
{"text": "Love the black stain and the floor color. Great job!", "label": 0}
{"text": "Something feels so unsettling about the all black bricks. I'm wondering what it would look like you managed to highlight the brick instead of erasing it from existence.", "label": 0}
{"text": "Most sealers state that the grout needs to fully cure before sealing, which is typically 30-60 days depending on the grout. \n\nOP should be limiting cleaning during this time which will disrupt the curing and pull color from the grout. Once it's fully cured, it should be sealed.", "label": 0}
{"text": "You may want to post this to /r/PestControl.  Last time something like this was posted it turned out to be termites.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "You could try accented parts of it. or simply take some sand paper to the joints to expose the brick pattern? Just food for thought.\n\nLooks good imo.", "label": 0}
{"text": "Yes it looks like someone might have slipped and fell into the wall where the soap dish was, tried to get their balance on it and ripped it off.", "label": 0}
{"text": "Unless it's epoxy grout, it should be sealed. \n\nAlso not understanding the addition of grout. Applying a thin layer over existing grout is a really bad idea. Grout/mortar/concrete does not stick to itself. If that's what you did, I would expect the top layer to start chipping within a year.", "label": 0}
{"text": "Cool, thanks!", "label": 0}
{"text": "Your house isn’t in Oakley is it? Lol looks identical to what was behind my upstairs closet years ago.", "label": 0}
{"text": "It looks pretty flat in this photo in person it has a lot more texture and dimension. I’ll see if I can capture it in another photo.", "label": 0}
{"text": "We did sand them, then just conditioner and clear coat", "label": 0}
{"text": "Usually I would say never ever mess with natural but this maybe the one exception it turned out really nice! Great job", "label": 0}
{"text": "Is the fireplace still functioning \nIf so that is the koolest nook \nIv seen in a long time", "label": 0}
{"text": "That looks awesome - I was thinking you might’ve painted it white when I saw the first pic, but black looks way better. Nice work!", "label": 0}
{"text": "I do not even see something that needs to (or could) be fixed.", "label": 0}
{"text": "Lol that’s such a bad take, indoor exposed brick really only looks good when it fits the style of the home (mostly loft-style). Otherwise it just looks outdated AF", "label": 0}
{"text": "Exactly. Free air against the roof? Good. \n\nInsulation against the roof? New civilizations will be discovered. You'll get a cite in Nature. Won't be enough to pay for a new roof, though.", "label": 0}
{"text": "It sucks, but it’s time to just repaint the whole room. This happened with my kitchen. Touched up a few nicks and dings and chips here and there. Next thing I know I’m painting the whole thing.", "label": 0}
{"text": "I used milk paint, it’s water based and comes in a powder that you mix yourself. This way the brick absorbs it instead of sitting on top like regular paint would.", "label": 0}
{"text": "Aaaah perfect", "label": 0}
{"text": "imo, I like the more rustic feel, I'd rejuvenate the brick to make it more vibrant and build around that, like some some cherry wood panels on half the wall.", "label": 0}
{"text": "Can you take a picture of the hardware they provided?", "label": 0}
{"text": "The black looks really good.  I think it really makes the floors stand out.  A lot of people fear putting black into a small room.  It actually can make a room appear cosier.", "label": 0}
{"text": "Appreciated!", "label": 0}
{"text": "Like inside the house!!", "label": 0}
{"text": "I would do it if you don't want it inside. Take off the smoke stack and get a decent tarp to cover it when not having a fire. \n\nThere will be a bit of oxidizing (rust) with weather and humidity but it isn't dangerous from my knowledge. You can grind and paint it too. \n\nDefinitely modify a bit if taking it outside. It is a cool piece for retro outside", "label": 0}
{"text": "Thank you so much for the really detailed response LOL. Yeah it looks like whoever did it Just layed them down the on ground and I guess over time definitely got thrown off. I like the idea of putting some stuff underneath it and I'll definitely look into those options you sent me cuz it sounds good. Thank God we don't get any trick-or-treaters but I have seen a doordash guy almost go down once so I knew it was time lol", "label": 0}
{"text": "https://imgur.com/a/WBXTbQY", "label": 0}
{"text": "I am obsessed. I love black tho but this is super tasteful and kinda hides the taller area which looked awkward before. Well done OP", "label": 0}
{"text": "Do you own the house?", "label": 0}
{"text": "Clean it really well and get yourself some concrete stain. Pick the color you want and test it in a inconspicuous spot to make sure it’s the color you want", "label": 0}
{"text": "Tbh I've never chilled in my garage with the lights off to ever notice how much light comes in.", "label": 0}
{"text": "Yes! First home, built in 1900", "label": 0}
{"text": "On a serious note.... I'm seeing 2x4 rafters and you need a deeper pocket than that for insulation those need to be doubled so you can put rafter baffles in and insulation over that before you can drywall.\n\nThe only way to do that, in that cramped space, is to sister 2x8s next to all those sloped rafters you want to enclose and insulate.  Being a grow room, with high moisture ranges, you'll want to use a moisture barrier or house wrap as well. \n\nYou will need 2 or 3 seperate electrical circuits to that space, depending how many lights you're planning. But as noted elsewhere in this thread, you should plan air conditioning and dehumidifiers.\n\nGrow rooms are a lot of work and investment. If you don't like your end product, you'll regret it. Just be smart, do your research and ask other growers lots of questions.", "label": 0}
{"text": "That shower is gone. tile on drywall is a big no no. remodel time.", "label": 0}
{"text": "Yep! Not cold enough yet but will be a good reading spot.", "label": 0}
{"text": "Congrats!", "label": 0}
{"text": "Where did you get that chair? I'm looking for something just like that for my house", "label": 0}
{"text": "I’ll never forget the guy who fell down the stairs and put a giant hole in the wall at the bottom, then asked for Reddit’s help in fixing it before his wife got home \n\nEverything went great until he painted the patch. His wife immediately knew because the area was a couple shades darker than the rest of the wall lol", "label": 0}
{"text": "He can just cut the pipe back in the fitting and replace the cut pipe.\n\nThey make a bit for that, or a wing it with a rotary wheel.", "label": 0}
{"text": "https://www.nfm.com/natuzzi-editions-destrezza-leather-arm-chair-in-brandy-59797027/59797027.html", "label": 0}
{"text": "When I win the lottery I am hiring you", "label": 0}
{"text": "You should have left it and did a wood wainscoting, and crown molding in the same shade of the wood that the mantle is made out of.", "label": 0}
{"text": "Nobody suggested that?", "label": 0}
{"text": "Omg I need to see that...have a link?", "label": 0}
{"text": "Damn... there really is a sub for everything", "label": 0}
{"text": "The old brickwork did look ok. I do really dig what you did with it. It is going to make the fire stand out nicely too.", "label": 0}
{"text": "I'm a non-pro, and only use my batter nailer(s) for inside projects where I don't want to drag a hose or have a loud compressor in the house. Outside and shop I use the air guns.   \nThat all said...I seem to have subscribed to the Ryobi ecosystem, so your last point is spot on.", "label": 0}
{"text": "My apologies, thanks for the recommendation \nI'll try there.", "label": 0}
{"text": "Those are going to be ring shank nails holding down your subfloor.   Assuming you have to drill the joists to run an electrical wire for the fan, I would look at using an installer bit from the ceiling rather than cutting the floor.  Much easier to repair sheetrock than your subfloor.  Google \"5 foot installer fish bit\" to see if it's something you can use.", "label": 0}
{"text": "Likely, but is that diy friendly for someone thinking they can use an indoor stove as an outdoor fireplace? \n\nYou need to relate to the people that are DIYing. Using high heat spray paint at $10-15 every few years is much more DIY friendly than alternatives.", "label": 0}
{"text": "RemindMe! 1 Day", "label": 0}
{"text": "Latex, all the way /s", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Good but Needs overhead lighting desperately - LED cans around the perimeter or large pendant or combination of both.", "label": 0}
{"text": "All of my touchups are unnoticeable, but not until a few days after application. Used the exact same paint and a roller. Brush touch ups will always look different due to surface tension during application.\n\nAlso, if this isn't the original paint, i.e. it's color matched or a new can of the same color, it will never match.", "label": 0}
{"text": "Cram it wherever your species traditionally crams things!", "label": 0}
{"text": "I’m curious what brand and color you used. I have a fireplace in my house that the previous owners did a bad job of trying to paint (Or something? It’s hard to tell exactly how they messed it up). But we were also thinking of painting ours black to make it look more uniform and tidy.", "label": 0}
{"text": "Probably the kind where he asks about it on AITA and opens with how perfect their relationship is…", "label": 0}
{"text": "He's married.", "label": 0}
{"text": "https://a.co/d/hD7pgkU", "label": 0}
{"text": "Brill some pilot holes in the four corners (not too close to the ends) so you don't split the wood.", "label": 0}
{"text": "FYI you can’t have paint on the crick and it also can’t be sealed. The brick needs to be able to absorb the water.", "label": 0}
{"text": "If it’s not a climate controlled garage, and your not getting water blowing in then I wouldn’t stress it. Iv found weather stripping on garage doors wears out quickly and stops sealing. Replaced it all on my garage door and had same issue again in 6 months. Year later got a whole new door professionally installed (for other reasons) and again 6 months later same issue lol.", "label": 0}
{"text": "Am I the only one that wants OP to either make that doorway into a secret passage, or rig up some fake bricks to wall up a mannequin holding a cask of Amontillado?", "label": 0}
{"text": "Good to know. It’s possible we’ll need to go another route in that case. Thanks for the link!", "label": 0}
{"text": "i just fade out with a brush...", "label": 0}
{"text": "What you don’t see is the hole on the other side of the archway where a vanity light from the 80s has recently been ripped out. We will get an overhead light eventually, but I can’t decide on what I want yet.", "label": 0}
{"text": "Rad", "label": 0}
{"text": "In the garage light on. It will go away", "label": 0}
{"text": "Depends a lot on where you're from. In some areas, it's now not uncommon (especially in older houses) to get a peak to eve foam of your rafters (no more cold zone). It's far more energy efficient and most old houses breathe just fine without roof soffits.\n\nI did exactly that to my attic space awhile ago and it made it immensely warmer, I have no moisture issues (I did install some vent fans for the summer), and frankly it's made it entirely livable. Something to consider.", "label": 0}
{"text": "I work at a paint store. \n\nTouch ups are impossible to be reliable. Paint fades on the wall and doesn't fade as fast in the can. \n\nIf you repaint one wall it will match the other walls and you won't even be able to tell.", "label": 0}
{"text": "Your patches need better sanding and blending in before you paint more. Then get one of those little rollers and roll first over the newest spots with the thickest paint a few times then thinner farther away from patch until you have that paint roller texture matched. Then paint the whole wall one coat.", "label": 0}
{"text": "This looks great!   Very surprising result.  But…this looks like a very small room.  What is its purpose? Someone mentioned being grateful that you didn’t install a tv over the mantle, but the room looks too small to be a tv room.", "label": 0}
{"text": "Well, I think a more traditional brick stain would have looked better, but hey it's not my house and not everyone is into the look.  Can't complain on technical merits, they did it properly. After that it's all just taste and anyway, this is r/DIY not r/homedecor.", "label": 0}
{"text": "I love it", "label": 0}
{"text": "That picture looks a lot better. I like the sort of white lime wash that shows around the bottom of the fireplace.", "label": 0}
{"text": "I used these for the same reason but I got mine at Lowe’s.", "label": 0}
{"text": "You want /r/AskAPlumber and /r/Plumbing for this", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Oh, I see! Makes sense.", "label": 0}
{"text": "FACTS!!", "label": 0}
{"text": "But then how will you see the rust?", "label": 0}
{"text": "It is adjacent to our living room and you are correct far too small to use as a tv room. The house is very old and I suspect it was originally a completely closed off room, or maybe pocket doors were removed? The left side also has the stairway that leads upstairs.", "label": 0}
{"text": "Gaming den", "label": 0}
{"text": "I don’t do plumbing — why wouldn’t a coupler work here? The inside would catch gunk or something?", "label": 0}
{"text": "At least two have suggested it so far and I’ve only scrolled as far as this comment.", "label": 0}
{"text": "or a hot and spicy chili oil", "label": 0}
{"text": "To add to that, you can use closed cell spray foam to meet code in the roofline, which also creates a vapor barrier for you, and replace the old fiberglass to get a full envelope on the room you want to make.", "label": 0}
{"text": "Any worry for mold, bugs, rodent issues with warm, damp soil in an attic like area?", "label": 0}
{"text": "Have you asked r/trees?", "label": 0}
{"text": "You could put a skirting board around the island. Not saying it would be my first choice, but it's an option.", "label": 0}
{"text": "I remember this post! Nice choice!", "label": 0}
{"text": "This, I have had to do this exact thing, could not get new drain pipes to fit. This little device was a life saver.", "label": 0}
{"text": "Seeing as this is going through the back of a cabinet I'm assuming this is a sink drain. Although it looks a bit big for sink drain, is it 2\". Also assuming the picture is oriented so that up is the top of the pic. Is the cut through the pipe wall at an angle or does it penetrate to the inside all the way back? If it's at a shallow angle and only cuts through for the last inch or so, I'd cut the pipe flush with the cabinet and put on a new coupling. You can make a flush cut with a wire saw, a hand saw or an oscillating multitool. \n\nIf the cut goes all the way back, you'll need to remove the piece of pipe and glue in a new one. You can heat the pipe with a hot air gun until its soft and then twist it out. Look for a YT vid to show you how.", "label": 0}
{"text": "Oh gosh I hope not lol\nThanks for the tip.", "label": 0}
{"text": "Perhaps ask /r/CleaningTips about this", "label": 0}
{"text": "Just ONCE I want to see a legitimate post by someone who completely 100% IS the a-hole", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "If I had not seen the before, I might have thought *oh I would have done it better*\n\nIt's great - the before was really talking too much, stealing the show.  The after is updated and calm.", "label": 0}
{"text": "Please post this to /r/sewing and subreddits that deal with fabrics and vinyls", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* It is a \"craft\" project. Paper projects, origami, candles & small decorative items are not allowed. Please post these to /r/crafts. \n* It is about paying someone else to do the job - please try /r/homeimprovement.  \n* It is in some way unrelated or not a good fit for /r/DIY - please try /r/findareddit and submit your post to an applicable subreddit suited for your submission.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Wrong%20Subreddit).", "label": 0}
{"text": "Shoemold. You could choose to use pine and paint it to match the cabinet, or you can use oak and stain it to match the floor.", "label": 0}
{"text": "Was a one story craftsman, previous owner redid attic as living area (1.5 bath, 4 bedroom and living room). No access to remaining attic", "label": 0}
{"text": "Store shit in here to make room to grow somewhere else", "label": 0}
{"text": "I had a space just like that, and I made an office out of it. I have pictures of it somewhere in my post history, just don't know how to link it.", "label": 0}
{"text": "Painting for me is one of the most arduous tasks that I build up in my head but after all the prep work (key) and couple coats, it's one of the most rewarding things a man can do.", "label": 0}
{"text": "youve never lived!! the experience is illuminating", "label": 0}
{"text": "I did something similar, but with carpet. My now wife and I were pet sitting a bunny who decided to eat the carpet in the corner of the room. We went to HD and bought a \"sample\" board of carpet. The fee if we didn't return the sample board was only $20. One of the squares matched our carpet well enough that the apartment complex didn't even notice. We got our entire deposit back.", "label": 0}
{"text": "Put an extraction fan to get rid of the weed smell", "label": 0}
{"text": "6 if you can space them evenly two per stud.  Won’t be able to rip it out if you tried", "label": 0}
{"text": "Angry updoot.", "label": 0}
{"text": "Your patches don’t even match the texture and you care about a slight mismatch in the paint?", "label": 0}
{"text": "Perhaps ask /r/ApplianceRepair about this", "label": 0}
{"text": "Looks so good!", "label": 0}
{"text": "Metal screws?\n\nAnchor?  toggle bolt? \n\n  \nOdd situation.. was there no knobs to begin with?!?", "label": 0}
{"text": "At night, plants close stomata to prevent water loss.", "label": 0}
{"text": "Shake it up really good. Paint your spot and feather it out as you get bigger. Don’t do a square, do a larger oval and fade/feather the edges.", "label": 0}
{"text": "I only had a brush and a sponge.  But sure,  a roller would do it, too.", "label": 0}
{"text": "Assuming there is no water hook up\n\nMost fridges have  heater element which heads up briefly to melt any frost build up.\n\nThat Melt had to go somewhere. On a big fridge it goes into a pan by the compressor cooling fan and it is blown by the fan to evaporate it.\n\nWhen the line that draws the water to the cooling fan is blocked it will leak out of the fridge.\n\nFind that line and unblock it.", "label": 0}
{"text": "/r/DIY does not provide quotes or pricing.  You will have to interview multiple contractors in your area and request quotes.", "label": 0}
{"text": "Thank you for submitting to r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Inappropriate Topics: \n   * Cooking, Cleaning\n   * Basic home maintenance (Lawn Care, Painting, Lighbulb Identification, etc)\n   * Basic general automotive maintenance\n   * Sewing, Crafting, Decorating, Life Hacks\n   * Cosmetics, Hair styling, Personal Hygiene \n   * Software based design: Solely CNC, 3D or laser printed projects\n   * Solely Programming, Coding, Scripting, Automations, etc.\n  * Requires a professional (Asbestos, Dangerous, Certification Required, Etc)\n\n    * Memes, Jokes, Polls, Opinion Requests, Rants, Venting, General Complaining\n\n^(Mod discretion may be used in cases if the above is not adequate enough to describe the content not suited to the community)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Had a dog scratch up and chew at the carpet right by the main door to the apartment. Grabbed a cheap larger metal transition piece and threw it down. No one ever even questioned it and we got our full deposit back", "label": 0}
{"text": "The knobs I had are those type that work as knob and keyed entry with knob on both side.", "label": 0}
{"text": "We have a malm outside in N Texas and it’s held up great. It’s mostly covered which probably helps but still plenty exposed.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "\"WHERE I CAN GROW PLANTS\" 🪴 💨 🌬", "label": 0}
{"text": "I think that the lattice would look fine if you were more thorough when lining it up across the doors and drawers and surrounds; that's a big ask and a lot of super fiddly work.\n\nThat being said, it's a great way to get rats and birds and insects into your storage, but you're going to have that problem regardless. It's also not terribly secure against thieves. As long as you aren't planning on storing a lawnmower or anything expensive, stealable and easy to pawn, you should be fine and it's a neat thought that I have considered for myself but ultimately abandoned.", "label": 0}
{"text": "The pipe is split lengthwise. A fitting would cover up most of it but the risk of leaks is very high", "label": 0}
{"text": "You're right", "label": 0}
{"text": "/r/DIY does not provide recommendations of vendors or products.  You will have to search for ribbons on your own.", "label": 0}
{"text": "Cannabis is C3 crop, so negligible nighttime humidity release besides non stomatal transpiration (usually <5% of daily transpiration).", "label": 0}
{"text": "Explain how mounting a 2x4 to the wall is going to hold books", "label": 0}
{"text": "That's usually because the drain for water when it defrosts to the pan underneath is blocked.  Jam a wire or something down it to clear it, and it will drain properly.\n\nTuring it off will just make it worse.", "label": 0}
{"text": "Necessity is the mother of invention. I love it.", "label": 0}
{"text": "And now it looks like a cozy but roomy reading nook. You must require the occupant(s) to wear tweed and keep a cigar/pipe on a side table. 🤣", "label": 0}
{"text": "If it’s an attic space then it should remain intact as an attic space. They are separate structures of the house. Changing them makes for big heating and cooling problems. \n\nJust use a grow tent.", "label": 0}
{"text": "I agree with all of that!", "label": 0}
{"text": "I kind of lovehate it. What I do love is how it accents the wood floors and the wood mantle. I really didn’t like it before. This is a definite upgrade!", "label": 0}
{"text": "Fill the hole.  Install a new anchor right next to the old hole.", "label": 0}
{"text": "turn the brightness down, or switch to dark mode", "label": 0}
{"text": "It’s 3/4” oak.", "label": 0}
{"text": "It looks like there’s about two inches on the bottom between the vertical inner and outer door frame boards where you could screw in a 2” x 2”. Paint is white, and it will look like it was meant to be there.  With two less inches, that should be enough to keep the dog in.", "label": 0}
{"text": "This a one way door? How do you open  if you're on the dummy knob side of the door?", "label": 0}
{"text": "I’d prefer not to move it over to the side though. :/", "label": 0}
{"text": "Im not an expert but had a similar situation in my home. My understanding is that this is a big problem. The waterproofing is now compromised and the only way to ensure that you dont get rot/mould under your shower is a complete rebuild. \n\n\nI would move swiftly on this. Get advice from a builder and get a paper trail going with the cleaning co via email. The best outcome is you get their insurance to cover it ", "label": 0}
{"text": "I am planning to put dummy knob both side. The door will be locked by keyless door keypad from outside and a small handle like thing from inside. The knob are basically to pull push the door.", "label": 0}
{"text": "If it has been previously painted, no.\n\nOtherwise, sure.", "label": 0}
{"text": "Think I’m going to take that advice and run with it. This is something I’ve been contemplating since we’ve moved in but only just started messing around up there the last day or so. I’ve got a tent on my back porch now but with it getting colder I don’t think the plays will like 40s and below wether. Next stop is checking the basement. Appreciate the reply 👍", "label": 0}
{"text": "Thanks for the lead", "label": 0}
{"text": "We would but we have a storage building for all of those things.", "label": 0}
{"text": "Then yeah, just paper. Padding will make it more likely for the boards to move, resulting in squeaks/popping. ", "label": 0}
{"text": "Oh, I'm very pro maximalism, but that doesn't mean just slap any old things together.  You still have to work with the style of your house.", "label": 0}
{"text": "You said your ADDING walls, NOT tearing down walls. Your fine, add as many walls as you want. \n\nMaking a maze?", "label": 0}
{"text": "Do not add white. It's not something you can dial in by hand. Also, make sure you stirred and shake the can.\n\nFinally, feather it out with the unloaded brush.\n\nIf all else fails you'll have e to repair t but do not just add white (or any color) - at least not straight into the can.", "label": 0}
{"text": "Should be able to pay the mortgage off in no time then! 😃", "label": 0}
{"text": "That board is part of a de facto drain pan situation.  It should have a right angle appliance pig tail for the power cord.", "label": 0}
{"text": "Is there a general guide for what to look for? The youtube videos I am finding look entieely different (many have metal backplates or the compressor is a different make, I do not want to accidentally destroy something)", "label": 0}
{"text": "And it does. That a major reason I’m\nNot sure about the insulation. Like I’m\nNot sure if I should get some on the roof or not", "label": 0}
{"text": "That looks like casing for around windows and doors. Might be worthwhile to get actual baseboard trim", "label": 0}
{"text": "It’s fine, crank the amps to the 11 and let it ride", "label": 0}
{"text": "You want /r/AskElectronics, /r/DIYElectronicProjects, /r/DIYElectronicCircuits, and maybe some laptop subs", "label": 0}
{"text": "It’s an uninsulated attic storage space. Unless you’re willing to do some serious renovations it should stay that way. Growing plants in here without proper venting will definitely lead to mold issues.", "label": 0}
{"text": "Fair enough, thank you!", "label": 0}
{"text": "Why not cut a sample of the color off from the wall and then take said sample to a color match machine? \n\nYou already know how to patch a hole.", "label": 0}
{"text": "If it’s insulated properly it’s perfect for climate control just make sure you have an exhaust port and don’t listen to these weenies", "label": 0}
{"text": "Change it to a toggle bolt.  Patching it or (jesus christ!) hot gluing it will be temporary.\n\n  \nSOmething like this:\n\n[https://www.homedepot.com/p/Everbilt-8-32-tpi-x-3-in-Thread-Head-Anchor-Toggle-Bolt-814048/204273392](https://www.homedepot.com/p/Everbilt-8-32-tpi-x-3-in-Thread-Head-Anchor-Toggle-Bolt-814048/204273392)\n\nYou can use a screwdriver, wiggle it around to make the hole big enough...dont need to drill precision holes- just get the toggle in any way you can\n\n  \nOh, if the second anchor is still OK, leave it- just one toggle is all you need.  The second anchor just kinda keeps it from rotating- all the strenght will be the toggle", "label": 0}
{"text": "I'd also block those corners, and maybe thicker wood under gate...", "label": 0}
{"text": "lol.  I just answered the initial post...told you spackling the hole was going to be a waste of time and it would fail.\n\n  \nAdvice still is to install a toggle...find my post", "label": 0}
{"text": "You have 2 choices. Pull up the subfloor, or tear out the garage ceiling.\n\nYou could just pick the easiest of the two.\n\nRegardless, if you open it up, it's best to replace the compressed insulation with new.\n\nIf you do the garage ceiling  you have extra opportunities. \n\nYou could add a 2x2 on the bottom of the joists, giving room for more insulation. Turn 2x6s into 2x8s.\n\nOr, you could add a layer of foam board attached to the bottom of the joists. Tape the seams. Seal edges with canned spray foam.\n\nDefinitely add a vapor barrier. An added benefit of a vapor barrier  here is to make the ceiling air tight to prevent any car exhaust fumes from getting into your bedroom.\n\nAll in all. I'd do the garage ceiling.", "label": 0}
{"text": "Wall has faded slightly over time.\n\nAlso, the patches are a different material than the main drywall so the paint will look different.\n\nGoing to have to paint the entire wall at least.  Maybe not the bathroom, but that one wall, yes.", "label": 0}
{"text": "In laws room when they come over?", "label": 0}
{"text": "I’d install shelves that are on rollers so you can roll the shelf out since it’s so deep it would be impractical to reach your arm back inside there.", "label": 0}
{"text": "So no primer?", "label": 0}
{"text": "If you want to be ahead of the game, dust off that can of beige from 2003…", "label": 0}
{"text": "Perhaps share as many pictures of the room that you have with the dozens of interior design subreddits out there.", "label": 0}
{"text": "You mounted posts in concrete in three foot deep hole and the post didn't stay up straight?", "label": 0}
{"text": "1.  Take the shelves out.    \n2.  Make a wall panel that hides this creepy closet.   \n3.   Cut the eyes out of a portrait painting.    \n4.   Cut holes in the wall aligning with the eyes.   \n5.   Invite Scoobie Doo and friends.", "label": 0}
{"text": "I think there’s some code violations in there… the santee below the floor next to the fernco on pvc… is that the u bend for the shower? That doesn’t seem right…", "label": 0}
{"text": "If you're just gonna paint it black, why not just cover it up with paneling or plasterboard? Why make the conscious decision to permanently discolour the bricks with a \"milk paint that seeps into the bricks\"?\n\nI don't like it, and think you should have at least left it there to be discovered later. Natural brick colour feels homely to me. The black paint is short sighted, and irreversible.", "label": 0}
{"text": "Add proper sized board across studs centered for tv mount. TV will hide any unsightly mess.", "label": 0}
{"text": "Slide out storage", "label": 0}
{"text": "The only obvious answer is to leave an Ana Lee doll sitting I  the corner for the next guy.", "label": 0}
{"text": "I'd remove the shelves, line the inside with white melamine, and build a roll out rack that can store towels, extra toiletries, etc", "label": 0}
{"text": "Slap some latex paint on masonry. Nothing could possibly go wrong. /s", "label": 0}
{"text": "I mean I’d be down for that too. I don’t HAVE to grow here, just thought it’d be an easy spot and could vent right out the side. But I would like to insulate what would help with it staying too warm in the summer and too cold in the winter.", "label": 0}
{"text": "With a small spot, you can fade the edges and blend.  It takes a bit of time.  I know it's not wet on wet, but Bob Ross has his \"three hairs and some air\" technique.", "label": 0}
{"text": "White washed would be pretty!", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "They're just trying to be helpful, checking for water issues or mold.", "label": 0}
{"text": "We just renovated our kitchen only to discover this mess, is there anyway we could make it look like plaster, so we can paint.", "label": 0}
{"text": "I only use some finger nail clippings with some carefully applied pieces of lint as brushes for my strokes, but you're right you could do that too", "label": 0}
{"text": "That was my first thought as well before checking hr comments.", "label": 0}
{"text": "Looks cozy, needs another chair, mirror has to go.", "label": 0}
{"text": "Then you might have to go deeper, to get anything to stay up/straight . Tough situation .", "label": 0}
{"text": "I have a space a lot like that in my basement bathroom. \n\nI'd rip out the door and the rough shelves. Paint some mdf or paint-grade plywood white, and tack it up to the studs, making a built-in cabinet. \n\nThen put some shelves in and get a bunch of these :\n\nhttps://www.containerstore.com/s/elfa/components/classic-by-elfa/elfa-mesh-drawers/123d?productId=11021313\n\n Mine are 9\" wide and function like pull out drawers. Works really well and looks ok exposed since the baskets all match. \n\nIf you want to keep the depth and can get 2 deep baskets in there more power to you. But I wouldn't feel bad making your \"cabinet\" shallower than the space.", "label": 0}
{"text": "Btw that was really clever shit posting, and even though I responded flat I appreciate the humor and also you, my person. It wasn't lost on me, I just fall into client relations mode when I'm talkin nerd shit. Thanks for the tasty slop, redditor 😘", "label": 0}
{"text": "What you’re calling a screw is a bolt. What you’re calling a bolt is a nut. The rest are holes.", "label": 0}
{"text": "I have the opposite situation. I have the shiny insulated space against the roof, but no grow :P\n\nIt does seem perfect for it though! Even has a big fan to vent. Just not my thing.", "label": 0}
{"text": "Here is the link to the other post with the resolution: https://www.reddit.com/r/DIY/s/EW9vxztE7D", "label": 0}
{"text": "is this \"plaster\" or \"wallboard\" aka \"Sheetrock\"???\n\n  \nIf its sheetrock ie both the white part and the brown part) just spackle and tape, skim coat.\n\nWhats the slatted stuff above the green??!??", "label": 0}
{"text": "I think its wallboard, its cladding.", "label": 0}
{"text": "jinkies meep it sure is spooky!", "label": 0}
{"text": "Piqued", "label": 0}
{"text": "Easier to back out a screw and not destroy the picket possibly as compared to nailing also nails back out. Yes it's more expensive, but as the saying goes, \"ya get what ya pay for\". Do it right and tell em to stuff it.", "label": 0}
{"text": "Good choice", "label": 0}
{"text": "OP ignored all of the top comments from her last fireplace post and painted the brick. At least it’s not white…\n\n![gif](giphy|84BjZMVEX3aRG)", "label": 0}
{"text": "Bummer I love the original brick but I’m happy you found a solution that fits your tastes!", "label": 0}
{"text": "Why did you tear it out? I can’t imagine the mindset. It’s not glued to the wall, no. But why would you destroy something nice (that no doubt improves the value of the home anyway)?", "label": 0}
{"text": "Yeah, at retail prices it is breathtaking…\n\nI have a commercial account, low volume… but it’s half of list.  Franlkly I’d have a hard time paying that without the discounts.\n\nMany year ago I read an article, might have been Fine Homebuilding, on how paints are formulated and tested…. Very large chemical vendors make up differnt products…run tests on specific brands and their owners in house stuff…acres ad acres of test boards sit out in the sun for years.  Take away is that there ARE differences and you do get what you pay for.  Again, not worth 4x…and for something that just needs to look good for 5-6 years, sure.", "label": 0}
{"text": "And then caulked the shit out of the baseboards.", "label": 0}
{"text": "Is that chair facing a full length mirror?", "label": 0}
{"text": "That's almost exactly what I would have recommended.", "label": 0}
{"text": "Right… my house glows purple after dark out the front window. And the plug in hybrid add the to electric usage. But we only grow cactus and houseplants… so many house plants. \n\nHah. I almost forgot the lizard and its 1000 watts.", "label": 0}
{"text": "After installing the floor ( reasonably competently ) they then slaped the quarter round up, and left it ragged like a drunk guy did it. Yeah I threw them out after. Now im getting rid of the mistakes by fitting corner blocks.  Every doorway and corner. No more drunken half cut miters.", "label": 0}
{"text": "Paint it white", "label": 0}
{"text": "Like it? I've lived in some places with interesting above fireplace features, whether it be big stones or wood and always enjoyed it trying to make out what being the shadows create. It's fun.", "label": 0}
{"text": "Defeat Voldemort", "label": 0}
{"text": "“Throwing them out” because they have a 1/16” overhang on shoe moulding is a completely unreasonable response. Whatever you did there is out of place and very weird. Kindly bring up you’d like a cleaner finish on the quarter round over getting an attitude towards them and showing off whatever this abomination is", "label": 0}
{"text": "That's nice of you to be so concerned and involved in your mom's reno. I hope she loves it!", "label": 0}
{"text": "Paint it white. Trust me", "label": 0}
{"text": "I think I see the problem. One is white and one is blue. /s", "label": 0}
{"text": "Milk paint? wtf is that, I was thinking it was chalkboard paint.", "label": 0}
{"text": "That applies to exterior brick.. you gonna be watering your fireplace?", "label": 0}
{"text": "as another DIYer with similar fence history, i second your second.    \nalso, for what its worth, depending on the species and quality/consistency of the wood, screw are easier to control for head depth.  sometimes guns shoot those nails too deep or too shallow.  maybe im too perfectionist but it bothers me.", "label": 0}
{"text": "Don't tell anyone you are growing \"plants\".", "label": 0}
{"text": "Put a false back to it and fill with towels...hide you other \"stuff\" behind the false wall.", "label": 0}
{"text": "An accent light shining from above in the nook would look really nice and draw eyes to the detail of the architecture. Doesn’t have to be a big light. Maybe a nice bottle of scotch a couple glasses. A few curated books.  Relatively uncluttered book shelf. Nice job on the paint!", "label": 0}
{"text": "Indeed, also the wood pops so nicely with the black.", "label": 0}
{"text": "Put books in it or some other artsy nonsense.", "label": 0}
{"text": "Do you just sit there and watch yourself in the mirror?", "label": 0}
{"text": "Nah, the bolt is a washer. The screw is a bolt. The corner connector is the \"nut\". And I'm confused.", "label": 0}
{"text": "Attics can get over 160f.", "label": 0}
{"text": "Give concrete a good paint job, ( any color ), frame in concrete, add siding. Make floor , your choice, no paint , paint, wood. The point being, from the front it'll  look  like you have a new deck. Paint to keep erosion down. Wood steps will make it look complete", "label": 0}
{"text": "The problem is that the human eye is really, *really* good at seeing tiny differences in color, so any sun fading or oxidation of the paint by even a tiny amount is noticeable.\n\nIf it bothers you, it's easier to just repaint a who section of wall. If the two colors aren't right next to each other, you won't notice as much if it's slightly different from the other walls in the room.", "label": 0}
{"text": "The idea with the rolling shelves is great, if you want to use the space for storage and still keep the pipes and electric accessible. Also, why not add a light, to do away with the creepiness and have a light feature in that corner.", "label": 0}
{"text": "☝️Hero for future Redditors", "label": 0}
{"text": "Flashing tape is a distinct step that occurs between the door/window install and the exterior trim if it isn't integral. Otherwise, you silicone the back of the integral trim during install and maybe also tape the trim to the siding, but that gets to be a lot of redundancy.\n\nMetal flashing over the top is still used, and it's the more important step out of the two. OP can probably get away with keeping the original flashing if everything lines up right and their area is not prone to high winds, but it'll be a better job to use flashing tape, and it might not be possible without removing the metal flashing.", "label": 0}
{"text": "the lamp seems very good", "label": 0}
{"text": "Tbh keep it old and weird. My inlaws bought a house with a now illegal, but grandfathered in architectural feature, and it’s the only one like it in the city. Weird old things like this add character and charm. Obviously clean it, but it’s vaguely functional as is in a nostalgic way. ", "label": 0}
{"text": "the dark color between the bricks is the problem.  White would be much better.", "label": 0}
{"text": "I found it! But we have a problem, the update and second update were removed. Do any of the sites to see removed posts still work?\n[Original Post](https://www.reddit.com/r/Wellthatsucks/comments/kbbad2/gravity_wins_but_i_live_to_trip_another_day/)  \n[Update](https://www.reddit.com/r/Wellthatsucks/comments/kbtya2/update_maybe_i_can_pull_this_off_before_the_wife/)  \n[Final Update](https://www.reddit.com/r/Wellthatsucks/comments/kceuwp/final_update_wife_knows_she_laughed_she_loves_me/)", "label": 0}
{"text": "Rent it out as a mortuary.", "label": 0}
{"text": "It looks like the fire was too big for the fireplace", "label": 0}
{"text": "Ehm, make a floor, insulate the roof with PiR/PUR plates, make a ceiling, maybe add a few roof windows, and enjoy an attic? That's a room", "label": 0}
{"text": "We just went through this. We were quoted 5k to repaint vaulted ceilings. Take a piece of the drywall and take it to home depot. Their color matching is awesome. They have a little Machine and everything. It was perfect for us and saved us 5 k.", "label": 0}
{"text": "Honest question, why is that a bad idea?", "label": 0}
{"text": "It's painfully obvious that's ai gen'd", "label": 0}
{"text": "Put shit in there", "label": 0}
{"text": "Eat a burger? I usually get prette calm about everything when I encounter labor but binge eats instead.", "label": 0}
{"text": "Add a lot of old, creepy dolls.", "label": 0}
{"text": "It's completely possible to remove paint from brick in most cases.", "label": 0}
{"text": "Pressure washer with water replaced with paint remover? Say no more.", "label": 0}
{"text": "Same thing happened to me several years ago and I didn't feel like repainting the entire room so I did exactly what you're thinking about; just mixed the old paint with som e white paint of the same brand. It took several tries, but it ended up looking great. I would absolutely recommend going that route. Worst case is you'll blend it too much and have to repaint the whole which is on the docket now anyway.", "label": 0}
{"text": "You meant the bit they have labelled as the bolt is the rubber washer.", "label": 0}
{"text": "Plaster and paint, different colour to the room, I.e. make it a feature of the room.", "label": 0}
{"text": "I was thinking just cover it in white but that black is waaaay better! I can’t stop staring at it.", "label": 0}
{"text": "Expand their bedroom Closet! Depending on them bedroom lay out!", "label": 0}
{"text": "I didn't notice. First thing I saw was the paint \"oopsy\" on the LVP from the baseboard.", "label": 0}
{"text": "OP, i love your set up to sit in a chair and stare at yourself in a mirror for hours. Stunning power display", "label": 0}
{"text": "The perimeter seal (vinyl door stop) can be replaced and adjusted. It fastens to the door jambs with trim nails. \n\nThe bottom seal is directly on the door on a bottom aluminum retainer. It can also be replaced.", "label": 0}
{"text": "It ends up looking like crap if it's a functional fireplace. [Example 1](https://fullservicechimney.com/wp-content/uploads/2020/12/Chimney-Soot-Build-Up-Fireplace-480x302.jpg), [example 2](https://chimneys.com/wp-content/uploads/2010/10/Fireplace-Soot-01.jpg), [example 3](https://i.pinimg.com/736x/71/81/91/7181911959dfeed6d12093fee1386b3f.jpg). I mean you still have to clean it even if it's black but at least it won't look bad.\n\nI still question the decision to make the entire back wall black though. Makes the small room look even smaller. But maybe that was the point.", "label": 0}
{"text": "Paint it all white", "label": 0}
{"text": "So I found a video on what I would want to do. Your wall isn't as big. Not even close. But obviously you can't go full tard on it and do the accent coats too thick. I'm assuming these can be diluted with water or whatever the liquid additive is, if you struggle to do consistent light pressure and glazing. But this is the exact look I pictured as soon as I saw your question and the wall.\n\nThe stuff he uses is called LimeLike. \n\nhttps://youtu.be/dpaDncXoOnI", "label": 0}
{"text": "I'd turn it into a Tardis.", "label": 0}
{"text": "Probably the rubber washer is a (potentially white) plastic washer. Rubber washers are a bit tricky in this case as the head of the bolt (that OP called screw) will grip on it instead of slide over it. For the rest fully agree!\n\n\nOP share a picture of your hardware, group the same items (you'll probably have multiple of many items) label them as nice as you did in the picture of the (bit crappy) manual.\n\n\n\nDon't be afraid to ask, like your post actually; clear questions, clear picture with the items you're unsure about labelled. If everyone asked questions in such a good way getting the right help would be simpler and they'd learn a lot faster.", "label": 0}
{"text": "Best way to roast the dogs and crank the hog.", "label": 0}
{"text": "Dats where me and the homies smoked in high school", "label": 0}
{"text": "I dislike painting brick on principle, but those floors are _gorgeous_ and the black brick really works well with it.  Needs a bookshelf to the right of the mirror, or maybe some kind of built-in, but you've got yourself an absolutely charming little reading room right there.", "label": 0}
{"text": "My feelings exactly -- I hate it on principle, but I love how well it vibes this way.", "label": 0}
{"text": "Inside the fridge there should be a path that dripping water on the cooling area can follow. Might be behind a metal plate looking thing. Do not attempt to bend or move the metal as you might make a leak. Clear the drain and maybe use a stainless steel or copper wire and just leave it for the future. Once something grows in there (mold or such) it will come back over time. My fridge does this and once a year I clear it and spray bleach in it, but it comes back.", "label": 0}
{"text": "You should only grow plants here if you’re trying to hide them from the DEA.", "label": 0}
{"text": "[https://imgur.com/a/OgoSsOD](https://imgur.com/a/OgoSsOD)  \nanother photo of the pad", "label": 0}
{"text": "How?", "label": 0}
{"text": "If you switch your plan to the basement and find you need more storage space there is probably nothing stopping you from putting down a few more sheets of plywood in this attic space", "label": 0}
{"text": "\"Plants\"", "label": 0}
{"text": "Never understood people saying dark colors make rooms look smaller. Has always felt insane to me.", "label": 0}
{"text": "Those bricks would look one million times better if the ridiculous black mortar was covered.", "label": 0}
{"text": "Eww. Good luck in the future selling the place.", "label": 0}
{"text": "I would guess it’s blot>rubber gasket>glass>thinner gasket>washer>corner connector from the pic.", "label": 0}
{"text": "Good choice painting it black, especially if the fireplace is functional. It wont's look dirty when soot builds up with use.", "label": 0}
{"text": "In some places it’s perfectly legal to grow “plants”", "label": 0}
{"text": "Nope. Grow your weed elsewhere", "label": 0}
{"text": "A volt meter would figure out the issue pretty quick.\n\n\nIf you don't have one or don't want to get one I would head to a hardware store and buy a new bulb socket and a new lamp cord. I'm in the US so it might be different but our hardware stores typically have all the parts you need to build a lamp.\n\n\nStart by removing the bulb fitting. Likey just the 2 screws at the bottom of it. \n\n\nThem pull it out and feed the wire through until you have some room to work on the part where the wires are connected.\n\n\nRemove the shrink wrapping and anything else until you get to bare wires. I'm guessing they are crimped so that will need to be removed too.\n\n\nI would then wire the new cord to the old socket and give it a test. Make sure none of the exposed wiring is touching eachother or anything else! Wrap it in electrical tape is probably the easiest. If it works reassemble the rest of it and return the new socket.\n\n\nIf that doesn't work you can try the old cord with the new socket. Or just use the new cord and the new socket since they are likely pretty cheap.\n\n\nReassemble. Turn it on. Vibe out.", "label": 0}
{"text": "that’s my house! I cleaned up the shelves. leaving plumbing exposed. The bottom 3” are for an old hamper over a hole in the floor leading to the washing machine. I’ve the same door", "label": 0}
{"text": "Awesome thanks! I’ll check this out!", "label": 0}
{"text": "Awesome thanks man!", "label": 0}
{"text": "Amazing. I feel like a small rug would tie it together", "label": 0}
{"text": "Thanks for the reply. The bulb is a very specific type “lava lamp bulb” R80. I’m not sure that they would be as easy to come by? I’m also wondering if it is best to change to a different more modern bulb?\n\nEdit- apparently it’s E27", "label": 0}
{"text": "That book nook bit is such a nice bit too, I'm kinda jealous of your house now mate :)", "label": 0}
{"text": "Do you mean LED? If so, yes. However two of the four work", "label": 0}
{"text": "I'd only be tempted to do one more coat where the natural daylight hits it", "label": 0}
{"text": "Are you sure? The light in the pic with the blue background isn’t LED, it’s halogen. Upload a pic of the front face of the lights you are replacing", "label": 0}
{"text": "Ruined it. ", "label": 0}
{"text": "\"grow some plants\"...", "label": 0}
{"text": "Very cool and moody. All you need now is a cushy moody rug and you’ll never want to leave!", "label": 0}
{"text": "I replaced the bulbs in the existing fitting with these LEDs and only the two work. I pulled out the fitting to see if the fitting was easily replaced but seems to not be easily removable. \n\nThe one with the blue background is the genuine spare (no longer available) which I looked up to see what the manufacturer replacement item would look like.", "label": 0}
{"text": "Look how they've massacred my boy", "label": 0}
{"text": "find it more unsettling that the room just has a single chair facing a giant mirror", "label": 0}
{"text": "Grow plants eh. Nudge nudge wink wink say no more...\n\nI'd board it out and put a velux in there, extend the closet.", "label": 0}
{"text": "It doesn't look good to me.  I'm not sure how I would have fixed it but the black brick just doesn't look good.", "label": 0}
{"text": "Drill a bigger hole. Torx or square-drive screws will grip the bit better. An impact driver works better than a drill for driving screws, though it is louder.", "label": 0}
{"text": "You could have just stained the brick. Ugh. This looks tacky as hell.", "label": 0}
{"text": "I have no idea which is before and after", "label": 0}
{"text": "You may need a bigger pilot hole. The hole should be about as big as the shaft of the screw in-between the threads.\n\nIf you're driving the screw with a drill, it's important to put your weight into it and push the drill towards the screw. \n\nIf those don't work, torx or Robertson head screws are a lot easier to not strip.", "label": 0}
{"text": "Might wanna get an electrician out for that one", "label": 0}
{"text": "Staples?", "label": 0}
{"text": "I guess if you're trying to use products off the Home Depot shelf it would be, but there are masonry cleaners that make pretty quick work of it.", "label": 0}
{"text": "Honestly that’s something I need to do. There’s a pretty decent size gap towards the top of the “wall” where you can see daylight coming through.", "label": 0}
{"text": "Electrician here.. Sometimes it can be a weird thing that just seems to happen with some light fixtures. You can get the voltage checked etc but sometimes it’s a mystery.        \nGood luck", "label": 0}
{"text": "You should drill a hole through the top piece of wood.", "label": 0}
{"text": "No the shower's on the further line. The Santee goes to the toilet and then up to the vent", "label": 0}
{"text": "The lack of sanding is driving me crazy", "label": 0}
{"text": "Scaffolding is the only way.. renting scaffolding was cheaper than I expected but putting it together was one of the scarier parts for me. Being up there was fine once assembled. I was just replacing a dining room table light for a high ceiling. A ceiling fan is certainly more involved. I don't think a ladder could work (not that you asked about a ladder).", "label": 0}
{"text": "Thank you! This may just do the trick", "label": 0}
{"text": "Fire and a lot of it. Spooky season indeed!", "label": 0}
{"text": "You have made an excellent point", "label": 0}
{"text": "Are the bulbs a decent brand, or have you tried a mixture of brands?\n\nI've bought some which were dirt cheap when I was broke, and they had a very high failure rate.", "label": 0}
{"text": "Check the voltage.  Replace the cover with something that lets the heat out.  \n\nHow many bulbs is every six months?", "label": 0}
{"text": "Good feathering will make a massive difference if you're not ready to paint the whole thing. Key is to be as random as possible and feather deeply into surrounding areas so there's no clear line at all - just be sure to gradient into the surrounding paint - the bits furthest out should be faintest", "label": 0}
{"text": "I’ve replaced all the bulbs in two separate apartments with LEDs upon move in and never had to replace one. This covers about 10 years of living.\n\nYou should get that fixture looked at.", "label": 0}
{"text": "I suspect it's a heat issue. I'd either replace it with a different fixture, or leave the jar off for a year and see if that solved the problem THEN replace it.", "label": 0}
{"text": "Overheating for sure.  Take the glass off of it if you are using a LED lamp. Better yet would be to replace the whole fixture with an actual LED fixture.", "label": 0}
{"text": "too bad the entrances were painted black, honestly, i think lots of the bricks add depth and perhaps you should have changed the color of the room to play with that look much more instead of turning it into a black lump..", "label": 0}
{"text": "That type of fixture tells me you have an older house.  I bet you have a \"shared neutral\" (google it) or at least some kind of similar ground issue. \n\n\n Wouldn't necessarily be, like, an imminent for threat, but it is elevated and it might mean your electronics burn out faster too.\n\n\nAn electrician could identify this and the effort to fix can really vary, but it might just mean a new panel.", "label": 0}
{"text": "I'm starting to think they should require permits for paint like they do electrical work to prevent catastrophes like this.", "label": 0}
{"text": "The problem is running the wire.  My house is not built with spacers between the ceiling and joists", "label": 0}
{"text": "No offense, but you don't sound like a great electrician 😂", "label": 0}
{"text": "[https://www.limeworks.us/product/ecologic-colorwash-stain/](https://www.limeworks.us/product/ecologic-colorwash-stain/)\n\nIf you’re going to do that do it right, do it right the first time & don’t be a cheapskate about it. Masonary stains are not cheap, but the home value will go up.", "label": 0}
{"text": "I know, but it’s honestly the case you get a fixture that’s like this.        \nThe only real thing you can check is the voltage, and that’s usually fine. The annoying thing is that other lights in the same area will work perfectly fine, which mostly rules out voltage spikes.         \nYou can have a proper surge arrestor fitted to your switchboard, which will filter the voltage and make it much ‘smoother’ but i’ve never gone that far to fix this issue.", "label": 0}
{"text": "I’ve replaced light fixtures, it could be a thermal issue.  I’d measure the voltage to the fixture and make sure it’s the same voltage as expected though.  \n\nOne other thing that can happen to older light fixtures with some flexible connections at the nase of the light bulb is that someone overnighted a bulb and now the connection to the bulb isnt very good as the connection was bent.  The symptom is the same, light bulbs burn out much too rapidly.  After verifying voltage is correct I fixed it by bending the light bulb base connection back (w power off) and then don’t over tighten the light bulb in the future.", "label": 0}
{"text": "Possibly, in that case on the connectors of the globe and inside the socket on the light fixture you’ll see some pitting and discolouration from the crappy connection.", "label": 0}
{"text": "Ask ChatGPT again 😅", "label": 0}
{"text": "Reddit hates painted brick. That is all.", "label": 0}
{"text": "I painted my bedroom grey about ten years ago before it started popping up everywhere. I thought it was nice and calming. Now it's everywhere in the flipped houses and I hate mine lol.", "label": 0}
{"text": "Heat builds up in enclosed fixtures. Most LED bulbs are not rated for enclosures.", "label": 0}
{"text": "I just went through this this year when residing and did some air sealing. I could feel the AC outside the knee walls. Completely worth it. My house feels better and my electric usage dropped around 20%.\n\nAdd ridge vents if needed and seal with blocking at the floor joists, finish the floor, add foam board and seal with foam.", "label": 0}
{"text": "Take the glass off as a test.", "label": 0}
{"text": "Best would be to have a dedicated wire for light and fan each, meaning either another 14/2 or replace the old one with a 14/3.\nBut as u/ExactlyClose already suggested, Shelly would be an alternative and my first choice for something like this, although I live in Germany and running a new cable would just not be possible, at least not for me.\nIf you choose Shelly, I’d be happy to help out with what I know", "label": 0}
{"text": "Look, if the plastic is discolored , like from white to yellowish white, it is overheated.", "label": 0}
{"text": "A fixture designed with LED bulbs in mind or one with built in LEDs? The latter is so wasteful, having to throw out the entire light fixture instead of just replacing a bulb when the time comes", "label": 0}
{"text": "Well this would be the perfect spot to store your dead bodies but now you’ve gone and posted it all over Reddit", "label": 0}
{"text": "I did the same way back in 2010/2011 and I still absolutely love it. I've since moved out of my childhood bedroom, but I miss it terribly and feel passionate about the color every time I visit my mom. I swear once I finally buy a home Anonymous Gray by Behr is going back up if I can help it. House flippers tried to make me hate gray but they'll never get to me. Both my cars are gray too, and in 2009 I made my dad buy his car in gray. Idc they'll never make me hate you Gray!", "label": 0}
{"text": "Is it intermittent? Mine is light only about 50% of the time. /s", "label": 0}
{"text": "Try to get more bubbles out, for sure looks like water is trapped. If it doesn’t t work, take it off. Re-clean the windows and try again to make sure no debris is stuck underneath", "label": 0}
{"text": "The one I use has a felt strip wrapped over the edge. It worked well for me.", "label": 0}
{"text": "Looks great! Nice job", "label": 0}
{"text": "It is a storage space for firewood, it would loook better with a stack of firewood in it ;p", "label": 0}
{"text": "Applying window film is way harder than anyone thinks.  It is impossible to tell exactly what went wrong but there are many good instructional videos online.\n\nNo matter how mater videos you watch, you will still require a few practice attempts that will be short of perfect until you develop your technique.", "label": 0}
{"text": "It does look like there are still water bubbles. Also, use less soap. Like a 1-2 drops in a quart spray bottle.", "label": 0}
{"text": "Led bulbs in inclosed fixtures will cook themselves they need to vent heat from the driver circuitry incandescent bulbs are terrible but they can take heat", "label": 0}
{"text": "I’m not exactly sure, but I got the film onto my door with no bubbles.\n\nI didn’t spray anything on the film, just thoroughly cleaned the door then sprayed it with water. ", "label": 0}
{"text": "I also put a towel on the window sill below the window and just went crazy spraying the water.", "label": 0}
{"text": "Get over it. ", "label": 0}
{"text": "Probably sun.\n\nIf you paint an entire wall you won’t notice the slight change between each wall. (Due to shading and the lighting) I’ve done this a few times now.", "label": 0}
{"text": "looks like a great place for those jars of teeth", "label": 0}
{"text": "Honestly, I don't know the brand of the film. If I bought it directly from Amazon or Home Depot, I would have to wait 2 to 4 weeks for it to arrive at my house since I'm not from the US. :( I bought it from an online store in my country.", "label": 0}
{"text": "pilot hole should be 1/8\". Make sure your driver/bit matches up to the screw well. #2 size bit/driver is common for phillips Put as much pressure as possible to mate the screw face and the driver while screwing to keeps your bit seated.", "label": 0}
{"text": "Specific products depend on what and where you're working, but Prosoco is the brand we use. I work in masonry restoration.", "label": 0}
{"text": "Gotta have a smoke break once in a while.", "label": 0}
{"text": "I’ll definitely be looking into it. I was going to fill with expanding foam,but once I got to looking I don’t think that will be a good idea 😂", "label": 0}
{"text": "sandwich mesh between 1x3 frame pieces or similar. screw together the sandwich and land screw between mesh holes for bonus strength.", "label": 0}
{"text": "Thanks! I'll check them out", "label": 0}
{"text": "My mother in law had a similar problem: one of the spring contacts was bent, only made a tiny point of contact with the terminals on the bulb and that was causing them to overheat from the resistance. If it's not a difficult job, try replacing just the socket which holds the bulb", "label": 0}
{"text": "If the light fixture is attached to the ceiling of the stairwell, is that the underside of the stairs going up? Because if so, the bulbs might be burning out faster because they're getting a good shaking every time someone goes up and down the stairs above. Have someone stamp their way up the stairs while you observe the bulb from the basement stairs. If you can see/feel shaking or vibrations, move the fixture or figure out a way to isolate the fixture like with a rubber gasket", "label": 0}
{"text": "We have/had a number of light fixtures that tend to burn out LED lights *much* faster than other ones. They all, I think, can be explained by one of the 4 folowing reasons:\n\n1. enclosed fixture - LED driver killed by heat\n2. janky fixture / loose connection somewhere in the fixture (you bump into this fixture and it goes on and off quckly a couple times)\n3. shitty/cheap LED's + power surges (lightning strikes, even the AC going on)\n4. Legitimate wiring issue - one lightswitch also had 2 plugs on the same wall box that were supposed to be seperate circuits but were all tied together, so both circuits were being double fed. fixing this helped with the burnout rate on a few fixtures.", "label": 0}
{"text": "It's a documented phenomenon, lighter colors create the perception of space.\n\n\nIn OP's case it was a dark color wall to begin with so they're not missing anything and like I said maybe they even chose to keep it dark on purpose.\n\n\nYou can also mix light and dark dudes to create partial effects, like light walls with a dark ceiling to make a tall ceiling seem lower or the other way around, dark walls with light ceiling to make a low ceiling seem higher.\n\n\n\nPersonally with such a small space I would have taken every opportunity to make it seem a bit more roomy, but that's me.", "label": 0}
{"text": "Did you use the textured side down instead of the flat side?", "label": 0}
{"text": "Why has nobody commented on the floor molding having to go from white to black? Must look even worse in person", "label": 0}
{"text": "Edit: Not sure if this is considered a rim joist or floor joist. It’s parallel to the floor joists but definitely the last one closest to the exterior", "label": 0}
{"text": "Is the film cut too big? The edges of the film are lifted up because they collide with the wood. \n\nAll the film I've seen applied professionally does not touch the edges, you cut it perfectly so that it is just inside the edges, this lets it lay flat and fully spread out.", "label": 0}
{"text": "Is it safe to put anchor in a door? I didn’t know that this is a way to do it. What kind of anchor do you suggest? Are they especially made for doors.", "label": 0}
{"text": "Did you peel the protective layer off of the cling film before applying? The first time I used this stuff I did that. It looked like this", "label": 0}
{"text": "DIY 101, paint the whole wall.", "label": 0}
{"text": "Same. Outlet mounting tabs are likely bent, cover plate if any cracked and prongs on plug bent. I'd want to get that washer out of there. Replace the outlet and cover plate. Then use a short pigtail flush plug so the washer plug isn't poking out and you can push the washer back in without fucking up the outlet.", "label": 0}
{"text": "Pretty certain it was a joke", "label": 0}
{"text": "Landlord special", "label": 0}
{"text": "Roll out shelves", "label": 0}
{"text": "ok hold on, i’m getting confused here.       \nSo you brought 4 new bulbs and only two work?        \n      \nWhen you said “ if the LED bulbs are currently working in two fittings” what did you mean, Indidnt think you’d gotten any LED lights yet(blue background picture)          \n\nWhat I *think* your problem is is that attached to each of the lights on your hood is a transformer, which is somewhere inside the hood (attached to those wires that go up into it you mentioned).      \nI think 2 of your transformers May be faulty, which is why I changing the bulbs on those lights didn’t work.", "label": 0}
{"text": "Think I just used water, no soap. Mine turned out well, but it also took about 3 hours to do my shower.", "label": 0}
{"text": "Push some dolls all the way to the back in various poses/configurations and call it a day 🤷🏻", "label": 0}
{"text": "Did you clean the window with rubbing alcohol first? Use lots of water and maybe 1 drop of liquid dish soap. Squeegee the film as you apply, if you don't have a squeegee then use a credit/debit card.", "label": 0}
{"text": "Yes sorry I realise I haven’t been clear enough. \n\nRange hood no light bulbs fitted. Bought new LED bulbs, inserted into fittings, two of four work. Changed them around same fittings not working so thought is that the fittings are no good. \n\nChecked the Smeg spare party and supposedly it’s end of life, and halogen as you say. Was thinking to fit replacement fittings (not being aware of the transformer) and could see the cable with plug on the page with the blue background. \n\nLook to be the same as the ones from the Amazon screenshot on my phone however I cannot pull the fitting out and unplug (if this is actually what I have). \n\nSo looking to decide on what to do next. Stuff like the transformer is coming out which might be quite expensive. Also was not aware I couldn’t use LED. This is all stuff I’m learning. As you can see in my photo I do have two working LED bulbs in there currently, so trying to decide on a course of action.", "label": 0}
{"text": "Razor blade. Make tiny poke in bubble, squeeze", "label": 0}
{"text": "Hi! Construction person here. You will need to insulate any exterior walls before covering in drywall, or it will never stay climate controlled like the rest of your house. If you want outlets or lights installed, I’d get an electrician in there first. Then finish sheathing the floor with OSB for strength. And that’s it! You can grow whatever you want as long as it’s fully insulated, that will help with moisture issues also.", "label": 0}
{"text": "Also make sure the bulb is listed as safe for an enclosed fixture. Cheap LED bulbs are often not built for heat and their circuits burn out when enclosed in a fixture. Had the same issue with a fan at my old house. People don't realize that LEDs have to convert AC current to DC so they have a circuit board in them much like a phone charger for example.", "label": 0}
{"text": "Did you scrape the water upwards? Then it stays partway at the edge, and runs back down. Always push the water from the middle and out, then down.\n\nCheck the other side of the glass; places you might have missed are more visible there.\n\nRun it over more than once; spraying the none sticky side of the film might also be a help, to see where you've already been, and it also helps the tool run smoother.\n\nIf you end up with a few bubbles after that, puch them together to one larger bubble and makes a tiny hole with a needle at the lower edge of the bubble before gently pushing it out.", "label": 0}
{"text": "I was thinking maybe that effect is amplified in the picture and may not be as much of a black-out in person.", "label": 0}
{"text": "And any bugs or monsters that may lurk. They may be indoor cats but they are the ultimate hunters", "label": 0}
{"text": "You also need one or two small drops of soap at most.", "label": 0}
{"text": "Hopefully this clears everything up. I do appreciate your responses so far", "label": 0}
{"text": "Light a match lol", "label": 0}
{"text": "Maybe don't put quite so much stock in \"influencers\"", "label": 0}
{"text": "Build a bridge", "label": 0}
{"text": "Wrong tool, try with your credit card instead. Or order a [squeegee](https://a.co/d/fQhdO3b) from Amazon", "label": 0}
{"text": "Probably just need to take the “nut” off the bottom instead. ", "label": 0}
{"text": "I remember your first post. I was thinking please don't paint it. But - the black looks fantastic with the floors and window frame. Nice work!", "label": 0}
{"text": "Depending on how hard it is for you to repaint the wall... you can try \"feathering out\" which is basically taking the roller after you have painted your spots and without applying extra paint, keep going beyond the edge of the spot. As the roller gets drier and drier, you get less and less paint and it sort of blends the edge so instead of having a hard start and stop point instead you get this nice blend in between. \n\nIf the paint is too different it might not help a lot, but from the spot I see in the picture, I think that should work.", "label": 0}
{"text": "Nice job! I have dealt with two painted masonry issues back in my contracting years and both times we had to sandblast and tuckpoint, which is the best way to restore stuff like that but it's a commitment to a massive amount of prep work, protection, and a mess that is not on most people's lists of fun things to do.  Faux finish paint jobs can go a long way for a lot less hassle!", "label": 0}
{"text": "Its not crappy :( but I get it, will try with a squeegee.", "label": 0}
{"text": "•Demo everything in there. \n\n•Cut a piece of pre-finished plywood to fit the height and depth. \n\n•Attach it to the back wall with a few drawer slides. \n\n•Mount a few shelves, hooks, whatever on that plywood and then a cabinet face to cover it when it’s closed. \n\n\nWith only a 4 or so drawer slides, you could built a lot of slide out selves if you build a one-sided cabinet and  \n\n[Something like this.](https://www.almfab.com/store/p/mini-kitchen-cabinet-with-step-stool-storage-presale)\n\n[Here’s a YouTube video of its construction.](https://youtu.be/8Cn_ZmzeRnc?si=FFl5ExCAxl-A4iM-)\n\nYou don’t need all of those fancy tools to build it though. Could be done with just a circular saw, glue, and screws.", "label": 0}
{"text": "Bad idea. You need 12\" of loose fill insulation on the floor which you cannot achieve when you put decking down. those ceiling joists should be totally covered. This is to get better energy efficiency below. Attics are not for additional living space.", "label": 0}
{"text": "No.", "label": 0}
{"text": "it may have been mentioned already: I would remove the shelf, clean it up, buy one or two of those skinny kitchen storage box on rollers. They are lightweight, has various size and style you can choose from to fit the space. Then some led light on top. \n\nIt is the most effortless way I.can think of rn.  If the roller you pick fits well, wouldn't even need a door in this setting...", "label": 0}
{"text": "Also absolutely supporting the permit.  This is a huge job for a DIYer.  I’m a licensed general contractor and I would warn a client how extensive this job is.   \n\nThis is more than tearing out the staircase and running new stringers.  Extending the staircase means you will contact the low point of the ceiling earlier where the header supports the floor upstairs.  \n\nImagine a hole is cut in the upstairs floor allowing the staircase.  You can’t just cut a hole though, you have to support the joists you cut.  The way this is done is by adding a header across the “cut” joists and fasten them to it.  Then the header is support on either side of it by the continuous joists.  If you extended the staircase, the existing header will be in the way.   Where is it?   In this case, it’s very likely over the wall with the door to the attic (if the ceiling is wide open once inside the door.) \n\nThe way this project would legally be accomplished is a new header installed opening the “hole” up larger.  This will make structural changes to the floor upstairs and the ceiling below.  \n\nAs others have noted, once you mess with something, you have to do it to current code, which means your new rise and run must fit within a specific size.  We can’t really tell from the pics if you have enough space to do this, but I know when I ran a new staircase in a turn of the century house with a steep climb to the second story, there were several feet of distance required to make it legal.  (In that case, the ceiling was open in the entire foyer, so there was no header issue.)\n\nThis is a big job, and that’s without seeing the structure for ourselves.", "label": 0}
{"text": "God, I hate that grey. My place was painted a variant of it when I bought it - right before listing of course, and so poorly it was in thick gobs everywhere. Imagine Zillow flipper mental illness grey, but even more blue toned. Made for a *fantastic* contrast with the ORANGE bamboo floors, lol.\n\nAnyway it's all been painted warm white, but my god.", "label": 0}
{"text": "I mean, that brick was designed to have some items placed on and around it to tone down the variation of color not that it looked that bad bare. You fuckin nuked it with a damn orbital laser going and painting it black like that.", "label": 0}
{"text": "Brushless motors are awesome, way less maintenance than brushes and they last longer. \n\nLithium batteries are awesome, for example the newer 20v Dewalt batteries last way longer than the 18v ones did, and are much lighter. \n\nIf you’re starting out a new cordless tool collection, Black Friday is just around the corner. I’m sure that there will be a hundred different tool packages you can buy from major retailers for less than normal. Look for something with multiple batteries, those are the more expensive part if you aren’t buying a package of tools. I suggest checking your options on a price charting website, so you can verify it’s actually a good deal. \n\nI don’t think the brand is the most relevant piece of information, especially when you start. Milwaukee has more specific tools for specifically the trades, while Dewalt has a whole suite of lawn care tools. I’ve heard good things about Ryobi tools if you’re on a budget. \n\nI personally have Dewalt cordless tools, and they are all brushless. The only cordless tool I may ever buy that isn’t with these batteries is a Festool track saw.", "label": 0}
{"text": "Lefty loosie?", "label": 0}
{"text": "Codes are different everywhere, here in MA I'm pretty sure it needs to be a san T, but if it's legal where you are then leave it be.", "label": 0}
{"text": "The flickering is maybe likely to do with using the LED replacement bulbs in an old halogen transformer or possibly the fitting the bulb goes into rather than the wiring (unless they have always flickered).                    \n\nHalogen downlights are just TERRIBLE. They’re hungry on power, the transformers get extremely hot in the roof space and they are a real fire danger. They were only used before the industry came up with higher voltage Downlights which run cooler and then eventually LED lights which are vastly superior in every way.          \n\nYes, I have see issue of lighting transformers inside Rangehoods failing like that before.", "label": 0}
{"text": "The new brushless cordless tools with lithium batteries can do a lot of hard work, but corded still is important for the really tough jobs, especially if used for work rather than just home stuff.  \n\nI am invested in Ryobi's 18v line of tools. I have their rotary hammer drill and have loved it. I've drilled probably a few hundred holes in concrete with it as well as using it with a big scraper blade to chisel/scrap concrete floors. They also have a 40v line of tools that includes lawn mowers and other larger/higher power requirement tools, but I have not yet given up my gas tools to that. Batteries should dictate what you buy, you don't want to buy a bunch of different brands that all require their own battery and chargers. Pick a brand and stick with it. Lot of people talk crap on Ryobi, but they really have gotten much better in the last 10 years or so. I think many of their tools can hold up as well as Milwaukee or DeWalt for a somewhat smaller price tag. \n\nOn specific thing I would never use a cordless for is mixing grout/thinset/mortar. I've burned up a corded drill doing that and then went and bought a proper corded mixer that was made specifically for that task.", "label": 0}
{"text": "Lol yes, and then clean up them pubes next time you post a pic 🤮", "label": 0}
{"text": "Lefty loosie but mirrored, so it's easy to get it backwards from the other side.", "label": 0}
{"text": "Probably too much water, man. And maybe the soap. I just took a spray bottle. Wet the window a little all over and slapped it on. Squeegeed it flat and have no issues.", "label": 0}
{"text": "Look at the front page of the instructions. M is a part, and T is a part. That spells empty. Like the head of the graphic designer who drew that up. \n\n\nThe hardware will be labeled with an M that should relate to whatever is referenced there. Probably a plastic screw with a plastic washer. Tighten gently..", "label": 0}
{"text": "Yeah, and they seem hard to get nowadays. I purchased [these](https://www.argos.co.uk/product/9583205) as a replacement. And it seems to be certain fittings in roof that flicker, the only way to stop it is to swap the halogen bulb back in.", "label": 0}
{"text": "Generally indicates you have a bad neutral connection somewhere in the series.", "label": 0}
{"text": "I haven't owned a corded drill in at least 3 decades. Back then, if I needed to do masonry drilling I would borrow my dad's hammer drill. Nowadays you can get good cordless hammer drills so you don't even need that.", "label": 0}
{"text": "Just drilled into my concrete basement with my brushless Makita cordless. Love that drill.", "label": 0}
{"text": "It's beautiful!", "label": 0}
{"text": "Nothing like reading while staring at yourself in the huge mirror with a fire roaring beside.", "label": 0}
{"text": "The majority of these seem to me to be some kind of algorithm or else the severe consequences of social media has on susceptible individuals to pathologically obsessive behavior. Christ I'd have to burn my entire house down and start from scratch if these people saw my front door.", "label": 0}
{"text": "Yup, literally just drilled holes into ceramic tile and brick walls for an hour yesterday hanging TVs. \nCordless Makita Hammer drill, not even the latest brushless. But he mentioned masonry.", "label": 0}
{"text": "If you’re drilling a lot of masonry look into an SDS hammer drill", "label": 0}
{"text": "But not according to DEA. Yet.", "label": 0}
{"text": "I think its quite lovely as is", "label": 0}
{"text": "Definitely too much water, also is this actually adhesive or is it the thicker rubber stuff?", "label": 0}
{"text": "Google search \"182 paint superspice\". See if that's the color.", "label": 0}
{"text": "It should be noted Ryobi and Milwaukee share a parent company, TTI. Ridgid and Hart are also in the TTI family.", "label": 0}
{"text": "It's threads like this that make me really love Reddit.", "label": 0}
{"text": "That's a place to stick firewood.", "label": 0}
{"text": "My boss bought a beautiful brick house and his wife immediately made him limewash it white. Then made him make cedar shudders (which looked really good) but then made him paint the cedar shudders white.\n\n\nShe spends most of her free time on Pinterest.", "label": 0}
{"text": "Bosch Biturbo machines can draw up to 2000W from a 18V battery, and some machines can use 2, so 4000W of power. Than literally more than corded can provide.\n\nSure they will empty quick but every constructor has like 6 batteries anyway so couple are always ready.", "label": 0}
{"text": "Do you have hard water? It looks like there is soap scum on your window where there is no film.", "label": 0}
{"text": "Skeleton", "label": 0}
{"text": "No.", "label": 0}
{"text": "I canned everything cordless, as I got sick of buying batteries for different manufacturers. How many batteries will you have to buy over 20 years to keep this tool operational? Will you even be ablate find a battery for it in 6-8 years?\n\nBesides, I know how to throw an extension cord over my shoulder to keep it out of the way of my work.", "label": 0}
{"text": "If you are referring to the window above, it looks dirty because I peeled off another piece of film that had been cut incorrectly and I didn't clean the window after.", "label": 0}
{"text": "They are very good but there is still a place for a corded tool.   My Milwaukee will do 2800rpm. Pretty handy if you are drilling smaller holes.  The torque from a big old 15amp 1/2\" drive is also occasionally useful.", "label": 0}
{"text": "“Plants”", "label": 0}
{"text": "I don't think so, they are super clean. I applied almost 1L of thinner to give it a proper cleaning, finished with soap and water and let it dry for days before installing the film.", "label": 0}
{"text": "I Googled those numbers along with \"paint\" and 176B4 brought up a bunch of parts for a Fiat; #182 brought up a red paint used on Fiats.  Seems like a strange coincidence that both numbers related to Fiats.  Could it be car paint?", "label": 0}
{"text": "Make sure your bulbs are rated for enclosed fixtures. LEDs don't get as hot as incandescent bulbs, but they still get hot. If the bulb isn't rated for enclosures, it'll fail early.", "label": 0}
{"text": "I’d like to add do not cheap out on the rollers, otherwise with this length and the added weight of stuff, they will quickly break. I learned that the hard way.", "label": 0}
{"text": "Easy space for at least three bodies", "label": 0}
{"text": "Buy a Milwaukee Fuel M12 combo kit.  I will ALWAYs grab that before I grab my larger M18 versions. I even used hammer mode the other day to bore holes for Tapcons in my block wall last weekend. They are GREAT.", "label": 0}
{"text": "Cats just love that! Our went in the wall during a shower replacement before the drain was installed. And yes, was closed in! Luckily there was an access panel for the other bathroom and she was very happy to go toward the light!", "label": 0}
{"text": "Your friend has shared a link to a Home Depot product they think you would be interested in seeing.\n\n\n\nhttps://www.homedepot.com/p/Milwaukee-M12-FUEL-12-Volt-Lithium-Ion-Brushless-Cordless-Hammer-Drill-and-Impact-Driver-Combo-Kit-w-2-Batteries-and-Bag-2-Tool-3497-22/320268525", "label": 0}
{"text": " If you are referring to the window above, it looks dirty because I peeled off another piece of film that had been cut incorrectly and I didn't clean the window after. \n\nI will definitely try to flatten it out for longer!", "label": 0}
{"text": "I see the brown brick and I want to paint it black.", "label": 0}
{"text": "I've installed vinyl on just about every surface it can be for years. Few things: \n\nHow much soap did you mix in? Should be just a 2-3 drops of dawn soap in a standard Zep spray bottle. \n\nUse a proper squeegee to press the material down to the glass...you have a plastic scraper. No way are you getting enough pressure to put the water out with that. When applying vinyl using water, use strokes from the top center and move to the left then center to right. Repeat moving about half the distance of your squeegee down with each pass.it will slowly work the water down. Once its done, do some final verticlestrokes from the top to the bottom and work out the little water bubble toward the sides if any formed. Cut the vinyl flush with the edges, and do one final pass to ensure everything lays flush and there is no tension pulling the vinyl away from the window.\n\nApplying vinyl is an art. It's why people pay 5+ grand for a car wrap that costs a couple hundred bucks to make print.", "label": 0}
{"text": "An optimal layout for a Narcissus TV.", "label": 0}
{"text": "Man, I need a room dedicated to sitting and looking at myself in the mirror.", "label": 0}
{"text": "Second this - I've had several Ryobi battery tools for years and they've served me well. Good run time and no issues. I'm sure some of the more expensive brands are better, but for home use I'm happy with Ryobi:\n\nDrill, two impact drivers, small circular saw, two flashlights\n\nI still have several corded tools because, well, I've had them a long time. Craftsman router, Hitachi 12\" miter saw, table saw, etc.\n\nGo with your needs and budget", "label": 0}
{"text": "Perhaps try less soap and filtered or distilled water?", "label": 0}
{"text": "Thanks everyone! Looks like I’m going to get a quote from a licensed contractor instead!", "label": 0}
{"text": ">I don’t think the brand is the most relevant piece of information, especially when you star\n\nhttps://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Ffyw5knwsk4ac1.jpeg", "label": 0}
{"text": "Ooooof", "label": 0}
{"text": "Pull out shelfs", "label": 0}
{"text": "We weren't looking for a huge reno job that year. The plan was to get it looking decent then if it didn't work we'd wrap it in a stone facade. I was pleasantly surprised by how realistic it looks. I'd still like to get that facade at some point, but it's an old house with much bigger issues so it's low on the list.", "label": 0}
{"text": "2 no hub bands\n\ncut dead center between the 45 elbow and the 90 elbow\n\nnew 45 and some pipe, slip on the no hub bands and send it.\n\n\nalso that TJI looks compromised as fuck", "label": 0}
{"text": "Lower the entire gate? This honestly looks very stupid this way.", "label": 0}
{"text": "You don't have to explain, you just asked what we thought, and that's my take. You are the one who will be enjoying it.\nMy concern was that the next person *can't* do whatever they want, as the paint is unremovable, even if the bricks aren't original, they're forever changed.", "label": 0}
{"text": "My wife and I are having some symptoms of nose and throat irritation and headaches, and I'm pretty sure I'm fairly sensitive to mold.\n\n\nWe live in a basement apartment with drop ceiling everywhere, and evacuated for 2 weeks after hurricane helene.  We've started noticing the symptoms since we've come back (and there was no air circulation for 2 weeks).  I've looked around at the insulation elsewhere and none of it has this same white-ish stuff on them.  Only noticed this in the bathroom so far, which has a fan and a window, but again it's a basement apartment so the humidity has been high for periods of time.\n\n\nCurious if anyone has thoughts on this.  Thanks!", "label": 0}
{"text": "I love the brick. I feel like the room is missing some plants or other but I really like the black milk painting and as long as you love it, that's what's important! \n\nLooks good! Giving moody cigar room vibes.", "label": 0}
{"text": "Cordless _SDS hammers_ are viable. Cordless coring drills are viable. \n\nA cordless power drill is ezpz.", "label": 0}
{"text": "Posting a video doesn't make one an expert.", "label": 0}
{"text": "Made so they roll out but can also be accessed without being rolled out, with the most frequently used items placed on the end that’s facing the bathroom.", "label": 0}
{"text": "I rented a house for a while a couple of years ago that had a closet like this.  The shelves were painted white, and that made a huge difference.  I’d also try to install some LEDs in there so you could see what’s in the back.", "label": 0}
{"text": "Work in a record store. We want to put a few plastic tape racks on the front of one of the cabinets. I don't want to drill into the front damaging the cabinet, and being able to move the tapes would be nice. \n\n\nThey weigh about 10lb when full, with the weight distributed about a foot across and nine inches down, so it's not all concentrated. I'd love to not deal with screwing into the 3/4\" deep boards I'm using. The drawing isn't to scale, and I don't think this actually counts as a cleat but I have no idea what to call it. \n\n\nI imagine it will hold together, especially since I'm not gluing on end grain. Does they sound right? ", "label": 0}
{"text": "Use another piece of flooring on the toe kick to bring it out to cover the gap.", "label": 0}
{"text": "Yes, I think that would work. I hope it's an option. A post under the speaker shelves might work too. But I'm disappointed that an otherwise well designed desk didn't anticipate heavier speakers. Like they say in automotive, \"there's no replacement for displacement\" (i.e., the piston volume). Bigger magnets, better speakers.", "label": 0}
{"text": "Agree.   Have both Milwaukee m18 and m12 variants of impacts and drills.\n\nHonestly, I almost always use the m12 fuel.  Light, powerful, and the newer batteries last longer than you’d think.   I’ve only recently used my m18 impact for a deck I put together for my sister.  Before that, I really don’t remember it had been so long.", "label": 0}
{"text": "How far are you from Mexico?  We bought a Cantera style door for  75% less than what one would go for locally.", "label": 0}
{"text": "It could be overheating or it can possibly be loose wiring, which would be a fire hazard. Overheating is very common thought. Enclosed spaces kill electronics.", "label": 0}
{"text": "As should any normal human being with a sense of taste.", "label": 0}
{"text": "Ugh ignore all the haters (j/k I know it just personally preference). I'm am absolute SUCKER for dark and moody. I love how this turned out!", "label": 0}
{"text": "I mourn this house", "label": 0}
{"text": "Build a darkroom and print photographs and make a book.", "label": 0}
{"text": "I think it really depends on the scale of your plants operation. I've gotten decent results with a couple of clones and a grow light, then a transition to outside, pretty much the same as the boring plants I grow. It would have worked fine if I had kept it inside, and I'm doing it again as an experiment. If you are going to spend a bunch of money and do something on a scale, why not use the basement and a set up decent hydroponic and/or lights/and/or humidity and air control system, or just buy a little shed and completely kit it out? Otherwise, a normal closet or something for a handful of plants would probably be fine. Back there seems like a huge pain and more trouble than it is worth.", "label": 0}
{"text": "In my homeowner around the house and yard type work, my 18v Milwaukee does everything I need it to do. I’m my professional life I need a corded drill for thick steel and large holes. But even then, the 18v Milwaukee does almost everything. \n\nKinda like the cordless impacts. They work almost all the time till you need the 3/4” drive pneumatic impact.", "label": 0}
{"text": "Yup.  I have a drawer full of cordless drills and haven't used any of them in years.", "label": 0}
{"text": "Looks good", "label": 0}
{"text": "Paint it white too", "label": 0}
{"text": "Put a piece of furniture grade plywood on top.  Seal it with spar urethane.", "label": 0}
{"text": "I used to apply the window-clings at the video game store I worked at, and man it’s so hard to do right.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "Gimp storage.", "label": 0}
{"text": "Dad, is that you?!", "label": 0}
{"text": "One thing to plan ahead is a way for the cables to be invisible, Do you want a whole behind where the TV will be, then one lower down where your media devices and power cables will enter the wall. add a draw string to make it easy", "label": 0}
{"text": "The only drills that need a cord these days are hammerdrills, and even then there are options. That said, I have some god-level brushed corded drill from the 60s that I'm pretty sure could rip an arm off if used wrong, but who *really* needs that shit?", "label": 0}
{"text": "Lol", "label": 0}
{"text": "Yes, an adhesive dissolver and a scraper is often effective for jobs like this", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "If you are going to insulate, replace the boards first.  Why waste labor and time?", "label": 0}
{"text": "3 flat owner, have rented for 25 years. The saved paint in the basement is for whole walls only. When a tenant vacates and we need to patch we take a small chip off the wall and get it laser matched.  When applying feather it out or dabble with a damp sponge to blend.", "label": 0}
{"text": "I use my cordless for EVERYTHING except masonry drilling. I'll even use them for smaller masonry stuff but over 1/4\" I use my big corded drill. \n\nBut if you get a modern 18v you will be *blown away* at what they're capable of. Hell I just got an m12 Milwaukee and it's outrageously powerful.", "label": 0}
{"text": "There is no quick fix.  The landlord needs to install a better product.", "label": 0}
{"text": "Look at a “hinge adjustment tool”:\n\nhttps://m.youtube.com/watch?v=0RWinhROhjk", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* This was posted to /r/DIY sometime ago.  There is no reason to repost it.\n\n* Duplicate post / Multi-post (Common reddit issue)", "label": 0}
{"text": "Please post this to jewelry-related subreddits", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* It is a \"craft\" project. Paper projects, origami, candles & small decorative items are not allowed. Please post these to /r/crafts. \n* It is about paying someone else to do the job - please try /r/homeimprovement.  \n* It is in some way unrelated or not a good fit for /r/DIY - please try /r/findareddit and submit your post to an applicable subreddit suited for your submission.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Wrong%20Subreddit).", "label": 0}
{"text": "Not trying to be snarky, but what do the instructions say?", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "picture?", "label": 0}
{"text": "The two easiest ways are to A: use an adjustable post base:\n\n\nhttps://www.lowes.com/pd/Simpson-Strong-Tie-4-in-x-4-in-Hot-Dipped-Galvanized-Wood-to-Concrete-Cast-in-Place-Base/1002708554\n\n\nAnd B:  cut the posts unequal lengths, to account for the uneven concrete.", "label": 0}
{"text": "I liked the brick wall before you changed it", "label": 0}
{"text": "Maybe /r/DIYUK might know.", "label": 0}
{"text": "When you zoom in on the picture, it looks like a large flat blade screwdriver fits it", "label": 0}
{"text": "I know, for some its not.", "label": 0}
{"text": "You should try this.  Worst possible case?  You fall back to Plan B", "label": 0}
{"text": "That looks like a 1/2” drive so an extension for 1/2” ratchets would fit. \n\nWhen changing the anode rods, they come in either a straight stick or a string of chain links. Do you have 4’ of room above the heater to drop the new rod in from above? If not, order the chain link version so you can feed it in with the head space you have to work with. \n\nDo you have really hard water? And are you certain the tank is not fiberglass? I would think a 6 year old tank is a fiberglass tank which will fail at a MUCH slower rate. If it’s fiberglass, I would just do a drain and flush, but that’s my personal maintenance and I flush annually.", "label": 0}
{"text": "Picture added", "label": 0}
{"text": "This looks really nice and a lot cozier than before. Great color palette.", "label": 0}
{"text": "It can be replaced.  But there is no guarantee that the removal will eliminate your symptoms.\n\nYou may need an air quality test to help you determine what is causing your symptoms.", "label": 0}
{"text": "This may stop or reduce insects getting into your home.  But bugs are persistent, and can get through the smallest of holes.", "label": 0}
{"text": "That may not be the anode rod.  It could be an alternate spot to put the relief valve on top.  That’s the way Bradford white heaters are.", "label": 0}
{"text": "Just want to say thanks for pointing this out. I didn't even think about it but I was able to remove that u bend and run the tub line straight and I'll just add a p-trap underneath the tub drain.", "label": 0}
{"text": "White wash might be nice.", "label": 0}
{"text": "Get.  Multiple.  Quotes.\n\nThat is the ONLY way to get a sense of what this project might cost.", "label": 0}
{"text": "I’ve tried to do my car windows for years and it’s super hard. One thing is that it will always look better once it dries. IMO, it looks like what some of the others have said - maybe too much soap in the e batch. The film comes with adhesive on it. The goal is to just get everything sopping wet so nothing sticks until it’s where it belongs. GL", "label": 0}
{"text": "Buy that kind of screwdriver.\n\nUse longer, bigger screws.\n\nUse glue.\n\nBe smart about this.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "You may want /r/PestControl for this.", "label": 0}
{"text": "You could fit 3 vertical bodies in there too probably", "label": 0}
{"text": "I have a Makita 12v brushless set that I use for almost everything, the impact driver most often. For high torque I'll pull out my pneumatic impact wrench as it outperforms the impact driver and doesn't sound like I'm breaking it at high torque. \n\nI probably pull out my 3/8\" dewalt corded drill about once a year but I still keep it around as if I need to drill a lot of holes or just have something that can run for 30 minutes you can't beat it. \n\nI also have a 1/2\" corded hammer drill though I don't recall the manufacturer. I use it rarely but when I need to drill a few holes in concrete it gets heavy use (if I need to drill a lot I'll rent an SDS drill).", "label": 0}
{"text": "Google the phrase “how to repair large holes in drywall”", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Yes, but there is the question if you need the power. I had my a-ha setting m12 into heavy concrete with a cordless hilti and it was just so easy", "label": 0}
{"text": "Call an electrician right away….", "label": 0}
{"text": "Thank you for submitting to r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Inappropriate Topics: \n   * Cooking, Cleaning\n   * Basic home maintenance (Lawn Care, Painting, Lighbulb Identification, etc)\n   * Basic general automotive maintenance\n   * Sewing, Crafting, Decorating, Life Hacks\n   * Cosmetics, Hair styling, Personal Hygiene \n   * Software based design: Solely CNC, 3D or laser printed projects\n   * Solely Programming, Coding, Scripting, Automations, etc.\n  * Requires a professional (Asbestos, Dangerous, Certification Required, Etc)\n\n    * Memes, Jokes, Polls, Opinion Requests, Rants, Venting, General Complaining\n\n^(Mod discretion may be used in cases if the above is not adequate enough to describe the content not suited to the community)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Not a specific question for OP, but curious if the tiles should be rotated to avoid a repeating pattern?", "label": 0}
{"text": "Drill new mounting holes and screw the cleat into both studs", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "You have to throw the entire fan away and buy a new one, all because the light burned out. This should be illegal.", "label": 0}
{"text": "Honestly my plumbing ability is just replacing what's already existing I couldn't lay any of this out but can replace what someone smarter then me already set up lol. \n\nI asked a plumber buddy about the bend you pointed out. He said it would probably be fine. But while I have everything open, I might as well get it up to code.", "label": 0}
{"text": "If you want to diy.... Turn off the switch and and or breaker then  scrape off the white glue/ silicone/ gunk and look for some writing for + and - maybe their is a voltage amount. Go turn everything back on and Use a volt meter to check polarity ann wether you have d.c. or a.c at the wires. If you got a known amount of angry pixies in the wires hop on Amazon or check out your local hardware store. You can find something similar if not an exact match.  If it's not quite right you can always hot glue or sticky foam something in there. YouTube a bit of basic wire connections you can fix this for about ~ $30 usd depending on what you get... Heck you might find a fancy RGB with remote if you like.", "label": 0}
{"text": "Thanks guys!", "label": 0}
{"text": "Shade sails", "label": 0}
{"text": "Where in the balkans is this?", "label": 0}
{"text": "You need a better photo to get the numbers you need  but that part is replaceable. Once you start to match a few up online you’ll find what you need.\n\nYou look at the wattage and figure out what color you want, then make sure the screw holes will match up and you’re done. I swapped mine because I didn’t like the dingy yellow color. Very easy, like a bulb but with 3 screws and a clip wire.", "label": 0}
{"text": "Contact the manufacturer. They often have spare parts. Every one of my ceiling fans uses this style light and they are all replaceable. ", "label": 0}
{"text": "Slovenia, how did you know?", "label": 0}
{"text": "I know but they wanted it like it is, they weren't complicating.", "label": 0}
{"text": "Right I’ve heard this said many times and the only response I can think of is “no it’s not” haha. A 20x20 room feels like a 20x20 room to me regardless of the color. Black clothing is slimming because it hides shadows that would come from a bulging stomach. That has no impact on room size. I genuinely feel like this is just an old myth but open to saying this could just be me. I’ve never painted a room darker and had it feel smaller or painted a room lighter and had it feel larger.", "label": 0}
{"text": "Lime wash", "label": 0}
{"text": "# Wrong.\n\nSee those 3 screws on the LED fixture? Those can be unscrewed and you just replace the LED part. I’m not going to link to Amazon (because the auto moderator might block me) but search for “Retrofit Light Kit for Ceiling Fan Flush Light Replacement Panel PCB*”… they cost $12.99 shipped prime overnight. \n\nYou’ll see the 3 screws right in the product photo.", "label": 0}
{"text": "this is the answer, can’t believe how many people don’t know what they’re on about.      \nI’ll even bet that the wires in the centre end in plugs so you can just unplug/plug in the new one", "label": 0}
{"text": "> this is the answer, can’t believe how many people don’t know what they’re on about.\n\n/r/confidentlyincorrect \n\n> I’ll even bet that the wires in the centre end in plugs so you can just unplug/plug in the new one\n\nThey do indeed.", "label": 0}
{"text": "They make shelf pins that can be screwed to the bottom of the shelf.", "label": 0}
{"text": "I know the word fasada, brother from another mother. Thank you. Hope Canada is as nice as Bosnia.", "label": 0}
{"text": "Nice. High 5!", "label": 0}
{"text": "There are led bulbs of that form factor but the one currently installed has no UL listing which would suggest its not replaceable.", "label": 0}
{"text": "They are not adjustable, I believe.\n\nYou may be able to reposition the door striker a little lower to compensate", "label": 0}
{"text": "Get a bunch of 4 & 6 aH batteries and you’ll be able to wear yourself out before the tool. \n\nI may have a problem: 4- 6aH, 7- 4aH, 6- 2aH, 4/5- 1.5aH", "label": 0}
{"text": "You might not like how wasteful it is but companies love you buying a new $120 fixture instead of a $3 light bulb.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "It’s not a single led lamp, it’s all the little ones around the circumference that are soldered to the board. You won’t know where the fault it. These are made to last forever, but the small amount that do fail you have to replace the entire fan or light assembly (if the piece is available).", "label": 0}
{"text": "Removed as this has absolutely nothing at all to do with /r/DIY.   This is a dispute between contractors and the homeowner", "label": 0}
{"text": "Jokes on them I refuse to buy those type of fixtures", "label": 0}
{"text": "Either one lol pick and choose in the moment", "label": 0}
{"text": "Dont see a picture but they sell this plastic wrap kit.\nYou use double sided tape to stick the sheet over the window/frame and a hairdryer to \"tighten it\". Magical. Stops drafts as well as condensation.", "label": 0}
{"text": "Life is good here, can’t complain too much. I do wish moving back was a realistic idea (financially, economy, politics) but maybe one day. For now I still visit as much as I can in the summer time. I do need to visit Slovenia one day. My father went to school there and loved the country", "label": 0}
{"text": "You will have to repair it, or hire someone you trust.  The railing should not present a problem if the repair is done correctly.\n\nIf you want to see how this would be done, google the phrase “how to repair broken concrete steps”", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "Just looked into it and it looks like it’s not documented much at all outside of internet comments. It appears to just be a myth that’s been circulated for a while. According to this guy who claims to have read the studies (I haven’t):\n\n[First, there is no scientific paper or study suggesting either of these statements (dark rooms feel smaller) to be true. Second, scientific studies conducted during the last one hundred years shows the opposite to be true.  Psychological studies on human perception and distance (the earliest study I found dates to 1898) have consistently found that observers perceive bright objects to be nearer than the same objects in darker colors.](https://www.sherwin-williams.com/home-builders/color/education/sw-article-pro-mcdebunking)", "label": 0}
{"text": "It’s the dimmable driver in the box with the wiring, not the led array, that’s probably bad.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Maybe /r/HelpMeFind, /r/AskReddit, or /r/Ask could help you with that", "label": 0}
{"text": "You won’t be buying any fixtures in about 5 years.", "label": 0}
{"text": "What do the local home improvement stores sell to patch small holes in walls?   Spackle, perhaps?", "label": 0}
{"text": "Find the original documents on ot it instrustuons and contact the manufacturer.  They might be able to give you a part number and / or get it ordered for you.  Also, a good chance it's just trash as most things are made very poorly just so you have to buy a new one", "label": 0}
{"text": "These kind of lights are not supposed to go out during the lifetime of the device. You might be eligible to a warranty claim. And if not maybe it's possible to at least get a replacement part from the manufacturer. \n\n\nOf both are no option then I agree that's kinda shitty, but the shitty thing is that there's some design flaw in the circuit, because if it was designed right it should have lasted decades.", "label": 0}
{"text": "Laughs in ceiling fan lighting product CEO:  “Hahahaha, then he said, what build do I use to replace this?, hahahahahahah”\n\nInsert Leonardodecapriowolfofwallstreet.jpeg", "label": 0}
{"text": "Yes, that will be strong enough to hold it", "label": 0}
{"text": "Thats an LED, for most people you dont service it but replace it. Its not like a bulb you twist out and twist a new one in.", "label": 0}
{"text": "I probably do - no idea that existed :) Thanks!", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Please do not use /r/DIY as your first stop for questions - we are not Google.  \n* Please search Google and /r/DIY to see if your question has been asked before. Check owners manuals, tech support forums or contact the manufacturer.\n\n* Your question does not include the research you've done to find an answer yourself, or why that research didn't answer your question. \n    * This is a basic requirement so others do not spend time repeating your steps. It is *not* a judgement about your question being \"too easy.\" We're looking for evidence that you've made an attempt yourself.\n\n* **Have you already done some basic research and are still stuck?**\n * Please include what research you have done in your question so that others do not repeat your steps.\n * Consider posting your question in the [sticky thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel. \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**    \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Basic%20research).", "label": 0}
{"text": "People say both my guy", "label": 0}
{"text": "That's pretty darned cool.  Now I'm trying to come up with some reason I need one.  Or better yet, why my work needs one, so they have to pay for it. :)", "label": 0}
{"text": "My best guess on this one is that its to create a smoothish surface instead of haveing the exposed brackett and screw right under the lip of the counter where hands and fingers my rub against it. Once removed would hightly recommend replacing it.", "label": 0}
{"text": "Ice", "label": 0}
{"text": "I had a place like that. The power in my kitched would also go out from time to time. Turned out one of the plugs in my kitchen was badly wired / corroded. It was in a weird spot so I never noticed that one half of it didn;t work at all. Well when I pulled it it looked like a corroded battery. I replaced it and the short lived bulbs and power outages both stopped", "label": 0}
{"text": "Looks like you had a furnace fire now lol", "label": 0}
{"text": "That doesn’t mean they ain’t wrong haha", "label": 0}
{"text": "Cheap components. Typical nowadays.", "label": 0}
{"text": "I'll try there. Thanks.", "label": 0}
{"text": "Yeah there is a pretty decent market growing for LED fixtures replacements.  Recently redid an LED fixture in my kitchen (which was itself a refit fluorescent). ToggLED was the brand.  Good stuff.", "label": 0}
{"text": "Maybe the folks at /r/vacuumcleaners could assist you with this", "label": 0}
{"text": "You still are relaxing the entire fixture in that scenarios. This model does not have a lamp/bulb. It has soldered on LEDs.", "label": 0}
{"text": "What?", "label": 0}
{"text": "pretty sure it shuddered when the paint was brought out", "label": 0}
{"text": "Modern cordless drills are quite powerful, which is why you can buy a used, corded drill so cheaply. I would suggest that you replace your 20 year old corded drill with a 40 - 60 year old corded drill. They're much cooler, sound better, and are just better made in general. And you can usually pick one up for under $10.", "label": 0}
{"text": "Kinda just looks like dust in the fiberglass.  Get a cheap humidistat and see what the humidity actually is down there.", "label": 0}
{"text": "Believe you want /r/DIYUK and /r/UKElectricians for this project", "label": 0}
{"text": "Him having try to correct someone seems like it", "label": 0}
{"text": "Please post this to the many cosplay subreddits out there", "label": 0}
{"text": "This is hilarious and true", "label": 0}
{"text": "Thank you for submitting to r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Inappropriate Topics: \n   * Cooking, Cleaning\n   * Basic home maintenance (Lawn Care, Painting, Lighbulb Identification, etc)\n   * Basic general automotive maintenance\n   * Sewing, Crafting, Decorating, Life Hacks\n   * Cosmetics, Hair styling, Personal Hygiene \n   * Software based design: Solely CNC, 3D or laser printed projects\n   * Solely Programming, Coding, Scripting, Automations, etc.\n  * Requires a professional (Asbestos, Dangerous, Certification Required, Etc)\n\n    * Memes, Jokes, Polls, Opinion Requests, Rants, Venting, General Complaining\n\n^(Mod discretion may be used in cases if the above is not adequate enough to describe the content not suited to the community)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "What in the Minecraft is this?", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "LED.   Home depot", "label": 0}
{"text": "Great job! Very clean and neat.", "label": 0}
{"text": "another:\nhttps://imgur.com/rmm0VT7", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "I am at HOME NOW! The project is at my HOME. What i am trying to say is that some countries build houses using drywall like eg. USA. The country i live in builds houses with bricks and motar. \n\nBut idk how this is helping me tho...", "label": 0}
{"text": "Very neat!! It's pleasing to the eye.", "label": 0}
{"text": "I think the first thing that you need to do is remove all the drywall so that you can see what structures are inside.", "label": 0}
{"text": "Try /r/WhatIsThis and /r/WhatIsThat", "label": 0}
{"text": "Just to clarify, it didn't take me 7 years for the staircase.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "That's a \"replace the whole ceiling fan\" kind of bulb", "label": 0}
{"text": "Pride slovenc in ze jamra, klasika", "label": 0}
{"text": "Walls would look so nice painted a dark deep green or some other rich color (burgundy maybe?)", "label": 0}
{"text": "I suppose it depends on the direction of the 10 lb force.  I'm struggling to understand what the finished product will look like.  Can we get a \"zoomed out\" sketch of it in operation?", "label": 0}
{"text": "Dewalt 20v Li-Ion are sold as \"18v XR\" outside of the US.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "Test the heat instead of the voltage. Thermo gun.", "label": 0}
{"text": "It’s pretty rate for bulbs to blow filament because of heat, they are in a vacuum inside after all and the temperature of the filament is much hotter than it could get to around the outside of the bulb", "label": 0}
{"text": "I used chat gpt to guide me..why do ceiling fans have to be so ridiculous lol", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* Your title does not adequately describe your project or your question.  \n* Your title is clickbait or inaccurate. \n* Your title contains the words \"xpost\" in some form or another.\n* Your title is in ALL CAPITAL LETTERS.  \n* Your title is unreadable, not understandable, uses acronyms, is not in English, or is otherwise difficult to read.\n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting**\n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Bad%20Title).", "label": 0}
{"text": "![gif](giphy|znRstrOYuirrW)", "label": 0}
{"text": "Fair enough, but with it happening with multiple bulbs and different types I don’t think it’ll be the smoking gun", "label": 0}
{"text": "So for this one you’re thinking if the voltage, power, and energy were spiking indicates on? Otherwise some minor baseline from phantom draw if off/standby?", "label": 0}
{"text": "Buy a new fan, remove the light from new fan, replace, then return", "label": 0}
{"text": "Nice work", "label": 0}
{"text": "We whitewashed our bricks and I inserted an electric fireplace that filled the actual fireplace.", "label": 0}
{"text": "Is it to a finished basement or an old scary basement?", "label": 0}
{"text": "I must say you did an amazing job with your first staircase. It's one of the hardest things to make out of stone/tile. Everything has to be right, or you will be in trouble, and then it's too late to correct. Hats off 👏", "label": 0}
{"text": "You even linked something with the proper spelling and still didn't get the joke. *sigh*", "label": 0}
{"text": "Awesome, will give it a go, thank you!", "label": 0}
{"text": "Thanks, do you think I should remove the drywall with mold or just wipe with concrobium and let it dry out before sealing? I was also thinking of painting the affected area with Kilz mold primer once cleaned", "label": 0}
{"text": "These worked perfectly. Thank you!", "label": 0}
{"text": "NOT a fan of that tile pattern at all....", "label": 0}
{"text": "\n###Please read this entire message in length before messaging the moderators or you will not receive a response.   \n\n&nbsp;  \n\n Hi wallwhore, \n\n\n Your post has been automatically flagged for removal because it appears you may be asking for help identifying asbestos. \n\n It is not possible to determine if an item contains asbestos just by looking at it. Microscopic asbestos fibers cannot be seen, smelled or tasted and asbestos exposure does not cause any immediate symptoms.\n\n The only way to detect asbestos in a material is to send a sample to a lab for testing.\n\n More information about identifying and dealing with asbestos can be found at https://www.asbestos.com/asbestos/\n\n Alternatively - please feel free to [click here](/r/DIY/search?q=asbestos&sort=new&restrict_sr=on&t=all) for a list of previously submitted questions regarding this topic.\n\n If you believe that your post was removed in error, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Asbestos).  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DIY) if you have any questions or concerns.*", "label": 0}
{"text": "Fire Marshall Bill..", "label": 0}
{"text": "Sign shop owner here. \nFirst, this frosted vinyl is one of the most persnickety products we work with, so the idea that you struggled on the first try is not a giant surprise. \nRemove it and clean the glass all over again. \nSpray with glass cleaner and scrape the whole window repeatedly with a razor blade. Then spray with glass cleaner again and get it looking good. Then dab a paper towel with a half dollar size of rubbing alcohol and clean the whole thing again. The Polish with a dry paper towel.\nThe application fluid should be a spray bottle of water, about two tablespoons of rubbing alcohol and one drop (!!) of dish soap. That's is. We use this solution every day. \nYour plastic drywall knife is not the tool. It's not as smooth as you think.\nI would recommend getting an actual application squeegee with felt on one side from Amazon or similar.\n(1) Clean the glass as described. (2) Absolutely soak the glass and the vinyl with application fluid. (3) Use the felt side of the squeegee first. Work from the top down so gravity is working with you. You will \"chase\" the fluid down as you go. You can also go outside and check your progress. For the first ten minutes or so, the vinyl is very willing to allow you to chase bubbles to the edges. Work gently. Chasing a bubble slowly gives time for the vinyl that is already stuck to release and allow the bubble by. If you press a bubble too fast/hard it will just fold over and make a permanent wrinkle.\nWork with the felt side of the squeegee until it's all even. Then spray the outside of the vinyl with a light dusting of fluid, then switch to the hard side of the squeegee. Work from the center out to the edges. The fluid is here to prevent you from deeply scratching the surface of the vinyl.\nLike I said at the beginning, this product it a chore. Get the right solution and the right tools. Try to work with the product instead of fighting against it and it will go your way.\nhttps://a.co/d/eUFMviT", "label": 0}
{"text": "Hell, even the bulbs were sabataged...\n\nhttps://en.wikipedia.org/wiki/Phoebus_cartel", "label": 0}
{"text": "Just sand lightly, prime and repaint.  Using a small roller will get you a better finish than a brush.\n\nIt actually just looks like he used a brush and not enough coats.\n\nPaint is very easy to diy if you have patience.  Use tape.  Go slow and give the coats time to fill in.  And if you mess up just knock it down with sandpaper and try again.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reasons:\n\n---\n\n* You are asking how to \"get started\" on a project. \n* You are asking what is the best method or approach to a project.   \n* You are asking whether or not you should do a project.  \n* You are asking for advice on what project you should make (\"what can I make within my budget?\")    \n * If you have a project in mind, please do some basic research on the matter, come up with your plan, then you can ask about a specific aspect of the project. \n\n**We want you to get the help you're looking for.** If you have any of these questions, some places to get help are:\n\n - The [Getting Started thread](/r/DIY/about/sticky) at the top of the subreddit.  \n * Ask your question in our [Discord server](https://discord.gg/diy) in the appropriate channel.   \n * You may also try other subreddits - /r/homeimprovement, /r/woodworking, /r/electronics or /r/findareddit to help you find a subreddit applicable to your question.   \n\n**Please read our [guidelines](https://www.reddit.com/r/diy/wiki/guidelines) before resubmitting.**  \n\nIf you believe this was a mistake, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDIY&subject=Brainstorming%20questions\\)).", "label": 0}
{"text": "You mean 2 bed apartment", "label": 0}
{"text": "yea - that's what I was thinking - apparently mine is like a Bradford White - although no union to make it wasy to remove the anode from hot water side - I put pics above.", "label": 0}
{"text": "Tell Building Maintenance to repair/replace them.  That is what you pay rent for.", "label": 0}
{"text": "Thank you for submitting to /r/DIY. Unfortunately your content has been removed for one of more of the following reason/s:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* Not about DIY\n\n* General off-topic \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Please* [*contact the moderators of this subreddit*](https://www.reddit.com/message/compose/?to=/r/diy) *if you believe that you have received this message in error.*", "label": 0}
{"text": "Hi! Thanks for the tip. Is it just plaster or is it combined with gypsum board?", "label": 0}
{"text": "Looks to my amateur eye like a layer of plaster over top of render/stucco", "label": 0}
{"text": "You may want /r/AskAPlumber and /r/Plumbing for this repair", "label": 0}
{"text": "Modern drills likely can. Masonry drilling is one of the only reasons I keep a corded drill around tho. Most hand drill activities are short in duration so battery drills are perfect. Masonry drilling though is commonly a longer process. I would get a cordless any day, but I'd keep the cord just for that. \nAs for brands, I'm not joking, I was a DeWalt wh0re for years and spent dearly for it. Then I got a Ryobi at about half the price and multiple batteries for about half the price and never looked back. Their modern HP+ tools have ridiculous power and if you really wear the thing out after a few years, you get another brand new one rather than dropping off the big name tool for reconditioning at the service center. \nI have an embarrassing variety of 18v Ryobi tools. They literally make everything.", "label": 0}
{"text": "So I managed to find what I think is spackle (spachtel), I tested on one of the pairs of holes but it’s pretty obvious, different shade and doesn’t have the same texture. \n\nI’d imagine I can paint to match the color, but I have no idea how to match that texture.", "label": 0}
{"text": "Get.  It.  Tested.\n\nThe ONLY way to know for sure.", "label": 0}
{"text": "So is that a white color finish or do they have clear finish? Do you paint over it or can you leave the primer as the finish?", "label": 0}
{"text": "I use white.  I also paint it afterwards, because primer shows dirt and is hard to keep clean", "label": 0}
{"text": "I had a similar thing I had to replace. lights on the front of my house all had a bulb, but the back of my house had a built in LED. They were the exact same fixtures except for the bulb vs built-in LED. Thing is, the buld versions are $5 cheaper. Even average LED bulbs are less than $5. There is no reason anyone should have purchased the built-in LED versions. And of course the LED one burnt out so I had to replace the entire unit.", "label": 0}
{"text": "They sell these? This is great news 👏", "label": 0}
{"text": "I'm no plumber but this looks like some sort of cheap pvc drain. It's probably already sealed from the bottom. I would just use any sort of white bathroom caulk. Clean the area with simple soap and water or like lysol dry it and apply the caulk in the same area it was removed from. Once dry reattach the cover. Another product you can use is plumbers putty but if caulk was used there before just re caulk it.  If you never used caulk get a disposable glove wet your finger and smear the caulk edge wiping the excess off your finger on a paper towel till perfect. You can look up a video on youtube if it helps.", "label": 0}
{"text": "Clean it and paint it with enamel.", "label": 0}
{"text": "shower drain, the sealant cracked and was leaking in room bellow.  I cut out all the older sealant (was dap kwik seal ultra)", "label": 0}
{"text": "Other comments are fine, but likely won’t solve the problem. The PCBA module is most likely fine. If you remove the top cover and get access to the j-box, you will most likely see a driver that needs to be replaced. Contact the manufacturer for this, they might even send a replacement for free if it’s a relatively new fan. You could probably get the part number from the driver and find one online as well. Their lifespan is much less than the LEDs and are usually the first to go. \n\nChances are this fan also has a remote for dimming the fan and light? If so, ensure that you do not have this fan also wired to a dimming light switch. If you do, cutting the amperage was likely the cause of the failure.", "label": 0}
{"text": "Whatever they sell at the auto parts store", "label": 0}
{"text": "If it’s significantly different yeah, small differences are normal", "label": 0}
{"text": "If you don’t know what an LED is, then I would advise you to not touch anything electrical and call an electrician", "label": 0}
{"text": "before\n\n[https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW\\_Doug%20Bennett%201\\_Before\\_21.jpg](https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW_Doug%20Bennett%201_Before_21.jpg)\n\nafter scratch coat\n\n[https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW\\_Doug%20Bennett%206\\_21.jpg](https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW_Doug%20Bennett%206_21.jpg)\n\n  \ndone\n\n[https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW\\_Doug%20Bennett%2018\\_21.jpg](https://fs.hubspotusercontent00.net/hubfs/401758/Swenson%20Blog%20Post%20-%20Thin%20Stone%20Veneers%20Make%20a%20Fireplace%20Update%20Easy/SGW_Doug%20Bennett%2018_21.jpg)", "label": 0}
{"text": "Exactly. They're not expected to keep up with the other brands. They're expected to be a broke beginners first power tools for a DIY project. The tools will get beat up, and by the time they don't work any more, the owner will get their worth out of them and they can decide if they want to shell out for an upgrade or not. They fit that niche perfectly.", "label": 0}
{"text": "Just looks like dust.", "label": 0}
{"text": "You might want to post these images to the dozens of interior design subreddits out there.", "label": 0}
{"text": "EDIT! I meant to say I also need help figuring out where to begin. I have no idea how to do this, but am great at diy and learn stuff really fast’", "label": 0}
{"text": "Bricky here, that is a masterpiece. The paint looks good too", "label": 0}
{"text": "LED   on element maybe bad. test with multimeter", "label": 0}
{"text": "[https://www.youtube.com/watch?v=JBKF7rKB3zc](https://www.youtube.com/watch?v=JBKF7rKB3zc)", "label": 0}
{"text": "This looks awful", "label": 0}
{"text": "Assuming the 3rd photo is the ceiling, it looks like a leak from above working it'd way down the wall. What's on the other side of the ceiling?", "label": 0}
{"text": "So like a mini roller?", "label": 0}
{"text": "What if I left out the context. Then you’d never know about renter dynamic", "label": 0}
