{"text": "I’m afraid of the people who read stuff this and buy it. It’s just so absurd.", "label": 0}
{"text": "I know right. Kamala let in 20m illegals", "label": 0}
{"text": "Time to send screen shots of tubgirl, the blue waffle, and other shock sites I’ve forgotten", "label": 0}
{"text": "Definitely report this to your carrier.\n\n\nService providers take a very dim view of people and organizations clogging up their SMS system with spam *unless they pay for it*.\n\n\nSource: Used to support AT&T's business clients and boy howdy they'd get pissed when they get caught and blocked from sending SMS/MMS.", "label": 0}
{"text": "The VP doesn't make policy. She can't.", "label": 0}
{"text": "Three witnesses say he did. But everybody is lying except Trump, right?", "label": 0}
{"text": "Go back to r politics", "label": 0}
{"text": "Kamala and Biden together made executive orders to open the border. Sad.", "label": 0}
{"text": "> Kamala and Biden together made executive orders to open the b\n\nTrump made the GOP [kill the last border deal](https://www.axios.com/2024/01/29/trump-republicans-border-deal-senate-immigration), which they'd already agreed to, so he could campaign on it.", "label": 0}
{"text": "Weird, I’ve gotten like 3 messages in the last 24 hours asking me to vote for Trump too…and I’m a registered Democrat.", "label": 0}
{"text": "1. JD Vance\n\n2. Joe Rogan\n\n3. Laura Loomer\n\n4. Ben Shapiro\n\n5. Tucker Carlson\n\n6. Rudy Giuliani\n\n7. Kevin Sorbo\n\n8. Easy marks", "label": 0}
{"text": "Should have tried responding in different languages", "label": 0}
{"text": "Half the country worships Hitler?\n\nThe History channel glorified him for decades.  He has become transformed into a ‘misunderstood’ individual-  and his legacy shouldn’t really be judged solely on the holocaust…..", "label": 0}
{"text": "Hitlers generals made something like 40 attempts against his life.", "label": 0}
{"text": "That bottom quote seems to be about how trump will leave office forever by the grace of God lmao \n\nWas just talking to my friend who said he thinks God specifically was allowing him to live so everyone can learn from his folly, so I know some carry the sentiment. \n\n but the top quote makes me think its just incoherent rather than misunderstood", "label": 0}
{"text": "I’m going with the psalms", "label": 0}
{"text": "That \"He had his chance\" T-shirt", "label": 0}
{"text": "Have to remind your Trump/FoxnFriends connections that he was the one that paid to have \"the jab\" made. Probably the best thing he did as president and one he'll never mention cause they have all been brainwashed to think the Covid vaccines are \"the devil's juice\".", "label": 0}
{"text": "so no one deserves their own opinions anymore?", "label": 0}
{"text": "Weren't they the kids that he stiffed when he didn't pay them after they had performed?", "label": 0}
{"text": "#🐈‍⬛", "label": 0}
{"text": "Yup!", "label": 0}
{"text": "Freedom and liberty everywhere? For who? Billionaires and bigots?", "label": 0}
{"text": "This was some profoundly fascist shit: \n\n\"Enemies of freedom\nFace the music\nCome on, boys—take ‘em down!\nPresident Donald Trump knows how\nTo make America great\nDeal from strength or get crushed every time…\"", "label": 0}
{"text": "Further proof that religion is stupid.", "label": 0}
{"text": "Mao Zedong did this too", "label": 0}
{"text": "It's not fair comparing Trump to Hitler. There's loads of differences between them. First of all, I don't think Trump can even paint.", "label": 0}
{"text": "Nor can he speaks German. And Hitler was a self-made-man.", "label": 0}
{"text": "Definitely getting Homelander vibes.", "label": 0}
{"text": "I did my part in Nevada. 💙🗳️", "label": 0}
{"text": "I assume most watched because it's a hit with old people and plays on countless public retirement home TVs all the time. I hope to God it's not actually the most popular outlet.", "label": 0}
{"text": "Bless your heart💙", "label": 0}
{"text": "“The Children’s Hour: Why So Many Proto-Fascists Are Also Pedophiles”\n\nhttps://www.nationalmemo.com/republican-pedophiles", "label": 0}
{"text": "“The Children’s Hour: Why So Many Proto-Fascists Are Also Pedophiles”\n\n“In Tennessee last May, federal prosecutors charged Putnam County Commissioner Jimmy Ray Neal with possession and distribution of child pornography. He allegedly went by the handle “Tennesseemaster” on an app used to share pictures of pre-pubescent children.\n\nLast November, Joel Koskan, running for the third time as a Republican candidate for the South Dakota legislature, was charged with felony child abuse, after a family member reported that he groomed, molested, and raped her for years, starting when she was 12.\n\nOne state closer to Canada, in North Dakota, last spring, the state’s longest serving state senator, Ray Holmberg, resigned after reports that he exchanged a stream of text messages with a man jailed on child porn charges. Holmberg exchanged 72 text messages with Nicholas James Morgan-Derosier, who prosecutors say possessed several thousand images and videos depicting sexually abused children and took two children under the age of 10 from Minnesota to his Grand Forks home, with the intent of sexually abusing them. Holmberg said he couldn’t recall, but thought the texts exchanges were about a patio.\n\nIn Texas, anti-gay activist and one-time chairman of the Houston area Republican Party, Jared Woodfill, conceded in a deposition that he ignored complaints about the behavior of his law partner, the Baptist preacher Paul Pressler, with young men. A young man accused Pressler of repeatedly raping him in a church youth group. Woodfill had been informed that the preacher was a predator, who liked to tell young men lewd stories about men “naked on beaches” trying to lure them to skinny dip at his ranch.\n\nIn 2020, Trump campaign operative George Nader pled guilty to child porn and sex trafficking and was sentenced to ten years in prison. Prosecutors accused him of possessing pornographic images of children including some featuring toddler-age boys, baby goats, and other farm animals, and of arranging to transport a 14-year-old boy from the Czech Republic to his Washington home.\n\nTrumpworld was creepy with men who had a thing for teens, starting with 45 himself. Alabama’s 2018 U.S. Senate candidate Roy Moore, was a notorious teen-girl harasser. Six women accused him of pursuing sex with them when they were as young as 14. Moore was so aggressive toward high school girls that a local mall actually banned him, according to the New York Times.\n\nThe revelations did not lose him Trump’s endorsement.\n\nAn Uncle Fester getting gnarled hands on a nubile is nothing new in conservative circles.“\n\nhttps://www.nationalmemo.com/republican-pedophiles", "label": 0}
{"text": "The Dear Leader must be celebrated", "label": 0}
{"text": "Happy cake day 🎂", "label": 0}
{"text": "I took my pup with me to put up yard signs for a school board candidate. He peed twice. Both times right in front of a Trump sign. \n\nEven the animals know.", "label": 0}
{"text": "Good dog. 🐕", "label": 0}
{"text": "Jesus, what a chode", "label": 0}
{"text": "How can someone so rich be so pathetic?", "label": 0}
{"text": "Let's make sure that all government money going to SpaceX and Star Link is part of the $2T he wants to cut", "label": 0}
{"text": "He speaks like English isn’t his primary language", "label": 0}
{"text": "I'm sorry, was that his whole speech? What a bunch of garbage. Literally anybody could've gone up on stage done the same circlejerk speech.\n\n\nThis is the idiocy our country is competing against?", "label": 0}
{"text": "Guys such a fuckin dork, it’s insane. I thought this party valued personal responsibility? Guy probably doesn’t even wipe his own ass these days.", "label": 0}
{"text": "\"Of the 64 cases brought by Trump and his supporters, twenty were dismissed before a\nhearing on the merits, fourteen were voluntarily dismissed by Trump and his supporters before a\nhearing on the merits, and 30 cases included a hearing on the merits. Only in one Pennsylvania\ncase involving far too few votes to overturn the results did Trump and his supporters prevail.\"\n\n> Donald Trump and his supporters brought seven cases with sixteen counts in Wisconsin,\nalleging that fraudulent votes were counted and that elections officials violated the law in their\nrulings on the counting and casting of ballots. Both federal and state courts examined these\nallegations, and found them all baseless. Post-election analyses have confirmed the courts’\nrulings that no systemic fraud existed that would have altered the election results. In an October\n2021 report, the Wisconsin Legislative Audit Bureau, a non-partisan and independent body,\nfound no evidence of widespread fraud that would alter the election results. In December 2021,\nthe conservative Wisconsin Institute for Law & Liberty likewise found no evidence of\nwidespread voter fraud and no evidence of significant problems with voting machines—in fact,\nthey found that Democratic candidates performed worse than expected in areas with Dominion\nmachines. Similarly, in December 2021, the Associated Press concluded its study of the\nelection, which found no evidence of widespread fraud. The AP survey of local elections officials\nand prosecutors identified 31 potential cases of voter fraud, representing less than 0.15% of\nBiden’s margin of victory.\n\n[Lost, Not Stolen](https://lostnotstolen.org/)", "label": 0}
{"text": "He already admitted he will be going to prison if Kamala wins. He has committed treason because of Putin.", "label": 0}
{"text": "Wow. He really has no understanding of macroeconomics. Or he's being deliberately misleading.", "label": 0}
{"text": "Let's hope he gets to go to a brand new one just for billionaires, on Mars", "label": 0}
{"text": "I hate Musk as much as the next guy but he is not going to see prison time in the event of a Harris victory lol. Maybe he’s slapped with some fines but that would be it. And even if the Harris administration were to seek legal action against him, he would easily seek asylum in any number of countries that are adversarial with the US.", "label": 0}
{"text": "Imagine telling Americans in the 1950s…", "label": 0}
{"text": "That coke really has his mouth working overtime between the few actual prepared lines of speech he actually delivers.", "label": 0}
{"text": "It isn't.  It's Afrikaans.  He is a South African.", "label": 0}
{"text": "Yeah the richest man in the world (or second richest if putin counts) doesn't go to jail, he sends people to jail", "label": 0}
{"text": "He says \"USA\" the way we make fun of Russian trolls saying it", "label": 0}
{"text": "Oh cool he even found a MAGA hat in the font that Nazis also loved", "label": 0}
{"text": "Except it was a woman the aid was brave enough to push around ...", "label": 0}
{"text": "He is a skid mark on America!!!", "label": 0}
{"text": "I don’t think they weren’t paid. They sued because they were promised more gigs that didn’t materialize. The suit was eventually dropped.", "label": 0}
{"text": "\"so you know what can happen\" seriously wtf these people are out for blood. That is not a platform it's a threat!", "label": 0}
{"text": "I go with both", "label": 0}
{"text": "why would I want to listen to what this douche has to say?", "label": 0}
{"text": "English is his first language. Most rich white people in SA speak English as their first language and then learn a bit of Afrikaans in school.", "label": 0}
{"text": "The actual enemy within is MAGA.", "label": 0}
{"text": "I can’t listen to that voice for another 4 years.", "label": 0}
{"text": "Damn. There are already too many upvotes. I suppose I should gather my gear; Looks like this pansy, demonic liberal's anti-fascist Marine Corps training's going to come in handy again!", "label": 0}
{"text": "Will be if he wins", "label": 0}
{"text": "So they are paying celebrities to be there. Isn't that disingenuous?", "label": 0}
{"text": "50 is either not a fascist, or knows that Trump never pays his bills, or both.", "label": 0}
{"text": "I think hes banking on a lot of government and military contracts if trump wins.  Wont matter if those businesses fail", "label": 0}
{"text": "And make a public announcement donating it to the Harris campaign.", "label": 0}
{"text": "👨‍🍳🤌🏼", "label": 0}
{"text": "But if Trump loses, I’ll be sitting back and watching🍿 Elon getting the 💩kicked out of him.", "label": 0}
{"text": "Delusional", "label": 0}
{"text": "It’s a lot of money if you’re fucking chachi who can’t get work.", "label": 0}
{"text": "Damn, I didn’t even know he said that too. All focus has been on the PR and Latinos cumming inside jokes.\n\nHere’s the thing to think about: the Trump campaign can distance itself all it wants, but why would he even think those jokes would land for that audience? And the audience did laugh at the Puerto Rico joke. ", "label": 0}
{"text": "You believe people on the right have the unmitigated caucasity to compare Hinchcliffe's set to Don Rickles!?!", "label": 0}
{"text": "Explains why so many D list celebrities that almost no one cars about is coming out for Trump. ", "label": 0}
{"text": "Well put. You can't reason with the unreasonable. Why don't they interrupt Trump's rallies?", "label": 0}
{"text": "He wouldn’t have gotten the money anyway.", "label": 0}
{"text": "Sorry if its violent AF.\n\nBut not voting Harris because you dont agree with 1 or a few points... You are dumb as rocks. Because you may not agree on all of Harris, but for sure you agree less with what Trump has to offer.\n\nIf you dont vote at all, sure you didnt vote trump, but the vote that could have went to harris is not there too.", "label": 0}
{"text": "It cost Kamala’s campaign $10M for Beyoncé to give a 4-minute lecture and then walk off stage. Money needs to be removed from politics completely.", "label": 0}
{"text": "k [https://www.politifact.com/factchecks/2024/oct/28/instagram-posts/heres-no-evidence-beyonce-was-paid-to-endorse-harr/](https://www.politifact.com/factchecks/2024/oct/28/instagram-posts/heres-no-evidence-beyonce-was-paid-to-endorse-harr/)", "label": 0}
{"text": "Fiddy lives-ish in Houston-ish. He's every inch MAGA! He travels to rallies. \n\nIf he wasn't at MSG, there's a damn good reason why he weren't cuz Fiddy like cash money.", "label": 0}
{"text": "Make no mistake, Trump approved this message. \n\n\nVote Harris!", "label": 0}
{"text": "As we know what tRump does isn't always the same as what he does", "label": 0}
{"text": "\\>Yeah sure Trump said he'll allow Israel to \"finish the job\" but the only reason Europe is allowing Israel to run amok is because of the diplomacy with Biden.\n\nlol lmao even\n\n\\>With trump that diplomacy is gone and action will be taken.\n\nYou're right. Trump would block off all humanitarian aid not put any limits on weapons.\n\nListen, Biden has been awful on this and deserves a ton of criticism.\n\nBut Trump would be far worse and would legitimately make Palestinian lives even worse than they are now. \n\nTrump was the one who moved the US embassy to Jerusalem, he blocked off all USAID support to Palestine, and he implemented his \"Muslim Ban\" which included people from Gaza. \n\nIt is Pure fantasy pretending that Trump improves the plight of Palestinians in any single tangible way.", "label": 0}
{"text": "LOL indeed MAGA, where's ur proof of B getting money? It's  weird you would say something you don't know is true or not. That's not Dem tactics, that's MAGA.\n\n Now I'd love to see that canceled check for ANY amount you want to claim...with B's name on it. If you cannot produce a lowly canceled check or transaction report...you're a liar, believing a liar, lying for a liar and willing to do so happily.\n\nNow sweatie, your evidence of eleventy billion Russian Roubles or whatever amount of money you want to claim went into B's pocket is.... \n\nLOL. Ya aint got it!\n\nAre you upset we got B and you got KR? YEAH, ya are! U tryna knock B down a peg to tar her with MAGA.", "label": 0}
{"text": "Brought to you by Carl’s Jr", "label": 0}
{"text": "Extra big-ass diaper!!", "label": 0}
{"text": "Because there’s no record of him saying this. Would you be swayed if some general said Kamala said something bad? I don’t know why we have to stoop to this level.", "label": 0}
{"text": "According to the article in *The Atlantic* they spoke to two sources who heard him say it.\n\nBut let’s pretend this particular quote is false. Trump has said countless other outrageous things that make it clear he’s completely unfit for office.", "label": 0}
{"text": "Fine, but why publish this article headline as if he himself said it directly?", "label": 0}
{"text": ">Diddy was in to freaky and/or gay stuff, so I’m sure people in that world have long known that it was fucked up sexual shit going on behind closed doors.\n\nIt's not that it's gay or freaky. It was sexual assault and shit", "label": 0}
{"text": "The others have responded to you & yet you didn’t reply to them. They’ve all provided excellent reasoning but you give this guy a response? Please lol", "label": 0}
{"text": "The only people i know that have “moral qualms” about voting are people that would’ve voted for Kamala. Not a single person i know of has any issues with voting for Trump. By the way, I am Palestinian, and I’m talking about other Palestinians. So many think that Trump will somehow be better for Gaza.", "label": 0}
{"text": "#Trump = Pervert", "label": 0}
{"text": "**LYRICS: The song lyrics of \"Hail to The Donald--He is Victorious\" are in public domain.  You are free to copy and distribute them with or without attribution.  See CC0 1.0 Universal public domain dedication document at:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T7**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T7)\n\n**MUSIC:  Click the link below to hear the music of the Dr. Seuss song to which the lyrics of The Trump Anthem are set to:**   \n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T8**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T8)\n\n**The revised lyrics are a little longer than the original.** \n\n**MORE TRUMP SATIRE -- All the items below are likewise in the public domain.  You are free to copy and distribute them with or without attribution.**\n\n**Trump with his MAGA Guard singing the Trump Anthem at the Trump Temple:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T6**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T6)\n\n**Trump in Oval Office with his yes-men:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T5**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T5)\n\n**The satirical song lyrics of the Trump Anthem:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T7**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T7)\n\n**Trump Windbag Warning Flag:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T9**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T9)\n\n**Trump Bombast Warning Flag:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T1**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T1)\n\n**Trump Jailbird Flag No. 1:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T2**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T2)\n\n**Trump Jailbird Flag No. 2:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T3**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T3)\n\n**Trump Jailbird Flag No. 3:**\n\n[**https://www.williambrahms.com/pages/massachusetts\\_state\\_flag.html#T4**](https://www.williambrahms.com/pages/massachusetts_state_flag.html#T4)", "label": 0}
{"text": "Kinda like Clintons n Obamas also with several photographs with Diddy & Epstein", "label": 0}
{"text": "I´m not American and I have no idea if Bernie Sanders is a good politician or not, but from everything I see about him I feel like he´s the president the US needed for a very long time, but it´s probably to late now sadly.....", "label": 0}
{"text": "Make America Gay Again?", "label": 0}
{"text": "Nothing. But Trump followers want everyone in America to be straight. So let's make it gay again!", "label": 0}
{"text": "Not just presidents. We need to vote out every single politician in congress. \n\nThey have all gotten complacent. They care about the reelection only. They all need to go, even the good ones", "label": 0}
{"text": "You lost? Russia is over there. ::points::", "label": 0}
{"text": "Россия без Путина.  Ответьте или проголосуйте за/против, если вы согласны.\n\n1989年天安门广场", "label": 0}
{"text": "There's two boxes after the ballot box, but we're only allowed to talk about one on Reddit, and it's compromised.", "label": 0}
{"text": "The Logan Act has never effectively been enforced, ever.   And now the whole FEC campaign-finance setup has been invalidated, such that it's worse than nothing.  It effectively doesn't exist for any purpose, except to block embezzlement of campaign funds.\n\nAlong with Musk, there are another half dozen dark-money billionaires, making Trump competitive by funding his whole campaign.   The world may go to hell next month.  Wait and see.", "label": 0}
{"text": "They executed the Rosenberg for far less. Security clearance should have been revoked long, long ago even if the Logan act is not enforceable.", "label": 0}
{"text": "Come on. If disabling an ally of the US and enabling an enemy of the US is not enough to revoke security clarearse and NATIONAL SECURITY contracts, WTH is security clearance for?\n\nAt that point are just being as obtuse as they are.", "label": 0}
{"text": "She’s repulsive as is her thug brother.", "label": 0}
{"text": "Replacing SpaceX and Starlink is not an easy thing to do.  Those products took many years and billions of dollars to get started,  And getting Musk out of the ownership-slot there is also very difficult.  I'm sure they're looking at it very closely.  They're also probably monitoring his communications with Russia.  He may be fully cooperating.   Stranger things have happened.   \n\nLife is unfair, especially when it comes to heavily-subsidized tech-billionaires.  I don't like it any more than you do.", "label": 0}
{"text": "You replace musk not spacex.", "label": 0}
{"text": "TIME IS WHAT YOU DO NOT HAVE. There's a coordinated effort by Israel, Iran, Rusia, China, NK, to isolate the US and implant puppets that will destroy the US from inside. This has been known for decades, and even in the \"Stop Trump Spam\" subredit pretend like you have time. The US is truly F'd.", "label": 0}
{"text": "##No puppet. **No puppet. You're the puppet!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EnoughTrumpSpam) if you have any questions or concerns.*", "label": 0}
{"text": "They’re also a party to fascism", "label": 0}
{"text": "Yes she still wants to destroy public education in America.", "label": 0}
{"text": "FBDV", "label": 0}
{"text": "Damn it Dan. How greedy can you be!!!", "label": 0}
{"text": "Think of your family, Dan.", "label": 0}
{"text": "Dan. Donate the 5 cents. It will cost him a buck.", "label": 0}
{"text": "I send a donation to Harris every time JD Vance pisses me off with emails (because I am somehow subscribed to every Trump mailing list). \n\nHe sent one today with the subject “It pisses me off.” \n\nSo Harris got another $10.", "label": 0}
{"text": "No.", "label": 0}
{"text": "I wonder if they just coded a bunch of random responses because all of these are hilarious lol.", "label": 0}
{"text": "I told mine to fuck off, they immediately informed me I was off their texting list. I should.of been last election when I said the same thing.", "label": 0}
{"text": "those guys are awesome", "label": 0}
{"text": "If he pulls off the upset, get ready for Vance and God help us all.", "label": 0}
{"text": "No", "label": 0}
{"text": "Fake button 😒", "label": 0}
{"text": "https://en.wikipedia.org/wiki/Protection_racket", "label": 0}
{"text": "Sending a $1,000 donation to billionaire so he can get hundreds of millions from your government and foreign governments is the height of insanity. ", "label": 0}
{"text": "Just out of curiosity where are you from? Is it illegal for politicians to solicit donations? Because if so, I’m very jealous lol.", "label": 0}
{"text": "The FEC agrees, but says it can’t do anything to stop this unless Congress passes a law. That’s probably never happening unless Democrats have majorities in both chambers, or somehow push it through as a compromise. I highly doubt the latter would happen since the GOP is **much** guiltier of using this tactic, given the head of their party is a massive grifter.", "label": 0}
{"text": "\"Trump is not happy you have not donated to him\"\n\nGood. He doesn't deserve to be happy.", "label": 0}
{"text": "Switzerland\n\nIt's not illegal, but regulated and transparent.\n\nhttps://www.ch.ch/en/political-system/political-parties/financing-of-political-parties/", "label": 0}
{"text": "This bitch needs to go away.", "label": 0}
{"text": "In Spain the financing of political parties is very regulated, including private donations. For example, companies have a limit (10k€ I think) for how much they can donate per campaign. \n\nI think that if one political party messaged Spanish citizens to ask for money there would be a big scandal.", "label": 0}
{"text": "They'll just stash Trump away somewhere, tell him it's the Oval, and the tech bros/VCs will be calling the shots through Vance.", "label": 0}
{"text": "Honestly badass glad I voted for this man", "label": 0}
{"text": "I want you to know that being called useful as trump is a complement to me. So I’m gonna turn my frown upside down. I love you too.", "label": 0}
{"text": "Trump was useful \n\nHe let millions of Americans die from a highly contagious disease but I got paid to sit at home \n\nSo yeah let's go #Trump2024 \n\nI'll take that government money known as socialism to sit at home doing nothing to actually make America great again", "label": 0}
{"text": "Message me a pic of your boobs", "label": 0}
{"text": "Everywhere except for the US has sane election campaign laws", "label": 0}
{"text": "You're thinking of Pinocchio \n\nA Man/Boy wanting to be real \n\nA Democrat an Independent A Republican \n\nAnything... a fast food worker a garbage man a President \n\n\nLove me daddy\n\n LOVE ME!!!", "label": 0}
{"text": "I did if Trump can do that again I'll vote for him \n\nElon needs to send me a $100,000 check before election day", "label": 0}
{"text": "How embarrassing. ", "label": 0}
{"text": "So?", "label": 0}
{"text": "Would you rather I have not voted", "label": 0}
{"text": "I think he was giving out a hundred or so bucks to voters in Pennsylvania or something. I’d have voted for Biden for $100.", "label": 0}
{"text": "Aren't garbage man and burger flipper the jobs patents and teachers threatened kids with if they didn't study and get good grades?\n\nMaybe old Donny wants to cosplay a ditch digger next.", "label": 0}
{"text": "Even excluding all the election scamming, the dude was found liable for sexual abuse. And you votes for him. That's sad man.", "label": 0}
{"text": "I honestly can't believe this election is even close, given the sheer number of things Trump has done. So I made an anti Trump metal song, if you like metal, you can hear it here: https://youtu.be/L_zjemKeNDg?si=VGYTCBKMdW3qSqxO the YouTube algorithm is actively supressing this song, so if you like it share it with others that might enjoy it.", "label": 0}
{"text": "Get out and vote, flush the orange turd.I honestly can't believe this election is even close, given the sheer number of things Trump has done. So I made an anti Trump metal song, if you like metal, you can hear it here: https://youtu.be/L_zjemKeNDg?si=VGYTCBKMdW3qSqxO the YouTube algorithm is actively supressing this song, so if you like it share it with others that might enjoy it.", "label": 0}
{"text": "There was a German guy a few years ago that said He Alone could fix Germany.  \n\nIt didn't work out so well that time.  Let's get off this timeline.", "label": 0}
{"text": ">Many people are asking how I can do it all.\n>First McDonald's now garbage man.\n\nAre people really asking \"how could Trump manage two different photo ops in two weeks?\"\n\nDo people actually think he pulled full eight hour shifts?", "label": 0}
{"text": "He's been cosplaying as a billionaire for about 40 years now.", "label": 0}
{"text": "Yes, unironically yes.", "label": 0}
{"text": "I know, right? before Trump, if any politician had done a single one of the thousands of things Trump has done and said, their political career would be over... now, not only does he get away with it, there is a whole group of them that feel empowered now, to just be their worst possible selves.", "label": 0}
{"text": "Well I reiterate I’m jealous lol", "label": 0}
{"text": "Voter intimidation is very much illegal.", "label": 0}
{"text": "This can’t be rea- and it’s real. The former president attacking a private citizen by calling him a baby less than a week before the election.\n\nConservatives, this is your man?", "label": 0}
{"text": "Cuban didn’t declare bankruptcy 6 times.", "label": 0}
{"text": "🍄 vs 🍆", "label": 0}
{"text": "This feels like something you'd see in North Korea - he must've gotten the idea from his best bud little rocket man", "label": 0}
{"text": "No flight data on arrival, only departure.", "label": 0}
{"text": "data is wrong, simple as that\n\n[adsbexchange](https://globe.adsbexchange.com/?icao=aa3410) has a flight from Las Vegas to Phoenix, which makes sense, since the last flight was to Las Vegas.\n\nAlso: flight time Las Vegas → Dubai: >16h, Dubai → London: >8h, total >24h", "label": 0}
{"text": "Morally and financially bankrupt", "label": 0}
{"text": "It won’t make the news and his followers will only laugh at it and double down.     It’s a cult.", "label": 0}
{"text": "You must have missed where Trump said Liz Cheney should be shot at and then described a firing squad being the ones doing it.\n\nThis rant isn't even the most horrible one he went on in the last 24 hrs", "label": 0}
{"text": "Sentencing in NY is Nov 11th. \n[Third one down ](https://celebrityprivatejettracker.com/#gref)\n\n ￼\n\n\nDonald Trump’s Boeing 757 (N757AF) departed from Al Maktoum International Airport (DWC), , and arrived in Luton Airport (LTN), a few hours ago.   384 flights tracked since 01/21/2023\n98% verified", "label": 0}
{"text": "He obviously was at a rally last night so I'm assuming it's a U Haul trip.", "label": 0}
{"text": "Cnn and NPR covered it at length", "label": 0}
{"text": "2 billion reasons why he's going to pressure the Federal Reserve chair to bring rates to zero just like he did last time (Federal reserve is supposed to be independent btw). This act, tariffs, and deportation of labor force would have a bigly effect on inflation, more than anyone has ever seen before. People on fixed incomes come up him with tears in their eyes and say you selfish prick you did all this to enrich yourself and pay your debts?  And he just tells them they're garbage and walks past, since he doesn't give a flying fuck about anything or anyone. ", "label": 0}
{"text": "Well that’s refreshing.", "label": 0}
{"text": "That was just a smart business move! /S", "label": 0}
{"text": "So you're saying that I'm closer to a billionaire than he is?", "label": 0}
{"text": "I’m not sure it is real, Tyrer whole thing remains on point and somewhat coherent, that is definitely not trumps style.", "label": 0}
{"text": "Nope. Because he’s a loser.", "label": 0}
{"text": "Trump’s so far across the line you’d need a telescope to see him", "label": 0}
{"text": "End of his campaign? Have you learned nothing? This piece of shit excuse for a human gets away with everrrrrryyyything.", "label": 0}
{"text": "You forgot sexually. Ain't no way Melania is fucking him.", "label": 0}
{"text": "Not accurate.  The original quote in context: \n\n“Let’s put her with a rifle standing there with nine barrels shooting at her, ok? Let’s see how she feels about it, you know, when the guns are trained on her face. You know, they’re all warhawks when they’re sitting in Washington in a nice building saying, ‘Oh, gee, let’s send 10,000 troops right into the mouth of the enemy.’”\n\nPretty clear he’s talking rhetorically about were willingness to put other people’s lives at risk. Still shitty talk from a shitty person and no one who should be close to the presidency. But the left gains nothing from making itself look unreasonable and kinda illiterate.", "label": 0}
{"text": "Logic has worked backwards since 2016. The more violently outrageous, vile and insane shit he spews, the more and more vile and angry maga bastards relate to him. His supporters also hate women, immigrants, lgbtq, and just people that aren't them.", "label": 0}
{"text": "\"bUt it's REEETORICAL\" JFC, didn't take long to find the first apologists.", "label": 0}
{"text": "Trump's creditors are counting on a big ROI if he wins.", "label": 0}
{"text": "How is he running as a convicted felon? That shit is crazier.", "label": 0}
{"text": "I never understood why MAGA and anyone who votes for him could possibly think he's great for the economy.  Dude is basically a bankruptcy waiting to happen.  His most successful business venture to was to lie and insult people to encourage his base of supporters to buy his stock and MAGA paraphernalia.", "label": 0}
{"text": "Call it whatever you like, but it’s definitely not threatening her with execution via firing squad.", "label": 0}
{"text": "All the anxiety I have over the election is solely because of SCOTUS. I do not trust those six at all.", "label": 0}
{"text": "And if he loses and Harris becomes president, then what? Does Putin send his goons after Trump or what?", "label": 0}
{"text": "They will give it to him if they have the slightest pretense to do so.   They did it in 2000, and they feel entitled to do it.  I had thought that Roberts was not a zealot, but I think he's let go of his more moderate tendencies, and now he can get outvoted.   I'm very concerned about it.", "label": 0}
{"text": "So if he files for bankruptcy a 7th time, what debt goes away?", "label": 0}
{"text": "Ngl it terrifies me.", "label": 0}
{"text": "Pray the age of psuedo-intellectualism is gasping it's last breathe.", "label": 0}
{"text": "Yup", "label": 0}
{"text": "If Trump were to murder her himself, the GOP would defend him and still run him and the republican voters would still vote for him.\n\nMAGA is that depraved.", "label": 0}
{"text": "That’s the only way he qualifies as a “billionaire.”", "label": 0}
{"text": "We all get a good nights sleep", "label": 0}
{"text": "He's going to whine like a little bitch, shit his pants, and all his cult followers are going to freak the fuck out.", "label": 0}
{"text": "I sure hope so. This is so exhausting", "label": 0}
{"text": "That's the wrong question, this is:  How do we deal with the fact that half the voters in this country can support someone who is such a piece of shit? They will still be here after the election.", "label": 0}
{"text": "Same as last time. Then once more four years from now. Repeat until he dies.", "label": 0}
{"text": "If it's a landslide victory it will push the Republican Party far back to rethink their messaging and motives and even who they align themselves with.\n\n\nIf it's a soft win, we'll be battling it again next election.", "label": 0}
{"text": "Where the hell have you been the last nine years? Shit has not been okay, bub. You think the maga cast of characters and the cult following it just goes away after a Harris victory? That can of worms is open. This is how politics are now until the next major shift. JD Vance will be positioning himself to take the lead and more Project 25-kinda bs.", "label": 0}
{"text": "Unfortunately", "label": 0}
{"text": "I so despise that pos, I’m voting straight party democrat. I’m a life long republican, and I’ve never voted straight party. I could never understand why anyone would until now. I want nothing to do with anyone affiliated with that pos. FYI, I voted for Obama & both Clinton’s.", "label": 0}
{"text": "I really do think optimistically. I miss the old struggles of trying to find a balanced budget, paying down of the debt, making social security solvent, having some sort of international presence. Let’s have a good debate. I feel like the choice is between the end of a republic and the birth of a dictatorship and erosion of a democracy with a separation of powers. I used to think it was naive to frame every election as the most important election. But I feel it this time.", "label": 0}
{"text": "My hope is that voter turnout skyrockets massively and shows that 'half' is more like 15%, and people were just lazy in voting.", "label": 0}
{"text": "The lack of any critical thinking on their part is infuriating", "label": 0}
{"text": "The nightmare ends and all the world - not only America - will heave a deep sigh of relief", "label": 0}
{"text": "Yes, this. Let's go back to arguing over what the marginal tax rates should be instead of whether or not the President should be a king, but only if he's a Republican.", "label": 0}
{"text": "After stop the steal 2.0", "label": 0}
{"text": "It's going to be more than half. Part of the whole thing is that they're already geared up claim the election was rigged, and they're planning another half assed coup to overturn and install him as President.", "label": 0}
{"text": "This is good but calling yourself a life long Republican gives a lot of credit if you were voting blue in the 90s and 2000s and 2010s. I only mean most people who identify as Republican are going to be less open to compromise than you.", "label": 0}
{"text": "When is the next major shift? Asking for a country.", "label": 0}
{"text": "Over 2 billion. Jared Kushner also threatened Qatar with economic sanctions that mysteriously went away when the Qatar Sovereign Wealth Fund bailed him out of 666 Fifth Avenue. \n\n[https://www.justsecurity.org/69094/timeline-on-jared-kushner-qatar-666-fifth-avenue-and-white-house-policy/](https://www.justsecurity.org/69094/timeline-on-jared-kushner-qatar-666-fifth-avenue-and-white-house-policy/)", "label": 0}
{"text": "I would love nothing more than Harris win and the maga try another Jan 6th.  This time Biden and Harris will have national guard and more than enough safety measures, plus Biden won’t allow Trump to have a hate rally in DC the same day.", "label": 0}
{"text": "if he wins, he wont be. vote. please vote.", "label": 0}
{"text": "Definitely.\n\nIf harris wins parlimentary hill will be on lockdown that day. They wont even see the capitol", "label": 0}
{"text": "If that SOB wins this thing, then I will be very, very unhappy.", "label": 0}
{"text": "Every time I tell them to get fucked with a razor dildo and never once been told I've been unsubscribed. 😂🤷‍♂️", "label": 0}
{"text": "I bought a Trump tie at an outlet mall like 20 years ago… seemed like a luxury item that was on clearance so I bought it, and it always seemed like a good quality tie.\n\nOther than that and The Apprentice, which I watched a few episodes of the celebrity version, I knew nothing and likely would have never looked into it.\n\nThen he kept talking about Obama and was exposed as a fraud and an idiot and a racist and a rapist, etc.\n\nHad he just faded into obscurity I don’t think anyone would have ever looked into who he really was.", "label": 0}
{"text": "I lived in NYC in the eighties.  Trump seemed like a self-promoting used car salesman.   There were plenty of those in the big apple back then.", "label": 0}
{"text": "Trump was a joke who thought he was a demigod. The apprentice repackaged his as successful. Mark burnett should be banned from the country.", "label": 0}
{"text": "I grew up in the late 70s early 80s and read Art of the Deal. He was approximately like Mark Cuban is today, in my kid imagination at the time.  A business dude who had turned to self promotion.", "label": 0}
{"text": "Always in the papers. Regularly on TV. Annoying. Steady string of failures in. Haines never got him to go away. \n\nI remember hearing that his casino needed to make $1M/day (back when that was a lot of money) and to me that seemed ridiculous,like who ever thought that was a good idea.", "label": 0}
{"text": "IMO the media glommed onto to him when that tower went up in NYC. This was about the time cable TV was coming up and all sorts of new shows were being created. Lifestyles of the Rich and Famous comes to mind as well as other shows like that that completely focused on celebrities and the opulent lives they led. Celeb mags filled the racks at every checkout lane at every grocery store. And trump was all over all of these shows and magazines. He was really  being carted out and showcased because of his rich status and what an incredible business man he must be. He had a beautiful foreign wife, was pictured at all the parties from NY to Hollywood. Talk shows had him on all the time. It/he was quite the spectacle. \nHe was into everything especially marketing his brand- from steaks to education (trump university). It was nuts. \nHe was into WWF and beauty pageants and casinos. \nAnd the media followed him throughout all. We now know how much he was in  cahoots with the owners of those media outlets. They kept him on the front pages and in the headlines and in our faces. All the effing time. \nI think he just wanted to be one of the cool kids at the Hollywood parties but they sort of rejected him. The smart ones anyway. And it pissed him off.\n\nEvery now and then a story would come out about him screwing a contractor but nothing ever stuck to bring him down and get him out of the limelight. \nIdk I think it’s all been an act and all the stories about him being a phony and everything his niece says about him is true. \nThe facts are there that he has never done any for others.  It’s all been just about him.", "label": 0}
{"text": "All of the newspapers, not just the tabloids.", "label": 0}
{"text": "But he definitely has outtakes that should have been released in 2016. Would have been a much nicer last 8 years.", "label": 0}
{"text": "Back then he seemed like a 5 out of 10 on the scuzz-meter.   Today he is a perfect 10.", "label": 0}
{"text": "Is he a Trump / MAGA supporter?  If so I take it back.  To hell with him.", "label": 0}
{"text": "He was hated the world over for trying to get out of debts and not paying for contractors.", "label": 0}
{"text": "I grew up in the '80s and '90s, so a little bit later. From my recollection, he was always sort of a joke - gaudy and uncultured.\n\n\nHe was the golden toilet guy in my mind. Sort of the stereotypical poor man's idea of a rich person.", "label": 0}
{"text": "Except Cuban is … legit? And not a nepo baby? And thoughtful and articulate (despite his issues)? This is a pretty nonsense comparison.", "label": 0}
{"text": "He destroyed the USFL because he insisted on competing in the fall with the NFL and then bankrupted the league with litigation. \n\nAs an older person this would be like me telling you Jack Doherty will be president in 2048.", "label": 0}
{"text": "He’s been a clown his whole adult life", "label": 0}
{"text": "I’m on the West Coast so we weren’t exposed to him quite as much as New Yorkers, but I remember seeing interviews with him the 80s. I feel like most people thought he was a douche. A used car sales man, all flash and bs with no substance.", "label": 0}
{"text": "There are credible reports that there are tapes of Trump using the n-word on the Apprentice set (as a slur, not just saying it out loud while telling people not to say it or something). Burnett is sitting on them for some bullshit contractual reasons or something, but basically fuck him. If he's not explicitly supporting Trump, he's implicitly supporting him, and that's bad enough.", "label": 0}
{"text": "One of the Back to the Future movies in the 80s had a character based on Trump as the President of a horrible dystopian alternate future. So that pretty well shows what a punchline he was at the time.", "label": 0}
{"text": "You forgot the silver spoon factor.", "label": 0}
{"text": "I was a British child in the 80s and I remember him being considered a bit of a joke here. Especially his hair, even then.", "label": 0}
{"text": "Never been to New York: He was a POS across the country.", "label": 0}
{"text": "I grew up in his neighborhood. Ok I was across the boulevard in the adjacent neighborhood of Hollis. But all my life this clown has been over me and all around me. He was always a joke. My father always hated him and made fun of him since the early 80s", "label": 0}
{"text": "A *Golden Girls* episode made fun of him in 1992", "label": 0}
{"text": "Yes, he was considered like an exaggeration of a rich person, kind of in a fun way. He was considered an immortal person and someone you just might see around the city. He was constantly in the news for doing something wrong. Not paying bills, mob ties, casino and land issues, adultery, etc. He ran as a Democrat for years, but no one took him seriously.  He's great at taking advantage of people.", "label": 0}
{"text": "he seemed like a self promoting jerk grifter. \n\nwhich is what he is.\n\nhe was laughed at even then.", "label": 0}
{"text": "Possibly accurate readings. I think it’s possible that getting into politics worsened him", "label": 0}
{"text": "Murphy Brown made a joke about removing the first 'T' from \"Trump Tower\".  Also early 90's.\n\nhttps://www.youtube.com/watch?v=7Gcx1G2M0-g", "label": 0}
{"text": "Growing up in the 80's and 90's watching lots of late-nite comedy, Trump was the butt of a lot of jokes. He was a caricature even then, but a more benign form of charming business bullshit egotist. Then Celebrity Apprentice came on and a lot of people apparently took a reality TV as built upon a golden temple of fact and integrity. Would watch it with friends sometimes, but as a jokey \"can you believe this mfer?\"\n\nAnyway, it boggles the mind that so many voters just want the love of their traumatizing father figure.", "label": 0}
{"text": "Hollis, Queens? Did your mama ever cook collard greens around Christmas time? Are you secretly Run, DMC, or Jam Master J?", "label": 0}
{"text": "He was an asshole then too. Shit, I bet he was an asshole in kindergarten.", "label": 0}
{"text": "Donald Trump spent 1982-1985 feeling *super* great, thanks to the diet pills his doctor freely prescribed:\n\n“The first thing I would do when I got to the office in the morning,” recalled one former vice-president, “was to go see Norma Foerderer and ask her, ‘Is this a Dr. Greenberg day?’ If she said yes, I would do everything I could to stay out of Donald’s way.”\n\nhttps://www.gawkerarchives.com/the-best-theory-of-1992-donald-trump-took-amphetamine-1755299885", "label": 0}
{"text": "From what I remember. He was a celebirity even then. Trump Tower and redevolpment of the Hyatt next to GCT were a big deal. The Wollman Rink in Central Park had been stuck in renovation hell for years before he tweaked Mayor Koch's nose, took over the project and finished it in months. \n\nThe jokes came after his divorce, bankruptices and shopping at K-Mart with sexond wife Marla Maples, coverage which he probably arranged.", "label": 0}
{"text": "They even joked about him being lame on “The Office” in the mid ‘00s.", "label": 0}
{"text": "In the 80’s, what we would consider acting like a douchebag today, was considered cool.", "label": 0}
{"text": "Not really. Maybe by other douchebags.", "label": 0}
{"text": "[http://imgur.com/yoeQP.gif](http://imgur.com/yoeQP.gif)", "label": 0}
{"text": "Wall Street, Ronald Reagan, James Spader", "label": 0}
{"text": "Thing is its not gonna be over.\n\nThose fuckers will flip everything on its head", "label": 0}
{"text": "I lived in Vegas a s a kid and I remember Jim’s as a joke and a conman going all the way back. His deals for the hotels and all the scandal was all I could remember about him. There was never news that made me think he’d ever be someone to trust or buddy up with.", "label": 0}
{"text": "So, Run and his brother Russel who started Def Jam moved onto my block (Whitehall Terrace) when I just started high school. Run DMC wrote the song Christmas in Hollis back then and when he mentions seeing Santa at the park after dark, he was probably referring to the small playground and handball courts of my local playground on Hillside avenue. So small there wasn’t a single tree or plant on the grounds. This park was just one short block in front of his house. \n\nOne time when I was in 11th grade, I was walking to the store in a light snow storm and Run pulled out of his house in his early ‘80s 5-series BMW and attempted to drive up Francis Lewis Blvd. He got about 5 feet before spinning sideways. I was younger than him but I was a car guy and I explained that a light rear wheel drive car with wide tires needs snow tires or at least all season tires to go up even a slight hill. But I pushed his car as he tried to drive again and he gained enough momentum to make it up the hill. I always wondered if he ever made it back home without crashing.", "label": 0}
{"text": "0 chance that changes anyone’s vote. The list of things that should’ve ended him politically is truly endless.", "label": 0}
{"text": "Grew up in NYC in the 80s and 90s. I remember as the 2016 Republican primary was progressing that it suddenly dawned on me that the rest of the country didn’t realize he was actually a literal joke. They believed all The Apprentice hype whereas I think most of us who were familiar with him before smelled the BS from a mile away.", "label": 0}
{"text": "I wasn't expecting anything in response to my dumb comment. I couldn't be more delighted about your reply. Thank you for sharing these little stories.", "label": 0}
{"text": "I think he was mostly hated in NYC. Outside of the area, he just seemed like a rich braggart..", "label": 0}
{"text": "Never _ever_ taken seriously", "label": 0}
{"text": "he never had credibility. he had media exposure. he failed at so many things.", "label": 0}
{"text": "I graduated from high school in NY in 1984. Trump at the time was considered a buffoon and a blowhard. There was a columnist in NY named Jimmy Breslin who wrote about Trump as the snake oil salesman he was. There was also a magazine called SPY Magazine. This was published by [Graydon Carter](https://www.vanityfair.com/news/2016/10/graydon-carter-on-donald-trump?srsltid=AfmBOop4waCZp3Z0aiVz_vdirAC-u8BDSRnCs68cb4SfoF2sa7hZM4rK). They wrote about what a buffoon Trump was and would prank him like sending him ever smaller checks to see if he would cash them. Trump cashed a 13 cent check. SPY called Trump a short fingered vulgarian, this is where the tiny hand thing comes from. Technically he does not have tiny hands, he has short fingers. But Trump is such an idiot he did not get the insult. I vulgarian is defined as *a vulgar person, especially one whose vulgarity is the more conspicuous because of wealth, prominence, or pretensions to good breeding.* By the 90s, Trump had bankrupted his casinos as well as an airline. He sued the NFL and ended up with $3.76 and caused the USFL to fail. No one took him seriously, especially not New Yorkers. He put his name on everything. Steaks, water, vodka, a mortgage company, a real estate school. All of them failed. The school had to pay $25 million because they were found to be ripping people off. \n\nI served in the US Navy and when I got out in 1995 I moved to Florida. Every once in a while I would have to deal with someone who hated me because I was from New York. Trump represents everything people in rural areas hate. He never worked a hard day in his life, he had everything handed to him and he fucked it up. In his adult life he woke up every day in a golden palace in the sky. Yet somehow Cletus in the single wide thinks Trump cares about him. Trump is a poor mans idea of a rich man, a stupid mans idea of a smart man, and a weak mans idea of a strong man. \n\nIf you really sit down and listen to Trump and all of his complaints, he sounds like an emo teenage girl.", "label": 0}
{"text": "If you have to tell people you’re smart, you aren’t.\n\nIf you have to show off you’re rich, you aren’t.\n\nIf you have to tell people how nice you are, you aren’t.\n\nIf you have to tell people you are famous, you aren’t.\n\nAnyone who falls into one of those categories doesn’t need to broadcast it. They just are those things.", "label": 0}
{"text": "and be too chicken shit to drink it himself", "label": 0}
{"text": "not accurate. always a joke", "label": 0}
{"text": "As my grandmother said back in 1989 when seeing Trump on TV after the helicopter crash that killed his casino management team: “That boy has always been an embarrassment.”", "label": 0}
{"text": "[https://www.politico.com/magazine/story/2018/06/29/trump-robert-moses-new-york-television-city-urban-development-1980s-218836/](https://www.politico.com/magazine/story/2018/06/29/trump-robert-moses-new-york-television-city-urban-development-1980s-218836/)", "label": 0}
{"text": "He screwed over Atlantic City Biggly.\n\n[https://www.theguardian.com/artanddesign/2019/apr/08/atlantic-city-trump-ghost-town-gambling-brian-rose-photographer](https://www.theguardian.com/artanddesign/2019/apr/08/atlantic-city-trump-ghost-town-gambling-brian-rose-photographer)", "label": 0}
{"text": "Growing up in the south in the 80’s he just seemed like some kind of caricature of a successful businessman. As I got older I just saw him as a sleazy grifter, hawking whatever he could put his name on for a buck. My opinion of him has not improved with time.", "label": 0}
{"text": "Cuban at least knows he got lucky when Yahoo paid him more than his company was worth.", "label": 0}
{"text": "\"Short-fingered vulgarian\" Loved that magazine.", "label": 0}
{"text": "Mark Burnett, and the resulting 'reality TV boom' did as much damage to society as social media, I'm sure of it.\n\nAnd it only exists, as usual, because corporations were too fuckin greedy to actually pay writers a living wage, so they struck. \n\nAnd rather than pay people for their work, they went with \"unscripted\" bullshit, spawning survivor and apprentice and all that other terrible garbage.", "label": 0}
{"text": "My neighbor a few doors down is Ukranian/Polish and had a neighborhood drive to support families in Ukraine last year... Last week a Trump sign appeared in her yard...I'm completely stupified by it.", "label": 0}
{"text": "$39 a night is actually decent for a hotel that nice in that area, even then.", "label": 0}
{"text": "Rich racist asshole back then.", "label": 0}
{"text": "It’s actually $78 minimum since it’s priced “per person, per night, double occupancy”. Semi-misleading advertising, kind of like a used car saleman lol", "label": 0}
{"text": "In fact, I would argue that Survivor season 1 succeeding led to the Trump presidency:\nhttps://www.reddit.com/r/survivor/s/W0EozZ4FtU", "label": 0}
{"text": "Just curious; why do you use so many spaces betwixt sentences?", "label": 0}
{"text": "I was a kid in NY in the 90s and my dad was a banker. The only thing I remember him saying about trump was that he was a crook and his bank wouldn’t deal w him.", "label": 0}
{"text": "Kinda like his presidency", "label": 0}
{"text": "Shit, it's possible, however, seeing what a tenacious ass bug Mark Burnett is, he may have figured out other ways to fuck us.", "label": 0}
{"text": "Go watch his Larry King interviews in the 80’s and 90’s. Totally different guy. Damn near likable?", "label": 0}
{"text": "I grew up in CT in the 80’s and 90’s. I lived in northern CT, but we still knew he was a buffoon. He wasn’t accepted by the wealthy in NYC cause he was so tacky and low class. I’m not saying the ultra-wealthy in NYC are good people, but they knew what he was, and it’s driven him crazy his entire life. Not sure if you’ve noticed, but he can never let go of anyone ever looks down on or speaks ill of him. Anyway, we all knew what a fraud he was and couldn’t believe that The Apprentice made other parts of the country think he was some business genius. \n\nAs an aside, Kurt Andersen was a co-creator of Spy Magazine, a satirical mag in the 80’s/early 90’s. They sent checks to a bunch of ultra-wealthy New Yorkers that were written for like $1 or less…my recollection might not be completely accurate, but I’m doing this from what I remember…too lazy to google it. Anyway, the only person who cashed the check was Trump. I think it was for like $0.37 or some shit. One of the writers also mentioned how small Trump’s hands were and would occasionally receive letters from Trump with his hand outlined trying to prove they weren’t small. This went on for years, which is totally on brand for that man baby. \n\nhttps://www.motherjones.com/politics/2020/08/trump-files-spy-magazine-prank/\n\nEdit: after reading the above article I linked, it started with $1.11 checks, then they sent more checks to the ones who cashed the checks, working down to $0.13 checks. Two people cashed them: Trump and an arms dealer.", "label": 0}
{"text": "He was on the cover of people magazine. Didn’t care.", "label": 0}
{"text": "I followed Trump news in the 80's because I find grifters interesting. Hell, you want to see pré-politics trump you can Google search but set the date pre-2010,then read the news. It's been sandblast er a lot but it's still interesting, seeing how the... Narrative was adjusted.\n\nHe was a grifters who self promoted, failed at a lot of business stuff but managed to keep his head above water by sheer blather. Not actually \"above water\" but people kept bankrolling him while he peddle bs even then. It was... Kind of pitiful/sad how dumb banks can be.", "label": 0}
{"text": "There was a length saga in the comic strip Bloom County about Donald Trump's brain being put into Bill the Cat's body. He was an icon of sleezy 80s excess.", "label": 0}
{"text": "Remember when Berkeley Breathed in \"Bloom County\" always made fun of Trump and Ivana? That's where I first learned about him.", "label": 0}
{"text": "I also have thought of Biff Tannen. I was a European teenager when the film came out and I didn't know anything about Trump.\n\nOver the years, I've realized how much they have in common.", "label": 0}
{"text": "He was a clown who thought people respected him but everyone really just thought he was an annoying semi-successful businessman (I am being very generous there) who was for some reason or another was always in the tabloids", "label": 0}
{"text": "This is so embarrassing for our country 🥲", "label": 0}
{"text": "I was a kid, but I remember him being the butt of jokes on late night talk shows my older siblings watched, especially his hair. Rich but not respected.", "label": 0}
{"text": "I was a kid in the 80s and remember him being a sleazy, corrupt businessman in the 80s. I don't think anyone thought he was a good person.", "label": 0}
{"text": "There’s a sucker born every minute.", "label": 0}
{"text": "I also lived in NYC and at times was in the same sphere.  He was a buffoon and known for forcing himself on women.  \n\n\nRecently I saw a rerun of an old sitcom called empty nest period in this episode. One of the daughters is planning to move to New York City from Miami. the other sister gives her a going away gift -  a rape whistle and says it's in case she runs into donald trump while in new york.  I am guessing the show originated in the early eighties. That's the reputation that donald trump had back then. Admittedly my jaw fell to the ground when I saw this on t v now.", "label": 0}
{"text": "He wanted to be accepted into New York City’s society circles - the old money elite. But to them he was (is) a gaudy, flashy joke of “new money” - saddled in debt and bankruptcies.\n\nI think some of his issues come from not being accepted. First with his father then society wealth, and those he wanted as peers. He desperately wanted to be a major sports team owner, but he screwed that up as well. \n\nWith his insecurities, incredibly fragile ego and mounting debts - by the 1980’s he was an easy target for Russian flattery and money.", "label": 0}
{"text": "And it’s no coincidence (and with his total\nlack of subtlety) that that ad came out immediately after he and his fist wife Ivana came back from being wined and dined in Russia.", "label": 0}
{"text": "Growing up in NJ in the 80s I was blown away that anyone would think he was a good businessman.  I'm not sure where I absorbed the information from, but Trump was never someone to be impressed by.  He was always a joke, and a little bitch who used the courts and bankruptcy to screw over thousands of people.", "label": 0}
{"text": "I always thought survivor would’ve been so much better without Hatch winning that first season. I did not put that much thought into it but damn. I hate this timeline.", "label": 0}
{"text": "I think we have to stop thinking about it as *changing* people’s vote, and hope that it angers enough people to get out and vote. Obviously it could have the opposite effect, but I do think more people voting, the better.", "label": 0}
{"text": "exactly!", "label": 0}
{"text": "El o also runs a vote lottery for Trump. This MUST GET HIM LIFE IN PRISON BEFORE DEMOCRACY GETS IT!", "label": 0}
{"text": "YOU MATTER\n\nunless you multiply yourself by the speed of light squared, then\n\nYOU ENERGY", "label": 0}
{"text": "Trump was always viewed as joke. There are old MadTV comics that make fun of him for constantly going bankrupt while claiming to be a great businessman. \n\nHe was never accepted into nyc high society. He was always viewed as a scummy guy who bought access due to his money. No one ever liked him but they put up with him because of the money", "label": 0}
{"text": "Remember when he wanted to buy the Buffalo Bills? The other owners laughed him out of negotiations.", "label": 0}
{"text": "During high school, my friends and I saw him as the image of the successful businessman.  We didn't know anything about his personal life or views.", "label": 0}
{"text": "That’s as clear as I can make it.", "label": 0}
{"text": "He was taken very seriously in the 80’s and well into the 2000’s. The left used to love the guy. I remember him going on Letterman and criticising Bush Jr. during the Iraq War, and the left leaning crowd erupted in applause.", "label": 0}
{"text": "I think this is inconsiderate to used car salesmen. At least they’re not trying to completely scam you", "label": 0}
{"text": "yes he was always considerated a joke nepobaby. Just losing daddies money as a business", "label": 0}
{"text": "Huh, well, I guess he won't flee there then.", "label": 0}
{"text": "That's a strange thing.  Trump hates Latin America and calls everyone there garbage.. so it's weird that they'd take him as their leader.", "label": 0}
{"text": "Fuck off bot", "label": 0}
{"text": "He’s worse. X 10,000.", "label": 0}
{"text": "Leave Electric Light Orchestra out of this.", "label": 0}
{"text": "I remember the first time i saw him interviewed on tv in the 80s. I could instantly tell he was a self absorbed grifter", "label": 0}
{"text": "What the fuck :(", "label": 0}
{"text": "Just wow. American ugliness and ignorance is out of control with these Nazis.", "label": 0}
{"text": "From what I recall it was a stalled multi year project, Trump finished it pretty quickly.", "label": 0}
{"text": "Yep - and people who don’t vote for Kamala or don’t vote at all at inviting this to happen.", "label": 0}
{"text": "This graphic is a mess. I mean, I agree, but holy shit, take a few minutes to look it over, please.", "label": 0}
{"text": "You're known by the company you keep, or in this case, but the voters who support you.", "label": 0}
{"text": "Ignorance knows no bounds.", "label": 0}
{"text": "The was issues with finishing it. It was a skating rink It is not that big of a project. It was almost finished finally when he took over.", "label": 0}
{"text": "They’re literally Nazis", "label": 0}
{"text": "And the coward couldn’t even identify themselves. Talk about a vile piece of trash…\n\nSorry your sweet mom received that. People who are willing to sacrifice society for some extremist religious ideals are why we can’t have nice things like healthcare, rights, and environmental regulations.", "label": 0}
{"text": "And these shitbags will still screech when people call them racists and Nazis.", "label": 0}
{"text": "This is radicalization plain and simple. What a fucking nutjob.", "label": 0}
{"text": "I should've  finished that statement. After realizing what sort of narcissist Trump was, I picked Ed Merv", "label": 0}
{"text": "Gross. What a horrible person. Whoever wrote that should be ashamed of themselves. This is exactly the reason they are getting so much hate themselves", "label": 0}
{"text": "MAGA is full of the same people you see fighting at professional sporting events. The MAGA movement has given these people a sense of an underdog team camaraderie but now they feel like they can actually effect the win. And since this isn't just a game now to them they feel entitled to actually fight over their political position like they do for their teams but now it's a real life, 24/7 game time, game 7, OT situation and anything goes, just get the win. \n\nBasically just the worst society has to offer. The only difference between them is money. Strip them all down to nothing and they would all act the same.", "label": 0}
{"text": "Indeed. Just to have drunk the orange koolaid.", "label": 0}
{"text": "I'm so sorry, we have gone down a horrible track, but I hope we can back the train up.", "label": 0}
{"text": "As a Peruvian, I disapprove this message", "label": 0}
{"text": "Yeah, exactly. “Vermin” is about as bad as it gets. \n\nhttps://www.npr.org/2023/11/17/1213746885/trump-vermin-hitler-immigration-authoritarian-republican-primary", "label": 0}
{"text": "How many of these people know what a Marxist is?", "label": 0}
{"text": "Only one misspelled word.  Impressive.", "label": 0}
{"text": "My old boss was Jewish and wrote a persnickety letter to the Greensboro News & Record about the appalling driving ability of Greensboro residents during icy weather, and the next day he had a nasty gram under his windshield wiper from the KKK. \n\nIt’s almost as if the News & Record has KKK members on Staff who feed their terror enforcer arm with names and addresses of people to terrorize.", "label": 0}
{"text": "he was not doing the over the top hand movements and voice that comedians do\n\na very subtle performance when compared to some of the other comedic imitations.", "label": 0}
{"text": "I think he is pretty good as Trump from the clips I have seen. It's how I would imagine Trump behind closed doors, he still does that pouty thing with his mouth which is funny", "label": 0}
{"text": "We finally get a young blond Sebastian Stan in a movie and it's not Luke Skywalker it's DJT. I am not enjoying this timeline lately.", "label": 0}
{"text": "If they've drunk the orange koolaid, they are Nazis.", "label": 0}
{"text": "I certainly hope the grandma contacted the postal inspector, they would find the sender and give them what they deserve.", "label": 0}
{"text": "This was written by a student.  Only they would double space handwriting", "label": 0}
{"text": "I would genuinely love for the world to put all MAGAts on a permanent no-fly list. None of MAGA fools would even condemn that letter…", "label": 0}
{"text": "Can we discuss this in a few days?", "label": 0}
{"text": "Agreed.  I'm too afraid of that monster find any of that garbage entertaining.   After he loses, then I'll be able to get a laugh out of it.  Not now.", "label": 0}
{"text": "I looked at their post history. They definitely seem like they are pro Trump.", "label": 0}
{"text": "Shooting occurred. Ketchup was not used. Trump lied about being shot because the \"Protector\" cannot drop to the ground while most supporters stayed on their feet. When the hospital told him he was not shot, he blocked the report, released the bullet photo, pressured the FBI and gaslighted in his convention speech", "label": 0}
{"text": "Ears bleed like crazy. Older folks have more fragile skin so it's easy to split and ear open. I don't discount that he was shot at and I believe the assassination attempt was very real, however, I have always believed the impact of being taken down by Secret Service was the cause of the bleeding.", "label": 0}
{"text": "It’s time for a national divorce. We are too divided as a nation. I say this as someone who voted for Kamala. It’s over , liberals need to accept reality", "label": 0}
{"text": "Putin loves your ideas.  Is he paying you?", "label": 0}
{"text": "Nope. I despise him and Trump. The point is half of this country has lost its mind. We are too divided, wont progress if we are bound together", "label": 0}
{"text": "Sedition is what happened on Jan 6th. I’m also allowed to speak freely. Read the 1st amendment", "label": 0}
{"text": "Do you know how long this has been going on? George Washington, our first present, condemned the 2 party system just like you're saying here. It is designed to cause the great divide. This isn't new. You must be very young or something. There have been crazy ass presidents before. Look at Ronald Reagan and Reagnonomics. Dude was no better than Trump and was an actor before becoming president. \n\n>Don't give up, don't ever give up. \n\nJim Valvano", "label": 0}
{"text": "What's wrong with the idea?  \nBlue and red states forming their own countries would immediately lead to blue states being much more powerful.\n\nI think it could lead to further stability, while Putin and China want us to destabilize.\n\nYou are definitely right, though.\n\nWe should be deeply wary of doing that which makes our enemies happy.", "label": 0}
{"text": "Also. .223 ammunition (which I assume was used), is super high velocity. Unless the bullet just, and just nicced him, his body would have taken a lot more force. He was hardly \"shot\", even if it was the bullet that did the damage. No one is saying he wasn't close to getting shot (there is a NY Times picture with the bullet and his head in frame).", "label": 0}
{"text": "I saw the video, and although he says \"the left will protect some things but won't get much progress done\", he also says \"Trump will absolutely do horrific things\".\n\nHe then goes on about how worrying is pointless because it doesn't accomplish anything, instead get yourself involved at the local level and create change. \n\nIt's a decent message, but click bait titles like \"don't worry about it\" do damage. Being flippant about the side which needs to win can diminish enthusiasm, which is needed. \n\nThis video overall has a muddied message and doesn't accomplish as much good as it thinks it does.", "label": 0}
{"text": "I checked out when he starting talking about worry. I don't mean this to be insulting to OP, but Conover is denser than lead talking about ways to take back power when one candidate and their apparatus supports taking the ability to do some of those things away.\n\nHe comes across as condescending and also just a know nothing when he doesn't realize that changes Trump could make to the NLRB could take away your ability to unionize and strike.\n\nHe IS talking from a tremendous position of privilege and just because he \"cares\" doesn't negate that. Suggesting that Trump would be darker, but Harris would be incremental at best is just straight up bullshit. The elder care policy alone would not be \"a little better\" it would be life changing.\n\nHomie lives in a world where he's been a white dude and doesn't realize that not being a white dude means you can't do some of the things he's suggesting doing with the same level of freedom he has.\n\nTrump and the GOP have blitzed the media down the stretch with anti-trans ads. This ill-informed dude says he can't throw hands with the military, but you shouldn't worry if you have family, friends, or other loved ones who could be hurt by the mass deportations?\n\nI'd love Conover to tell my family that they shouldnt have worried before they were interned in Manzanar and White Heart. Because they could just protest and strike and shit. Give me a fucking break.\n\nI worry when I get pulled over by the police because I was harassed physically once because I was playing fucking Hoobastank too loud. What was my fucking power in that moment?\n\nConover is always preaching this smarmy, I know more than you bullshit.\n\nIt would serve him well to realize he IS fucking privileged and he doesn't to to just hand wave that because it's in the way of him preaching and both sidings shit like a pseudo-intellectual idiot.\n\nSorry. I don't like to get worked up, but I live in the real world where this \"rise up\" shit sounds dumb as fuck coming from some well off YouTuber.", "label": 0}
{"text": "Not about to watch a Trump movie for a couple years.", "label": 0}
{"text": "I'm not Pro Trump.", "label": 0}
{"text": "Except for the both-sideism, he’s right, though. People need to be involved in solving their community problems.", "label": 0}
{"text": "I would bet the “both sides are the same” narrative is predominantly funded by the right as a way to minimize the significance of the decision for undecided voters. The only group that benefits is the worse group when “both sides are the same” is parroted. One president is has multiple felonies, absconded with top secret documents, withheld emergency support from states who didn’t vote for him, and has no qualms about lying to his supporters to advancing agendas of foreign adversaries as long as it helps him personally. Not to say he bungled the one actual challenge his administration faced. Both sides are certainly not the same.", "label": 0}
{"text": "What's there to imagine? Doesn't really change much, and the SS on stage still did their job", "label": 0}
{"text": "As it turns out, a lot of stuff in his shows were just lies.", "label": 0}
{"text": "It's the conspiracy I would believe.  The Secret Service and government agencies would have a real reason to cover that up, unlike a lot of the other ones.", "label": 0}
{"text": "Yeah grassroots local politics don't really mean shit as long as the SCJ decides on everybody's lives", "label": 0}
{"text": "Yeap all the effort to get some generational legislation passed and then the supreme court declares it unconstitutional, violating the \"Republicans don't like it\" Amendment.", "label": 0}
{"text": "But he never \"two-sides\" in the video, idk wtf the guy above is talking about, probably guessed and didn't even bother to watch.", "label": 0}
{"text": "The FBI has said he was struck with a bullet.\n\nhttps://www.npr.org/2024/07/27/nx-s1-5053981/fbi-trump-bullet-assassination\n\nAny claim that Biden's Department of Justice is deliberately lying to the American public to bolster Trump is going to require a tad bit more proof than a 30 second YouTube video.", "label": 0}
{"text": "Yeah, he’s got some good episodes once in awhile like the one guy that spoke about corporate farming, but there’s a lot of bs in there as well. He’s definitely not consistent.", "label": 0}
{"text": "This account is a political spam bot, he has shared this post on over a dozen pages in the last few minutes.", "label": 0}
{"text": "I watched it. It's a stupid take. That's my opinion.", "label": 0}
{"text": "Except for the guy that died and the two other injured people that is.", "label": 0}
{"text": "Yeah, but you can look up and see it's not. Conover suggesting things would be maybe \"marginally better\" is fairly obvious both sides nonsense. Just because he says Trump is worse, \"but don't worry because the reasons I suggested that I would be at risk won't hurt you\" is silly.", "label": 0}
{"text": "They can’t even spell of course. It’s despicable. Tell your mom she rocks. She wrote a letter signing her name and receives a cowardly piece of crap from someone who can’t even sign his name, and writes it on notebook paper. I hope your mom is doing okay.", "label": 0}
{"text": "It's \"interest on a note that never comes due,\" as my dad likes to say. And it's true that constantly letting yourself fall into catastrophic thinking isn't helpful, but it's not as simple as just deciding to not worry any more. I think Adam has a point, and I'm generally a fan of his stuff, but I think maybe there's a better way to construct this argument. Or maybe everyone has just been stewing in this pressure cooker of a country for too long and we're all on one edge or another.", "label": 0}
{"text": "I really like his Netflix series about the work government agencies do.", "label": 0}
{"text": "Sorry Confederates, we’re dragging you into the 21st century, whether you like it or not.\n\nI’m not going to abandon the millions of black people and women who live in the south.", "label": 0}
{"text": "It's also entirely disingenuous to say that he would also be in danger and can't mix it up with the military (I mean... duh) and then suggest that people could strike and protest. That's stupid.", "label": 0}
{"text": "Its brutally and shamefully dishonest to suggest that he can set his privilege aside and ask you to ignore it because \"he cares about people.\" That's not how privilege works.", "label": 0}
{"text": "Yeah the video felt a lot like it was grasping at straws to support the very clickbaity title. I'm also pretty sure a lot of professional athletes experience a lot of nerves before important games. So even the main metaphor didn't really land. \n\nIf the video had been framed around \"here's why you should less time online dooming about the election\", it may have worked better? But it would have got less clicks and that topic has been pretty well covered by others.", "label": 0}
{"text": "That's a good point. What nerd thinks that Judge wasn't going up to the plate with nerves and worry during the WS knowing how poorly he was playing? What made Mariano Rivera special was his cool under pressure. That's not common.", "label": 0}
{"text": "Is this the guy who said men are only better than women at sports because men created the sports, and “because the way a basketball spins.”?", "label": 0}
{"text": "How do you plan on engaging in activism when Trump throws you into a concentration camp ? Arm yourselves. This is propaganda", "label": 0}
{"text": "That’s…they really revealed their true colors there. Said the quiet parts out loud 😒", "label": 0}
{"text": "It's always the explanation that made the most sense to me.  Explains why parts are still sealed long after the cold war ended.  Trump said the other day that people are still living who would be \"affected\" by the full release of the file.", "label": 0}
{"text": "Not that it really matters, but is it physically *possible* to get shot in the ear by an AR rifle and have \"[a little bit, not much](https://www.youtube.com/watch?v=NerBWOrKG0g)\" scarring? Look at his ear in that video, you can't see a thing.  He clearly makes no mention of cartilage replacement or anything like that. \n\nI've also heard that a \"near miss\" shot can cause damage if it goes by extremely close to the ear, that could also explain it.", "label": 0}
{"text": "At least you might walk away from an encounter with a used car salesman with a used car. This guy? He'd pinch your wallet, grope your daughter, and you'd have to listen to a half hour about how good his golf game was.", "label": 0}
{"text": "He was never taken seriously by the business community in New York. Not ever --", "label": 0}
{"text": "sounds legit", "label": 0}
{"text": "He's admits that at about 2:40. And that he's worried for others. And he's political opposition (\"lying press\").", "label": 0}
{"text": "Yes, but him saying that you should set aside his privilege *because* he cares about others is absolutely idiotic.", "label": 0}
{"text": "I don't think that his speech is about not worrying in general.", "label": 0}
{"text": "Doesn't matter if it is or isn't. Saying that anyone *shouldn't worry* but you should jump in and be active is a stupid thing to say. People have kids (I mean I don't) and bills to pay. Going to strike sounds great in theory, but that's not something people can do. Where are the guardrails for families at or beneath the fucking poverty line?\n\nI have friends that can't get health care without the ACA. Trump and Johnson have both talked about repealing it. Should those chronically ill people jump up and protest? \n\nShould the women who are turning out *en masse* trying to undo the damage of Dobbs do... more? They're turning out like never before and Trump still might win. Should they worry? Or should they protest more than they already have been?\n\nWhat I'm saying is that this is a reductionist take and Conover does this kind of stuff because he doesn't actually know shit. He's a privileged dude living off media production. He can say he cares and I'm sure he does, but the fact that he would have the brainlessness to suggest that him *caring* means you can set aside his massive privilege just go to the heart of his foolishness.\n\nI can assure you, some of the most politically active people I know. Some who have been roughed up by the police at protests or who have been the targets of Christian Nationalist are out there, they're still worried. And I promise you they're doing a lot more than Conover is doing while he's up there talking about how Trump is 'darker,' but Democrats don't really do shit.\n\nDude, fuck off. Biden got the Inflation Reduction Act passed against a hostile House. The created good paying jobs for millions. You can stand on morality about P/I and that's fine, but the ACA doesn't exist without Democrats fighting for it.\n\nSo many levels of what Conover is saying is so hopelessly out of touch and full of shit.", "label": 0}
{"text": "That's your read of it. Mine is that he's trying to point out that voting isn't sufficient, which is the anarchist critique of the role of electoralism in capitalist society. \n\nAll your comments seem to amount to some ad hominem fallacy. \n\n>So many levels of what Conover is saying is so hopelessly out of touch and full of shit.\n\nLOL, he literally had a show on how government works AND he brought in Obama: https://www.netflix.com/title/81037116  as mentioned by Obama: https://www.facebook.com/barackobama/videos/g-word-trailer/340590948006194/", "label": 0}
{"text": "Why are there these huge lines to vote in the US? In the UK I've never seen a queue at a polling station once.", "label": 0}
{"text": "Because republicans closed a ton of polling places, on top of there being a small number of polling places in general (sometimes as few as 1 per county, with 100,000+ people). \n\n\n\n\nLongest I waited to vote was 40 minutes, the machines were all taken and I opted to vote on paper because that line was moving faster.", "label": 0}
{"text": "Brutal and accurate ", "label": 0}
{"text": "You're comment rings so true", "label": 0}
{"text": "He doesn't write it, he just plays a character and reads a script ", "label": 0}
{"text": "Nope. I followed the source", "label": 0}
{"text": "Yet I noticed you did not say what show it was 😆 I call BS on you", "label": 0}
{"text": "Yeah.... Do you just give up. The guy owned you", "label": 0}
{"text": "Adam Conover kind of seems like a dick and I liked him on 'Adam Ruins Everything'. I listened to an episode of his podcast where he had this economist on their named Kyla Scanlon. This woman is relatively young but she's obviously very intelligent and a very good communicator. She coined a term 'Vibecession' which is used to describe the state of the economy when most or all of the traditional indicators show a good economy but people still feel like the economy sucks. Because apparently this is a part of economics that most economists just kind of ignore for the most part. \n\nHe brings up the term, she says 'It's now in the dictionary.' and he goes 'Really?' she goes 'Well, dictionary.com.' he then basically tells her that's no better than Urban Dictionary or Know Your Meme. Then when she starts to explain what it means, he cuts her off then begins to mansplain to her the fucking term that she herself created in the first place. Then throughout the whole interview he fucking keeps saying he doesn't know much about economics but continuously cuts her off to explain economics shit to her.  At one point, she uses a meme to explain he then proceeds to completely misunderstand, tell her she's wrong then patronizingly explains the meme to her even though it was really apparent she knew what she was talking about.", "label": 0}
{"text": "Why would you have respect for mainstream economists?", "label": 0}
{"text": "His argument isn't wrong because he's a dick. Thanks for wasting my time.", "label": 0}
{"text": "There really is no such thing as a 'mainstream' economist. Most economists disagree on most things that aren't directly and easily observable. They know if you do *this* then *this* will happen, but if you as ten different economists *why* it happens you'll get ten different answers. She talks about how they ignore a lot of stuff they should be paying closer attention to. She complains that they always base models on people being rational actors which they absolutely are not, she complains they ignore public sentiment about the economy while that sentiment has a huge effect on the economy. \n\nEven ignoring that, she's a guest on his shitty podcast, so that should afford her a level of respect and even if she was a mainstream economist, whatever the fuck that means, she would still know more about economics than him.", "label": 0}
{"text": "There are no long lines here yet, the sun isn’t even up on the East coast (still dark) and the polls aren’t open for hours.", "label": 0}
{"text": "Because we haven't passed the Freedom to Vote act. Basically we like playing pretend with democracy until we get serious someday.", "label": 0}
{"text": "There are no long lines here yet, the sun isn’t even up on the East coast (still dark) and the polls aren’t open for hours.\n\nI don’t know where this photo is from.", "label": 0}
{"text": "I want to see him go to prison, then, I will be happy", "label": 0}
{"text": "Eh, I disagree that knowing more about economics is a good thing.\n\nAnd coming up with new words like:\n\n>Vibecession\n\nis also a waste of time. Instead of pointing out the the actual decoupling of profits from labor that's the base for that incongruity, the word just helps to obscure the problem. \n\nThis is especially bad as the argument is that \"economy good is good, but the popular impression  of the economy is bad\". That stance is premised with the notion that the \"Economy\" is the stock market (rich people's money) and job counts, and that GDP is a measure of well-being. For that alone she should be dismissed, regardless of gender or other personal traits. And \"creating X jobs\" isn't necessarily \"good economy\", as if \"lots of jobs\" means a great economy when people have to work 2-3 jobs and with zero-hour contracts. \n\nThis type of discourse where some supposedly smart economists 'splains why the economy is great when it's actually bad and extremely stressful for large swaths of the working class is very bad faith and very easy to spot during breaks from one's 3 jobs.", "label": 0}
{"text": "Drive all your friends and family to the polls or else we're stuck with his brain rot word vomit forever.", "label": 0}
{"text": "He’s not going away. He will incessantly whine about the election results and scream tweet how this or that wouldn’t be happening if he were president. Next, he will tease running in 2028, hold rallies, and grift. The media outlets will keep him relevant for clicks.", "label": 0}
{"text": "Not if his ass is in federal prison.", "label": 0}
{"text": "In your attempt to sound smarter than you are, you're making a LOT of assumptions that were never stated nor implied. Plus you're hugely oversimplifying a hideously complex problem and ignoring how useful it is to put names to things. She specifically points to how individuals on average feel they are doing financially compared to how they feel about the economy. Most people feel much worse about the economy than they do their own individual financial circumstances. Which is a bad thing for the economy because if think the economy is doing worse than it actually is, they will spend less money than they normally would which in and of itself can depress the economy. She also does go into individual factors that are both good and bad. Most consumer goods like electronics, clothes, things like that are relatively cheap. But during the 2008 financial crisis they kind of stopped building houses for the most part creating a supply issue and making housing prices shoot up, food prices have shot up since COVID and car insurance has gotten a lot more expensive because cars have more tech in them which makes them on average more expensive to repair after an accident.  \n\nBut again, even with these issues taken into account, people's perception of the economy is a lot more pessimistic than their perception of their own financial well-being. This is kind of a new thing that hasn't really happened before and it makes creating new economic policies for government really tricky. Because people on average feel like their own financial situation is at least serviceable while seeing the economy itself as a trainwreck. So the normal stuff the government does for these kinds of problems simply aren't really working and what needs to happen is policies to target more individuals. Things like the government helping with in home elder care for aging parents, child care, single payer healthcare, incentives to build more houses, help buying those houses, that kind of thing are obviously *really* hard to get passed.\n\nSomething like a really good-sized tax credit for first time home buyers would help with the housing situation, it would help people afford homes and incentivize developers to build more homes geared towards first time buyers. But, people who already have a house don't give a shit and don't want other people getting help that they didn't. People who think their insurance is better than a single payer system or simply think single payer would make their care worse don't want that even though it would make care improve across the board for less money. Because, again, people aren't rational actors.\n\n> Eh, I disagree that knowing more about economics is a good thing.\n\nWhat? Do you think our entire economy is just held up by magic? Do you think we've stayed the largest economy in the world for the past 60+ years with wishes and hopes? The government enlists a *lot* of economists that do a lot of shit to keep things as balanced as possible, it gets more complicated every day and knowledge of economics is the only reason the whole system hasn't imploded in on itself. Anything they do today won't have an effect on the economy for at least two years just due to the sheer scale of it. They have to try to predict what will be happening in two years and what effect what they do today will have in that economic climate. The 2008 recession was literally caused by the government doing exactly what economists told them to *not* do. This has been the story for every economic downturn we've had after The Great Depression. Hell, they were even warning that we weren't prepared for a pandemic before COVID hit.\n\nEconomists agree with a lot of the common-sense solutions people want to help the economy, healthcare, corporate taxes, better social safety nets and so on. But none of that shit can get very far because of politicians, so economists are trying to hold this shit together while people blame them for it. The prominent politicians fighting for these changes themselves have degrees in economics like AOC and Elizabeth Warren. Economists aren't the problem, politicians who think like you do or simply don't care are the problem.", "label": 0}
{"text": "He’s going to be submitting paperwork to run for president in 2028 by January 21,2025. \n\nHe believes that if he’s running, all criminal cases against him must be put on hold until after the next election. He will use any and all tactics to avoid prison for his multiple felonies. \n\nHe’s sadly not going away just yet even if he loses", "label": 0}
{"text": "Judges hate this one simple trick", "label": 0}
{"text": "With all his debts and court issues, he will scream like he were being sucked into a black hole, louder and louder, and then finally - merciful silence, and the world will move on from this yutz.", "label": 0}
{"text": "> She specifically points to how individuals on average feel they are doing financially compared to how they feel about the economy.\n\nShe's an economist. You're describing psychology and a branch of sociology. \n\n>What? Do you think our entire economy is just held up by magic?\n\nI don't think that economists have much to do with the economy. They're more like sports commentators and sports. \n\n>The 2008 recession was literally caused by the government doing exactly what economists told them to not do. \n\nPrecisely. Economists don't matter, except when they're doing good PR for business as usual. \n\n>so economists are trying to hold this shit together while people blame them for it.\n\nNo they're not.", "label": 0}
{"text": ">She's an economist. Yet, you're describing psychology and a branch of sociology.\n\nIt's called economic psychology and behavioral economics. They're both important branches of economics because what people do and why is really important.\n\n> They're more like sports commentators and sports.\n\n\nThis is factually, verifiably false. A branch of the Federal Reserve called The Federal Open Market Committee (FOMC) take data and predictions from a group of more than 500 economists and their forecasts for the economy in order to adjust things like interest rates and treasury securities in order to keep inflation more or less at the same level and keep unemployment at the correct rate.\n\n> Precisely. Economists don't matter, except when they're doing good PR for business as usual.\n\nAgain, this is factually untrue. It's not even a matter of opinion. It's just a vast misunderstanding of how the economy works on a federal level.\n\n> No they're not.\n\nAgain, factually incorrect.", "label": 0}
{"text": "A landslide would be required.\n\nSelzer says it can happen.", "label": 0}
{"text": "Not if there is a landslide result for Kamala. Selzer says it can happen.", "label": 0}
{"text": "Seems a bit desperate.. “my only qualification is, I’m not him.”", "label": 0}
{"text": "Mail in voting is uncommon in the UK. it's not needed to eliminate lines", "label": 0}
{"text": "So did I; a good portion of the citations didn't quite say what his summaries said. The \"security theater\" one was pretty well spot on, though.", "label": 0}
{"text": "How about me, then? I have not called you a liar. Can you point me to timestamps?", "label": 0}
{"text": "My guess is more likely the latter.", "label": 0}
{"text": "Except that's not exactly what he says. Instead, he says (heavily paraphrased) \"Stop waiting for politicians to solve problems in areas of which they might have little expertise; get out there, be a part of something constructive, keep at it, and then the positive change will come\".", "label": 0}
{"text": "> It's called economic psychology and behavioral economics. They're both important branches of economics because what people do and why is really important.\n\nShe's not even an economist, she's doing economist education. \n\nFor fucks sake, you're into some celebrity and wasting my time with fanboyism.", "label": 0}
{"text": "The last time I see him, I want it to be a picture of him in a orange prison uniform without makeup and that ridiculous comb over. That’ll be the close of this embarrassing chapter in America’s story.", "label": 0}
{"text": "#1 make it so", "label": 0}
{"text": "T-shirts reading \"Free Trump\" for the next decade or until he passes. When he passes, people will set up shrines in their homes like teen girls did for Micheal Jackson.", "label": 0}
{"text": "Another lie. He said that after he lost the last election", "label": 0}
{"text": "That’s great then, “we shall know them by the shirts they wear.” Can’t make it any easier to identify the afflicted.", "label": 0}
{"text": "That actually was a Central Park five thing.", "label": 0}
{"text": "This is much better.\n\nYou’re all clear kid, now let’s win this thing and go home!", "label": 0}
{"text": "Today feels like a day in limbo.. I don’t like it. I want it to be over, and I hope, we never have to listen to this overgrown Oompa Loompa again. Nothing would be greater than watching him flail and cry while Kamala is taking her oath.", "label": 0}
{"text": "Voting is constructive. But him ignoring the conditions by which change happens in and suggesting he doesn't worry because of these reasons is coming from a position of privilege.", "label": 0}
{"text": "Timestamps for what, specifically?", "label": 0}
{"text": "I wouldn't hold my breath on that one. Call me a cynic, but I don't hold much hope that our judicial system will hold him accountable.  There's too much hand-wringing amongst the ruling class that believes if he is held accountable this will open them all up to prosecution.", "label": 0}
{"text": "We will both see and hear from him endlessly regardless of the outcome of this election. He won't quit trying to keep himself out of prison until he dies. If he loses he will immediately start running again in an attempt to shield himself from prosecution. Sweet baby Jesus help is if he wins. The insanity will never stop.", "label": 0}
{"text": "Yeah, I know I’m ’clutching at straws’ but there *must* be some accountability? Surely? Otherwise do you just run for President your entire life??", "label": 0}
{"text": "Wierd", "label": 0}
{"text": "Yeah, unfortunately I agree. If you’re ever (deities forbid) arrested, just say you’re running for President and it’s ELECTION INTERFERENCE! You’re set, got this dumb fuck as Precedent!", "label": 0}
{"text": "That will never happen. It feels like we’ve been subjected to seeing and hearing as much of him in the last 4 years, as we did during his presidency. Maybe more. He never stopped whining……", "label": 0}
{"text": "Republican playbook\n\nStep 1 eliminate Mail in voting \n\nStep 2 limit in person voting locations \n\nStep 3 make in person voting as difficult as possible", "label": 0}
{"text": "Oh no, I'll have to rely on real comedians now.", "label": 0}
{"text": "Vance is young. Vance isn't going anywhere, he's Trump 2.1 and the same financiers and strategists for both.", "label": 0}
{"text": "he's going to continue to complain, whine, whinge and stir up trouble until he's dead.", "label": 0}
{"text": "Never did tbh.", "label": 0}
{"text": "*Melania gushed over Donald's tender side in her tome, revealing he regularly calls her personal doctor to check on her health*\n\nThis is creepy. If i tried this my wife would probably divorce me.", "label": 0}
{"text": "Friend stood in a long line in North Liberty yesterday. ", "label": 0}
{"text": "He's a convicted felon awaiting sentencing, and he's still sitting under a mountain of other indictments - both federal and state - that are currently pending.", "label": 0}
{"text": "\\>>> \"Truth Social\"\n\nI'm sure that the irony was lost on Donnie Dumbfuck, world's most prolific liar when his kissass cultists named it.\n\nI give the site a week from today before it collapses like an old Las Vegas casino.\n\nAfter that, there's going to be either a fire sale of tRump properties or a midnight flight to Moscow. (Stevie \"Half-ton\" Seagal says 'Hello' BTW)", "label": 0}
{"text": "His sentencing is Nov 26th. Make sure he makes that date by driving all your friends and family to the voting booth.", "label": 0}
{"text": "He's a convicted felon and his sentencing is Nov 26th. Drive all your friends and family out to the polls to make sure the clown goes down.", "label": 0}
{"text": "\"Don't sentence me to prison because I'm busy committing election fraud\" is not going to convince any judge.", "label": 0}
{"text": "And yet that is exactly what’s happened. He has been given so many passes by the justice system already. They have effectively shown him that he can ask for delays over and over and they will grant them. \n\nHe should have been sentenced in July. Any other person would have been. He is treated with white gloves at every turn", "label": 0}
{"text": "On that we are in total agreement. It's a disgusting double-standard.", "label": 0}
{"text": "Strange that the Tea Party was financed by the Koch Brothers & Uhlein & other billionaires and talked them into voting against their best interests.", "label": 0}
{"text": "which is why i am worried about post election. the justice system has shown no willingness to actually give him consequences for his actions. Until they show otherwise, I will not trust that they will", "label": 0}
{"text": "I know, but after the last election he said that  and lied about it", "label": 0}
{"text": "I was never referring to his words, only his legal cases. We all know it is the only thing that will shut him up.", "label": 0}
{"text": "I knew Trump drivers could manage to drive even slower and hold up traffic. Why can’t they get a job?", "label": 0}
{"text": "Hmmmmmmm. Yes. Yep.", "label": 0}
{"text": "Huh?, symbolic to where Trump takes us if enough idiots vote for him, back to horse and carriage.", "label": 0}
{"text": "What are they? ", "label": 0}
{"text": "I’m going to guess Amish?", "label": 0}
{"text": "Be careful with that rhetoric, he might pretend you're that mic stand he was blowing the other night....", "label": 0}
{"text": "Lol what?", "label": 0}
{"text": "Oh diddly, did you not see him \"eating a corndog\" the other night?!\n\nDon't threaten tRump with a good time....    ;-)", "label": 0}
{"text": "Haha yeah I did. What a moron. But why would he wanna blow me from what I said haha?", "label": 0}
{"text": "I don't know, I just suck at jokes lol", "label": 0}
{"text": "inbred mostly", "label": 0}
{"text": "Haha any humor is welcome today. Have a good one!", "label": 0}
{"text": "You as well, cheers!", "label": 0}
{"text": "That's under a shit filled diaper, too.", "label": 0}
{"text": "I thought the Amish were largely apolitical, no?", "label": 0}
{"text": "There was a queue when I went to vote in our general election this year, but it was only inside the actual building and took 5 minutes if that. \n\nThis is in the middle of a big city centre too.", "label": 0}
{"text": "Even funnier: The photo is 2020, and they're all huffing hopium.", "label": 0}
{"text": "They never sign their name either", "label": 0}
{"text": "Maybe all those extra fingers and toes help them do chores faster.", "label": 0}
{"text": "It's probably still from his campaign.", "label": 0}
{"text": "Yes they are.   I think this is photoshopped \n\n\nThe Amish call other Americans \"the English\". That's how disconnected they are from us.  They couldn't give a fuck about our politics", "label": 0}
{"text": "So sick of this annoying fucking toddler and his constant tantrums.", "label": 0}
{"text": "The last thing they need is for the women in their community to start getting ideas.", "label": 0}
{"text": "They believe whatever lie Trump tells them. It's so frudtrsting.", "label": 0}
{"text": "People are stupid, and they'll believe obvious self-serving lies and exciting conspiracy narratives over boring facts and reality. You can't ban misinformation when that's what people want to hear. Americans voted *for* the lies and misinformation.", "label": 0}
{"text": "okay and that is a hopeful message.  thank you.  \n\ni  am hoping the picture of him over there on the right sidebar is removed.   i  am so sick and tired of even the awareness of his existance.", "label": 0}
{"text": "From dead to buried, sure.", "label": 0}
{"text": "This country is done. This was our last free and fair election.", "label": 0}
{"text": "I think you’re right. One piece of painfully bipartisan legislation didn’t make everyday life more affordable so people want a change.", "label": 0}
{"text": "This is a stupid take. Democrats were warned over and over about taking core voting demographics for granted and STILL took them for granted to court centrist republicans. The fault lies on the losing campaign", "label": 0}
{"text": "Hard agree with this message and I think it’s an interesting direction to take things. I haven’t heard anyone suggesting we mobilize over this issue", "label": 0}
{"text": "Yeah democracy is fucked. How can we effect change at all?", "label": 0}
{"text": "The GOP now has a supermajority. Majority in House/Senate, absolute power in the executive, and a conservative supreme court judiciary.\n\n\nThe GOP can now define the country in anyway they choose.\n\n\nGod help us all", "label": 0}
{"text": "looks like trump spam is back on the menu", "label": 0}
{"text": "Ugh I misread the post. I thought it was him saying you'll never see him again, like he did last time, sorry about that", "label": 0}
{"text": "Stop picking people in the primaries that give the misinformation weight.", "label": 0}
{"text": "They blew it in 2016 when they fucked over Bernie, the only actual populace candidate who would have destroyed Trump. But the DNC is loyal to their corporate masters so they gave us Hillary who is the same fucking unlikable non-charisma having archetype as Kamala. So they ran the same scenario in which they had already lost before. I think they purposely lost bc the elite controllers wanted it that way.", "label": 0}
{"text": "Now we get to watch Trump create more debt in the next 4 years than Obama did in 8 years three times over", "label": 0}
{"text": "It's too late.  We now live in a post-truth society.", "label": 0}
{"text": "My biggest fear is Trump encouraging Netanyahu to deploy nukes.", "label": 0}
{"text": "Im ok with watching it burn.", "label": 0}
{"text": "Yall be realistic. Trump is winning the popular vote, not because significantly more people vote for him in 24 than they did in 20. A little more did but not significantly more. \n\nGOP is sweeping the elections because Dems did not vote. Harris is running 15M behind Biden. There’s a complete collapse of the dem coalition while trump kept his intact.", "label": 0}
{"text": "Anyone have any of these \"innovative solutions\" just sitting around? The mind virus they talk about is real, but it's not \"woke,\" it's rampant far-right disinformation that is incentivized to be spread through efficient channels. No one has produced anything close to an effective fix for this yet because there is no personal incentive structure for doing so. Free speech is vital, but it has also now been weaponized against us. What's worse, even if someone were to devise an effective method for countering this spread of lies and distortions, the people who have been given power will kill it before it even has a chance to be implemented.", "label": 0}
{"text": "Gods part of the reason the GOP won so easy good luck asking him for help", "label": 0}
{"text": "The republicans need to win the presidency when the US is downhill, so that Americans can actually see that they don’t actually improve anything. Democrats are trapped in coming in after republicans failings, where republicans have been handed solid economies over and over again. I think with Trump’s tariff plan, Americans might finally start understanding the economic pain republicans put us in, but it likely will take until the end of his presidency for the impacts to start really being noticeable, and then we’ll go back to Democrat and they’ll have to fix it over 4 years like the last several presidencies.", "label": 0}
{"text": "Regan repealed the law that made it a crime for news outlets to lie.\n\nHe did that to allow Fox News to be called Fox News and spread lies.", "label": 0}
{"text": "The voters were so dense they could not grasp that it was Trump's fucked up response to Covid that gave us the inflation.", "label": 0}
{"text": "NO, I think almost half of this country is stupid and vindictive and a small portion has to protest that the left is isn't left enough and votes for fakes like Stein or RFKWormJr.", "label": 0}
{"text": "Faux Nues should not have been a successful business model.", "label": 0}
{"text": "It's more like a quarter of voters are actively racist and/or misogynistic and millions of people are just passively so, so they felt comfortable staying home.", "label": 0}
{"text": "It's not just social media. The legacy media has been bought up by oligarchs and sanewashed Trump for years, too.", "label": 0}
{"text": "I agree, but the education system (ie, schools) isn't how voters are getting their information. The media needs to be held to higher standards, with heavier fines for spreading misinformation. It shouldn't be possible for a news outlet to repeat obvious lies and still remain in business.", "label": 0}
{"text": "We learned in 2016 that a woman couldn't win the presidency. So in 2024, we run a *black* woman against the same dude and expect to win? What's wrong with this picture?", "label": 0}
{"text": "Education won't get better.  I've watched it swirl down the drain for two generations now.\n\nI'm soooo fucking glad we don't have kids.  We're able to just ride this rollercoaster to the inevitable burn pit & know we have no descendants who will need to try to emigrate their way out of this mess.  \n\nThe world is laughing.  Like, scared laughing.", "label": 0}
{"text": "Can’t GOP has total control of house and senate and the Presidency. They cn pass whatever they want in the next two years.", "label": 0}
{"text": "yeah, noshit. the only people left who will work for Trump are  these idiot talibangelicals with their boner for supplyside jesus and subjugate women and dark people theocracy.", "label": 0}
{"text": "They got the House?", "label": 0}
{"text": "The dems needed to flip 4 seat to gain control. \n\nAs of now, the gop has flipped 5 seats and the Dems have flipped 2. Meaning the Dems would need to flip 7 additional seats of the remaining ones to get the house. \n\nBased on how bad democrats turned out, it’s just not going to happen", "label": 0}
{"text": "...... If there are elections in two years......", "label": 0}
{"text": "How about we honor the name of this subreddit and flush the trump spam down the toilet.\n\nThat means quit fucking talking about him all the fucking time. We need to regroup, focus on OUR OWN SHIT AND OUR OWN CANDIDATES, FIRST.\n\nWe alllllll know he’s gonna do stupid shit ALL THE TIME. Who fucking cares at this point. The next 4 year will be ass. But we MUST talk and share and discuss and debate OUR CANDIDATES for 2028. Not the latest ramblings from an 80 year old dog shit human.", "label": 0}
{"text": "They have the house and senate so please explain. If Harris won she would be the lame duck because the asshat majority would see to it that nothing gets done except for them getting a pay check.\nNow Project 2025 will become a reality.\nThere are no guard rails on Trump now, there won’t be any smart people in his cabinet, just sycophants. He will pardon himself, along with any other cronies of his, along with the January 6th insurrectionists.\nUkraine is fucked, Gaza is fucked and the list goes on. Rape and incest will be decriminalized and law and order are gone. No more protests will be allowed and will be vigorously shut down.\nI never thought I would see fascism running the country .", "label": 0}
{"text": "You think you're so adorable, *Matt*. But we saw through you the whole time. And we see other things.", "label": 0}
{"text": "Yeah, you have failed to understand that the republicans took the presidency, the house, and the senate.\n\nThey now will go about replacing all government workers with Trump sycophants.\n\nThis country might not ever see democracy again.", "label": 0}
{"text": "Are you really still going with “low-information voter”? You’re blaming the press? \n\nDemocrats need to sell a vision that appeals to enough people to win, pure and simple.", "label": 0}
{"text": "This got little to no media coverage: as soon as people were lighting him up for project 2025, he put up \"Agenda 47\" on his official campaign website. It was just a rebrand of Project 2025, but for some reason all the news outlets let him continue to distance himself from it, and NO ONE grilled him on Agenda 47.", "label": 0}
{"text": "Except we just had an election and the country loudly moved to the right. His party was just given a mandate to govern and enact their policy. They have all the motivation they need. \n\nAt best, Dems can retake the house and senate in 2026. But that is 2 years of complete control for the gop and they will be using it very well to attack every part of American democracy", "label": 0}
{"text": "There’s still bipartisan legislation that will need to be passed. Plus SCOTUS will handle everything else as it concerns civil rights. So we fucked basically.", "label": 0}
{"text": "You can kiss the filibuster goodbye.", "label": 0}
{"text": "Once again, an absolutely total abdication by our press", "label": 0}
{"text": "Romney retired. Murkowski will say she’s unhappy with the plan and the vote to pass it anyway. \n\nThis isn’t being a defeatist. It’s seeing reality. The gop has full control and nothing to stop them from enacting their policy. The 2026 map is favorable for them as well as the majority of their seats are in safe states", "label": 0}
{"text": "No shit.", "label": 0}
{"text": "Listen, you are always free to give up and crawl into a hole. But that's a choice.", "label": 0}
{"text": "People who are fucked is my guess", "label": 0}
{"text": "Yes, I’m aware. Why not fight fire with fire?", "label": 0}
{"text": "Yup, even though it hasn’t been officially called just yet, they retained the House and now have every branch of government.", "label": 0}
{"text": "Who is the \"us\" here? Because if \"us\" means someone other than Republicans, my response is that we can't fucking make him a lame duck, because they control all the branches of government. We are shut out. Best we can do is get our shit together and try to actually win a couple elections in two years.\n\nAnd if \"us\" does moderate Republicans, then Jesus Christ you have not been paying attention because those haven't existed in years.", "label": 0}
{"text": "I guarantee the filibuster is toast next year, because there's no way they get Project 2025 done without killing it first.", "label": 0}
{"text": "At least Gilead had strong environmental laws.", "label": 0}
{"text": "Yeah, we should block everything and then run on how we support what we blocked like they do.", "label": 0}
{"text": "Or better yet hold those things hostage to push real solutions. Make the news cycle about a government shutdown unless a bill reducing the cost of living is passed. \n\nThis isn’t rocket science. Democrats are just champions of the status quo and the status quo sucks.", "label": 0}
{"text": "How? He controls the Senate, Congress, and supreme court? What do you think is going to stop him? Most of the US military support him? Do you think stern words will do it?", "label": 0}
{"text": "Bit of both I reckon.\n\nLook at the crowds for both their rallies. Some probably thought Kamala had enough votes and couldn't be assed lining up.", "label": 0}
{"text": "Pressure from what public? The one that just gave a Trump a federal trifecta and the popular vote for the first time a Republican has had the pv since 2004?", "label": 0}
{"text": "Really can't wait for the people who sat the election out to see the results of Trump's actions on Gaza \n\nSpoiler alert: it will not get better", "label": 0}
{"text": "This feels like cope", "label": 0}
{"text": "Regardless of why, those who chose not to vote just handed your country to a fascist.", "label": 0}
{"text": "Why be introspective and critical when we can blame the other party for voting who they were always going to vote for?", "label": 0}
{"text": "Only because there was a nuclear war.", "label": 0}
{"text": "It should be, but that seems unlikely. We’re down shits creek now. Data and facts have no bearing on overall public opinion", "label": 0}
{"text": "Maybe you did and most of reddit. Unfortunately for you, over 50% of Americans didn't.\n\nLeopards eating undecided voters faces will be a common thing next year.", "label": 0}
{"text": "Hi, you are f'd and we -the rest of the world- also. I told you you didn't have time.", "label": 0}
{"text": "I'm part of what they're Going to burn down.", "label": 0}
{"text": "For now", "label": 0}
{"text": "What do you want me to say?  I'm only one person.  The world is full of stupid folks.\n\nLet's still hope for the best, and that he doesn't find a way to fuck it up and sell us out.  That's all we can do.", "label": 0}
{"text": "Indeed.", "label": 0}
{"text": "If the past decade has taught us anything it's that when shits hits the fan and everything falls apart, maga-minds blame everyone but themselves amd the masses believe them every single time. They will never be held accountable by this country...it's going to take an outside force at this point.", "label": 0}
{"text": "No man not trying to shame you. It's just you liberal guys act as if it's a normal institutional world and it is just not. The world is on fire, your pants are on fire. The Democrats just keep pretending is not. Hope we all survive.", "label": 0}
{"text": "You guys know filibuster is dying day 1, right?", "label": 0}
{"text": "What exactly did I say to make you think that?  My earlier comment was about how difficult it is to kick Elon Musk out of his company, and that it's not in the public sphere right now.  I stand by it.    This is not wartime, so we have no emergency powers to do that.   We might take operational control of StarLink away from Musk, but he still owns the company.   It's not being reported on, so that's the end of it - for now.", "label": 0}
{"text": "Actually, I don't think thiel is one of them and he's the guy who paid for Vance to be the running mate most likely", "label": 0}
{"text": "Imagine rejoicing in the systematic dismantling of government institutions.\n\nVile scum.", "label": 0}
{"text": "We don't have a press anymore. Haven't in years, we have a very successful oligarchy propaganda machine", "label": 0}
{"text": "Half the press is full on right wing propaganda and the other half of the press' only goal is shielding corporate motives and profits and does not give a flying fuck about the country.", "label": 0}
{"text": "How TF do you propose we make him a lame duck with all the pickups the GOP had across the board?   Strap in buckeroo, your rose colored glasses timeline ain’t happening.", "label": 0}
{"text": "Wow they sure love lying. This is of course no surprise to anyone who actually pays attention and is familiar with how this group operates. We all knew project 2025 was the plan. And now we get to watch as they try to implement it and the media just acts as if it’s just a normal political party enacting a standard political agenda, rather than what it really is, a massive power grab and the largest expansion of presidential power in American history. Power no individual in our country should have, and they want Trump to have it. Unreal", "label": 0}
{"text": "Project 2025 has always been their agenda. The difference this time is they wrote it down.\n\nBut it's been their agenda for over 40 years.", "label": 0}
{"text": "I mean, probably not. Republicans benefit most from to sticking around. They can run on he and then blame democrats for it not passing mall while passing tax cuts for their donors through reconciliation.", "label": 0}
{"text": "I am aware but this will be far more extensive.\n\nThe idea will be to tear government down and rebuild it as MAGA from the ground up.\n\nPretty sure that is the message that Musk is putting out and he will have a position in the new government.\n\nCreate enough pain and then say this is what we have to do and MAGA will be the answer.", "label": 0}
{"text": "Is Matt Walsh actually involved with the Trump campaign? Isn't he just a right wing commentator?", "label": 0}
{"text": "Sorry I mis read your comment in my grief stricken state of mind.", "label": 0}
{"text": "The next 2 years are a wash. They can pass whatever legislation the heritage foundation and other christo fascit think tanks want. There is nothing that can be done about that. \n\nJust hope we still have fair elections in 2 years, because I guarantee now that have 100% grip on power they will make moves to make that permanent.", "label": 0}
{"text": "All good, I’m in the same boat.", "label": 0}
{"text": "No one's used that crap for years. No one's going to use it now.", "label": 0}
{"text": "These all take numbers and/or money. If we had those we would have won.", "label": 0}
{"text": "Remember when democrats had control of every branch and all they attempted to do was pass a healthcare bill modeled after a Republican plan because they didn’t want to abuse their power? After this latest flop I’ve lost all faith in the Democratic Party, they’re not committed to winning or even pushing an actual agenda when they miraculously win.", "label": 0}
{"text": "Democratic establishment has been so scared of being liberal because they are living in the 1980s when they got crushed for being liberal. So for the last 60 years, they’ve been going as the center party and lose constantly for it.", "label": 0}
{"text": "Not to mention control of the judiciary system up to the Supreme Court.  They can pass any law they want, and when people complain, their puppets on the highest bench will rule in the GOP's favor, every time.  I'm a pessimist by nature, but I think I'm fairly justified this time in saying America as we knew it is gone.  You really think the GOP will let there be another election?  I don't, or at least just a show one which they'll win, because the opposition-controlled SC just hands it to them, like Gore/Bush.", "label": 0}
{"text": "##No puppet. **No puppet. You're the puppet!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EnoughTrumpSpam) if you have any questions or concerns.*", "label": 0}
{"text": "I did what I could. I donated, I volunteered, I phone banked.", "label": 0}
{"text": "Using chatgpt is certainly a statement. Not an impressive one, but certainly one.", "label": 0}
{"text": "Trump will just claim that he's read it *since* the election and liked *parts* of it.", "label": 0}
{"text": "I saw a guy on Twitter ask we can prevent Project 2025, like, he seemed a very man. But I was like, you aren't SURE? ON HOW?", "label": 0}
{"text": "The Twittards said he was JUST TWOLLING. And if there's an accurate source on anything, it's usually found on Xtwit. /s", "label": 0}
{"text": "Sadly, they won't learn, most will go to their graves thinking that MAGA was and is the answer. This is what happened to the true-believer citizens of Nazi Germany.", "label": 0}
{"text": "Trump will kick the bucket before the next election, and Vance is a big proponent of Project 2025", "label": 0}
{"text": "Does it come with cartoon pictures?", "label": 0}
{"text": "Matt is no way shape or form connected to the trump administration", "label": 0}
{"text": "He won the popular vote. It’s over people.", "label": 0}
{"text": "It's like the onion article.", "label": 0}
