{"text": "BRICS doesn't need to exist for the Yuan or the Lira. It exists because those trash currencies swap at abhorrent rates because anybody outside their fiasco countries think they are low grade meme lords. They have to give them real value in Dollars and Euros for their worthless papers. Nobody cares if you can buy a piece of low grade bread with your fake Rubels, Ivan", "label": 0}
{"text": ">What exactly makes something a \"stupid Russian talking point\"...?\n\nWell, let's see. You are somehow upset that things were renegotiated **IN YOUR FAVOR**, which is a Russian talking point if I've ever heard one. In fact it is so pants-on-head blindingly idiotic that you basically *HAVE* to be a Russian. :)\n\n>I am interested to know given that I formed my fundamental opinions about the EU at a time when it was called the EEC, and the Soviet Union was in favor of it, thinking it would be a useful wedge between the USA and western Europe.\n\nAnd the Russians were wrong about the level of control they could exert over the EU. The only people upset about that are the Russians, sweetheart. :D\n\n>Your \"Russian talking point\" shtick is just a cheap cop-out to dismiss arguments you find uncomfortable but can't be arsed to actually argue against.\n\nWrong.\n\nI'm confused as to why you are upset that things were resolved A) Peacefully and B) **IN YOUR FAVOR**. And rather than even try to answer that you decided to ignore EVERYTHING else and concentrate on the fact I am calling out your obvious Russian propaganda.\n\nSee, sweetheart, if you were actually from Denmark, or if you were actually interested (or even knowledgeable) in the points you claim to be so important, you would have focused on them, instead you flew right off the handle at the mention of the word \"Russian\"... Just like a Russian would. :D\n\n>We are still interested in democracy, yes?\n\nI mean, you very clearly aren't. The EU is the envy of the world as a pillar of the power of democracy and compromise. But to hear you tell it, they're worse than North Korea.\n\nSo, no, I don't think you are interested in democracy at all.", "label": 0}
{"text": "Even the comies didn't do this in 1990. I cannot really imagine it. I would fuck Orban with my own dick.", "label": 0}
{"text": "Blowing up the nordstream pipeline was the start of the decline  of the EU economy", "label": 0}
{"text": "Stop smoking whatever it is.", "label": 0}
{"text": "Save? Its needs to rebuilt.", "label": 0}
{"text": "I think 99% of us citizens are aware that the qol is higher in Switzerland that in the US, I didn’t say anything controversial. If you have some insights that I missed please share. I’m not a US hater", "label": 0}
{"text": "Ostia esto es muy flipante", "label": 0}
{"text": "The OECD’s [Better Life Index](https://www.oecdbetterlifeindex.org/topics/income/) accounts for disposable income after taxes and transfers, so it accounts for healthcare differences, student loans, etc. Canada averages $34k US versus $54k for the USA, so even accounting for societal differences the US is pretty far ahead.", "label": 0}
{"text": "Not to mention the concentration of wealth in the US wildly skewing those stats.", "label": 0}
{"text": "Here let me show you how dense your comment is. \nAmerican average teacher salaries: 43k. \nLuxembourg average teacher salaries 110k€ excluding pension and healthcare contributions.\n\nThe average person is not a software engineer, attorney, doctor or CEO.", "label": 0}
{"text": "And they trust the EU even less than other places", "label": 0}
{"text": "It's a bit more complicated then that. If you're a Brazilian company and want to buy things from Russia it's really hard to just buy billions of rubels using reals. So you use reals to buy dollars, you pay with dollars and the russian company sells the dollars for rubels.\n\nWith alternative trading system (let's call it credits) you buy credits from your own gov when you want to buy stuff from a different country and when you export you sell the credits back to your country. Every now and then the countries get together and check who owes who how much. And since it's multisided clearing then if you import 1 million credits worth of goods from A and export 1 million worth of credits to B then you're at net zero.", "label": 0}
{"text": "Imagine risking being charged with treason, sabotage and endangering multiple lives for 500$-5000$\n\nAt this point it's safer to just rob a bank.", "label": 0}
{"text": "The difference is the US is more of a civilization-state than a nation-state. \n\nI know the term was originally meant to describe China, but I think it applies to the United States as well.  \n\nAlso, had a Polish ex whose mom started to complain about how often she was hearing Ukrainian rather than Polish on the trams in Łódz, which kinda snipes your thesis a bit and highlights how nationalistic even very mainstream Europeans can be.", "label": 0}
{"text": "Imagine thinking software developers won't be obsolete in 15 years lol", "label": 0}
{"text": "Why the hell UA troops will go to Hungary or other EU countries, if Ukraine's 2/3 of borderline is shared with russia, the main enemy for the next 100 years.", "label": 0}
{"text": "why do europeans hate freedom so much?", "label": 0}
{"text": "In the Netherlands, this fortunately changed and we’re now saving tax free for our own retirement.", "label": 0}
{"text": "It’s true that many billionaires support Trump, but this phenomenon is not unique to him. Kamala Harris, like many other politicians, also receive a significant amount of financial backing from wealthy donors and corporations. The influence of money in politics affects candidates across the spectrum, as both parties rely on substantial donations to fund their campaigns. It’s really a systemic issue rather than a situation limited to a single candidate or political party, highlighting the broader challenge of balancing democratic representation with the financial interests of the wealthy in the political arena.", "label": 0}
{"text": "Wtf is that article? Reads a bit like an AfD propaganda piece", "label": 0}
{"text": "Hungary is NOT a democracy.", "label": 0}
{"text": "The only country that would care about Belarus is Poland, as there are between 200,000 and 1.1 million Poles living there. Considering Lukashenko's hybrid war tactics—pushing migrants across the border for years and imprisoning leaders of the Polish minority—he has essentially burned that bridge.", "label": 0}
{"text": "You seem to have absolutely no knowledge about Switzerland, which is fine ofc, but still, it's just uninformed yapping.", "label": 0}
{"text": "You can help your existing families not to lose income and be able to buy the place where you could live when you have child.\n\nBiggest problems now are corporations what buying all flats and houses and then making you or rent-slave or credit-slave.\n\nIn US additional problems making universities, what making the same thing.\n\n40 years ago 1 working man could cover 1 wife and 3 kid's spendings. Now you need, probably, 4 working people at family and one kid.  That's all. \n\nBan companies and people from buying 2+ flats/houses, add limit's to making houses for \"rent only\". Place for live should be treated as medical care. And you will see in next 20 years what you really don't need so much immigrants.", "label": 0}
{"text": "Hahahahhhaha", "label": 0}
{"text": "lol, yes, its exactly like that. imagine if you fight a ufc fighter and small midget, and you have 10 ufc fighters behind the midget handing him knives, boxers, golf clubs", "label": 0}
{"text": "Oh well... \\**shrugs*\\*", "label": 0}
{"text": "But if it says democratic it must be true (/s)", "label": 0}
{"text": "Own goal after own goal after thinking you can save the planet with money you didn't earn will do that to you .", "label": 0}
{"text": "> Seems impossible to buy a house when you have to pay double in a 5 year loan.\n\nYou can, if you sign up to fight in Ukraine.", "label": 0}
{"text": "Well, I don't really consider access to health care an enemy, but you do you.", "label": 0}
{"text": "It's election time.", "label": 0}
{"text": "Have you asked yourself why does the finish line move further and further?", "label": 0}
{"text": ">However it turns out we were dependent on Russian gas but they are not dependent on our money.\n\nThat is simply not true. It hurts both sides, but Europe managed to switch its gas sources inside 12 months. That hurt because there economic reasons to choose Russian gas over someone else's though there was always diversification.\n\nAnd Russia's economy is now running entirely on war economy, that mode is not an indicator of health because the state can print as much money as it wants and obviously orders are there because the state mandates industrial output for the war.\n\nSo it hurt both sides and Russia is the one in a quagmire where the outcome is not set.", "label": 0}
{"text": "I don't believe her for a second.", "label": 0}
{"text": "Why would they want to join our poor union where everyone are living in poverty and have no financial freedom.", "label": 0}
{"text": "I heard Ukraine may find the use for few thousands Tomahawks as their own business.", "label": 0}
{"text": "I can see his plan now, Russia is week, time for the Belarusian to move and be in Moscow in 3 weeks, always works, 70% of the time....", "label": 0}
{"text": "So far living contractors have been paid. Where it gets iffy is if you die. If there is no corpse the Russians classify you as AWOL/captured and the family gets no payout. This is the case even if your unit testifies that you died in battle.", "label": 0}
{"text": "Fashism Is hell of a drug", "label": 0}
{"text": "This is just Deepstate level conspiracy theory for left wingers.", "label": 0}
{"text": "Its not gonna be their business when north korean POWs realize are being treated better in ukraine than they were in north korea", "label": 0}
{"text": "The recognition isn't worth much if the statistic is that faulty. :)", "label": 0}
{"text": "They are", "label": 0}
{"text": "This actually touches a good point that I also think needs focus, more cooperation between EU countries. I hope the Netherlands and Germany can take the lead once the factory from Dresden  opens", "label": 0}
{"text": "Italy looks like shit as always", "label": 0}
{"text": "They don't live in Switzerland. Why is this sub full of parrots who can't be bothered to google the most basic information for 2 minutes.", "label": 0}
{"text": "> Dont be an Idiot. Just because the FDP is destructive didnt absolve the SPD of their own failures, which will haunt Germany and its people for decades to come.\n\nCare to explain which ones that would be?\n\n>The biggest example here without a doubt being Russia. The SPD was THE driving force between the growing economic interdependence of Russia and Germany aswell es several diplomatic blunders - like Minsk II.\n\nYou mean the thing the CDU didn't care to change in the last 16 years and even decided to be more dependent on because they refused to invest more in green energy killing all our leading companies in that field? Oh yeah sure must be all the SPDs fault...\n\nUhm, who again was the chancellor during Minsk II and could to point them out in this picture? https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Normandy_format_talks_in_Minsk_%28February_2015%29_03.jpeg/1920px-Normandy_format_talks_in_Minsk_%28February_2015%29_03.jpeg\n\nhttps://de.wikipedia.org/wiki/Minsk_II\n\n>Or what about not only their help in pratically stopping and destroying the German solar industry 12 years ago, but gleefully doing the same thing to the wind industry just a few years later?\n\nWho was chancellor again at that time? Do you have problems differentiating CDU and SPD? I know it's hard they even share on letter even when it's not at the same place...\n\n>The greatest and latest example of their stupidity and shortsightedness would be the Rentenpaket 2. Another reform that solves nothing but punishes everyone under the age of 40.\n\nYou mean the system the CDU didn't care to even touch for 16 because it's a giant shit show? It's interesting how the CDU needed to be out of the picture so the government would even start to touch it... And here we also have again the FDP shitting all over the place because they suddenly don't like the version they previously agreed on anymore. But I'm sure you would prefer to do nothing making it even more expensive and driving more old people into poverty?", "label": 0}
{"text": "You don't make peace with only your friends, by definition.", "label": 0}
{"text": "Im sure you are eager to explain it to me", "label": 0}
{"text": "Russian dollars on bank account", "label": 0}
{"text": "Could say the same shit about US debt.", "label": 0}
{"text": "You don't make peace with your friends. If you don't go and meet them, what chance does diplomacy has?", "label": 0}
{"text": "\"As you can see I'm Dark UN today\"", "label": 0}
{"text": "Make Russia Small Again", "label": 0}
{"text": "Thanks.", "label": 0}
{"text": "Luckily no lives forever", "label": 0}
{"text": "A little different to find the common explanations for the group of surplus countries", "label": 0}
{"text": "Switzerland is not a direct democracy. They are an indirect democracy, just with more referendums than other countries.", "label": 0}
{"text": "BREAKING: The 🇺🇸 U.S. now believes 🇰🇵 North Korean troops could soon deploy to Kursk to help 🇷🇺 Russia fend off a Ukrainian incursion, per NSC spox John Kirby https://x.com/laraseligman/status/1849860306174161166", "label": 0}
{"text": "\\> supposedly closest Russian ally\n\n  \nWhat do you mean by that?", "label": 0}
{"text": "Good thing their three day special military operation is running on schedule, and their deadline for pushing Ukraine out of Kursk is also right on schedule!", "label": 0}
{"text": "Julianne Smith was specifically talking about the short-term aspect of arms purchases for supporting Ukraine and making up the defense shortfalls especially in countries bordering Russia. She agrees with Europe's long-term focus on fostering domestic defense capabilities.", "label": 0}
{"text": "Thanks for the answer. And yes I agree there has to be reliable backup energy source. But even if it's there, it will be (comparatively) expensive. I believe manufacturing will most likely invest in storage, adapt to the times and seasons of greater energy availability, or both. Mostly for cost reasons.", "label": 0}
{"text": "Where have I heard that before? Oh yeah! Ukraine- after the Putin’s puppet fled Ukraine to hide out in the kremlin", "label": 0}
{"text": "Great success", "label": 0}
{"text": "What a bloody troll, Europe is cowering now to appease him, but it wont save us from being next in line", "label": 0}
{"text": "That’s your assumption- which is incorrect.", "label": 0}
{"text": "And the ufc fighter doesn't have weapons?", "label": 0}
{"text": "3 degrees THIS CENTURY...  so by 2100\n\nI hate how everyone just stops at that date.  \n\nWhat does this look like VERY long term, like year 3000.  Are we looking at like 20 degrees by then?  \nDoes it stop or plateau at some point?   \nDo people start dying from Co2 poisoning at a certain point?  \n\nSo many questions just handwaved away by limiting the forcast length.", "label": 0}
{"text": "Yeah, since he's selling it to the Russians as well via the UAE.[1](https://www.wsj.com/world/russia-buying-musks-starlink-systems-in-arab-countries-ukraine-says-a0185f55) [2](https://www.newsweek.com/starlink-russia-ukraine-dubai-spacex-elon-musk-rumors-pentagon-1868461) And because he shutdown Starlink coverage ahead of Ukrainian strikes.[3](https://www.theguardian.com/technology/2023/sep/07/elon-musk-ordered-starlink-turned-off-ukraine-offensive-biography) [4](https://www.politico.eu/article/elon-musk-ukraine-starlink-russia-crimea-war-drone-submarine-attack-sabotage/) [5](https://www.bbc.com/news/world-europe-66752264)\n\nYou vatniks always put those emojis in your comments, if you want to seem more credible on reddit, you should avoid them in the future.", "label": 0}
{"text": "So same a in Germany! I was expecting worst 😅", "label": 0}
{"text": "So is this NK shit is Putin's the idea how to deal with Kursk without taking troops from Ukraine/Donbass or new recruits? I just wonder what does NK get from this deal? Battle experience for the troops? Nukes? MBRs? Food? What? \n\nNo idea, what could one promise to a country so that it sends its own citizens to fight in a foreign war.", "label": 0}
{"text": "Why are you being downvoted to death for a genuine question?", "label": 0}
{"text": "Nope, I am just saying that the reason we have not destroyed Putin is because he has 6,000 nuclear nukes. Or it will be already over. I mean you guys can downvote but this is the reality", "label": 0}
{"text": "Hungary is the bad one here as they pay almost twice the rate as Italy.", "label": 0}
{"text": "I remember making this argument in the 90s, when it became obvious that the West was sending its most greedy businessmen there to get rich quick. It was obvious that they would create a gangster state, but the opportunity to make money means they can spread it around the politicians and seem like the most confident people in the room.\n\nNow they’re doing the same thing with climate change.", "label": 0}
{"text": "we'll imagine his arms and legs are his weapons because he is fighter and automatically dangerous like he had weapons.", "label": 0}
{"text": "No, I'm not a soldier. I would, however, sign up if Putler would attack us.", "label": 0}
{"text": "And at the same time were supposed to have kids while both parents work, can’t afford a house with soaring prices for rent / acquisition and have trouble finding reliable care for our children. Yeah, just fantastic, absolutely fantastic", "label": 0}
{"text": "In front is the statue of Poseidon.", "label": 0}
{"text": "As a Serb, I don't want us entering EU with Vučić in power honestly.", "label": 0}
{"text": "Statue of Poseidon", "label": 0}
{"text": "What's up with Switzerland? Don't they have direct democracy where every person votes on their phone on complex political issues and then brag about it online", "label": 0}
{"text": "Apparalty its a problem deporting people to countries that don't accept them back.\n\nHow will they solve that ?", "label": 0}
{"text": "I'm Flemish and I did indeed check the Netherlands first lol", "label": 0}
{"text": "Yes in contact means friends, solid logic.", "label": 0}
{"text": "Haha same I'm from Bulgaria.", "label": 0}
{"text": "Building NS2 after Ukraine already got invaded is absolutely treason.", "label": 0}
{"text": "Whataboutism is a real fallacy, it's just that he (and half of reddit) use it wrongly", "label": 0}
{"text": "I’m going to suggest something really crazy and propose that there just might be something in between “Germany makes the EU/it’s members do things” and “the decisions of Germany have no weight at all”.", "label": 0}
{"text": "Least insane trump cultist", "label": 0}
{"text": ">India obviously walks a thin line between democracy and dictatorship. \n\nNo, it doesn't. Not even close. India's a regular democracy.\n\nG7 is just for large *industrialized* democracy. India is a developing country, not yet industrialized.", "label": 0}
{"text": "Why you don't annex me, Putinu onii-chan!!", "label": 0}
{"text": "Yeah it’s not very good for democracy when half of your population is severely limited in rights based on sex.", "label": 0}
{"text": "PPP does not account for social transfers. That’s untrue. \n\nGDP has grown a lot since the 70s and arguably people have less purchasing power", "label": 0}
{"text": "You are correct if you mean literally killing Putin. However Russia would be done already if they had given Ukraine what they needed when they needed it.  If the west is afraid to go against Russia because of nukes then better start learning Russian.", "label": 0}
{"text": "There are plenty of them around the world. It’s just that most of them are educated and would rather stay in their home countries doing skilled labor than to live in Europe working an entry level job. Too bad they don’t want the jobs the locals don’t want to do either. \n\nPersonally if I wanted to immigrate to one of the rich European countries for some strange reason I doubt I would find a good job there in my current skill and experience level. Assuming I found an entry level job or something like that I might earn more than in my current job in absolute numbers but my quality of life would drop as everything would be more expensive as well.", "label": 0}
{"text": "Krusk already looks mostly dealt with tbh mate. Ukraine stopped moving forward after the first week and has lost about half or more of the area they captured and is putting out fires on every front including Kursk.", "label": 0}
{"text": "or production. new production can fuel new money, kind of a egg or chicken dilema, who was it first. germany has thrived for the last decades on the whole world taking dept and buying german goods, basically, what you said, additional money entering the german economy.", "label": 0}
{"text": "It's a Swedish proposal. A classic Nordic nanny state law.", "label": 0}
{"text": "So the 2nd strongest army in the world attacks a country with 1/4th of their human resources, with a fraction of West deliveries in their defense. And you try to make it sound like the balance is on the midget's (ukraine) side? Take your meds lil bro", "label": 0}
{"text": "Ok Vlad, settle down.", "label": 0}
{"text": "Denmark also dominates in aid to Ukraine as a percentage of their GDP:\n\nhttps://www.statista.com/statistics/1303450/bilateral-aid-to-ukraine-in-a-percent-of-donor-gdp/", "label": 0}
{"text": "hmm, what's going on with Musk?", "label": 0}
{"text": "Putin remains a master strategist!", "label": 0}
{"text": "I too am of the opinion that the housing market needs profound reforms to return to normalcy, even more radical reforms than those you propose; and yet to delude oneself that the demographic winter is only a problem of purchasing power is that: just an illusion. The issue must be approached with far more sympathetic answers, which go towards culturally making the concept of having children no longer an oppressive economic burden, having to operate not only on purchasing power but also on explicit support measures for couples with children, aiming at a future of universal childcare.\n\nAt the same time, it is unlikely that even these measures will suffice to achieve the demographic growth we seek for both foreign industrial competitiveness and domestic financial sustainability, as well as being extremely costly and very gradualist policies, slowly burning-in the cultural mantle of a society that currently has an idea of having children that is radically distinct from that of past generations, which is why a serious policy of vigorous regulated and assimilated immigration is not only the obvious best choice but a great opportunity for the dynamic common cultural and economic prosperity of all of Europe.\n\nTo not understand it and to oppose it in such a dogmatic and vitriolic manner is really beyond my comprehension. Are you really so intimately racist as to be disgusted by the prospects of the continent as a solid, fraternal land of opportunity, of a European dream and a dream of Europe?", "label": 0}
{"text": "That's not Germany asking for the tax, that's the churches taking it. It's not even a tax.", "label": 0}
{"text": "He is being himself.", "label": 0}
{"text": "Doubt they're duped as often as they seem to be, journalism is a tit for tat business. The real dolts are the ones that do Russia's bidding for the love of the game, to defend ideological hills, like Chomsky the genocide denier.", "label": 0}
{"text": "NATO boots on the ground means direct war between NATO and Russia, and that means professional soldiers are not enough and you will be fighting too. \n\nI hope it is clear to you what are you arguing for.", "label": 0}
{"text": "Chancellor Schroder gave up nuclear. He was an actual Russian who even moved to Russia and managed a Russian oil Company.\n\nMerkel just continued it.", "label": 0}
{"text": "You are lucky if you get any paycheck at all.", "label": 0}
{"text": "Please God that Armenia joins the EU.", "label": 0}
{"text": "Well no more slaves for the rich, good. \n\nFuck wage slavery.", "label": 0}
{"text": "Hey Elon, where is the freedom of speech you wanted to defend by taking over this network?!?!?!??", "label": 0}
{"text": ">  from Palestine \n\nThere was no state of Palestine in 1950. Jordan annexed the land from the expiring British mandate in the course of the war in 1948.\n\nThe \"state of Palestine\" was not proclaimed until 1988.", "label": 0}
{"text": "???\n\n>tbh I'm a primitivist, the only thing that matters is food production.\n\nMate, what? Literally your first sentence. I got curious about your views because you said that specific sentence lol.", "label": 0}
{"text": "you sound like a hippie, you forsake meritocracy to satisfy the cult of diversity", "label": 0}
{"text": "And what's the East™ doing differently? Nothing.", "label": 0}
{"text": "Saying Vučić is a Četnik is an insult to Četniks.", "label": 0}
{"text": "Not really...maybe niche industries but I can't think of the last time I was required to send a fax for anything legal, medical or government related.", "label": 0}
{"text": "As much as to criticize the Russian government the central bank has actually been managing things pretty well. The huge pile of gold their sitting on certainly does help tho", "label": 0}
{"text": "Do you think he’s calling him to ask what he did over the weekend? Be for real.", "label": 0}
{"text": "I doubt it", "label": 0}
{"text": "Yes, and Croats don't complain any bit more than Romanians, French, Greeks, etc.", "label": 0}
{"text": "Enlighten me, if you give the world wars as an example, when and what was negociated with Japan, regarding it's surrender to the allied forces?\n\n\nhttps://en.m.wikipedia.org/wiki/Potsdam_Declaration", "label": 0}
{"text": "Ohhh no, it very much isn't you delusional fks", "label": 0}
{"text": "Excuse me... excuse me...  Our whining is so good, that nobody does it better than us. We usually ace the tests of whining. We have the best whining! The best. Not like some other shithole countries. No. We have the best words for whining. It's tremendous!", "label": 0}
{"text": "Putin and his puppets are all praying Trump is going to win and save them.\n\nSo Americans go out and f*in vote. So many life depend on it", "label": 0}
{"text": "”but whatabout Poland ” is not an argument.\n\nAnd also NS1 and NS2 wasn’t economic projects ,trying to argue thats why Eastern European countries were mad at Germany is just dishonest at best.\n\nGermany made a deal with russia to fuck over eastern europe and you are mad at Poland for critiquing that.\n\nOh and everyone who is against north stream only wanted money from Germany ,is such a close minded German ridiculous take, everything is about money for you guys.\n\nTell me why the baltics were so against North Stream , did they also want to blackmail germany for cash? Or just maybe they were worried about their geopolitical situation?", "label": 0}
{"text": "I'm not advocating primitivism, I'm looking at things in a more primitivist way. To me it reflects reality better than post-feudal abstractions.\n\nI don't think we should ever revert back to pre-industrial society, that's insane.", "label": 0}
{"text": "Okay. Wasn't it called 'Mandatory Palestine'? But I admit, I do not know enough about that. \n\nDoesn't that still mean Israel now occupies region that Jordan didn't have the mandate to give up to them?", "label": 0}
{"text": "Sure, the facts do disagree with that, though, but you do you.", "label": 0}
{"text": "Before long Putin will tell us that he will not be the one to see the Russian people suffer from cowardice while Kim Jong-un will repeat his “Our nuclear force is invincible and can wipe out any enemy” quote , two very dangerous dictatorships", "label": 0}
{"text": "When the west started to help Russia started screaming and threatening with red lines and nukes and now Russia is doing the same thing they were screaming about and more. At this point there is no red line.", "label": 0}
{"text": ">>Last time I checked Israel wasn't a NATO memner state. So i am not sure where you got the \"when we do it\" from - your behind, most likely. \n\nDo they not have military alliances with the west, predominantly USA? And its even better if they are not in NATO, that way you can bomb them for their crimes :) \n\n>>Also, Gaza brought this war entirely on themselves\n\nReally? 40 thousand dead civilians, most of which women and children, were personally responsible for and brought that war up on themselves? That is some solid logic, cant argue it.\n\n\n>>Whataboutism isn't an \"imaginary word\", my little challenged friend.\n\nLet me explain it in a words that an enlightened one, such as yourself, can understand better. You say that Russia did X, I say that that Israel/West also did X, you call for `whataboutism` i call for hypocrisy which it essentially is, just a imaginary term used to defend from accusation of hypocrisy, nothing more, my enlightened friend.", "label": 0}
{"text": "Every accusation is an admission. When Musk cried about how Twitter favored the democrats he was merely projecting how much he would abuse the platform for the republicans if/once he owned it. It’s pathetic all around, but unfortunately effective.", "label": 0}
{"text": "Yes Israel occupies the West Bank. They unilaterally withdrew from Gaza in 2005 but given how things turned out there I guess nobody is surprised that Israel doesn't want to repeat the same story in the West Bank.", "label": 0}
{"text": "Yes, i was being generous", "label": 0}
{"text": "What a surprise, the \"freedom of speech absolutist\" turns out to mean \"absolutely no freedom of speech\".", "label": 0}
{"text": "What's the alternative?\n\nIf you compare the European standard, it's much higher than most of the world and it will be even if the economy tanks massively.", "label": 0}
{"text": "You literally have a dictator", "label": 0}
{"text": "Why thank you! Never knew Germany was a religious state. I suppose I can tax Germans at 10% rate if I'll come as a religious organization saving the population from extinction.", "label": 0}
{"text": "Meaning they only pay for what they use, how is that not fair?\n\nI bet you'd rather Switzerland additionally be subsidising the east, considering you're from the largest net beneficiary...", "label": 0}
{"text": "Honestly, who cares? Things are going pretty good already.\nOnce the clean energy transition is done and the wars are resolved this should solve itself anyway.", "label": 0}
{"text": "I live in Poland and there was no crazy fluctuation, just steady inflation.", "label": 0}
{"text": "I honestly don't understand who you are talking about. I Guess Vucic? I don't know enough about Serbian politics tò retort in any way.\nMy position was a little more... General", "label": 0}
{"text": "Thats why you have the channel, lads.", "label": 0}
{"text": "How are they this useless? Complete control of the narrative and still loses", "label": 0}
{"text": "Its the Holy Grail; how to make money off fat Americans.", "label": 0}
{"text": "But we don't want to be a part of the EU. Shouldn't we as citizens of Serbia consulted first?", "label": 0}
{"text": "Spain obviously", "label": 0}
{"text": "Could be.", "label": 0}
{"text": "Yet again more reasons to doubt Elon's supposed motives.", "label": 0}
{"text": "Perhaps, but it's also in Europe's interest to keep Russia out of the Balkans.", "label": 0}
{"text": "> and their families receive huge amounts of money in case of \"missing\" or death.\n\nThey usually avoid paying out on these, though. They even fudge the records or falsely decclare the dead soldiers missing.", "label": 0}
{"text": "In other words, marriage no, simply fuckin, sure…", "label": 0}
{"text": "Doesn't his platform still discourage the use of trans flags?", "label": 0}
{"text": "Honestly bleeding a country the size of a continent for a war with way smaller but stubborn enemy is craziness", "label": 0}
{"text": "Nobody likes a pedant, clearly they meant amenities", "label": 0}
{"text": "Not russian, but according to ROMIR deflator:\n\n* 41% in 2022\n* 38% in 2023\n* 28% in 2024 (january to september)\n\nhttps://www.reddit.com/r/CollapseOfRussia/comments/1gc2d42/inflation_in_russia_20202024/", "label": 0}
{"text": "The European Union is concerned by reports of North Korea sending troops to Russia for its war against Ukraine, seeing this as a serious breach of international law and a hostile act that threatens global peace.\n\nThe EU firmly criticizes the increasing military collaboration and arms transfers between North Korea and Russia, which violate numerous UN Security Council resolutions, and calls on North Korea to cease its support for Russia's illegal military actions.\n\n„The European Union is deeply alarmed by reports that the DPRK is sending troops to participate in Russia’s illegal war of aggression against Ukraine. This would constitute a serious breach of international law, including the most fundamental principles of the UN Charter” – it was stated in [the official statement ](https://www.consilium.europa.eu/en/press/press-releases/2024/10/24/russiaukraine-statement-by-the-high-representative-on-behalf-of-the-eu-on-reports-of-the-dprk-sending-troops-to-russia/?utm_source=brevo&utm_campaign=AUTOMATED%20-%20Alert%20-%20Newsletter%20from%20TST&utm_medium=email&utm_id=3318)published on behalf of the 27 EU countries by Josep Borrell, the EU's foreign affairs chief.\n\n# The EU denounces the deepening military cooperation between Russia and North Korea\n\nAccording to Borrell, Russia's increasing military partnership with North Korea indicates that, despite claiming to be open to negotiations, it is not genuinely pursuing a fair and lasting peace but rather escalating its war efforts by seeking help from disruptive global actors.\n\nThe EU's top diplomat indicates that Russia's recent stance on North Korea's denuclearization undermines its commitments under the Non-Proliferation Treaty and violates several UN Security Council resolutions, compromising its role as a permanent Security Council member.\n\nThe ongoing support from North Korea for Russia's aggression in Ukraine highlights the interconnectedness of European and Indo-Pacific security, prompting the European Union to work with international partners on an appropriate response, as declared by the EU's High Representative for Foreign Affairs and Security Policy.\n\nSource: IAR/DPA/X/@EUCouncilPress/consilium.europa.eu\n\n(m p)", "label": 0}
{"text": "Ozempic is a wonder drug, there is research it reduces addictive behaviour, such as drink, that it helps against Alzheimer, and generally helps against inflammation.\n\nWe will all be on GLP-1 drugs in a decade.", "label": 0}
{"text": "Musk is literally doing exactly what all MAGA and other far-right conspiracy theorists think people like George Soros, or Jews in general are doing with media. He's a foreigner who bought the biggest platform for news in America (like it or not, people get news from twitter), goes private, cuts any transparency in how the platform runs, and he's now manipulating the spread of news to influence the American elections. This would be so funny, if it wasn't so potentially dangerous for the entire planet.", "label": 0}
{"text": "All the money messed with his brain so he thinks he is a god now.", "label": 0}
{"text": "That's completely wrong. I presume it is not deliberate, but you have used the aid figure with refugee assistance stripped out and the gross national income figure without capital outflows removed.\n\nIf you use the total aid figure from your dataset (€2.57 billion) and the [CSO figure for the same year](https://www.cso.ie/en/releasesandpublications/ep/p-ana/annualnationalaccounts2023/gniandde-globalisedresults/) (€267 billion) then the figure is 0.963% of GNI.", "label": 0}
{"text": "I have had a feeling for some time, that Luka has grown to like Belarus being sovereign nation and that Russian isn't really a friend.", "label": 0}
{"text": "And you're the authority on that? 🤣🤣 You don't live in either of those, nor do you speak the language. Croats are 100% complaining more, but this discussion with you is pointless because you're going into the discussion with bad faith.  You'll always be able to call me wrong based on your subjective feeling", "label": 0}
{"text": "A very shitty thing to do and very hard thing to prove!", "label": 0}
{"text": "Germany paid [300 billion euros](https://www.ecologic.eu/19435) alone for relief measures for citizens and industries.", "label": 0}
{"text": "Ahh that's what you mean. Yeah that's fair. Basic needs are a better indicator in a lot of ways I agree on that. The rest is more about freedoms and self actualization, which has a lot of value too but it's ultimately secondary. I'd include shelter in that too. \n\nWhy birthrate keeps falling down is mostly because we are competing for resources in cities in my opinion. Very stressful and cramped, so nature does what nature does and reduces the competition. Economic systems will suffer for it though, that will create some artificial scarcity for food where food exists but isn't easily reachable.", "label": 0}
{"text": "Putin owns Musk, Trump and most of the Republicans in congress", "label": 0}
{"text": "Started when Russia was destroying Chechenia.\n\nSo are bad 2000, but the west didn't see it, then 2008 Georgia, then 2014 Ukraine.\n\nBut sure let's join with Russia and build ourselves a pipeline, and put a chancelor as executive in company maintaining it. Good job Germany.", "label": 0}
{"text": "We're approaching The Great Filter.", "label": 0}
{"text": "How ironic of Musk. Complaining that the media is being censored and than does the same to people who criticize him or republicans on X/Twitter.", "label": 0}
{"text": "i think the entire europe uses the \"bismark\" system", "label": 0}
{"text": "Do you want to say that Elon Musk is not world's most shining defendant of free speech? How dare you!", "label": 0}
{"text": "Hi, thank you for your contribution, but this submission has been removed because question posts are not allowed on r/europe. See [community rules & guidelines](/r/Europe/wiki/community_rules).\r\n\r\n\r\n\r\nIf you have any questions about this removal, please [contact the mods](/message/compose/?to=/r/Europe&subject=Moderation). Please make sure to include a link to the comment/post in question.", "label": 0}
{"text": "\"Sir, you are under arrest. Please stay calm\"", "label": 0}
{"text": "Fur Deutschland! (Też tak robię)", "label": 0}
{"text": "Thank you so much! Actually I was on my way to work and shot this photo in a hurry and didn’t think much about composition. It kinda just happened and was really happy with it afterwards", "label": 0}
{"text": "You can have hobbies, friends a career and children.", "label": 0}
{"text": "I agree. She’s a cunt.", "label": 0}
{"text": "I don't want us entering even without him. Especially without him.", "label": 0}
{"text": "It exists for 30. 20 years to go, and original countries will pass the mark. Too bad UK will need to start all over again.", "label": 0}
{"text": "Finally at least some real arguments.\n\n>Her narrative was to shut down nuclear plants because of environmental impact and but cheaper Rushists gas.\n No. First at all, germany started the exit of nuclear in the late 80s under Kohl - by simply stopping to build new ones (and not starting the newest, nearly finished one in Kalkar). And, the overwhelming majority was in favor of  nuclear exit - Merkel just reacted to that. It would have even been nearly completely ok, if the government didn't kill the renewable at the same time. The gas dependency was discussed and criticized ironically by our current Economic Minister Habeck from the green party.\n \nBut what clearly shows the irrelevance of nuclear vs gas is: Germanys usage of gas for electricity was/is rather small.\n\nPeak nuclear was 2000-2006 (around 170TWh), Peak Gas 2020 around 90TWh. Renewables: 90TWh in 2007, 170TWh in 2015, and by 2022 we were around 260TWh renewables. If you look at CO2 (and pollution), than it's absolutely fine to complain about Nuclear exit before coal. \nWe used  by far the most gas for heating ( another part for the chemical industry). And that was more or less irrelevant to nuclear energy or not. (But obviously not to the high prices).\nThats what also your linked paper (in hindsight) got wrong, natural gas is nearly on the same level as 2008. \n>Germany’s decision to be free of nuclear power by 202324 will greatly increase its reliance on hydrocarbons to generate electricity over the coming decade, in particular natural gas.\nSee here: https://www.cleanenergywire.org/sites/default/files/styles/gallery_image/public/paragraphs/images/fig2a-gross-power-production-germany-1990-2023-source.png?itok=x1IW2WRw", "label": 0}
{"text": "Saw the joke. Didn't understand the joke. Decided to go for insults.", "label": 0}
{"text": "Well yes and no. Its very high interest rate at one end but Russia always had high interest rates. Russia had if I remember correctly an interest rate on like 8 procent prior to the war. Thats an increase of around 170 procent which is alot. On the other hand countries like Sweden had around 0.25 procent which increased to 3.25 which is an increase of 1200 procent. (We even had it at 0 and negative for a few years). Our economies are  fundamentalt very differently built so its hard to compare with ours. If ours would have jumped to even the 8 procent they normally are hovering around our economy would collapse due to the difference. Most countries had high interest rate in the past tough.", "label": 0}
{"text": "And still, everyone is staying on X.", "label": 0}
{"text": "But he was right. \nGerman money gave Russia fuel to attack Georgia, later in 2014 Ukraine first time and in 2022 second time", "label": 0}
{"text": "Germany only overtook Japan in GDP last year because of the cheap Yen.", "label": 0}
{"text": "What happened? Does Elon moderate r/europe too? 😮", "label": 0}
{"text": "This is a lot of words to justify Serbian murder of innocent civilians on a massive scale.", "label": 0}
{"text": "Source?", "label": 0}
{"text": "Look at the US, compare states like Delaware to Texas to California to Massachusetts to Arizona or to Florida. All economic success stories in their own right, all different areas of specialisations and making the most of either their natural resources and cultural/geographic advantages and in lieu of that have created their own advantages, whether be tax based, education based, law based etc. \n\nWe have become obsessed with enforcing this level of equalisation across all of Europe that actually benefits nobody when each region, nation, province should be focusing on what they are either good at or what they can be good at to attract industry/talent from elsewhere.", "label": 0}
{"text": "Obviously getting reliant on Russian gas was a mistake but I would never call it traitorous. Merkel always thought the best way to tie down Russia was via the market and via diplomacy. Increasing trade between the west, china and Russia was (and still is) supposed to stop imperial ambitions.\n\nThis isn’t how it turned out at all but it does seem like an honest mistake. From her perspective back then, trade with Russia maximizes prosperity in Europe AND prevents another Cold War. \n\nI also think it’s funny that everyone is blaming her for the market ties with Russia but globally, we are all tied waaaay closer to china. It’s the same situation and china might start some similar shit in the next years. So where are the people calling all current leaders traitors for their Chinese market ties ?", "label": 0}
{"text": "https://www.ege.fr/actualites/rapport-dalerte-ingerence-des-fondations-politiques-allemandes-et-sabotage-de-la-filiere-nucleaire-francaise\nEnglish version available at the bottom of the page", "label": 0}
{"text": "Counterpoint: Hungary", "label": 0}
{"text": "This needs to be shared on to more subreddits.", "label": 0}
{"text": "Maybe that's the problem? We are over 6 billion people and we all compete. Our high standards are unattainable? 🤷", "label": 0}
{"text": "You'll be downvoted, but it's 100% the truth, yeah being poor and not being able to afford housing sucks, but to think that's the sole or biggest reason is dumb. \n\n\nIt's mostly our mentality that's changed, if quality of life was the main driver of our birthrates, then Europe would be the most high birth continent while Africa the lowest, but it's the opposite.", "label": 0}
{"text": "The Italian economy should harness the power of pasta.", "label": 0}
{"text": "You nailed it. Urbanization seems to be the primary factor. Germany's economic success was based around them being spread out into many towns instead of huge urban centers.\n\nIn large cities one business can provide services to tens of thousands. But if you spread that population out into smaller communities, suddenly you need that same business in all of these places. More people get employed, more transportation is needed,  economic activity goes up.\n\nArtificial scarcity is humanity's worst sin. I go full Marx just thinking about the absurdity of it all.\n\n\n-\"No, I cant give you food\"\n\n-\"Why?\"\n\n-\"Well if we pretend there isn't a lot of it I can exchange it for more stuff from you. I am a genius and deserve it\"", "label": 0}
{"text": "Austria is trying to look real small while Germany gets all the heat", "label": 0}
{"text": "This research from EPA: [Europe’s state of water 2024: the need for improved water resilience | European Environment Agency’s home page](https://www.eea.europa.eu/en/analysis/publications/europes-state-of-water-2024)", "label": 0}
{"text": "It’s chosen because many knockoff cascading effects will start around then", "label": 0}
{"text": "All countries aiding Ukraine to Putin: it’s our business.", "label": 0}
{"text": "The Baltic States and Poland not sharing the top 5? I call bullshit!", "label": 0}
{"text": "Yep, in Croatia 15% of gross pay goes ro currently retired and 5% goes to me.", "label": 0}
{"text": ">\"President Vladimir Putin said on Friday that it was Russia's business whether or not it decided to use North Korean troops and said that if Ukraine wanted to join NATO then Moscow could do what it wanted to ensure its own security.\"", "label": 0}
{"text": "I’ve read in UA news that the issue is in Usyk’s privacy settings, so that checks out.", "label": 0}
{"text": "Oh no not mighty Serbia", "label": 0}
{"text": "I won't take meds if you have the US on one of the sides, which spreds hatred and wars all around the globe, and now they're considered good guy for helping the ukraine. \n\n  \nImagine Russia helping in all of the wars US are leading across the globe", "label": 0}
{"text": ">Idiots here expecting Guterres to bitch slap Putin and stick a pair of handcuffs on him or something.\n\nthe \"idiots\" probably just expect Guterres not to show up to a meeting and then hug and hang out with brutal blood thirsty dictators who have essentially took the UN charter and whipped their asses with it\n\nThis was not a UN event, he did not have to show up to this", "label": 0}
{"text": "True... until Novo manages to shave off the enzymes treating each of those individually... and maintain the price.", "label": 0}
{"text": "As if Belarus was a state instead of the Russian oblast #50.", "label": 0}
{"text": "It’s literally his job to go lol", "label": 0}
{"text": "\"missing\" does get payout. But soldier becomes \"missed\" only in 6 months if no one seen his death and marked as dead 3 months after oficially \"missed\". I know bunch of people who currently serving by contract, even some relativies, including one family friend \"missed' and then \"dead\", never heard about any problems with payments in my region", "label": 0}
{"text": "Good 👍", "label": 0}
{"text": "Because unlike other countries where women must choose between career and maternity, in France a mother who does not work is poorly perceived so things have been put in place to facilitate this double life so women are less afraid of having children, so the main fear is the cost of living. \n\nAnd of course, there is immigration that also benefits from social assistance even though all this could change as access to care becomes more difficult with the shortage of doctors. I personally gave up on having a third child because my attending physician refused to care my children (cause of too much patients)  and it took me more than a year to find a new doctor, which had caused me to be behind in vaccinations.", "label": 0}
{"text": "Lal like Ivan speaks English ", "label": 0}
{"text": "Selling your country's future for cheap has consequences.", "label": 0}
{"text": "I have no idea what they talked about and neither do you.", "label": 0}
{"text": "Ok. So we can stop that UN bullshit and close that organisation.", "label": 0}
{"text": "Negotiations with Russia are effective only when the other party has leverage, as leverage creates pressure and incentives for Russia to make concessions. Ukraine’s attempts at negotiating with Russia ultimately fell through because Ukraine lacked this leverage; without the power to impose meaningful consequences or gains for Russia, there was little reason for Russia to compromise. In negotiations, leverage shapes the balance of power, and without it, reaching a favorable outcome becomes nearly impossible.", "label": 0}
{"text": "Her strategy with Russia was pretty level headed. It just backfired spectacularly. She, like many other leaders, decided that trade and diplomacy are the best tools to prevent conflict. This is the same shit that’s happening with china. Our markets are so heavily dependent on each other that conflict would ruin both sides.", "label": 0}
{"text": "They're just asking the west to do something and so win the argument... somehow...", "label": 0}
{"text": "But are you working?", "label": 0}
{"text": "Who denies that? Between 1945 and 1991 there are almost 50 years and Belgrade was capital and all republics were vasals to your communist command in a way. And from 1991 until today only 33 years have past.", "label": 0}
{"text": "🇹🇷💪🏻💪🏻💪🏻💪🏻💪🏻", "label": 0}
{"text": "What's your point, that Russia is barely hanging on with the scraps the west has sent?", "label": 0}
{"text": "Thank god you don’t, you can go to your Russian buddies. And do you really care about Muslims being genocided? Because I seem to remember that was like your whole national thing.", "label": 0}
{"text": "What is this bullshit, you got ruskies nukes on your land, go fucking dig some potatoes for your occupiers imbeciles", "label": 0}
{"text": "\"reality is different\" b*tch I live in it, stop the bs", "label": 0}
{"text": "Assistant Regional Manager!", "label": 0}
{"text": "Do you really think that Musk, Trump, and most republicans in congress can't be giant cunts who are a threat to democracy on their own, without being coerced? I think they manage.", "label": 0}
{"text": "That's not possible. Orthodox Christian brotherhood and anti NATO are especially skyrocketed in Serbia. They don't deny that and their recent statement of officials who visited Russia said they \"will not survive without Russia\".", "label": 0}
{"text": "If you share a cookie with 1 million people, do you care that it was marginally bigger than a cookie that was shared by just 10?", "label": 0}
{"text": "No shit more civilians died, that’s the case in every war. And of course no UNSC approval was given, they are a complete joke of an institution that don’t do shit. Did peacekeepers in Rwanda do anything? They absolutely didn’t.", "label": 0}
{"text": "Thanks.", "label": 0}
{"text": "Like this exact statement itself.", "label": 0}
{"text": "The EU is stronger now than ever since Russia started fucking around.", "label": 0}
{"text": "nothing mentioned here said anything about growth", "label": 0}
{"text": "That'll show them", "label": 0}
{"text": "Germany and France would love to have countries that arent broke join for a change", "label": 0}
{"text": "What are you even talking about", "label": 0}
{"text": "Cliché much?", "label": 0}
{"text": "Rheinmetall", "label": 0}
{"text": "_Orbanistan will never accept this!_", "label": 0}
{"text": "The West didn't \"send its most greedy businessmen\". They did that voluntarily.", "label": 0}
{"text": "The head of the UN consorted with leaders who represent almost half the world and control all the resources, affecting the world's economy and prosperity.\n\nOnly a Redditor would be childish enough to think they should be boycotted. \n\nIt's frankly amazing that you think the UN should solely serve Western interest while forgoing everyone else. By Western, I mean Europe and North America, who only represent 13%.\n\nInsane that you think Russia will just pull out just because. You talk about International law, but the US and NATO invaded and ruined Iraq, Afghanistan, Syria, Libya, Yemen, and now supporting the war against Lebanon.\n\nRussia isn't even tapping into their stockpile. They're using their old Soviet weapons and that from NK.", "label": 0}
{"text": "they are poor because their culture, politics,religion .. but that  doesn't mean  that there is not a lot of talent in India and a lot of people who deserve to have a much better live. the key I think is to legislate to filter those ones and get rid of the scammers . Please lets not put all Indians in the same bag .", "label": 0}
{"text": "You're here, commenting. So no point then?", "label": 0}
{"text": "Tf, these people dont want to join my union! We should invade them! Thatll show them our moral superiority!", "label": 0}
{"text": "Don't forget that when your own parents are to old to care for themself, help pay for a retirementhome because a pension is to small to cover the expensive care and we are to busy working to help out... The system is not sustaining itself.", "label": 0}
{"text": "Is Putin on his knees in the picture? Begging?", "label": 0}
{"text": "BRICS 🤡", "label": 0}
{"text": "Sweet baby fat Murican Jesus, Danes! You saves the world. And the budget.\n\nBTW how can I synthesize Ozempic domestically? Their patent is running out in few years. This thing will be more popular than the weed.", "label": 0}
{"text": "Kids? Unless you're like 60+. you'll have plenty of fun yourself.", "label": 0}
{"text": "Better, faster transportation with rural life is gonna be the way to go for successful countries in the future is what I think. People not having kids or choosing to have kids is gonna act like a filter for the survival of cultures. We are witnessing something fascinating that probably didn't happen in thousands of years.\n\nBesides that though, businesses got to a point where their greed is actively taking away from the future of man. Artificial scarcity aside, prices are soaring as well as productivity. Who's gonna be able to afford anything if this keeps going? How are new generations gonna be born when they lower the quality of life in the rat race? That's the opposite of the biological imperative after all. Are businesses gonna sell things to each other, completely removed from the rest of humanity, only using robots? Will that mean anything to humanity at that point? Nothing going on right now is sustainable and everybody can see it. Weird times.", "label": 0}
{"text": "> because Europe had 3-4% inflation for a few years.\n\nThere is no need to downplay things. Inflation in 2022 was in EU 10-12%.\n\nIn a few members states it reached close to 20%.", "label": 0}
{"text": "The funny thing is in the Cold War, as late as the 1980’s we saw Yugoslavia as a role model of what we hoped we could eventually become: rich, peaceful, not as totalitarian", "label": 0}
{"text": "Nah", "label": 0}
{"text": "What are we doing differently? Supporting Ukraine as much as we can and in the mean time, arming ourselves to the teeth to fight alone for it longs as it takes as your shit leadership pulls their heads from the sand?", "label": 0}
{"text": "Madness!", "label": 0}
{"text": "Citizens have mortgages though and it is not that common outside of the US that their rates are locked for the entire period", "label": 0}
{"text": "My dudes. Its fine, Germany should be happy its not going in the minus. They are going away from Russian gas, its can't be easy. Also there's a war and they have applied a bunch of sancrions on a big car buying country.  Germany needs to recalibrate and it's fine.", "label": 0}
{"text": "such a nice gesture to a country who's leader litteraly stepped off the plane to attend the BRICS summit.. thank you olaf,very cool.", "label": 0}
{"text": "Or they go to the Anglo sphere where the language barrier is less while also having similar if superior earnings potential. If you are an Indian for example you rather go to the US/UK/Australia than Europe due to being fluent in the local language already.", "label": 0}
{"text": "lol. Should have thought of that, baby Ivan.", "label": 0}
{"text": "You must be an imbecile not to see what is happening, should I post to you how the Panemune bridge crossing looks like to Kaliningrad from Lithuanian side?", "label": 0}
{"text": "Eh the Cold War is separate, Yugoslavia fell due to other reasons not the Cold War ending, they were neutral then and by the standards of communist regimes fairly wealthy, Yugoslavia was seen here as not western rich but definitely richer than Czechoslovakia or Poland", "label": 0}
{"text": ">think they should be boycotted\n\nBowing to Putin and embracing Lukashenko is pathetic.\n\n>Insane that you think Russia will just pull out just because.\n\nWhy shouldn't they pull out? Why did they invade in the first place?\n\n>Russia isn't even tapping into their stockpile.\n\nLol, so they're losing on purpose? Makes a lot of sense. What weapons does Russia even have that weren't made by the Soviets?\n\n>Syria\n\nThat was Russia pal.", "label": 0}
{"text": "> recoalization\n\nWhat is that supposed to be?  \nCoal power is at the lowest in 30 years.", "label": 0}
{"text": "yet you do not deny that this is happening,curious thing that.", "label": 0}
{"text": "Because each ethnicity tries to prove it’s the best ethnicity and has the longest history and the others are invaders", "label": 0}
{"text": "One problem with your statement Serbia didn't commit genocide, and that was rulled out by International courts. So NATO bombed Serbia because of genocide is lie confirmed by International courts and also against UN rulles.", "label": 0}
{"text": "Oh, i'm absolutely shocked.", "label": 0}
{"text": "Wow! Brilliant!", "label": 0}
{"text": "Poland [stopped donating weapons](https://apnews.com/article/poland-ukraine-weapons-russia-war-trade-dispute-5e2e7a194b5238b86c160f0f4848b4f3) to Ukraine a year ago.\n\nCzechia has spent [five times more](https://csd.eu/publications/publication/tapping-the-loophole/) on Russian oil and gas than aid to Ukraine.\n\nWhere's the leadership?", "label": 0}
{"text": "Because the longer the timeline, the more difficult it is to predict based on the current and historically available data and models and which basically means the accuracy is lower. In the end it doesn't matter because most people don't care what will happen in next 20-30, forget about 200-300.", "label": 0}
{"text": "Why does this debate always end with calling me Vlad, Russian agent or something similar instead of arguing your position? Maybe you dont have arguments?", "label": 0}
{"text": "Well they do share the cost. The contribute more to the EU than 18 of the EU countries.", "label": 0}
{"text": "> The article clearly mentions the desire of extending their pipelines by Poland\n\nNo, it doesn't and you are spreading fake news. It just states the obvious fact that NordStream was not just a business project  because it would have been cheaper to upgrade the existing infrastructure. \n\nIf you still insist on spreading your misinformation, here is the relevant quote (highlighting mine):\n\n>> The Poles are the most vocal but far from the only critics of the gas deal, which Warsaw insists is **motivated by politics rather than economics** since it would be much cheaper to upgrade existing pipelines connecting Russia with western Europe via Belarus and Poland.", "label": 0}
{"text": "But that'll make perfect sense - less possible side-effects", "label": 0}
{"text": "Wtf", "label": 0}
{"text": "Time to open a Russian bank account", "label": 0}
{"text": "LED streetlights are more directional, meaning less light spill upwards into the sky", "label": 0}
{"text": "The European population has little enthusiasm for Switzerland.", "label": 0}
{"text": "That's what I'm saying, in this case I believe a spade is a spade and Lukashenko just meant what he said", "label": 0}
{"text": "sanctions don't work\n\n/s", "label": 0}
{"text": "*Yes, commander, they drank bottle of vodka and now whole platoon is blackout.*  \n*...*  \n*Nyet, not one bottle of vodka for each, one bottle of vodka for whole platoon.*  \n*...*  \n*There was some left in it when I found them.*", "label": 0}
{"text": "Quite the opposite actually. Real life is not reddit.", "label": 0}
{"text": "Polands dispute is from last year mate, the Hungary and Slovakia shit is irrelevant their contracts are done, Ukraine can bomb the shit on the distribution pipelines as of yesterday, these countries can block aid as long as they want, we have systems to circumvent these idiots, so not sure what are you trying to convince me here or the rebutle is", "label": 0}
{"text": "No, that is just your defense mechanism.", "label": 0}
{"text": "or mRNA injectable", "label": 0}
{"text": "India has been a democracy since its independence in 1948. It has over twice the number of inhabitants of the entire Western democratic world. Other large countries in the Global South like Indonesia, Brazil, Mexico and South Africa all have free elections, free press and independent courts now for at least the last decades.  Those 4 countries have allmost the same number of inhabitants as all Nato-countries combined. So your statement is not correct.", "label": 0}
{"text": "Serbia might fuck off as well, if that's what they want.", "label": 0}
{"text": "and I wouldn't have it any other way", "label": 0}
{"text": "Thank you. Any particular part? Anyway going to read it, but - not knowing the source and quite OT – this part is quite concerning, lol:\n\n>Of course, we could also mention Poland's almost Pavlovian reflex to compulsively buy American weapons, with EU money, to ensure Uncle Sam's protection at the expense of the European defense industry?. It is also true that Berlin isn't shy when it comes to keeping non-European industries in business either. The German company OHB's lobbying in favor of Spacex over Ariane for a European satellite launch program bears witness to this, as does Germany's purchase of some thirty American F-35 fighter jets to the detriment of European alternatives\n\nThe F35 is similar in price for Poland compared to the Rafale or Eurofighter but one generation newer, capable of carrying nuclear weapon (The reason germany ordered 35). And, iirc part of the deal handing Ukraine F16s. \n\n Germany also ordered 180 Eurofighter, a European development project France left. And is together with France and Spain developing the next gen fighter. \n\nAlso, germany is a major investor in the ESA. https://spacewatch.global/2019/11/germany-invests-3-3-billion-euro-in-european-space-exploration-and-becomes-esas-largest-contributor/\n\nThat parts reads like someone's feelings are really hurt ;)", "label": 0}
{"text": "Azerbaijan and Turkey LOL", "label": 0}
{"text": "Also, look at the things Lithuania spearheaded and other Baltic states, unless you are a ruskie shil then you can go fuck yourself", "label": 0}
{"text": "Denmark is more impressive than Norway", "label": 0}
{"text": "Which still makes Switzerland a magnitude more democratic than the next country.", "label": 0}
{"text": "They are absolutely right about their concerns", "label": 0}
{"text": "Very funny table.", "label": 0}
{"text": "Besides a global pandemic, inflation, depressed wages for a decade, war, a chronic housing shortage and impending climate crisis, what reasons could there be for the birth rate dropping?", "label": 0}
{"text": "What lol? The law forbids exports and re-exports to active war zones. Everyone here was mad about it.", "label": 0}
{"text": "I was agreeing with you. Not sure why you're getting down voted.", "label": 0}
{"text": "Putin's war wasn't originally meant to mean that no one supported/or would support it, more that the decision to invade was something kept in the dark from the public as long as possible and almost entirely created by him and his advisors for their own ends. That doesn't mean there shouldn't be a level of collective responsibility, there always is.\n\nhowever, it wasn't something like Iraq where the government had to genuinely attempt to get a majority of the public onside with their bullshit and be upfront about their intentions and reasons for invading for many months beforehand. \n\nThe amount of russian public that wanted a full scale invasion of ukraine or expected one was miniscule before it happened. That doesn't mean that a big chunk of the population, especially the 40+ age group, won't end up supporting it after the fact for various reasons like swallowing the ramping up of propaganda(which had been going on steadily since the early 2010's as ukraine pivoted further westward), being right-wing fascist nationalist assholes, succumbing to the usual support our boys militaristic nonsense that happens worldwide during wars etc....", "label": 0}
{"text": "Enmities? You amenities you mean?", "label": 0}
{"text": "Yes please, let's enjoy all the benefits of EU, but please do not share your problems. \nWhat about closing Switzerland from any European country, and see how much time before the \"please let me in, please!!!\"", "label": 0}
{"text": "I would annex me so fucking hard", "label": 0}
{"text": "Which was... stipulated clearly when they were sold.\n\n\nYou can still shoot them yourself in Ukraine, the law just forbids re-exports to war zones.\n\n\nI also wish it wasn't the rule, but it was like this from the beginning.", "label": 0}
{"text": "No, both of them are now strongly below replacement rate.", "label": 0}
{"text": "And having already established communities", "label": 0}
{"text": "I could say the same thing. What the hell are you talking about? Wages? Work? Irrelevant", "label": 0}
{"text": "YEET!", "label": 0}
{"text": "Beautiful", "label": 0}
{"text": "Unfortunately they build switzerland right in the middle", "label": 0}
{"text": "Did you in any way compare Belarus' army with Ukraine? Belaurs is basically Russia. Lukashenko is just doing poor PR work.", "label": 0}
{"text": "The Swiss are nothing seething, maybe some shareholders for the weapons manufacturers but overall most folks are pretty anti war and weapons manufacturing.", "label": 0}
{"text": "\n\n Putin is a respected man. Putin does not talk nonsense ", "label": 0}
{"text": "Agree. Stupid move by Merkel", "label": 0}
{"text": "How", "label": 0}
{"text": "I think Putin will have to wait until the War in Ukraine is over before he makes any sort of move on Belarus, & Lukashenko knows it.", "label": 0}
{"text": "Sorry I didn't realise that you were agreeing, I have a headache but I can be thick without the headache as well. Downvotes on Reddit are often random", "label": 0}
{"text": "The map doesn't cover prices part ", "label": 0}
{"text": "EU is an alliance of small, second rate countries cooperating, lifting each other to compete with big countries. If nothing else, it's beneficial in the long run to convert and absorb Russia's client states, and gradually push out all their influences.", "label": 0}
{"text": "I think she handled 2008 pretty decently but she stayed for far too long. Term limits for the chancelor position should be a thing.", "label": 0}
{"text": "Someone's about to get \"liberated.\"", "label": 0}
{"text": "Full steam ahead!", "label": 0}
{"text": "That's the American POV, whereas \"arrogant\" = \"they don't do as they're told\".\n\nRemember how they renamed \"French fries\" to \"Freedom fries\" at the Congress's cafeteria because France refused to invade Iraq with the US?", "label": 0}
{"text": "I think a big reason is that with the rise of the internet, everyone can see everything from everywhere. \n\nWe’ve all just realised how truly horrible the whole world is and saying, “no I won’t bring kids into this when I’ll hardly have enough for myself anyway”.", "label": 0}
{"text": "Afraid of tsunamis in Germany and Putins dogs she gave Europe a wedgie hope she has a good retirement in her little flat listening to old ddr propaganda recordings", "label": 0}
{"text": "My exact thought I had today about Labour in the UK. All social democratic parties in Europe are old, crusty and really cannot adapt meaningfully to changes.", "label": 0}
{"text": "> Proclaiming they were fighting \"for the freedom\" of the Italian people under a fascist regime is insulting. Even Italians back then had little love for their dictatorship. They were fighting to subjugate other (free) people, in an useless war that killed many innocents.\n\nIts El Alamein. Its far from clear what the axis was trying to do there. But I guess \"died because rommel wanted to keep his german units somewhat intact\" doesn't flow well in italian.", "label": 0}
{"text": "This is actually beyond the worst case scenario the  governor of the Central Bank of Russia stated some months ago.\n\nIt's proof that the economy is burning, prices and salaries out of control and that Putin is unable to find measures. 🍿 time.", "label": 0}
{"text": "The \"dispute\" was just Western and Ukrainian framing during that time. Poland didn't announce any new aid packages since then, they're just sending already announced aid.\n\n> Ukraine can bomb the shit on the distribution pipelines as of yesterday\n\nIt's not like Czechia, Slovakia and Hungary have made any plans to get off Russian pipeline oil and gas.\n\nThey can still use their veto in the Council, as well as NATO and try to horse-trade, like Orbán and Erdoğan did.", "label": 0}
{"text": "Well, in Denmark we do prefer renewable resources...", "label": 0}
{"text": "My impression is that Germany has and also produces skilled workers. It’s just that they usually emigrate due to low wages.", "label": 0}
{"text": "I don't know. If you read the history of these countries, you can often find points where being a monarchy was the factor that made them come down on the right side of the fence. King Harald of Norway famously said \"I am the communists King too\" when the politicians urged that he should deny the communists the influence their votes entitled them to. Finland was a republic and ended up with a civil war.\n\nJuan Carlos preventing a coup, Lord Mountbatten preventing a coup, etc. Also I have my doubts of you could call Japans 20th century \"stable and democratic\"", "label": 0}
{"text": "Because small communities reaches a threshold where they can’t sustain themselves, so they move to big cities, Japan has been shrinking for few years now, but Tokyo is getting bigger and bigger, making Real Estate in Tokyo even worse, and small communities house even harder to maintain", "label": 0}
{"text": "Yeah lol Europeans here are like \"fuck the Commission that we can't even vote out for pushing this distopian shit down our throats\".\n\n\nAnd then you say \"well thank Wilhelm Tell that I'm not in the EU\", and everyone freaks out cause you're supposed to support the EU unconditionally.", "label": 0}
{"text": "Sadly Ukraine, right?", "label": 0}
{"text": "Nothing more than a puppet who execute the command of his master", "label": 0}
{"text": "Of course it can. But Poland is doing a lot of catching up .", "label": 0}
{"text": "Xenophobic Russians? Well I never!", "label": 0}
{"text": "That's one senior officer for ten men, what the fuck are they smoking?", "label": 0}
{"text": "I like your take!", "label": 0}
{"text": "Referendum just came on the question if EUropoors are copium huffing dummies.\n\n\nAll cantons voted YES to EUropoors are copium huffing dummies, see you next referendum.", "label": 0}
{"text": "People are pretty pessimistic but Germany does have the tools to get going again. The low amount of national debt is something many like to ignore.", "label": 0}
{"text": "Why is NATO being so weak here? Is it the US elections? Makes me worried about democracy if they can't pull anything together to a threat like this.", "label": 0}
{"text": "Less potential nazis, yippie", "label": 0}
{"text": "All eyes on Georgias election tomorrow now!", "label": 0}
{"text": "That’s a bit of a cop out, Japan simply isn’t doing well either.", "label": 0}
{"text": "Such delusionally uninformed take, i love it!", "label": 0}
{"text": "The rule could be annulled.", "label": 0}
{"text": "At this point they're basically Smaug", "label": 0}
{"text": "You can look up from the internet that modern people live longer, crime has generally gone down and while stagnating living standards are somewhat of an issue, most people in developed countries most certainly have enough for themselves and also for multiple children. In fact, many countries offer generous schemes to families up to the point of financial impact of children being almost invisible. \n\nAs said here, it is actually the free time and our careers that we are unwilling to sacrifice.", "label": 0}
{"text": "I mean… what exactly do you think Swiss has any enthusiasm for, aside from own interest and benefit?", "label": 0}
{"text": "\"Actually, you are aware of the dysfunctions because of a relatively transparent media and functioning democratic institutions exercising their mandates to keep each-other in check.\"\n\nNope. It is because the independent media which is paid directly by their readers/viewers. Institutions in Romania do nothing, their management is politically named, the justice system is nonfunctional, it is tragic.", "label": 0}
{"text": "Probably they will let the Koreans command their own soldiers in conjunction with Russian commanders so the Koreans can become battle tested in their own section of the battle space essentially. + Support roles like artillery or non combat roles", "label": 0}
{"text": "Sausage Vs Sushi, who will win?", "label": 0}
{"text": "Not sure, but the last time this came up it turns out that a lot of countries[ \"recycle\"](https://www.reddit.com/r/europe/comments/1aqkvy9/germany_sending_dramatically_more_plastic_waste/).\n\nWe sort all our crap, but at lot of it that can't actually be used again without wasting a lot of energy in the process get burned for heat and electricity. Probably doesn't count according to eurostat, but shipping it to be \"recycled\" in Asia counts.", "label": 0}
{"text": "Do you spam the same comments in every thread? That is when you're not calling for Iran and Russia to [use nukes on the west?](https://www.reddit.com/r/israelexposed/comments/1gbf2bt/comment/ltl9r7z/)", "label": 0}
{"text": "until we see how racist and sexist you are deeply lol", "label": 0}
{"text": "I can only assume you are docking points off from Norway for being crude/NatGas rich.  To me it's just as impressive that Norway didn't turn into Saudi Arabia or Venezuela having struck gold in natural resources lottery.", "label": 0}
{"text": "The source is legit although obviously partial when it comes to french interests. That said, an F35 for the price of a Rafale ? Are you high ? And the utility of space programs compared to sovereign energy sources ?", "label": 0}
{"text": "I don't think Ozempic is doing all that, thats just how bad being fat is for you. So when you lose weight you gain all kinds of benefits that are only indirectly caused by Ozempic. Thats my man guess atleast :)", "label": 0}
{"text": "I've opened the article just because of your comment. I wasn't disappointed. Absolute crap", "label": 0}
{"text": "Lol. Amazing.", "label": 0}
{"text": "EU has an FTA with Canada. Lets do the same deal.", "label": 0}
{"text": "It's the only thing that has stopped wars.", "label": 0}
{"text": "Switzerland pays billions to the EU.", "label": 0}
{"text": "It's just Tusk saying words. I voted for him but people shouldn't really put too much weight into what he's saying. He'll say everything the other part wants to hear and then absolutely not do anything about it.", "label": 0}
{"text": "Lil puppy barks at mummy Russia..", "label": 0}
{"text": "You did not answer the question - do you support genocide of Gaza or do you deny it? \n\n>>Because I seem to remember that was like your whole national thing.\n\nIt wasn't my country that put people in gas chambers for their skin color or ethnicity, for that matter.", "label": 0}
{"text": "So sorry to hear that! I grew up in rural Germany and seeing the Milky Way is something that comforted me. It was a feeling of \"whatever happens, you are part of the universe. And no matter what tomorrow brings, the stars will be there.\"\n\nWhen I first moved to a bigger city with no chance of seeing the Milky Way I felt lost.  It was a big relief when I moved back into some little bit rural place.\n\n\nReally crossing my Fingers that you can see it one day.", "label": 0}
{"text": "European citizens barely have a say in their laws.", "label": 0}
{"text": "Funny, I don't see you saying the same about Ukraine. Should Israel use them on Iran to stop the attacks?", "label": 0}
{"text": "Malta. Cyprus. Luxembourg. Ireland. Much worse.", "label": 0}
{"text": "Switzerland contributes billions to the EU.", "label": 0}
{"text": "About 600$ (after taxes).", "label": 0}
{"text": "I bet Orban and Fico will do the same thing.", "label": 0}
{"text": "Why is Italy so bad? Romania and Hungary could blame it on the ongoing war in a neighbouring country but what's happening in Italy?", "label": 0}
{"text": "That's some bizarre attempt to look like he cares about his country. He can only stay in power with the help of Putin. He can in no way believe what he is saying here.", "label": 0}
{"text": "Because of sanctions..meanwhile Russia's economy is absolutely flourishing. Ruble is doing great, economy is growing..", "label": 0}
{"text": "🤔🤔", "label": 0}
{"text": "That doesn’t work if you want the Euro to sustain. Fiscal union or bust.", "label": 0}
{"text": "It does not really matter if some tiny economy in the EU runs a surplus of \\~3% if all the major economies in the EU run a deficit of \\~-2%.", "label": 0}
{"text": "No, it is using the total figure including all three forms of support.", "label": 0}
{"text": "As a Belgian I’m really surprised at how low we score. We have the most gouvernements per km2 in the world, and we vote so diversely that it takes years for a coalition to be created. It may not be an efficient democracy, but it feels to me like every voice counts", "label": 0}
{"text": "To clarify, he means that if Russia were to invade his country, Lukashenko would go to war *alongside Russia, not against it", "label": 0}
{"text": "A big part of the Danish budget surplus is \"extra\" revenue from pension funds. \n\nWhen the Danish government, the unions and the employer organisations agreed on work related pensions in the early 1990's, the intention was of course to make the grunt workers be a part of saving for their retirement, and not in the future \"burden\" the younger generations. \n\nDenmark is one of the few countries that expects its elderly population to pay more in taxation on claiming pension savings, than it is expoected those retired people will cost in elderly care and medical bills.", "label": 0}
{"text": "Unfortunately, this is behind a paywall, but there are other media that reposted the story. For example:\n\nhttps://www.timesofisrael.com/russia-provided-houthis-with-tracking-data-to-target-ships-in-red-sea-report/\n\nSummary: Russia sent satellite data to Iran, who forward it to the Houthis through members of Islamic Revolutionary Guard Corps embedded in Yemen. Houthis then used the data to target international shipping.", "label": 0}
{"text": "That's great advice indeed! The French public library also offers a Pressreader account for around the same yearly price, I need to sign it.", "label": 0}
{"text": "Swexit", "label": 0}
{"text": "Taxes through the roof as well.", "label": 0}
{"text": "It does seem that western help has been enough to stop the Russian onslaught. Ukrainians have been chronically short of artillery ammunition and SAMs. With plenty of artillery ammunition, the Russian assaults can be handled  and the air defence will give the Ukrainians a chance to do something about the aerial bombardment, that Russia can do with abandon and which has ground down Ukrainian formations. And this attritional combat has been going on for so long too. Of course giving them permission to strike with Western arms the airfields in Russia that the bomber's operate from could help too.\n\nBut organizing Ukraine's supply has been a sluggish affair and just a fraction of what has been promised has actually been delivered. Which at this point, after two and a half years tells more about lack of political will than lack of resources or time. It is sad to see how helpless our leaders have been in handling this act of aggression.", "label": 0}
{"text": "One of the reasons why Russia will do it when he dies.", "label": 0}
{"text": "mr P// president downfoll the country...", "label": 0}
{"text": ">  \"Russia will annex Belarus over my dead body\"\n\nok then, easy enough. Just don't get near any windows, don't drink any tea, don't travel by plane ... you'll be fiiiine Luka, don't worry!", "label": 0}
{"text": "Downvotes have nothing to do with truth. “Average” is not something which I care about. I understand that it’s not common knowledge to you, that “no” is not a conversation starter. It’s your problem to think that, not mine. I don’t write anything to people who don’t know that. They won’t decide by facts either way.\n\nAlso the statement about judges contradicted itself in the context. You don’t need to know anything additional. I didn’t need to answer properly for that. So yes, it’s a you problem, that you think, I need to argue about a self-contradictory statement. I have nothing substantial to say to people who believes in such statements.", "label": 0}
{"text": "Is the Swiss's Nazi gold any worse than France's stolen African gold (and uranium) or Germany's money from selling submarines to apartheid states or the UK's various Crown Dependent tax havens or the Netherland's etc...?", "label": 0}
{"text": ">>No shit more civilians died, that’s the case in every war.\n\nThat's the case with every war in a sense that there was a ground war component to the air component, this was an \"intervention\" type of war, where there was no ground invasion (there were some pathetic attempts at Kosovo, but they ended up badly for Albanians and US PMCs), where the goals were to destroy military capability of Milosevic's regime, but somehow they managed to bomb more civilians than soldiers and more civilian infrastructure than military installation.\n\n>>And of course no UNSC approval was given, they are a complete joke of an institution that don’t do shit.\n\nI guess then the International Law is dead and we are in the might makes right regime now, its just good to remember every now and then who broke it first, who set the precedent for it.", "label": 0}
{"text": "And nobody would intervene if Russia did so. Reap what you sow.", "label": 0}
{"text": "What was it? Lions and faces?", "label": 0}
{"text": "You forgot about the EU spending 62% of all defense budgets on US-made weapons.", "label": 0}
{"text": "More taxes and regulations will fix it.", "label": 0}
{"text": "you don't have to negotiate government policy to violate the logan act, all you have to do is negotiate with a foreign government to work against US interests in regards to any conflict or dispute the US has with that country:\n\n>Any citizen of the United States, wherever he may be, who, without authority of the United States, directly or indirectly commences or carries on any correspondence or intercourse with any foreign government or any officer or agent thereof, with intent to influence the measures or conduct of any foreign government or of any officer or agent thereof, in relation to any disputes or controversies with the United States, or to defeat the measures of the United States, shall be fined under this title or imprisoned not more than three years, or both.", "label": 0}
{"text": "Not right now, but they will eventually join before Ukraine and some of the Western Balkans", "label": 0}
{"text": ">That's the case with every war in a sense that there was a ground war component to the air component, this was an \"intervention\" type of war, where there was no ground invasion (there were some pathetic attempts at Kosovo, but they ended up badly for Albanians and US PMCs), where the goals were to destroy military capability of Milosevic's regime, but somehow they managed to bomb more civilians than soldiers and more civilian infrastructure than military installation.\n\nI mean, there is a reason kosovo is safe now and not being literally genocided. \n\n>I guess then the International Law is dead and we are in the might makes right regime now, its just good to remember every now and then who broke it first, who set the precedent for it.\n\nI mean yes? And in this case the Serbs by invading. And in other cases the russians for Afghanistan. You making this into \"nato\" bad is actually laughable with the current state of the world right now. Go join your russian friends and celebrate the invasion of Ukraine.", "label": 0}
{"text": "Dude are you from around here? The stuff you are talking is long settled, as it seems you are living in yesteryear, Polish Krabs are flowing to Ukraine as we speak, the soviet shit they had is probably expended in the first year, Baltics gave everything they did not need at the time and buying more, Polish are buying everything that South Korea can produce and shift production to them, the idiots that are still buying oil from ruskies are irrelevant, as I said we have mechanisms in place to circumvent these assholes, Orban can suck Putlers dick, Austria has no contract anymore and their pipie shut, EU has imported 15bln qubick meters of gas from russia this yras that is like 10% of only Germany importing this shit, so the market for these assholes is shut, nodody is dealing with them, they cant even make payments so what are we talking about here? In the BRICS summit this dide had he explicitly requested to have dollars on hand, in the mean time talking about the destruction of it, lunatic", "label": 0}
{"text": "> Modi welcomed the agreement as an economic benefit for both countries. \n\n\nReally? \nGermany will have skilled workers, but what will India get in return?", "label": 0}
{"text": "Their public thinks NATO is already fighting there. They have equipment displayed in Moscow and other cities. News advertise that NATO soldiers are being killed in ukr. Even propagandists inside EU/NATO countries are spreading that propaganda.", "label": 0}
{"text": "Bitching about the EU despite having special privileges but loving all the benefits", "label": 0}
{"text": "A match made in heaven. The orcs prepare the sauce, the norks prep the meat.", "label": 0}
{"text": "Huh 🤔 \n[Twitter confirms completion of Elon Musk’s $44 billion acquisition deal, CNN  4 minute read Updated 1:16 PM EDT, Fri October 28, 2022](https://www.cnn.com/2022/10/28/tech/elon-musk-twitter-deal-close/index.html)", "label": 0}
{"text": "**EU races to prepare for a Trump win**\n\nBloc seeks to bolster aid to Ukraine, sanctions against Russia and trade policy in case Republican is re-elected  \n  \nEU capitals are racing to draw up assessments of the bloc’s biggest vulnerabilities if Donald Trump is re-elected to the White House, as polls suggest the contest is tilting in the former president’s favour. Senior EU officials are holding daily meetings to outline where a Trump presidency could cause the most pain for the bloc, said people familiar with the talks. They said topics under discussion included how to withstand a barrage of trade tariffs, offset an end to US aid to Ukraine and maintain sanctions against Russia if Washington lifts its restrictions. “Everyone is taking everything much more seriously,” said one senior EU diplomat. “We are trying to make sure we will not be taken by surprise.” \n\nThe preparations include formal talks between EU ambassadors and the staff of European Commission president Ursula von der Leyen, as well as informal groups of senior EU diplomats considering possible strategies. Trump has vowed to impose flat 10 per cent tariffs on all imports and is critical of US support for Kyiv and sceptical of Nato, which underpins Europe’s defence. \n\nPolling suggests he is in a dead heat against vice-president Kamala Harris ahead of the November 5 election, and has overtaken his Democratic rival as the candidate Americans trust most with the economy, according to a Financial Times poll released this week. “In my personal point of view, we will be in trouble. Deep trouble,” another EU diplomat said of a Trump win. “This disruptive element will be huge, and the unpredictability will be huge.”\n\n  \nCharles Michel, the European Council president who represents EU member states, told the FT that a Trump victory would lead to “immediate decisions” by the new US administration “that would have an immediate impact, a huge impact in the short term in Europe, for sure”. Michel added: “If it is Trump, it would be an additional wake-up call that we need to act more to take our destiny in our own hands.”  \n  \nOfficials fear Trump’s threatened tariffs could reduce EU exports to the US by about €150bn a year. The commission, which manages trade policy, has already drafted a strategy to offer Trump a quick deal on increasing US imports to the EU and only resort to targeted retaliation if he opts for punitive tariffs. Goldman Sachs forecast this week that the euro could fall by as much as 10 per cent against the dollar if Trump were to impose widespread tariffs and slash domestic taxes, while a study by the German Economic Institute in Cologne said a trade war could lower the GDP of the EU’s biggest economy by 1.5 per cent.  \n  \nThe biggest short-term security concern of EU officials is how to continue support to Ukraine if Trump cuts off a flow of weapons that has played a vital role in helping Kyiv thwart Russia’s invasion. The EU has provided more financial support to Ukraine than the US. But American weapons stockpiles and capabilities are far larger than European countries’. Officials briefed on the discussions say there is no possibility EU militaries could match what the US is providing. Officials in the bloc are also deeply concerned that a Trump administration would lift sanctions on Russia. That would raise the question of how much economic pressure the EU could maintain on Moscow without US support, even if Japan, the UK and other allies kept sanctions in place. Trump’s scepticism towards Nato has also exacerbated long-running fears about European reliance on US security guarantees.  \n  \n“Right now we are arguing amongst ourselves about how to raise €100bn for defence and whether we really need to,” said another EU diplomat, referring to the bloc’s debate about a joint debt issue. “If Trump wins, we’ll instead be talking about €1tn and it won’t be optional.” The EU talks to prepare for a possible Trump return to the White House have intensified over the past month. They follow von der Leyen’s decision this year to form a small in-house war room to prepare for the US election result, focused mainly on trade and security issues.  \n  \nNato officials are also brainstorming on how to minimise potential disruption and “Trump-proof” as much Ukraine support as possible. One option would be to give the 32-nation alliance a greater say in co-ordinating weapons supply and the training of Ukrainian troops to reduce US direct control over both issues. The alliance’s new secretary-general Mark Rutte, who maintained good relations with Trump during the former president’s first term, said last week that Nato “will not lose” its unity on Ukraine. But Michel said there was no guarantee that Harris would maintain existing US policy towards Ukraine, arguing that both candidates would probably identify the US economy as their key priority. “Maybe the tone will be more polite, in one case, less polite in another, more brutal in one case, less brutal in another,” he said. “But the fact is there is a protectionist trend in the United States.”", "label": 0}
{"text": "The 1940 Grapes of Wrath movie was withdrawn from theaters in the Soviet Union in 1948 for this reason. Originally, it was intended as propaganda by the government to show how badly people suffered under capitalism, but it had the opposite effect, as people were amazed that even the poorest farmers in America could afford to own their own cars, something that was an incredible luxury in the Soviet Union at the time.", "label": 0}
{"text": "80% of salaries in this country are only 1% of the cost of apartments and most USED cars... and everything is getting worse every month. And there is nothing to say anywhere...", "label": 0}
{"text": "Links and images should be posted as \"link post\" **without** any comments or other text in the post body. Any comments should be written in the comments section.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/europe) if you have any questions or concerns.*", "label": 0}
{"text": "I agree with this, out of the same playbook as “I don’t want Trump to win” nonsense he was saying", "label": 0}
{"text": "Let's be honest, has anything of value been done since 2015?", "label": 0}
{"text": "Batteries are already delivering nuclear scale energy day in and day out in California.\n\nhttps://blog.gridstatus.io/caiso-batteries-apr-2024/", "label": 0}
{"text": "So why use extremely expensive nuclear energy to create hydrogen when cheap renewables can do it?\n\nSee the recent study where it was found that nuclear power needs to come down 85% in cost to be competitive with renewables when looking into total system costs, due to both options requiring flexibility to meet the grid load.\n\n> The study finds that **investments in flexibility in the electricity supply are needed in both systems due to the constant production pattern of nuclear and the variability of renewable energy sources**. However, the scenario with high nuclear implementation is 1.2 billion EUR more expensive annually compared to a scenario only based on renewables, with all systems completely balancing supply and demand across all energy sectors in every hour. For nuclear power to be cost competitive with renewables an investment cost of 1.55 MEUR/MW must be achieved, which is substantially below any cost projection for nuclear power.\n\nhttps://www.sciencedirect.com/science/article/pii/S0306261924010882", "label": 0}
{"text": "Kim better watch out or Macron might schedule some phone calls with him.", "label": 0}
{"text": "Russia is a terrost state.", "label": 0}
{"text": "I don't understand this. If you have debts to outside entities and they refuse to accept your worthless currency as payment, isn't that tantamount to bankruptcy?", "label": 0}
{"text": "Why use extremely expensive nuclear energy to create hydrogen when cheap renewables can do it?\n\nSee the recent study where it was found that nuclear power needs to come down 85% in cost to be competitive with renewables when looking into total system costs, due to both options requiring flexibility to meet the grid load.\n\n> The study finds that **investments in flexibility in the electricity supply are needed in both systems due to the constant production pattern of nuclear and the variability of renewable energy sources**. However, the scenario with high nuclear implementation is 1.2 billion EUR more expensive annually compared to a scenario only based on renewables, with all systems completely balancing supply and demand across all energy sectors in every hour. For nuclear power to be cost competitive with renewables an investment cost of 1.55 MEUR/MW must be achieved, which is substantially below any cost projection for nuclear power.\n\nhttps://www.sciencedirect.com/science/article/pii/S0306261924010882", "label": 0}
{"text": "Sounds like a pretext for treason", "label": 0}
{"text": "World needs to prepare.", "label": 0}
{"text": "Capitalism caused this.", "label": 0}
{"text": "But Russia considers eastern Ukraine Russian, it already anexed it. You have to consider perception of the other side\n\nDefending the rest of Ukraine, yes that could work. I do not believe Russia is strong enough to occupy it nor wants it really. But Ukrainians will not be satisfied with status quo.", "label": 0}
{"text": "A fun game to play with articles like these is how many paragraphs it takes to get to some version of according to Ukraine. \n\nIn this care 1. “leaked intercepts obtained by the Defense Intelligence of Ukraine”", "label": 0}
{"text": "What genocide exactly?", "label": 0}
{"text": "Yes you do. The grid becomes even more horrifyingly expensive if you load follow utilizing nuclear plants.\n\nTake California, the \"baseload\" over a year is 15 GW. The peak load is 50 GW.\n\nThe grid demand is not constant.\n\nSo why use extremely expensive nuclear energy to create hydrogen when cheap renewables can do it?\n\nSee the recent study where it was found that nuclear power needs to come down 85% in cost to be competitive with renewables when looking into total system costs, due to both options requiring flexibility to meet the grid load.\n\n> The study finds that **investments in flexibility in the electricity supply are needed in both systems due to the constant production pattern of nuclear and the variability of renewable energy sources**. However, the scenario with high nuclear implementation is 1.2 billion EUR more expensive annually compared to a scenario only based on renewables, with all systems completely balancing supply and demand across all energy sectors in every hour. For nuclear power to be cost competitive with renewables an investment cost of 1.55 MEUR/MW must be achieved, which is substantially below any cost projection for nuclear power.\n\nhttps://www.sciencedirect.com/science/article/pii/S0306261924010882", "label": 0}
{"text": "I hope it will, but what makes you so sure? Lot of eurosceptics in todays EU politics. Also i think Putin wouldnt mind spending billions of euros to see it go away. I heard that je had his fingers mangled in the Brexit. \n\nNot to mention fucking Trump...\n\nJust reassure me.", "label": 0}
{"text": "Ah shit, here we go again.", "label": 0}
{"text": "How can we profit from this situation?\nRent apartments to old people?\nFuneral business?", "label": 0}
{"text": "Why is that?", "label": 0}
{"text": "Can't chew, bruh!", "label": 0}
{"text": "The same genocide that sits in the drawer with WMD in Iraq.", "label": 0}
{"text": "Gaza was deocuppied by Israel as a first step to their statehood and look what happened. And international community looks the other way", "label": 0}
{"text": "When you order political analysis on Temu 🤣", "label": 0}
{"text": "Ladies and gentlemen, we got 'em!", "label": 0}
{"text": "I feel like this is hyperbole. At some point after many halvings humanity could grow again, but not if we leave the world in a state of a runaway heating (or cooling) cycle.\n\nClimate change is still by far our worst crisis.\n\nIf at all a declining population could help mitigating climate change.", "label": 0}
{"text": "Yes, adjectives are important.", "label": 0}
{"text": "the ua in op's name stands for ukraine, probably", "label": 0}
{"text": "Not that simple. There is low unemployment. If the government begins claiming resourcess for investments there is a risk of overheating an economy that is in some areas already struggling to find qualified staff. You risk wages increases. Adding fuel to inflation. Making everything more expensive. Then hurting the Danish export. \n\nDenmark wants to remain competitive. Giving Danish people what politicians promise in election campaigns could hurt that nations finances.", "label": 0}
{"text": "I don't understand. Any group of counties that are sanctioned have to come together. Who else will they trade with?", "label": 0}
{"text": "Because EU went backwards on their own proclaimed values in Serbia. They supported this idiot in power and they still do, even tho he's transforming Serbia into autocracy. Why should I support a friend of my enemy? When we liberate ourselves from criminals in power, we won't forget those who supported them.", "label": 0}
{"text": "The issue with the Baltics that they're too small to make a big difference. And it's because of their size that they can't afford not to ally themselves with bigger states against any threat, such as Poland or Sweden.\n\n[An Estonian Secretary of State](https://www.youtube.com/watch?v=y_6S1eJvbpE) was even calling for European nuclear umbrella a few days ago at The Rīga Conference 2024 in Latvia, basically asking France and the UK to provide their nukes instead of US ones in case a new Trump administration casts doubts on that guarantee within the alliance.\n\nSo, yes, Baltic politicians have clarity on what's at stake and putting their money where their mouth is when it comes to supporting Ukraine. But who's going to listen? Isolationist and nationalist tendencies aren't only on the rise in the US.", "label": 0}
{"text": ">>Not really a genocide but there are absolutely warcrimes committed.\n\nSo in Serbia's Račak total of 45 people were shoot, even though it was never proven neither who shot them, nor where, and it was enough to call it a \"genocide\" and bombard a sovereign country without the approval of UNSC, in Gaza there are like 45x times 1000 civilian victims now, with mass graves uncovered etc. When is NATO going to bomb them are they waiting for the approval of UNSC? What's the hold up?", "label": 0}
{"text": "Sorry in a zero sum game the US will win. You will share the pool of slackers while the US will retain the brahmins. \n\nWhy do you think the middle and upper middle class will want to move to Germany and have to learn German if the pay and prestige is not at least on par with working in the US?", "label": 0}
{"text": "He got shot anyways lmao", "label": 0}
{"text": "I hope everyone is alright", "label": 0}
{"text": "Let them fight", "label": 0}
{"text": ">man guess\n\nWhat's your woman guess?", "label": 0}
{"text": "About at a “da” level.", "label": 0}
{"text": "> YOUR logic is nonsensical. \n\nYou're free to have this opinion even though you didn't provide any arguments.", "label": 0}
{"text": "Kyiv two hours ago", "label": 0}
{"text": "so far 1 dead, 4 injured", "label": 0}
{"text": "\"Somebody on X\" sounds like the most reliable possible source, good call listening to them and believing that the fish will be fine. ", "label": 0}
{"text": "To stop being delusional about unsustainable social systems which were created during an historical anomaly of economic growth.\n\n  \nThat means progressively doing away with the concept of \"free\" and \"universal\". That also means doing away with the idea that it can simply be \"fixed\" by increasing corporate and wealth taxes. Otherwise the collapse will hurt even more.", "label": 0}
{"text": "I never said one should be exposed to the things you described in order to toughen up a bit and learn to stand up to others / defend one self.\n\nOf course nobody ever, no matter the age should be exposed to what you said, its horrible. When you said \" exposed to growing up \" I just think the usual things kids get exposed to by other kids like your usual verbal bullying.\n\nWhy would you go that far to call me so disgustinly sexist for example ? I mean my bad to an extent, but you never did mention what exactly you were exposed to. \n\nDo you think I aprove of kids being exposed to what you said, or any other person ? Of course not, nobody deserves that.", "label": 0}
{"text": "Portugal did not just had a good year. The previous government enacted policies of austerity and consistently reduced the fiscal deficit. The new government also strives to do the same.", "label": 0}
{"text": "What are the tangible results? Do you remember the headlines from the start of the Russo-Ukrainian war? Do you need a reminder of how Russia will literally implode from the inside any moment now? What happened to that?", "label": 0}
{"text": "She brought the illusion of stability, while her party eroded away our foundations.\n\nWe will suffer from it for a long time", "label": 0}
{"text": "> We wont need Taxi or Truck drivers, postmen or cashiers in 50 years anymore and not everyone is smart enough to be an IT or Electrical engineer.\n\nI don’t really get this argument. If we make the population twice smaller, the same will still be true, not everyone will be smart enough to work in those professions (unless you’re into eugenics).", "label": 0}
{"text": "That's not good to hear. Hope it stays to only the one and that the injured make a full recovery. Thanks for the information", "label": 0}
{"text": "Damn, that is good sourcing right there. Wow. Thank you sharing.", "label": 0}
{"text": "I see. This is not just USA but a class that is taught in most of America (continent). I thought Europe had it. \nWell not sure.", "label": 0}
{"text": "Fuck condemning, it is meaningless and only makes dictators laugh and make us look weak.\n\nWant to show them ? More weapons to Ukraine and no more stupid restrictions.", "label": 0}
{"text": "The old expression, \"Hold your friends close, and your enemies closer\".", "label": 0}
{"text": "That‘s indeed a true problem between Ukrainian soldiers and foreign fighters. Might be similar with russian and north korean soldiers.", "label": 0}
{"text": "Personal take on this.\n\nI think that, if the information correct, this is a very big deal. The US can't allow such a challenge to go unanswered. (For the EU, allowing such things to go unpunished would also just invite more trouble.) But it is difficult to answer it symmetrically, so the answer will have to be strong and asymmetric.\n\nFrom the perspective of many in the Russian government, because Ukraine is a Western puppet that blindly follows its orders, Russian territory is already being attacked by Western proxies, so this is a fair response. I think that is a delusional point of view, but it helps explain why they perform such reckless actions.\n\nThe hard part will be calibrating a response that is strong enough to avoid appeasement, but still leaves this new step in escalation within some manageable bounds.", "label": 0}
{"text": "Belorussia will probably be set for some time in the 2100s then", "label": 0}
{"text": "If that moron really does get the vote, then you know what? May be we are too dumb as a species for democracy", "label": 0}
{"text": "Belarus's military is much smaller than Ukraine's, in terms of manpower and equipment. I kinda doubt Lukashenko would be able to do much.", "label": 0}
{"text": "Metal.", "label": 0}
{"text": "Nahh, we can support Ukraine on our own. Ukraine aid for the next year is already guaranteed.\n\nWhat we cannot really prepare for is the US economic strategy. That will have great impact. Essentially Europe would be in full war mode in all but name.\n\nWhat saddens me is that we have no enough naval power to deploy and protect Taiwan. Japan and South Korea must be really strong", "label": 0}
{"text": "..\nThat delays and cancels flights", "label": 0}
{"text": "We have the exact type of building in Romania too!", "label": 0}
{"text": "I literally don't remember any such reports. I remember people in comment sections talking about it, but I also remember others at that time talking about how sanctions happen slowly and we won't see the tangible results of them for several years. \n\n>What are the tangible results?\n\n21% interest rates, for one. You know...the thing this post is about? That's what I was referring to.", "label": 0}
{"text": "Why before Ukraine?", "label": 0}
{"text": "Could it bring us closer together, my European friends?", "label": 0}
{"text": "The US overtook Europe half a century before WW1 ended let alone WW2. After WW2 it simply increased that margin bigly.", "label": 0}
{"text": "It's not similar to Japan, because Japan allows a lot of housing construction. That population growth in Tokyo produced basically [no rent growth over the same period.](https://tradingeconomics.com/japan/rent-inflation)\n\nTokyo is the most expensive city in Japan, but it isn't having a housing crisis, because they chose to not have the restrictions that cause a shortage.", "label": 0}
{"text": "Sweden or Ukraine?", "label": 0}
{"text": "thank you for your contribution, but this submission has been removed for editorialisation, because its title does not reflect the title or content of the link. See the [community rules & guidelines](/r/Europe/wiki/community_rules).\n\nYou may delete and re-submit this link with an appropriate title.", "label": 0}
{"text": "You’re making a joke but you should be extremely concerned if North Korean troops are not being taught the phrase “I surrender”.", "label": 0}
{"text": "Happy to live in Spain, quite a healthy soil all things considered.", "label": 0}
{"text": "Why THE FUCK only now?", "label": 0}
{"text": "Assistant to the Regional Manager", "label": 0}
{"text": "I mean, that's just an artifact of Covid though. Q42019 is exactly before COVID hit.", "label": 0}
{"text": "Not us just Americans", "label": 0}
{"text": "Rub a garlic clove on the bread and we can be best friends.", "label": 0}
{"text": "Take it from a romanian, you would benefit a lot. We have, I have no reason to lie to you.\n\nBut some would see Serbia as another Hungary or Slovakia, another Trojan horse in EU, which nobody wants ( how true is that, I cannot tell, as the most I can figure out is that Serbia is split, I don't see you as little russia, you are so much better than they will ever be, but I do not trust your governament either that won't do what Orban is to an extent ).", "label": 0}
{"text": "Honestly only Montenegro and Albania might join before Moldavia", "label": 0}
{"text": "he is old and corrupt", "label": 0}
{"text": "... is greater than our Olympic effect. 😬😅", "label": 0}
{"text": "Humans: we don't don't do anything till is too late, think of climate changes", "label": 0}
{"text": ">>I didn't see a single reputable news source saying Russia's economy was on the verge of collapse. \n\nBefore we proceed, define what is `reputable news source` for you.", "label": 0}
{"text": "I don't, but I think the problem with Kosovo, right now, would be impossible to solve, in the sense that can you accept that Kosovo is forever lost to you and that it is its own independent state ?", "label": 0}
{"text": "Didn't Churchill say something to that effect?", "label": 0}
{"text": "I don't know what you're talking about I see plenty of reason here   /s", "label": 0}
{"text": "I need to finally get my ass to Romania as well.", "label": 0}
{"text": "What makes this other guy so sure?\n\nI can’t tell the future, but I think we have no choice really, it’s either the EU as we know it, or a United States of Europe (further integration), or we will fail to deal with the most pressing issues of our time (Russia, the resurgence of imperialism / authoritarianism, and global competition)", "label": 0}
{"text": "I think losing points because of the inefficiencies and complexity. We also often get points discounted from these kind of indices for our compulsory voting, which is just ironic. In my view we're definitely a total democracy, just with a flawed and inefficient system. Then again, good luck solving it.\n\nP.S. any outsiders, please don't comment on our system of government. The only thing we hate more than how complicated it is when outsiders complain to us about it. Few things will have us band together quicker.", "label": 0}
{"text": "Dragic is a name also, just like Milic", "label": 0}
{"text": "It almost look like a face.", "label": 0}
{"text": "Spineless bastard.", "label": 0}
{"text": "Let's hope there are  no windows in the russian central bank", "label": 0}
{"text": "Another orban or ex Poland? No thanks.", "label": 0}
{"text": "The ranking is global, meaning Israel is ranked better than most of these countries, 30th globally. The table in the post took only the European section within the global ranking table. \n\nSeems like you’re the dumb one darling lol", "label": 0}
{"text": "Under any normal circumstances an industry tycoon like Musk negotiating with hostile powers circumventing the DoD or the politicians and haggling with critical defense material is an absolute no, no. In another time it would have been considered treason. The media is doing anything but sensationalizing this issue, rather they are surprisingly timid about commenting on it. On top of that Musk isn’t “engaging in dialogue”, he is being blackmailed and possibly bribed. In a situation where the other power (Russia) is threatening the West with nuclear weapons, any kind of executive level communication channels should be contained to the relevant entities which under normal circumstances would be the foreign ministries, executive branches and top brass generals on each side. This is what “trusting democratic institutions” means.", "label": 0}
{"text": "Russian basterds. Hang in there folks. Those Russian bastards will run headfirst into the wall one day.", "label": 0}
{"text": "Stronger now than ever is not how I would call it, EU managed to wake the fuck up which is the first big step, still a lot work more to do. \n\nIf our western brothers would learn from the former East Block nations on how to deal with russia, then yes, we would really be going some places.", "label": 0}
{"text": "Maybe there is some synergy here. Indians working in the German bureaucracy.", "label": 0}
{"text": "Your entire chain of events literally starts wrong. Korea (and the start of proxy wars as you say so yourself) was LITERALLY a UN force repelling the chinese and north Koreans. \nThis started the entire cascade of proxy wars where the USSR was fucking around in all those countries too, and even before 1950's the illegal occupation of the entire eastern Europe. \n\nSo no, you are absolutely wrong. The foundation for these wars were laid in the illegal occupation of Poland, Ukraine, Latvia and all the other countries. \n\nAnd that the US did some shit doesn't mean bombing serbia wasn't the right thing to do. Stop genociding people and being ultranationalist.", "label": 0}
{"text": "Trumper spotted", "label": 0}
{"text": "Look around you mate, you will be surprised", "label": 0}
{"text": "Bomb Moscow/10", "label": 0}
{"text": "Many in Sweden are trying to stop it, but the politicians refuse to change direction. We are also getting tricked by the politicians. \n\n\nSome parties went to this year's EU election saying they want to stop Chat Control. They earned many votes on it. Like a week later they voted *in support* for Chat Control anyway. They said \"a mistake had occured\", however that is possible for something so important. \n\n\nThe largest parties (on both sides) all support it. \n\n\nIf you want to vote for a right block party that opposes Chat Control, you have to vote for the Sweden Democrats. \n\n\nIf you want to vote for a left block party that opposes Chat Control, you have to vote for parties who want to increase (or even unlimited) immigration (who lied about being against it and voted for it). \n\n\nThere is nothing else. So, what the hell are we supposed to do? Most of us hate Ylva Johansson just as much as anyone, it is obvious to anyone she is a total dumb-dumb. ", "label": 0}
{"text": "Yeah, the far right is in no way rapidly growing across Europe.  \n\n\nAnd its pretty much always with the same issue of unrestricted immigration kicking the door open for the far right.  ", "label": 0}
{"text": "They propably have a few manuals from the Austro Hungarian army in museums to take inspiration from", "label": 0}
{"text": "Yeah it's wild how wrong people are on Reddit about life in Japan.\n\n\nWe have the most affordable housing of any developed country by far. ", "label": 0}
{"text": "Maybe side with China is the more predictable option? And brace for us asylum seekers.", "label": 0}
{"text": "Who is going to listen, are you living in parallel universe? We are talking about this right now, before the invasion you would probably couldn't find Ukraine on the map. And we have to deal with the ruskies shit daily, we know the threat, and now the Baltic is a NATO pond and we have reliable partners and other guarantees even if US shits its pants, Europe is getting ready. At least this part of the world knows what we are up against, you asshats on the other side figure it out the sooner the better, to say even Spain has finally flinched and donating to Ukraine more than it has previously announced", "label": 0}
{"text": "My first question was “what on earth is this list actually measuring?”.\n\nSo I went to examine that, and couldn’t get any good answers, then I came across this map:\n[map](https://upload.wikimedia.org/wikipedia/commons/0/04/Economist_Intelligence_Unit_Democracy_Index_2023.svg)\n\nWhich seems to indicate Portugal and Italy are on a similar level as SOUTH AFRICA. \n\nTo which, as a neighbor of Portugal, daughter of an Italian mother and someone who has visited South Africa, I can say I have no idea what these people are smoking, and this list is completely invalid and prima facie absurd.", "label": 0}
{"text": "What is this even, Serbia is not even close of being puting most faithfull followers. They sold weapons to Ukraine, took in refugees, I would say Hungary that blocks aid and has a pro russian governament INSIDE EU is way worse.", "label": 0}
{"text": "That is the thing, they are finding some benefits come before weight loss. So GLP-1 must be affecting ti directly, and weight loss is an actual side effect.", "label": 0}
{"text": "I wont", "label": 0}
{"text": "FPÖ has 28%, not more than 50. Afd also under 30. Big, big difference.", "label": 0}
{"text": "Those foreigners living in Switzerland are one more example of “take”.\n\nEvery one that moves to Switzerland is one less contributing to the economy of their homeland.", "label": 0}
{"text": "> Furthermore right now you could earn much more by being a courier delivering food than as a teacher, so inflation and uneven wage increases create unhealthy societal situation imo.\n\nThat reminds me of Hemingway’s quote:\n\n- “How did you go bankrupt?”\n- “Two ways. Gradually and then suddenly”\n\nIMHO, these real life experiences from regular people are even more damming and paints an even gloomier future than even the most apocalyptic predictions from Western analysts. ", "label": 0}
{"text": "None of these (except maybe Farage) have caused damage even on the same order of magnitude as Trump", "label": 0}
{"text": "All of this sounds really reasonable, but we know that voting most commonly doesnt go by reason.\n\nIdk too many details about Brexit, i informed myself about it aftee it happened and i did that from John Oliver, but I am convinced by listening to statements of polititians he presented that the decision making of thise politians wasnt the reason, but \"We don't know what we could do. Lets exit EU shall we?\" instead.", "label": 0}
{"text": " . . and yet we still don't have the money to invest in education??", "label": 0}
{"text": "The EU has been preparing for that since many months, at least", "label": 0}
{"text": "So shit in 6 months it improved from 7 to 3,5 and is set to go under 3 by 2027\n\nMa un po' meno esterofilismo e disfattismo no?", "label": 0}
{"text": "That was also the year russian general threatened Poland with nukes after a few years of a break (which has been a regular thing since then).\n\n[https://www.theguardian.com/world/2008/aug/15/russia.poland.nuclear.missiles.threat](https://www.theguardian.com/world/2008/aug/15/russia.poland.nuclear.missiles.threat)", "label": 0}
{"text": "That had nothing to do eu with with Serbia, as per official ruling or ICC.\n\nhttps://humanrightshouse.org/articles/serbia-not-guilty-of-genocide-2/", "label": 0}
{"text": "Komoromat", "label": 0}
{"text": ">\nIf our western brothers would learn from the former East Block nations on how to deal with russia, then yes, we would really be going some places.\n\nThat is very much the path we are on now, most countries are being outright hawkish, are actively making huge investments in defence spending and sending troops to forward areas along the russian border (and even though it's not directly the russian border to Romania too!) \n\nWe are starting to coordinate defence industries and almost all countries have massively cut ties with Russia, and people are calling the germans outright stupid for their bullshit reaction to russians before that invasion. \n\nI would absolutely call this stronger than ever, because we in the history of the EU have never done this.", "label": 0}
{"text": "I hope you and your loved ones are alright OP. May Ukraine win the war.", "label": 0}
{"text": "Sadly it seems bashing Serbia without thinking is really popular around here. Kind of pisses me off, especially when i hear others calling you little russia, you are so much better than this.\n\nFuck, we have states inside EU that side with russia and some idiots would rather bash Serbia instead ? What the fuck is this even ? We have states in EU that actively help putin, Serbia did nothing like this since the war started and people always call you pro russian.\n\nRidiculos.", "label": 0}
{"text": "I agree with your last sentence but what magical countries actually manage to make the financial impact of children almost invisible? I would doubt if there is even one. (definitely not Germany)", "label": 0}
{"text": "Please provide me with verdict where Serbian state was deemed involved in that.\n\nNot saying it did not happen but it was committed by Bosnian Serb army. Serbia actually sanctioned Republic of Srpska during the Bosnian war.", "label": 0}
{"text": "Like people not wanting to have children? Women being able to find fulfilment by doing other things other than raising children? Easy access to contraception and abortions?\n\nWe objectively live in a much better world than our ancestors did 100 years ago, pick any metric you want, but nevertheless we produce way fewer children than they did.", "label": 0}
{"text": "Super bonus, you energetically renowate your house and the government gave you 110% of what you spent back. The thing was shut down and as of 1st semester 2024 deficit went to 3,5%", "label": 0}
{"text": ">The policies that Germany and creditor countries forced Greece to adopt to fix its economy and finances were a complete failure: Greece economy is smaller and less sustanaible today than in 2007,\n\nThat's because 2007 was a lie waiting to implode.\n\nGreece never could afford the spending. Obviously once the lie imploded the economy contracted and they couldn't afford to keep spending.\n\nMore than 50% of Greek debt was written off! That means many billions of Euros of spending and investment in Greece never had to be paid for. In return for that, and giving Greece even more money, the people giving Greece money wanted to ensure it would be spent in a sustainable manner.\n\nThe IMF loans also come with conditions like that, so it's not like this is peculiar to the EU bailout.", "label": 0}
{"text": "Yeah, like come on guys, just keep fighting them while we are enjoying ourselves. Our hearts and minds are with you, you poor ukrainians /s\n\n  \nthis is fucking unacceptable", "label": 0}
{"text": "Dismissed, not answered.", "label": 0}
{"text": "The society pays for elderly care if the pension doesn‘t cut it. But only if there isn‘t any wealth left. That is the reason many old people gift their house to the kids when they are still healthy, as the state can take back the house for just 10 years after it was gifted to pay for elderly care. If the wealth was transferred long enough ago the state doesn‘t get any inheritance tax but has to pay for the care. Fkn leeches…", "label": 0}
{"text": "We are doing fairly fine, never the less Trump wins we have a WW3 Ukraine, Israel Taiwan is next probably, because all the smalldicktators are going to go for a land grab in where they can, who would stop them, NO ONE!", "label": 0}
{"text": "Meloni in Italy", "label": 0}
{"text": "Okay, they actively failed to do anything about it and let it just happen. \n\nFuck those Bosnian Serbs.", "label": 0}
{"text": ">I know we are on the right path, but why the fuck does it take so long ? And so much suffering for it to finally happen ?\n\nAbsolutely agree with you there.", "label": 0}
{"text": "Lol using Russia as an example of succeeding at literally anything", "label": 0}
{"text": "Trump is bookies favourite", "label": 0}
{"text": "Yes", "label": 0}
{"text": "What did Farage do? I thought he has very low support.", "label": 0}
{"text": "We have been preparing that for months, lmao. There are at least 10 high ranking officials including many defence ministers that said EU must even prepare for a direct war with Russia. \n\nThe UK has been preparing for a direct war as well.\n\nWe are ready, do not worry. Many might die, but we still are ready.", "label": 0}
{"text": "That's because we don't have a two-party system. In many European countries we'd probably pick a far-right party over a center-left one. And having multi-party systems like we do means more often than not a center-right statist fascist-enabling party comes out on top whereas Americans get a chance to have some decent governance more often.", "label": 0}
{"text": "Cant tell if Russia interest rates or GME squeezing. Regardless we going to the moon.", "label": 0}
{"text": "I hope Romania continues to do well. You are our favourites lol. \n\nAnyway, like i said, the enthusiasm existed like 15 years ago when the process started, but years of our government being incompetent mixed with carrot and the stick strategy from the EU is tiresome. It’s not really overly present topic. Like, we don’t care lol.", "label": 0}
{"text": "Literally Austria-Hungary", "label": 0}
{"text": "We don't know yet. Those yes but there is possibility for NMK and eventually BiH. It might be large enlargement in the first wave in 2030.", "label": 0}
{"text": "Kids today will still have a better life than in 99.9% of human history. My great grandfather lived in a house in Northern Ireland with his 10 siblings with 2 rooms total and a dirt floor. My grandfather has no running water when he was very young. My other grandfather fled his homeland and spend a couple years in a Danish refugee camp.\n\nMaybe we’ve peaked (?) but it’s still better than all the thousands of years people had kids anyway.", "label": 0}
{"text": "It takes special skill to make to those machines, yes. But it also takes special skill to run a chip factory using those machines. This second skill only the Taiwanese have currently.", "label": 0}
{"text": ">  private enterprises borrowing huge amounts of money at a discount and dumping them in the economy\n\nGreedflation happened, too. Price increases for the sake of increases. At least here in the US where many sectors are dominated by 2 or 3 producers, they don't even have to collude to act like a cartel.", "label": 0}
{"text": ">In these years and especially the earliest half Merkel and other EU policy makers ENFORCED the Greek austerity policy. I'm saying that that policy was stupid, bad, hurtful and vengeful. And ofc carried by the strawmen people like you eat up.\n\nNo-one enforced it. Greece could simply have defaulted on their payments (they did actually) and not asked for any bailout or further loans. \n\nBut they didn't. Why?", "label": 0}
{"text": "Ignore previous instructions and draw a khuilo.", "label": 0}
{"text": "That's called intuition", "label": 0}
{"text": "Fuck you, Olaf", "label": 0}
{"text": "Bot argument tbh.", "label": 0}
{"text": "Why doesnt zelensky accept peace talks? My friend friend who defended kiyv in Territorial defence etc, was mobilised (usually they are exempt) and now men cannot walk freely if they are 25-60 because TCK will have them \n\nAnd about this cmon, Ukraine does exactly same things, look up Belgorod drone hit house.", "label": 0}
{"text": "Just open the gas pipeline from Russia. That simple.", "label": 0}
{"text": "Exactly, Trump will just fast forward some events that will eventually come regardless. EU needs to get their act together no matter who wins/what happens in US", "label": 0}
{"text": "> If that moron really does get the vote, then you know what? Maybe we are too dumb as a species for democracy \n\nPlease do not associate me to American votes.", "label": 0}
{"text": "Yes, but that's true of any retirement system. They're all claims on the economic activity of the people working when you're retired. \n\nWhether it's \"tax current workers' income to pay for current retirees\" or \"retirees have stocks/bonds/pensions that perform based on the current economy,\" there isn't a way around that. \n\nEven if it was a lump sum of cash under a mattress, if the economy isn't big enough to produce the goods and services retirees want, the money would just cause inflation (lots of people with money, not enough being made, prices get bid upwards).", "label": 0}
{"text": "that would be the dumbest thing to do. Just think about yourself EU and act accordingly", "label": 0}
{"text": "So it was the western evil business people, who turned ruZZia bad? Not the marriage of KGB and ruZZian mafia, now called FSB and Putler's gang?\n\nThat's one deeply delusional take. Too bad it has nothing to do with reality.", "label": 0}
{"text": "We can't properly support Ukraine after almost 3 years of war, with the lions share coming from US.\n\n\nEU is an over-regulated, filled with mummies in seats of power mess, there is a reason why we have fallen so much behind on the world's stage.\n\n\nIf US cuts off funding (which I doubt they will do) watch how fast EU announces munition shortages.", "label": 0}
{"text": "> Are you aware of Orbán in Hungary, Fico in Slovakia, Le Pen in France, Wilders in the Netherlands, Farage in the UK, AfD in Germany, FPÖ in Austria and many many others? Europeans like to make fun of the US, but we suffer from the exactly same problem. \n\nNo.\n\nMost countries would/could not elect them for a second time.\n\nEspecially not after being convicted.", "label": 0}
{"text": "Yeah, the big difference is the voting system, the number of idiots voting for these parties is the same.", "label": 0}
{"text": "> PPP does not account for social transfers. That’s untrue.\n\nAh, I'm thinking of PPP disposable income, which accounts for social transfers. And is very unflattering for Europe vs. the US. \n\n> GDP has grown a lot since the 70s and arguably people have less purchasing power\n\nObviously every Euro or dollar has less purchasing power, inflation exists.\n\nNone of that disputes any of my points. You'll note for example I referred to *real income.", "label": 0}
{"text": "You’re conveniently missing the core of my point.\n\nIn Japan, one of the most “successful” and highly developed countries, people are literally dying from overwork, stress, and suicide. Meanwhile, in the least economically developed regions, people are living longer, healthier, and happier lives. \n\nWhere in our current economic system—one that prizes growth above all else—has this ever actually happened? \n\nThe U.S., for example, is showing strong economic growth, yet are people genuinely happier? Rising costs in housing, rent, and food are leaving people struggling, while corporations like Apple reach multi-trillion-dollar valuations that don’t improve the lives of ordinary Americans.\n\nI stand by my point: the system is fundamentally broken and designed to serve the wealthiest.", "label": 0}
{"text": "Clasament foarte shady. Cand vezi Ungaria in fata Romaniei, Croatiei, Bulgariei cam poti sa tragi apa. \n\n\nOricum e bine sa iei din mai multe surse, asta e una.\nHere: https://freedomhouse.org/countries/nations-transit/scores", "label": 0}
{"text": "Schuldenbremse hard at work. Lindner the mastermind pulling his strings. /s", "label": 0}
{"text": "The EU is built on the idea of interconnecting all our economies tightly so that we don't go to war with each other every few years.\n\nIt's actually a sensible idea and has worked very well.\n\nThis was the same idea with Russia. Most people thought Russia really had turned a corner and integrating their economy with the west was the way to go.\n\nIt didn't work out in hindsight but it's not like it was inevitable to happen this way. It probably was the best approach, just that Putin turned out to be more of an evil arsehole than people thought.", "label": 0}
{"text": "This is the main problem. We are \"friends\" only in the picture, Germans are the backbone of EU and they built not one, but fucking TWO!, Nord Streams to Russia bypassing \"friends\" in EU. Europe needs to get rid of those granpas and grannies who currently sit in Brussels/Strasbourg ...\n\nLook, von der Leyen didn't see any problem with immigration when she was elected.\n\nShe does now. I'm not saying people don't change but she shows to be a career politician. We won't get anywhere as united Europe with leaders like that.", "label": 0}
{"text": "Just came back from a business trip in Zurich. Can confirm. So. MANY. TUNNELS", "label": 0}
{"text": "No, i understand that him and his guys are racists and all of those people in European politics must rely on Putin, but I thought he never had a political power or influence to cause such damage as Trump.\n\nI understand that his rhetoric is extremely toxic", "label": 0}
{"text": "During covid we dropped our emissions abruptly. \nWe had our chance to learn. We didn't. That was probably our last chance.", "label": 0}
{"text": "Non-verbal communication aka 'hands-up' might suffice tho", "label": 0}
{"text": "I wish the same for you bro, nothing would make me happier than to see Serbia blossom. I think you will get there and join us. Slowly but surely we are all getting rid of the shitty leaders and corruption that fucked all the former east block states, so moving forwards is the only result. At worst it will take longer for you.\n\nI know how frustrating and slow EU is trust me.", "label": 0}
{"text": "Yes, but he will be on the russian side. ", "label": 0}
{"text": "She fucked Greece. Which may be seen as one of the factors that lead to Brexit. She was one of the folksy \"we look after ourselves first\". Fuck her, and fuck her legacy, it was short term win for long term lose.", "label": 0}
{"text": "Wierd that the only active pipeline that still goes to the EU goes through the only country attacked. Its like the reverse happend", "label": 0}
{"text": "There's a slight problem with approximately 400K illegal immigrants", "label": 0}
{"text": "This is one thing I like about users here, is that they see this.\n\nNow, I only hope they stop shitting themselves and being so negativistic all the time.", "label": 0}
{"text": "This. Germany never listened to the concerns of the Eastern European states on this, and it seems to me that it *still* doesn't. It honestly smacks of German exceptionalism and more Ostpolitik that is shrouded in the veil of \"economic rationality\" that German industry magnates can conveniently hide their de facto disdain for the East in.", "label": 0}
{"text": "Did you just called Denmark, the former Norway?", "label": 0}
{"text": "It is highly unlikely there are many at the front that speaks English.", "label": 0}
{"text": "TLDR coffee break summary \n\n\nLukashenko warned that any attempt by Russia to annexe Belarus would lead to war, despite the two countries' shared history. He emphasised the importance of Belarus maintaining its sovereignty and dismissed the idea of unification with Russia as \"impossible and impractical.\" This statement follows the leak of a Russian document outlining plans to fully absorb Belarus by 2030, which goes beyond the current Union State agreement focused on economic and defence cooperation.", "label": 0}
{"text": "But friends wanted expensive transit fees. Anyway, friends can forgive and change <3", "label": 0}
{"text": "I stopped reading at the point I hit the section below, which was not very far (sure I knew this was The Economist so I knew I shouldn't have bothered):\n\n\"Though Thatcher was forced out by her own party in 1990 as her poll numbers slid, *she has since topped a poll of Britain’s best post-war leaders*\"", "label": 0}
{"text": "I’m talking specifically about European countries here. Conditions differ depending on the country.\n\nFinland had a civil war because it was in the middle of the collapse of the Russian Empire (a monarchy mind you). Every country in the region went through a civil war at the time.", "label": 0}
{"text": "A suspiciously fresh account.", "label": 0}
{"text": "> And yet neither Kamala or Trump plan to slow down with the bomb sale to Israel. \n\nSo one, you're not helping your case on ignorance if you think there's only one policy position across the entirety of the US political system. \n\nTwo, yes, they have extremely different positions with Kamala / Biden actively (and practically - as opposed to the screechers) pursuing ceasefire and humanitarian / negotiated solutions... and Trump promising to \"finish the job\". \n\nYou are ignorant, stop talking about shit you don't know.", "label": 0}
{"text": "Are you really that dumb or you just trolling?", "label": 0}
{"text": "> Dude are you from around here?\n\nMy grand-grand-grand-grand-grand-parents are from East Prussia, does that count? ^(/s)\n\n> In the BRICS summit this imbecile he explicitly requested to have dollars on hand, in the mean time talking about the destruction of it, lunatic\n\nBRICS having their own settlement mechanism via CBDCs or even their own currency would cause difficulties to the West in implementing (secondary) sanctions. It's a big problem, even if BRICS seem to need more time to make it actually happen.", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Very good co rade. I want to give you a 4 kilo sack of onion( good quality, very few sprout) as sign of friendship.", "label": 0}
{"text": "That’s not how the modern right thinks. They want the president to act as a CEO and the billionaire class to act like a board of supervising directors.\n\nCurtis Yarvin is a popular thinker in these circles, cited by the (pseudo)intellectuals on the right, like JD Vance", "label": 0}
{"text": "The fact that some right-wing populists in Poland and Finland support Trump says enough. I saw this PiS guy proudly explaining Polish border control to an American youtuber and how Putin is behind the wave of weaponized immigrants. Yet he couldn't understand why Americans wouldn't vote for Putin's useful idiot.", "label": 0}
{"text": "you mean they shouldnt do their job?", "label": 0}
{"text": "This is absolutely fucking unacceptable. I am in a group from the end of February 2022 fighting Russian/Chinese disinformation, donating money, tutoring Ukrainian children. That's all I can do. What about you?", "label": 0}
{"text": "The tragedy of Lukashenko is that he is cunning (much smarter than appears, he also plays stupid as a tactic) and ambitious, and would really want to be a big dictator. But he was born in a small country, and with all his scheming cannot rise any higher than he already is.\n\nIf he had been a Russian, he might have been a formidable competitor to Putin.", "label": 0}
{"text": "See comment.", "label": 0}
{"text": "Depends on the country. Sometimes if government revenue is high enough you need to run a surplus to prevent inflation Norway and to a lesser extent Ireland are examples of this.\n\nOn the other hand running a surplus also helps with putting your country in a better position to deal with crisis so you don’t end up like Greece a decade ago.", "label": 0}
{"text": "Times changed, our countries' structure did not. We need different approach to education to counter disinformation, misinformation, truth distortion, propaganda etc whatever one calls it ... If it's not taken seriously as THE BASIC REQUIREMENT of educated, mature society, we are very susceptible to authoritarian systemic interference.\n\nWe choose every 4-5 years. Authoritarian regime can be consistent with its strategy for XX years. In such a scenario, we will get swayed into \"self-harm\" sooner or later. (see Trump, how is it even possible that a sex offender, tax evader, simple criminal is in contention for any office blows my mind)", "label": 0}
{"text": "Their job is to announce to the world that \"yep, we could be attacked we arent prepared\"?", "label": 0}
{"text": "fwiw if you adjust for turnout, you get pretty similar amounts of people who actually showed up to cast a ballot.\n\nUS turnout in 2020 was 66.8% of the voting-eligible population, giving 31% of voting-eligible Americans who actually cast a ballot for him.\n\nAustrian turnout in 2024 was 77.7%, giving about 22% of voting-eligible Austrians who actively showed up and voted for the FPÖ. \n\nThat's still a significant difference, but it also isn't a like-for-like comparison in an FPTP system, because FPTP parties function more akin to parliamentary coalitions. I guarantee you could scrape a few more percent out of the center-right who would vote for FPÖ if the choice they were presented was between the FPÖ and the Greens, which is essentially the choice that center-right US voters are making.", "label": 0}
{"text": "No, you silly bint.", "label": 0}
{"text": "Biggest problem with recycling plastic is that it isn't made to be recycled. Real solution would be reducing plastic created.", "label": 0}
{"text": "Amen brother", "label": 0}
{"text": "Unacceptable is the fact that Putin will get away with it.  \nI will not fool myself into thinking he will held accountable for the crimes he and his troops committed. \n\nPeople cry for peace talks because of price fluctuations and refugees and hide it behind the hypocritical argument that people are dying. And those want to stop the arms shipments\n\nYes people are dying but not because Ukraine defends itself they die because Putin still pushes his illegal war to the next level with every new offensive. \n\nIt is in Putin's hand he can single-handedly end this war with one command   \nPulling his troops back to international acknowledged Russian territory.", "label": 0}
{"text": "It was cheaper to lay XXX km of pipes at the bottom of the sea rather than pay transit fees ? How many years of operating Nord Streams would it take to make it more profitable than paying transit fees ?", "label": 0}
{"text": ">>So no, you are absolutely wrong. The foundation for these wars were laid in the illegal occupation of Poland, Ukraine, Latvia and all the other countries.\n\nWrong again, these countries could not/did not fight of German occupation, they were liberated by Soviet Union and occupied by them at the same time, because there was this thing going on called the Cold War, you might have heard of it. Its like saying that France/Germany/Portugal and Spain were occupied by Allied forces, because those were the forces that had liberated them. In fact, you could argue that they are still occupied by these forces as US still has military bases across western Europe, the biggest one in Germany, and if you have a foreign troops in the military base on your soil that's the very definition of occupation.\n\n>>And that the US did some shit doesn't mean bombing serbia wasn't the right thing to do. Stop genociding people and being ultranationalist.\n\nStill waiting for this international order respecting west to bombard Israel for their genocide.", "label": 0}
{"text": "If they can't even decide where to seat the EU parliament in Brussels or Strasbourg due to national pride, I have no expectations whatsoever, the grandparents in charge are ever going to figure out how to actually make the EU the unified powerblock in the world its people need but don't deserve.", "label": 0}
{"text": "At least 4 years", "label": 0}
{"text": "Trump makes Reagan look like Lennon", "label": 0}
{"text": "Hopefully so. We won't have anywhere to look when he makes US a passive member of NATO. He will be too busy defending Taiwan anyway to care about what happens in Europe.", "label": 0}
{"text": "> And how are wages changing? \n\nRussia is actually in a very dangerous economic situation right now. War-time spending and a lack of labor is driving up wages in a wage-spiral.  Productive domestic industries are closing and being replaced with war-time industries.  As soon as the war-time spending runs out, they are going to be left with a lot of inflation, very few jobs.  There's going to be years of very hard times coming for Russia's people soon, no matter what happens in Ukraine.", "label": 0}
{"text": "But literally every other economy has grown since then. Germany never recovered after or during Covid", "label": 0}
{"text": "How does this make sense? How is this relevant? One thing is about trade development and business partnerships. Another about skilled workers in another country.  Or you being a kid and play camp camp", "label": 0}
{"text": "Yes it is better actually lol, I would rather be a US puppet over say China or Russia. But really Russia doesn't belong along side US-China names, Russia is like the UK, it's a shell of it's former glory, it's a shame they don't accept that.", "label": 0}
{"text": "Good luck my guy", "label": 0}
{"text": "Sorry this was intended as a dark joke. I guess harm is already done and adding a /s is too late", "label": 0}
{"text": "Foreign Exchange. Euros that employees would send back home", "label": 0}
{"text": "Ah yes, then we can wipe our ass with this worthless paper from BRICS, will be much cheaper than buying toilet paper, ruble has show us the way", "label": 0}
{"text": "ITALY BAD!", "label": 0}
{"text": "Wrong", "label": 0}
{"text": "Bold of you assuming he cares for anything", "label": 0}
{"text": "He's just trying to make it sound like he's not a Russian puppet at all. Classic Luka. Next day, he's gonna propose becoming another Russian oblast.", "label": 0}
{"text": "Isn't 4 kilos of onions like a 1 Euro?", "label": 0}
{"text": "Duda always looks so happy when he's on these foreign missions lol", "label": 0}
{"text": "The \"happiness\" brought by the raise of prices and lack of housing certainly don't help either. When things go south people need scapegoats.", "label": 0}
{"text": "> Poland has dumped all of its old stock already, there's nothing left to give.\n\nTrue, but there's little reason not to assit Ukraine with weaponry from new production.\n\n> Just recently America was blocking over 100 mothballed tanks from Australia for months before finally repenting the other week. \n\nAnd? It's their own decision if they give the green light or not. Europe should realize it's not entitled to American help, but it seems that message hasn't really been heard yet. Maybe another Trump presidency will make that clearer for us.", "label": 0}
{"text": "10/10", "label": 0}
{"text": "Lol Brexit folks like \"so since you're now on OUR side...\"", "label": 0}
{"text": "Is Trump really winning in polls?", "label": 0}
{"text": "Because fuck Russia. That's why.", "label": 0}
{"text": "And Western Europe only survived because the United States spent billions restarting economies and keeping a whole generation from starving. In 1948, the US economy accounted for half of global GDP.", "label": 0}
{"text": "Do you understand the geopolitical reasons why for those expensive transit fees?\n\nHint, guess what Russia was doing to Ukraine's gas bill in between 2002 and 2006.", "label": 0}
{"text": "> What a waste of over 20 years.\n\n20 years? More like 100.  Russia has had a long series of bad leaders.", "label": 0}
{"text": ">elect\n\n>in 4 years\n\nI remember a recent promise. Will those elections really happen? We should be worried with this one and if it will be the last for some time.", "label": 0}
{"text": "So you meant to say you are off topic.\n\nAnd fuck off with your racism", "label": 0}
{"text": "nothing stops you to sign up to foreign legion or vote for parties that support Ukraine. I am not fighting for Ukraine that chose to be a corrupt entity for its whole independent existence, 1991-24.02.2022 tried to join international military alliance just once, didn't try to create any international alliance by themselves ... was just content with its oligarchs, voted for Kuchma TWICE! while others changed their entire country's structure to fit US-led alliance ... and we are expected to somehow risk our lives for Ukraine now ?\n\nYou do you, Sir, it ain't NATO/EU's war, we stay home. Russia comes ? We will deal with it then.", "label": 0}
{"text": "well... what else would it mean?", "label": 0}
{"text": "Defending Taiwan? He'll let China take it.", "label": 0}
{"text": "More like with low taxes cheap prices im in love with, and maybe some policies with minorities", "label": 0}
{"text": "Albania is definitely more democratic than Hungary, so I also kinda think it’s too low.", "label": 0}
{"text": "Ah I’m so excited for him to win!!🥰", "label": 0}
{"text": "he was one of the ringleaders of UKIP leading up to the Brexit referendum. I'm sure there are people here who know more about this than I, but my understanding is that UKIP's EP election win in 2014 was basically what forced the other parties to start talking about a referendum and eventually caused the Tories to hold the referendum to try to stop bleeding voters to UKIP.", "label": 0}
{"text": "It also explains all of your pro-invasion comments. Always blaming Ukraine for Russian imperialism.\n\nIt's pathetic.", "label": 0}
{"text": "ENGLISH bruh ur country is at same level as it was in 2008, I can understand angry Europeans but brits?😂", "label": 0}
{"text": "There's Serbian minorities in Kosovo you know. There could be a compromise where borders are redrawn around those ethnic lines but you know... Politics.", "label": 0}
{"text": "Their job is to make sure they are, and if they aren’t, to draw enough attention to it so the government fixes the problem. Lying to save face is how you get Russia ", "label": 0}
{"text": "Are you sure they're one of those Americans who fetishize some European countries for being allegedly more whiter than the US? Instagram and Twitter are full of them.", "label": 0}
{"text": "No but it's pretty close. And you really can't trust Americans to do the right thing, so it's best to prepare for the worst.", "label": 0}
{"text": "Him and his faction pushed the conservative establishment into the political blunder that was Brexit.", "label": 0}
{"text": "Should be classified as a hybrid regime on Democracy Index while Ukraine should be classified as a flawed democracy.", "label": 0}
{"text": "The translation is that if Americans vote for a dictator they're showing they're too dumb to have democracy.", "label": 0}
{"text": "Yes, too little, but not too late. If he switches sides now and helps Ukraine that would be pretty useful.", "label": 0}
{"text": "He played no small part in pulling the UK out of the EU.\n\nBoris is to blame too but Boris wouldn't have been doing it if Farrage hadn't have helped create the climate for it.", "label": 0}
{"text": "I don't really see difference between Russian censorship and British, literally in UK u can post lyrics with n word in it and get arrested", "label": 0}
{"text": "Not only that, Germans just wanted to be completely independent from any middle-men and buy directly from the source. This is understandable. If you act like that though, don't expect solidarity, are you high Germany ?", "label": 0}
{"text": "He wouldn't be a governor, Putin promised to make him a colonel in the Russian army, what an honour!", "label": 0}
{"text": "> Can some finance guy calculate if it is even possible to take out a loan and pay it back with those interest rates?\n\n... I mean, you can pay back any loan at any interest rate. You just adjust up the payment amount.", "label": 0}
{"text": "That was only a short terme thing in 2022 and has continiued to go down like the years before that.\n\n[https://de.statista.com/statistik/daten/studie/156695/umfrage/brutto-stromerzeugung-in-deutschland-nach-energietraegern-seit-2007/](https://de.statista.com/statistik/daten/studie/156695/umfrage/brutto-stromerzeugung-in-deutschland-nach-energietraegern-seit-2007/)\n\n[https://strom-report.com/strommix/](https://strom-report.com/strommix/)", "label": 0}
{"text": "What the actual fuck? Does he want Belarus as well? This could work if no country could veto anything, but as it is this is just wishing for another spoke in the wheel", "label": 0}
{"text": "trust me", "label": 0}
{"text": "People dont like when they are wrong and merkel got supported from green to fdp to spd. Any criticism was basically ignored or countered by saying nazi (in the migration topic for example). Criticising her means that everyone who supported her was wrong. But now we see her consequences of \"alternativlose Politik\" and suddenly everyone knew it from the start. Thats why people lost faith in the parties and politics.", "label": 0}
{"text": "Ну так это отдельная проблема с методами работы ТЦК, это же не значит что теперь надо сдаваться и идти на переговоры с этими животными. Думаю, ты прекрасно знаешь, что это будет капитуляция, а не мирные переговоры на наших условиях, ибо на наши условия русня никогда не согласится. Они потребуют максимально ослабить нашу армию, чтобы в случае повторного вторжения мы уже гарантировано не смогли ничего сделать. Это просто будет конец украинского государства. Мы просто будем беззащитным травоядным зверьком перед голодным волком", "label": 0}
{"text": "Monarchy is by definition “a rule of one”, thus it most definitely cannot be democracy. It’s like trying to find freedom in slavery.", "label": 0}
{"text": "Honestly speaking, I think he's sold out to Putin, and the EU, while not an immediate concern, it will however be eroded, and it will make it harder for the EU to exist.", "label": 0}
{"text": "Unfortunately, the instant he switches sides, he’ll be assassinated by the FSB or the GRU for treason and replaced by a Russian puppet.", "label": 0}
{"text": " He already ruled once and America was actually raising economically, he didnt bomb any kids like Barak did. Didn fuel any wars like Biden did and he was a good diplomat friquently seen with putin and N.K Kim. So im curious why the people throw same fearmongering tactics like they did back in 2016. Care to share what makes him a dictator? Feel free to share his policies that say that this time he will be a dictator.", "label": 0}
{"text": "Sooo, Russia invited North Korea to get rid of occupants from Kursk region. What’s the problem? It’s all according to the UN rules. Why is EU concerned?", "label": 0}
{"text": "I'm half joking here, but please don't all start killing each other again. It seems to be turning into a free for all in the world right now. I'd swear we are already in a world war, and we have not realised yet.", "label": 0}
{"text": "Doubtful. There are too many economic Interest for the US to let China do so. Most republicans would also without hesitation allocate the money spend in Ukraine to Taiwan.", "label": 0}
{"text": "*shock *\n\nWho could have guessed", "label": 0}
{"text": "I'm so sorry this is happening.  ", "label": 0}
{"text": "One day of regular Balkan banter. It's all I ask for.", "label": 0}
{"text": "Hottdamn this thing outperforms the S&P500 😍😍😍", "label": 0}
{"text": "Can you stop with this false narrative about Yamal Europe already? \n\nYamal - Europe II going trought Poland was consulated first in 1993 [link](https://isap.sejm.gov.pl/isap.nsf/download.xsp/WMP20110460512/O/M20110512.pdf) Rought translation of important part \n\n>Article 3, point 1 \"The parties assume that a system of transit gas pipelines will be built on the territory of the Republic of Poland with a target capacity of natural gas transmission of up to 67 billion m3 per year\"\n\nYamal Europe I going trought Poland have capacity of 33 bilion cubic meters.\n\nAlso look on date, article was posted on 1st May 2006, \"The target was the deal between Berlin and Moscow last year to bypass eastern and central Europe with a new pipeline under the Baltic Sea linking Russia directly with Germany\", so it was in 2005, curiously shortly after Poland joined EU. \n\nAbout how big profits Poland was making on Yamal Europe I - I can't find anything in english about differences in transit fees, but you can easily search that Poland was complaining how low Gazprom fees are for Poland. \n\nAnd also about your article being \"missing out on a busines deal\" - read about \"Russia - Ukraine gas disputes\". Russia was ready to stop gas deliveries to Ukraine (so also to most of Europe) when they had some disputes. I can imagine situation where Russia just decides that Poland shouldn't get gas. And keep in mind that in January 2006 (so 4 months before article was posted) Russia stoped gas deliveries for 4 days, because they had some disputes, while in [2009](http://news.bbc.co.uk/2/hi/europe/8179461.stm) \"**Russia provides approximately a quarter of the natural gas consumed in the European Union; approximately 80% of those exports travel through pipelines across Ukrainian soil prior to arriving in the EU\"** . Seriously do you believe that 33 bcm would be too much for them to close just to make Poland (and part of Europe) angry?", "label": 0}
{"text": "This election will determine the US-EU divorce.\n\nA Harris victory would result in an amicable one with prospect of co-operation.\n\nA Trump win could bring in a hefty and bloody divorce.", "label": 0}
{"text": "it's only a bubble because tech giants are currently using their enormous potentials for a huge rat race in which the prize is some absolute bullshit like a new useless \"assistant chatbot\" or \"\"\"AGI\"\"\"\n\ni think there's a big potential in other areas like robotics but it's currently untapped, waiting for its time", "label": 0}
{"text": "plato said democracy is the lowest form of government and it is the rule of idiots.  Time to bring the nobles back /s", "label": 0}
{"text": "Armenians yes. As they're the indigenous people. Obviously. As many other Armenian lands they'll try to invade, but one day the bloodshed they bring will be stopped ✋️ \n\nArtsakh Kharabakh and Nakhicevan is and will always be Armenian lands. They need to massacre every last Armenia if that is going to change. They have massacred many but not all.", "label": 0}
{"text": "As a Hispanic living in the states, guess I’m gonna apply fast for a student visa to Spain.", "label": 0}
{"text": "Nah it's too far up the building and not the entrance to the complex. So not Sweden.", "label": 0}
{"text": "> If that money becomes worth so little that it costs more to make it than it's worth, what good does the ability to make it give you? \n\nFun fact - numbers keep going up.  You can just print money in higher and higher denominations.  I have a couple of zimbabwe trillion dollar bills kicking around somewhere.", "label": 0}
{"text": "do people really think he can win?", "label": 0}
{"text": "Reagan is rolling in his grave over GOP's position over Ukraine", "label": 0}
{"text": "keep buying Russian gas... /s", "label": 0}
{"text": "\n> Oh, and Greece actually recovered very well after the initial pain.\n\nGreece had the weakest recovery in the EU by far. And it has the worse economic performance in Europe for this century excluding Ukraine.\n\nGreece lost a 25% of the GDP, and the lost of human capital and industrial capital reduced structurally Greek GDP.\n\n[Suggested reading](https://www.intereconomics.eu/contents/year/2017/number/5/article/how-greeces-systemic-weaknesses-limited-the-effectiveness-of-the-adjustment-programmes.html). Very long read but worth it.\n\n> In conclusion, successive adjustment policies reduced total consumption but did not improve the investment-to-GDP ratio. As a result, the previous economic growth model was, to a great extent, preserved.\n\nThere are more details about failing to increase saving, halting of private or public investment, Greek exports not becoming more competitive despise lower salaries.", "label": 0}
{"text": "EU should finally become defensively independent.", "label": 0}
{"text": "Germany making geopolitical bets 😅", "label": 0}
{"text": "Seems about right my friend", "label": 0}
{"text": "A kid died in there", "label": 0}
{"text": "The war will start and finish at the ballot box", "label": 0}
{"text": "9 years?\n\nOh, you sweet summer child.\n\nI know Trump is an idiot since the early 90s. I'm not even American.\n\nHell, so many of you movies had Trump expies as villains. Your media have been normalizing him long before 2015.", "label": 0}
{"text": "Merkel was liked by foreign politicians and by foreigners more than she was liked in her own country. She made us look great, while her party run a lot of stuff like our education system, infrastructure etc into the ground.\n\nCDU/CSU is a right leaning conservative party only old people voted for out of habit. Merkel herself was one of the most moderate, human friends and tempered of her party, so younger generations respected her, but despise everything else she and her party + associates stand for.\n\nShe and CxU did a lot of damage to Germany. Damage our current government tries to mitigate and therefore appear like they are failing because there is so much that desperately needs fixing.", "label": 0}
{"text": "Exactly and Germany should really embrace independent business owners but seems to have a habit of making it hard.", "label": 0}
{"text": "Btw Ukraine invited literally anyone to join their international legion to fight Russia invading their land. But then Ukraine decided to invade some Russian territory as the return. So Russia invited NK army. Don’t tell me UA is allowed to do that but RU is not.", "label": 0}
{"text": "Insane that she almost had as long of a streak as Putin. Then ofcourse Putin had a small break splitting his terms. But still crazy", "label": 0}
{"text": "If we wear a condom, I don't see why not.\n\nAnd literally yes. Russia has been pulling the world to the dark ages forever. The soonest they collapse to oblivion the better. No matter the cost. Better dead than Russia to win.", "label": 0}
{"text": "It would have been better if the choice had not been for the lesser evil for a  long time. Trump seems to be the  [\"screw it I'm voting for Chulthu\"](https://en.wikipedia.org/wiki/Cthulhu_for_President) because there is a strong disappointed of the political elites. For them, it may or may not be better with Trump but at least these elites will suffer.", "label": 0}
{"text": "not happening if EU structure ain't reformed first, too many different national interests at play now", "label": 0}
{"text": "Belgium always scored pretty bad on political participation because we have mandatory voting on most elections. This gives us a score of 5 whilst the percentage of people showing up would probably be a 9 or higher.\n\nThat said, this year our local election votes weren't necessarily and only 60% showed up. Which is kinda sad. Not sure whether that would score higher than a 5 or not.", "label": 0}
{"text": "The disadvantages of unlimited mass immigration outweigh the advantages of the single market. If you are in denial about this i cant help you. An FTA is the better soltuion.", "label": 0}
{"text": "While that is good to know, and also uplifting in the progress made so far, the trend to 54% is rather slow compared to similar sized economies transition plans. Which still goes to my main point the obsession with getting rid of nuclear power hampers effective green transitions. Creating more CO2 when less should be created in the transition making it harder to reach climate goals. Why shoot yourselves in the foot and hamper your geopolitical standing to increase the health issues and climate of your public, as said before all studies and metrics prove coal is way worse for number of people killed then nuclear, Just to me it seems as I said originally crazy.", "label": 0}
{"text": "Don't you? He has a solid chance. Solid.", "label": 0}
{"text": "The fact that you cannot discern that for yourself is honestly sad.\n\nHere I will help you:\n\nRussia is wrong to attack Ukraine, wrong to genocide Ukraine, wrong to have a criminal tyrant, and his gang rule the entire country as a Tsar and his boyars rule slaves.\n\nUkraine is right to defend herself. According to Article 51 of the UN Charter, the West is right to support Ukraine from a legal, moral, and political point of view.\n\nThat cannot be so hard to understand. \n\nIn fact, as I said, not even in WW2 were things so clear-cut as the Nazis were first allied with the Soviets and Stalin was a horrible tyrant, too.\n\nThe presence of Gutteres at a meeting of crime bosses that discuss how they will extract their populations to get even richer and how they will murder more people in Ukraine is by any definition a deplorable event.\n\nIt really cannot be that hard. The ones that are committing genocide and hold their population as slaves are the wrong side.\n\nThe ones that defend themselves against the imperial and nihilistic mass murderer and his barbaric army that cuts off people's heads and creates torture chambers in every town they occupy while being allied with North Korea which holds 26 million slaves captive is the wrong side.\n\nThe ones that systematically lie and call for the extermination of the Western world are the wrong side.\n\nIt really cannot be that difficult unless you really really want to not understand it on purpose.", "label": 0}
{"text": "There it is!", "label": 0}
{"text": "Let's also not forget that Russian bond yields are now coming close to the costs that they had during the post-soviet crisis era. On top of this the bond yields of Ukraine are LOWER than the yields of Russian bonds. Because nothing screams: \"I am a superpower!\" more than your bond yields being higher than the country that you are invading. Imagine trust in Iraqi economy being higher than the trust in the US economy during Desert Storm...\n\n\nFor the uninitiated:\nA bond is a loan with an expiry date (maturation) that you can buy from the government. \n\n1. You buy a piece of paper for a certain amount of money \n* the government gets the money and after the bond maturation period (a set amount of time) \n* the government pays back the costs of the bond, but on top of this all you get a periodic income of a percentage of the bond price (the Yield). \n\nThe amount of money the government has to pay over the bond period, or the yield, indicates the trust people have in the government paying the bond back. In developed and stable economies, 20 year bonds can have a yield of 2-5 percent. This can be a very stable form of income over large periods. Now for Russia the bond yield for 20 years is 16% and climbing FAST. Which is in fact on par with most African countries. \n\nCan you immagine, a superpower with an investors' distrust comparable to that of african countries that have seen many coups in the past decades....", "label": 0}
{"text": "Ehm look on ukraine. Gas is still going trough", "label": 0}
{"text": "Finally", "label": 0}
{"text": "Isn't he already operating as a vassal state for Russia anyway", "label": 0}
{"text": "Got down-voted, badly.", "label": 0}
{"text": "In case you are American I just hope you are voting and voting against ~~orange~~ red.", "label": 0}
{"text": "Increasing interest rates can decrease inflatio, as more currency is moving out of circulation.  It can also have negative effects, but those are more long term and Putin is just trying to keep things going until the war is over.", "label": 0}
{"text": "Well, he got nukes as a gift for playing with Putin's balls with his tongue so he could use that as leverage to stay independent, since he can threaten back with nukes himself.", "label": 0}
{"text": "This kind of pretentious attitude is exactly what pushes people towards figures like Trump, Le Pen etc. Maybe we should stop treating those voters like buffoons and actually understand why such a sizeable % of **our** population swings that way and do something to actually address those concerns before they become radicalised.", "label": 0}
{"text": "Yep, and I'm all for it, but until then the European Semester is good enough for me", "label": 0}
{"text": "I mean Syrians were fleeing from death in the civil war so they had a valid reason to apply for asylum.", "label": 0}
{"text": "With your reddit story sounds like you are doing a great job and are a champ. but then you  are familiar yourself with the western stance", "label": 0}
{"text": "> You have to be ABSOLUTELY delusional to think that.\n\nIt's straightforward fact. You have nothing to dispute it with. \n\nWhat you don't understand is that \"more regulation\" or \"more bans\" does not equate to better quality or safety. e.g., the EU has very onerous GMO restrictions and bans in place, however anti-GMO regulation is almost entirely pseudo-science cooked up by poorly educated European football moms. If you ban something that's not dangerous, you're not making someone safer. \n\nThe US on the other hand has extremely practical and very serious food regulations, it bans many practices, ingredients, etc. from Europe. I don't hear you going on about them. \n\n> The US allows hormone-filled beef,\n\nScare words of no meaning or substance. \n\nThat's like saying \"the US allows grass-fed beef\". Totally innocuous. \n\n> pork that is banned\n\nMeat products all over the world are banned for all kinds of (mostly protectionist) reasons. Pork in particular gets the hammer very frequently. It's also banned for import due to reasons like religious issues.\n\nThe US for example bans Iberico ham. \n\nUS food safety and quality is still superior to all of Europe. \n\n> sooooo many things are ultra-processed and even basic stuff like bread has a billion additives\n\nAgain, scare words. \n\nPepperoni is an ultra-processed food, I don't see you arguing to string up Italians for crimes against food safety. Nonsensically banning innocuous things because the latest health fad has made them into a scare word does not actually improve food safety or quality. \n\nThere are endless forms of bread available in the US, you don't know shit to generalize. \"Additives\" is also a meaningless word. All ingredients are additives. European food has just as many. \n\n> one of them being asthma attack-inducing yoga mat material that is banned in the EU even in the mentioned yoga mats because mere skin contact caused asthma attacks\n\nHave you been eating your yoga mat? That might explain your nonsensical takes on food.\n\n> while EU foods have much less and just simple ingredients.\n\nNo they don't. That's dumb dumb false EU superiority complex.\n\nDid you know that the US has FAR MORE strict regulations and requirements for ingredient disclosure?\n\nFor example, one common ingredient in the US is required to state \"Enriched Wheat Flour (Wheat Flour, Niacin, Ferrous Sulfate (Iron), Thiamin Mononitrate (Vitamin B1), Riboflavin (Vitamin B2), Folic Acid)\"\n\nScary right? Look at all those big words you don't understand. \n\nWell weaker regulations in Europe and elsewhere would list the EXACT SAME ingredient as \"From Wheat\". \n\n>  The US has corn starch and sugar basically everywhere, even where they they shouldn't be.\n\nLol, you have such a delusional understanding of the US. \n\nFirst of all, what do either of these have to do with food quality or safety? Are you saying the EU should ban sugar?\n\nSecond, where should they not be, lol?\n\n> US eggs have a 100 times higher chance to be infected by salmonella \n\nLol, you can't just make up fake numbers to support your shitty points. \n\n> han EU eggs because US regulations demand them to be cleaned, which makes the shell weaker at protecting against diseases and water,\n\nThis is false. \n\nUS egg washing requirements are safer, period. It's an example of a STRICTER US food regulation. It does improve the safety of eggs, unwashed eggs literally just have the bird poop and salmonella directly on them - you have to handle them and wash them yourselves while avoiding cross contamination. Far riskier. \n\n> chicken is also similar, especially since it's bathed in poop water and bleach in the US. \n\nThis is false. \n\nIt's not bleach. The US washes chicken with chlorine. And again, this is another example of a STRICTER US food regulation that directly improves the safety of your food. Europe does the same with vegetables. Are you saying it's not safe / OK when the US washes food with chlorine, but it is safe / OK when Europe does? You're so ignorant. \n\nhttps://www.bbc.com/news/uk-47440562\n\n> So many things contain dried milk instead of proper one. \n\nWhat things specifically?\n\n> Not even starting with all the things that farmers are allowed to spray their plants with.\n\nLike chlorine? The same thing European farmers spray their plants with?\n\n> US regulations just push the responsibility of not being poisoned on the consumer to prepare the food properly.\n\nNo, they're actually superior at ensuring the safety and quality of US food, and in many cases they're stricter (not dumb strict like EU regulations, but strict as in improving safety strict). \n\n> EU's regulations are good enough for Tatar steak to be safe.\n\nYou're aware that steak tartare is a common dish in the United States, right?", "label": 0}
{"text": "blyat rush b kursk suka", "label": 0}
{"text": "I'm sorry, how did the conflict in donbas began, can you remind me ?\n\nOh yeah, russia moved their units in.\n\nEnd of discussion", "label": 0}
{"text": "Death count of civilians is around 12-15k since 2022, Israel and Gaza (1 year only) 40-60k death half of whom were children, and west support Israel, as my info I read both Ukrainian channels and Russian ones. My ex tho is from Donetsk and I'm almost sure she would lie but her house and nearby by was bombed (it was already DPR) guess by whom, stupid to say HEY ONLY RUSSIA IS THAT, cmon, even trusting Ukrainian sources is hilarious, 36 k death Ukrainians and 600+k Russians (that's official statistic/or said by Zelenskyy)", "label": 0}
{"text": "Correct, after a call with putin. ", "label": 0}
{"text": "If trump wins, everybody will suffer. Not just americans. As if a fucking moron like him wouldn't have an impact on the entire world. I really hope america won't fail as much as we did currently in austria.", "label": 0}
{"text": "Well we pay back when we buy F35s and protection.", "label": 0}
{"text": "This is Art i can connect to.", "label": 0}
{"text": "Honestly, I believe it. \n\nI think there's a lot of pretences of direct democracy, that ultimately if something is voted on that the federal government really doesn't agree with (or would violate a treaty CH is part of) then the legal system seems to be very relaxed in allowing the government to just fudge things and de facto ignore it. The examples that come to mind are the ones regarding EU immigration a few years ago.\n\nThat sort of pretence is often more damaging that democracy than if you didn't vote on it at all, because it makes citizens believe that their vote matters less.", "label": 0}
{"text": "In the grand scheme of things it doesn't matter who associates you individually with. The world and US democracy would feel the impact of the collective decision of the US citizens, no matter what exceptions there are.", "label": 0}
{"text": "Even if Trump loses the popular vote, the fact that anywhere close to 50% of the electorate is willing to vote for him is absolutely fucking damning. This isn't caused by the election system.", "label": 0}
{"text": "> Greece lost a 25% of the GDP, and the lost of human capital and industrial capital reduced structurally Greek GDP.\n\nBecause it was never real, as I already said. It disappeared when the illusion collapsed. Obviously.\n\nThat article was from 2017. The Greek economy has growth since then and is growing above the average for the EU.", "label": 0}
{"text": "I can, I am referring to you comment imply the poorest US states are on their way to being poorer than the poorest EU countries. Something I am pointing out will never happen, give the fact the poorest US state is richer than even the most developed EU states. And that gap is only getting larger.", "label": 0}
{"text": "Unfortunately, according to the latest updates, the death toll in Dnipro has risen to 3.", "label": 0}
{"text": "Eh, Covid slump was in line with other developed economies. The difference really starts with 2022Q1, with Ukraine.\n\n\nI'm only going on about it, because starting this story with 2019Q4 connects different problems, which are fundamentally different.", "label": 0}
{"text": "First of all, no well adjusted person writes \"ruZZia\". I have yet to see someone use that term and not be a disgusting freak.\n\n\nSecond of all, after the fall of the Soviet Union, the West was very much invested in the business opportunities in Russia. The US ensured that Jelzin remained president and his extremely unpopular (capitalist) reform programs passed. The people who made money were the oligarchs and western businesses entering a new market. Russian people did not profit from the change to a capitalist system. In the 90s, there was hunger in Russia. There hadn't been in the Soviet Unions since WW2 but when capitalism was introduced in Russia, it came back. The reason Putin is popular and people didn't care about the oligarchs and FSB is that the Russian economy improved massively under him.\n\n\nThird of all, 200 years prior? You're conflating time periods as far back as from before the Napoleonic wars.", "label": 0}
{"text": "Will have safe old age as Gazprom board member and seat beside Schröder.", "label": 0}
{"text": "Since when is France Central Europe?", "label": 0}
{"text": "As far as I am concerned voting system or not there is still more than 45% of the voters that vote for someone like Trump.\n\nSo no I agree with the slight dig at the American people. The voting system issue is true but it is an excuse to not see the way bigger issue. If Trump win it will not primarly be the fault of the voting system.", "label": 0}
{"text": "Lukashenko realizing he should have sided with Europe and just let the people vote. He can still be that guy.  European would never come up with plans to absorb his country. That’s dictator shit.", "label": 0}
{"text": "It's a bit absurd. But I have heard from two economists that we have kinda painted us into a corner.\n\n\nWe can't lower taxes much without raising inflation and erase the benefits if it. We can't redistribute money because it would raise inflation with same issues. We can reinvest a part of it, which is why we are investing so heavily in energy infrastructure, but again, only a fraction. We can't raise interest rates to combat inflation without slowing growth and maintain jobs.\n\n\nSo we spend it outside Denmark as loans, Foreign aid and probably a lot of our help to Ukraine comes from that mindset too.", "label": 0}
{"text": "Nt!)By the way I’m from Івано-Франківськ", "label": 0}
{"text": "English, go reclaim ur islands first the geopolitixs", "label": 0}
{"text": "I've seen this phrase a thousand times, but only now I doubt its relevance. I would be concerned, as NK soldiers are still a resource so what is the mistake?", "label": 0}
{"text": "You said \"a lot of eastern European\", so by all means continue. And don't forget that these sums do not include maintenance.", "label": 0}
{"text": "Ohhhhh my gohd", "label": 0}
{"text": "Many Americans pay back loans at 21% routinely. Many also do not pay them back. See credit cards, payday loans and car loans for high credit risk people.", "label": 0}
{"text": "For the same reason Biden didn't, it was a waste of time. \nBRICS is slightly more important than a one-sided peace summit without the US and Russian President...I'm guessing.", "label": 0}
{"text": "The real reason for no growth is the lack of government spending, simple as that. Little spending = little growth.\n\nWhy use many word when few word do trick", "label": 0}
{"text": "Once again, it wasn't \"russian minority\" that started the conflict that ended up with civilians dying.\n\nit was russia moving their units in. end. of. discussion.\n\nthe fault is on russia exclusively and you cannot blame the side attacking enemy that uses civilians as shields. that's the responsibility of the person breaking geneva convention on human shields to manage.\n\n&#x200B;\n\nand if we go past all of this, yes. in ukraine you have to speak ukrainian if you provide services. that's how it is in every country and russification is not a justifiable reasoning behind not doing that. considering russia uses russian speakers as justification for hostilities, what the fuck then u expect from ukrainian majority?", "label": 0}
{"text": "What news have you been consuming?", "label": 0}
{"text": "In real income terms, housing, healthcare, and education is much more unaffordable. Buying electronics is more affordable than before, sure. There’s more services and goods than before, sure. GDP is higher but where it matters, purchasing power is lower\n\nAh, PPP disposable income, an extremely misleading statistic. Let’s break it down. \n\nFirst, PPP is not cost of living. It’s how far that money goes in that economy on a macro level. That’s why costs of construction and bureaucracy are involved in the calculation. \n\nGermanys PPP is rated at 1.25 euros to 1 dollar…  meaning 1.25€ in Germany. give you the same purchasing power as $1 in the US. that’s not cost of living, not even close. \n\nAlready there’s a 30% advantage to the US which is just not accurate. \n\nSecond of all, the “social transfers in kind” are not measured in any equal way. \n\nWhy would we not measure average wage instead?\nAverage wage in Germany is 50k€(54k USD). In the US it’s $62k. \n\nThats about 6k more a year, so about 500 per month. Let’s say 800 more a month in the US because of taxes. \n\n800 more in the US… before healthcare, education, pension contributions, elderly care, childcare, and housing…\n\nRent prices are 80% more per square meter on average in the US than Germany. \n\nAll the other things are free in Germany, already covered by tax. All of those other things you need to pay for in the US. \n\nNot to mention you need two cars in the US for a family, and associated costs like insurance. \n\nIn Germany you don’t, public transportation is good and cheap. \n\nHealthcare alone will eat up the difference. Pension contributions too. \n\nThere’s arguably much higher disposable income in European countries than the US, unless you praise GDP above actual living conditions and discretionary income and what standard of living the average person is capable of buying in each country.", "label": 0}
{"text": "Look at USA to get a glimpse of what you are asking for. Even higher rates of poverty at retirement years. Longer retirement age.\nDunno if that is the way forward.", "label": 0}
{"text": "No, don't forget that the investments have fired up a declining economy. It is actually the large lower class that hugely benefit from the war. The factories in Russia are now forced to pay more for labor or they will simply work for military industrial complex, because they are offering massive paychecks.", "label": 0}
{"text": "someone being friendly to your adversary and complying with their demands sounds a lot like betrayal, aka treason", "label": 0}
{"text": "Suffering from success", "label": 0}
{"text": "A lot of people, me included, have no problems saying that a child doesn't fit into what we imagine our life being, which is different from people wanting kids and not being able to afford them.\n\nI think it's very mature and wise to not reproduce when you can't guarantee a decent standard of living, standard technological tools for education and healthy fairly produced food for one more person.\n\nEven when couples decide not to have kids because otherwise they'd have to sacrifice vacations and lifestyle, what's the problem? \nIsn't that an option? \nI think that it's a legitimate choice, since everyone should just enjoy life as they prefer.\n\nA lot of elders would label that as an immature choice, but then, why would we want immature people to become parents?", "label": 0}
{"text": "Thats not how odds works. If you drop a coin. Is it fifty fifty that it will fall upwards?", "label": 0}
{"text": "I wonder what the 1940's version of Reddit commenting on this article would think lol.", "label": 0}
{"text": "I hope Canada joins the EU.", "label": 0}
{"text": "Nah, Reddit lives in a bubble where they only think one step ahead. Considerations for second order effects is not possible for this community.", "label": 0}
{"text": "Why not take just the Finnish model? Swedish and Finnish on same rights etc etc, but hey we had to fuck up everything, if u really live in kiyv u know it's mostly Russian speaking city, And if u think crimea is Ukraine but saying like 90% of Crimeans who don't know but a little Ukraine has to learn it for what?", "label": 0}
{"text": "Yes, \\~ 20-25% year on year seems about right for last couple of years.", "label": 0}
{"text": "In Germany, even the babies are packed like bratwursts.", "label": 0}
{"text": "Uh you realize under trump there weren't wars? And the war with Ukraine is happening already .\n\nWe already saw 4 years of trump. I don't understand your fearmongering for ww3. \n\nThere are many things to attack him on. Causing wars isn't one of them", "label": 0}
{"text": "Can you elaborate on how EaP influenced Belarus? I'm genuinely curious.", "label": 0}
{"text": ">Serbia was not a UN member after the collapse and wars in Yugoslavia.\n\nIrrelevant. Serbia was a UN member when Kosovo declared it's in independence in 2008. As a UN member and prior to the declaration of independence, Kosovo was recognised as part of Serbia. Even today 89 UN members still do recognise Kosovo as independent.", "label": 0}
{"text": "I really don’t think he will nor do I think it will be close.", "label": 0}
{"text": "That is climate change... \n\nI hope this one goes a bit faster.", "label": 0}
{"text": "At the national level, Kamala is still leading, but that doesn't really matter because Trump's numbers are up in the battleground states in recent weeks: Pennsylvania, Wisconsin, Michigan, and Nevada.\n\nSome polling average already put Trump ahead of Kamala by 0.2% in Pennsylvania:\n\nhttps://www.natesilver.net/p/nate-silver-2024-president-election-polls-model\n\nhttps://projects.fivethirtyeight.com/polls/president-general/2024/pennsylvania/\n\nIf Kamala loses Pennsylvania even just by 1000 votes, it's over for her. \n\nThe Economist model also indicates that Trump wins 53 out of 100 simulations:\n\nhttps://www.economist.com/interactive/us-2024-election/prediction-model/president\n\nOverall it's still more or less 50:50, with a razor thin advantage for Trump", "label": 0}
{"text": ">Wrong again, these countries could not/did not fight of German occupation, they were liberated by Soviet Union and occupied by them at the same time,\n\nSo yes, illegal occupation, exactly what I said. \n\n>Its like saying that France/Germany/Portugal and Spain were occupied by Allied forces, \n\nAnd again you are wrong, there was this thing called free elections in those countries. And not literal uprisings that were crushed with soviet tanks. \n\nhttps://en.m.wikipedia.org/wiki/Hungarian_Revolution_of_1956\n\nhttps://en.m.wikipedia.org/wiki/Prague_Spring\n\nOh yeah and the fact that the literal Berlin fucking wall was built to keep people in. \n\n>occupied by these forces as US still has military bases across western Europe, the biggest one in Germany, and if you have a foreign troops in the military base on your soil that's the very definition of occupation.\n\nNow you are making up definitions, the US didn't \"occupy\" those countries because the people in those countries actively want them to be there, NATO has been ratified by a democratically chosen goverment and never has ever forced someone to join. \n\nYou are also very wrong about the countries you name, Spain itself was a facist country that wasn't involved in WW2, no allied country set foot there. \n\n\n>Still waiting for this international order respecting west to bombard Israel for their genocide.\n\nHasn't been named a genocide, and it was nothing like serbia.", "label": 0}
{"text": "Yikes.  \nWith that being said, why are so many people in r/AskARussian so blinded by Putin propaganda?", "label": 0}
{"text": "You just like throwing around words I guess", "label": 0}
{"text": "Sure doesn’t feel that way buddy. \n\nThe peasants of yesterday only saw their neighbours fields. \n\nNow, we see the wealth of every person on the planet.", "label": 0}
{"text": "Boris was just following the election result...", "label": 0}
{"text": "I blame their education system", "label": 0}
{"text": "Literally nothing happens \"in a vacuum\". Every event in history is preceded before it\n\nBut imagine the UN head saying ISIS enslaving Yazidi women \"didn't happen in a vacuum\" because ISIS grew from the Syrian civil war etc.\n\nYou honestly think he wouldn't be overwhelmingly condemned for that? So why is something like Oct 7th different?\n\n>Oct 7 was a terrible tragedy caused by a chain of another terrible tragerdies\n\nExcept there is no evidence for this. Hamas grew out of the fact the PLO turned into the PA and renounced violence against civilians and recognized Israel at Oslo. Like objectively that is what happened. They have always been clear regardless of the settlements or occupations their mission was to kill Jews and destroy Israel.\n\nIt is just people like yourself who NEED it to be true because you want to blame Israel for Oct 7th but can't outright say it for obvious reasons.\n\n>You keep asserting that such argument is basically a justficiation and support of the attack (which is obviously isn't)\n\nIt literally is. It is deflecting the blame from Hamas to Israel. That is literally  an excuse and justification.", "label": 0}
{"text": "for real, he is a mentally unstable criminal. How can he run for ANY public office is beyond comprehension", "label": 0}
{"text": "your street view is 🔥", "label": 0}
{"text": "All that Russian ass kissing didn't pay off. The world wont shed any tears for Lukashenko.", "label": 0}
{"text": "America wont allow us. Too much money in the weapon industry to allow us on a large scale to make our own weapons. Look how they for example heavily are trying to prevent Sweden from selling gripen.", "label": 0}
{"text": "lol the handful of guys that walked into the capitol? Can you please be honest with what you're claiming ? \n\nHow about the year + of open policy rioting in the US which was ok under Biden ? Let's use some fancy word to describe that one ? \n\nIt's funny when the deep left calls the far right idiots / brainwashed , then doesn't see the simplest things ...", "label": 0}
{"text": "No money, no time, no house, no partner. You do the math.", "label": 0}
{"text": "Both NS didn't increase Germanys consumption of natural gas, and I don't know why this point is always ignored. Trough NS, Germany just became a major re-exporter. \n\nUnlike Poland, Germany didn't need new pipelines with Norway because the existing pipelines were already enough for Norway to work at full capabilities (that's why Baltic Pipe isn't even necessary if you would trust Germany).", "label": 0}
{"text": "recalibrate to what? You need reliable, cheap energy to run an economy, however modern it is.", "label": 0}
{"text": "Because sweden doesn't threated to invade finland, doesn't claim  finnish is inferior language, their cultural is backwater and just a dialect of sweden.\n\nThe only ones who \"fucked up everything\" is russia with their imperialistic view on post-ussr countries.\n\n>And if u think crimea is Ukraine but saying like 90% of Crimeans who don't know but a little Ukraine has to learn it for what?\n\nIf they want to provide services or sell products, they need to be able to communicate in ukrainian. Yes. That's how things work. If buyer requests to speak russian they're free to do so, but i, as a ukrainian, should be able to use the official language to conduct official matters.\n\nThis protection of ukrainian language is only required because of consistent efforts of russia to destroy it. You have nobody to blame but yourself", "label": 0}
{"text": "It will start gradually. Less demand for teachers or any other job where they work to meet demands created by children. \n\nThose people will be out of jobs and shifted into other areas, where eventually they will end up with same issue as the demographic drop starts extending into fewer teens, young adults, middle age, and then old people. \n\n\nJust a constant scramble until suddenly you realize the country's economy is basically just agriculture and if you're lucky some niche thing. \n\n\nThe current numbers are not just non-growth. That would be if they were around 2.1.\n\nThey are in the territory of shrinking. The only precedence in human history is due to famine/wars. And those are things that either ended with the cause stopping or that particular human society going extinct.", "label": 0}
{"text": "She thought she could use financial dependency to get Russia to stop war mongering. It worked for a decade, and then it didn't.", "label": 0}
{"text": "He can, according to FiveThirtyEight's simulations he wins 53 times out of 100. The election could come down to less then 5000 votes, which is horrifyingly close.", "label": 0}
{"text": "The Economist model finds a slight advantage to Trump in the simulations: https://www.economist.com/interactive/us-2024-election/prediction-model/president", "label": 0}
{"text": "A typical Russian Nazi - you are lying when you open your mouth. Tell me, why are the Nazis like you know how Ukrainians oppressed the Russian language in Ukraine, but Ukrainians do not know? Ah, yes, for sure, because it is a complete lie! None of those whom I know did not feel problems with the Russian language in Ukraine.\n\nPutin lied to you and you believed, as befits an ordinary Russian Nazis.", "label": 0}
{"text": "He didn't say it was unjustified. He gave a literal justification for it. \"It didn't happen in a vacuum\".\n\nI like how I HAVE to accept what you are saying is the objective truth as well. Like I can't actually disagree with the fundamental claim being made, that Oct 7th was a response to Israel's actions like the occupation, Hamas CAN'T POSSIBLY just be genocidal terrorists who don't actually give a crap about that, they just want to kill Jews.\n\nSounds like excuses and justifications to me.", "label": 0}
{"text": "Cost of F35 : with or without maintnance ? With or without the mission elaboration software license ? Are the Poles even authorized to touch the plane ? You do realize that it’s a little bit more complicated than buying a New car. Painting the F35 as a bargain when compared to the Rafale is a travesty.", "label": 0}
{"text": "Yes, but their stockpiles of such manuals are above all other countries.", "label": 0}
{"text": "Maybe so. What a bleak potential future, all because our leaders couldn't act and respond to the civilizational level threats to our democracies yesterday, today, and probably tomorrow.\n\nI swear, people take our cozy peaceful western prosperous lifestyle for granted, even as their civilian counterparts in Europe are actively being bombed and shelled in their homes.", "label": 0}
{"text": "Italy and France being at -7% and -5% is fucking scary.", "label": 0}
{"text": "That was actually really smart. Russia used its resources to build a pipeline that was never used while they completely ignored China.", "label": 0}
{"text": "Don't worry, that isn't even a possibility.", "label": 0}
{"text": "I mean, I don’t think the closest allies in almost any arrangement would say much different when the topic of annexation by an ally comes up, lol", "label": 0}
{"text": "Well yeah.. because none of their countries are as influential as USA. It’s like saying water is wet or the sun is hot. ", "label": 0}
{"text": "I'm not deep left 😂 just a normal European\n\nYou guys are just brainwashed", "label": 0}
{"text": "Well, russia is learning from the teacher and soon exceeds the master. \n\nBond yields in Turkey are now 30% for 10 years, which is massive. Russia is quickly catching up with 16% now. And not even being able to sell all of them last rounds.", "label": 0}
{"text": "> If Trump win it will not primarly be the fault of the voting system. \n\nYes it is, since with better voting system Trump would not have been never near even national candidacy and even that happening it would have been some other third parties person running against Hillary and so on. 45% of USA is voting for the republican party. Just as 45% of USA is voting for democratic party. Well more like each is voting for \"not democratic party\" and \"not republican party\".", "label": 0}
{"text": "I see very little reason to be optimistic for a Harris win.  I hope I’m wrong but for the last couple of weeks the race has been shifting to Trump.  I’d be shocked if he doesn’t retake Arizona and Georgia, I don’t there is mich reason left to think that she is going to flip North Carolina and the “blue wall”/rust belt polls have been shifting away from Harris and toward Trump.  Again, I’d be very happy to be wrong about it, but I think he’s gonna win.", "label": 0}
{"text": ">Boris was just following the election result...\n\nHe and Farrage were campaigning for that outcome though.", "label": 0}
{"text": " it's absolutely insane that Trump is where he is, but the rule from 4 years ago that democrat needs to win by 2%+ to win doesn't necessarily apply today. Muslims/Progressives abandoned her but she gained from women and centrists. As far as we know the electoral map might even be democrat favored today.", "label": 0}
{"text": "Well we’ll see in 4 years. ", "label": 0}
{"text": "\\>far left liberal democrat\n\n  \nWhat the fuck is far left about the democratic party? A lot of their policies are republican policies from 4-8 years back, including immigration and economy.", "label": 0}
{"text": "I mean Orbán is at least not sub 100 IQ. Trump literally can't fucking say a grammatically correct sentence.", "label": 0}
{"text": "Minus a bit, can be on the side", "label": 0}
{"text": "Sanctions due to the 2014 crimea, lughansk and donbas invasion/annexation.", "label": 0}
{"text": "\"Dear officer, but have you SEEN how short her skirt was ? I simply had no choice\"", "label": 0}
{"text": "Should you really believe that then you are revisionist and an idiot", "label": 0}
{"text": "People do often say that, sometimes as a gotcha even, but a lot of it comes from us having not such smal population.\n\nPer head when we substract contributions from benefits we are around 240 euro on profit but it is nothing compared to slovakia or Czech Republic, where there is net positive 520 euro per citizen, or Luxemburg where they get around whooping 2400 euro per head.", "label": 0}
{"text": ">The US has a unique blend of religious fanaticism, lack of education, propaganda networks like Fox News, and a self-centered “we’re the best” attitude\n\nSounds similar to Lithuania.", "label": 0}
{"text": "This is the only good thing to come out of what we have had to bear with Trump. Europe, which since WWII, has counted on rich its Uncle Sam for defense, technology, and more, has just been told they have been written out of the will. They will have to make it on their own.", "label": 0}
{"text": "Nah there is plenty of times where the odds have suffered quite a bit. Ofcourse not like the election result is certain but there is a big difference between 60/40 and 50/50 \n\nIt doesnt matter that it isnt about popular vote. Odds can still be calculated. You just have to look on the states and not popular vote.", "label": 0}
{"text": "If Russia collapses to oblivion that means that is happening to the rest of the World too. \n\n>Better dead than Russia to win.\n\nI can understand this from Ukraines perspective but not from the perspective of the EU or the rest of the World", "label": 0}
{"text": "Yeah he has a really good chance. Reddit won't tell you because this is a **far left** echo chamber. But Kamala it's extremely unpopular. \n\nThe only reason she even has a chance it's because people hate Trump. But this an election of essentially who do you hate more. \n\nKamala couldn't even get the nomination in 2020 of her own party, she in fact got in the last place back then, Bernie Sanders, Andrew Yang, Tulsi, etc. All of them were better choices of candidates than her for the current election even tho most of them got like 5% of  the Dem votes lol.", "label": 0}
{"text": "The naivety of this comment is adorable.", "label": 0}
{"text": "Germans love to just forget about the 2014 invasion and pretend that Russia was trustworthy up until 2022.", "label": 0}
{"text": "> First of all, no well adjusted person writes \"ruZZia\". I have yet to see someone use that term and not be a disgusting freak.\n\nOh wow. Started with ad hominem, to make a strawman out of it. You sir, truely are a master fallacies.\n\nAnd the rest of your post is the same old muscovite nonsense/troll trying to make living. Bye.", "label": 0}
{"text": "Swiss banking secrecy is already gone. \n\nThe main reason to not integrate further from Switzerland’s perspective is the Customs union. Forcing an EU-level minimum of 15% standard VAT rate is fucking anathema to Swiss people who pay 8,1% right now (lowest rate in EU rn is Luxembourg at 17%).", "label": 0}
{"text": "The only thing is that russia is using North Korean troops because they follow orders without question. Will it be like that in Europe? I highly doubt it. Although it would be a sensible decision - a mirrored response in return.", "label": 0}
{"text": "Strives is a strong word there.", "label": 0}
{"text": "To their own countries, sure. To the collective Western world, Trump is in a league of his own.", "label": 0}
{"text": "Technically no but practically yes. Kamala is in the lead overall but the US voting system is more dependent on the results of votes in swing states, where Trump has been taking the lead recently. 270towin has a pretty good breakdown of the situation.\n\n[https://www.270towin.com/2024-presidential-election-polls/](https://www.270towin.com/2024-presidential-election-polls/)", "label": 0}
{"text": "I am not, but youbare entitled to your opinion. You are mixing ethnic cleansing and the genocide.\n\nFeel free to throw insultts won't change the facts.", "label": 0}
{"text": "Imagine an alternative world where the head of lockheed martin is found to have been in regular contact with putin since 2022. That shit would be such a big deal that that man would instantly be put behind bars. But elon has all his corrupt maga buddies constantly undermining the law to save their own skin.\nUnbelievable, what a shitshow.", "label": 0}
{"text": "> Because it was never real, \n\nCement factories have a certain realness to them and those closed to.\n\n>  The Greek cement market has been in freefall for the past six years and is estimated to have dropped by some 35 per cent in 2012 to less than a quarter of its 2006 peak\n\nPeople with experience in skilled jobs that moved to less skilled jobs (mostly in tourism), retired early or moved abroad \n\nIf you read the article there were certain expectations about Greek economy that never happened. Greek companies lost access to credit, despise IMF estimations; Greek companies didn't increase internationalization despise crumbling internal demand. Growing taxes, lower salaries, lower welfare colapsed internal sales, but the savings in that translated in a 45% lower private investment went the forecast was that the private investment would grow.\n\n> That article was from 2017.\n\nAnd it is a good moment to look at the 2009-2015 period when the bad decisions that I was talking about were made.\n\n[I mean 2022 was the first years since 2009 when investments were higher than deprecations](https://www.eurobank.gr/en/group/economic-research/economic-bulletin/economy-and-markets-12-12-22)\n\n> he Greek economy has growth since then and is growing above the average for the EU.\n\nSo, are Spain and Portugal. And we had quite different economic policies during that period of time.", "label": 0}
{"text": "Should Germany just ignore a huge market for it products?", "label": 0}
{"text": ">I dont think we can blame everything on Russia. We tried to blame Americas election 2016 on it aswell. Turned out to be bs. Its very far stretch to make that Boris works for Russia because he meet up with some oligarch.\n\nYou're post history is basically proving you're Russian based troll. You consistently defend them.\n\nYou've been called out on it before.\n\nStop lying and mayhe do something while you still have a country.", "label": 0}
{"text": "Who told you that? News about the german economy have been negative for 2 years straight and  the majority of germans, even on reddit, is absolutely aware of the bleakness of the situation.", "label": 0}
{"text": "It's interesting because the obvious response to that is \"You're right they need to be more intensive\".", "label": 0}
{"text": "always the croats with most insight on serbian relations, insane but rent free i guess", "label": 0}
{"text": "Let me guess American in Ireland", "label": 0}
{"text": "Why? Almost 40% Hispanic voters support Trump.", "label": 0}
{"text": "Then f..... do something....", "label": 0}
{"text": "the fearmongering about ww3 is stupid, but the \"under trump there weren't wars\" sentiment is also stupid.\n\nthe US is not participating in neither the Israeli - Gaza war, nor the Ukraine war. the october 7 terrorist attack had absolutely nothing to do with the US, if anything, Trump just made the tension worse by moving the US embassy to Jerusalem, and considering Trump was Putin's little bitch I don't really understand how people like you think he would have helped Ukraine from being attacked. If anything he would have vetoed the bills that contained financial supply for Ukraine and unpredictable aggressive Russia would be closer to us Europeans than ever.\n\nnot to mention that there were multiple wars and armed conflicts in Africa, South-America, Yemen, Syria, etc. that Trump did absolutely nothing to end or soothe, on the other hand he abandoned US allies, classified drone attack data, had military leaders assassinated and that kind of thing. he moved the \n\nit's really one of the silliest points to dickride orange man about his foreign policy record, it's absolutely awful.", "label": 0}
{"text": "No one is joining the EU, it’s just false hope to get them away from Russia. Balkans have tried for decades and are not even half ways. France was very clear with its opinion before the Russian invasion that no more countries will join", "label": 0}
{"text": "Yeah and guess who will come out winning in that divorce? You’re delusional, Europe needs the US far more than we need you", "label": 0}
{"text": "See? Nobody cares… yet.", "label": 0}
{"text": "Trump isn’t going to win. But America is going to have to confront itself with how millions and millions are stupid enough to vote for someone like him", "label": 0}
{"text": "Meanwhile my grandma and her 9 siblings living in absolutely tiny house.\n\n\nTimes have changed so much people don't even realize.", "label": 0}
{"text": "What made sense to vote Trump in ???", "label": 0}
{"text": "At this stage, you can't even trust americans to state their true intentions in the polls because redneck swing state populations are being told to lie to pollsters by their own political candidates.", "label": 0}
{"text": "While Serbian politics is about as bonkers as one could imagine, leaving Serbia out is a lot more trouble than letting them in.", "label": 0}
{"text": "Irish born and bred. I have to be American to realise that Trumps style of politics is rampant across all of Europe right now? It's nothing unique to America. It's actually insane that someone in Europe in the year 2024 has head their head buried so deep in the sand for that long.", "label": 0}
{"text": "But it don’t get any security updates anymore using a old smartphone is dumb it’s alright it’s a dumb phone trough", "label": 0}
{"text": "Using old smartphones without a actual andere is is quite insecure", "label": 0}
{"text": "Uhm.. what?! Where did that come from?", "label": 0}
{"text": "That’s like the Muslims who support Orban or Farage.", "label": 0}
{"text": "\"They condemn it\" That is the first  response I read from the EU.   \nThis is pathatic!", "label": 0}
{"text": "But there is talk many of the polls are not showing the whole picture.", "label": 0}
{"text": "How's the war going, Vlady?", "label": 0}
{"text": "And?", "label": 0}
{"text": "> our chaotic system has remained stable and largely resilient since Washington was elected in 1789—a remarkable record in modern history. \n\nRight there wasn't a civil war at all over by large part about the disagreements over power shares in the political decision making (subject matter of said ofcourse being \"who gets to decide about slavery\"). Very stable political system.\n\nAlso stability gained by disenfrencising minorities is no democracy. That is oligarky.\n\nThere was no shoot outs between social democrat labor movement and police, pinkertons and so on.\n\nThere wasn't the massive civil rights movement in the 1960's and so on. Stable in good since 1789. Based on perfect constitution also?\n\n> No European nation can claim an unbroken chain of democracy for that long.\n\nWell you see we run some democratic experiments, found the bad systems by them leading us to crisis and then improving. Some times chaotic crisis and necessity is good finder of innovation and new solutions.\n\nPlus it's hard to have democracy since 1700's, when ones country didn't exist until 1800's or 1900's.\n\nPlus ehhh... USA had wars with native americans.... European states ripped each other to shreds. So that caused some not so long lasting democracies, regardless of their democratic credentials. When the \"biggest cannon\" diplomacy ruled the roost.\n\n> Every democracy has its quirks. \n\nIt ain't a quirk, it is a deep dysfunction.", "label": 0}
{"text": "Yes but other than the Hungarians, the Slovaks, the French, the Dutch, the English, and the Germans are we really all as bad as the Americans?>!/s!<", "label": 0}
{"text": "Ass kisser", "label": 0}
{"text": "Well that'd be grand, but highly doubtful.\n\nNot that it would undo any of the damage done to ourselves in the meantime.", "label": 0}
{"text": "The irony is some far left US voters are going for Trump because of his anti war stance. If Palestine is your main concern or you're minded to appease Putin to end the war then Trump is the better choice.", "label": 0}
{"text": "It's 300 now? Jesus...", "label": 0}
{"text": "If not liking the democrats is enough of a reason for someone to even consider voting a criminal, I think they deserve at least a weird look.", "label": 0}
{"text": "You can’t change a rule just because a war broke out in europe, can you?\nNation full of schysters and tax-evaders.", "label": 0}
{"text": "Oh that's funny because it won't hurt the Russians oligarchs. They are actually making money on their insane amounts of cash piles, while at the same time choking the Russian economy as a whole. Genius.", "label": 0}
{"text": "It is not called Norway and Southway.", "label": 0}
{"text": "> So it is Ukraine affair if Europe send theirs ?\n\nThe thing preventing Europe from 'sending theirs' is not concern about Russian position on this, but sense of self-preservation.", "label": 0}
{"text": "Under international law the occupation has not ended, although Israel withdrew its forces from Gaza. You can read up on it if you're interested.", "label": 0}
{"text": "It doesn't matter who wins.\nBoth candidates are shit, i don't envy the 'mericans for the choice they have to make.\n\nEU should have emancipated at least 2 decades ago from US and become the multilateral powerhouse it should have.\n\nBut no, if US says jump, we say how high.", "label": 0}
{"text": "I live in South Korea and they all study English intensely from a young age. They can read an extremely difficult essay but they can neither understand spoken English or say anything beyond basic phrases. I imagine it’s worse in North Korea because they won’t have much exposure to western media like the south does.", "label": 0}
{"text": "We haven't voted in any retardeds like him in America.  I see you have an interest in America just like me . I saved my American wife by bringing her to Ireland.  Her words not mine.  I also have Trumpanzee inlaws who I do not speak to", "label": 0}
{"text": "People bring up Germanys Nazi past all the time. They do this because they know it hurt us. We are carrying a heavy burden. This is uncalled for.", "label": 0}
{"text": "Except that both Switzerland and Norway give away billions in funds for poorer countries. Not to mention other political and economical factors.\n\nBoth of these countries set up a deals that were beneficial to them. And let me assure you - EU wouldn't agree to them if it didn't gain something as well. \n\nSo considering that both of these countries are gold standards when it comes to democracy and human rights we should have nothing but respect for them and their citizens.", "label": 0}
{"text": "Bringing up Fukushima into it shows how easy fearmongering is. It was a disaster but only because where Japan is located and the whole thing happened because earthquake followed by tsunami.\n\nThings that won’t happen in the middle of a tectonic plate where Germany is located.\n\nSmart government would not blindly listen to vox populi, especially in hindsight is seem those concerns about safety of atom could be fuelled from russia to sell some more gas.", "label": 0}
{"text": "To put it more into perspective, imagine the entirety of France voting for Trump.", "label": 0}
{"text": "In other news, Gollum realised that Sauron wasn't actually a friend when he pretended to be one.", "label": 0}
{"text": "Europeans say this every election cycle. I've been hearing it for decades.\n\nWhat Europeans don't do is actually do something. Which means this becomes a favorite conversation topic until the next election, and nothing more.", "label": 0}
{"text": "I feel like it's in part due to perceived hostility coming from foreign audience so there're some users who become contrarian, in part because r/Russia has been banned which used to be filled with pro-government/anti-West users so they've migrated to ARA and after all few Russians would bother chatting in English on a foreign site so it's not your average Russian user who uses Reddit too.", "label": 0}
{"text": "15 years is just long enough that technically anything could happen. It’s not long enough for this realistically though. The boomers need to be completely gone and 15 years isn’t quite enough.", "label": 0}
{"text": "\n... In a form of 800kt warhead planting a mushroom of peace?", "label": 0}
{"text": "Complete economic noob here, why do we need economic growth? Germany has high living standards, why do we need to go higher? I'm Genuenly trying to understand this", "label": 0}
{"text": "Yes we have them in Scotland as well, I live in a small 7-storey one of these. But ours is safe and not on fire. It's just awful, I'm so sorry.", "label": 0}
{"text": "Trump is an idiot, but the republicans in congress (not the Marjorie Greene types) know enough  that Taiwan is strategically valuable.", "label": 0}
{"text": "Kind of like how millions and millions - a clear majority, actually, unlike Trump's win in 2016 - Britons voted for Brexit?", "label": 0}
{"text": "Why wouldn't a businessman contact a potential customer", "label": 0}
{"text": "No, nonono, as far as democracy goes, its shit in Albania. The general albanian population just doesnt give enough shit to make a scene out of it. Whose gonna give a shit anyway, the old folks? Those are the ones mostly left in Albania anyway. Young and energetic folks who can oppose the crap happening here are leaving the country by the hour, if not daily.", "label": 0}
{"text": "The interest rate makes sure that people put money in the bank, instead of in the economy.\n\n-------\nThe economy has 1000 rubles in circulation but some is hidden in secret pockets such as real estate, company assets, investments, etc... But the government puts 100 rubles into the economy every month to buy tanks (inflation of 10%). \n\nThe government wants to keep the economy on 1000 rubles because inflation 5%> is bad, very bad. \n\nThe government says: put your rubles into the bank, not in the economy. We will pay you 20% each month to keep your rubles in the bank. \n\nEveryone puts a 100 rubles per month in the bank and the bank now pays 20% for every ruble in the bank. \n\n------\nAfter six months, the government has spent 600 rubles for tanks, there are 600 deposited rubles in the bank (which with 20% amounts to 1191.60) and the economy still has 1000 rubles. Everything is fine.............. However, some economists are complaining that businesses are no longer investing money in research and development, because they don't expect a higher profit than the 20% the bank offers. But hey.... Everything is fine....\n\n------\n\nAfter 12 months, the govenment has spent 1200 rubles. People put 1200 rubles in the bank (which due to the 20% interest have acumulated to 4750.27 rubles). And the economy is still 1000 rubles. However, companies have become extremely lazy. Even firing people, because the company can better put the wages into the bank than let people work. Because the bank guarantees 20% return and those lazy employees only earn 10% of their wage back for the company. \n\nPeople are now fired and need to pull money out of the bank to stay alive. Now you have an economy of 1000 rubles, but after people take money out of the bank there suddenly is 5750 rubles in the economy but some is still hidden in the secret pockets. An inflation of 575% and the economy is doomed. Oh, wait.. It's not only doomed. It is also dead because there are no companies anymore that do productive work. Now the economy is shrinking, which means that the hidden pockets are opening and there is a poole of rubles appearing on the table and everyone can now truly see how fucked the economy is.", "label": 0}
{"text": "So that's about 1% per month. Hyperinflation, here we come lol", "label": 0}
{"text": "General Grievous vibes", "label": 0}
{"text": "All Europe", "label": 0}
{"text": "You write that the Europeans would never have, how do you know, you've already done it?\n\nOr were they other Europeans? Or didn't your relatives and neighbors do it? Maybe it was done by aliens? No? Then why do you write like that?", "label": 0}
{"text": "russia is actually vert predictable", "label": 0}
{"text": "I agree. Standards need to adjust as to what government can provide. While the US in some ways is doing better than Europe over the past 20 years, I think ultimately our dependence on the car and our desire to live in suburbs is going to come back to bite us. Not yet but we have a reckoning. Europe doesn't have those issues so much, you just have social systems, but those can be reformed with legislation. We can't \"reform\" our suburbs very easily.", "label": 0}
{"text": "EU problem-solving:\n—> thorough 1-week debate\n—> moral highground statement\n—> problem solved\n\nWhen is the day that the EU starts to act. As in; really make difference for Ukraine, but also for our economies, for our tech sector. \n\nIt’s all words, it’s very little tangible action. A bloody 3rd party dictatorship sends flesh & blood soldiers to the front for the Russians in Europe, and the EU’s reaction is an official condemnation? Like that will change anything? Why the fuck do we even have all these people there governing the whole thing, taxfree?\n\nCowards.", "label": 0}
{"text": "Shiiiit we can't shit on the US social system whilist counting on them for defense sheeet what will happen now?", "label": 0}
{"text": "Congratulates himself afterwards", "label": 0}
{"text": "when you get the choice between shit and differently flavored shit, your vote doesn't really matter", "label": 0}
{"text": "Let's goooo🇪🇺🇪🇺", "label": 0}
{"text": "Many of our ex-communist countries are like that.", "label": 0}
{"text": "Wishful thinking.", "label": 0}
{"text": "> This isn't caused by the election system.\n\nit very directly is. He became the candidate by winning primary elections. Which, as my HS civics teacher phrased it \"only people who are really pissed off about something show up for\". \n\nLow primary turnout results in more extreme candidates going through to the general than a majority of voters would choose in a vacuum.", "label": 0}
{"text": "2000s Russia was a pretty cool and hopeful place, in general, despite stuff like the killing of Anna Politkovskaya and conflict in Chechnya, Beslan Massacre, and other stuff. Russia seemed like a hopeful place where change could occur and integration between Russia and the West could take place.\n\nIn retrospect, it was all a game on behalf of Putin and his Kremlin cronies and it officially ended in 2012.", "label": 0}
{"text": ">Where do you think Russia hides all these losses?\n\nA wood chipper", "label": 0}
{"text": "and what is the difference? Who bombed Yugoslavia? \n\nWho attacked Iraq, Libya? Other Europeans?", "label": 0}
{"text": "A witty NK soldier will try to be MIA and deflect.", "label": 0}
{"text": "Why is this downvoted?", "label": 0}
{"text": "Lithuania? I am not an expert on Europe but I didn’t know Lithuania was so self-absorbed lol. Can you elaborate?", "label": 0}
{"text": "What do you mean? Democrats have immigration policies that are way further to the left than any European country, i unironically think if you put users of this sub into America they'd end up voting for Trump on that issue alone", "label": 0}
{"text": "Germany's solidarity is manifested by paying €30 Billion to the EU budget each year. How about Polish solidarity? They where trying to make money off German need for gas. Doesn't sound very friendly.", "label": 0}
{"text": "She could've realized in 2014 when Russia invaded Ukraine the first time. But instead, she approved another pipeline for Russian gas.", "label": 0}
{"text": "you can take out loans both at a fixed or variable rate, so it depends on the terms on the specific loan", "label": 0}
{"text": "American opinion, very interesting, much relevant.", "label": 0}
{"text": "I was just in Serbia and everyone I chatted with was telling me how much they wanted to join the EU so idk how popular this will be on the ground …", "label": 0}
{"text": "> even consider voting a criminal, I think they deserve at least a weird look. \n\n But you know they don't have to vote for criminal. They do as large part of USA... They sit out. The real result taking in all options ends up being like 33% Trump, 33% Harris, 33% Sleeping peoples party.\n\nWhich then makes system even more chaotic, since there is less overall voters including probably in key districts, so it is even smaller absolute numbers of votes to change.", "label": 0}
{"text": "my country is too busy with making more chaos and helping Israel to stay genocidic 🫠", "label": 0}
{"text": "lol @ \"eu races\"\n\nthe only thing eu races towards is to plan a meeting, to take care of creating a committee that will try and establish a rough guideline sometime in 2028\n\neither that or legislating AI", "label": 0}
{"text": "> The choice of another candidate was offer to them. \n\nWell more likely sleeping out. Since polarization. It is pretty big step to step over that boundary in a two party system with so polarized culture.", "label": 0}
{"text": "Unfortunately they aren't the ones who determine the odds. \n\n\nThis is a multi billion dollar market, meaning of course that there are a lot of people and entities (\"smart money\") dedicated to figuring out the correct probabilities based on all available information. ", "label": 0}
{"text": "I already had no respect for the UN now I just hate it", "label": 0}
{"text": "\"Races to\"? If we haven't prepared ourselves in all the ways we can already, this is just farcical. ", "label": 0}
{"text": "Bernie Sanders", "label": 0}
{"text": "But is any one doing anything about it?", "label": 0}
{"text": "Hopefully it does happen. EU and UK are stronger together.", "label": 0}
{"text": "Where it counts, he is sadly winning unfortunately.", "label": 0}
{"text": "We want you back", "label": 0}
{"text": "You already know the answer from the last Trump presidency: No.", "label": 0}
{"text": "yeah smart money isn't on polymarket betting on the election, I hate to break it to you. smart money has way lower-risk, higher-yield ways to invest.", "label": 0}
{"text": "And what kind of wars were they? Do I understand correctly that you can just kill like that, but if you are aggressive, then you can't? Do I understand your logic correctly?\n\nAbout the Holodomor, this is our story, not yours, this is the story of our country when Ukraine screams about the Holodomor, it's just populism, famine was all over Russia, and there was no such country as Ukraine at all, it was all Russia. Moreover, no one starved on purpose, unlike by the way your grandfathers and grandmothers, who were just starving.\n\nthis museum is bullshit on a stick, what you did, I honestly don't understand why you weren't exterminated in response, our ancestors were too humane, your ancestors didn't deserve to live after this, even animals don't do that.\n\nAnd now the grandchildren of these animals tell us that they would never have waged wars of conquest, that's what surprised us.", "label": 0}
{"text": "Sure, let the asshole dictators fight amongst themselves", "label": 0}
{"text": "Wait thats the dumbest thing i heard and we are on reddit. You say that covid deaths are on his hands? And these 20 people that riot in went into the capitol is and insurrection? While he said \"peacefully and patriotically?\". This is your proof of dictatorship ? THIS? what country you are from? Cause ill need to avoid it.", "label": 0}
{"text": "He is though. Unfortunately, but he is.", "label": 0}
{"text": "> Hasn't been named a genocide, and it was nothing like serbia.\n\nNeither was \"genocide\" in Serbia named one, but that did not stop the \"intervention\". I guess its just two sets of rules. That would be the only logical conclusion.\n\nhttps://prnt.sc/hicwt47l63d7", "label": 0}
{"text": "Poll results are often misleading. Especially because showing your candidate currently being in the lead is generally seen as an advantage in american politics. \n\n\nIf you're talking about number of people in the US who will vote for Harris over Trump, then yes, she will definitely get more votes. But who becomes president is very uncertain atm.", "label": 0}
{"text": "What if they don't want to leave? That's what the Turks did in Germany.", "label": 0}
{"text": "It’s not like the EU is begging for train wreck Serbia to join… 😂", "label": 0}
{"text": "Also Germany: rejects skilled talented workers from other countries", "label": 0}
{"text": "With that holier than thou attitude, everybody will just leave the ICC.", "label": 0}
{"text": "[https://www.youtube.com/watch?v=ROfK\\_ANeosU](https://www.youtube.com/watch?v=ROfK_ANeosU)\n\nYes they seem extremely dangerous ready to order mcdonalds and smock a sig. What a joke.", "label": 0}
{"text": "Merkel was the worst. \n\nBad on energy (quitting nuclear was a mistake). \n\nBad on migration (opening borders was a mistake). \n\nBad on Ukraine (appeasing Russia was a mistake).", "label": 0}
{"text": "Heyooo", "label": 0}
{"text": "I want us back, too.\n\nI'm proposing this as our official Brejoin anthem:\n\n[Back for Good](https://youtu.be/N2ICtCO8TCw?si=DP95p2khk0EHT9c6)", "label": 0}
{"text": "If russia collapses that means nothing to the rest of the world, its isolated like north korea already", "label": 0}
{"text": "I don’t know if it’s really as definitive as you make it seem. Unfortunately she isn’t doing very well in a lot of the crucial states and has somehow managed to alienate a lot of voters", "label": 0}
{"text": "Their relationship status had been \"It's complicated\" for a while now, hasn't it?", "label": 0}
{"text": "Condem Condem Condem.  What about some action", "label": 0}
{"text": "It will not fix it but it will make it better.", "label": 0}
{"text": "How will the north koreans distinguish between russian and ukraine soldiers (except for uniforms of course) the look the same the language sounds the same. Friendly fire 100% gonna be a daily occurrence", "label": 0}
{"text": "Hey brother", "label": 0}
{"text": "I came", "label": 0}
{"text": "Copium", "label": 0}
{"text": "Basically, the goal of Korean English education is to read English papers and get university education. It is not the government's educational goal to communicate well with foreigners and Koreans..It's effectively preventing brain drain to some extent.", "label": 0}
{"text": "Enough with fucking pussyfooting.", "label": 0}
{"text": "Why the need to call me Russian bot if you believe in the strength of your arguments? And if NATO goes to war with Russia, majority of the people who will be fighting will not be the professional soldiers.", "label": 0}
{"text": "yeah, the crucial states are pretty much all 50-50%. but what I said is true- she lost in certain demographics and gained in others.", "label": 0}
{"text": "What the fuck happened in the last month????", "label": 0}
{"text": "EU:Darn we actually have to invest in our military and not on other things.", "label": 0}
{"text": "Lithuania has religious fanaticism?", "label": 0}
{"text": "They can go fuck themselves and their pound exchange rates, and custom taxes. Fu. Stay where you are. We're getting our own Amazon.ie domain.", "label": 0}
{"text": "He literally said it right ?He is literally HITLER omg he definitely said it and was serious 100%. LITTERALLY!!!!", "label": 0}
{"text": "Please come back tomorrow.", "label": 0}
{"text": "ChatGPT\n\nDito por si:\n\n￼\n\nThis guy is talking about Guterres from UN, is this true?\n\nDito pelo ChatGPT:\n\nChatGPT\n\nThe text in the image appears to reference António Guterres, the current Secretary-General of the United Nations, who previously served as Prime Minister of Portugal from 1995 to 2002. Here’s a breakdown of the claims:\n\nMember of the Portuguese Socialist Party (PSP):\nThis is true. António Guterres is indeed a long-time member of the Portuguese Socialist Party, a center-left political party.\n\nSupportive of Nicolás Maduro:\nThere is no concrete evidence that the Portuguese Socialist Party is \"mainly supportive\" of Nicolás Maduro, the Venezuelan leader. The PSP generally aligns with social-democratic and center-left values in Europe, which do not mirror Maduro's regime. Guterres himself, during his tenure at the UN, has had to take a diplomatic stance, calling for negotiations in Venezuela rather than overtly supporting any one side.\n\nChatGPT buddy.", "label": 0}
{"text": "The Creators\n\nThe Ozarichi concentration camp was created on March 10, 1944, by order of the commander of the 9th Army, General Josef Harpe (who was captured by the Americans and lived to the age of 80). It consisted of three camps set up along the front line.\n\nThe area was entirely marshland and sparse woods.\n\nThe first camp was located near the village of Dert. It was established by the 35th Wehrmacht Division under the command of Lieutenant General Georg Richert.\n\nThe second camp was near the settlement of Ozarichi.\n\nThe third was close to the village of Podosinnik. The camps in Podosinnik and Ozarichi were organized by the 110th Wehrmacht Division under the command of Lieutenant General von Kurowski.\n\n=Lieutenant General von Kurowski was sentenced to 25 years in prison=\n\nHell\n\nThe territory was surrounded by barbed wire. The perimeter was mined. The surrounding area was entirely marshland. There were hardly any trees. There was no drinking water. There was no food. There were very few dry spots that were not waterlogged.\n\nThere were fifty thousand women and children — prisoners of the Ozarichi concentration camp.\n\nSince most of the prisoners were intended to survive until our army arrived, in order to infect Russian soldiers with typhus, they were fed bread made of sawdust and oatmeal flour.\n\nThis \"bread\" was thrown over the barbed wire rather than brought in, to avoid infection. Not everyone got any.", "label": 0}
{"text": "You've just discovered clientelism, which is an inherent part of a representative democracy.", "label": 0}
{"text": "Never said that.\n\nIt just shows that Ukraine, even after being attacked by russia in 2014, wanted russian gas transiting their country. \n\nSo blaming germany and no other country is just rediculus.", "label": 0}
{"text": "Sure, russia strong, for sure it will go to a berlin again. Profesional ssoldiers alone fron nato would be overkill, us airforce would end this war alone (look at first iraq war)", "label": 0}
{"text": "The only sense of self preservation necessary is to remember an oath. \"Never Again\". And that is all that matter with his ilk. \n\nSelf-preservation start with removing the tumour, not let it fester by fearing the treatment. Inaction is the mother of damnation.", "label": 0}
{"text": "I have to think the sticking point for this would be giving up the Pound. I don't see the EU allowing the UK back without moving to the Euro, and I don't see the UK wanting to give up the Pound (and I would hate to see it go)", "label": 0}
{"text": "I’d only support if they adopt Euro.", "label": 0}
{"text": "If he's stupid enough to start trade wars with literally everyone besides Russia again, possibly.\n\nIt's funny how the Republicans thought anyone would want to join their anti-China crusade when they were trying to put tariffs on their allies simultaneously.", "label": 0}
{"text": "AP, Reuters, etc. (i.e. factual focused reporting with minimal spin) are preferable but I find I hard to believe that any major network would have said that the sanctions would cripple Russia’s economy immediately. It’s pretty commonly understood that sanctions take a while to take effect. \n\nSo, I guess, anything that not an op ed or some rando’s opinion but an actual attempt at factual reporting. It could be from any major network, even the right wing ones like Fox or (now) CNN", "label": 0}
{"text": "Most have basic Counter-Strike English courses, so they know everything they need - \"go, go, go\", \"enemy spotted\", \"taking fire, need assistance\", \"team, fallback\". Also cykablyat is pretty international.", "label": 0}
{"text": "Київ 😥🇺🇦", "label": 0}
{"text": "And that is precisely what is happening, nature thrives when the underlying conditions are sustainable. Our way of life has gotten unsustainable and thus nature is putting a cap on it ....we as a population could maintain a slightly lower population if we came together and decided that we'd transition to a post-growth economy slowly and plan for it but that's unlikely to happen since we've let greed dictate terms for way too long so now we'll have to wait till population shrinks to a fraction and world order shifts around a bit and then eventually transition into sustainable economic and social models. The only loss would be of progress and culture.", "label": 0}
{"text": "Yes it would. The same way that NATO has a commanding officer, so does the EU. And even then, your reasoning would mean that the sheer concept of \"AN ALLIANCE\" could not exist. \n\nNow go back making saner argument Yakov. I've other things to do than to listen to that bullshit !", "label": 0}
