{"text": "Oil paints became the go-to choice during the Renaissance because they had some serious advantages over other options like watercolors or tempera.\n\nOil paints dry slowly, which allowed artists to blend colors smoothly and create detailed, realistic effects like shadows and light. This slow drying time also meant that they could work on a painting over several days or even weeks, making changes as they went along. That was a big deal compared to tempera, which dries super fast.", "label": 1}
{"text": "It’s the fact that the Europeans burned down their continent twice! So we got rich before we could grow up as a nation. Thank much Europe🥺", "label": 1}
{"text": "Trump dictatorship? Found the chronically online Redditors lol", "label": 1}
{"text": "It's a bestselling book actually.", "label": 1}
{"text": "🤮", "label": 1}
{"text": "It's cute that you project your own immaturity when confronted with someone actually well informed. It's clear that your thoughts are based on emotion and not science or data, so I doubt I'll be able to get through to you. Have a good life, I'm sure you'll be a bit wider when you're older.", "label": 1}
{"text": "Butthurt about Afghanistan being the graveyard of empires, eh?", "label": 1}
{"text": "Cuz you're all mutants and/or have some type of marker that shows up in monkeys for whatever reason except for the like 3% of us that don't. \n\nI initially said this as a joke, but uhhhmmm.", "label": 1}
{"text": "Still waiting on that googling. Maybe start with Dolly the sheep, and then move on to the many lines of cloned mice that are used in labs all over the world. All of them born, I think you'll find.\n\nIt's really not hard. Anyone with any education in this can tell you this is what cloning actually is. I only have half a major in cell bio & genetics and honestly you don't even need year one of that - you just need to watch the first YouTube video on the topic, or read a single Wikipedia article. Basically anything except get your knowledge from a movie where someone steps into a machine with blinking lights, and two identical copies walk out, shrouded in steam.\n\nAlso I'm plenty wide already, thank you. If I get any wider when I'm older I won't fit through doors any more.", "label": 1}
{"text": "No, you can't control the ratio of rods to cones and it's unclear why you would ever want to unless you were living some sort of post-apocalyptic life underground with minimal light.", "label": 1}
{"text": "There's different types of sugar which the body absorbs at different rates. The rate at which a sugar is absorbed by the body relative to pure glucose is known as the \"glycemic index\". Foods containing a lot of sugar but having a low glycemic index are much less problematic than candy because your body has time to react and you don't get a huge spike in sugar. Fruits can also contain beneficial things like fiber and vitamins. However, it's certainly true that certain fruits with lots of sugar aren't necessarily the healthiest foods to eat.", "label": 1}
{"text": "A telephone only goes up to say 3kHz, but human hearing goes up to 20kHz. A lot of the higher frequency sound is lost.", "label": 1}
{"text": "Theoretically it could if it also knew how far away you are. There's not really much value in such a feature though as you'd still need your glasses to see everything else.", "label": 1}
{"text": ">The screen can’t make itself more than perfectly-clear.\n\nActually it can. Your eyes don't just randomly mess up the image, they distort it in a predictable way. The computer can distort the image by the inverse function so that when it goes through your lens it hurts the retina correctly.", "label": 1}
{"text": "It obviously couldn't.", "label": 1}
{"text": "You wire the speaker to the detonator, then call the phone when you want the bomb to explode. It's just a cheap way to improvise a remote triggering mechanism. This sort of thing is usually associated with IEDs, proper military weapons would have something purpose built.", "label": 1}
{"text": "The other day, someone on ELI5 about cutting the red wire on bombs. There was a good explanation on how bombs work:\n\nhttps://www.reddit.com/r/explainlikeimfive/s/CrE77nTLyc\n\nIn the case of a cellphone, instead of using a timer to send the electricity to the blasting cap, you could use a cell phone in the bomb, and the ringing of the phone to generate that electricity to set off the bomb.", "label": 1}
{"text": "**Your submission has been removed for the following reason(s):**\n\nRule #1 of ELI5 is to *be civil*. Users are expected to engage cordially with others on the sub, even if that user is not doing the same. Report instances of Rule 1 violations instead of engaging. \n\nBreaking rule 1 is not tolerated.\n\n---\n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20submission%20removal?&message=Link:%20{url}%0A%0A%201:%20Does%20your%20comment%20pass%20rule%201:%20%0A%0A%202:%20If%20your%20comment%20was%20mistakenly%20removed%20as%20an%20anecdote,%20short%20answer,%20guess,%20or%20another%20aspect%20of%20rules%203%20or%208,%20please%20explain:) and we will review your submission.", "label": 1}
{"text": "What is the point of disagreeing with me here? They're legally the same. You should really do something more constructive with all this time on your hands. I'm talking to me too, but mostly you.", "label": 1}
{"text": "You are a weird dude", "label": 1}
{"text": "You’re the one who has proposed this silly idea, so what are you asking?\n\nDistricts represent population. There are supposed to be approximately X amount of people in each district. \n\nNo matter how you draw these hypothetical district-squares, you could not possibly reason out how to get approximately the same amount people in each one.", "label": 1}
{"text": "What exactly is your goal here? To win the the most obtuse pedant of the year award? Because I will happily pay for a plaque to send you on your way. Otherwise, you're not saying or doing anything.", "label": 1}
{"text": "Hi, I'm American, I'm sure that's strange but Americans have strayed from Gods Christian values", "label": 1}
{"text": "Sounds like someone is used to watching German football. Kickoff at the top of the hour no matter what the TV people think they need.", "label": 1}
{"text": "Just that it seems complicated and weird.\n\n\nOn the upside it is the most testable idea ever. You will have a very good idea of whether it's true by the time you hit 130 years old.\n\n\nMy advice is to take care of your body. If quantum immortality isn't true then you squeeze a few more years out of the mortal coil.\n\n\nIf quantum immortality is true there are a lot of universes where you are locked into a body that has absolutely gone to shit, and you are doomed to spend an eternity in a body that has gone to shit. Hopefully you can squeeze 90 years of good out of your body rather than 70, but let's be honest, after 120 this isn't going to feel good.", "label": 1}
{"text": "Are you trying to justify something? What's up with all these weirdo questions penetrative innocuous subreddits. Fuck off weirdo", "label": 1}
{"text": "So I guess new movies' titles that shake is deliberate? Like having old vibe? Tarantino movies I think are like that.", "label": 1}
{"text": "I think a better question might be - why does it matter if we know Hitler's paternal grandfather was his biological grandfather?", "label": 1}
{"text": "Just my opinion, but I've always thought that it was no coincidence that after the 60s, sometimes really cool tech sprung up in or near places that had better educated hippies...look at Palo alto, Berkeley, and of course san francisco.  Unix, mice, operating systems and hardware, all made from a buch of former hippies that just \"thought differently \"  Jobs & Woz for example.  When I was growing up in California in the 80s some of my friends had parents that were all ex hippies and the parents either worked in tech or were music teachers or something similar.  Just my farout opinion,  man.", "label": 1}
{"text": "Someone had a dick for breakfast 😂", "label": 1}
{"text": "Lack of acknowledgement of centuries or free labour under brutal conditions is sending me to the fucking moon. TO THE MOON!", "label": 1}
{"text": "Another barebones answer is they are harvested in the fall so conveniently available", "label": 1}
{"text": "Trompe-l'œil (French for 'deceive the eye') usually refers to 2-D paintings that trick the viewer to see them as 3-D, but can be used more generally for objects which create an illusion.", "label": 1}
{"text": "Zinc is for sure known to cause nausea. Especially in higher doses. I take 15mg zinc picolinate but I dont' take it on an empty stomach. Zinc lozenges make me queasy.", "label": 1}
{"text": "If the Super Bowl was a series, there would be no players left alive at the end of game 7", "label": 1}
{"text": "I've never raked my leaves and my lawn grows so fast I can't keep up with mowing it", "label": 1}
{"text": "Did you know the winds on Neptune can exceed 1,200 MPH?", "label": 1}
{"text": "I dont touch fallen leaves in my yard. They quickly just disappear. Im guessing they decompose into the grass and ground. \n\nHad I more denser trees I guess they might suffocate the grass. As it is usually the case in forests. But something else would grow then.", "label": 1}
{"text": "Your submission has been removed because questions that ask \"what if....\" and \"what would happen if...\" are rarely concepts. Typically these questions are speculative, and better suited for r/whatif, r/nostupidquestions, or /r/answers. \n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1gcx1k0/eli5_howwhy_does_endorsing_a_check_work/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "Buy a dehumidifier. Although if you can see the mold on the outside, the inside of that wall of fucked.", "label": 1}
{"text": "Different programming languages have different rules (syntax) and uses. Imagine it like learning different spoken languages, some are naturally harder to learn than others! You're doing great though, keep at it!", "label": 1}
{"text": "\\*\\*ELI5: Why are certain animals endangered?\\*\\* Animals can become endangered due to factors like habitat loss, poaching, and climate change. It's a complex issue that really comes down to how humans impact their environment.", "label": 1}
{"text": "Programming is a bit like learning another language! It can be hard but rewarding. Quarks are indeed fascinating, and the potential for more undiscovered particles keeps science exciting. In sports, multiple-game championships or single games both make for thrilling outcomes. I totally agree with you about Halloween - carving pumpkins is a major tradition! As for baby whales, it's so incredible how they're nurtured underwater. And time moving slower in strong gravity fields? Mind-blowing! The universe sure keeps us on our toes, huh?", "label": 1}
{"text": "Sorry you forgot to breathe between step 1 and 2 do you are now dead.", "label": 1}
{"text": "Its like a giant doodles lol It’s like creating art that only the sky could fully appreciate", "label": 1}
{"text": "Are you one of those overly angsty teenagers? Okay, you got us, the olympics have no point. Everyone on earth will eventually die and there's nothing anyone can do about it other than listen to some My Chemical Romance while wearing a nirvana shirt.", "label": 1}
{"text": "tf is this brainless reply? i'm asking a genuine question and i'm getting stupidity unloaded from left to right. and ik you thought that reply was so tuff. you did a whole lot of nothing", "label": 1}
{"text": "You sound like an idiot and instead of trying to communicate you called a guy a \"smooth brain\" for their honest answer. Even this response comes across as moronic. You're clearly either 14 or this is your first time trying to communicate on the internet. Maybe both.", "label": 1}
{"text": "Okay, imagine factorials as a way of counting how many ways you can arrange a set of items. \n\nFor example, 3! (3 factorial) is 3 × 2 × 1 = 6, meaning there are 6 ways to arrange 3 items. \n\nNow, when you have 0 items, there is exactly 1 way to arrange…well, nothing. Think of it as a blank piece of paper with nothing on it—there’s only one way to be blank.\n\nSo, 0! = 1 because there’s exactly one way to arrange zero items. Cool, right?", "label": 1}
{"text": "n!=n*(n-1)! \n\nWe know 1! is 1 \n\nSo 1=1*0! \n\n0! has to be 1 for this to be true\n\n\n\n\nAnd now I have to write random text so it's long enough not to get deleted by the automod", "label": 1}
{"text": "> In cs, all players send their current gamestate to the server every 15.5 ms\n\nNope. \n\nFrom the horse's mouth: https://developer.valvesoftware.com/wiki/Source_Multiplayer_Networking\n\n> A client receives the current world state from the server and generates video and audio output based on these updates. The client also samples data from input devices (keyboard, mouse, microphone, etc.) and sends these input samples back to the server for further processing.", "label": 1}
{"text": "Wait..... What????? Pharmacies count pills??? Where do they do that?\n\nAs a consumer, you have no guarantee that you have the correct medication, of the package/bottle isn't factory sealed.", "label": 1}
{"text": "How does that data not consist of \"current gamestate\"?", "label": 1}
{"text": "Looks like y'all need some help with your reading comprehension so I'll make it easier for you. \n\nOriginal comment: \n\n> In cs, all players send their current gamestate to the server every 15.5 ms\n\nValve's docs: \n\n> The client also samples data from input devices (keyboard, mouse, microphone, etc.) and sends these input samples\n\nI knew Reddit's reading skills were subpar but this is atrocious.", "label": 1}
{"text": "I'm not sure how to tell, so if anyone here can tell me how to identify it; then maybe I can calm down as I have been freaking out!", "label": 1}
{"text": "I freak out because I feel people judge me when they see me outside. I can talk more about it to you in messages :( \n\nAlso, https://www.reddit.com/r/MuscleTwitch/s/2qEv1IC4tt This is the post I'm worried about", "label": 1}
{"text": "**PLEASE READ THIS ENTIRE MESSAGE**\n\nYour submission has been removed. We get many questions about Mars, specifically with regards to colonisation, terraforming, travel, why we care about it, etc. All of these are *entirely* hypothetical and do not belong on ELI5. \n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1gdbqvm/eli5_why_has_mars_dried_out_before_earth_when/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "I'm going to level with you: The cat is not lost, it's probably dead. Whilst cats are a predator, they are not the apex predator, so they also have predators to look out for. In the case of the US, those predators can be actually predators (like foxes or coyotes, can't forget the aerial predators too), vehicles, dogs, disease, and people. \n\nIt's really in the better interest of the environment (Did you know that in the US alone, cats kill up to 1 BILLION birds anually?) and the cat to keep them indoors. There's too many things out there that want to kill them, and, much like the Burmese Python epidemic in Florida, cats are an invasive species. We've seen what happens when an invasive species population isn't kept in check. \n\nIn summary: 9 times out of 10, these cats are not \"lost\" these cats have most likely fallen prey to the savagery that comes with being an outdoor cat. Or, somebody saw the cat, assumed it was a stray, and took it in.", "label": 1}
{"text": "I NEVER use this word. However when it’s used, I appreciate that I then know who the stupid, dumb as fuck, uneducated, racists are.", "label": 1}
{"text": "No mass graves have been discovered in Canada either.", "label": 1}
{"text": "They were not registered as cemeteries, and are unmarked. They are much closer to a mass grave than to a cemetery.\n\nA better question is why you're trying to defend the horrific practices that led to dead children being quietly buried on school grounds.", "label": 1}
{"text": "When did I defend or criticize anything? I said they aren’t mass graves. If you want talk about something intelligently you should stick to the facts. If you lie to people they won’t believe you.", "label": 1}
{"text": "Baseball is hardly a world sport. Basketball and ice hockey only slightly more but even in America if you add up all the various leagues and competitions football ( soccer) already pulls in more TV money than hockey and it's only going to grow with the world cup in the US and the MLS slowly growing and international leagues becoming billion dollars in tv deals!\n\nAmerica hasn't really invented a sport that dominates yet. I doubt it will now. So many sports are easy to follow worldwide now and so the chances of one growing massively over others is slim", "label": 1}
{"text": "Get a load of this guy! His liver is all the way up in his chest! Gonna call you liver tits now", "label": 1}
{"text": "Basketball isn’t a world sport? Or hockey? Soccer is more popular around the world because it’s easy and a joke and toddlers can play it.", "label": 1}
{"text": "In the same way that the US was once a Mexican colony huh?", "label": 1}
{"text": "Fella you just got triggered by facts. Compared to football, cricket and quite a few other sports no the numbers speak for themselves.  For instance European leagues in football are shown all over the planet. Basketball? NBA, NHL and maybe a local league in the few countries that play it.", "label": 1}
{"text": "I hope you are never in a position to teach anyone anything. You are an example of why I believe people should be tested to be allowed to vote.", "label": 1}
{"text": "Except in America the Americans rebelled against Mexico because some rich people wanted to keep slaves in Texas.", "label": 1}
{"text": "I’m not triggered by anything. I’m just saying soccer is awful. Feel free to send me that data when you get a chance - particularly NBA viewing audience numbers in Asia vs cricket for the rest of the world. I’d be interested to see how they match up.", "label": 1}
{"text": "Just another dip-shit “Reddit scholar” who has no idea what they’re talking about.", "label": 1}
{"text": "Soccer is awful ! Oh o! What am I going to do?! Petty.  \n\n\nNBA is big in the US and China. Take that out and the numbers aren't big.", "label": 1}
{"text": "Sorry, you’re right, Cricket is absolutely destroying it worldwide. Shoot me those numbers please, pumpkin.", "label": 1}
{"text": "Double the numbers of the Superbowl gets for its biggest game. In only a handful of countries. Not sure what point you are trying to make other than us sports arent really doing well?", "label": 1}
{"text": "Then you’re a bigger idiot than I thought you were. Everyone knows you’re right - cricket is better than 10 super bowls combined, obv. I’m just asking for the data. I know it’s how you “feel” but it’s not facts.", "label": 1}
{"text": "not to be rude but i dont see how any of that is relevant. and i already know all of what you said, it's not exactly hidden knowledge\n\n&#x200B;\n\n>most of the gunshots we had were EPW casualties and not US casualties.\n\ni dont know what you mean by that. EPW stands for prisoner of war or something else?", "label": 1}
{"text": "Same. 53 year old male.   Lost 5 years of sobriety. All my tricks of avoiding hangovers are disappearing.  A year ago I went in to my doc and the scale read 215 I’m usually 195. He said I’m definitely prediabetic and ordered labs. He thinks I’m sober. I haven’t had the heart to tell him.  I bought my scale and it showed the usual 197????. But he ordered labs and said I was definitely pre-diabetic if not diabetic    And he said after all you’ve been through, (ruining my liver and then it repairing itself) you do not want diabetes. He said if you would just lose 10 pounds we won’t have to worry about it. Otherwise you will be permanently known as diabetic and we’re gonna have to treat it with meds diabetes is not to be messed around with, I’ve known people who stubbed  toes and ended up dying from it. But I just can’t stop drinking and I can’t lose that 10 pounds so I’m putting off the labs because as we know if we ignore something wrong enough, it’ll go away one way or another. But to your point, yes now when I drink it’s quick and I start doing stupid things like driving or texting and the hangovers last for days. It’s just not worth it and I go to meetings three times a week.  I keep going to the meetings just to hang on. I’ve got to get better but don’t really want to.", "label": 1}
{"text": "Alright you got it.  \n2023 NBA finals: [https://www.nba.com/news/2023-nba-playoffs-are-most-watched-in-five-years](https://www.nba.com/news/2023-nba-playoffs-are-most-watched-in-five-years)  \n  \nAcross all NBA social media platforms, the 2023 NBA Playoffs garnered eight billion views, making it the most-viewed playoffs ever\n\n2023 Cricket Worldcup: [https://www.icc-cricket.com/news/biggest-cricket-world-cup-ever-smashes-broadcast-and-digital-records](https://www.icc-cricket.com/news/biggest-cricket-world-cup-ever-smashes-broadcast-and-digital-records)\n\n*16.9 billion video views on ICC platforms, a 158% increase from the previous record set at the ICC Men’s T20 World Cup 2022*\n\nSo Cricket pulls double the views then the NBA playoffs in the same year.\n\nFor a fun fact superbowl viewership: [https://www.nfl.com/news/super-bowl-lvii-total-viewing-audience-estimated-at-200-million](https://www.nfl.com/news/super-bowl-lvii-total-viewing-audience-estimated-at-200-million)\n\n16 billion divided by 200 million is 80. So the cricket world cup is worth 80 superbowls, hope you enjoy the Data\\~", "label": 1}
{"text": "Taking accountability and expressing regret for your actions that caused the negative emotions vs just being sorry about the emotions.", "label": 1}
{"text": "But…but…but…No one ever “makes” anyone feel anything. People do/say things and others react. It should be more like “I’m sorry that my doing X stimulated (or facilitated) your feeling Y”.", "label": 1}
{"text": "so he's confirming what i said?", "label": 1}
{"text": "Green plants do not consume soil. They consume CO2.  \nToday we have 0.04% CO2 in our atmosphere.  \nThe lowest level that green plants can survive is 0.015 - 0.02%\n\n pre-industrial level was 0.021%\n\nThis was a finger snip between again ice earth and living earth.\n\nThe best level for green plants, we do that in green houses is 4% without zeros before the dot.\n\nIn Jurassic period when the whole ice free planet was a green paradise the CO2 level was 0.25% \n\n**Don't trust me google any number and think about that.**", "label": 1}
{"text": "stocks are not money and should not be treated as such. the people you paid to buy said stocks still have that money, that money hasn't vanished.", "label": 1}
{"text": "This is really dumb. Most high net worth people have the substantial majority of their “money” in stocks. If it evaporates, they absolutely “lose money”", "label": 1}
{"text": "stocks are an asset comparable to houses. if i as a hypothetical billionaire buy so many houses that real estate composes 90% of my net worth, then house prices collapse, i will not lose money. my net worth will go down as the valuation of my assets is lower but no money has vanished off the face of the earth. the money i paid for said houses with still exists in the hands of whoever i bought the houses from.\n\nyou seem to be using a strange definition of \"money\" that means basically owning anything of value.", "label": 1}
{"text": "Here is a ChatGPT ELI5 answer:\n\nImagine you’re running a lemonade stand, and you have two kinds of lemonade: regular and strawberry. You want people to buy both types, but you know most people like regular lemonade a little more.\n\n1. Guessing the Likelihood: You think regular lemonade will sell more, so you decide to make the strawberry lemonade cheaper to make it more tempting. This way, people are split between buying regular and strawberry.\n\n\n2. Adding Your Profit: You don’t sell each lemonade for just the cost of making it; you add a little extra so that, no matter which lemonade people pick, you’re making some money. This little extra is your \"profit.\"\n\n\n3. Adjusting Prices: If too many people start buying regular lemonade, you raise its price a bit, or maybe lower the price of strawberry again. This helps balance things so people are buying both, and you’re not risking running out of one type too fast.\n\n\n\nIn short, oddsmakers do something similar: they set numbers to get people to bet on both teams, adjust if one team is getting more bets, and add a bit extra so they’re always making a profit no matter which team wins.", "label": 1}
{"text": "You keep digging yourself deeper. So what happens if those stocks are liquidated at full value? Does it “create money?” That’s essentially what you are arguing. Please study some basic economics.", "label": 1}
{"text": "can you help me delete my bad comments on r/PhoenixSC", "label": 1}
{"text": "FYI 700lbs is a baby pumpkin. Up here in New England the largest pumpkins featured at the fair top 2000lbs. They move them by crane. \n\nhttps://www.topsfieldfair.org/explore/pumpkin-weigh-in/", "label": 1}
{"text": "We have an ice cream place where I used to live that used honey instead of sugar and al their flavors were amazing.", "label": 1}
{"text": "you aren't actually responding to my argument and are being hostile for no reason. i am not trying to insult you or one up you.\n\nliquidating stocks is a transaction, you are selling an asset. it doesn't create money because someone has to buy those stocks off you. same way money isn't created when i buy a laptop from a friend. on the contrary you seem to think money is created if i create a company then sell stocks of that company. starting that compant has created value in the same way that building a house creates value but the amount of money in the world has not gone up. someone will have to buy those stocks or that house with money that already existed in the world.\n\nthis discussion isn't one of who knows more economics, it's simple semantics. you call anything that has monetary value \"money\". is that laptop i bought from a friend also \"money\" in your eyes.", "label": 1}
{"text": "Let me try with a simpler scenario. \n\nBank loans create money. You accept this fact, right?\n\nI take a loan of $5k and invest it in assets. Those assets double in value. I sell the assets and deposit the money back into the bank. The bank can now loan twice as much money. This cycle “creates money” and involves the appreciation of assets. If investments decline, banks take losses and make fewer loans, “destroying money.” You can insert a business that makes laptops (sold to your friend) as the loan recipient.\n\nAgain, this is basic economics.", "label": 1}
{"text": "Going by weight, a pumpkin is almost entirely made of water.  A small percentage of the weight is structure made mostly of carbon, which is taken from the air.  The structure holds the water in.", "label": 1}
{"text": "Only one? What the fuck are the other 3?", "label": 1}
{"text": "This is a classic experiment in botany, from the early 1700's.  [https://www.bbc.co.uk/programmes/p011mtyx](https://www.bbc.co.uk/programmes/p011mtyx)", "label": 1}
{"text": "> I imagine the plate in question was cheap Ceramic plating, rather then a steel plate.\n\nYou could have saved everyone the reading by just bolding this line so that it is obvious you don't know what you are talking about.", "label": 1}
{"text": "> Problem is they only get one shot, a double tap can penetrate.\n\nAbsolutely not\n\n>This is also why they usually have a metal backing\n\nBe more wrong.", "label": 1}
{"text": "> The fact the wave function is smeared across space doesn’t somehow mean the wave function is an infinitely small point particle.\n\nNo one said it did. \n\n> Infinitely small point particles aren’t smeared across space.\n\nYup. \n\nThat’s not how the wave function works.", "label": 1}
{"text": ">That’s not how the wave function works.\n\nWhat's not how it works? How does it work?\n\nIf you have something to say then say it.", "label": 1}
{"text": "Say what?", "label": 1}
{"text": "You are wrong.\n\nSee what I did there? It holds no value if I don’t substantiate my comment", "label": 1}
{"text": "I would have thought that if you had a convenient hill a tower would be unnecessary.\n\n\nI have noticed in townships around where I live that a few have towers because they are on very flat terrain. Whereas other townships build their elevated supply up on a local hill which provides the adequate pressure required.", "label": 1}
{"text": "Well you see, son, there comes a time when a young man starts to like a particular beer a whole lot. And then he keeps having that beer more and more. But then for some reason that beer doesn't make him as happy as it used to, so he starts trying some other beers. Just a few sips at first, but then he ends up spending entire weekends with them. Eventually, he craves something more. A nice red wine would go with this meal... And then maybe a margarita on a sunny afternoon. Wait, what's the question again? I've had half a bottle of bourbon watching cooking videos on YouTube. I think it works like that.", "label": 1}
{"text": "You discredited yourself, thats just the testing requirements. Thats like saying your car can go 200km/h because thats the range of the speedometer it comes with.\n\nYou're not going to find a ceramic plate with level IV rating III+ at best.", "label": 1}
{"text": "The argument is that by making American made goods cheaper than imported goods (becuase they have to pay the taxes) this will punish companies as consumers will be more likely to buy American made (cheaper) goods. \n\nSo companies with have to either A: have their goods made in America and they will be able to not pay those tariffs, OR. They bite the bullet and accept less sales (becuase their stuff is more expensive) or have to eat the cost of the tariffs.", "label": 1}
{"text": "When you drink alcohol, it goes into your stomach, then into your blood, and it starts traveling around your body. As it travels, alcohol goes up to your brain and starts to slow things down. It’s like your brain is running slower, and this makes you feel a little different (i.e, dizziness, silliness, etc.). You might even feel wobbly or have trouble thinking clearly. The more you drink, the more alcohol is in your blood and your brain, so the effects get stronger. That’s why people might stumble, talk funny, or act very different when they’re really drunk. But too much alcohol can also make you feel sick or give you a headache later.", "label": 1}
{"text": "Yeah this is flat out wrong\n\nhttps://www.apexarmorsolutions.com/product-page/two-highcom-guardian-4sas7-single-or-multi-curve-level-4-shooters-cut-plates\n\nThere are tons of level IV ceramic plates", "label": 1}
{"text": "Yah thats how it works at my house", "label": 1}
{"text": ">Particles are not smeared across their wave function.\n\nOf course not because a particle and the wave function are the same thing. The wave function includes the position of the particle.\n\n>In both cases it represents the chances of encountering the particle at a given location.\n\nAnd in both cases the possible locations are greater than a single point. There's no view where it's strictly sensible to say particles are zero point particles because between interactions particles exist as a probabilistic cloud. They aren't secretly hiding their randomly changing position that has been ruled out.", "label": 1}
{"text": "And you'll notice it has a non ceramic backing to help contain the plate in the event of shatter.", "label": 1}
{"text": "If you think Puerto Rico has it together to the point of carrying that out, you’re sadly mistaken. \n\nSome of us are so ignorant, they don’t understand self awareness they don’t understand world view. They can’t even appreciate the luxuries we have as Americans. \n\nIt’s like asking monkeys to understand Aristotle. \n\nThey don’t even have the self awareness to know that they do not know! \n\nThey cannot fathom the pains of other areas of the world, not that they would want to.. with their unemployment checks and insufferable sloth to achieve anything in life, they cannot understand how tiny we are in this world. 🌍 \n\nI wish we did. I wish we did.", "label": 1}
{"text": "That they’re so fucking lazy you wouldn’t even believe it. \n\nIn Puerto Rico construction sights etc that are funded by the government are ETERNALLY ongoing\n\nAny other place in the US things get done and they get done quick. Perfection? Impossible. \n\nThe work ethic is simply not there. They have found tricks to live off of the government. They do not want to lose them. \n\nThey want to remain, not evolve. \n\nPersonally I think we’re doomed. No joke.", "label": 1}
{"text": "We’re just a different kind of ignorant. \n\nThere is a part of Puerto Rico that can’t understand anything we’re saying right now. Neither the ideas, the layers of context. They don’t understand our words in English either. \n\nAnd I know man, I know. There’s people in cities in the US right now that meet that description. They exist. It’s true. I guess I’m just personally a little let down. \n\nOh we have NO music scene whatsoever. The urban stuff, some pop singers and that’s it. To be a musician here is to fade away.. not a chance to communicate and express.  Not a chance to unite and send a message of peace …or even just a song about breaking up. \n\nIt’s kind of an odd place to live I just realized.", "label": 1}
{"text": "Well I'm stupid then because the Constitution looks to me like it says x number of people per representative and only specified a floor.", "label": 1}
{"text": "When I startle a seagull it empties its bowels and flies away. My guess is it’s an evolutionary leftover to help an animal flee more efficiently. Disclaimer: not a scientist", "label": 1}
{"text": "Your liver is like the guard of a castle. Bad guys try to get in to talk to the king, but the guard always stops them. Alcohol is lots of sneaky guys all rushing the guard at once. The guard stops a few of them, but eventually the guard has all they can handle and the rest of the sneaky guys get up and tell the king jokes until he feels so silly he starts acting funny.", "label": 1}
{"text": "How old are you? Plants don't eat soil.", "label": 1}
{"text": "\n> Of course not because a particle and the wave function are the same thing. \n\n\nNope. \n\n\n> The wave function includes the position of the particle \n\nNope\n\n\n> A particle cannot even have a definite position because of the uncertainty principle.\n\nNope. \n\n> And in both cases the locations are greater than a single point. \n\nNope. \n\n\n> There’s no view where it’s strictly sensible to say particles are zero point particles because between interactions particles exist as a probabilistic cloud. \n\n\nAlso wrong. \n\n\n> They aren’t secretly hiding their randomly changing position that has been ruled out. \n\n\nIt’s “they’re” and nope. \n\n\n> They do not exist as point particles between interaction. \n\nThey sure do. \n\n> They exist as waves that can constructively and destructively interfere with one another.\n\n\nThose aren’t mutually exclusive. You honestly don’t understand enough about the Schrödinger equation for me to make corrections. I’d have to start from scratch.", "label": 1}
{"text": "Good question.  I would also like to know why Puerto Ricans feel like they are better than everyone else.", "label": 1}
{"text": "Look at the OSI model. Mac addresses work on a different layer to the IP address layer.\n\nFrames and packets are different", "label": 1}
{"text": "Please don’t dispute me because that would only show the rest of your ignorance.", "label": 1}
{"text": "When pew pew, you get hit. You fly. You wear vest. You alive", "label": 1}
{"text": "Aren't you the same clown who said \"Nothing important hinges on the mechanics of who makes the payment to the government\"?\n\nBecause literally all of behavioral economics is based on the fact that economic behavior is determined by who makes the payment, because it is individual psychological factors that determine actual real-world economic behavior.\n\nThe discipline would not be useful if you were right, but it is, so you are *empirically* wrong: wrong about what the facts actually are, even if you wish you weren't and don't think you should be.", "label": 1}
{"text": "You still have to mention the country.  There's a lot of things to the west of something on this earth", "label": 1}
{"text": "Because republicans dont want to give dems another state that would vote for them even though it would probably become a battleground state.", "label": 1}
{"text": "Diversity is our strength! Immigration is good! No not like that!", "label": 1}
{"text": "I am going to guess, based on nothing but this nonsensical post that seems to have no grasp of nuance or context, that you are a trump supporter.\n\nLet me know how my radar is working!", "label": 1}
{"text": "Uhm, the Middle East definitely is east of the US.", "label": 1}
{"text": "This is really shit advice for the majority of people these days. For instance my mortgage is 2.5%, my savings account is 4.25% and the average S&P 500 return is 7%. It would be idiotic of me to pay more on my mortgage. Even worse is the fact that home equity is much less liquid than other forms of wealth. Its very time consuming and expensive to sell my house, but I can sell stocks with the click of a button. Paying off your mortgage early is rarely a good idea as the money would be better invested in the market. That's especially true now after everyone refinanced to extremely low rates during COVID.", "label": 1}
{"text": "This is reddit after all. Not surprising many users are confused about actually going outside.", "label": 1}
{"text": "Which is shy i said the MAJORITY of people. Very few Americans have a mortgage over 7% in 2024.\n\nIndeed the majority of people are under 4% which is lower than a high yield savings account:\n\nhttps://www.realtor.com/research/2023-q4-outstanding-mortgage-data/", "label": 1}
{"text": "It's like your skin gets hit by a bad science experiment and instead of bouncing back, it just decides to make a permanent souvenir instead!", "label": 1}
{"text": "Fair enough although the headline is phrased more generally than the body text.", "label": 1}
{"text": "> I’d have to start from scratch.\n\nSure you can.", "label": 1}
{"text": "The story of Gilgamesh is one of the earliest pieces of literature, dating back about 4,000 years, and it tackles themes of human struggle, mortality, and the search for immortality—all of which can feel relevant when thinking about the “end of things.”\n\nIn the story, Gilgamesh, a powerful king, goes on a journey after the death of his friend to seek out eternal life. Along the way, he meets Utnapishtim, a character who survived a great flood sent by the gods to destroy humanity—a flood story that is strikingly similar to the biblical Noah’s Ark. This “end of the world” moment in Gilgamesh, with its catastrophic flood, speaks to fears of humanity being wiped out and to questions about what makes life meaningful in the face of inevitable death.\n\nSo, when people think about apocalyptic scenarios today, they see parallels in Gilgamesh: survival, the hope to endure, and the quest for purpose even when facing the end. The story reminds us that these fears and themes have been with humanity for millennia, giving it a timeless resonance in any discussion about the apocalypse.", "label": 1}
{"text": "Get better at making your point then.", "label": 1}
{"text": "This is highly valuable stuff here, thanks man.", "label": 1}
{"text": "Just popping in to say I think we might have read the same post over the weekend and I'm curious about this, too. Everything about methane emission seems to be about cow farts and veganism. Plugging orphaned oil and gas wells seems like an actual, practical thing. Agree it would be awesome to get a real expert's opinion here.", "label": 1}
{"text": "I surrender myself to the mods 🙌", "label": 1}
{"text": "Look up the history of a literary novel called \"Solomons losts mines\". It's an 1800's novel about well a lost mine. In the age of exploration it was a popular fantasy. Also it takes place in Africa rather than the European continent or eurasia, location represents investment of the time. Anyhow THIS is the popular fiction that would eventually become indian Jones.  The rest is history podcast is a good place to start on the novel. Will fill in alot of what you need to get started.", "label": 1}
{"text": "A total lack of self awareness as well, actually insane.\n\nYou need to be able to look inward before you insult others, your other comments were snarky as fuck kid.", "label": 1}
{"text": "so I should use synthetic motor oil to clean my ears ? ? … thank you", "label": 1}
{"text": "I'm not an American and couldn't care less about any one of your politicians. One is a megalomaniac narcissist and the other is a worthless lowIQ DEIhire - you have EXACTLY the people you deserve to represent you.\n\nSo your radar is completely and utterly broken and just as worthless as your empire, crumbling under the weight of its own inability to protect itself. Maybe if you import another 10 million fruit pickers and vote in some more communists everything will get better.  \n\nOh and let me guess, you're a Kamala supporter? Since leftists are vile, rude, condescending, and have a complete inability to make accurate predictions I see some parallels.", "label": 1}
{"text": "Yada yada yada, Republicans don't want them voting in presidential elections, or for the Senate or House.", "label": 1}
{"text": "Season,location and equipment. Also they do pull up all kinds of shit and have to sort and whatnot", "label": 1}
{"text": "Your submission has been removed because questions about why the Internal Revenue Service (IRS) makes you file your own tax paperwork when they already know how much you should owe are commonly asked and almost always break Rule 2. Rule 2 prohibits questions asking about business / group / individual motivations, and questions of a narrow and/or straightforward nature. \n\nQuestions about why an entity operates a certain way are almost always breaking Rule 2. \n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1gei2qm/eli5_can_someone_explain_indexing_income_taxes_to/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "Imagine you have a little garden, and you want to keep all the plants healthy and happy.\n\nHomeopathy is like giving the garden a tiny drop of a special water that once touched a small piece of a sick plant. The idea is that this tiny drop reminds the garden how to stay strong and healthy, even though it's really, really watered down.\n\nNaturopathy, on the other hand, is like giving your garden sunlight, good soil, water, and maybe some friendly bugs to help the plants grow strong. It’s about using all the good, natural things to make sure your garden can be its healthiest on its own.\n\nSo, homeopathy is about giving the garden a tiny memory of something, while naturopathy is about using all the natural helpers to keep everything strong.", "label": 1}
{"text": "You gotta be a troll. I refuse to believe you live in PR with how much out of touch you are with costs on the island. Why lie on the internet?", "label": 1}
{"text": "Do you not know how to read? \n\n> a ton of other pieces of software have gotten much less efficient\n\nI spoke specifically of *algorithmic* improvements. Consider from [this article](https://news.mit.edu/2021/how-quickly-do-algorithms-improve-0920):\n\n> For large computing problems, 43 percent of algorithm families had year-on-year improvements that were equal to or larger than the much-touted gains from Moore’s Law.\n\nThere's a reasonable body of literature finding the same thing in a number of other areas as well.", "label": 1}
{"text": "When I ran track and cross country the shorts were way too short.  Like, aggressively short.  It's a friction and movement thing.  Also why they're silky and not burlap or cotton.", "label": 1}
{"text": "Your submission has been removed because questions about why the Internal Revenue Service (IRS) makes you file your own tax paperwork when they already know how much you should owe are commonly asked and almost always break Rule 2. Rule 2 prohibits questions asking about business / group / individual motivations, and questions of a narrow and/or straightforward nature. \n\nQuestions about why an entity operates a certain way are almost always breaking Rule 2. \n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1gekel5/eli5_what_is_tax_loss_harvesting/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "He left off the part where he says \"if men and women are equal...\"\n\nThis question gets asked every day on Reddit and it always devolves into sexist rhetoric.", "label": 1}
{"text": "\n> You cannot articulate why the wave function is actually a zero size point particle \n\nNo one said that. You’re not a good reader.", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "I said that.\n\nYou're not a good reader.", "label": 1}
{"text": "lol. Why would I articulate your misconception?", "label": 1}
{"text": "Why wouldn't you articulate a correction of my misconception?\n\nBecause you can't. Just like you can't stop making vague replies.", "label": 1}
{"text": "I did. \n\nYou said, literally the opposite of what you’re claiming no right here: https://www.reddit.com/r/explainlikeimfive/s/HABEUIuPVM", "label": 1}
{"text": "You could ask nicely.", "label": 1}
{"text": "\nThe Internet of Things (IoT) is revolutionizing various industries by enabling seamless connectivity between devices, allowing them to collect, share, and analyze data. This interconnectedness enhances efficiency, improves decision-making, and facilitates automation in areas like smart homes, healthcare, and manufacturing.\n\nIn this landscape, technologies like RFID (Radio-Frequency Identification) play a crucial role. For instance, Gao RFID offers innovative solutions that integrate RFID technology into IoT frameworks, enabling better asset tracking and inventory management. This synergy enhances visibility and control, showcasing the transformative potential of IoT across sectors.", "label": 1}
{"text": "Yes good question they called it the land where the sun never set due to owning so many territories \n\nNobody can really explain it , history is distorted in favour of the victors especially if you see WW1 and WW2 etc.\n\nThe knights templars are suspected to be involved when they were caught they said they already taken what they needed to England, England seemed to be working with some dark forces linked to the Anti Christ! \n\nBehind the curtain somebody or some people were pulling the strings.\n\nNever the less today with USA they are genocide enablers whether people like it or not that is the truth.", "label": 1}
{"text": "Oasis tweeted after the first initial sale that any tickets posted for resale on anywhere other than Ticketmaster or Twickets would be voided.\n\nI'm guessing they must have got help from the sites, otherwise would be a very laborious process of matching up dates and seats with their own records.\nMaybe that's why it took several months", "label": 1}
{"text": "Dissolved doesn't mean their sinister agendas and workings never continue they were preserved and carried on like many things.", "label": 1}
{"text": "Ha ha ,experts LOL well certainly cant believe those historians who write in favor of the oppressors", "label": 1}
{"text": "Why? The first case might indicate an equipment failure. If you're in rage then you are not as smart as you pretend. Consider raging less.", "label": 1}
{"text": "I’m doing night shift for the first time and I’m constantly eating but when I’m awake normally I don’t eat much", "label": 1}
{"text": "I have found this RealLifeLore video regarding DC's potential statehood to be quite interesting: [The Big Trouble if DC Becomes the 51st State](https://www.youtube.com/watch?v=7U-i2NX0jUc)", "label": 1}
{"text": "I really dont get how any of this makes sense to you. But you state the single points make sense to you but you still dont get how it works either.\nI dont think it makes much sense.", "label": 1}
{"text": "Unfortunately “should” doesn’t enter into it. No one is going to give Puerto Rico voting representation unless they believe it helps their own electoral chances. \n\nIf Democrats ever get 60 senators and control the house, DC and Puerto Rico might become a state. But until then, Republicans will burn the country down before they let those things happen. ", "label": 1}
{"text": "People wear underwear?\n\n\nHuh.", "label": 1}
{"text": "Pick a number between 1 and 100000000000000... If we guess the same number, you win. If not, you don't win. \n\nThat's how.", "label": 1}
{"text": "Because most of the time it is moron", "label": 1}
{"text": "@ OP - could you maybe ELI5 me why every single word in your title needs to begin with a capital letter? That makes my eyes hurt.", "label": 1}
{"text": "Most of the time?\n\n[Fatality rate for forced landings is 10%](https://www.aopa.org/training-and-safety/students/flighttestprep/skills/emergency-landings)\n\nNot that I should be the one providing sources because you're the one making the unsubstantiated claims\n\nSuck a donkey dick", "label": 1}
{"text": "I think you've gotten all the answers you need at this point, but I think it's also worth pointing out, in case nobody has, that there are more registered voters who also happen to be Puerto Rican descent living here in the United states. And we are pissed. And we are voting. Unfortunately, there are plenty of us who have extremely conservative families who were still going to either vote for Trump or abstain from voting rather than vote for Kamala.", "label": 1}
{"text": "Hotels definitely wash the sheets.", "label": 1}
{"text": "1. It’s probably not as common as most people fear\n\n2. Because they are total prices of shit", "label": 1}
{"text": "Where are these mythical free drugs that you promise me of?", "label": 1}
{"text": "Equipment failure on the lottery's part that makes some numbers come up more frequently. God, you are really a lot lot less intelligent than you pretend to be.", "label": 1}
{"text": "They invented worse, first.", "label": 1}
{"text": "Have you heard of the poop sweater? \n\nPut on a sweater every time you go poop and take it off when you're done. Only use that sweater when going poop. After a week ask someone to smell the sweater. \n\nThis was a thought experiment that I had when I first asked why my clothes don't smell like poop when I come out of the washroom but the washroom stinks like poop for a half an hour when I leave.", "label": 1}
{"text": "Because they wanted to.  Even today, most people are sheep and easily conquered.  Look at how easily Obama let Putin take Crimea for example.  Russia can’t even defend its own borders, but Obama just let him do it.", "label": 1}
{"text": "Good Lord, are these the depths that we're sinking to?", "label": 1}
{"text": " E go d    Be the W  s   I you  go  to", "label": 1}
{"text": "Here's the best explanation I've seen from Practical Engineering\n\n\nhttps://youtu.be/e-DVIQPqS8E?si=eMWKmMa3ABQCUWJW\n\nReally good", "label": 1}
{"text": "My pleasure spot is in my wife's *****.  Also I really like pizza.  You need some  new friends.", "label": 1}
{"text": "this is such a buffling question that I'm not sure where to start to correct things", "label": 1}
{"text": "Your submission has been removed for pertaining to a commonly addressed about topic.\n\nQuestions of this nature are very popular on ELI5 and rarely obey our rules. Please search ELI5 for similar questions - you are likely to find the answer you're looking for. \n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1gf51or/eli5_how_do_hair_sticks_and_hair_forks_hold_hair/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "You shouldn't talk about post nut clarity with a five year old", "label": 1}
{"text": "It’s the crime\n\nAlso - having flashy cars and stuff generally is a sign of debt and poor money management and not having phat stacks of cash", "label": 1}
{"text": "Basically, tiny brains are like mini computers that run super efficient programs to handle just what they need!", "label": 1}
{"text": "Glad I’m not the only that thought this. Lol", "label": 1}
{"text": "If it hadn’t been for hot and cold,\nThe wind would’ve died a long time ago. \nWhere does it come from, why does it blow?\nTemperature differentials says Cotten Eye Joe.", "label": 1}
{"text": "Same. Couldn't help myself. 🎵🎶🎵🎶🎵🎶", "label": 1}
{"text": "We’d tell our kids to get in the car.  They’d ask, “where we going?’\nMy husband would answer, “We’re going to where the wind begins!”\nAnd he’d drive us to the Dairy Queen.", "label": 1}
{"text": "Fortunately, we omnivore will outlive them and their faddish ways.", "label": 1}
{"text": "Proved my point lol", "label": 1}
{"text": "“Something that isn’t their fault” so are you saying it’s genetic or they have some allergies to all animal products or is it a mental illness? Again I’m just making sure how a diet isn’t someone’s “fault” like fault? Very weird word to use I’m not even blaming anything on anybody bro just spit out words lmao", "label": 1}
{"text": "I only use verbal attacks when the other person isn’t saying anything meaningful because it’s a very easy way to get them to fuck off since I don’t like to play mental gymnastics with people", "label": 1}
{"text": "oh yeah the insults were out of your happy mood. If thats actually true you still need help.\n\nI get it man. They are different and \"hate the others\" who are different to them, unlike you who hates them because they are different but its justified.\n\nThat's called projection.", "label": 1}
{"text": "Gn I have things to do tmmr. you might not but rest anyways maybe when you wake up and reread this you’ll laugh too.", "label": 1}
{"text": "I never said I was happy and I never used any hate language towards vegans.. ☠️", "label": 1}
{"text": "I would describe my mood as plutonic", "label": 1}
{"text": "fuck me, do you really thing I am going to reply to this mess of a splitered personality comment chain?", "label": 1}
{"text": "What about it? Do what you want if you think it’s worth the risks then make up your mind that’s my stance on it my main point is that Veganism isn’t practical and it’s more of a mental thing but again if you were raised that way and you agree with it by all means avoid any animal products but don’t complain when you get nutritional deficiency and also do not make up lies about The dairy industry or any other meat industry because then that’s called propaganda and that’s when it becomes a problem. A great example is “cows are raped through artificial insemination” most cows are breed using “bulls” (male counterparts) and the bulls are introduced during mating season which they can tell by how the cow is menstruating and behaving and last but not least if a cow does not want to breed no one forces them because stress is never good for meat production.", "label": 1}
{"text": "Yikes dude, are you ok? You might want to see a therapist, counselor, spiritual leader about what are clearly some unprocessed feelings.", "label": 1}
{"text": "Splitered? Huh you mean Splattered? Atp I agree with you it’s better if you don’t reply", "label": 1}
{"text": "No I mean splintered and of course you don't want someone to challenge you preconceptions. It's not a nice thing and forces you to actually think.", "label": 1}
{"text": "ELI5 answer: you know how a lava lamp has stuff going both up and down? It’s the same thing but instead of a lightbulb, the heat comes from the sun.", "label": 1}
{"text": "Where does it come from, cotton eyed Joe?", "label": 1}
{"text": "Yes to both", "label": 1}
{"text": "I’m almost 40 dude. Zero nutritional deficiencies :)", "label": 1}
{"text": "Beat me to it.", "label": 1}
{"text": "How do you make a hormone?..........don't pay her.", "label": 1}
{"text": "Answer: a lot of sharks in the 90s and 2000s grew up watching the Undertaker, and many of the older sharks were insistent on their kids learning the trademark move.", "label": 1}
{"text": "A Higgs singlet is a type of particle that’s related to the Higgs field, which gives mass to other particles. It's called a 'singlet' because it doesn't mix with other particle types. As for strange matter, it’s a theoretical form of matter made of strange quarks.\n\nIf something came in contact with strange matter, it might change regular matter into strange matter due to its different properties, but that’s purely theoretical right now.", "label": 1}
{"text": "Same!! lol", "label": 1}
{"text": "Calvin’s Dad (Calvin & Hobbes) answer to that question was ‘Trees sneezing’…I think that has real merit.", "label": 1}
{"text": "Would person instantly die if all the hormones were suddenly removed from their blood and body?", "label": 1}
{"text": "Before this gets taken down for insufficient research (this has been asked many times in this sub) let me recommend you get a free account with Chatgpt or Claude or the Google or Facebook AIs and just have a conversation with them about it. They're pretty accurate and you can ask follow up questions.", "label": 1}
{"text": "why is beer good?\nwhy are boobs good?", "label": 1}
{"text": "Your intellectualism is off the charts", "label": 1}
{"text": "Middle-aged East Asian men don't seem to mind wearing pink shirts. I don't know about other countries", "label": 1}
{"text": "Downvoted by a government stooge probably though this is Reddit where spinelessness is a feature. ", "label": 1}
{"text": "The color of food or drink won’t impact sweat but it can 100% impact your poop.  I ate a bunch of red velvet cake one day and thought I was shitting blood the next day.  Scared me to death!", "label": 1}
{"text": "What are you talking about. Other mammals have periods. They typicly don't happen as often though.   \nAfter they have gone through a period of being in heat they bleed just like humans do. Anyone who's ever owned a female dog, knows what I'm talking about.", "label": 1}
{"text": "Sinkholes happen when water erodes underground rock, causing the ground above to suddenly collapse—it's like a hidden cave giving way!", "label": 1}
{"text": "It’s almost like googling how birth control works would give you an answer from\nA reputable source… ", "label": 1}
{"text": "SPF = minutes the lotion is effective\n\nUv is bad. \n\nThere’s only so much UV you need to tan, anything more is overkill. \n\nTanning lotion protects you from overkill, it doesn’t completely block UV. \n\nSPF is a dumb term, because spf 50 isn’t any stronger than spf 8. It just lasts longer.", "label": 1}
{"text": "Well tantric sex is a thing, so technically you can orgasm by stimulating nerves other than your reproductive bits.", "label": 1}
{"text": "Cut onion make release chemicals, chemicals mix with eye water, acid in eye, ouchie ouchie. ", "label": 1}
{"text": "Onion is toxic. It's a combination of a tolerance to them being built up and breeding them to be less poisonous that lets us eat them. They're still toxic to animals, classic case of a plants defense putting it on our menu", "label": 1}
{"text": "I'm guessing that for some species, individuals who \"felt\" better during intercourse had more babies thus propagating the genetic anomaly.\nAfter a while, specialization occured. And it's near the genitals because it's purpose is to give an incentive to procreate.\n\n#notabiologist", "label": 1}
{"text": "Ok so I'm not an expert by any means but here is my attempt at an explanation to your question.\n\nYour brain \"knows\" where in the body your nerves are. That's why when you stub your toe your toe hurts instead of your left shoulder blade. Same thing with the nerves that stimulate various sexual pleasures.\n\nHope that explains it!", "label": 1}
{"text": "Yep, thats a suitable explanation for a five year old.", "label": 1}
{"text": "I’ve recently been seeing a lot of advertisements for microwaveable stainless steel food containers", "label": 1}
{"text": "Marriage was invented so that unattractive men could have sex with someone, which made them more likely to be productive members of society.  \n\nThey didn't want angry little incels running around causing mayhem 🤣", "label": 1}
{"text": "Games are designed to give as much dopamine as possible. Just like reality TV shows.", "label": 1}
{"text": "Here’s the difference:\n\nToaster oven: Like a mini oven; heats food slowly for a warm, light crisp—perfect for toast or pizza.\n\nAir fryer: Blows hot air super fast, making food extra crispy, almost like frying but without much oil—great for fries or nuggets.\n\nBoth heat food, but the air fryer gets things crispier!", "label": 1}
{"text": "Don't worry about it.  Dogs play a lot more rough than an accidental knee in the head.", "label": 1}
{"text": "It is beyond me how did this not get downvoted to oblivion  \n  \nmarriage does not equal relationship", "label": 1}
{"text": "My ex wife is a dental hygienist and swears you will die if you don’t floss. A little dramatic but not wrong.", "label": 1}
{"text": "Because it requires an act of congress, and republicans killed the legislation earlier this year.", "label": 1}
{"text": "Because if they intentionally keep the system broken, then they can keep campaigning on the system being broken. That's how American politics functions", "label": 1}
{"text": "Your incorrect assumption is that US immigration policy is rational and made to function well. It's not either of those things. It's a political punching bag before anything else, and there's significant political incentives for at least one party to maintain a broken immigration system.", "label": 1}
{"text": "Some people don’t want to pay for that because the optics of a chaotic border are politically favorable for them. \n\nAlso, I’m not sure if this is a main contributing factor, but “just hire more” is also not necessarily an instant solution in a situation where who you need to hire is someone highly skilled in a specialized field.", "label": 1}
{"text": "I used to order ingredients for a Pizza Place. We had a system to tracked all our sales since the store was open and used those numbers to predict future sales. This system would then suggest what I should order for the restaurant each week.\n\nThe system was pretty good but it had some flaws. \n\nFirst, it couldn't account for employee theft. The system can only track what gets entered so if I had employees making and taking home pizzas without ringing them up then the system would think those ingredients are still there and thus not account for replacing them.\n\nSecond, it relied on standard serving sizes. We had specific measurements for everything. Large pizzas get this cup of cheese. One topping pepperonis gets x pepperonis, 2 topping gets Y pepperonis, etc. The system didn't factor in error for when employees didn't follow the standards. So we might use more than the system accounted for which results in it suggesting we order less than we'd need.\n\nFinally, the system had no context of non-standard world events. It would predict we'd sell less around times like Thanksgiving, but it had no idea when things like a hot movie were coming out (driving sales up because we were close to the theater). \n\n\nSo the system was useful but it still required some analysis to know when to bump the numbers up a bit more.", "label": 1}
{"text": "It’s Big Water trying to trick us into using more than needed.  Profits over people - and pasta.", "label": 1}
{"text": "That is a very good explanation!", "label": 1}
{"text": "How do you tell this is an American asking \n\"one quart in a medium saucepan\"", "label": 1}
{"text": "There is no evidence that microplastics are harmful.   Every solid breaks down into micro particles. We are surrounded by micro particles of rock all the time.  Our bodies can obviously cope with them.", "label": 1}
{"text": "Adenosine (tired hormone) receptors in brain receive the adenosine, and since their hormones, the brain realises that it needs rest, so you get tired. Correct me if I’m wrong I don’t know a whole lot about it but I’m pretty sure that’s why, and that’s how caffeine works, by blocking the adenosine receptors.", "label": 1}
{"text": "I mean, the poison is in the dose. Oxygen will fuck up your lungs if you constantly have 100FiO2", "label": 1}
{"text": "You’re ignoring how the poison can also be the length of exposure, even with small doses. \n\nA single cigarette won’t kill you; a single cigarette a day over decades is likely give you cancer.", "label": 1}
{"text": "If you worry about plastic, just buy glass containers from now on. You can keep them for many many years if you are careful.", "label": 1}
{"text": "This may be silly, but if there was a way to make the circle smaller while the process is happening wouldn't that speed it up substantially?", "label": 1}
{"text": "*The Mythical Man-Month* (1975) by Fred Brooks. \n\nTLDR; To make games faster, studios should make themselves **smaller**!", "label": 1}
{"text": "Where do you imagine it goes?", "label": 1}
{"text": "That makes sense.", "label": 1}
{"text": "So what's your point? That microplastics aren't dangerous? That they are? I understand my other comment was downvoted, but my point was: what is your goal here with this comment? Why are you arguing with the guy saying that asbestos is bad for you?", "label": 1}
{"text": "My question is why is he bitching about it if he’s not even going to answer it in the first place", "label": 1}
{"text": "Least brainwashed by the state propaganda propagated by the corrupt dept of education which since its inception has only seen the iq of the country fall. \n\nCarlin called it. The iq drops a few points every five years but you’re fooled by bureaucracy.\n\nI’m more competent than you will ever be in your life. I can play chess blindfold. Play multiple musical instruments. And see through government propaganda but yes please lecture me on how much better off you are with state indoctrination.", "label": 1}
{"text": "This is middle school biology. \n\nDNA is stored in chromosomes and those are inside the nucleus of each and every cell. \n\nDNA is small. It is literally molecular scale:\n\nhttps://th.bing.com/th/id/R.f2449a41d01f4e3bdfb11c3a477443f1?rik=ZW5GGf7JyKepgg&riu=http%3a%2f%2frosalind.info%2fmedia%2fproblems%2frevc%2fDNA.png&ehk=M3241SOCDmAY7MyjcbN3hO%2bEGgapWMZyllQuKX4jgkg%3d&risl=&pid=ImgRaw&r=0", "label": 1}
{"text": "If you are not able to figure out what a groupoid scheme is or an fppf-topology, then you probably don't have the skills to really understand a stack yet. It just takes time and effort to learn this stuff, there isn't really a shortcut.", "label": 1}
{"text": "We’re here for a good time not a long time", "label": 1}
{"text": "That the evidence is tenuous at best and some of you like to make blanket statements with no backing or context. Thats how we end up with legislation like California saying everything gives you cancer. \n\nSilicosis is real, should I stay away from marble counters because of microsilica? Calm down and think a little critically next time. \n\nOr what are you saying? That we’ll all die from it and should ban marble tops? wHaT iS yOuR gOaL hErE?!?¿", "label": 1}
{"text": "The evidence of asbestos causing mesothelioma is tenuous at best? \n\n\nOkay, glad to know I wasted my time commenting with an idiot.", "label": 1}
{"text": "https://www.reddit.com/r/explainlikeimfive/s/9MlZRyf73e\n\nGood answers there.", "label": 1}
{"text": "[https://www.reddit.com/r/explainlikeimfive/comments/kczvyw/eli5\\_how\\_does\\_a\\_dishwasher\\_save\\_more\\_water\\_by/](https://www.reddit.com/r/explainlikeimfive/comments/kczvyw/eli5_how_does_a_dishwasher_save_more_water_by/)", "label": 1}
{"text": "Usually there is no objective difference, but increasing prices of necessities to adjust to high demand during a disaster is seen as an ethically bad thing. However, if prices stay low that means the supply is also low, which is where the government SHOULD step in and provide some relief. Such as diverting shipments of essentials to places impacted by natural disasters to increase supply.", "label": 1}
{"text": "It’s not just Americans.  And many Americans use bidets.\n\nIt’s not unhygienic as scene by the lack of constant fecal born diseases.\n\nClean your ass however you want and get over yourself.", "label": 1}
{"text": "Less internal pressure due to opening the can?", "label": 1}
{"text": "I was gonna reply in more detail but fuck it. You have no interest in discussion, you just want to win. Ok, you win. Pasta can be cooked at any temperature with any amount of water with no effect whatsoever on the result.  ", "label": 1}
{"text": "An algorithm is when a programmer defines a set of rules that are automatically applied to a data set by a computer. You will hear it often in context with social media. Facebook defined an \"algorithm\" (= some instructions) which posts of other users should show up on your personal feed. Showing all is too much, because there are so many. So they want to show you only the ones you most likely will have interest in by default.\n\nThere are many different technical ways to define those instructions. Some more modern ones include so called \"machine learning\" or \"AI\".\n\nThe more problematic issue with \"algorithms\" is not so much the technology. Algorithms in themselves are not good or bad. They just do a job a software developer programmed them to do. The issue is that e.g. Facebook (and others) continue to tweak their algorithms. Their goal is to make you like posts and share them as much as possible. Sadly they found out that posts that anger you are more likely to get a comment or share from you. This can lead an algorithm to be designed to show you more content that angers you, to drive engagement. Sadly that can have severe side effects that have nothing to do with technology. Mostly on your mental health, our society at large, etc.", "label": 1}
{"text": "No, I am taking your personality at face value. Anyway, the comment was never directed at you, so fuck off I guess?", "label": 1}
{"text": "You are so wrong it's hilarious. You're not half a smart as you think you are dude.", "label": 1}
{"text": "lol you don't have to accept it. Just pay for your shit.", "label": 1}
{"text": "The way he generated the prime wasn't true in general, so claiming 7 must he prime is false. It just happens to be prime but that generator is not guaranteed to give us a prime", "label": 1}
{"text": "This tent, they made it for a twin bed, one that’s just about 38 inches wide. And your bed, it’s kinda bigger at 42 inches, right? So, here’s where things get a bit weird. This tent might be just a little snug, or it might not even fit at all. Picture it like trying to squeeze into shoes that are a size too small. You can kind of make it work, maybe, but it’s not exactly gonna be comfy or really fit right.\n\nNow, tents, they usually kinda cling to the edges of a bed. And if those edges are wider than expected, then the tent might warp or sag in some awkward way. Honestly, at that point, you could end up with flaps hanging off the sides - just a bit odd-looking. It's almost like if you tried to put a twin bedsheet on a full-size bed. So, yeah, it’s not exactly meant to stretch out that way.\n\nIs it doable? Sort of, maybe, in a way, if you don't mind things looking a bit funky. But is it, you know, ideal? Not really.", "label": 1}
{"text": "Long running devices build up digital cobwebs and a power cycle clears the cobwebs.", "label": 1}
{"text": "Building on that, a typical work day is 8 hours.  \n  \nMost people don't work out that much. And ones that do, often end up with similar injuries and ailments.", "label": 1}
{"text": "And you also plan recovery days for those muscles to build back and work them in groups. The people that have to work and do the same strenuous thing for 5 days straight don't get much recovery time", "label": 1}
{"text": "As someone who’s working in construction, my guess is that people don’t tend to stretch their body after their work day which will cause problem on the long run. And  There’s the thing they dont work adequately and don’t take time to have better posture when working", "label": 1}
{"text": "Prime numbers are like questions that have never been asked before. Sure, as more people ask more questions there are less and less 'new' questions but because of the questions people have asked, that leads us to ask questions we couldn't have asked before!", "label": 1}
{"text": "Did you pick up any STI?", "label": 1}
{"text": "The hardware is designed to run those instructions.\n\nThis is probably the best resource on the topic:\n\nhttps://www.nand2tetris.org/\n\nhttps://www.youtube.com/watch?v=LqirVc5SlW0&list=PLrDd_kMiAuNmSb-CKWQqq9oBFN_KNMTaI", "label": 1}
{"text": "As a city planner, I can explain the American reasonings behind this type of (bad) design; maybe it'll also apply on your side of the pond?\n\n\nThere's a mix of a few things at play here:\n\n\n\n* Some architects and planners in the early/mid 20th century tried to work with nature, making roads follow natural contours and features rather than just forcing grids on top of everything. These were usually high status figures like Frank Lloyd Wright, and so other developers began to imitate their curvy street plans even on flat ground where there wasn't any natural topography to work around.\n\n\n* People decided at some point that their entire neighborhood should be private space, and others shouldn't use it even to walk through. Confusing and disconnected street and walkway networks were marketed as a way to keep \"others\" out.\n\n\n* Lack of good planning by local governments -- making a development connect well to what's already there and also provide opportunities for the next future development to connect well requires that the local government have good plans and regulations pushing these things. It's easier to just say \"you can connect to the main road at this point here, and then the rest of your development is an island that doesn't have to connect to anything around it.\"\n\n\n* Homogeneity / sameness - large-scale developers often just do the same thing over and over again. Even if the roads don't have to curve to follow the land, curvy streets are part of their practice and brand. Even if you personally don't value exclusion of others, too bad, they're marketing that as a feature whether you want it or not. Even if the local government wants connectivity, the developers want to come in with the same disconnected site plan they've done in ten other places: connecting with the surrounding context makes copy/paste harder.", "label": 1}
{"text": "Sounds like you should get a girlfriend", "label": 1}
{"text": "Poll taxes are illegal in the United States.  Maybe your Constitution doesn't care about poll taxes, but we do down here because they have traditionally been used to discriminate against minority communities and the poor.  $60 to buy an ID that is required to vote courts have found is a poll tax.  Which are illegal. This is not a hard concept to understand but conservatives play dumb.  Because the whole point is to disenfranchise those people but they can't say that.\n\nSo if you still don't understand why charging people $60 to vote is immoral and wrong then I take it you're a reactionary who is arguing in bad faith.", "label": 1}
{"text": "Nobody opposes voter ID laws if the IDs are free of charge, but they aren't made free of charge. How the hell do you not understand this simple thing?  These laws are made to disenfranchise poor people. They don't make the ID free. They make it borderline impossible for certain people to get.  You just don't want those people voting so you don't care.\n\nSo are you stupid or do you just not want poor people voting? It's one or the other", "label": 1}
{"text": "In summary, machine code is transformed into hardware actions through a series of decoding steps that generate control signals, which then direct the various hardware components to perform tasks based on those instructions.", "label": 1}
{"text": "Fuck both of you", "label": 1}
{"text": "In my opinion, it's because there isn't a strong paradigm to view construction as if you go to the gym every day. Pre stretch, post stretch, eating clean, and live as if you're an athlete. Because we are athletes and our jobs are very physical. I think if we did these things and made a cultural lifestyle change, we would see less of these hobbled old heads in our industry.", "label": 1}
{"text": "At a tough job, you do the same moves over and over, which wears your body out. At the gym, you exercise for a short time, then your body gets to rest and grow stronger", "label": 1}
{"text": "Planes fly at similar speeds because it saves fuel and helps them get to places quickly. If they flew slower, it would take longer and use more fuel. If they flew faster, they would use too much fuel. \n\nSo basically they pick a speed that’s just right", "label": 1}
{"text": "A dishwasher uses special sprays to clean dishes with less water by shooting it really fast. It also recycles the water, so it doesn’t need as much as washing by hand", "label": 1}
{"text": "Buy fresh onions and prepare them yourself. Unless you're actually 5 then let your mom do it and make sure she washes her hands after using the toilet.", "label": 1}
{"text": "Ngl if you gym the wrong way it can fuck you up too. Most gym people won't admit it though.", "label": 1}
{"text": "I just want to say that I fucking love this thread and the thought people are putting into their answers.\n\nBaseball is the best.", "label": 1}
{"text": ">People want life to be fair and everything to be fixable with the right environment, but unfortunately it's not.\n\nIt is fixable to a huge degree with environment when it comes to the lower end of the scale. Better nutrition, education, toxic stress, less exposure to pollution etc can be the difference between being mentally challenged and being average.", "label": 1}
{"text": "That's a better mindset to have regardless if it's true. Having a growth mindset helps you learn.", "label": 1}
{"text": "Probably because your teacher thought it was a sextagon, and was not mature enough to say it without snickering.", "label": 1}
{"text": "data harvesting name/address perhaps? Or it adds sales count to a store? I dunno really.", "label": 1}
{"text": "My guess would be that they're getting away scamming the first XXX people who try to order one but the AliExpress catches on and cancels all the orders after that and refunds them. Could also be that AliExpress just refunds everyone who falls for this and considers it a cost of doing business for them. The scammers can't be caught because they're in some far flung destination with a shady government, but AliExpress would lose more money trying to stop those scammers from getting seller accounts in the first place than they do from just refunding the people who get scammed.\n\nIt could be 100 other things too but that's my first thought.", "label": 1}
{"text": "Honestly, no clue OP.\n\nI do the same thing all the time, and the only thing I can think of that makes it happen is that I have a low level of stress about needing to wake up early, so I wake up periodically to check how long I have.\n\nOften times I wake up 20 minutes before my alarm.  Idk why.\n\nI’m not sure if there is a sufficient explanation, and I hope someone chimes in with one because I’m just as curious as you.", "label": 1}
{"text": "What the fuck is a heptagon?", "label": 1}
{"text": "Well for starters most people in physical jobs aren't warming up, lifting with correct form, resting and treating injuries until they've healed, taking care of their diet and insuring they're getting good sleep. If they are doing all those things their body probably won't wear out.", "label": 1}
{"text": "There are places in the UK where you can simply cross a bridge and the local accent changes dramatically.", "label": 1}
{"text": "Discretionary military spending following wars and social security for older Americans as required spending has also dramatically increased.", "label": 1}
{"text": "Bruh, you have different accents within the same city. They sometimes change neighborhood to neighborhood.", "label": 1}
{"text": "Why do AI eat other AI and spit out shit like this?\n\nThis can't be a human, can it?", "label": 1}
{"text": "Actual 5 year old in the comments", "label": 1}
{"text": "\\> Is time a man made concept?\n\nHonestly, not more than space is a man made concept.", "label": 1}
{"text": "If you don't like the idea of something having always existed, you're not going to find a Bible very satisfying.", "label": 1}
{"text": "My first water table is 7ft. I thought I was going to dig a huge, deep pond and I ended up with a huge deep ditch because i couldn’t go more than 5ft.", "label": 1}
{"text": "I’m no scientist but I do have a very mechanical brain and the thing that makes the most sense is the theory that the universe is in a constant state of expansion and collapse\n\nBig bang which causes expansion which at some point decays and starts collapsing into a tiny, very dense entity which then eventually explodes and on and on forever. \n\nIt doesn’t answer the question of where it came from of course.", "label": 1}
{"text": "Part B ) Does is actually even matter?", "label": 1}
{"text": "A bunch of moms with too much time on their hands, thinking they are doing their part. All being supervised by a minister, who probably gets paid way too much, that isn't very honorable but thinks he is.", "label": 1}
{"text": "People on ships ate hardtack because it was a hard bread that didn’t go bad. It was easy to keep for a long time. Fishing was tricky. Sometimes the weather was bad, or there weren’t enough fish. Not everyone could fish, either. So, hardtack was a safe food to have on the ship!", "label": 1}
{"text": "When you vote, your choice is kept secret! The barcode on your ballot helps make sure it’s yours but doesn’t say what you picked. You sign the envelope to show you’re allowed to vote, but once your ballot is inside, no one can see your vote. So, even with these steps, your vote stays private and safe!", "label": 1}
{"text": "Ballistic missiles go really, really fast and fly high up, but they follow a straight path, so it's hard for them to hide. They can use some tricks to make it a little harder to find them, but they can't be as sneaky as a plane. So, while they can try to be less visible, they won't be as stealthy as planes like the F-35.", "label": 1}
{"text": "Working a physical job, like construction, can be tough on your body because you’re lifting heavy things and doing the same movements a lot. This can make you feel sore and tired over time. Going to the gym is different because you can focus on specific exercises and use good techniques. You also take breaks and let your muscles recover. This helps you get stronger without wearing your body out. So, while both jobs involve physical work, the gym is a great way to stay fit and healthy in a balanced way!\n\n4o mini", "label": 1}
{"text": "Yes, time is something people made up! We use clocks and calendars to keep track of when things happen, but it all comes from natural things like day and night. So, while nature has its own rhythms, the way we measure time is created by us.", "label": 1}
{"text": "You're just plain old, flat out wrong. \n\nYou don't understand the concept of proof by contradiction. \n\nYou don't understand the concept of a prime number. \n\nYou don't understand the concept of proof. \n\nAre you trolling? Or are you one of those morons who can't admit when they're wrong? \n\nI'm betting on troll.", "label": 1}
{"text": "\"yes, I know they were built\"\n\nYes, the roads really did get built, and by people no less. Can you imagine it? Real people operating real tools and machines, really, actually building roads, over time. It was crazy man", "label": 1}
{"text": "Got coke blown into his butt.  Or vice versa?", "label": 1}
{"text": "Do they cost an arm & a leg?", "label": 1}
{"text": "For the same reason [this](https://www.drugs.com/article/top-10-most-expensive-drugs.html) link exists. Because it’s something you can charge a shit ton of money for that people will still pay. Woohoo capitalism", "label": 1}
{"text": "**Please read this entire message before taking action.**\n\nYour thread has been removed for requesting a “how to” or instructional.  Please familiarize yourself with the rules, and try a how to related subreddit. \n\nGood luck!\n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1ghrh1n/eli5_how_do_i_teach_my_friend_that_every_fair/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20does%20your%20post%20differ%20from%20your%20recent%20search%20results%20on%20the%20sub:) and we will review your submission. Note that **if you do not fill out the form completely**, your message **will not be reviewed**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "They said \"CAN\" remember. I misread it as \"can't\" at first too and was like, \"Did they even read these comments?\"", "label": 1}
{"text": "ELI5: why do you have long lines for voting. Why are the lines often longer in black or latino communities.  Why are districts gerrymandered. \n\nQuestions I ask as an external observer in a country with compulsory voting where most booths have at most a fifteen minute wait.  I mean longer waits do happen, but an hour would be extraordinary, and in fact when I was electoral officer in charge of a booth that DID have an hour wait I was walking down the queue letting people know that the booth 1.5km down the road had no wait at all.\n\nLarger population or population density arent the answer, there are numerous counterexamples of that.\n\nIt's entirely political will to fix it, and/or political reasons for it existing in the first place.", "label": 1}
{"text": "The real question is 'why are there long lines?\"", "label": 1}
{"text": "**PLEASE READ THIS ENTIRE MESSAGE**\n\nYour submission has been removed. ELI5 does not allow questions asking for reddit help, or questions about reddit itself. If you are asking about ELI5 and its rules please go to r/ideasforELI5.\n\n**If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Can%20you%20review%20my%20thread?&message=Link:%20/r/explainlikeimfive/comments/1ghsk7v/eli5_big_o_notation_and_whywhen_it_is_used_really/%0A%0APlease%20answer%20the%20following%203%20questions:%0A%0A1.%20The%20concept%20I%20want%20explained:%0A%0A2.%20List%20the%20search%20terms%20you%20used%20to%20look%20for%20past%20posts%20on%20ELI5:%0A%0A3.%20How%20is%20this%20post%20unique:) to request review of this removal. Please note: If  the form does not appear (which is common for mobile users) or if you do not fill out the form completely, we will reply asking for that information before processing your request.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeimfive) if you have any questions or concerns.*", "label": 1}
{"text": "only thing that put \"nation on the edge\" was the fake regulations and measures taken. covid was just a flu. try to live with that. bye ;)", "label": 1}
{"text": "Good question! It’s wild how the system ensures anonymity despite the barcodes and signatures. The key is separating your identifying info from the actual vote during processing. Still, it makes you wonder how tight the security really is!", "label": 1}
{"text": "that's not important, what's important is making sure rich people can go on joyrides and money that could go to the less fortunate, afflicted and suffering goes to NASA and SpaceX, so that humans can spread bigotry, hatred, trauma, inequality, corruption and cronyism across the universe\n\nOccupy Mars and all of space exploration is nothing more than a clever way to obsess over money and ignore all the problems created by those in power and aided-and-abetted by *\"the educated\"*", "label": 1}
{"text": "I believe that some people are just more prone to addiction, and habit\n\nI work with a guy who used to vape, but when he found out he was allergic to the 'juice', he switched over to smoking... I'd say for him, probably just a habit, something to keep his hands busy.\n\nOthers, the dopamine (or whatever) in the brain, takes over and causes people to need that rush\n\nThis is just my opinion", "label": 1}
{"text": "Do you happen to have a map handy?", "label": 1}
{"text": "By that logic why didn’t they colonize Eastern Asia and sub-Saharan Africa? \n\nWhy didn’t they colonize the whole world?", "label": 1}
{"text": "I also struggle with this. I’ve found that the best way to refresh after work is to get a little exercise. Doesn’t have to be much. Just something to let you see the sun and get your blood moving. Afterward I’m usually able to do one or two of the things I wanted to do that morning", "label": 1}
{"text": "I think they already got enough wars and not enough personnel (soldiers) (even if a lot were already child kidnapped slaves)", "label": 1}
{"text": "Just a bit sad you yourself had to move the goal posts. Or should I say delete? Just like you did with your comment", "label": 1}
{"text": "You shouldn’t joke about suicide", "label": 1}
{"text": "I'm guessing there's a database somewhere with 1-2 second segments of every song owned by X label.\n\nThe segments will be made up of a bunch of values between -128 and 127.\n\nSo imagine a segment looks like a graph of values between those two extremes.\n\nI'm guessing they sample every nth value as the chances of those combinations being unique to a segment are high enough that it isn't worth storing the whole range of values.\n\nWe can call the collection of samples in a segment the fingerprint of the segment\n\nWhat they then do is perform a one way hash, this is basically a way of turning that fingerprint into a single unique key\n\nThis unique key is the deciding factor when searching for your song. \n\nWhat's special about this key is that it can potentially be a massive number. \n\nLet's say 1029383848383. Or 3, or 494, \n\nEvery possible segment has its own unique number\n\nImagine let's say you have Shazam listen to your song,\n\nIt takes in five segments\n\nEach one is used to trigger a search in the database. The same approach can be used to create the keys we use to then perform the search\n\nNow imagine your database is a gigantic book with a trillion pages  with each page pointing to a unique segment\n\nThe page numbers match that unique number we were talking about.\n\nSo all we have to do is browse to the right page right?\n\nThat might potentially take ages right with a trillion pages \n\nNot so if we remember how fast modern computers are.\n\nThere are also optimisations that can be made to the search\n\nA quick way of explaining is imagine we want to find a page in a dictionary for giraffe\n\nTo start we open the page right in the middle and ask is giraffe before or after the middle\n\nIf the answer is before then giraffe must be in the first half which is obvious because the middle of the dictionary will be around the letter j\n\nOkay so what now we'll we repeat the process again looking at the middle of the first half of the dictionary again asking the question whether it's higher or lower\n\nThis time it's higher, okay we need to repeat the process for the second quarter.\n\nThese comparisons continue until we've reach the correct page and then the correct word\n\nIf we go back to the book with a trillion pages the same process is applied using the order of page numbers  instead\n\nSo let's say your key is just below half a trillion, well you'll look at the first half, second quarter and so on until you land on the page\n\nWhy do this? Well if you think about it the number of comparisons we make falls down to the number of times you can divide a trillion by 2\n\nThis works out to be around 20 times so your computer just has to perform 20 comparisons which makes this search super quick.\n\nOkay so let's say we find the correct page for the segment what's next?\n\nWell the pages for each segment will have the info of the song the segment comes from \n\nAll your application needs to do at that point is follow the link and feed back the information to the client\n\nThat's it or at least how I'd implement a basic version of it.\n\nI bet Shazam has some next level stuff because they have to deal with the challenge of serving responses to millions of requests a second", "label": 1}
{"text": "My guess is that Quebec always has their special status since the end of French and Indian War, which directly contributed to the founding of United States.", "label": 1}
{"text": "Didn't realise aliens paid, couldn't they enter for free using their UFO?", "label": 1}
{"text": "Whatever you do, don’t deposit any real money to gamble. Sports books LOVE people like you.", "label": 1}
{"text": "That’s the way it used to be. There were a flurry of laws passed by GOP-controlled states prior to the last cycle. \n\nMail-in ballots tend to favor Democrats, for a variety of reasons. \n\nThis is why there has historically been something known as the “red mirage / blue shift”, in which early results lean Republican, but overnight, as more mail-in ballots are counted, results shift to Democrats. \n\nGiven that states were loosening restrictions on who could vote absentee for the last cycle, these new GOP-passed laws severely exacerbated the red mirage / blue shift. \n\nThis, in turn, drove an unprecedented amount of “stolen election” conspiracy theories. \n\nSo, you might ask, why did the GOP do this? Shouldn’t they have known that it would fuel the fires of conspiracy theories and lead to greater distrust in the legitimacy of our elections?\n\nThere are two schools of thought here. \n\nOne is “it was an innocent mistake and they failed to understand the consequences.”\n\nThere’s another school of thought that goes like this:\n\nTrump and his team were planting the seeds of “if we lose, it means the election was stolen” several months before the election. In fact, the phrase “stop the steal” was bandied about well before November 5th. \n\nThat was the kindling. \n\nthe law delaying the counting of mail-in ballots was the accelerant. \n\nJanuary 6th was the conflagration. \n\nTL;DR: many people believe that these laws were a cynical ploy to keep Trump in office.", "label": 1}
{"text": "But do anorexic people want to die?", "label": 1}
{"text": "That is a very good question I have never thought about.  And I'm sure there are a number of ways.\n\nThe first on that come to my mind is you make some kind of lock system. You have an area that you can close off and fill with new water, and have check valves to stop to it just to be keep backfilling up with the current working water.  Then release it into the system either gradually or all at once depending on the design.", "label": 1}
{"text": "Before Covid mail-in ballots were usually for people who had a valid reason they might not to be able to vote in person on election day (out of town, difficulty getting to poll, etc.)\n\nWith Covid, a lot of places loosened the restrictions so almost anyone can vote early or by mail. Now the absentee/overseas ballots are a bigger deal because there are so many more.", "label": 1}
{"text": "> I just don't think this specific measure is needed and does more harm than good.\n\nThere's no evidence some of the things you support are needed, either, and yet you support them. And there's no evidence that voter ID laws would do more harm than good. We already went over how the disenfranchisement is a completely made-up problem.\n\n> And I don't think your accusation of this argument being inherently partisan is as much of a gotcha as you think it is. In fact, for me, I don't think it should be a partisan issue at all. Indeed, it's the GOP that's made it so.\n\nAmerica is virtually the only developed democracy that doesn't have voter ID laws. Most Americans support voter ID laws. Who opposes it? A specific wing of the Democratic Party.\n\nOf course it's partisan, the Democrats have made it partisan by making it about race when it's not and never has been about race.", "label": 1}
{"text": "And this, in turn, raised the alarm bells for GOP politicians and political scientists who feared that making absentee voting easier might increase the turnout of Democratic voters.\n\nObservers who share this theory also point out the decision by the Trump administration to dismantle mail processing equipment and slow mail deliveries prior to election day.\n\nA neutral observer might notice that given their advance knowledge of the stress on the mail system that the explosion of mail-in voting would cause, this would be the *worst possible time* to take active steps to slow down mail delivery.\n\nOthers see this as just another tactic to help Trump remain in office.", "label": 1}
{"text": "I'll Venmo $5 to the first person who makes me laugh with a your-anus joke... (I just finished a double shift and can't think of one)", "label": 1}
{"text": "Well I believe there’s life in Uranus but we really need to probe deeply?", "label": 1}
{"text": "Ahh Uranus. The butt of all space jokes.", "label": 1}
{"text": "Of all the moons around Uranus, the one with the piece of corn has the best chance of harboring life.", "label": 1}
{"text": "More Republicans are early voting than Democrats this year, because Repubs have changed the messaging, so for now they probably won't. If anything they might look for a way to discount on the day votes.", "label": 1}
{"text": "The main reason is the scientists would be giggling too much at the endless \"your anus\" jokes to be able to do sciencey stuff properly.", "label": 1}
{"text": "That not true. More republicans are voting early than did in 2020, but the number of democrats voting early is still greater than republicans by a factor of almost two to one.", "label": 1}
{"text": "I really hope that's true, I will need to double check the stats when I next see them pop up.", "label": 1}
{"text": "Maybe it's my cynical nature but I have to wonder if this switch to wanting republicans to vote early is because they've figured out a way to cheat that part of it and it would be too obvious if they had been against it?", "label": 1}
{"text": "Because they are controlled by Republicans.  Republicans want a rush to count votes to give them more opportunity to cheat in the chaos. ", "label": 1}
{"text": ">Before Covid mail-in ballots were usually for people who had a valid reason they might not to be able to vote in person on election day (out of town, difficulty getting to poll, etc.)\n\nThis varied wildly by state. I’ve been a permanent absentee ballot voter for my entire life here in California and my first election was in 2008.", "label": 1}
{"text": "One of the most idiotic comments here. Congratulations, that surely is an achievement", "label": 1}
{"text": "None of the moons can support life because of the gas in Uranus", "label": 1}
{"text": "> In fact, the phrase “stop the steal” was bandied about well before November 5th.\n\nI could be misremembering, but there were *Stop the steal* websites registered before the 2016 election.", "label": 1}
{"text": "I don’t just want the schedule filled, I want specific people on at a specific times to fill specific roles.", "label": 1}
{"text": "And now Republicans have gerrymandered the fuck out of house districts so now the regressive fucks get disproportionately large representation in both chambers.", "label": 1}
{"text": "The Montessori method of education is a type of educational method that involves children's natural interests and activities rather than formal teaching methods. A Montessori classroom places an emphasis on hands-on learning and developing real-world skills.[2] It emphasizes independence and it views children as naturally eager for knowledge and capable of initiating learning in a sufficiently supportive and well-prepared learning environment.[3] It also discourages some conventional methods of achievement, such as grades and tests.\n\nhttps://en.m.wikipedia.org/wiki/Montessori_education", "label": 1}
{"text": "Alcohol.", "label": 1}
{"text": "In addition to all the other comments:  [He has a very good dog. ](https://youtu.be/3hNXCbSDBvc?si=FxfaNc447i3lZAZR)\n\nApparently this reply will be automoderated from ELI5 unless I explain more. So let me say: He has a very, very good dog. Such a good boy.", "label": 1}
{"text": "Here is the top answer to this question from 1 year ago:\n\n[Eli5 What is Montessori learning??](https://www.reddit.com/r/explainlikeimfive/comments/15nou6m/eli5_what_is_montessori_learning/)\n\n\"It's basically how all pre-school learning is done. You provide access to activities that allow the child to participate in self-directed learning.\n\nFor example, you know those bead and string sets, well in Montessori you'd show the child the set and observe how they choose to play with it. Maybe they'll thread the beads onto the string, or maybe they'll sort the beads by shape or colour, maybe they'll throw the beads at their sister and blame it on the dog. Either way, you observe the behaviour and you encourage the good things they're doing. You don't force them to do things one way.\n\nIt makes more sense in a group setting, where traditionally kids are encouraged and often forced to behave and interact in a uniform and proscribed fashion. To go back to the beads and string example, making all of the kids thread their beads in a specific pattern to teach them fine motor and pattern recognition skills. Montessori developed as a counter to that style of learning.\"", "label": 1}
{"text": "What has happened to this sub, and Reddit in general? it seems like Reddit is now populated by actual five-year-olds, who have never asked their parents a basic question. How can a person who knows the word “parallel” not know that the definition of parallel is two lines that will never meet?", "label": 1}
{"text": "The Dotard and all the right-wing propagandists were all on message weeks before the election pushing the narrative that votes coming in after the polls closed are illegal because they missed the deadline. \n\nAnd Trump in 2020 kept insisting that a winner must be declared before midnight. \n\nAll these right-wing politicians and their propagandists knew that delaying the counting of mail-in ballots opened up all sorts different avenues to cast doubt on the election results weeks in advance. \n\nThe propaganda was successful too. A lot of people saw Trump’s “huge lead” disappear late into the night once the mail ins started being counted. And they were all like “Trump was right! He told us they’d steal the election after the polls were already closed!”", "label": 1}
{"text": "You cut it up on the spot and haul the pieces back to your vehicle. Hopefully, you have buddies to help you.\n\nHunting is hard ass work.", "label": 1}
{"text": "No one can explain it with certainty yet, but there are a lot of theories. r/astrophysics, r/space and r/astronomy are some good places to check out. My favorite theory is quantum perturbations that gave rise to the energy required for the universe to exist. We know that virtual particles exist and pop in and out of existence all the time...I think that the universe started because this process happened on a scale that is hard to wrap your head around. Out of seemingly nothing, came everything. Although, the concept of \"nothing\" doesn't exist in the universe, as even empty space is never empty due to these virtual particles.", "label": 1}
{"text": "Art. That simple.", "label": 1}
{"text": "When you mooned me with Uranus, I saw signs of life", "label": 1}
{"text": "Shakespeare: you brought this horrible situation on yourself by repeatedly making the worst choices possible\n\nGreek tragedy: you tried your best to avoid a horrible situation and you just made it worse, you should have given up and let yourself suffer, idiot", "label": 1}
{"text": "why vote, CIA still makes the NATO/woke/WW3 supporters win by rigging the election counts again", "label": 1}
{"text": "\"I read past the headlines and imagined my own narrative without looking at the big picture at all because i have to force election fraud in there somehow\".\n\nI never said they were perfect. What i said, and what all experts agree, is that the elections were SECURE. Not perfect, but secure. You are too stupid to understand that every election has some discrepancies. It is about impossible to collect millions and millions of votes, in 50 states that each have their own way of doing things.. which is of course idiotic but i can guess you love that chaos.\n\nYou have not shown ANYTHING to prove that the elections were not secure. Each of your sources SAY SO, you fucking traitorous moron.", "label": 1}
{"text": "I think it's more that Iowa is a fairly solid red state, if it flips blue then it's a good sign the other swing states will follow", "label": 1}
{"text": "Why tf would America want them lol?", "label": 1}
{"text": "Steroids age the crap out of you", "label": 1}
{"text": "The STI is crafted through a meticulous assembly process at Subaru's specialized manufacturing facilities in Japan. Engineers and technicians work to ensure high performance by focusing on the car’s core components, including its turbocharged engine, advanced all-wheel-drive system, and reinforced chassis. Every STI undergoes rigorous quality testing, including dynamic performance assessments to confirm that it meets Subaru's standards for handling and power. Once production is complete, the STIs are distributed globally to select dealerships, catering to a dedicated fan base that values the car's rally-inspired capabilities and reliable engineering.", "label": 1}
{"text": "A large part of it is that Republicans have spend decades systematically obstructing access to voting in an attempt to disenfranchise minority groups. If you have to wait in line for four hours but you are only given an hour off of work, you probably won't actually get to vote.", "label": 1}
{"text": "Pretty simple. You have one political party making it their mission to mess with people who want to vote for the opposition.", "label": 1}
{"text": "Oh stop being pedantic. Its ELI5, not advanced number theory in a post-grad course.\n\n\nIf your ELI5 requires another ELI5, you aren't doing ELI5.", "label": 1}
{"text": "It's crazy how many people are all of a sudden experts on pollsters lol", "label": 1}
{"text": "I had to show ID when I voted in Texas. But got to walk right up and vote right away. Might be busier if you live in a huge city. ", "label": 1}
{"text": "Where I live in NJ I've never had to wait more than 3-5 minutes. Lines are on the news and social media because they're exceptional, normality doesn't get attention.", "label": 1}
{"text": "I ain't no expert; I read and read some more and make my own conclusions based on what I've read. \n\nHow what do you learn‽", "label": 1}
{"text": "The best part of that op is how they say that Canada requires ID to vote. I wonder why that might be 🤔", "label": 1}
{"text": "I have no idea why people choose to stand in a line, I simply got a mail in ballot and dropped it off at the box outside the library", "label": 1}
{"text": "Some states have very few polling places. I have a half dozen locations I can pick from. I have been voting early for probably 20 years and there’s never a line at all.", "label": 1}
{"text": "to those saying its only exception places that is not true..\nMy area in the past has been no line during early voting. \n\nHere,in my case, it has been a hours long line when i went several times and finally the other day went early morning and it was a shorter line \n\nMy point is its way longer lines like op is saying. Its been the way since early voting started and was very long every day..its NEVER been like that.\nWhy? Im not sure", "label": 1}
{"text": "Republicans love to close polling places to make the number of places you can vote very small. So when what used to be 3 or 4 places get combined into 1, you end up with lines. Now it’s backfiring because democrats are more likely to vote early.", "label": 1}
{"text": "It's a way to legally disenfranchise voters.  You're less likely to vote If there's only 1 polling place for half a million people.\n\nSame reason they tried to make it illegal to pass out snacks/refreshments to people who are waiting in the hour long lines\n\nSame reason general election voting day is NOT a national holiday, if you've got to miss time to vote you're less likely too. \n\nIt's all a way to make it as cumbersome as possible to vote", "label": 1}
{"text": "I’ve never had more than 1 person in front of me in line in a federal, provincial or municipal election in Canada.", "label": 1}
{"text": "🤦 oh so you're *that* type of person. \n\nI assume the only sources you decide to trust are the ones that say what you already wish to be true?", "label": 1}
{"text": "Don't forget also the mail equipment dimantling was ordered by the guy whom Trump appointed to run the post office, but got rich running his own rival delivery company.  \n\nSynergy.", "label": 1}
{"text": "If anyone is interested in game theory vis-a-vis Ukraine then William Spaniel is a YouTube channel worth checking out", "label": 1}
{"text": "Here is the top answer to this question from 5 years ago:\n\n[ELI5:Why do you feel tired from thinking very hard although you're just sitting on a chair?](https://www.reddit.com/r/explainlikeimfive/comments/gksuju/eli5why_do_you_feel_tired_from_thinking_very_hard/)\n\n\"The brain is 2% of your body weight, but accounts for **20%** of your daily calorie use\n\nYour brain runs on glucose and glucose levels can be consumed faster than they can be restored during periods of hard thinking.\"", "label": 1}
{"text": "Your skin has multiple layers, each of which is replaced at different speeds.  The tattoo ink is deposited in the deepest layer of your skin (the dermis), which _doesn't_ refresh like the top most layer (the epidermis) does.  The dermis simply heals itself (which is why deep cuts result in scars - the dermis is damaged and scar tissue is how it heals).\n\nMoreover, the tattoo ink particles are very large (from a biological perspective) so your body can't flush them away easily.  Over time, you immune system will break down the ink and clear it away, which is why tattoos fade over time.  The process takes decades, though.\n\nThis is how tattoo removal lasers work.  They heat up the ink particles, causing them to shatter.  This makes them small enough for your immune system to clear them away at a much faster speed.", "label": 1}
{"text": "The body doesn’t know what to do with a piece of steak.\n\nHowever once we break down the piece of stake into its base or core components we end up with different amino acids; sugars; minerals and stuff……this our body knows exactly how to handle", "label": 1}
{"text": "I've always heard this, and my experience has been that that any accident with a sharp blade has hurt me way worse than any accident with a dull one.", "label": 1}
{"text": "Dopamine cannot cross the Blood Brain Barrier, this is why you need a drug that modifies your body's production of dopamine.", "label": 1}
{"text": "It’s not allowed you idiot.", "label": 1}
{"text": "Plastic isn’t used for roofs because sunlight, rain, and temperature changes make it brittle and crack over time. Roofs need tougher materials that last in all weather.", "label": 1}
{"text": "Electricity isn't expensive enough here to make me want to have something as ugly as a solar panel on my house.", "label": 1}
{"text": "Asking for a former president", "label": 1}
{"text": "Your standard for what's considered a scientific \"law\" is... how can I put this? Bullshit.\n\n\nThe world is incredibly complex, nothing is absolutely true, there are shades of nuance to everything.  Spend enough time critically thinking about details and you start to lose respect for cutesy one size fits all trueisms. I fully understand how pressing hard with a dull knife can cause you to lose control and hurt yourself... but don't kid yourself, there's no science here.\n\n\nYou didn't test, you didn't do a meta analysis of data, you didn't read any studies. You parroted a thing you heard.\n\n\nI'm not saying my take is scientific, either, before you go jumping down my pants about my \"perception.\" I'm not even sure what my take is.", "label": 1}
{"text": "\"We'll enjoy you hurting yourself because you're kind of obnoxious\" is a wild thing to say over a reddit disagreement bro", "label": 1}
{"text": "Never ceases to amaze me how much it pisses people off when you question their scout masters.", "label": 1}
{"text": "you can imagine it, i believe in you :)\n\nwe'd boil water or heat up something else that eventually boils water", "label": 1}
{"text": "Bake pizzas, feed pizza to kids, kids run in giant mousewheels, wheels are tied to a giant fan, fan blows on a wind power farm", "label": 1}
{"text": "username checks out.", "label": 1}
{"text": "Wind power farm then heats up a bath tub of water. Water evaporates. Fusion.", "label": 1}
{"text": "Ah yes. The preferred solution.", "label": 1}
{"text": "Quite well researched for a long time now….\n\n\nhttps://m.youtube.com/watch?v=z3OQTU-kE2s", "label": 1}
{"text": "Have you been drinking? This analogy doesn't even make sense", "label": 1}
{"text": "The idea that drinking brings out some repressed personality that we have been hiding from the public and ourselves is not even remotely true. I put as much effort into the anaology as you did the post.", "label": 1}
{"text": "And the sugar in the gas tank comes from where? I spent all my effort trying to understand your nonsense", "label": 1}
{"text": "Well, if I put sugar in a gas tank I’d ruin the car so I would not make that same mistake. However, getting wasted and making a fool of myself and ruining relationships does not stop me from guzzling again.  So, kinda different.", "label": 1}
{"text": "Constricting flow in a narrowing aperture is not the same as \"it's windy.\" But you know better.", "label": 1}
{"text": "It sounds like a difficult situation. Here are some steps to consider:\n\n1. **Set Boundaries**: Make clear boundaries with Z and Z's parents, letting them know what behavior is unacceptable and how you’ll respond if boundaries are crossed.\n\n2. **Support**: Encourage Z’s parents to reconsider seeking professional help, reminding them of the potential safety risks for everyone, including themselves.\n\n3. **Limit Involvement**: If you feel unsafe or uncomfortable, minimize interactions and avoid situations where you may need to intervene. Let authorities or trained professionals handle these incidents.\n\n4. **Document Incidents**: Keep notes of concerning incidents and interactions, as this documentation can be useful if intervention from authorities or social services becomes necessary.\n\n5. **Community Resources**: Suggest local support groups or mental health services to the parents to provide them with resources to manage the situation better.", "label": 1}
{"text": "And acting like a 5 year old.", "label": 1}
{"text": "I've seen it once.  Worst driving conditions ever.  You go from darkness to extreme brightness as the lightning reflects off the snow that is everywhere, then back to darkness.  All the while, it's a slimy wet snow under the tires.", "label": 1}
{"text": "The sugar in the gas tank represents alcohol. This is a decent analogy. Not sure why you're reacting so rudely.", "label": 1}
{"text": "The form of precipitation isn't mentioned in the song.\n\nYou can be Thunderstruck any way you please.", "label": 1}
{"text": "Here's what you need to make that song. \n\n[https://youtu.be/k3zCnTgdLG0?si=CrTC9SOMGS\\_9ry5i](https://youtu.be/k3zCnTgdLG0?si=CrTC9SOMGS_9ry5i)", "label": 1}
{"text": "No thundersnow in Australia.", "label": 1}
{"text": "That’s a load off my mind.", "label": 1}
{"text": "Thundersnow is a thing where I live too. Happens every winter", "label": 1}
{"text": "Wow, this is how I discovered AC/DC is an Australian band, not sure how I never knew that until now lol", "label": 1}
{"text": "ChatGPT's gotcha.  Prompt:  Write a Metallica song about Thundersnow\n\n>**Title: Thundersnow**  \n*Verse 1*    \nDark clouds rollin' in, cold breath of death,    \nA storm’s on the rise, and it takes my last breath.    \nWhite fury descending, a frozen hell's roar,    \nElectric sky clashing, down to the core.    \n*Pre-Chorus*  \nIce shards in my veins, snow to my knees,    \nThe thunder cries out with a cold-biting breeze.    \nHeaven’s unleashed a white lightning blow,    \nWelcome the fury of Thundersnow.  \n*Chorus*  \nThundersnow! Raging skies collide,    \nBolts through the blizzard, nowhere to hide.    \nThundersnow! Storm’s cold embrace,    \nFrozen thunder, nature’s cold embrace.  \n*Verse 2*  \nFrost covers the earth, with electric delight,    \nShaking the silence of endless white night.    \nCascades of snow and fury so bold,    \nLighting the storm in flashes of cold.    \n*Pre-Chorus*  \nThunder and ice, a cruel winter’s glow,    \nNature's wrath rains down in Thundersnow.    \nSound and the fury, white lightning’s might,    \nA battle of gods in the heart of the night.  \n*Chorus*  \n*Bridge*  \nWhiteout horizon, endless and wide,    \nNature’s revenge from the dark winter's side.    \nThe silence shattered, the roar of the beast,    \nUnder the snow’s thrall, I brace for the feast.    \n*Solo*  \n*Verse 3*  \nThe roar fades to whispers, the storm is spent,    \nLeaving a frozen, shattered lament.    \nBut scars remain, where the lightning did blow,    \nMarked by the chaos of Thundersnow.  \n*Chorus*  \n*Outro*  \nThundersnow, electric night,    \nWhere heaven's fury meets frostbite.    \nEchoes fade in the cold below,    \nLost in the shadow of Thundersnow.", "label": 1}
{"text": "I remember reading a short story about how a woman was watching some little kids and got abducted by aliens. The aliens got their a$$ kicked after they tried to mess with the kids. The reason she could do this was her ability to sweat, along with her endurance. The aliens are all fur so they can't sweat and got tired and over heated quickly.", "label": 1}
{"text": "Cuz I didn’t have any sharp ones on hand /s", "label": 1}
{"text": "now do it with Hatsune Miko the OG AI song smith.", "label": 1}
{"text": "I read the title and thought \"this must be theost retarded question I've seen in a while\" started reading the comments and got a nice NO U", "label": 1}
{"text": "What i think happens is, there are far little ambient sounds in a library than outside. Our tones increase with increase in ambient sounds. If we are not able to hear ourselves talk, our tone instinctively increases.\n\nThink about, why, when wearing ear covering headphones, does your voice get louder. My guess is, since you are able to hear yourself  very easily in a library, you dont have to raise your tone.", "label": 1}
{"text": "We DON'T.\n\nWe let the population chill the fuck out.\n\nLet the shareholders take a bath. \n\nWe need to stop using so many resources and sacrificing humanity and the world for perpetual growth.", "label": 1}
{"text": "If predators aren’t better at something than the prey, they wouldn’t be the predators for that prey.", "label": 1}
{"text": "will add on that tools are a part of this; skis dating thousands of years BC have been found and were used for hunting. Humans can’t ski faster than moose but can keep at it for much longer.", "label": 1}
{"text": "Had one so bad that it shook the brake pads off the clippers and dented the tank with the handlebar. \nStayed on but fuck me it was scary!", "label": 1}
{"text": "I think it is mainly having chronically high levels of cortisol. It has a bunch of impacts on your body and I’m not going to list them all so just google “chronically high cortisol”", "label": 1}
{"text": "Patent this idea straight away. It'll make you millions (of Zimbabwen dollars)", "label": 1}
{"text": "This is a wonderful explanation of what is happening. \n\nhttps://youtu.be/Bm7L-2J52GU?si=KcUdK3hte9gIx2V8\n\nTechnology Connections for the win.", "label": 1}
{"text": "Awww...and you're hurt by the truth. Sorry, but people who fight this hard for real diamonds and all of the history they encompass don't get things sugarcoated. It is what it is, and if you find my response uncivil, but don't mind the history of real diamonds, that's a moral issue that I can't help you with.", "label": 1}
{"text": "Nah mostly just a visual confirmation that SOMETHING is happening.\n\nUseful to know you completed post-POST tasks, even if the OS fails to load.", "label": 1}
{"text": "the border of europe and asia/arab is defined by the fact that west of the boundary live civilized people, east from the boundary lies chaos. it is pretty simple way to define what is europe and what are it's boundaries. some politician said couple years ago \"let's extend european union to northern african countries!!!!\". anyway. bye", "label": 1}
{"text": "culture, skin colour and civilization is what separates europe from the \"east\". this is the truth and has always been. bye", "label": 1}
{"text": "Bro. \nDelete this comment.\n\nYour family owns a jewelry store and you proposed with a 1/2 carat second hand diamond you hustled off a man? What kinda cheap ass dude are you? \n\nYour wife may claim she doesn’t care, but trust me. They care. I hope she never finds out. \nGo buy her a nicer diamond my man", "label": 1}
{"text": "Civilized people who invade other countries, call them colonies, and take all their shit.\n\nLOL.", "label": 1}
{"text": "Lol... bless your heart sweetie!\n\nIn my city the hospital system is the largest landowner. They buy up land then let it sit, all while paying $0 in property taxes.", "label": 1}
{"text": "You little redditors keep parroting stuff for upvotes. DeBeers hasn't been doing this for years.", "label": 1}
{"text": "People, usually old people, use it as a socializing time. And not just voters, those old ass election workers too.", "label": 1}
{"text": "Densely populated areas tend to be run by democrats at the local level. They’re the ones who decide whether to use many polling stations or fewer, larger polling centers.", "label": 1}
{"text": "They count the number of blank ballots before they start.  Then they count the number of blank and nonblank ballots after.  If they got more after, they declare fraud.  It doesn’t have to be complicated.", "label": 1}
{"text": "Very much depends. Another commenter used the example of Ohio where it was decided on a state level to give each country one early voting location. Obviously this creates much longer lines in the more densely populated urban (democratic-voting) counties.", "label": 1}
{"text": "This is entirely not true", "label": 1}
{"text": "State level rules often trump (haha) local laws.", "label": 1}
{"text": "Not sure where you live, but that's just not true. States, not counties or cities, have ultimate authority on elections. And they can and do dictate polling locations/hours/etc/mail-by-ballot eligibility/etc.", "label": 1}
{"text": "why are you lying about this? the single locations in ohio were setup by the republican legislature.\n\ni suppose i should expect nothing less from a sleazy republican shill.", "label": 1}
{"text": "The counties decide where the polling locations are, how many workers and machines they’re going to use.", "label": 1}
{"text": "It does happen, to what extent is the question. The idea there only 1 ballot per 1 voter is incorrect. Just recently a woman (and others) was caught depositing mass absentee ballots. Her candidate won 2:1 on mail but had less in person votes. Both were democrats.", "label": 1}
{"text": "Not in all states, and many state run ones have a board that further decides, and counties in all states are responsible for setting up the actual polling location(s), dealing with the workers and machines, based on state rules.", "label": 1}
{"text": "In some places, maybe, but not all. You keep using absolutes as if every state is the same, which they very clearly are not.", "label": 1}
{"text": "And the counties decide where that location is, how many workers and machines they’re going to use, etc.", "label": 1}
{"text": "yup. but the logical answer for hosting 900,000 people is that you need more than one location. as a result voting times were like 2.5hours or more. absolutely appalling.", "label": 1}
{"text": "That just isn't the case everywhere, just because it is in your stste doesn't mean it has to be everywhere, which brings us back to the OP asking why it is worse in some places (where the GOP dictates all of that to keep Dems from voting) than others (the places you are talking about and take for granted that is should be like thst everywhere). For example the counties can't just spend money to rent out a giant facility and fill it to the brim with machines and workers when the state tells them they don't have a budget for any of that.", "label": 1}
{"text": "Ok but it’s still the Republican-majority state legislature that decided one location, even if (and I’d love a source for this claim) that local governments can decide where and how to staff that one location.", "label": 1}
{"text": "State ran elections are state ran and distribution of money to organize comes from the state.  The rules also come from the state.  Sure the local areas can decide where to put the booth but they don’t get to decide how many booths they get.", "label": 1}
{"text": "The reality is that voting is an irrational act. You spend around a half hour (and for some people much more) of your time to travel, wait in line, etc., and you have effectively no chance that your vote changes the outcome of the election. \n\nWhen you add that voter fraud is a crime with significant jail sentence, voting illegally is incredibly irrational. What would it take to meaningfully change an election in a close state? A difference of 10,000 votes would be a very close state presidential election result. The risk/reward of casting 10 illegal votes is just terrible -- it's a risk of up to 50 years in prison for a tiny chance of changing the outome.", "label": 1}
{"text": "They’re responsible for monitoring your vitals and adjusting the anesthetic levels to keep you safely unconscious throughout the surgery.", "label": 1}
{"text": "Can someone explain why anaesthesiologists need to go to med school? It seems like a gigantic waste of time to learn all this stuff that immediately becomes irrelevant once they become an anesthesiologist. I'm sure they'll come up with lots of pomp and self import but let's be honest it just seems like a restraint of trade.", "label": 1}
{"text": "So the county could decide to provide 500 poll workers and 5,000 ballot booths with 5,000 ballot boxes and put them wherever they want? Because something tells me that's not really how it works.", "label": 1}
{"text": "Mods protect pedophiles by removing anything like this post that shines a light on them.", "label": 1}
{"text": "I got my house with my wife in 2019 before house prices really started exploding. We played $113k in a rural PA area. Nice single house, old, but good one. Even at the amount of money, we would have needed to save EVERY. SINGLE. CENT. of our pays for almost two years (factoring after taxes) just to afford the house. And this is an affordable one.\n\nI mean, even if I started saving an aggressive $1000 a month just for buying a house , I would have needed to save for 4 1/2 years just to save my half of the house. That doesn’t even take into account life, food, car payment/insurance, gas, car maintenance, student loans, any kind of going out, clothes, retirement, other savings…\n\nIt isn’t practical.", "label": 1}
{"text": "My guess would be that when youre asleep, atleast half your face is burried in a pillow, meaning oils, sweat, drool, moisture and god knows what else is in constant contact with your face, adding pore clogging makeup to the mix is probably not a great idea", "label": 1}
{"text": "Because if businesses aren’t making money, the economy isn’t moving, and you don’t have a job. \n\nThat’s pretty much it.", "label": 1}
{"text": "Tell me you don't understand evolution without telling me you don't understand evolution ", "label": 1}
{"text": "Spores that can infect the lungs from water damage. Debris from construction material have the same damaging effect.", "label": 1}
{"text": "Why do pollsters say there’s a 34 point gap in voting between men and women regarding the current presidential election? \n\nIm sorry it’s horribly worded, the mods created an overzealous auto mod that took down my posts trying to ask this directly so I had to come up with this shit show to dodge the censors.", "label": 1}
{"text": "Probably because they assume there are the same number of each group, but accounting to the census website, as of the 2022 election, there were 5.6% more women than man that were registered to vote. \n\nEven if what they’re saying made sense, it isn’t meaningful to talk about national polling data, since the national population vote doesn’t matter.", "label": 1}
{"text": "> Ten or Fifteen kilometers? Thanks to GPS, we can tag animals and see **how they roam about on an average day**:\n> \n> \n> \n> Elephants will travel close to 500 km looking for water\n\nRead better.", "label": 1}
{"text": "The best explanations are in 2 episodes of Once upon a time there was life...\n\nhttps://www.youtube.com/watch?v=i-2JRNWKhzA\n\nand\n\nhttps://www.youtube.com/watch?v=9du5MB_1XaU", "label": 1}
{"text": "first, im sorry our education system failed you. but yes its one closed loop that opens up. 1 tube (artery) opens into 2 then to 4 then 16. until you get to capillaries. once the capillary goes back into the larger units (veins) there are one way valves that make sure the blood moves in one direction. the pressure stays the same as long as your heart is pumping.", "label": 1}
{"text": "Oh what happened to your \"*per day**\" part? Remember better.", "label": 1}
{"text": "You are so pathetically confused. I almost feel bad for you.", "label": 1}
{"text": "The cell has a way of tagging proteins to direct them to certain places, and the cytoskeleton serves as a railway to carry them to their destination.", "label": 1}
{"text": "Its funny watching people dance around trying not to say what we all know is the reason. Its because they don't have _____ people. ", "label": 1}
{"text": "You either have to be a nuclear armed government led by complete morons, a very dedicated boy scout, or know the right Yakuza boss.", "label": 1}
{"text": "The low immigrationt rate is one of the most important factors.\n\nComparing to the usa for example, japan has  **0.489 per 1000 population**, south k **0.390 per 1000 population**, USA is **2.768 per 1000 population**.", "label": 1}
{"text": "Yes, why do two countries with super strict migration policies have very low crime compared to those with much higher migration from third world countries. Hmm must be American sense of individualism", "label": 1}
{"text": "Japanese people love to parrot this shit to anyone who will listen, but the truth is there are many countries in the world where you can do this", "label": 1}
{"text": "It’s funny how this is most likely the correct answer, but it can never be acknowledged.", "label": 1}
{"text": ">the main character constantly fret about her honor left and right every other scene based on stereotypical pop culture understanding of Asian cultures, but actual movies and anime’s from China, Korea, Japan, Hong Kong, etc never have characters actually do this.\n\nThat is complete and utter bullshit and tells me you consume very little actual media (or very cherry picked atleast) from those regions. They are chockfull of honor, stoicism, idolizing social norms and fear of losing your social standing and environment. If you think critically about it, it becomes apparent pretty quickly how extreme those themes go and how pervasive they are.", "label": 1}
{"text": "Violent crime would be absolutely related to immigrants, especially in the UK right now. To think anything else is silly.", "label": 1}
{"text": "You give them money so your losses would be financially covered in case of accident or disaster.  \n\nAfter said accident/ disaster, you file a claim and they tell you 1,000 ways to go fuck yourself.", "label": 1}
{"text": "You pay for years then when it's time to actually get help they deny your claim and leave you destitute.", "label": 1}
{"text": "Often times people don't have the money to buy a house.  So they ask a bank for a loan to pay for it and pay the loan back to the bank in installments.  This special type of loan is called a mortgage.", "label": 1}
{"text": "It’s a home loan. \n\nSince it’s secured by the value of the house (i.e. you can’t/don’t keep up the payments, they seize the house), you get better terms (percentage and length) than you would for a car/boat/pinball machine.", "label": 1}
{"text": "In 2024, there's this crazy thing called \"google\". With this service, you can search, or \"google\" very simple questions and get clear simple examples. For example, if you had an easily answered questions like \"what is a mortgage\", you could just type that into Google and get a simple quick answer.", "label": 1}
{"text": "Because the Electoral College is a scam that allows Republicans access to the White House without needed to win the popular vote", "label": 1}
{"text": "The civilians also don't have any guns so thats a huge safety check to limit on the types of crimes that can be committed.", "label": 1}
{"text": "It's not due to one thing. It's \"multi-factoral.\" For example, these are some of those factors:\n\n* Nonresponse Bias: Some groups just don’t answer polls, especially certain political ones. Results end up skewed toward people who do.\n* ‘Shy’ Voters: Some voters, especially for controversial candidates, stay quiet. Pollsters struggle to account for this.\n* Outdated Methods: Landline calls? Really? Younger people ignore these, while older folks answer, messing with age balance.\n* Weighting Woes: Pollsters try to adjust results for demographics, but even small errors can throw things off. •Fast-Changing Opinions: People’s views shift fast in today’s news cycle, making polls hard to keep up-to-date.\n\nToday, polls are a bit better with new techniques. But we're about to find out if they're better today, aren't we?", "label": 1}
{"text": "Mam this is not a Wendy's.", "label": 1}
{"text": "You may still be insane, but you are also observant.", "label": 1}
{"text": "\"The guilt–shame–fear spectrum of cultures is a sociological and anthropological concept that categorizes societies based on the primary means by which they enforce social norms and maintain order. This model identifies three types of cultures:\n\n1. Guilt Cultures: Social control is maintained through the internalization of a moral code, where individuals feel guilty when they violate societal norms, even if no one else knows about the transgression.\n\n\n2. Shame Cultures: Social control is achieved by emphasizing the importance of social reputation and honor. Individuals fear public disapproval and loss of face, which discourages deviant behavior.\n\n\n3. Fear Cultures: Social control is enforced through the fear of physical punishment or supernatural retribution. Compliance is driven by the anticipation of negative consequences imposed by external authorities or forces.\n\n\n\nBelow are five indicators for each type of society:\n\n\n---\n\nIndicators of Guilt Cultures:\n\n1. Internal Moral Compass: Individuals are guided by personal conscience and internalized values, leading them to feel guilt when violating norms.\n\n\n2. Emphasis on Individual Responsibility: There is a strong focus on personal accountability, where individuals are expected to own up to their actions.\n\n\n3. Legal Systems Based on Justice and Fairness: Laws are designed to reflect moral principles, and justice systems aim to uphold individual rights and equitable treatment.\n\n\n4. Value of Confession and Redemption: Societal norms encourage admitting wrongdoing and seeking forgiveness to alleviate feelings of guilt.\n\n\n5. Privacy of Transgressions: Wrongdoings are often considered private matters between the individual and their conscience or deity, rather than public concerns.\n\n\n\n\n---\n\nIndicators of Shame Cultures:\n\n1. Importance of Social Reputation and Honor: Maintaining one's image in the eyes of the community is paramount, and social standing influences behavior.\n\n\n2. Collectivist Orientation: The needs and norms of the group take precedence over individual desires, promoting conformity.\n\n\n3. Public Acknowledgment of Wrongdoing: Deviations from norms are often addressed publicly, and shame is used as a deterrent against nonconformity.\n\n\n4. Face-saving Behaviors: Individuals engage in actions to preserve dignity and avoid embarrassment for themselves and others.\n\n\n5. Use of Indirect Communication: Messages are often conveyed subtly to prevent causing offense or shame, emphasizing harmony over confrontation.\n\n\n\n\n---\n\nIndicators of Fear Cultures:\n\n1. Belief in Punitive External Forces: There is a strong conviction that deities, spirits, or authorities will impose punishment for wrongdoing.\n\n\n2. Strict Obedience to Authority: Compliance with rules and directives from leaders or institutions is expected to avoid negative consequences.\n\n\n3. Prevalence of Physical Punishment: Corporal punishment and harsh penalties are commonly used to enforce norms and deter deviance.\n\n\n4. Superstitious Practices and Rituals: Rituals are performed to appease supernatural forces or prevent misfortune, reflecting a fear of unknown powers.\n\n\n5. Rule Compliance Driven by Fear: Adherence to societal rules is motivated by the anticipation of punishment rather than personal conviction or concern for reputation.\n\n\n\n\n---\n\nUnderstanding these cultural frameworks helps in appreciating the diversity of societal norms and the various mechanisms through which social order is maintained around the world. It's important to note that many societies may exhibit a combination of these indicators rather than fitting neatly into a single category.\"", "label": 1}
{"text": "Don't be an idiot. You know what people are saying when that conversation comes around.", "label": 1}
{"text": "It’s been proposed many times but never passed by congress. Get your head out of your ass.", "label": 1}
{"text": "Wrong sub my guy. \n\nYou can't explain these concepts to a 5 year old. \n\nTry r/math instead. And add some context as well.", "label": 1}
{"text": "This is what I learned in high school accounting. There are four places to put profit:\n\n1. Dividends: Shareholders get a slice of the pie as cash payouts.\n2. Reinvestment: The company spends it on new projects or expansions, so it’s not “profit” anymore. Or they do stock \"buy backs\"--which simply drives up the price making investors and execs very happy.\n3. Bonuses: If it’s used for employee bonuses, it counts as an expense, not profit. - So if they are registering a \"profit\" you can rule this out. \n4. Retained Earnings: They stash it away as savings for a rainy day (or, let’s be real, a future CEO bonus).", "label": 1}
{"text": "It was an advance accounting class (kind of a grade 13 thing back in the day.)", "label": 1}
{"text": "You can't predict what an individual car will do on the highway but you can tell they're all going the same way. ", "label": 1}
{"text": "From Chat GPT:\n\nDiddy, whose real name is Sean Combs, is an American rapper, producer, and businessman known for his influence in the music industry, particularly in hip-hop and R&B. He has also been involved in various ventures, including fashion, beverages, and entertainment. Diddy has created several successful albums and is known for hits like “I’ll Be Missing You” and “Bad Boy for Life.”\n\nA “Diddy party” typically refers to a party or event that is associated with Diddy’s extravagant lifestyle, often characterized by glamour, celebrity appearances, and a lively atmosphere. These events may include lavish spending, high-end entertainment, and a sense of exclusivity.\n\nThe notion that a Diddy party could be viewed negatively may stem from various factors, such as the potential for excessive behavior, like partying hard or engaging in controversial activities. There can also be concerns about the influence of celebrity culture on attendees and the potential for reckless actions in such environments. Additionally, the media often portrays high-profile parties with a critical lens, highlighting any negative incidents that might occur.", "label": 1}
{"text": "If you are just adding commentary, then combatively dismissing what I wrote Is a retarded why to go about it dude. All offence. Absolute lunatic.", "label": 1}
{"text": "Same reason you can’t get vegetables from the same place your grocery store gets them from.", "label": 1}
{"text": "thank you very much, kornwallace21. you are not a fool. unlike THAT one.", "label": 1}
{"text": "If you have the money, and are willing to buy larger quantities,  you can.\n\n  \nUsers buy from people that sell 8 balls, guys selling 8 balls buy from people selling ounces. Those guys buy from people selling half or whole pounds. Those guys are buying kilos. \n\n  \neach level has differnt types of risks.", "label": 1}
{"text": "Dude, you're an idiot the first guy explained it just as clear", "label": 1}
{"text": "what can I realistically get for about $2400? I have a gold watch I can trade in too although it might be fake, and an Ipad from 2017. (srs answer please), I just want to know the equivalent value of said items.", "label": 1}
{"text": "Are you literally five years old?", "label": 1}
{"text": "HEY MODS!!! Why in the fuck is this nonsense answer still up when you removed mine which actually offered an answer?????", "label": 1}
{"text": "they inappropriately touch your genitals", "label": 1}
{"text": "don not type unless you type a solution please. being foolish is ill advised.", "label": 1}
{"text": " OP’s question is qualitative, and doesn’t mean anything. The only people who know anything about the climate are experts. Due to social media these people don’t get many likes, thus there is no way to profitably interact with a human on the subject. As a result nobody knows what to ask that is actually quantitatively relevant for humanity. We now live in a world where civilization can be completely destroyed in a few decades and life the Earth left to bacteria, but it was all worth it for that dancing squirrel GIF.", "label": 1}
{"text": "That’s a little judgey", "label": 1}
{"text": "Wow. Doubled down. That’s borderline racist.", "label": 1}
{"text": "What was his comment? I can take a guess, but still want to know", "label": 1}
{"text": "It depends, but the short answer is *indefinitely.*\n\nHowever, there may be existing easements or tools such as eminent domain that the local or state government has to develop under your land. In the case of building a subway, you may live in a city where the local government has a right of way to run their subway 100 feet under your lot. \n\nIn terms of airspace, the FAA has jurisdiction over what aircraft may fly over your lot. You cannot dictate air traffic. However, nobody can build a bridge or hypothetical floating building above you. Air rights are a thing.", "label": 1}
{"text": "\"Yes\". \n\nSo...uh...next question I guess?\n\nYou asked a yes or no question so I'm not sure there's anywhere else to go here. ", "label": 1}
{"text": "Probably something Reddit would view as racist", "label": 1}
{"text": "That's the most accurate and concise answer I've seen to this question. But I should add my 5 cents to the OP's second question. You can \"stumble\" into whatever things are on the dark web when you are already there, but you should get there somehow in the first place. So, I recommend starting from this list of [dark web websites](https://darkwebfans.com) and then stumbling upon these really messed-up things on the dark web as much as you want.", "label": 1}
{"text": "**Your submission has been removed for the following reason(s):**\n\nThe subreddit is not targeted towards literal five year-olds.\n\n\"**ELI5 means friendly, simplified and layman-accessible explanations.**\"\n\nThis subreddit focuses on simplified explanations of complex concepts.\n\nThe goal is to explain a concept to a layman.\n\n\"Layman\" does not mean \"child,\" it means \"normal person.\"\n\n---\n\nIf you would like this removal reviewed, please read the [detailed rules](https://www.reddit.com/r/explainlikeimfive/wiki/detailed_rules) first. **If you believe this submission was removed erroneously**, please [use this form](https://old.reddit.com/message/compose?to=%2Fr%2Fexplainlikeimfive&subject=Please%20review%20my%20submission%20removal?&message=Link:%20{url}%0A%0A%201:%20Does%20your%20comment%20pass%20rule%201:%20%0A%0A%202:%20If%20your%20comment%20was%20mistakenly%20removed%20as%20an%20anecdote,%20short%20answer,%20guess,%20or%20another%20aspect%20of%20rules%203%20or%208,%20please%20explain:) and we will review your submission.", "label": 1}
{"text": "Because they don’t want the 3 million votes to be counted and released early; which might sway other voters \n\nFederal elections are still run by the states (as written in constitution)", "label": 1}
{"text": "Why do states even exist?  It seems crazy to me to have different laws for different geographies within one UNITED States.  Don't tell me that people are different from community to community. It is the politics that makes people different, not the other way around.", "label": 1}
{"text": "Lol, I got downvoted for pointing out voting machines are not on the internet and that I agree with paper ballots for confirmation.  This is indeed a silly shit-hole of social media.", "label": 1}
{"text": "Look at your ballot. There's more than one thing to vote on. Some of the things to decide affect you very locally.", "label": 1}
{"text": "Not every animal is capable of storing and then transmitting all diseases\n\nThis is why we worry about mosquitos and yellow fever and dengue but not fleas and yellow fever\n\n\nInsects are completely immune to the rabies virus, so are fish and amphibians ", "label": 1}
{"text": "They use early data & trends to make predictions, but it’s not official until all the votes are counted", "label": 1}
{"text": "My county and state are going to Kamala no question, so my vote there doesn’t matter. But the county board of education is super close here with a lot at stake so my vote on that race matters a lot.", "label": 1}
{"text": "Because politicians are typically scumbags and have manipulated the system for their various benefits", "label": 1}
{"text": "It's a gimmick to get you to spend more on water", "label": 1}
{"text": "In HS Civics people learn the importance of participating in the Democratic prospects.  Maybe some people didn't pay attention.:s", "label": 1}
{"text": "I remember when this came out in Japan.  I thought it was hilarious.  I'm not sure what magic they claimed it to be but water with extra hydrogen to me is H2O2.  I certainly ain't drinking that. Apparently they still make it 🤷‍♂️ https://www.itoen.jp/suisosui/", "label": 1}
{"text": "Not all blackholes are the same! \n\nThere are different types, and the ones that create those are spinning, like most, but not all. \n\nHere is a fascinating podcast called Ologies by Alie Ward who interviews experts in different fields. [this one deals with blackholes! ](https://open.spotify.com/episode/4DSEwpJyLT0aIKqUhVpT8C?si=kR9FQ4NjRn2wl1vZYVYcGA)", "label": 1}
{"text": "Pedants like you should read closer. \n\nDemocratic Federal Government means federal government controlled by the Democratic Party. ", "label": 1}
{"text": "Arkansas always goes with the most conservative option for some time now at federal. It’s an extremist abortion kinda place where people have no problem with fascism or corruption as long as women take all the hits. Zero percent chance of people here not hiring a fascist crook.", "label": 1}
{"text": "My understanding is that auto manufacturers have been quietly phasing out AM radio due to incompatibility with their EV production vehicles. A bill has been presented to congress that will require all new vehicles to have AM radio available. The bill already passed a subcommittee and I think is on the congressional docket. \n\nA Google search for \"AM radio for every vehicle act\" should provide several articles on the issue.", "label": 1}
{"text": "Good idea", "label": 1}
{"text": "Shivering when you’re not cold happens because your body has other ways of reacting that aren’t about temperature. When you feel strong emotions—like excitement, fear, or even listening to music that gives you chills—your body releases chemicals like adrenaline. Adrenaline preps you for action, which can make your muscles contract a bit, causing shivers.\n\nIt’s similar to how animals fluff up when they’re excited or scared. In humans, this reaction can happen as a leftover survival instinct, triggered by strong feelings instead of just the cold. So, it’s your body’s way of responding to powerful sensations, even if it’s not about keeping warm.", "label": 1}
{"text": "Remember Boaty McBoatface. The popular vote means idiots get the most of what they want over smart and logical people.", "label": 1}
{"text": "On a really nice day I set up my computer outside and worked my full 8 hour day out on the patio in the shade of the house. I came in at the end of the day and I was mildly burned. I didn't get within 5 feet of an sunshine at any point. Is my grass that reflective, or is it from the clouds?", "label": 1}
{"text": "This [link](https://ledstore.pro/blog/2023/02/06/why-do-led-lights-flicker-in-the-camera) explains it pretty well.", "label": 1}
{"text": "I said the electoral college. \n\nBut you want to be a tiresome little shit thinking he’s clever, go do it to someone else. ", "label": 1}
{"text": "I don't know why you're downvoted. The short, but real, answer is: yes,  the other states don't mean anything.", "label": 1}
{"text": "You're very stupid if you actually believe your argument. Congratulations.", "label": 1}
{"text": "It would depend on where you measured it. If you measured it between the 2 batteries you would only see 5 volts/amps, if you measured it after both batteries you'd see the full 10 volts/amps", "label": 1}
{"text": "I'm not arguing with you I'm just letting you know your argument is very stupid", "label": 1}
{"text": "Idk but I'm never ever taking any shit from Americans again how fucking embarrassing lmaoooo you've automatically lost any argument", "label": 1}
{"text": "We had record early voter turnout but it's looking like turnout I really is down.", "label": 1}
{"text": " Because they’re done counting", "label": 1}
{"text": "What a childish answer.", "label": 1}
{"text": "Biden doesn’t care, or even know there is an election,", "label": 1}
{"text": "Nor does Trump half the time", "label": 1}
{"text": "that's hilarious. i was saying all along people that were pretending to be happy with kamala as the candidate were blue maga boot lickers and now you're just outright claiming election interference. no, people just never liked her. she's unlikable. why'd the democrats want somebody who locked people up for dumb shit running for president is totally beyond me. we're not the blue lives matter party. that's how far the overton window shifted; we're just supposed to vote for a straight up actual republican now. which i did. and expected her to lose. but not by an absolute landslide.\n\ncalling for recounts is so silly. send those people home. she lost *hard*. it wasn't close. biden should stay in bed. maybe next time they'll actually let us vote on the candidate we put up. if there's still a government left. 🤷‍♂️", "label": 1}
{"text": "You’re the first sensible comment I’ve read around this issue here on Reddit. They’re even blaming immigrants with citizenship and using them as a scapegoat lol. \n\nI lost faith in the intelligence of the republican voter decades ago, but now it’s time to lose faith in the democrat base too.", "label": 1}
{"text": "Non political answer: Americans are incredibly stupid. Like way dumber than the world thought possible, apparently.", "label": 1}
{"text": "Damn, we went from make sure to vote posts to why are we voting posts lmao, Reddit day and night.", "label": 1}
{"text": "70 million people are assholes, cultists, racists, misogynists, and death worshippers. \n\nNot sure how we handle that, but there we are. ", "label": 1}
{"text": "brave of you to self identify as one of the stupid people", "label": 1}
{"text": "That's rich coming from the side the loves genocide. Have you no ability to introdpect?", "label": 1}
{"text": "Because they find fascism a preferable alternative to equality for women, trans people, etc.", "label": 1}
{"text": "Cry harder", "label": 1}
{"text": "You are the cultist and racist", "label": 1}
{"text": "Silent majority bitch", "label": 1}
{"text": "This is the state of education eh? Explains a lot about recent events.", "label": 1}
{"text": "Wow you’re just more intelligent than everyone.", "label": 1}
{"text": "Nice in depth answer. \nI stand by what I said: it is a childish response.", "label": 1}
{"text": "Exit rolling and geographic demographics for precincts.\n\nFor instance, Selma Mississippi is predominantly black. If that majority of that precinct votes a certain way you can make a logical leap that the majority of black voters in Selma also voted that way.", "label": 1}
{"text": "Imagine there's a playground where everyone wants to play. Some kids (the \"left\") think they should automatically get to use the swings and slides without waiting their turn or sharing. They also complain a lot if things don't go their way. \n\nOther kids think you should have to do the right thing before you can get to use the swings, like actually voting, or fighting for your rights.\n\n\nYou're not born with rights they are fought for, like grandaddy had to do.", "label": 1}
{"text": "I went on vacation to Costa Rica one year. We found this nice restaurant up on the side of a cliff that overlooked the ocean. \n\nTheir menu was mostly seafood and I got a giant plate of Shrimp and rice for $8. I'm talking like 30 pieces of cooked shrimp for $8.\n\nNeedless to say I went back to that restaurant several times while on my vacation. \n\nThe point I'm making with that story is that when a country's currency is weak it's usually also reflected in their cost of living.", "label": 1}
{"text": "You. Lost.", "label": 1}
{"text": "Not being American, now the election is over I had hoped that subreddits that aren't about American politics would be enjoyable to come back to, without just seeing a barrage of posts arguing about  American politics.\n\nApparantly not, apparantly every sub has to keep arguing about American politics until the end of time.", "label": 1}
{"text": "In America, every group besides white men vote democrat. \n\nWhite men can go either way depending on what they see.", "label": 1}
{"text": "lol then what was January 6th?\n\nThis is an awful analogy.", "label": 1}
{"text": "Most of the votes for Biden last time were people who were dead or illegally voting. Maybe, just maybe they caught on to the crock of shit that is mail in votes.", "label": 1}
{"text": "spinning", "label": 1}
{"text": "It's quite simple, the popular vote is when people vote for something and the electoral vote is when rich people say they know better while drawing cursed districts on the map and paying all politicians", "label": 1}
{"text": "Runout\" in simple terms means that something is a little bit wobbly when it spins. Imagine if you were trying to spin a pencil perfectly in the middle, but instead, it shakes or moves a little bit from side to side as it turns.\n\nIn machining, like on a lathe, runout happens when a part doesn’t spin exactly in a straight line, and this little wobble can make the part look uneven or not quite right. It’s important to make sure parts spin smoothly to create precise shapes and surfaces.", "label": 1}
{"text": "* **Using a Center Finder**: Place the steel cylinder between centers on a lathe or on a fixture that allows it to rotate. Then use a center finder tool, which is like a fine-pointed tool, to make small adjustments until the cylinder spins as smoothly as possible without wobbling. This will approximate the true center even if the outer surface isn’t perfectly round.\n* **Marking with Dividers**: For rough center-finding, a set of dividers or calipers can be helpful. Adjust the divider to the approximate radius of the cylinder and make multiple marks from different points around the circumference. The point where the marks converge or overlap will be close to the center.\n* **Using a Lathe Chuck and Dial Indicator**: Mount the cylinder in a lathe chuck, then bring a dial indicator to measure runout on the outer surface. Slowly rotate the cylinder and watch the dial indicator; adjust the position in the chuck until the dial reading is as consistent as possible, indicating that the cylinder is centered as closely as possible.\n* **Surface Plate and Height Gauge**: Place the cylinder on a flat surface plate, then use a height gauge to measure and mark the approximate midpoints from different sides. This method isn’t as precise but can give a reasonable estimate for rough work.\n* **Turning Between Centers**: After roughly finding the center, you can drill shallow center holes on each end of the cylinder. Then, mount it between centers on the lathe, allowing for adjustments to remove wobble during the turning process. The centers provide a pivot point, and even if the outside isn’t perfect, the workpiece will rotate evenly on its true center axis.\n\n\\-ChatGPT", "label": 1}
{"text": "I guess it would be something to do with how babies are fed by their mothers. Incisors and canines are made for tearing things. e.g. tearing the flesh off a bone while eating a deer or whatever. Molars are made for breaking down the food that’s already in your mouth. In the same way mama birds feed their babies, mothers would tear off the flesh for the baby and they would only need their molars to break it down.", "label": 1}
{"text": "Couldn’t reply anywhere else because you deleted your dumb post where you were bragging about losing $10,000\n\nBrahhhhhhhhhhhhhhhhhhhhhhhhhh I’m glad I screenshotted it I see you deleted the post I had to come back here.\n\nReally want you to reflect on how much a miserable smug idiot you were in your original post. Do whatever you want with your money - it was the overconfidence and the smugness that made your lose so beautiful. \n\nWE GOT THE POPULAR VOTE AND THE ELECTION WASNT EVEN CLOSE.", "label": 1}
{"text": "I am guessing the length of the sound wave gets shortened as the air chamber is filled with denser than air water.  Shorter wave means higher pitch.", "label": 1}
{"text": "I forgot which politician said it but it was something along the lines of \"Australians don't need fast internet\" or some bullshit", "label": 1}
{"text": "How do we... what? Hold up, what do any of those words mean?\n\nI don't know the answer to the question but I will try to come up with one.\n\nUprelegation and downrelatin is what happen when the synapse receptors get pregnant with informatoin. We will see using our naked eyes they happen live in front of us right now every day every week every year 24/7. So what\n\nThis happens because whenever mosquitoes get in yor brain and they well you see they have electricules", "label": 1}
{"text": "Google: “specific heat”", "label": 1}
{"text": "what ive typed is definitely more sane than the schizophrenic rant you went on about tribes or whatever lmao thats genuinely such a creepy comparison to make", "label": 1}
{"text": "Have you heard of that biatch Kari Lake?\n\n\nShe's still counting from the last election.", "label": 1}
{"text": "do you have an example?", "label": 1}
{"text": "We da best 🦅🦅🦅🦅 you need help? We there. You don’t need us? We there 🛩️🛩️🛩️🛩️🛢️🛢️ Why we’re there depends on the leader. So you’re either shit out of luck or grateful we’re there.", "label": 1}
{"text": "Why US Elections Matter Globally 🌎\n\n* **Economic Shockwaves:** New trade policies can shake up global markets, influencing what we pay for goods everywhere. 📈💸\n* **Alliances & Security:** Shifts in U.S. commitments to NATO and other allies can impact military strategies worldwide. 🌍🔒\n* **Climate Action (or Not):** Whether the U.S. joins or ditches climate pacts impacts global progress against climate change. 🌱🔥\n* **Global Health Funding:** U.S. leadership often sets the tone for health initiatives and funding—vital for fighting diseases worldwide. 💉🌐\n* **Tech & Cultural Trends:** The U.S. sets standards for tech, data, and culture, shaping regulations and trends everywhere. 📱🎬\n\nIn short, what happens in the U.S. definitely doesn’t stay there. 😬\n\nDo the emojis help? 🤔", "label": 1}
{"text": "You're right to be concerned: Removing Low-Cost Labor Increases Prices 💸\n\n* **Fewer Workers = Higher Wages:** Without low-cost labor, companies need to raise wages to attract workers. 💵⬆️\n* **Higher Wages = Higher Prices:** When companies pay more to make stuff, we pay more to buy it. 📈\n* **Labor Shortages = Slower Production:** Fewer workers means delays and less supply, pushing prices up. 🕰️🔺\n* **Industry Ripple Effect:** Everything from food to home repairs gets pricier without affordable labor. 🍔🛠️\n\nSo, deporting low-cost labor actually raises the cost of goods. Making them legal might be a smarter policy.\n\n(I add the emojis for style points.)", "label": 1}
{"text": "I figure that if we wanted it explained like we're 5, it needs pictures!", "label": 1}
{"text": "So \"keep immigrants because they'll do cheap labor\" is your point? Interesting. Slightly racist but interesting nonetheless.", "label": 1}
{"text": "Immaculate conception. She basically just got told that she would be having it. Kind of fucked up.", "label": 1}
{"text": "This is an involved one....\n\nEastern European countries like Hungary thrive in the EU because it’s more than a free trade deal—it’s a deep partnership. A two way street. ⇆ Here’s why it’s different:\n\n1. Full Access, Full Benefits: EU membership means joining a single market, with freedom to trade, invest, and work across borders. It’s not just “free trade”—it’s full integration. 🌍💸\n2. Billions in Support: The EU doesn’t just open markets; it invests in new members. Hungary gets billions in development funds for infrastructure, education, and local business growth. 💰🏗️\n3. Protected Standards: EU regulations on labor and quality mean foreign companies can’t exploit loopholes. Hungarian businesses compete fairly in Western markets, and local workers get better protections. ⚖️🛠️\n4. Political Stability: EU membership comes with rule-of-law standards that make Hungary a safer bet for investors. Stable politics = steady growth. 🗳️🏛️\n5. Shared Goals: Eastern Europe’s “return to Europe” wasn’t just economic; it was cultural and historical. Unlike traditional power plays in trade deals, the EU’s growth model is mutual, with shared interest in everyone’s success.🤝❤️\n\nSo, for Hungary, the EU means real opportunity—not one-sided trade, but full access to growth. 🚀   \nThe African countries don't get the same two-way access. 😢\n\n(Emojis, because we're 5.)", "label": 1}
{"text": "Analogy: Finding the next biggest prime number like **hiking an endless mountain range with random peaks**:\n\n**The Proof:** We know there’s always a higher peak (a larger prime) somewhre in this range. We just don't know where or how high it will be. But it must be there *because* the range goes on forever.\n\n**The Gaps:** The first peaks (small primes) were easy to find because they are close together. But as we go higher, the distance between peaks grows. The gaps are enormous now.\n\n**The Testing Challenge:** Each peak we want to reach takes more work to climb. For huge peaks (massive numbers), it’s like the slopes get steeper and rockier, so it takes a lot of strength (computing power) to reach the top and verify if it’s really a peak (a prime).\n\nWe know they exist, but finding each new tallest peak is a huge effort, and it only gets harder the higher we go!", "label": 1}
{"text": "Also I think it's very cherry picked where they can see someone wearing MAGA kit and actively choosing to avoid them.", "label": 1}
{"text": "When you call people Nazis they are surprisingly unwilling to talk to you.  Who knew?", "label": 1}
{"text": "You’re going with “the polling companies are calling us Nazis” now?\n\nYeah, I can see a Trump supporter believing that. Pretty on-brand really.", "label": 1}
{"text": "I lost both parents and both my inlaws from old age and cancer, and around 5 other family members.\n\nMost of the time people are already so bedridden, that they will be wearing adult diapers, which catches whatever fluids people will lose when they pass.  \nDeath isn't like in the movies, it isn't pretty. But you get used to it, even though that sounds weird, because you kind of know what to expect.\n\nPeople that pass don't always lose their bowels, but will mostly lose their bladder contents, because the bladder is like a muscle that is constantly working. That's how you pee, by relaxing the musclebladder. That muscle relaxes in the same way when someone passes.\n\nAlso, you will probably be so overcome with sadness, that you don't care what is happening. Dying people, can vomit, bleed, pee and poo. It's part of being human. Most of the time there will be nurses to assist what whatever mess is there.  \nAnother thing that I want to mention, is that most dying people have had a long (or short) sickbed and especially with your parents, you will help them as age does its thing.  \nYiou get used to the little accidents, wounds and sickness and everything that comes with it. By the times a parent passes, you will have seen it all and whatever happens on their deathbed, will probably not phase you anymore.", "label": 1}
{"text": "I swear redditors see a comment and shit the same crap out their mouth. Tons of Latin American countries have/ have had women as presidents. Shit, mexico just elected their first woman president. Redditors are just stupid as fuck and fail to see the actual reasons why your side lost and gotta find a boogeyman to justify your failiures.", "label": 1}
{"text": "This generation’s biggest con man has successfully conned us again.", "label": 1}
{"text": "Easy peasy!  First, try an experiment.\n\nGo to most any subreddit here, except for one of the few conservative ones.  Post a comment that is mildly pro-Republican.  \nExample:  \"I'm pleased with the election results.  Let's all reach across the aisle to make friendships and move forward together.\"  \nI predict you will receive many abusive responses and a ton of downvotes.  Left-side bullying will clearly show.\n\n  \nDoes that help explain why pollsters don't always get accurate information from people they talk  to?", "label": 1}
{"text": "I’m sorry you have 0 ability to critically apply what’s being communicated to you.", "label": 1}
{"text": "Reddit is a great example.  Hive mind and over-modding.  When you censor people, you start to believe the silence is acquiescence.", "label": 1}
{"text": "These are called two-piece and three-piece cans. Two piece cans require specialized tools to manufacture since the bottom of the can needs to be formed together with the sides into a fairly complex shape. A three piece can can be made from three flat pieces of metal using simple tools.", "label": 1}
{"text": "I assure you that animals also have wonky teeth. But my guess would be that we evolved smaller and smaller jaws and the teeth never really fell in line with what the jaw was doing… so here we are. Kind of like how we evolved to stand upright but then people develop a ton of back problems because for millions of years our ancestors spines were more horizontal and didn’t have all that gravity pushing down on them. \n\nAnyway, someone else will have a better response but that’s my uneducated guess.", "label": 1}
{"text": "Here's a simple explanation about 'nlikeimfive/comments/1glib36/first_time_homebuyer_lending_and_under_contract/)':\n\nSorry, I couldn't find anything on that topic.\n\n---\n^(I am a bot. This summary was retrieved from Wikipedia.)", "label": 1}
{"text": "Sexism? Just my guess.", "label": 1}
{"text": "Being \"undetectable\" means the viral load is so low that HIV can't be transmitted, even though the virus remains in the body. With ongoing meds, the virus is controlled, delaying progression to AIDS.", "label": 1}
{"text": "Today has been rough. I’m going to take the lil Mongolian beast to bed and over tomorrow in 20. If you want talk, 3154471773.", "label": 1}
{"text": "I thought the question was asking why the earth doesn't move opposite of yourself when you jump. Totally missed the more obvious scenario.", "label": 1}
{"text": "Ok so if you were to drill a tunnel through the entire earth and  you threw an object into the hole what would happen? For sake of argument Lets assume the tunnel could withstand the pressure and heat.", "label": 1}
{"text": "Look at the YouTube videos of Kurzgesagt named \"the size of life\"", "label": 1}
{"text": "I have no medical background at all but here’s my guess based on intuition: i can probably win a fight against 1 weak person but 10 weak persons? I’d definitely lose", "label": 1}
