{"text": "Shut the fuck up", "label": 1}
{"text": "Fucking McCunt pass it to Kupp you piece of shit", "label": 1}
{"text": "I'm pissed it's the fucking puma and Williams show this hole drive bullshit", "label": 1}
{"text": "Idk that’s too many names for me to think about", "label": 1}
{"text": "Alt F4", "label": 1}
{"text": "So stoked to unleash my KW3, Mason, Conner stack this weekend. All of them should EAT.\n\n(please don’t age poorly)", "label": 1}
{"text": "Fuck you and I hope this is nothing 🫠", "label": 1}
{"text": "I have both so I hope they both do well", "label": 1}
{"text": "CMC for the upside", "label": 1}
{"text": "Let's say you're the knee doctor in Cincinnati.  Yeah, you've got the market pretty much locked up, because how many knee doctors are there in Cincinnati and the other northern suburbs of Lexington, Kentucky?  But still, if Joe Burrow keeps calling, you'll probably want that out there.  So when you pick up, you say \"Hey, Joe Burrow, how can I help your knee today?\"  If he texts you when you're treating somebody's Kentuckio mom-sister, you'll probably read your reply out loud while typing it.  \"Good to get your text, J-O-E B-U-R-R-O-W period Yes I got your knee replacement kit when would you like it installed question mark No of course I won't tell anyone's dad-uncle winking smiley face.\"\n\n\nAnd look, this sort of random reddit muckraking usually isn't credible.  But this is Joe Burrow we're talking about here.  Have you seen pictures of him this year?  On top of his encyclopedic injury history, he obviously has an undisclosed case of Stage 4 hair cancer.  Pretty good chance that 8 or 9 of the 12 doctors in North Lexington are on a first-name basis with him by now.", "label": 1}
{"text": "Mason is the only back that we KNOW will be given a full workload and will thrive if the starter goes down. Guys like Braelon and Allgeier we HOPE will get starters’ touches, but it is possible or even likely they split work with the 3rd string. And then guys like Charbonnet and Ray Davis have shown they will get the work but might not be smash plays.", "label": 1}
{"text": "Shut the fuck up", "label": 1}
{"text": "You are fucked.", "label": 1}
{"text": "Shut your fucking mouth", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Bro look at this fool writing an essay for Chuba fuckn Hubbard 🤣🫵🤡\n\nDude has always been a JAG.  Never averaged than 5 ypc never broke a thousand yards, but keep coping!  Remind ne at end of season where these two RBs stand, princess 😂😂", "label": 1}
{"text": ".5 ppr, \n\nI give Metcalf, Waddle, Swift, Baker\n\nI get J Taylor and Jordan Love.\n\nI have a deep team and I see this as a big RB upgrade down the stretch plus huge QB upgrade now with TB injuries.\n\n Am I giving up too much?", "label": 1}
{"text": "Thanks for saving me the time, what a bozo OP is", "label": 1}
{"text": "This happens every week, been trying to point it out whenever I see his garbage", "label": 1}
{"text": "he just got activated off IR", "label": 1}
{"text": "Nice of the national fencing team to loan him back to Miami", "label": 1}
{"text": "Jesus Christ reddit", "label": 1}
{"text": "Thats awful😭😭", "label": 1}
{"text": "Strike up the fuckin band!", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "But most of the time you're Nostradumbass.", "label": 1}
{"text": "Bro I’m thinking about Tua instead of Mahomes lol", "label": 1}
{"text": "Suck my entire dick and balls", "label": 1}
{"text": "Start your studs, & come back here later to blame  anyone", "label": 1}
{"text": "Start", "label": 1}
{"text": "I’ve got him or Caleb Williams. I’m tempted to put in Caleb", "label": 1}
{"text": "I own him. and I will be starting Bo Nix, I feel he's not going to be 100% against a rather decent Bears D.", "label": 1}
{"text": "Don’t play fantasy scared.", "label": 1}
{"text": "Nope. One decent hit to those ribs and he's out for the rest of the game. Could be looking at a .6 point fantasy performance and the Bears D is no slouch anyway. I'm starting Russel Wilson instead", "label": 1}
{"text": "What a wuss. Just play him. You pray for him to be active all week just to sit him? 🤣", "label": 1}
{"text": "Yea that’s how I’m leaning. I think Daniels will be hesitant to run to protect himself which limits his upside.", "label": 1}
{"text": "I'll say this: Women who go to hospital ready to have baby know the pain that is ahead, so they get  Epidural shot because they know they are headed (or at least believe they are) for pain. Daniels know he will be in pain this week so they will give him the NFL version of whatever magical pain relief they're willing to subject players to. Last week, he didn't know he would be injured so he sat out. Next week, who knows if he'll be dealing with injury after this week's pain meds and adrenaline because the drama of the top two draft picks dueling this week is too important to risk.", "label": 1}
{"text": "Scared money don’t make money", "label": 1}
{"text": "Idk if scared is the right word I guess. Looking at my lineup vs theirs, I'm Def the favorite for the week. Which is why I'm leaning towards the safe play. If I eat a 0 at QB I'm fucked", "label": 1}
{"text": "Pretty sure this has been asked 5 out of the last 10 posts.", "label": 1}
{"text": "I’m starting Murray over him. Idk, bears D is legit and he’s injured so passing this week.", "label": 1}
{"text": "I have Russ with a great matchup against the Giants coming off an almost 25 point game last week. I'm for sure the favorite in my matchup. Which is why I'm leaning towards the safety play. ", "label": 1}
{"text": "I’m going Caleb as well", "label": 1}
{"text": "I have him and Tua and Miami plays at noon. Thinking of just starting Tua", "label": 1}
{"text": "I would start him but if your only options are 1pm guys or him it's tough. That's the situation I'm in", "label": 1}
{"text": "I benched Puka, I’m starting Daniels. Start your studs!", "label": 1}
{"text": "I'm pivoting to Purdy", "label": 1}
{"text": "I went safe but can see both sides. One hit could knock anyone out.", "label": 1}
{"text": "I'm honestly just hoping for a shootout, which Daniels makes more likely. Bears defense is good though. So hopefully turnovers,  putting Caleb in a position to score TDs.", "label": 1}
{"text": "They play at 4:25 and most fantasy relevant teams play at 1. So you could decide later", "label": 1}
{"text": "If you have a capable backup with a decent matchup I think it’s okay to sit and wait a week on Daniels. The bears D hasn’t been a great matchup for teams this season either. If you are a favoured playing a safer bet isn’t a bad play", "label": 1}
{"text": "Idk if I played a little scareder I would have benched Juju after his hammy flared up in practice", "label": 1}
{"text": "I mean he probably could have played last week, but they absolutely crushed the Panthers so there was no point in bringing him back in when it was a three score blowout. He played through broken ribs at LSU and all tests on this injury have been negative, so I don't see any reason why he wouldn't be a full-go.", "label": 1}
{"text": "I’m 1-6 and my season is over. My choice is to play a much inferior QB at 1 and watch Daniels go off at 4:30 on my bench, or gamble that he plays and goes off. Probably either way I’ll be 1-7 on Tuesday, but at least I’ll go out swinging. \n\nSigh", "label": 1}
{"text": "Rumors that his injury was actually his nipple ring being ripped out", "label": 1}
{"text": "Fortune favors the bold", "label": 1}
{"text": "Bucky time baby!", "label": 1}
{"text": "Literally go fuck your self Mcdaniels, stop letting mostert vulture bruh", "label": 1}
{"text": "Bucky RB1", "label": 1}
{"text": "Bucky should be getting 80% of the carries.", "label": 1}
{"text": "Should've started Maye, fuck", "label": 1}
{"text": "Give Bucky these TDs my god.", "label": 1}
{"text": "fuck u rachaad white", "label": 1}
{"text": "Pitts you fucking dumbass", "label": 1}
{"text": "Why are wide receivers so regarded", "label": 1}
{"text": "I said some stupid shit about you Pitts and I’m sorry dude I’m glad i had the nerve to keep starting you", "label": 1}
{"text": "Pitts you fucking idiot. So lucky", "label": 1}
{"text": "Yep i saw the replay.  It's such horseshit.  Fuck Kyle pitts", "label": 1}
{"text": "bro I've given him so many chances at this point lol", "label": 1}
{"text": "Give Njoku some love", "label": 1}
{"text": "NJOKU CHADS RISE UP!!!", "label": 1}
{"text": "GIVE RHAMONDRE THE TD", "label": 1}
{"text": "MONDRE REDEMPTION ARC", "label": 1}
{"text": "Tua can slide?", "label": 1}
{"text": "Adams wtf", "label": 1}
{"text": "Is MHJ droppable the cardinals fucking suck ass", "label": 1}
{"text": "Chase Brown !!! there we go", "label": 1}
{"text": "Why would Bengals go for it at their own 30 in a 1 possession game with tons of time left?", "label": 1}
{"text": "THAT’S THE WRONG HILL YOU FUCKS", "label": 1}
{"text": "Rest In Piss Diggs", "label": 1}
{"text": "Bucky was wide open Baker god dammit", "label": 1}
{"text": "Careful, the mods on these subs have really itchy trigger fingers if you joke about dear leader.", "label": 1}
{"text": "karma from leaving Buffalo.", "label": 1}
{"text": "Give Mondre another one!", "label": 1}
{"text": "Mayo is a terrible coach", "label": 1}
{"text": "Please tell me Stefon just needs some water", "label": 1}
{"text": "Lmaooo that’s what you dumb fucks get for giving it to allgeier", "label": 1}
{"text": "Yet they only delete and ban a certain set of posts... 🤔", "label": 1}
{"text": "So that’s what it feels like to have an elite QB @Jalen Hurts?", "label": 1}
{"text": "Goff with 85yds and 3TDs is hilarious", "label": 1}
{"text": "YOU ARE A FUCKING CLOWN", "label": 1}
{"text": "Are you fucking serious flowers? Fucking dive in", "label": 1}
{"text": "Mondre for the push in pls", "label": 1}
{"text": "MONDDDRE", "label": 1}
{"text": "Suck my dick Drake London you fraud", "label": 1}
{"text": "Njoku TD to top this shit off!", "label": 1}
{"text": "Ravens lol", "label": 1}
{"text": "marshawn lloyd bagholders rise up", "label": 1}
{"text": "He's the 14 point KING", "label": 1}
{"text": "Richardson is just dumb man.", "label": 1}
{"text": "agree", "label": 1}
{"text": "why no free play?", "label": 1}
{"text": "Gimme K9 TD", "label": 1}
{"text": "You can run but you can’t hide, bitch", "label": 1}
{"text": "Mahomes is so bad my god.", "label": 1}
{"text": "Walker tuddy doo itt", "label": 1}
{"text": "Get Charb out wtf", "label": 1}
{"text": "get ucked walker", "label": 1}
{"text": "SEAHAWKS LMFAO", "label": 1}
{"text": "Seahawks trying to sabotage me with all these snap shenanigans", "label": 1}
{"text": "2 catches. 12 yards.\n\nNice work OP!", "label": 1}
{"text": "I figured they'd at least keep the score low", "label": 1}
{"text": "can you kick the ball forward?", "label": 1}
{"text": "Yeah that 2/12 floor. Wow. Banger.", "label": 1}
{"text": "Seattle being fantasy terrorists today", "label": 1}
{"text": "Wtf is that twist!? eject that dude", "label": 1}
{"text": "Ejection too. Wtf was that.", "label": 1}
{"text": "fuck u swift", "label": 1}
{"text": "I love having K9. I hate that he's on the Seahawks.", "label": 1}
{"text": "Your league is full of morons.", "label": 1}
{"text": "FUCK YOU GENO", "label": 1}
{"text": "Fuck you geno", "label": 1}
{"text": "Hawks game gonna be over in record time", "label": 1}
{"text": "Bills eating up all the clock. K9 and JSN barely getting any action. Fuck sakes.", "label": 1}
{"text": "Can the Seahawks like, run some plays?", "label": 1}
{"text": "minshew such a fool", "label": 1}
{"text": "Keenan Allen’s a fat old fart, just retire you fossil", "label": 1}
{"text": "Looks like Ai was correct on this too.", "label": 1}
{"text": "Dumbass knows nothing above this comment", "label": 1}
{"text": "AND THIS IS WHAT HAPPENS WHEN YOU DONT FUCKING GIVE IT TO SWIFT YOU FUCKING MORONS", "label": 1}
{"text": "Bye bye", "label": 1}
{"text": "Sutton lol", "label": 1}
{"text": "Tell them to fuck off.\n\nIt’s your team.", "label": 1}
{"text": "Fair game and strategic, especially if you play in a league where missed FGs lose points.", "label": 1}
{"text": "I would say that’s some good head coaching your just taking a knee", "label": 1}
{"text": "While you could there is always the concern for a Stat correction that takes something away from you.\n\nI think it's fair play but wouldn't as I'd expect to score more from your kicker.", "label": 1}
{"text": "Do you have a league constitution where this is a stated rule? If not then it’s not unconstitutional and you’re allowed to do it", "label": 1}
{"text": "Ask if you're allowed to make start/sit decisions for his team? When they say no say thanks you aren't for me either", "label": 1}
{"text": "That one league member needs to not procreate", "label": 1}
{"text": "It ain't against the rules. Tell them to cry harder", "label": 1}
{"text": "Acceptable behavior: things you think will help you win.\n\nUnacceptable behavior: things that you think will make you intentionally lose for no reason. \n\nThe end.", "label": 1}
{"text": "There is no constitution in fantasy football. It’s strategy. Do what you have to do to win.", "label": 1}
{"text": "Just watch there be a 1 point stat correction", "label": 1}
{"text": "In real football if a kicker was able to get the negative points then they would bench him too!", "label": 1}
{"text": "Don’t be that guy", "label": 1}
{"text": "If your kicker is Aubrey let it ride and get those points that could decide tie breaker for playoff seeding", "label": 1}
{"text": "The tradition of Dak throwing god awful throws to CD continues.", "label": 1}
{"text": "Mother fucker. Mason. I knew your time was limited but why you gotta go out like this?", "label": 1}
{"text": "My season is over", "label": 1}
{"text": "Fuck the fucking fuck off", "label": 1}
{"text": "Please dump it off to Mason purdy you fucking bum", "label": 1}
{"text": "All you Guerendo commenters didn’t start him, shut the fuck up.  And I own him in all my leagues.  ", "label": 1}
{"text": "tooth penis", "label": 1}
{"text": "Not that big of a call. I suck & I saw it as an obvious crack @ a rosterable spot.", "label": 1}
{"text": "You'll get a notification when the commisioner uses commish tools to adjust a lineup.", "label": 1}
{"text": "lost every team bc of jason mason im dropping his ass", "label": 1}
{"text": "Collinsworth is such a douche for shit talking Pearsall", "label": 1}
{"text": "Omg lol", "label": 1}
{"text": "Cry about it", "label": 1}
{"text": "Lil sensitive tonight aren’t we", "label": 1}
{"text": "You're the one looking for validation.", "label": 1}
{"text": "Wish I was in your taco league", "label": 1}
{"text": "The fact that it took five weeks for someone to claim him speaks volumes though", "label": 1}
{"text": "Yes it is. your league is trash lol", "label": 1}
{"text": "It most definitely is when you look at the landscape of people that were probably being held over her, even in a 10 teamer. Its not even hindsight, it was obvious early on", "label": 1}
{"text": "I hope this gave you the happiness you are seeking", "label": 1}
{"text": "WEEK FIVE? I mean if it was an 8 team league or something I can see him being on the waivers for the first 2 maybe 3 weeks but WEEK FIVE?", "label": 1}
{"text": "Same.  Don't care that Collins is coming back.  Done with Stroud, bad draft pick\n\nTorn between Stafford, cousins, nix, Winston now.  Ten team league, all are available \n\nI think i rank them as i listed them", "label": 1}
{"text": "He was dropped to waivers in my 14 team work league.    \n     \nThat shows you the level of competency I deal with at work sometimes.      \n    \nTbf, we have 2 bench slots. Maybe the dude has a broken team and needed the spot, idk.", "label": 1}
{"text": "can i join your league?", "label": 1}
{"text": "Yeah it definitely happens and casual players are more reactionary. I'm in a 10-man league and he didn't get drafted (4 spot bench) but I immediately bid 17% on him after week 1 and nobody else did since it seemed obvious that if he was already producing week 1 the talent will come through quick and he'll be relevant.", "label": 1}
{"text": "This is why every league is getting rid of vetoes. Regards like you", "label": 1}
{"text": "no dont tell him its funnier that way", "label": 1}
{"text": "As your WR1 no you wont", "label": 1}
{"text": "Not impossible but, depending on the scoring, that may be a tall order.", "label": 1}
{"text": "I need 6 from the Steelers defense", "label": 1}
{"text": "Bro there’s other fantasy subs that allow this type of circle jerk fantasy spam, try finding them", "label": 1}
{"text": "delete your reddit account", "label": 1}
{"text": "You're kidding. Whoever traded you is a moron.", "label": 1}
{"text": "Hunter Henry led the team in receptions. Pop had 2. And that was with Maye missing most of the game", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "You really coming back to hype up your 45 yards from TE on a day when TEs led the entire league?\n\nYou enjoy that brotha 💀", "label": 1}
{"text": "Texans", "label": 1}
{"text": "Bruh he has 2 of 3 receptions TOTAL while Maye was in. That’s 66%.\n\nWe were obviously talking about the current state with Maye at the helm. That all changes when noodle-arm Brissett is back in there.\n\nYou truly are lost lmao.", "label": 1}
{"text": "Tracy", "label": 1}
{"text": "Look at the odds on a Sportsbook app to get an idea. Right now the odds are lower for a singletary TD vs Tracy so Vegas thinks Singletary will have the better opportunity to score", "label": 1}
{"text": "Cuz he played against me.\n\nMy opponent also started Monty so of course he threw a td to LaPorta to add insult to injury.", "label": 1}
{"text": "Idk Nico should be back in a couple of weeks.", "label": 1}
{"text": "Lmao sure bro. You realized your a dumbass sheep and got triggered. You're the one that started calling names. 😂✌️", "label": 1}
{"text": "Are you? Like what about my comment is so obscenely off track that you can’t even manage to follow? Like I’m impressed by your commitment to not understanding. Can only imagine how much that genuinely helps you in life", "label": 1}
{"text": "I need Pickens to outscore Nabers I’m gonna kms", "label": 1}
{"text": "lol I just came here to post this too. It was showing correctly until about an hour ago. Only shows the wrong total on the detailed h2h view that shows individual players. \n\nPretty sure it’s because the side by side now says “8 points allowed” but 2 of those points were from the safety against the offense and until an hour ago it was counted correctly. \n\nAlso if you look at the details by tapping on the score to see the breakdown it still shows only “1-6 points allowed” and the correct total points .", "label": 1}
{"text": "You sound like sn incredible dbag", "label": 1}
{"text": "Uh ok Joe Buck let’s see you toss that pass then. The fuck.", "label": 1}
{"text": "No shit", "label": 1}
{"text": "No one cares troll", "label": 1}
{"text": "Literally lose trade leverage if they announce. They are asking around for trades.", "label": 1}
{"text": "Pussy", "label": 1}
{"text": "Kyler Murray got hit in the head by Anthony Davis pass", "label": 1}
{"text": "Looking at timelines of similar injuries and firsthand experience of breaking my fucking leg. Not just reading tweets like my head is full of cotton candy", "label": 1}
{"text": "Woah dude, that makes no fucking sense but I'm surprised you know what a barometer is.", "label": 1}
{"text": "Are you fucking dumb?\n\nI'm saying he will not be on Concussion Protocol because he hopefully doesn't have one.", "label": 1}
{"text": "Anyone but the fantasy football show, dude is very douchey and gives bad advice", "label": 1}
{"text": "First Wicks is the next Puka, now Tillman huh\n\nCan always tell who the guys new to fantasy are because they’re always the guys who say “this waiver guy I picked up is exactly like *insert superstar*•\n\nHow’s Wicks worked out? Lmfao.", "label": 1}
{"text": "Fantasy football for republicans, I mean this not as a dig but I studied advertising & marketing, he’s the only ff personality to wear sunglasses during his entire, reference political matters on the channel, it also his work also gives very weird dominance and subservient behaviors reminiscent of cam girls and the like, people doing superchats and what not , maybe that’s just me, I can be more swayed on a draft guide. \n\nHe also orgasms each week when gibbs or bijan do well or have big plays it’s really funny to watch highly recommend checking his story out on sundays", "label": 1}
{"text": "Won 2 leagues last year, wbu small fry? 😂\n\nYou’ll see in time. Wicks was a good gamble, sorry you’re too bad to see it.", "label": 1}
{"text": ">Wicks was a good gamble\n\nlol please come back to reality \n\nYeah dumping your FAAB on the Packers WR4 who has struggled was a good gamble. Lmfao. You crowned him the “next Puka” how many times? \n\nOnce you play enough you’ll learn not everyone is a league winner. Keep crowing every single player the next Puka though it’s hysterical.", "label": 1}
{"text": "Accurate", "label": 1}
{"text": "punished the owners", "label": 1}
{"text": "Is he still on waivers in your ultra competitive 6 team league? Snatch him up boss", "label": 1}
{"text": "R. Stevenson \n\nMy backs currently: Jacobs, Barkley, Taylor", "label": 1}
{"text": "Nice L take", "label": 1}
{"text": "Can’t believe some taco dropped deebo.", "label": 1}
{"text": "[those are just the season passing numbers statmuse does not have those kind of statistics](https://www.pro-football-reference.com/years/2024/passing.htm)", "label": 1}
{"text": "Who’s 🧠 thomas?", "label": 1}
{"text": "Wont be to end the season.", "label": 1}
{"text": "Yes", "label": 1}
{"text": "😂😂😂", "label": 1}
{"text": "No he might as well be the quarterback on that play. If you’re not punting or kicking it’s not special teams. I’ve never seen a fake punt/FG touchdown count as points for the D/ST and highly doubt chase sanders TD for the dolphins was counted as points for the dolphins special teams.", "label": 1}
{"text": "Bro always got the worst takes lmao. \n\nDude can’t even stay on the field, much less challenge Jacob’s for any significant carries. Zero chance he’s relevant this year.", "label": 1}
{"text": "Oh god not the worst takes guy on his 10th alt account", "label": 1}
{"text": "I’m on my first account and will chime in to confirm that is a bad take", "label": 1}
{"text": "Good analysis", "label": 1}
{"text": "There is still plenty of games left, stay the course. Your WRs are great, now that their situations are improving; Burrow is a stud. I don’t think you need 3 QBs, so drop them to deepen your bench. You need better RBs though. Rhamondre is so inefficient and Chuba could be in a time share with Jonathan Brooks. You could consider a 2-for-1, where you sell high on Rhamondre and package him with a bench option like Jennings to get an even better RB.", "label": 1}
{"text": "Yeah Diontae going to a team that can hardly support one fantasy relevant WR is gonna help his fantasy value. Lmfao\n\nBetween this and “Wicks is the next Puka” I’m starting to think you aren’t actually watching games lmfao", "label": 1}
{"text": "Just obliterated both your arguments with a single response. \n\nWhat are you even on about?", "label": 1}
{"text": "Lmfao you never fail to be confident even when you’re wrong I’ll give ya that", "label": 1}
{"text": "My bad for telling people to start Tillman last week ig", "label": 1}
{"text": "Bum", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Ljax owner. I’m so hard right now", "label": 1}
{"text": "And you’re desperate for a damaged 29 year old RB on arguably the worst team in the league to save your season 😂\n\nShows how much you know, bro", "label": 1}
{"text": "> worst team in the league\n\nBruh stop telling on yourself. They just beat the Ravens lmfao.", "label": 1}
{"text": "You’re coping so hard that you’re trying to argue that the Browns are good 😂😂😂\n\nIf I’m ever down this bad, I hope someone puts me out of my misery", "label": 1}
{"text": "So you’re standing by the worst team in the league statement? Yikes.", "label": 1}
{"text": "Yes, I read what you said… dickhead. You are correct, but what I argue is that it’s nothing special based on the combined stats of other teams running backs.", "label": 1}
{"text": "But them in the IR spot and then BAN yourself.", "label": 1}
{"text": "Other people are probably using IR slots", "label": 1}
{"text": "I just traded Tank Dell and Bucky Irving for DK Metcalf. PPR 14 man.", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Same tbh.", "label": 1}
{"text": "Burrow, Cousins, Carr, or Lawrence", "label": 1}
{"text": "I've been stashing Darnold", "label": 1}
{"text": "Nearly lock for playoffs but worried about regular season matchup 4 weeks from now.... hmmm", "label": 1}
{"text": "Go grab Jalen Coker.", "label": 1}
{"text": "It is not better than Carolina, fantasy wise, and now I know you are fucking idiot if you think Zay is worse than DJ", "label": 1}
{"text": "It’s absolutely better than Carolina lmao. Likewise!", "label": 1}
{"text": "%40 have Travis kelce 😏", "label": 1}
{"text": "Incredibly common internet janitor L", "label": 1}
{"text": "We do know. Nico is back after next week, no one will be fantasy relevant for the receiving group except Nico and maybe Tank. Anyone who thinks otherwise is an idiot.", "label": 1}
{"text": "Downs > Cedric > Keon", "label": 1}
{"text": "Believe in yourself!!", "label": 1}
{"text": "Downs #1 if Flacco starting imo\n\nDowns, Tillman, Coleman.", "label": 1}
{"text": "Would go for downs as first priority, Tillman, Coleman.", "label": 1}
{"text": "Going great sweetie 😘", "label": 1}
{"text": "You tell him! Mods might give you a chance to become one", "label": 1}
{"text": "Oh, you're an idiot. I get it now.", "label": 1}
{"text": "Lol wtf? This is a completely delusional comment. ", "label": 1}
{"text": "The horrible attempt at humor on every single post. Yet it’s still upvoted a lot which I guess is just a sign of where the majority of people are intellectually speaking. \n\nLike I genuinely have no idea how people can find the same shit funny over and over and season after season. Examples like “oh he’ll have 150 yards and 2TDs? That’s cool what about the second half” or “X player just did amazing and it’s because I dropped him. You guys are welcome” followed by “thanks for your sacrifice”. \n\nLastly as an athlete myself I can’t help but cringe at the “he’s a jag” or “he’s a bum” comments from people on here. Like come on how can you write that when most likely you’re either skinny, fat, skinny fat and fragile and most likely have no athletic ability or muscle yet you’re calling a professional athlete a bum? Incredible lack of self awareness. \n\nWith that said, every year this sub has good information that can help you out. Just have to ignore the terrible humor and stupid comments but you’ll definitely find gems of information here every year. ", "label": 1}
{"text": "Anybody know anything about stat corrections on nfl.com for the early weeks happening today/yesterday? \n\nGot a pop-up several weeks ago that they had trouble correctly tracking the QB Hits (we play with IDP) and updated the scoring. Because of that a game from Week 2 flipped. However, as of today the same game flipped back, impacting the overall standings but there's no explanation anywhere on why that happened.", "label": 1}
{"text": "Hopkins @ 36 🤨\n\nI’m starting him over DJ Moore @ 22", "label": 1}
{"text": "Pittman was dropped. Worth dropping Pop Douglas for Pittman now that Flacco is starting? No brainer, right?", "label": 1}
{"text": "also just... FUCK no", "label": 1}
{"text": "Dak has no mobility. He's not running outside of the pocket to make plays, and when he does, he's inaccurate (almost led to another interception). If you can sell him to someone, go for it. \n\nCeedee is just great. If McCarthy gets his head out of his ass he'll realize a short passing game is far better than his run game. Ceedee will get peppered with targets. \n\nThere is no run game in Dallas. And if there was, dowdle must not have agreed to whatever sex party that Jerry Jones forces his players to do, so he got inexplicably benched for two old men holding onto their youth by the power of prayer. \n\n\nDeebo was good, but he wasn't great. Not unusual with him being so badly sick the week before. \n\nGjuerendo (whatever I'm not fixing it) is a good running back. He and Mason will definitely eat in to cmac for at least the first week, until cmac goes God mode once again. \n\nKittle is a fucking beast and I'm so pissed I didn't grab him.", "label": 1}
{"text": "awful rankings... Goff at 17 feels like chatgpt put this together.", "label": 1}
{"text": "I mean it is Matthew Berry.", "label": 1}
{"text": "If you’re an idiot maybe.", "label": 1}
{"text": "You dropped your dunce cap buddy", "label": 1}
{"text": "Yeah I dropped it for you.", "label": 1}
{"text": "Haha you’re cute", "label": 1}
{"text": "Tacos gonna taco.", "label": 1}
{"text": "Hey fuck you!", "label": 1}
{"text": "Is it a paid or free league? \n\nI'd make a waiver for his good players.", "label": 1}
{"text": "What's the process of that? Does he have to go through the normal procedures and all other teams agree not to take any of those players? Or is there a way he can just force all the players back on the team ", "label": 1}
{"text": "Hi gay", "label": 1}
{"text": "I'm not, but the guy behind me is.", "label": 1}
{"text": "10 team standard\n\nMy Jordan Mason + Isaac Guerendo + Tyler Lockett for his Raheem Mostert + Jameson Williams\n\nMy other RBs are Connor + Achane and… that’s it. Looking to pair up Achane and Mostert.\n\nOther team has been holding CMC all season, and I’d be giving him all the handcuffs, plus Lockett for Jamo to spice it up.", "label": 1}
{"text": "Nobody likes you.", "label": 1}
{"text": "It’s because they play on Thursday so he wouldn’t be available to pick up before then; Forcing it to be pushed to next waiver day.", "label": 1}
{"text": "I'd say this was a waste  of time DJ", "label": 1}
{"text": "hooker szn", "label": 1}
{"text": "How do we feel about Downs ROS? WR2?", "label": 1}
{"text": "Canalas is a sex, porn, and booze addict. Dude raw dawgs randoms and then his wife. Has kids at home too. Fuck this guy.", "label": 1}
{"text": "Fire stedansky. This guy sucks", "label": 1}
{"text": "Got offered Wilson and Downs for Amon.  Was thinking of countering to Amon and Mason for Wilson, Downs, and Mattison.  Am I getting fleeced?", "label": 1}
{"text": "And seasoned with those peppers inside him.", "label": 1}
{"text": "Are you in need of an extra receiver? Also if CMC comes back, getting Mattison is in your favor. So I guess it depends, if getting the two receivers helps your situation I say it’s a decent trade. Downs is underrated especially with Flacco back.", "label": 1}
{"text": "assuming that's u/PolarNewt, who is on his 4th or 5th alternate account that he uses to troll and dm people when he doesn't agree with them\n\n  \nfunniest part is he's almost always wrong too haha", "label": 1}
{"text": "Smooth brained mother fucker", "label": 1}
{"text": "I actually haven't had taco bell in close to 15 years. But, if we're going there, gut biomes adapt, so if you're eating taco bell and it doesn't affect you at all, that probably just means you're eating like shit all the time. People whose guts can't handle taco bell aren't \"weak\", they're just healthier than you", "label": 1}
{"text": "No I'm just not a huge pussy and my body doesn't freak out when I eat something slightly out of the ordinary like a bitch", "label": 1}
{"text": "I don’t respect grifters", "label": 1}
{"text": "Well your just dumb", "label": 1}
{"text": "This is literally a post about paying for a subscription. So no, they aren’t “just giving it to you”. They’re grifters.", "label": 1}
{"text": "I would try toggling off of STD. Most think it means Standard, but actually means Sexually Transmitted Disease", "label": 1}
{"text": "You're*", "label": 1}
{"text": "Should i trade for Adam's?", "label": 1}
{"text": "They're terrible. Absolutely not", "label": 1}
{"text": "I’d do it", "label": 1}
{"text": "I WILL NOT be starting him. ", "label": 1}
{"text": "Dropping Brock Bowers as my back up TE. Did it at the beginning of the season and I have since regretted it. Didn't think he was going to be as good as he has been. I did it because I needed to switch out defenses and didn't want to drop the ravens defense (I thought they were better than they are) at the time which in hindsight I should have just done.", "label": 1}
{"text": "Ok but I’m right", "label": 1}
{"text": "Got tired of randoms looking through my post history grasping at straws to discredit blatant facts.\n\nNot dissimilar from your comment!", "label": 1}
{"text": "> your YAC comment 1000 times\n\nLegitimately the first time I’ve included YAC in a comment ever. Just search with my username for it.\n\nYou’re grasping so hard at straws you look silly lmao. Enjoy your roster clogger!", "label": 1}
{"text": "its a fairly level trade", "label": 1}
{"text": "Probably only trade him for Aubrey tbh", "label": 1}
{"text": "he sucks at pass blocking, hes useless to real football", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "I can't stress enough just how important it is to network and be a sincere, good person. \n\nGo out of your way for others, until they give you a reason not to. But give them the benefit of the doubt. \n\nI'm 20 years into my professional experience, and I. Can't tell you just how many people reach out to me for things, people, or opportunities. \n\nBe friendly, be amicable, and be sincere. It's ok to be vulnerable, too. So many people share in their experiences, good and bad.", "label": 1}
{"text": "Would yall trade Josh Jacobs and Tee Higgins for Nico Collins and Tyrone Tracy? My only other starting RB is Breece, who’s been disappointing, but adding Nico to my corp of Deebo, Downs, JSN and Tillman could be deadly", "label": 1}
{"text": "Can you wait for them to get healthy? If you do that trade you're essentially punting 2-3 weeks", "label": 1}
{"text": "Activate him you fucking cowards", "label": 1}
{"text": "Niceeeeeeeee", "label": 1}
{"text": "It’s Thursday my dudes", "label": 1}
{"text": "Trade conner burrow Coleman for kamara mostert? I only start conner since I have daniels and terry,kupp,amonra", "label": 1}
{"text": "Double teamed a stripped bitch on Saturday and she wasn’t having fun either", "label": 1}
{"text": "Index but yes obviously take it", "label": 1}
{"text": "> This is the same knee as was previously injured, per team official", "label": 1}
{"text": "You have too much fucking time on your hands", "label": 1}
{"text": "Javonte Williams, Njoku, worthy for Najee, MHJ, and McBride I’m getting the Najee side.", "label": 1}
{"text": "gsdf", "label": 1}
{"text": "yes", "label": 1}
{"text": "Aaron your offense is outdated and shit", "label": 1}
{"text": "What a fucking idiot lol", "label": 1}
{"text": "are you fucking shitting me stroud you're fucking fairbairn", "label": 1}
{"text": "NFL Streams:\n\nNFL Week 9:", "label": 1}
{"text": "are the rodger c*ck suckers done defending him yet?", "label": 1}
{"text": "You guys remember when people thought Wilson was garbage?", "label": 1}
{"text": "fuck ur rodgers", "label": 1}
{"text": "What’s that have to do with Davante’s possible concussion?", "label": 1}
{"text": "DOINK", "label": 1}
{"text": "You fucking piece of shit!!!!", "label": 1}
{"text": "Going to fucking drop that piece of shit Fairbitch ", "label": 1}
{"text": "Fucking nothing. That guy is a moron.", "label": 1}
{"text": "Davante Adams was traded to the NYJ and subsequently people had the opinion Wilson was done.\n\nYou playing dumb or actually dumb?", "label": 1}
{"text": "See reply to the other guy.", "label": 1}
{"text": "Considering by rule that is a touchdown that’s just you being dumb buddy", "label": 1}
{"text": "Ya, cuz this time you left out the name “Davante” which is relevant.\n\nStill can’t tell if you’re actually dumb or playing dumb. Please decide.", "label": 1}
{"text": "End this fucking game man, my opponent is about to get a garbage time Tank Dell TD and I’m going to end it all", "label": 1}
{"text": "I've seen this guy make some of the toughest and most contested catches ever. He's waaaay better than we give him credit for", "label": 1}
{"text": "That’s probably the only way you’d ever get some 🐱", "label": 1}
{"text": "This is a 12 pack Sam Adams post", "label": 1}
{"text": "Literally don’t even know who you are. You good?", "label": 1}
{"text": "Kyler", "label": 1}
{"text": "Baker", "label": 1}
{"text": "a bit odd since they listed brooks as questionable, not doubtful", "label": 1}
{"text": "yes he's listed as FP", "label": 1}
{"text": "Brandon aubrey or cameron dicker?", "label": 1}
{"text": "i think gesicki finally gets a TD this week, its the raiders lol", "label": 1}
{"text": "14 teams, 0.5 PPR\n\nWelp I was gonna try and have one of Singletary/Brooks as my Week 9 RB2 but that’s gone up in flames over the past hour. With Tracy trending towards playing this week I probably gotta drop Devin at this point. The pickings are rather slim in this 14 teamer though:\n\nElliot\n\nChandler\n\nRoschon\n\nKendre\n\nVidal\n\nE. Wilson\n\nBenson\n\nCorum", "label": 1}
{"text": "what about fantasy experts? that job seems easy af to do", "label": 1}
{"text": "An edit: https://twitter.com/StuJRams/status/1852411237973536867\n\n> Will be listed as questionable for Sunday’s game at Seahawks, but McVay said he wouldn’t bet against the WR playing", "label": 1}
{"text": "But you didn’t know that for sure yesterday dumbass, need to call you a stormtrooper for how bad you miss", "label": 1}
{"text": "Source: told ya", "label": 1}
{"text": "The quote is technically correct. Tee just makes waiting for those games really difficult.", "label": 1}
{"text": "when he was suckin chase browns dick", "label": 1}
{"text": "every day we fall further from god’s grace", "label": 1}
{"text": "Hahahaha", "label": 1}
{"text": "You had the choice to just not write this out or post it", "label": 1}
{"text": "OK that was a good one", "label": 1}
{"text": "And yet here we are", "label": 1}
{"text": "ye tarnished are godless", "label": 1}
{"text": "you mean guessed", "label": 1}
{"text": "Catching, not pitching?!", "label": 1}
{"text": "https://www.reddit.com/r/fantasyfootball/s/9aEwrI3Clx\n\n🤷‍♂️🤷‍♂️🤷‍♂️ you’ll learn", "label": 1}
{"text": "Your league is stupid.", "label": 1}
{"text": "yasss", "label": 1}
{"text": "he needs to rest more tbh", "label": 1}
{"text": "determined af", "label": 1}
{"text": "that was like faaast fast??", "label": 1}
{"text": "That why you always flex the player that plays last no matter the position", "label": 1}
{"text": "what is happeninggg???", "label": 1}
{"text": "I prefer getting blowjobs, but oftentimes I can't climax from it. It's usually a precursor to a very quick PinV penetration orgasm. \n\nI don't know if it's a mental block, or if the blowjobs in getting aren't taking me away from what I'm thinking through, or if perhaps I'm just not one to orgasm unless I'm putting in the work, though to be fair, I have climaxed quite a few times recently while she's on top and doing the work. \n\nI dunno.", "label": 1}
{"text": "I once ejaculated on a ladies backside and then wiped it off, but that was after I peed in the toilet to clean out my pipes. \n\nShe didn't like having to eait", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Darnold or cousins?\n2 of doubs, chestnut, brob. Full PPR\nTyia!", "label": 1}
{"text": "Coin flip for the QBs. I like Darnold more at home especially with Hock back\n\nI’d roll with Doubs, Robinson but if Robinson (hammy) is out, Chesnut obviously", "label": 1}
{"text": "Thanks!!", "label": 1}
{"text": "I believe it's spelled 'Autism'", "label": 1}
{"text": "“Stalker” nah you’re just in literally every thread making the most casual takes in the sub and being a dickhead about it lol ", "label": 1}
{"text": "FUCKIN QUEEEEEEEEEERS", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Pay at the beginning of the season or you don't play", "label": 1}
{"text": "Shirley, you can't be serious.", "label": 1}
{"text": "Long live the post-Dan Snyder era!! 20+ years of hell, the man can't even run a successful burger stand or amusement park, who the hell thought he could run a professional football league? He is a stain on DC, a black mark... and we will curse his name for generations due to the stories we imbue our children with.", "label": 1}
{"text": "This is the new Skins... we don't pick up MF'ers on the last year of their contract anymore.\n\nNo Deons, No All Days, No Fitztragics, No McNabbs, No anyone!! That was Dan, not us anymore! Fuck outta here.", "label": 1}
{"text": "Hail brother....", "label": 1}
{"text": "Cooper Kupp to the Skins... calling it.", "label": 1}
{"text": "Not gonna pass, pun intended.", "label": 1}
{"text": "ABD!", "label": 1}
{"text": "Truth. Hopefully the players come.", "label": 1}
{"text": "Ayiuk in DC would be 2/3/0", "label": 1}
{"text": "Gesicki over Ertz?", "label": 1}
{"text": "lol this is delusional. You compared them to Kyren and Puka. Dont change your argument now.\n\nYeah bud keep getting literally everything wrong and being the laughing stock of the sub. Try to be self aware lil man, when you’re getting literally every take wrong, you can’t keep pretending you’re smart. ", "label": 1}
{"text": "10 team ppr. \n\nErtz or Gesicki?", "label": 1}
{"text": "Oh fuck off Zamir White, you fucking vulture. ", "label": 1}
{"text": "I hope carr gets his knee broken", "label": 1}
{"text": "Derek Carr should be executed at the stake for legitimately ruining this guys career and life", "label": 1}
{"text": "Honestly would make my day if Derek Carr killed himself", "label": 1}
{"text": "I’m fucking dropping Allen, fuck this bum", "label": 1}
{"text": "Kick it with Aubrey stupid cowboys", "label": 1}
{"text": "In the hearse as of 30 seconds ago", "label": 1}
{"text": "My London vs his Mooney.. I’m sick", "label": 1}
{"text": "Dowdle you beautiful son of a bitch.", "label": 1}
{"text": "Let’s goooo started Quinton Morris in my 64 man league 😫😫😫", "label": 1}
{"text": "Hollins is a menace nobody has him use Shakir you asshole", "label": 1}
{"text": "Yeah, you imbecile.  They're just getting the ball for the first time.", "label": 1}
{"text": "Bro smd I’m not watching the game", "label": 1}
{"text": "Gay", "label": 1}
{"text": "I hope you get publicly executed Marvin", "label": 1}
{"text": "Kyler is a fucking dumb fuck, stupid midget fucker", "label": 1}
{"text": "I pray all jag players burn in hell", "label": 1}
{"text": "Fuck *you", "label": 1}
{"text": "Fucking cunt", "label": 1}
{"text": "You’re still garbage Trevor", "label": 1}
{"text": "yep.", "label": 1}
{"text": "You were saying?", "label": 1}
{"text": "Make America Great Again baby", "label": 1}
{"text": "26.68 PPR for Sutton this week.", "label": 1}
{"text": "FUCK YOU GENO", "label": 1}
{"text": "JSN you sick fuck", "label": 1}
{"text": "Damn, really hurt your feelings bringing up stats, did I?", "label": 1}
{"text": "That Postmates commercial literally says they charge fees unless you spend $50. Fire that marketing team.", "label": 1}
{"text": "Down 44 with JJ and Vikings defense.. I’m cooked", "label": 1}
{"text": "He has an annoying face.", "label": 1}
{"text": "Use the index you moron. Stop asking here.", "label": 1}
{"text": "Anyone else think that CJ Stroud looks like Eyeore from Winnie the Pooh?", "label": 1}
{"text": "Oh shit, ok. My bad.", "label": 1}
{"text": "Anyone who was bored enough to watch the entire game could see that he had almost all of his yards on the last couple of drives when the chargers were totally relaxed in garbage time.", "label": 1}
{"text": "Yes AR was and always will be a mediocre quarterback. But have you forgotten that he’s black? That’s all that matters nowadays. Black quarterbacks are trendy. \n\nThat’s why they didn’t let Joe Burrow play at Ohio State even though he was twice as good as the quarterbacks they were starting. \n\nThe Colts would rather lose games with a black quarterback than win games with Flacco.", "label": 1}
{"text": "Yeah i think hes legit. Good body control, and may be playing behind for a few of their games ROS. Hes a priority for me to try to get this week. I think he could be top ten ROS", "label": 1}
{"text": "Fuck Reichtarded missed", "label": 1}
{"text": "Fucking idiot. Thanks for nothing you fucking bum. You have ONE job!", "label": 1}
{"text": "LOL, commentators talking about Richardson being tired... then they show him yawning on the sidelines.", "label": 1}
{"text": "Fuck you Reichard. YOU HAVE ONE FUCKING JOB!", "label": 1}
{"text": "Said it before, Reeba must give the best sloppy domes out there for her to still be relevant at her age.", "label": 1}
{"text": "I'm still upset NOFX retired.", "label": 1}
{"text": "My Sam to Hock stack needs this tuddy.", "label": 1}
{"text": "Go away Akers", "label": 1}
{"text": "Cool cool, now Jones", "label": 1}
{"text": "He'll throw a tuddy to Hock, just watch.", "label": 1}
{"text": "CJ Stroud = Eyeore from Winnie the Pooh", "label": 1}
{"text": "Yes! No Romo", "label": 1}
{"text": "I'm sure he thinks you are the pillar of society.", "label": 1}
{"text": "Please no Darnold to Hock TDs, nope... don't need it.", "label": 1}
{"text": "If he was asked to clean up cum stains in a Porn Theater, he may take your job.", "label": 1}
{"text": "Darnold+Hock = success", "label": 1}
{"text": "So 1 Hock TD tonight is a myth just like Ragnarok?", "label": 1}
{"text": "Goddammit. My 117.5 to his 119.1 tonight.  \n\nHis Kelce to my Butker tm... gonna hate this.", "label": 1}
{"text": "Mods please leave this up", "label": 1}
{"text": "Yah buddy we all do that", "label": 1}
{"text": "Aw shuck, laddey.", "label": 1}
{"text": "I’m sorry for you dude, I fucked up this week too\n\nHowever the comments on this are funny as fuck so", "label": 1}
{"text": "It’s a game of luck, and you don’t have any.", "label": 1}
{"text": "Ngl what league has Mooney and Meyers on waivers at this point in the year?", "label": 1}
{"text": "Yes. A tome for this sub to reflect on for all week", "label": 1}
{"text": "I remember my first time…", "label": 1}
{"text": "I actually made a lot of right calls. Holy shit I feel like some sort if Savant.", "label": 1}
{"text": "Next time just turn your phone upside down and then you’ll make all the right decisions since it’s opposite", "label": 1}
{"text": "12 hours?? Jesus christ dude take a walk outside", "label": 1}
{"text": "See you next Sunday lil bro", "label": 1}
{"text": "12 hours ya and got it all wrong apparently", "label": 1}
{"text": "How does this comment even have upvotes? Lmao. Underhill is one of the most respectable reporters in all of NFL. He's 0 bullshit kind of guy. Do everybody a favor and delete your comment where you project your ignorance ", "label": 1}
{"text": "Because he didn't interject with his own opinion on Ceedee's injury afterwards you dumbass. Come on now lol", "label": 1}
{"text": "Weird comment. How’s that “Lul comparing Tillman to Puka” take aging for you?\n\nBro getting left in the dust per usual 😂", "label": 1}
{"text": "This is good insight. I hope everyone learns from this post. :)", "label": 1}
{"text": "Last time I see you, you had just ripped a guy's throat out with your bare hands.", "label": 1}
{"text": "CD, Nabers, and Rice here. Luckily Mooney and Sutton have stepped up for me.", "label": 1}
{"text": "I mean I traded Devin Singletary, Wan’Dale Robinson, and Rhamondre Stevenson for Brian Robinson Jr. cuz I’m in a dynasty league and they were just rentals (outside of Singletary) that I was using till my actual drafted guys became healthy again, unfortunately my team got injured again so my season is over but since it’s dynasty my team will be insane next season the RBs I got alone are insane (Pacheco, Robinson Jr, Harris, and Chubb) and my season is only over cuz I’m tanking to get the number 1 pick to draft Ashton Jeanty coming outta college", "label": 1}
{"text": "That’s what happens when your girl votes for kamala", "label": 1}
{"text": "Shut up dummy", "label": 1}
{"text": "Booooo", "label": 1}
{"text": "Haha", "label": 1}
{"text": "I just wanted to get downvoted into oblivion. Already losing my fantasy matchup by 50.", "label": 1}
{"text": "KHunt owners coping rn", "label": 1}
{"text": "He deserves this for killing my rice", "label": 1}
{"text": "Trash website", "label": 1}
{"text": "It's literally not, though? Do you know how to read?\n\n> Las Vegas Raiders star receiver Davante Adams shocked the world on Tuesday when he reportedly told the team he \"prefers to be traded\n\nWith multiple links to reporting on his trade request.\n\nThen if you can manage to read a little further down...\n\n> ESPN's Adam Schefter reports that Adams would prefer to play with a quarterback he knows.\n\nOh damn, and will you look at that - if you continue down the page there's even more reporting on potential trade destinations, including ones that were out of the running:\n\n> NFL insider Jordan Schultz reports that the Cowboys are not interested in trading for Adams.\n\nAll with links to sources reporting on the situation.\n\nWeird. What sources were there in the ETN article, again?", "label": 1}
{"text": "Again, I implore you, try reading \n\nThere is reporting for everything: Davante's trade request, his preferred destinations, the teams that were and were not interested in trading for him. From top to bottom, there were sources for almost every rumor around his potential trade. \n\nFind me one single credible source that's reporting on ETN being traded. Not a beat reporter speculating to pad his article count, but a credible insider saying \"ETN is on the trade block\", or even \"X team is kicking the tires on an ETN trade.\"\n\nJust find me one example that's not a opinion piece saying the Jags *should* trade him, or so and so team *should* trade for him.", "label": 1}
{"text": "Fucking hell just take a knee you almost turned it over you morons", "label": 1}
{"text": "The dude being carried across the field by teammates? Fuck off", "label": 1}
{"text": "no fucking shit.  you were always favored to win.  why post ?", "label": 1}
{"text": "What work? ", "label": 1}
{"text": "Stop hiding coward", "label": 1}
{"text": "Cya", "label": 1}
{"text": "Bye ✌🏽", "label": 1}
{"text": "It's just a game, dude. You nailed it with your last point, treat it as an activity to stay in touch with your buddies.", "label": 1}
{"text": "That’s way too much for my tastes. I’d hate playing if I was in 6 leagues.", "label": 1}
{"text": "That's actually a good idea for a weekly league, I'll bring it up in chat and would rejuvenate the guys who are losing bad already.", "label": 1}
{"text": "Man, that was an omitted part from your post. 5-6 sounds like a lot. I would say reducing down to only the league(s) with friends would help you", "label": 1}
{"text": "This happened to me when I was in too many leagues. When I cut down to just 1-2 that I really cared about, the season was much more enjoyable", "label": 1}
{"text": "Sounds like you need to do some best ball.  Excitement of the draft without having to figure out which of 5 guys that will score 11 points to put in the Flex.", "label": 1}
{"text": "I quit for 5 years and now im back stronger than ever", "label": 1}
{"text": "Yah that's probably why I'm getting burnt out, I'm treating it more like gambling than bs'ing with buddies.", "label": 1}
{"text": "Man as a person you seem like you SUCK lmao I’m glad I’m not your friend. Good night.", "label": 1}
{"text": "coo", "label": 1}
{"text": "He also started Will Reinhard this week. I woke up this morning sweating to the sound of the doink he did kicked last night.", "label": 1}
{"text": "Well there’s your mistake.", "label": 1}
{"text": "This is kind of me with the Fantasy Premier League and I think it's because my friends and I don't have the bandwidth to manage it anymore.\n\nI watch the games religiously but fantasy sometimes is too upsetting.", "label": 1}
{"text": "lol I played Reichard and benched DHop. Luckily I won 130-86 and just jumped to first place at 6-3 due to highest PF. For now fantasy is fun…", "label": 1}
{"text": "I started my fantasy career waaaaay back in college.  Graduated, started work, and our league just sort of fell apart as everyone suddenly had girlfriends, wives, and work to balance.  I guess you don’t realize it, but sports seasons are calmer when you’re not constantly thinking about line-ups, waivers, and tracking teams/injuries.  I probably stopped for about a decade until I was invited to participate in a work league.  The drafts were fun as we’d grab a conference room at lunch (and maybe a pack of beers) and live draft all in the same room.  But I’m hyper competitive and would fixate on close losses, incorrect line-ups, and stupid stuff like being one of the highest scoring teams but just having rotten luck by playing someone who got lucky and went off in a given week all while the guy with the lowest scoring team would squeak by because he also had the fewest points against.  For better or for worst, the work league sort of faded as we got promoted, people left the company, and whatever else in real life.  Fast forward and after Covid I switched jobs.  My new place had some familiar faces and they volunteered me to start up our old work fantasy league.  But after the first season, I was already burned out by the same issues I faced before.  It’s not that I’m bad, I make playoffs more seasons than not and I’m on top of making in-season moves/pick-ups.  But again, I take things too seriously and sap the fun out of it for myself.  I think there’s an element of being commissioner that’s extra effort as well.  Collecting buy-ins, managing payouts, ensuring that managers remain active, etc.  (I know people think if a manager stops playing, then it is what it is, but I hate when managers give up and suddenly players on bye or IR get left as starters).  Anyways, I stepped aside as commish for season 2, found a replacement for my spot, and washed my hands of the stresses of it.  I didn’t make it beyond week 2 of the new season before I was checking on my co-worker (who finished in last place previously) and started offering advice.  By week 4 I was added as co-manager and completely controlling his teams player decisions.  It’s honestly more relaxing and more fun not stressing about buy-ins and end of season winnings.  For me now, the joy is managing in the shadows and taking his last place team to the playoffs.  The office league Cinderella story if you will.", "label": 1}
{"text": "3rd year in a casual work league but I love it because it got me into football. Now I am watching 4-5 games a week. First year joining a second league. Love FF more than ever and am dominating my work league at 6-3… last year I finished 5-9! So this has been a comeback/revenge tour :)\n\nRolling over my opponents with Henry, Kyren, Amon, DK, Kupp, McBride, Denver/Chargers D, Boswell, DHop and Darnold/Geno. Just traded for JT 10 days ago and almost broke my league.", "label": 1}
{"text": "It was obvious it would happen. Achane his rookie year produced more than CMC did his rookie year, anyone who wasn’t on board with him becoming even better is a straight up retard.", "label": 1}
{"text": "one of us :(", "label": 1}
{"text": "Soft like AR15", "label": 1}
{"text": "It's the same for me. I am playing fantasy for 10 years. I am the comissioner of the league, the most engaged player and I am hyped for each years draft. I love reading about the statistics of the players and the buzz in camp. I love the math behind it. But after the draft the excitement just drops. There is simply no point in staying really engaged as the game is 90% luck after all. The only reason I stay tuned is simply addiction to winning/gambling. And thats fine as long as I am winning, but if your guys get injured or you just get unlucky by having the most points allowed (in my case both, you can guess) the experience is shit. \n\nI tried to watch single games, but I am not engaged with any team as I am from the EU and there're simply to many breaks to keep it exciting. Watching redzone is like watching it on speed and half of the time you're praying that a QB XYZ passes the TD to your guy and not the one of the opponent. So you're not rooting for the game, but a specific outcome. \n\nI am running the league to keep this 10 guys who partly don't see each other together. However, most season I watch the games alone as I moved and the experience is either one game(=lame) or many games(=emotional rollercoaster). \n\nThis year I really engaged as comissioner to make the experience more engaging: I thought of a small prediction game with a price, I keep the group chat alive, but in the end I feel the tiredness after 10 years of the lottery. \n\nIf anyone has a tip for making it exciting again you're welcome.", "label": 1}
{"text": "Do you feel like best ball takes a bit of the luck element out of it? Especially this year I feel like a have very solid teams but every week there’s just some dude in my opponent’s team that has a season high score", "label": 1}
{"text": "So are you in a few money leagues with strangers and not friends?", "label": 1}
{"text": "I only have 1 friend league and 4 Randy's, although it's mostly the same players as last year.", "label": 1}
{"text": "Exactly how I feel, this year I have made more trades than ever and it's still not enough to keep me engaged. And I too watch RedZone hoping my player gets a TD but after 3 hours of RedZone I feel like it's a complete waste of time and I turn it off and stop caring if I win or lose. I think I'm gonna pull back out of all the leagues except my friend one and only spend minimum energy doing research etc..", "label": 1}
{"text": "Bruh it’s been that year for me.. I’ve had like 4-5 game where I was top 3 in scoring in the league those weeks but was happened to play the one guy that scored higher than me that week.. I’m 3-6 and should easily be 6-3 and maybe even 7-2.. strength of schedule has been insane this year for me but that’s fantasy sometimes lolol", "label": 1}
{"text": "Well I'm in a hockey one which I've won the last 2 years in a row and I don't know shit about hockey. I just drafted based on expert rankings on the web and check it each day for 5 minutes to see if I need to change the lineup. Maybe I'll take that strategy in FF next year and do no pre draft research and follow expert rankings. So far in hockey I'm 3-1 with the second highest scorer in a 13 team league. So don't know what you would hate to see from me. I just don't care about bball or baseball to even consider fantasy there.", "label": 1}
{"text": "I read more comments and see now that’s not ur problem so I apologize.. I agree and think what you’re describing is the only part you like is the draft so found weekly fantasy is definitely a good solution for ya", "label": 1}
{"text": "I get it. I also have to reevaluate after the season what I am doing. Now that I am reflecting I am realizing that this feeling started last year, it’s just stronger this year. The game was engaging when I was watching it with my friends. Under the week we were talking about FF and planned what to cook on Sunday. Now, that this is only possible 3 times a season FF also became far less exciting. Sunday football feels more like an obligation, as I want to see how my bets are performing. I think I have to reevaluate what this game is to me", "label": 1}
{"text": "Fantasy football is gambling.. it hasn’t changed from that so I’m confused how you ever liked it if the part you hate is having root for an outcome rather than a team is exactly what fantasy football is..", "label": 1}
{"text": "The weekly variance for sure, yes.  The amount of players on your team needs to be increased on all platforms though as it becomes a war of attrition sometimes without the ability to add more.  With the injuries and bye weeks and also not everyone you pick is going to be viable.\n\nMany people enjoy the big best ball tournaments cause ‘big prize’ but I prefer the sit n go style where you just compete against the teams you drafted with.", "label": 1}
{"text": "The Raiders should not be buying right now lol. They better not fuck up and win enough to drop out of the top 5, they need to be in full rebuild mode", "label": 1}
{"text": "He was the WR1 when he got hurt...I generally hate it when people say this, buttt...taco league right there.", "label": 1}
{"text": "Is there anybody with IDP leagues that has any interesting picks? Brian Branch getting ejected made me rethink him at the moment so I'm open for a swap.", "label": 1}
{"text": "One of his highlight videos was in his For You page 4 years ago.", "label": 1}
{"text": "Being that this list is already pretty long and not one person mentioned Bucky Winter Soldier Irving, he’s untradable.", "label": 1}
{"text": "Patrick Ricard", "label": 1}
{"text": "Dalvin Cook", "label": 1}
{"text": "You should get the back up of whoever’s going to get injured in the next few weeks", "label": 1}
{"text": "Dalvin cuccccccc", "label": 1}
{"text": "I picked up Saquon on waivers, check yours to see if he's there", "label": 1}
{"text": "Too many cooks", "label": 1}
{"text": "nice one", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Yes, if the wide open receiver simply stopped his route instead of slowing down he could have made a better play on the bad pass that drew him OB.\n\nIt’s on both of them. We can talk in circles all day about it but it’s still on both of them.", "label": 1}
{"text": "Or I can just open Sleeper and look at who is trending\n\nfuck your trash podcast shilling", "label": 1}
{"text": "I got banned for 3 days for saying this", "label": 1}
{"text": "Lmao 🤣", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Hello! Unfortunately, since your account is under 5 days old, and new account spam makes up a significant portion of all spam, you are not allowed to post in /r/fantasyfootball at this time. Please wait a few days and try again. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Neither", "label": 1}
{"text": "There were zero DBs there to worry about. Mahomes made a bad throw and Worthy made a bad catch. Both things can be true.", "label": 1}
{"text": "Why is Rotowire's write ups and predictions so wrong this year compared to others?\n\nIf I read one more summary hyping up Marvin Harrison Jr I'm going to vomit.", "label": 1}
{"text": "Join our free-to-enter beta tournament launching in a couple weeks – with cash prizes up for grabs!\n\n**Sign up at**[ www.playdraftday.com](http://www.playdraftday.com/)", "label": 1}
{"text": "Thanks! Excited to get the beta in your hands :)", "label": 1}
{"text": "Russ might be able to, but Arthur Smith's offense cannot.", "label": 1}
{"text": "Exactly! Enjoy the thrill of redrafting and saying (thank you and) goodbye to your injured players", "label": 1}
{"text": "Woo, thanks! Excited for you to try it out", "label": 1}
{"text": "Thanks!", "label": 1}
{"text": "I don’t see any practical use for this, nice idea though. Maybe your next idea will be a good one", "label": 1}
{"text": "There is no practical use for it.", "label": 1}
{"text": "Hey, real quick: did ETN get traded?", "label": 1}
{"text": "Dude you need help", "label": 1}
{"text": "Alright cool, just wanted to check.", "label": 1}
{"text": "Join our free-to-enter beta tournament launching in a couple weeks – with cash prizes up for grabs!\n\n**Sign up at**[ www.playdraftday.com](http://www.playdraftday.com/)", "label": 1}
{"text": "Exactly! Enjoy the thrill of redrafting while saying goodbye (and thank you) to your injured players", "label": 1}
{"text": "Yeah, it's very similar to that!", "label": 1}
{"text": "Did you pull a foil Charizard in your pack!? 😜", "label": 1}
{"text": "Yeah, we released it to a handful of people earlier in the season before this broader beta release. Don't worry -- you'll get it soon :)", "label": 1}
{"text": "Appreciate your opinion -- sounds like I did a good job of doing \"marketing speak\" :)", "label": 1}
{"text": "The tournament is only available to people in the US but you'll still be able to participate in other games!", "label": 1}
{"text": ">  John Harbaugh says Lamar will play Thursday night vs. Cincinnati", "label": 1}
{"text": "We think so too :D", "label": 1}
{"text": "And we're excited to give it to you :)", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "Glad to hear you’re enjoying it 🙌", "label": 1}
{"text": "Henry?", "label": 1}
{"text": "He throws like a girl", "label": 1}
{"text": "Probably the guy with the best receiver in the league right now and not the guy throwing to his tight end and a bunch of tackling dummies. \n\nDafuq kinda stupid question is this?", "label": 1}
{"text": "I have been just running Kyler at QB all season. His bye is coming up, and this week doesn’t look particularly great. Should I stream him anyway or snag a QB for the next couple weeks? 12 team wire has: Jones, Rodgers, Stafford, Maye, Flacco, Nix, Wilson\n\nAll would be serviceable, I guess (even DJ as a streamer into someone else next week). Just wondering if anyone stands out to you.\n\nLove the post! Very informative and clearly more thoughtful than the WW articles telling us to add QJ.", "label": 1}
{"text": "Dan was worthless, still is. I hope he reads this and realizes how bad he failed. Yea he made money out of it all, but he's like a shittier Elon Musk and people hate him slightly less than Elon.", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "yeah so sick of these low quality takes from a hamster behind a keyboard", "label": 1}
{"text": "Lol what a fucking trash webpage", "label": 1}
{"text": "This comment comes up every time this website is posted but I’ve never had an issue with it on mobile or desktop. What makes it trash?", "label": 1}
{"text": "Oh I dunno, formatting, ads, endless scrolling, zero hyperlinks blah blah blah", "label": 1}
{"text": "Opening it on my phone it looks great, better than most mobile sites for use", "label": 1}
{"text": "Unfortunately, your post has been removed. [Please read how our subreddit works before sending modmail to ask why.](https://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines) Thanks. (1001)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyfootball) if you have any questions or concerns.*", "label": 1}
{"text": "It's because so many people have Adblock extensions. if you are browsing it like it on like a phone or Ipad, this website is indeed horrible.", "label": 1}
{"text": "Fk you Kyle and your reports", "label": 1}
{"text": "That has absolutely nothing to do with my comparison or argument lmao \n\nIt’s also LAR not the LAC you inbred. \n\nThe Panthers are going to try and win as much as any other team, if you disagree with you you’re a Neanderthal \n\nChuba is one of their best players and gives them the best chance to win", "label": 1}
{"text": "It’s just an asinine cope comment", "label": 1}
{"text": "I don’t think you do. Coping is all of you children in the comments crying and trying to blame someone for Olave getting blown up by a head-hunting defender.", "label": 1}
{"text": "It’s just a stupid comment. He got drilled on a dirty hit. That could happen any play, and every team utilizes short/medium passes over the middle. \n\nDon’t act condescending when you have no idea what you’re talking about, just because someone on your make-believe football team got hurt. You look like an idiot, and the only people upvoting you have Olave.", "label": 1}
{"text": "Go make another account, you’re already embarrassing yourself on this one", "label": 1}
{"text": "I think you have CTE", "label": 1}
{"text": "They are trying to translate coach speak. It’s double filtered for your pleasure.", "label": 1}
{"text": "yes", "label": 1}
{"text": "You are without a doubt one of the most pathetically stupid dorks I’ve talked to about fantasy football.\n\n\nYour rebuttal to the fact that almost every RB historically is less efficient, less productive and worse statistically as a runner their first year after a significant ACL injury is, *shrugs* “he’s probably fine now” \n\nDid I say all rookie RB’s have experienced this, no I fucking didn’t. I had 3 examples from this season and this draft class that are in comparable situations, you dunce.\n\nHere, let me hold your low IQ ass hand, and make the only arguments against what I’m saying that would result in him being fantasy relevant this season \n\n1. Brooks is in the 1% who plays incredible well only a year removed from an ACL injury and surpasses Chuba \n\n2. Chuba gets hurt \n\nOr he doesn’t play better than Chuba and \n\n3. Carolina feeds him the ball regardless of how he does even if it hurts their chances to win \n\nAnd guess what the only reason is they would possibly do that that..\n\nThey have zero plan to keep Chuba after this season and need Brooks to develop now rather than later \n\nBut still flawed, as most teams like to run their contract year RB’s into the ground \n\nAfter explaining it to you like the Neanderthal you are, can your pea sized brain comprehend why these 3 outcomes aren’t that likely, especially when their current RB1 is a top 10 rusher", "label": 1}
