{"text": "Looks like bacon, broccoli and cheese.", "label": 0}
{"text": "Yes! Patio", "label": 0}
{"text": "Garlic Soup 🧄🥣\n\nIngredients:\n3 heads of garlic \n8 ounces garlic paste\n2 tablespoons olive oil\n2 tablespoons butter\n2 sweet yellow onions, diced\n30 sage leaves\n8 cups chicken or vegetable broth\n3 cups heavy cream\n2 teaspoons turmeric\n1 teaspoon cayenne\n2 lemons, juiced\n8 eggs\n8 slices of bread, roasted\nchives, chopped \n1/2 cup parmesan cheese, finely grated\nsalt and pepper to taste\n\nDirections:\nPreheat the oven to 350°F. Slice the top off the bulbs of garlic so that every clove of the garlic is exposed. Place on a small square of tin foil and drizzle with olive oil. Fold the edges of the tin foil together and twist and make a completely sealed bundle. \n\nPlace the garlic in the oven and roast until it is golden brown and tender, about 60 minutes. Remove from the oven and let cool. \n\nSqueeze the roasted garlic into a small dish. \nMelt the butter in a heavy large sauce pan over medium high heat. \n\nAdd the onions, turmeric, sage, and Cayenne. Then cook until the onions are soft and translucent, about 5 to 10 minutes. \n\nAdd the roasted garlic and the garlic paste and cook, stirring off in, 2 to 5 minutes. \n\nAdd the chicken stock. Cover and simmer until garlic is very tender, about 45 minutes.\n\nUsing an immersion blender or regular blender, puree until smooth and creamy. \n\nAdd the cream in lemon juice. Bring to a simmer. Season the salt and pepper to taste. \n\nLadle one inch of the soup into a skillet and bring to a shimmer over medium heat. Four at a time, carefully crack the eggs into the pan and poach for about 3 minutes. \n\nTo serve, places, slice of toast in each soup and top with a poached egg. Ladle the soup over the eggs and sprinkle with Parmesan and chives.", "label": 0}
{"text": "*Paczki were created to use up the last of the forbidden ingredients of Lent, including lard, eggs, fruit, and sugar. While the fat in paczki dough is butter, the dough was traditionally fried in lard to use it up before Lent.*", "label": 0}
{"text": "mmmm the ones I’ve had are not spongey", "label": 0}
{"text": "Hey there, u/creeperseeker86! Thank you for your submission. Unfortunately, it has been removed for the following reason(s):\n\n**Image Title Rule:**\n\n* The majority of your title (over 50%) must specifically describe the food.\n\n* Avoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\n* Example:\n\n \"[Homemade] Chicken & rice for dinner\"✔️\n\n \"[I Ate] Tonight's dinner\"❌\n\n**Some examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.**\n\n\n\nFor more information, please see the sub rules/wiki/sidebar, or modmail the team. Thank you!", "label": 0}
{"text": "Yummy", "label": 0}
{"text": "Yes please", "label": 0}
{"text": "wow! they look so perfect! I can definitely  eat the whole box..", "label": 0}
{"text": "no u (rizz)", "label": 0}
{"text": "Napoli + olives. I've rarely seen it in Italy and when I do it's usually called \"Siciliano\". It's a great pie, with or without the olives.", "label": 0}
{"text": "Make some yourself: https://www.seriouseats.com/esquites-mexican-street-corn-salad-recipe", "label": 0}
{"text": "one of my favorite baked dessert of all time!!", "label": 0}
{"text": "You will never convince me that tastes better than if it was just cooked.", "label": 0}
{"text": "please tell us your top spots", "label": 0}
{"text": "Raw meat? For breakfast? No, thank you", "label": 0}
{"text": "The method of cooking will always make these have an eggy taste. If you don't like that taste, you won't like these. ", "label": 0}
{"text": "They look so fluffy, giggly and yummy!!!! What flavors were those?", "label": 0}
{"text": "Thanks! Yes, it was delicious. We made oxtail soup from scratch ( it took 3 days) and  we ate it for tea. The bread so crusty and chewy. Gliaden and Glutenin are the two protein components of gluten. When they mix with water you get gluten which is a chewing gum like substance. As the yeast bacteria eat the proteins, they produce CO2 and ethanol. The CO2 is responsible for the bread rising as it is trapped in the dough by the gluten. The ethanol just evaporates off.", "label": 0}
{"text": "Def what I was going for!", "label": 0}
{"text": "Exactly how I ate it!", "label": 0}
{"text": "Why does oyster pizza sound like a euphemism?", "label": 0}
{"text": "Love that!! Perfect", "label": 0}
{"text": "Your sandwiches are worth visiting for. Raw meat and pickled herring. Mein Gott.", "label": 0}
{"text": "Looks delicious! You’ve just made my morning cravings a hundred times stronger.💪", "label": 0}
{"text": "Pickled herring is so goood", "label": 0}
{"text": "Try it, even if weird xP it will be worth it", "label": 0}
{"text": "Corn 3 ways", "label": 0}
{"text": "Hearing my Swedish friends gasping when I’ve just mouthgasmed on a piece of bread with a thick slice of herring and a thick slice of raw onion also adds a lot to the experience. It’s so fackin raw and basic and just simply beautiful. And delicious!", "label": 0}
{"text": "It just does not happen. Mettbrötchen are everywhere.\nThe most dangerous food item in Germany is prepacked cut lettuce.", "label": 0}
{"text": ">mett=meat\n\nI mean, mett **is** meat, but I can understand your confusion if you thought it would be cooked. Ü", "label": 0}
{"text": "Well, it looks delicious, honestly, so I'm glad it cleaned up nicely! No amount of tasty chili would have stopped my crying after ruining my Le Creucet, lol. Damn things are expensive!", "label": 0}
{"text": "Isn’t that what the Crema is for?", "label": 0}
{"text": "This looks like a grapefruit sandwich", "label": 0}
{"text": "I wanted to try these.", "label": 0}
{"text": "Some people just use crema. Some mix crema and mayo. I'd say most of the time it's just mayo.", "label": 0}
{"text": "where are my sweet hawaiian bread rolls at!", "label": 0}
{"text": "Agreed! This is an off-brand I've been abusing for years, so I'm honestly always looking for an excuse to finally upgrade haha", "label": 0}
{"text": "My wife is currently pregnant, I am not eating Mettbrötchen out of solidarity. I really want a Mettbrötchen.", "label": 0}
{"text": "Yeah. Mild provy is my go to unless there's a real cheese sauce available.", "label": 0}
{"text": "I've been wanting to try chili made in a smoker ever since I saw it in a YouTube video a couple years ago. I'd probably add some smoked chorizo too.", "label": 0}
{"text": "Da bomb.", "label": 0}
{"text": "Mine is as well…and I tried not to have one but O couldn’t resist 😂 I asked her million times if it’s okay", "label": 0}
{"text": "Sweet... Sounds really good. Closest what we have here is chili con carne, sounds about the same stuff.. \n\nI'm hungry now!", "label": 0}
{"text": "I sure do! Glad to share it with likeminded!", "label": 0}
{"text": "Coffee Time Bake Shop on Bridge St. They do these around Easter I think? Not sure if they have them all year, I was only visiting a friend.", "label": 0}
{"text": "u/mieldevenus, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Simple yet delicious I'm sure 😋.", "label": 0}
{"text": "u/Ambitious_Chard5684, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Yes I made 2 more and had four of these in total :)", "label": 0}
{"text": "And fresh onion 🤤", "label": 0}
{"text": "Mett is finely minced meat *with spices*", "label": 0}
{"text": "Yees 😍", "label": 0}
{"text": "We have that here in Sweden! Usually eaten at midsummer eve. It sure is good.", "label": 0}
{"text": "Any quick advice to achieve such a nice texture on the eggs?", "label": 0}
{"text": "This, and the bacon wrapped hot dog with the grilled onions, jalapeños, ketchup, (sometimes) mustard and mayonnaise are my favorite Mexican street food snack.", "label": 0}
{"text": "Also, add black pepper. And use chives instead of green onion. And thank me later.", "label": 0}
{"text": "This looks great. I made some yesterday and I have a pot left. It’s always better the next day and I like the idea of it with tortilla chips gonna go get some!", "label": 0}
{"text": "How was it?", "label": 0}
{"text": "Done it this way too, just been craving that delicious double onion recently for some reason", "label": 0}
{"text": "LOVE polenta 😍🗣️ this looks amazing. Recipe?? Pls", "label": 0}
{"text": "I’m gonna have to try that now", "label": 0}
{"text": "looks amazing!! any chance i could get a recipe?", "label": 0}
{"text": "Yes, low heat pan, add a few small knobs of butter, add eggs, and keep stirring, don’t stop stirring, don’t walk away, don’t let the eggs stick, take the pan off the heat if it gets too hot.  keep stirring until they’re fully cooked and creamy.\n\nIt will take longer to cook it this way.\n\nTake off the heat, add your seasoning, and serve.", "label": 0}
{"text": "Amazing, some of the best street food I have ever had, it was nice it was a fresh grilled veggie which can be hard to find in typical street fare. Nice and spicy too which is also unusual.", "label": 0}
{"text": "I should call her", "label": 0}
{"text": "Hell yes!", "label": 0}
{"text": "Sugar? On a savory Empanada?", "label": 0}
{"text": "I love this! now im craving it.", "label": 0}
{"text": "Looks delicious, I want some.", "label": 0}
{"text": "Interesting, I wouldn't expect a dry look at all with a cook schedule like that. 205 is a tad high because it'll continue to cook for a bit off heat but still strange. Bark looks well developed but could be thicker if you're looking for a moister cook next time. If you're not already using it I'd recommend a 16 mesh or larger pepper for your initial coat. And apply the pepper first so you don't have it bounce off the other seasoning. My two cents, looks like a solid cook just trying to brainstorm on the dry appearance.", "label": 0}
{"text": "\"pretty safe\" does not exactly instill me with confidence.", "label": 0}
{"text": "In Germany there are regulations around how freshly it has to be butchered, served, stored so I'd be hesitant to try this outside of Germany tbh.", "label": 0}
{"text": "They look amazing! I've had Chinese chicken floss buns with sugar before, and I totally get that adding sugar to the chicken doesn't make it overly sweet - it just turns into a winning food combination. ❤️", "label": 0}
{"text": "That is perfect looking toast", "label": 0}
{"text": "Not in Germany at least. Never heard of any problems with Mett.", "label": 0}
{"text": "It sure does taste like paint", "label": 0}
{"text": "Yes, the only real way to prove one’s Asianess is to down one of these every meal", "label": 0}
{"text": "I’ll ask my wife. It’s her grandmother’s recipe, so an over 80 year old recipe.", "label": 0}
{"text": "Cup version is the easier way.  Normally all of the condiments are just spread on the corn cob and you eat it off there!", "label": 0}
{"text": "![gif](giphy|3NUJ4FwSp4MJG)", "label": 0}
{"text": "Hot take: not a big fan of garlic bread unless there's a lot of cheese on top", "label": 0}
{"text": "eggcelent. thanks mate. i'm pretty sure i used too much heat. will try that on sunday. have a good one", "label": 0}
{"text": "On the one hand I've eaten Kibbeh Nayyeh many times, so it doesn't bother me. On the other hand it just doesn't look as tasty as most other sandwiches with cooked meat.", "label": 0}
{"text": "Fire 🔥", "label": 0}
{"text": "Don't  feel alone i like my french toast (egg bread as we call it locally ) as much savory as possible. The funny thing is when i see the photo at first i thought they were grilled halloumi sticks xD", "label": 0}
{"text": "Lovely!", "label": 0}
{"text": "I will give it a try when I visit Mexico", "label": 0}
{"text": "I like mustard on mine.", "label": 0}
{"text": "Ha thanks!", "label": 0}
{"text": "That looks heavenly delicious", "label": 0}
{"text": "Yummy", "label": 0}
{"text": "Japanese milk bread? Sounds interesting 🧐", "label": 0}
{"text": "The comments from Americans on this post just highlights the lack of real fresh food in the US. And, their lack of awareness of other countries.", "label": 0}
{"text": "It looks fabulous!  ❤️", "label": 0}
{"text": "Well, we have 20 weeks to go. But I’ve made it this far, I can make it another 20. My will is unbreakable.", "label": 0}
{"text": "They look like shoe prints.", "label": 0}
{"text": "In my opinion, garlic bread goes great with pasta dishes. Just my opinion. Thanks for sharing :-)", "label": 0}
{"text": "looks yummy", "label": 0}
{"text": "That’s a combo I’ve never seen before, not a big mustard fan but maybe I’ll like it. I’m always up for trying new things", "label": 0}
{"text": "I have found a kindred soul. When my Mom was I. The Army, we used to Ruby Tuesdays every other weekend . She loved this smoky Mountain chicken. It has been on my mind for a few days now. I am going to cook it and send her a pic. 🤣🧡💚", "label": 0}
{"text": "Mustard on a Leberwurst Brötchen is amazing! Not quite sure about Mett... Gonna try it though", "label": 0}
{"text": "This looks phenomenal", "label": 0}
{"text": "Pretty common in Belgium too", "label": 0}
{"text": "u/Mercadooliva, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted an image as a [text] post, please use a text post for [text]. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile. \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "My Wisconsinite coworker explained this tradition to me (in Chicago) and I was shocked but it sounds cool. My head went here too, thinking, “oh this is like cannibal sandwiches”.", "label": 0}
{"text": "Garlic? And bread? No thank you. Not for me.", "label": 0}
{"text": "As a kid, mayo was my condiment of choice, but it had to be the smallest amount possible, basically just creating a barrier between the bread and meat/veggies.\n\nAs I've gotten older, I like many condiments, but mayo is 100% better if you put a decent amount on a sandwich.  And it has to be Duke's.", "label": 0}
{"text": "The best part of my year is when I see boxes of these on the shelf of my local grocer.  They used to do a mean blueberry but now all I find is raspberry, lemon, and chocolate.", "label": 0}
{"text": "Would freezing adequately kill off parasites like it does in fish for raw consumption? like, if a Johnsonville brat had been previously frozen, would it be safe to squeeze out of its casing and onto a burger bun as a quick mettbrötchen hack?", "label": 0}
{"text": "Perfection!", "label": 0}
{"text": "Yeah it really does. It never lasts long enough in my house to snack on 🤭", "label": 0}
{"text": "This being safe has nothing to do with freshness. Trichinosis is a parasite. If the pig has the parasite, so will the meat, regardless of how fresh it is. It’s safe because Germany heavily tests pigs for trichinosis.", "label": 0}
{"text": "Germany heavily tests for trichinosis. It’s a common misconception that it’s because it’s “fresh”, but that really has nothing to do with it.", "label": 0}
{"text": "Beautiful cake and I'm sure it's delicious, but this would be such a steep drop-off of disappointment for me, going from \"yay, pancakes!\" to \"oh, chocolate cake with too much icing\"", "label": 0}
{"text": "Yum 🤤", "label": 0}
{"text": "Yummmm\n\nI discovered Mett when I went to Köln back in 2019 with a group of friends. They all found the concept of straight up raw meat on bread nasty but I loved it, couldn’t get enough. Had it everywhere I could get it. Amazed I didn’t get food poisoning, but if I had it honestly would have been 100% worth it.", "label": 0}
{"text": "Reddit detective here! People stealing things from others for karma is ridiculous.", "label": 0}
{"text": "I agree. That’s what I served with the garlic bread. Now that I’ve made it my family can’t eat pasta without the homemade garlic bread. This back fired on me 😂", "label": 0}
{"text": "i thought these were really worn down ll bean slippers", "label": 0}
{"text": "This looks delicious, but as a heads up your sauce looks a lil broken.  \n\nusually cold knob of butter off heat while liquid still warm will help it emulsify, sometimes may just need a splash of water for the fat molecules to have something to bind to.", "label": 0}
{"text": " ... a couple of shots afterwards.", "label": 0}
{"text": "It’s definitely one of those very special things in Germany 😍", "label": 0}
{"text": "Recipe?", "label": 0}
{"text": "Very cool. How do you do this?", "label": 0}
{"text": "\n\nI used to eat this when I lived in Munich.", "label": 0}
{"text": "The cup in the second pic looks like everything is gonna drop to the ground once you move that spoon in the slightest way.", "label": 0}
{"text": "Everyone saying how good the food looks and I'm just here like: bober kurwa??", "label": 0}
{"text": "Raw meat? No, ty.", "label": 0}
{"text": "This was not what I was expecting. Amazing!", "label": 0}
{"text": "Delicious", "label": 0}
{"text": "Yep! Which is why I \"drank\" a portion of corn straight from the cup first. Once there was a bit of willggle room we were able to free the spoon from it's maze prison.", "label": 0}
{"text": "Yeah the place i live in in germany had a lot of italians, just like Chicago and New York do. Had like 6 italian kids in my class in elementary school, all their parents had their own restaurants hahaha. \n\nBut lots of them either went back to italy or their kids didnt want to keep doing that business, so back then every pizza you ate was from an italian, now its like 1 of 5. You can really taste the difference though. \n\nTheres different styles too. One particular italian run place catered to all the US Army people that used to live here so they made it New York Style. The other ones had those thin crunchy ones and now theres some great neapolitan ones, the pizza bakers usually just speak italian and the best one is just a little hole in the wall place, everybody complains that it doesnt look nice there, but that just adds to the feeling of having a real neapolitan pizza.\n\nMost UK food ist Indian/Pakistani run and yeah its just not the same kind of pizza. It usually has like a huge layer of cheese that feels like plastic, with the ingredients being underneath them. So you pepperoni doesnt get any char, nope, it swims in the plastic-cheese-fat and in its own.\n\nIf you're ever in germany let me know, i will let you know where you can get some real pizza.", "label": 0}
{"text": "Looks a little rare lol", "label": 0}
{"text": "You made my night 😂😂🤣", "label": 0}
{"text": "I believe there is a freshness to it as well as trichinosis wouldn't be the only concern.\n\nBut thank you.  I didn't realize they test so heavily.  That makes sense.", "label": 0}
{"text": "Oh man I am so craving garlic bread now. Looks good!", "label": 0}
{"text": "Criminal!!", "label": 0}
{"text": "Ya know what, I’ll be damned. That looks pretty good and I’m tempted to try it myself", "label": 0}
{"text": "Dang, now I kinda want a sip of street corn myself, lol.", "label": 0}
{"text": "That looks so good!!!", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gc5eqy/homemade_whole_wheat_thin_crust_margarita_pizza/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Usually people eat the stuff on the board but to each their own I guess.", "label": 0}
{"text": "Here in Wisconsin it’s a holiday tradition to eat “cannibal” sandwiches, or “[tiger meat](https://en.wikipedia.org/wiki/Tiger_meat?wprov=sfti1#)” sandwiches.\n\nI grew up eating them yearly, and still do. It’s basically raw ground beef, on some rye bread, usually with onions, salt and pepper. Obviously, Wisconsin has very strong German roots, so it tracks. Every single year there is always a warning sent out to not eat raw meat here because of the risk of food borne illnesses, but we still do it. Nobody in my family has ever gotten sick from it. I quite enjoy them.", "label": 0}
{"text": "Looks delicious", "label": 0}
{"text": "It was lightly buttery but not overkill. It held together til the end! They cut the bread in a sort of pocket!", "label": 0}
{"text": "Cool, but I was kind of disappointed", "label": 0}
{"text": "My husband finished both sandwiches and ate his own 😂😂😂", "label": 0}
{"text": "Congratulations to you, a wonderful scourge. Give me a picture to see how you look from the inside.", "label": 0}
{"text": "This made me instantly hungry", "label": 0}
{"text": "Looks delicious.", "label": 0}
{"text": "Thank you. My house still smells good from it.", "label": 0}
{"text": "Why do you think that? Just curious", "label": 0}
{"text": "u/GranPrepotencia, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Por dios 🤤🤤🤤", "label": 0}
{"text": "This makes me irrationally angry", "label": 0}
{"text": "I appreciate that! I didn’t really make a sauce, I just whisked in some butter to the strained braising liquid. Could’ve sauced it up a bit but thought this was fine.", "label": 0}
{"text": "Yeah. I'm totally into that. Ooh mama.", "label": 0}
{"text": "Angry or hangry? I legit started a war in my home, I'm making real pancakes for dinner!", "label": 0}
{"text": "Bonus for non shredded colby", "label": 0}
{"text": "You’re right, I misspoke. The common sickness with raw pork is trichinosis, but old raw meat is definitely more dangerous than fresh raw meat", "label": 0}
{"text": "I genuinely can’t imagine raw mince being a pleasant texture, regardless of flavour.", "label": 0}
{"text": "I'd love a taste of this.  \nCreamy goodness spread on bread.  \nLike *pastin* in northern Italy,", "label": 0}
{"text": "Can't agree more", "label": 0}
{"text": "Love it. We also will slice tofu into patties, panko bread them, and top with siracha mayo, kimchi, and whatever other toppings you like- recommend shredded carrots and a fried egg. Korean \"chicken\" burger.\n\n\nAnother combo I enjoy is pesto, mozzarella, sliced tomatoes and balsamic glaze for caprese, or with marinara and mozz and parm for \"chicken Parm\" burger.\n\n\nOr smoked tofu burgers with bbq sauce, cheddar cheese and caramelized onions.", "label": 0}
{"text": "Love garlic bread.", "label": 0}
{"text": "There’s not a lot of charcuterie in that cheese fruit and cookie bowl", "label": 0}
{"text": "Enjoy 🤤🤤🤤😍 that’s looks so good", "label": 0}
{"text": "> thought this was fine.\n\nI agree, it looks delicious.  \n\nI just know I beat myself up for a long time trying to figure it out and thought 50/50 shot it helps a stranger make delicious food even more delicious", "label": 0}
{"text": "You should definitely give it a try one day", "label": 0}
{"text": "Oh I appreciate any tips. I will definitely use your notes in the future. Any and all knowledge is valuable. Thanks again!", "label": 0}
{"text": "Since I saw the recipe I wanna try... didn't cook it yet :(", "label": 0}
{"text": "I will!", "label": 0}
{"text": "Mmmm au poivre. So good.", "label": 0}
{"text": "Perfect for the spooky season. Love the artistry!", "label": 0}
{"text": "Oh this gorgeous work! I couldn’t eat them, too cute. 🥺", "label": 0}
{"text": "It's esquites when it's off the cob", "label": 0}
{"text": "do they taste like egg like on french toast?", "label": 0}
{"text": "Looks good but like also like a lot of work", "label": 0}
{"text": "Everybody questioning if sugar belongs on a chicken dish should consider BBQ sauce", "label": 0}
{"text": "What about cysticercosis?", "label": 0}
{"text": "Recipe or it didn’t happen !", "label": 0}
{"text": "it's amazing indeed", "label": 0}
{"text": "it's actually a thursday :3", "label": 0}
{"text": "Looks delish!", "label": 0}
{"text": "yeah it is", "label": 0}
{"text": "automod ate comment, cant link the fat separators.  I'll say that one has a spout at the bottom that rises to the top, and one has a release valve at the bottom to let gravity do 100% of the work\n\n>Any and all knowledge is valuable\n\nDope!  I shall infodump away and you can take whatever suits your needs best :D\n\nI'll say the cold butter off heat is the best result as you're usually reducing the liquid already so it'll be hot.  wait a lil bit so its not bubbling hot, and pan off heat you can just swirl the pan and it'll move the butter around and ambient heat will incorporate it. \n\nWith a braise, I've always considered getting a fat separator that [pours from the bottom]or [has a release for higher accuracy] to prevent the bad(I forget word) fat from being in the sauce.  it doesn't mix as easily as butter and usually doesn't taste good.  They're different fats and I forget what the difference is.  Even easier is letting it chill overnight, which often makes the braise even better, and then just pull the solid fat off, but, fat separator for same-day is a huge saver.\n\nI used to try adding unflavored gelatin to a store bought stock, and it kinda worked and helped, but my cousin (fancypants chef) made fun of me for it and told me to just use butter.  Starch/water then boil is probably the easiest/most common \"fuckit\" method but runs the risk of not cooking out the flavor of flour.  The butter method just makes it even better, because butter makes better.\n\nI'm sure you already know some of this tho.  keep on enjoying delicious food!", "label": 0}
{"text": "And last a I checked an occasional case from bear meat.  Evidently bears are riddled with parasites.", "label": 0}
{"text": "dough being different applies to many different kinds of donuts, not just polish ones\n\nhell, there's different kinds of donut dough within poland too", "label": 0}
{"text": "Few things will get you a more spirited argument/debate than how to properly make chili con carne. Wildly differing opinions held deeply.", "label": 0}
{"text": "This looks like an incredible chilli", "label": 0}
{"text": "Wow! So awesome! Enjoy Halloween and those cookies! Keep some for the ghosts. Lol", "label": 0}
{"text": "look for shops specializing in polish food", "label": 0}
{"text": "it's actually fat thursday ;P", "label": 0}
{"text": "Why not just call it a fried tofu sandwich?", "label": 0}
{"text": "  Sounds good but I  only like Pintos in my Chili and just a handful of those..    Kidney beans are those ones in that 3 bean  whatevrthfuk", "label": 0}
{"text": "I just remembered the corner and looked it up on Google TBH. It was only a few days ago.", "label": 0}
{"text": "Out of all the cakes you've had, how would you rate the taste of this 1 to 10?", "label": 0}
{"text": "Is this like some kind of twist on the ratatouille?", "label": 0}
{"text": "u/brendan3rd, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "I’m laughing I meant prosciutto", "label": 0}
{"text": "Not bruschetta it is prosciutto", "label": 0}
{"text": "adore![gif](emote|free_emotes_pack|put_back)", "label": 0}
{"text": "You made a delicious dish and put on plastic for a picture", "label": 0}
{"text": "no beans. ever.", "label": 0}
{"text": "🤤", "label": 0}
{"text": "It looks great and the dish is called Tonkatsu", "label": 0}
{"text": "Plastic? You mean the plate? It’s ceramic", "label": 0}
{"text": "My mistake.", "label": 0}
{"text": "It’s okay :)", "label": 0}
{"text": "❤️❤️❤️", "label": 0}
{"text": "Yeees", "label": 0}
{"text": "I'm with you. I like tofu and there are plenty of vegan dishes I will eat. None of them taste even remotely like meat so I hate it when they give it a meat name. Just let it be what it is.", "label": 0}
{"text": "Have you tried putting a bit of mayo on the bottom of the broetchen or is this anatema?", "label": 0}
{"text": "Perfect execution 😍", "label": 0}
{"text": "Honestly I was raised to be an open minded eater, I would eat anything. I've eaten alligator, kangaroo, and almost anything. Not to the extent of bugs but you get the point, I didn't mind eating unusual or questionable looking foods. However, recently I've been growing more pickier, especially with textures. I don't know why it's happening since I wasn't raised to be picky, but certain textures make me shudder. For example, I used to like eating tuna with crackers a lot. It is a very nostalgic food for me but now I can't stand it. The smell and the texture absolutely disgusts me now. Its a bit sad for me since it was a childhood food attached with memories but I can't change how I feel. The same is happening with shrimp too. I used to eat that shit up but the texture is fucking with me now. I don't want to be this way but its something I genuinely can't help. I came to this Reddit to see if there was anyone like me who is suddenly becoming so picky with things. I'm very curious as to why its happening since there isn't really any noticeable reason that I can scrutinize. My body just reacts on its own, even though I used to be okay with eating things I didn't like just to not be hungry.", "label": 0}
{"text": "Please sir, may I have some more?", "label": 0}
{"text": "so delicious!!!", "label": 0}
{"text": "Just using it like butter, not a lot", "label": 0}
{"text": "lol if it makes you feel any better I googled bruschetta before commenting to see if it's also the name of a meat I'm not familiar with", "label": 0}
{"text": "Same except now I'm growing into a picky eater and idk why. Certain smells and textures are just fucking with me now and I can't eat some foods I liked or was okay with as much anymore. Its not about if I like it or not its more of my body just shudders to it now.", "label": 0}
{"text": "Agreed, vegan/vegetarian dishes should be able to get by on the strength of their own taste and flavor not by impersonating a popular meat based dish.  This is not meant to knock OPs sandwich, it looks tasty, but let it stand on it's own.", "label": 0}
{"text": "u/Remarkable_Guide_394, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "'Deconstructed meal'", "label": 0}
{"text": "Is this what heaven looks like?", "label": 0}
{"text": "Garlic?! ....and bread?!", "label": 0}
{"text": "It depends on the state, but Mexico City does indeed call them esquites.", "label": 0}
{"text": "is this in Mexico? I never saw a cart selling Elotes in the US? if its in the US where? I love mexican corn.", "label": 0}
{"text": "Watch out, you'll get fat.", "label": 0}
{"text": "How does the tikka masala pair with the beets? Looks awesome.", "label": 0}
{"text": "My great grandparents were mostly Swedish and German, smelts and herring are one of the favorite easy lunches my son and I enjoy!", "label": 0}
{"text": "That looks so tasty!", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gc80y8/homemade_grilled_sesame_glazed_octopus_ate_all/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "I didn't know this was a thing until I dated my ex 5 years ago. I'll be grateful to her for the rest of my life for introducing me", "label": 0}
{"text": "Wish I had one right now", "label": 0}
{"text": "Looks good screw the beans in chili haters with or without it’s amazing. Love the smoke taste", "label": 0}
{"text": "Purple sweet potato. Really good bc sauce is super rich, savory and spicy", "label": 0}
{"text": "Interesting assortment of veggies there. Folks this way add in a quarter lemon for the acid, sliced raw onions for the kick and cucumbers as palette cleansers.", "label": 0}
{"text": "Probably 7. My wife makes some really good cakes.", "label": 0}
{"text": "All of our parents grew up in a time where pork was very likely to get you sick unless you cooked it all the way well done. We basically regulated trichinosis away decades ago but old habits die hard and my parents still won’t eat my pork chops because I cook leave then just a little pink.", "label": 0}
{"text": "it looks delicious, something like that would be great for me right now", "label": 0}
{"text": "Haha ok, it was just a bad joke. Btw the elote you ate (shelled corn in a cup) it’s called “Esquites” or “elote en vaso” (corn in a cup).", "label": 0}
{"text": "Red boat fish salt does contain fish, I would not consider it vegetarian.", "label": 0}
{"text": "The most skeptical about a pizza I have ever been was at a place in Bellingham called “Fairhaven Pizza” and it was smoked alaskan salmon as the main topping.\n\nTo this day one of the best pizza pies I have ever had. I don’t think the place even exists anymore but I will never forget that one 🥺", "label": 0}
{"text": "Trich is a parasite that can survive freezing. It takes heat to kill it. \n\nWhen people get food poisoning, it's mainly from bacteria. The more surface area a piece of meat has, the better the chance for bacteria to develop. This is why processed meat like salami needs to be cured with nitrates and nitrites. While a whole muscle product like prosciutto just uses salt to cure and be safe.", "label": 0}
{"text": "That is an original choice or sides for the dish, but I will never knock originality.\n\nDid it all work together for you?", "label": 0}
{"text": "Yes 😁", "label": 0}
{"text": "That’s so pretty!", "label": 0}
{"text": "sweet!  Def use some of the pasta water when reheating it.  the pasta water has starch from the pasta in it, and its already boiled most of the flavor out.  helps it stick to the pasta better, as with any pasta sauce.  just care, pasta water is salty and you may have already salted the dish.  also a reason unsalted butter is great for the butter method\n\nWould love to see how delicious it looks, ive been too lazy to put my knowledge to work lately and enjoy seeing other people's wins and delicious culinary art", "label": 0}
{"text": "The best opinion is having like 10 go to recipes that are all different yet delicious.", "label": 0}
{"text": "I agree with you.", "label": 0}
{"text": "Thanks! I say give it a shot.", "label": 0}
{"text": "Agora mostra o rato que estava na sua cabeça", "label": 0}
{"text": "I just rub a garlic clove on the toast, I think avocado is fatty enough on its own without all the butter.  If you were gonna do it with proper buttery garlic bread I think you'd have to add some more stuff to cut all the fat, like some arugula and tomato.  But by that point you're basically making a sandwich.", "label": 0}
{"text": "It’s so…small. ", "label": 0}
{"text": "They are delicious, I tried them on my trip to Mexico and I recommend them", "label": 0}
{"text": "Yeah, just for me. I live alone. 😅 so one person portion.", "label": 0}
{"text": "It should be called the happiness burger", "label": 0}
{"text": "My first thought: KURWA BOBER", "label": 0}
{"text": "Confit biyale *", "label": 0}
{"text": "Everyone worried about the oysters, im more concerned about the obscene amount of cheese.", "label": 0}
{"text": "My Oma who was from Germany living in Canada called them Berliners oddly enough lol.", "label": 0}
{"text": "Damn that looks good - love salt and pepper deep fried goodness", "label": 0}
{"text": "Didn't know there was a spicy Maggi, now I have a new item to hunt for. Thanks 🤤", "label": 0}
{"text": "You are damn right.", "label": 0}
{"text": "If it was too chewy, you just need to cook hotter.", "label": 0}
{"text": "Hey there, u/Nickidemous420! Thank you for your submission. Unfortunately, it has been removed for the following reason(s):\n\n**Image Title Rule:**\n\n* The majority of your title (over 50%) must specifically describe the food.\n\n* Avoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\n* Example:\n\n \"[Homemade] Chicken & rice for dinner\"✔️\n\n \"[I Ate] Tonight's dinner\"❌\n\n**Some examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.**\n\n\n\nFor more information, please see the sub rules/wiki/sidebar, or modmail the team. Thank you!", "label": 0}
{"text": "That looked so good I just had to cook some chili for myself. And it's in the middle of the night here! \n\nSo now I'm just sitting here, at 2:40 am, eating chili 😆", "label": 0}
{"text": "Hey there, u/Charming_Bus9001! Thank you for your submission. Unfortunately, it has been removed for the following reason(s):\n\n**Image Title Rule:**\n\n* The majority of your title (over 50%) must specifically describe the food.\n\n* Avoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\n* Example:\n\n \"[Homemade] Chicken & rice for dinner\"✔️\n\n \"[I Ate] Tonight's dinner\"❌\n\n**Some examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.**\n\n\n\nFor more information, please see the sub rules/wiki/sidebar, or modmail the team. Thank you!", "label": 0}
{"text": "Yeah the smell of garlic bread in the house is the best.", "label": 0}
{"text": "This is delicious, I need to go back to Mexico to eat one", "label": 0}
{"text": "Omg yummm!😋", "label": 0}
{"text": "It’s a hearty bean soup (typically chili and kidney beans) with ground meat and onions. It’s typically made from tamari sauce/juice that is seasoned with chili powder.", "label": 0}
{"text": "r/foodporn", "label": 0}
{"text": "Not for me but I do love some fleishkase!", "label": 0}
{"text": "Of course, but I liked the mix of chew and crunch, it worked for me.", "label": 0}
{"text": "busted", "label": 0}
{"text": "This will be my dinner tonight.", "label": 0}
{"text": "No it won’t🥱", "label": 0}
{"text": "how delicious and fun they look", "label": 0}
{"text": "I had it in the late 80’s…delicious", "label": 0}
{"text": "Not sure if this is appropriate to say but that steak looks sexy", "label": 0}
{"text": "I am as frustrated as I am hungry ✨", "label": 0}
{"text": "Looks delicious!", "label": 0}
{"text": "Username checks out.", "label": 0}
{"text": "Call it what it is… a fried tofu sandwich", "label": 0}
{"text": "I was surprised but not angry lol this is cool", "label": 0}
{"text": "That’s honestly a super aesthetic burger, looks tasty", "label": 0}
{"text": "Came out sooo creamy, it’s pretty tasty especially with the bread the wife toasted with some garlic butter", "label": 0}
{"text": "Oh yes please!", "label": 0}
{"text": "I haven't tried braising. Last cut I used was Eye of Round. Basically anything around $20 at the store is what I'll use.\n\nHow would I braise it? every 15-30 minutes spoon broth over it as it cooks?", "label": 0}
{"text": "Great skills", "label": 0}
{"text": "A classic that doesn't fail", "label": 0}
{"text": "I must try this if I ever go to Germany", "label": 0}
{"text": "There’s at least one, maybe two pieces of pork in this dish.", "label": 0}
{"text": "Oh man, this has convinced me to start making chili again! (I guess the weather getting colder is also helping)", "label": 0}
{"text": "Same, I was all pumped and then immediately deflated when I got to the third pic. And now I want pancakes 😕", "label": 0}
{"text": "Looks amazing!", "label": 0}
{"text": "That's a neat way of looking at it actually", "label": 0}
{"text": "Gonna go for some pancakes this morning then.", "label": 0}
{"text": "Here in South Dakota too, we call it Tiger Meat.", "label": 0}
{"text": "I’d absolutely prefer just pancakes lol", "label": 0}
{"text": "We were just in Köln this summer and got to try it.... Absolutely amazing!", "label": 0}
{"text": "Hmm, is the pancakes not pancakes but cake? 😆", "label": 0}
{"text": "That’s just outrageous! How did you do it?!", "label": 0}
{"text": "Croissant 🥐", "label": 0}
{"text": "Does kifto mean meatball? Cuz kofte is meatball in turkish", "label": 0}
{"text": "liebe Zwiebeln", "label": 0}
{"text": "I’m starting to believe this is posted 2-3x a week.", "label": 0}
{"text": "Burger perfection 🤤", "label": 0}
{"text": "Burn the witch!", "label": 0}
{"text": "Dog thinks it’s for him", "label": 0}
{"text": "well done", "label": 0}
{"text": "I was about to downvote a stack of pancakes but was pleasantly surprised it was actual cake.", "label": 0}
{"text": "We have one Polish restaurant in town and that's it.", "label": 0}
{"text": "kifto is chopped and minced beef tartare (Ethiopian style). Seasoned with clarified butter and mitmita. Delicious!", "label": 0}
{"text": "Happy birthday breakfast to me.", "label": 0}
{"text": "Something about this looks incredible, but I can’t put my finger on it.", "label": 0}
{"text": "Almost Heaven, West Virginia", "label": 0}
{"text": "looks like they said hot plate. like microwaved to death and left to dry.", "label": 0}
{"text": "It legit looks like an optical illusion, well done", "label": 0}
{"text": "Prosthiutto", "label": 0}
{"text": "Love it except for the tomato🤷🏻‍♂️", "label": 0}
{"text": "I legit thought the first pic was AI generated 🤣", "label": 0}
{"text": "Looks so amazing, have you posted a recipe?", "label": 0}
{"text": "That look so damn good!!", "label": 0}
{"text": "Always has been.", "label": 0}
{"text": "Nice brown roux", "label": 0}
{"text": "Its a yummy orange and yellow crunchy triangle 🥰", "label": 0}
{"text": "I'm so confused. And I have a sugar headache.", "label": 0}
{"text": "Im no coonass, but I'm friends with a few and ive spent a lot of time in south louisiana, and this looks excellent. \n\n\nIf you want suggestions, I would recommend fully shelling your shrimp.  Your roux is fine but you can let it get closer to dark chocolate.  ", "label": 0}
{"text": "Looks like thick cut bacon too? No need to be humble", "label": 0}
{"text": "How about the chimichangas?", "label": 0}
{"text": "I like my chili with beans but this still made me chuckle lol", "label": 0}
{"text": "You know it's a good party when there's finger foods", "label": 0}
{"text": "Chili powder \nPaprika\nCayanne pepper\nGarlic powder\nOnion power \nOregano \nThyme\n\nYou don't need a mix..this blackening season will be 100 times more authentic", "label": 0}
{"text": "I thought it was going to be like a crepe cake. Nice job!", "label": 0}
{"text": "I also used these spices as well 😊", "label": 0}
{"text": "Mr Sausage ass post", "label": 0}
{"text": "https://preview.redd.it/7d3irtypv0xd1.jpeg?width=1125&format=pjpg&auto=webp&s=7cf090ff3b52755a482e7ffbb7f39846ffb4292f\n\nI’ll take your sweet potato and raise you a squash", "label": 0}
{"text": "What food/margaritas?", "label": 0}
{"text": "tosTiTos for dessert?", "label": 0}
{"text": "Lecker!", "label": 0}
{"text": "Mmmm yes thank u so much for sharing", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Gorgeous job 👏", "label": 0}
{"text": "Would usually have double the rice along with garlic naan but decided to make it a bit healthier. I could eat cardboard topped with that sauce.", "label": 0}
{"text": "Yummy pancakes", "label": 0}
{"text": "dang im jealous!", "label": 0}
{"text": "That looks so good wtheck!", "label": 0}
{"text": "Nice!", "label": 0}
{"text": "It's optional paprikas a mix too btw", "label": 0}
{"text": "Perfect harmony for a good old cinnamon roll.", "label": 0}
{"text": "This is so sexy", "label": 0}
{"text": "Lmao", "label": 0}
{"text": "Only certain cuts will fall apart; they need to have a lot of connective tissue that will dissolve. Lean cuts won’t ever fall apart. Chuck roast, short ribs, fatty end of a brisket are examples of what you’re looking for here.", "label": 0}
{"text": "![gif](giphy|l4pMattUYTTM7qpIk)", "label": 0}
{"text": "Well there's your answer. Eye of round is garbage. Use beef chuck", "label": 0}
{"text": "That final product is gorgeous! Would pay good money for that.", "label": 0}
{"text": "I’m gonna need an address. If not I need the recipe", "label": 0}
{"text": "Not true. Do a quick Google search. And even if it were, you'd only be weakening your point further.\n\n\nIn my time cooking professionally, I've never come across a blackening seasoning with chili powder. But if that's what you like, rock on.", "label": 0}
{"text": "and raw red onions", "label": 0}
{"text": "Olive oil, and let it cook for 1 hour on minimum heat 😉", "label": 0}
{"text": "Thank you for the tip 🙂 Ended up using about the \"normal\" amount of spices total in the end, a mix of the Tonys and dried/fresh spices, at about a 30/70 ratio. \n\nThe smoked sausage was quite salty already, and the Tonys seemed a bit more on the salty side too, so i decided to do it that way and go by the taste so it didn't turn into a over salted mess.", "label": 0}
{"text": "Sounds great", "label": 0}
{"text": "Now that’s a torta if you catch my drift.", "label": 0}
{"text": "Great Confit Duck.", "label": 0}
{"text": ">I used Vegeta\n\n\nIs that like a brand, or something?", "label": 0}
{"text": "awesome, I was unaware of this.", "label": 0}
{"text": "No just felt like a light dinner", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Yum, making that roux was tedious though when did it lol", "label": 0}
{"text": "Should have sent... a poet", "label": 0}
{"text": "Amazing looking duck, and those beans look really delicious.", "label": 0}
{"text": "I am curious, what does it tastes like?", "label": 0}
{"text": "Nice creativity, I'm gonna make this for Halloween.", "label": 0}
{"text": "I’m sorry you didn’t appreciate my dish. However, you’re right, I bought assorted vegetables. I stewed the meat and made a gravy for it so that it could be mixed with rice :)", "label": 0}
{"text": "Out of curiosity did you roast the butternut squash or just boil? Its been awhile and I've done it both ways but forgot which way is the best. Either way it is always good and it is soup season.", "label": 0}
{"text": "I'm hammered after a long Friday shift, but those look delicious", "label": 0}
{"text": "Once you taste it you will really like it.", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "For myself it was initial puzzlement and then pure wonder and knowing that I wanted a piece of that artistry", "label": 0}
{"text": "Oh, I got you. However, I cooked it quickly and didn’t plan to do much chicken…🤕", "label": 0}
{"text": "I just randomly made it. I invented the dish", "label": 0}
{"text": "Everything is fine, I know how to cook meat, but this time I decided to just stew it in a sauce without seasonings, but the sauce turned out to be too liquid, but tasty! In the photo, I specially poured sauce on the rice to make it tastier😄", "label": 0}
{"text": "Well, since the movie (US only) yeah.", "label": 0}
{"text": "You shut right up.", "label": 0}
{"text": "Icing cleverly done to look like pancakes?", "label": 0}
{"text": "Chef John", "label": 0}
{"text": "Well you cook all the vegetables and the chicken and make a broth.\nThen you cook the couscous in it .\nEverything is juicy.\nNo need for sauce.\nBut if you want some . Any chilli sauce will fit", "label": 0}
{"text": "Fake", "label": 0}
{"text": "yes it does look like that but it was a pastry!", "label": 0}
{"text": "I just made a shoulder roast with veggies for dinner tonight. I pressure cooked the roast on high for 90 minutes with red onion and seasoning on it. Then I added the veggies and cooked for an additional 30 minutes. The roast fell apart beautifully. \n\nTry your pressure cooker.", "label": 0}
{"text": "Thank u🙏🏻🥰", "label": 0}
{"text": "The dog is like, who are you trying to fool?", "label": 0}
{"text": "The dog's face is sending me!", "label": 0}
{"text": "That looks delicious OP. Well done.", "label": 0}
{"text": "I know it’s simple.. but, I had a craving 😂", "label": 0}
{"text": "Such a handy cook!", "label": 0}
{"text": "that looks delicious!", "label": 0}
{"text": "I don't think I'd have much trouble getting one of those down if offered.", "label": 0}
{"text": "Hello Clarice", "label": 0}
{"text": "Yes, it is a mix of peppers. Hence why different locations have different flavors.", "label": 0}
{"text": "Deliciously talented.", "label": 0}
{"text": "That looks so nice! at first look its doesn't seem like a cake but a real pancake.. well done👌\n\n.", "label": 0}
{"text": "Hands down , the best charcuterie I’ve seen in a while", "label": 0}
{"text": "Hey, I also made gumbo tonight. Yours looks better though (mine was a little watery).", "label": 0}
{"text": "I follow the method of doing in the oven, and my god it takes all of the stress out of having to make a really dark roux and not fucking it up.", "label": 0}
{"text": "Honestly Gumbo is basically a ton of food thrown together in a soup", "label": 0}
{"text": "I hope it is! That abomination if not fit for human consumption!\n\nJk bro, it looks awesome! Great job.", "label": 0}
{"text": "This pancake looks so soft and delicious. Do you have a recipe? How did you make it?", "label": 0}
{"text": "This looks amazing. How long did you cook your sweet potatoes?", "label": 0}
{"text": "![gif](giphy|dyXZOHFChoQPQsnY2P|downsized)", "label": 0}
{"text": "The roux looks beautiful. Nice and dark which from me at least is a *chefs kiss*, because I’ve seen entirely too many “blonde” rouxs on Reddit. My only remotely iffy thought is the sausage, and that is because I’m sausage snob (no innuendos so don’t send messages weirdos). I prefer a pure pork over mix strictly because of texture. Higher beef mixes tend to break apart more in gumbos/soups. \n\nThis is a great looking bowl of gumbo and that’s coming from a coonass with a lot of gumbos under my belt. I realize you’re not in the states, but if you’re able to find Tony’s then Richard’s seasoning might be available too. I find it to be less sodium heavy which Tony’s has been for quite a while lately.", "label": 0}
{"text": "Omg this looks so good!!", "label": 0}
{"text": "u/big_key33, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "I’m not sure how I feel about this… like my blood is boiling because those pancakes looked damn good but I also respect the craft..", "label": 0}
{"text": "This looks amazing! Do you have a recipe?", "label": 0}
{"text": "This is all I want from life", "label": 0}
{"text": "This does not look homemade, good job! :O", "label": 0}
{"text": "Since seeing Isaac Toups on bwb, I've been making gumbo regularly, it's my favorite stew. I don't know how authentique his recipe is but it's fast and delicious. The differences I noticed are the spices (only pepper) and roux cooking. To make the roux faster, you should heat the oil until smoking before adding the flour. It'll cook much faster (about 5-10min) but can also burn more easily so stir often.\n\nI'm surprised you found okra, is it popular in Australia?", "label": 0}
{"text": "I love a really good burger. And it looks delicious", "label": 0}
{"text": "Yay, I needed this in the morning. Nothing goes better with coffee than vomiting.", "label": 0}
{"text": "Points for style but King’s Hand is a traditionally vegetarian dish and without Greek Salad I’m not sure it really works.. you could have at least put some Feta in the mix or chucked in an M&M or two??", "label": 0}
{"text": "I love duck it has a taste that is just so recognizable. That dish looks delicious and tasty.", "label": 0}
{"text": "Wow, I look and see delicious pancakes. Then the last picture and it's a cake! I'm shocked, it's beautiful!", "label": 0}
{"text": "That's a good pun gotta hand it to you", "label": 0}
{"text": "It’s Croatian, but is very popular in some other european countries.\nAnd it’s amazing.", "label": 0}
{"text": "Hannibal! Stop playing with your food!", "label": 0}
{"text": "Gotta hand it to you ...... that's brilliant.", "label": 0}
{"text": "I cut them in half, brushed them with olive oil and then baked them in the oven for 35 minutes at 180 degrees Celsius.", "label": 0}
{"text": "Weird, usually the dish is drenched with the said broth thus the question", "label": 0}
{"text": "I can't tell you how delicious that looks.", "label": 0}
{"text": "That steak could convert Liver King into a vegetarian.", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "Totally appropriate! That steak is giving off some serious allure!", "label": 0}
{"text": "A lovely steak can really make the day", "label": 0}
{"text": "Imposter Doggo!! But still a cutie.", "label": 0}
{"text": "You made the pancakes look too delicious", "label": 0}
{"text": "Don't worry. I'll give you a hand.", "label": 0}
{"text": "Yummy🥰", "label": 0}
{"text": "I mean you made a flesh shape outta flesh.", "label": 0}
{"text": "This! The \"falling apart\" are things between bundles of muscle fiber; connective tissue, collagen and fat having rendered/melted. Just as a counterpoint, it can happen in things that are relatively lean, like in cod fish for instance, which can be poached very gently for not very long and still reach that point where it will separate into flakes at a push. Land animal red meats only do this when it's a cut where these structures are present. Something really lean can still become very, very tender, to the point of muscle fiber being so soft that that they can be \"mushed\", but that \"falling apart\" thing is all about the separation of bundles by dissolving connections between them or with bone.", "label": 0}
{"text": "u/Ill-Economist5659, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "It looks sweet", "label": 0}
{"text": "Fuck yeah boy. Tony's for life mudafacka. I love putting it on mashes potatoes!", "label": 0}
{"text": "Love it. Eggsellent", "label": 0}
{"text": "Recipe????", "label": 0}
{"text": "The simplicity is what makes it awesome!", "label": 0}
{"text": "Nah rokurinsha in tokyo station ramen street!", "label": 0}
{"text": "That looks delicious ❤", "label": 0}
{"text": "For a good moment I was wonder why would you do that! But Halloween and all! Enjoy your party.", "label": 0}
{"text": "This would actually go well in the latest Netflix show “is it cake?”", "label": 0}
{"text": "Wow", "label": 0}
{"text": "This 100% I will never understand the “I’m so vegan/vegetarian I must name my dishes after meat dishes” thing. I have seen things like “vegan scallops” (sautéed mushrooms) “vegan salmon” (baked watermelon) and now this friend chicken but really tofu sandwich.", "label": 0}
{"text": "Looks Delicious", "label": 0}
{"text": "Is this the new carbonara?", "label": 0}
{"text": "Love this.", "label": 0}
{"text": "Yummy", "label": 0}
{"text": "Thats pretty good", "label": 0}
{"text": "always beans.", "label": 0}
{"text": "Surely the best", "label": 0}
{"text": "Beautiful and aesthetic plating!", "label": 0}
{"text": "ohhh perfect, i love Tiramisu 😍", "label": 0}
{"text": "🤣🤣🤣", "label": 0}
{"text": "I’ve never even considered the possibility of chorizo in chili, but fuck me sideways do I want to try it now. Thank you for this nugget of wisdom lol", "label": 0}
{"text": "My invite must have gotten lost 😘", "label": 0}
{"text": "Amazing. How did you do it? Fondant or something else for the decorations?", "label": 0}
{"text": "Yeah!", "label": 0}
{"text": "this looks fantastic", "label": 0}
{"text": "can't post links apparently. Search for \"Petterson and Findus pancake cake\" pls and tell me that doesn't look amazing", "label": 0}
{"text": "can't post links apparently. Search for \"Petterson and Findus pancake cake\" pls and tell me that doesn't look amazing", "label": 0}
{"text": "Oh, wow! I really wanted a stack 8f pancakes when I saw the first photo! 🥞 Don't play with my feelings so! 😭", "label": 0}
{"text": "But where?", "label": 0}
{"text": "Did someone eat it once already before you took this photo?", "label": 0}
{"text": "Just one more tip: don't buy the cheap red chorizo paste that's sold near the breakfast sausage. Try to find high quality stuff that comes in a tube or links. Just remember to remove the casing.", "label": 0}
{"text": "This baker needs more info! How did you do it?", "label": 0}
{"text": "🤤🤤", "label": 0}
{"text": "Love that, that’s the best :)", "label": 0}
{"text": "Is this an airplane box", "label": 0}
{"text": "How clever", "label": 0}
{"text": "Yountville, CA.", "label": 0}
{"text": ":( poor guy", "label": 0}
{"text": "It doesn't look amazing", "label": 0}
{"text": "you just put it in an oven and wait so you can premake it in bulk\n\nquick google, alton knows his stuff\n\nhttps://www.foodnetwork.com/recipes/alton-brown/shrimp-gumbo-recipe-1946875", "label": 0}
{"text": "fair enough, childhood nostalgia is a factor I guess, but I always thought it looks delicious", "label": 0}
{"text": "My Nana likes to call this Elotes Loco. Lol.", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gck7mu/i_ate_frozen_baked_alaska_vanilla_ice_cream_with/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "You are making me Hangry!", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gckg3l/i_ate_egg_omelet_bacon_waffles_pancakes_plantains/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Happy Sanhaim", "label": 0}
{"text": "Did you dip in eggs before dipping in the flour. I'm intrigued.", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "disturbing\n\ndont let the pup see the hand shape  🙃", "label": 0}
{"text": "How do you rate the pizza suggestion guys", "label": 0}
{"text": "They look 10 out of 10 to me! What are you planning on dressing the pancakes with before consumption?", "label": 0}
{"text": "same some for me", "label": 0}
{"text": "Looks amazing! How long did you cook the broth for?", "label": 0}
{"text": "Probably some honey and cherries", "label": 0}
{"text": "Very nice!", "label": 0}
{"text": "Probably some honey and cherries", "label": 0}
{"text": "My point..thank you...paprika in simple terms is a mix of dried peppers..different regions using different blends..", "label": 0}
{"text": "I’m more consumed with the fact that all of your bananas are off the crown, and in a bowl.", "label": 0}
{"text": "Delicious!", "label": 0}
{"text": "Hahaha, clever!", "label": 0}
{"text": "You wanna try the food", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "I don’t see anything in the title that says “Texas chili.”  Chili typically has beans. TEXAS CHILI does not have beans. Both are chili, despite attempts at gatekeeping a comfort food.", "label": 0}
{"text": "Maybe 6 hours?  Made a huge batch about a month ago and froze portions", "label": 0}
{"text": "Am I allowed to say that this is one of the very few non boring \"I ATE\"?", "label": 0}
{"text": "If you add in a good amount of soffrito adding garlic you have your fife vegetables a day with the tomato sauce. \n\nIf you then don't overdo it with the cheese you can somewhat argue that lasagna isn't unhealthy, maybe add a side salad and it's basically a health food.", "label": 0}
{"text": "I had something like this with sashimi. It was delicious. This is looks great as well.", "label": 0}
{"text": "It's beautiful, I ***super*** recommend mizithra cheese grated on this. It's got a wonderful salty, nuttiness.", "label": 0}
{"text": "Those looks good!  What's in the stuffing?", "label": 0}
{"text": "This post history is wow.", "label": 0}
{"text": "Looks like a pain to eat", "label": 0}
{"text": "Thank you the meal look delicious yeah", "label": 0}
{"text": "Thanks! Onions, garlic, basil, thyme, oregano, Aleppo, pepper flakes, dash balsamic vinegar, salt, pepper, fresh parsley, Parmesan", "label": 0}
{"text": "What cuisine is this? Can you explain the peppers and white items? Looks great!", "label": 0}
{"text": "10 over 10 meal", "label": 0}
{"text": "Wow I feel bamboozled. Looks so yummy tho.", "label": 0}
{"text": "Goat meat with ugali have you tried the meal", "label": 0}
{"text": "I've tried them but it's always a rubbery inedible mess. I think it's very sensitive to cooking time and ingredient ratios", "label": 0}
{"text": "That's a beautiful burger", "label": 0}
{"text": "But it's not made of bread", "label": 0}
{"text": "Can you post this again please in a downloadable format. \nThis is gold.", "label": 0}
{"text": "That looks amazing OP!", "label": 0}
{"text": "[Handmade]", "label": 0}
{"text": "That looks great…beautiful rustic color.   Not too dissimilar from mine, curious what about the recipe makes it Basque (certain spice?)", "label": 0}
{"text": "This post has been removed,\n\nYour post does not contain the correct tag. The tag system requires [Homemade], [I ate], or [Pro/Chef] to show the source of your image. The tag system might be better explained in [here](https://www.reddit.com/r/food/wiki/index#wiki_add_a_tag_at_the_front_of_your_title) You may re-title and re-upload using the most appropriate tag for your image.\n\nTitles may only include one (1) single tag. The three tags are:\n\n* [I ate] - You went to a place and most likely exchanged money to eat this. This tag includes restaurants, food trucks, etc.\n\n* [Homemade] - Food you made. This includes food made from scratch, or food assembled from pre-made ingredients.\n\n* [Pro/Chef] - You work in a food-related industry and made it. Chefs, pastry chefs, bakers, butcher, sous chef, and food photographers all fit into this category\n\n* [Text] - For anything text based, help / feedback or in-depth recipes.", "label": 0}
{"text": " It looks delicious and tasty.", "label": 0}
{"text": "This post has been removed,\n\nYour post does not contain the correct tag. The tag system requires [Homemade], [I ate], or [Pro/Chef] to show the source of your image. The tag system might be better explained in [here](https://www.reddit.com/r/food/wiki/index#wiki_add_a_tag_at_the_front_of_your_title) You may re-title and re-upload using the most appropriate tag for your image.\n\nTitles may only include one (1) single tag. The three tags are:\n\n* [I ate] - You went to a place and most likely exchanged money to eat this. This tag includes restaurants, food trucks, etc.\n\n* [Homemade] - Food you made. This includes food made from scratch, or food assembled from pre-made ingredients.\n\n* [Pro/Chef] - You work in a food-related industry and made it. Chefs, pastry chefs, bakers, butcher, sous chef, and food photographers all fit into this category\n\n* [Text] - For anything text based, help / feedback or in-depth recipes.", "label": 0}
{"text": "This post has been removed,\n\nYour post does not contain the correct tag. The tag system requires [Homemade], [I ate], or [Pro/Chef] to show the source of your image. The tag system might be better explained in [here](https://www.reddit.com/r/food/wiki/index#wiki_add_a_tag_at_the_front_of_your_title) You may re-title and re-upload using the most appropriate tag for your image.\n\nTitles may only include one (1) single tag. The three tags are:\n\n* [I ate] - You went to a place and most likely exchanged money to eat this. This tag includes restaurants, food trucks, etc.\n\n* [Homemade] - Food you made. This includes food made from scratch, or food assembled from pre-made ingredients.\n\n* [Pro/Chef] - You work in a food-related industry and made it. Chefs, pastry chefs, bakers, butcher, sous chef, and food photographers all fit into this category\n\n* [Text] - For anything text based, help / feedback or in-depth recipes.", "label": 0}
{"text": "Lol thanks! People didn't like my tongue post but that was interesting as well,I thought.", "label": 0}
{"text": "Home-made, while sitting clearly on a business bar. I mean I know I slice a bowl of lemons for home all the time.", "label": 0}
{"text": "Well, since nobody has said it so far:  This is a tian.", "label": 0}
{"text": "This is genius", "label": 0}
{"text": "I love your posts and always look forward to seeing your pup getting a little snacky snack.", "label": 0}
{"text": "I can't take credit for the idea but I'm super happy with the way they came out!", "label": 0}
{"text": "There's literally a restaurant menu sitting next to your \"homemade\" dish.", "label": 0}
{"text": "Great looking pancakes.", "label": 0}
{"text": "The perfect combo!", "label": 0}
{"text": "what the dog doin", "label": 0}
{"text": "Go for it! Haha", "label": 0}
{"text": "I like the \"homemade\" dish with a restaurant menu sitting next to it.", "label": 0}
{"text": "Your Sunday roast looks amazing, especially the Yorkshire pudding and the variety of veggies.", "label": 0}
{"text": "Do you have any special cooking tips to make the roast beef crispy on the outside and tender on the inside?", "label": 0}
{"text": "https://preview.redd.it/7b8i0m05a4xd1.jpeg?width=3024&format=pjpg&auto=webp&s=c837d64e2d3ac2ef0042492f810542af31814258\n\nthat’s winnie. she’s a big dope. she also has some things to say about [ron howard](https://www.reddit.com/r/AnimalsOnReddit/s/cX45fGEnWx).", "label": 0}
{"text": "Be I prepared it myself", "label": 0}
{"text": "r/wewantchocolatecups", "label": 0}
{"text": "No, they were always steamed and soggy and bitter, parents cooked steak all the way through as well. I had to try cooking as an adult when I figured out searing and caramelizing. Nothing fixes broccoli though.", "label": 0}
{"text": "That’s a really cute idea! I have an appreciation for you doing the math and rounding up. 😅", "label": 0}
{"text": "Mmm pannkakstårta, det väckte minnen!", "label": 0}
{"text": "Love it, cool recipe in time for Halloween", "label": 0}
{"text": "It's a gif, you should be able to download it.  Do you want it in a mp4 or something similar?", "label": 0}
{"text": "Looks like a repost. I've seen this image 1 time.\n\nFirst Seen [Here](https://redd.it/15pbp94) on 2023-08-12 100.0% match.\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=1gcnhul&sameSub=false&filterOnlyOlder=true&memeFilter=false&filterDeadMatches=false&targetImageMatch=80&targetImageMemeMatch=97)\n\n---\n\n**Scope:** Reddit | **Target Percent:** 80% | **Max Age:** 0 | **Searched Images:** 626,764,076 | **Search Time:** 1.76126s", "label": 0}
{"text": "I'm trying to download it, but It doesn't work on mobile. Clicking on the gif just closes your comment and holding it does the same. I'm confuse", "label": 0}
{"text": "looks fancy", "label": 0}
{"text": "Yummy", "label": 0}
{"text": "So cool! the little ghosts look yummy", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "It very much did and gave plenty of leftovers! Love making soups in large batches to save.", "label": 0}
{"text": "I like to use hot breakfast sausage along side ground beef.", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Analyzing user profile...\n\n76.47% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.83\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/HugestLovelyBoobsx is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Ground Chucky 😭", "label": 0}
{"text": "Okay this is brilliant", "label": 0}
{"text": "Fun way to say you went to the pub", "label": 0}
{"text": "hmm I might try that! Thanks for the tip!!", "label": 0}
{"text": "That looks great and tasty.", "label": 0}
{"text": "Looking delicious", "label": 0}
{"text": "\"smothered\"", "label": 0}
{"text": "No thanks", "label": 0}
{"text": "Looks straight out ikea my guy (that's a compliment)", "label": 0}
{"text": "ayyyyyyyy", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Sausage hand!", "label": 0}
{"text": "WOW... looks so delicious", "label": 0}
{"text": "I like them with chocolate milk", "label": 0}
{"text": "I'm going to use some context clues here and guess that they used the two cans of tomatoes right there in the picture.", "label": 0}
{"text": "Are those deep fried frozen vegetables?", "label": 0}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Sharing is caring", "label": 0}
{"text": "That looks so delicious 😋", "label": 0}
{"text": "lemon WITH CHOCO MILK????", "label": 0}
{"text": "Well done that looks delish", "label": 0}
{"text": "Mmmm! Look at all those crispy bits!", "label": 0}
{"text": "Which is still ratatouille", "label": 0}
{"text": "nice job", "label": 0}
{"text": "You won’t be disappointed", "label": 0}
{"text": "Very nice Benchmade knife", "label": 0}
{"text": "It has never occurred to me to cook sausages this way.", "label": 0}
{"text": "wait no i see it cuz one time me and my friends combined lemonade with coffee and that shit was actual fire", "label": 0}
{"text": "Looks amazing", "label": 0}
{"text": "that was my EDC for around 6yrs. he’s in semi-retirement.\n\nhttps://preview.redd.it/bnw2vslmv4xd1.jpeg?width=3652&format=pjpg&auto=webp&s=e3e6c34f0d9d023c82e5b71265c33c8b48d95b0e", "label": 0}
{"text": "Images of fast food and pre-packaged food are not allowed.", "label": 0}
{"text": "Looks like a lot of work for grilled cheese and tomato soup. Looks good though", "label": 0}
{"text": "Looks amazing. I have no frame of reference for this dish. But I want to try it. ", "label": 0}
{"text": "Confused about the bread in the soup.", "label": 0}
{"text": "Look... This looks amazing... And I would 100% take a homemade tomato soup over the Campbell's stuff any day... \n\nBut you know, there's something sentimental and magical for me about a simple sandwich with some crappy white bread and some slices of kraft. Almost every time I make fancy grilled cheese sandwiches I end up thinking I'd have probably secretly liked the crappy kraft one better.", "label": 0}
{"text": "It does look really tasty!", "label": 0}
{"text": "u/redR0OR, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Oh, nice! Where I'm from we also eat boiled tongue, but it's the other side of the world. Way tastier than many cuts. ", "label": 0}
{"text": "Thank you!!", "label": 0}
{"text": "i’m that way with kraft mac and cheese. i do suspect they’ve changed something though. like in the last 10yrs it hasn’t been quite right.", "label": 0}
{"text": "Want", "label": 0}
{"text": "A lil’ snickety snackety,", "label": 0}
{"text": "A bitten Kit Kat.", "label": 0}
{"text": "…still no crisp:)", "label": 0}
{"text": "When life gives you KitKat... but forgets the ‘break", "label": 0}
{"text": "All kit no kat? That's outrageous!!!!", "label": 0}
{"text": "Tiramisu is my favorite dessert; in a chocolate cup I’d be in utter heaven.", "label": 0}
{"text": " Very tasty, highly recommended.\n\nIngredients (two dishes)\n\n* \\~1-2 tsp fresh garlic minced finely\n* \\~50 ml of butter\n* pinch of sugar\n* 1/4 tsp onion powder \n* 1/4 tsp chives\n* 1/4 tsp sea salt\n* 1/4 tsp pepper\n* 1/4 tsp parsley\n\n  \nPreparation\n\nPreheat oven to  350 F. Combine everything but the garlic in a ramekin or small mixing bowl and then melt with medium heat in a microwave for a minute or so (until hot). Add the fresh garlic & stir well to mix. Pour over escargot. Put into the oven about 12-15 minutes to cook, look for some good bubbling from the liquefied butter. Remove, & serve on a plate. Careful, they're hot. \n\nEnjoy & have a great weekend.", "label": 0}
{"text": "Good ol Reddit app. Use a 3rd party app or open it in a web browser.", "label": 0}
{"text": "Amazon,  \"craft foam tray\", saran wrap,  and a template on etsy for the editable labels- printed at home", "label": 0}
{"text": "Thanks but no AI", "label": 0}
{"text": "Same! If someone put this in front of me, I’d be really happy!", "label": 0}
{"text": "If it's American Kit Kat, my condolences", "label": 0}
{"text": "NOTHING more delicious in this WHOLE WIDE WORLD than this! Yum! 😋 Enjoy! 😍", "label": 0}
{"text": "Recipe?", "label": 0}
{"text": "Do you have the recipe for the dessert?", "label": 0}
{"text": "Can't tell if sarcasm or it genuinely tasted awful and at this point I'm too afraid to ask. ![gif](emote|free_emotes_pack|laughing)", "label": 0}
{"text": "How gooey is the center? My biggest issue making these is that the center gets too cooked", "label": 0}
{"text": "awesome man, you're so good at cooking that you can't even spell roux. what is it about posting food that makes some people want to be the worlds biggest haters?", "label": 0}
{"text": "I do love some good halloween themed food! :)", "label": 0}
{"text": "The style is called basque cheesecake. I’m pretty sure its called that cuz it originated from Basque (the country)", "label": 0}
{"text": "What are you replacing it with?", "label": 0}
{"text": "Wow that's a full plate not to mention so much meat ![gif](emote|free_emotes_pack|facepalm)", "label": 0}
{"text": "\n\nPepper Jack-Stuffed Beef Sliders with Balsamic Onion Jam\n\nSide: Cheesy Mashed Potato Cakes\n\n\n---\n\nIngredients\n\n(Makes 6 sliders with 8-10 small potato cakes)\n\nFor the Sliders:\n\n450 g ground beef (80/20 blend)\n\n85 g Pepper Jack cheese, diced or shredded\n\n5 g garlic (1 clove), minced\n\n5 g Worcestershire sauce (1 tsp)\n\n6 g salt (1 tsp)\n\n2.5 g black pepper (½ tsp)\n\n6 slider buns (~25-30 g each)\n\n\nFor the Balsamic Onion Jam:\n\n170 g onions (about 1 medium onion), thinly sliced\n\n28 g butter (2 tbsp)\n\n15 g olive oil (1 tbsp)\n\n45 g balsamic vinegar (3 tbsp)\n\n25 g brown sugar (2 tbsp)\n\nPinch of salt\n\n\nFor the Cheesy Mashed Potato Cakes:\n\n450 g Yukon Gold potatoes, peeled and cubed\n\n45 g butter (3 tbsp)\n\n50 ml milk (3 tbsp)\n\n90 g shredded cheese (Cheddar, Mozzarella, or a blend)\n\n45 g flour (~¼ cup)\n\n1 egg (~50 g)\n\nSalt and pepper to taste\n\n2 tbsp olive oil (for frying)\n\n\n\n---\n\nPrep Work (15-20 Minutes)\n\n1. Peel and Cube the Potatoes: Peel 450 g Yukon Gold potatoes and cut them into uniform 2-3 cm cubes.\n\n\n2. Mince the Garlic: Mince 5 g garlic (1 clove).\n\n\n3. Slice the Onion: Thinly slice 170 g onions (about 1 medium onion).\n\n\n4. Dice or Shred Cheese: Dice or shred 85 g Pepper Jack cheese for stuffing the sliders and 90 g shredded cheddar cheese \n\n5. Measure Butter and Oils:\n\n45 g butter (for potatoes)\n\n28 g butter (for onions)\n\n15 g olive oil (for onions)\n\n2 tbsp olive oil (for frying the cakes)\n\n6. Prepare Seasonings: Portion 6 g salt (1 tsp) and 2.5 g black pepper (½ tsp) for easy access during cooking.\n---\n\nStep-by-Step Instructions\n---\n\n1. Make the Cheesy Mashed Potato Cakes:\n\n1. Add the 450 g cubed potatoes to a pot of cold salted water. Bring to a boil over medium-high heat.\n\n\n2. Boil the potatoes for 15-18 minutes, or until fork-tender. Drain well.\n\n\n3. Transfer the potatoes to a mixing bowl. While still hot, mash them with 45 g butter (3 tbsp) and 50 ml milk (3 tbsp) until smooth.\n\n\n4. Stir in 90 g shredded cheese until fully melted. Season with salt and pepper to taste.\n\n\n5. Let the mashed potatoes cool slightly. Then mix in 1 egg (~50 g) and 45 g flour (~¼ cup) to bind the mixture.\n\n\n6. Shape the potato mixture into 8-10 cakes (~60 g each).\n\n\n7. Heat 2 tbsp olive oil in a non-stick pan over medium heat. Fry the potato cakes for 3-4 minutes per side until golden brown. Set aside on a paper towel-lined plate to absorb excess oil.\n\n---\n\n2. Prepare the Balsamic Onion Jam:\n\n1. Heat 28 g butter (2 tbsp) and 15 g olive oil (1 tbsp) in a pan over medium heat.\n\n\n2. Add 170 g sliced onions and a pinch of salt. Stir occasionally and cook for 15-20 minutes, until the onions caramelize to a deep golden brown.\n\n\n3. Add 45 g balsamic vinegar (3 tbsp) and 25 g brown sugar (2 tbsp). Simmer for 5 minutes until sticky and fragrant. Set aside.\n---\n\n3. Form and Cook the Sliders:\n\n1. In a mixing bowl, combine 450 g ground beef, 5 g minced garlic, 5 g Worcestershire sauce (1 tsp), 6 g salt (1 tsp), and 2.5 g black pepper (½ tsp). Mix gently to combine.\n\n\n2. Divide the mixture into 6 equal portions (~75 g each). Flatten each portion into a thin patty.\n\n\n3. Place 14 g of Pepper Jack cheese in the center of 3 patties. Cover each with another patty, pinching the edges to seal tightly.\n\n\n4. Heat the same non-stick pan over medium-high heat. Sear the sliders for 3 minutes per side until browned and cooked through.\n\n---\n\n4. Toast the Slider Buns:\n\n1. In the same pan, toast the 6 slider buns (25-30 g each) for 1-2 minutes on the cut side, until golden and crisp.\n\n---\n\n5. Assemble the Sliders:\n\n1. Place the cooked sliders on the toasted buns.\n\n2. Add a generous spoonful of balsamic onion jam on top of each slider.\n\n---\n\n6. Serve and Enjoy:", "label": 0}
{"text": "Nice!!", "label": 0}
{"text": "Good looking New York strip and Chili Garlic Noodles.", "label": 0}
{"text": "u/Safe_Wrongdoer_1915, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "I see what you did there 🫶🏾", "label": 0}
{"text": "this one always gets me creeped out haha", "label": 0}
{"text": "Good ol' dogger.", "label": 0}
{"text": "Honestly super well done. Now I want cake since I made pancakes this morning", "label": 0}
{"text": "Used these pickles from earlier in the week\n\nhttps://www.reddit.com/r/food/s/vrmntIACnW", "label": 0}
{"text": "Shoutout to u/chadsexytime for the egg suggestion! Genius", "label": 0}
{"text": "Thank you! They are wonderful dogs!\n\nI wish we had a single litter with her. She would had have beautiful puppies.", "label": 0}
{"text": "You are a wise person 😌.", "label": 0}
{"text": "Looks good but that one piece of broccoli is upside down so I'm out.", "label": 0}
{"text": "These are so awesome", "label": 0}
{"text": "That thing looks like a Rottweiler.", "label": 0}
{"text": "It was delicious, melted in my mouth", "label": 0}
{"text": "I don't know why these homemades pop up on my feed every now and then as I don't even frequent r/food but this one actually looks good. Would devour.", "label": 0}
{"text": "What is in it ?", "label": 0}
{"text": "I cannot stand the dog trend in this sub. Just let the fucker eat it then take the photo of the shit food you made all over its mouth. Dare you.", "label": 0}
{"text": "What is this, a cheescake for ants?", "label": 0}
{"text": "Yum", "label": 0}
{"text": "Your ingredients include no escargot!", "label": 0}
{"text": "![gif](giphy|PRH7kZqQsHTSE|downsized)", "label": 0}
{"text": "That looks amazing! Any chance you could share a recipe for this one?", "label": 0}
{"text": "Nice Hotdog", "label": 0}
{"text": "The sauce", "label": 0}
{"text": "Fixed, thx\n\n![gif](giphy|ZqlvCTNHpqrio|downsized)", "label": 0}
{"text": "Only thing I did differently is use a mix of fresh veggies instead of the frozen stuff and used Sea scallops because they were the only thing available... and a lot cheaper.\n\nIngredients\n\n1 (16 ounce) package mixed frozen vegetables \n2 tablespoons butter\n¾ cup chopped onion\n1 clove garlic, minced\n1 (4 ounce) package sliced fresh mushrooms\n1 ⅔ tablespoon Cajun seasoning\n2 tablespoons all-purpose flour\n1 ½ cups milk\n1 pound sea scallops - rinsed, drained, and cut in half (or whole bay scallops or white fish)\n1 teaspoon salt\n⅛ teaspoon ground black pepper\n\nDirections\n\nPlace the mixed vegetables in a pot with enough water to cover and bring to a boil until the vegetables are tender, about 5 minutes. Drain and set aside.\n\nMelt the butter in a pot over medium-low heat; cook and stir the onion, garlic, mushrooms, frozen corn, red pepper and Cajun seasoning in the melted butter until the onion is tender, but not yet browned, about 5 minutes. Stir in the flour. Pour in the milk; cook and stir until thickened and beginning to bubble. Add the scallops, salt, and pepper; continue cooking until the scallops are opaque, 5 to 7 minutes. Fold the vegetables into the mixture and cook until reheated, 2 to 3 minutes. Serve immediately. \n\nhttps://www.allrecipes.com/recipe/198625/cajun-scallop-chowder/", "label": 0}
{"text": "https://www.seriouseats.com/detroit-style-pizza-recipe", "label": 0}
{"text": "Well that makes zero sense at all, you should try it like this though.", "label": 0}
{"text": "I'd recognize it anywhere.", "label": 0}
{"text": "Poisoning that poor defenseless burger with guac after luring it with the promise of jalapeños …. Your a monster 😂", "label": 0}
{"text": "It is a cooked starchy vegetable food made from dried grated cassava (manioc) flour commonly known as garri all across West Africa. It is often eaten with rich soups and stews, with beef, stockfish or mutton. The dish is often described as having a slightly sour, sharp taste.", "label": 0}
{"text": "For those who never had birria, try it, now. It was like the first time I had a slice of pizza or a cheeseburger.\n\n# Quesabirria = Heaven", "label": 0}
{"text": "that’s pretty cool.", "label": 0}
{"text": "Beautifully cooked and cut", "label": 0}
{"text": "What did you use for the fingernails?", "label": 0}
{"text": "If you focus hard enough there's actually a dog in this photo! \n\nExcellent steak!", "label": 0}
{"text": "My mouth is watering already! Thank you!", "label": 0}
{"text": "That looks amazing the colour is beautiful and of course it looks delicious", "label": 0}
{"text": "I feel like some Karen might end up screaming at you over the 666. But awesome idea", "label": 0}
{"text": "This is inspiring me to have pizza tonight. Maybe even make one myself.", "label": 0}
{"text": "Unnecessary", "label": 0}
{"text": "How???", "label": 0}
{"text": "damn that looks professional!\n\nwhat is cross laminated?", "label": 0}
{"text": "Well now I'm having pancakes before I make this homemade pizza 😏😂 I have plenty of cake already 😁", "label": 0}
{"text": "This looks so good", "label": 0}
{"text": "never cared for guac on burgers, seems like a wasted chance at tacojoes", "label": 0}
{"text": "Little Caesars", "label": 0}
{"text": "Ah nice 😁 I was thinking it was pickled ginger", "label": 0}
{"text": "I really want to try this", "label": 0}
{"text": "A Karen who would scream about 666 probably isn't letting their kid trick or treat in the first place.", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gcvfu2/i_ate_sushi/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "The asparagus cook looks great, the consistency of the  hollandaise looks amazing as well.\n\nBut where do you live that you get fresh white asparagus at this time of the year? Where I live white asparagus with any form of butter is a spring delicacy.", "label": 0}
{"text": "it has got some cartoonish perfect look in my eyes and the serving board adds a decent touch. well done 👏", "label": 0}
{"text": "Oooh pooch tax. That’s some fun pictures.", "label": 0}
{"text": "Looks like a repost. I've seen this image 2 times.\n\nFirst Seen [Here](https://redd.it/1gcuhkv) on 2024-10-26 100.0% match. Last Seen [Here](https://redd.it/1gcuiuh) on 2024-10-26 100.0% match\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=1gcvh3u&sameSub=false&filterOnlyOlder=true&memeFilter=false&filterDeadMatches=false&targetImageMatch=80&targetImageMemeMatch=97)\n\n---\n\n**Scope:** Reddit | **Target Percent:** 80% | **Max Age:** 0 | **Searched Images:** 627,014,840 | **Search Time:** 0.06588s", "label": 0}
{"text": "I want it so bad 😭", "label": 0}
{"text": "thank you so much 😊", "label": 0}
{"text": "So much cheese. Apart from the ocean of cheese looking melted, why does the dough still look raw?", "label": 0}
{"text": "Mustard is so good on so much if you like mustard. When TikTok was on about mustard as a healthier alternative to dip veggies in.. that shit slaps. They were right.", "label": 0}
{"text": "😂", "label": 0}
{"text": "I don't cook, they cook for me 😚", "label": 0}
{"text": "The mom we all wanted", "label": 0}
{"text": "Aww ![gif](emote|free_emotes_pack|slightly_smiling) my kids are out of the house.  I was rarely one of those moms when they were young as it was hard to get 'stuff'together as a single parent.", "label": 0}
{"text": "Recipe or it didn’t happen !", "label": 0}
{"text": "this is probably the most creative and clever ideas I've seen In a long time.  freaking awesome", "label": 0}
{"text": "Looks gooood!", "label": 0}
{"text": "2000£", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "It was so good 😍", "label": 0}
{"text": "Is that cheese? I thought it was some kind of sauce. Looks almost like a hollandaise.", "label": 0}
{"text": "It’s not a country, it’s a region in both Spain and France. Burnt basque cheesecake was created in the 90s in the Spanish basque region", "label": 0}
{"text": "Pittsburg it???\n\nLooks beyond incredible!", "label": 0}
{"text": "I’m totally on board everything here… except the yellow mustard inside a grilled cheese. That would ruin it for me. Not saying you can’t like it though… do you!", "label": 0}
{"text": "the classic autocorrect roux into rue! just admit you have no clue what you're talking about and stop shitting on some guy for uploading a pic of his oven baked tater tots, loser", "label": 0}
{"text": "Well it’s one a pizza, so I made that bold assumption… who really knows though?", "label": 0}
{"text": "Your dogs beautiful but also looks like he’s about to lay-off an entire department.", "label": 0}
{"text": "Omg", "label": 0}
{"text": "Amazing looking! What’s the name of this heirloom?", "label": 0}
{"text": "Do you deliver", "label": 0}
{"text": "it’s magic\n\n![gif](giphy|ieREaX3VTHsqc)", "label": 0}
{"text": "Well, the math is off. It should be 6.64", "label": 0}
{"text": "Bacon cheeseburgers are normal.", "label": 0}
{"text": "it was pretty alright. definitely had better but it was ready in like 20min so i can’t complain.", "label": 0}
{"text": "Recipe please!", "label": 0}
{"text": "Lord would I destroy that right now. The pup is adorable too, I'm sure r/animalslookingatfood would love them!", "label": 0}
{"text": "What is the third one, please? :)", "label": 0}
{"text": "Looks so delicious", "label": 0}
{"text": "Hey there, u/cuzoil! Thank you for your submission. Unfortunately, it has been removed for the following reason(s):\n\n**Image Title Rule:**\n\n* The majority of your title (over 50%) must specifically describe the food.\n\n* Avoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\n* Example:\n\n \"[Homemade] Chicken & rice for dinner\"✔️\n\n \"[I Ate] Tonight's dinner\"❌\n\n**Some examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.**\n\n\n\nFor more information, please see the sub rules/wiki/sidebar, or modmail the team. Thank you!", "label": 0}
{"text": "It's a repeat of one of the two showing.", "label": 0}
{"text": "OMGG I need the recipe!!’", "label": 0}
{"text": "It looks like someone dropped a steamer on top of your desert my friend. That’s very unfortunate.", "label": 0}
{"text": "Yes now we’re talking, perfect", "label": 0}
{"text": "5/5 Classic Cheesburger.", "label": 0}
{"text": "dirty water dogs forever ", "label": 0}
{"text": "search on-line for La Vina burnt cheesecake.  It's simpler than regular cheesecake and tasters great!", "label": 0}
{"text": "Your [submission](https://www.reddit.com/r/food/comments/1gcx9iy/i_ate_korean_food_today/ has been removed because you used an emoji in the title. Please retry your submission without emojis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "did you get get the shits?", "label": 0}
{"text": "nope. ", "label": 0}
{"text": "Yes, so creepy/cool!", "label": 0}
{"text": "Oh that looks so good!", "label": 0}
{"text": "You're really a good chef it looks yummy yummy", "label": 0}
{"text": "Kimchi Udon. Say no more, I’m sold!", "label": 0}
{"text": "Good job", "label": 0}
{"text": "Good job and looks good", "label": 0}
{"text": "Here’s a classic recipe for apple fritters that’ll give you that sweet, crispy deliciousness you’re looking for!\n\nIngredients\n\n\t•\tFor the Fritters:\n\n\t•\t1 cup (125g) all-purpose flour\n\n\t•\t2 tbsp granulated sugar\n\n\t•\t2 tsp baking powder\n\n\t•\t1/2 tsp ground cinnamon\n\n\t•\t1/4 tsp salt\n\n\t•\t1/2 cup (120ml) milk\n\n\t•\t1 large egg\n\n\t•\t1 tsp vanilla extract\n\n\t•\t2 cups (about 2 medium) apples, peeled, cored, and diced\n\n\t•\tOil for frying (vegetable or canola oil)\n\n\t•\tFor the Glaze:\n\n\t•\t1 cup (125g) powdered sugar\n\n\t•\t2-3 tbsp milk\n\n\t•\t1/2 tsp vanilla extract\n\nInstructions\n\n\t1.\tHeat the Oil: In a deep skillet or heavy-bottomed pot, heat about 2 inches of oil to 350°F (175°C).\n\n\t2.\tMake the Batter:\n\t•\tIn a mixing bowl, whisk together the flour, sugar, baking powder, cinnamon, and salt.\n\t•\tIn a separate bowl, mix the milk, egg, and vanilla extract until combined.\n\t•\tPour the wet ingredients into the dry ingredients and stir until just combined.\n\t•\tFold in the diced apples gently.\n\n\t3.\tFry the Fritters:\n\t•\tOnce the oil is hot, use a spoon or a small ice cream scoop to drop small mounds of batter into the oil, about 2-3 tablespoons at a time.\n\t•\tFry the fritters in batches, making sure not to overcrowd the pot.\n\t•\tCook for 2-3 minutes on each side, or until golden brown and cooked through.\n\t•\tRemove the fritters with a slotted spoon and place them on a paper towel-lined plate to drain any excess oil.\n\n\t4.\tMake the Glaze:\n\t•\tIn a bowl, whisk together powdered sugar, milk, and vanilla until smooth and drizzly.\n\t•\tAdd more milk if needed to reach your desired consistency.\n\n\t5.\tGlaze the Fritters:\n\t•\tDip each fritter into the glaze or drizzle the glaze over the fritters.\n\t•\tLet them sit on a wire rack for a few minutes to allow the glaze to set.\n\n\t6.\tServe: Enjoy warm, fresh, and crispy!\n\nLet me know if you need any variations or tips to spice things up!", "label": 0}
{"text": "I love Apple Fritters!", "label": 0}
{"text": "I like that the parsley looks like eyes and mouths.", "label": 0}
{"text": "looks absolutely divine", "label": 0}
{"text": "Nice except the tails on the shrimp", "label": 0}
{"text": "Now I need pierogis.", "label": 0}
{"text": "Good looking dish. Gorgeous doggo 🤍", "label": 0}
{"text": "thanks, one of my favorites.", "label": 0}
{"text": "So nice to see Brazilian food getting some love! Are you having a party?", "label": 0}
{"text": "dill but yes. :)", "label": 0}
{"text": "I thought I recognized it. Looks amazing.", "label": 0}
{"text": "What's in the broth?", "label": 0}
{"text": "Tik-Tok? Been having mustard on grilled cheeses since the early 90s.", "label": 0}
{"text": "Looks pretty damn good. How was it?", "label": 0}
{"text": "Yummy", "label": 0}
{"text": "I’ve never tried catfish looks great", "label": 0}
{"text": "What ground chucky taste like? HAHA", "label": 0}
{"text": "Wow", "label": 0}
{"text": "Looks good! What seasoning to you use for the catfish?", "label": 0}
{"text": "Thanks!  It's about a tsp of each:\nGarlic powder \nOnion powder \nThyme\nCayenne \nPaprika \nBlack pepper \nSalt\n\nDredge the fish in it before cooking.  Can also use Cajun seasoning instead.", "label": 0}
{"text": "That looks very good!", "label": 0}
{"text": "There’s a seasoning you can buy end or make called blackened or blackening seasoning. Which equates to blackened fish or whatever your making tastes like a mild smoky old bay", "label": 0}
{"text": "u/shoegazelife, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "i mean i assembly them", "label": 0}
{"text": "I’ve added this to my shopping list! Your description makes it sound like it would be fantastic with my pasta", "label": 0}
{"text": "That one floret really did some damage unfortunately.", "label": 0}
{"text": "Complicated sandwich.", "label": 0}
{"text": "Making the bun... Kinda, but worth it.\n\nEverything else was either simple or done in advance (everything pickled)", "label": 0}
{"text": "heat your plate in the oven first. Keeps your food warm.", "label": 0}
{"text": "That looks interesting and tasty! What are the ingredients?", "label": 0}
{"text": "Thanks. I use more paprika (smoked, not sweet) and a little basil, oregano, and thyme. I also might add more cayenne after cooking because I like it spicy but my family does not. But I rarely measure the seasoning so it's a little different each time.", "label": 0}
{"text": "I think he is plotting.", "label": 0}
{"text": "Sausage, Bread, Smashed Potato, Peas, potato straws and of course ketchup", "label": 0}
{"text": "I’ll have to give that a try!  Thanks for the challenge!  🌭", "label": 0}
{"text": "Mayo works too", "label": 0}
{"text": "u/AMY0173, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* Your title is a question or contains a question, which breaches our title rules for image posts. THe majority of your title (50%) should only describe what the food is. If you want to ask a question, please use a text post. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "The juice on the bottom of the “meat”", "label": 0}
{"text": "I think that meat needs a few more minutes of cooking", "label": 0}
{"text": "Can you share the recipe for the noodles? 🤤", "label": 0}
{"text": "I've never tried this, but it looks delicious.", "label": 0}
{"text": "That's the perfect doneness I like for meat", "label": 0}
{"text": "I like the color it has, but I wouldn't eat this", "label": 0}
{"text": "I'm sitting here eating a bologna and cheese and suddenly feel like crying.", "label": 0}
{"text": "Thank you! It pretty tasty. Finished it a little too quick. 😅", "label": 0}
{"text": "I find that meat horrible", "label": 0}
{"text": "Tastes a lot like rice Krispy treat lol", "label": 0}
{"text": "Smart cheesecake.", "label": 0}
{"text": "Not my idea but apparently also used in horror movies back in the day.", "label": 0}
{"text": "Very nice plating and photography.  What cut of meat is that?", "label": 0}
{"text": "I swear that ones a heart screaming eat me NOW", "label": 0}
{"text": "Oh man, this is one my go to dishes multiple times a month. Drooling right now.", "label": 0}
{"text": "You freakin nailed it! Looks perfect 👌", "label": 0}
{"text": "You're gonna have to fight me for it", "label": 0}
{"text": "this will be my dinner tonight", "label": 0}
{"text": "Heck yeah! Hope you enjoy it as much as I did", "label": 0}
{"text": "today I tried this for lunch, I can say it's delicious.", "label": 0}
{"text": "The meat is way too thick. ", "label": 0}
{"text": "Mine too", "label": 0}
{"text": "I've been a chef for a long, long time. I started in fast food, then chains, got a break at a high-end restaurant, went to culinary school, worked my ass off at places in Chicago, LA, and NYC, and now I finally have the privilege to run my own place. \n\nI say all of that because, at the end of the day, there's a subtle beauty to Gatorwine. Does it sound gross? Yes. Is it in many ways grotesque? Absolutely. Does it work? Somehow. \n\nSeriously guys, don't hate it until you try it lol", "label": 0}
{"text": "my doctor doesn't let me eat this, but it's delicious.", "label": 0}
{"text": "Love that you took time to add the 940 lol", "label": 0}
{"text": "It's actually not called basque, it's called *bossk* cheesecake after the similar shade to the Trandoshan bounty hunter", "label": 0}
{"text": "Extra calcium! (You know, from the bones)🦴", "label": 0}
{"text": "Plastic wrap might want to be tighter, but otherwise brilliant!", "label": 0}
{"text": "Phenomenal! Congratulations, it looks superb (and is making me very hungry, despite it being 01:25 where I am at the moment).", "label": 0}
{"text": "Is that a cutlet in there? Daaamnnn", "label": 0}
{"text": "I love black magic, its makes your steak look like a guy who dyed his hair with way too dark of a color", "label": 0}
{"text": "Not if I lick the sandwich first", "label": 0}
{"text": "I shared with my daughter who asked me for my recipe....don't remember where I got it from. These look so good!", "label": 0}
{"text": "Babish content making its way into this sub. Nice.", "label": 0}
{"text": "it's a burger to share with friends", "label": 0}
{"text": "A bit over cooked for my taste but it does look delicious and great plating.", "label": 0}
{"text": "I’ll wear a dog suit if you’ll feed me that.", "label": 0}
{"text": "I'm looking for a partner to share a dinner like this", "label": 0}
{"text": "Lets get some Hometown BBQ up in here", "label": 0}
{"text": "Unexpected r/MagicTavern", "label": 0}
{"text": "Probably heard this a million times, but I hope that dog's name is ditto.", "label": 0}
{"text": "Jolly good show! 😊", "label": 0}
{"text": "Mash some of the beans against the side of the pot, and it will thicken.\n\nOr, add a slurry of masa.", "label": 0}
{"text": "Nicolosis in Easton?", "label": 0}
{"text": "I'm kind of lost on your comment. I've eaten plenty of raw and cooked meat; fish, beef, chicken, venison, alligator, pork, mettbrötchen, tartare, surströmming, snakes, the list goes on you name it and I probably tried it or still eat it. It's all the same meat to me. This is a culinary experience and an image of beauty(except that one piece of broccoli, sorry lol).", "label": 0}
{"text": "Oy!!! that’s a banger mate!!!!", "label": 0}
{"text": "Delicious", "label": 0}
{"text": "This is wild! I like it ![gif](emote|free_emotes_pack|grin)", "label": 0}
{"text": " That looks yummy :)", "label": 0}
{"text": "These look amazing but man do I dislike the term \"guac\". It sounds like someone hawking up a loogie. Guac **TUAH**", "label": 0}
{"text": "Gotta have the dill.", "label": 0}
{"text": "i had left the post before i processed this and had to come back in to upvote you.", "label": 0}
{"text": "Haha! That's awesome :)", "label": 0}
{"text": "Wow. All your posts are insane. Do/did you make a living as a chef/baker???", "label": 0}
{"text": "Great. Now I want pizza skulls.", "label": 0}
{"text": "You made your own cheese?  That's Impressive", "label": 0}
{"text": "Hah, my sister has a pizza mould and she makes these every year. It's really satisfying to pull the top of the skull off and see cheese and red sauce ooze out...", "label": 0}
{"text": "Ok I'm going need one like yesterday", "label": 0}
{"text": "Sabrett? Im a Grey's man myself", "label": 0}
{"text": "I love you so much for this, what a great idea! I've used rice treats before to make dessert imposter treats but this is something I've never thought of or seen before!", "label": 0}
{"text": "Yum", "label": 0}
{"text": "Good job", "label": 0}
{"text": "Good job", "label": 0}
{"text": "Looks good", "label": 0}
{"text": "Unique idea", "label": 0}
{"text": "Looks so good", "label": 0}
{"text": "Cross section?", "label": 0}
{"text": "Maybe the receipt is just honey garlic butter and soy? :’)\n\nLooks delicious however.", "label": 0}
{"text": "Thank you ☺️", "label": 0}
{"text": "Thank you so much. This one is a top sirloin. If I were to do it again, I would prefer a ribeye here.", "label": 0}
{"text": "How do you make them", "label": 0}
{"text": "The cauliflower itself is purple. I added a touch of ube extract as well though it didn't come through much on the taste.", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Thank you! :)", "label": 0}
{"text": "I miss mine alot, best doggo ever. But so high energy.", "label": 0}
{"text": "101 dalmatian time 🥹", "label": 0}
{"text": "That would be a fun variation too!", "label": 0}
{"text": "so you have an excuse :) either way, it still looks and probably tasted delicious. well done ( no pun intended)", "label": 0}
{"text": "👍 my pleasure! \n\nYou have a great way with colour, lighting, and composition. Thanks for posting.", "label": 0}
{"text": "Oh they look heavenly!", "label": 0}
{"text": "Lodge Cast Iron has a good skull mold. Search \"Lodge Skull Mini Cake Pan\"", "label": 0}
{"text": "My dumb ass thought you melted cheese on them bitches. Well…Apple pie and cheese is a thing….i digress. Looks great. Love an Apple fritter!", "label": 0}
{"text": "Love me some apple fritters! What type of apples do you use/recommend?", "label": 0}
{"text": "Lol, thank you. Excellent pun.  :)", "label": 0}
{"text": "I thought this was an ad 😂 \nSeriously OP, this is such a beautiful plate. One could say it…put a spell on me!", "label": 0}
{"text": "I’ve come to call the crust “pizza bones”", "label": 0}
{"text": "Ooooh.", "label": 0}
{"text": "👍🏻👍🏻👍🏻", "label": 0}
{"text": "raw onions on pizza. that's a first.", "label": 0}
{"text": "Dill!  Great addition to chicken soup.", "label": 0}
{"text": "Shout out to the great cooks in here that post amazing meals but dont get upvoted because they aren’t karma farming with a dog", "label": 0}
{"text": "yummy!", "label": 0}
{"text": "Looking yummy 😋", "label": 0}
{"text": "those came out awesome! hope someone gave you hand making them...\n\n![gif](giphy|jbwsLn6OvdO80|downsized)", "label": 0}
{"text": "Did the other comments say that you’re fat and can’t walk short distances?", "label": 0}
{"text": "Thank Mr Skeletal!", "label": 0}
{"text": "Perfect bread to meat ratio", "label": 0}
{"text": "yum chops, how did you make them look so yummy", "label": 0}
{"text": "Doot doot!", "label": 0}
{"text": "Reminds me of that Jimmy Neutron Pizza monster", "label": 0}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 0}
{"text": "Need a shot of a gooey one!", "label": 0}
{"text": "Ur mom's house.", "label": 0}
{"text": "u/Pumpkinmal, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "u/Pumpkinmal, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Hard pass", "label": 0}
{"text": "Maybe it needed to rest a little longer before slicing, or maybe it was just a really juicy meat regardless. Garnish on the cutting board feels a little weird, but I understand it's for the picture. What else is on that bad boy? I see bell pepper, queso fresco(?) and a beautifully fried tortilla. What's the hot sauce and did you marinade the meat yourself?", "label": 0}
{"text": "Looks legit", "label": 0}
{"text": "YUM!!!!!", "label": 0}
{"text": "It was 16.95 I think for a full 12\" beast of a sub", "label": 0}
{"text": "It was actually called the Nicky sandwich and it had ham, salami, cappicola, fried eggplant, hot salad, mushroom, lettuce and tomato. Absolute beast of a sando", "label": 0}
{"text": "That looks so good!", "label": 0}
{"text": "looks simple but yummy", "label": 0}
{"text": "Why did it win?", "label": 0}
{"text": "Bruhhhh what?! That’s a great deal lol.", "label": 0}
{"text": "Pizza skull sounds like an insult.\n\n\"What were you thinking? You damn pizza skull.\"", "label": 0}
{"text": "these were clearly cooked in.  you don't just slip a bit of the onion under the cheese after it baked...", "label": 0}
{"text": "That's a pretty dish. Well arranged, good photo. Kudos.\n\nI'm sure you enjoyed it :)", "label": 0}
{"text": "It’s cheese and sauce", "label": 0}
{"text": "Fantastic!  I just checked out your other posts; genuinely inspirational presentation all round.", "label": 0}
{"text": "Half peperoni, all onion. I could fuxx with that! That crust looks perfect!", "label": 0}
{"text": "At this point the egg is an afterthought.", "label": 0}
{"text": "It wasn’t mine. I was just a judge.", "label": 0}
{"text": "Wait is that what they meant by \"boneless pizza\"?\n\nIt makes so much sense now.", "label": 0}
{"text": "I need to try this during halloween", "label": 0}
{"text": "There's a few ways to do pierogi/perogies. There's also more than a few names for perogies. Varenky are a Ukrainian version, however so is Pedaheh, however that may be more localized. They are all a filled dumpling. Usually with similar ingredients and cooked almost always the same ways. \n\nSome prefer them boiled and then fried and some prefer them only boiled. Almost always with a butter or a fat of some kind, sometimes bacon and onions over top. Sometimes served with a sour cream and fried kolbassa.\n\nThis sub however does not allow for many outside link recipes because of the current domain whitelist restrictions.", "label": 0}
{"text": "yes, how do you think they survive out of the water?", "label": 0}
{"text": "I would eat the food you made.", "label": 0}
{"text": "Absolutely!", "label": 0}
{"text": "I need to try that this morning can you give me the procedure.", "label": 0}
{"text": "It's look good.", "label": 0}
{"text": "So good, it looks like AI but you know it’s real.", "label": 0}
{"text": "Did you mean \"skull pizza\" (pizza shaped like a skull) or \"pizza skull\" (skull that tastes like pizza)? :>", "label": 0}
{"text": "How did you make them wow 🤩.", "label": 0}
{"text": "Nothing else? Not even water? Anyway, I'd suggest the Salt Mound.\n\n&#x200B;\n\n**Ingredients:**\n\n1 tsp of salt (on a serious note: careful here, too high doses are deadly)\n\n**Instructions:**\n\nPour salt into a small dish or bowl, arranging it into a neat mound.\n\nDraw a smiley face with your finger.\n\nAdmire the simplicity of your salt mound for about 15 minutes without consuming.\n\nThen stand up and go shopping for pasta, in which that salt can actually be put to a sensible use ;)", "label": 0}
{"text": "u/Vaultoffel, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "I really love pizza wow yummy good work.", "label": 0}
{"text": "Bottom right one looks like they have a beard", "label": 0}
{"text": "Careful what you wish for, because personally, I'm not sure I'd want to judge this one beyond a first glance.  And un-fucking-fortunately that is the burden you suddenly bear as a judge.  Gotta bite em all.", "label": 0}
{"text": "I don't know which bothers me more, you going all in on this joke post, or the person appearing to not get it.\n\nEither way, kudos to you both.", "label": 0}
{"text": "That looks so delicious 🤤", "label": 0}
{"text": "Did no one else show up?", "label": 0}
{"text": "This shape is really unique. How does the filling inside taste?", "label": 0}
{"text": "Was it sausage filled?", "label": 0}
{"text": "Mmmmm, dry-looking meat and bland boiled vegetables", "label": 0}
{"text": "I make these every year for my kid at Halloween. We call them Skullzones.", "label": 0}
{"text": "Never seen a sandwich like that in Italy tbh", "label": 0}
{"text": "why do you guys love few ingredients in your burgar?", "label": 0}
{"text": "Ouch.", "label": 0}
{"text": "I mean it’s the only place where American cheese actually works somewhat", "label": 0}
{"text": "How many burgers did you have to judge? Won't get you get super full quick", "label": 0}
{"text": "He is being a smartass OP don't worry about him", "label": 0}
{"text": "Is there any difference if you sear first and then oven?", "label": 0}
{"text": "lol was really confused how and why this man slow cooked tenderloin.", "label": 0}
{"text": "Ooh yeah I missed the spice part lol", "label": 0}
{"text": "8 but we only had a couple of bites of each", "label": 0}
{"text": "Onion pizza with half pepperoni.", "label": 0}
{"text": "Add some bacon", "label": 0}
{"text": "……another babka?", "label": 0}
{"text": "Your British you eat peas and fries", "label": 0}
{"text": "You’re so close to getting it", "label": 0}
{"text": "Because it was a taste contest. They want to taste the burger.", "label": 0}
{"text": "when i see red onion on a pizza i immediately think like\"it needs bbq sauce drizzling over the top\" due to the times i was loving to eat papa john's bbq chicken pizza. pepperoni and red o ion co bo looks nice too.", "label": 0}
{"text": "This looks like an Italian Torta to me… it looks amazing", "label": 0}
{"text": "u/Commercial_Room6961, thank you for your submission to r/food! Unfortunately, it has been removed for the following reason(s):\n\n* You've posted a [text] post using image post tags, please use a [text] text posts. Images can be included in the body of a text post if you are using the desktop site, currently in-line images are not avalable on mobile.  \n\nFor more information, please see the [wiki](https://www.reddit.com/r/food/wiki/index). If you have any further questions, feel free to [contact the moderators](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal). Please include a link to the post so the moderators know what you would like reviewed. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 0}
{"text": "Thank you :)", "label": 0}
{"text": "Can I eat a bit, haha looks yummy 😋", "label": 0}
{"text": "American cheese is the best cheese for a cheeseburger because it melts without splitting.", "label": 0}
{"text": "I’ll be right over with a gallon of milk!", "label": 0}
{"text": "I’m hella hungry for that !", "label": 0}
{"text": "🦇", "label": 0}
{"text": "They look so good. Great effort.", "label": 0}
{"text": "This is just a quote from The Menu.", "label": 0}
{"text": "Who is British???", "label": 0}
{"text": "what’s in the middle of them. Looks awesome btw can I have some lol", "label": 0}
{"text": "It's perfect, although the beans make the stomach gassy sometimes.", "label": 0}
{"text": "I care", "label": 0}
{"text": "It’s like a judging a croissant, you’d want the plain one to tell how good the overall dough is as opposed to a chocolate or almond one.", "label": 0}
{"text": "Apparently you", "label": 0}
{"text": "Hey thank you", "label": 0}
{"text": "So good", "label": 0}
{"text": "Any apples you bought too much of because your kids said they wanted apples and then never touched them", "label": 0}
{"text": "Oh theres been jokes ;-)", "label": 0}
{"text": "Theyre so good", "label": 0}
{"text": "not that much no, it does sear better i find", "label": 0}
{"text": "Are you a bot? Your responses dont make any sense..", "label": 0}
{"text": "I would’ve minced some fresh jalapeño into that cheese sauce and won your vote, therefore, the competition", "label": 0}
{"text": "I like tasting the BEEF", "label": 0}
{"text": "My doctor told me not to eat this because of the raw sausage.", "label": 0}
{"text": "Looks amazing", "label": 0}
{"text": "Beautiful", "label": 0}
{"text": "That looks good. Love gribiche with any kind of schnitzel", "label": 0}
{"text": "This is amazing I need to attempt this", "label": 0}
{"text": "Great", "label": 0}
{"text": "I’m a chef. Cooking school and all. Learn how to take criticism because you sound like a child.", "label": 0}
{"text": "Haha that’s exactly what I call it 🤣", "label": 0}
{"text": "Thank you! ☺️", "label": 0}
{"text": "But that’s bacon in the middle", "label": 0}
{"text": "Really good, cheesy but good with a piece of pepperoni", "label": 0}
{"text": "I purchased them", "label": 0}
{"text": "You might be using bad American. You gotta get Kraft. Some off brands are more like plastic and they never melt", "label": 0}
{"text": "Yep slow cooked tenderloin is like an hour simmering", "label": 0}
{"text": "what's the criticism towards me dumbass? i didn't cook it. and you're definitely not a chef. learn how to not pretend you're better than everyone because you live a sad life", "label": 0}
{"text": "Lasagna", "label": 0}
{"text": "redditcares", "label": 0}
{"text": "Tough to do when you're trying to keep corn syrup from getting all over everything.", "label": 0}
{"text": "I had about 3 pounds of chuck roast that I needed to use and didn't want to make a stew or roast so I got the idea of using it to make pizzaiola in place of steak. I didn't think through a side dish so I just used some instant potatoes I had lying around. \n\nI seared the meat in some olive oil and then removed it to a plate. I then sauteed some red bell pepper with mushrooms until they were soft added red pepper flakes and minced garlic to taste for a few minutes before adding a half cup of chardonnay with a half cup of beef broth letting that boil for a couple minutes before adding a 28 ounce can of peeled tomatoes that I crushed by hand before. Seasoned to taste with salt, pepper, and oregano. I added back in the meet and mixed it all up bringing it to a simmer for about 90 minutes when the meat was fork tender.", "label": 0}
{"text": "You were a judge of burgers and you called a smashburger a \"smashed cheesburger\"", "label": 0}
{"text": "Ah, so you just don’t make any sense", "label": 0}
{"text": "Wife or wives?", "label": 0}
{"text": "Yes", "label": 0}
{"text": "You mean crisps", "label": 0}
{"text": "I was genuinely curious to know the reasons but reddit is reddit :))))", "label": 0}
{"text": "Nah, imo just this sub", "label": 0}
{"text": "This is not the answer for my question", "label": 0}
{"text": "How’s that? Which part confuses you?", "label": 0}
{"text": "so eat steak then?", "label": 0}
{"text": "What country was this in?", "label": 0}
{"text": "This was in Newfoundland and Labrador, Canada.", "label": 0}
{"text": "Nah mac and cheese and grilled cheese sandwiches are better with other “real” types of cheese\n\nThere are plenty of cheeses that melt wel without being processed to all hell", "label": 0}
{"text": "Wtf", "label": 0}
{"text": "Well this is a smash burger. A loaded burger is different. A smash burger is pressed thin on a flat iron grill and gets its flavor from the Maillard reaction on the meat. I still put lettuce, tomato and onions on my smash burger, but OP was in a tasting contest.", "label": 0}
{"text": "It’s not my choice cut either, but it was alright!", "label": 0}
{"text": "A what now?? How do I get into one of these and where?", "label": 0}
{"text": "Jalapeños under the cheese is a new one for me, but I'm interested to try it out.", "label": 0}
{"text": "Ooh, how about a recipe?", "label": 0}
{"text": "Nah go to the deli and have them slice fresh American.", "label": 0}
