{"text": "I downvote any “charcuterie board” that contains anything other than meat. \nIt’s the literal meaning of the word. Let’s not ruin it.", "label": 1}
{"text": "We really got to be friends", "label": 1}
{"text": "Damn you have to be the oerfect lady ❤️", "label": 1}
{"text": "Lol buddy, better put your flame retardant suit on. You're gonna get roasted for this abomination.", "label": 1}
{"text": "Elotes is very common to refer to either style in northwest Mexico and California. Family in Playa do use the distinction but when I'm in Rosario or Tijuana both are referred to as elotes", "label": 1}
{"text": "Is Trich basically irradiated in Germany? I’m fearful to try here in NA as I don’t trust the quality standards of our pork to the point I’m comfortable consuming it raw, that said, I want to try it over there lol", "label": 1}
{"text": "In Germany, pork is heavily regulated, so eating it raw is generally safe 😊", "label": 1}
{"text": "I'm pretty sure it's eradicated in the US as well. I think there's only a few cases a year and they all come from wild boar. \n\nCan't speak for the rest of north america though", "label": 1}
{"text": "It's funny that most of the world does sweet things with French toast, I prefer loads of black pepper and HP sauce.", "label": 1}
{"text": "so, what's up with trichinosis these days? is it really not a risk any longer?", "label": 1}
{"text": "Yep, more likely to catch something in prepacked fresh veggies.", "label": 1}
{"text": "You won’t get food poisoning, just a little radiation poisoning!", "label": 1}
{"text": "Cooked meat tastes better. It’s not a matter of “Americans don’t have fresh food.” Enjoy your goop though!", "label": 1}
{"text": "Freshness has nothing to do with it. Trichinosis is a parasite and will be present in the meat regardless of how fresh it is. Germany just heavily tests for trichinosis.", "label": 1}
{"text": "100% Raw, don’t knock it before you try it 😊", "label": 1}
{"text": "people rave about tartare, sashimi and sushi, but somehow *this* is off limits?", "label": 1}
{"text": "german food looks sad", "label": 1}
{"text": "Nice presentation, that lil mouse is brilliant.", "label": 1}
{"text": "Trichinosis isnt real. You're must be mistaking it for vaginosis.", "label": 1}
{"text": "Yeah, trichinosis in farm raised pigs hasn’t been a serious problem in the US in literal decades. Between 02 and 07 there were less than a dozen cases per year in the US and most of them were from wild game.", "label": 1}
{"text": "It's interesting that you're the only one who mentioned that lol", "label": 1}
{"text": "ew", "label": 1}
{"text": "I heard it was a big deal here in the US recently. Source: Midwest meat processor engineer who isn't me.", "label": 1}
{"text": "Solid nope from me. American BBQ sauce is disgusting.", "label": 1}
{"text": "Just edit the word. No need to write the edit.", "label": 1}
{"text": "Most carnivores and omnivores are", "label": 1}
{"text": "wanna eat this!", "label": 1}
{"text": "Is there a tiktok thing going on here?  There's been an awful lot of these posts in the last month or so.", "label": 1}
{"text": "Holy crap that's impressive how realistic that is", "label": 1}
{"text": "Wow! they look perfect", "label": 1}
{"text": "looks so fluffy sweetie", "label": 1}
{"text": "Why the downvotes? I don't mind them, but if you disagree please let me know your thoughts", "label": 1}
{"text": "Bears are bad news when it comes to parasites. I eat plenty of wild game but recommend anyone who’s asks to pass on it. Bear can be safe like anything else with proper cooking, but the bar is much higher than most other meat. You absolutely don’t want to undercook it.", "label": 1}
{"text": "Vast majority of trichanosis comes from bear meat, yes", "label": 1}
{"text": "love me some corn", "label": 1}
{"text": "Disgusting germans", "label": 1}
{"text": "![gif](giphy|l0M4wzPekehrBSvXB2|downsized)", "label": 1}
{"text": "Not saying I agree or disagree with you but it’s probably because your source is a “trust me bro, this guy I know told me so.” Not an actual case or study.", "label": 1}
{"text": "vegetables look frozen or canned.  chicken plain and unseasoned.  rice looks like sloppy gruel.", "label": 1}
{"text": "Look I'm a chef and there's a lot of negative shit to say here, but honestly? Way to go, you're being healthy and you *made* something! Good work OP.\n\nI eon't care if you do pre-made veggies, I don't care if the rice is a little soupy, but please, for the love of god, season that bird next time!", "label": 1}
{"text": "Tbh 😩", "label": 1}
{"text": "very realistic", "label": 1}
{"text": "looks AI generated. also i’m not sure about this combination", "label": 1}
{"text": "Looks tastyyy", "label": 1}
{"text": "perfection 👌", "label": 1}
{"text": "No it isn't lol, look how irregular the green onions are, so many different shapes and sizes when it should be more uniform", "label": 1}
{"text": "is this AI?", "label": 1}
{"text": "Considering the only thing resembling fried chicken in the picture appears to be made out of bread, that's entirely possible.", "label": 1}
{"text": "Try reading the sidebar/rules, dude.", "label": 1}
{"text": "With all that typing you could’ve explain, do you feel accomplished?", "label": 1}
{"text": "I don’t want to read the “rules” of a food reddit, do you realize how fucking boring you sound when that’s your go to?", "label": 1}
{"text": "You replied twice to me, yet still couldn't be bothered to check the rules. Do you?  \nThats how Reddit works, smart guy. Each sub has their own set of rules. Don't want to read or follow them, don't post, you'll just have it removed or get banned.   \nGo back to tiktok and save the rest of us your whining bullshit.", "label": 1}
{"text": "Wah wah cry baby typed out a paragraph because I said they’re boring", "label": 1}
{"text": "hahah. Right. Big insult you got there, buddy. I'm trembling. \nYou been here all of 6 days. Like I said, go back to tiktok, I'm sure you'll be happier there. Reddit obviously isn't for you.", "label": 1}
{"text": "“Reddit isn’t for you” do you watch when your partner and their lover do it? Or do you need express rules when doing that too", "label": 1}
{"text": "It's a chicken schnitzel.", "label": 1}
{"text": "I'm looking at this picture at full res on a large monitor, that texture ain't quite right even for tenderized chicken.", "label": 1}
{"text": "Ai good looking good tho", "label": 1}
{"text": "It looks like pork.  The shape doesn't even make sense for chicken.", "label": 1}
{"text": "Nope but instant Soba noodles and a homemade chicken schnitzel as someone pointed out", "label": 1}
{"text": "Baştan", "label": 1}
{"text": "Hmm don’t know how to. Here is a video of the [chocolate eating game show](https://ios.imgur.com/?link=https://imgur.com&isi=639881495&ibi=imgurmobile&cid=3105317008106385722&_icp=1)", "label": 1}
{"text": "Well explained 👍", "label": 1}
{"text": "It's the caramelized honey and soy sauce. That's why it looks black. Also \"blackend\" salmon is a pretty common dish. Source: 10 years as maitre d'hotel in Michelin starred restaurants.\n\nAnd you shouldn't talk about food, because the salmon might look burned, but you look like an ignorant idiot.", "label": 1}
{"text": "Looks nice!", "label": 1}
{"text": "The forbidden double dog", "label": 1}
{"text": "I think it's great for an appetizer", "label": 1}
{"text": "I could never tolerate broccoli, I find it very unpleasant", "label": 1}
{"text": "Man, this looks so good.", "label": 1}
{"text": "I'm hungry.", "label": 1}
{"text": "you're gonna lose.", "label": 1}
{"text": "how you cook it.", "label": 1}
{"text": "“embarrassed.”", "label": 1}
{"text": "Wow looks like delicious waffles", "label": 1}
{"text": "Good combination darling", "label": 1}
{"text": "Yum i want one", "label": 1}
{"text": "Yeah, people did mustard. But TikTok did a mustard craze (like Watertok) where they were dipping veggies and anything they could think of into mustard as an alternative to unhealthier dip. Everything.", "label": 1}
{"text": "Your dog is waiting give him some", "label": 1}
{"text": "Wow", "label": 1}
{"text": "Very Creative", "label": 1}
{"text": "Looks tasty", "label": 1}
{"text": "cutie pancakes", "label": 1}
{"text": "Well yes. That's what I said...", "label": 1}
{"text": "Really? How do you explain toasted salt then?", "label": 1}
{"text": "Anyway to make it less salty? Need to watch my sodium intake", "label": 1}
{"text": "Nice steak", "label": 1}
{"text": "XAq", "label": 1}
{"text": "I‘m Spanish, I can confirm it is not very authentic. Or not a paella at all.", "label": 1}
{"text": "What’s exactly inside?", "label": 1}
{"text": "That’s… not paella", "label": 1}
{"text": "I don’t think I need a diet right now; it’s like this food is seducing me to eat everything!", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "bake some more!it looks great ❤", "label": 1}
{"text": "this is perfect!", "label": 1}
{"text": "Yummy breakfast i need to prepare my future man such😍😍.", "label": 1}
{"text": "Looks good right?", "label": 1}
{"text": "Can I have some bite OP", "label": 1}
{"text": "Wow, Thank you OP for sharing! Maybe next time I'll try it and I post it here too", "label": 1}
{"text": "Im imagining it", "label": 1}
{"text": "This looks cool but honestly rice crispy treats and sour candy together sounds kind of gross.", "label": 1}
{"text": "I thought the one on the bowl is Salted Egg with onion", "label": 1}
{"text": "Hahahaha I just notice it , Why they are asking tho its on the title", "label": 1}
{"text": "    The blogger is really ingenious. This not only looks good, it must also be delicious. I really love it!😍Give me a taste🤤", "label": 1}
{"text": "Wow. Can you share the recipe? i want to try it", "label": 1}
{"text": "This tells us everything we need to know about you and your post.", "label": 1}
{"text": "This cake looks stunning! You’ve done an incredible job with the design and I bet it tastes as good as it looks", "label": 1}
{"text": "she's too beautiful to eat!", "label": 1}
{"text": "Looks chocolatey and amazing!!!", "label": 1}
{"text": "Ok, this looks great... but I have such an aversion to roaches I could not get near it because it looks so damn real. \n\nBut seriously, this is a great job. Gross but I think that is the vibe you are going for.", "label": 1}
{"text": "Thank you!!! for sharing", "label": 1}
{"text": "Thank you!!! for sharing", "label": 1}
{"text": "Thank you!!! for sharing", "label": 1}
{"text": "Thank you!!! for sharing", "label": 1}
{"text": "Yummy", "label": 1}
{"text": "It looks like real", "label": 1}
{"text": "I forgot to make it....", "label": 1}
{"text": "Nicely done.. so perfect for Halloween.. looks like the images from the Russian Sleep Experiment.", "label": 1}
{"text": "Yum", "label": 1}
{"text": "Looks Delicious", "label": 1}
{"text": "Yummy", "label": 1}
{"text": "Russian salad is the best! I love the mix of veggies and creamy dressing. Perfect side dish!", "label": 1}
{"text": "Thank you!! 😊", "label": 1}
{"text": "all of them looks delicious! is it like one of those trending dubai chocolate bars?", "label": 1}
{"text": "Hey there. Yes but these are filled with other desserts inside of the bars!🥰", "label": 1}
{"text": "😅 I need to see these metals. They might make me hungry 😂", "label": 1}
{"text": "It looks so gross", "label": 1}
{"text": "Good chicken rolls", "label": 1}
{"text": "🤗🤗", "label": 1}
{"text": "They youuuu!! They are!!", "label": 1}
{"text": "We currently do not have a gluten free or keto option but as soon as we do you’ll be the first to know!!", "label": 1}
{"text": "Thank you 🤗🤗", "label": 1}
{"text": "First time posting. I had no clue what I was doing lol", "label": 1}
{"text": "Oreo, s’mores, Biscoff Cookie butter and pistachios.", "label": 1}
{"text": "For sure", "label": 1}
{"text": "Very yummy did you finish it all", "label": 1}
{"text": "ohh my that looks so tasty, the cheese and the mayo 😍", "label": 1}
{"text": "woww!", "label": 1}
{"text": "Bigger goes viral faster 😉😉 we have smaller ones too!!", "label": 1}
{"text": "[puke emoji]\nsorry", "label": 1}
{"text": "How fancy…such a humane thing to do just to eat the liver of a bird.\n\nFoie gras (French for ‘fat liver’); French: [fwa ɡʁɑ] ⓘ, English: /ˌfwɑːˈɡrɑː/ ⓘ) is a specialty food product made of the liver of a duck or goose. According to French law,[1] foie gras is defined as the liver of a duck or goose fattened by gavage (force feeding).\n\nForce-feeding is the practice of feeding a human or animal against their will. The term gavage (UK: /ˈɡævɑːʒ, ɡæˈvɑːʒ/,[2][3] US: /ɡəˈvɑːʒ/,[3][4] French: [ɡavaʒ] ⓘ) refers to supplying a substance by means of a small plastic feeding tube passed through the nose (nasogastric) or mouth (orogastric) into the stomach.", "label": 1}
{"text": "It looks delish", "label": 1}
{"text": "It looks delish", "label": 1}
{"text": "yess, one of my favorites!!", "label": 1}
{"text": "yess, one of my favorites!!", "label": 1}
{"text": "😅😅😅", "label": 1}
{"text": "Gotcha. It’s on our instagram \nA shot of flava", "label": 1}
{"text": "I am ready to devour this.", "label": 1}
{"text": "What joke. You eat meat… you think that all animals are raised humanely?  lol not even possible to feed the populations in most countries. You’re a hypocrite. Go away.", "label": 1}
{"text": "Go munch on grass. All animals in the food industry suffer", "label": 1}
{"text": "Looks good but the ethical issue surrounding FG are just too significant for me to ignore any more, even though it was regularly eaten on special occasions by my (French) family. No wonder its production is banned in so many places. One would like to think that a total prohibition on production, importation and sale will happen at some stage. \n\nIt tastes delicious but it’s an abhorrent foot ethically.", "label": 1}
{"text": " I suspect you have never slaughtered and butchered your own meat too. I don’t care what you view as ethical or not. That is your opinion that is better left to yourself", "label": 1}
{"text": "Keep lying to yourself… industrial farms are not ethical but hey if you don’t see it it must not be real. Slaughter your own meat then tell me about ethics. Till then you’re just another idiot with your eyes closed.", "label": 1}
{"text": "I'm gonna love this.", "label": 1}
{"text": "wow looks good", "label": 1}
{"text": "I love those chicken tenders. Give me some.", "label": 1}
{"text": "yummy!!!", "label": 1}
{"text": "Just looking at these cookies is making my sweet tooth go absolutely crazy", "label": 1}
{"text": "It was yummy 😋 am the one who ate lol not you darling 💋", "label": 1}
{"text": "This is one of the perfect ones to partner with Beer, simple easy to pair with.", "label": 1}
{"text": "Let's say I was the color of the chocolate chips, maybe even a little darker. How would I cope with going to poo when my poo is the same color as my skin tone?", "label": 1}
{"text": "Mmm, the crispy skin is everything. Definitely trying this recipe soon!", "label": 1}
{"text": "Yummy I thought 💭 about the white 😭💋", "label": 1}
{"text": "Wow, you really went all out! Love the idea of coconut-crusted chicken, bet it adds amazing flavor.", "label": 1}
{"text": "That's uhhhh really gross, challenge the cook to eat a piece of that first.", "label": 1}
{"text": "IMO it is an underrated German dish. This is how it looks in preparation phase. Onions and black pudding from a butcher.\n\nimg", "label": 1}
{"text": "My taste buds are dancing, yummmy", "label": 1}
{"text": "Please ! Provide it", "label": 1}
{"text": "Thank you for sharing OP", "label": 1}
{"text": "So tasty look", "label": 1}
{"text": "A week on this sub without someone making food with cum glaze on it and posting a picture of is not possible3🤣", "label": 1}
{"text": "\nOur AMA with Makinze Gore, longtime Delish editor and baking columnist, is now over. You can view their responses in the below post.\n\nAMA here: https://www.reddit.com/r/food/comments/1ge7his/ama_im_a_senior_food_stylist_specializing_in/\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 1}
{"text": "Buy bulk meat at Costco", "label": 1}
{"text": "A good rule to live by is to not listen to or do anything that Jordan Peterson says.", "label": 1}
{"text": "Don’t take advice about anything from Jordan Peterson.", "label": 1}
{"text": "Eh when I went carmivore-esque it was mostly ground beef. Steaks 24/7 is too expensive for the average joe.", "label": 1}
{"text": "Giving up fiber, vitamin D, and vitamin C in favor of an extremely fat-rich, cholesterol-rich diet is probably the dumbest thing to ever come out of Jordan Peterson’s mouth, and that’s a pretty high bar.", "label": 1}
{"text": "lol this is sad. I ask about a diet and people go “don’t trust anything that man says” like alright wasn’t asking your opinion on the individual (he’s a personal mentor of mine) I’m asking about affording steaks when you’re not so well off. God bless", "label": 1}
{"text": "Buy a whole or half cow, and butcher it yourself. If you think increasing the amount of red meat in your diet will somehow make any change in your life, maybe if you were a vegetarian or vegan with anemia. Red meat every couple days will do you good though.", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "\"He's a personal mentor of mine\" lol you're just asking to be bullied mate", "label": 1}
{"text": "It would be hard to afford new york strip steaks every single night but if you wanted to eat more beef, you can much more cheaply get something like a bottom round roast or a london broil cut to feed your family for like a week. If you want to be more efficient with meat eating, getting a large cut and butchering/preparing it yourself is significantly more cost effective. You'd be amazed at how much you can save by just making a few cuts yourself.\n\nAs you can probably guess, this applies to all meat, not just beef. Bone-in, skin-on chicken thighs are like $2/lb whereas boneless/skinless are $8 or more per pound. People's laziness or ignorance about how to remove bones blows my mind, 4x the cost for like 3 minutes of convenience. And you don't get the skins and bones for \"free\" chicken broth either!\n\nTL:DR is buy a large chunk of beef and cut off the steaks yourself to save a ton of money", "label": 1}
{"text": "Looks good", "label": 1}
{"text": "Wow looks yummy!", "label": 1}
{"text": "Scratch the corn beef hash and replace it with Goetta, and swap the poached egg with a fried over easy egg.", "label": 1}
{"text": "“If my grandmother had wheels, she would’ve been a bike.”", "label": 1}
{"text": "Homemade Ragù. You're living the dream right there", "label": 1}
{"text": "This is some serious comfort food.", "label": 1}
{"text": "It is a little diffferent from the authentic recipe, we adjusted it to our taste so no offense to all the lovely Italians here, we appreciate your authentic recipe and also cook it sometimes that way :D\n\nDice 2 Celery sticks, 1 Large carrot, 1 Medium diced onion: Fry them until sweaty and golden in olive oil, set aside in a bowl. In the same pot melt some Guanciale and set aside on top of the fried vegetables. In the same pot again, fry the ground beef (400g-500g). I liike to fry it until its sort of fried and crispy. Add the fried vegetables and guanciale to the beef and give everything a good stir.  Now add a cup of Red wine (I use Merlot). I like to add a laurel leaf and some thyme. Further, add 4-5 medium sized tomatoes diced and optional: a little squeeze of tomatoe paste for the richness. I also add a small piece of dark chocolate. Then I add 2 cups of homemade beef broth for the first simmer round and water occassionally for the next 4-5 hours.  I also find that adding water in small amounts more frequently cooks the meat better rather than pouring large amounts of water all at once. I personally love a good amount of basil in this sauce with 1 small clover. For the seasonings: I season it with salt and pepper and a tiny pinch of nutmeg. I serve it with some good spaghetti/ spaghettoni and lotsssss of Parmigiano Reggiano!", "label": 1}
{"text": "This is making my mouth water. Can’t wait to try it", "label": 1}
{"text": "Your cooking game is strong. This looks pro chef level", "label": 1}
{"text": "I need to recreate this masterpiece", "label": 1}
{"text": "That yolk is perfection. I could dive right in", "label": 1}
{"text": "I’m a sucker for a good hash. This one looks amazing", "label": 1}
{"text": "Perfect!", "label": 1}
{"text": "This dish is giving me major brunch vibes", "label": 1}
{"text": "This is exactly how I like my breakfast. So satisfying", "label": 1}
{"text": "I can practically taste it through the screen. Well done", "label": 1}
{"text": "Oh man, it’s the tits, best cookies I’ve ever had in my life.", "label": 1}
{"text": "cravings ![gif](emote|free_emotes_pack|sob)", "label": 1}
{"text": "Looks mouthwatering! A delicious combo, perfect for taco night!", "label": 1}
{"text": "Nice presentation!! looks good!", "label": 1}
{"text": "Looks so delicious, it might just convince me to pop the question!", "label": 1}
{"text": "thiis is a delighttt", "label": 1}
{"text": "Wow, that looks so yummy", "label": 1}
{"text": "This is food art", "label": 1}
{"text": "I love this, i literally made this every week before i workout.", "label": 1}
{"text": "Looks delicious! Avocado and eggs are the ultimate power couple.", "label": 1}
{"text": "Pasta is life", "label": 1}
{"text": "I havent tried this one, can you drop your recipe? 😍", "label": 1}
{"text": "looks tasty and delicious", "label": 1}
{"text": "Flavors visually appealing!", "label": 1}
{"text": "Gotta say that looks pretty yummy😍", "label": 1}
{"text": "It looks so good! It takes a breakthrough to try to do something new, and you're so good at it!", "label": 1}
{"text": "Lol Rocomamas. There food has gone down the drain the past 3 years...", "label": 1}
{"text": "that is not a burger, that is a sandwich.", "label": 1}
{"text": "Indeed.", "label": 1}
{"text": "This looks like a good western-fusion Cantonese Roast Duck. I'd eat the heck out of that with a pile of white rice.\n\nPeking duck has a very specific preparation process. This will render the fat out and leave a skin behind that's like... potato chip crisp. \n\nBon Appetit's youtube channel has a video called \"Making 40 Hour Peking Duck with a master carver\". You'll be able to see and hear the difference between actual peking duck and your peking duck. Reading your steps, it sounds like you did your research - you just need to refine your technique a bit. You may not have a medium rare duck, but there's a lot of visible fat that actual peking duck won't have. \n\nEven though I live not far from a Chinatown, getting actual peking duck is tough. A lot of places sell a Cantonese/HK BBQ roast duck adjacent duck as peking duck and you see a lot of Cantonese roast duck pics posted here as \"I ate peking duck\". And your's looks like the later. \n\nOut of the dozens of restaurants in Chinatown that have peking duck on their menus, there are two places in my city that actually have peking duck, and none of them are in Chinatown. As an Asian-American, I have my theories on this, lol.\n\nActual peking duck, I'd pay $100+ per person with one duck per 2-3 people. This is a three course meal where the skin presentation is the main and the rest of the duck (stuff like the legs) is turned into additional dishes. About a half duck per person.\n\nIf I go to an auntie at the HK BBQ place - I order a pound of char siu (half fat, half lean) and a pound of duck and it costs in the neighborhood of $30.", "label": 1}
{"text": "Uh oh, not this debate!", "label": 1}
{"text": "Its not a debate. Anything tha doesnt have beef patty is considered sandwich accordance with american law.", "label": 1}
{"text": "It's a ground patty. The grind is the important part. It can be beef or bison or elk or turkey or whatever else, it just needs to be a ground and shaped patty to be a burger in the US.", "label": 1}
{"text": "Came here to check if anyone said this.", "label": 1}
{"text": "Sadly it is a debate. Although I agree with you. This thing is no burger.", "label": 1}
{"text": "you realize that you just made my case.", "label": 1}
{"text": "Umm actually that’s a sandwich ☝️🤓", "label": 1}
{"text": "If it's Nashville food, which is in the US, you might think they'd still say \"Nashville hot chicken sandwich\".\n\n\nWe do this sometimes in the US too, like *panini*.", "label": 1}
{"text": "Gonna get a bowl of ramen and call it \"Tokyo spaghetti\"", "label": 1}
{"text": "I love this dish!", "label": 1}
{"text": "This post has been removed.\n\nThe majority of your title (over 50%) must specifically describe the food.\n\nAvoid vague descriptions, excessive use of emojis, and include one [square-bracketed] tag. Do not use personal appeals or emotionally compelling details, like hardships, to influence votes. Posts are removed at moderators' discretion.\n\nExample:\n\n\"[Homemade] Chicken & rice for dinner\"✔️\n\n\"[I Ate] Tonight's dinner\"❌\n\nSome examples of good titles can be found in the [wiki](https://www.reddit.com/r/food/wiki/index#wiki_titles_may_only_contain_the_food.27s_name). Feel free to re-title and re-upload your post.", "label": 1}
{"text": "*sandwich", "label": 1}
{"text": "Came to see how many \"burger\" comments there were. Did not disappoint.", "label": 1}
{"text": "I've never understood why such sandwiches get called burgers. \n\nI slot these into the same boat as boneless wings - like burger meat is ground meat, and a wing is a part of a bird. How did we decide that a burger is now just any round sandwich and a wing is just any small oblong shaped meat chunk? Are we going to start selling steak wings and sashimi wings next? I mean, we might have to start calling circular quesadillas \"cheeseburgers\" soon by this logic. It's just chaos!", "label": 1}
{"text": "A burger has beef patty.  This is a chicken sandwich.", "label": 1}
{"text": "The US is the only country in the world that's not allowed to be pedantic about the names of its own foods for some reason.", "label": 1}
{"text": "My taste buds are jealous right now", "label": 1}
{"text": "I need this in my life ASAP!", "label": 1}
{"text": "I didn’t say that. I said they should get over it.", "label": 1}
{"text": "This looks delish!  best paired with a crisp green salad and some garlic bread. What a perfect meal", "label": 1}
{"text": "And I'm disagreeing with you.", "label": 1}
{"text": "Provide some examples", "label": 1}
{"text": "Non-North American former English colonies like to call chicken sandwiches “burgers”.", "label": 1}
{"text": "Great, now I crave pasta!", "label": 1}
{"text": "Pizza looks appetizing", "label": 1}
{"text": "Beautiful steak", "label": 1}
{"text": "Appetizing", "label": 1}
{"text": "That looks deliciousss <3", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "Where's the joke Karen? Nobody can see it seems", "label": 1}
{"text": "Apart I'm the toxic and you are the one insulting... Impossible to be more Karen than that", "label": 1}
{"text": "Y'all are disgusting, give me your entire stock! \n\nI love these in the winter.", "label": 1}
{"text": "Looks yummmy!", "label": 1}
{"text": "Pic 2, dick pic, classic food porn. 👏", "label": 1}
{"text": "would be good to dip a biscuit in", "label": 1}
{"text": "I haven't had an Italian beef sandwich in forever. Now I want one!", "label": 1}
{"text": "Craving for this right now..", "label": 1}
{"text": "Looks delicous! Hope it was as good as it looks!", "label": 1}
{"text": "Bacon and egg with bagel cream cheese hits the palate positively.", "label": 1}
{"text": "wow looks good!!", "label": 1}
{"text": "So I realized from other countries anything with meat between BREAD is a burger but in America and especially Nashville that's not a burger IT is a sandwich.", "label": 1}
{"text": "Looks delicious~", "label": 1}
{"text": "done an amazing job can smell it from here", "label": 1}
{"text": "Ohhhh, it looks like it’s ready to transport me straight to Penang!  🍤🔥 Those juicy shrimp, the perfectly charred noodles, and just enough spice to wake up your taste buds—absolute perfection on a plate!  If only my screen was scratch-and-sniff, I’d be set.", "label": 1}
{"text": "Looks so good, I gotta stop buying from IKEA and start learning how to cook that..", "label": 1}
{"text": "Crispy edges on pizza are the best! 🍕✨", "label": 1}
{"text": "Idk why they downvoted you for that but thanks! \nMy watery attempts were through a sieve as well but maybe I added too much.", "label": 1}
{"text": "Ew", "label": 1}
{"text": "Focaccia stuffed with ham and pesto Yes, please", "label": 1}
{"text": "Dude, this is next-level deliciousness You’ve got good taste", "label": 1}
{"text": "Perfect fuel for a long day at work! What a feast", "label": 1}
{"text": "Looks so fresh and yummy", "label": 1}
{"text": "What a way to unwind after work! Great choice", "label": 1}
{"text": "I love how colorful that sandwich is seems super fresh", "label": 1}
{"text": "This is making my stomach rumble Save me some", "label": 1}
{"text": "Wontons with chili oil That's a match made in heaven", "label": 1}
{"text": "You’re gonna have to share the recipe for these gems", "label": 1}
{"text": "[that’s what i call it too](https://www.reddit.com/r/hotdogs/s/XCWvN0z1Kr) but sometimes this board takes itself too seriously and they just assume i’m trying to cause drama.", "label": 1}
{"text": "Your dog’s dick doesn’t have a fingernail? Weird", "label": 1}
{"text": "[close](https://www.reddit.com/r/stonerfood/s/ZzjiXBPU1E)", "label": 1}
{"text": "I need this in my life! Did you pair it with anything special, or is it the star of the show all on its own?", "label": 1}
{"text": "My facorite also! Can't wait to make one again!", "label": 1}
{"text": "that mac and cheese makes me sad", "label": 1}
{"text": "If Reddit is becoming an AI platform you can suck my dick", "label": 1}
{"text": "What, you don't bite into raw bundles of rosemary?", "label": 1}
{"text": "I've seen worse food but why you gotta eat from this abomination", "label": 1}
{"text": "Wowwwww looks so good!", "label": 1}
{"text": "I guess not. And apparently it's a downvoteable offense not to. ", "label": 1}
{"text": "Wow that\\`s delicious", "label": 1}
{"text": "Looks good yum!", "label": 1}
{"text": "Nice", "label": 1}
{"text": "They’re for smoking. Duh. Where is the bong though?", "label": 1}
{"text": "No idea why you’re getting downvoted‽ Frikkin insane. And inedible shit on the plate must have a VERY good reason to be there. Like the bone for the marrow. That’s fine. Raw herbs is flippin delusional.", "label": 1}
{"text": "Like parsley or cilantro are fine, but this is too far imo. ", "label": 1}
{"text": "Why is there a random bundle of rosemary on the steak?", "label": 1}
{"text": "I'm gonna dine-in for this, awesome presentation 1000%.", "label": 1}
{"text": "hotDOG!!", "label": 1}
{"text": "Yeah sorry. I meant herbs like twigs of herbs that should be used in the cooking process. Parsley and cilantro on steak (with chili and lemon and olive oil) is the shit!", "label": 1}
{"text": "Yeah we agree. Just thinking of the exceptions. ", "label": 1}
{"text": "Being honest here, it doesn't look very good. It may have tasted delicious, but the lack of sear on the steak, and the two sides in the right of the photo looks gross.", "label": 1}
{"text": "Thank the gods. Although it seems overkill. How was it? And how expensive was it?", "label": 1}
{"text": "In Sweden it would probably be around there as well. But it wouldn’t be considered “affordable” by almost all people.", "label": 1}
{"text": "Glad someone said it", "label": 1}
{"text": "These sausage rolls look dangerously good—I can practically smell them through the screen!", "label": 1}
{"text": "And to be fair if you really like either (parsley and cilantro) you can eat those for a palate cleanse.  That's what a spring of sticks (I see it's rosemary, but c'mon) tied in string?\n\nNever put anything on the plate you can't eat.", "label": 1}
{"text": "Amazing artwork", "label": 1}
{"text": "Poor thing doesn't know that, she's probably more familiar with tacos & enchiladas ingredients.", "label": 1}
{"text": "I will never understand this stuff, made me gag.", "label": 1}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 1}
{"text": "Very gross (but good job)", "label": 1}
{"text": "eat that", "label": 1}
{"text": "Me too! It looks so realistic!", "label": 1}
{"text": "Wow, this is made from mushrooms! What kind of mushrooms are they?", "label": 1}
{"text": "Grabbing a piece and pair it with my sweet bitter coffee.", "label": 1}
{"text": "Wow, looks so delicious! Such a creative twist on a classic dish!", "label": 1}
{"text": "Ain’t you a stupid and rude little shit.", "label": 1}
{"text": "Ew ew eeeee wwwwwwwww🤢", "label": 1}
{"text": "The finished steak looks great! Thank youbfor your great cooking tips.", "label": 1}
{"text": "i wont dare eat, i would be sad deforming it 😅", "label": 1}
{"text": "hmmm looks so yum", "label": 1}
{"text": "All that yummy mercury!", "label": 1}
{"text": "Wow,I wish I could bake like that too. Where did you study that?", "label": 1}
{"text": "Got a link for that?  All I can find is the cold pan method, which it doesn't seem like you're talking about.  For me warming up the steak seems to make a big difference in the texture of the meat going into the pan/grill, which changes how it cooks, but I've never done science about it.", "label": 1}
{"text": "look cool and gross very attractive haha the worms are very realistic..super duper nice!", "label": 1}
{"text": "looks so yummy like i can eat all those all through ou the day. 😁", "label": 1}
{"text": "It's not desserts, it's art", "label": 1}
{"text": "A homemade butter chicken sandwich on garlic brioche is very delicious! The rich, creamy butter chicken pairs perfectly with the savory garlic brioche, creating a flavorful and satisfying meal. Toast the brioche for a bit of crunch, and don’t forget to add some fresh cilantro or cucumber slices for an extra burst of freshness! 🥪✨", "label": 1}
{"text": "fat fuck", "label": 1}
{"text": "Those fries look amazing", "label": 1}
{"text": "thanks! yes i would be more condifent wearing heavy duty gloves. some sort of protection.\n\ni also like your low sodium soy sauce and wasabi flavouring. that actually seems pretty REFINED. im asian, and i don't even do that! like i think i know what you are saying. its a SIDE dipping dish of light soya sauce, and wasabi you can at moments mix in. where i was talking about sprinking the whole platter with lemon juice, herbs, and sea salt. two different approaches. i like them both!\n\nblue moon and stella to wash it down. seafood and beer is always a good combination. and you are not full-full, since seafood is light. beer is heavy. i never have beer with pasta. thats too much! wine plz.\n\ni do get your point about driving, but i was more how to make this dish at home. i would be really interested in inviting two friends over. have a metal tray out filled with ice cubes ... and practicing shucking.and playing our displays onto the ice. i would provide the protective gloves.\n\ncook up some rose pasta for the clams.\n\nand just eat the oysters like that while socializing. i could prepare some melba toast with some cream cheese sour cream chive spread on top. and top with raw oysters. and drink probably white wine.", "label": 1}
{"text": "this is spooky cute", "label": 1}
{"text": "uggggh a taste of heaven", "label": 1}
{"text": "That cheeseburger looks like it could solve all my problems <3", "label": 1}
{"text": "That's my favorite!", "label": 1}
{"text": "Do you not understand what \"grim\" means?", "label": 1}
{"text": "Sorry if English isn't your first language.\n\n\nThis does not look good. But I hope you enjoyed it.", "label": 1}
{"text": "That's three dinners on one plate", "label": 1}
{"text": "Poor animal 😢", "label": 1}
{"text": "I've made similar pies before. For the top, try baking it separately and freezing it slightly before adding to the pie. It helps with detailing and keeps its shape. As for worms, gummy ones work great or make your own from fondant or marzipan!", "label": 1}
{"text": "Needs nsfw fuxake.", "label": 1}
{"text": "HA! We did not! Parm was from the grocery store :)", "label": 1}
{"text": "Hey man. Ive eaten some wild shit. I grew up on an island where we scrape opihi off rocks and eat them while alive still. \n\nBut the whole head and the face of pure holy fuck I’m being fried to death is a little bit of a turn off for me.", "label": 1}
{"text": "That may be true, but it still looks unappetizing", "label": 1}
{"text": "Fuking gross. These are pets in America, not for eating.", "label": 1}
{"text": "What’s that lol", "label": 1}
{"text": "Tasty?", "label": 1}
{"text": "George W Bush and Dick Cheney went to a nice cafe to have lunch.   \n\nAs they're contemplating the menu, the waitress comes up to them to take their order.  \n\nCheney says \"I'll have the beef wellington\".   \n\nBush squints at the menu, looks up, and says \"How about a quickie?\"   \n\nIndignant, the waitress throws his glass of water at him and storms off.  \n\nAfter a moment, Cheney gives Bush a pitying look and says \"It's pronounced quiche\".", "label": 1}
{"text": "Ahhh ok nice", "label": 1}
{"text": "I’ll take one too please", "label": 1}
{"text": "looks like meat", "label": 1}
{"text": "Yum", "label": 1}
{"text": "wowwwwwwww", "label": 1}
{"text": "And you somehow decided to photograph it and post it.  Hope you enjoyed it.  I find a lot of food tastes great, but we don’t need to photograph it.", "label": 1}
{"text": "Can I have some ?", "label": 1}
{"text": "Invite me over next time! 😂", "label": 1}
{"text": "Yummy! Invite me over next time!", "label": 1}
{"text": "Yummy! Invite me over next time!", "label": 1}
{"text": "perfect!!", "label": 1}
{"text": "You say this and you'll probably lose your shit when you see someone eating a dog lol", "label": 1}
{"text": "Why even bother being on this sub reddit? Yikes", "label": 1}
{"text": "What upset you about what I said?", "label": 1}
{"text": "How did it taste?", "label": 1}
{"text": "Let me know how it tastes", "label": 1}
{"text": "My cup of tea :)", "label": 1}
{"text": "How did it taste? 👅", "label": 1}
{"text": "Maybe it was that being a dick for no real reason part?", "label": 1}
{"text": "Perfect Artwork! Happy Halloween!", "label": 1}
{"text": "This is literally a sub for pictures of food?", "label": 1}
{"text": "The Black King, I like the consistency of the broth.", "label": 1}
{"text": "Looks good", "label": 1}
{"text": "looks scary", "label": 1}
{"text": "Sooo delicious!", "label": 1}
{"text": "i love tacos!", "label": 1}
{"text": "that sauces to die for!", "label": 1}
{"text": "No surprise, sounds like you don't give a lot of thought to other creatures.", "label": 1}
{"text": "The absolute fuck are you talking about? Some cultures eat dogs, some eat cats, some eat cows, some eat bugs. If you take issue with people eating dogs but not with eating cows, you're an enormous hypocrite blinded by bias.", "label": 1}
{"text": "I personally cannot finish this much rice", "label": 1}
{"text": "I thought we were having discourse\nAka lol Reddit.\nBeing downvoted for my honest opinion about having a head on my plate is funny to me when we were just talking about food \nLMAO", "label": 1}
{"text": "I actually opened a small shop, selling to friend amd collegues. \n[instagram page](https://www.instagram.com/pastafaced/profilecard/?igsh=MTQxM2x1NXZrdHBhaA==)", "label": 1}
{"text": "oh my goodness so clever", "label": 1}
{"text": "What?!?!", "label": 1}
{"text": "That’s not a carbonara, it’s called bismark", "label": 1}
{"text": "That looks so good", "label": 1}
{"text": "Lol where was this \"photo\" taken?", "label": 1}
{"text": "Those fries look amazing", "label": 1}
{"text": "Yum. For some reason this kind of looks like cake that's supposed to look like other food.", "label": 1}
{"text": "Wtf? This looks like a promotional shot from something from the 90s, lmao", "label": 1}
{"text": "No you didn’t bot", "label": 1}
{"text": "Exactly my thought!", "label": 1}
{"text": "AI much?", "label": 1}
{"text": "Yes I did. Don’t be jelly", "label": 1}
{"text": "Rightttt?!!!  Like have you ever seen actual AI food? How much of an idiot can someone be if they can’t tell a difference between fake and real food.", "label": 1}
{"text": "Yes I'm the weird one not the guy who thinks it's normal to eat pets like dogs and cats. Lack of awareness is crazy lol", "label": 1}
{"text": "Wow, that looks delicious! Love how you threw that together, such a colorful plate!....", "label": 1}
{"text": "Was it tasty?😋", "label": 1}
{"text": "Come out good?", "label": 1}
{"text": "Jealous", "label": 1}
{"text": "strikingly hot pizza.", "label": 1}
{"text": "How was it?", "label": 1}
{"text": "Tasty?😋", "label": 1}
{"text": "Looks yum!", "label": 1}
{"text": "Yum 😋", "label": 1}
{"text": "its ai though", "label": 1}
{"text": "I can't explain it, it looks like a picture in Costco food court that's been badly photoshopped.", "label": 1}
{"text": "Looks great", "label": 1}
{"text": "How was it ?!", "label": 1}
{"text": "too much calories on one sitting, would puke :-D", "label": 1}
{"text": "Poor fella", "label": 1}
{"text": "sd", "label": 1}
{"text": "rt", "label": 1}
{"text": "You're a horrible person for doing that. Do you not know how intelligent they are....", "label": 1}
{"text": "Uh oh, look out we have a my octopus teacher expert over here", "label": 1}
{"text": "Wow", "label": 1}
{"text": "Not this one, he blew all his money on instant lottery tickets\n\nhttps://preview.redd.it/oycgtxhfuiyd1.jpeg?width=640&format=pjpg&auto=webp&s=6f7d43e7154a82adf58e0fb6abdd0fc3afb641e3", "label": 1}
{"text": "Damn it. You got me there.", "label": 1}
{"text": "The hell is happening in this comment section lmao, first time seeing a post where every comment is downvoted", "label": 1}
{"text": "Amazing looking. Great work. Since you clearly care about presentation, I would test a couple of variations of sauce placement to see if something works better. The simplicity works, but it's slightly boring to my eye. Run a spoon through it to give it a bit of natural curvy something or other to contrast the hard edges of your tater log. Maybe pull a line across the plate and under the log at an angle? I don't know, it's great looking now, I would tinker a bit more to see if something elevates it even further.", "label": 1}
{"text": "Looks absolutely amazing, but I think octopus is something I don't think I'll ever be able to eat, simply because of how amazing they are", "label": 1}
{"text": "This is damn impressive looking but man, I sure wish octopi had the same \"cute\" factor to make people care about not catching/eating them like the save the dolphins movement in the 90s.", "label": 1}
{"text": "Wow looks amazing!", "label": 1}
{"text": "I can't really countenance eating octopus anymore. It's almost like eating chimp.", "label": 1}
{"text": "Shame. There are plenty of non-sentient creatures you could eat instead.", "label": 1}
{"text": "Looks amazing 😍", "label": 1}
{"text": "yum!!", "label": 1}
{"text": "These look amazing! Yummy.", "label": 1}
{"text": "Holy, that looks crazy delicious, good job on that 🤙", "label": 1}
{"text": "I thought it's melted cheese haha", "label": 1}
{"text": "I can’t eat them anymore after watching “my octopus teacher”.", "label": 1}
{"text": "Here ya go! The recipe says it makes 3 but I did 2 in larger pans and upped the baking time by 5 minutes.\n\n[Cinnamon Babka](https://family-friends-food.com/cinnamon-babka-modern-jewish-baker-review/)", "label": 1}
{"text": "DELICIOUS HARMBURGERS!", "label": 1}
{"text": "If it makes you feel better, that's not aglio oilo.\n\n\nAglio olio by its very nature is a simple dish, oil, garlic, pepper flakes and parsely. That's the dish. No sausage, no cheese, nothing else.", "label": 1}
{"text": "Is that dried oregano?!\nI'm not Italian but this \"Aglio Olio\" looks so wrong on so many levels 😳", "label": 1}
{"text": "Yes octopus is really good. Too bad they are such wonderful animal", "label": 1}
{"text": "dumplings?", "label": 1}
{"text": "That looms amazing but also looks like it could give you a heart attack.", "label": 1}
{"text": "delicious", "label": 1}
{"text": "дерьмо", "label": 1}
{"text": "Wow, this is some next-level comfort food", "label": 1}
{"text": "Yummy, one of my favorite..", "label": 1}
{"text": "I'm professional chef", "label": 1}
{"text": "Looks not good", "label": 1}
{"text": "Look so tasty", "label": 1}
{"text": "watch Octopus Teacher and you’ll never want to do this again.", "label": 1}
{"text": "I can taste the crispiness from how it looks 😍", "label": 1}
{"text": "Looks so fancy and colorful ❤", "label": 1}
{"text": "Looks crunchy and yummy!", "label": 1}
{"text": "sour?", "label": 1}
{"text": "I haven't tried it but I wanted, Recipe please", "label": 1}
{"text": "You had bad currywurst.\n\n[I use this recipe](https://www.reddit.com/r/Cooking/comments/adjvq1/a_berliners_guide_to_making_berlin_currywurst/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)\n\nyou don't have to make your own sausages, your favorite from the store or butcher will be fine. But follow the recipe for the curry powder and sauce. Go a little heavy with the curry seasoning.", "label": 1}
{"text": "Extra cinnamon on top for the win!", "label": 1}
{"text": "That steak is still breathing", "label": 1}
{"text": "I'd love cinnamon :)", "label": 1}
{"text": "What settinf are you using? Air frying?  Mine dont come out looking as nice\n\nGonna try you slicing too jalapenos stay together better like that it seems", "label": 1}
{"text": "Sure, here ya go. I really like this recipe and I do the overnight proof, cuz it’s easier to handle the colder dough, and splits up the job. Plus I like longer proofs. All I add to this is a big pile of thinly sliced scallions right to the flour before I mix everything. Seems to work well. And this recipe makes 8 good size burger buns. You could probably get 9 smaller ones.", "label": 1}
{"text": "Ohhhhh yesssssssssssss\n\n  \nI can taste the spicy, tomato-y goodness right now 🤤", "label": 1}
{"text": "nothing beats a hearty homemade Irish beef stew", "label": 1}
{"text": "so beautiful!!!", "label": 1}
{"text": "Second time making this. Made a little bit of a mess, but tasted very good.\n\nFollowed recipe here: https://natashaskitchen.com/tuscan-chicken/", "label": 1}
{"text": "No, there is nothing contributing to these things tasting like shit. They taste like salty garbage even when they're seasoned and cooked on a stove.", "label": 1}
{"text": "that butter chicken looks delicious!!🤤", "label": 1}
{"text": "Haha, so adorable! You must be super happy when you're eating too!", "label": 1}
{"text": "Is that red one a sausage? It looks so delicious!", "label": 1}
{"text": "May (the elder) god have mercy on your soul for this (sumptuous) sacrilege", "label": 1}
{"text": "That looks superb makes me want to have a bite 😍", "label": 1}
{"text": "Looks yummy 😋", "label": 1}
{"text": "Looks very tasty, I would try this combination", "label": 1}
{"text": "DM me if u r visiting India again, will make sure to share too many options. \nPS: fulltime foodie here 😎", "label": 1}
{"text": "I can share the recipe 😋", "label": 1}
{"text": "What ingredients to use to make that green paste?", "label": 1}
{"text": "looks super delicious", "label": 1}
{"text": "U all simply can't imagine how my mouth is watering now. This chocolate color just makes me want to stuff it in my mouth. And the berries too. And the skull.", "label": 1}
{"text": "Whoa, that cake looks wicked cool! Totally on theme", "label": 1}
{"text": "Those blackberries are a perfect touch! So sleek!", "label": 1}
{"text": "This one makes me hungry. I would love to try to prepare this one.", "label": 1}
{"text": "That Boeuf Bourguignon looks absolutely mouthwatering and definitely giving me major food envy! 🍽️ #NomNomNom", "label": 1}
{"text": "British cuisine really be putting cheese on bread. I'm sure it tastes good but come on lol", "label": 1}
{"text": "Don't worry, I get it.", "label": 1}
{"text": "The wife and I once went to a very expensive French restaurant and were served this dish, not realizing on the menu it literally meant weekend leftovers. \n\nI've not had it in me to try this dish ever since. \n\nI don't know how much red wine they reduced to make the dish, but it was more than this drunkard could take. \n\nI hope yours was a success because I'll never find one.", "label": 1}
{"text": "\nHi /u/ilikepizza18,\n\nYour [submission](https://www.reddit.com/r/food/comments/1gjknr6/text_if_i_had_to_live_off_of_packet_noodles_whats/ has been removed as it contained --> health <--\n\nWe do not allow submission that contain medical, health or wellbeing terms due to the damage that false claims can make. If you think that your post should be allowed, message us using the below link and explain why we should allow it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 1}
{"text": "They call those “fat sandwiches” in Jersey.", "label": 1}
{"text": "Looks like it", "label": 1}
{"text": "Can i dip this with Nacho chips? looks tasty.", "label": 1}
{"text": "wow looks so delicious", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "Looks delicious!", "label": 1}
{"text": "Looks awful!", "label": 1}
{"text": "That does not look good tbh", "label": 1}
{"text": "why am I watching this at 4:00 in the morning😓", "label": 1}
{"text": "The meat looks the perfect pink color😋😋", "label": 1}
{"text": "The truly amazing thing is that you willingly paid money for these.", "label": 1}
{"text": "Looks great, french fries are my favorite", "label": 1}
{"text": "nice presentation", "label": 1}
{"text": "It’s literally everywhere in Berlin and extremely affordable as well as delicious\n\n\nEat shit", "label": 1}
{"text": "Loved!", "label": 1}
{"text": "My god. That could feed an average person for a month! Or me for a day!", "label": 1}
{"text": "The colors are so tempting!", "label": 1}
{"text": "wow!!", "label": 1}
{"text": "hmmmmn, looks yum", "label": 1}
{"text": "Spicy breading 100%.", "label": 1}
{"text": "Loved!", "label": 1}
{"text": "Wow this looks yum!", "label": 1}
{"text": "Looks delicious, makes me hungry..", "label": 1}
{"text": "For my cheat day..", "label": 1}
{"text": "Would love to have this..", "label": 1}
{"text": "How was it ?", "label": 1}
{"text": "RedBeans 😍", "label": 1}
{"text": "Looks terrible… I would hate to eat something like that… I mean just look at it…. Bet it tastes even worse…Imagine coming home from work and “enjoying something like this”…. Yeah I could never see myself eating this dish… I definetely won’t be trying this anytime soon… Sure feel bad for OP having to ingest this meal…", "label": 1}
{"text": "Full packed meal! love it!", "label": 1}
{"text": "ive tried it and this is heaven!", "label": 1}
{"text": "Chicken looks so good ❤", "label": 1}
{"text": "this looks so delicious, i wanna try!", "label": 1}
{"text": "i can taste the crispiness of the dumpling 😍", "label": 1}
{"text": "Heaven!!!", "label": 1}
{"text": "First of all ew second of all repost", "label": 1}
{"text": "Was just kidding.", "label": 1}
{"text": "Klingon food is the best", "label": 1}
{"text": "Why ew? Seems like a totally normal dish.", "label": 1}
{"text": "Lmao at eat shit", "label": 1}
{"text": "looks appetizing, but I would miss the meat, I would need to complement it with a huge steak😅", "label": 1}
{"text": "I’m in a really tough spot right now and could use some help. While traveling on a bus, we made a stop at a truck stop, and someone stole my purse with all my cash, cards, and ID in it. I immediately reported it to the police, but by the time we finished, the bus had left, leaving me stranded here without any way to get home.\nI’m not someone who usually asks for help, but right now, I’m stuck with nothing on me and no way to get back. If anyone could help with a few dollars for transportation or anything else to get me home, I would be so grateful. Every bit helps, and I would be more than happy to repay the favor in the future.\n\nChime is Ashleypaige123\nCashapp is Ashleyfreeman0\nPayPal is lyriczmom", "label": 1}
{"text": "As lovely the name and taste sound, heart attack is waiting!", "label": 1}
{"text": "Sure thing its healthy and delicious 😍", "label": 1}
{"text": "Same here! it gives a different kind of kick!", "label": 1}
{"text": "Gross", "label": 1}
{"text": "I want my share too❤", "label": 1}
{"text": "This looks delicious! A classic favorite, beef and broccoli never disappoints!", "label": 1}
{"text": "Thought this was a promotion on reddit trying to look like a post. Nice pic and burger looks incredible.", "label": 1}
{"text": "looks very sweet", "label": 1}
{"text": "Looks tasty, simple not over seasoned .. keeping the shrimp as the hero of the dish. <3  \nThanks for sharing the recipe..", "label": 1}
{"text": "Hank Hill also has sex with “the fundamentals”. He is not an adventurous spirit.", "label": 1}
{"text": "Gross", "label": 1}
{"text": "Ingredients:\n\n* 8 oz fettucini pasta\n* 1 lb shrimp, peeled and deveined\n* 2 tbsp butter or olive oil\n* 3 cloves garlic, minced\n* 1 cup heavy cream\n* 1/2 cup grated Parmesan cheese\n* 2 tbsp chopped fresh parsley\n* Salt and pepper to taste\n\nInstructions:\n\n1. Cook the fettucini according to package directions. Drain and set aside.\n2. In a skillet, sauté the shrimp in butter or oil over medium-high heat until opaque, about 3-4 minutes. Remove shrimp and set aside.\n3. In the same skillet, sauté the garlic in the shrimp cooking liquid for 1 minute.\n4. Reduce heat to medium-low and stir in the heavy cream. Simmer for 2-3 minutes until slightly thickened.\n5. Remove from heat and stir in the Parmesan and parsley. Season with salt and pepper.\n6. Add the cooked fettucini and shrimp back to the skillet and toss to coat everything in the creamy sauce.\n7. Serve immediately, garnished with additional parsley if desired.\n\nEnjoy your Fettucini with Shrimp!", "label": 1}
{"text": "I have put the recipe in a comment", "label": 1}
{"text": "Thank you, feel free to make urself the recipe is in a comment", "label": 1}
{"text": "Count me in, lets do the taste test 😎🤤", "label": 1}
{"text": "Ohhh my God, this is how I love home cooked foods 😍👌", "label": 1}
{"text": "Es en rosario, sta fe. El instagram es Cafete.ros !", "label": 1}
{"text": "I'll gonna try making this one, the brocolli really looks appetizing", "label": 1}
{"text": " Looks so so good", "label": 1}
{"text": "Looks very tasty", "label": 1}
{"text": "Looks delicious, yum yum.", "label": 1}
{"text": "Of course", "label": 1}
{"text": "Why did I get a downvote :(", "label": 1}
{"text": "Unhealthy amount of calories", "label": 1}
{"text": "Just about any shrimp would do I guess, fresh if possible.", "label": 1}
{"text": "That sounds amazing, u can add cherry tomatoes as well if u wish, but u have to put them in the oven to cook", "label": 1}
{"text": "we all had to start somewhere, this recipe is as simple as it gets, don't be intimidated, and if u have questions feel free to DM me ♥", "label": 1}
{"text": "My stomach just growled louder than my phone’s notifications. 😂 yummy", "label": 1}
{"text": "Nothing says food like a deep fried chicken dick with rainbow bang bang", "label": 1}
{"text": "This is a perfect meal for the upcoming cold season", "label": 1}
{"text": "Holy shit this sub is pure cancer. Why are people downvoting that? The pizza is very nice, but i like it a bit less dark, thats all.", "label": 1}
{"text": "You must be confused with r/foodcirclejerk", "label": 1}
{"text": "I’m so sorry for your loss, OP. It’s been a joy to see your posts here and on Instagram over the years. My condolences to you and your family.", "label": 1}
{"text": "I said this in another thread and got downvoted to hell.", "label": 1}
{"text": "May I have a bite ? 😋", "label": 1}
{"text": "Best oven baked pizza I’ve ever seen", "label": 1}
{"text": "Love a good steak 🥩", "label": 1}
{"text": "Was it delicious?", "label": 1}
{"text": "Anytime :)", "label": 1}
{"text": "The pancakes look so fluffy!", "label": 1}
{"text": "Perfect!! Can you share your recipe?", "label": 1}
{"text": "I want some lol", "label": 1}
{"text": "Just got back from a few weeks in Asia, makes me want to vomit.", "label": 1}
{"text": "I need to have my cheat day..", "label": 1}
{"text": "How did it turn out ?", "label": 1}
{"text": "Looks like you did a good job!", "label": 1}
{"text": "Making me crave some pizza now", "label": 1}
{"text": "We share this opinion, gag reflex kicked in.", "label": 1}
{"text": "This takes away my STRESSED day A heavenly sweet chocolate with orangey zesty taste DESSERTS.", "label": 1}
{"text": "Looks incredible", "label": 1}
{"text": "Thank you for sharing Op", "label": 1}
{"text": "Looks so good.. I love Pizza it's my go to comfort food..<3", "label": 1}
{"text": "looks so good", "label": 1}
{"text": "Gross", "label": 1}
{"text": "Really? Just dinner, chocolates, medication, pickles and flowers. Some squash and corn to celebrate the fall season. 🍁", "label": 1}
{"text": "Nice", "label": 1}
{"text": "I now claim my chat day!", "label": 1}
{"text": "cheat day i should say ;)", "label": 1}
{"text": "wow!", "label": 1}
{"text": "The title of the post says Turkey Breast with gravy with a side of mashed cauliflower and lemonade!", "label": 1}
{"text": "hmmmn, looks delicious. comfy food", "label": 1}
{"text": "damn it looks so good", "label": 1}
{"text": "great combination", "label": 1}
{"text": "beautiful and interesting", "label": 1}
{"text": "Okay, this looks like it could end world hunger in one bite 😍", "label": 1}
{"text": "I’m drooling just looking at it! It must be super delicious!", "label": 1}
{"text": "it looks that chicken is still alive", "label": 1}
{"text": "These looks absolutely amazing! The layers and flavors must be incredible, even with the pastry hiccup.", "label": 1}
{"text": "Rice, beans and fried chicken are a perfect combination!!!!!", "label": 1}
{"text": "🤞", "label": 1}
{"text": "Gross", "label": 1}
{"text": "This looks  yummy!! I'll definitely try making it.", "label": 1}
{"text": "Ew", "label": 1}
{"text": "This is making my stomach growl Perfect for a cozy night in", "label": 1}
{"text": "I can almost smell it from here", "label": 1}
{"text": "That looks absolutely mouth-watering! I need this in my life", "label": 1}
{"text": "share your sauce recipe please", "label": 1}
{"text": "Thank you for visiting r/food, unfortunately your comment has been removed. You have commented a link to a domain that is not on our domain whitelist. If this is your own webiste/blog, please see our rules and apply to have your domain white listed. If it's a common recipe/food website but not your domain, please send us a modmail and we will review the comment. Please remember to distinguish to us if it's your own domain or not your own domain in any messages. [**Contact the moderators**](https://www.reddit.com/message/compose?to=/r/food&subject=Post%20Removal)\n\nRules: https://www.reddit.com/r/food/wiki/index\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/food) if you have any questions or concerns.*", "label": 1}
{"text": "Interesting! I want to try some :)", "label": 1}
{"text": "Craving some of that", "label": 1}
{"text": "Amazing 🤩", "label": 1}
{"text": "I love sweet pies 😍", "label": 1}
{"text": "I want some homemade ragu now", "label": 1}
{"text": "That look good you made it or somebody else did!", "label": 1}
{"text": "Going to get tacos now", "label": 1}
{"text": "Amen", "label": 1}
{"text": "Almost too pretty to eat… almost", "label": 1}
{"text": "Gulab jamun looks absolutely delicious!", "label": 1}
{"text": "You have some cute dogs there, I bet they're waiting for a bite of that pork co'z it looks so tasty, and thanks for sharing the ingredients .. I'll just adjust the taste based on my preference..", "label": 1}
{"text": "My friend, do you think artificial intelligence can make this kind of food?", "label": 1}
{"text": "I want to peel my skin and vomit. Trypophobia.\n\nLooks delicious if I close my eyes.", "label": 1}
{"text": "I’m drooling! The spice level must be off the charts with this beauty", "label": 1}
{"text": "Thank you for sharing OP", "label": 1}
{"text": "One of my cravings", "label": 1}
{"text": "Oh thats mouth watering", "label": 1}
{"text": "Nice plating OP, Looks so delicious", "label": 1}
{"text": "Genuinely horrific. I'm sure it tastes great but good lord.", "label": 1}
{"text": "isn't schnitzel just normal breadcrumbs and it's panko for torikatsu", "label": 1}
{"text": "Plz.", "label": 1}
{"text": "But Im sure it taste good", "label": 1}
{"text": "Looks so Yummy", "label": 1}
{"text": "looks delicious", "label": 1}
{"text": "Hsusis' jsioamflkxn? Ksukoaks ksofufup bfudhs èhdhf.", "label": 1}
{"text": "Same, the presentation itself is truly appetizing", "label": 1}
{"text": "Ew good job!", "label": 1}
{"text": "looks crispy on the outside, i bet it's soft and moist on the inside. would loved to try this!", "label": 1}
{"text": "Looks delicious! I would like to make this on a saturday night chill with a glass of wine.", "label": 1}
{"text": "Looks so Crunchy and tasty.. <3", "label": 1}
{"text": "Those look 🔥🔥", "label": 1}
{"text": "Or a bot fly. Sorry. Gross, I know", "label": 1}
{"text": "It looks so delicious! Is this dumpling pan-fried?", "label": 1}
{"text": "Delicious 😃", "label": 1}
{"text": "you're a good husband. this is really good when not feeling well.", "label": 1}
{"text": "wow! that cheesy goodness!", "label": 1}
{"text": "This is fucking stupid rage bait.", "label": 1}
{"text": "Yeees", "label": 1}
{"text": "it was extraordinary, although initially I was skeptical, because you must admit the combination is very exotic (shrimp and jambon...)", "label": 1}
{"text": "I'm drooling rn 🤤", "label": 1}
{"text": "first time to see this type of cuisine.", "label": 1}
{"text": "as a chocolate lover. this is heaven", "label": 1}
