{"text": "This how I use to be when my parents told me no", "label": 1}
{"text": "Hah... funny.... hah...", "label": 1}
{"text": "r/anti-work", "label": 1}
{"text": "I’d just say I identify as a caution cone.", "label": 1}
{"text": "Wow, that's a bold choice for Halloween! Using fake tombstones at a nursing home is definitely a wild move. Can't believe they thought that was a good idea", "label": 1}
{"text": "Yes please! Put that sign on my life!", "label": 1}
{"text": "Very funny post", "label": 1}
{"text": "She doesn’t deserve to be put to work. Firing her would send her over the edge", "label": 1}
{"text": "Wow that’s incredibly racist. I’m reporting you.", "label": 1}
{"text": "You'll get to bring your chicken to any other meal you want! It's yours!", "label": 1}
{"text": "ok, then I’ll stand corrected. it’s poisonous in any dosage if ingested. 🤷🏻‍♀️", "label": 1}
{"text": "What's so funny about being called gay is if you're confident in your sexuality, it won't bother you.", "label": 1}
{"text": "Why do you think it’s an insult? Grow up", "label": 1}
{"text": "I mean, she's not ugly. She could make OF🫠", "label": 1}
{"text": "Drama streamer Destiny's favourite spot apparently", "label": 1}
{"text": "It's a feature. You need to take a right turn to fix it.", "label": 1}
{"text": "Nahhh", "label": 1}
{"text": "I like your doggy new poose.", "label": 1}
{"text": "I inspired", "label": 1}
{"text": "The monkeys children are enjoying a ride.", "label": 1}
{"text": "Boyfriend surely made something bad.", "label": 1}
{"text": "You’ll never guess the shape of their vapes.", "label": 1}
{"text": "Now that's some discount 😂", "label": 1}
{"text": "[Nordstan](https://en.m.wikipedia.org/wiki/Nordstan) (=north city)\n\nNordstan Fried Chicken \n\nBut this place is located in the bus/train station right next to Nordstan.", "label": 1}
{"text": "At least you took took your shoes off", "label": 1}
{"text": "I'll project a load on your face", "label": 1}
{"text": "hahahah \"like blackpool illuminations in here \" all the dam time", "label": 1}
{"text": "They flirted with him to move up. They wanted this. Their faces watching him masturbate were like this: $\\_$", "label": 1}
{"text": "Ah ofc, this stereotype had to show up.\n\n\"Do you have any idea the moronic way I can choose to interpret what you said, and the moronic intentions I can try to frame you with, because I am a moron??\" No. Didn't ask. Stfu.", "label": 1}
{"text": "He was also one of the original writers for Conan. And the simpsons.\n\nAnd btw he was the nr.1 most popular comedian of all time for years until the some rats decided to take advantage of the me too movement to steal his money and smudge his image.", "label": 1}
{"text": "Nah this is my little dude, Yihan. He’s a shy little man but his parents always go all out for costume party days.", "label": 1}
{"text": "GTA Quest", "label": 1}
{"text": "Your kid never forgot to close a cabinet door?\n\nDude I forget to close a cabinet door almost daily and I'm a grown adult...\n\nYou can't lecture or beat absentmindedness out of a teen... They have a lot going on in their world. Is not a big deal if they forget to clean up every now and then...\n\nAre you not worried about the sort of mental anguish your child must be going through to live in a household where they have to walk on egg shells carefully to never make a mistake or it will upset you?", "label": 1}
{"text": "\n\nlol my dad had been doing this revenge since we were kids.", "label": 1}
{"text": "Absolutely! Next stop: intergalactic gas stations and cosmic coffee breaks!", "label": 1}
{"text": "When he tickles the ivory...", "label": 1}
{"text": "Nice reference, but he actually practices Amera-dote", "label": 1}
{"text": "that's really scary lol", "label": 1}
{"text": "10% is my new 20%. Inflation is killer and I’m not going to be expected to pay their salary’s anymore. Maybe your boss just implement a matching system or something but I’m not footing the bill any longer.\n\nChange the price of the meal if that’s what it takes.", "label": 1}
{"text": "Why stop there...  why not have nonestop n1gger printed on it..  or relentless k1kes", "label": 1}
{"text": "Should have carved \"Harris for president\" 😂", "label": 1}
{"text": "This cow is redefining what it means to be a mom no boundaries in love", "label": 1}
{"text": "Who is a Nazi? \n\nDefine Nazi.\n\nAnd give examples why you say that.\n\nWw2 caused 65 million deaths. Because Germany started a war. \n\nAnd compare that to Trump? The camps?, the killings, the appartheid?\n\nYour insane.\n\nAnd i have family in Israel my self.\n\n\nJust hang yourself. Waste of air.", "label": 1}
{"text": "Get out of here with your Standard Time fake news", "label": 1}
{"text": "i will do this asap to my future kids lol", "label": 1}
{"text": "Wheely: Fast & Hilarious. It's a kid show, jackass.", "label": 1}
{"text": "Terrifying tbh🫣", "label": 1}
{"text": "He has that look of fear like it was at that moment he knew he Fucked up🤭", "label": 1}
{"text": "Or even scarier: Harris won", "label": 1}
{"text": "So true! Long marriages are like masterpieces that evolve over time", "label": 1}
{"text": "He turned himself in for a life sentence just to get some peace and quiet. They offered parole, but he said, 'Nah, I'm good.\" LMAOOO", "label": 1}
{"text": "stop shoving your disability down our throats dude we get it, your disabled but still perfectly abled for modern relationships.", "label": 1}
{"text": "I mean I literally make [blankets](https://sheetsgiggles.com/ht)", "label": 1}
{"text": "Check DM", "label": 1}
{"text": "Check Dm", "label": 1}
{"text": "BEst one", "label": 1}
{"text": "sunsets ", "label": 1}
{"text": "Because he’s a rapist", "label": 1}
{"text": "Or a giant bank account", "label": 1}
{"text": "Guess that's what they mean by 'neighborly love'", "label": 1}
{"text": "I'll bake some fresh ones ASAP!", "label": 1}
{"text": "Veil lifted, mission accomplished!", "label": 1}
{"text": "Well, it's still young at heart!", "label": 1}
{"text": "You're easily fed...I mean, entertained!", "label": 1}
{"text": "Good post", "label": 1}
{"text": "I inspired your talent", "label": 1}
{"text": "They're on a cookie break, check back later!", "label": 1}
{"text": "And sometimes it's a sitcom, other times a drama!", "label": 1}
{"text": "Not old, just seasoned.\"", "label": 1}
{"text": "Mission accomplished: belly laughs!", "label": 1}
{"text": "Im trying my best but not getting the love back", "label": 1}
{"text": "If you close the tab will you get hired back again?", "label": 1}
{"text": "I can confidently say you’re a moron.", "label": 1}
{"text": "\"Become the non-stop retard she deserves\"", "label": 1}
{"text": "Good right", "label": 1}
{"text": "this has been reposted in every sub like once a day for at least two weeks now……. and every damn time I stop to listen to it because it’s so damn hilarious", "label": 1}
{"text": "Great friends mine just beat me", "label": 1}
{"text": "You must be a real piece of shit", "label": 1}
{"text": "Well, when you drink like a Comanche .", "label": 1}
{"text": "\"Guess I need to channel my inner Hobbit to retrieve them!\"", "label": 1}
{"text": "The parties don’t get “planned” to go that late. Get some friends and you’ll see that shit just happens😹", "label": 1}
{"text": "I don’t know you’re getting downvoted so heavily, it’s the truth ", "label": 1}
{"text": "Owww", "label": 1}
{"text": "Dwight is a cold name", "label": 1}
{"text": "Mother Nature was like... Nope", "label": 1}
{"text": "Lmao your edit, you can't just call people \"shills\" because you don't understand something.\n\nHey dumbass, when the wall was built, China was not a single country yet, they were all still petty Kingdoms fighting each other.\n\nThere was no \"toward the territory of China\"", "label": 1}
{"text": "Good friends: keeping you safe at Halloween parties and ensuring you learn practical life skills the next day. 😅 Hope that tire's treating you better than last night did!", "label": 1}
{"text": "Lugs? You mean the ones holding your life together?", "label": 1}
{"text": "DD: the unsung hero of nightlife", "label": 1}
{"text": "Noodle-ing around with that statement?", "label": 1}
{"text": "Hey bro, I disagree.\n\nFeminism didn't create narcissistic women, it enabled those women to be assholes in public. They were going to be that way regardless in private. \n\nNeo-feminism is the new wave. The rally flag of anti-humanists / anti-patriarchy that see men as inferior beings, or as deserving of hate for the sole quality of being male. There's plenty of reasons (though of course, none of them good or rational) to steer towards that general message without being a narcissist, though that's usually rooted in trauma or a learned hate during childhood.\n\nSo while I hear you, I disagree with the premise on which you introduced the topic.\n\nThat said... It came out of nowhere. I don't understand how you saw neo-feminism as relevant to the comment chain, and even after the fact I still don't think it is.\n\nBoomers got married because they felt like they had to. They stay married because they feel like they have to. In their day, you were a harlot if you ever dated more than one person in your lifetime... But also the Internet wasn't really around in their 20s so they didn't have much of a reach in terms of the people they could meet. The \"haha wife bad\" is beyond stereotypical of boomer humor, just look at the newspaper comics that have been around for ***decades*** at this point. They (mostly) all appeal to the older generation of folks that are disgruntled and frustrated with their spouses but lack the communication skills or capability to compromise to solve any of their problems, in part because they don't feel they should have to communicate or compromise.\n\nBut we as the newer generations have learned that those two things are what a healthy relationship revolves around, and that one is built upon trust and compassion... The other two things at least one of my parent's relationships have been marred by a distinct lack of. We've learned from their mistakes and find \"haha wife bad\" humor to be a pathetic grasping at straws to justify their being terrible at relationships, so we make fun of it.\n\nHas nothing to do with neo-feminists.", "label": 1}
{"text": "I could not stop laughing", "label": 1}
{"text": "PTSD came out to play", "label": 1}
{"text": "too soon", "label": 1}
{"text": "remove daylight savings, and remove timezones all together, make a world wide time I dont matter if that means sun goes up 2pm here and night starts 6am\n\n>\\苘苘苘苘苘苘旗衢翦糗荥苘苘苘苘苘苘苘\\   \n some chocolate workers smell like fish food  \n Disney nuts flatulens  are youa small boi?  \nDo I belvue in amagica or ghost No, he’s NOT riding a male duck.  \nThey often don't expect themselves to explode.  \nPray with me on this dark day, brother.We will see in the morning", "label": 1}
{"text": "Lesson learned: Don't let the party stop you from remembering where the essentials are! 😂", "label": 1}
{"text": "“What’s this called?”\n*pulls out a 9 year old Indian boys pen1s*\n“Shreck”", "label": 1}
{"text": "Where is this I have a bowl!", "label": 1}
{"text": "This is the way!", "label": 1}
{"text": "Put it in the front yard to piss off Karen on the HOA board.", "label": 1}
{"text": "That's not what a Strawman argument is.", "label": 1}
{"text": "That one prop player", "label": 1}
{"text": "\"you know that you have to clean up after we record\"\n\nDad: 😶", "label": 1}
{"text": "2 wrongs don’t make it right … Someone call Fani Willis", "label": 1}
{"text": "Just continue the party", "label": 1}
{"text": "The drawing is by the 4 year old, not the writing for fuck’s sake. Oh, the word ‘her’ looks like it was written by an adult? Really? Because the rest of it looks so childlike?\n\nI love that your comment is framed as you brilliantly deducing that a child didn’t write that and explaining it to everyone else.", "label": 1}
{"text": "Nah, you’re cringe for being thick as pig shit.", "label": 1}
{"text": "Definitely more inn than quality, am I right?", "label": 1}
{"text": "I bet he's got a better attitude than my actual boss", "label": 1}
{"text": "My favourite animal💕", "label": 1}
{"text": "HAH! Humans laughing about underage drinking is brilliant. I love you guys. I'm so glad were all best friends and get to laugh about stuff like this together. I'm not sure what I'd do without you guys in my life.", "label": 1}
{"text": "Is campus placements are thing of India or it's there outside of india also ??", "label": 1}
{"text": "It really is a beautiful thing to see someone in their element. You can really only hope the person on the other side is just as enthusiastic.", "label": 1}
{"text": "I had no idea they had black metal, interesting", "label": 1}
{"text": "Nothing like spending the weekend getting yelled at by jet engines.", "label": 1}
{"text": "doggo's on duty for being \"cat security officer\" making sure catto doesnt wander off on an approved adventures  lol", "label": 1}
{"text": "When you’re trying to leave the party, but your friend insists on being the designated bouncer 😂🐾", "label": 1}
{"text": "Lol. From tailgating to roadkilling", "label": 1}
{"text": "The director said we have to take this scene again, as the actor: you have to multiply the payment.", "label": 1}
{"text": "Sadly people will remember Rayguns efforts at the olympics, the talentless cunt.  Moreso than our most decorated Olympian Jess Fox.  She made a mockery of the efforts of so many athletes, and then has audacity to beg people not to too much her.", "label": 1}
{"text": "Gamakichi? Is it you?", "label": 1}
{"text": "They call it “the Modi” in India. It spews hate, lies and orange smoke.", "label": 1}
{"text": "This dog is such a good guardian.\nThe way cat fights him is hilarious.", "label": 1}
{"text": "This cat's enemy is this dog who doesn't allow the cat to have his cat adventures", "label": 1}
{"text": "I can just imagine it as a quirky piece of home decor. Who knew spiders could be such fascinating little artists? 🤣", "label": 1}
{"text": "We also have the opposite of this too. A bomb named after our goddess of wealth, Laxmi. The bomb even has a picture of her on it.", "label": 1}
{"text": "Good handling", "label": 1}
{"text": "Did you know that morning wood is a normal part of the sleep cycle? It's actually a sign of healthy blood flow and nerve function!", "label": 1}
{"text": "As always, cats show that physics is just a guideline, not a rule.", "label": 1}
{"text": "doggo is setting a very good example of showing appreciation and hoping for a tasty bite! 🍽️🐾", "label": 1}
{"text": "It's like he's saying, \"I'm starving! how much longer, hooman?\" haha, such cutie little foodie in action", "label": 1}
{"text": "Kill and eat that dog", "label": 1}
{"text": "I think only Donald Trump’s pu$$y could look as orangey/pink like that.", "label": 1}
{"text": "lol \"not on my watch\"", "label": 1}
{"text": "I'm remembering this trick 😅", "label": 1}
{"text": "Amazon really coming through with the “you’re getting older” reminder! 😂", "label": 1}
{"text": "Odd looking moon", "label": 1}
{"text": "I'm the dogs' owner\n\n  \nsorrry, but your dog was filming my dogs .. she said Aww", "label": 1}
{"text": "How can you prove something DIDN'T happen?  What evidence can you provide?  This is ridiculous.  \n\nUnscrupulous delivery drivers can always take a photo of the stuff at your door and then walk away with it.  I don't know how to prevent this.  On the other hand, unscrupulous customer can always complain they didn't get their food, hoping to get a free delivery.   It's kind of a shitshow.  \n\nI guess it's just a matter of tracking complaints about delivery people and customers and acting on something that looks dodgy.", "label": 1}
{"text": "How can you prove something DIDN'T happen?  What evidence can you provide?  This is ridiculous.  \n\nUnscrupulous delivery drivers can always take a photo of the stuff at your door and then walk away with it.  I don't know how to prevent this.  On the other hand, unscrupulous customer can always complain they didn't get their food, hoping to get a free delivery.   It's kind of a shitshow.  \n\nI guess it's just a matter of tracking complaints about delivery people and customers and acting on something that looks dodgy.", "label": 1}
{"text": "They all look like Ramsey", "label": 1}
{"text": "Hahaha, it's really hard to leave, unless the witch is willing to lend you her broomstick.", "label": 1}
{"text": "When Halloween is over, maybe it will come back, maybe...", "label": 1}
{"text": "/r/DoPutYourDickInThat", "label": 1}
{"text": "These paw cleaners are great!", "label": 1}
{"text": "She just unlocked a new camo", "label": 1}
{"text": "Now where I live in the desert there’s a store that buys boxes of Amazon returns. They start out on Fridays at $12 and by Thursday the next week anything left is $1 dollar, lather rinse and repeat. So there’s a bunch of these dog paw washers there this week, so far I haven’t seen any of these sold. I have bought some pretty nice stuff there like a hummingbird feeder that lists on Amazon for $40 for $5.", "label": 1}
{"text": "Ахтунг злой сабакен за яйцен клацен клацен", "label": 1}
{"text": "Welcome to the double-duty club: gadget enthusiast & dog parent", "label": 1}
{"text": "I was mighty polite enough in my original response and apparently facts are biased to you.\n\nSorry buddy! Just calling it like it is, you're clearly dumb as dirt with absolutely no self awareness whatsoever, so get fucked", "label": 1}
{"text": "I totally agree, this guy definitely wins Halloween!", "label": 1}
{"text": "That's what I thought it was, hahaha", "label": 1}
{"text": " OP you are just extremely shait person.....", "label": 1}
{"text": "If he gets pulled over, will he tell the cop that he \"yabba-dabba din-doo nuffin?\"", "label": 1}
{"text": "Reminds ne of [this](https://www.reddit.com/r/BestofRedditorUpdates/s/icOakKCyDi)", "label": 1}
{"text": "When people say 'boys will be boys', this is the type of thing I want to see. \n\nNot the usual blatant misogyny.", "label": 1}
{"text": "Based CHAD incel moment I hate women and I LOVE 4chan! 🏳️‍⚧️🫷🫸🏳️‍🌈", "label": 1}
{"text": "I am honored", "label": 1}
{"text": "Keep\n\nYourself\n\nSave\n\n>\\苘苘苘苘苘苘旗衢翦糗荥苘苘苘苘苘苘苘\\   \n some chocolate workers smell like fish food  \n Disney nuts flatulens  are youa small boi?  \nDo I belvue in amagica or ghost No, he’s NOT riding a male duck.  \nThey often don't expect themselves to explode.  \nPray with me on this dark day, brother.We will see in the morning", "label": 1}
{"text": "Thank you fellow Redditor! Hawk TUAH!! 😂🤣", "label": 1}
{"text": "LOLLL dis one funny asf BOIII!! Do you know da wae 😂", "label": 1}
{"text": "I think it's meant to look like someone pressed against the window, like a playful \"stuck\" effect.", "label": 1}
{"text": "I did this one time with my online class cause they say its effective. It did not end well. lol", "label": 1}
{"text": "Why do you take things from free libraries and not return them?", "label": 1}
{"text": "bro he even blinking 💀", "label": 1}
{"text": "That’s amazing car.🔥😂", "label": 1}
{"text": "Shut up woman", "label": 1}
{"text": "I’m aligned with that view.", "label": 1}
{"text": "For guys turned on by the movie “teeth”", "label": 1}
{"text": "I'm curious, what's the weight of the catfish?", "label": 1}
{"text": "eek", "label": 1}
{"text": "Wades statue is a violation", "label": 1}
{"text": "\"You know, i see a little of myself in Dwayne.\"\n\n\"You don't say?\"", "label": 1}
{"text": "Leave them in the box and get a never ending supply of animal crackers.", "label": 1}
{"text": "Poor Rocky! might be a little stony right now", "label": 1}
{"text": "Full email >\nGet Pro For $49/yr!\n\nNowadays children don't believe in any of the old-school supernatural scares. Ghosts? Werewolves? Vampires? British cuisine? That's kindergarten shit.\n\n  Oi guv'nah, plate'o jelly eels, side o' mash pees and a bo'oh o wo'ah. 'Fanks mate.\n\nIf you wanna scare a kid these days, you have to dress like global warming, or worse, P. Diddy. And dressing up as the Diddler poses its own set of dangers as painting one's face black is a huge no-no, unless you're the Prime Minister of Canada (zing!). So where does that leave you for scary costume ideas? Fear not, here is a list of costume ideas for you:\n\n• Buy a discounted roast beef, tape it to your chest, and pour White-Out all over yourself - presto! You're Elon Musk on a yacht!\n\n• Go to San Francisco, collect street poop, cover yourself in it, and you can dress up like Your Online Privacy Rights. Hold your applause, we know, we know, topical and witty. It's just what we do.\n\n• Join the Israeli Military cyber defense squad, then create ExpressVPN, and go partying dressed as their secretive owner, Teddy Sagi!\n  The Three Horsemen of the Apoopcalypse\n\nIf you are like us and don't have time for Halloween shenanigans because you are busy building things, or are too socially awkward to dress up as a slutty astronaut/cat/presidential candidate and party, fear not! You can just dress up your IP address as another sluttier IP address instead! It's exactly like Halloween except without cavities! Get Windscribe Pro and take your IP address trick or treating online for only $49 a year!\n\nWindscribe's Scariest Sale\n\n\nWhether you go out or stay in, we hope you have a safe and fun Halloween. Be careful when partaking in orgiastic candy-eating sessions and remember not to eat too many pillowcases full of those infant-fist-sized chocolate confections - lest you're forced to release a torrential storm into your toilet. The key is to eat juuuust enough to turn those Reece's Pieces into feces pieces. Don't ask how we know. Just trust us.", "label": 1}
{"text": "Bro 😅", "label": 1}
{"text": "Very hot dance (I mean the second version if anything)", "label": 1}
{"text": "The dog is a bit crazy", "label": 1}
{"text": "Really interested to meet the designer...", "label": 1}
{"text": "Boys being boys..", "label": 1}
{"text": "Go trump babby trump all the way", "label": 1}
{"text": "Well, I actually voted. What are you gonna do.", "label": 1}
{"text": "Just a sample ballot 😉", "label": 1}
{"text": "🤣🤣🤣", "label": 1}
{"text": "Wow, you want that to be true soooooo bad.", "label": 1}
{"text": "I don't see a lobster at all. That's a crab. And he's happy", "label": 1}
{"text": "That's how you know he's a keeper", "label": 1}
{"text": "Funny", "label": 1}
{"text": "\"do you like my bling bling?\" haha", "label": 1}
{"text": "now i can not unsee lol", "label": 1}
{"text": "Your husband really has a creative mind.. Don't even know how to do this in my gallery 😂", "label": 1}
{"text": "Lol!! What was that!", "label": 1}
{"text": "Flipping a pancake is just a warm-up for flipping the whole kitchen! 🎉", "label": 1}
{"text": "Looks like", "label": 1}
{"text": "I'm just reading this, but why I do feel hot right now?", "label": 1}
{"text": "Ruthless way to describe someone lol", "label": 1}
{"text": "I see a crab for some reason", "label": 1}
{"text": "He left his texture 💀", "label": 1}
{"text": "👁️👃👁️\n°….👅.…°", "label": 1}
{"text": "\n 👁️👃👁️\n °….👅.…°", "label": 1}
{"text": "That lobster looks way too relaxed for my comfort", "label": 1}
{"text": "A biblically accurate one!", "label": 1}
{"text": "When love sneaks its way into your camera roll – you’ve got yourself a keeper", "label": 1}
{"text": "Visualization is the main thing)", "label": 1}
{"text": "If only all seafood had that kind of confidence before dinner", "label": 1}
{"text": "[Step 1](https://media.tenor.com/v8iGnliKgyQAAAAM/renee-zellweger-bridget-jones.gif)", "label": 1}
{"text": "lol. Who ever that guy that laughs after he got bonk is a mad lad HAHAHA", "label": 1}
{"text": "Why you saying they instead of she?", "label": 1}
{"text": "yummy enough", "label": 1}
{"text": "From my point of view the Jewish are evil...", "label": 1}
{"text": "this is called art sir", "label": 1}
{"text": "perfect evil character laught", "label": 1}
{"text": "He is happy and sad at the same time 🥲", "label": 1}
{"text": "Dude come on. We all know we can use they when gender is unknown. But when we know someones gender so its weird to not just say she. But I think this is a weird political thing thats happening, where for some reason pronouns are y'alls hot button issue so... I'm out. You guys care way too much about this", "label": 1}
{"text": "those are treasures", "label": 1}
{"text": "that's me haha", "label": 1}
{"text": "I'm having same feeling with the MK5 supra I just got. It's not convertible though", "label": 1}
{"text": "Mummy wakes up, sees modern fashion, and immediately regrets it. 😂", "label": 1}
{"text": "Hmmm", "label": 1}
{"text": "XD", "label": 1}
{"text": "Unfortunately this is the reality of many people in society. We used to call them mentally challenged but now we call the Trump supporters.", "label": 1}
{"text": "*redditor plays dumb for a joke*\n\n*same redditor gets mad and defensive when people think he's dumb*\n\n*continues to misunderstand the criticism levied against him*\n\n*writes a several paragraph pissy response and then blocks and runs away like a little girl*\n\npeak reddit, lol\n\nthank you for that laugh, I needed it", "label": 1}
{"text": "Ha, it's slow to eat like that, there's no one on the side, just get started, no one found mygreedy cat,it's so smart.", "label": 1}
{"text": "dreams really do come true! What's her next fantasy vehicle? hahaha", "label": 1}
{"text": "Human powered rollercoaster, where friends become engines.", "label": 1}
{"text": "Nothing like a little humor to keep the office entertained!", "label": 1}
{"text": "Reality check, Goggle-less and proud!", "label": 1}
{"text": "more sad than happy imo", "label": 1}
{"text": "wow how generous of Royal SAS Hotel to really grant your wish. Hope for not just a best day but also another good year for you.", "label": 1}
{"text": "American students- \"my dad has diabetus\"", "label": 1}
{"text": "Sounds like a chipmunks", "label": 1}
{"text": "I understood one of the children", "label": 1}
{"text": "So you’re the re tard", "label": 1}
{"text": "Even Mona Lisa needs a vacation from people staring at her 🤣🤣", "label": 1}
{"text": "This dog is great at dribbling and balancing without even needing a hand so impressive!", "label": 1}
{"text": "That was a wild scene! The kangaroo was a real beast. I'm glad the man was able to defend himself and save the dog. What a punch!", "label": 1}
{"text": "dog is tweaking", "label": 1}
{"text": "dog is tweaking", "label": 1}
{"text": "Dog is tweaking", "label": 1}
{"text": "At this point, i think my eyes are blurry 😅", "label": 1}
{"text": "Rabies.", "label": 1}
{"text": "This is how I am right now with my clothes, I'm thinking about going on a diet or buying new clothes", "label": 1}
{"text": "Lost me at DUMB WHITES, but surely taking advantage of DUMB COLOREDS would be equally funny? 😂🤣😂", "label": 1}
{"text": "Let her.", "label": 1}
{"text": "Well it grabbed my attention. Its worth checking out lol", "label": 1}
{"text": "Enjoy every moment you got", "label": 1}
{"text": "I can imagine that it's draining to be stared at all day. Hope she had a good trip.", "label": 1}
{"text": "*Batcat*", "label": 1}
{"text": "Love seeing people grow and develop their sense of humor.", "label": 1}
{"text": "Boo! Cake or we haunt you.", "label": 1}
{"text": "If i were you i would put it on a necklace and wear it all the time lol", "label": 1}
{"text": "I identify as a lobster. I see my fellow lobster as unemotional", "label": 1}
{"text": "lmao. Why do i hear the exact phrases on my head HAHAHA", "label": 1}
{"text": "this made my day! such a creative and funny way to bring up the classic debate....", "label": 1}
{"text": "Did it come with a side of existential dread, or was that just a bonus topping? 🍩😅", "label": 1}
{"text": "Ya'll ROCK!  We laughed our heads off at your, \"drooling headlock escape tactics!\" Thanks for the giggle.", "label": 1}
{"text": "Lmao this is just objectively false. They teach many aspects of physical therapy in chiropractic school 😂😂", "label": 1}
{"text": "Objectively wrong lmao", "label": 1}
{"text": "Kind reminder not to take medical advice from Reddit", "label": 1}
{"text": "As if the origin has shit to do with it currently 😂 nah, just say you’re uneducated and go lmao", "label": 1}
{"text": "Lmao you’re an idiot", "label": 1}
{"text": "Objectively wrong", "label": 1}
{"text": "Best joke ever", "label": 1}
{"text": "Objectively wrong", "label": 1}
{"text": "You could say that about any medical professional lol", "label": 1}
{"text": "So does your mom.", "label": 1}
{"text": "I have. I assure you, every point you bring up, I have better counterpoints for. You think the origins of the profession have anything to do with current teachings lmfao?? No, you are definitely objectively wrong 😂😂", "label": 1}
{"text": "I'm confused already", "label": 1}
{"text": "Looks like a young Trump", "label": 1}
{"text": "Please, point where I have said anything incorrect. I’ll wait. I promise you, I can out-argue you fools on this topic. You didn’t even say anything here at all you moron 😂😂", "label": 1}
{"text": "You’re not very educated are you? 😂😂", "label": 1}
{"text": "Notice: you’re too scared to bring up any points. You have no reasoning. You can’t even articulate your points. Don’t talk to me, you’re way too dumb for me, bud 😂", "label": 1}
{"text": "Please, sir, tell me exactly how I’m uneducated. I would love to hear. Please, articulate it 😂😂", "label": 1}
{"text": "dinosaur\nbut the chicken is dinosaur.zip😂😂", "label": 1}
{"text": "No they don’t lmfao.", "label": 1}
{"text": "What kind of fucking moron thinks chiropractors get their info from that? 😂😂😂", "label": 1}
{"text": "Highly doubt this lmao", "label": 1}
{"text": "Objectively wrong, but you bozos just sound like broken records at this point. Got any proof or you speaking out your ass like the other fools in here? 😂", "label": 1}
{"text": "ID required to buy liquor but none needed to vote.", "label": 1}
{"text": "These construction workers are out here workin’ overtime like they’re tryin’ to finish the underworld’s highway! 😂", "label": 1}
{"text": "Hahaha no wonder, this is who I’m dealing with 😂😂", "label": 1}
{"text": " I'm sure he knew what he was doing Lol", "label": 1}
{"text": "You still didn’t list anything lmfao?? Just say you can’t form a proper opinion. That’d save us both a lot of time", "label": 1}
{"text": "ai fs, no way that is fr", "label": 1}
{"text": "The mustache has moved a little ;)", "label": 1}
{"text": "Qué Malá Harris wanted you to abort him.", "label": 1}
{"text": "ugly ashhhhh", "label": 1}
{"text": "Again, pussy, are you going to list any points, or are you going to keep embarrassing yourself? Please, if that’s all you can come up with, then by all means, keep going 😂", "label": 1}
{"text": "You still haven’t even said anything this whole time besides chiropractors are fairies 😂😂 this is pathetic. I’ve heard better reasoning from kids lmfao", "label": 1}
{"text": "That’s what I thought, pussy 😂 tuck your tail and go 😂 hmu when you come up with some actual logic and reasoning", "label": 1}
{"text": "this will happen to some of my girlies who made to much fun on Halloween. lol", "label": 1}
{"text": "They have a huge emphasis on physical therapy. It’s not like they’re just teaching stuff about the human body and it happens to relate lmao. You didn’t claim otherwise, but you said, “you went to a quack and you’re lucky you didn’t get hurt,” which is objectively wrong.\n\nAlmost everything they teach is completely based in science lmao. Please, tell me something they teach that is completely unscientific. I’d love to hear it. Additionally, no. You would not be “lucky” to not get hurt. If you look up research journals, chiropractic is extremely safe.\n\nCool? I didn’t say otherwise. That is exactly what I would expect to lmao.", "label": 1}
{"text": "Looks like your cat's finally showing its true colors! Beware of midnight mischief! 🎃👻", "label": 1}
{"text": "Looks good imo", "label": 1}
{"text": "U dude, are talented", "label": 1}
{"text": "When the creative juices flow... maybe a little *too* freely", "label": 1}
{"text": "Yeah", "label": 1}
{"text": "This is made by some pedo artist", "label": 1}
{"text": "Can I reschedule the surgery after halloween? LOl :))", "label": 1}
{"text": "When you try to be holy, but accidentally summon Picasso instead.😂", "label": 1}
{"text": "At this point, Mr. Right is just running on skeleton time. 🕰️💀 Guess he took 'till death do us part' a little too seriously!", "label": 1}
{"text": "Not surprised. Horrible movie with horrible a horrible lead actor.", "label": 1}
{"text": "Idk who you are either but don't worry I tried to do Neo from the matrix but I have brown hair and I wear prescription glasses that don't transition (so no shades) so no one really knew who I was either. Just a black wool trench coat and a black button up shirt with gray dockers. I should've done better. Your costume is good though at least you have all the props and everything", "label": 1}
{"text": "the delivery man is also in character. that mini jumpscare tho lol", "label": 1}
{"text": "They were blinded by the light and wrapped up like a deuce, an additional night runner", "label": 1}
{"text": "Hey guys i cant post coz of karma\n\nplz help me \n\n\\-thanks", "label": 1}
{"text": "Hey guys i cant post coz of karma\n\nplz help me\n\n\\-thanks", "label": 1}
{"text": "I see weapon of mass destructions", "label": 1}
{"text": "Well.she has a face like ogre Fiona…", "label": 1}
{"text": "Good luck with that logic lol.", "label": 1}
{"text": "Dodge this!\" - Patches O'Houlihan (RIP), Dodgeball. Yessssss", "label": 1}
{"text": "[Hillview Road inclusion](https://maps.app.goo.gl/JC1U9L2ENgb7q6bz7)", "label": 1}
{"text": "The kid is not pleased.", "label": 1}
{"text": "Someone's been taking etiquette lessons from the Queen of England!", "label": 1}
{"text": "hahaha the moment they went home they've thought that they got the huge treat.", "label": 1}
{"text": "kids, prepare for the plot twist", "label": 1}
{"text": "Wait, they aren't?", "label": 1}
{"text": ">Costume      \nSwine.", "label": 1}
{"text": "Obvious Plant has something not far off of that called \"Barely Any Ketchup\" lol", "label": 1}
{"text": "The important thing is to try", "label": 1}
{"text": "That is so funny! But how does that house not get egged?", "label": 1}
{"text": "You really nailed the healthy Halloween theme! Who needs sweets? LOL", "label": 1}
{"text": "Randomly. Right. Let’s pretend you didn’t just make up that uneducated statement.", "label": 1}
{"text": "He’s not agreeing with you lol. He’s pointing out how bad your argument is for it being “animal abuse.” You’re oblivious.", "label": 1}
{"text": "1. Your reply barely makes any sense. Reread it. That is awful.\n\n2. Your statement said 2 things. That chiropractic is risky, and that it is also animal abuse. Both of these are untrue. Chiropractic adjustments are rather safe after sifting through multiple chiropractic journals. Most of them admit there is no causation with the actual adjustment as well. Additionally, your argument for why it is animal abuse is dumb. Animals can’t communicate their discomfort or confusion well anyway, and that certainly doesn’t qualify as animal abuse just because they experience those emotions.", "label": 1}
{"text": "Can’t name anything, can you, moron? How’s it false? Name something. You’re pathetic 😂", "label": 1}
{"text": "Who knew taste buds could be so easily duped?", "label": 1}
{"text": "Double trouble for trick or treating! Two costumes, twice the treats!", "label": 1}
{"text": "love the triple eyebrows set", "label": 1}
{"text": "is that weed! i need that", "label": 1}
{"text": "Tbh, the burden of proof should be on you fools, since chiropractic is a pretty well established profession. For you to make those bullshit claims, you should have to prove they are true. But I will be the bigger person and list a link for you. Additionally, of course, I am name calling when you make up bullshit claims. You’re spreading misinformation. Like the crap about animal abuse. You literally just made that up.\n\nRead “Systematic Review and Meta-analysis of Chiropractic Care and Cervical Artery Dissection: No Evidence for Causation.” This is one example I was talking about. Cervical artery dissections are one of the major “dangers” of chiropractic, and evidence shows there’s no causative link. Plenty more too. This one examines many journals and examines the data to make conclusions. Look forward to your subpar reply.", "label": 1}
{"text": "\"Shinning bright like a diamond\"", "label": 1}
{"text": "What game is this?", "label": 1}
{"text": "I’m not going to do all the work for you. Remain uneducated if you want. I don’t have a horrible character; I just hate morons that go around shouting their stupid opinions. Good stay silent, I’m tired of reading the weak rebuttals.", "label": 1}
{"text": "The most loyal group of friends", "label": 1}
{"text": "I want you to win the best costume award at whatever Halloween contest you join. Well done on the makeup\\\\\\", "label": 1}
{"text": "Try again", "label": 1}
{"text": "Catman 🦇 😂", "label": 1}
{"text": "Cocker spaniels are definitely the worst!!", "label": 1}
{"text": "How many atoms are there in a skittle?🤨", "label": 1}
{"text": "Boys will be boys", "label": 1}
{"text": "Nice chest of drawers", "label": 1}
{"text": "Most likely an injury. You’re extending your spine rapidly with zero weight after having 500pounds stopping you.", "label": 1}
{"text": "And adults need to be careful too", "label": 1}
{"text": "Ahh hell nahhh", "label": 1}
{"text": "You’re very welcome, spread the question 😂", "label": 1}
{"text": "lil bro got a restraining order to not get close to a web within a 100 cm hahaha", "label": 1}
{"text": "I’d actually watch this", "label": 1}
{"text": "When you're too old for trick or treating but too young to give up, lol", "label": 1}
{"text": "ITs a fate", "label": 1}
{"text": "For me Velma nailed it. they should have another one to be scooby.", "label": 1}
{"text": "DAPHNE THE DESTROYER wore it best", "label": 1}
{"text": "LOL, He's stocked with that for life", "label": 1}
{"text": "RIP inflatable Scooby.", "label": 1}
{"text": "Real lol", "label": 1}
{"text": "Yall win", "label": 1}
{"text": "Your friends absolutely nailed the 'creepy yet funny' vibe! 😂👏", "label": 1}
{"text": "Me and my friends slayed as pirates<3", "label": 1}
{"text": "So Daphne is a boy and Fred is a girl?", "label": 1}
{"text": "damn mama", "label": 1}
{"text": "makes me wonder why they name it that way lmaooo", "label": 1}
{"text": "Bro was so done, lol😭", "label": 1}
{"text": "Once again, another idiot post by you.  You really don’t offer anything meaningful do you?  You’re a pathetic loser who fits the left perfectly.", "label": 1}
{"text": "Losebriel is his name", "label": 1}
{"text": "guns are not funny.  calling a woman a \"bitch\" is not funny", "label": 1}
{"text": "Im laughing so hard. Can't find what to say bout this, but this a top notch acting and voice over", "label": 1}
{"text": "hahahaha the moment it started running.", "label": 1}
{"text": "ohh that pure heart of his, makes me think that since we are young we are subjected to letting go its eitheer things, moments or even persons", "label": 1}
{"text": "now this is funny hahahaha", "label": 1}
{"text": "hilariously cute", "label": 1}
{"text": "a \"copy cat\" phrase came up with a reason", "label": 1}
{"text": "Killing me with the cuteness", "label": 1}
{"text": "the way he gets thrown by the big doggo without even trying is sending me", "label": 1}
{"text": "Annoying fatties", "label": 1}
{"text": "Yeah. Let the MAGA guy have it.", "label": 1}
{"text": "check the wirings", "label": 1}
{"text": "Perspective doing its thing", "label": 1}
{"text": "The tranny on the end", "label": 1}
{"text": "If my kid came home from trick or treating with a giant bag of candy and a magnum condom I would laugh really hard.", "label": 1}
{"text": "Who's that tranny to the left.", "label": 1}
{"text": "Happy birthday", "label": 1}
{"text": "Not gonna lie, i've been hooked on this for a while now. It's amazing", "label": 1}
{"text": "A goid prank again. Where no one gets harmed.", "label": 1}
{"text": "Hope your day is legendary and full of surprises.", "label": 1}
{"text": "The Leafmen!\n\nSuperpower: Making you laugh", "label": 1}
{"text": "That's so funny 😂😂😂", "label": 1}
{"text": "That actually seems fun, ngl!", "label": 1}
{"text": "Karen 🤣", "label": 1}
{"text": "donkey:excuse me?", "label": 1}
{"text": "She wasn't pregnant but she still delivered.\n\n[@lotharvazquez4593](https://www.youtube.com/@lotharvazquez4593)", "label": 1}
{"text": "haha the way they rushed in 😂", "label": 1}
{"text": "yea she's enjoying her meal for sure", "label": 1}
{"text": "To everyone asking about the shirt it’s from here [https://www.teefind.com/products/fk-hoodie](https://www.teefind.com/products/fk-hoodie)", "label": 1}
{"text": "Reading that feels like how I talk when I'm freakin' drunk or high..", "label": 1}
{"text": "Ewwww she with a black guy? 🤮🤮🤮🤮", "label": 1}
{"text": "            o   De                              PPOoP", "label": 1}
{"text": "Did she try and practice that?", "label": 1}
{"text": "Jimmy Eats Corn", "label": 1}
{"text": "Aw shucks!", "label": 1}
{"text": "I have a little sofa for my dog too lol. That one looks a little more padded though. Might need to upgrade to the tufted edition.", "label": 1}
{"text": "Nutty joke that might choke. lmao", "label": 1}
{"text": "maybe later then", "label": 1}
{"text": "I can name your band as \"Rockstar - corn\"", "label": 1}
{"text": "This explains that this is not the right time for you, or maybe you can come back later.", "label": 1}
{"text": "Looks like he's in a burger marathon while she's in a fine dining experience! 🍔⏳ Patience is key, my friend! 😂", "label": 1}
{"text": "Corn friends", "label": 1}
{"text": "Pop IT!", "label": 1}
{"text": "Cornucopia", "label": 1}
{"text": "Cornfused! They don’t need a Korn reference.", "label": 1}
{"text": "Electric Corns", "label": 1}
{"text": "So that included reddit cuz I feel like I see stuff from reddit and twitter on here plenty?", "label": 1}
{"text": "This is just evil 😡. Please do more.", "label": 1}
{"text": "Yes, it's a repost.\n\nhttps://www.youtube.com/watch?v=R9rymEWJX38", "label": 1}
{"text": "Husqvarna", "label": 1}
{"text": "Lol, this got me rolling", "label": 1}
{"text": "U always dressed like that?", "label": 1}
{"text": "That can be really tough to watch! It sounds like you might be experiencing a strong empathetic response, possibly even mirror-touch synesthesia, where you physically feel the pain or discomfort of others. That's a pretty rare and fascinating phenomenon! Do you find that happening often when you watch intense or painful scenes?", "label": 1}
{"text": "That sandwich is living on borrowed time! Hopefully, she checks the expiration date and gives it a sniff test before taking a bite. If it's been stored properly in the fridge, it should be good for a few days, but if it's past its prime, better safe than sorry", "label": 1}
{"text": "Dr. Seuss would be proud", "label": 1}
{"text": "Popcorn 🍿", "label": 1}
{"text": "on her first bite i will be already finished , and who drinks orange or chocolate with a burger !!", "label": 1}
{"text": "I think he’s one of the owners of the restaurant and they do these videos  as entertainment and promotion.\n\nSometimes he’s in the background trying to not to poop his pants. Sometimes.", "label": 1}
{"text": "her face was like, \"wtf?!\" hahahaha", "label": 1}
{"text": "Lmao i love it", "label": 1}
{"text": "I mean i kinda see it", "label": 1}
{"text": "\"Mom these strawberries taste weird\"", "label": 1}
{"text": "the plot twist i didn't see coming", "label": 1}
{"text": "With all these people around?? 💦", "label": 1}
{"text": "No shit.\n\n\n🙃", "label": 1}
{"text": "The unicorns", "label": 1}
{"text": "Father's love is silent", "label": 1}
{"text": "HardCorn", "label": 1}
{"text": "Oh my sense of humor is doing just fine. Your \"jokes\" on the other hand...well...", "label": 1}
{"text": "just some random thoughts: have you ever had one of those days where you're holding a stick and thinks someone is a pinata? he looks like a pinata", "label": 1}
{"text": "https://a.co/d/2AD8Gkv", "label": 1}
{"text": "Sure she did.    Sure.", "label": 1}
{"text": "corncopia", "label": 1}
{"text": "In general, sipping is better than gulping when it comes to drinking liquids, especially when it comes to water. Drinking water slowly and steadily can help your body absorb it more effectively and can prevent overhydration.Feb 16, 2023", "label": 1}
{"text": "Food poisoning is a bacterial infection. It's not \"my tummy hurts, pepper spicy mama\"\n\nBro your comment history is.... really sad. Genuinely, seek therapy. \n\nI'm gonna block you because you sincerely seem mentally ill.", "label": 1}
{"text": "Me excitedly waiting for the results and then😐", "label": 1}
{"text": "The cobs! :3", "label": 1}
{"text": "One strawberry per child? I hope the parents brought fire extinguishers! 🔥", "label": 1}
{"text": "a butt plug", "label": 1}
{"text": "Corn", "label": 1}
{"text": "The corn huskers", "label": 1}
{"text": "Russian Khrushchev Beatles", "label": 1}
{"text": "oh boy ! ran fast kiddo LMAO", "label": 1}
{"text": "Right? It's like he's taken all his classic dad moves and turned them into grandpa-level magic.  Makes me so happy to see them making memories like we used to, just in their own way now!", "label": 1}
{"text": "Yeeeeaaaaaaahhhh…… righhhttt…. A “snail”.", "label": 1}
{"text": "funny", "label": 1}
{"text": "That head tilt and then smile translates as, \"You absolute asshole and I love you so much!\"", "label": 1}
{"text": "😂", "label": 1}
{"text": "I want this suit", "label": 1}
{"text": "Cornholieo and the Huskers", "label": 1}
{"text": "The child greeted him very calmly. If it had been any other child, he would have cried instead of greeting him.", "label": 1}
{"text": "I thought it was Potato Man, ready to come out and fly.", "label": 1}
{"text": "lift need a rest too", "label": 1}
{"text": "get tf out my food", "label": 1}
{"text": "scum metal*", "label": 1}
{"text": "cat's disappointed", "label": 1}
{"text": "Cornelious travel cub", "label": 1}
{"text": "Cornstars", "label": 1}
{"text": "Yeah have you seen those Indian street food vendors? Delicious", "label": 1}
{"text": "red chili chill", "label": 1}
{"text": "Last post this guy ever makes", "label": 1}
{"text": "Not sure he's a whore but , he's still doin it for money 😶", "label": 1}
{"text": "Americans talking about the quality of British food is like the fat kid calling other kids chubby. Quality ingredients are the norm in the UK.\n\nAmericans will make a point of specifying when they have butter instead of margarine.\n\nAmericans wash their chicken in chlorine because their food standards are so poor.\n\nAmerican \"sugar\" has been virtually replaced in most products with high fructose syrup.\n\nPeople who live in glass houses shouldn't throw stones.\n\n\"British food is bad\" is a thing, but it's almost entirely from the US because they're too stupid for self reflection and the French because their French.", "label": 1}
{"text": "jolly corn", "label": 1}
{"text": "You're the best dad. What matter most is the memories  created!", "label": 1}
{"text": "Yeah that was the most ridiculous part about the video. I've spent many years living in America and Britain, as well as having traveled and lived in a lot of other countries. I've never been anywhere where people eat so much fried shit and mayonnaise as Brittain. Vastly more than America.\n\nIn Britain (also in my own home country by the way) it's very common to have a deep fryer in your own house. I've never heard of any American that had one.", "label": 1}
{"text": "“It is commonly said, even by the English themselves, that English cooking is the worst in the world. Boiled vegetables, tasteless gravies, and, of course, boiled beef-the food itself a symbol of the British stoicism.”\n\nGeorge Orwell, 1945", "label": 1}
{"text": "Almost got me, I need to look closely to recognize.. xD", "label": 1}
{"text": "They're great at what they do, but I want to slap whatever idiot decided to package them with a \"fryer basket\" instead of just putting a bigger fan in a toaster convection oven (which allows you to actually fit food in reasonable quantities)\n\nWhen I met my wife she had one of those stupid things.  We could make 3 mozzetta sticks at a time in it.", "label": 1}
{"text": "Haitans would like to have a word. Why no dogs and cats on the menu?", "label": 1}
{"text": "British are the most vile people on the planet. They worship a pedophile as king while standing atop their garbage island. \n\nThere’s a reason why everyone declares independence from those toothless trolls.", "label": 1}
{"text": "He's correct ! She's referring to hoards of Indians that liver there since the the British occupation of India hundreds of years ago. \n\nThe only other funnier video of this would be asking which country has better Dental (teeth) appearance ? ;-)", "label": 1}
{"text": "Bwahaha!!! Just a coincidence or done on purpose?", "label": 1}
{"text": "He was wrong but not enough to go to jail", "label": 1}
{"text": "Omg where can I get one for my wife?", "label": 1}
{"text": "Guess you're correct... yous are the world experts in turning into disgusting fatties after all.", "label": 1}
{"text": "Looks like you have some nice sized boobies. Can we see them?", "label": 1}
{"text": "Is chicken tikka masala really British cuisine or just a delicious colonial souvenir? 🍛", "label": 1}
{"text": "when you wanted to play with a stick", "label": 1}
{"text": "Imagine those are trump's hands", "label": 1}
{"text": "mhmm this is the one", "label": 1}
{"text": "lmaoo", "label": 1}
{"text": "Probably made by a Trump company", "label": 1}
{"text": "Fuck off Instagram crocheting rainbow haired 40 year old shithead", "label": 1}
{"text": "What do you think people outside of the US tnk of when they hear about \"American food\", piggy?", "label": 1}
{"text": "And what is it the ? \nA male genuinely asking...", "label": 1}
{"text": "to keep it warm", "label": 1}
{"text": "the oi was damn personal", "label": 1}
{"text": "me making the same wrong decisions in life", "label": 1}
{"text": "Remember a line with Chef Robert Irvine boasting about English restaurants being the best in the world over some beers with another guy. So the other guy asked what type of food they served. \n\nReflexively Robert responded, “French!”", "label": 1}
{"text": "Answer the question, spineless piggy", "label": 1}
{"text": "Vote biden fuckers", "label": 1}
{"text": "Vote bidens mother fuckers piece of shit", "label": 1}
{"text": "Vote for trump mother fuckers", "label": 1}
{"text": "It's not about food, it's about the dumbest developed nation on Earth thinking they're exceptional.", "label": 1}
{"text": "Hahaha lol", "label": 1}
{"text": "u/savevideo", "label": 1}
{"text": "Nah I gonna slag it off.\n\nIt's mid at best and requires either separation of the beans and toast such that the toast doesn't get soggy and one can get the correct bean-toast ratio OR a nutter that wants to eat soggy toast.\n\nIt's not garbage but damn is it overrated", "label": 1}
{"text": "Look man give us this one aite?\n\nIf we lose this all we left are what, fucking pasties and ice cream?\n\nPlus I've met many foreigners who say that English roasts are the best they ever had so...\n\nJUST GIVE US THIS ONE", "label": 1}
{"text": "Seen better days, still a beefy classic.", "label": 1}
{"text": "u/savevideo", "label": 1}
{"text": "> I'm Italian and American good crushes.English.\n\nI'm British, and I'll have a good British curry any day over any Italian food lol", "label": 1}
{"text": "Great milk shake at the end", "label": 1}
{"text": "No, because his initial reply was talking about American BBQ. It would be like saying Indian food and Chinese rice bowls are the same because they both have rice in a bowl. When Americans say BBQ they're talking about [this](https://assets.sainsburys-groceries.co.uk/gol/up-your-barbecue-game-with-these-cheffy-touches/original.jpg) When Britons say barbeque they're talking about this which Americans call grilled food. \n\nAmerican Style BBQ, which the person /r/connell1975 was referring to, is an American cuisine. There are some shops that sell it in the UK, but it's like an indian restaurant in the UK. It's not British cuisine it's American cuisine sold in the UK.", "label": 1}
{"text": "I have 2 pairs of those that i use only for overnight backpacking trips. \n \nI have nearly equally comfortable boxers for a third of the price but dont do nearly as well for when im sweaty, physical, and not able to shower for the next 3-5 days… \n \nSaxx tho…. I felt goddamn luxurious 3 days into the smokey mountains. And check my username", "label": 1}
{"text": "for that \"extra, extra\" lift. lol!", "label": 1}
{"text": "Is this a football game or a casting call for a new reality show? 😂", "label": 1}
{"text": "She's used to the unexpected...eruption", "label": 1}
{"text": "Up for a Corn-cert?", "label": 1}
{"text": "That titty bounce was grade A", "label": 1}
{"text": "Straight up stolen and copied.", "label": 1}
{"text": "That looks sick", "label": 1}
{"text": "PURRtrain", "label": 1}
{"text": "As an Asian, both British and America food is shit, none of them know food could be fried.", "label": 1}
{"text": "it didn't stop him", "label": 1}
{"text": "nice try", "label": 1}
{"text": "Especially with cereal spillers.", "label": 1}
{"text": "their lifeless eyes just makes it even better and a suitable cake to bring to work. \n\nCause thats how I be looking dragging my self to work", "label": 1}
{"text": "penguins look like they had a long week already!! great mood for a work cake😅", "label": 1}
{"text": "i remembered someone.", "label": 1}
{"text": "\n\n\nA message to all users: Please be aware that spreading misinformation regarding COVID-19, vaccines, or other treatments can result in content being removed and/or a ban. Content advocating for or celebrating the death of anyone, or hoping someone gets COVID-19 (or any disease) can result in a ban as well. Please follow [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439). If you see content violating these policies, please use the report button and do not feed the trolls.\n\n\n[Reddit's Content Policy](https://www.redditinc.com/policies/content-policy) \n\n[Reddit's stance on misinformation](https://www.reddit.com/r/announcements/comments/pbmy5y/debate_dissent_and_protest_on_reddit)\n\n[/r/Funny's rules](https://www.reddit.com/r/funny/wiki/rules) \n\nWe also encourage you to read these helpful resources on COVID-19, vaccines, and treatments:\n\n[COVID Dashboard](https://covid19.who.int/)\n\n[Reddit's Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_where_can_i_find_information_about_the_mechanism_and_progress_of_vaccines.3F)\n\n[Ivermectin FAQ](https://www.who.int/news-room/feature-stories/detail/who-advises-that-ivermectin-only-be-used-to-treat-covid-19-within-clinical-trials)\n\n------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*", "label": 1}
{"text": "Honestly I didn’t know this. Now I can yell it next time 🙂", "label": 1}
{"text": "this is nut", "label": 1}
{"text": "Kids really do have a unique approach to creativity, don’t they?", "label": 1}
{"text": "Pls uovote i need karma", "label": 1}
{"text": "Pls uovote i need karma", "label": 1}
{"text": "It's funny but also sad...", "label": 1}
{"text": "the hunter becomes the hunted", "label": 1}
{"text": "Looks like he took the wrong turn in the game!", "label": 1}
{"text": "Nice job, although a bit of a stretch", "label": 1}
{"text": "Nice job, although a bit of a stretch", "label": 1}
{"text": "I thought of this right away.", "label": 1}
{"text": "lil bro you are just a dumb cunt. Nobody eats jellied eels lol", "label": 1}
{"text": "The dish is consumed in other parts of Europe, including Denmark, Norway, Sweden, France, Germany, Poland, Belgium and the Netherlands.\n\nhttps://amp.theguardian.com/lifeandstyle/2013/nov/09/jellied-eels-cockney-tesco-food\n\nhttps://bradleysfish.com/product/jellied-eels-pot/#::text=These%20are%20our%20finest%20Jellied,selling%20for%20over%2069%20years.\n\nGrow up mate.", "label": 1}
{"text": "what can i say, he was an artist", "label": 1}
{"text": "If someone could replace the audio with this track, it fits pretty well.\n\n[https://youtu.be/5uQ4aJ2NJZQ?si=S7vgytkT3cn7hdBs](https://youtu.be/5uQ4aJ2NJZQ?si=S7vgytkT3cn7hdBs)", "label": 1}
{"text": "I hope your 6 y.o. cousin is cute", "label": 1}
{"text": "Read the room, numb nuts.", "label": 1}
{"text": "kids are fucking stupid", "label": 1}
{"text": "Halloweening is tough when you're a minion with big dreams and little arms! 😂", "label": 1}
{"text": "I would say indian cusine is amazing", "label": 1}
{"text": "This is a masterpiece😁 I hope it will be sold for thousands of dollars someday", "label": 1}
{"text": "n-n-neckbeard 😨😨\n\n\n\n\n\nGet a job fatty", "label": 1}
{"text": "Time to escalate start printing ‘Queen of Canada’ pictures and tape them everywhere in the office let the reign begin!", "label": 1}
{"text": "They were so chill, like watching a puppy barking", "label": 1}
{"text": "TIL Ancient Aliens has been on the air for 20 seasons.", "label": 1}
{"text": "Video does nothing for me because of what these dogs are capable of. The other day in the UK there was another child victim of their vicious attack. \nDog breeds like that should not exist.", "label": 1}
{"text": "The \"Never fight\" at the end...  Legendary!!", "label": 1}
{"text": "The \"rule\" your mentioning is a fallacy.\n\nIts a shame that these dogs have such great physical ability that asshole humans train them to be violent.", "label": 1}
{"text": "You shouldn't exist", "label": 1}
{"text": "It’s a hand me down from his mother. That’s my guess.", "label": 1}
{"text": "What a naughty skeleton! lol", "label": 1}
{"text": "Should the US deport black people because they commit violent crime at a higher rate than whites?", "label": 1}
{"text": "Sweet", "label": 1}
{"text": "They’re both living things. I want to understand the position of the guy who I’m debating on this topic as I see some parallels.", "label": 1}
{"text": "I don’t own a dog at the moment. I will once I have a house with a yard. \n\nAnswer my question though, as you’re the one calling for the mass murder of dogs based a crime that an overwhelming minority of their breed has committed. You won’t because you see the hypocrisy of you stand by your original claim and say no to my question. \n\nMost are peaceful, lovable pets that have no desire for violence. I’m not saying they don’t have the capacity for it, but at that rate you should be calling to ban Rottweilers, German Shepards, cane corsos, etc. I just think that’s dumb, and not a call for the government to make", "label": 1}
{"text": "would,", "label": 1}
{"text": "For real 😂", "label": 1}
{"text": "Had to look at what sub I was in...", "label": 1}
{"text": "Ouch! well I guess it's a better clip than just a scare prank..", "label": 1}
{"text": "Something’s definitely off with this Santa, but… what could it be?", "label": 1}
{"text": "[Sauce](https://www.tiktok.com/t/ZTFvDjLKL/)", "label": 1}
{"text": "When you ask your cat for a little affection, but they misinterpret it as free buffet 🐱🍴", "label": 1}
{"text": "I’m just here for the memes and trying to avoid all forms of temptation... like peanut butter cups 🥜😂", "label": 1}
{"text": ">1. And it came to pass that in the days of tribulation among the Nephites, there appeared unto them an angel of the Lord, even an angel named Miles. And he was clad in robes white as the snow upon the mountains, and his voice was like unto a mighty rushing wind.\n\n>2. And Miles spake unto the people, saying: Behold, ye sons and daughters of Nephi, how long shall ye fear the armies of the Lamanites? For the Lord hath looked upon thy suffering and hath heard thy cries.\n\n>3. Therefore, thus saith the Lord, thy God, unto thee: Mount ye upon the tapirs which the Lord hath prepared for thy deliverance, for in the strength of these beasts shall ye be mighty.\n\n>4. And ye shall ride forth in my name, and the Lamanites shall tremble, for never before have they beheld such a host.\n\n>5. And ye shall gird up your loins and go forth, riding upon the tapirs into the midst of battle; and I, the Lord, shall go before you and scatter your enemies.\n\n>6. And it came to pass that the Nephites did hearken unto the words of Miles, and they did gather up their strength, each man finding a tapir and mounting thereon.\n\n>7. And the women and children did look on with wonder, for it was a sight most curious to behold, even the mighty Nephites riding upon the backs of the tapirs.\n\n>8. And the Nephites did go forth, and the power of the Lord was upon them, and they did prevail against their enemies, for the Lamanites fled in fear and confusion.\n\n>9. Thus was the word of the Lord fulfilled, and Miles departed from among them, ascending once more into heaven. And the Nephites gave thanks unto the Lord for the victory, and they remembered the tapirs all the days of their lives.", "label": 1}
{"text": "Retaliate with a \"Queen's Gambit\" printout, then act like it's casual decor.", "label": 1}
{"text": "Tech consultants are often more effective when they focus on delivering real expertise.", "label": 1}
{"text": "Tip?!? I gave her the whole thing!", "label": 1}
{"text": "Oh, I hate this. But also where do I get one?", "label": 1}
{"text": "the kid be like i'll be pranking my dad cause he's busy playing on his phone lol", "label": 1}
{"text": "He does hahah", "label": 1}
{"text": "This isn't true. While there isn't a true-fault-transfer, contracts can only do so much. If your consulting firm or \"subcontractor\" provides you with information that leads to injury... that is liability.\n\nEntirely depends on the issue. We are not talking about people  disliking a PowerPoint. Unless that PowerPoint displays and accidental pornographic image where children are present.\n\nIf you provide professional recommendations based on expertise as consultants do, you may carry liability. It's why almost every company that consults carries liability insurance. And they require at least 50-75% of their employees every year to attend an insurance training seminar about liability. The seminars usually are from the insurance company, and talk about e-mails, communication, communicating properly when giving technical advice. I have been through many of them. Through many different companies. I'm not sure you know what you are talking about.", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "More like 4:20 adventures", "label": 1}
{"text": "Hoe do you even enjoy your food eating this slow, wth", "label": 1}
{"text": "What a save for him", "label": 1}
{"text": "Playing any dice game with the pigeons is not allowed", "label": 1}
{"text": "funny", "label": 1}
{"text": "never give up or you'll.....", "label": 1}
{"text": "what a day!!! i should not thinking about today do you?", "label": 1}
{"text": "i feel like me and that billboard have things in common", "label": 1}
{"text": "if they were to explain the things in school like this, id be very smart", "label": 1}
{"text": "I'm not sure if I'm more hungry or confused", "label": 1}
{"text": "🫢", "label": 1}
{"text": "Lmao, why am I hearing 'Twerk It Like Miley' with this pup’s moves?", "label": 1}
{"text": "They are thongs, not slippers worn by a 90 year old 🤣", "label": 1}
{"text": "Squirrels in my pants?", "label": 1}
{"text": "Brings back childhood memories.", "label": 1}
{"text": "Pool water", "label": 1}
{"text": "Top 10 anime betrayals", "label": 1}
{"text": "Even he’s probably confused about why he’s everywhere you look", "label": 1}
{"text": "Now that’s a negotiation I can get behind! 😆 Just promise there’s no anchovies", "label": 1}
{"text": "Amazing work. You could have coated it in blood lol", "label": 1}
{"text": "its not a bug, it's a feature", "label": 1}
{"text": "I'm not sure if this is a pun or a dad joke, nut I'm laughing. Bone-afide humor lol", "label": 1}
{"text": "With a few drinks in my blood 😄😄", "label": 1}
{"text": "This is why you should always use a private browsing window, lol", "label": 1}
{"text": "😂🤣😂", "label": 1}
{"text": "I guess the Bless this home was too mainstream", "label": 1}
{"text": "Keep the seasoning for the popcorn, not the pigeons.", "label": 1}
{"text": "Also the belly flop might have been painful.", "label": 1}
{"text": "Bro must have had his confidence at 101% to do that Lmao", "label": 1}
{"text": "The cornies", "label": 1}
{"text": "haha, that's so acurate", "label": 1}
{"text": "Gotta keep that prostate healthy!", "label": 1}
{"text": "\"better watch out cause hes carrying a knife\" 💀💀", "label": 1}
{"text": "Heartwarming, lucky to have these co-workers", "label": 1}
{"text": "Bro is about to observe civil war part 2", "label": 1}
{"text": "You intended to post on r/tiredrecycledjoke", "label": 1}
{"text": "Your folders are empty. All took no memes.", "label": 1}
{"text": "Sir this is Reddit.  Not taking a strongly pro-Kamala position is the same as being a Nazi.", "label": 1}
{"text": "My Trump-winning memes are spicier than a ghost pepper.", "label": 1}
{"text": "Potato alarm activated! Lol", "label": 1}
{"text": "no its happy birtday from now on", "label": 1}
{"text": "Doesn’t even need a second coat.", "label": 1}
{"text": "So funny", "label": 1}
{"text": "Guess he nailed the 'blend in' look", "label": 1}
{"text": "He’s officially part of the crew now, forever...", "label": 1}
{"text": "This is the kind of woodcarving I can get behind, no wonder they always say “it’s all in the details!” Looks like a masterpiece in progress. <3", "label": 1}
{"text": "This is brilliant! Ginger cats really are elite", "label": 1}
{"text": "So random😂 where is this??", "label": 1}
{"text": "hope she doesn’t mind a bit of a 'rough ride'!", "label": 1}
{"text": "Well that’s one way to keep the ship on course", "label": 1}
{"text": "It's going to save the world", "label": 1}
{"text": "I think you guys need the whole pharmacy! hahah  \nBut I gotta say the art job was amazing!!", "label": 1}
{"text": "Before even looking at the comments I told myself I NEED to get this for my gay friend.  He'd fucking love it!", "label": 1}
{"text": "Man, congrats on that awesome email! Hey, I've been using Hello Dexter to make my outreach super smooth and it's been a game changer. Might help you keep that momentum going!", "label": 1}
{"text": "10/10 for effort, -2 for execution! HAHAHA", "label": 1}
{"text": "What a great escape!", "label": 1}
{"text": "He made a promise. He better keep it", "label": 1}
{"text": "One less dumb ass in the world", "label": 1}
{"text": "Better start drinking", "label": 1}
{"text": "Cheers", "label": 1}
{"text": "Follow through. Cheers!", "label": 1}
{"text": "Bye bye", "label": 1}
{"text": "Please stream", "label": 1}
{"text": "Put your money where your mouth is!", "label": 1}
{"text": "Chug! Chug! Chug! Chug!", "label": 1}
{"text": "You didn’t do it did you? See? THAT is what people are tired of. Dramatic, unrealistic, bullshit TALK. No action. Just talk, talk, talk. Hopefully Kamala disappears forever.", "label": 1}
{"text": "Enjoy", "label": 1}
{"text": "It did XD.\n\nNow - bottom's up, buckerry.", "label": 1}
{"text": "Bon appetit!", "label": 1}
{"text": "Might join you. Draino sounds delicious.", "label": 1}
{"text": "[called it](https://www.reddit.com/r/MarkMyWords/s/jCQw1cPP4A)", "label": 1}
{"text": "So funny xDD", "label": 1}
{"text": "Drink up!!!   😆 Fuck ya!!  TRUMP!!! 👊🏻", "label": 1}
{"text": "Chug-a-lug", "label": 1}
{"text": "Drink up!", "label": 1}
{"text": "Drink up dipshit", "label": 1}
{"text": "Just do us all a favor and keep your promise.", "label": 1}
{"text": "Well, start chugging. ", "label": 1}
{"text": "Well kamala arsehole is the worse out of the 2", "label": 1}
{"text": "Use the drano to flush all the sh*t called the liberal left communist socialist nazi democrat party F the communist leftist liberal democrats", "label": 1}
{"text": "Why? So pussies like you would have one less person that could kick your ass? Key board warriors lol", "label": 1}
{"text": "The second best thing about this evening is that cackling Küntmala's political career is over. It will be fantastic to see Ms Thing have to certify the very election that kicked her own @$$. Maybe her and Hillary can start a support group for each other.", "label": 1}
{"text": "Drink up", "label": 1}
{"text": "ENJOY!!!!!", "label": 1}
{"text": "Take you a big old drink lol.", "label": 1}
{"text": "May God rest your soul #TrumpVance2024", "label": 1}
{"text": "Looks like German sausages)", "label": 1}
{"text": "What is this? ( I say this embarrassed since you posted as if I’d understand ) please don’t downvote me for asking!! Forgive my ignorance!!", "label": 1}
{"text": "Vader really let himself go", "label": 1}
{"text": "Glad you're out. This card is kidney-stone cold awesome.", "label": 1}
{"text": "lol", "label": 1}
{"text": "What on earth!?", "label": 1}
{"text": "Dude was scared, what was he trying to say😂", "label": 1}
{"text": "Reminds me if that once sentence above the gates of that one specific camp…", "label": 1}
{"text": "He's better at dancing than 50% of the earth's population", "label": 1}
{"text": "Happy birthday to your little cutie there,  that cake is so pretty.. <3", "label": 1}
{"text": "His name is chug for a reason", "label": 1}
{"text": "LOL if only we can skip intro like ads it would have saved me from feeling anxious every self introduction", "label": 1}
{"text": "He really said that", "label": 1}
{"text": "that one dude with social anxiety lol", "label": 1}
{"text": "maybe it's artificial", "label": 1}
{"text": "Fascism? I thought Ukrain was being fascist when they were killing russian women and children and burnt the cinema with people, but I guess for YOU it is ok, but standing up for your people is fascism", "label": 1}
{"text": "What a cover letter.. the company got checkmated.", "label": 1}
{"text": "He is a man of focus, commitment and sheer fucking will. I bet he's also responsible for what happened. I'd hire him just to be safe.", "label": 1}
{"text": "(bug) : I wish I could stay here in earth for a long long time. \n\n( painter):  I got you!", "label": 1}
{"text": "This pumpkin just unironically discovered the dark side… of the treats.", "label": 1}
{"text": "I can't believe I’m getting recipe tips from a sign that’s clearly got its head in the punquam! That's bone-afide humor right there!", "label": 1}
{"text": "This application truly took “robbing job eligibility” to a whole new level. Honestly, it sounds like the only thing life is missing is a sequel! Can’t wait to see how they spin the next chapter.", "label": 1}
{"text": "It worked for Thurman Merman.", "label": 1}
{"text": "The fact that he attended the funeral to keep an eye, shows his detective side HAHA", "label": 1}
{"text": "I've seen better acting in porn", "label": 1}
{"text": "I should show that to my colleagues, Im tired of stupid meetings", "label": 1}
{"text": "Hope you still have fingers", "label": 1}
{"text": "To be fair I've seen individuals being sold at family dollar and gas stations by the register, but you deserve a ferrero rocher fountain baby. You worth it.", "label": 1}
{"text": "Only way this is funny is if you’re 12.", "label": 1}
{"text": "I need a gold coin for that..", "label": 1}
{"text": "new pride month gift idea just dropped", "label": 1}
{"text": "new pride month gift idea just dropped", "label": 1}
{"text": "actually surprised they didnt play dead", "label": 1}
{"text": "this feels like a threat", "label": 1}
{"text": "\\*Mariah Carey enters the chat", "label": 1}
{"text": "nice", "label": 1}
{"text": "Interesting  what happened to him afterwards ?", "label": 1}
{"text": "Cat a bit see the cake as cake facing camera not cake , doesn't smell interesting for the cat either is it an actual cat cake tuna , pumpkin seeds chicken egg , I would say no .Funny no .", "label": 1}
{"text": "That's like finding a pokemon shiny", "label": 1}
{"text": "that's some bold marketing lol", "label": 1}
{"text": "I fucking hate kids i wish i could slit their throats", "label": 1}
{"text": "kick out your husband for cheating on you", "label": 1}
{"text": "Well, guess my blood sugar just decided to take a little vacation…", "label": 1}
{"text": "Must've been the brownie edibles", "label": 1}
{"text": "A special place in hell just for accidentally merging layers.", "label": 1}
{"text": "No intro, No problem", "label": 1}
{"text": "where can I buy this? I will buy it all. My brother in law would love this!", "label": 1}
{"text": "I'm sorry, but this is not exactly how all humans work. For example, I live with one who almost never hears the first thing someone says and because we are in Sweden, the equivalent is more like \"what did you say?\" which is absolutely not considered rude here. In fact it could be rude to use such a long string of un-necessary words like as in your example, between close friends or at home. \n\nAs far as it goes for me - sometimes I am not listening because, well, so many reasons. So - if someone just starts talking to me without checking to see if I am paying attention, and then gets pissy because I did not hear them the first time, they can piss off.", "label": 1}
{"text": "Sign up for the dabble app and use my link. You’ll receive a FREE $25 when you join !! Try it out! \nPANTHER94\nhttps://click.dabble.com/GaFA/wxe4l7kf", "label": 1}
{"text": "He was probably embarrassed", "label": 1}
{"text": "I'm already cringing and I haven't even heard what he said yet", "label": 1}
{"text": "If only we could", "label": 1}
{"text": "Digital artists draw hell, but where's the undo button?", "label": 1}
{"text": "The pressure to create something perfect can be paralyzing...", "label": 1}
{"text": "Introverts, lol", "label": 1}
{"text": "Well at least aliens are honest about our collective shortcomings, lol", "label": 1}
{"text": "I always laugh at people who take a day off work to accept a delivery or wait for a service call.  Like you’re dumb and it’s funny.", "label": 1}
{"text": "play to a click track/metronome when rehearsing/performing\n\ngive yourself the control that all drummers, from the dawn of time, were meant to withhold😈😈😈\n\nReally though, all I have in my In Ears is a metronome, a backing track, and maybe my kit bleeding through. I cannot hear jack shit what's going on around me😂 I just perform the song, keep time, and it's on everyone else to listen to my drums and stay on time and do their part😂\n\n\"I HAVE THE METRONOME. PLAY TO ME. LOOK AT ME. I'M THE CAPTAIN NOW\"", "label": 1}
{"text": "Gatekeeping Italian food is like 80% of their cultural export. Italian men are like autistic kids who will only eat tendies and kraft dinner, except with pasta and red sauce.", "label": 1}
{"text": "Cartoonishly hilarious. lol", "label": 1}
{"text": "Banana-Flags?😅", "label": 1}
{"text": "This guy just knew that the tambourine was the real star of the show", "label": 1}
{"text": "I don't think it looks like one, but it's some super cool stuff", "label": 1}
{"text": "No it's not. I'm not arguing that someone who creates art with AI is an artist.  \nTHAT would be that argument.\n\nGo ahead, look back. The articles, as written, still exist, and some of them are online. Early 80's into the 90's and 2000's. They decry digital art as \"not art\" and call digital artists hacks and pretenders. More recently, even today, artists argue that using a lot of the tools available digitally is \"cheating.\" \n\nLook further back, and you'll find the same arguments against photography.\n\nI'm pointing out the evolution of what is considered art, and who is considered an artist, is subjective to the time, and those decrying the current technology would be exactly who was subject to harsh criticism in the past.", "label": 1}
{"text": "[https://www.youtube.com/@KotteAnimation](https://www.youtube.com/@KotteAnimation)\n\nLiterally the funniest animations on all of Youtube.", "label": 1}
{"text": "I thought its beard hahaahaha", "label": 1}
{"text": "Pi-Fi ,This is a new tech era for sure 😅😅💔", "label": 1}
{"text": "Hahahha notice it too", "label": 1}
{"text": "Yes probably", "label": 1}
{"text": "too much interference, can't get much signal for pineapple.", "label": 1}
{"text": "I’ve stayed home on purpose to accept a delivery,, only to find a card in the letterbox saying they tried.. WTF.?", "label": 1}
{"text": "\"Don't tell ne I didn't warn you\"", "label": 1}
{"text": "sorry for following you from in front", "label": 1}
{"text": "in what world are those slippers? They are thongs mate!", "label": 1}
{"text": "r/Damnthatsinteresting", "label": 1}
{"text": "I'd love to make friends and laugh too, I like to laugh", "label": 1}
{"text": "Damm you a joker Lol.", "label": 1}
{"text": "I sent a", "label": 1}
{"text": "will that soup makes my face less aging?", "label": 1}
{"text": "thats cool", "label": 1}
{"text": "horse could tell there is an impostor", "label": 1}
{"text": "Snow Jelly is a fungus", "label": 1}
{"text": "niyahahah, pease share here if u found out that date:)", "label": 1}
{"text": "Hope you like complex equations and existential dread.", "label": 1}
{"text": "I once had to use a video of FedEx rolling a 50in flat screen tv end over end up my 20ft driveway and flight of stairs to file a complaint because Fedex refused to honor the shipping insurance because the ferry picture showed an 'undamaged' box.\n\nYeah.... It was rolled along the edge... The front of the box never touched the ground.\n\n\nThe stand had gouged dozens of grooves in the screen and until they had a video of the FedEx driver rolling three tv from the truck to my porch flat out devoted that it was damage in shipping.", "label": 1}
{"text": "Just enjoying while they can..", "label": 1}
{"text": "how do u teach a cat to smile like that? it's sooo cutee", "label": 1}
{"text": "Yeah, but that's because you grew up with real dancing and Michal Jackson.", "label": 1}
{"text": "that’s a cute smile… with a side of danger haha", "label": 1}
{"text": "sooo sweet!!!", "label": 1}
{"text": "this is behind the scenes of the uptown funk music video", "label": 1}
{"text": "haha, i love the way this doggo lean on:) what a sweet gesture..", "label": 1}
{"text": "You're not even close. I just listened to good music and make Future Funk.\n\n\n\nI Don't get my music from bullshit TikTok videos.", "label": 1}
{"text": "It's perfect because you have brain rot? And not everyone watches tik Tok like you do?", "label": 1}
{"text": "Your mother was proud, too", "label": 1}
{"text": ">You have captured the essence of \"Boomerness.\"\n\n\nMy dude. There's nothing boomer about stating literal facts. Michael Jackson is in the dance hall of fame for a fucking reason dummy. You sure as hell didn't grow up with any Legends apparently in the Hall of Fame. \n\n\nI'm sorry you feel the need to call people Boomer because you're weird ass feelings got hurt by words on Reddit. \n\n\nYou seem like the the kind of kid who can barely fucking talk or have a conversation in public. That's why you fail all your job applications And people like me don't hire you. Lol", "label": 1}
{"text": ">Yea so I’m 27,\n\nFucking Boomer. You're only two years younger than me and I'm 29. \n\n\n\n> was a nice try, but just take the L and move on my guy\n\nYou even talk like a fucking loser. I hope you don't write that way on job applications.\n\n>Music and dance change with time bud, you simultaneously sound very old and very immature.\n\nMusic and dance are timeless, That's exactly why BTS and weird ass Korean boy bands are getting popular because there's no longer any '90s boy bands in America. \n\nI'm not the one who invented this situation dude, I'm just not fucking stupid and understand it.", "label": 1}
{"text": ">You sound like a really fun person to be around.\n\n\nApparently,  because I actually get invited to hang out with people or have them Come over to my apartment to chill with me and my wife. \n\n>You must kill at parties.\n\nYou still go to fucking parties like a loser?  Do not already have friends of your own to hang out with?", "label": 1}
{"text": ">Jesus Christ man I was just making some menial japes man\n\n\nYou were making menial Japanese men?? Stop talking like a fucking loser and use actual words in the dictionary my dude. \n\n\n\n\n\n>I didn’t expect for you to get so heated lol.\n\n\nOh no my friend, Don't misinterpret me slam dunking on you as anger. I simply think all stupid people deserve to be slam dunked on and put in their place. We should all bully the shit out of stupid people because you have the knowledge of all human history at the tip of your fingers. You can literally Google before you speak. Being stupid is a choice in today's day and age. \n\n\n>I’m not sure if you’re aware, but people in their 20s and 30s have parties.\n\nI'm not sure if you're aware but people in their 20s and 30s have a real fucking jobs and a life of their own. I don't have parties because Everyone I know can actually afford to go do something fun. We're not poor and partying in our parents house like you. \n\n\n>The fact that you didn’t know that is actually quite telling\n\nThe fact you think \"partying\" is an adult thing is very telling. None of your friends have real jobs or have to work in the morning. Get lost kid.", "label": 1}
{"text": "Is that kid on the spectrum or....", "label": 1}
{"text": "Bumper sticker? I hardly know her", "label": 1}
{"text": ">The only one crying here is you\n\n\n\nYou literally got your weird ass feelings hurt because I said O.P grew up with legendary music that's factually in the Hall of Fame. \n\n\n\nGo fucking cry about it weirdo.", "label": 1}
