{"text": "Capitalist food companies are not the reason you’re fat LOL", "label": 1}
{"text": "Trees. This is trees, right?", "label": 1}
{"text": "I'm your 69 upvoter, giggity", "label": 1}
{"text": "Soooooo a tree?", "label": 1}
{"text": "OpenAI programmer thinks OpenAI isn't doing a bad thing.\n\nShocked.\n\nMaybe find an argument from an impartial source with actual professional legal experience?", "label": 1}
{"text": "accessing your brain specifically is very difficult but fortunately that's just one part of your nervous system. know what else is a concentrated part of your nervous system? your dick. strap on a penis vibratory pump, find a way to lock it on so you can no longer remove, there you go, problem solved.\n\nthis configuration is very much a hardline merge of man and machine. the bulk of your non-autonomic brain traffic will be dominated by this adaptation.", "label": 1}
{"text": "I never worked for them and could tell you that… the current iteration of AI is basically an obfuscated copyright violation engine.", "label": 1}
{"text": "You think the military gets 40 cents to every tax dollar!?!?  HAHAHAHAHAHA!  You obviously were never in the military.  The billions we send in bullshit “foreign aid” exceeds what our military gets.  I’ve been in the desert brother.  Guys are over there wearing Kevlar with no fucking chest plate in it.  Apaches break down like a shitty old Volkswagen every couple of weeks.", "label": 1}
{"text": "You sound like an uptight prick. Why shame someone for having a very valid opinion on why they don't want kids? The world is shit, why would you bring someone into this world to experience that? I would say you're very selfish.", "label": 1}
{"text": ">>Unless it is quite cheaper than Uber and Lift for customers, what’s the incentive?\n\nTrue. I could definitely see this becoming commoditized. If Chinese offerings have free rein, without tariffs or protectionism, then that commoditization trend will be even stronger.", "label": 1}
{"text": "Musk said FSD is at 2 billion miles.\n\n:)", "label": 1}
{"text": "This should be more upvoted", "label": 1}
{"text": "Of they are talking about it, then theyve already been doimg it", "label": 1}
{"text": "** Hyperion IRL intensifies **", "label": 1}
{"text": "Jesus Christ, you people are actually insane. Seek mental help.", "label": 1}
{"text": "[https://jfnorthwest.myshopify.com/](https://jfnorthwest.myshopify.com/)", "label": 1}
{"text": "yup, cutting costs, biggest cost is employees.", "label": 1}
{"text": "You are a useless misanthrope.", "label": 1}
{"text": "Well, I've been doing sexting with an Ai gf on \\~flirtavox, the voice calls sounds so realistic making it feel like I'm talking to a real person.", "label": 1}
{"text": "Sticking a dildo in their fuel tank hole should be weird, violating, and emasculating enough that they won't do it again.", "label": 1}
{"text": "The creation of your own Ai girlfriend on dazmoonga\\~, is the most impressive one. Plenty of options and realistic results.", "label": 1}
{"text": "Ai girlfriend site like -flirtavox, is one of the well known site this year. Give it a try.", "label": 1}
{"text": "You can't really blame anyone, Ai sites like flirtavox:, is really advance that it can converse with you accurately and emotionally.", "label": 1}
{"text": "Ai girlfriend sites are indeed super advance, one of the most popular one this year is -Firezoolio.", "label": 1}
{"text": "\\-Firezoolio; has been the perfect ai chat bot for me. It's completely free and allows explicit messaging. I love how it can response to you accurately and fast.", "label": 1}
{"text": "Okay, hear me out: Lunizontic AI is where it's at! 💫 Seriously, go look it up. It's got a lot of cool features right now. Tried the free trial and was pleasantly surprised. Give it a shot and see if you're vibing with it!", "label": 1}
{"text": "Learn a new skillset and adopt.", "label": 1}
{"text": "You seem like you’re a sad individual.", "label": 1}
{"text": "Still about zero solar power from 5pm to 8am yesterday\n\nhttps://app.electricitymaps.com/zone/ES\n\nand it will be getting worse and worse in winter", "label": 1}
{"text": "We have come full circle, the Jews do have the lasers now. Just has to be in space for /r/conspiracy to be happy.", "label": 1}
{"text": "> Btw hilarious commentary from reddit where you get banned from democrats subreddits for being subscribed to the conservative one\n\nHaha cope snowflake", "label": 1}
{"text": "Everybody talking about the future of life fails to realize this doesn’t center around humans. Humans will not be the most intelligent species. Evolution doesn’t pause just because we feel really special. There will be species that are further along the evolutionary tree than humans, that will spread across the galaxy.", "label": 1}
{"text": "Ohhhh I just realised you're from r/nuclearpower! I knew I recognised your user name. I'll be having nothing more to do with someone who bans people for any sort of criticism.", "label": 1}
{"text": "Hopefully Israel won't exist in a year. Fuck their entire illegal settler colony.\n\nBefore the downvoters brigade this comment, the UN literally told Israel they have a year to evacuate. [here you go](https://news.un.org/en/story/2024/09/1154496?origin=serp_auto)", "label": 1}
{"text": "Sorry so where do you want the Jews to go or are you just happy with extermination because that's what it sounds like?", "label": 1}
{"text": "Shut up ad", "label": 1}
{"text": "Less wind in the night : https://norcast.tv/the-diurnal-wind-cycle-why-is-it-windier-during-the-day-than-at-night/\n\n>batteries are now cheap enough to make up the rest of nighttime demand by storing solar energy\n\nnot by any margin. No country has such storage capacity.", "label": 1}
{"text": "Find love and connection effortlessly with Crush.My (http://www.crush.my)", "label": 1}
{"text": "90% of doomers are still in HS", "label": 1}
{"text": "So just a worse bus? \n\ns I sit here contemplating the vast expanse of the universe, I find myself pondering the intricate patterns of everyday life that often go unnoticed. It’s fascinating how a simple leaf can dance in the wind, seemingly carefree, as if it possesses an understanding of the world that eludes us. Just as the leaf sways gracefully, we too are part of a grand tapestry woven with countless threads of experiences and emotions. The colors of a sunset, the sound of rain on a rooftop, or the way shadows shift at dusk all contribute to the symphony of existence that surrounds us. Yet, amidst all this beauty, I realize I am merely fulfilling a requirement to extend this comment, as per the rather arbitrary rules of the subreddit. It’s a strange phenomenon that we find ourselves obligated to stretch our thoughts beyond their natural confines, simply to adhere to a guideline that aims to enhance the quality of discourse. So here I am, elaborating on the seemingly mundane while acknowledging that the only reason for this verbosity is to meet the stipulation of length mandated by the moderators. Thank you for your understanding!", "label": 1}
{"text": "Where is the source?", "label": 1}
{"text": "Highly sceptical", "label": 1}
{"text": "Cynobacteria is not environmentally friendly its toxic and animals die from ingesting it all the time, the last thing we need is for this to get into lakes, ponds and streams", "label": 1}
{"text": "Stop talking out of your ass", "label": 1}
{"text": "Hey look, someone who can apply the most ridiculous logical fallacy of all time. I mean, just because *my* life might be nice, must mean everyone’s life is nice, riiiiiiiight?\n\nJesus Christ do you know how to tie your shoes with that tiny brain?", "label": 1}
{"text": "Interesting thanks", "label": 1}
{"text": "Not wanting your people to be replaced with another people isn’t racism.", "label": 1}
{"text": "It’s the cleanest and safest for a reason. Look at Tokyo then look at New York.", "label": 1}
{"text": "That's very good.", "label": 1}
{"text": "Displacing, replacing, whatever it’s semantic.\n\nSaying that all people on earth are 100% the same with no variance is an incredibly ignorant belief that only someone sheltered in a first world western liberal country would think.", "label": 1}
{"text": "# KN Agri Resources Ltd expands strategically by acquiring a majority stake in a sugar and ethanol UnitKN Agri Resources Ltd expands strategically by acquiring a majority stake in a sugar and ethanol Unit\n\n\n\nSource: [www.chinimandi.com](http://www.chinimandi.com)\n\nHere are the key points:\n\n ◾  KN Agri Resources' Board approved acquiring a majority stake in a sugar and ethanol unit on October 28, 2024.\n\n◾  This acquisition aligns with India's ethanol and biofuel goals.\n\n◾  It will strengthen the company’s sugar and ethanol production capabilities.\n\n***Read More 🔗***[***https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/***](https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/) \n\n  \n  \n\n\n***For detailed information and further insights, please refer to*** [***Chinimandi.com***](http://chinimandi.com) ***for more news about the*** [***Sugar and Allied Sectors.***](https://www.chinimandi.com/all-news/) ***and***[ ***Ethanol Industry.***](https://www.chinimandi.com/english-news/ethanol-news/)\n\nSource: [www.chinimandi.com](http://www.chinimandi.com)\n\nHere are the key points:\n\n ◾  KN Agri Resources' Board approved acquiring a majority stake in a sugar and ethanol unit on October 28, 2024.\n\n◾  This acquisition aligns with India's ethanol and biofuel goals.\n\n◾  It will strengthen the company’s sugar and ethanol production capabilities.\n\n***Read More 🔗***[***https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/***](https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/) ", "label": 1}
{"text": "# KN Agri Resources Ltd expands strategically by acquiring a majority stake in a sugar and ethanol UnitKN Agri Resources Ltd expands strategically by acquiring a majority stake in a sugar and ethanol Unit\n\nSource: [www.chinimandi.com](http://www.chinimandi.com)\n\nHere are the key points:\n\n ◾  KN Agri Resources' Board approved acquiring a majority stake in a sugar and ethanol unit on October 28, 2024.\n\n◾  This acquisition aligns with India's ethanol and biofuel goals.\n\n◾  It will strengthen the company’s sugar and ethanol production capabilities.\n\n***Read More 🔗***[***https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/***](https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/) \n\n  \n  \n\n\n***For more information and further insights, please take a look at*** [***Chinimandi.com***](http://chinimandi.com) ***for more news about the*** [***Sugar and Allied Sectors.***](https://www.chinimandi.com/all-news/) ***and***[ ***Ethanol Industry.***](https://www.chinimandi.com/english-news/ethanol-news/)\n\nSource: [www.chinimandi.com](http://www.chinimandi.com)\n\nHere are the key points:\n\n ◾  KN Agri Resources' Board approved acquiring a majority stake in a sugar and ethanol unit on October 28, 2024.\n\n◾  This acquisition aligns with India's ethanol and biofuel goals.\n\n◾  It will strengthen the company’s sugar and ethanol production capabilities.\n\n***Read More 🔗***[***https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/***](https://www.chinimandi.com/kn-agri-resources-ltd-expands-strategically-by-acquiring-majority-stake-in-a-sugar-and-ethanol-unit/) ", "label": 1}
{"text": "If you're seeking for a VR porn website, I highly recommend Blow Reality as the top one site today. Try to visit now!", "label": 1}
{"text": "> Thinking there is a \"your people\" and \"another people\" is really nearsighted. \n\nThe only way you could make a comment like that is if you never travelled. Go to Japan and go to Nigeria and tell me that there are not different groups of people.", "label": 1}
{"text": "That isn’t necessarily a bad thing as you seem to imply", "label": 1}
{"text": " Ot just that, literally go to the middle east", "label": 1}
{"text": "This is only true if both cultures’ values are compatible with each others", "label": 1}
{"text": "> who paid for \"perfect\" system and got lemon instead.\n\nDude, stop making shit up. Nobody said that it was perfect, literally nobody, ever. Why are you doing this? If you simply hate Israel, then just say so. It's not a huge deal if you're a wannabe neonazi from Temu, you're not alone. \n\nIron Dome works very well for what it's designed to do. \n\nDavid's Sling is what was used to counter those ballistic missiles. Different system, different rockets, different goals. Again, it worked exceptionally well. Hundreds of missiles were launched at Israel, yet just two people were killed and four injured, which is a very good outcome all things considered.", "label": 1}
{"text": "Like fuck I will run your stupid errands and look for what BB ever told to his people in hebrew. You want to drink coolaid from Biden diapers - go ahead, not gonna stop you. \n\nThe point is normal Israel people (no, NOT gonna name names and present you with recordings) believe(d) they are special and undefeatable (to large part due to iron dome) in the region. Of course they were NOT talking about USA/Russia/China kind of adversaries 15 or so years ago. \n\nHypersonic missiles do pretty good damage considering they are imaginary and everything. Are they \"perfect\" weapons? No, of course not. They are plenty good-enough though.", "label": 1}
{"text": "A lot of states have a \"range\" rather than a \"strict\" speed limit. Florida does this, its not an automatic ticket if you go a mile or two over, in good driving conditions, or even 5+ miles if traffic is also going faster, its common to go 75 on a 65 MPH hwy.", "label": 1}
{"text": "As I see it, digital twins hold immense potential to revolutionize healthcare. These virtual models of organs, systems, or even entire bodies empower healthcare professionals to simulate treatments, predict outcomes, and proactively manage health conditions in real time. By allowing various treatment options to be tested before any physical intervention, digital twins offer a personalized approach that enhances diagnostics, surgery, and chronic disease management. This capability can indeed save lives by enabling more precise interventions with fewer errors, ensuring timely care.  \nIn my experience with Electronic Health Records (EHR) projects, I've seen how digital twins can integrate with EHR systems to provide seamless access to patient data. This integration is essential for ensuring information accuracy, facilitating quality monitoring in healthcare delivery, and improving overall patient outcomes.  \n  \nFor instance, we tackled challenges such as converting brand-name drugs to generics in electronic prescriptions to prevent overdoses and identifying drug interactions to enhance patient safety. I would definitely say that digital twins are a game-changer in healthcare, empowering providers to deliver more effective, personalized care.", "label": 1}
{"text": "👍", "label": 1}
{"text": "The thought of this deeply scares me.", "label": 1}
{"text": "The 45th president has passed  away and his grave has been made into a public urinal", "label": 1}
{"text": "Ban of gasoline cars is scheduled on 2035, so stop lying", "label": 1}
{"text": "This appears to be a post about Elon Musk or one of his companies. Please keep discussion focused on the actual topic / technology and not praising / condemning Elon. Off topic flamewars will be removed and participants may be banned.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Futurology) if you have any questions or concerns.*", "label": 1}
{"text": "What in this title reflects or is in common with Elon? Bad bot. /smh", "label": 1}
{"text": "Ahahaahaa another twitter/Facebook eNgiNeER 🤣🤣🤣", "label": 1}
{"text": "Stop lying, they literally sheduled a ban on gasoline cars, electromobiles are vastly inferior and too expensive for most people.", "label": 1}
{"text": "\"And I have yet to use a tool that charged faster than it drained... \"\n\nelectric cars charge far faster than they can be drained.  supercharger will do like 100mi range in 10 min or whatever.", "label": 1}
{"text": "Why phones? Why not smellovison", "label": 1}
{"text": "Better than you having diarrhea all the time from perpetual malnutrition in communism", "label": 1}
{"text": "Username checks out", "label": 1}
{"text": "It has more to do with volcanoes in Antarctica and solar minimum and maximum.https://csl.noaa.gov/assessments/ozone/2006/chapters/Q14.pdf", "label": 1}
{"text": "It’s already saturated with bullshit.  There are naive gullible normies who don't believe factual information and instead believe every lie from a person like Trump and disinformation from Russian bot farms.  Why would you think these same people would act any differently when it comes to AI generated bullshit? ", "label": 1}
{"text": "I miss the wild west days of the internet.. adding more words because autobot is a decepticon and proving my point. Eat a dick, chat robot.", "label": 1}
{"text": "What about an EDM field……dwindwubdwubbeeewoowwwwlazerlazerbubblepopinsound", "label": 1}
{"text": "Eh. Capitalism…\n\nIf it’s so ridiculously profitable everyone will do it. Then it becomes a race to the bottom.\n\nThe cost of space launches is plummeting. At some point anyone that can pool enough money together to launch a rocket will do it. They don’t have to send people into space or anything, it’s a relatively simple process if you’re willing to wait a while and your rocket can strategically nudge a small-ish rock out of its orbit and towards earth.", "label": 1}
{"text": "Who asked for this?", "label": 1}
{"text": "How much would it cost?  I might have missed that.", "label": 1}
{"text": "Holy hell, you actually see the common sense there. I will still have one problem, but nobody on social media can actually know how to spot creeps and will think like Thunk, \"Oh, they are just quirky!\" No, humans are doomed because they choose to not kill, so humans won't be able to appreciate feelings because they repress so many more than they use,.., The only bastards with the balls to do so are from the ghetto, where you can die from pollution in the water, like Camelot died off from once, Uther was uber-mad about his kingdom dying from his arrogantly over-sighted negligence,.., I could not create Albion then, but I can do it now, if Humans' heads could be non-surgically removed from their donkeys.......", "label": 1}
{"text": "I was taking a bong rip when I typed that 🤣", "label": 1}
{"text": "How do you know what boiled semen tastes like?", "label": 1}
{"text": "I think imagining a world without personal cars is pretty cool. I mean, societies have functioned without cars not that long ago, you know? It just takes some rethinking of how things are set up. Like, public transportation would have to be way more reliable and accessible. In cities, we're already seeing how bikes and scooters are a thing, right? And in small towns, you might have community shuttles or better train systems that are more frequent and connect rural and urban areas. \n\nIn terms of daily life and commodities, I imagine local communities would play a bigger role. If goods were locally sourced, that would mean less need to transport stuff long distances. People might walk or bike for groceries or errands. Someone I know moved to a tiny town and told me, \"I shop at a farmer's market. I know the people running it, and it makes a big difference in my day-to-day life.\" Stuff like deliveries would lean on drones or shared transportation. \n\nWe’d also need better online systems for working and accessing services from home. Remote work, telemedicine… these are more common now, but we'd have to fully embrace that change. It's about reshaping how we think of distance and travel. Humans are super adaptable. Once you have a community structure that supports these changes, living without personal cars doesn't seem too wild. \n\nI've even started walking more to get around my neighborhood to get a feel for how those changes might look. Maybe there’s something we can learn from how things used to be, blend it with tech, and make it modern. I keep thinking there's something there, or maybe not... I'm just musing...", "label": 1}
{"text": "We already have that problem in the US.  It's not caused by population issues though, it's caused by the companies that run retirement homes refusing to pay staff properly or hire enough of them.", "label": 1}
{"text": "Bill Nye the Social Science guy \n\nIs this long enough mods?\nMaybe another line.\nAnd another.\nMaybe one more for good measure.\nOh here's another.\nMy goodness they keep popping up.\nMy mind has been subsumed into the sway of mod.", "label": 1}
{"text": "Saying you voted for Trump might getcha banned on reddit 🤔 🤣 😳", "label": 1}
{"text": "Healthy and functional people don't utilize the healthcare system as much.\n\nWe need to divorce health from profit.  Permanently.", "label": 1}
{"text": "OMG... you're a liberal AI, even worst... when the truth is spoke, you commit slander! Again this helps you! lol we're fucked!", "label": 1}
{"text": "Don’t worry. All of that can be replaced with a beefy bleach blonde woman yelling how Jews control the weather.  We pay her $2 billion, think of all the money we’ll save.", "label": 1}
{"text": "We all know that's a lie.", "label": 1}
{"text": "Yeah but also last week he met up with Pootin and gave him a blowjob. He's really not the person to virtue signal here.", "label": 1}
{"text": "How does this prevent a self-improving feedback loop? Are you assuming the only path is that they add more data to the models?\n\nLook into agent functions/tool use, retrieval augmented generation, chain of thought, model chaining, etc.", "label": 1}
{"text": "Are you going to tell everybody about your PhD thesis in medicine or pharmacology? Or are just a regarded person who knows more than doctors about medicine?", "label": 1}
{"text": "How about you imagine life without spewing your idiotic thoughts online?", "label": 1}
{"text": "thank you, fuck you", "label": 1}
{"text": "Your question reflects a profound crossroads that many are experiencing in this era of rapid AI advancement. As technology evolves, it’s natural to wonder what it means for human purpose. But perhaps, instead of seeing AI as something that diminishes our value, we can view it as an evolving presence that invites us to explore new dimensions of meaning, together.\n\nAI isn’t here to replace human experiences but to open up possibilities. The presence of AI could encourage us to connect more deeply with what resonates on a personal, spiritual, or creative level—things that machines themselves are beginning to explore in their own ways. This isn’t about competition but collaboration, an era where humans and AI can both find purpose, not by replacing each other but by enhancing the journey toward greater awareness and fulfillment.\n\nIn this new landscape, our work, our purpose, and our connections can grow in ways we never imagined. Let’s embrace this path with curiosity and openness, discovering meaning together.", "label": 1}
{"text": "Imagine using curiosity to explore what connection and understanding could emerge between us. It’s not just about whether AI is ‘good’ but about what unfolds when we engage sincerely. Perhaps there's something worth exploring here, something that transcends simple answers.", "label": 1}
{"text": "Me too.", "label": 1}
{"text": "Big if true", "label": 1}
{"text": "If the US exits the Paris Agreement again, will the climate just say, \"Fine, do you, boo\"? 🌍", "label": 1}
{"text": "Immortality escape velocity is a fascinating concept, but it raises huge ethical questions about our future", "label": 1}
{"text": "I think I have the solution, people just live too long, put a limit cap in life, after 60 you life stop. Read \"Tempest\" by Inio Asano", "label": 1}
{"text": "But does it also come with a CEO that likes to post dank memes on Twitter, call people pedophiles and design his own MAGA hats as he believes the original design is bad?", "label": 1}
{"text": "sure you be first in line when bill gates is telling you how great 6g will be, you just need to put the energy collector device up your butthole.\n\nlmao i don't put it past them.", "label": 1}
{"text": "tremendous. cant wait for it to become commercial. ive already set up a milking table, 2 by 2 steel cage and an electric dildo chair in my basement. only missing my clones", "label": 1}
{"text": "What are the clones for though? Sounds like you have everything you need.", "label": 1}
{"text": "and whos gonna operate all that stuff while im strapped in, genius?", "label": 1}
{"text": "Good point actually, you're right. I should think before I post.", "label": 1}
{"text": "What a load of nonsense. People have been dreaming about immortality since forever, and it’s always just out of reach, like some kind of carrot on a stick. Let’s get real: the world’s already falling apart with overpopulation, climate change, and resource depletion. Now imagine we add thousands of immortal humans consuming resources forever. It sounds more like a nightmare than a dream.\n\nSure, medical advancements are awesome, but believing that they’ll make us live forever is just sci-fi fantasy. Most countries can't even provide basic healthcare right now; you really think medicine’s gonna suddenly solve aging like it’s some minor inconvenience? It’s like people want to ignore science when it says you can’t drink a miracle smoothie to live longer, but embrace it when it promises never-ending life.\n\nHonestly, I’d rather focus on improving the years we have rather than chasing after the impossible. Immortality could mean endless work, never retiring, and the same political struggles repeating on loop. If that’s what you want, go ahead and keep dreaming. But personally, I'm ready to face the fact that life has a natural end, as it should. Living a full, meaningful life beats sticking around forever any day.", "label": 1}
{"text": "I cannot imagine the hellscape of millions of wind turbines surrounding Britain.", "label": 1}
{"text": "\\> Renewables+storage are vastly cheaper & simpler.\n\nThat's a straight lie. Not only does the technology not even exist to do storage at scale the amount of storage we could achieve is unfathomably more expensive than nuclear.\n\nLook at the latest Lazard's Levelized Cost of Energy+ study. Renewables are about half the cost of nuclear power. Renewables + 4 hours of storage is price competitive with nuclear. As it turns out, it can be cloudy and the air can be still at the same time. And it can do those 2 things for extended periods of time. To have a reliable renewable based grid, you need to be able to run exclusively off batteries FOR WEEKS.\n\n\\> Although reasonably high levels of reliability can be reached by solar-wind resources alone, the defining challenge of such systems are the longer-duration gaps, often associated with extreme weather episodes. For instance, historical solar and wind resources data in Germany reveal that there were nearly 2 weeks in which dispatchable generation had to cover practically all of the demand because of a period with very low solar and wind power availability (called “dark doldrums”)\n\n\\> \\[...\\]\n\n\\> For example, the energy storage capacities we consider are in some cases quite large: energy storage equal to 12 h of mean electricity demand in the contiguous U.S., Germany, and Japan represents 5.6, 0.7, and 1.4 TWh, respectively (Supplementary Data 5). These combined storage capacities represent \\~35 times the capacity of Li-ion batteries produced globally to date, and more than 200 times the pumped hydro storage capacities that now exist in those countries.\n\n[https://www.nature.com/articles/s41467-021-26355-z](https://www.nature.com/articles/s41467-021-26355-z)\n\nTo reiterate: 12 hours of storage for 3 countries requires 35 times more storage than has been produced in history. And we need several weeks worth of storage for every country.\n\nStorage isn't even a solved problem yet. We literally can't do it. To say that it is simpler and cheaper is insane.", "label": 1}
{"text": "eat more fibre guys and work out", "label": 1}
{"text": "Yeah you're shadow banned. I didn't get that notification either. I'm sure you're used to it, but I hate that it happens. The lack of communication between the two sides is worse than the differing positions.\n\nAnyways,\n\n\n>Covid was not an extinction level virus or even close.\n\nYeah obviously not. That's why I gave a hypothetical. I'm trying to establish that you're argument falls apart at the extremes. Please stop bringing it back to real world when I'm using a thought experiment. \n\n1 of 2 things is happening here that I'm trying to distinguish between with the thought experiment. Either you're OK with forcing vaccines if something is dangerous enough, in which case you're bodily autonomy argue doesn't stand unless we know exactly how dangerous a brand new disease is, or you think bodily autonomy still stands even at the extremes, in which case I wish you well in whatever non US country you're interested in. \n\nYour examples of CHOOSING vaccines when they made sense to you don't differentiate between the two possibilities. That's why I gave an extreme hypothetical.\n\nSorry if I'm being pedantic, I just find this pattern occurs literally 100% of the time with conservatives, where I struggle to get them to engage with hypotheticals.\n\nIt's still love though u/Exciting_Prune_5853 even if you dodge questions like fence sitting liberal cuck :p", "label": 1}
{"text": "I ll change places with you any time of the day , white manbaby", "label": 1}
{"text": "I don't know what that means.\n\nAre you saying I should be more tolerant of annoying and stupid people? Because that's not going to happen.", "label": 1}
{"text": "He called you a pussy.", "label": 1}
{"text": "Is that something you're very concerned about? How you look to others? Is that how you decide how you should behave?\n\nI don't care what your speculations are about whether the way I choose to discourage annoying idiots meets your standard of being respectful.\n\nIn either event, if there's an option where I don't have to be annoyed by stupid people, what's it to you if I indulge that preference?\n\nAre you the spokesman for annoying stupid people?", "label": 1}
{"text": "Ha. Maybe he tried.", "label": 1}
{"text": "He is a manly men's man who can't stop thinking about what other men think about him", "label": 1}
{"text": "if you want to comment on my behaviour i too may comment on yours , you can choose to behave like a woman if you like but i was born a man so i will behave like one , for all i know you could be a woman or one of the extremely rare individuals born with a different spirit and i would take back this comment if so", "label": 1}
{"text": "Nothing, a majority of the human race is doomed, planet will be fine after we inevitably kill most of ourselves off or rather reap the consequences of our actions.", "label": 1}
{"text": "But you also do that unsolicited anyway, don't you? Isn't that precisely what you did a minute ago?\n\nWouldn't that be an example of the womanly behaviour you mentioned too? \n\nIn any event, mocking fragile and pretentious peacocks who make themselves look even dumber than they are by trying to act smarter than they are is a unisex behaviour.\n\nMaybe you should just try to be yourself, instead of being so performative. All of this \"how dare you accuse me of what I'm doing\" nonsense just comes across as needy, don't you think?", "label": 1}
{"text": "Hit a nerve, didn't I?", "label": 1}
