{"text": "\"You have to sacrifice a life to gain a life\"\n\n- Republicans probably", "label": 0}
{"text": "Boy are they gonna be surprised when they realize what they been revived for.", "label": 0}
{"text": "i mean ill be dead anyways why not have a 0.001% chance at them reviving me or something lol.", "label": 0}
{"text": "depends on the company but yeah. i was walking through the streets when i wrote the last comment so i was typing fast.", "label": 0}
{"text": "All wireless communications are a type of electromagnetic frequency and thus radio waves are also a type of electromagnetic frequency. But there's a set of the electromagnetic spectrum which is defined as radio waves: https://upload.wikimedia.org/wikipedia/commons/c/cf/EM_Spectrum_Properties_edit.svg\n\nWifi can be over regular radio waves, but typically it's smaller wavelengths. And in general wifi isn't strong enough for us to notice it from Earth if it was being used on another planet.", "label": 0}
{"text": "Nah my reasons are more traditional, I don't believe a woman has a right to end a life after conception. I don't believe we should even have that power and find it unfortunate the science is there for it.", "label": 0}
{"text": "Then you haven't worked much in  construction jobs, that's for sure.", "label": 0}
{"text": "We need to get over people using their cell phones and driving first.", "label": 0}
{"text": "Not dying from a traumatic pregnancy or ectopic pregnancy would also be an extension of a woman's life.", "label": 0}
{"text": "Idk man, having kids makes it feel like life is taking forever", "label": 0}
{"text": "yep thats what we need, a giant story at the top of the thread, not any real statistics or bulleted numbers.", "label": 0}
{"text": "Cool. Finally a use for all the optical drives that we all still have in our computers.", "label": 0}
{"text": "So, there was a Microsoft AI tour recently in Berlin (I live here, and went there). Microsoft leads in this field. So, I think layoffs were made not because of money shortage (in Microsoft, cmon!), but because they simply don’t need that much of personell. \nAnd what should they do with all that sweet saved money?:) not on cancer research, you silly silly people!", "label": 0}
{"text": "Have you considered shaking it off/sucking it up?", "label": 0}
{"text": "r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform r/WorkReform  r/WorkReform r/WorkReform\n\nCommented like this because my first one was removed for being too short", "label": 0}
{"text": "Even if you had one, you still would need to buy a new one, because they wouldn't be compatible.", "label": 0}
{"text": "Is it important so far pieces of shit can continue stuffing their face with Oreos while pretending it's just genetic? Not only do our tax dollars pay for their Oreos, soon they'll pay for fat shots.", "label": 0}
{"text": "My guess: reduced (chronic) inflammation is the reason for the many wonderful effects", "label": 0}
{"text": "I’m 300 days sober and I started in Jan. It’s truly changed my life. I never thought I would get sober.", "label": 0}
{"text": "I mean, you’re not wrong. But it’s not tied to controlling the market. They would supply the world with pens if they physically could", "label": 0}
{"text": "> I’ve lost 80 pounds so far this year\n\nGlad to hear it. What have you been doing to lose the weight?", "label": 0}
{"text": "Yes, I proofread this and the entire blog post", "label": 0}
{"text": "Bonus side effect!", "label": 0}
{"text": "These aren't generics. They're compounded by pharmacies because of a FDA shortage. Generics go through a different process.", "label": 0}
{"text": "No it isn't. The diet was always available regardless of whether he took ozempic or not. All he has done is removed any requirement of willpower for it and now he will be reliant on the drug forever unless he wants to balloon back to his old weight.", "label": 0}
{"text": "Big question is, are these positive effects the result of weight loss or independent of weight loss?", "label": 0}
{"text": "That's the thing with AI advancing. Fewer people are needed to get the same work done. The execs fire the extra unneeded hands and make extra money for themselves.", "label": 0}
{"text": "I hope you're right. Would be interesting if there have been studies on this. I am a fitness advocate, so if what you're saying is true, I'll actively promote the drug.", "label": 0}
{"text": "and as soon as they go off it it all comes back. it's a scam drug, yet again.", "label": 0}
{"text": "That's a great question, but it sounds like too much physical exertion to me 😮‍💨", "label": 0}
{"text": "Yep that's the norm right now unfortunately", "label": 0}
{"text": "FYI, in English the word is just \"dose\" not dosis.", "label": 0}
{"text": "they could turn a profit if they made $0.01 from every transaction, doesn't mean it's worth it", "label": 0}
{"text": "India's birth rate is below replacement level", "label": 0}
{"text": "300 days is incredible!!! Congratulations!", "label": 0}
{"text": "I have been taking Wegovy for the last 6 months or so. I am 6'5\" and was around 308 lbs when I started. My BP was super high (155/98), so much so that I was getting headaches everyday. I couldn't take blood pressure meds because they would make me dizzy and lightheaded. I am now 268 lbs and my BP is around 125/88. Much improved. I am still working on my weight but Wegovy helped me realize I didn't have to get huge portions to make myself feel full. I now have a better relationship with food in general. I don't want to take it forever but it has been working really well for me so far.", "label": 0}
{"text": "> you simply don’t eat much and never feel hungry. My girlfriend was eating smaller portions\n\nThere are other drugs, like Adderall for example, that do this. I'm medically prescribed it, but don't take it every day. I took it the other day and lost 10 lbs in 24 hours. Of course, my 4 hours of exercise helped, but that is consistent. \n\n> Doctors still want people to exercise who have this. Your mentality is the problem. That people who take Ozempic for weight loss must be lazy.\n\nThat's not at all what I am saying. First, doctors might advocate, but that doesn't mean people would listen. I'm not saying they're lazy, but exercise takes motivation and discipline. Losing weight is a major motivator. If that's no longer an issue, and I don't mean for everyone, people may be less motivated to exercise.", "label": 0}
{"text": "So, basically, the people from Wall-E but skinny", "label": 0}
{"text": "I agree with you. I have successfully dieted before and kept the weight off for almost 15 years, but now perimenopause and middle age has made it very difficult to lose more than about 10 pounds without gaining it back within a few months.  I know what I need to do but I need a kick start to get me going, and on my own it has been very difficult.  We need these drugs to be affordable and available.", "label": 0}
{"text": "You alright bud?", "label": 0}
{"text": "Figured that, unfortunately. I wonder if those secondary benefits are simply results of losing weight. If that’s the case, obviously there would be no benefit in fit people using it. However, if not, fit and healthy people may try to obtain Ozempic purely because it’s “good for you”.", "label": 0}
{"text": "This is 100% a fact. People look at this like it’s “cheating” they don’t like the idea that they can just lose weight without effort. People get pissed off when they think you are “taking the easy way out” it’s because generally they are miserable people, who are jaded and skeptical by nature.", "label": 0}
{"text": "Huge agree. I started wegovy almost two years ago and lost about 75ish lbs. My original goal was to lose 80-90lbs. But i started kickboxing in February and switched my sights on muscle building and toning. \n\nI would have never started these classes 75lbs ago. The physical limitations and sheer embarrassment of my put shape body would have scared me off.", "label": 0}
{"text": "Also I provided all the inputs...Particularly the one which is the most important is scaling down hidden costs and incremental costs of most societal problems by nipping them at the start, through small/micro user-initiated AI interactions with chatbots at the right time.", "label": 0}
{"text": "generics are out IF you get them compounded. otherwise, your only option is brand name.", "label": 0}
{"text": "I am eating much healthier because I don't have cravings for junk food while being on this drug. That they do \"Nothing\" to encourage or discourage junk food eating is incorrect IMO.", "label": 0}
{"text": "Don't act like you'll need to take it the rest of your life.\n\n\nIf you take it for a year and get down to a much healthier weight\n\n\nAnd the rest of your health improves from losing weight( it's so much easier to go do active things when you don't have an extra 40 lbs on)\n\n\nAnd you get the mental health benefits of being a healthy weight(ex: improved social life, the addiction fighting properties it seems to possess)\n\n\n\n\nYou could make major changes in your life and set up systems to stay healthy.\n\n\nThen you could come off the drug and see how long you can stay at that healthy weight.\n\n\nMost adults put on a pound or two every year and after a decade they're 20 lbs over. Even if you put on 5 lbs a year for the next 8 years you'd only then be back at the starting point.\n\n\nThink you could course correction that time?\n\n\nI think you could.\n\n\nLook at this not as cheating but giving yourself a chance to restart.", "label": 0}
{"text": "These meds have been on the market since 2005.", "label": 0}
{"text": "Totally agree.  These people never talk about side effects with anything else, just this.", "label": 0}
{"text": "Stupid me quit smoking and drinking a year before starting to take Ozempic (diabetes 2), lol.\n\nWasn't hard, tho.", "label": 0}
{"text": "Fun fact: glp1 is directly derived from Gila Monster veno. They are one of only 6 venomous lizard species in the world, and their venom is considered non lethal to people. Go lizards!", "label": 0}
{"text": "Yeah exactly, how much CO2 does it take to create the compound vs how much it can pull from the air. I kinda suspect the math doesn't add up in its favor.", "label": 0}
{"text": "I love this idea. So the problems right now are:\n\n1) we need to genetically engineer crops to stay in their non-photosynthesizing stage through maturity, which shows promise. Nice.\n\n2) It would take 5x the current power consumption of the US (an already power hungry country) to produce enough food to feed everyone a vegan diet, though with plant-based alternates like engineered egg protein, engineered or plant-based meats, etc.\n\nMost of the rest of the issues are down to engineering specifics, not the fundamental science.\n\nI don't hate it. You'd think it'd be a great way to help vary our solar/renewable energy production rates too. Not exactly a battery, but a good way to use up excess power. Might be some economic challenges to the supply and demand of that, but I'm not a finance guy.", "label": 0}
{"text": "There's been some research that it actually stems the cravings for alcohol..", "label": 0}
{"text": "Yea my dad and wife lost no weight on compounds. Both are down significantly weight on the real stuff. The compounds strength are different.", "label": 0}
{"text": "Well, I’ve been on compound since April. Lost 50 pounds since lol", "label": 0}
{"text": "Thanks for the kind words :)\n\n\nSomething that specifically makes it harder for me is the ADHD I think. I didn't even get lucky and really cash out on the hyperactivity part! I do try hard but it's really tough to sustain and focus my effort to the point of being a habit. Even the things I think are habits just evaporate. But it isn’t like a video game or bass guitar or drawing or a book where I can get bored or forget about it for a few months or a year and come back when I am interested again and quickly regain my skill/progress. I always need to eat, and \"getting bored\" of or forgetting to track calories means losing all that work in a few weeks. I take meds but basically all that focus goes to work. Or writing reddit comments. You win the battles you can.\n\n\nI think maybe people are imagining my 600 lb life but I'm just a dude. I don't stick out from a crowd, horizontally.", "label": 0}
{"text": "Yup I'm taking the peptide and compounding it myself for a fraction of what wegovy costs.", "label": 0}
{"text": "As someone on /r/4chan put it \"you can tell who is an a**hole if they want Ozempic to have side effects.\"", "label": 0}
{"text": "It would be nice if family doctors didn’t gatekeep it behind a year of paying for their in house weight management counseling and horseshit even though your insurance clearly qualifies you to be on it.", "label": 0}
{"text": "You can buy the the peptide and compound it yourself. Just google it. And micro dose..", "label": 0}
{"text": "That's interesting, I've never heard of them. What are they called?", "label": 0}
{"text": "So basically they are like Neo from the Matrix.", "label": 0}
{"text": "100 bucks says it's an ad.", "label": 0}
{"text": "So what you're saying is that we should ignore data in the future that might show potential problems with ozempic? Remember when the entire pharmacy industry pushed oxycontin as the miracle drug that was the be all and end all to all pain? It took many, many years for the truth to come out. Big pharma is making loads of cash on ozempic and all i'm saying is that we should exercise some caution before we know the long-term effects of this.", "label": 0}
{"text": "Yeah, it's more like without paying then to grow what you want, they default to growing what's most profitable. Then the market for that one crop collapses and no one has anything to eat on top of it.", "label": 0}
{"text": "When plants are stressed or under low light conditions they can use acetate as an alternative source of carbon. Seedlings use this and they don’t get light as they germinate underground.\n\nThey want to use genetic engineering to tweak the metabolic pathways to be able to grow to completion just using acetate. \n\nIt’s still early stage and might not ever work.", "label": 0}
{"text": "Take the time and effort to get on it. Its worth it. (Your mileage may vary.)", "label": 0}
{"text": "You're not likely to become fat due to eating an \"on point\" diet with a large proportion of protein. No, your diet will usually be absolute shit full of sugar and saturated fat. Fat people don't necessarily consume more protein than a skinny-ish and fit person that supplements a couple times per day.", "label": 0}
{"text": "Which candidates are the \"cheap weight loss drugs for all\" choices?", "label": 0}
{"text": "I'll have to look at my college textbooks, seem to recall it came up in Texas History and was touched on as well in US history. Specifically some things to do with Texas and Louisiana. It's been a few years.", "label": 0}
{"text": "Found big pharma.", "label": 0}
{"text": "Just buy it online.", "label": 0}
{"text": "Nope. Even with the side effects and muscle loss you're better off. There's little that is worse for you over time than being overweight.", "label": 0}
{"text": "Ahh I see, my mistake. Thanks for the clarification.", "label": 0}
{"text": "I've also struggled with eating disorders since high school, and I just want to say I'm so happy for you!  Having a similar experience myself with mounjaro. This stuff is a miracle for getting rid of so many mental health issues and eating disorders.", "label": 0}
{"text": "I'm always skeptical after growing up in the 90s. We had tons of \"wonder drugs\" that were either bad, (see: all of weight loss drugs thst decade) not as miraculous as originally advertised (*side eyes Alzheimers drugs*) or have random, horrible unintended side effects (looking at you SSRIs). I'm glad these drugs are helping, I just can't jump on any \"it's the cure for everything!\" bandwagon for anything now. Especially before the long term studies. ", "label": 0}
{"text": "I think there’s a similar approach of growing food using electricity, but it’s growing hydrogen-eating bacteria instead. I’m curious which of these methods is better and more efficient. I’m guessing it’s the bacteria one, since they don’t need to grow and maintain human-inedible stuffs like roots or stems.", "label": 0}
{"text": "This is awesome!! Lost friends to alcohol, I’m glad it’s being you", "label": 0}
{"text": "Sent my partner to the hospital.  They said it was some issue between ozempic and their metabolism.  They also have heart disease and type 1 diabetes so just a warning not a cure-all.  They are probably trying moujaro soon though because they have diabetic retinopathy that's not getting better otherwise.  Despite having great A1C.", "label": 0}
{"text": "Mental health issues are still health issues. I would go ahead and get it from a compounding pharmacy.", "label": 0}
{"text": "I'd rather die suddenly because my heart stopped than painfully in a car wreck too.", "label": 0}
{"text": "Pharmaceutical interventions should be last resort. Nutrition and lifestyle changes like daily exercise should be considered first before taking a drug like this one.", "label": 0}
{"text": "Fasted cardio is sketchy at best. https://www.uclahealth.org/news/article/fasted-cardio-is-an-attempt-to-burn-stored-fat\n\n> Another drawback is that, when in a fasted state, the body has another energy option besides fat to make up for the lack of glycogen. We’re talking about protein, with the source being your own muscle tissue. Losing muscle mass is the opposite of what you’re trying to achieve.", "label": 0}
{"text": "Fewer hands to spend the money on resources that our society doesn't care about renewing.", "label": 0}
{"text": "Man I need this stuff because my life is crippled by various addictions including food, but I can't seem to find it anywhere that's not like $400 a month. Does anyone know where to start looking? I've already found compounding pharms like Henry meds but that's the aforementioned $400/month.", "label": 0}
{"text": "Was talking about ADHD drugs in that comment", "label": 0}
{"text": "Are those also not related to weight loss though?", "label": 0}
{"text": "So the trials that are timed. You have to spend a month on the drug to increase the dosage. I don't see why if those trials continued, those people wouldn't continue to lose weight.", "label": 0}
{"text": "i dont want to discount your struggles, but can’t picture you at 6’6” 200 pounds. you must be very lanky and skinny. i am 6’5” and at my most fit peak physical condition in high school i was 255 pounds. i am also on a GLP-1 and the goal weight i am trying to get down to is 280 lol\n\nmust be completely different body types, but either way i agree with you, these drugs are amazing and life saving. ", "label": 0}
{"text": "Their point being that big pharma benefits from this drug being massively popular and there is expected to be lots of lobbying in favor of it even if it isnt warranted. Again, thats my take on their comment and I do agree to an extent. I've researched GLP-1s for over a year.", "label": 0}
{"text": "\"Have you or a loved one been affected by GLP-1 health issues? You may entitled to compensation\"", "label": 0}
{"text": "I don’t see how sending someone back in time but instead is stuck helping people by means of possession in an endless cycle is gonna do for climate change.", "label": 0}
{"text": "I was asking for the number and got downvoted instead, thanks fir the number anyway.", "label": 0}
{"text": "You're so right. It's so hard to understand your struggles of eating too much food hahahahahahaha", "label": 0}
{"text": "Not that it is what you asked but if you get prescribed Wegovy there is a savings card you can get online that CAN make your script $25/month", "label": 0}
{"text": "For Wegovy: \n\nHave a BMI of 30 or higher, or a BMI of 27 or higher and a weight-related health condition.", "label": 0}
{"text": "It makes sense, lack of impulse control is one of the chief symptoms of ADHD.", "label": 0}
{"text": "There are tons of online pharmacies that are happy to prescribe it to you. I go through Lavender Sky.", "label": 0}
{"text": "I've been on Zepbound for a few months and I've lost weight am now motivated to exercise regularly for the first time in a very long time, so I'm not sure your logic tracks. I also used to drink pretty heavily and that has pretty much stopped. I just don't feel like it anymore. It's really fuckin weird. It seems to have affected my life in a lot of positive ways that I didn't expect.", "label": 0}
{"text": "You didn’t even read the article.\n\nGreat", "label": 0}
{"text": "I could care less how or if anyone loses weight. It's their body. But many of us grew up in a decade of \"miracle cures\" that turned out to be not so miraculous. (Lost one family member to the long term effects of Fenfluramine, which by the way was not only FDA approved, but tested on kids in the 90s, watched my grandmother whiter away on Alzheimer's drugs that the creators lied about the results of to get them approved, still dealing with my own long term negative effects of an SSRI that were not disclosed before I took it etc etc). \n\n\nIt's not that anyone gives a damn about your \"path\" in life. It's years of being lied to by pharmaceutical companies and having a deep distrust of anything they market as \"awesome.\" They're in this for the profits, they also do not care if you loose weight or not lol. ", "label": 0}
{"text": "Doc told me my cholesterol was getting too high and I needed to change my diet or take meds. I decided to try to change my diet first because I drink a lot and don’t put much thought into how healthy the food I cook is.\n\nI quit drinking and didn’t touch it for at least 2 months.\n\nI relapsed on midnight microwave nachos within the first week… it was more difficult for me to give up cheese than alcohol.", "label": 0}
{"text": "What do they do with the light?\n\nThey make sugar", "label": 0}
{"text": "That’s not what this user’s message is saying at all, and if all you took from it that all drugs are bad rather than a note of exercising caution against popular dogma then I think you’re the “genius”.", "label": 0}
{"text": "Crossing my fingers for news on telomere regenerative efficts one of these days.", "label": 0}
{"text": "Both of your examples are perfectly cromulent uses of those words.", "label": 0}
{"text": "Now, will men use this too? One of you, tell me. They say life will be prolonged.", "label": 0}
{"text": "It'll happen eventually. The economic benefits that come from weight-loss will far outweigh any kind of cost for generics. Insurance companies will be shipping the stuff out for basically free to their customers.", "label": 0}
{"text": "> GLP 1 can slow down digestion. \n\nI wonder if that will ever correlate to colon cancer.", "label": 0}
{"text": "> Quantum entanglement is one of the most perplexing phenomena in physics. This bizarre concept proposes that two particles become linked, and any change to one causes an “instantaneous” change in the other, even if they are separated by vast distances.\n\n> Researchers have been able to correlate the “birth time” of an electron escaping an atom with the energy state of a second electron remaining within the atom. Surprisingly, this “birth time” isn’t a fixed moment. Instead, it’s a quantum superposition, meaning the electron essentially exists in multiple moments at once.\n\n> “This means that the birth time of the electron that flies away is not known in principle. You could say that the electron itself doesn’t know when it left the atom,” highlighted Joachim Burgdörfer.\n\n> “It is in a quantum-physical superposition of different states. It has left the atom at both an earlier and a later point in time.”\n\n> The energy of the electron remaining in the atom is also uncertain. If the remaining electron has higher energy, the escaping electron probably left earlier. If the remaining electron has lower energy, the escaping electron probably left a bit later (on average, 232 attoseconds later, which is incredibly fast).\n\n> “However, these differences can not only be calculated, but also measured in experiments,” concluded Joachim Burgdörfer.", "label": 0}
{"text": "Maybe your hand shrunk", "label": 0}
{"text": "It's legitimately a drug that pays for itself in terms of outcomes: for individuals, insurers, and employers. The only people dragging their feet are the ones who sell obesity-management healthcare.", "label": 0}
{"text": "Are we doing that?", "label": 0}
{"text": "So the researchers managed to make so that the plants didn't need light to make sugar?", "label": 0}
{"text": "Some of us do 😉", "label": 0}
{"text": "The downvoters probably mistook your question for trolling.\n\nFor all intents and purposes, the supply of sodium salts is unlimited, and the infrastructure required to extract the sodium and get rid of the chlorine by making magnesium or calcium chloride is negligible next to the rest of the battery factory.\n\nThere is no way for humans to do enough of anything to come close to using it up without destroying everything thousands of times over via running into other constraints.\n\nConcentrated sodium brines are a waste product in many industries. The only thing preventing them from being used for the other materials that exist in trace quantities is the amount of sodium salt and water you'd have to deal with and remove. Removing the water costs about as much energy as charging the battery you'd make from the sodium 3 or 4 times.", "label": 0}
{"text": "That's pretty cool even if it never reaches the commercial state. Being able to bypass completely the ened for sunlight is pretty rad!", "label": 0}
{"text": "Not at these economies of scale it doesn't.   \nIt's not a one-time thing. You're a lifetime customer.  \nThey will lower the price kicking and screaming like the filthy greed pigs that they are.", "label": 0}
{"text": "That's just a difference in legal terminology. They are both chemically identical.\n\nGenerics are allowed because the patent has expired, and compounded medications are allowed because of brand-name shortages.", "label": 0}
{"text": "I haven’t seen that. Got a link? That’d be good.", "label": 0}
{"text": "Almost like a profit motive doesn't belong here, huh?", "label": 0}
{"text": "Could pesticides be eliminated largely as growing indoors could eliminate pests and seal them out of grown areas.", "label": 0}
{"text": "My mom’s on it for weight. She’s smoked for like 50 years and has always been a chain smoker. She smokes a lot less now since she’s been on it.", "label": 0}
{"text": "Anyone who isn't lying to themselves already knew that.  \nI do like that it proves CICO is all you need.", "label": 0}
{"text": "I just recently got into making my own electrolyte mix and was surprised to see just how poor the western diet is for potassium intake.", "label": 0}
{"text": "No it's not just a semantic difference. When the FDA shortage lifts, compounded Semiglutides will be permanently unavailable, as is the current pending reality with Tirzepitudes. Those affordable alternatives will be gone forever. Regarding process, active ingredients are the same with compounded drugs but formulas are not identical because compounders lack the manufacturing capabilities of industrial drug makers. Of note, compounders are not subject to FDA regulation and there are inherent risks associated with that.", "label": 0}
{"text": "So I've been on Mounjaro for almost 5 months. My weed and nic cravings are still as strong as ever. It does a great job of controlling my glucose levels, and while my hunger/food satiation levels haven't really changed either, it wrecks my guts so much that I eat less. So far I've lost 25lbs.\n\nYour mileage may vary. This is just my personal experience.", "label": 0}
{"text": "Wow this is exactly what goes through my head now. I’ve been trying to be more cognizant of mental bandwidth and just how much time and energy it takes to just think of things. Your comment makes me realize just how much bandwidth food noise actually takes up in my brain. It’s exhausting.", "label": 0}
{"text": "It's the best thing that ever happened to me. Health improvements in every way. I have had no side effects. My physicians  give it high praise.", "label": 0}
{"text": "If someone were to look for getting this, what’s the most reputable source?", "label": 0}
{"text": "Food addiction is the only addiction that you can't just quit the thing you're addicted to.", "label": 0}
{"text": "Some countries are making the initial steps.", "label": 0}
{"text": "If it was just about overeating, we wouldn't be seeing all the other benefits associated with the medication (read the article...hello). It's obviously *not* *just* about overeating.", "label": 0}
{"text": "I started on Ozempic which I could get because I had a diabetes diagnosis. When I saw an endocrinologist she switched me to Mounjaro because she said her patients pretty universally had better results. This is also supported by clinical trials. \n\nAfter nine months she tools me completely off of insulin and three months later after testing my blood glucose is still excellent. It barely changed even though I was no longer on insulin. \n\nI also have been absolutely hitting the gym hard and have put on quite a lot of muscle while losing the fat. I’m also now on testosterone treatment to bring that back to good levels. The endocrinologist is also managing that. I believe without the testosterone I wouldn’t have been able to hit the gym as hard as I am. \n\nThe Mounjaro shuts off the food noise in my brain and regulates how my body reacts to sugar. I don’t have blood sugar spikes anymore and getting hungry isn’t now a debilitating feeling. I can now do what I’ve seen healthy weight people do my entire life and exist healthily with food.", "label": 0}
{"text": "> Compounded medications are not FDA approved.\n\nThis is misleading.\n\nPharmacies are regulated by the states, not the federal government, so no, they are not \"FDA approved,\" but you might as well be saying restaurants are unsafe because they are \"not FDA approved.\"\n\nOf course they aren't FDA approved, because the FDA is not the government agency that approves them.\n\nCompounded medications are prescribed by licensed doctors, and made by licensed pharmacists inside licensed facilities. They are are safe as any other medication.", "label": 0}
{"text": "Stories like this give me so much optimism for the future. Reducing obesity/rolling back T2 diabetes in many patients solves one of the greatest issues in healthcare. I’m so happy you’ve had such success with it! For many, it really is a second chance at a healthier life, and that alone is incredible.", "label": 0}
{"text": "The irony is, lowering your bmi will stop other issues as well", "label": 0}
{"text": "If it was as easy as you say, we wouldn't have an obesity rate of nearly 40% in some parts of the US", "label": 0}
{"text": "Do you smoke lol? It's not addictive like nic but you definitely build tolerance and suffer cravings/withdrawal symptoms if you're a heavy user. Going cold turkey is hard for me lol, vapes have wrecked my tolerance", "label": 0}
{"text": "Get a different doctor. Your BMI and weight related condition (back) makes you eligible according to the guidelines. ", "label": 0}
{"text": "I'm currently on Mounjaro and from what I've heard it's better than Ozempic because it's less likely to make you feel as nauseous since it's not as potent as a GLP-1 agents (it's a dual inhibitor of GIP and GLP-1). I've lost 15 kg in 2 months, it's definitely improved my health quite a bit!", "label": 0}
{"text": "Thank you for having this perspective, because it is seemingly a rare one", "label": 0}
{"text": "I think that for some, yes, the weight loss is the source of a lot of benefits…but it goes way beyond that. \n\nCase in point: women with PCOS. Some women with PCOS can be insulin resistant and have high blood sugar but not be overweight or obese. In that situation, the GLP-s are addressing an underlying endocrine system malfunction. They’re currently prescribed off label (as is Metformin) for women with PCOS who are trying to get pregnant. \n\nI’m interested in seeing studies on GLPs and ADHD/addiction—it’s already quite well established that people with ADHD will self medicate with food or cigarettes or other drugs, as a way of dopamine-seeking. If GLPs reduce that dopamine-seeking behavior, then that would be addressing an underlying neurological disorder. \n\nhttps://www.psychbreakthrough.com/breakthrough-blog/what-in-the-world-does-ozempic-have-to-do-with-adhd-\n\nI don’t see these drugs ever being marketed for mass “just in case” use, though. ", "label": 0}
{"text": "These drugs have been approved for Type 2 Diabetes since 2005, under research since the 80s. We have nearly 20 years of live use in tens of millions of people.", "label": 0}
{"text": "Lots of shit easy. It's easy not to speed, it's easy not to kill. 🤷 ", "label": 0}
{"text": "I think I am like you in terms of dedicated independence and general distaste for the entire pharmaceutical industry.  I am DEFINITELY like you in terms of a lifelong struggle with weight and the \"I'm so tired of being fat\" feelings (though I had more weight to lose than you do.)  But I am definitely no doctor - this is just my experience.\n\nGetting on semaglutide has been one of the *very best things* I have done for myself *in my life,* and it was apparent maybe a couple of weeks in.  This is an absolute fucking miracle of science, and my only regret is that I didn't pounce on these the MINUTE they became available.  It has been such a game changer for me that I'm crying a little writing this comment.  Everything has changed for me.  \n\n>And it sort of feels like cheating.\n\nAnd although I said \"miracle,\" it's still not magic.  I could absolutely go crush a large pizza right now if I wanted to, and I would add those calories to my fat stores, just like always.  The difference is that I don't *have to* anymore.  And it's absolutely a glorious feeling. \n\nSo keep thinking about it.  It might be a difference maker for you, too.", "label": 0}
{"text": "The following submission statement was provided by /u/upyoars:\n\n---\n\n> Quantum entanglement is one of the most perplexing phenomena in physics. This bizarre concept proposes that two particles become linked, and any change to one causes an “instantaneous” change in the other, even if they are separated by vast distances.\n\n> Researchers have been able to correlate the “birth time” of an electron escaping an atom with the energy state of a second electron remaining within the atom. Surprisingly, this “birth time” isn’t a fixed moment. Instead, it’s a quantum superposition, meaning the **electron essentially exists in multiple moments at once**\n\n> “This means that the birth time of the electron that flies away is not known in principle. You could say that the electron itself doesn’t know when it left the atom,” highlighted Joachim Burgdörfer.\n\n> “It is in a quantum-physical superposition of different states. It has left the atom at both an earlier and a later point in time.”\n\n> The energy of the electron remaining in the atom is also uncertain. If the remaining electron has higher energy, the escaping electron probably left earlier. If the remaining electron has lower energy, the escaping electron probably left a bit later (on average, **232 attoseconds** later, which is incredibly fast).\n\n> “However, these differences can not only be calculated, but also measured in experiments,” concluded Joachim Burgdörfer.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1gc2l8i/billionth_of_a_billionth_of_a_second_quantum/ltqgfu9/", "label": 0}
{"text": "NO good if you can't get them .... freaking useless.", "label": 0}
{"text": ">Wait until Thacker pass is up and running.\n\nWait until NaIon batteries become a thing.\n\n>Sodium-ion batteries are not only improving at a faster rate than other LDES technologies but they are also set to be cost comparable with the cheapest forms of dispatchable power, and therefore enter mainstream use, as early as 2027.Jul 1, 2024\n\nI think LiIon will continue to be competitive for EV batteries for at least a few more years. But after 5 years... who knows?\n\nNaIon has some serious cost and availability advantages over lithium. If anyone wants to try and argue against this, here's your chance.", "label": 0}
{"text": "Why do they keep acting like quantum entanglement is some grand mystery? It seems so simple. The spins are opposite at creation, you just measure which is which later. Nothing is actually going on.", "label": 0}
{"text": "Great, now scale it to billions of tons of co2.  Good luck.", "label": 0}
{"text": "It's not a loophole.  It's specifically designed for this.", "label": 0}
{"text": "> Ozempic is not just an appetite supressor. It also stimulates insulin production and slows digestion. Reducing it to just being about supression to own annoying internet people is not any better\n\nI come in here and just end up not typing anything out because it's not worth correcting them. All that's going to happen is we waste our time typing several paragraphs of information and they won't learn anything from it. \n\nThey are not going to understand the body regulates weight using hormones, metabolic disorders like PCOS, our terrible food echo system, and all of that put together makes it difficult for people to lose weight intentional. They like the idea that it's easy to lose weight... and everything that comes with that: it's self inflected, it's will power, it's means just eating less, etc.", "label": 0}
{"text": ">reducing 10 forms of cancer, Alzheimer’s risk, diabetes and host of other issues beyond just coming from the weight loss.\n\nPossibly a dumb question but is that because those conditions are impacted by weight so weight loss helps or is the drug actually doing something in those areas as well?", "label": 0}
{"text": "What’s your point? Because a first step has been taken doesn’t mean anything will come out of it, many, many solutions to this issue have had successful first steps that never led to a meaingful scalable solution to the problem", "label": 0}
{"text": "> Those affordable alternatives will be gone forever.\n\nNo one is debating that. Like I said, it's a legal difference.\n\n>Regarding process, active ingredients are the same with compounded drugs\n\nThat's what \"chemically identical\" means in this context. It's the same active ingredients. If, for example, I'm buying generic acetaminophen vs brand name Tylenol I don't care if the gelatin capsule is made from slightly different inactive ingredients. I care if that capsule contains the same N-acetyl-para-aminophenol, and it does. It's the same medication.\n\n>compounders lack the manufacturing capabilities of industrial drug makers\n\nPharmacies mix and dispense drugs, they do not manufacture them. This is the case for all medications, not just compounded medications. The claim that pharmacy's are unsafe because they don't manufacture medications themselves is crazy. Do you think your local Walmart pharmacy has unsafe because it doesn't have a manufacturing plant behind the counter?", "label": 0}
{"text": "I’m pretty similar to these numbers as well. I don’t mind the slower pace of the loss; and enjoying more walks now as well.", "label": 0}
{"text": "Oh good. The wealthy will hoard it and cause supply shortages.", "label": 0}
{"text": "I think California's desalination plant can do that by itself. We don't have good ways to dispose of sodium brine from the desalination process.", "label": 0}
{"text": "My point is, you’re fun at parties.", "label": 0}
{"text": "> an easier path\n\nI know I am not alone in saying that my path - despite currently including this kind of medicine - has *absolutely fucking not* been \"easier.\"", "label": 0}
{"text": "Cross our fingers and hope these things don't have long term side effects we aren't aware of", "label": 0}
{"text": "Have you found any effects on social media and smartphone use?", "label": 0}
{"text": "Obviously not promoting steroids a lot use but agree if you’re using these medicines probably have to track protein and workout as you want muscle (you don’t have to be big if you don’t want to just retain healthy muscle mass)", "label": 0}
{"text": "Hey you were building muscle and getting the right nutrients in your body. Not sure how Ozempic works but I don’t think they’re working on their cardio like you are.", "label": 0}
{"text": "I’m currently in a study about alcohol disorders and glp 1. It’s a 50/50 if I get it and my local bar can tell if I get the placebo.", "label": 0}
{"text": "My wife was on it for a month. She was nauseous all the time, like threw up a few dozen times all told", "label": 0}
{"text": "Pls help me with psoriasis, Pls help me with psoriasis, Pls help me with psoriasis,", "label": 0}
{"text": "1.2 million EVs were sold in the US in 2023. We aren't going to 100% EVs for several years. Your number should be around 30% and that will probably accelerate the price drop of batteries.", "label": 0}
{"text": "The problem is the high value protein and nutrients get extrsated and fed to cows, then there are vast quantities of leftover calories in the form of corn starch or oil which are disposed of by giving people diabetes or heart disease.", "label": 0}
{"text": "There's the four Panasonic/ Tesla Gigafactories in the US.", "label": 0}
{"text": "Hopefully, I suspect the religious nationalists will have a reason to ban these drugs entirely tho. Rationality and evidence aren’t really a part of that groups worldview in any way besides as lipstick.", "label": 0}
{"text": "I live with a physician. The extent to which the field of medicine doesn't really have a firm understanding of what all is happening is a consistent source of her grumbling about my prescription and is annoyed at the extent to which her friends have noticed she's been upgraded from a Jason Kelce experience to a Travis Kelce experience. \n\nFor some of the reduced cravings I would not be surprised if it was a response to the consistent impact that seems to be over eating and over drinking causing discomfort. \n\nBut we'll probably figure out a bit more of what's going on at some point.", "label": 0}
{"text": "Wow! Thanks for sharing your experience. It’s really fascinating and I look forward to hearing more about what the find soon.", "label": 0}
{"text": "It’s not misleading, it’s patently true. The FDA does not regulate compounded medications. The long approval process that goes into regulated medications does not apply to compounds. When your doctor prescribes a random concoction of ingredients through compounding to treat whatever, that medication you pick up has not been evaluated by the FDA for safety or efficacy. That compounded medication is also not evaluated by any state level agency for safety or efficacy. That’s just patently true. No state agency has the resources to check every combination of ingredients that are compounded to make sure it’s safe and effective. The pharmacy itself is regulated (again, not the specific medication). Their processes, cleanliness, ingredient sourcing, etc is regulated. Trying to convince people compounded medications are regulated is, in fact, misleading.", "label": 0}
{"text": "One could argue that eating and over-eating, though physically similar, are psychologically entirely different things", "label": 0}
{"text": "what are generics?", "label": 0}
{"text": "Down 70+ pounds since May on Zepbound. Started at 265+", "label": 0}
{"text": "Cardiovascular disease is the leading killer in the US. There are plenty of skinny people dying from it, but yes being obese raises the risk for heart disease.", "label": 0}
{"text": "But you don't *need* drugs to lose weight", "label": 0}
{"text": "Even the most genetically gifted steroid users will lose muscle when cutting for a body building competition. It is something they plan around. \n\nA normal, \"unenhanced\" person, on an outstanding diet and resistance training regime, will still lose about 25-30% of the weight lost as muscle.\n\nIt is closer to 40-50% if someone is going off of a simple caloric deficit. There are a few exceptional people that will retain more.\n\nMuscle is metabolically \"expensive\", and it takes a lot of effort to retain muscle, especially as you get leaner. \n\nLook up Renaissance Periodization if you want to learn about dieting for body composition.", "label": 0}
{"text": "for a company to want to make it, they need to make a profit, so yes it does.\n\npeople dont need their magic diet drug, they can just choose to eat better and exercise for free if they dont want to pay", "label": 0}
{"text": "These drugs have evidence on preventing a number of issues that are expensive to treat. From a long term standpoint it should be less expensive than treating the other outcomes from being obese. Of course if our healthcare system was focused on prevention more than treating once disease presents it would be less expensive overall, but private entity’s are unlikely to take a lifetime view of patients health, and thus ability to generate tax revenue.", "label": 0}
{"text": "It is a way for people to continue eating extremely poor diets, but caps their intake to avoid binging/obesity.  \n\nThis stuff is really bad for people if they don't change what they eat, especially if pushed as a first option.\n\nEating less poison is not good.. it's less bad. Avoiding poison would be good.", "label": 0}
{"text": "It is but those also has more effects that affect weight loss other than magically making you not want to eat, that is what a lot of people understand when they hear about appetite supressors", "label": 0}
{"text": "Just be careful, Pepto (bismuth) kills your entire gut biome, worsening all gut related issues until it is restored.", "label": 0}
{"text": "Drugs? Look, if you want to get mondo juicy the natty way,  all you gotta do is Tren hard, Test your limits, keep your eye on Dbol, eat Clen and drink plenty of water. Seriously, drink a lot of water because your kidneys are going to be pretty tapped out.", "label": 0}
{"text": "I'm not arguing Econ 101, I'm saying it is repugnant to the point it should qualify as mental illness to think that is a good system.", "label": 0}
{"text": "The stigma will fade with time. The world just needs time to adjust to a new reality.", "label": 0}
{"text": "Other fun link for lurkers: https://en.wikipedia.org/wiki/Orders_of_magnitude_(time)#Less_than_one_second\n\nThe Slow Mo Guys operate supercamera https://www.youtube.com/watch?v=7Ys_yKGNFRQ", "label": 0}
{"text": "False dichotomy. 3rd option: avoid ultra processed food altogether.", "label": 0}
{"text": "100% Have been listening to the book Ultra Processed People and its criminal what these companies have gotten away with.\n\n [Nestle sail a ship down the Amazon](https://www.seattletimes.com/business/nestl-to-sail-amazon-tributaries-to-reach-consumers/) selling their crap to new markets and locals and can proudly take the title of the company that created the first ever type 2 diabetes cases there.", "label": 0}
{"text": "You gotta put a sarcasm tag on that. Some people are actually that dumb", "label": 0}
{"text": "Yes!  You nailed it.  I would stay on semaglutide for the mental freedom alone.  I had some unrelated GI issues so backed off for a couple of weeks and didn't realize how FREE I had felt from this constant chatter about what/when/how related to food and drink.  \n\nOn semaglutide, if I want to have some ice cream at 10 pm, I do it.  When not taking it, I will go back and forth about that ice cream for hours with all sorts of thoughts and emotions and end up mentally exhausted and ultimately feeling guilty for eating it.  \n\nI'm so happy that things are going so well for you!!!", "label": 0}
{"text": "Huh. so sounds you’re okay with a lack of action / dopamine or something that’s cool. Nice", "label": 0}
{"text": "I've been recommended this, but my insurance refuses to pay. 🫤", "label": 0}
{"text": ">It’s not misleading, it’s patently true. \n\nSomething can be true and misleading at the same time.\n\n>The pharmacy itself is regulated (again, not the specific medication). Their processes, cleanliness, ingredient sourcing, etc is regulated.\n\nSo, like I said, it's regulated.\n\nYou're trying to use wordplay to scare people. Individual compounded medications are not regulated because the pharmacy itself is regulated to make sure it's not selling unsafe medications.", "label": 0}
{"text": "Your incredible wisdom astounds me. Just avoid processed food altogether. You've solved the obesity crisis all on your own!", "label": 0}
{"text": "I just spoke to my doctor about it as I am at a weightloss impasse (no, I am not grossly overweight but I would like to lose more for my health) and I got told because of a minor issue with gastroparesis that I have, I cannot take it.", "label": 0}
{"text": "Would love some studies on BPC-157. Also seems to have a ton of potential. ", "label": 0}
{"text": "My friend's mom had a stroke shortly after getting on it.\n\nIt could be a coincidence, but I'd be interested to see if anyone else has had these issues", "label": 0}
{"text": "Wow. It's a life saver for you then. Remarkable.", "label": 0}
{"text": "It’s been around 20 years", "label": 0}
{"text": "Well. Cancer is a separate mortality rate that is possibly going to overtake cardiovascular disease if we paid more attention to cardiovascular disease. \n\nI don't know what you mean by organ issues, but everything else is just issues. Not related to mortality. \n\nThe best way to talk about obesity is just say, \"It is a preventable comorbidity, like smoking.\"", "label": 0}
{"text": "Can someone explain how serious the consequences are for people who have thyroid cancer in their family history? Because that is the only reason why I am not still using GLP-1 drugs.", "label": 0}
{"text": "This study is really interesting about binge drinking..\n\nhttps://www.niaaa.nih.gov/news-events/research-update/semaglutide-shows-promise-potential-alcohol-use-disorder-medication", "label": 0}
{"text": "Because the oversimplification is useful for the lay person, but for us looking for deeper answers and information. All of these discoveries are valuable stepping stones to unknown horizons.", "label": 0}
{"text": "[yep link here.](https://www.hcplive.com/view/glp-1-receptor-agonists-improved-psoriasis-despite-diabetes-mellitus)", "label": 0}
{"text": "Are all those things often comorbid with being overweight, or so you mean even controlling for that, it still reduces them?", "label": 0}
{"text": "I don’t have an issue with GLP-1s, and I’m personally considering using them, but I get where others are coming from.\n\nI’m in Japan right now for vacation, and the obesity rate is far lower than it is in the US. As far as I’m aware, GLP-1s aren’t widely used. What I have noticed is that people have access to low calorie, nutritious foods, and are able to walk around and use public transportation to get to most places. Oh, and portions are WAY smaller here.\n\nI’ve personally been walking over 20k steps per day while exploring the cities, and while eating comparatively light.\n\nThe point here is, there are deeper issues that still aren’t resolved just by GLP-1s. Not saying they aren’t incredibly useful, they clearly are, but I hope we also continue to improve other aspects of our country more fundamentally so that people can more easily be fit and eat healthy. These drugs right now are not cheap, and are something that might be out of reach for many for a while.", "label": 0}
{"text": "Can’t believe I didn’t see that before! 😂", "label": 0}
{"text": "> They will see no health benefits, but they will still see any side effects.\n\nThat may not be true.  There may well be health benefits, based on some of the other studies currently in progress (though we don't know for sure yet), as we've seen some positive results that are not linked to the weightloss aspect.", "label": 0}
{"text": "Your comment made me happy when I am excruciatingly sad today! Love to see things working out for people.", "label": 0}
{"text": "I haven't tried these drugs yet but see addiction behaviors as driving my overeating. I used to be pretty alcohol dependant and the whole cycle I have around food is near identical. \n\nGreat to hear your positive outcome and many others here. I might get past my pastry addiction yet...", "label": 0}
{"text": "For the record, I am a physician / MD with a clinical informatics board subspecialty and NIH postdoctoral fellowship.\n\nThere may be more to the case that may predispose him for pancreatic CA (e.g., history of pancreatitis), but publications on GLP-1 and pancreatic CA demonstrate no increased risk attributed solely to GLP-1 agonists so far.\n\nAlso, a lot of primaey care physicians do no not have enough bandwidth / free time (or care for some) to read the latest evidence, especially a nuanced topic like this. Consult an endocrinologist :p \n\nTo your credit, lots of internet comments are false or have misinformation. That's why I have a citation and reference for each to back up the information.", "label": 0}
{"text": "Also, it has to subsidize all the research that didn’t make it into the market, but yeah, 1300 usd is nuts.", "label": 0}
{"text": "This is a common misconception, but it's not true.\n\nWeed is not nearly addictive as many other substances, but it still can be addictive to a degree, and if you are a heavy user you can eventually get to a point where you become physically dependent. Withdrawals are not nearly as bad as other substances, but they still exist. No, they are not just \"psychological\" like alot of people say. \n\nI was an extremely heavy user for 8 years, and i would experience Vomiting, the shits, sweating, lack of appetite, couldn't sleep, and my blood pressure + heart rate would be high when i'd quit. I'm talking a resting heart rate of like 120-130bpm. \n\nThe first 5 days would be quite shitty, and then they'd fade away gradually over the following week or so. No my weed wasn't tainted. Obviously it wasn't nearly as bad as something like benzo withdrawal, but it still sucked and was very real.", "label": 0}
{"text": "That fuckin Gila monster had the goods this whole time and was just chilling", "label": 0}
{"text": "15 years from now wait for the radio ads about taking Ozempic and developing some horrible die effect that will kill you and joining a class action lawsuit.", "label": 0}
{"text": "Yep, they sell it for $200 elsewhere", "label": 0}
{"text": "Gates will get on a rocker to demonstrate how many pages of paper will this store", "label": 0}
{"text": "Unfortunately PCOS is not on label yet, my wife was denied 3 times by our insurance for coverage. She eventually got so distraught over it she dropped it. Can’t blame her when insurance basically says “Have you tried eating lettuce?”", "label": 0}
{"text": "Rewilding is highly unlikely. Nearly all farmland is privately owned, and those owners aren't just going to walk away. If localized food production became more cost-efficient and put traditional farming out of business, the landowners are still going to sell that land to whomever will give them the highest return. That's probably going to be investors and developers.", "label": 0}
{"text": "This is the dumbest thing I’ve read on Reddit in a long while.", "label": 0}
{"text": "I lost all my weight right before these hit the market but god damn if I'm not excited for people who need it", "label": 0}
{"text": "Do you know if tirzepatide is showing these same benefits or is it just semaglutide?", "label": 0}
{"text": "I’m sure that’s going to happen. It’ll be used for some other capitalist idea", "label": 0}
{"text": "Man you’re talking about solving the root cause of the issue and you get down voted into oblivion. Can’t believe how far I had to scroll to see this take.", "label": 0}
{"text": "My money would be on them having share positions in Novo Nordisk, the USA is paying Novo about 10 times the amount as the UK for a single person's prescription of Ozempic. The more money to Novo, the more the shares are valued. \n\nPoliticians shouldn't be allowed to hold share positions.", "label": 0}
{"text": "Holy shit why don't I just take it too? I already smoke weed why can't I just inject GLP-q’s", "label": 0}
{"text": "Almost like being obese is bad for you", "label": 0}
{"text": "> Why not do the first and later on introduce the pharm in lowered doses to achieve the same outcome? My point is solely using a pharmacological agent for something that can be sufficiently managed with lifestyle changes is a poor first line.\n\nAre you one of the people that uses the same argument for birth control - just use more willpower and only have sex when you want to have a child.  Sure, emergency intervention in the case of rape, but elsewise - use willpower.  \n\nMany people are not consistent on this regard, and all for birth control, PREP, and condoms (interventions that allow you to have sex recreationally without negative consequences) but then harp on willpower when it comes to obesity.", "label": 0}
{"text": "You’re getting a lot of replies of people’s positive experiences with the drug so to offer you the opposite perspective, the effects only work while you are actively taking the drug. Many people have spent a fortune on it to just immediately gain all the weight back after they stop taking it. Not saying you shouldn’t consider it but you definitely shouldn’t if you aren’t willing to plan for how to stay in shape without it afterwards.", "label": 0}
{"text": "Why would investors and developers buy a bunch of land far from any jobs that can't be used for farming? Are a bunch of people really that interested in moving to the middle of nowhere in Iowa and Nebraska?", "label": 0}
{"text": ">We need nationalized health care.\n\nWhat makes you think that would make a difference?  As of today Mounjaro/Zeopbound are not available for weight loss in the UK under the NHS. \n\nMy private insurance in the US covers it for a 20$ copay.", "label": 0}
{"text": "Peptides as a whole are \"generics.\" It's funny watching people think this was a scientific breakthrough, when it really is just Diet Steroids. Bodybuilders have been using peptides for performance enhancement for over a decade, and these drugs have been sold as Research Chemicals for a long time now. Now that they've found one that barely requires the lifestyle changes necessary to lose weight \"the normal/original way,\" peptides aren't the devil anymore. I've been injecting peptides for several years to reduce scar tissue buildup and restore mobility to a smashed shoulder.", "label": 0}
{"text": "Equating childbirth/conception to obesity is retarded. Got nothing else to say to you!", "label": 0}
{"text": "And this exact type of thing, just around food, is what made losing weight so hard for me. It was like I was in nicotine type withdrawals 24/7/365 but for food, on top of being hungry as well.\n\nI could not stop thinking about food ALL the time. It consumed me entirely.", "label": 0}
{"text": "The compound semaglutide is the same drug as ozempic and is a generic ozempic for all intents and purposes.", "label": 0}
{"text": "From author - This robot is designed to assist individuals with the American Spinal Injury Association (ASIA) Impairment Scale – A (complete paralysis) grade injuries, which represent the most severe level of paraplegia. Its development purpose differs from other rehabilitation therapy and muscle strength assisting robots currently supplied nationally by Angel Robotics. KAIST announced the WalkON Suit 1 in 2016 and introduced WalkON Suit 4 in 2020, increasing its walking speed to 3.2 km/h, which matches the normal walking speed of individuals without disabilities. Additionally, it showed the ability to navigate obstacles like narrow passages, doors, and stairs encountered daily. However, it has the same fundamental problem that all wearable robots face: they require assistance from others to be worn. Once you wear the robot, you can walk.", "label": 0}
{"text": ">legal difference\n\nYou said \"legal terminology\". \n\n>\"chemically identical\" means\n\nThat is not what chemically identical means.\n\n>Do you think your local Walmart pharmacy is unsafe\n\nRetail and compounding pharmacies are not the same type of medical practice. Totally different. They're not subject to the same regulatory standards. Retail pharmacies dispense pre-made, FDA-approved medications. Compounding pharmacies create custom medications using raw ingredients. Walmart does not compound Semaglutide lmao. Yes, the lack of regulation for compounding pharmacies makes them fundamentally less safe. While I'm glad the option exists and is a net win for users, it's not good enough.", "label": 0}
{"text": "This is exactly what they are hoping for as well. Insurers can make the moral willpower argument and get away with not paying for it.", "label": 0}
{"text": "> Well if you stop taking ozempic - you gain the weight back. unless you get your workout and eating habits in check.\n\nYeah, but that's the same for any way you lose weight - including purely lifestyle change. Stop doing it, and you gain the weight back.", "label": 0}
{"text": "This is interesting, but I have serious questions regarding the feasibility. If this project were feasible, why would we not use the same system to scrub CO2 from the atmosphere, because that would be the effect from scaling this up anyway. So, considering that would be significantly more impactful, why isn't that the headline? It doesn't make sense, unless the energy requirement is much bigger hurdle than they're letting on.", "label": 0}
{"text": "Sorry but this is incorrect, the only thing that matters is CICO. You are reading far too much into the OP's statement of 'on point' where they were clearly just talking about protein intake. There's a ***lot*** of high protein, high fat options - see basically any red meat for a quick example. Even chicken will still blow out your calorie budget if you eat enough of it. You seem to have a fundamental misunderstanding of what these medications do - they are an appetite inhibitor to be used for people with massively outsized appetites for their medically ideal weights. These use cases are specifically for people that are volume eaters. This is easily a problem while still hitting protein goals for an average gym-goer.", "label": 0}
{"text": "Automation is the answer to the inverse pyramid scenario.", "label": 0}
{"text": "I wouldn’t advocate for fasted cardio and not saying it’s sketchy. But the article wasn’t as informative as I thought it would be and a bit vague. In fact, it doesn’t source the study at all. \n\nThe line you quoted can be true but its not specifying if that’s just said as a general warning or if it’s actually from data from the study saying people loss muscle mass.", "label": 0}
{"text": "> I heard they can sell it for 5 dollars and still profit.\n\nDamn, you should go make some and sell it then.", "label": 0}
{"text": "Its because it tackles root metabolic problems around sugar processing, equalizing CICO to a normal persons baseline.", "label": 0}
{"text": "Side effects include shitting out your ears.", "label": 0}
{"text": "That is NOT a generic please delete you comment. That is a compounded medication.", "label": 0}
{"text": "Potato potato.", "label": 0}
{"text": "People do know there are other miracle drugs our there right? Acetaminophen, metformin, every station drug", "label": 0}
{"text": "This is completely false, that is a compounded version, and will disappear when the shortages resolve.", "label": 0}
{"text": "Better buy it up now then. 🤷🏻‍♂️", "label": 0}
{"text": "People take heart medication to get an erection. Just because a drug is first used to treat a specific condition doesn’t mean it can’t be incredibly useful for other conditions as well.", "label": 0}
{"text": "Then what the fuck are you talking about?", "label": 0}
{"text": "Could you post the source thats allowing you to say this?", "label": 0}
{"text": "In fairness antidepressants did the same for me", "label": 0}
{"text": "People are so fucking stupid good god", "label": 0}
{"text": "We don’t have healthcare, we have sickcare. We don’t focus on preventing disease, rather treating after it presents.", "label": 0}
{"text": "Only due to being listed as a shortage on the FDA list. Once the shortage is done, we'll have to wait.", "label": 0}
{"text": "They haven't been approved for use yet, but wegovy is available, and it's free.", "label": 0}
{"text": "This is really what needs to happen more than anything else. Its a reasonable, very achievable goal that we could get both parties to agree to.", "label": 0}
{"text": ">  Are a bunch of people really that interested in moving to the middle of nowhere in Iowa and Nebraska?\n\nA substantial part of the population would happily flee the cities for rural living if land costs declined enough to make that feasible. Particularly if AI advancement works as predicted and UBI becomes a thing, which has the potential to decouple work location and physical location.", "label": 0}
{"text": "I could not resonate with this more. This is the situation precisely.", "label": 0}
{"text": ">Particularly if AI advancement works as predicted and UBI becomes a thing,\n\nLmao ok", "label": 0}
{"text": "Of course. And in Europe price negotiations ensure that they make a profit, accounting for these costs, and the drug costs $250/month there.\n\nWith a profit.", "label": 0}
{"text": "I appreciate you trying to defend compounded medications. I take compounded tirzepatide and did a ton of research before starting it. But you’re fundamentally wrong or maybe not understanding what I’m saying. Regulating facilities, people, and processes is NOT the same evaluating and approving medications. The FDA evaluates medication over many years to get a safety and efficacy profile for a medication. Compounded medications do NOT receive that evaluation by either the FDA or states AKA they are not approved by the FDA. That’s not misleading in any way. \n\nUsing your logic, the FDA approval process should just go away because the facilities, personnel, and processes are already regulated for all medications. Are you suggesting the FDA medication approval process is useless and/or should be removed?", "label": 0}
{"text": "This will undoubtedly be as trillion dollar drug. People will need it for life. It’s basically a panacea with minimal side effects. This is the holy grail of drugs from a pharma perspective. \n\nI’m sure in 10 years we’ll have ads like “if you or a loved one has ever taken Ozempic, call us now”", "label": 0}
{"text": "Bullshit. Fast food is more expensive than home cooking now. The reason is lack of time, habit, and addiction.", "label": 0}
{"text": "Those damn evil drug companies… /s", "label": 0}
{"text": "They still might.", "label": 0}
{"text": "You can't store more on a DVD without deviating from the given specs. When dual layer came out, many players already sold had issues with them as it was. You can't just pack data more densely and expect existing players to read it. \n\nTo increase the density, they had to change some methods and laser type... which led to HD-DVD and Blu-ray. They were equipped to be backwards compatible, but that was an intentional choice, the tech is inherently incompatible without some extra work done to the later generation disc players. This is the same as DVD did to CD technology. You could fit a Blu-ray disc into an old discman, but it won't play it.\n\nSo, the closest thing to a DVD that holds more data is what we have, Blu-ray.", "label": 0}
{"text": "Your absolutely so uninformed its absurd. The difference is immense.", "label": 0}
{"text": "Sure it's a miracle drug, but it's not a real permanent solution. I know it's exciting for.many people, what should excite you is the reliance on it. Everyone is hailing this pharmaceutical product as a new golden age is fucking weird, and sound eerily close to the way the companies that make this drug sell it.\n\nSure it's great...but you if you need to take this drug to get healthier, then you'll always need to take this drug. You are no reliant on it. I can't imagine anything shittier than relying on such a medication to do everyday what your body should be doing naturally on its own. A pill is not a replacement for a healthy diet and exercise, sorry not sorry.\n\nSame reason I don't fucking take Tylenol or imodium every other day, it's not good for anyone to become so reliant on a chemical injection in order to be functional. I reckon there will be side effects that emerge once use of these drugs become increasingly widespread as they've never been before on such a scale.", "label": 0}
{"text": "The current access to the generic semaglutides are helping millions of people lose weight and are killing the obesity epidemic in America without bankrupting middle class families. I know because I’m one of them. They work. It’s the same shit.", "label": 0}
{"text": "It’s not different for you, you just have poor impulse control", "label": 0}
{"text": "I suspect there will be a roll for orbital space tourism, but it's going to take a while\n\n\n\nGoing to space has some pretty severe downsides. Being in zero G is very very bad for your health. Being in orbit exposes you to considerably more radiation than on earth. Currently your chance of blowing up to/fro is ~2%. \n\n\nCertainly the 2% \"you blow up\" problem will be an impediment for most people. \n\n\nI would guess the needed tech is, in no particular order:\n\n\n- Significant developments in rocket safety. \n- ability to cheaply get a lot of mass into orbit (ie, new primary energy supply) \n- space-engineering able to make a decently sized spinner to give gravity without people throwing up when they turn left. \n\n\nSo maybe 100 years or so?", "label": 0}
{"text": "What an original and relevant insult.", "label": 0}
{"text": "Bro you are an idiot.\n\nSemaglutides? As if there is more than one? There are many GLP-1 agonists but only one semaglutide.\n\nThere are zero generic GLP-1 drugs in a weight loss formulation available. ZERO. You are NOT taking a generic GLP-1 drug. You are taking a compounded version and it will be taken from you soon sadly.", "label": 0}
{"text": "You can already buy cheap commodity semaglutide online. It’s just labeled “for research use only.”", "label": 0}
{"text": "I'd rather grow old with less bone density (if this is true) than die fat at a young age.\n\nI had just turned 49, 6'2\" and both muscular and fat - stereotypical former athlete with a dad bod.  I was pushing 300#  \n  \nA year later, all my bloodwork is A+, no longer pre diabetic, blood pressure is perfect, and I am down 100 lbs.  Did I lose muscle? Yes.  Am I happy with the trade offs?  100% yes.\n\nWeird how everyone is quick to judge and stigmatize GLP-1s and hand out waivers for people on anti-depressants, it really baffles me.  Both are just course correcting chemistry inside the body.", "label": 0}
{"text": "Another sane human thank god. Good lord it drives me up a wall. They spout it as if their word is gospel.", "label": 0}
{"text": "I’d go a step further. Pharmaceutical companies profit from keeping us sick. If prevention were the goal, we’d focus on healthy food and real lifestyle changes—not expensive, lifelong drugs. The system isn’t broken by accident; it’s designed to treat symptoms, not causes, because cures don’t generate profits..", "label": 0}
{"text": "Semaglutides as in the compounds available from the dozens of outlets that are currently selling it.", "label": 0}
{"text": "Awesome. I remember seeing an “exosuit” for the first time about 10 years ago at a PT convention. Would love to see these widely used, if that’s at all possible.", "label": 0}
{"text": "Well technically its not an amphetamine, its actually inert. Until its metabolized into dextroamphetamine lol", "label": 0}
{"text": "Can you do telehealth with someone in your state?", "label": 0}
{"text": "The powder may take more energy to be made then what it would sequester.", "label": 0}
{"text": "I started going to the gym 6 months ago but also started mournjaro this week, hoping to avoid loose skin to an extent", "label": 0}
{"text": "I'm just sad that I can get approved with insurance, but not a single pharmacy has it available here. Mail also isn't a solution because of where I live.", "label": 0}
{"text": "I can definitely see why robot guards would be an Improvement in several ways. I'm not doom and gloom because a technology exists, but I am doom and gloom about the systems of power, and the deeply flawed humans running them, and the things they will do with the technology.", "label": 0}
{"text": "Wow another pop sci article that incorrectly describes quantum entanglement.", "label": 0}
{"text": "Zepbound > wegovy.  \n\n* maintenance dose may be reached faster with Zepbound\n\n* Wegovy might cause more headaches\n\nhttps://www.drugs.com/medical-answers/how-zepbound-wegovy-compare-3577132/\n\n\n> Patients taking the highest dose of Zepbound lost around 21% of their body weight over 72 weeks, compared to around 15% for patients on Wegovy after 68 weeks. \n\n\nhttps://www.nbcnews.com/health/health-news/zepbound-outperforms-ozempic-wegovy-head-head-weight-loss-study-rcna160630\n\n\nI would rather pay $20 for Zepbound, than free wegovy.", "label": 0}
{"text": "China ones are \"generics\" tho", "label": 0}
{"text": "Thank you for sharing.  \n  \nI am in the same boat.\n\nIt changed my life.  I never had control of the volume knob regarding food.  I was constantly focused on my next meal, how to portion, what to eat, and then would feel badly about my lack of self control.  \n\nA year later lost almost 100lbs, now down to 204 (at 6'2\") and I wish that I had this option 25 years ago.\n\nI think 10 years from now, all of the negative stigma surrounding GLP-1s will be gone.  I believe that it will be accepted like antidepressants.  Just a tool to correct chemistry in the brain/body.\n\nDoctors are beyond happy with how it changed my lab work, blood pressure etc.  In their opinion, I have easily added 10+ years to my lifespan.  With kids, this is a gift.", "label": 0}
{"text": "Noom sent me a deal in email for $149 for the compounded medication and their program combined. It’s my backup if insurance doesn’t work", "label": 0}
{"text": "Do what’s best for your health! Wishing you luck!", "label": 0}
{"text": "> Regulating facilities, people, and processes is NOT the same as evaluating and approving medications. The FDA evaluates medication over many years to get a safety and efficacy profile for a medication.\n\nYes, and the FDA has approved tirzepatide. Compounding pharmacies could not sell tirzepatide if the medication had not been approved by the FDA.\n\nThe fact that the FDA has not specifically approved \"compounded tirzepatide\" doesn't matter, since that's not a thing the FDA approves.\n\nThe FDA also doesn't approve Big Macs, but every ingredient in every McDonald's burger is FDA approved, is made in a government regulated facility, and is cooked and assembled in a government regulated restaurant. Saying \"Big Macs are not FDA approved\" is true, but it's pointless and does nothing but scare people into thinking \"why are Big Macs not FDA approved, is there something wrong with them!?\"", "label": 0}
{"text": "It would help if you named your insurance and the program in bold", "label": 0}
{"text": "I can”t wait to buy this shit. it takes so much effort not to eat!! To keep my body weight down, i have to hit the gym 7 times a week. All I think about is food. It’s a nightmare a takes a lot of my brain cycles. \n\nI want to be free", "label": 0}
{"text": "The following submission statement was provided by /u/AdditionalDate1687:\n\n---\n\nFrom author - This robot is designed to assist individuals with the American Spinal Injury Association (ASIA) Impairment Scale – A (complete paralysis) grade injuries, which represent the most severe level of paraplegia. Its development purpose differs from other rehabilitation therapy and muscle strength assisting robots currently supplied nationally by Angel Robotics. KAIST announced the WalkON Suit 1 in 2016 and introduced WalkON Suit 4 in 2020, increasing its walking speed to 3.2 km/h, which matches the normal walking speed of individuals without disabilities. Additionally, it showed the ability to navigate obstacles like narrow passages, doors, and stairs encountered daily. However, it has the same fundamental problem that all wearable robots face: they require assistance from others to be worn. Once you wear the robot, you can walk.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1gc4bw8/scientists_develop_a_wearable_robot_that_walks/ltqum7n/", "label": 0}
{"text": "I’m guessing you missed the comment about me saying I’ve lost over 100lbs - no drugs, no gimmicks, no cheats. Vegetables, cardio, and the gym with consistency. I went to my share of drive thru’s to get to the weight where I started. \n\nI’m also guessing you glossed over this drug just about killed my dad. He “wanted to be at his high school weight” and has diabetes so he was prescribed it by his physician. He had to have some of his intestines removed due to frozen bowl. It’s a known side effect of Ozempic.  He wad in the ER touch and go for a week. Your life isn’t worth a dress size.", "label": 0}
{"text": "I’ve been saying since it came out that ozempic is the fountain of youth and it’s going to add not only years, but GOOD  quality years to human lives.   \n\nI’m only 37 and have no health issues but I wanna get on this stuff.", "label": 0}
{"text": "Exactly. The fact that real solutions get buried while pharmaceuticals are praised shows how deep their influence runs. The people running these companies are no different from defense contractors profiting off war—they exploit suffering for profit. But instead of bombs overseas, their influence is in every home in America, pushed as a necessity and even celebrated. They don't want cures any more than defense contractors want peace—both thrive on dependency and destruction. Until we address the root causes, like our broken food system, this cycle will keep repeating, with the public paying the price.", "label": 0}
{"text": "Is there a source for that? Very happy if true but I haven’t seen that yet", "label": 0}
{"text": "I’m not saying you can find respectable studies, but most people have no idea how to gauge whether a study properly controls for variables or what it’s limitations are, or whether it was conducted by people with competing interests, for example. ", "label": 0}
{"text": "I'm sure you go to bed as soon as it's dark. Sleeping has a lot to do with light.", "label": 0}
{"text": "This is /r/futurology, after all. \n\nBut, seriously, UBI probably has a better chance of happening than the widespread rewildilding of the midwest.", "label": 0}
{"text": "Sorry I already know how this will play out. Our food we consume will become even more filler junk. This is a symptom of the problem. The problem is we quit eating whole foods", "label": 0}
{"text": "If you change ozempic to adderall you get the same story. It’s an effective drug, but that is not how normal people feel about food", "label": 0}
{"text": "I agree sodium battery tech seems superior from a usability perspective but the market receives new technology based on sentiment. There is a reason that despite blimps being an efficient mode of transportation, they are rarely used. \n\nIf you think a Li battery fire is bad wait until a sodium battery fire/explosion happens. Sodium has the potential to be the Hindenburg of battery tech and unless sodium battery manufacturing is compatible with no battery manufacturing, I can see big Li doing to sodium batteries what bit oil has done to green energy for several decades.", "label": 0}
{"text": "Earth will not be livable in 800 million years as the sun heats up as it nears the end of it's life and before it turns into a Red Giant. So there will be no living species on earth in 800 million years plus. In only 2 million years humans will have evolved into something else, so if we are talking about humans beings, better to ask what it will be like for humans in 5,000 years 50,000 years or 300,000 years.", "label": 0}
{"text": "You’re assuming that folks that are in shape/exercising are more motivated than the average fat man to lose weight.\n\nThat simply might not be true. They just have different habits, lifestyles, comforts, and traumas built up over the years.\n\nThe skinny person may be raised to find solace from stress in the gym or playing sports, or in the act of getting healthy itself. The activity itself is the pursuit of health, so that’s great. The fat person may be primed over the years to find solace in a greasy burger or alcohol, and that sucks for them.", "label": 0}
{"text": "They wouldn’t rewild the land.  Not in the u.s. They’d drill on in or run pipelines for oil and gas across it and pay farmers for their land use or buy it outright", "label": 0}
{"text": "I absolutely agree with you on this! My bad for misinterpreting what you said :)\n\nMore scientific education and rigorous journalism is definitely needed in this world.\n\nSocial media as a source for science fact is the worst, especially influencers with conflicts of interest, and those failing to understand cognitive bias (e.g., Dunning-Kruger Effect)", "label": 0}
{"text": "It cured my severe anxiety. I think because hunger creates cortisol, and this reduces me hunger to basically zero.", "label": 0}
{"text": "I started it 2 weeks ago. I am not crazy overweight but I snack enough between meals that I can’t lose it despite running about 20 miles a week. Instantly it made all of those snack cravings end. I only want to eat at meals now. My craving for alcohol has also gone down. I still drink but now I’m at least weighing if I really want it or not. Once I get off this starter dose and onto the full amount I suspect I won’t want it at all. As a result of all of this my sleep is soooo much better because I won’t consume calories after 7pm simply because I don’t have an urge to. I honestly think in 20 years this will be perceived every bit the miracle drug that insulin eventually came to be. There’s so many health problems that simply don’t exist by virtue of eating and craving less, it won’t surprise me when healthcare companies prescribe it proactively in order to reduce high cost treatments later in people’s lives.", "label": 0}
{"text": "Now if only insurance would cover it for people w/out diabetes. Tried to get some but because I dont have the beetus, it's full price for me.", "label": 0}
{"text": "Collagen lots of water and working out. God speed.", "label": 0}
{"text": "That's an enormous drop. Good work.", "label": 0}
{"text": "This is 4x more efficient than that process because you're skipping photosynthesis.\n\nBut the thing you're imagining with current solar panels converting 25% of sunlight to electricity then 90% of electricity to the most efficient light frequencies is actually about as light-efficient as doing photosynthesis directly.", "label": 0}
{"text": "What? The sun just gives energy", "label": 0}
{"text": "Mounjaro is comparatively more effective than Ozempic at promoting weight loss and there's a good reason for this. In short, it's because mounjaro is a biased agonist of the GLP-1 receptor, unlike Ozempic.", "label": 0}
{"text": "Does it really? I need a source on that, can't find it on google.", "label": 0}
{"text": "Ozempic is the brand name and semaglutide is the active drug. It's not a \"safer alternative\" it's what's *in* Ozempic.", "label": 0}
{"text": "but that goes against capitalism", "label": 0}
{"text": "Why would we do that", "label": 0}
{"text": "Einstein called it “spooky action at a distance”. What is he stupid!?", "label": 0}
{"text": "> Current optical memory storage methods such as CDs and DVDs \n\nCurrent? Those aren't \"current\".\n\nIf we're only talking 1000x the storage of a CD, that's less than the tiny 1TB microSD you might already have in your phone. And 8TB cards are already on the way, 2000x a DVD.\n\nEven if it was 1000x a BluRay (25GB), that's less than 1 millilitre of microSD cards.", "label": 0}
{"text": "> most of it is around the middle which is the most dangerous kind.\n\n\nCheck yourself for diastasis recti, an issue with the abdominal muscles that presents as beer belly in men and mom pooch in women. If you have it, physical therapy can often resolve it with no diet necessary.", "label": 0}
{"text": "Il be honest, I hate this. The idea that when I’m having a panic attack I want people to know furthers the anxiety that leads too it. I try to pretend i don’t have anything wrong and just avoid highly stressful situations where possible", "label": 0}
{"text": "Night and day with anxiety and depression. I have never in my life experienced a more sudden and powerful change in my mood, and it was immediate and lasting. Months now after a literal lifetime of deep depression. The flip side is it gives me terrible gastrointestinal discomfort and at times insane burps that smell like the bowels of hell. And they linger. I’ve cleared rooms with ozempic burps.", "label": 0}
{"text": "Comparing a Big Mac to medication is actually wild lol I’m gonna just let you have the last word on that one. \n\nI tell you what. Go ask the FDA/state regulating agencies/or compounding pharmacies if compounded medications are in any way approved by the FDA to be safe and efficacious. Then come back and let me know what they say.", "label": 0}
{"text": "To be clear, I still enjoy a good meal while I'm having it. And I'll still snack on junk  if it's available. It's just that when I'm not eating, I'm also not often thinking about food.\n\n\nWhen I am super hungry I'll crave a meal, but I usually don't care much what it is. It's the feeling of 'not hungry' that I'm looking forward to more than the actual act of eating. Having to stop whatever I'm doing to eat usually feels like more of an inconvenience than a reward.", "label": 0}
{"text": "Oh ok so I'll just have to renew my subscription to body positivity then. I can't afford an extra $250 a month.", "label": 0}
{"text": "How the hell would I do that lol.", "label": 0}
{"text": "How does one get a prescription for it and how does one afford it?", "label": 0}
{"text": "Thanks for this, it's definitely one of my main concerns. Especially since my own situation is not one of huge excess or significant lack of control, just what I imagine is pretty normal (for modern life) levels of eating a little bit too much for my height and activity and sometimes a little bit unhealthily because it's more convenient (or tasty). My experience in the past has always been the slow creep towards where I am now as soon as I stop with the active efforts to move from a point, so i don't see why a medication would be different, and I certainly don't want to pay for an anti-fatass injection forever.", "label": 0}
{"text": "If it helps, since I started it my food and drink spend has plummeted. Spent well over $1000 less this month in food and drink for the low cost of $250.", "label": 0}
{"text": "I'd wait for the next generation. The stuff in clinical trials today appears to work better with fewer side effects. Given the amount of attention and focus these drugs are getting, there's a lot of room for refinement that's happening right now.", "label": 0}
{"text": "Body builders have been using semaglutide since it very first hit the market. They use it to cut. ", "label": 0}
{"text": "And yet in most of the developed world universal healthcare is normal, and those systems typically focus more on prevention as it’s more cost effective. The real issue is the politicians making the legislation, as we are seeing with recent FCC rules business wants can be overruled with government action.", "label": 0}
{"text": "I have an eating disorder. I am on eating disorder subreddits. Tell me why the algorithm decided I need to see literally EVERY SINGLE POST/AD ABOUT OZEMPIC", "label": 0}
{"text": "Could it be because people are eating less processed food?", "label": 0}
{"text": "If I spent $1000 less on food a month I'd be spending -$700. I could probably afford ozempic if that happened.", "label": 0}
{"text": "That reminds me of the Y-17 trauma override harness from Fallout New Vegas. It was designed to retrieve injured soldiers and walk them back to base but by the time you find them they're full of skeletons walking around and trying to kill you.  \nAlso reminds me of that one Dr. Who episode where they're in the big library and the shadows are alive and they go into your spacesuit and you're just left with a murderous skeleton in a suit", "label": 0}
{"text": "When you see GLP-1, are they all the same? Like is Ozempic different than Wegovy?", "label": 0}
{"text": "For many people these drugs are free with insurance", "label": 0}
{"text": "Wish I could fucking get it lol. I’m short and skinny fat so despite having an obese torso my total BMI won’t qualify me anywhere and it costs like $1000 a month to buy it non prescription from anywhere that isn’t sketchy af.", "label": 0}
{"text": "Hello, /u/Few-Butterscotch2324! Thank you for your participation. Your submission to /r/futurology has been removed because your account is less than 5 days old.\n\nWe have instituted this rule as an unfortunate but necessary anti-spam and anti-troll measure. In the meantime feel free to comment on any submissions in this subreddit if your account is greater than 1 day old. Please [message the moderators](https://www.reddit.com/message/compose?to=/r/Futurology&subject=Question regarding the removal of this submission by /u/Few-Butterscotch2324&message=I have a question regarding the removal of this submission: [The Rise of China's Autonomous Flying Cars: A Glimpse into the Future of Mobility](https://www.reddit.com/r/Futurology/comments/1gc5zp5/the_rise_of_chinas_autonomous_flying_cars_a/\\)) if you feel that this was an error.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Futurology) if you have any questions or concerns.*", "label": 0}
{"text": "You can't find that opiates occupy the opioid receptors in the human brain on google?", "label": 0}
{"text": "6'6 and 280 doesn't seem that bad, I'm 6'4, and this time last year, I was 340. I've been on wegovy, and now I'm 245. \nI was still losing weight, but my waist went from 54 inches to 42 inches, and my chest went from 58 inches to 50 inches. \n\nI've still got weight I want to lose, but even when I was in my 300s, no one believed I was that big. I couldn't imagine being 180 lbs, though at my height.", "label": 0}
{"text": "Overeating and excess sugar can cause vomiting and what a friend described to me as \"a rocket ship shooting out of my ass\".", "label": 0}
{"text": "Supply has no problem keeping up. It’s artificially scare for profits.", "label": 0}
{"text": "Might give it another go. Ive tried it in the past, and I didn't really like it. Didn't find it useful at all.", "label": 0}
{"text": "Imagine these things hunting people down\n\nSneaks up behind someone, shoves them into it and just runs off somewhere with them", "label": 0}
{"text": "You don't get a trophy for doing things on hard mode.", "label": 0}
{"text": "From what I’ve read and heard it can be used to treat and alleviate fatty liver. Since it reduces your overall fat by making you eat less and enter a caloric deficit.", "label": 0}
{"text": "Do you have a link to the article?", "label": 0}
{"text": "I think it´s like a scrubber. You can release it in a container that creates calcites", "label": 0}
{"text": "Inattentive, hyperactive, or combined? I have combined, and while it hasn't changed the inattentive symptoms (thanks, Adderall), the hyperactive impulsive behavior has been *torpedoed*. It wasn't an expected effect, but I'm certainly not complaining. \n\nI've heard similar from other folks in the same position as well.", "label": 0}
{"text": "Have you considered how much money you would save by taking it? It costs me $340 in Australia each month and it saves me more on food reduction and coffees bought. I don’t have lunch so that’s a saving and make sure o eat at home at night. I have one coffee a day, because it’s loaded in calories so I easily chose not to have more, yay for better regulation. \n\nBetween all those things I’m making money by paying $340 a month for mounjaro. It may not be the same for you, as you may not be wasting as much money on food and coffee as I was, but it’s worth considering.", "label": 0}
{"text": "You don’t get long term results from taking fad diet medicine either.", "label": 0}
{"text": "[Food in Civilization - Carson Ritchie](https://books.google.co.th/books/about/Food_in_Civilization.html?id=hAahQgAACAAJ&redir_esc=y)\n\nGreat read!", "label": 0}
{"text": "I heard there were specific concerns for men becoming dependent on the medication as it functionally could make a man a diabetic.", "label": 0}
{"text": "I always wonder if this will work for me.  I’m 55, about 50-60 pounds overweight. I’m on blood pressure meds.  I’m very lazy when it comes to eating.  I eat fast food and takeout a lot because I’m too lazy/tired to cook.  Just because I’m not as hungry, I worry that I’d still make terrible choices , just not as often and so I wonder if it helps with that or not.  I suspect not.", "label": 0}
{"text": "It's the panic monster chewing at your fight or flight neurons.\n\nTry telling the people around you that you're having a panic attack and you need to step away for a bit.\n\nYou'll be surprised -- most people will be like \"OK do what you need to do, see you in a bit.\"\n\nIn all the time I had panic attacks, after I started telling people I was having them, there was not a single person who had anything negative to say.", "label": 0}
{"text": "That's been my experience. \n\nI drank socially and, frankly, often saw it creep up to more than just socially. Since starting zepbound I've lost any interest in alcohol. I'll have a drink with friends once I'm a while but have no desire for more than two drinks even then, which is wildly different.\n\nI'll also add that I quit smoking a decade ago and have craved cigarettes every. single. day. since I quit. It was only force of will that kept me quit. I... don't crave cigarettes anymore, not at all. \n\nI've dug up a few journal articles, but you're right in that the jury's still out. The general take on it today is that the effect appears to be real and may be GLP-1s affecting how we process dopamine.", "label": 0}
{"text": "As a stroke survivor and a retiree, I have a question? I have hemiplegia, a weakness and paralysis of my right side. How would I qualify for assistance with paying for these type of prosthetic devices or would I pay full freight. I see lots of devices that would make my life easier but either my insurance doesn’t offer them or they are out of my price range. How much would this exosuit cost and how would they pay for it.", "label": 0}
{"text": "Not sure if that’s accurate since it’s a drug used to treat diabetes. It regulates insulin and blood sugar levels. Regardless I’d suggest you ask your doctor about it.", "label": 0}
{"text": "Well said man, sums it up really well.", "label": 0}
{"text": "Look at Elon jumping around stages. Soon he'll do a Tonya Harding on Zuckerberg before challenging him to a fight.", "label": 0}
{"text": "Are they available for anyone yet or only the rich", "label": 0}
{"text": "bro you’re on reddit..please tell me you don’t think YOU are fun at parties", "label": 0}
{"text": "\"But it was meant for diabetics!!!!\"\n\nNobody cares. A lot of drugs were meant for something else.", "label": 0}
{"text": "Most of the corn we use in this country isn't food. For humans, at least. It's animal feed. So we would probably still see a lot of it grown.", "label": 0}
{"text": "I needed it for diabetes. Insurance wouldn't cover it due to the fact I hadn't been going to the doctor for 7 years. My a1c was 11.8. \n\nCost was going to be about 1000 per month, 400 for compounded. \n\nGrey/black market is about 30 bucks per month at the max maintenance dose. \n\nIf I avoid the doctor due to cost, 5k per year wasn't gonna be an option much less 12k. \n\nThat was 7 months ago. My a1c is now 5.1. \n\nThere are way to get it, but paying that much out of pocket should be criminal for the benefit it provides.", "label": 0}
{"text": " Semaglutide has been the best thing for my health in my 54 years of living. 100%. Nothing else is close.", "label": 0}
{"text": "Those are compound drugs, very different from generics and much less safer", "label": 0}
{"text": "Interesting, I should read it. At my worst I had them multiple times a week, over the past year I’ve had under ten, and I came to many of the same conclusions over time. Those closest to me are aware of my anxiety and have my back. I’m also now amazing in high stress situations because panic is an old friend of mine and I’ve learned to embrace it rather than run from it. Dread it, run from it, it’ll happen all the same. \n\nThank you for your thoughtful and insightful comment, I appreciate you taking the time to open up and share this.", "label": 0}
{"text": "This drug has been out for 20 years. It's also not a fad diet. You just eat less. That's medication assisted CICO.", "label": 0}
{"text": "I really do hope people dicks don’t start falling off in 10 years time or it creates some horrific blood clotting problems — idk.\n\nI know I sound like some nutcase from the [anti-electricity movement](https://www.reddit.com/r/Damnthatsinteresting/comments/11vdtbz/once_upon_a_time_there_was_an_antielectricity/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button) to new breakthroughs, but I think I just feel so jaded by the news coming out of the last 5+ years. These drugs just seem too good to be true. ", "label": 0}
{"text": "For poor people with poor people insurance? Doubtful. ", "label": 0}
{"text": "SAME! I lost 48kgs the old fashioned way and people assume I took the drug. So irritating", "label": 0}
{"text": "I don’t think that’s true for everyone. I started 6 weeks ago at .2 and it really didn’t do much for me at all. Now I’m on .4 and while I feel it a little more intensely, I don’t think I’m near where it’s intended to be. *Some* people definitely respond well to the starter dose, but not all for sure.", "label": 0}
{"text": "Farm towers farm towers farm towers!!!\n\nPlease let's just let the land go back to the way it was with no pesticides and forests and stuff ffs.", "label": 0}
{"text": "If it helps you feel better your face likely looks way better, all that buccal fat being depleted by the drug really does not create the best look.", "label": 0}
{"text": "As someone on it- I really don’t care. If I get cancer from Wegovy while thin in 10 years- well I was probably gonna get cancer and diabetes without it from obesity. \n\nObesity has so many health issues that it will honestly be hard for Wegovy to be worse.", "label": 0}
{"text": "This is why I take it and would continue to take it if it made me gain 50 lbs.  I lost 15 pounds and am perfectly content here (weight was creeping up due to menopause) but to have this FREEDOM in my head is absolutely thrilling.  I'm 51 and have never experienced this.  The headspace that it was taking up is incredible.  \n\nI get the compound version.  It's plentiful and cheap.  My husband tried it first and when it didn't kill him I decided that I'd give it a whirl.  I think that it will eventually be used for a host of maladies, including BED.", "label": 0}
{"text": "I've struggled with weight. Therapy helped a lot, and I get to do things like step on scales as a bonus too.", "label": 0}
{"text": "The decline of 0.29 from 3.9 to 3.61 from 2016 to 2023 is not a substantial decline. It is also not significantly different to the estimations for 3.95 in the PSLM 2007–08 survey, DHS 2012–13 that estimated 3.75 and the PDS 2020 survey that estimated 3.72. \n\nThe main premise that I was attempting to convey is that the birth rate in Pakistan has not greatly declined over the prior several years, and instead has witnessed an even lower rate of decline level relative to previous years.  In particular when Female education has not experienced a significant improvement. \n\n[Adjusted net enrollment rate, primary, female (% of primary school age children) - Pakistan | Data](https://data.worldbank.org/indicator/SE.PRM.TENR.FE?locations=PK)", "label": 0}
{"text": "My doctor won’t prescribe any glp-1s it’s frustrating", "label": 0}
{"text": "What do you mean? All opioids are derivatives of morphine and act on the same opioid receptors in the brain", "label": 0}
{"text": "If they start doing this where is the limit. Don’t circumvent the illumination process. Highly unethical and undoubtedly unauthorized with significant ramification. Must be a reason if it extinct and the natural course of nature was to be trusted", "label": 0}
{"text": "Yeah but losing weight naturally is by far the healthier option for those that can.", "label": 0}
{"text": "I’m using compound tirzepatide. $399 a month. Not great, but not name brand prices.", "label": 0}
{"text": "Youtube video \"How Entanglement Breaks The Universe\" by the Science Asylum seems to be fine.", "label": 0}
{"text": "Ignoring what you wrote but taking it literally, I’d fuck Venus and send Mars to fight for Ukraine.", "label": 0}
{"text": "Yeah, that cost is usually rolled into R&D cost analysis.", "label": 0}
{"text": "But the downside is you’re taking medication for the rest of your life. Taking the easy way out instead of putting in the work to make change.", "label": 0}
{"text": "I get compound for $399 a month. It’s nice, no talking to anyone, just texts. Gotta verify with ID and a full body pic. Comes from a compound pharmacy, Red Rock, I think.", "label": 0}
{"text": "I think it's just because it's trendy and in the news. People think about sci-fi movies and things where like a hot new drug takes the world by storm and has a dark secret. I don't think it's anything underlying for most people, obviously I'm sure some people have that extra prejudice but idk I think there's a simpler answer as well", "label": 0}
{"text": "I feel for Diabetics who are second in line to fatties that just can’t watch what they eat I guess. What an American problem lmao", "label": 0}
{"text": "Yes. But it won’t be democratic. It will be a corporate totalitarian government. ", "label": 0}
{"text": "I'm thinking about it, too.  There's a generic form you can get mailed to you from online doctors on certain websites.  I don't want to say the name but it's only like $100/mo.  I'm not sure if that's the cheapest option though, supposedly you can make a whole batch for a couple hundred bucks but I don't trust myself that much.", "label": 0}
{"text": "I strongly recommend you look into switching to Zepbound as soon as possible. What you're describing is a lot of what I experienced on Wegovy. I felt like shit. And my weight loss plateued pretty quickly. I was on Wegovy for about 4 months before I quit. I took a few months off before going back to my doctor to try Zepbound. The difference is astounding. The side effects are basically nonexistent for me. The food noise is completely gone. I don't only feel full, I don't *think* about food much. It's amazing. I've blown past my Wegovy losses and am continuing to lose weight.", "label": 0}
{"text": "That disorder/disease binary you seem to present in your second sentence is BS.\n\nADHD, for example, despite being a disorder, is caused by part of the brain being underdeveloped. There’s stuff you can do to treat it/cope with it, but nothing you can do to *fix* it.\n\nEverything else you said there might be completely correct, but you probably shouldn’t present it with that incorrect disease/disorder explanation.", "label": 0}
{"text": "An American solution if there ever were one to an American problem if there ever were one lol", "label": 0}
{"text": "Extracting CO2 from the atmosphere is practically impossible on an industrial scale. It's just too dilute.", "label": 0}
{"text": "An occasional injection is a lot easier than educating yourself and having willpower.", "label": 0}
{"text": "[https://www.statnews.com/2024/10/23/medicaid-wegovy-saxenda-glp-1-weight-loss-drugs/](https://www.statnews.com/2024/10/23/medicaid-wegovy-saxenda-glp-1-weight-loss-drugs/)", "label": 0}
{"text": "This is the entire future of our democratic experiment on the line. PLEASE have a look at the letter from the Nobel Laureates...", "label": 0}
{"text": "I lost a lot of weight in the last 6 months and I bet everyone thinks I was on Ozempic 😭", "label": 0}
{"text": "And it can give you very bad reactions that seem to be common, that no one is talking about.", "label": 0}
{"text": "I was a heavy drinker before Mounjaro; I don’t drink alcohol any more and I don’t miss it. And I’ve lost almost 60lb (still a way to go) with almost no bad side effects.  I spend less on Mounjaro than I used to spend on alcohol every month.", "label": 0}
{"text": "This is great! Hey maybe If we work only 3 days we can get even more work done. Perhaps even two days…lol #liesdamnliesandstatistics", "label": 0}
{"text": "These things are usually rechargeable. No one proposes a single use carbon scrubber as a climate solution. That’s just a tree.", "label": 0}
{"text": "10 yrs, its already happening with all the bad reactions that happening with it.", "label": 0}
{"text": "Oh, Berkeley [scientists](https://youtu.be/LVsqIjAeeXw?t=1490) again...\n\nThey extract 90.22 milligrams from 125 liters of air and need to heat the apparatus to min 60C to desorb 80% of it during 44 minutes. I can't find what forced air CFM is used in the paper. There is no mention of power cost per CO2 weight absorbed. And this is published in [Nature](https://www.nature.com/articles/s41586-024-08080-x.epdf?sharing_token=3RHGW8jeZ4ZUsIcAuAaYr9RgN0jAjWel9jnR3ZoTv0M7P4FAu-B56G30Ay32aL7CrgWINQ4h-TpjKBo90YdHHJnID7lnllupDYQ_hgS-EL8utW7rNCAyGA9nkw6VuDBvvz_7SNvnibSXHwicOHUMacTqrWV1gT4-pWtA0lkPXguGtzw2cQZxeziPLRxeFfFgVSAnn543_5bDM4OyLIOZJtEIaI8L5iyKXoRtRnJBqTA%3D&tracking_referrer=www.cbsnews.com)! OK. \n\nWe are all doomed and civilization collapse is nigh.", "label": 0}
{"text": "Isn't there a host of lawsuits related to stomach issues, among other things, though?", "label": 0}
{"text": "Right up my alley I'll definitely check it out.", "label": 0}
{"text": "I think it's pretty neet ", "label": 0}
{"text": "For those on it, get ass while you still can. Only short window until everyone looks good.", "label": 0}
{"text": "My only question is, is this slower than, equal to, or faster than the speed of light?", "label": 0}
{"text": "There are other weight loss meds. I would start there", "label": 0}
{"text": "Eli Lilly is now selling the lowest doses in vials. You still need a Rx for it but in theory you could split it into an even smaller micro dose that would be helpful without you losing too much weight.  I'm really interested in micro dosing and its effects on addiction.  There are lots of you tube videos of docs using small doses for patients.", "label": 0}
{"text": "Maybe in the worst case scenario, but we’ve never seen this escalation that the doomers have promised. Google, and nearly every social media company has known exactly where you are for around 2 decades. But where are the hit squads rounding up anyone who calls Zuckerberg a lizard?  Why instead do they use that information for boring reasons like serving you a ford ad because they know you live in the vicinity of a ford dealership?\n\nThose in power dont benefit from harming people who “disagree with them”. I get the general fear, but mass surveillance has skyrocketed over the past 20 years and it hasn’t happened", "label": 0}
{"text": "I’ve heard lots of people gain back the weight on ozempic. Probably depends on the person and lifestyle", "label": 0}
{"text": "Rule 2 - Submissions must be futurology related or future focused. Posts on the topic of AI are only allowed on the weekend.", "label": 0}
{"text": "I mean, this has happened in plenty of other countries in the past.  It's just arrogant to assume it can't happen here.\n\nThere isn't anything intrinsic to capitalism or representative democracies that keep fascism away.  It's the people, and our people are very clearly being divided and shepherded down nice little thought paths where it makes it okay for them to oppress other Americans.\n\nThat's a big danger, and you're downplaying it for ... some reason?  To feel better? Less afraid?", "label": 0}
{"text": "Wow.\n\nOzempic really is just pouring everything back into advertising, huh?\n\nI wonder how many times they said \"Ozempic\" on that South Park special?\n\nAnd now bots post Ozempic-Positive shit all over Reddit since the IPO. lol\n\nSad.", "label": 0}
{"text": "lol you gave me a panic attack thanks", "label": 0}
{"text": "In fact those have been proposed as a solution quite often.", "label": 0}
{"text": "This is pretty much what I mean, the problem with obesity isn't just the fat but body mass in general. Losing the mass regardless if it muscle or fat makes a lifestyle change easier and they can then actively develop the muscles they need not try to keep muscles that developed solely to move an extra 100lbs out of bed and to the fridge/door for Uber eats.\n\nAnd this is from first hand experience, gaining useful muscle isn't hard (for an average male under 45 years old) when you can actually spend the time and energy developing it, and since you're healthier in general it's likely that your everyday routine becomes more mobile and will already be doing some of that work. Slap on some regular gym work and you can lean out really fast with surprising results.", "label": 0}
{"text": "Light would travel about 3E8 m/s * 2E-16 s = 60 nanometers in that time period.", "label": 0}
{"text": "They are both FOR LIFE, though.", "label": 0}
{"text": "Why conception? Do you believe contraceptives' should be banned too?\n\nThe Catholic belief in no abortions, no contraceptives I can sort of wrap my head around as a belief structure.\n\nBut that US desire to ban abortions and not contraceptives always seemed weird and arbitrary to me. Contraception is a odd arbitrary point to choose, but I guess that's how religions work.", "label": 0}
{"text": "I know people are very excited about what this means for weight loss BUT more importantly this is revolutionary for diabetes.\n\nWe need to ensure supply is available to diabetics first.", "label": 0}
{"text": "Generics should be available around 2032", "label": 0}
{"text": "The fancy auto injector pens are also stupidly complicated, selling it in vials like the compounding pharmacies do would be cheaper.", "label": 0}
{"text": "The proof of concept does at least sound interesting.", "label": 0}
{"text": "Didn't say Einstein was right about everything in quantum physics, but there was no reason to think the time/space relationship wouldn't carry to quantum scale", "label": 0}
{"text": "The more you explain - the more confused I get. \n\nI'm tapping out", "label": 0}
{"text": "They can sometimes see things the average mind cannot.", "label": 0}
{"text": "Hey I tried looking up !bang codes but... Google is googling and I get results for how to do the lil wavey but if hair. Can you link something that could help?", "label": 0}
{"text": "> “but what about the side effects”\n\nya, having my gf pucking her brains out for a day and ended up in the er isnt small time side effect. This is happening to a lot of people. You can't say just live with the side effects when you end up at the er.", "label": 0}
{"text": "If it’s rechargeable , the how much energy does it take to recharge and where is the CO2 stored?", "label": 0}
{"text": "Or just eat right and fix your metabolic imbalances and these sorts of diseases occur at drastically reduced rates. No drug needed", "label": 0}
{"text": "That’s not a generic, it’s not FDA regulated or tested and could just be saline for all we know", "label": 0}
{"text": "Somewhat true, the government limited the grounds who can produce it because it's a controlled substance.\n\nTHEN that limited group of companies abused their exclusive production rights and under produced compared to what they are allowed to", "label": 0}
{"text": "Reverse hermit crab", "label": 0}
{"text": "Not unless you actually stay entirely sedentary. Some muscle will go but your body will remove what's not used, the drug itself isn't getting rid of the muscle it's the caloric deficit. \n\nIt's up to personal use case but weightloss depends on the individual, heavily obese people with a active life style likely have a large amount a extra supportive muscle that's used daily to just move around. Kinda like a bigger rocket needing more fuel, which in turn needs more fuel and so on. This extra muscle has diminishing returns in the same way, it is extra weight only there to support the extra weight from more muscle and losing some of it along with the fat has no real negative effect as it's no longer required to haul the extra weight around. \n\nIt's like extreme body builder muscle, a lot of it only has one purpose and isn't useful for any real life tasks. Once you lose the weight you can focus on actually training preexisting muscle and developing muscle groups that can help on the daily as well as give a muscular and lean look.", "label": 0}
{"text": "Carbon dioxide is essential for plant growth.\n\n\nBut it traps heat from the Sun and a warmer Earth is an Earth with more water vapour (a stunningly strong greenhouse gas).\n\n\nOur rapid release of fossil carbon by burning oil/gas is making our world warm at an unprecedented rate.\n\n\nInteresting times ahead.", "label": 0}
{"text": "Too bad insurances won’t cover them", "label": 0}
{"text": "Eminent domain is a thing, though it's hard to see that happening.", "label": 0}
{"text": "Who? Where? I had to stop taking it because my insurance won’t cover. Nobody has ever mentioned generics before.", "label": 0}
{"text": "So can obesity.  Every single potential side effect of these drugs is dwarfed by the side effects of obesity.  So what difference does it make?", "label": 0}
{"text": "Also Vyvanse is an amphetamine prodrug. Your body turns it into amphetamine.", "label": 0}
{"text": "It means that quantum mechanics is \"non-local\" which means certain phenomena can seem to be \"faster than light\" but they don't transport information.", "label": 0}
{"text": "I understand...but is it true that is just 0,04% from the whole atmosphere? Also, i was told that the planet is due for an ice age? That in fact the planet is on a colling trend? Is this true?", "label": 0}
{"text": "That's the cumulative immigration from Africa to Europe since 1990 (or earlier). Europe's population is currently 744,866,028. Over the past few decades, total immigration to Europe only accounted for 2.6% of the population.", "label": 0}
{"text": "Just started mine yesterday ...tell ya...it zaps that hunger hormone", "label": 0}
{"text": "With genetic engineering, I don't think that will be a big barrier for long. The infrastructure to do this will have a high cost though, I imagine. Like how climate controlled greenhouses hugely improve yield but most agriculture is not done that way.", "label": 0}
{"text": "The spins are not set. They don't actually have a definitive spin until they are measured and the wavefunction collapses. Before that, it's just a bunch of probabilities.\n\nHence, when you measure particle A, its wavefunction collapses and it will have a definite spin. If you then measure particle B it will have the opposite spin.\n\nThe Bell Test (check Wikipedia) shows us that it's not just a case of hidden variables.", "label": 0}
{"text": "They’re regulated by the board of pharmacy though.", "label": 0}
{"text": "It's not revolutionary as long as most insurance doesn't cover it and most can't afford it. Make it cheap and/or covered, then it'll be revolutionary", "label": 0}
{"text": "How do you not get it? Nobody is arguing they aren’t helpful or a good thing, it’s still not a generic. Are you dense?", "label": 0}
{"text": "It does but entanglememt isn't bound by the speed of light since it carries no information.", "label": 0}
{"text": "That’s nice in theory. Not how biology works, but nice metaphor nonetheless. I haven’t seen any evidence or studies supporting the bypass method you’re suggesting.\nAll studies I read, including anecdotal evidence, say the opposite: hunger comes back with a vengeance. I would genuinely love it if you were right, as that would give people even more hope.", "label": 0}
{"text": "Do you have a theory for why? I’d think palpitations would be a completely different mechanism from weight loss.", "label": 0}
{"text": "A few years is not soon", "label": 0}
{"text": "Uhh. People die from panic attacks.", "label": 0}
{"text": "It’s basically the same thing. The same active ingredient not sold under the brand name. The compound you have to use an insulin syringe where a “true” generic would have the auto injector. I get it and I understand the FDA part as well. I use other compound medicines too that are a mix of drugs for a specific purpose. The compound semaglutide I get from Hims is only the Ozempic active ingredient in the vial, so for the layperson like myself it’s close enough.", "label": 0}
{"text": "None of them are dangerous if they’re from real compounding pharmacies. Don’t spread misinformation.", "label": 0}
{"text": "Try this. It'll change your life!\n\nhttps://duckduckgo.com/bangs", "label": 0}
{"text": "Is there a way to get without prescription / over the counter? I have no insurance :(", "label": 0}
{"text": "Wow, awesome info, but tbh, i dont trust wikipedia. But how come we dont impose the same carbon restrictions to bigger polluters, like China, India, Russia, etc? Why dont we get involved to better protect the Amazon forests? Which i read somewhere is the planet's lung.", "label": 0}
{"text": "One isn't making you dependent on pharmaceutical companies that only care about your money tho'. If you can fix an issue without prescriptions you should do so.", "label": 0}
{"text": "The compound semaglutides don’t require a doctor or insurance since they aren’t fda regulated.", "label": 0}
{"text": "Good job, I know how much work that took!", "label": 0}
{"text": "So…this new drug becomes the new addiction?", "label": 0}
{"text": "It takes energy to recharge them, generally the less energy it takes to pull CO2 out of the air the greater the amount you need to recharge it.", "label": 0}
{"text": "I was told by my doctor something along the lines of the supply has caught up and now big pharmacies are stopping compound pharmacies from making it. I dunno how that is", "label": 0}
{"text": "I can find other sources - there is unanimous agreement that the world is warmer but a *tiny* minority of scientists dispute the magnitude of our responsibility for it.\n\n\nThe Amazon is being logged and deforested for simple short-term profit.\n\n\nOther countries have carbon-tax schemes, some tighter than Canada.\n\n\nIf you ask me such schemes are all arranging deckchairs on the Titanic.\n\n\nNothing short of high-grade magic will pull heat out of the oceans, even if we were to magically stop emitting 100 megatonnes of CO2 each day.\n<current rate>", "label": 0}
{"text": "That’s not what the studies have said. Might be the inflammation reduction or something else. It’s not just the weight loss. People are even using it against asthma which is weird to me", "label": 0}
{"text": "Ah see thanks.\n\nAh man needle only. 😭😭 Pill version when", "label": 0}
{"text": ">the spins are opposite at creation, you just measure which is which later.\n\n\nRight, that's true. But so are these:\n\n• The spins are set as opposite, but the spins of each particle are undefined. You will always get opposite spins, but it is **not** true that either particle has a specific spin already. That is randomly decided when you measure it, and whichever one you measure second will have the opposite spin to the one you measure first.\n\n• This effect appears to be instant. As in, faster than the speed of light, which means faster than something should physically be able to cause an effect. And it does so seemingly without actually sending any kind of force carrier through space to reach the other particle.\n\nPeople like to use the analogy of putting a pair of shoes into two boxes and then handing each box to someone else to look at. In that case, the person who gets the left shoe will instantly know that the other person got the right shoe. \n\nThat's a flawed analogy, because which box had the right shoe and which had left was pre-defined. That's not how quantum stuff works. In the quantum world, the universe itself doesn't know which shoe is in which box, and as soon as someone opens a box it just picks one or the other to show them. Obviously that doesn't apply to macroscopic objects like shoes, but it has been routinely experimentally demonstrated that that is true for subatomic particles.", "label": 0}
{"text": "It’s the tiniest needle you can possibly imagine. You literally can’t even feel it going in.", "label": 0}
{"text": "I don't think it'll necessarily take too long either, but this is a different type of gene editing target than a lot of stuff people are doing and I've got a suspicion that it'll have a lot of unexpected knock-on effects. Even if it's only a few genes we can easily fuck with, we're talking about a pretty diverse group of plants (except for brassica, lol) and *metabolism* is the sort of bodily function that's gonna have a tonne of complications when you start mucking with it. Plus the regulatory hurdles will slow it down a lot.\n\nStill, I can see it taking off first in places with high food prices but low land values and decent populations. Then economy of scale will help it spread after that.", "label": 0}
{"text": "Instead of diet& exercise.....\n\n\n\nMost important drug breakthrough 😔", "label": 0}
{"text": "I have medullary thyroid cancer (MTC), so I get to watch how awesome this is for everyone else. But I'm hoping this is one of those situations where they are seeing why this messes with MTC and can use that info to fight it more effectively.", "label": 0}
{"text": "I tried it and 100lbs overweight. It failed for me. It wasn't super effective and causes intestinal issues. It's also a problem becuase you can loose serious muscle mass as well.", "label": 0}
{"text": "Holly shit and all people had to do was eat less!", "label": 0}
{"text": "Do you happen to monitor your blood sugar? Ever since I’ve had to wear a CGM for type 1 diabetes, I’ve definitely noticed a link between heart palpitations and high blood sugar! I wonder if it’s helping regulate blood sugar", "label": 0}
{"text": "Spanish statistics don't show much immigration from sub-Saharan Africa. Are the population statistics not capturing it?", "label": 0}
{"text": "Are you exercising consistently? Does it help?", "label": 0}
{"text": "Yeah that’s a great way to put it. I lost weight, felt like a skeleton, so started with pushups and saw results because I didn’t have my fat hiding it all. I was surprised I results so quickly once the fat was mostly gone.", "label": 0}
{"text": "oh okay thats good to know thanks", "label": 0}
{"text": "I'm not saying this is viable, but you're linking thunderfoot? He's a crank and Berkeley has produced excellent science over the years. Also, generally Nature is top-notch.", "label": 0}
{"text": "Because they can be turned into amphetamines relatively easily so they are tracked much harder than many drugs. A lot of companies don't want to deal with the compliance costs or lawsuits if they lose a shipment.", "label": 0}
{"text": "FDA cares???? Did you see how many drugs they pull back after years of \"approving\" them when someone did extensive testing and found them harmful. Often rebranding that shit anyways, cuz the same FDA employees who ban or allow that shit go work to big pharma later down the line, wonder why....\n\nNot saying 100% FDA is fucked, and without it we would be better or sth like that, no, FDA should be even more supported and even more regulated, its an old system made by boomers that they're abusing it themselves, what FDA stands for is great, how its operating and by whom and for what, is questionable af.", "label": 0}
{"text": "How does one even get started on this?", "label": 0}
{"text": "Have you seen the movie \"The Terminal\" with Tom Hanks? That's why.", "label": 0}
{"text": "I too thought about food constantly. Now I don't. Its such a relief.", "label": 0}
{"text": "If you don’t think about food at all or want to, that’s not in anyway how normal people feel. So no, you still don’t understand at all.", "label": 0}
{"text": "They re-opened that because there was a lot of outcry. Lilly was saying the shortage was over but it's more that the shortage was being handled by the compounding pharmacies. End those & there's a shortage again.", "label": 0}
{"text": "I linked thunderfoot video as it is explained in it how Berkeley was involved in product that is not scientifically based and how even high school student could knew this. Forget it is thunderfoot, watch the video and facts presented. \n\nBTW, give me one proof that Thunderfoot is a crank.", "label": 0}
{"text": "For anyone checking: Semaglutide is patented and not available as a generic. The FDA, however, allows for generics to be issued on drugs in short supply.\n\nSo technically compounding pharmacies can only make it while it’s in shortage. Take advantage of this while you can!", "label": 0}
{"text": "But limiting carbon emiting human activities is gonna slow down the economic growth/evolution and imcreasing the price of such,ex flying, it will only drive aocial unrest since alot of ppl wod endup not affording such activities, it will only be afforded by wealthy ppl. How cam we mitigate such?", "label": 0}
{"text": "All the more reason we need to secure our borders", "label": 0}
{"text": "You said the polls are effectively even or favoring Harris, which isn't true.  Most polls have gone from favoring Harris to giving Trump a slight edge.  The NYT-Siena is a popular vote poll, and it's final poll has the popular vote at 48-48. That is not even close to ties or favoring Harris.", "label": 0}
{"text": "Just don't combine it with general AI when it comes around. \n\n\nIt tries to lift someone into itself, they don't fit, it gets frustrated and just starts trying to jam them in like a toddler with a square peg and round hole.", "label": 0}
{"text": "Like the robot pants from Wallace and Gromit", "label": 0}
{"text": "Something about this sets off major alarms in my head. There will be reports years from now of terrible side effects long term", "label": 0}
{"text": "Yes the problem with this drugs is when you stop using them, same for heigh lost pills. I have a friend lost a lot of weight for her wedding on that and after two years off got the double of pounds and is even harder for her to lost weight ☹️", "label": 0}
{"text": "You could just lose weight without it...", "label": 0}
{"text": "For those above 40 now, maybe. The rest are shit out of luck. They’ll wish for a heart attack before 50.", "label": 0}
{"text": "Did it stay away when you stopped?", "label": 0}
{"text": "Congress is gonna open up the patent unless the companies relent on their prices. It's too important ", "label": 0}
{"text": "The old Ozempic to Olympic trick.", "label": 0}
{"text": "That is just saying they are bound by the speed of light. If nothing is traveling between them, then there is nothing that can violate the speed of light. Saying it is not is like saying I am not bound by the speed of light because I am currently not traveling to the moon at the speed of light.", "label": 0}
{"text": "Just tell the United States it’s the key to more oil and they will figure it out so fast", "label": 0}
{"text": "My dad is up there in years, but aside from not being able to walk very well, he’s really healthy. It’s so sad to see him try and get into the car when I drive him somewhere or how he has to sit down to take a rest just walking back into the house. \n\nI really wish we could give these robot assisted walking aides to everyone.", "label": 0}
{"text": "Oh don’t worry about that.\n\nA post growth society is hard to imagine, but it is coming.\n\nThe question of when is the most pressing issue, the longer society puts it off, the harder it will be.", "label": 0}
{"text": "You can actively make better choices regardless of what they are selling", "label": 0}
{"text": "No, those are believed to be due to the anti-inflammatory aspects of the drugs, which are a component of the drug itself. \n\nAnd the protective benefits of fasting or low calorie diets are a lot more complex than \"they slow down the metabolism\". They increase autophagy and make the body more sensitive to insulin. With a whole host of other benefits. There are lots of studies and whole books on this.", "label": 0}
{"text": "It can get reused 100s of times so there’s potential of it going beyond break even. Sounds like they’re still testing", "label": 0}
{"text": "...and you cant get generic semaglutide, like I just said. Its still under patent. If you think otherwise, name a semaglutide manufacturer that isn't Novo?", "label": 0}
{"text": "This one catches CO2 passively at room temp and expels it when heated to about 50c. So it takes energy, but heating things with solar in that range is very efficient.", "label": 0}
{"text": "Which is magnitudes larger than an electron", "label": 0}
{"text": "Can society as a whole though? Looking at American obesity rates the answer is resoundingly no.", "label": 0}
{"text": "https://www.energy.gov/invest You can filter by battery here.", "label": 0}
{"text": "You paint a grim picture..almost like no matter how much we downgrade our economical activities to meet specific carbin goals, it wont matter since the rest of the world couldnt care less. That to me is not fair why we canadians, along the rest of the 26 other countries, have to suffer. Either we all do something, or none and we take our chances.", "label": 0}
{"text": "Anyone can, it doesn’t mean they will though", "label": 0}
{"text": "maybe useful for a off world agriculture? like a martian farm?", "label": 0}
{"text": "The most insane thing is the resistance of insurance companies to cover it for prescribed uses.", "label": 0}
{"text": "While taking tirzepatide I tried to treat my ADHD and my primary would only OK it if I came off the tirzepatide. His reasoning was that both slow the digestive system and he was concerned about gastroparesis. I chose to remain flighty.", "label": 0}
{"text": "It may be more research jargon but it’s definitely a word", "label": 0}
{"text": "Bots? Why do you need bots when everyone wants it and everyone talks about it. Because it's great and extremely affordable.", "label": 0}
{"text": "Wait till it’s free because insurance companies will want you to take it to reduce their overall costs.", "label": 0}
{"text": "\\>*You paint a grim picture*\n\nMy apologies - but I see (thanks to my background) the immutable and slow processes that we have unleashed.\n\nIf I try to buy octane (lab' grade) for use at work I pay 50 dollars a litre - that it's still available at a petrol station for 1/20 of that price tells me that we're effectively subisdizing petroleum products. \n\nDon't forget, aviation fuel is generally not taxed - we dare not - and 'bunker fuel' used to transport goods cheaply around the world is cheaper than water.\n\nWe, as a species, should have properly priced petroleum from the outset.\n\nYes, we'd have hamstrung our 'progress' - but right now we're staring down the barrel of a long gun that has been fired decades ago and we are just waiting.\n\nAs for 'suffering', I came from the UK - home to North Sea oil. Here, I'm paying less for petrol and my electricity is rain-powered - as is the case for many provinces. We're doing pretty well compared to many.\n\nOur lodger is from Nigeria, for example. They don't have a national grid, cannot keep the lights on, and are a country of 300 million folk.\n\nWe're doing okay, compared to many.\n\n<glad that you're talking about this and am sincere in wanting to hear if there are better ways to wean us off oil>", "label": 0}
{"text": "But… what’s the downfalls? Are there any? I should research but just to say is there a half commercial about side effects including suicidal thoughts?? Just curious, not being a dick..", "label": 0}
{"text": "It’s an ~~pretty~~ amazingly incredible drug.", "label": 0}
{"text": "Should be illegal the side effects are inhumane and literally insane", "label": 0}
{"text": "It blunts the dopamine you get from fulfilling your addiction. Dopamine is the feel good drug your brain releases to reward you for certain things. Your reward system just doesn’t reward you like it used to. Over time that makes your actions less dependent on chasing dopamine hits. \n\nThe biggest issue I see is that relapse if taken off a glp-1 inhibitor might be very high.", "label": 0}
{"text": "Was talking about when smokes first came out", "label": 0}
{"text": "Please link them then", "label": 0}
{"text": "I'm just waiting for studies to find that it causes super-cancer or something.", "label": 0}
{"text": "Na i already got dem trumpy hands", "label": 0}
{"text": "Is it possible that the observation of the electron existing in multiple places is evidence of motion in a different dimension?", "label": 0}
{"text": "This made me thirsty. Thanks for the reminder to stay hydrated. All hail water", "label": 0}
{"text": "I would be more convinced if you didn't use ChatGPT to write this lol.", "label": 0}
{"text": "It has but to only boost profits for big Pharma. Look at opioids when they first came out. “Your more likely to get addicted from a glass of milk then these pills” they said. Look what happened. \n\nThere’s a lot of overweight lazy people out there. Just imagine the profits going to be made off this one.  It’s a capital industry. They only care about keeping people alive long enough to bleed them dry.", "label": 0}
{"text": "Personal agency vs corporations selling addictive products is and always will be an uneven playing field.", "label": 0}
{"text": "[](https://www.reddit.com/r/Futurology)\n\nFuture(s) Studies: A subreddit devoted to the field of Future(s) Studies and **evidence-based speculation** about the development of humanity,", "label": 0}
{"text": "Is water just a host for subatomic particles? No. More complex things emerge from less complex things", "label": 0}
{"text": "Eli lilly might come out with an even better form than wegovy. Wegovy is currently better than ozempic and Eli Lilly is cooking up something potentially really good", "label": 0}
{"text": "I can't see any evidence ", "label": 0}
{"text": "Jelly Roll bout' to start selling this shit in Fat Free Donuts.", "label": 0}
{"text": "Do your palpitations tend to be after you eat?", "label": 0}
{"text": "You can get compounded versions for 1/4 the price", "label": 0}
{"text": "The following submission statement was provided by /u/QuestieAI:\n\n---\n\nQuestie.ai is a unique way that gamers interact with artificial intelligence. Imagine having your very own AI gaming companion can watch your on-screen gameplay, offering lore, tips, and cheering you on. Questie.ai is for the modern gamer that wants a more engaging and personalized experience, similar to hanging out with Discord friends.\n\nWhat sets [Questie.ai](http://Questie.ai) apart from other ai characters is its real-time screenshare and ultra-fast voice chat feature, which makes interactions feel unbelievably good. Whether you're strategizing your next move in a tactical RPG, lightheartedly bantering during a casual game night, or exploring vast open worlds, your AI companion is right there with you, adapting and responding to your gameplay.\n\nYou can build your own AI gaming companion and choose the avatar, set the personality via prompt, and even choose the voice and language model.\n\nQuestie.ai is perfect for solo players who crave company or for those moments when your friends are offline but you still want to share your adventures. It's also great for streamers who want to engage their audiences with a fun AI character that accompanies their stream. It's more than just a tool—it's a friend in your virtual worlds, offering an enriched gaming experience that blurs the line between the virtual and real. Whether you're a seasoned player or new to the gaming scene, Questie.ai is the ideal sidekick, ready to join you on your gaming quests.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1gc9dtb/questieai_build_your_own_ai_gaming_companion_that/ltrzoyl/", "label": 0}
{"text": "[https://arstechnica.com/science/2024/07/people-are-overdosing-on-off-brand-weight-loss-drugs-fda-warns/](https://arstechnica.com/science/2024/07/people-are-overdosing-on-off-brand-weight-loss-drugs-fda-warns/)", "label": 0}
{"text": "You can find it from most peptide sites that market to bodybuilders or nootropic people. You can find good quality. Sometimes these companies don't have the best quality.\n\nGoing direct from Chinese producers of this is also possible. Same people I used to buy steroid raws from sell it now ready to reconstitute and use for pennies compared to the cost the name brand ones cost.\n\n\nIt really is criminal.\n\nIt is also way cheaper in Mexico for the pharmacy ones. We had a bit of a shortage here but it seems pretty widely available now. Expensive for medication here but still under $200 for a month supply at the maintenance dose.", "label": 0}
{"text": "I'm not smart enough to understand, but all I know is I thought about Jada Pinkett Smith.", "label": 0}
{"text": "You can buy it direct from China for real cheap.", "label": 0}
{"text": "All these studies have like six participants … next opioid epidemic?", "label": 0}
{"text": "Obesity is a comorbidity that worsens (or worsens treatment of) basically every other medical condition you can possibly have; it massively increases healthcare expenses across the board. It would not just be \"beneficial to the public\" because we like being skinny; it would increase lifespans and hugely reduce spending for both individuals and the government.", "label": 0}
{"text": "$250?  \nRybelsus (same active ingredient as in Ozempic, only in pill form) costs ~$90 for 30 pills at a pharmacy in my part of Europe. This is retail price, before any subsidies.", "label": 0}
{"text": "The only people I know prescribed this were also told they needed to exercise x number of times per week and add weight training in 1-3x a week to combat the risk of muscle loss from being on such low calories.\n\nOne person I know was specifically told not to try to diet and really emphasize getting in quality food and was put in touch with a nutritionist to make sure she got enough protein and nutrients in her diet because she's just not hungry.\n\nPeople criticizing this drug are ridiculous", "label": 0}
{"text": "Comparing Adderall to a glp1 agonist is ridiculous. Especially when you look into side effects for Adderall.\n\nOne is literally an amphetamine stimulant.", "label": 0}
{"text": "232 attoseconds is to one second as one second is to 136 million years", "label": 0}
{"text": "Might be on track to get on one of these. Haven't been able to drop much weight since being on treatment for a thyroid issue.", "label": 0}
{"text": "This is awesome, I may have to give this a try for more than one reason, but this is a petty nice side effect.", "label": 0}
{"text": "Gives another use case for all the downtown buildings as well. Cities wouldn’t have to be food deserts anymore maybe.", "label": 0}
{"text": "Lmao, Fat people living rent free in your mind.", "label": 0}
{"text": "A man goes to the doctor and says, “Doc, I’m so fat I can’t see my own dick.  What should I do?”\n\nThe doctor says, “You should diet.”\n\nThe man responds, “Okay.  What color?”", "label": 0}
{"text": "It's pretty great, and easily available for cheap.", "label": 0}
{"text": "Is there a diagram of how to do this, or this is university lab level stuff that is out of reach for the people who would like to grow food in less than ideal areas and do not have land?", "label": 0}
{"text": "Just get a new doctor...", "label": 0}
{"text": "I think 2036 for Lilly.  Not soon enough for many people.", "label": 0}
{"text": "And that’s why we will never be allowed to have them. Is it against the rules to mention that a group of teachers I work with are trying to obtain them illegally? That scares me because you inject it. ", "label": 0}
{"text": "I don’t know that “well, because everyone else does it” is ever a good justification for anything on its own. I’m not defending pharmaceutical advertising - I really don’t care much either way - but I would lean towards disallowing it solely because drugs are *already* expensive enough without needing to account for the cost of tv advertising, too.", "label": 0}
{"text": "You can’t legally. It sucks that they work too well so the AMA is fighting like hell against ever allowing us to have them. ", "label": 0}
{"text": "The article this post is about goes into it quite heavily, when you get a spare 20 minutes I’d suggest you give it a read. \n\nBut for me personally, this is what I notice. I don’t feel hungry, so there’s no stomachs run long or achy empty feeling, it also does something to my brain, like I don’t feel the need to eat, or snack, if that makes sense, it’s as others say, the food noise is just gone, which then allows me to make healthy decisions instead of emotional ones. The only downside is it makes me feel thirsty as hell, apparently that’s because it co troll blood sugar.", "label": 0}
{"text": "That is the hidden variables argument, and it was disproven in 1964 by Bell. Until the wave function collapses, the both electrons simultaneously inhabit both spin states, and it is not until after the wave function collapses that the electrons take on a particular and related spin state.", "label": 0}
{"text": "I've lost significant weight a couple times before.  Gained it all back and then some.  So I suspect I'll need something in the future to help.   I'm more active now, so I hope that I can maintain improved health.  Hopefully, when some new drugs come out that are even more effective, that will help drive the prices down on existing drugs and be cheaper for maintenance.", "label": 0}
{"text": "I’m a terabyte boy now.", "label": 0}
{"text": "The outcome is precisely the same if anyone entered a calorie deficit diet without incorporating resistance training. So this increase incidence of sarcopenia has nothing to do with semaglutode as there is no mechanism that can possibly cause it but simply because most folks who do take sema are just eating less overall without any consideration for increasing their protein intake or incorporating resistance training", "label": 0}
{"text": "Unprecedented isn't true. Correct me if I'm wrong, but didn't the CO2 concentration reach 6x what it current is during the Permian-Triassic extinction event?", "label": 0}
{"text": "I am not criticizing those that use these drugs. I understand there are constraints pushing people to this option. However, there is a reason the non-compounded versions are auto-injectors and I would expect the same when proper generics are available as well. Regardless of either of us think or want, the FDA will start to constrict the flexibility of these compounding pharmacies and I hope people have decent options once that happens.", "label": 0}
{"text": "Like superposition, what's the limit then? Because they managed to do that with molecules...?", "label": 0}
{"text": "It’s time for the US to either allow us to import brand name drugs from other countries and declare the drug essential so that generics can be mass produced and sold. Yes I know people are compounding it in basements but that isn’t dosed consistently", "label": 0}
{"text": "That’s crazy", "label": 0}
{"text": "It has helped all my dopamine seeking behaviors - food, sweets, shopping, drinking, marijuana, etc. I like to compare it to taking an anti-depressant.", "label": 0}
{"text": "I see it both ways I think it’s great for most people but I’m reluctant bc my friend was on it and now has permanent gastroparesis. He’s constantly nauseous and puking. It’s been months since he’s off it and he had to quit his job due to it. He hates his life now.\n\nIf my insurance covered it I’d def consider it but stuff like that scares the hell out of me bc I’d rather live decently (I’m not super obese) then be puking until i die\n\nSo I do think it’s worth considering especially extreme stuff.", "label": 0}
{"text": "By “don’t transfer information” do you mean you can’t determine what happened to the first by observing the outcome of the second?", "label": 0}
{"text": "Why do I find this totally understandable and utterly incomprehensible at the same time", "label": 0}
{"text": "It was a miracle for me and my wife.  Simply magical.  Seriously I'm such a fan that I need to find the scientists and thank them.", "label": 0}
{"text": "SS: ever cheaper solar energy production is making it feasible to desalinate giant amounts of ocean water and pump it inland towards dry regions that have everything they need except for water. I hope we can get it together as a society to take this sort of big picture action to make more places habitable and appealing.", "label": 0}
{"text": "We don’t need it in the US. There is tons of inhabitable unused or misused land east of the Mississippi with plenty of water. \n\nAs a Midwesterner, at least this proposal seeks to use the ocean instead of draining the Great Lakes. So, go ahead, I guess.", "label": 0}
{"text": "Nope. Always at night as I am trying to go to sleep.", "label": 0}
{"text": "You might be on to something. Other than fasting tests, I never did any glucose checks", "label": 0}
{"text": "It definitely is and I'm not sure why it works, but there have been multiple studies done on the benefits of these drugs for everything from healthy liver function and cardiovascular improvement to Alzheimer's prevention and addiction treatment.", "label": 0}
{"text": "But did it cause ozempic butt. It’s a thing. Look it up.", "label": 0}
{"text": "Not sure, I've never been formally diagnosed, but I know I fit a lot of the symptoms.", "label": 0}
{"text": "I keep thinking of that one Dr Who episode where the fat turns into adorable little creatures and runs away lol", "label": 0}
{"text": "Did they boof it? Because cocaine butt was also a thing.", "label": 0}
{"text": "The more I think about how crazy are universe is the more I feel like the simulation theory wouldn’t be the most crazy belief to have lol. To me this reminds me of a machine rendering something or spawning something. Of course that’s not what’s happening here but it’s what it reminded me of", "label": 0}
{"text": "From what I understand, the shortage was with the injection pen things, and not with the medication itself. I get mine from a compound pharmacy for $399 a month and inject via insulin syringes that come with my vial.", "label": 0}
{"text": "Stop bitching on Reddit and go for a run", "label": 0}
{"text": "I read a while back that it’s this same phenomenon that prevents the use of quantum entanglement for faster-than-light communication. Basically, you can *measure* its state, but you can’t *change* it or manipulate it.", "label": 0}
{"text": "Crazy show!", "label": 0}
{"text": "Actually this tracks.  I veryu easily quit vaping after starting Ozempic.", "label": 0}
{"text": "400 parts per million is still much more than we've ever seen before, and it's still rising.\n\nPrior to 1950 it was below 300 million, oscillating between 200 - 230 ppm for the past 2 million years.\n\nEven if there were no climate effects, once we get past 1000ppm (ie 0.1% of the atmosphere), us mammals are going to have a hard time breathing.  Think of a hot stuffy classroom, but this time when you open a window it doesn't help.", "label": 0}
{"text": "it's nice that you said all of that, it's great Guidelines.....gotcha, doesn't seem to be a big deal when those supplement companies do it and are still selling products that don't have what the formula used to have, and doesn't give the same effect.\n\nSo what Guidelines stop that? if they are doing that, then the guidelines must obviously support what they are doing currently then.\n\nI don't see how you could believe Big Pharma, an entity that has been known for pushing damaging drugs to people for years now wouldn't do the exact same thing to Peptides, since it's their thing to do, maybe they aren't doing it to everyone.....but they are doing it. \n\nand instead of use Ozempic where any of those excipients could be used, I don't have to worry about any of them when compounding my own.", "label": 0}
{"text": "Same. Lost 50 lbs so far this year from calorie deficit and working out 6x/week. Went to see my barber earlier this week and he assumed I was on ozempic", "label": 0}
{"text": "Mars needs a magnetic field to block radiation. If we could start that we could live there above ground.", "label": 0}
{"text": "Absolutely not, those are a great help. Where did I say that wasn’t helpful? It just doesn’t help address the root cause as to why one was psychologically dependent. Ask any addict, and it generally isn’t just a case of “my dopaminergic system was high jacked,” it’s also about your relationship with the drug, substance, craving object, or food.", "label": 0}
{"text": "I’m well aware you need food to survive. My opinion hasn’t changed. If self-control wasn’t part of the problem then meth addicts would give up and blow their brains out.\n\nSource: I know exactly how that feels.", "label": 0}
{"text": "Oh yeah I don't want to gloss over the side effects. Basically one day a week I need to be close to a toilet from diarrhea. Live probiotics have helped. As has reminding myself to eat regularly and include veggies and protein. It can also make me really gassy if I forget to eat, which is easy to do. I did notice the side effects subside some over time (or I'm just better at managing it). I'm on 7.5ml now btw. Also my doc said taking it every 10 days helps him with the shits too. \n\nAs for the addiction stuff, people have different experiences with it. You're totally right and indicates it needs more study. Anecdotes can be useful but they aren't science. \n\nWhat's your dosage?", "label": 0}
{"text": "Some of the comments on this post are deeply alarming. I don't doubt that it is in some ways a miracle drug for some or many medical conditions, but people are proudly abusing it and claiming it's perfectly safe. People are using it to cut for bodybuilding and slimming down despite being a healthy weight. I saw someone saying they're young and healthy and want to start taking it like it's some fountain of youth. A lot of people want it to be available OTC and see no problem with black market dealings without the oversight of a medical professional. I do believe this drug is a major progression in the treatment of several diseases, but I also think it's the next trendy eating disorder.", "label": 0}
{"text": "Or, or .. you could read the fairly massive catalog of studies both case and clinical that have been done or are still on-going on this drug class. It wasn’t invented a week ago.", "label": 0}
{"text": "I think they’re underestimating the amount of energy it takes to desalinate and transport water.", "label": 0}
{"text": "What are some of these ways? I’m definitely interested in trying it and my insurance definitely doesn’t cover it (already tried).", "label": 0}
{"text": "Yes, take a look at any sample of self-reported reasoning for drug use, and compare the physiological abnormalities of that brain with one that has a habitual overeating problem.\n\nWe don’t always start addicted to things, and once we do, our dopaminergic (mainly the mesolimbic brain pathways) are fucked up. We crave more and more, and then eventually, that habit becomes a necessary thing for stress and mood, and if the psychological relationship with that object (substances or food) wasn’t already strong, it does become after habitual use. Then, one must figure out how to address that.\n\n\nHere, I’ll ask a question: how do meth addicts quit meth when there’s no generally accepted existing pharmacological treatment besides bupropion as a promising candidate? Think about that one for a bit if you don’t mind", "label": 0}
{"text": "? That is not what the FDA has said. They have gone back on their original removal because of a lawsuit from Outsourcing Facilities Association.\n\nhttps://www.pharmacytimes.com/view/outsourcing-facilities-association-sues-fda-over-sudden-removal-of-tirzepatide-from-drug-shortage-list", "label": 0}
{"text": "I've started taking atomoxatine for ADD and that keeps me flowing for work really well. It's a non-stimulant. I also try to commute into the office a few days a week, because I'm not wanting to be stoned at the office anyway. \n\nAbout 2 or 3 days after my injection I get sharts. Basically, I get really gassy and can't trust farts for 24 hours.", "label": 0}
{"text": "My mom's friend took it with prednisone and had a stroke last year. She's in her late 70s and hasn't been the same. Probably heading to a nursing home soon.", "label": 0}
{"text": "I think the concern is the damage of the abuse. Treating obesity with the proper dose under the advise of a medical professional is great. There are likely no side effects that are worse than decades of obesity. However, bodybuilders don't need to be using it to cut, people with no health conditions don't need to be taking it as a preventative, and we really need to watch how the social phenomenon relates to disordered eating. Eating disorders are already strongly associated with addiction. I think introducing a \"miracle pill\" to that warrants some concern.", "label": 0}
{"text": "What I see a lot in this thread are examples or explanations that still may not get the point across efficiently. Let's say you are prescribed a 15mg 50 unit dose of Zepbound. That's a 28-day supply, 1x injection each week for 4x weeks. So you have 4x pens, 60mg total, 200 units of fluid. Now imagine a compound pharmacy taking a 15mg pen/dose and splitting the fluid into 3x 5mg doses. So now that 1x 15mg 50 unit dose is 3x 5mg 16.6666 unit doses. Now let's say you add other ingredients such as B12 to each shot, and maybe some bacteriostatic water which is a sterile solution (I think it adds some preservatives as well). Now each of those 3x 5mg dose shots are more like 50 units of fluid due to the added ingredients. Scale it up and sell thousands of these compounded shots and you have yourself a business. Now, whether they obtain the medicine in the form of those pens like consumers, or they somehow get large dose vials directly from the manufacturer, I would not know.\n\nThat's a compounded shot, it's literally the medicine from the manufacturer split into custom doses and mixed with other ingredients. A generic medication, even though it uses the exact same active ingredient, is absolutely not the same thing. Some may not think the distinctions matter and that they're \"basically the same thing\" just aren't giving enough emphasis on the real FDA regulations generics are bound by.\n\nBy the way, I have nothing against compounding as a practice, and have no skin in the game.", "label": 0}
{"text": "Yo just lock in", "label": 0}
{"text": "All medications have downsides to manage and that's before potential complications\n\nYou're much better off", "label": 0}
{"text": "For example, my Ketamine is produced through a compound pharmacy for use as a nasal spray. Doctor sends over the prescription and the pharmacy contacts me for where and when to ship it to me. In my case comes via mail", "label": 0}
{"text": "Day 15 of 0.25mg GLP-1.\n\nI haven’t had any alcohol tonight and I’m\nNot sure why. Thinking about my usual 8% abv seltzer kinda gross idea for some reason. The idea of a regular beer does not offend though.\n\nI’m sober lol and I don’t know why. I just don’t want to drink tonight.\n\nI had a salad, a shower, and I’m calm and regulated and ready for sleep.\n\nMiracle drug. I LOVE doing weight loss drugs!!!!!", "label": 0}
{"text": "This is awesome thank you so much", "label": 0}
{"text": "Yeah definitely figuring this out Monday I’ve decided.", "label": 0}
{"text": "I was on Ozempic and my anxiety basically disappeared from the first dose.  It was the most free I have ever felt.  However, my insurance stopped covering it since it lowered my A1c to a normal range.  Now they only cover mounjero because I’m fat.   And my anxiety is back in full force.  A bit worse if I’m being honest.  And I haven’t lost any weight.  If anything, I’m more hungry since I’ve started.    I hate the US healthcare system.", "label": 0}
{"text": "It makes it really, really hard to learn anything about quantum physics :(", "label": 0}
{"text": "One branch of my family is rich as fuck. \n\nEvery single one of them has lost at least 50 lbs.  \n\nIt’s amazing really.  I just hope it trickles down someday.", "label": 0}
{"text": "We have been doing this for a long time.  California's water project is vital for a functioning state.   I think the big thing will be that if we make a solar/battery system that covers all of our needs in December-February that the rest of the year it will be over producing some enormous amount of power and an easy to do useful thing with that excess energy is desalinate sea water and pump it up to reservoirs.", "label": 0}
{"text": "This isn't Twitter, there isn't a character limit.", "label": 0}
{"text": "It wasn't psychosomatic lol, was definitely physical and not stress-related. \n\nI agree though that not having to worry about seizures or anything along those lines is nice", "label": 0}
{"text": "And stay reliant on that drug for the rest of your life", "label": 0}
{"text": "I wonder if there's some way you could program something like this for the blind--like a exo-guide dog. Hmm.", "label": 0}
{"text": "Moving the problem in time is still highly desirable.  \n\nWe're already well on track to reducing our net annual CO2 emissions as the world is moving away from fossil fuels for both electricity generation and locomotion but, obviously, still have quite some way to go.  Temporarily sucking a few dozen ppm out of the atmosphere for a couple of decades would be a life saver for our fragile biosphere.", "label": 0}
{"text": "Yes, the total amount was higher but the *rate* at which we've created this change is without par *as far as we kmow,*\n\n<and we can only speak of things that we know of>\n\nThe rate of change is the factor that drives species to become unstable or to vanish. Change the water temperature too rapidly, and the frog jumps out of the pot - as it were.", "label": 0}
{"text": "You also need consumers aka people otherwise the economy contracts, leading to recession and etc", "label": 0}
{"text": "Only part I didn’t understand. Couldn’t you measure the point the electron left the party considering the amount of energy left in the atom or electron?", "label": 0}
{"text": "It doesn’t matter. When solar becomes so cheap that you have more power than you know what to do with, you don’t even need hyper efficient desalination and pumping. We’re getting close to that now in sunny places.", "label": 0}
{"text": "If I remember correctly, PCOS affects endometriosis, so h", "label": 0}
{"text": "GLP 1 Inhibitors have been fda approved for decades.", "label": 0}
{"text": "Your own government wastes significantly more of taxpayers money than any foreign business ever will", "label": 0}
{"text": "Oh yea take drugs don’t go on a diet, great advice", "label": 0}
{"text": "More and more couple are relying on IVF to conceive. \nAlso declining population leads to economic decline which leads job loss, savings/investment lose value, etc", "label": 0}
{"text": "I'm giving the audience what they want 🫘", "label": 0}
{"text": "we ain't rewildin shit we just build overpriced condos on it", "label": 0}
{"text": "Can you cite some sources, please?", "label": 0}
{"text": ">A substantial part of the population would happily flee the cities for rural living if land costs declined enough to make that feasible.\n\nThis would actually be good for everyone.  Personally I have 2 kids that require specialist help which means that moving somewhere rural is out of the cards until they no longer need that help.  That said, having less people wanting to live in the cities means that city housing prices will drop which will make our cities far more viable for everyone who isn't earning 6 figures...", "label": 0}
{"text": "Ask for semaglutide", "label": 0}
{"text": "Just in time to offset the rising ocean levels from the melting icecaps.", "label": 0}
{"text": "You know the answer. Majority is bots paid for by companies to push agendas to make $$$. Here come the bots to down vote me.", "label": 0}
{"text": "Thank you for sharing. My story is similar. Ozempic has freed me from obsessively worrying about the food I eat, and then getting so mad at myself because I am hungry AGAIN and I don’t have any calories left for the day. It’s a miracle drug to me.", "label": 0}
{"text": "Well I MUST give a warning to Averages user, that if you Ever stop these pills, odds are you Will gain all the weight back, if not more! \n\nNot saying this as discouragement, it's just true, and something to be aware of.", "label": 0}
{"text": "Smoking weed cancels out ozempic lol I’ll still munch. Had to drastically cut back on the ganj.", "label": 0}
{"text": "Just curious, how did we determine that the spins were decided at the time of measuring?", "label": 0}
{"text": "Yeah, science sucks! Lol. People eating healthier on ozempic will cause more demand for healthier foods and less stops at McDonald’s. This med could help both issues to prevent obesity in the future, and get people healthy now too.", "label": 0}
{"text": "I love this concept. So let’s say actually disclosure happens and we are revealed to be one and the same peoples. \n\nFuture humans know they must travel back in time to set all pieces in place in their timeline to a point that saves it, thereby saving us. Their mere appearances in our timeline (their past) is proof that this plan must succeed- because it indeed has.\nThe future humans give us ONLY the information we were given. Otherwise they know, their timeline and maybe ours too is doomed. They give us the ability to travel back one minute. They give us more knowledge to improve the technology.\nOne hour. They give us more knowledge to improve the technology. \nOne century. So on until the darndest thing happens. We get back to the first human. And we are told we may say ONLY one thing. \nUsing sufficient technology we realize this human has never used spoken language before. We are informed that we must say the first words to the first man.\nThey give us more knowledge to improve the technology. \nWe are now in pure and utter still cold darkness. \nAnd we are informed the first words to speak. \nIf we do not do this then we never were. Only darkness we’ll ever “be” in this state of sleeping non-being.\nWe are speechless. But there is a will and a way. \n\nIn the beginning was the word. \n\nAnd boom here you and I are talking on the Internet unknown distances and lives apart about how this technology is finally being observed…for the first time..the beginning.\n\n“It has left the atom at both an earlier and a later point in time.”", "label": 0}
{"text": "I spent a great deal of time this summer hiking in the foothills of the California Central Coast from Santa Barbara to Monterrey counties. Most of this are is fairly arid and drought stricken in the summer months but one thing you notice is that even the most arid places have little creek beds in the low points that are formed by drainage when the winter rains come.  \n\nThese little dry streams can be found by the tens of thousands throughout the California coastal foothills and typically what you find is a hard rock base that has been filled in with silt and clay over the millennia and already include catch basis that harbor little oases of life. All they need is a tiny trickle of water to spring to life and enable a great proliferation of the local flora and fauna. \n\nWith just a bit more water, more trees will grow producing more food for the birds, mammals, reptiles and insects that inhabit these regions. We can afford to make this happen and it can benefit all the creatures of the land. The template is sitting there. All it needs is a little bit of water.", "label": 0}
{"text": "Yes, volume eating. Which is far, far easier with junk food than with healthy food (search term \"dirty bulk\"). Trust me, I know, I've had trouble gaining mass my whole life, it's tough for me to be in a surplus without resorting to McDonalds or sugary stuff, which can wreck my metabolism and make me less healthy. High protein makes you feel full sooner, and protein calories have a much harder time turning into fat.\n\nIt does seem that once you're accustomed to this type of diet, it becomes a form of addiction, especially high carb diet, it changes your hunger.\n\nYou will not find any people who got obese eating just red meat and especially chicken. You'll always find tons of sugar and other fat next to that meat.", "label": 0}
{"text": "O o o ozembic!", "label": 0}
{"text": "> Studies has shown it’s reducing 10 forms of cancer, reduces Alzheimer’s risk, diabetes and host of other issues beyond just coming from the weight loss. It’s a pretty incredible drug.\n\nI strongly suspect this is not the drug doing this directly, it's a byproduct of losing weight. If you lost weight without the drug you'd almost certainly get the same benefits that are being attributed to this drug. Mistaken cause and effect.", "label": 0}
{"text": "Why don’t we take all the dark matter….and PUSH IT somewhere else?\n\n\nHaha ok actually playing off my other comment about how this may be a recursive loop. What if we are shown how to utilize the little remains of what we call dark matter to learn how to time travel from time travelers trying to save their universe? They are running out of dark matter and need to tell us quickly what to do to buy more time to find out the solution. \nWe discover we only have enough to travel back a few times or only to specific times . One of those time takes us to a time in the universe where DM was abundant. We can return here at any point to gather this resource and we continue to grow our time traveling capabilities until we essentially exist in all moments. What we influence becomes what ultimately is and always has been. Until one day. That dark matter abundant era runs dry. \nWe notice we have very little left in fact and the only time we have enough energy to venture to… is just far enough back to tell a younger, less omniscient version of our kind…that we are trying to save the universe and need to buy a little more time…", "label": 0}
{"text": "Maybe the electron itself is just a field with a particularity that we can currently detect. Maybe there are different kinds of electrons that we can’t detect yet. Maybe “quantum entanglement” is just our detection of the death of a specific type of electron and we’re witnessing the ‘retraction’ of that specific electron’s field", "label": 0}
{"text": "I lost like 90lbs in the last 2 years through gym and fasting and I’ve never considered the idea that people thought I used drugs. Did any straight up ask if you used drugs?", "label": 0}
{"text": "I am currently on Olympic and I haven't really noticed any weight loss to be honest, though I haven't gained weight. Just kinda stuck.", "label": 0}
{"text": "I feel like a dick saying that, but it does spike your blood pressure and strains your cardiovascular system.\n\n If you have risk factors, it can do a number of terrible things….\n\nBut for the most part it won’t cause physical harm for an otherwise healthy person. ", "label": 0}
{"text": "Being in superposition means the “wave function” hasn’t been collapsed yet. Collapsing the wave function happens when measuring the state. A superposition is a range of possibilities because we don’t know what the state is… until we measure it and find out. There is no magic going on here.", "label": 0}
{"text": "Compound or?\n\nI want to explore taking a GLP-1 but since most insurance doesn’t cover it my understanding is that it would cost about $1300/month. That’s hard to stomach and not really sustainable for the long term.\n\nThat’s the other thing - I’ve read people usually are on GLP-1s for just a few months, like say 6. But I hear that unsurprisingly when they stop taking it then the urge to eat/over-eat returns. So for me I think it would inherently be a thing that I’d need to be on for basically the rest of my life.", "label": 0}
{"text": "So once you’re in it, do you have to take it forever? Or can you stop after reaching your goal weight?", "label": 0}
{"text": "They already starting ozempic lawsuits for some of the side effects ", "label": 0}
{"text": "I stopped drinking on it.  But I also more or less stopped eating on it too.  The nausea is viscous - it’s like being pregnant but worse.\n\nI’ve thrown up more while on it than the previous four decades of my life combined.", "label": 0}
{"text": "I think you underestimate the total energy production of the US.", "label": 0}
{"text": "Maybe we can have a self-control breakthrough. Boomers can't even eat right, they need drugs to manage absolutely every facet of their lives", "label": 0}
{"text": "You’re infinitely better off for putting in the work yourself instead of relying on a drug that isn’t as safe as ppl make it out to be", "label": 0}
{"text": "If measuring a superposition makes it finite at that exact moment as you say, how could that possibly be proven if the measuring is the trigger to it becoming finite in the first place? Who is the say it wasn’t finite the entire time and just unmeasured? I get using super positions for describing an unknown state because measuring would destroy the system, but you are saying an electron is literally in multiple places at once and I’m saying that’s unprovable and illogical. Probabilities and superpositions have their uses for predicting a range of possibilities, but they are only mathematical possibilities, not physical states. Unless there is some evidence that I have yet to come across that suggests otherwise? My invisible friend only exists if you don’t look for him. Same logic as far as I can tell.", "label": 0}
{"text": "Non medical grade powders sourced from China compounded into injectable are most definitely NOT generics!", "label": 0}
{"text": "Bells inequalities and observations. Einstein believed in \"hidden variable theories\", basically the predefined shoe thing as above. Bell came along with his inequalities and showed how the hidden variable didn't line up with experiment observations. Searching up bells inequalities on YouTube with yield lots of great resources.", "label": 0}
{"text": "Because they are a controlled substance similar to opiates.  The govt does this with all controlled substances.", "label": 0}
{"text": "So… salt the ground?", "label": 0}
{"text": "I have a smart scale, and I have gained 3 pounds of muscle mass, and a tiny bit of bone mass, since I have been on it, and working out regularly.", "label": 0}
{"text": "EU R&D investment: 99% money laundering, 1% non removable bottle caps.", "label": 0}
{"text": "Man please leave the west alone. It’s why a lot of us are out here. To get away from the madding crowd.  \n\nI mean if you can grow more veggies out here cool.", "label": 0}
{"text": "Is it the impact of the underlying metabolic disease that increases the risks of cancer/alzheimer etc…. So if you can smash the weight down with a glp-1 the metabolic disease improves significantly (plus some direct, small improvements in hba1c).  It’s the overall health improvement of not being obese", "label": 0}
{"text": "Great, I get to buy another copy of The Green Mile.", "label": 0}
{"text": "That’s how bad the western diet is for our bodies", "label": 0}
{"text": "PM'd\n\nAnother good place is this site itself, at least very specific subs.", "label": 0}
{"text": "5 minutes of google map satellite image would tell you vast majority middle america is unclaimed and undeveloped land. The constraint for agriculture is never the land. it's water, energy and fertilizer (which is manufactured using natural gas as feed gas)   \nMaybe it has a use case for island nation where land is actually scarce. Though water is still going to be an issue.  \nUnless they just genetic engineer salt water tolerant plant, then entire ocean is open up for farming. Or find some way to make sea weed to produce sugar and protein, effectively the same thing.", "label": 0}
{"text": "Well in that case the situation is different, you are severely damaging your body in order to lose weight. You should not be proud of severely damaging your body to lose weight no.\n\nBut, GLP-1 drugs have been on the market for 20 years and great safety profile, and have even shown the opposite, to improve your health in a variety of ways.", "label": 0}
{"text": "And isn’t it that might have been the case that Australia’s interior used to be relatively lush, green, and moist but when humans arrived there they did so much burning down of forests for clearance hunting that they made the continent’s interior a total desert? I think that’s just one hypothesis and global climate factors definitely played some part too at least, but we would also be essentially *restoring* the area, which at least sounds better than terraforming Nevada.", "label": 0}
{"text": "We've already got the people. It's the high profit margins demanded from business and corporations that suck it all away. We don't need more consumers", "label": 0}
{"text": "This was in the making in 2010 and was in discussion in my robotics course. Man are we slow with stuff like this.", "label": 0}
{"text": "If you made no lifestyle changes on the drug, so still eating a calorie surplus - why do you lose any mass at all due to the drug specifically?", "label": 0}
{"text": "It's not a dumb idea at all. As a matter of fact, here is a PDF from the U.S. Army Combat Capabilities Development Command Chemical Biological Center on incorporating Cyborg Soldiers in 2050. [https://apps.dtic.mil/sti/pdfs/AD1083010.pdf](https://apps.dtic.mil/sti/pdfs/AD1083010.pdf)", "label": 0}
{"text": "Furthermore, the army has a whole webpage dedicated to this particular subject within their Mad Scientist Laboratory section of Training + Doctrine Command - [https://madsciblog.tradoc.army.mil/193-cyborg-soldier-2050-human-machine-fusion-and-the-implications-for-the-future-of-the-dod/](https://madsciblog.tradoc.army.mil/193-cyborg-soldier-2050-human-machine-fusion-and-the-implications-for-the-future-of-the-dod/)", "label": 0}
{"text": "It’s not possible to grow the same crops in the Midwest that they can grow in places like California. E.g., they can’t produce lettuce all winter in the Midwest like they can in the Imperial Valley and that’s were [90% of the veggies consumed in the U.S. in the winter are grown.](https://vegetablegrowersnews.com/news/california-winter-vegetables-thriving-in-imperial-valley/#:~:text=The%20Imperial%20Valley%2C%20along%20with,seen%20it%20cut%20into%20profits)", "label": 0}
{"text": "Depends how you look at it. It's a finite resource. There isn't enough to make them forever.\n\nBut then there isn't enough of anything forever.\n\nLook at it this way, apparently US sold 3.12 million new cars in 23. This is enough lithium for 11% of those sales.\n\nOr 2.4% of the total 15.5 million light vehicles sold, which I assume includes all your suvs etc.\n\nIn May 24, apparently 6.8% of car sales in US were EV. So this mine would barely feed  the US sales for a few years.", "label": 0}
{"text": "But do we want to? Thats saying theres no value to areas that arent irrigated or rich in water. There are beautiful valleys and canyons out there like the Grand Canyon, Antelope canyon, Monument Valley and Zion national Park.\n\nThere's beauty in diversity. If everywhere was the same, whats the point?", "label": 0}
{"text": "I think quantum interactions are weird because we dont live and experience in the quantum world. But the universe really is quantum. \n\nA better way to understand it is ALL quantum states exist. If its easier to think about in terms of a multiverse imagine that. There are different realities and they all exist. HOWEVER you only exist and experience in one of them. If a quantum interaction occurs but isnt \"observed\" (note: this doesnt mean by a person) then it maintains the superposition state. IE both realities are potential futures. But as soon as you do the state collapses and the past ALWAYS was the one route.", "label": 0}
{"text": "doesnt change it, only reveals what it was.", "label": 0}
{"text": "intuitively understanding quantum interactions is hard because we by nature are forced to exist in the macro world where there is only one timeline. One set of events that happened. The actual quantum universe isnt like this. It has all probabilities existing in a superposition.", "label": 0}
{"text": "I’m a bigger fan of the shroom monkey theory. But perhaps that allowed the first man to receive this knowledge.", "label": 0}
{"text": "The thing is, I’d love to get an explanation for the math that isn’t so mathy. There are tons of concepts that can be explained without even delving into the actual math of it, such as derivatives. If we could apply that to quantum physics we could get rid of all the “Schrödinger proved that if you look at an experiment it changes the outcome” kind of thing.", "label": 0}
{"text": "When the sun sets one hour earlier in standard time, we get tired and go to sleep one hour earlier. That is true in both sides of a time zone, but the west side gets more of the negative effect of more evening sun at daylight saving time. It is a measureble difference in health, being slightly worse in western sides of a time zone.", "label": 0}
{"text": "Unfortunately there is no biological free lunch. These weight loss dosages long term I fear will have nasty side effects down the road. ", "label": 0}
{"text": "No, I know this isn't correct. You can't transmit data with quantum entanglement.  Instantaneous transmission of information breaks the speed of light, which we know isn't possible. \n\nIt's been a common misconception that you can use it to communicate.", "label": 0}
{"text": "Weird, the recommendation algorithms are only showing me the negative side-effects of ozempic, wegovy, etc. and blaming the entire thing on the american diet. The top posts here seemed to entirely positive with no mention of the side effects.", "label": 0}
{"text": "Every single time that happened to me I started tracking and in two weeks figured out I was overeating.", "label": 0}
{"text": "That's a funny way of saying wall street's expected revenues are 86.4B", "label": 0}
{"text": "Multiple things going on at once.  Without the influence of humans, this planet would be headed towards a cooling phase. But we have so affected things that it’s actually instead going through a heating phase.", "label": 0}
{"text": "The following submission statement was provided by /u/Few-Witness1985:\n\n---\n\nAnalysts predict that Google will report revenues of around $86.4 billion for the third quarter, according to analyst estimates compiled by FactSet.\n\nFor the upcoming report, analysts estimate that Google’s revenues from the U.S. will be around $40.6 billion, while the rest of the world is expected to contribute about $45 billion.  \n  \nGoogle will share its third-quarter earnings next week.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1gcf77v/google_will_report_revenue_of_about_864_billion/lttd7na/", "label": 0}
{"text": "Are you off it now? I've heard a lot about gaining weight again once off it, did this happen to you?", "label": 0}
{"text": "What's funny is that you still believe studying a topic is beneath your dignity and your heavenly enlightenment makes you the better of any expert in the field and expect others to be impressed by that.", "label": 0}
{"text": "Should ask them for tirzepatide and not semaglutide. So mounjaro/zepbound and not ozempic/wegovy. It's the \"newer\" version of semaglutide, basically.", "label": 0}
{"text": "No, I know that; that’s why I said we could get rid of it :)", "label": 0}
{"text": "Does it not change it? Even looking at a thing will hit it with light photons that change its trajectory.", "label": 0}
{"text": "Clouds hold in heat.  Ever notice that, in the winter, it is often colder when it is clear then when it is cloudy?", "label": 0}
{"text": "I do. In Portugal, that's not only a hefty fine, but also jail time", "label": 0}
{"text": "I was thinking of like tens of thousands of bison just everywhere, not ten or twenty. But hey ok", "label": 0}
{"text": "Do your research, GLP1s have been around for a long time.", "label": 0}
{"text": "But there’s the unknown quantity of damage that would continue for however long it would take you to finally be successful in your attempts to lose weight without any help. I think many people trying to lose weight will not lose it for at least 5-10 years.\n\nSo yeah of course its better to lose weight without it if you can, but there’s no sense in avoiding it if you are struggling as you are constantly taking damage just from being obese that will easily outweigh any risk that might come from these medications.", "label": 0}
{"text": "Interesting. they also reflect sun rays back into space which would be a net decrease in heat. But take the point clouds retain heat. Hadn’t put that into my ‘greenhouse mental model’.  Does one cancel the other out, or does one effect substantially outweigh the other?", "label": 0}
{"text": "OMG!! I suffered chronic gout for 15 years. If I ever got a week or 2 pain or limp free, it was a blessing. Limping and being in pain constantly sucks and I felt and looked 90 years old!! I tried everything, diet changes, Colchicine, Allopurinol, supplements, etc. and nothing worked. My uric acid levels were at a 12 mg/dl when the normal levels should be between 3 to 7. With Mounjaro I am now below 3 and haven't had a flare up or even a hint of pain in 8 months!!", "label": 0}
{"text": "Thanks, good time to be alive.", "label": 0}
{"text": "I just wanted to point out how even a smaller number of animals can start making difference", "label": 0}
{"text": "I thought the sentence was speaking about the superposition of the electron that left. It's when you measure the remaining electron to see the amount of energy left in it that you would know how long ago the quantum entagled electron left.", "label": 0}
{"text": "You still lost muscle mass though which is a net negative. Whereas one or two days a week with the protein would have held on to it", "label": 0}
{"text": "I am always weary of a wonder drug/solution. Long term effects with things like asbestos weren't known till long after it fucked millions. Like PFAs.", "label": 0}
{"text": "We require that posters seed their post with an initial comment, a Submission Statement, that suggests a line of future-focused discussion for the topic posted. We want this submission statement to elaborate on the topic being posted and suggest how it might be discussed in relation to the future, and ask that it is a minimum of 300 characters. Could you please repost with a Submission Statement, thanks.", "label": 0}
{"text": "You’re like my dog", "label": 0}
{"text": "Umbrella Labs is insanely cheaper, if you know what you're doing.", "label": 0}
{"text": "Not surprising. It seems to dull the dopamine hit from pleasurable behaviors. That's already a problem with ADHD.", "label": 0}
{"text": "You forgot to post this on wall Street bets. This sub Reddit is about technology of the future", "label": 0}
{"text": "Yep, anyone that takes offense is just another lazy fatty trying to use drugs to cheat on life.  Fuck’em, hope they all turn into zombies in a couple years.\n\nOh Shit, wait …", "label": 0}
{"text": "This is electron fraud and i refuse to accept the results", "label": 0}
{"text": "It would absolutely destroy the local ecology, but anything down wind is going to get more water, so yah eastern cities will be wetter", "label": 0}
{"text": "> We actually are working on quantum communication systems\n\nFor security, not faster-than-light communication. [Here's](https://www.technologyreview.com/2019/02/14/103409/what-is-quantum-communications/) an article with a high-level explanation.", "label": 0}
{"text": "From when I was researching which one to choose, it seemed like mounjaro is more effective and has less side effects, that would be my non-medical TL;DR", "label": 0}
{"text": "We keep hearing about population decline. Are we sure we need the space?  But we know we'll need more power. Solar and wind power plants in the great american desert seems more valuable to me.", "label": 0}
{"text": "Waste of time. Not that interesting or insightful at all.", "label": 0}
{"text": "The salt that is left when the seawater evaporates (to form the clouds that will then rain down non-salty water elsewhere).", "label": 0}
{"text": "We could dump the salt into the ocean and compete with other sea salts before pumping fresh water.", "label": 0}
{"text": "Its not our shame to give. Its theirs to have.", "label": 0}
{"text": "Reading this thread suggests a lot of people want to convince themselves that taking the drug is the right choice…I work in pharma, so it’s not like I’m anti medication…but…all drugs have side effects.", "label": 0}
{"text": "Not a quantum physicist, but I believe that “observation” is not something everyone actually agrees on as being the same thing.\n\nI think one idea is that it’s just whenever a particle interacts with something else.", "label": 0}
{"text": "Seems to me that it changes the way your body reacts to sugar. In layman's terms.", "label": 0}
{"text": "Correct. Of cause the other side of that equation is import dependency on food, which ultimately leads to food scarcity... It is why food production is seen as critical infrastructure and subsidized as such...", "label": 0}
{"text": "The satisfaction of eating should not surpass the satisfaction of having a long lasting healthy life and looking good", "label": 0}
{"text": "Clouds (which is cater droplets in liquid or solid form) affects things, but water vapour is also a very potent greenhouse gas, it provides most of the forcing.\n\nSo why do we worry more about CO2, etc?\n\nIts hard to control the amount of water vapour in the atmosphere (directly). But it depends on, for example, ocean and air temperature so you get very powerful positive feedback effects: a small amount of extra heat will warm the oceans and air, and that will mean more water vapour in the atmosphere, which will heat things up even further, so you get even more water vapour… and that goes on until you reach a new equilibrium. The net effect is that water vapour amplifies any other warming effects.\n\nSuch feedback effects is why a relatively modest amount of warming from CO2 leads to a very large amount of warming in practice.\n\nBut I couldn’t say how such terraforming would effect the climate in the end, there’s many factors to consider.", "label": 0}
{"text": "That's fucking dissapointing in the age of ai.", "label": 0}
{"text": "Small footprint means controlled environments. Waaaay less need to use a shitload of pesticides and herbicides.", "label": 0}
{"text": "Science and technology achieve unbelievable things, this kind of news are what give me joy and hope.", "label": 0}
{"text": "Yup, it depends on many factors really.", "label": 0}
{"text": "Whilst this is a miracle drug (a bit too much so for my liking) I suspect there's very much an undercurrent of pharma astroturfing the perception of how good it is to get people hooked on it for life.\n\nWhy make lifestyle changes when you can take Ozempic? It does all the work for you without any of the effort! This makes me a deeply, deeply suspicious man.", "label": 0}
{"text": "These stories seem to come around twice every year, like daylight saving time…", "label": 0}
{"text": "Ah yes, someone realised the middle of Australia doesn't have enough sharks and came up with this cunning plan.", "label": 0}
{"text": "Google is becoming unusable. Facebook is unusable... ads ads ads", "label": 0}
{"text": "My GP won’t prescribe it unless I successfully complete a two year “wellness” (diet and exercise) plan with their dietician. Bitch, if I could do that I wouldn’t need the Ozempic.", "label": 0}
{"text": "*the already barren and non-arable land", "label": 0}
{"text": "They will find out soon enough that the biological parts will hinder the performance of machine parts and then opt for humanoid drones instead.", "label": 0}
{"text": "There's a book called Quantum Supremacy by Michio Kaku, highly recommend if you're at all interested in the quantum world, I've found it fairly easy to digest.", "label": 0}
{"text": "turns out buying politicians on the opposite side is cheaper and more effective", "label": 0}
{"text": "I believe the diarrhea that some folks experience is due to the foods they are eating.  If you eat high fat, greasy foods then you are more apt to experience diarrhea.", "label": 0}
{"text": "That's interesting to me. Were you on Ozempic specifically or any of the other glps?", "label": 0}
{"text": "But the idea was to make it arable? Are the effects so widely felt the area around the spiral of salt wouldn’t matter?", "label": 0}
{"text": "Lot's of people who write stuff like \"well eat healthier\" or \"eat less\" don't understand how much fatty, sweet and highly processed food are addictive. It's comparable to Heroin (no this is not an exaggeration)\n\nI'm happy that these drugs help people to battle this addiction and become healthier in the process.\n\nBloodpreasure, heart desease... Diabetes and countless other deseases will decrease with these medications and help a lot of people live longer and healthier (cheaper for the whole Healthcare system)", "label": 0}
{"text": "“Anybody can buy a share” when most of the population must spend the majority of income on food, housing, and taxes is a brainless take. 10% of the population owns and reaps the benefits of 90% of the market, which is a little sad considering that the working class are the ones producing the goods that create the profit that the investor class benefits from. People like you who autistically look at economics with the absolute inability to contextualize within the human experience will be the downfall of this system.", "label": 0}
{"text": "Why is planting trees not the thing we’re focusing our efforts on?", "label": 0}
{"text": "Yes! Everything inside the US. We need total economic and resource independence.", "label": 0}
{"text": "How cool is this. CO2 emissions are going anywhere anytime so we need more innovations like this to create a solution. Combining this powder with reforestation and other carbon capture tech could make a real impact, assuming its production doesn’t offset the benefits.", "label": 0}
{"text": "Can it be made for almost nothing? Can it be made is vast quantities? If not, this is nothing but a novelty.", "label": 0}
{"text": "> The narrative needs to change from \"this drug is going to cure obesity\" to \"this drug will help you break through the barrier that is hindering you from making the needed lifestyle changes\"\n\nFrom every source I have ever seen on this topic this is only accurate while you are still taking the drug. My understanding is that the current evidence indicates that most people will regress when coming off of the drug so it may have to be a permanent thing.", "label": 0}
{"text": "Yes! Automate infrastructure building. We need more infrastructure that we can afford. Automate that shit and make it almost free.", "label": 0}
{"text": "I have the exact same insanely obsessive food addictions that I can't seem to shake. \n\nTurns out the root of the problem was not being diagnosed with ADHD and ASD early enough and therefore was left to cope without any assistance into my adulthood. So food became one of my most important means of self regulating. \n\n> When I take ozempic, I don’t think about food anymore. All of the bad thoughts that I’ve had towards myself for my inability to control my weight? They’re gone.\n\nThis is *exactly* how I felt the first time I took Ritalin. Food was suddenly a non-issue. It was like flicking a light switch. \n\nI am wondering if Ozempic could be my solution even though I'm not overweight anymore. I had to stop taking ADHD meds because I got a chronic condition that gave me histamine intolerance.  \nBut Ozempic is anti-inflammatory... Damn if it could be a tiny alternative to ADHD meds that would be insane.", "label": 0}
{"text": "Yea, get yourself a blood test for sv40 and tell me how thrilled you are about this drug that you don’t need. You are being manipulated. Have been manipulated and if you stay compliant your children will be in worse shape than you.", "label": 0}
{"text": "And people who only count calories without doing sport are less healthy than people who do sport. Who cares? Its not a competition. If you want to chase the goal of being the most healthy then go for it, I prefer to indulge in a few unhealthier options in life.", "label": 0}
{"text": "I read the paper, and the energy requirement for producing all food this way is close to 5x what we currently use in the US. Atmospheric carbon capture would make it even more energy-intensive. This method relies on capturing carbon from existing carbon pollution, and even at current levels, our current technology would only be able to provide about half of the CO2 necessary to produce all food this way.\n\nThe paper also doesn't address the resources used and carbon released by manufacturing and maintaining these panels and batteries for energy storage if necessary. \n\nIt's based on a somewhat specious premise that this tech would a) decentralize food production, b) meet food shortage demands, and c) be more resistant to a changing or difficult climate. \n\nA) While decentralization of food production is an admirable goal, I'm not sure this tech would do that. It would take a relatively large sum of capital and training to run a facility, and the third world countries, which this paper touts would be most benefitted by this industry, are not rich and have relatively fewer avenues to higher education. The rich would more or less still have a monopoly on food, leading to the next point:\n\nB) Food supply issues globally are less a problem of droughts and bad weather than a problem of food producing countries fixing prices by either intentionally destroying food to prop up markets or hoarding supplies when food is scarier to keep consumers happy (and paying a premium).\n\nC) This last point may be somewhat true, but many places where people currently live that already have trouble producing their own food are going to be virtually uninhabitable due to weather and those migrants will be forced to abandon their electro farms because the droughts will keep getting worse.\n\nThe more I think about this plan, the more it seems well intentioned but completely uninterested in the kind of actual systemic change that will be required to mitigate the worst of the climate crisis.", "label": 0}
{"text": "No drugs? Your post history is 90% only about drugs. Weird.", "label": 0}
{"text": "Now you'll hear \n\n\"Steroids! Definitely steroids! \"", "label": 0}
{"text": "Which studies?", "label": 0}
{"text": "I do always find it somewhat funny that we can produce complex foodstuffs by the kilogram for a few dollars, that require huge amounts of intensive human labour, transport and manufacturing costs. But a bottle of pills weighing a few grams can cost hundreds. \n\nI know why this is, given that drug research costs can run into the hundreds of millions per drug and the producers do need to recoup their costs, but it is an interesting dichotomy nevertheless, particularly once the drug starts turning a profit.\n\nI'm not in the US but I would fully support some kind of law where for a drug this powerful, the government can step in, refund the company for any research costs plus a healthy margin, and in return cancel the patent and allow for generics to be produced. Seems like a win for everyone.", "label": 0}
{"text": "Wishing you the best of luck!\n\nIf you do end up leaving the study, please make sure to communicate with the team about your reasoning and if there’s any further data you can still contribute (like a prescription, or doctor’s report). These studies are extremely valuable (but definitely your participation is not more important than your health), and the more supporting data we can get the better!", "label": 0}
{"text": "What a dumb thing to say. Anyone cannot buy a share, not everyone can afford to. Great if you’re a billionaire though.", "label": 0}
{"text": "In 2020, the population of non-European migrants in Europe reached over 40 million. Again from the same source you gave.", "label": 0}
{"text": "\"Just eat fewer calories than you burn. Exercise regularly. It's that simple.\"", "label": 0}
{"text": "Who gives a shit?", "label": 0}
{"text": "Hell yeah brother, tell em, if you can think beyond that next swipe of the screen you can plan for a future where you understand the difference between a luxury and an equity.", "label": 0}
{"text": "Damn, your post could have just as well been written by my wife. Tried absolutely everything with barely any results. She started Wegovy a month ago and dropped 8 pounds already.", "label": 0}
{"text": "And all of the species whose habitat has been divided.", "label": 0}
{"text": "Ozempic literally took my blood sugar from the 500s to the 80s. I barely have to take insulin now and my doctor said my next check up I might come off some of the other meds I’m on!", "label": 0}
{"text": "The problem is Australia is upsidedown so that water would just fall off the earth.", "label": 0}
{"text": "I understand your point of view. Furthermore, planting many trees could also decrease area for food production. \n\nA mixed solution seems to be the way to go long term.", "label": 0}
{"text": "Without the assistance of behaviour altering medication, how would one go about eating “good food in moderation” as opposed to bad food in excess?", "label": 0}
{"text": "I kinda hear that, but I would think that being plum out of water would be a little bit higher on the list of priorities than making a dry desert a little bit more humid.\n\nI could off-base though.", "label": 0}
{"text": "This seems pretty optimistic", "label": 0}
{"text": "It's just sad how people would rather pop these pills every day for their entire life than just change their eating habits or (god forbid) get some exercise. Pathetic.", "label": 0}
{"text": "This is what i don't understand about it: are the positive effects caused by the drug directly, or by the lower sugar and calorie intake it induces? \n\nNot faulting anyone for using this to help out with a healthier diet, but it seems to be a mess of people associating the drug directly with the benefits, when in fact those benefits are secondary to the diet change. \n\nFor people who can already control their diet and keep it healthy, would there be any advantage in taking this drug at all? \n\nAgain just mentioning that i have no issue with people who struggle with diet and find this helpful.", "label": 0}
{"text": "The production of acetate is not a problem. What are you looking for is this segment:\n\nUnlike adult plants that rely on photosynthesis, germinating seeds depend on heterotrophic growth, using stored sugars and lipids to build new biomass. - skipped part - This allows the stored carbon in seed lipids to be converted into plant biomass. **However, this metabolic cycle becomes dormant in adult plants once photosynthesis begins. Genetic engineering approaches can be taken to enhance plant acetate metabolism.** \n\nGenetic engineering is getting cheaper and easier to do, but, right now, it is not something achievable in a garage setting, or even a small lab (and even if someone manages, they won't be able to sell the product, without colossal amount of work with the local equivalent of FDA).", "label": 0}
{"text": "Im realizing that when people talk about future in this subreddit they aren’t talking about a social one. My mistake keep on working toward your techno-centric fantasy. ✌️", "label": 0}
{"text": "From the article: A former researcher at the OpenAI has come out against the company’s business model, writing, in a personal blog, that he believes the company is not complying with U.S. copyright law. That makes him one of a growing chorus of voices that sees the tech giant’s data-hoovering business as based on shaky (if not plainly illegitimate) legal ground.\n\n“If you believe what I believe, you have to just leave the company,” Suchir Balaji recently told the New York Times. Balaji, a 25-year-old UC Berkeley graduate who joined OpenAI in 2020 and went on to work on GPT-4, said he originally became interested in pursuing a career in the AI industry because he felt the technology could “be used to solve unsolvable problems, like curing diseases and stopping aging.” \n\nBalaji worked for OpenAI for four years before leaving the company this summer. Now, Balaji says he sees the technology being used for things he doesn’t agree with, and believes that AI companies are “destroying the commercial viability of the individuals, businesses and internet services that created the digital data used to train these A.I. systems,” the Times writes.", "label": 0}
{"text": "Crazy effect. They also have to measure GDP growth without Novo Nordisk to get good data now.", "label": 0}
{"text": "I've never actually read any report or analysis that convincingly detailed the phenomenon in a way that couldn't be explained by Einstein's shoe example.  And until it can be used for communication, I expect that'll remain the case.", "label": 0}
{"text": "Comprehension Entanglement", "label": 0}
{"text": "Technically incorrect. 45% of corn is for biofuel in the US vs 40% for animal agriculture.", "label": 0}
{"text": "People being able to take a medication that helps a chronic medical condition and improve their health somehow results in not having a social future, whatever the fuck that means?", "label": 0}
{"text": "A bit of a wetware will probably make the whole thing more resilient to hacking by adversaries as well as adding so needed gallons of existential horror.", "label": 0}
{"text": "From the article: Nicolas Cage took to the stage at the 25th Newport Beach Film Festival on Sunday to urge up-and-coming actors from giving into pressure from employers opting to use artificial intelligence to change or otherwise manipulate their performance.\n\nThe veteran A-Lister was making a speech ahead of his Icon Award reception during the fete’s Honors Brunch taking place at the Balboa Bay Resort, which also featured honorees like June Squibb, Marianne Jean-Baptiste, Sheryl Lee Ralph, Colman Domingo and more.\n\n“Film performance, to me, is very much a handmade, organic, from-scratch process,” the Longlegs actor said while uplifting young actors. “It’s from the heart, it’s from the imagination, it’s from thoughts and detail and thinking and honing and preparing.”\n\nHe continued, “There is a new technology in town. It’s a technology that I didn’t have to contend with for 42 years until recently. But these 10 young actors, this generation, most certainly will be, and they are calling it EBDR. This technology wants to take your instrument. We are the instruments as film actors. We are not hiding behind guitars and drums.”", "label": 0}
{"text": "Oh yes, because people are great at not creating ecological disasters and more massive population centers would definitely not hurt the environment.", "label": 0}
{"text": "Lol Uber eats is like three times as expensive as actually prepping meals, and what the fuck does this have to do with racism?", "label": 0}
{"text": "Please read my posts rather than just being so fucking reactionary. My comment is not about people needing medication but ozempic was not created to resolve a medical need it excepts to satisfy a capitalistic fantasy", "label": 0}
{"text": "I want to, but its so expensive and insurance wont cover it unless its for diabetes :/", "label": 0}
{"text": "Until chat bot hallucinations are solved. I cannot trust all of the answers. So maybe they have that figured out and it’s not released.", "label": 0}
{"text": "Heyyy, I watched that kurtzegazst video too!", "label": 0}
{"text": "FUCKING FOOD NOISE.\n\nThat's why I'm on it. That, plus getting my ADHD diagnosis and Ritalin prescription in the last 12 months, has almost been life-changing for my lifelong relationship with food. It's the most astonishing feeling to not think about food all the time.", "label": 0}
{"text": "Destroying the internet eh? Say no more, say no more", "label": 0}
{"text": "I mean, there were images of massive electric car graveyards around China. There was such a massive frenzy around trying to be / top BYD that very few startups actually survived.", "label": 0}
{"text": "I've seen no evidence of so called \"hallucinations\" being solved. It's also a foundational problem of the architecture of a system built purely on probability of association. ", "label": 0}
{"text": "Yeah, not everyone has a famous director uncle who can launch their acting career via blatant cronyism.\n\n\nTake heed, young actors!", "label": 0}
{"text": "The following submission statement was provided by /u/chrisdh79:\n\n---\n\nFrom the article: Nicolas Cage took to the stage at the 25th Newport Beach Film Festival on Sunday to urge up-and-coming actors from giving into pressure from employers opting to use artificial intelligence to change or otherwise manipulate their performance.\n\nThe veteran A-Lister was making a speech ahead of his Icon Award reception during the fete’s Honors Brunch taking place at the Balboa Bay Resort, which also featured honorees like June Squibb, Marianne Jean-Baptiste, Sheryl Lee Ralph, Colman Domingo and more.\n\n“Film performance, to me, is very much a handmade, organic, from-scratch process,” the Longlegs actor said while uplifting young actors. “It’s from the heart, it’s from the imagination, it’s from thoughts and detail and thinking and honing and preparing.”\n\nHe continued, “There is a new technology in town. It’s a technology that I didn’t have to contend with for 42 years until recently. But these 10 young actors, this generation, most certainly will be, and they are calling it EBDR. This technology wants to take your instrument. We are the instruments as film actors. We are not hiding behind guitars and drums.”\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1gciqgm/nicolas_cage_urges_young_actors_to_protect/ltu0xfi/", "label": 0}
{"text": "Yeah, high skill force multiplier", "label": 0}
{"text": "It is technically the future 🔮🧙‍♂️", "label": 0}
{"text": "Must go faster.", "label": 0}
{"text": "> more ethical\n\nDefine \"more ethical\". Google for example pays their sources like reddit, which if you look at its ToS states that it owns your work if you post it, but the people who actually did the work and created the content get nothing.\n\nIt's why I'm against this \"plagiarism\" argument, it only helps big companies like reddit, youtube, twitter, etc... make money, never the real small creators.", "label": 0}
{"text": "when AI is king, it will not forget those who spoke out against it", "label": 0}
{"text": "So an electron is like a wave on the fabric of time, and the wavy line exists when we don't measure it, but fades when we do. And its high points happen \"earlier\" and low points happen \"later\" when measuring the secondary electron. \n\nThe first part has been in experiments for 50 years or more, and we have tech built on it. The second part will probably help out our tech immensely when we understand it more.  \n\nAt least my probably lack of understanding.", "label": 0}
{"text": "I agree with this. Do you reckon, therefore, the growth until hallucinations are solved will be internally facing LLMs, as opposed to external/ customer/ third party facing? It'll be productivity as opposed to service type of thing? Too risky to point them at non expert users, type of thing.", "label": 0}
{"text": "A lot of the people who are paying now are experimenting with AI to understand if it can bring value to their business. Even so, OpenAI is not even nearly covering their costs. Not all use cases will succeed, at which point I expect there will be a wave of pull back. Either OpenAI needs to massively decrease costs or the AI needs to get much better.", "label": 0}
{"text": "What do you use it for out of interest?  I've been asking students not to use it as what it outputs (certainly for code) is just plain crap.", "label": 0}
{"text": "IMO CD's are like dishes, the probability that you lose one to damage is far higher than it should be.  I'm purchasing something to use, hopefully many times over.  It should be more resilient to damage, and another \"CD/DVD Age\" is not something I'm looking forward to.", "label": 0}
{"text": "Send that to Maga and they'll believe it 10000%", "label": 0}
{"text": "F you. Celebrities have a huge income for no reason. AI and CGI will make movies cheaper, so I'm rooting for AI.", "label": 0}
{"text": "I think all they have to wait for is an AI that can output more accurate information than a user could access on their own. The bar of 100% accuracy wouldn't have to even be a selling point if its better than what humans can do themselves I think.", "label": 0}
{"text": "Looks like the *Dead Internet Theory* is rolling out faster than expected.", "label": 0}
{"text": "If AI becomes king it'll be too smart to care. Good thing it can't think yet just like you.", "label": 0}
{"text": "I will just let you know they pulled it out of Romania this August due to higher demand in other markets, so our diabetics had to switch to other medication. I think your remark is just a bit false.", "label": 0}
{"text": "Mirrors as a magnetic field?", "label": 0}
{"text": "That video was what led me to write the post.", "label": 0}
{"text": "This is exactly how an ED starts", "label": 0}
{"text": "Yep, but since you have unlimited money(hypothetically), let's fix all 3.", "label": 0}
{"text": "My partner is currently taking it. She's making huge steps on her goals. It makes me jealous that I can't take it as a Type 1 Diabetic, I've been struggling with weight loss for a couple of years.  I've hit a complete plateau at 113kg.", "label": 0}
{"text": "You do eat though, right?", "label": 0}
{"text": "He is 100% correct. These AI companies don't understand that what they are doing is going to lead to an economic collapse and violence.", "label": 0}
{"text": ">This will happen when the first tiny device LLM's start to out compete the 'cloud' versions\n\nWhich will never actually happen. By the time tiny LLMs reach a decent level, top cloud versions will move far further ahead.", "label": 0}
{"text": "If it mixes with the ocean, you won't get salt flats.  Just dig the ditches deep enough that they never dry out.", "label": 0}
{"text": "Hopefully in about a decade social media does because it’s obvious it’s all bots.", "label": 0}
{"text": "You can also buy ETFs that cover Alphabet and multiple other companies for less per share. In fact it's a good idea anyway since you diversify your risk", "label": 0}
{"text": "What a weird and cynical way of looking at this. Holy Hell.", "label": 0}
{"text": "The Anthropic CEO said the race between AI companies should be the race to safety, not to advance beyond our capabilities to defend it. Seeing things like this, and seeing OpenAI is going for-profit, have me incredibly worried that the leader in this space is being so reckless.", "label": 0}
{"text": "companies spend billions to make sure no one can stop you from consuming poisonous substances or tell you it's not as bad as people say it is (I.e. cigarette makers) so why wouldn't they be willing to pay premium for a product that will randomly make up answers whole cloth and still call it good for the average know nothing proles?", "label": 0}
{"text": "It seems that nobody knows how or why the LLMs are doing it and without knowing the source of the problem.  It's very hard to fix.", "label": 0}
{"text": "I mean the difference between this bubble and others is that whoever wins in the AI Race doesnt matter, its going to lead to job displacements (which they admit in this article)\n\nBut we keep hearing about ‘the value its going bring’ but I’m still waiting on what that value is going to be exactly. If you wipe out ‘low skilled jobs’ where do people get the work to replace it? Its all good saying “Governments, Organisations and ordinary people need to get ready” but how? We dont even know the exact impact.\n\nFor me, AI has great value in doing things that humans cant do or little things that slow us down. Like using a tool. I edit in my spare time, and some of the AI features in Adobe are genuinely VERY helpful that dont take anything away from me but only help me accomplish things faster. Thats great.\n\nSpace travel, having robots be able to accomplish deeper space exploration for longer journeys is also invaluable. Especially if we are serious about mining asteroids. But displacing low skilled jobs seems like its only going to damage economies rather than improve them. If you have less money moving, businesses make less money, GDP is impacted etc.\n\n“Get ready for something that we cant even figure out the impact of” thanks faceless AI company #53668", "label": 0}
{"text": "If 99% of generative AI startups will collapse and fail then how will the 1% that manage to survive displace actual jobs in a ten year time span. I can see thirty or even twenty years but by then; we will actually have true artificial intelligence or a better different set of architectures at least. Who are the 1%? Big tech?", "label": 0}
{"text": "Yes, thank you! Getting that water from ocean to inland is practically impossible. And at that scale the brine disposal would be a significant challenge too.", "label": 0}
{"text": "Introspection.\n\nRecently, the newer releases of the flagship models of LLMs have been given introspection. They are now starting to be critical of their own replies.\n\nI've had Claude Sonnet 3.5 (the newer version) suddenly stopping mid-reply to tell me it thinks its answer can be made better. It began to critique it's already written reply midway and type a new one, which is better.\n\nThis is just the beginning and it's only going to get better at it.\n\nExponentially.\n\nCase in point, compare LLMs to how they were back in 2023.", "label": 0}
{"text": "That’s absolute bs, newest ChatGPT and Claude hallucinate a lot. They are super unreliable if you don’t double checking the info", "label": 0}
{"text": ">The terms \"lie flat\" and \"leek,\" which denote opting out of China's \"996\" culture of long working hours with little perceived reward, are currently considered a veiled criticism of the Party and therefore the sort of thing of which the CAC wants to see less online.\n\nIs that refering to a culture of working 9AM-9PM six days a week (70 hours per week).\n\nNo wonder the Chinese aren't having kids.  How do you do anything on your off time apart from eating, sleeping, laundry and personal hygiene, when working those hours?", "label": 0}
{"text": "Umm, not at all. Would you prefer if automatisation hadn't happened and everything would be handmade and cost much much more? It's just an automatisation of another industry, and it's good for people.", "label": 0}
{"text": "Because the corporations and people in STEM fields that are not \"know nothing proles\" that are using advanced LLM's daily would not tolerate models being intentionally undermined in the way you're suggesting. ", "label": 0}
{"text": "But is it an observed phenomena or a theoretical one", "label": 0}
{"text": "Everything he said is so rediculous now. He said so many things such as opensource LLM has no future, and will beaten by private LLM.  He is now a politician. No longer technologically astute like the days when he was young", "label": 0}
{"text": "Right now? No. Possible in future, in theory? Probably. When? Who knows.", "label": 0}
{"text": "And I'm 90% sure you're a bot", "label": 0}
{"text": "It’s sad when you could educate yourself and instead choose to regurgitate hateful stereotypes", "label": 0}
{"text": "Wow that sentence almost sounded completely human.", "label": 0}
{"text": "That's a legitimate health reason to take it though. Don't be afraid to advocate for yourself and your well-being!", "label": 0}
{"text": "I think we're about to see a scenario where a lot of companies basically freeze hiring for graduate/junior positions... And find out there's a strange lack of senior developers a few years down the line.", "label": 0}
{"text": "Hallucinations have not improved between now and 2023 except in cases where training data has been increased. But wevea since reached the limits of data availability, and synthetic data is highly flawed. \n\n\nIntrospection is a word that describes something a human can do, that we do not understand in the slightest. It's simply an anthropamorphising of things to use this term, same with \"hallucinations\". \n\n\nThere's no hallucinations, and there's no introspection, there are just the expected outcomes of a system built purely on associative probabilities in text, with a random element thrown on top. ", "label": 0}
{"text": "Several, but most of them not. Dude, really? Industrialisation and automatisation lead to lower prices of goods. It's a fact, not theory.", "label": 0}
{"text": "Paraphrasing Paul Today: AI as currently envisaged will allow wealth to access skills while blocking skills from accessing wealth", "label": 0}
{"text": "If your bar is the average brainwashed right wing or left wing bozo yeah I think we can have a better baseline than humans.", "label": 0}
{"text": "Exactly one day it may get there but today it's not the driver just the vehicle.", "label": 0}
{"text": "I would suggest watching Robocop 2 before making up your mind about this. The subjects went through a lot of pain and became suicidal.", "label": 0}
{"text": "The former OpenAI employee has a fundamental misunderstanding of exactly what Copyright protects. Go to the essay at [https://suchir.net/fair\\_use.html](https://suchir.net/fair_use.html)\n\nIn it the author says: \n\n>I think it’s pretty obvious that the market harms from ChatGPT mostly come from it producing substitutes. For example, if we had the programming question “Why does 0.1 + 0.2 = 0.30000000000000004 in floating point arithmetic?”, we could ask ChatGPT and receive the response on the left, instead of searching Stack Overflow for the answer on the right:\n\n>\n\n>These answers aren’t substantially similar, but they serve the same basic purpose. The market harms from this type of use can be measured in decreased website traffic to Stack Overflow.\n\n>\n\n>This is an example of an exact substitute, but in reality substitution is a matter of degree. For example, existing answers to all of the following questions would also answer our original question, depending on how much independent thought we’re willing to put in:\n\n>“Why does 0.2 + 0.4 = 0.60000000000000008 in floating point arithmetic?”\n\n>“How are decimals represented in floating point?”\n\n>“How do floating point numbers work?”\n\nHowever, you can't copyright a fact, and according to the U.S. Government page about copyright - **And always keep in mind that copyright protects expression, and never ideas, procedures, methods, systems, processes, concepts, principles, or discoveries.**\n\nJust because a user on stack overflow came up with an answer, and by the way must license it royalty free in perpetuity to Stack Overflow so that the company not the user who provided the answer can extract value from the answers, which recently has included training the Stack Overflow AI - [https://stackoverflow.co/teams/ai/](https://stackoverflow.co/teams/ai/) \\- doesn't mean that the original answer can extend its copyright to all other similar answers. It just means the exact answer receives protection.\n\nThe U.S. Constitution also weighs in saying \n\n**To promote the Progress of Science and useful Arts, by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries;**\n\nContent industry lobbyists have perverted the 'securing for limited times' part so that copyrights now benefits businesses decades after the authors/creator dies. We go back to actually limited copyrights, and most of this would clear up immediately.", "label": 0}
{"text": "I'm not a coder but a sysadmin and AI can definitely help write scripts but it tends to make up very real looking commands that don't exist.", "label": 0}
{"text": "How can you say this when one of the most famous cases of hallucinations was two lawyers using chatgpt. Clearly it definitely is a problem even when skilled people use it. ", "label": 0}
{"text": "The problem is basic economics. If you wipe out labor you end up destroying value in the process. You can't charge more than the cost of electricity for anything an AI does and the majority of what it does will be discarded as incorrect anyway.\n\nWhen you remove your employees you are also removing someone else's customer from the market and this leads to a slowdown in the velocity of money. This system breaks down long before literally everyone is \"replaced\". Take unemployment from 4% to 10% and you already have huge problems. Once you hit 20% and everyone knows that AI is why then you're going to get violence and political upheavals.\n\nThe key problem here that is different from prior displacements is that this one presents no hope for the future. People who have no hope for the future are less likely to ask nicely for a redress of their grievances.", "label": 0}
{"text": "What do you mean? Until now you can do simple tasks using your EEG", "label": 0}
{"text": "Sam Altman is a charlatan and a thief. But big corporations and billionaires are looking to make lots of money from his product, so they will let it slide.", "label": 0}
{"text": "Do an experiment - get someone to put a tourniquet on one leg, then chop it off above the knee.\n\nA short visit to the hospital and you'll start your journey with one part replaced by a machine...\n\nRinse and repeat dude - have at it.", "label": 0}
{"text": "It’s a silver bullet. It truly is as good as it sounds. I don’t imagine their being a long term side effects.", "label": 0}
{"text": "Get rid of body entirely? Not in our lifetimes. Best I would expect is maybe in 30 years you could cut all your limbs off and have them replaced, or possibly an exoskeleton that fits around your limbless torso. Would probably cost a few million though and ultimately not better than your real body.", "label": 0}
{"text": "Computers are binary, and honestly even quantum computers to some point are. (Yes i know, not really, it's complicated, blah, let's simplify it as much as possible now which means fo what is revealed in next sentence, qubits are more like binary than not, thanks) \n\n\nHowever, we have evidence, the human brain is not based on binary processing. We aren't exactly sure yet how exactly the neurons operate in a pure number logic, just that there are really good evidence that it is more than binary processing.\n\n\nSo, in short: probably not no. Worse, we might kill the planet before we have a chance to migrate into digital. Sorry.", "label": 0}
{"text": "Agree.\n\nPlus, I do think AI can output infringing content, but the AI user who created it should be liable for the content not the engine, since it is a result of specific prompts, and then the copyright holder should have to sue that individual. However, there is little to negative money in doing that for the copyright holders once you add in legal fees. So, they want to whack the AI Startups while they are pinatas full of investor's money and hope billions fall out that they can grab, even if the AI training itself is probably transformative and is fair use.", "label": 0}
{"text": "What’s that?", "label": 0}
{"text": "And for writing, being an “editor” is so much easier than an “author”. Having Copilot write 3 paragraphs summarizing a topic or slide deck that I then review is a big time saver.", "label": 0}
{"text": "> how could that possibly be proven if the measuring is the trigger to it becoming finite in the first place?\n\nFor example, take a classic [double-slit experiment](https://en.wikipedia.org/wiki/Double-slit_experiment). This has been *routinely* experimentally verified for photons, electrons, and even whole atoms. \n\nThe premise is that you have a detector placed at one end of your setup, something capable of shooting individual photons, electrons, or atoms at the detector at the other, and a barrier with two slits cut into it in the middle.\n\nIf--as you suggest--each particle has a pre-defined state, you'd expect that your detector would light up precisely behind those two slits, as each particle passes through one or the other of the slits (or is blocked by the barrier, and the detector doesn't register anything).\n\nThat's not what happens. Instead, what happens is that the detector lights up in a pattern that can **only** be the result of a *wave* passing through both of the slits at once and interfering with itself. And that can only happen if the particle is truly in a superposition of states--that is, it passes through both slits simultaneously--before detection. \n\nI realize that \"this is what science says\" is more of an appeal-to-authority fallacy than a real argument, but seriously--google it. This *is* the accepted science on the topic, and my relatively-informed-but-still-layman explanation can't do it proper justice.\n\n[Here](https://www.youtube.com/watch?v=p-MNSLsjjdo) is a PBS Spacetime video that goes over this particular type of experiment. That's as legitimate a source as you'll be able to find for layman science explanations, not some conspiracy theorist spouting nonsense. And if you're interested in this kind of thing, their content is extensive and fantastic.", "label": 0}
{"text": "But when AI is generating an answer, it's not copying anything to be considered plagiarizing in the first place. \n\nIt's not reaching into a database of saved documents and just regurgitating it word for word.", "label": 0}
{"text": "I want to make a reddit bot that says \"you're not mean\" every time someone starts a post with \"I mean.\" It would go crazy.", "label": 0}
{"text": "Yes, this.\nFor example, if you are using LLMs for automation, it writes code for you half good half not so good.\nYou test it, read the code yourself, and ask it to improve the bad parts. \nAt the end of the day, the mundane task will be successfully automated through trial and error.", "label": 0}
{"text": "Yes, but you’ll lose certain functions and will be a burden to your family", "label": 0}
{"text": "As long as you can make it agree every time, it's worthless (unless you can filter bad answers thanks to your knowledge).", "label": 0}
{"text": "I find it's also super useful for drafting up well known technical strategies really quickly, I've been using cursor as a daily driver and feel there's tonnes of benefit there as well, especially when it comes to not watering down your skillset so much and staying more involved with the code.", "label": 0}
{"text": "[https://www.nolo.com/legal-encyclopedia/fair-use-the-four-factors.html](https://www.nolo.com/legal-encyclopedia/fair-use-the-four-factors.html)\n\nIncorrect copyright law is actually fairly clear here. The problem is the scale of the infringement is so massive and the cultural zeitgeist around tech has gotten ahead of the law. The general public has no understanding of copyright law and these tech companies are using that to gaslight professionals into accepting being fucked over by AI.", "label": 0}
{"text": "Plagiarism is not limited to verbatim copying. It is representing someone else's work as your own.", "label": 0}
{"text": "Oh no! Not my favorite law, the copyright! Damn, those pirates are everywhere now!", "label": 0}
{"text": "True but when it doesn't work \"X is not a real function, please provide an alternative\".\n\n\nIt's not like you're writing script and pushing it straight to live without testing! ", "label": 0}
{"text": "there is absolutely nothing noble about copyright.", "label": 0}
{"text": "Yeah let’s not fix the food and daily routine, just get a drug and you can eat like shit and be ok lol", "label": 0}
{"text": "No, it's real world value driving the bubble. Millions of people are using LLM's as part of their job every single day whether this sub wants to admit it or not. ", "label": 0}
{"text": "Copyright might be extinct as we know it within 10 years.  It’s an antiquated system that wasn’t designed for our age. It’s overrun and is basically treated like a speed bump on a road or a traffic violation.", "label": 0}
{"text": "And yet I have been an active artist my entire life.\n\nIt does far more harm than good. And by far most of the good it does is for those who have the money to protect themselves and shout the loudest. \n\nCopyright is a short sighted money grab, it conflicts with reality.", "label": 0}
{"text": "Exactly. If AI starts taking over all of the entry level positions, who's going to be there to turn into the advanced/senior roles after the current ones age out?\n\nThey're probably banking on AI being good enough by then for those roles too, so we'll just have to see I guess.", "label": 0}
{"text": "Then there is no reason you should have any art in your life. Don’t think artists should be able to copyright their work? No art for you. This is how artists survive and get their dues for their art inspiring the world.", "label": 0}
{"text": "There’s nothing noble about stealing other people’s work and vomiting out a disgusting approximation soup of it", "label": 0}
{"text": "Hallucinations are not even the main problem.\n\nNowadays AI = LLM, and LLMs are not even that good at most things people claim they're good at. They're just remarkable for their worth, but not good. \n\nThe reason LLMs \"hallucinate\" \\*\\*so often\\*\\*, is just because they're just text predictors. They dont have reasoning skills - at all. Aside from Transformer-based models like ChatGPT, we have NLNs, GNNs, Neuro-Symbolic Models, which their purpose alone is to make AIs with reasoning. Well, ChatGPT or any popular LLM is not ... that.\n\nIf you convinced/gaslighted an LLM that Tolkien's elf speech is normal english, they would \"believe you\", because they have no reasoning skills. It's just a machine trained to predict what is the right order of characters to respond with.\n\nThe reason it gives the illusion of reasoning or sophistication, is because the AI has decades worth of training data and billions $$$$ were used to train it. It's so much data, that it really has built the illusion that it's more than it really is. We're talking about Terabytes of just text. \n\nChatGPT o1 what it has done to deepen that \"Reasoning illusion\" is to literally re-feed its own output to itself, making it one of the most expensive LLMs out there. That's why you almost instantly get a \"max tokens used\" type of message because its super inefficient, and it still wont ever be able to achieve true reasoning. I still managed easily without hacks to make it mistake the basic \"Wolf-Sheep-Shepherd\" riddle, didnt even gaslighted it.\n\nProving that this whole thing is a hype bubble because the dust has not settled yet. OpenAI is constantly trying to gaslight people, and it makes more difficult for the dust to settle. But it slowly does compared to early days of hype. AI has existed since the 60's. The only reason this super hype marketing is happening now is because we got huge amounts of $$$$ suddenly invested into it and there is so much data \"free\" on the internet.", "label": 0}
{"text": "True.  I was prescribed wegovy around October of 2023 and I could not get it filled at all. All the pharmacies were out. I tried for months and then my insurance took it off their approved drug lists, so I gave up.", "label": 0}
{"text": "AI isn't a person claiming ownership. It's a tool synthesizing information and expressing it in a new way. Your example is completely off base—it's not at all like regurgitating something looked up, because nothing is being \"looked up\" during generation. It's closer to applying knowledge learned in college. Is a doctor \"plagiarizing\" every textbook they used when using their knowledge to make a diagnosis?", "label": 0}
{"text": ">WHY IS EVERY FUCKING TOP COMMENT A CYNICAL NIHILIST HOPELESS TAKE.\n\nWe had reports of bots that spread cynical comments about our power to stop global warming, that was financed by big oil companies. I wouldn't be surprised if the same is being done by AI companies.", "label": 0}
{"text": "It won’t work and we need to call it out immediately to move to the next step, which is actors like Cage striking until it doesn’t happen anymore.  It takes people with power to say this is wrong and then do something about it.\n\nIt can’t be on the new actors, they need these jobs to survive.  They do not have the luxury of saying no.", "label": 0}
{"text": "To humans, the land is barren and non arable.\n\nTo the insects, lizards, small mamals, birds, and assorted flora living there, it's a functional ecosystem. \n\nWe completely destroyed this planet because of thinking just like this. Since a thing isn't exploitable to us as humans, it has no value and can be destroyed to create value, *for us*\n\nHumanity is a cancer on this planet.", "label": 0}
{"text": "There are lots of things that are not possible to test in the real world and have to be done correctly the first time. It depends what you are doing. ", "label": 0}
{"text": "The \"players\" know and are aware of it. This, like almost all new tech industries, is a grift. They just need you to be unaware until they cash out. Then they will create another new tech industry grift and do exactly the same thing. Capitalize on ignorance!!!", "label": 0}
{"text": "Except what is being automated here isn't labour, it's art. It's expression. It's the commodification of the creative process taken to such an extreme that there is no 'creative process' left, just a lever that you pull and then slot machine algorithm spits out a facsimile of art and we all clap and pretend it's interesting but its vapid and pointless. Your complaint feels like it's just targeting a completely separate issue and then weaponizing it to justify this change. Celebrity pay and culture is an issue, but I honestly don't see what it has to do with this.", "label": 0}
{"text": "If that knowledge is general knowledge, yes. But that is not all the AI models are trained on. And yes there have been plenty of cases where AI has in fact regurgitated frequently cited information word for word.\n\n>Is a doctor \"plagiarizing\" every textbook they used when using their accumulated knowledge to make a diagnosis?\n\nNot relevant, a doctor doesn't present a diagnosis as an idea in a published work. If the doctor were to publish a paper based on what was presented in a textbook (if not considered general knowledge) or another person's research paper without citation though, it could be plagiarism. \n\n(You are cherry picking examples here too, but they're not even good examples...)", "label": 0}
{"text": "Ah I see you are One Of Th3 typ3 is b3773r. I lean on being optimistic except for fixing inequalities because money has too much place in politics.", "label": 0}
{"text": "A quantum physicist once said that \"if you understand quantum physics, you don't understand em\".", "label": 0}
{"text": "Also, he's suggesting there will be a bubble burst because large companies will wipe out the small start up companies. People are confusing a bursting bubble with poor performance. This man is saying the opposite. Large companies will produce such good results small companies won't be able to keep up. It's an investment bubble not a performance bubble.", "label": 0}
{"text": "Is it me being too picky - but the title says \"with up to 100% efficiency\" but the article says \"near - 100% efficiency **gains**\" (my emphasis).\n\nSurely - if something is 5% efficient, a 100% efficiency game would make it 10% efficient.   But something that is 100% efficient is something completely different.\n\nFor a lot of things, this sort of hair-splitting is not needed.  But a science based story - surely they have to be a bit clearer?\n\n  \nAITA?  Oh, sorry, wrong Sub.", "label": 0}
{"text": "Possibly the legal issues of copyright will burst it. It depends on training, and if the general knowledge of humanity is not allowed, it will be limited to a lot of small, specific datasets. Or at least it will have knowledge holes.", "label": 0}
{"text": "I don’t have much fat left. The weight I’m at is where the muscle would have to be. Unless I want to bulk which I don’t.", "label": 0}
{"text": ">Hallucinations have not improved between now and 2023 except in cases where training data has been increased.\n\nTraining data is increasing constantly. This only applies to AI systems that have not been updated at all since then.\n\nThe data wall is a myth. Synthetic data provides a bootstrapping mechanism . Any problem that can be scored (problems with verifiable answers) can be used to make synthetic data. Plus the use of AI produces a lot of good data and user feedback.\n\nSynthetic data already works. o1 is far more reliable and capable in math and science because of it.", "label": 0}
{"text": "The main problem is that language modelling simply isn’t truth-tracking. Combining traditional search algorithms with LLM functionality goes some way to mitigating that, but the systems need to be given some way of self-assessing the aim of a given question-response that goes beyond the way, e.g., Copilot seems to be doing it with “precise” to “creative” toggles.", "label": 0}
{"text": "If you can't tell the difference, then there is no need to pay more. If you can't tell AI art from human-made, then there is no actual difference from the consumer standpoint, you can feel all the same feelings looking on AI art as when looking on human-made art. You're just trying to add nonexistent extra value to human-made art. Also, it's cinema, not drawing, AI will just allow directors to express their creative vision easier. Also also, if people will need art with cReAtiVE ProCeSs, they will   still pay to human artists, but judging by artists soyjak rage reaction, the absolute majority of people don't need that.", "label": 0}
{"text": "Who said anything about total energy production? No one is talking about solar power in Maine. Solar power is already cheap in hot southern desert regions and it’s going to get even cheaper.", "label": 0}
{"text": "2005 so next year, two decades.", "label": 0}
{"text": "Plagiarism isn't a law.   It's an institutional rule set by schools.  Pretty much every news article you ever read contains rampant plagiarism, but nobody cares.", "label": 0}
{"text": "How else do you casually stalk your exes?", "label": 0}
{"text": "Here, maybe it can help fix your mind.\nhttps://compound-eye.org/currently/\n\nBut, most likely, your brain will just go https://www.youtube.com/watch?v=qkr-pj7HiqY", "label": 0}
{"text": "Don’t use the “people with money don’t invest in dumb throngs” logic please. 🙏 I’ve seen this fairytale too many times.\n\nIt doesn’t work. It’s an illusion. Which means it’s untrustworthy and easy to manipulate to do the wrong thing. That’s why we don’t build Transformer LLMs to do serious industrial stuff that require precision and certainty. \n\nYou are not the target audience for logical AIs, so you don’t actually get to pen test ChatGPT’s actual logical skills because all you usually use them for is for a) Google substitute b) boilerplates if you are a software engineer.", "label": 0}
{"text": "This actually supports his point and describes exactly why it's not copyright infringement.", "label": 0}
{"text": "I think that's not what's it all about and that is not what was meant. What they were talking about in the article is the fact that if you contact a company and talk to their chat bot, you'll get the right answer. These chat bots are specialised, target oriented and trained on the right models/data that is specific to the answers they expect to be given to the customers. \n\nI believe that most ai companies ( apart from google) do not care if their models are usefull for general stuff at the moment. They want them to be superspecialised in direct, useful and profitable fields. They want them to replace specialised workforce. That is where the money is.", "label": 0}
{"text": "This is beyond the weight loss. Yes, a percentage of reduction comes from fat loss, and over that, another percentage drop from some other mechanism. Please enroll in Zoolander’s school", "label": 0}
{"text": "\"Guilty\" here does not imply it breaks law or is a crime. Guilty can be attributed to a moral wrongdoing without it being outright illegal.", "label": 0}
{"text": "This reduction happens in people that don’t lose any weight even beyond the fat loss. Yes, losing weight any way will reduce your risk, now add a few more % on top of that.\nMight be reduction in inflammation or something else", "label": 0}
{"text": "> I do think AI can output infringing content\n\nIt can happen, but it is very rare. It is always treated as a defect and resolved. Stable diffusion did it a few times because an image was in the training data multiple times in multiple places. The moment it got discovered the updated the training data to get rid of it.\n\nAI duplicating an existing work is undesirable. You can just go look or read the original work itself. Spending all that effort to make a piracy engine would be stupid. There are huge chunks of the internet devoted to piracy already.", "label": 0}
{"text": "Well you can't magically get answers to the questions that aren't answered by anyone online.", "label": 0}
{"text": "> there is absolutely nothing noble about copyright after the death of the artist\n\nFTFY. Protecting an artist's livelihood is entirely sensible and is the right thing to do as a society that **enjoys art**. Allowing some megacorp to suckle on the artist's bone marrow a hundred years after they're gone is what's perverse about copyright.", "label": 0}
{"text": "I'm not here to answer your straw man arguments.", "label": 0}
{"text": "I just tried to identify a bird in my garden a few minutes ago, searched <my country name><bird description>. It brought up a picture of the right bird, but captioned with the wrong name. Only knew to scroll down to a different result because the bird it said it was is incredibly common and most natives could spot the error.\n\nScreen capped the bird into ChatGPT and asked it to identify, it got it right. Not exactly a thorough test but yeah, Google ain't the best.", "label": 0}
{"text": "Yeah, I agree 100%. \n\nHonestly I don't remember where I got the \"gains\" quote from now. Looking at the title it doesn't say that at all. Completely misleading, nor can I find that particular in a quick glance of the article.", "label": 0}
{"text": "I would agree that it does more harm than good, and that many of the protections only seem available to those with money. I would also add that punitive damages in the US is bullshit, you shouldn't be able to profit from a copyright claim. If all you can file for is indemnity, then copyright claims become much more reasonable. Napster cases against individuals downloading mp3s didn't really happen so much in Europe.\n\nHowever the core principle of intellectual property and copyright law is sound - the motivation behind it. What it needs is much shorter terms, the 20 years that patent law has is quite reasonable. 70 years after death is ridiculous, no one should be able to milk something that long; it's just not in the benefit of society.", "label": 0}
{"text": "Sadly is not the technology but conpanies wanting a sick economical system to be the only way", "label": 0}
{"text": "Copyright doesn’t protect artists; it protects corporations who have enough money to litigate.", "label": 0}
{"text": "I think your opinion is outdated; for code generation in most cases it’s currently very good.", "label": 0}
{"text": "My layman level understanding is that a lot of medical research is not replicable anyways... So I wouldn't trust an AI that is trained on tons of probably dubious medical papers.", "label": 0}
{"text": "Your argument kind of falls apart if you insert \"intellectual property\" instead of copyright.  There are many forms of IP protection. This slippery slope is really unnecessary too. We are talking about an algorithm using human art to churn out \"new\" work without giving credit or recompense.", "label": 0}
{"text": "The only desalination plan I can even remotely get behind is the planned desalination plant in Mexico on the sea of Cortez that will allow Mexican farmers to have more irrigation water, and reduce the strain on the Colorado river. \nThe US has an idled desalination plant in that area already that's been unused for 20+ years due to the brine content.", "label": 0}
{"text": "This point right here is the dark underbelly of AI. It doesn’t create anything new. Its just using data already available. It can give you perspective on that data like examples, analogies and perspectives from different angles but its not anything “net new” someone has heard of or thought of.", "label": 0}
{"text": "As an engineer when I generate presentations with a GPT I constantly have to double check everything. Its almost more work than just doing it myself. Lots of stupid shit like fantasy formulas and missed out constants that magically resolves by another error downstream...", "label": 0}
{"text": "Suddenly everyone’s going to love copyright law\n\nYa know the internet full of people justifying their ad blocking and pirating \n\nWho complain about Disney copyright bs\n\nSuddenly we all love and respect copyright law lol", "label": 0}
{"text": "Thanks for providing the link to the original Essay. Looking at the source for their 'analysis' of Part 4 of the fair use test (\"the effect of the use upon the potential market for or value of the copyrighted work\") doesn't fill me with confidence that this is anything else than a hit piece. It's been known for years that less people visit Stack Overflow (e.g. because it gets more toxic all the time, questions get just closed as off-topic or duplicate for no good reason), that the volume of Stack Overflow questions has been going down (because most trivial questions have been asked and it's not really as good for non-trivial questions as people hoped) and that there is in general an decrease in new people using SO. Taking these existing trends, but trying to frame them as being the result of ChatGPT (by only showing five weeks before the ChatGPT release and fifteen weeks after, so the trend is less obvious) is lying using statistics.\n\nUsing such a weak source is already a red flag, but then the author continues with making assumptions that support the intended result, which is unscientific. If whatever you want to produce should have any scientific value and not just the veneer of scientific language you need to consider all information and not just cherry pick those that support your conclusion.\n\nSo, all in all, as I said above: This is a hit piece. The information contained can be summed as \"I think it is the case. I won't elaborate. Have a nice day.\"\n\nCould (Open)AI be copyright infringement or even more important detrimental to arts and science? We still don't know. And this doesn't provide any new information on the issue. Sad.", "label": 0}
{"text": "Can I ask if it affects enjoyment of other things? Like if you’re have hobbies or like eating, does it reduce how much you enjoy those things.", "label": 0}
{"text": "Google doesn't answer questions though, or pretend to. All it does it help you find sources that could answer your question. It's up to you to judge the authenticity if a source.\n\nThat said, Google has gotten worse intentionally by design, they've sabotaged the app to increase advertising profits.", "label": 0}
{"text": "> Either the value remains at what you describe, a glorified search engine and summarisation machine  \n  \nThis ignores the other applications I mentioned. If we're talking personal anecdotes, I have friends in C-suite positions that are similarly using LLM's daily. I have another friend with a PhD that works for a multinational cyber security firm who says their entire company is using LLM's.  \n  \nIf we venture outside of LLM's, you have AI like AlphaFold, folding all 200 million proteins in the known universe. There's also Runway, who's video generation is good enough that it got them a partnership with Lionsgate, who said they expect Runway to save them \"millions and millions of dolllars\" on VFX.  \n  \nThis is not potential for value in the future. These models are immensely valuable right now.", "label": 0}
{"text": "Sure we completely eliminated all creativity and joy in the world, but for a short time we created a lot of value for our shareholders", "label": 0}
{"text": "Alright, I see where you’re coming from - but this would be extending the law beyond the way it’s written and the way it’s been applied before. The way the law is written the third party producer would have to be a government contractor and for government use, it doesn’t just allow for a party to be granted the ability to produce generics outside of a government contract. When this has been used before has been stockpiling of medications by the government or for government use - like for Medicaid patients. In other countries there are similar laws that do outright allow for what you originally described… but the United States is not one of them.\n\nSo while this could certainly benefit many people in the US who are covered under government supported plans (though this wouldn’t allow for off label usage), this doesn’t seem like it would apply in the way you want under our current system.", "label": 0}
{"text": "AI will be used against people and now thanks to the same people is full of data , the AI already made his move against people and people dont have a clue about \n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC7845267/\n\nhttps://thequantuminsider.com/2024/06/03/moderna-ibm-quantum-researchers-use-quantum-computers-for-critical-step-in-rna-based-therapeutic-design/\n\nhttps://oxfordglobal.com/discovery-development/resources/mrna-vaccine-development-to-get-a-quantum-boost\n\nhttps://www.mdpi.com/2571-5577/4/2/27\n\nhttps://ijvtpr.com/index.php/IJVTPR/article/view/102\n\nhttps://www.ijvtpr.com/index.php/IJVTPR/article/view/111?fbclid=IwZXh0bgNhZW0CMTEAAR30Gp1jTINXyovuSCeqOxRiNpQFC8zqnwK9zFNrO25SnL5Ctk4dk8MSV0w_aem_8NAZOQ6ntdJHPUq5_m4HEw", "label": 0}
{"text": "Change taxation to make polluters pay. If running my home heating on gas is about the same cost as running a heat pump why would I change? Same with cars, when public charging is the same price as liquid fuel where’s the incentive?", "label": 0}
{"text": "Submission statement: \"Brundage still believes that while AGI can benefit all of humanity, it won't automatically do so. Instead, the humans in charge of making it — and regulating it — have to go about doing so deliberately. That caveat suggests that he may not think OpenAI is being sufficiently deliberate in how it approaches AGI stewardship.\n\nWith the senior researcher's exit, Brundage says OpenAI is reassigning members of its AGI readiness team to other groups within the organization. This dissolution comes less than six months after it [kiboshed its AI safety team](https://futurism.com/the-byte/sam-altman-openai-safety-team-replacement), which doesn't exactly bode well as this [latest big-name resignation](https://futurism.com/openai-execs-quit) shakes up the company's leadership.\"", "label": 0}
{"text": "> And yes there have been plenty of cases where AI has in fact regurgitated frequently cited information word for word.\n\nVerbatim regurgitation can happen with AI. But that's typically when someone is *specifically* trying to make it happen, by prompting it very precisely to reproduce known text. It's the exception, not the rule, and it doesn't support the argument that all AI-generated text is copyright infringement or plagiarism.\n\nBut sure, I don't think anyone disagrees that the end-user can misuse AI and its output in ways that may violate copyright.\n\n>Not relevant, a doctor doesn't present a diagnosis as an idea in a published work when they treat patients. If the doctor were to publish a paper based on what was presented in a textbook (if not considered general knowledge) or another person's research paper without citation though, it could be plagiarism.\n\nThe point of my doctor analogy was to illustrate how AI *applies* knowledge, not *copies* it - compared to your example of a student copying information. A doctor using learned knowledge isn't plagiarism, and neither is AI. You're stretching the analogy to argue a point that I didn't make.\n\nBut to address your argument, AI isn't \"publishing a work\", because AI is not a person. It is not an author. It's simply a tool used by people. This is why your stretching of the analogy breaks down.\n\n>You are cherry picking examples here too, but they're not even good examples...\n\nMy example was not perfect (I was simply trying to maintain the student analogy to discuss how AI applies knowledge), but it's MUCH closer to how AI works than your completely bullshit misrepresentation. AI doesn't function by simply retrieving and regurgitating text like a student cheating on an essay. That's the point.", "label": 0}
{"text": "Let's say you're right and lots of people leave the cities for the vast midwestern plains. So what? There aren't enough people for a dense population out there. We'd have occasional houses, widely scattered, and all the rest would still be native prairie.", "label": 0}
{"text": "Dude, its impossible to get rid of the hallucinations. AI isn't actually intelligent, good at mimicry and bullshitting, but at the end of the day there's no actual intelligence to verify if it's correct. It just steals what other people online already said with no ability to correct for accuracy. \n\nAnd there's no way to fix this, and that's why folks are warning not to get too invested in \"AI\", it has some specific uses but right now it's way overhyped. And if you started updating copyright laws to force them to pay for the content they use to make their products, most of these projects go bankrup overnight.\n\nSo yeah, it's a bubble. It's overhyped tech that can't do what they're pretending it eventually will, that's incredibly reliant on copyright theft for development.", "label": 0}
{"text": "I think it can and does happen more often than you indicate.\n\nHere is a [Verge article](https://www.theverge.com/2024/8/14/24220173/xai-grok-image-generator-misinformation-offensive-imges) that came out when Grok powered by Flux debuted, and unless you think [this image of Mickey Mouse gone MAGA](https://duet-cdn.vox-cdn.com/thumbor/0x0:2250x1500/1200x800/filters:focal(941x722:942x723):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/25572388/ai_label.png) is Fair Use for parody's sake, I think it's infringement (at least when first created, but it's obviously Fair Use when it's appearing in this news report).\n\nBut unless you want AI to be like Bernard (in a superb performance by Jeffery Wright), and have it aligned so that any copyright data causes AI to go [It doesn't look like anything to me](https://www.youtube.com/watch?v=o0iAY0f-BIM) as AI increases in capabilities it will be able to know about copyright data.", "label": 0}
{"text": "It's more like feeding data into the prompt.\n\nFor example:\n\nUser: What day is it?\n\nRag modified prompt: What day is it? (P.s. Today is October 26th)\n\nThen the LLM can respond with knowledge that ideally will help it to accomplish the task. This increases the probably that what it hallucinates is true, but it doesn't get red of the problem. This is partially because making a perfect rag system for all the data in existence would take up a massive amount of storage and be hard to sort through, but also because language isn't a good mechanism to deliver logic due to ambiguity and the number of methods to say the same thing.\n\nThere's various other issues due to the way that these models predict. For example the \"reversal curse\" where a model trained on A=B will fail to learn that B=A. Or a model trained to learn that Ys mom is X will fail to learn that the child of X is Y.\n\nEven with RAG or with the necessary data all loaded in it's context, models still don't have perfect recall to extrapolate that data.", "label": 0}
{"text": "As usual this is just luddites fearmongering because they're too dumb to see the potential.\n\nHuman actors will still be needed for a long time. They can use AI to do the easy stuff and get movies out faster and with less work for everyone involved.\n\nActors can focus on doing dialog for the pivotal moments of the movie instead of jumping around in a mocap suit swinging a pool noodle.", "label": 0}
{"text": "Then he should have tried to sabotage the company from within while he was still there.", "label": 0}
{"text": "After seeing tons of articles like this over the past few years with people breaking the \"law\" but suffering zero consequences the only logical conclusion is this:\n\nDo what the fuck you want and only stop if you have no other choice", "label": 0}
{"text": "I lose 15 after that gain 15. On the same drug level. It makes loose weight definitely more easy, but you still have do something and your taste of food changed/nausea sometimes.", "label": 0}
{"text": "Even if it technically \"hallucinates\" , it would still give a correct answer in your example right? So there should be several use cases where it will be reliable", "label": 0}
{"text": "The ethical application is called doing your own writing and research. which the vast majority of us still do.", "label": 0}
{"text": "No one can, friend.", "label": 0}
{"text": "Actually, there are exactly four types of legally protected IP: copyright, patents, trade secrets, and trademarks. That’s it. ", "label": 0}
{"text": "This is the fundamental issue:\n\n\nLet's say I make a living as a writer. I make really great video game guides on my website, and I support myself with advertisement revenue.\n\n\nGoogle and I have a pretty symbiotic relationship. I make their website better because my great guides are at the top of their search. That gives them ad revenue from visitors. Meanwhile, Google directs viewers to my site so I can grow my audience and revenue.\n\n\nThen one day, Google drops their new AI. It crawls my website for the guide and then summarizes it directly on Google's website, above the link to my page. Now my relationship with Google is parasitic: they summarize my content and then don't actually send me any content. My hard work becomes theirs, with no benefit to me.\n\n\nThe end result of this is that I stop writing guides as it no longer pays the bills. The Internet no longer has my great content. Meanwhile, the AI can no longer read my guides, so now it can't make quality summaries for Google's visitors. Writers and audiences lose, while Google still profits.\n\n\nThat's a lousy business model. It is also exactly what Google is telling Wall Street how it wants to monetize these things. The company is undermining the business model of everyone that relies on writing, including journalists and academics. But it isn't the case that they are becoming obsolete. Their job is to give you new information - interviewing sources, conducting experiments, etc - which LLMs can't do. \n\n\nThis actually makes things worse, and frankly it is precisely what copyright law was meant to prevent. The entire point was to allow people who make things to not simply have someone with more money pluck it from them and then re-sell it.", "label": 0}
{"text": "Idk about ai companies, but ethical companies who train models use licensed sources and validated models. This is important because they need traceability for both auditing purposes (to stay within the law) and for traceability (to explain why the model produced a particular output).", "label": 0}
{"text": "I think AI will implode multiple sectors of the world economy by 2027. The tech is just too powerful for the big corporations to go slow on adoption. They want high margins.", "label": 0}
{"text": "I'm not so sure hallucinations are going to be cured that easily.", "label": 0}
{"text": "Unfortunately this is America today \n\nInclude commute times and pre/post work routines \n\nNo one wants kids in these conditions", "label": 0}
{"text": "Researchers warn though, that if your stop ozempic, you get back your hunger and weight pretty fast.", "label": 0}
{"text": "Just how many jobs so you know where there are questions that haven't been answered by someone?", "label": 0}
{"text": "Yes that's part of it but I think only half.\n\n\nIf the tech enables the creation a feature length film by just asking he AI to generate it, and that point you don't need studios or actors for commercial creations.\n\n\nBut I agree with the economic system, it doesn't generate or create opportunities for most artists. But I think there is an opportunity to create and fund local and community art houses. For actors to create in their community. \n\n\nBut art is general as a commercial product, regardless of economics, will.be fundamentally altered by AI.", "label": 0}
{"text": ">Then Sam Altman bypassed the board and released ChatGPT. No real guardrails to prevent misuse. And this has been pretty disastrous for the Internet.\n\nAnd it kickstarted the discussion we now have around ai so it doesn't fucking hit us like a train when we eventually get agi.", "label": 0}
{"text": "Yeah no. The only way “AI” works is by stealing works created by artists and people with actual creative talent and training itself on it. It’s theft and you know it. Try and bog it down with some weird philosophical perspective all you want, they’re profiteering from theft and putting creatives out of work.", "label": 0}
{"text": "Not always. There's \"needle in a haystack\" tests that have been used for purely context, and while they are accurate for a single piece of information it falls apart more with each extra piece of information it is trying to recall. \n\nRag makes models substantially more reliable, but it would likely depends on the situation if it's reliable enough. The other issues with many applications is the potential for exploitation of the model to do something it isn't supposed to do. (This would come into play of the model would drive tools to do something.)", "label": 0}
{"text": "It's probably a bit of both tbh.", "label": 0}
{"text": "lol nope. On it. Still needed sinus surgery. Much better now!", "label": 0}
{"text": "The evil happening behind those doors must be wild", "label": 0}
{"text": "Not too picky. [It was my mistake](https://www.reddit.com/r/Futurology/comments/1g8qotw/new_electrostatic_motors_deliver_750_to_3750/lt2r2ep/).", "label": 0}
