{"text": "Hello", "label": 1}
{"text": "Nice one", "label": 1}
{"text": "Sigh. Put the porn down and go live in the world. This is sad", "label": 1}
{"text": "Yes, you've explained that, because you think breastfeeding a child is sexual and this disturbs you. But it isn't sexual.", "label": 1}
{"text": "Again, no breastfeeding occured in reality. Again, since you are seemingly fucking stupid. Sucking on boobs is sexual, if someone walked into a police station with a picture of a ten year old boy sucking on an adult woman's tits they would be immediately arrested for possession of child porn. You need to get your brain scanned because you are either extremely stupid or just really enjoy arguing an invalid point.", "label": 1}
{"text": "You ever been fucked, little girl?", "label": 1}
{"text": "\"He's like that one friend who always promises to bring snacks to the party but shows up empty-handed every time. At this point, we just need to accept that the snacks are never coming.\"", "label": 1}
{"text": "It’s called acting, something mature and professional people can do and understand without projecting their weird mommy issues on everything.", "label": 1}
{"text": "Lol. Quickly deleted random personal attack, too.", "label": 1}
{"text": "😍", "label": 1}
{"text": "ah well, first I'd stop harrassing everyone around me, specially my uncle that is oviously turning into a supervillain.  \nAnd send my mom on a mission to old valyria or something", "label": 1}
{"text": "shit you're right. dani is a different kind of an idiot.", "label": 1}
{"text": "Everything the above comments say, but my personal addition would mainly be to change that horrible ass haircut and make someone make me a proper crown that i'm not gonna wear like a douche", "label": 1}
{"text": "Why does it look like gun dildo? Theres literal balls", "label": 1}
{"text": "It does look like a dildo i once saw that was called “the Jurassic cock”.", "label": 1}
{"text": "Authentic family DNA!", "label": 1}
{"text": "No one knew it better from the start", "label": 1}
{"text": "This particular user exhibit several characteristics commonly associated with a resubmission bot:\n\n1. The account is only one month old, falling within the 1-6 month age range typical for spam accounts.\n2. Posting history is quite limited or non existent.\n3. Commenting history is quite limited or non existent.\n4. Active posting began only recently, from a few hours to a few days ago, or right at the account's creation.\n5. The user frequently resubmits high-vote content and even adds a slim white border around the post to avoid detection from resubmission bot detectors.\n6. They often resubmit the top comment from the same post they resubmitted in order to gain comment\n\nGiven these signs, it's possible that this account might transition to posting merchandise/crypto scams as soon as it accumulates a certain amount of karma.\n\n-----\n**Report the account: Report -> Spam -> Disruptive use of bots or Al.**", "label": 1}
{"text": "If English isn't your first language why would you possibly (and incorrectly) criticize my grammar? Smoothbrain", "label": 1}
{"text": "Woah! I never knew there was original art cover.", "label": 1}
{"text": "I read their last day (Sophie’s at least) was filming the council scene when they decide who’s King.", "label": 1}
{"text": "I mean it was the largest twist in the show, just keep in mind things that are said specifically about Targaryen's by Master Aemon of the Nights Watch. \n\nA lot of fans of the series got big mad because they forgot subtle hints from the starting seasons of how things would turn out.", "label": 1}
{"text": "I get what you are saying, seriously I do. But even tho it's portrayed as breast feeding, sucking a woman's boob is inherently sexual. So again I ask, would you not be disgusted if a CHILD had their mouth on a prosthetic penis or dildo? It's just really bizarre to me.", "label": 1}
{"text": "Well she is an actual porn actress 🤷🏽‍♂️", "label": 1}
{"text": "Any Tywin's scene shouldn't be deleted", "label": 1}
{"text": "The man skinned his own supper....him doing these type of things wouldnt surprise me", "label": 1}
{"text": "I don't know how to tell this.... It's ACTING,.. make believe? We all know what rape is....... you're right it was horrifying... for the moment, but I slept peacefully that night cause it was fiction \n\n19 is an adult. You can do porn, go to war, and vote. I don't know what is creepy about that.", "label": 1}
{"text": "Tywin was furious of getting Jaime back...", "label": 1}
{"text": "Yeah, I found it amusing to watch him stop pretending.", "label": 1}
{"text": "happy old age", "label": 1}
{"text": "Everyone is excited!", "label": 1}
{"text": "Arya is right all along", "label": 1}
{"text": "We just kept on waiting and boom the season's over.", "label": 1}
{"text": "Mine is between her fight with the hound and her knightship by Jamie", "label": 1}
{"text": "btw Paddy Considine’s performance was brilliant from start to finish. I wasn’t ready for him to die, even when I knew it was coming.", "label": 1}
{"text": "Got alternate galaxy", "label": 1}
{"text": "Then either take the Black (or slit ur throat, r*pist), quit being a spineless perv or start being actually funny", "label": 1}
{"text": "Nice and gorgeous costume! FOR THE WATCH!", "label": 1}
{"text": "They saved up so much from the babies they had collected", "label": 1}
{"text": "oh my god", "label": 1}
{"text": "When she took it off.", "label": 1}
{"text": "Poor future husband", "label": 1}
{"text": "I'd seen this multiple times", "label": 1}
{"text": "That moustache for Jaime wins", "label": 1}
{"text": "lo, same", "label": 1}
{"text": "For Danerys it’s naked 🤣", "label": 1}
{"text": "she really wanted those elephants", "label": 1}
{"text": "Ned Stark nursed him on his titties", "label": 1}
{"text": "Any time where we get to see her tummy and/or tits", "label": 1}
{"text": "Jaime by far from proud lion to reasonable human being", "label": 1}
{"text": "I'm quite confused about this also, but I just think that their using old english and they're not really that sophisticated yet.", "label": 1}
{"text": "I would say Sansa, from a prince-loving kid to a queen", "label": 1}
{"text": "Shut tf up", "label": 1}
{"text": "They're called fanny wings, you uncouth slob.", "label": 1}
{"text": "I was also thinking about something similar", "label": 1}
{"text": "Winter came for house frey", "label": 1}
{"text": "Great collections!", "label": 1}
{"text": "All for Bran to be king", "label": 1}
{"text": "Always gotta being race into it where it’s not warranted. This is based on British and European history,  no shit a noble is rich and white. What a weird comment 😂😂😂😂", "label": 1}
{"text": "And she's been in porn", "label": 1}
{"text": "having sex with women, for starters", "label": 1}
{"text": "but he knew that he knew", "label": 1}
{"text": "Stannis is thinking “so, she wouldn’t chose me for King? I’m going to have to burn her for this…”", "label": 1}
{"text": "Can we really say he banged Arya? I think Arya banged him", "label": 1}
{"text": "Yeah, but did he make the 8?", "label": 1}
{"text": "You dont contest it, because you cant.\n\n\nYou are a Troll. Im done talking to a wall.\n\n\nBye.", "label": 1}
{"text": "The destination was sort of okay,. They just really fucked up the journey to get there, and as a result left hanging plot lines and made the ending unsatisfying. If they had put in the work i don't think most people would have complained. ", "label": 1}
{"text": "Spit roasted", "label": 1}
{"text": "I don't think he is fit for a king, they just have no other choice.", "label": 1}
{"text": "😂😂😂😂", "label": 1}
{"text": "Pycelle being savage real quick", "label": 1}
{"text": "there is something completely off with the proportions of this thing", "label": 1}
{"text": "Lotr is very family friendly and secretly gay, there are basically no women and just guys hanging out looking like their close to kissing\nGot is much more adult themed, comes close to a soft porn at times honestly. But it explore the darkness and light in humanity and is deep and well written", "label": 1}
{"text": "I love how Daemon’s like this GNF warlord, but when he’s in Harrenhall, he’s creeped the hell out 😂", "label": 1}
{"text": "Robb looks like a mixture of him and Jon", "label": 1}
{"text": "They are united at last!", "label": 1}
{"text": "What a funny scene it was!", "label": 1}
{"text": "It's just a bunch of misinformed/ignorant drivel whinging about how perplexed you are regarding a show you claim to have watched for 70+ episodes. \n\nSo I tried to ELI5 the pretty clear red flag you seemingly claim doesn't count as any sort of 'hint', even though she literally states multiple times she's down to do this very thing, ie, giant ass 'hint.'", "label": 1}
{"text": "Season 7 has no right to be up there.", "label": 1}
{"text": "Please go to therapy? What did you call me? You need to heal. Your level of whatever this is is really not normal. Sheesh! Not even trolls are this unhinged.", "label": 1}
{"text": "Also Production should not alternate the core story more away from the book.", "label": 1}
{"text": "Sansa honestly should’ve exposed Littlefinger ages ago! She could’ve had way more peace without all his schemes.", "label": 1}
{"text": "They forgot to capitalize \"Stark\"", "label": 1}
{"text": "You would be a great defense attorney for rapists.", "label": 1}
{"text": "GeorgeGPT is here, folks.", "label": 1}
{"text": "I agree with you, OP.\n\n\n\n\nI would much rather that they accepted that they dropped the ball and that no amounts of spin offs can save them or regain the investment and interest that people used to have. It's over. Let it die. \n\n\n\nTimes have also changed since the days of GoT. The economy is in the gutter, war is all over the place, climate change has become an increasingly problematic reality and I just don't think people want to watch misery porn in a fantasy setting right now. \n\n\nA lot of people are hungry for hopeful tales where people are good and overcome evil. That is not the world of ice and fire.", "label": 1}
{"text": "So you’re telling me I haven’t read the books or rewatched seasons multiple times ?", "label": 1}
{"text": "Says the person actually trolling lol", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Totally! That would be great to see. Watching Mance leave the Watch and bring the clans together would be amazing.", "label": 1}
{"text": "There's also new South Park episodes, and no new GOT episodes. So the one with new episodes is more likely to get viewers", "label": 1}
{"text": "Let's put it this way: There are two possible paths to chose from. One is the original path and the other one is WotD. I am afraid it will be the wrong one.", "label": 1}
{"text": "Arya's journey to nowhere. Bran doing nothing. Greyworm meeting his death by butterflies at Naath", "label": 1}
{"text": "Even at a thrift shop that is the deal of a lifetime! The books are probably what I'm gonna read after I finish what I'm currently reading, can't wait!", "label": 1}
{"text": "I will be your champion.", "label": 1}
{"text": "I think she hit just fuck it, I get it.", "label": 1}
{"text": "Oh he would be dead for sure", "label": 1}
{"text": "Pointy end goes to the other person", "label": 1}
{"text": "That burned so bad, he despised her", "label": 1}
{"text": "SANDOR!!! FUCKING!!!! CLEGANE!!!", "label": 1}
{"text": "The story is good but not the best for me", "label": 1}
{"text": "We never know they might give us some good story", "label": 1}
{"text": "This is the what could've been", "label": 1}
{"text": "This is the what could've been", "label": 1}
{"text": "That white walker wins!", "label": 1}
{"text": "How does Sansa know he can’t have kids/his dick doesn’t work?  Just because I person can’t walk doesn’t necessarily mean they can’t get a boner.", "label": 1}
{"text": "Don’t shatter the illusions of children of summer", "label": 1}
{"text": "A nostalgic scene for sansa", "label": 1}
{"text": "The night king", "label": 1}
{"text": "She's wild for that 😂😭😭", "label": 1}
{"text": "Let me say - I miss GOT!  \nMy winner -  Tyrion Lannister", "label": 1}
{"text": "Sorry to hear they've been teaching y'all to be porn addicts before having unattended access to the internet I guess then...", "label": 1}
{"text": "He knew how to troll everyone around him", "label": 1}
{"text": "filmex.to", "label": 1}
{"text": "Honestly, the tragic love stories in GoT are unmatched. Romeo and Juliet could never.", "label": 1}
{"text": "Tormund knew it better", "label": 1}
{"text": "When you realize you left your sword at home but still have to look cool for the family portrait.\" 😄🗡️📸\n\nGame of Thrones style!", "label": 1}
{"text": "But when bran find out it wasnt secret for him", "label": 1}
{"text": "Season 4 has my favorite episode of the whole show “Watchers on the Wall”, and also, you’ll wanna see what happens to Joffrey.", "label": 1}
{"text": "The time realm only consisted of the main characters and every region was only a short walk away.", "label": 1}
{"text": "This really highlights how ridiculous it got. Just imagine a bunch of Unsullied trying to negotiate feudal politics. The chaos would be iconic.", "label": 1}
{"text": "Because the entire episode was nothing but cinematic porn. Every fucking shot.", "label": 1}
{"text": "Titties and dragons.", "label": 1}
{"text": "Ngl it’s absolutely vile either way, but she looks like 9 years old in this drawing to me, aside from the fact she was given a bit of cleavage", "label": 1}
{"text": "Drogo got to hit this?", "label": 1}
{"text": "This requires ramsay to have human emotions but ramsay is a bigger sociopath than joffry there is no soul behind those eyes", "label": 1}
{"text": "Smartphones distracting you from your goals of mass murder and conquering💀", "label": 1}
{"text": "Episode was dark as hell cause they left their phones at home maybe", "label": 1}
{"text": "This is a really nice style. Don't know why so many people seem to be criticizing it. She looks good!", "label": 1}
{"text": "Jack Gleeson is annoyingly good! I love the fact that he made me truly hate Joffrey.", "label": 1}
{"text": "Engage in this sub more :)", "label": 1}
{"text": "Welcome to GoT! Yep, *loving a character = watch them die* is the show’s mantra. Ned’s death? Absolutely pivotal—his honor just doesn’t work in a world like this, and it sets up that “no one is safe” vibe going forward. Daenerys trusting that healer was a brutal mistake too, but hey, it’s part of her learning curve. GoT is a masterclass in making us *feel* the stakes, with zero plot armor. You’re in for a wild ride!", "label": 1}
{"text": "Not only is Drogo a slaver scum. He's also a pedo", "label": 1}
{"text": "No not those there was a naive stupid fool guy what was his face dead on first season episode 9 beheaded ned , ed, eddard,", "label": 1}
{"text": "All of these", "label": 1}
{"text": "Cersei had done stupid ideas together with this!", "label": 1}
{"text": "Its fascinating seeing them grow in the series and in real life", "label": 1}
{"text": "Dany", "label": 1}
{"text": "Ygritte", "label": 1}
{"text": "I followed along just fine. Did you?", "label": 1}
{"text": "But he won’t be king unless you die. So why do you give a shit", "label": 1}
{"text": "I find it really absurd lol", "label": 1}
{"text": "There are two ways we can look at this:\n\nWe can look back historically, and in less liberal cultures, age of consent is handled differently. Yes it’s still probably traumatizing for Daenerys and we’re supposed to feel that for the character, although it’s not breaking a taboo in this (Dothraki) culture.\n\nAnd also we see other young people do unexpected things for their age, like Jaime being knighted at 15, so I just imagine in Planetos people mature slightly faster than irl.", "label": 1}
{"text": "I loved the whole time when he and Arya were traveling together.", "label": 1}
{"text": ">I dont disagree with you but there is little to no advancement in the GOT world of technology\n\nBaseless.", "label": 1}
{"text": "Oh hey, another stupid shitpost from someone not paying attention.", "label": 1}
{"text": "Literally me every 6 months", "label": 1}
{"text": "we all did haha", "label": 1}
{"text": "there were so many I can't even think of one", "label": 1}
{"text": "Sansa was honestly the most insufferable character at the end", "label": 1}
{"text": "Just westerosi things", "label": 1}
{"text": "I would love to have same Earing Margaery has", "label": 1}
{"text": "I would love to be Margaery's earring.", "label": 1}
{"text": "That was kinda the point wasn't it?", "label": 1}
{"text": "Great representation! 50's rocks!", "label": 1}
{"text": "House Stark since dawn of time", "label": 1}
{"text": "*Imagine* did not lose his arm", "label": 1}
{"text": "This was the best dialogue of the entire season", "label": 1}
{"text": "But he never wanted to be king. He was happy in the North with Ghost and the wildlings", "label": 1}
{"text": "Yes, Jon will definitely be better off in the North", "label": 1}
{"text": "Jon \"I don't want it\"", "label": 1}
{"text": "A hand and an arm are different body parts numb nuts", "label": 1}
{"text": "LOL... I'm not wrong. It's literally show canon, objectively portrayed on-screen. And I'm not the one whinging about the end because it makes sense to any open-minded, unbiased viewer.  \n\nYou're the one on here whinging about how perplexed you are because of how thick your rose-colored glasses are over a fictional character because you refuse to accept basic show canon as meaningful context. \n\nBut in the end your ignorance is only your loss.", "label": 1}
{"text": ">\\> That isn’t a true statement.\n\nI'm sorry... maybe you are ESL, but are you honestly trying to deny the events clearly portrayed in the final? Maybe you haven't seen the finale in a while and have forgotten this, because it's absolutely true, plain as day. In the final episode she pretty clearly states her desire to conquer many other cities/nations just as she did to King's Landing.\n\nWild this has to be ELI5 to any so-called viewer, but here's the gist of her speech. \n\n\"**But the war is not over… From Winterfell to Drone, from Lannisport to Quarth, from the Summer Isles to the Jade Sea.\"**  \n\nAbsolute fact she plans to take it 'on tour' across both Westeros and Essos.\n\n*Ie, Jon absolutely saves the lives of thousands from all those locations considering Dany's painfully clear intentions, from her own mouth on-screen for all to see.* \n\n**It absolutely is a true statement, based wholly on painfully clear show context.**", "label": 1}
{"text": ">\\> It’s silly to think Dany just wants to ride her dragon and blow up stuff.\n\n**But she literally states that's what her plan is, lol!**\n\nWild this has to be ELI5 to any 'viewer' of the show. \n\n**Her own words, right there on-screen for all to see, during her speech to her forces in the finale. Spells it out pretty damn clearly she wants to 'ride around and blow stuff up' just like she did in King's Landing.**", "label": 1}
{"text": "He is a bit sad indeed", "label": 1}
{"text": "He just not want it for sure", "label": 1}
{"text": "OP is a wench", "label": 1}
{"text": "Targaryan Dildo", "label": 1}
{"text": "We elected a real protector of the realm", "label": 1}
{"text": "Protector of white men *", "label": 1}
{"text": "I thought, “If the goal is to put a female in office, they couldn’t have picked a more unlikeable candidate than Hillary.” I couldn’t have been more wrong.", "label": 1}
{"text": "Yes, Tywin likely would have taken the threat seriously. Though skeptical at first, Tywin’s pragmatism and focus on survival would drive him to assess the dead army as a real danger, unlike Cersei’s dismissal", "label": 1}
{"text": "Racist fool", "label": 1}
{"text": "\"WHO GAVE YOU THE ORDER! SAY IT!\"", "label": 1}
{"text": "You want a good girl, but you need the bad sausage", "label": 1}
{"text": "I'll deal with your brother after I'm done with my traitor uncle. I'll gut him with Sausageeater, you'll see", "label": 1}
{"text": "Sausage is cumming", "label": 1}
{"text": "\"Moon of my life, my SAUSAGE.\" – Daenerys Targaryen", "label": 1}
{"text": "You want a good sausage, but you need the bad \"poosay\"", "label": 1}
{"text": "He is dumb af. that is one.", "label": 1}
{"text": "What is sausage may never die", "label": 1}
{"text": "Marry him immediately🙈❤️", "label": 1}
{"text": "He would but he would still have used it as an opportunity to plot and \"weaken\" the opposition so I could only see him sending a few soldiers at best to support", "label": 1}
{"text": "Baratheon Things being this...", "label": 1}
{"text": "Season 1 is so epic!", "label": 1}
{"text": "Gendry is being Gendry!", "label": 1}
{"text": "He would do exactly what Cersei did, in my opinion!", "label": 1}
{"text": "Yup, in the book it was Tryion who was caught climbing into Cersei thigh cunt by Bran. Tryion got jealous Bran could the building but he couldn't climb into Cersei thigh, so he pushed Bran out of the window. \n\nTyrion repeatedly slapped Joffrey The Gentle because he was too chivalrous to hit back his gremlin uncle. He then tried having Bran assassinated as Littlefinger The Truthsayer stated that the knife was owned by Tyrion. \n\nTryion after becoming acting hand immediately started undermining his sister. Then he tried getting Joffery assassinated in war. When that failed he poisoned Joffrey. \n\nHe couldn't even let his proud father take shit in peace. Why? Because he was consoling Tyrion gf who was endlessly crying because of Tryion execution. He then killed his gf Tysha as well because he was a misogynist insecure of his own father. \n\nThen he joined another kinslayer Daenerys The Horsemating Targaryen and got both his sibling murder.", "label": 1}
