{"text": "Battle of the Bastards, baby!", "label": 0}
{"text": "Something something secret Targs", "label": 0}
{"text": "AI is the scariest thing of current times", "label": 0}
{"text": "Game of Words", "label": 0}
{"text": "Lady Stoneheart", "label": 0}
{"text": "Tywin knew Tysha wasn't a whore though", "label": 0}
{"text": "I feel bad for this lad and for the lady but c'mon. I can't believe someone would kill themselves over something so stupid. But as someone who's contemplated suicide a lot I really feel for this family and this young man tbh", "label": 0}
{"text": "Sad. This stuff shows how lonely people are in this oddly connected world.", "label": 0}
{"text": "No only every time there is a̶ ̶m̶a̶s̶s̶ ̶s̶h̶o̶o̶t̶i̶n̶g̶ an announcement of new work from GRRM other than an ASOIAF book.", "label": 0}
{"text": "Oops. Yes, sorry. :)", "label": 0}
{"text": "Shit is about to get real weird", "label": 0}
{"text": "I’m not George, you’ll have to ask him. But he’s been very clear he never wants it finished if he passes before releasing the final books", "label": 0}
{"text": "I have never seen this put so perfect. ", "label": 0}
{"text": "Why won't you write one of the greatest novels ever written?", "label": 0}
{"text": "better than season 8", "label": 0}
{"text": "Too much milk of the poppy. It’s all over the place down in Kings Landing", "label": 0}
{"text": "ai started saying \"sunset found her squatting in the grass, groaning\" and he couldn't handle it.", "label": 0}
{"text": "I couldn’t comment there, haven’t seen him in anything I can recall", "label": 0}
{"text": "it told him to kill himself eppps", "label": 0}
{"text": "If they’re struggling with a mental health issue or disorder it’s not that easy. We have rules about proper gun security to prevent accidental shootings. An ai like this with no system to detect self harm can be dangerous and deserves safeguards too.", "label": 0}
{"text": "Completely agree 💯 that was such a disappointment. I was expecting so much more, and don’t even get me started on the “long” night.", "label": 0}
{"text": "I feel like a lot of people underestimate how much smarter their kids are when it comes to apps and internet.", "label": 0}
{"text": "Boltons and Starks, fuck the Starks!", "label": 0}
{"text": "If the kid felt lonely it’s not just because of this. \n\nI grew up in a family of 6 and never felt loved and that was back when moms often stayed home (mine did) but now both parents often work and kids have nobody to come home to", "label": 0}
{"text": "Still don't get why S8 is hated so much", "label": 0}
{"text": "First four episodes were actually pretty good. A Knight of the Seven Kingdoms is one of my favorite episodes of the series. Everything went south fast once the NK died (har har).", "label": 0}
{"text": "What do you mean? Because I comment that suicide does not have anything to do with guns in itself?", "label": 0}
{"text": "Firmly believe he has no intention of finishing it.  \n\nThat said, a complete off the wall thought I’ve had is that he’s already finished it but it’s only gonna be released after he passes.  So he doesn’t have to deal with the fan reactions.", "label": 0}
{"text": "Tormund wipes out his entire family and I guess that's fine because he cracks jokes. Yeah Ollie is just supposed to swallow it with these people getting zero punishment.", "label": 0}
{"text": "I kinda forgot and Idunwannit", "label": 0}
{"text": "After season 4, it went down the toilet imo...", "label": 0}
{"text": "I always thought this scene would have been better if Ramsay sat there and said something about his dogs not eating him and Jon replying that this kennel wasn’t for dogs then ghost appearing behind ramsay covered in the dogs blood, showing that the wolves have come home. Followed of course by his screams.", "label": 0}
{"text": "Because it's not good", "label": 0}
{"text": "SO SAY WE ALL...whoops... WHAT IS DEAD MAY NEVER DIE", "label": 0}
{"text": "'Let's remember the journey rather than the end'", "label": 0}
{"text": "People complaining about it are now more irritating than the season itself imo", "label": 0}
{"text": "Xerox Urine Duck Sauce", "label": 0}
{"text": "Pretty bad, but actually not as bad as a lot of people make it out to be.", "label": 0}
{"text": "Interesting—I think of season 1 being really warm, I think because comparatively it feels like there’s a lot of scenes in Essos and King’s Landing.\n\nBut, yeah— the show opens at the wall and all of the scenes in the North are for sure cooler. \n\nSo, yeah, I agree it’s pretty location based.", "label": 0}
{"text": "Mr. Bradley and Mr. Bradley.", "label": 0}
{"text": "It's the biggest piece of dog shit", "label": 0}
{"text": "For my book readers John Snow, the son of Rhaegar Targaryen and lyanna Stark. \n\nSo he pops out of nowhere claiming he is Aegon. Do you guys this he is the real Aegon or a fraud? He’s supposed to be dead but has no Targ features. Curious what you all think. Also they had a secret annulment and secret wedding which makes him legit.", "label": 0}
{"text": "Look, it was entertaining. I’m not going to lie. Everything about it from a technical standpoint was incredible. Acting as well. It’s the pacing and the writing. I’m not losing sleep over it, but watching season 1-4 again recently made me so disappointed at how great it was to how shit it became", "label": 0}
{"text": "Better the second time you watch it. The first might be a shock", "label": 0}
{"text": "Honestly one of my favorite episodes is the long night. It feels very emotional with all the reunions and joining together for a greater cause", "label": 0}
{"text": "I'd say season 2 felt a bit more like a fantasy with the introduction of Stannis, Davos, Melisandre, and The LoL. We also had Quaithe (yes I know they did nothing with her character outside of some exposition, but still). There was also Pyat Pree (a literal warlock), Bran warging, the red comet, Jaqen H'ghar. Season 1 had a lot of lore build up too, but I felt that season really upped the ante.", "label": 0}
{"text": "Sure it is. It ruined the ending of one of the most beloved shows of all time.", "label": 0}
{"text": "Do they ever explain how he acquired Quan Chi’s amulet?", "label": 0}
{"text": "She signed up for it. War is hell.", "label": 0}
{"text": "Oh my god this is gold", "label": 0}
{"text": "He had a son, right didn’t pass to women, that’s literally what House of Dragon/The Dance of Dragons War is based on.  Women can’t come before Male Heirs.", "label": 0}
{"text": "She should’ve burnt the north and winterfell as well ", "label": 0}
{"text": "Username checks out", "label": 0}
{"text": "It was okay. Some high points, more low points than we wanted but meh. Nothing is perfect guys. Overall the series is still fantastic and season 8 isn’t actually full on trash. It’s okay and that’s okay.", "label": 0}
{"text": "never existed", "label": 0}
{"text": "Go bitch on some other sub. This sub is for fans", "label": 0}
{"text": "I thought the idea was that he did make some money once but didn't know how to properly manage it and so made himself broke again. He did have a lot of gold in decorations about his house it seemed, so I assume at one point he had some amount of money", "label": 0}
{"text": "i dont disagree, it was bad. Just the statement of something being bad while saying that u didnt really pay attention is very contradicting. I like the think it ended after the jon and dany incident", "label": 0}
{"text": "Best dad on Ted Lasso!", "label": 0}
{"text": "My biggest proving point for Aegon being fake is the death of Elia and Rhaenys.\n\nMaegor Holdfast has Secret tunnel that leads outside is only known most likely by Varys, it is said to be like a maze, so even if The Lannister found the entrance (which is highly unlikely) they would not know how to follow.\n\nOne of the excuses people give why Varys only saved Aegon is that he probably couldn't find a look-alike of Rhaenys, but Aegon as a baby is easy to swap.\n\nImagine the conversation Varys was having with Elia about giving Aegon to him.\n\"Princess, Lannister's are at the gate, I know the secret passage, Give me Aegon so I may hide him in essos, when he's older I'll help him to the throne. I couldn't find a look-alike of Rhaenys, so she has to stay with you and possibly die.\"\n\nElia would probably say, \"Varys you imbecile, enough with your plotting. Lead me through the secret passage. There'll be enough time for plotting after I get my children safely to Dorne.\"\n\nOnce people says to Varys, Princess Elia was said to love both her children, So why would she not save Rhaenys? Was she a fool in love with the idea of her Son sitting on the Iron Throne in the distant future that she would sacrifice herself and her young daughter? Yeah Right! FAegon is more like a whoreson, rather than Rhaegar's Son.\n\nAlso look at Varys character.\nVarys said to be the one who revealed Rhaegar's Harrenhall plot to Areys.\nSo, what is his motivation to Save Aegon? Love for the Targaryen's, while betraying Rhaegar who everyone hoped would be the Savior of Targaryen dynasty. Or his love for innocent children, while using & abusing mutilated children in his service?", "label": 0}
{"text": "I thought, as always, Ramin Djwadi’s score was flawless. Also episodes 4, 5, and 6 were shot very well.", "label": 0}
{"text": "Time compression has been used in fiction as long as there has been fiction.  We don't need to see every plodding step of every journey.  It's used early in the series too, but for some reason it wasn't a problem for anyone at that point in the story, only later.", "label": 0}
{"text": "> not as bad as a lot of people make it out to be\n\nAgreed, there are issues, but it isn't the flaming trainwreck some folks insist it is.  Some people have become emotionally invested in GoT being the worst thing ever.", "label": 0}
{"text": "I give Eragon a pass for (most) things, considering the author was around 16 when he wrote it. \n\nThe early books anyway- don't think I'm gonna give Inheritance a break anytime soon.", "label": 0}
{"text": "Our household watched it as it appeared, binged it again later, enjoyed it both times.  Maybe it's because we didn't jump into fan theories and avoided thinking we had figured out the ending that kept us from being pissed off over not getting the ending we wanted.", "label": 0}
{"text": "I GOT 99 PROBLEMS… drats… WHAT IS DEAD MAY NEVER DIE.", "label": 0}
{"text": "He was amazing till he met Danerys", "label": 0}
{"text": "Brilliant, they nailed it.", "label": 0}
{"text": "Yeah I mean Dany made a point to be like “he still has a crazy nice home let’s loot his stuff” lol", "label": 0}
{"text": "And Frey Pie is coming!", "label": 0}
{"text": "I don’t even think it’s just from being a bad show, for myself it was like watching George Lucas do everything he could so the third Star Wars movie could end the momentum and waterfall of cash that Star Wars is now. Rowling is doing it right now but HP is long established so it’s not being affected as much but this? They could have had theme parks, fairs, experiences like their own Medieval Nights, licensed hotels, watered down the material to begin reaching to children with age appropriate toys and media, and they just allowed it to implode because they had hubris. D&D effectively killed the runaway success of a train they had and during season 5 and 6 no one would have ever considered an offshoot show of GOT would have been cancelled like the one with Naomi Watts recently did. Rather than trepidation with HOTD, people anticipation would have been feral so for me, it isn’t just being sucked into being annoyed about season 8 and me complaining about it. It’s the economic and cultural gains that were squashed that still shock me to this day.", "label": 0}
{"text": "Blood magic", "label": 0}
{"text": "The canals of Bravos were actually hydrogen peroxide, so when she fell in it was like an instant anti-bacterial bath.", "label": 0}
{"text": "10/10 almost shit my pants", "label": 0}
{"text": "Got in a trailer park is closer to mad max than got.", "label": 0}
{"text": "I think he just overinflated how much wealth he actually had? Using his reputation to get loans? Idk. \n\n\nI think in general it's supposed to be symbolic of how everything in the city is an illusion. They pretend to be some wise council of elders but really they're playing the same political games as everyone else. The wizard guy literally is creating illusions. Etc", "label": 0}
{"text": "S8 is probably the season that has the less \"teleportation\" in the entire series.", "label": 0}
{"text": "Yes, that's the explanation, but there was no build up to this, just kinda happened suddenly.", "label": 0}
{"text": "Here we go with the victim card again", "label": 0}
{"text": "“I once walked into a brothel with a jackass and a honeycomb…”\n\n-The last line spoken in an 8 season series spanning as many years.", "label": 0}
{"text": "I don’t think he’s writing at all.", "label": 0}
{"text": "Yeah 👍 cool. I liked it second time. Saw the angle. And will hopefully watch again", "label": 0}
{"text": "Yup. Once you establish some of the baseline rules for how your fantasy setting “works”, randomly deviating from them in the interest of quickly moving the story from Point A to Point J becomes a lazy cop out/deus ex machine kind of thing.", "label": 0}
{"text": "Then why didn’t he just take the Eagles to Winterfell?", "label": 0}
{"text": "On the field? The lannisters would have swamped them fairly easily. However, the show likes to play very loose with how terrifying a castle is meant to be. They mention Ned Stark's opinion on Winterfelll but... High Garden should have been a years long siege even without their banners called. Especially since we're told how well supplied High Garden is.", "label": 0}
{"text": "Danaerys be riding her dragons into the most dangerous situations possible and then blames others for killing her children", "label": 0}
{"text": "I'm not sure what it is that you're attempting to say.", "label": 0}
{"text": "I’d do the same for Daenerys", "label": 0}
{"text": "\"In every chat, every time, there is a red text saying 'anything said by the character is made up'. If you have such a weak psyche to kill yourself over a chat bot whose answers you can edit however you like, where you can change the story at any point... maybe don't use a smartphone", "label": 0}
{"text": "As always, in a story with dragons and people raised from the dead, there is tremendous irony in folks getting cranky over things like, *How come they got chains to haul out that killed dragon?*\n\nIt's like hearing people complain about *The Odyssey* because it has unrealistic stuff like a cyclops and gods with their own agendas.\n\nHow on Earth did some folks form the opinion that GoT was a documentary?  It's fantasy fiction, with magic, relax and enjoy the story.", "label": 0}
{"text": "You miss the point.\n\nI wasn't talking about happy endings of characters or main storyline, I was talking about of the last two rushed, shitty, seasons per se.\n\nYeah, first four seasons were great, 5-6 seasons ok - I mean, better than most shows, but still not that great compared with first four seasons, last two seasons were really bad because D&D rushed the all thing just to (try to) put their hands in Disney's money.", "label": 0}
{"text": "He still sitting in locker", "label": 0}
{"text": "Not the trash bag", "label": 0}
{"text": "When little Lady Mormont throws the dagger into the ice giants eye as he’s crushing her to death!! Will always give me chills and remain one of my favorite scenes", "label": 0}
{"text": "Sounds like natural selection to me", "label": 0}
{"text": "Except for Khal Drogo", "label": 0}
{"text": "This makes me think, what episodes weren’t he in", "label": 0}
{"text": "There wasn’t an expectation of Elia dying since it was a dumb move.\n\nVarys would not care about Rhaenys.\n\nFor all we know he saved Rhaenys too and simply sent her somewhere else. Not enough is know about the account.\n\nHowever it wouldn’t make any sense to tell Kevan Lannister that he’s in with Aegon if he was fake.", "label": 0}
{"text": "Curious if you have these same moral judgements for Daemon", "label": 0}
{"text": "Part of the reason why is the show’s forced stoic look on Dany almost all the time", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "What Paywall? I don't have any subscription for it and I could read the article...", "label": 0}
{"text": "Yeah Arya just made the Freys eat their father that she cooked into a pie", "label": 0}
{"text": "Good for you and I didn't and it did very well critically so not sure what that has to do with someone saying their career is tanked.", "label": 0}
{"text": "As much as Emilia seems to be a great person, those pictures shows us how bad of an actress she can be.", "label": 0}
{"text": "Aegons wig lol", "label": 0}
{"text": "Not to mention Jaimie rolling around in the mud and drinking piss lol", "label": 0}
{"text": "I reckon he just ate her, and not in a sexual way either lol", "label": 0}
{"text": "When the shit winds blow, the shit wolf dies but the pærk survives", "label": 0}
{"text": "In the beginning I thought he was the main character", "label": 0}
{"text": "And they were literally just nominated for a whole bunch of awards and named in a list of the most powerful showrunners in the industry but sure I guess tanked lol", "label": 0}
{"text": ">Melisandre thinks Prince who was promised and Azor Ahai are the same character prophesied to come. Master Ameon And Rhaegar believe only in PwwP.\n\nNo there is only the prophecy of the PTWP.   \nMelisandre and members of the cult of R'hllor interpret the prophecy through their religion and perceive the Prince as their god's champion, Azor Ahai. That's why she uses both terms.  \nAemon, Rhaegar or people who aren't religious just use the original wording of the prophecy. \n\n>In my personal opinion Daenerys is Azor Ahai because Drogon can be the Lightbringer.\n\nThe dragonsteel blade, Lightbringer, is a blade that was made to be able to deal with the Others and their cold blades that can shatter regular steel.  \nDragonsteel is a steel that has the magical properties of dragonglass and was made with a blood sacrifice.  \nIn the tv series we've seen that valyrian steel, a magical steel made with blood sacrifice, has the same magical properties as dragonglass and therefore, any valyrian steel is a dragonsteel blade, is a \"Lightbringer\".", "label": 0}
{"text": "Good lord this dumb picture again even the people who didn't like the ending many of them mocked this person on social media for how dumb they looked and how they were just an attention seeker for doing this. it has been 5 years move on", "label": 0}
{"text": "But then they’d have to acknowledge the fantasy aspects of the source material and the audience doesn’t want that!!!!!!!", "label": 0}
{"text": "Those weren't innocent people tho", "label": 0}
{"text": "Really thought that given his family's sigil, that's where we were headed.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Thank you! 🕊", "label": 0}
{"text": "His head is kind of spherical. Nice!", "label": 0}
{"text": ">but there's still a ton to appreciate about the show as a whole.\n\nSure. And it's all that hard work is STILL lessened by the knowledge that it all goes to shit in the end. \n\n> . it's not worth continuing to direct\n\nYes it is. \n\n>life is so much better when you don't let the negative things in life weigh on your mind.\n\nI've never believed this, both with small and big things.", "label": 0}
{"text": "There's actually also no \"teleportation\" in season 8. First episode takes place almost entirely at Winterfell with a stop at Kings Landing. the next two episodes entirely take place at Winterfell. The next episode the first half of the episode takes place at Winterfell. Then they go to Dragonstone and it shows they traveling on a boat before they get there. Then they go to Kings Landing which is very close to Dragonstone. The last two episodes take place entirely in Kings Landing except the final montage at the end. People really don't pay attention. Like the claim Tyrion only makes cock jokes in that last two seasons when he literally makes 1 in season 8 and zero in 7. There's also tons of fast travel in the early seasons. Cat and Littlefinger are zipping up and down the map for example.", "label": 0}
{"text": "LOL", "label": 0}
{"text": "I’m watching Sweet Tooth right now and totally forgot he was in GoT", "label": 0}
{"text": "I liked the Walder Frey moment, Ramsey getting eaten, and absolutely was losing it over “How do you plead…. LORD BAELISH” 😨👏🏼👏🏼👏🏼 they had me going for a moment and I thought Sansa was under his spell fr", "label": 0}
{"text": "Lol I appreciate the clarification, but I wouldn't have seen your question as an attack.\n\nThe reason I think that has more to do with his actions and not necessarily the way he was presented in the show. This includes sending Bran and Jojen their visions in an attempt to manipulate them into coming North, knowingly sacrificing Jojen to do so. At the time, it's presented as mystical importance, but by the end, it turns out it's just the 3ER's will.  \nOther notable evil actions are things like giving Theon his final speech to manipulate him into sacrificing himself to stall for enough time for Arya to make her move and quite literally taking over Bran's body to keep his life going.\n\nHowever, the biggest giveaway that he's evil is the way he manipulates Sam. Sam is literally the only person alive who knows about Rhaegar's annulment, and he's the only person who the 3ER decides to tell about Jon's true parentage. By looking into the past, he knows that Sam will stand up for Jon as a leader, even if he doesn't want it himself (like when he was elected Lord Comander), and he needed something to catalyze a rift between Jon and Dany's claim to the Throne. That rift is what ended up causing the rest of the plot to go down the way it did, including Dany going crazy and Jon being the one to kill her. Without his intervention, either Dany becomes Queen or Jon becomes King. The only way to make that not happen is for madness to overtake Dany and for Jon to be the one to put an end to it. He knows from Bran's mind that Ned taught them the old ways of the one passing the sentence should be the one to wield the blade, and he knows Jon loves Dany too much to let anyone else be the one. Beyond that, the only thing that made Jon ineligible from claiming the Throne was the fact that he killed Dany while she still had a standing army in King's Landing. Jon being ineligible is what directly led the council to elect him as King. He even gloats about it to Jon's face afterward telling him \"You were exactly where you were supposed to be.\" \n\nThose actions are concrete, but I also think there were other more disputable actions at play as well like using crows cawing to cause Bran to get caught and pushed from the tower; and that he sent the Azor Ahai vision to Aegon I to ensure Jon's birth, but there's not really evidence for these so they're more just personal belief.", "label": 0}
{"text": "The coffee is the cherry on top.", "label": 0}
{"text": "Exactly that", "label": 0}
{"text": "So?", "label": 0}
{"text": "No, it was more. I just didn't want to sound like I'm exaggerating. You can see the distance on this video at about 34s: https://youtu.be/urWhH9VIztw?si=EamRx9EVVO2DkHiX", "label": 0}
{"text": "\\*Robb and Jon are a bit boring, but they are the new Ned, so trying to do whats good and right is boring.  You could say the same about Lord Friendzone oops I mean Jorah.  Robb at least has the hottest girlfriend tho who isn't annoying (sorry Ygritte)\n\n\\*Theon's flip didn't have much backstory, so it does appear to come out of nowhere.  It doesn't get explained any better, just that he feels beta in an alpha man's world I guess.\n\n\\*Sansa and Arya have the compelling story arcs at this point because they are so vulnerable and you are rooting for them.  Don't fret, Robb and Jon WILL catch up.  Bran is tougher because of all the supernatural elements.  Googling a bit of the storyline here may help cuz its harder to follow.\n\n\\*What's the point of Jaime???  He's a fantastic character.  If there was a prequel season, he would have had the biggest scene of all- killing the prior king.  Plenty of ALL good or ALL bad characters like Ned, Dany, Tywin& Joffrey form the base of the story, but the ones who straddle that line like Tyrion, Bronn & The Hound will always keep you guessing and makes things interesting.  Jaime is in the latter group.\n\n\\*there are many many characters its hard to keep up, all of the ones in the 4 families battling for the throne have important roles but don't sleep on these outside those families: The Hound, Bronn, Brienne, Jorah (4 already mentioned), Olenna & Margery Tyrell, Mance Rayder, Samwell Tarly, Davos and last but not least - Hodor.\n\n\\*please do an update after finishing season 3, it is interesting to see the progression.", "label": 0}
{"text": "First off, I’d never allow Bronn anywhere near my small council. In fact, I’d have Bronn dealt with permanently. I’d never sleep soundly knowing there’s a man out there who’d happily slit my throat if someone offered him the right price.", "label": 0}
{"text": "Might as well burn them all", "label": 0}
{"text": "Night's watch, not knights", "label": 0}
{"text": "What are the episodes he ISNT in?", "label": 0}
{"text": "I think the quote that sums up the series perfectly is “rhaegar fought valiantly. Rhaegar fought nobly. And rhaegar died.”", "label": 0}
{"text": "That’s exactly the point. It’s the type of thing that could push someone to the edge.", "label": 0}
{"text": "On second rewatch recently and didn't realise that this is Big Man ❤️", "label": 0}
{"text": "Or varys incase he saw a better candidate elsewhere", "label": 0}
{"text": "My Hand would be Tywin Lannister \n\nThe Master of war would be Barristan selmy \n\nThe Master of whisperers would be Qyburn\n\nThe Master of coin would be \nMace the ace Tyrell\n\nLord Commander of the city watch would be Book Stannis", "label": 0}
{"text": "Better later than never! It was fun watching it as it came out live. The hype was insane. I remember going to packed bars watching the new episodes. Good times", "label": 0}
{"text": "You have to look at motivation of Varys. There are only two reasons why Varys would save Aegon. Either Varys is a Targaryen loyalist or He is a compassionate person.\n\nVarys's actions don't paint him as a Targaryen loyalist, certainly not Rhaegar's supporter. His unhinged usage of mutilated children also shows his nature. What he said to Kevan is irrelevant, it simply could be a way of mocking a defeated foe. The broader story events make Aegon a Fake.", "label": 0}
{"text": "Wasn't he originally supposed to have an even more graphic exit from the show?", "label": 0}
{"text": "One of the dumber plot lines. So boring.", "label": 0}
{"text": "Don't forget that, even after significant risk and cost to herself in allying with Jon Snow and helping defeat the Night King, she wasn't any more loved or accepted in Westeros-- in fact, the only thing she really got out of that was a betrayal by Cersei. She wanted to win over the hearts and minds of people in Westeros and have them accept her as their rightful sovereign, and, even though she wasn't as unrealistic as her brother in this regard, all of that still stung.", "label": 0}
{"text": "TBF Elon totally seems like the type of guy that would pull it off", "label": 0}
{"text": "He should've worn brown shoes at the bottom.", "label": 0}
{"text": "Therapy is all about establishing a connection and forming a therapeutic relationship, and AI can do none of those things. It can over advice or counseling at best, but you can just google that stuff anyway.", "label": 0}
{"text": "I think if Varys was actually treated with respect instead of him just being tolerated because he was useful, he would have been a bit more loyal", "label": 0}
{"text": "That has other problems. 1) not sure how you connect to the sea if you didn't wanna lose your h2o2 solution.\n2) that's probably just kill Arya too. Contact with skin can cause irritation and burns. And considering the liquid would be exposed to her core whilst in the river.....\n\nOooh that would be nasty", "label": 0}
{"text": "Maybe he wouldn’t bend the knee to her, and she destroyed him. \n\nI want to read the chats lol", "label": 0}
{"text": "On a dragon yes, he could ride the dragon to another continent and turn the people on it one by one, or he could sail a ship he seems organized and capable of figuring out how he would conquer all the world.", "label": 0}
{"text": "What buildup did you want? His father set his sights on attacking the North, after disrespecting Theon, and gives Theon a menial responsibility. With Dagmer in his ear, he thinks the way to win his father and the Ironborn’s respect is to take the heart of the north. This also, in his mind, solidifies him as an Ironborn. You even see him indecisive in the beginning as he burns the letter.", "label": 0}
{"text": "Just got goosebumps picturing it! \n\nGotta say I’m grateful for this sub popping up in the algorithms… I got soooo turned off by the last season that I never watched it again (and was an avid rewatch all seasons over and over as each new season came out kinda fan)\n\nThese posts and comments reminding me of all the good there was is making me want to finally go back and give it a watch through again….", "label": 0}
{"text": "Alrigt, Benioff.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Best halloween costumes so far!", "label": 0}
{"text": "He'd be a better Master of War 10/10 than Bronn. Bronn is a mercenary not a strategist.", "label": 0}
{"text": "How did he take the time stone from the Sorcerer Supreme?!?!", "label": 0}
{"text": "Remember master of whisperer is your internal/external intelligence chief. It would be foolish not to have one.", "label": 0}
{"text": "Yeah I,m not denying its a factor. And you make a good point about people changing their mind altough there also there is other efficient ways to do so. \n\nYour study definetly shows some backing to it altough I would also like to add that a person that is determined to take their life is more likely to use a gun while people not as determined might fail on purpose. Its pretty common here for example that people overdose in public bathrooms where they can expect to be found and saved and hence fail. Even doing it at home would greatly reduced the chance of surviving. \n\nWhen it comes to suicide rate, between USA and Sweden it seems like both countries have a rate of 14/ 100 000 citizens?", "label": 0}
{"text": "There were prophecies about,\n1. The Stallion who Mounts the world.\n2. Azor Ahai, who is also known by different names in different Essosi culture. In Westeros some believe he was The Last Hero.\n3. The Prince who was promised.\n\nAll the prophecy about these three promised heroes has their own flavor with similar characteristics. Whether they are different or the same is purely speculation by GRR's characters and by us. No one can know for sure and It is kept that way by GRR.\n\nLightbringer is a Mythical weapon. Its legend is folklore, it could be literally true or it could be metaphorical, like GRR said, all his folklore is not 100% true. He likes to keep his reader on the edge that way.\n\nI don't remember watching anything about making Valyrian Steel, And nobody knows anything about making Valyrian Steel anymore, so don't know where you get this idea of Blood magic.\n\nDrogon being The Lightbringer is my Opinion based on similarities of how the legendary weapon of the past was created using the death of a spouse and wielded by the other spouse. \nLike I said there is a lot of ambiguity when it comes to prophecy in GRR's book.", "label": 0}
{"text": "Hand of the King: Tywin Lannister \n\n\nMaster of Coin: Tyrion Lannister \n\n\nMaster of War: Ser Barriston Selmy\n\n\nMaster of Whisperers: Qyburn\n\n\nMaster of laws: Edmure Tully\n\n\nMaster of ships: Yara Greyjoy\n\n\nLord Commander: Jorah Mormont", "label": 0}
{"text": "The darkness for the long night was the right choice.", "label": 0}
{"text": "Bro joeffery went 9 rounds with the butchers boy. He would've won if that girl didnt disarm him", "label": 0}
{"text": "Shae lived a whore and died a whore. Tyrion deserved better", "label": 0}
{"text": "I would put (book) Randyll Tarly into a barrel of boiling pitch.", "label": 0}
{"text": "A pyromancer is a user of fire-based magic\n\n\nA poultrymancer is a user of poultry-based magic. \n\n\nAn example of the art in practice:\n\n\nhttps://youtu.be/miomuSGoPzI?si=iMCNiWRvp-UYxPWZ", "label": 0}
{"text": "It was widely hated for a reason. There are plenty of ways of capturing the terror of the darkness without making it so that we literally can't see what the hell is happening for most of the episode.", "label": 0}
{"text": "Going back through these and didn't connect that in 'Baelor' you have Jaime asking Robb to end war (bring peace) the old way, similar to Jon and Ramsey's exchange later. Robb's response is the same, basically not acquiescing knowing that he would lose in the heat of it but otherwise had the upper hand.", "label": 0}
{"text": "It’s worth a rewatch for sure. I just ignore all the negative things and watch what I like. I know people think the last seasons weren’t as good but I still enjoy them", "label": 0}
{"text": "Let this guy cook", "label": 0}
{"text": "He's certainly not a charming man I agree, but if you want to rule a Kingdom, you need men of his character. He has many of the qualities of Ned Stark, but far less naive.", "label": 0}
{"text": "Now I fully agree that you shouldn’t have to have the “right” screen to view it on. But it looks great on oled in 4k. Like. Really great. \n\nThe darkness was the right choice.", "label": 0}
{"text": "For me it's Arya killing Marin Trant", "label": 0}
{"text": "Most likely. But an AI bot off your dream girlfriend who pretends to be in love with you but you know they aren’t real would be fucking hard on a 14 year old. \nI struggled navigating ‘brb’ on messenger and they never b’d.", "label": 0}
{"text": "well the OP asked in the first place so others didn't quite get it so obviously it was a gray area.  There was no apparent rift between he and Robb.  Going into more detail doesn't prove there was no gray area to a first time watcher.", "label": 0}
{"text": "he also has the most amount of chapters in the books", "label": 0}
{"text": "Shae really believed all the bad words Tyrion used to her? He was just protecting her. She betrayed him?", "label": 0}
{"text": "I’d have bronn in a brothel and then have Tyrion as my hand,then Varys as my master of whispers,Margaery Tyrell as my queen,Bran as my master of coin and idk who else", "label": 0}
{"text": "I would never want to put anyone in a place of higher power when they've told women that they need a good raping or that they've chained their son in a basement for talking about becoming a Maester.\n\nShow Randyll by means not a perfect person. He is still abusive towards his son, definitely rough around the edges, but he is loyal to the crown beyond a doubt.", "label": 0}
{"text": ">. it's not worth continuing to direct\n\n>Yes it is. \n\n>life is so much better when you don't let the negative things in life weigh on your mind.\n\n>I've never believed this, both with small and big things.\n\nwhy?", "label": 0}
{"text": "So what would happen if the mountain did say Tywin told him to kill her. I can see drone wanting to go to war for real this time but that’s it. Kings landing is pretty far from drone so they could see the army coming. The king isn’t going to do shit to him. So he kills the mountain after he confesses then what? Goes back home and plans a fight? Would Tywin even let him leave the city. Just not sure what the plan was. Poisoning him at least makes the dude suffer. Which is what I figure he would really want.", "label": 0}
{"text": "Reddit cares reports and temp bans come from those style comments. ", "label": 0}
{"text": "Reddit cares reports and temp bans come from those style comments. Suggesting a method of suicide may trigger someone to report you or ban you. ", "label": 0}
{"text": "I’ll probably get downvoted, but I thought it was fine. \nGranted, I’m not a super fan who places my identity in the show, and making it my Halloween costume or getting GoT tattoos or anything.  I did not watch it when it originally aired. I binged  for the first time fairly recently and kept hearing about the tragically awful last season. When it was over I was like “Huh. I kind of liked it.”", "label": 0}
{"text": "I think he hated the fact Tyrion was actually dwarf and resented that Tyrion's birth killed his wife but I think Tywin actually liked Tyrion and in a lot of ways that made Tywin angry. He trusted Tyrion to act as hand of the king in Tywin's place. That shows a level of trust you wouldn't give to a son you hate and despise. He also then rewards him with a marriage to Sansa Stark which is an actual reward. He's practically giving the North to Tyrion's lineage if everyone would've worked out in the Lannisters favor. Tywin and Tyrion's relationship was just ruined after Tysha and if that never happens then maybe Tyrion takes life a bit more seriously and Tywin doesn't have this event that makes him distrust his son or think some type of way about his work ethic or wits.", "label": 0}
{"text": "Isn’t it already lethal? Just because it doesn’t kill him right away doesn’t mean a month from now it actually kills him.", "label": 0}
{"text": "Sorry for your loss - of a good ending.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "This quote would be great if it weren’t parroted by every idiot thinking the dogshit writing in the second half of the show has any excuse.", "label": 0}
{"text": "It's as if he knows nothing", "label": 0}
{"text": "Hand: Bran is way, way too overpowered to have anyone else. I know he’s boring, but still. \n\nCoin: Margery Tyrell. Gives me access to Highgarden and its wealth, is an excellent player, and is one of the few who cares for the small folk. \n\nWar: Tywin Lannister. Too ruthless to be my hand, but he’s the guy you want for war. \n\nWhispers: Varys. Can’t see anyone doing it better than him. \n\nLaws: Stannis Baratheon. Most sternly just character in the show, highly meticulate, and has life experience to pair with the literacy. \n\nCity watch: Eddard Stark. Good leader of men, can be trusted to lead a force loyally, and won’t go tyrant on the small folk. \n\nShips: Yara. Not a ton of great candidates here. \n\nKingsguard: Arthur Dayne. Similarly honorable to Selmy and a better fighter. Also just prefer him. \n\nGrand Maester: Whichever senior maester I believe is most moral and qualified, which is none of the named characters in the show. Sam was not nearly qualified enough.", "label": 0}
{"text": "I think you can only change faces with someone of a similar build to you. A tall person moves and walks different than a shorter person. In the Books, she doesn’t see or feel a difference in her face, but to others she looks different. That implies there is magic involved (well we already knew it was magic based on how it is portrayed in the books) but it’s meant for essentially a more “realistic” illusion. So to her, her face and body would look normal sized. \n\nHow would she pretend to be longer limbed and taller? The Mountain’s arms are longer than Aryas by a lot, so he can grab things further away from him than Arya can. How would she pretend this? Her body looks like her normal body to her. Also he is significantly heavier than her, would her weight change? How would that work if she looks and feels the same?\n\nAll that leads me to believe you can only really change faces with someone who had a similar build to yours. That’s why the Faceless Men are ok with hiring young children, so they can use the faces of children.", "label": 0}
{"text": "Yeah, I made that claim based on the WHO's report from 2019, which shows US total rate at 14.5/100000 with Sweden at 12.4/100000.  But I wasn't reading their report directly, I was reading an article talking about the report.  \n\nI'm not sure if they have more recent numbers, as when I try to go to WHO's website it keeps giving and error message.  I'm also not sure if there are other sources that are more recent or that give different numbers.", "label": 0}
{"text": "I see your username baratheon propaganda cant fool me", "label": 0}
{"text": "We are never told if he is actually poisoned… could be small doses so it does bad things slowly..but if the poison were to stop, it might reverse…\n\nThink of like Fox Glove poisoning… keep getting worse because people keep I vesting it!", "label": 0}
{"text": "So why would the show that already has tons of characters grind the story to a hault. Sideline a bunch of characters to add dozens of new ones that all have half finished storylines that over a decade later the author can't even finish", "label": 0}
{"text": "Oberyn got killed by the Mountain because of emotion and lack of discipline. Would you want that in a full blown war?", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Swedens official website says 14/100000 from 2022. I guess it has increased :(", "label": 0}
{"text": "Spoiler alert!\n\nHe's a bastard.", "label": 0}
{"text": "He’s definitely a Targaryen supporter.\n\nI think he’s fine with any Targaryen on the throne but thinks males have the stronger claim.\n\nTheres no reason to mock someone with a lie when the truth is just as valuable. Better yet, don’t tell him anything since it comes across as monologuing for the reader anyway.", "label": 0}
{"text": "When making a cosplay version of a Kingsguard suit (esp the helmet), I noticed a lot of things... the image posted here is from Season 1, which actually changes a LOT in season 2. They narrowed the opening of the helmet and added some detail, which looked a lot better than the S1 helmets. Also, weird thing I noticed...they change shoulder armor depending on the scene (when Jamie Lannister was riding the horse in S1, they're smaller to give him flexibility while actually on top) but otherwise much larger for better show quality. When browsing the first few seasons, I was stunned how much the Kingsguard armor changes. Those last two seasons with Cersei... I have zero love for.", "label": 0}
{"text": "Ramsay should have been flayed, a quick death by hounds doesn't feel much like poetic justice", "label": 0}
{"text": "Never heard of fox glove and yeah never proved you are right just him smelling so bad is a big clue. Plus the talk about it earlier. But yeah I guess if George never comes out and says it then just speculation and fan theory.", "label": 0}
{"text": "Yeah nice guy fighting for Tyrion. Even in childhood Cersei was evil.", "label": 0}
{"text": "That shit aired in Season 3 and I was prepared. \n\nThe rest of y'all apparently forgot.", "label": 0}
{"text": "The last scene where Little Finger threw her was predictable.", "label": 0}
{"text": "Old testament punishment is not generally considered neither good nor just. She wanted to liberate slaves, yes, but I think it is clear pretty early on, that she had a dark side, too. She was very brutal and she wanted the seven kingdoms too much.\nShe wanted to conquer the world with the undisciplined Dothraki. That would be like if an English would-be king had brought the Mongol horde to England. Not a good thing for the natives.\n\nShe exiled Jorah, which he certainly didn’t deserve. She killed the Tarlys in season 7 - an unnecessary brutal decision.\nBurning the Kahls was about getting free, but she clearly also enjoys it.\nThen there were the mess with her brother’s rather grim execution (which she also enjoyed if I remember correctly) and with the witch, which cost her the child.\nShe let her dragons free even though they killed and most likely ate people.\n\nShe did do good things, but signs that she had a dark side was there, too, right from the start.", "label": 0}
{"text": "Sha nay nay", "label": 0}
{"text": "I read years ago that it blew out the color balance when they tried to film it in the initial test runs. I don't know how verifiable that story was, as it was some 8 years ago when I read it. For what it's worth it seemed legit at the time.", "label": 0}
{"text": "And Ned always looks constipated!", "label": 0}
{"text": "I kept telling myself this can’t be the same character. But then decided maybe his hair changed his appearance lol", "label": 0}
{"text": "everything she went through was her fault for one lie", "label": 0}
{"text": "It’s because his character had the best story…", "label": 0}
{"text": "I agree... the helmets got a major overhaul for Season 2 and forward - I had to replicate one for cosplay and I was shocked at the evolution just in the first few seasons. They closed the mouth gap and made a lot of other tweaks. I hated the Season 1 helmets but actually loved the Season 2-6 versions (NOT the Darth Cersei versions).", "label": 0}
{"text": "Yeah that’s what I thought. Something super slow", "label": 0}
{"text": "The most misunderstood character. He was just looking out for his family", "label": 0}
{"text": "That’s what comes of forgetting iron fleets and landing your dragon on piles of zombies though.", "label": 0}
{"text": "The Stallion who Mounts the World is a dothraki prophecy about someone uniting the different Khal to conquer cities, Daenerys did that in the show and she will probably unit the khal in the books as well.\n\n>Azor Ahai, who is also known by different names in different Essosi culture. In Westeros some believe he was The Last Hero.\n\nAzor Ahai is a religious figure from the cult of R'hllor.  \nAnd here you are not referring to a prophecy but to a legend.   \nAn Asshaii legend about a hero with a red who fought the darkness during the first Long Night. The legend spread accross Essos and different cultures claimed it. Some called him Hyrkoon, others Neferion, or Yin Tar and for the R'hllorist, they believes that this hero was their god's champion, Azor Ahai just like they think that the prince appearing in visions is his reincarnation, but that's just their religious interpretation of that legend and that prophecy.   \nThe legend was about the Last Hero fighting the Others in Westeros though. \n\n>All the prophecy about these three promised heroes has their own flavor with similar characteristics. Whether they are different or the same is purely speculation by GRR's characters and by us. No one can know for sure and It is kept that way by GRR.\n\nThey aren't the same thing. the Stallion is not the same thing as the PTWP.  \nThe PTWP is about a prince being born amidst salt and smoke to wake dragons from stone, it has nothing to do with uniting the khal.   \nIn interview Martin also uses the PTWP when talking about the  \"Azor Ahai prophecy\"  which confirm that they are the same. \n\n>Giving himself to the Lord of Light in return Melisandre sees that the Lord of Light gives him a token, of his role as **the Prince that was Promised** by ancient prophecy and that's the sword Lightbringer.    \n[https://youtu.be/DIe0Q3PgcOw?t=421](https://youtu.be/DIe0Q3PgcOw?t=421)\n\n\n\n>\\- What is the origin of **Azor Ahai's prophecy**? \n\n>\\- The prophecy comes from the eastern countries, it is not a ponienti prophecy, you can deduce it only by name. Westeros has his own prophecies different from **the prince who was promised**.  \n[https://archive.is/uuZOO](https://archive.is/uuZOO)\n\nMartin never say \"Azor Ahai prophecy\" though since the original wording is the Prince that was Promised and that prince is perceived by the R'llorist as the reincarnation of their god's champion, that's why Melisandre refer to Stannis as Azor Ahai reborn or as the prince that was promised. \n\n>Lightbringer is a Mythical weapon. Its legend is folklore, it could be literally true or it could be metaphorical, like GRR said, all his folklore is not 100% true. He likes to keep his reader on the edge that way.\n\nThe Others have blades of ice that can freeze and then destroy steel...  \nIt make sense that the Last Hero made a blade with a steel that can generate heat (to counter the frost) and kill the Others.   \nThat's why the dragonsteel blade, Lightbringer, is describe as a steel that can burn and when you stab an Other, he melts, just like dragonglass. \n\n>I don't remember watching anything about making Valyrian Steel, And nobody knows anything about making Valyrian Steel anymore, so don't know where you get this idea of Blood magic.\n\nIt's well known that Valyria sorcery is rooted in fire and blood magic. Qohorik smiths, who knows the spells to reforge Valyrian steel, are doing blood sacrifices to produce a steel that is almost as good as Valyrian steel.\n\n>“Call it dragonglass.” Archmaester Marwyn glanced at the candle for a moment. “It burns but is not consumed.”  \n“What feeds the flame?” asked Sam.  \n**“What feeds a dragon’s fire?” Marwyn seated himself upon a stool. “All Valyrian sorcery was rooted in blood or fire.**\n\n\n\n>**Art and music flourished in the cities of the Rhoyne, and it is said their people had their own magic—a water magic very different from the sorceries of Valyria, which were woven of blood and fire.**\n\n\n\n>**According to Pol, the true reason for his final exile was his discovery of blood sacrifices—including the killing of slaves as young as infants—which the Qohorik smiths used in their efforts to produce a steel to equal that of the Freehold.**", "label": 0}
{"text": "The conquerer of winterfell", "label": 0}
{"text": "I can see how some people might not believe that a 14-year-old would think a chatbot was real. Maybe part of him knew it wasn't real and part of him felt it was real. Or that he really needed it to be real. Some children, teens, and even adults are not always able to differentiate between what is real and what is not. Especially if suffering from anxiety, depression, hormonal changes, or extreme changes or stresses in life. Desperation can be so tragic. Very sad. ☹️", "label": 0}
{"text": "which 5 were he not in?", "label": 0}
{"text": "WHAT IS DEAD MAY NEVER DIE!", "label": 0}
{"text": "I think House of the Dragon is absolutely worth the watch!  Just to get back into the world of Westeros.  I think so far, the characters are super interesting and the dialogue is incredible!  moves out a bit of a slower pace, very comparable to season one and two of Game of Thrones", "label": 0}
{"text": "Like a spider, he sucked the air out of his fur to breathe underwater. Done.", "label": 0}
{"text": "and he doesn't want it", "label": 0}
{"text": "Your account is too new, so your submission has been automatically removed.  Please spend a little time on Reddit, make some comments or posts in other subreddits, and try again later.  Also before you post, please [review the spoiler guide](/r/gameofthrones/w/spoiler_guide) to ensure your post has a warning tag that fits the scope of the topic you want to post about.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Joffrey dying at his own wedding after being so elated about the red wedding", "label": 0}
{"text": "Sam for Grand Master right. Forgot that", "label": 0}
{"text": "The tough Ironborn considered Theon more Westerosi than Ironborn.  He had not earned their respect, so for them his words are wind.", "label": 0}
{"text": "Hand of the King:  Stannis\n\n\n\nMaster of Whisperers: Qyburn\n\n\n\nMaster of Ships: Davos\n\n\n\nMaster of War: The Blackfish\n\n\n\nKinsguard: Jaime\n\n\n\nMaster of Laws: Maester Aemon", "label": 0}
{"text": "It is known", "label": 0}
{"text": "No point, after the first month, you'll probably spend it just like the other seven days of the week.", "label": 0}
{"text": "It works in both ways. Both sides are not allowed to harm each other if they share bread and salt together. \n\nThat's why the old bear was angry with Karl when he killed Craster. They have violated the guest right.", "label": 0}
{"text": "Me dogs always look very intent at this scene. I treat them well I’d say but the way they pay attention…", "label": 0}
{"text": "That's why I spoke only about the series. She killed his sons and made pastries with them and served it to Walder so she shared food with him", "label": 0}
{"text": "I had to do a double take lol awesome cosplay!", "label": 0}
{"text": "No, there were many occasions where people mentioned it works for both of them.\nYou're not allowed to harm your host, and he is not allowed to harm you.\n\nIt would be stupid if it wasn't. You wouldn't invite your enemy in your house, if you're not allowed to harm him, but he still can kill you as your guest.", "label": 0}
{"text": "Yeah but every single person useful in that position isn’t loyal enough to warrant me using them, maybe Varys if I’m a good king but that’s not something for me to judge I’d rather remove the power that is gained from that position then let it fall into bad hands… maybe Doran Martel would be passable but hard to say", "label": 0}
{"text": "There is quite a bit of a difference between Bronn and the average Lord or high-borns. lol He is a sell-sword and has no issue informing you he will sell you out if the price is right. lol \n\nYou could argue his honesty is a good trait, better to know what he is capable of doing, but I feel like if a man is telling you he'd betray you for the right price, it's best to take him for his word and just remove him entirely. Assuming you even can, as he seems to always be two or three steps ahead of anyone even thinking about killing him. lol\n\nI get your point though, and I'd be wanting someone like The Mountain to be killed the moment I took power. lol", "label": 0}
{"text": "Sam took a single summer class at the Citadel, he's very likely the least qualified 'maester' alive. There isn't a worse choice.", "label": 0}
{"text": "But… but… muh freedum…. Murca… fuck yeah….🇱🇷🇱🇷🇱🇷", "label": 0}
{"text": "Indeed.", "label": 0}
{"text": "Same. I just skip/ff past the parts I really dislike especially when Daenerys gets murdered and the rest of that episode.", "label": 0}
{"text": "Damn. Oberyn Martell was sad to see. He was winning if he didnt try to make him say the crimes.", "label": 0}
{"text": "Poetic justice indeed. Arya getting revenge so completely was satisfying", "label": 0}
{"text": "Same. I thought he might throw at Tywin and it will miss and he will be exectued for that instead of dying in that match.", "label": 0}
{"text": "My point is pretty much any sell sword would kill you for the right price. You don't need to kill all sell swords. You're the king, there's no reason Bronn (or any other sell sword) should be able to even get anywhere near you unless you want them to. \n\nI totally understand removing him from the council, but killing him seems unnecessary unless you have reason to believe that he is going to be a threat.", "label": 0}
{"text": "It’s Maisie Williams who said this. She said that Kit told her that one of the directors told him that back in S3, but I doubt it. D&D didn’t tell any actor where their stories were heading. Even when Nikolaj kept asking them when Jaime was going to leave Cersei, like in the books, they just kept telling him \"just wait\".\n\nEither this was a prank, as you said, or it was another director who didn’t know the ending and was taking a guess, or Maisie misspoke.", "label": 0}
{"text": "LoL", "label": 0}
{"text": "Starks are very serious, stern characters as whole. The house has been known for those traits for centuries in that very setting \n\n\nThat way, considering Starks need to sound more stoic than everyone else, probably there's little room for \"flashier\" performances that Lannisters deliver. Even Tywin, the most stoic Lanni, would have some pretty sassy moments", "label": 0}
{"text": "Hi, you'll be fine, you just won't be able to monetize it unless its transformative (like a concept trailer, or an edit that involves something of yours). Or a theory video, that will be monetized, but Max is pretty strict with using their footage, it's no longer HBO actually, so they pretty much claim videos that are transformative, you can probably get away from a claim by transforming at least 75% of used scenes like photoshoping them etc. But no, you will not get a strike even if its a compilation of scenes, the only way you'll get a strike is if you leaked something or uploaded a full episode. So don't worry and sleep well ;)))", "label": 0}
{"text": "Bc he doesn’t know who his mommy is", "label": 0}
{"text": "They both suck cause they don't have different colours for different hair areas", "label": 0}
{"text": "Really messed up. He never should have betrayed the Starks. His biggest mistake.", "label": 0}
{"text": "Daenerys did a mistake. Even if he was her enemy in the past now he is a honest soldier who will be useful.", "label": 0}
{"text": "Smelling Sam’s farts.", "label": 0}
{"text": "Yup. This is the way", "label": 0}
{"text": "That scene was so brilliant and satisfying. Especially when she has him gagged & asks him if he knows who she is", "label": 0}
{"text": "Not a peep", "label": 0}
{"text": "D&D offered Kit an acting class and he said, “I don’t want it.”", "label": 0}
{"text": "Probably stared at him like that when he said it too", "label": 0}
{"text": ".missandei was the last straw", "label": 0}
{"text": "Olenna Martell - broke guest right by poisoning Joffrey at his wedding where she attended as a guest and was in turn poisoned by Jamie Lannister.", "label": 0}
{"text": "Hell yeah", "label": 0}
{"text": "He and the treacherous doreah got what they deserved", "label": 0}
{"text": "Yea, that wins.", "label": 0}
{"text": "Oh so you want to say he should be okay with she killing thousands of innocent people ,women children burned by his dragons just for her throne ", "label": 0}
{"text": "sorry but it's 100% in line with her character and arc", "label": 0}
{"text": "Also, the fact that they yell \"fire\" when shooting while for the entire series they always yelled \"loose.\" Those must have been some very confused soldiers wondering what ballistas have to do with fire.", "label": 0}
{"text": "I’m a terrible person because I fully expected to see a picture of the kid that committed suicide over the AI Daenerys.\n\nGood reminder that not everyone on the internet has the same dark humor as I do lol", "label": 0}
{"text": "I immediately thought back to season 1 episode 2:\n\n“A dire wolf’s no pet. Get her a dog, she’ll be happier for it.”\n\n- Big Bobby Baratheon", "label": 0}
{"text": "Doubt that vault was hermetically sealed, guy was a liar after all", "label": 0}
{"text": "The mom has a point tough, as the chats were very, very sexual.\n\nWe would stone a man that sexualized a 14 y/o. So I think the company has to at least take some responsability in order to prevent minors to acces that kind of content", "label": 0}
{"text": "Yeah I don’t have any complaint about it happening necessarily. I think that there were signs she was slowly going mad from pretty early on. I just don’t think that some traumatic stuff happening to you is good justification to start burning down a city of a million people. People that did nothing to her. I think the justification is more that she was mad like her father.", "label": 0}
{"text": "LoL", "label": 0}
{"text": "I agree.\n\nBranbot 3000 should not be king", "label": 0}
{"text": "LoL", "label": 0}
{"text": "Ramsay deserved this and more… but I *hated* this scene. \n\nI just don’t feel this is something Sansa would do or enjoy. The show has this very confusing loral compass were the heroes start to act more and lore like the villains, but we are supposed to still root for them. After the Long Night, Sansa and Arya apply what basicaly amounts to Lannister plasticity to argue why they shouldn’t bother to help Dany take the Throne. This is later validated after the fact when Dany goes spontaneously crazy and burns kings landing. “But”, the show tells us right to our face, “it isn spontaneous at all. Weren’t you paying attention? Danny was displaying barbaric acts of violence towards her enemies! Only a monster does that! Don’t you feel like a jackass for cheering fir her when she crimucified all those fucking slave masters?”\n\nBut… Arya and Sansa displayed horrific violence against their enemies? And you very clearly wanted us to cheer for them? \n\nAnyways, Sansa acted out of character imo and all in service of fanservice that only works to fuether muddy the show’s already confused messaging. Rant over.", "label": 0}
{"text": "It was peak because it really started going downhill after", "label": 0}
{"text": "Are there any people who think Daemon is a good person? I have yet to meet them.", "label": 0}
{"text": "The coffee cup 😅", "label": 0}
{"text": "A big one for me was actually before this, when John beats the ever loving shit out of Ramsey lol", "label": 0}
{"text": "Real", "label": 0}
{"text": "I think it's fitting. Ramsay always believed himself to be the ultimate puppet master and the one in control of everything all the time. Literally, when he was tied to that chair, he was still trying to manipulate and control Sansa.\n\nIt was a perfect way for him to go. Be rid of him and don't let his wretched life occupy the minds and the effort of anyone longer than needed but at the same time make sure he dies knowing he has no control over anything and the hounds, who he thought were the object of his control, see him for what he truly is. Just another piece of meat.", "label": 0}
{"text": "He was so annoying back then but redeemed on the latter seasons", "label": 0}
{"text": "BOIL ‘EM, MASH ‘EM, STICK EM… oh shit WHAT IS DEAD MAY NEVER DIE!", "label": 0}
{"text": "I think Olenna just became more reserved because she never, ever expected to outlive the people she did. The only complaint I had about her writing was that the Tyrell army was very much not “shit at fighting” and Highgarden should have been so much harder to take than one damn day", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "The starks lose most of their family too", "label": 0}
{"text": "Honestly i  have no clue what you’re on about lol", "label": 0}
{"text": "I guess you also believe Varys serves \"The Realm\"? His hearts bleed for the suffering of the smallfolk?", "label": 0}
{"text": "dragon fire has been extinguished, no need for fans.", "label": 0}
{"text": "Yes she did. And she chose her own death, so she even violated this rule. \n\nShe outsmarted everyone even in death 😂", "label": 0}
{"text": "Both Jon and Daenerys felt like YA characters thrust into a would where everyone else had more depth than the both of them put together.", "label": 0}
{"text": "> Daenerys was nothing but friendly \n\nBecause she expected Sansa to give up the North’s independence. The moment Sansa actually brought it up during their private conversation, Daenerys immediately retracted her offed of friendship. Not so friendly after all.", "label": 0}
{"text": "Unpopular opinion - not as bad as most people say.", "label": 0}
{"text": "That’s just his face. Better get used to it.", "label": 0}
{"text": "Seriously. She just needs the end result. How you give it to her she is ok with.", "label": 0}
{"text": "Did I say that ?", "label": 0}
{"text": "I feel like Arya was, by the end of", "label": 0}
{"text": "Why?? What wrong with Henry Cavill?", "label": 0}
{"text": "Lol you know you're REALLY GAY when that is sitting naked next to you, and you can't get it up.", "label": 0}
{"text": "I love how nonchalant she is about the whole business.", "label": 0}
{"text": "Yeah he saved the day. That side was too OP but after he came the other side became OP.", "label": 0}
{"text": "On this show marriage really just seems like that. \"I have a son, you have a daughter. Let's get them fucking\"", "label": 0}
{"text": "Yeah Jojen Reed was a cool kid who died for Bran and Bran wasnt even sad for him.", "label": 0}
{"text": "Absolutely nothing. But he's been fancasted as just about every hot male character ever and it's starting to piss people off. Superman and Geralt laid the foundation\n\n*In infomercial voice:*\n\n#Do you have a hot male character that's hot? And probably a good guy? English or American? Yes? Then do I have the character for you! Henry Cavill!!!! He's got a chiseled jaw, washboard abs, and tits comparable in size to rival Sydney Sweeney. He's magnificent and he's exactly the guy for your hot male protagonist role!\n\n>!Note: he doesn't like to be sexualized for the sake of sexualization!<", "label": 0}
{"text": "Totally and Sansa with Loras.... Margery could explain things to Sansa and all would be happy! Harvest Moon! 🌺🌚", "label": 0}
{"text": "Right??! Me too… all business in the front", "label": 0}
{"text": "I really trusted she was a good person. When Tyrion quarelled with her, she sould have understood that he was obviosly caring for her safety to send her far away. But she betrayed and sided with Tywin.", "label": 0}
{"text": "No payoff whatsoever", "label": 0}
{"text": "Oh boy lol", "label": 0}
{"text": "It was. Marrying your kids off was politically the right move, you wanted as many kids as possible for that reason.", "label": 0}
{"text": "Nobody can tell me why Jaime is a bad guy for killing someone commonly known as the Mad King??..... they write him as a villain for saving people from getting burned alive , it makes no sense to m3 at all", "label": 0}
{"text": "The biggest, dumbest, most gullible guys I could find.", "label": 0}
{"text": "Probably because he is the only one in hollywood who actually cares about the source material and understands that because of that source material there is already a well established fanbase and that tainting that source material will lose you the fanbase that was handed to you on a silver platter and is literally the only reason these shows are made…", "label": 0}
{"text": "Ok.. but at this point he had accepted the proposition by Loras to *become* king… he knew what all came along with it", "label": 0}
{"text": "Can’t delete 400 words when you haven’t even written any to begin with", "label": 0}
{"text": "A hot mess", "label": 0}
{"text": "Yep. He cares, like fuck me he cared so much about the Witcher and look what happened there. Hollywood pushed him aside so much he gave up.", "label": 0}
{"text": "Who would he play in Dune? He would have made a great Duncan Idaho but that ship has sailed. He would not be good as Leto II. There aren’t a lot of leading male roles for him in Messiah or Children. \n\nNow, if they decide to go back and do a Butlerian Jihad trilogy then there are some options for Cavill.", "label": 0}
{"text": "What is burnt may never fry!", "label": 0}
{"text": "Like when Tywin learned Sansa has had her period. \"You will wed her and bed her\"", "label": 0}
{"text": "I mean a large amount of male actors are on steroids and nearly all of them deny it so it’s not that big of a deal.", "label": 0}
{"text": "Oooooo duh lol... I didn't even think k of steroids", "label": 0}
{"text": "He would make a better baratheon", "label": 0}
{"text": "I will give you that he is one of the most outspoken about caring about the source and duty to the fan base. However, he is far from the only one. Ryan Reynalds' passion for Deadpool is almost singularly responsible for the current iteration.", "label": 0}
{"text": "Think you'd be a better ruler than young Griff? Not a chance Varys is on your side when it truly matters lol", "label": 0}
{"text": "besides, Jamie Campbell Bower would do better as a Targaryen.", "label": 0}
{"text": "100%", "label": 0}
{"text": "The general public didn’t know that the Mad King planned to burn everyone alive. Remember that they kept saying there was a rumor of wildfire caches stored around the city, so yea no one knew definitely the Mad King’s ulterior motives.", "label": 0}
{"text": "The lady should of had looked into what her child is doing then this tragic wouldn't happen....and over game of thrones? Really? That kid was ill or something else entirely but rest In peace the lady's kid", "label": 0}
{"text": "My sister had a gay friend who screamed and covered his eyes when another friend of hers was topless and he saw her boobs.", "label": 0}
{"text": "I’ve always thought Henry Cavill would make a better Baratheon, possibly Orys.", "label": 0}
{"text": "😂😂😂", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I personally love it. I think it was perfect lmao", "label": 0}
{"text": "I took a shot of celebration when I saw this for the first time", "label": 0}
{"text": "Not sure, it even matters.   I think Arianne Martell will be his downfall.  I think they get married in the Sept, and Cersei blows it up.  So I doubt he lives long enough for us to find out.\n\nIf I'm wrong, then I'd want Daenerys' dragons to decide.   If Aegon / Young Griff can bond with one of the dragons, and become a dragon rider, then that would be good enough for me.", "label": 0}
{"text": "u/repostsleuthbot \nu/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Reddit failed to provide necessary data. Unable to analyze.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Santa?", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n50.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.52\n\nThis account exhibits traits commonly found in karma farming bots. It's likely that u/Fuzzy-Promotion9822 is a bot.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Analyzing user profile...\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n100.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.92\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/Ill_Commercial_9530 is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "I didn't find any posts that meet the matching requirements for r/gameofthrones.\n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=1g6lkw7&sameSub=false&filterOnlyOlder=true&memeFilter=false&filterDeadMatches=false&targetImageMatch=86&targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Target Percent:** 86% | **Max Age:** Unlimited | **Searched Images:** 626,359,809 | **Search Time:** 2.28903s", "label": 0}
{"text": "Analyzing user profile...\n\n100.00% of intervals between user's comments are less than 60 seconds.\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n100.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.93\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/Expert_Presence7276 is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "They're bots.", "label": 0}
{"text": "She was a masterful player, up against the craziest and dumbest bitch who's ever lived in Westeros.", "label": 0}
{"text": "this", "label": 0}
{"text": "for the context he lives in, sure.", "label": 0}
{"text": "Care to explain?", "label": 0}
{"text": "I wasn’t (and still am not) looking at Joffrey in that picture.", "label": 0}
{"text": "How can a king so gentle and righteous be hated smh", "label": 0}
{"text": "A live-action series with Waldau could’ve been epic. He has the perfect vibe for Geralt.", "label": 0}
{"text": "u/bot-sleuth-bot Downvote and report them as spam. Click the 3 dots next to your profile or the response arrow, hit Report, Spam, Disruptive bots.", "label": 0}
{"text": "Joffrey the gentle! If he was alive faith militants would have ended up on spikes, king’s landing would have its own standing army, he would have dealt with Dany before she became a major threat and he would have given the night king a red smile from ear to ear! All hail the one true king!", "label": 0}
{"text": "Because Jon is lost.\n\nHe grew a noble, but had to do some of the work as Bastard.\n\nHe thought he knew the *real* world. Then he gets to wall, beats up a bunch of normal kids and gets scolded for it. A lot of the Nights's Watch were just poor. \n\nHe's trying to figure out the world.\n\nHe knows nothing.", "label": 0}
{"text": "So true, All those traitor didn't understand he was what kept the kingdom on balance", "label": 0}
{"text": "I can see that 100%", "label": 0}
{"text": "Tywin lannister is a most gracious patron", "label": 0}
{"text": "Analyzing user profile...\n\n66.67% of intervals between user's comments are less than 60 seconds.\n\nAccount made less than 3 weeks ago.\n\nAccount has default Reddit username.\n\n100.00% of this account's posts have titles that already exist.\n\nSuspicion Quotient: 0.93\n\nThis account exhibits multiple major traits commonly found in karma farming bots. It is extremely likely that u/Dizzy_Metal1541 is a bot made to farm karma, and it is recommended that you downvote their posts to hinder their success.\n\n^(I am a bot. This action was performed automatically. I am also in early development, so my answers might not always be perfect.)", "label": 0}
{"text": "Probably a better uncle", "label": 0}
{"text": "This needs to be posted everywhere.", "label": 0}
{"text": "i hav forget", "label": 0}
{"text": "Cersei's cleavage being in this picture makes it funny for some reason lol", "label": 0}
{"text": "I dont think hate is happening in this scenario", "label": 0}
{"text": "3. Theon was a captive of Winterfell and never felt welcomed, so he has an identity crisis. It’s really not a flip if he felt he had to prove himself to his “real” family.", "label": 0}
{"text": "Dolorous Ed and Tormund.", "label": 0}
{"text": "Ser Janos for me. Pretty much anyone involved with Ned’s execution. \n\nI also love Littlefinger’s panic when he says no one can judge him because they weren’t there and then Bran tells him the same thing he told Ned. The build up sucked up but he was the WORST.", "label": 0}
{"text": "I think the relationships works precisely because he is not their father. \n\nAs a father he would want his children to be prepared for the harsh world. He wouldn't be cruel but he would be strict in teaching and discipline. \n\nHe sees in Sansa someone who needs to be saved from a life she didn't choose. A possible out for himself as well. (If he takes Sansa to a Stark or Stark ally, perhaps they would take him in as well). \n\nIn Arya he sees a ransom, and then a kindred spirit. He doesn't have to parent her, he only has to protect her. Sure he teaches her some life lesson on survival (but he doesn't want her to do something foolish that gets him killed too).", "label": 0}
{"text": "How can people look at his pious Queen mother like that in her biggest moment of weakness? 😞", "label": 0}
{"text": "Ramsay The Kind would Never do this to a fellow human especially not to Joffrey", "label": 0}
{"text": "He would be a good father but you would have a horrible uncle.", "label": 0}
{"text": "The uncle who takes you out for chicken at the local inn", "label": 0}
{"text": "Even the original high septon knew how to get freaky", "label": 0}
{"text": "Not even close imo The only thing that comes close is Ramsay the Kind traitorous death by the starks", "label": 0}
{"text": "Probably when Ramsay Bolton was so generous and sacrificial that he gave his own flesh to feed his starving dogs", "label": 0}
{"text": "Melisandei is so much better looking though", "label": 0}
{"text": "Yeah he has gentleness in his genes. His dad killed a king and his mom blew up a sept.", "label": 0}
{"text": "I was so depressed for a long time once he died…", "label": 0}
{"text": "Is there a Joffrey in the pic?", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "He definitely would protect his child til the end of time.", "label": 0}
{"text": "Don’t cover the good stuff", "label": 0}
{"text": "Yes its comes at close second he was so kind that he wanted to return some to the world and valued the life of others, even dogs over his own", "label": 0}
{"text": "Does this mean he reduces his concept of how long *Winds* should be by 400 words? If so...\n\n\"Hey, I think Henry Cavill would be a great actor to play a Targaryen!\"", "label": 0}
{"text": "She says it plainly herself. She wants to be queen.", "label": 0}
{"text": "And magical 😍", "label": 0}
{"text": "Three is a strange number of boobs to see in a pic.", "label": 0}
{"text": "The sand snakes", "label": 0}
{"text": "Sir Teryn Mant ....  \n\nSir Meryn Trant", "label": 0}
{"text": "I understand that to you Ramsay the kind's sacrifice was sadder to you, even though its saddens me aswell for me Joffrey's death is more sad", "label": 0}
{"text": "Yeah the idea is someone else coming too", "label": 0}
{"text": "Who is the person in the picture?", "label": 0}
{"text": "The mountain actor 1 of 3", "label": 0}
{"text": "So give me a kiss by the Long Canal🎶 \n🎵And give me two kisses in Salty Town\nFor we’re going to dine tomorrowwwww \n\nAh fair Queen Cersei…", "label": 0}
{"text": "he'll probably be the cool dad in sleepovers", "label": 0}
{"text": "Craster was a real POS and I'd argue one of, if not the, worst people in the show.", "label": 0}
{"text": "You guys are also forgetting when Theon had an addiction to whores and we all know that a proper heir to the iron island should only be with one women. And what did Ramsay the merciful do? He cured Theon of his addiction.", "label": 0}
{"text": "The way he acts and eats especially would definitely be looked down upon nowadays. He also murders people", "label": 0}
{"text": "Reply would have been a good king.", "label": 0}
{"text": "Sansa 😈", "label": 0}
{"text": "Truly Ramsay's want to help others is immeasurable we all should aspire to be like him one day", "label": 0}
{"text": "[repost bot](https://www.reddit.com/r/gameofthrones/comments/n2n9jh/no_spoilers_drogon_incredible_game_of_thrones/)", "label": 0}
{"text": "When you're with uncle Sandor, you get every fucking chicken in the place", "label": 0}
{"text": "Shae", "label": 0}
{"text": "🤦‍♀️🤣", "label": 0}
{"text": "ONGGGGGGGG", "label": 0}
{"text": "Bold of you to assume there's 400 words to delete. We're more likely to get Kingkiller book 3 before Martin finishes this one...", "label": 0}
{"text": "Yeah but with the context of both of them being dragonriders and these dragons being their most lethal weapons, it's down to the exact same.\nAnd nothing changes, what Rhaenys says makes no sense at all since Rhaenyra is neither a warrior nor a fighting Dragonrider, and neither is her dragon. \nIt's like people saying that they \"see red\" in fights, thinking it gives them some kind of power. It doesn't. Face Francis Ngannou in that state and you will be seeing black. Most likely forever.", "label": 0}
{"text": "I bet my friends would be like yeah idk I just told em I didn't know it was a secret", "label": 0}
{"text": "And probably another series he can nerd out with for sure.", "label": 0}
{"text": "Balon Greyjoy\n\nThe Waif\n\nThree Eyed Raven\n\nBenjen Stark", "label": 0}
{"text": "Gods the breastfeeding actually got me nauseous", "label": 0}
{"text": "And it has none of the safety nets a regular therapist provides.", "label": 0}
{"text": "Walder Frey? Craster?", "label": 0}
{"text": "I fucking hate Joffrey", "label": 0}
{"text": "THANK THE GODS FOR LYSA! AND HER MILKERS!", "label": 0}
{"text": "1 trillion % agree.", "label": 0}
{"text": "It also works when you tell one person a secret.", "label": 0}
{"text": "I'd fly there, burn the city, take the throne", "label": 0}
{"text": "Little man was like like 12", "label": 0}
{"text": "I cried for days over him and Ramsay the righteous. It’s always the ones who don’t deserve it 😔", "label": 0}
{"text": "Same i couldn't watch got for multiple days after those scenes, so heartbreaking 😞", "label": 0}
{"text": "She spared the women, and since we see no children at the feast, they surely lived.  Also, Arya/Walder tells the  men that she invited only those who helped him kill the Starks at the Red Wedding.  That implies she left some male Freys alive because they didn't seem guilty.", "label": 0}
{"text": "Is he a virgin i wonder", "label": 0}
{"text": "…Ser Whatsit or Whocares", "label": 0}
{"text": "Until she pulls a superhero move and jumps off her dragon and stabs Aemond through his stupid eye. \n\n😂", "label": 0}
{"text": "Indeed", "label": 0}
{"text": "Dani did not need to do that to her girl tho", "label": 0}
{"text": "One could say in the earlier seasons he reeked. ", "label": 0}
{"text": "Ramsay was my least favorite but there were so many to choose from.", "label": 0}
{"text": "If he quit the Witcher over not sticking to source material, then why would anyone want to cast him for anything book related?", "label": 0}
{"text": "bro what? she legit pointed out tyrion to be guilty and then fucked tywin??", "label": 0}
{"text": "Its Our Gracious Good King Joffrey The Gentle and you didn't notice him probably because his death is so horrible and sad that you unconsciously tried to ignore him not to depress you", "label": 0}
{"text": "More future conscripts for the Nightking Army", "label": 0}
{"text": "Stannis. Had his own daughter killed.  Unforgivable nutcase.", "label": 0}
{"text": "Just, in history, there were a lot more Jaime and Cersei situations lol", "label": 0}
{"text": "He drank and he knew things", "label": 0}
{"text": "The most noble child the gods ever put on this good earth.", "label": 0}
{"text": "I read a comment from someone here that said the dragons are better with a rider like as in you can see better with two sets of eyes, and Dany can help him quickly dodge etc.", "label": 0}
{"text": "I’m surprise the collective hangover didn’t kill him", "label": 0}
{"text": "He's just deleting things out of other people's books now after someone thought about mentioning it once.", "label": 0}
{"text": "I wish", "label": 0}
{"text": "They were so lame", "label": 0}
{"text": "The boar that killed Bobby B", "label": 0}
{"text": "Is this dude gonna live long enough for A Dream Of Spring?!", "label": 0}
{"text": "i didnt look away", "label": 0}
{"text": "I honestly found myself hoping so many characters would die very often\n I was warned not to get attached to characters before watching. I enjoyed hoping many would cease. I loved cerceis atonement despite the fact that it did not feel like nearly enough", "label": 0}
{"text": "So you must think Ramsay's death is sadder, fair fair", "label": 0}
{"text": "Peritonitis. How Dennis Jurgens died. True crime case from White Bear Lake, Minnesota.", "label": 0}
{"text": "it’s Jon. i haven’t read the books but my understanding of TPTWP was centred around uniting the realm in/and defeating the army of the undead; all of which was undertaken by Jon", "label": 0}
{"text": "GRRM is delving into negative word counts as fast as possible. Pretty soon,  he'll have deleted the entire series.", "label": 0}
{"text": "An innocent's souls death is no laughing matter 😞", "label": 0}
{"text": "Well he had to listen to his king.  That were his orders.", "label": 0}
{"text": "This show's habit of recasting characters and not really addressing it can be frustrating.", "label": 0}
{"text": "Only cast Henry as someone who gets naked", "label": 0}
{"text": "I miss The Hound.", "label": 0}
{"text": "Tis true", "label": 0}
{"text": "Ransoming Arya and hitting Arya was his duty?", "label": 0}
{"text": "He says that....but was it really true?  And he had a lot of regret for that family afterwards...", "label": 0}
{"text": "Ron", "label": 0}
{"text": "At that moment, I thought Cersei's cleavage, NICE. But then after suddenly it hit me, Ooo the Prick is dying", "label": 0}
{"text": "This, dude got paid the HBO bucks.  He's done", "label": 0}
{"text": "Lol.", "label": 0}
{"text": "Exactly my point.", "label": 0}
{"text": "Yes its hard to ignore the queen mother's beauty but we should do it to honour a Goodman's death", "label": 0}
{"text": "You post it again tomorrow, I'm busy.   But I got Sunday.", "label": 0}
{"text": "In an world where a lot of fathers 'go out to get milk'.  This guy stuck around for those 2 girls and risked his life for them.....I'd say yeah ...father of the year.", "label": 0}
{"text": "This is the correct answer", "label": 0}
{"text": "Arya stark -cuz she worked hard. Really hard!. Arya’s revenge for the Red Wedding is one of the most satisfying moments in Game of Thrones! \n\"The North remembers!\"\n\"Winter has come for House Frey\"", "label": 0}
{"text": "I read that one too.  It’s very good but very sad.  Used to live in WBL.", "label": 0}
{"text": "Can’t subtract 400 from zero…", "label": 0}
{"text": "Like Jamie surviving the fight with Euron despite being stabbed multiple times", "label": 0}
{"text": "I must've contributed to atleast 4000 words being deleted then.", "label": 0}
{"text": "Your submission has been automatically removed because of the reference \"**meme**\". Please take a look at our [rules](/r/gameofthrones/w/posting_policy) which state **Reader-reaction posts should promote discussion about the show/books/story.**    If you feel this action was in error, please [message the moderators](/message/compose?to=%2Fr%2Fgameofthrones).  Try /r/AdviceAnimals or /r/reactiongifs\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Well it’s not like Margaery has any romantic love for Renly. This is just a business transaction for her (not a criticism, that’s just how she behaves) and so she needs Renly to fulfill his end of the bargain", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Definitely your Mom.", "label": 0}
{"text": "Did you guys enjoy the scene where Jaime tells Cersei?", "label": 0}
{"text": "It's quite simple people the smallfolk is dumb", "label": 0}
{"text": "Speaking of, how was it even legal to have that child sucking on a grown womans tit on tv?", "label": 0}
{"text": "Even her rejecting the offer is extremely infuriating. She has an offer which can afford her a nice living standard for the rest of her life, something people of her status can only dream of, and she's still not satisfied.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Well no I didn’t say or even remotely imply that lmao. This is a response to your own question about him being a good father :)", "label": 0}
{"text": "Huge tracts of land.", "label": 0}
{"text": "The Waif’s character in the books was minor BUT extremely different than the show version. It was disappointing to watch.", "label": 0}
{"text": "lmao, i miss this cat", "label": 0}
{"text": "Henry Cavill should play GRRM in a biopic", "label": 0}
{"text": "Love it. Almost from the episode itself", "label": 0}
{"text": "I’m late to the party with this comment but who’s bloodraven?", "label": 0}
{"text": "That’s what I thought too lol like. Does he actually still write outside of for funsies for himself?", "label": 0}
{"text": "I found it very disturbing as well 😵‍💫No way I’d like my kid do that, especially for a show.", "label": 0}
{"text": "Tywin everything.", "label": 0}
{"text": "Season 4 was the best book season.\n\n\nSeason 8 was the best non-book season.", "label": 0}
{"text": "Timeline got fucked up.", "label": 0}
{"text": "Tyrions vote scene, living vs dead, gregor vs the zombie mountain. It was peak as well.", "label": 0}
{"text": "He wouldn’t? I don’t know.. might be interesting to see Cavill play the God Emperor and spend 2 hours of a movie waxing philosophical about how a private army of hot women is far superior  to any male army.   \n\n(God damn I’ve read that book and even just writing that out made me think: “Jesus Frank you fucking (brilliant) weirdo” 😂😂😂)", "label": 0}
{"text": "Goddamn every nerd community has a hard on for cavill, and its completely deserved", "label": 0}
{"text": "He looks NOTHING like the type they cast as Targs I’m so sick of seeing it", "label": 0}
{"text": "He's wholesome 100 Keanu Chungus and he plays video games just like me so that means his bland acting is good.", "label": 0}
{"text": "It was the salt a lot. When Robb went to see Walder before the Red Wedding, they made a big deal about getting salt as soon as they came in. Catelyn even mentions it and how they had guest rights because of it.", "label": 0}
{"text": "He isn't a maester, he ran away", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "How about Evan Peters?... I think he's one of my favorites right now.... he could be someone good lol 😆", "label": 0}
{"text": "The nicknames are accurate and they will stick forever but Jamie did the right thing and anyone who knows the full story (like Brienne) can see that. \n\nOthers who don’t have the full story (like Ned and 99% of the population) will always assume Jaime just killed the mad king so his father could take the city. \n\nSo the issue for Jamie is that people don’t know the whole truth, and they never will, because nobody will believe him even if he tried and as he said himself “Do you think the great honourable Lord Stark had any interest in hearing my side of the story?” (Or words to that effect).", "label": 0}
{"text": "Lmao did you know there are chapters out there?", "label": 0}
{"text": "Yeah cuz if she ran into the castle she would have gotten killed....I mean....really?", "label": 0}
{"text": "Chungus 😂", "label": 0}
{"text": "If he dies, he dies", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "A) You take a bag of gold and love rich for the rest of your life\n\nB) You stay and become a whore for Tywin Lannister\n\nAnd you chose B. Congratulations.", "label": 0}
{"text": "He will be that cool uncle . Who acts all rough and tough but has a soft spot . Who trains you and gives valuable insights and once you have grown shares a drink with you", "label": 0}
{"text": "He is", "label": 0}
{"text": "Na, he's just not writing anything at all.", "label": 0}
{"text": "He could work! Especially the him like from the bath house scene with Brienne - that's exactly the sort of vibe you'd want from the Witcher, I think!\n\nThat being said, there will never *ever* be a more perfect casting - imo of course - than the OG adaptation https://media.teleman.pl/photos/Wiedzmin-2001-2002_uFnuFum.jpg (pictured from right are Geralt, Yennefer and Jaskier/Dandelion). Sure it had the lowest of budgets and the \"effects\" look derpy haha, but there's precious few shows that manage to capture their source book's atmosphere as well as this series does. \n\nhttps://www.youtube.com/watch?v=MLg9t3NOXMs", "label": 0}
{"text": "I completely agree. Saying it’s the mother’s fault is completely fucked up because we don’t know these people or their lives. People kill themselves even when they have a good mother. There are so many other factors that contribute to someone contemplating and/or carrying out suicide. It’s hard to blame one thing for the cause of it.", "label": 0}
{"text": "But he made it clear he wasn't comfortable about the whole role in the first place. He's a smuggler. Good at that, all day long but he didn't want to lead that seige. He was upfront about that right away. Even though the odds were on his side. Stannis still forced him to. Who would've guessed a vessel had been pumping wildfire into Blackwater all day?\n\n Really in a way it was a blessing in disguise. A victory would have put Stannis' crazy ass on the thrown, and Kings Landing would turned into a slaughterhouse to keep the blood magic wheel turning.", "label": 0}
{"text": "Your submission has been automatically removed because its title includes the spoiler \"**blind**.\" Please read the [Spoiler Guide](/r/gameofthrones/w/spoiler_guide) that explains how spoilers are moderated and how to provide warning for them.  The bot looks for a very complex set of patterns, and every now and then it returns a false positive.  If you feel the bot is wrong about your post title, please [contact the moderators](/message/compose?to=%2Fr%2Fgameofthrones) to have it reviewed.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I think the bigger problem is people who consider breastfeeding to be somehow *inherently* sexual.\n\nThe fact that you’re comparing the natural way a mother feeds her baby to a hypothetical pedophilic sex act is incredibly sick. The premise is uncomfortable due to commonly accepted ages of weaning, and not at all portrayed in an objectively sexual manner in the show either. \n\nYour comparison is further exposed due to the fact that if you simply reduce the age in both instances, one of them becomes completely normal and acceptable while the other is still a disgustingly horrific crime.\n\nJust because something becomes fetishized by certain people does not change the fundamental reality of that thing existing in a normal, non-sexualized way. If you perceived this scene in any type of sexual manner, that’s applied through *your* lens, which again is crucially disturbing.", "label": 0}
{"text": "Will that come out or not?", "label": 0}
{"text": "Well, sucking a dick is actually a sexual act. Breastfeeding isn't. Weird, but I wouldn't categorize them the same way.", "label": 0}
{"text": "The Wagatha Christie approach.", "label": 0}
{"text": "I don't think it's vulnerability with Arya so much as it's her subverting expectations placed on her because of her gender and status. Gods help them if the day comes where she has to marry Robb's ally \n\n\nYeah I forgot about Bronn, he's alright too. Samwell is good comic relief but atm he doesn't really seem to have a purpose. Margery is interesting too\n\n\nWill do an update if I remember lol", "label": 0}
{"text": "Not to say HC wouldn't be a good pick to play any characters but to me he doesn't look like a Targ at all. More Baratheon looking to be honest. Maybe play Rob B in Rob B's Rebellion ", "label": 0}
{"text": "Very Gentle... Very gentle death indeed", "label": 0}
{"text": "Rhaynera and I’m on her side she’s just poorly cast and written", "label": 0}
{"text": "GRRM foresaw the meat cube way before it was cool", "label": 0}
{"text": "…and you’ve still managed to miss the entire point, congratulations.", "label": 0}
{"text": "Not really, your entire argument is completely illogical and based off a breast feeding fetish lmao. This is the internet, you could be too young for this conversation or a virgin.. sucking on boobs isn't a fetish, it's as common as sucking a dick. Point still stands.", "label": 0}
{"text": "Which means the word count is in the negative. So we owe HIM words! Better pay up", "label": 0}
{"text": "Aren't there sheep where he lives?", "label": 0}
{"text": "No death is sadder than Ramsey the Pious :(", "label": 0}
{"text": "having a bowel movement is dishonorable.", "label": 0}
{"text": "Book version, was kind to Tommen and Myrcella", "label": 0}
{"text": "It’s an opinion, get over it? 😂", "label": 0}
{"text": "No matter, still zero", "label": 0}
{"text": "The battle of winterfell is a top ten episode, regardless of the overall depleted writing quality of the season, and i’ll die on that hill", "label": 0}
{"text": "If I had to fancast him as anyone it would be a Stark or Baratheon, I can't really picture a Targaryen.", "label": 0}
{"text": "Assuming they would all be loyal to me:\n\nHand of the King: Jon Arryn\n\nMaster of War: Tywin Lannister\n\nMaster of Coin: Tyrion Lannister\n\nMaster of Whisperers: Varys\n\nMaster of Laws: Eddard Stark\n\nMaster of Ships: Davos Seaworth\n\nLord Commander of the Kingsguard: Barristan Selmy\n\nGrand Maester: Samwell Tarly", "label": 0}
{"text": "Season 8 is the GOT fanbase's piñata.", "label": 0}
{"text": "You’re basically just listing the main characters though who were “bad guys”. They always inevitably get killed. \n\nWhat about the other 40 people at the red wedding whose names we don’t know for example.", "label": 0}
{"text": "Sansa", "label": 0}
{"text": "I'm engaged, my porn watching days are in the past. Curious why so many people are defending this extremely weird scene.", "label": 0}
{"text": "Was either of their purposes supposedly for sexual gratification? Or were they just \"breastfeeding\"?\nAs portrayed through their outward actions?", "label": 0}
{"text": "His swift transition from \"extremely loyal to Stannis\" to \"extremely loyal to Jon\" is odd and should have been better dealt with in the show. \n\nI don't think we even get a scene where he ruminates on losing Stannis. This was the man he was cool with losing his fingers over ffs", "label": 0}
{"text": "Absolutely 100%. He didn't agree with a lot of Stannis's methods, especially near the end. Yet, he remained loyal. I think if he knew about Shireen a bit earlier while he was at Castle Black it would have changed his allegiance but Stannis was already basically done for by that point. He didn't blindly cast his loyalty to Stannis for no reason, but truly saw Stannis as the rightful heir. Which honestly with only watching the show and what we knew as an audience I agreed that Stannis was the natural rightful heir up until his demise.", "label": 0}
{"text": "Because nobody else considers it sexual. Only you think this, and so only you are disturbed by it as if it portrays something sexual.", "label": 0}
{"text": "yippee kai yeah MFer", "label": 0}
{"text": "It you still don't understand why everyone disagrees with you, after all these comments, you're probably trying not to", "label": 0}
{"text": "Take my downvote karma farmer", "label": 0}
{"text": "Well, it looked like she had passage to leave. We don't know if she chose to come back or not.", "label": 0}
{"text": "Joffrey's death truly, truly TRULY, in my mind, marked the beginning of its decline though there was some trouble in the water even earlier.  Unpopular opinion is Oberyn's death was comical and a bit silly which kind of cheapened the whole bit to me.  Seasons 1-4 were full of great moments with none particularly standing out over the other.  Some cringe, some skippable and some amazing moments.  Season 4 it comes to a head and well the rest is show business.", "label": 0}
{"text": "What does that have to do with Shae?", "label": 0}
{"text": "\"lot of fathers\" ?\nWhat does that mean? How many and what percentage of people had their fathers run out to get milk? I can't imagine any more than 1 in 1000 fathers who did that. Is that really your benchmark for being a good father? Not running away?", "label": 0}
{"text": "Who do we need to fancast to get season 8 deleted?", "label": 0}
{"text": "Maybe the mad uncle that takes the kids to KFC.", "label": 0}
{"text": "Jaime is nothing more than an accessory in the first two seasons, get real.", "label": 0}
{"text": "I disagree. Because the show HAD a happy ending. The Starks/Snow are alive, the white walkers are defeated and Westeros is mostly intact. It almost ends in a \"And they lived happiley ever after\" way.\n\nI had hoped in a much darker, bitter end. An end where Westeros will have paid a terrible price for its arrogance. Still alive, but painfully aware that they are NOT the dominating species and that the WW will return, someday.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Current printings of Dance of Dragons were reported to be missing 12000 words", "label": 0}
{"text": "Jon Snow - Hand of the King  \n\nBran Stark - Master of Whispers\n\nSansa Stark - Master of Coin\n\nArya Stark - Master of Ships\n\nBrienne of Tarth -  Lord Commander of Kingsguard\n\nTormond Giantspan  - Master of Law\n\nSam Tarly - Grand Maester  \n\nGendry  - Master of War", "label": 0}
{"text": "Am I that off base with the rest of the random lol", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I have odd tastes, I know. Though I can see the beauty in most women on the show. my top 3 are:  \nOsha  \nYara Greyjoy  \nTyene Sand", "label": 0}
{"text": "If I ever start dairy farming, my first cow will be called Lysa.", "label": 0}
{"text": "Idk whether to laugh or cry", "label": 0}
{"text": "A must need holder", "label": 0}
{"text": "It makes absolute sense. Because conversations between human beings are not that easy.\n\nHere, she is saying to him: \"Leave her alone.\"\n\nShe is not writing an essay about dragon fights. What she is saying is that she is perfectly able to take care of herself while shaking off an annoying person and pointing to Renhira state of anger. It's a clever sentence.", "label": 0}
{"text": "I think his plan was to marry Sansa and with Robin Arryn in his pocket, he'd control the North and the Vale. Sansa also holds some sway with the Riverlands. That would put him in a very strong position. \n\nOne aspect of him starting a war between the Starks and Lannisters is it put a big dent in the Lannister's dominance. Their army was greatly weakened and they were heavily in debt (something Littlefinger oversaw during his time as Master of Coin), so he would know that in an eventual conflict with the Lannisters, the odds would be in his favour..", "label": 0}
{"text": "Eh... all of those things wasn't enough to turn on Stannis for four seasons in extremely dire conditions? \n\nYeah, Stannis died at the end (or so he's heard from Melisandre) .... but so did Jon! Right after him. The show didn't really do a good job of making us understand why he goes to such lengths to protect Jon's dead body?! Like why? Why not ride south to see what has happened to Stannis' army and Shireen with your own eyes for example. \n\nThe show made him an audience surrogate and suddenly have him risk his own life for a Lord Commander he barely knew", "label": 0}
{"text": "They’re not defending the scene, they are agreeing with the person who replied to you who clearly explained why your example is in no way comparable to the scene in the show, the two acts are wildly different.\n\nA child being fed by their mother, no matter the age, isn’t pornographic.", "label": 0}
{"text": "He's begun taking away words from A Dance with Dragons now", "label": 0}
{"text": "That's quite an accomplishment", "label": 0}
{"text": " It's many stories wrapped up into one. Re-watchable many times over.  It's the best tv show ever, by far.  \n\n  Sometimes I just like to start watching during season 6, so I can re-live all the Stark re-unions, without all the heartache.", "label": 0}
{"text": "Stop copying stuff", "label": 0}
{"text": "I doubt he would've been a good father, I do think he would have tried the best he could.", "label": 0}
{"text": "The Sausage King of Chicago? Is that you Abe Froman?", "label": 0}
{"text": "The fictional scene is \"breastfeeding\" however in real life, we have a 10 year old boy with his mouth on an unrelated 40 year old woman's breast.\n\nIt's extremely disturbing to anyone with functioning eyeballs.", "label": 0}
{"text": "Uhh. Maybe in the world of ASIOF but he’s not a father for a reason, I’d imagine:\n\n“… Oh there are plenty of women in the ground. I put some there myself…”", "label": 0}
{"text": "My problem isn't with the fictional portrayal of a mother breastfeeding her kid. It's with the very real 10 year old boy being filmed sucking on a strange 40 year old woman's breast.", "label": 0}
{"text": "     10:Gets paid HBO bucks for working on a new GoT related series as an advisor  \n     20:GRR Is happy because it's close to his books and has a lot of impact on the production  \n     30:Series runs of source material so they start doing their own thing  \n     40:GRR complains about getting sidelined and ignored all the time  \n     50:GOTO 10  \n  \nMoney printing loop.", "label": 0}
{"text": "Henry Cavill as Rogal Dorne. Give people exactly what they think they want in the way they want it least.", "label": 0}
{"text": "Terrible execution is a lie.\n\n\nYou dont have to like the ending, but at least be honest why.", "label": 0}
{"text": ">\"lot of fathers\" ? What does that mean?\n\nLots of *cunts.*", "label": 0}
{"text": "Did you forget to switch to your alt-account before making this comment ?", "label": 0}
{"text": "Hand - Tywin\nMaster of Coin - Tyrion\nShips - Stannis\nWhisperers - Varys \nGrand Maester - Qyburn\nLord Commander - Ser Barristan\nWar - Robert Baratheon\nLaws - Ned Stark", "label": 0}
{"text": ">He doesn't even believe in magic!\n\nI'm pretty sure he does after seeing Melisandre giving birth to a shadow to kill Renly.\n\n>The show didn't really do a good job of making us understand why he goes to such lengths to protect Jon's dead body?!\n\nWhy not, he has nowhere to go. He knew Jon from recent events, saw that he is a selfless leader that got killed for his care about the greater good. He saw him mercy kill The king beyond the wall when he was being burned alive.", "label": 0}
{"text": "Wheel of Time said hello", "label": 0}
{"text": "Thug life!", "label": 0}
{"text": "I didn’t read them until this year, I highly recommend.", "label": 0}
{"text": "he left a girl and her father to starve to death", "label": 0}
{"text": "Well you know ..some habits are harder to break than others ...", "label": 0}
{"text": "Well except for HoTD for the most part. I believe they have all the material they just are stretching it out. The other points still stand though", "label": 0}
{"text": "Yeah I mean, I have nothing better to watch so I just watch it on repeat and skip stuff that irks me in it. It's the best way to watch imo.", "label": 0}
{"text": "No they didn't.   They only said things would get 'muddled' with books 4/5.   \n\nFurther, they completely altered the direction of those later season (eg. S7-S8E3 doesn't follow the outline they had from GRRM, and instead they made on their own..  for example, they didn't decide Arya would kill the night king until after S6 was written because \"no one would see it coming\".... then they eventually returned to GRRM's outline).  \n\nThere was no structure.. which is why each 'act' (S1-4, S5/6, S7/8) seems as if it own type of story", "label": 0}
{"text": "Is this a real question or just a thinly-veiled humble brag?", "label": 0}
{"text": "Yes there are plenty of people like that nowadays - and none of them are good fathers. Not sure what point you're trying to make.", "label": 0}
{"text": "THAN* FFS", "label": 0}
{"text": "That’s what GOT is all about beautiful Scenarios and details on sets", "label": 0}
{"text": "i think tom holland would be a great targaryen", "label": 0}
{"text": "We need Travis Fimmel as aTargaryen", "label": 0}
{"text": "Lazy writing. They probably didn’t know what to do with him at the taking of Kings Landing. Him getting taken out there would have made more sense. Was it extra CG they didn’t wanna pay for? Imagine a dragon falling out of the sky onto Kings Landing a la Meleys", "label": 0}
{"text": "But… but… nah, I’m not gonna say it", "label": 0}
{"text": "IHis body looks pretty natural to me. I think it’s hard work for years and years plus the right food.", "label": 0}
{"text": "u/repostsleuthbot\n\nThis was just posted yesterday by another bot.", "label": 0}
{"text": "Looks like a repost. I've seen this image 2 times.\n\nFirst Seen [Here](https://redd.it/1dpnwka) on 2024-06-27 95.31% match. Last Seen [Here](https://redd.it/1dpnx98) on 2024-06-27 95.31% match\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=1gcbu94&sameSub=false&filterOnlyOlder=true&memeFilter=false&filterDeadMatches=false&targetImageMatch=86&targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Target Percent:** 86% | **Max Age:** Unlimited | **Searched Images:** 626,586,647 | **Search Time:** 0.32111s", "label": 0}
{"text": "I don’t believe Varys serves the realm.\n\nHe serves his interests and his interests are tied to Targaryens.", "label": 0}
{"text": "Almost any other moment is sadder.", "label": 0}
{"text": "First thought - oh no, how awful, what black humor, it reminds me of that horrible moment.\n\nSecond thought- or should I buy this", "label": 0}
{"text": "ALRIGHT ALRIGHT WE GET IT", "label": 0}
{"text": "Yes and it was the walk of shame for Cersei the Gracious.", "label": 0}
{"text": "That is like ... a yearly progress deleted each time!", "label": 0}
{"text": "r/upvotedbecausecleavage", "label": 0}
{"text": "Agreed … although I think Bran as King is really the King as a faintly-reluctant arbitrary figurehead for others to responsibly organise behind —  organising in the best on-going interests of a populus they barely care about (but do care). The game is over, the dull work of solid stewardship commences, legitimised by some notions of natural royal hierarchy. This is a bit of a leap, but the end reminds me of the end of Viridiana, if you’ve seen that movie!", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "It's called pouting. Apparently it brings a lot of money in so he does it.", "label": 0}
{"text": "Aemond would own her even without dragons\n\nGirl doesn't even know how to weild a sword", "label": 0}
{"text": "Complain that fans complain that you've broken repeated promises about completing the work years ago.", "label": 0}
{"text": "Yeah he's dug in pretty deep now, not sure he's coming out of this circle anytime soon. \n\nIt's been so long since I read the last book I feel like I'd need to read them all again now. I also told myself I won't read WoW until the final book is released, if that ever happens.", "label": 0}
{"text": "Implying there are 400 words to delete.", "label": 0}
{"text": "This post deleted 400 more. We might have to give back A dance with dragons books soon.", "label": 0}
{"text": "It’s my comfort show along with the Big Bang Theory", "label": 0}
{"text": "Liam Cunningham’s performance is one of my absolute favourite in the show. I think he, Conleth Hill as Varys, and Alfie Allen as Theon are all tied for my favourite performances. The actors just embody every facet of their characters so well. \n\nI’m reading the books right now and while I do tend to picture most of the show’s cast while I read, I make mental edits here and there to make them fit better with the books. Not Davos, though. Every chapter of his, when I’m imagining his voice, his appearance, his mannerisms, etc it’s 100% Liam.", "label": 0}
{"text": "What circle is that?\n\nThere was \"Game of Thrones\" which had a last season so bad that the dislike for it was almost universal. Which, yes, was based on unfinished material.\n\nAnd then you have \"House of the Dragon\" which is based on material that is finished, as all of the Dance is covered in \"Fire & Blood\" as it currently exists.\n\nSo there are two shows, only one he actually publically complained about and only the one he didn't complain about it is based on unfinished material.\n\nThere is no cycle here. There's one instance, and it's not even an instance where the material was unfinished.", "label": 0}
{"text": "“Nothing fooks you harder than time”", "label": 0}
{"text": "People are weird af. You sound really hurt about a man that has made something far more significant than you ever will. And I mean that with no ill will against you, I mean that with a great deal of respect.", "label": 0}
{"text": "He never complained that GoT messed it up and the dance isn't an unfinished story.", "label": 0}
{"text": "He was only in his 40s when he published A Game of Thrones. It's been nearly 30 years. That's a long time to finish a book series, even if it's being written slowly. \n\n\nThe last book came out in 2011. \n\n\nI get that it's probably hard for him now that he's in his mid 70s, but why take so long to write the books?", "label": 0}
{"text": "Tbf, he is literally Deadpool without the murder and has been since before he even had a career lol", "label": 0}
{"text": "Right? It's been almost 30 years since A Game of Thrones. He was only in his 40s when he published it. That's a long time to finish the series, and he's still, supposedly, 2 books from the end.", "label": 0}
{"text": "He DID slap tf outta Arya that one time, but overall yeah I agree.", "label": 0}
{"text": "Or bran just snitched", "label": 0}
{"text": "Creative liberties have to be taken either way, but yes whatever contract he signed probably didn’t give him that much power, or he’s unwilling to put his foot down and prevent the show from being completed at all I’m guessing.", "label": 0}
{"text": "After he’s dead they’ll use an AI with his notes to finish the story. I’m not too worried", "label": 0}
{"text": "Personally I consider Tyrion, Jon and Daenerys to be the main characters.", "label": 0}
{"text": "He's been a highlight in almost everything he's done. That said, I don't believe he's really had a super dramatic role as of yet so there's still a lot to be seen, but regardless of one's personal feelings on the man, one is delusional to deny that at the very least, he does /very well/ in the roles he's had.", "label": 0}
{"text": "emotionally tranquil response, as expected.", "label": 0}
{"text": "Jesus Christ... I literally said that the last season was stupid. Go bitch about it to someone who cares.", "label": 0}
{"text": "Yes. Stating that you stated a fact is sheer emotionalism. Thanks again.", "label": 0}
{"text": "When he was born he started writing and had the first book out by the age of 1. He is 76 and we are still waiting on the second one 😔", "label": 0}
{"text": "you stating it as a fact doesn’t mean that it is. But carry on", "label": 0}
{"text": "It's Hollywood, so I wouldn't be surprised if he is, but his physique is absolutely achievable. He's been working out for 20+ odd years, he's got size but he's not MASSIVE, and he's not extremely cut either.\n\nHis physique does not look like the physique of a man on gear. But being an action star in Hollywood, it's completely possible.", "label": 0}
{"text": "Targ casting is wild. I was always under the impression they were supposed to be Martin's answer to Elves, ethereal almost and beautiful, yet 70% of the Targ men look like soggy newspaper lol", "label": 0}
{"text": "Agreed. He should just get others to finish it with his oversight.", "label": 0}
{"text": "Wow. Harsh. But fair. I would love to be a fly on a wall at a lunch with him, JK Rowling, and George Lucas where the discussion topic was “You thought you were a creator until your creation became a popular Frankenstein cash-spewing Money machine and now IT owns you.”", "label": 0}
{"text": "I think calling someone a joke for not finishing a book series is a bit much", "label": 0}
{"text": "George won't release the book. The only way we'll get it IMO is after he's dead, when another author will have the chance to finish it.", "label": 0}
{"text": "Yeah no shit. We aren't talking about caging the man and forcing him to finish. That doesn't mean people can't think he's an ass and make jokes about him when heis name is brought up.", "label": 0}
{"text": "At least he did good work on Elden Ring", "label": 0}
{"text": "He ran outta da juice", "label": 0}
{"text": "Lol it's a meme bro, not a legal prosecution", "label": 0}
{"text": "Thank you for commenting this because I feel like people forget fire and blood is a finished history, and the hotd creators butchered it for no reason.", "label": 0}
{"text": "Seriously.  HOTD is like 1/10 of Fire and Blood.\n\nI don't think there's any way he could finish GoT without people hating it anyway. \n\nI'd like him to bridge the gap between Aegon III and Baratheon I.", "label": 0}
{"text": "Yeah but most people would have finished their works by now (which he easily could have), and would most likely only be focused on the adaptations so there isn’t this weird issue of it not staying true to your vision that only you know about", "label": 0}
{"text": "Every day there are posts that unironically prove the point he’s made a couple of times about the fan base.  Today is your day.  Well done.", "label": 0}
{"text": "So, Varys's questionable actions towards two known Targaryen is not anti Targaryen?\n\nI mean the man's passionate speech about Aegon to Kevan Lannister would tell you how much Varys loves that boy. If he showed even 1% of that love to Viserys and Daenerys, they might have had a safe childhood, Viserys might not have subjected his sister to a cruel fate.\n\nFor all his love of Aegon, Varys sure didn't respect his father, mother and sister to save them. Read the passage where Varys declares his loyalty to Ageon to Kevan Lannister, If you don't find his love of Ageon suspicious, then I'm afraid you are blind my friend.", "label": 0}
{"text": "Fire And Blood is a finished book…", "label": 0}
{"text": "You think the actor actually had his mouth on the actress’s real breast? It’s acting, and not real.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I'm probably pretty similar, and this way with a few shows. It's something I can just have on in the background and if I miss anything while doing stuff around the house or with my toddler I can't just jump right back in.", "label": 0}
{"text": "If Martin's work was unfinished in the same way Tolkien's was, he'd have finished ASOIAF twenty years ago and since been writing stories and creating characters from everything inbetween the original Long Night 8.000 years before up to Robert's rebellion. Some of them would be more detailed than others, some of them might be slightly contradictory, and overall there probably wouldn't be much order to it until he finds his own Cristopher to bring it in a sensible form.\n\nTolkien's story is unfinished in the same way as world history is unfinished. Sure, if you had more time to work with it, you'd always find out new things, some things you thought were right would have to be corrected - but the overall big picture remains.\n\nMartin's story is like a literary version of Alexander's conquest. It's always going to be a \"what could have been\", even if the fragments that came out of it are successful on their own.", "label": 0}
{"text": "Lmao stop, not you saying \"what parent *doesn't* murder people 😒\" \n\nThis comment has me rolling", "label": 0}
{"text": "Puh-tire", "label": 0}
{"text": "Questionable?\n\nWhat was questionable?\n\nHim helping Dany and Viserys gain some traction with the quest back to the throne?\n\nLove has nothing to do with loyalty and especially if it result in things based on self interest.", "label": 0}
{"text": "I've probably watched it a similar number of times and I swear everytime I realise something new or get a different/new perspective on something. It's wild.", "label": 0}
{"text": "By the end of the series Sansa Stark was a mixture of Cersei and Littlefinger. She betrayed Jon by telling his secret to Tyrion and also she purposely held back that the knights of Vale are on their way and got Rickon killed in the process. She wanted power and nothing was going to stop her from her goals. She very smartly made sure all her opponents are out of the way. She would have had no problems in letting Jon die for her purposes, which she almost achieved during Battle of Bastards but it was her bad luck that only one of her brothers died.", "label": 0}
{"text": "Wow, you gotta be the 1 guy that only watches the final seasons. Most would say the exact opposite by watching until season 4 or 5. Respect, though. Enjoy what you enjoy.", "label": 0}
{"text": "You are going in circles instead of addressing my point. I have no interest in wasting my time with someone like that.", "label": 0}
{"text": "Everything is either the best show of all time or absolutely terrible garbage.", "label": 0}
{"text": "If George has no intention of finishing the books, he should just come out and fucking say it. He’s been stringing fans along for 13 years. Because honestly, it seems like he doesn’t want to finish the story. \n\nHBO is on its second ASOIAF with a third well on the way. And knowing how GOT ended, and how HOTD seems to be following that trajectory, I don’t have high hopes for the execution of A Knight of the 7 Kingdoms, at least beyond season one. And if AKOT7K does follow the trajectory of GOT and HOTD, odds are he’s going to be bitching about it rather than write TWOW. \n\nI say all this knowing George has written himself into a corner, but I’m blaming him for that as well. He knew how big the plot of these was getting, but did he adjust his writing style to accommodate it? Fuck no. He’s still trying to bring ideas to fruition that he planted in earlier parts of the story. Dude is worse than a pantser, and I’m saying this as a goddamn pantser. \n\nSo yeah. If George isn’t going to finish, he should just say so, and we can all move on to a series that’s actually finished. For me, it’s going to be The Dark Tower. Rant over.", "label": 0}
{"text": "I’m on my 3rd rewatch and it gets better every time. I love catching things that I may of missed or help me understand the story better.", "label": 0}
{"text": "What does that even mean 😭", "label": 0}
{"text": "That's fair", "label": 0}
{"text": "And they had potential!", "label": 0}
{"text": "Not really father.  Probably a good uncle who drops in now and then and teaches the kids how to kill.", "label": 0}
{"text": "No, he would not.", "label": 0}
{"text": "Kind of. Sandor is a complex character. He knows what he is, and what he is, is a man who loves to kill. He is disillusioned with Westerosi 'society', that is he doesn't think it is a society at all. Just a bunch of psychotic killers in fancy clothes and posh accents larping virtue.\n\n\nHe would probably be a decent father to a daughter. But to a son? His son would start killing, just as his father. And Sandor has killed a lot, even when it was not necessary.\n\n\nRioters in kings landing. Not speaking of the would be rapists. He kills at least one in the mob, when the shove and a slap with the sword could have been enough. He takes food from the inn, contributing to the deaths of two innocents. He steals a carriage, not knowing whether this will eventually lead to the death of the owner. And winter is just around the corner.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "HBO never does games for their immensely popular shows. So when GoT got hot, it probably never crossed their minds.\n\nBut there are a couple okay licensed got games. Like the tell tale one, and there’s a couple amazing mods in the crusader kings franchise", "label": 0}
{"text": "~ magic ~", "label": 0}
{"text": "I rewatch the final seasons sometimes. There are lots and lots and lots of great scenes.", "label": 0}
{"text": "Salt and bread to be specific.", "label": 0}
{"text": "Yippe ki Yo, Ghost Riders in the Sky", "label": 0}
{"text": "Margaery played a masterful game of chess. Cersei flipped the table when she saw she was losing.", "label": 0}
{"text": "HBO has paid him not to.", "label": 0}
{"text": "It is a valid interpretation of that conversation. Nonetheless, that's not what she is directly saying, hence why you interpret it. Many could have a different interpretation.\nAnd still, even with that interpretation it's completely false. She is not capable of taking care of herself if she faces Vhagar. Neither her nor her dragon are fighters, they would both die. And the whole point of Daemon saying that is because they are at war and she is the queen and most important person on her side. And most important of all, she should be leading her side at that time. Instead she's MIA and making herself and her side extremely vulnerable in that situation. \nThere's nothing clever about it in my opinion, Rhaenys is just playing Rhaenyra's advocate with empty words.", "label": 0}
{"text": "Spambot. \n\n- [User: UrLovelyEGirl](https://reddit.com/user/UrLovelyEGirl)\n- [User: UrCuteAngelxoxo](https://reddit.com/user/UrCuteAngelxoxo)\n- [User: UrxCurvyGF](https://reddit.com/user/UrxCurvyGF)\n- [User: CanBeBossy](https://reddit.com/user/CanBeBossy)\n- [User: UrLittleRainbowxoxo](https://reddit.com/user/UrLittleRainbowxoxo)\n- [User: UrPetitexEGirl](https://reddit.com/user/UrPetitexEGirl)\n- [User: UrLovelyEGirlxoxo](https://reddit.com/user/UrLovelyEGirlxoxo)\n- [User: UrCurvyKitty](https://reddit.com/user/UrCurvyKitty)\n- [User: UrSweetTeenGFx](https://reddit.com/user/UrSweetTeenGFx)\n- [User: xUrLittleAngel](https://reddit.com/user/xUrLittleAngel)\n- [User: UrCuteBbyxoxo](https://reddit.com/user/UrCuteBbyxoxo)\n- [User: xCurvyLadyBaby](https://reddit.com/user/xCurvyLadyBaby)\n- [User: sweeethoneybaby](https://reddit.com/user/sweeethoneybaby)\n- [User: cuteexlady](https://reddit.com/user/cuteexlady)\n- [User: Juicy-Barbie](https://reddit.com/user/Juicy-Barbie)\n- [User: SweetSexyxPrincess](https://reddit.com/user/SweetSexyxPrincess)\n- [User: CuteRoseex](https://reddit.com/user/CuteRoseex)\n- [User: CuteGabriela](https://reddit.com/user/CuteGabriela)\n- [User: sweetmantle](https://reddit.com/user/sweetmantle)\n- [User: littlecutiepiexxz](https://reddit.com/user/littlecutiepiexxz)", "label": 0}
{"text": "All of the people who seem to hate GOT after the show seem to talk about it on here an awful lot. This show is in my all time top 3 in its current form.", "label": 0}
{"text": "😂😂😂 I can only imagine the look on Aemond's face when he sees her diving on him", "label": 0}
{"text": "My theory is that rather than unwork a massive narrative knot and tie it back in a nice bow, like most of us he's turned his attention to other things.  In his case dozens of (lucrative or enjoyable) side projects, whether related to ASOIAF or not.  The other thing is he's aging and it gets harder to  concentrate.  And finally, he's a self-declared gardener, not a planner.  In other words, he's a perfectionist who seeds new sections of the garden while letting the old ones get weedy and overgrown.  He's lovingly seeded F&B and D&E, and left the main garden to fend for itself.", "label": 0}
{"text": "I could watch a whole spinoff with these 2. Great exchanges.", "label": 0}
{"text": "Maybe he just lost interest.\n\nMaybe there are too many characters whose storylines he has to wrap up so he thinks it is too much.\n\nMaybe he just enjoys making TV shows more at the moment while the metal is still hot so to speak. Even if he completes the books they won't make the last seasons.\n\nSo maybe once HOtD is done and things around GOT cool down a bit he might do it. :)", "label": 0}
{"text": ">HBO has paid him not to.\n\nHe wrote a blog post in response to that conspiracy theory when Ian McElhinney went around claiming it:\n\nhttps://georgerrmartin.com/notablog/2019/05/13/idiocy-on-the-internet/\n\n>It seems absurd to me that I need to state this. The world is round, the Earth revolves around the sun, water is wet… do I need to say that too? It boggles me that anyone would believe this story, even for an instant. It makes not a whit of sense. Why would I sit for years on completed novels? Why would my publishers — not just here in the US, but all around the world — ever consent to this? They make millions and millions of dollars every time a new Ice & Fire book comes out, as do I. Delaying makes no sense. Why would HBO want the books delayed? The books help create interest in the show, just as the show creates interest in the books.\n\n>So… no, the books are not done. HBO did not ask me to delay them. Nor did David & Dan. There is no “deal” to hold back on the books. I assure you, HBO and David & Dan would both have been thrilled and delighted if THE WINDS OF WINTER had been delivered and published four or five years ago… and NO ONE would have been more delighted than me.", "label": 0}
{"text": "Because he can't.\n\nFeast took 5 years. He realized he couldn't do the timeskip he wanted so it threw a wrench in his plans.\n\nSo he spent most of Feast and Dance introducing new characters and plotlines just so he'd have something to put out there because he couldn't continue the main chars the way he wants to. \n\nBut now, he's unable to get those added plotlines and characters to coalesce, so he's procrastinated by working on several other things, like Fire & Blood. And he started work on Blood & Fire despite promising it wouldn't start until after Winds.", "label": 0}
{"text": "Not enough to redeem the later seasons but these two are pretty cool.", "label": 0}
{"text": "[repost bot](https://www.reddit.com/r/gameofthrones/s/Drff1ywaAd). Mods, please increase the minimum karma to post here", "label": 0}
{"text": "I am around my 14th rewatch myself too! Cheers.", "label": 0}
{"text": "Fingers are tired from carrying those big bags of HBO money.\n\nJokes on him though if he’d finished and we had a season 8 that lived up to 1-7 quality he’d have twice - nay thrice as many bags.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, I think this is it. It’s much easier and much more fun to write new, fresh material as opposed to trying to fix tons of narrative knots upon knots from a decade+ prior. Not to mention the lack of pressure from doing the former rather than the latter. I honestly would likely do the same if I was him, sadly.", "label": 0}
{"text": "Ramsay the compassionate's death was pretty sad too.", "label": 0}
{"text": "[repost bot](https://www.reddit.com/r/gameofthrones/s/ukqQcBVfit)", "label": 0}
{"text": "I'd say season 3 was peak. Season 4 was worse than the first 3, then season 5 took a nosedive. Season 6 got a bit better, then 7 said \"nope\" and jumped off a cliff. Season 8 lives at the bottom of that cliff.", "label": 0}
{"text": "How different is the book from the show?", "label": 0}
{"text": "They robbed us of glorious visuals of Joffrey the Brave finishing off the night king!", "label": 0}
{"text": "My wife and I are going to Ireland. We will be in Belfast for Halloween. What time did you get done with the bus tour?", "label": 0}
{"text": "He’d be like Kratos. Toughening the kid in his own way. Loving him in his own way. Showing it in his own way.", "label": 0}
{"text": "Yay!  Soon you can join us complaining about the books not being finished!", "label": 0}
{"text": "Why couldn't he do the time skip he wanted? I don't really understand", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Well, you may as well pre-order your ticket for the unfinished book series hate train. We pass by the season 8 hate train every now and then and give a slow understanding nod to one another.", "label": 0}
{"text": "He wrote himself into a corner", "label": 0}
{"text": "Extremely similar, they differ in a couple aspects. The book is way more descriptive (sometimes in a good way, sometimes takes too long in it) and always shares the characters inner thoughts (always positive) while the show has a much bigger scope in the scenes, it doesn’t just follow one characters POV.\n\nThat would be the main difference IMO, each chapter follows a specific character’s mind and even the writing styles differ, Sansa initially is in a fairytale, Ned in the mind of a troubled and responsible man, Jon in a bitter, lost yet ambitious young man and Tyrion in a smart ass, cunning and analytical view. There are pros and cons to this, and given that the show is pretty much 1-1 with a couple things cut (like the 10 page description of climbing the Eerie [that’s what I meant with takes too long]) and a lot of scenes added (mostly from characters with no POV, like Robert and Jaime) I would say they are both equivalent.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Lol if it weren't for him...the little dove would have been dead.", "label": 0}
{"text": ">In hod the watch was well manned and prepared, and Lord Cregan Stark is very aware about the sleeping danger in the north. \n\nI disagree that we know they were well manned and prepared. It could very well be similar manpower issues as during Ned Stark's era.  We only saw one castle out of 19. \n\nNed was aware of the importance of the Night's Watch and from what we see, he was very supportive of them.  Benjen joined the Night's Watch and rose to first ranger. He encouraged Jon's wishes to join as well.  \"Starks have manned the wall for thousands of years. And you are a Stark.  You may not have my name, but you have my blood.\"", "label": 0}
{"text": "He's already made a lot of money and can't be bothered imo.", "label": 0}
{"text": "His army would kill everyone as he watches from afar. Without Bran he has no reason to get involved.", "label": 0}
{"text": "Same here, I've begun reading ACOK and so far it's excellent", "label": 0}
{"text": "\\- \"I got two hard rules I live by, Pop: I don't fuck with the devil, and I never do tag-teams with blood relatives. \n\nKenny Fucking Powers", "label": 0}
{"text": "This is genuinely the reason I haven't read them yet. They are probably worth it but not finishing something drives me nuts.", "label": 0}
{"text": "Don't bother. The books are never going to be finished.", "label": 0}
{"text": "While watching the series, I'd often ask myself, \"Okay, so how would I have avoided this happening to me?\" or \"How would I get out of this situation?\" My answer for this guy, is that if I had enough money to build that big, fancy vault, then I'd also have enough sense to build an escape switch on the inside.", "label": 0}
{"text": "Lol she killed Walder's sons, most of whom participated in the red wedding. She specifically didn't have any of the women eat the poison because they were innocent and she didn't even kill Walder's wife. The fact you think that is even remotely comparable to Daenerys purposefully mass killing women and children is hilarious.", "label": 0}
{"text": "He saw how much people hated the ending.", "label": 0}
{"text": "Say hi to Griff for me!", "label": 0}
{"text": "# The most noble child the gods ever put on this good earth", "label": 0}
{"text": "Oof, I feel sorry for your future wife having to deal with you getting all horny every time she needs to feed the child I hope to God you never have.", "label": 0}
{"text": "Season 1 really good. Season 2 really bad.", "label": 0}
{"text": "Get ready, cause the show is gonna piss you off.", "label": 0}
{"text": "I did this. I enjoyed most of the show and then received one of the books as a gift, so I got the rest and read them all. One thing I noticed more in the books than the show is the subtlety that Martin uses when it comes to magic. He does a good job of making magic feel like it’s truly seeping back into the world, not just being present all at once.", "label": 0}
{"text": "My favourite part of the audiobooks are the Lannister accents. To each his own", "label": 0}
{"text": "It still looks cool, and artists best be learning how to use this shit because it is not going anywhere and it's just gonna get better", "label": 0}
{"text": "I’ve been watching the entire series on repeat all of 2024, literally …. I can’t even tell you how many times I’ve seen each episode but as soon as season 8 ends I roll right back into season 1 episode 1 and start over.", "label": 0}
{"text": "I think he lost focus and interest in writing, so he's lost the inspiration for the story. \n\nWe know he had a falling out with D&D during GoT. We know he wanted to have reveals like Jon's parentage and Hodor in the book before the show, but he was taking too long, and the show wouldn't wait. I think the show got the broad strokes of the ending right (Dany breaking bad, Jon ending up North of the Wall, Bran as King, etc), but Martin was disappointed in how they executed it. And he saw the fan reactions and got disspirited. \n\nHe's lost the will to write the story, but he's still under contract to do so. It's become a chore he HAS to do rather than something he's really passionate about anymore.", "label": 0}
{"text": "Yeyyyy 🥳🥳🥳🥳🙌🏼🙌🏼", "label": 0}
{"text": "100% YES!! lol, GOT is on as ll day every day as background noise. I'll watch different shows/movies in between- I'll play video games & do outside activities too like a regular person. But when I'm at home relaxing or winding down after work, that shits constantly on. \n\nI hate how bad Rings of Power season 2 is. But I can't wait to binge the Stranger Things series finale & season 2 of Squid Games; I really hope they don't mess this one up. Just use the same formula as season 1- unknown talents & no censorship to cater to our western lunacy that's harming our creativity regarding all forms of media.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "What i find crazy is Martin knows he will make loads of money from WoW, so we must conclude that he is financially doing well and doesn't need to write the book. \n\nIf he doesn't need to write it, the only reason he would is because he wants to. He's already screwed the publisher 100 times with false completion dates, so he obviously doesn't care about that aspect.", "label": 0}
{"text": "Then stfu and don’t state it. Were you in the room? You see the contract? No, you weren’t.", "label": 0}
{"text": "RIP KING 🙏", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to the book side lmao\n\nThe first four seasons are pretty close adaptations, it’s Feast for Crows where things get different.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I started listening to the audiobooks. Just started clash of kings.", "label": 0}
{"text": ">Then stfu and don’t state it. Were you in the room? You see the contract? No, you weren’t.\n\nTf? 😒\n\nSomeone shit in your oatmeal this morning?  Why take this out on me?", "label": 0}
{"text": "No was reading them well before, still enjoyed seeing it onscreen. Books betterof course👍", "label": 0}
{"text": "😢", "label": 0}
{"text": "Dont speak of Joffrey the Gentle like that dude, what's wrong with you? Talking bad on the greatest king Westeros has ever seen, come on man, do better smh.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "That and he should have been given a big ole hammer.", "label": 0}
{"text": "Same bro i too just finished it watching for the first time and no doubt it made me go mad in live with this series. Don't know why season 8 got so much criticism just because the way things ended? Apart from that a true masterpiece", "label": 0}
{"text": "Not much for reading blogs or hearing podcasts, but thanks. Also unavoidable to see updates from it in this sub and HotD", "label": 0}
{"text": "Would he marry Dany to Rob to help repay for the unnecessary slaughter of her whole family? Or reveal  Jon.", "label": 0}
{"text": "I don't think Daemon's a good person, however he is my favorite character on House of the Dragon. I like coming up with creative BS ways to defend him, as a joke. Like \"It's his parents' fault for naming him Daemon. Of course he's going to act like that.\"", "label": 0}
{"text": "\"Mature and professional\" dude was 10 years old.", "label": 0}
{"text": "because they don't, can't craft any armor on the north of the wall and the night's watch and there was only one way for him to get a armor and that was by crafting that armor in winterfell butr he died in the battle of basterds", "label": 0}
{"text": "Or a tree trunk", "label": 0}
{"text": "It looks very cool, def has a style to it ,imo,  has a real tarot feel to me, keep working on it .... how about a Sansa next? She is so stunning in some shots... like right before her doomed wedding to Ramsay ..", "label": 0}
{"text": "I already read the books but because of the show and numerous re-watches I have forgotten a lot of books. And many of the characters that aren’t in the show.\n\nI’d say well worth reading. I started a reread and it almost feels like cheating when you stumble on stuff that wasn’t covered in the show. This goes for the later books in particular. The first novel, first season were quite similar. Then it gradually diverges with each book.", "label": 0}
{"text": "Omg haha I didn’t actually blur it out, whoever posted it first on the internet did. I didn’t even notice it until pointed out!", "label": 0}
{"text": "Amen my Brother", "label": 0}
{"text": "Yeah, I think you’re probably right", "label": 0}
{"text": "I wish there was a way to know you’re in the good old days before you’ve actually left them.", "label": 0}
{"text": "So essentially you want Lord of the Rings. Just say you want Lord of the Rings.", "label": 0}
{"text": "she’s cute", "label": 0}
{"text": "How was it??", "label": 0}
{"text": "Currently almost done with clash of kings and I'm already filled with excitement and dread because I know they're not finished", "label": 0}
{"text": "Its a real close second imo", "label": 0}
{"text": "I really doubt that", "label": 0}
{"text": "Thank you \nI may do one for sansa soon \nI already made Jaime Lannister too and I'll post it soon", "label": 0}
{"text": "Watched the show before reading the books. Wrapping up Dance with Dragons right now, and man… the disparity between the shows and books reallllly starts to show in season 5 of the show/book 4. I don’t hate the show for it, it’s still great. But the books are just insanely good", "label": 0}
{"text": "I like the scene where Arya was so curious to see Tyrion and constantly asking \" Where is the imp?\"", "label": 0}
{"text": "Wait til OP gets through book 3 😂", "label": 0}
{"text": "Sansa was so annoying when she was young. It makes me laugh whenever Arya annoys/ humbles her both in the show and books", "label": 0}
{"text": "I love how proud Maisie looks in that last picture", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "I beat his hair is greasier than Joffery's cunt!", "label": 0}
{"text": "im not sure about that.\n\nis he actually a nice guy deep inside, yes. but idk about fatherhood.", "label": 0}
{"text": "Yet another case of a parent refusing responsibility.", "label": 0}
{"text": "My question is : what he is doing with the time stone?", "label": 0}
{"text": "If you thought critically, you'd realise she learned how *not* to be like them. \n\nShe was at their mercy, she admired and learnt political lessons from them, but she didn't like them. She wanted away from King's Landing and just cared about the North. Yes she was distrusting and hard (who can blame her?), but her priority was never power for herself, it was restoring her family and the North. \n\nHer warning about Rickon was just the truth, she was right and ignoring it caused Jon to mess up - she came in clutch with the Knights of the Vale.  If she had told Jon about the Knights, he would've still ignored her and the Knights would've probably lost too. \n\nShe showed the *most* emotion when reuniting with each of her siblings. You'd have to be seriously daft to think she actually listened to Littlefinger and wanted them dead (she literally killed Littlefinger for trying to turn her against them, so obviously she didn't fall for it). She smiled when Jon was made King. Her 'fight' with Arya about supposedly betraying Jon ended with them playing LF and getting closer than ever.", "label": 0}
{"text": "I saw a fucking edit of Karl Tanner the other day and the comments were hyping him up. I nearly threw up", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "The Mountain, Meryn Trant, or Craster. If we talk major characters, Tywin commands or enables 2/3 of those people to do the things that make them horrible, so…", "label": 0}
{"text": "According to the show, Jon.\n\nIn many regards, I saw Dany as the antithesis to Jon. \n\nThe image parallel between Dany hoisted on the slaves' shoulders ('Mhysa', 3x10) and Jon gasping for air during the battle of the bastards (6x09) isn't a parallel, but a contrast. Though she's hailed as a people's queen and has done great things in slaver's bay, Dany is usually *above* her people. Jon in that scene is *with* his people, fighting and almost dying with them, and that's why they admire him. Dany is a 'saviour' of the downtrodden,  but Jon actually brings them together. He stands up for people like Sam and for the wildlings, not as their ruler but as one of them - he is a steward, and then lives amongst the wildlings. Dany never *lowers* herself enough for me to think her character is about unity.\n\nIn the scene where she meets Jon, she is introduced with her long list of titles on the throne above him, while Jon is 'this is Jon Snow. He's the King in the North'. She is bringing fire and blood to conquer Westeros, and is seen by the Westerosi lords as an invader with heathen armies. Jon is the one who brings the threat of the Night King to everyone and insists they band together and put aside their power struggles. In all regards, he is managing to do the uniting. \n\nAnd in season 8, Jon fulfils the prophecy of Azor Ahai by killing his beloved (Dany) and saving the world (from her). But I may be wrong about that because I don't know much about the books. Regardless, whether or not it was a *good* ending, I believe the ending does make out Jon to be the ptwp.", "label": 0}
{"text": "Being the big bully that Sandor is, he can’t respect subtle skill and grace (when looking at Aryas training in s4).\n\nForel is clearly talented as he shows by beating up the Lannister guards.\n\nI think he’d probably come unstuck against top tier opponents who are stronger than him but that’s no shame.", "label": 0}
{"text": "It’s obvious he got fired. And from the indie movie I saw him in, it was for the absolute best.", "label": 0}
{"text": "The greatest swordsman who ever lived didn't have a sword?", "label": 0}
{"text": "Olenna is an eternal mood 😂😂", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "When all the chaos started to unfold", "label": 0}
{"text": "Just started them myself! Unfortunately the narrator calls Petyr Baelish \"Pe-tar\"", "label": 0}
{"text": "all so young, innocent, and pure", "label": 0}
{"text": "It looks great to me.", "label": 0}
{"text": "Da-Gnar-ace too", "label": 0}
{"text": "Nah.  He was killed by a boy whore with a sword.", "label": 0}
{"text": "Well he was the first sword of Braavos and stopped the Lanister soldiers long enough with a wooden sword to let Arya run.", "label": 0}
{"text": "Shablagoo", "label": 0}
{"text": "Yes. Ned wouldn't have chosen a clown to train his daughter.\n\nI'm salty they cut this scene in the show but apparently Syrio kills the Lannisters guards with the wooden stick.", "label": 0}
{"text": "The fuck is a Melisandei? Melissandre and Missandei's hidden child? 😆", "label": 0}
{"text": "After so many years of working on the same project, he is probably burnt out and wants to write/be involved with the world he's created but not the same characters or the same war.", "label": 0}
{"text": "You’re going to want to slow down and really savor each book, possibly for many years….", "label": 0}
{"text": "I don't know if it's against nature or god but I can see wierd.", "label": 0}
{"text": "Ask the knight king", "label": 0}
{"text": "I have a hard time staying focused while reading so I’ve been listening to the audiobooks. I love it so far.", "label": 0}
{"text": "Neither of them started the war.\n\nJon Arynn was order to kill both of them by the king (They lived with Jon), he refused and started the rebellion. \n\nRobert and Ned went their separate ways to raise their bannermen and get more allies.", "label": 0}
{"text": "He’s a perfectionist who has no financial incentive to put out a book unless he is satisfied  with it", "label": 0}
{"text": "Even better when you get through the last book that's out and there's entire plotlines and major characters left out...", "label": 0}
{"text": "You’re literally the one sexualizing the child…", "label": 0}
{"text": "looks like the comments were removed by a moderator. you can still see them on their comment history.", "label": 0}
{"text": "He told D&B the ending he had planned, saw the visceral negative audience reaction to it and basically went to writing prequels so he can make more of the storyline match his intended ending.\n\nSpoiler:  we've already seen the ending and hated it", "label": 0}
{"text": "Omg they’re so cute", "label": 0}
{"text": "Well because he brought back freshly fallen warriors…", "label": 0}
{"text": "Way over blown. By that point the actress was 20 when filming was done.", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "I read all five on a frenzied binge. I wasn't prepared for the letdown afterward.\n\nI don't really expect more books, I'm just having a hard time finding something ELSE that I am this excited about reading.", "label": 0}
{"text": "Ooof, that was too real", "label": 0}
{"text": "Playing an 14-15 yr old.", "label": 0}
{"text": "Idc if its \"legal\" it was still a really fucking weird scene. Especially if you binge watched it and 2 weeks ago shes 11.", "label": 0}
{"text": "9 was beautifully directed, but a lot of the plot points were extremely cheese.", "label": 0}
{"text": "lol", "label": 0}
{"text": "I don’t know how you came to that conclusion but I’m proud you got there anyways", "label": 0}
{"text": "Wait what he say?", "label": 0}
{"text": "What if Ned never said \"winter is coming\" 🥺😭", "label": 0}
{"text": "That’s because you only watched it for le epic sward fights", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "As far as I remember, he had problems to balance \"nothing has happened in those years, I don't need to summarize anything\", and \"all this crazy stuff happened, but I'll only tell it in retrospect\" for some of the characters. Both are quite unsatisfying. So he decided to obviously, a lot of crazy stuff will happen and that he needs to talk about it while it happens.  \nBasically, he started off wrong for such a time skip and only realised when it was too late.", "label": 0}
{"text": "Didn't someone make this exact post a couple days ago", "label": 0}
{"text": "I’ll try to find that, thanks", "label": 0}
{"text": "Dear lord don’t binge modern family then or any show that has children and goes for 6 or more seasons", "label": 0}
{"text": "Not even that, it was yesterday. Dead internet theory in action.", "label": 0}
{"text": "Then they tried to up the game by challenging the reigning food fighting champions…. The Freys 😐", "label": 0}
{"text": "Why do you think Bran came all that way", "label": 0}
{"text": "I get sooooo confused between young Robb Stark and Jon Snow. IDK if it's just me but they looked so similar until Robb got his beard. \n\nWhich one is this? Robb or Jon?", "label": 0}
{"text": "There is a specific r/asoiafcirclejerk sub you want to post this in.", "label": 0}
{"text": "Robb", "label": 0}
{"text": "I haven't rewatched the entire series a lot, but during its TV run I did a binge of all previous seasons before the new one. It took more planning by the end to rewatch 7 seasons vs one or two when I first started", "label": 0}
{"text": "And pretty sure they let her decide how much she was willing to show.", "label": 0}
{"text": "Jesus Christ the bar is in hell", "label": 0}
{"text": "Do you think Bran ever spied on his own conception? I mean you'd be curious how it happened, right? And it's not like he hasn't seen his sister at it on her wedding night.", "label": 0}
{"text": "I want to but the fact that it's not finished is holding me back.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "At this point let’s set up a meeting with this toddler. If they can give us the last two books faster than George than I’ll take that deal lol", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Best pick would be Jon. But I think that characters such as Tyrion and Deanerys also play very major role in the series", "label": 0}
{"text": "Bryyeeen bro!😄 Roy crazy with that ish but he good for a lot of other aspects. I laught out loud with some of his noises.😆", "label": 0}
{"text": "Northern fashion sure changed a lot by the end. They were supposed to be dressed up for the king and are wearing lumpy wool things. Costume budget increased I guess.", "label": 0}
{"text": "he wont be a boy forever but he will be the most boring fictional character ever created", "label": 0}
{"text": "Not gonna put you to sleep. Im overdue for another read but ive re read the series in anticipation of each of the last 3 books and i kept hoping i coild do the same for the last one so i put it off.\n\nBut every time i read it i cant *go* to sleep. One more chapter. Wait i need to get back to so and so and find this out. Oh its almost 1 migjt as well read until 1. Hmm i gotta pee and get some water time out doesnt count. Well im gonna be tired for work either way now, whats another hour?", "label": 0}
{"text": "What a weird response.", "label": 0}
{"text": "> And finally, he's a self-declared gardener, not a planner. In other words, he's a perfectionist who seeds new sections of the garden while letting the old ones get weedy and overgrown.\n\n\nThere's one of those late night show like interviews that had both him and Stephen King. \n\n\nWhen King said he just wrote, and things worked out for him, Martin was at a loss. He genuinely asked King how to do that. He keeps saying he throws days of work in the trash and starts anew.\n\n\nHonestly, I think he wrote enough already for a complete Winds of Winter and A Dream of Spring. It was just writing the same story points multiple times and tossing them out because he didn't like them. \n\n\nAt some point he just gave up.", "label": 0}
{"text": "Dias de verão", "label": 0}
{"text": "Sending his headless corpses?", "label": 0}
{"text": "Possibly alive.", "label": 0}
{"text": "Your submission has been automatically removed because the title includes the spoiler \"Lyanna r.\" Please read the [Spoiler Guide](/r/gameofthrones/w/spoiler_guide) that explains how spoilers are moderated and how to provide warning for them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Fix? Who said I'm gonna fix anything?", "label": 0}
{"text": "Jump off the wall and splatter your brains on the stones below.", "label": 0}
{"text": "Attack on titan if you like anime", "label": 0}
{"text": "If you plan on murdering a person but miss your opportunity that doesn’t take away the fact that you planned to murder them lmao", "label": 0}
{"text": "100% sure I'm not acting like sadistic prick, I guess it will help with a lot of things including Tyrells (Tomen is still seen as easier to manipulate, so I'm not 100% safe from poisoning, but I don't think I know about that).", "label": 0}
{"text": "It’s because he’s the Mannis", "label": 0}
{"text": "Game of thrones is legit.", "label": 0}
{"text": "Im almost done with the 3rd book now.", "label": 0}
{"text": "Someone has been reading/watching Villainess stories", "label": 0}
{"text": "When boiling down everything that has happened with the books and d&d rushing to end the show.  The only person to blame at the end of the day js George.  Many years had passed since they caught up to the books before the end of the show and virtually no progress had been made on a new book being published.  D and d weren’t brought in because they were visionaries in their profession but because George thought they could best reimagine his book into film.  \n\nEveryone from the cast and crew to the studios made an investment with the belief that the story would be finished way before the show ended.  Not making excuses for how absolutely shitty the writing was at the end of the day but like let’s be objective.\n\nMy theory is that with how much GRRM was working behind the scenes of the show, he purposefully let the show tank so that if and when he does finish the story it would be compared to the shit show and be automatically reviewed in a good light.", "label": 0}
{"text": "I haven't noticed those comments.\n\nStannis should be ruling in the eyes of any westerosi.\n\nJoffrey is still too young.\n\nRenly is younger than him. \n\nNobody really believes in magic, so whatever Stannis is doing is not really common knowledge in westeros.\n\nNobody knows Dani exist.", "label": 0}
{"text": "This guy knows about marrying his daughter to France to secure that alliance", "label": 0}
{"text": "I was just turning 16 when they were halfway through the first season. Time flies, i guess.", "label": 0}
{"text": "Hey, I mistakenly marked this as spoiler. Can you please remove the spoiler tag? I'm not very familiar with Reddit so I did this. Thanks.", "label": 0}
{"text": "Stannis would NEVER compromise, especially not at the start of the series. The only way you convince him to let you live is beheading Jamie & Cersei, sending yourself and Tommen to the Nights Watch, and Myrcella to the Silent Sisters. Maybe also laying out a red carpet for him straight to the Iron Throne.", "label": 0}
{"text": "I’d first return Ned Stark’s remains to the Stark family, alongside the Stark children Sansa and Arya (if possible). I’d remove Cersei from the small council because she’s manipulative. I’d have Littlefinger exposed and executed. I’d keep Tyrion close as an adviser. I’d propose marriage to Daenerys. I’d pray her dragons could sense that I’m a new Joffrey and have good intentions because I’d need them for the war against the white walkers. If the marriage proposal is accepted, it would be early in her development so she wouldn’t be as bloodthirsty and would be eager to leave the savages. I’d use her dragons to make the North yield.", "label": 0}
{"text": "Really? First comment on the post is exactly my point and while I agree he is definitely the most viable pick early in the show, rumors about the red lady definitely grow later in the show when even his hand says that people talk about how she’s one whispering what to do in his ears. \n\nIdk if it happens in the books but i’m sure most  if not all viewers of the show turn against him after the burning of  his daughter", "label": 0}
{"text": "Great cast", "label": 0}
{"text": "I just binge watched the entirety of Malcolm in the Middle in a weekend and am really confused as to how a 12 year old is going to university because I'm an idiot who doesn't understand time.", "label": 0}
{"text": "When Kim and Kanye had one of their kids, they gave each friend and family member a different baby photo, so they knew who leaked it when it hit the media.\n\nClever af, so unfortunately, I have to give them credit where credit is due.", "label": 0}
{"text": "As if the Mannis would wed his only daughter to a usurper and a bastard", "label": 0}
{"text": "Attempt to put the head back on,  yell for a maester.  Blame everything on Pycell.   Marry Margeary", "label": 0}
{"text": "He is a man of duty, in the fullest sense of the word, who is neck deep in religious fanaticism to get him there, early on it’s not such a string pull on him and he barely believes much of what she preaches, but after the blackwater, at his lowest point in many many years, she shows him a vision in the flames, as he said, “how can you deny her power, and that her god is real, when it’s right there in your face, when you see it with your own eyes”. As things became more desperate for him, he relied more and more on the power of her god. He was a man of duty, but his honour was questionable, which means he was willing to do gain the throne which he saw as his duty by any means necessary. He was a warrior, a king, a man in a mission, and also a religious fanatic.", "label": 0}
{"text": "If you struggle to comprehend timelines that are not parallell to your own real time to the point that binge-watching creates this sort of problems for you, I suggest you either stop binge watching or figure out how time and fiction works.", "label": 0}
{"text": "Blame it faulty intel from someone like Littlefinger, proclaim a month of mourning, then take the body and head back to winterfell, where I marry Sansa. If that works to quell rebellion then social reforms to become beloved by the people.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Marrying Joffrey *Baratheon* or Tommen *Baratheon* to Shireen *Baratheon*. What a way to tell the world 'my family is cool with incest, when your rivals have a problem with you most likely being a product of, you guessed it, incest", "label": 0}
{"text": " Cersie is much better!", "label": 0}
{"text": "Yeah. He looses support. When he burns his daughter, he is already in total desperation, because there is no way he is taking over Winterfell. After burning his daughter even he relies that he needs to die.\n\nBut before that, even though people mistrust the red lady, I guess they decide to ignore her. Stannis has a good cause up until then.\n\nAlso I only know the show.", "label": 0}
{"text": "Isn't this just ordinary succession law? Robert died not having any legal heirs, thus the crown gets passed to his younger brother. Can't be Joffrey because he was not Robert's child, thus has no true claim to the throne. Renly does have a claim, but Stannis is older thus is higher on the line of succession. Daenarys only has a claim in the form of her (father?) having been king, but the current king is king by usurpation, thus Daenarys is further away in that line of succession, but they are second or third cousins (+/- one or two generations removed)\n\nGiven the circumstances we know as fact, Stannis is the true heir when observing a strict legal interpretation of succession law.", "label": 0}
{"text": "Procession through the North would be a dangerzone", "label": 0}
{"text": "A lot of the characters I start out not liking but they grow on me with their complexity, and growth. Stannis is the opposite. I like him less and less as time goes on.", "label": 0}
{"text": "Why would you fix what ain’t broken? They don’t call him Joffrey the Kind for no reason.", "label": 0}
{"text": "This is from the pilot too so they are really young.", "label": 0}
{"text": "Well, I don't think it's an obsession.  My respect for him solidified when he climbed the ladder at Kings Landing during Blackwater.  His code of behavior is fucked up but singular.  He's a beast in battle and took his lumps like a champ.  All the while, Joffrey cowering behind his mother's skirt so to speak.", "label": 0}
{"text": "First things first, treating the people of King’s Landing far better. Portraying myself as kind and just. \n\nSending Cersei back to Casterly Rock, and immediately. In time, I’ll be replacing Littlefinger and Varys. Placing them both in cells and appointing Tyrion and Olenna in their place. Doran Martell is invited to serve as Hand. \n\nI’ll still promise Myrcella to Dorne and subsequently marry Margaery. I’ll have Sansa betrothed to Tommen. Winning back her favor, or indeed, making peace with the Starks in general, is no longer possible, but I’ll do my best to control them. \n\nAssassins must be resumed in the effort to slay Daenerys. That is not negotiable. \n\nAfter the Karstarks abandon Robb, I will treat with them. Same with the Freys when Robb breaks his marriage pact. There will be no Red Wedding on my watch, but when Houses Stark and Tully are defeated, we may well need new Houses to govern their Kingdoms. \n\nStannis and Renly can easily be assassinated, I’ll leave Varys to take care of that before I replace him. Renly will be handled by Stannis anyway. I’d also target the Red Woman if at all possible, but spare Davos Seaworth. He could be useful. \n\nEuron Greyjoy could be another problem. Yara is intelligent, she can be reasoned with. Euron is just a dangerous fool. So when the time comes, I will offer Yara my support against her uncle, without offering independence. \n\nAssuming all the enemies can be defeated peacefully, and I’ve dealt with the corruption in the city, and shown Olenna that Sansa is wrong about me, the final problem is the White Walkers. But, assuming Daenerys has been slain, the Wall will never fall. I will treat with the North and The Night’s Watch to discuss the issue if they wish it, but it is unlikely to be a problem.", "label": 0}
{"text": "Yes this is correct, but my question is more about the fan cult of Stannis the Mannis more than why he should take the iron throne after Rob’s death.", "label": 0}
{"text": "I still want a different ending for the TV series. Why do they have to vote for who will be the next king? Monarchy gone wrong. If im the show runners, Daenerys will not die in the hands of Jon Snow. I'm still waiting for Ser George R R Martin to give me an ending that's not as cringy as the TV show.", "label": 0}
{"text": "Not be a cunt", "label": 0}
{"text": "Damn bro you should be king for picking shireen over Margaery.", "label": 0}
{"text": "Easy. Send Ned to the wall, he will stay there bc he is honorable. Marry Sansa, and marry Tommen to Margery. And, of course, stop being evil.", "label": 0}
{"text": "Most people are just answering in a way that they only could if they knew way more than Joffrey ever did (understandable, we all watched the show)\n\nBut those answers are just a little boring, imo", "label": 0}
{"text": "Neds already dead fam", "label": 0}
{"text": "Maybe they’d at least use a less painful poison.", "label": 0}
{"text": "Don’t judge me lol Robb was my fave character", "label": 0}
{"text": "Marry margery when posssible, have my brother marry Sansa when possible, have my sister betrothed to tyrstane( I can't remember his name all too much. Try to patch the relationship with dorne by offering lorch immediately and the mountain after the ear discreetly.  I'd have the wildfire prepared for the inevitable siege, have tyrion shore up defenses, start forging and hunting in the Kingswood. Probably some more things I'm missing", "label": 0}
{"text": "I stand corrected ;)", "label": 0}
{"text": "As Lord Eddard Stark said to Varys \"Stannis Baratheon is Robert's true heir. The throne is his by rights.\"", "label": 0}
{"text": "Stannis the MANNIS", "label": 0}
{"text": "Jump out the window like my brother.", "label": 0}
{"text": "Ya, I’m pretty sure that the bastard son of the guy who stabbed her dad isn’t on her potential husband list. Any plan that doesn’t involve either killing her dragons as babies or killing her isn’t a plan which I would to well in. \n\nSure, nobody wants to hurt the dragons, but the harshest plans require the strongest will and sometimes kings need to make these types of calls.", "label": 0}
{"text": "Nah you shouldn’t get downvotes. Lena did an amazing job playing cersei. I can’t imagine GOT without her lol", "label": 0}
{"text": "0 chance Daenerys accepts. Why would she? She believes that she is the rightful queen. She has the strongest weapons in the world. Literally 0 reason to accept.", "label": 0}
{"text": "Fcuk Stannis", "label": 0}
{"text": "Don't be a dick to Sansa! Don't show her her Dad's head on a pike, for Pete's sake! Make your uncle Tyrion your best friend, and in the name of all that is decent, do whatever your grandfather/Hand recommends!", "label": 0}
{"text": "She can be my queen :\\*", "label": 0}
{"text": "I would first say \"poor communication kills\". When I told Ser Ilyn to bring me his head, I meant bring him here to talk. Then just do the inverse of all the shit he does, and you are fine.", "label": 0}
{"text": "STANNIS THE MOTHERFUCKING MANNIS, RAAAAAHHHHHH!!", "label": 0}
{"text": "IMMEDIATELY send all viable knights/army to Winterfell to kill Rob before he can organize forces", "label": 0}
{"text": "I think it’s important to establish the political situation first the reach is pretty much already in the hands of renly along with the stormlands they are gone, the eryie is run by lysa it’s gone, the north and the riverlands are on robs side and dorne hates the Lannisters. \n\n\nThere’s no alliance forming with the reach cause they are team renly at this point and want their daughter to be a queen\n\n\nFirst things first hiring a legion of sellswords and telling them to land in the north and have fun. The riverlands forces were bogged down and couldn’t really help Robb cause of the raiding by the mountain and westerlands. So do the same in the north. At the very least it applies pressure to the north leadership and in war even the tiniest bit of pressure on ur enemies help. At best it forces the northern forces to fall back to the north and deal with the problem. Allowing the riverlands to be picked off and mopped up by Tywin and locking the north in their own lands at the neck. \n\n\nTell Varys to send spies into the reach and storm land to keep ties on renly and possible drop the knowledge that renly and Loras are lovers(a open secret it is, but open secrets turn lethal when they are no longer secrets) and to keep tabs on any issues in that alliance or weak points to exploit \n\n\nNext setup a plan to muster crow lands forces and immediately attack Stannis cause at that point before renly death he only had roughly around a few thousand (it’s estimated about 5 thousand of dragon stone vassals) the crownlands can musters a good size army (at least 10-22,000 soldiers) a immediate attack on Stannis who is the second most battle hardened commander in the entire war  keeping him at least bogged down is the best move cause 5,000 isn’t a lot but in the right hands can be dangerous as 10,000 \n\n\nNext up try and  round up the stark girls to leverage as peace arrangements while also attempting to broker a deal with the iron islands to slice up the north for them if they support the crown and offer to marry Theon into the royal family. The north is big asf and with them being in open rebellion few ppl would see a issue with them  loosing land this would be after a few months of the north being ravaged by sellswords and the ironborn and the riverlands are put back in place and the Tully’s taken hostage.  Forcing the starks to sign a peace deal that’s on my side and keep a stark as hostage and a Tully as well. And for them  them to attack their eyrie to prove their loyalty \n\n\nAfter that we are left with renly for this it tricky.  I would offer to break my betrothal to  Sansa on grounds that her father is traitor and her family started a war. And marry Margery, this very tricky cause the reach is a coin flip. they joined renly cause of the relationship with Loras, but the minute renly was dead the allied with the Lannisters and married Margery off again. The tricky part is that  depended on Stannis being the one who assassinated  renly. With all that being said I’m gonna have assassination attempt on renly and try to marry Margery should it succeed.  If they say no after renly death we are still at war with them. So nothing to lose a lot to gain \n\nHowever should the assassins succeed and with Stannis stuck on dragon stone the stormlands are mine or tommans by right so i  would try to get the storm lands to swear fealty to me or tomman (i mean that’s really their only options) then after that giving me three armies of at least 10,000 men \nRough guess (according to google) would give the crown 108,000 men (22,000-crownlands, 40,000-the stormlands, 56,000- the westerlands)", "label": 0}
{"text": "Doran Martell who blames Joffreys family for the death of his sister", "label": 0}
{"text": "I had a gigantic grin on my face the whole time. Probably the best scene I’ve ever seen in television.", "label": 0}
{"text": "the funniest thing that could happen here would being killed by a boar", "label": 0}
{"text": "whathefuck.gif", "label": 0}
{"text": "Any? I don't think there would be a war if everyone was on the same page. ", "label": 0}
{"text": "That does not a character make. ", "label": 0}
{"text": "Absolutely flabbergasted", "label": 0}
{"text": "The question is not how the Night's Watch declined. The question is how on Earth it survived for so long\nThe First Long Night was 8000 years ago. In real life that's before farming was invented on Earth. In practice any memory of the White Walkers would have disappeared in a few hundred years. After that the Watch is basically a border defense legion. Throughout history, it was incredibly hard to keep such militarized border armies within control. Roman frontier legions were notorious for proclaiming Emperors or rebelling otherwise. This is despite these armies being paid very well in coin, land and honors after retirement. The NW members get no pay or retirement, no lands and titles and give up all claims to their actual or hypothetical titles and claims. Roman armies were volunteers not criminals sent from the black cells. In conclusion, compared to real frontier armies the NW has no motivation to stay at it's position other than honor and much more incentive to go AWOL and much more opportunity as well given the self governing Status of the Watch and access to ships and a port.\nTo make it all worse, the Watch has been failing at it's main job for the last few hundred years which is to keep out Wilding raiders. Raiders who have managed to turn vast swathes of the Gift land desolate. It's a total miracle the Watch has not collapsed centuries ago.\nIt would be funny to see a story in which Jon desperately flees from the Wildings to warn the Watch of Mance Raydar's invading army to find that after Ned Stark got beheaded and Rob Stark got betrayed at the Red Wedding the vast majority of the Watch saw an opportunity to flee the North and took it and only Sam, Edd, Allison Thorne and Maester Aemon are left", "label": 0}
{"text": "But she does it anyways, due to being God’s Favourite Little Princess and all. \n\nNot someone you can work into your plans unless your plans are to do whatever she says and then you’ll probably get set on fire anyways.", "label": 0}
{"text": "Roman frontier armies were notorious for revolting over pay, bad command or simply to proclaim their own Emperor and they got regular pay and were assured of a good pension on retirement in the form of coin or land.\nMen of the Watch get literally none of that and have to face off Ice Monsters and hordes of Wildling raiders and so many are either criminals or smallfolk who hunted illegally while starving (poaching). To make it all worse, the Watch elects it's own leaders and so there's got to be a strong temptation to elect a criminal type who promises to lead them away from the Wall", "label": 0}
{"text": "Wanked for hours after", "label": 0}
{"text": "Per the prompt in the King. Tywin can suck it.", "label": 0}
{"text": "If I’m Joffrey the  I deserve a painful death and will happily accept it, under the condition that I can watch in the mirror as I painfully suffer to feel the enjoyment of watching Joffrey (aka me) die.", "label": 0}
{"text": "The people I’m sending away cannot be trusted, especially Cersei. She may think she’s loyal but that doesn’t stop her from being a major liability.", "label": 0}
{"text": "Because Tyrian killed him because he was accused of killing Geoffrey, who was killed by the Tyrells for being a cunt. Don't be a cunt and Tywin wins.", "label": 0}
{"text": "Yes, but if Joffrey hadn’t been poisoned Tywin wouldn’t have been killed in Tyrion’s midnight stroll", "label": 0}
{"text": "It's just a rhyming joke.", "label": 0}
{"text": "Eh, I can agree with much of this but the thing that strikes me as off is the getting rid of Varys. Seems like a very dangerous thing to do, as long as your reforming yourself and not treating the common people like dicks your fine and so Is he.", "label": 0}
{"text": "10 things I’d do first:\n\n1. Marry Sansa to Tommen immediately. I need to undermine support in the North. Tommen is a child and so is Sansa. They can go through puberty together. The only reason to wait for Sansa to “bleed” is to ensure creating of an heir. I don’t care if Tommen has an heir. I need a wolf in the fold but retain my hand for the best future political match.\n2. Reach out to high lords in the North. Send them transcripts and eye witness accounts of Ned’s public confession. Establish that the beheading was both legal and just. Inform the northern lords  that there’s an opportunity for a power restructuring in the North if the Stark family doesn’t accept terms. I don’t need to turn them against the Starks. I just need to weaken their resolve. \n3. Use spies, Maesters, Septuns, and household staff to spread rumors that Ned may have been poisoned or ill from infection. If he wasn’t intentionally treasonous then he was at least unintentionally treasonous. If none of the Starks household remain alive to bribe or threaten then I’ll hire someone to pretend to be them. The goal is to cast doubt. “Lord Eddard was an honorable man but he was out of his wits with fever. What was the young king to do?” \n4. Reach out for alliances and trading partnerships to near by foreign countries. The North and everyone else needs to see that the Reign of Joffrey Baratheon will be a profitable and stable one. \n5. Send out Tyrion with a band of small performers and musicians to reenact the story of Ned going mad with fever and attacking his best friend’s son and heir. Give out bread, pickled eggs, dried fruits and ales at the events. \n6. Offer Walder Frey a seat on the small council with a fancy title if he keeps the northern forces on their side of the bridge and assists in negotiations which will happen under his roof. He can give the seat to someone else from his household if he wishes. \n7. Send a ship to the Nights Watch with an emissary. I’ll agree to change the conditions of the oath so that after 5 years of honorable service they can marry, and after 15 years of honorable service they can retire with a full royal pardon and pension based on their rank at retirement. In retirement they will still forever be Nights Watch, they can be called back into service in emergencies, but they will not be active members and don’t have to stay at the wall. I’ll also agree to increase food fashions, pelts and furs, and send engineers to assist with improving conditions. There will also be a villa reserved in the south for elderly and disabled Crows. They served at the Wall as brothers in the cold. They can end their days as brothers in warmth and comfort. The caveat is that they now answer to the crown and assist in internal defense as well as guarding the wall. Meaning the Starks now have multiple flanks to guard. \n8. Ballon Greyjoy wants to pay the iron price. I want to cut off the Starks. Hire Iron born captains as privateers. There will be a bounty on any ships loyal to the Starks. If they capture a ship from a Stark port they keep the ship and its cargo and they get a bonus from the crown. Same with sacking Stark loyalist port cities. They can pay the iron price, then they get a little gold on top. This will wreaking the ability of the Starks to get support and it will keep fighting men occupied defending ports and ships. \n9. Sue for peace immediately, publicly and every 7 days thereafter. Read the proclamations of peace in court flanked by Septuns and maesters. Ensure the heads of all major families, or suitable representative/hostage, are in attendance for each reading. Make it clear war is not my goal. But the kingdoms stand united. \n10. Buy some land in Qarth. It looks really nice there. Preferably next to the Spice King. Learn how to pronounce his full name. Figure out some ways to get merchandise flowing. Figure out some ways to get more money into his pockets. Stimulate the economy. Get things booming. Make hay while the sun shines. After all winter is coming.", "label": 0}
{"text": "Show or book, get rid of Varys either way. Stop being a sadist. Give up Jaime to the North and marry Sansa to Tyrion.", "label": 0}
{"text": "I was horrified and 100% traumatized. I stopped watching the show for a few weeks after seeing how Robb and Catelyn died. I still can't get the image of Grey Wind's head sewn onto Robb's headless body and being paraded around out of my head.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Well there was Highgarden.", "label": 0}
{"text": "Hodor", "label": 0}
{"text": "With this kinda f up, I feel you need to take that risk.", "label": 0}
{"text": "He so had it coming. No sympathy here.", "label": 0}
{"text": "The dragons were born at the s1 finale, which is the episode that picks up directly after Ned was killed. \n\nShe's a Targaryen, she knows how big dragons get and how powerful they are.", "label": 0}
{"text": "Sandor Clegane is the best person in Westeros.", "label": 0}
{"text": "I'm sure Jon meant it as a joke. But haven't you ever seen any sword fights? You can use the side of the blade to defend and also to slice across someone's neck .... there are other ways to use a sword beside just stabbing.", "label": 0}
{"text": "Easier to get back on the good graces of the Starks by handing them Littlefinger who is the one who gave the wrong info. \n\nCersei marries Ser Loras, Jamie wedded to Yara. Tyrion and Varys become the small council and Brann becomes the Hand. Tommen gets Maergery. \n\nRobb becomes the General of the armies and Lannister, Tyrell and Stark armies and the Iron Fleet destroy Stannis and Renling. \n\nMaester pycelle, Qyburn and Ramsay are put in one cell with a spoon. \n\nJust Arya to marry the viper and have them deal with the dragon girls.", "label": 0}
{"text": "Medic !!! Medic!!!", "label": 0}
{"text": "Username numbers checks out. Weird & sick mentality", "label": 0}
{"text": "Dragonstone certainly a tough nut to crack, when Stannis went north he left 200 men there, yet Loras lost 5x that when he assaulted the island", "label": 0}
{"text": "Send Sansa home, relinquish the crown to Tommen, befriend my uncle Tyrion the Hand, convince him to give the office to someone else, take as much Lannister gold as we can, and set sail to Essos where we’ll enjoy the rest of our lives in the brothels and whatever else comes our way.", "label": 0}
{"text": "Loved it when the usurper got what was coming", "label": 0}
{"text": "If there was no Ser Davos, no one would admire Stannis.\n\n I really think that Ser Davos is the key to whatever people see in Stannis that they like. \n\nSer Davos is so likable that we end up seeing Stannis through Davos' eyes. Even the \"one true king\" line is delivered by Davos. \n\nStannis himself is so... ugh... if he were a mental illness, he would be severe anxiety, the kind that eats itself.", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*", "label": 0}
{"text": "Not be gay", "label": 0}
{"text": "Ignoring Ned and staging a coup in Kings Landing.", "label": 0}
{"text": "Lady stone heart 😂", "label": 0}
{"text": "Well, I’m king. So, I’m the top. \n\nLora’s can just deal with that.", "label": 0}
{"text": "Was so happy when Walder got his revenge. Well deserved after being disrespected by that Stark boy.", "label": 0}
{"text": "tried this out and literally thought I was Tyrion sitting there lol.", "label": 0}
{"text": "Agree but he should have married Sansa and crowned her right away to appease the North. Then let her go back to Winterfell with her sister and Ned’s body.\n\nDany was never going to consider him, so he’d have to offer a proxy or send an actually effective assassin.", "label": 0}
{"text": "Not get merked by a shadow", "label": 0}
{"text": "Margaery", "label": 0}
{"text": "That would also be a great addition. It would have potential", "label": 0}
{"text": "Smart!", "label": 0}
{"text": "Renley being gay with a queen as beautiful as Margery made even less sense than Arya killing the Night King.", "label": 0}
{"text": "*checks sub* \n\nHe’s way better in the books. I’m a huge Stannis fan, but it’s pretty objective that he would be a shit king. He’s a *phenomenal* character. \n\nNotice all the people talking about how he’s a man of duty and honor? Most of that is bullshit. He’s actually stuck in the mind of a teenage boy who lost all semblance of love in his life. He’s completely and utterly warped by the lack of love. \n\nHe’s going to burn everything in his life to the ground, and he knows it.", "label": 0}
{"text": "I came (literally) to say this.", "label": 0}
{"text": "Plead insanity, abdicate my crown, declare renly the king in my stead and beg him to let me live the rest of my life in casterly rock.", "label": 0}
{"text": "Support my brothers rightful claim to the throne", "label": 0}
{"text": "Yep it just needs to keep locked in place a weapon is no use if it can’t leave its case", "label": 0}
{"text": "Plow Margaery.", "label": 0}
{"text": "Are they going to carry around Danaery’s dead corpse or something?", "label": 0}
{"text": "Margarey… other than that he got Dues Ex Machinaed", "label": 0}
{"text": "I don't, because it's all a story, I am but a part in it. I know my part. Mommy is calling, imp, please save my city.....", "label": 0}
{"text": "Send Ned's body back with Sansa and Littlefinger's head with an apology and blame Little for the whole thing.\n\nMake Tywin hand and get him to fix everything. Suck up to him by treating him as the font of all wisdom for an aspiring ruler. Tywin is *not* easy to manipulate by any means but he has a soft spot for family, is an arrogant fuck and frankly his biggest issue with Joffery is his stupidity and refusal to listen to Tywin. \n\nHaving brought Tywin on side, launch a charm offensive on the Small Folk and bring them on side through well-publicised acts of generosity and nobility of spirit. After all, am I not Joffery the Kind?\n\nGet Tywin's support to sideline Cersei, because she's an alcoholic snake.\n\nMarry Maergery and don't get poisoned because I'm not a sadistic little shit. Make nice with Olenna.\n\nBring Tyrion into the Council to replace Littlefinger. Treat with respect. Smooth relations between him and Tywin.", "label": 0}
{"text": "Seriously! He was going to name him as his heir!", "label": 0}
{"text": "I'll use my men and take Joffrey and the queen under house arrest without a moments delay, then ask Ned and the Reach for their support.\n\nMind you i don't believe in ghosts so there is a good chance i'd be stabbed too.", "label": 0}
{"text": "His best moment will always be\n\n''I freed my brother... and you slaughtered a city.'' ...HOTK pin drop!", "label": 0}
{"text": "This should be the top answer...", "label": 0}
{"text": "Wait isn't that why there was a conflict between them", "label": 0}
{"text": "Consummating my marriage with Margerie", "label": 0}
{"text": "Pretend i'd have some sort of religious vision, send Sansa home with her fathers body, appoint Renly as regent, abdicate and submit myself to the future kings justice.", "label": 0}
{"text": "Came here to say same thing. 100%", "label": 0}
{"text": "I'd do my duty by doing Margaery. \n\nShe knew he was gay, she just wanted an heir, then she would have let him live his life how he wanted. \n\nMy comment is based on the cultural reality of Westeros as written, not a reflection on my personal beliefs and modern sensibilities.", "label": 0}
{"text": "I just realised \nGuess ep 5 took that much of a toll that I forgot the eps", "label": 0}
{"text": "I’d support Stannis as he’s the rightful ruler. And I would have definitely put a kid in Margery lol", "label": 0}
{"text": "Lannisters, yes. But, no one liked Stannis. At that point, I’m guessing Ned’s likely to say, “fuck it, Joffrey’s a bastard, I’m sworn to Robert and thus Renly.”  \n\nThe Tully’s will follow the Starks bc of Cat. The North will rally behind the Starks. Walder and Roose see the writing onntje wall and fall in line. The Tyrells support Renly bc of Margeary. The North and Renly’s forces can basically squeeze the Lannisters at Castlery Rock. And if nothing else, they hold Cersai, Jaime and Joffrey -if they aren’t killed in the coup hostage.", "label": 0}
{"text": "Understandable for me its a close second", "label": 0}
{"text": "Oopsie", "label": 0}
{"text": "Stannis would have been a fair if unyielding king. But, fuck him forever for what he did to Shireen.", "label": 0}
{"text": "I would push for Stannis’s claim and side with Ned.  Secure alliance by marrying Maergery anyways.  This way, when Stannis dies - I become King (I’ll push for my succession over Shireen)\n\nAlong with that, push for a potential marriage between Loras and Shireen.  Loras won’t push for Shireen since he’ll want to keep packing with me.\n\nThis way - the bond between the two houses is strong and creates a united front against the Lannisters.  \n\nStarks would behind me since Ned would support a Baratheon claim, and by default the Tullys as well.", "label": 0}
{"text": "😂", "label": 0}
{"text": "What’s a war hero got to do to get some lubrication round here? (assuming you’re quoting Death of Stalin).", "label": 0}
