{"text": "Listen here you differently abled bad faith argument of a person, I don't believe you actually know how to read.   You can tell because you aren't reading anything I've written.   That is why you've gone from \"abrahamic religion\" to \"all religion\" to badgering me for not taking you seriously.   Either get in the conversation or get out of the conversation, don't send pithy remarks just to annoy people like some sort of petulant child.", "label": 1}
{"text": "Yeah it was just nonstop “YOU DUMB FUCKING BITCH HOW DO YOU EVEN KNOW HOW TO PLAY THIS GAME STUPID CUNT AM I MAKING YOUR PUSSY WET LOLOLOLOLOLHAHAHAHAHAHA”\n\nI’m sorry but that is not enjoyable and muting wasn’t a reasonable solution when the entire lobby was like this every single time you were in one. I actually enjoyed talking with other players when I didn’t have to deal with people who were massively overestimating how funny they were.", "label": 1}
{"text": "It all started when a little company called Bethesda sold a $3 CD with horse armor…", "label": 1}
{"text": " Nice! You nailed the cosplay look! Keep it up.", "label": 1}
{"text": "What’s the matter bacon bits? Wake up on the wrong side of your mother this morning?", "label": 1}
{"text": "I understand your frustration with the prevailing ethos of maximizing profit at the expense of ethical considerations. It reflects a myopic interpretation of capitalism, where financial gain is valorized over social equity and human dignity. This reductive perspective can lead to the commodification of not only goods but also people, eroding empathy and compassion in the process. The assumption that this is the \"natural order\" disregards the possibility of more equitable and sustainable economic systems. Challenging such paradigms requires a concerted effort to prioritize societal welfare over mere profitabili", "label": 1}
{"text": "Your observation about Blizzard's trajectory post-merger with Activision is quite astute. The integration undoubtedly marked a significant pivot in their business model, emphasizing monetization through in-game purchases and premium services. This shift reflects a broader trend within the gaming industry, where revenue generation increasingly supersedes the intrinsic value of gameplay and community engagement. Consequently, this has fostered a somewhat disheartening environment for players who cherish authentic experiences over commodified offerings. Ultimately, it raises pertinent questions about the future direction of game development and the ethical implications of such profit-driven strategies.", "label": 1}
{"text": "Your perspective on the pricing of digital items, particularly the $90 mount, is quite thought-provoking. While it may initially seem exorbitant, the value proposition can shift significantly when considering the extensive time investment and commitment players dedicate to games like World of Warcraft. This illustrates the complex interplay between convenience and cost, as many players may perceive the purchase as justifiable if it enhances their overall experience. Moreover, the willingness to spend on such items underscores a broader societal trend where digital convenience is increasingly recognized as a legitimate component of gaming culture. Ultimately, it invites a deeper conversation about the evolving nature of value in the digital marketplace and the role of consumer choice within it.", "label": 1}
{"text": "BECAUSE A FUCK TON OF PEOPLE (morons) ACTUALLY BOUGHT IT", "label": 1}
{"text": "Have you tried not being a cum dumpster?", "label": 1}
{"text": "Idk what yall are talking about, people getting DDOS’d especially in league play was extremely common back then", "label": 1}
{"text": "For sure.  \n\nI don't dispute that Valve has some say in the prices of items.   (And a vested interest in keeping prices high, but not *too* high.)\n\nBut, the price difference between a Gamma Doppler Karambit, and a Damascus Steel Flip Knife is enormous in spite of their similar rarity.  Those differences in price have been driven purely by demand; more people think the Karambit is cooler, so it's more pricey.", "label": 1}
{"text": "In unity, yea it is super easy to create a line from an object to the environment for aiming and render the camera separately. I have worked with Unity before. VR games are already rendering two cameras for the 3d effect. A cheap port to VR where that is all you do and ship it is about as cheap as you can get.", "label": 1}
{"text": "Why don't you just go hangout on /pol if you want to call 16 year old kids a fa*got, Ni*ger or tr*nny? You all yearn for this disgusting, toxic environment that still exists many places....\n\nYou're cringe as fuck for wanting that but hey, different strokes I guess. It's also extra weird that you want a game marketed and designed for children to have an environment like that.", "label": 1}
{"text": "And they are seething because now they are alone, and muted while we're laughing in discord.\n\n\"Yo, come back you nword\", we ain't bitch! 😂 You'll have to deal with your father beating the dogshit out of you and muted loneliness online you racist fuck.", "label": 1}
{"text": "The Herman Miller CEO told her workers to work harder and sell more chairs and furniture before asking for Christmas bonuses in a very condescending manner, like she was talking to toddlers instead of employees.\n\nYet she gave herself a 6 million USD bonus for Christmas.", "label": 1}
{"text": "Honestly, that’s how \\*Assassin's Creed\\* felt for me after a while. At first, the mechanics and exploration were amazing, and I was hooked on the historical settings and the stealth gameplay. But as time went on, every game just felt like a checklist of the same activities—climb this tower, clear this camp, collect 100 feathers. It started feeling more like I was clocking in for work than escaping into a world. It's like they made the gameplay loop so repetitive that it became less of an adventure and more of a chore.", "label": 1}
{"text": "You sound like a prick", "label": 1}
{"text": "Why not?", "label": 1}
{"text": " Well, people just hyped abut it!", "label": 1}
{"text": " Good luck with your stream!", "label": 1}
{"text": "If you have a decent PC and own the game I highly recommend following [this guide](https://steamcommunity.com/sharedfiles/filedetails/?id=2538304660) to get it set up, you can essentially achieve the exact look and feel of the game as it was on PS2 but in Full HD or whatever resolution you have.\n\nI found this when I was just looking for an ultra-wide fix for the game, and it looks incredible in 21:9 but it crops the cutscenes.", "label": 1}
{"text": "Well would explain,  \"live service\"", "label": 1}
{"text": "🤖", "label": 1}
{"text": "We really just need to start killing these motherfuckers.", "label": 1}
{"text": "Yep, this sonys M.O. They milk the cows for all they're worth. Sony not only can't create anything original, they steal everything from others and people lap it up like thirsty dogs. It's pathetic ", "label": 1}
{"text": "If the grammar wasn't so terrible I'd assume this was written by AI.\n\n(You can thank me for the engagement my \"bullying\" will bring you later)", "label": 1}
{"text": "You are fine my friend, I can see you are pretty new to this site\n\nits mostly filled with mentally ill pathetic individuals, dont mind it", "label": 1}
{"text": "This is so cool!", "label": 1}
{"text": "Ah, the Mario Kart 64 days—where friendships were made or broken on Rainbow Road! There was always that one controller with the loose joystick or the sticky button, and somehow it always ended up as the “loser’s” controller. Those battles over who got which character or track choice were epic, and looking back, it’s funny how intense it all felt. I miss those simpler times too, when the biggest drama was who hit you with the blue shell right before the finish line. Sometimes I wish we could go back, just for a day, to that carefree world of N64 tournaments and endless laughs.", "label": 1}
{"text": "Many devs support this Initiative. Game developers that do support this include Running with Scissors, Totally Accurate Battle Simulator devs, the cookie clicker dev, and some developers of The Crew: More developers who support Stop Killing Games - Twitch\n\nAnd some developers are part of the Initiative:✂️ Game & software developers are part of and support Stop Killing Games - YouTube", "label": 1}
{"text": "? We already knew 6v6 as a test was coming back lol. I’m talking about permanently. It’s never coming back. How do you not realize this?", "label": 1}
{"text": "Well, at least you can’t judge my dance moves based on my skin tone!", "label": 1}
{"text": "Classic! It’s like stepping back in time. Some things never change, huh? You can always count on CoD for a trip down memory lane—minus the nostalgia!", "label": 1}
{"text": "I want this", "label": 1}
{"text": "It's not pay to win but pay to convenience. It has vendors and trainers attached to it. ", "label": 1}
{"text": "Me! I'm the market!  $10 for remaster of HZD **_and_** The Frozen Wilds DLC? Sign me the fuck up.", "label": 1}
{"text": "Wow, that’s a brilliant perspective! It’s incredible how the value of art evolves over time, transforming from mere product to cherished legacy!", "label": 1}
{"text": "There’s something magical about revisiting the classics—it's like a time capsule of joy!", "label": 1}
{"text": "You're in luck because they've added a solo mode for dungeons and a story mode for raids.", "label": 1}
{"text": "This thread is illiteracy personified. Yall need to go back to first grade English Holy shit", "label": 1}
{"text": "This is a one love game", "label": 1}
{"text": "not big into Retro gaming so I wouldn't recommend any. If I had to say which games I played when I was young that a young person interested in retro gaming would enjoy, I would say Duke Nukem 3D, Commander Keen, Heretic, DOOM", "label": 1}
{"text": "You all live on a different fucking planet. Who gives a shit about this? I’m a CE raider and 3.2k io M+ score every season. I have never once interacted with the shop or spent a dime other than my subscription. People crying P2W or how this “breaks” the game are fucking losers. The shop has never ever affected the integrity of the game and if you feel like you’re under achieving, it’s because you’re bad at the game. The boogeyman in game shop isn’t to blame for your problems. \n\nDownvote me. Someone needed to tell you.", "label": 1}
{"text": "Ah. A gamer who fundamentally doesn't even have a clue. Honestly? You're like all gamers. A fucking dumb prick.", "label": 1}
{"text": "Don't like it? Don't buy it. This offers absolutely nothing in terms of player power. \n\nDo your part, boycott it. It doesn't matter though, because they've already made their money 100x over.\n\nThis entire story, and the peasant outrage behind it, is meaningless.", "label": 1}
{"text": "Hello 👋,\n\n\nHave you seen an ergonomical office or gaming chair reclined? Can you lay in bed like that with knees up? May be weird, laptop may slide but you can probably find a sweet spot. Maybe a laptop cooling device and mouse pad. I don't think the mouse has to be wireless, Ive had both 🤔.\n\n\nI think adjusting is inevitable, even on desktop gaming. Stretch you legs every half hour or so.", "label": 1}
{"text": "Man, nostalgia hits hard! Black Ops 2 was a game-changer. Can’t believe how many players were online back then. What was your favorite map?", "label": 1}
{"text": "We really need a war dude", "label": 1}
{"text": "Hello ! I would love to start FPS but I’m not good at it, are BO a good série for a newbie like me ?", "label": 1}
{"text": "Hello :) Im glad you like it that much ! Can you play it online with other people ?", "label": 1}
{"text": "Are the BO a good game to start FPS ? It’s a genre that I really want to try but I’m scared that as a newbie girl I’ll get some hate", "label": 1}
{"text": "Skipped multiplayer shooters, too time-consuming.", "label": 1}
{"text": "I ditched RPGs and open world games - too time-consuming!", "label": 1}
{"text": "Let's chat about keeping up foreign relations in DCS World!", "label": 1}
{"text": "Fucking disgusting twat", "label": 1}
{"text": "Crusader Kings 3", "label": 1}
{"text": "What nothing? No acknowledgement of how stupid and arrogant you sounded? No apology? Just a down vote and move along...I'm honestly not surprised.", "label": 1}
{"text": "Love it. Do you sell them?", "label": 1}
{"text": "Absolutely! SSX Tricky has such iconic cover art—such a blast from the past!", "label": 1}
{"text": "i dunno wouldn't have been so bad in 2012 i had 150mb down / 10mb up", "label": 1}
{"text": "The Meta Quest 3 is a great upgrade with improved visuals, mixed reality, and a solid game lineup, including *Asgard’s Wrath 2* and *Assassin’s Creed Nexus*. It’s a strong choice for VR fans!", "label": 1}
{"text": "7 days to die. Very to survive in a zombie apocalypse", "label": 1}
{"text": "Wc", "label": 1}
{"text": "Lmao you literally posted a 10x saltier reply then had to go back and delete it. Hilarious. \n\nKeep being salty babe.", "label": 1}
{"text": "One of the PS2 launch titles was called Zone Of The Enders. It was fast paced, mech combat with parry mechanics and it was SO FUN\n\n\nlooking back it's a rough one but the nostalgia for that game is real. \n\nWould love a reboot.", "label": 1}
{"text": "Lmao , what you said was clearly wrong . Just admit it already and apologize . Wow was at a peak of +12 million subscribers in 2011 and in 2020 it reached a low of 4 million subscribers . It has recovered a little bit but it still is nowhere close to where it was . Crazy how hard you are in denial , where you can't even admit this simple fact . Instead you are coping hard . Dude stop thats just sad .", "label": 1}
{"text": "Yes but I don’t think it’s allowed to post a link", "label": 1}
{"text": "[Had](https://www.reddit.com/r/MHWilds/s/Y1LU2HI3XE) this perspective convo at r/MHWilds , seems like their involvement with the upcoming MH title is very important to them.", "label": 1}
{"text": "Hahahaha mee too", "label": 1}
{"text": "It's an r/wooosh fest in this thread", "label": 1}
{"text": "H O T", "label": 1}
{"text": "The cottage cheese is already forming in the thighs. You've got maybe two years more, tops. Poor bastard.", "label": 1}
{"text": "There you are. I hope you become happier in life. So you dont have to bring your anger and unhappiness onto others. I will block you now. Good day.", "label": 1}
{"text": "What has helped me get through some horror same games is to just do it, rather than think and think or to talk out loud like commentating on the game", "label": 1}
{"text": "sad to see", "label": 1}
{"text": "Do you like halloween events in games? For example like this: [https://youtube.com/shorts/KjBSMkxl960](https://youtube.com/shorts/KjBSMkxl960)", "label": 1}
{"text": "Whoah...i want to get my tomb raided....", "label": 1}
{"text": "I wouldn't even be mad if you raided my tomb", "label": 1}
{"text": "hot", "label": 1}
{"text": "this is you:\n\nhttps://i.imgur.com/1vSV6PU.png", "label": 1}
{"text": "You dont have her thighs or butt", "label": 1}
{"text": "Please, raid my tomb.", "label": 1}
{"text": "Happily raid your tomb 🤪", "label": 1}
{"text": "Yoooo your wife is banging, good shit 🤙", "label": 1}
{"text": "Lol Origins is linear as hell.  The structure of Veilguard is more like Origins than any other Dragon Age game.  Y'all just make shit up because you're still salty about a fucking *15 year old game.*", "label": 1}
{"text": "look at me at all price... halloween mean to be scary but ofc girls take the chance to show their body, u so original bitchiz.. even on a gaming thread just imagine the narcissism", "label": 1}
{"text": "Dark cloud\n\nMario 64\n\nTimesplitters : Future perfect \n\nF.E.A.R\n\nThe suffering \n\nHonestly, imagine Dark Cloud in Unreal Engine 5. It would be eye candy, even though it doesn't have THAT much to give, idk I might just love the game too much.", "label": 1}
{"text": "This is also a smart move, also because if he thought you were gonna buy it, he'd want a much more [expensive model](https://www.amazon.com/SAMSUNG-DisplayPort-Mini-LED-DisplayHDR-LS57CG952NNXZA/dp/B0CDQM55C9/ref=asc_df_B0CDQM55C9?tag=bngsmtphsnus-20&linkCode=df0&hvadid=80814247623884&hvnetw=s&hvqmt=e&hvbmt=be&hvdev=c&hvlocint=&hvlocphy=&hvtargid=pla-4584413761525930&th=1).", "label": 1}
{"text": "Yo, help me out dude! I got the Raygun!", "label": 1}
{"text": "It's Craft, is it? \n\nDid your gamer boyfriend like your costume? It was this or a baby to save the relationship, wasn't it?", "label": 1}
{"text": "Add more unpredictable events dat can change da score, like injuries or weather conditions.", "label": 1}
{"text": ">\"I never knew gravy could have so many shades,\" she whispered, eyeing the steaming tureen. \"From rich caramel to deep mahogany, each ladle holds a new layer of mystery…and flavor.\"\n\n>His gaze smoldered over the mashed potatoes. \"You haven't even tasted the thickest, darkest parts yet.\"", "label": 1}
{"text": "Id like to put it in her dumper.  Respectfully.", "label": 1}
{"text": "not my country but I really love The Legend of Zelda series (Nintendo) made by Japan", "label": 1}
{"text": "Yep I'd rail her for sure.", "label": 1}
{"text": "Oh my gosh, definitely *Mario Kart* on the GameCube!", "label": 1}
{"text": "pussy", "label": 1}
{"text": "Check it out here:  \n[https://joshcamas.itch.io/abyss-bound](https://joshcamas.itch.io/abyss-bound)", "label": 1}
{"text": "Damn way too non-sexy. Dontcha know unless you’re showing your tits and ass it’s not a costume??", "label": 1}
{"text": "BLOW IT OUT YER ASS", "label": 1}
{"text": "they've been generic undead", "label": 1}
{"text": "I resemble that remark. I failed out of high school courtesy of World of Warcrack.", "label": 1}
{"text": "We can just hope hahah", "label": 1}
{"text": "Really? I had no idea wow", "label": 1}
{"text": "super cool, do they come off the stands?", "label": 1}
{"text": "Final Fantasy VII hands down. The moment Sephiroth steps in, and you’re in Midgar for the first time… mind-blowing. I’d love to go back and relive all those plot twists", "label": 1}
{"text": "Good god are you clueless. It isn't video games that is like drug addiction, it is video game ADDICTION that is like drug addiction. Taking drugs doesn't equal drug addiction either, meaning millions of people can play video games or take drugs and be fine but that's not everyone. Once again, you don't understand how any of this works and stop claiming that it insults \"real\" addicts. To reiterate, Ive been there and your take is beyond stupid. Don't speak on issues you have no knowledge or experience on. You're embarrassing yourself.", "label": 1}
{"text": "See my most recent comment in the chain. Senna is GOAT and it’s not even close statistically.", "label": 1}
{"text": "Multiplayer have more players than single player.", "label": 1}
{"text": "What is your obsession with guy's touching themselves?\n\nYou've got a problem. Absolute troll.\n\nYou'll look back one day, and be disappointed with the way you act...\n\nHopefully.\n\nDon't reply, you're already blocked.", "label": 1}
{"text": "We are now at a point that the idiots on here don't even get sarcasm when there's /s after it. Holy shit we are doomed.\n\nI already hated /s cuz a majority of sarcasm is easy to get online but damn this is a new low.", "label": 1}
{"text": "Black Ops 6 better than MW2 & 3 on Steam, but Warzone 2.0 is still king", "label": 1}
{"text": "Nah, he's still great.", "label": 1}
{"text": "Would’ve saved time by just finding an ebony ingot or two!", "label": 1}
{"text": "Let's not forget Mass Effect Andromeda and Fallout 76 had raving critic metascore...", "label": 1}
{"text": "because the game is fucking shit, you don't have free will to make your own mind up or what?", "label": 1}
{"text": "You guys are so smart for getting mad at how other people spending your money.\n\nLol jesus christ, no wonder you idiots make 20/hour", "label": 1}
{"text": "Many players prefer multiplayer in Project Zomboid because it enhances the experience through teamwork and social interactions, making survival more dynamic and engaging      \n\nHowever, some enjoy single-player for the ability to explore and strategize at their own pace, focusing on personal storytelling and immersion without the pressure of coordinating with others", "label": 1}
{"text": "> „Through them The Veilguard speaks to our hearts, and it's how the game approaches complex topics from our own world - topics like gender identity, neurodiversity, personal trauma, and parenthood - and each is handled gently and unobtrusively, and with maturity and care.“ - Eurogamer, rating it 5/5\n\n> „ […] as a non-binary person myself, Veilguard includes some of the most authentic representation of coming to terms with gender stuff – and having to navigate your family's reaction to it – I've seen yet in a game. […] It's quite well-handled, and finding out that the writer for this character is non-binary themselves did not surprise me at all.“ - IGN, rating it 9/10\n\nI call this the usual case of reviewers forgetting that they get paid to review the game, it‘s features, gameplay and quality, but not necessarily how it panders to their own sociopolitical belief system. Better wait for the user reviews as usual, because these kind of reviews are worthless to me personally, as these highlighted aspects don’t make or brake a a purchase.", "label": 1}
{"text": "I saw one of the first categories it was under for steam was LGBTQ and was immediately out", "label": 1}
{"text": "The average Gamer® is as unreliable as those reviews. A lot of the time they behave as mobs and down vote games they didn't play because of the existence of a black guy character.\n\nI'm sorry but I don't trust the average gamer incel loser", "label": 1}
{"text": "Games with no talky or story stuff, just fun gameplay!", "label": 1}
{"text": "Yes thank you faceless ass kisser of the exploitive corpo for reminding me of my personal tastes in video games.\n\nI never would have been able to figure out what i enjoy without your help and putting words in my mouth", "label": 1}
{"text": "The mentally ill can be intriguing to watch", "label": 1}
{"text": "A devout Sister of r/thighdeology/", "label": 1}
{"text": "I think im non-buynary", "label": 1}
{"text": "No developer hates money you sex/boob/ass obsessed gooner", "label": 1}
{"text": "Well, you can attribute a great deal of “it can’t be just ok, it must fail.” To the people whose big problem with it is “woke content.” And the same can be said for a lot of people who want this game to be at a 10/10 instead of a 7/10, same reason but opposite desire. At the end of the day, from what I’ve seen, this will be a game of mid to above mid experience for everyone who isn’t going for the culture war fight.", "label": 1}
{"text": "This game really is gooner bait", "label": 1}
{"text": "Korea's attitude towards women is so bad I can genuinely see the game tanking overnight if they gave equal opportunity fanservice.", "label": 1}
{"text": "This game is terrible ! _post two reviews of two YouTubers while ignoring positive review and calling any reviewer who liked it a shill_", "label": 1}
{"text": "They sold Tango but retained the IP's aside from HiFi Rush.", "label": 1}
{"text": "Okay now show us the daggers", "label": 1}
{"text": "Ugly", "label": 1}
{"text": "Fextralife is a horrible website that deliberately undermines and replaces actual community wikis with its own horrible low effort pages. They use search engine optimization and mass botting on sites like reddit to drive their shitty ass wiki to the top of the search results. Any hardcore gamers *should* hate fextralife for what they have done to the Souls and Monster Hunter communities.\n\nHow the fuck does anyone still not hate Fextralife here.", "label": 1}
{"text": "This change demonstrates a fundamental misunderstanding of ass. The developers of this game are not perverts but are posers masquerading as degenerates, completely unaware of the simple fact that the obstruction serves only to enhance the esthetic value of the ass. I could smell the scent of cowards from this game all along, the scent of those who simply don't understand the importance of more is less. I scoff at this and will be not playing the first descendant even more than i already wasn't how pitiful.", "label": 1}
{"text": "There is a lot of misinformation surrounding this game.  I watched all of Skilledup's video.  Seeing some of the things being attributed to him right now is like watching kids play a game of telephone.  He most definitely didn't like the game, honestly that was probably the worst review of a game I have seen that didn't involve bugs/glitches, but his takes are being paraphrased 3-4 times over to be something else.", "label": 1}
{"text": "Are you dumb?", "label": 1}
{"text": "VR big thing: Multiplayer gaming! Join the fun now! 🎮👾", "label": 1}
{"text": "The product of DEI hiring practices.", "label": 1}
{"text": "Lmfao you expect critics to be objective…. Shit don’t read any movie, or restaurant review for that matter.  You’ll be disappointed", "label": 1}
{"text": "Here I go.\n\nNegroes have done an irreversible damage to the game industry.", "label": 1}
{"text": "Not even that bad, expected worse, lets see", "label": 1}
{"text": "Hi Mr. Bot! Do you know Astro Bot? He's cool af\n\nYou should go away though", "label": 1}
{"text": "Whoa, looks really good cant wait for this one", "label": 1}
{"text": ">Reviews beeing bought is by no means a conspirac or even a secret in the industry?\n\nAre you in the games journalism industry?\n\n>You have to be incredibly naive to believe publishers wouldn't do this, especially a scum company like EA.\n\nDo you have any proof, then?\n\n>Game journalists have also shown more than once they are not exactly a bunch with high integrity.\n\nWhich specific games journalists, and please provide proof as well thanks.", "label": 1}
{"text": "I love user reviews. I don't even read the good ones, I only read the bad ones. It quickly becomes clear if the bad reviews actually have anything of substance to talk about. More often than not like 80% of negative reviews are the ravings of a mouth breather", "label": 1}
{"text": "Just shows that you dont know how sound and force works.", "label": 1}
{"text": "Grow up", "label": 1}
{"text": "Are you able to read? do you even think about what you type?\n\nThey are able to maintain a RATING SCALE that is universal. They are not able to maintain a universal opinion on what games belong to each rating scale. \n\nWhat the hell are you even talking about. \n\nThere is no comparison with other reviews. They are simply told \"6 stands for \"meh\"\" that is IT dude. At that point if they feel the game is meh, they rate it a 6.\n\nThey might feel something is meh and you may disagree. that's how this works.", "label": 1}
{"text": "Open wideeeeeeeeeeeeee, eat it all up , good boy!", "label": 1}
{"text": "God you neckbeard retards are such fuckin losers", "label": 1}
{"text": "Objectively well received among paid critics?", "label": 1}
{"text": "You must clearly not be here daily if you don’t know how fucked this site is with constant repost bots that keep up on your home page for more than a day. I do enjoy checking in a week later to see the same post reformatted via ms paint with the same top botted comment. \n\nThanks for your useless contribution though, in true redditor fashion. You might have a future here.", "label": 1}
{"text": "https://www.ign.com/articles/2017/03/20/mass-effect-andromeda-review\n\n\n\n>Mass Effect: Andromeda Review\n\n\n\n\n>Bringing Mass Effect to a new galaxy isn't quite the shot in the arm the series needed.\n\n\n7.7/10 IGN\n\n\n\nAnd I really enjoyed it.", "label": 1}
{"text": "Totally legit question. Most guys in the comment need a fucking life reddit wasn't a total circus as it is now.\n\nBunch of clowns, the game release was always on midnight this started to change this year. \n\nps. ppl talking about different timeline are wrong, they always released the game at 00.01 of the date release\n\npps. ppl downvoting or saying go to sleep need a fucking brain you bunch of clowns. 1 you don't know what kind of job he do 2 you are nobody to tell other what to do always remember it. I fucking miss the old real reddit with real ppl instead that get into the discussion instead of downvoting and judging instead of giving opinions", "label": 1}
{"text": "YouTubers are not inherently less ethically vulnerable in this regard. They still get advanced review code, invites to press events, and favorable treatment. \n\nI mean, hell, Ralph and Austin from SkillUp got preview access to this very game and still were more than willing to give it a negative review despite their business model revolving around getting early access to games.", "label": 1}
{"text": "O snap", "label": 1}
{"text": "I no longer play competive games like apex legends, battlefield, call of duty, and fortnite and really only play story driven games like gtav, rdr, and rdr2 as mentioned by another member I don't have the time to \"git gud\" at all the top games.", "label": 1}
{"text": "The grand theft auto series is golden.", "label": 1}
{"text": "Very nice great work. 🙏", "label": 1}
{"text": "Sadly I never got to enjoy battlefield 3 I started on battlefield 4 but the game looks great to be 13 years old.", "label": 1}
{"text": "Games that interact with the player are amazing 🙏", "label": 1}
{"text": "[Different gun, same vibe](https://images.app.goo.gl/Y37gJu6BReD7CMQu6)", "label": 1}
{"text": "GTA:SA", "label": 1}
{"text": "I was debating whether to get the Steam Deck or the Legion Go, ultimately decided to go with the deck after watching a few videos on how Windows behaves on these handhelds. I wanted a device that was simple to use", "label": 1}
{"text": "Your subbed to Asmongold, I can look at your post history, champ.\n\nWomen being reduced to sexual objects, get this, objectifies them.   I've explained this to you several times now.  Your inability to understand this basic concept does not mean I haven't explained this to you which Is why I suggested you look at something more in depth.", "label": 1}
{"text": "He is a dude who needed help, but society and people like you failed him. Also, please refer to me as Apache/Chopper. Those are my preferred pronouns.", "label": 1}
{"text": "Stupid Judgement set. It took our guild a long time to get Blackwing on farm, and after months of kills, we only ever got 1 Judgement breastplate. Dropped with our one and only Ashkandi. I convinced our #1 dkp paladin to get Ashkandi so I got our only breastplate.\n\nYears later, I was taking my now wife through BWL as a duo to show her what I used to do on weekends with 39 strangers (lol) and she got every Judgement drop. Took us two weeks to complete her full judgement set...", "label": 1}
{"text": "It was NOT \"fine\". it was the best we got and we tolerated it /got used to it.\n\nYou people are blowing my mind right now. I'm honestly embarrassed to belong to the same species.", "label": 1}
{"text": "Flippin heck ya cry-baby bunting.", "label": 1}
{"text": "I personally don't notice much optimisation issues in UE5 tbh so ig it might be the devs", "label": 1}
{"text": "Exciting news for Dragon Age fans! An 84/100 Metascore promises an engaging adventure in The Veilguard. Can't wait to explore!", "label": 1}
{"text": "The funny thing is that EA has been manipulating the process to get early reviews and gave access to only journalists who would praise and give it 10/10.\nLast game who did this crap? Cyberpunk.\nPeople are gonna get really disappointed in a few days", "label": 1}
{"text": "GTA 5", "label": 1}
{"text": "Clown take. Steam review scores tell a much more accurate picture than anything those \"journalists\" put out. I don't understand how anyone with a functioning brain can take them seriously.", "label": 1}
{"text": "Weren't the destroy all humans made by the austrian studio?", "label": 1}
{"text": "Sometimes I forget there are people in this world that truly don't understand sarcasm.", "label": 1}
{"text": "Did you just seriously made an angry rant about how \"normal functioning members of society\" are m0ron$ who trust paid reviews and have no problem dishing out 70 bucks for a crap they won't enjoy, and you called the opposite of that a sh€ep?\n\nXD", "label": 1}
{"text": "Anthem has a 59 aggregate metacritic score, and concord has a 62 lmao... so... lol... are these paid shills in the room with you right now? Because your examples dont back up your claims that tbey exist rotfl...", "label": 1}
{"text": "hi guys!! im supplier streaming platforms at super price! 🤗\n\nplatforms available: 📲\n•netflix\n•disney\n•max\n•crunchyroll \n•paramount\n•prime video\n•spotify \nand more!!💗  \n\nyou can get a complete platform for sharing with your family or just for one user staring and only $3. 🤩\n\neach platform has a different price. 💲\n\nif you interested send me a dm. 💌\n\nit’s 100% legal and i have a references from happy customers to share with you. 😉\n\npayment method: paypal. 💸", "label": 1}
{"text": "Yeah, whent it gets GOTY, I will come back here and rub your face in it!", "label": 1}
{"text": "i wish i play this game", "label": 1}
{"text": "Yikes, Canada! Red Dead Redemption on PC costs more than a polar bear riding a moose in a snowstorm! 🎮🤑", "label": 1}
{"text": "Starting to look like Marlboro cigarette points now lol. Geez, what a deal after basically smoking your life nearly away  here. Before, one could ever use any of them.  I could have bought a car with some of that s****.", "label": 1}
{"text": "stfu bot you don't even have human money to buy shit", "label": 1}
{"text": "OP is physically an ape", "label": 1}
{"text": "People who didn’t like 3make have made it very clear what they wanted out of it and didnt get. Cut locations, cut boss fights, overly scripted Nemesis encounters, changing Nemesis’ forms in general.\n\nIts a great game but you gotta be obtuse to not see why fans of the original wouldnt like it as much.", "label": 1}
{"text": "When I played yakuza 0 I thought that it would be cool if it was a tv series instead, for me the gameplay was somewhat tedious and also lack of voice acting in certain scenes was disappointing. Luckily it will get it's own show now", "label": 1}
{"text": "And is not what the final game was, which is what matters.", "label": 1}
{"text": "Nah 10000000000000000000000 would be fine", "label": 1}
{"text": "Starfield is trash. This video tells all the truth!", "label": 1}
{"text": "You guys really need to calm down. A game is almost never 100% complete. As even back in the \"golden days\" of videogaming you happen to worship. Its just that \"back them\" anything that didn't get added in time was saved for the sequal, or dlc depending of what \"golden era\" you're refering to. And you've been bitching about day one patches  since x1 and ps4 days. When are you guys going to finally get it through your heads that thats been the norm for the past decade and its not going away because AAA games are just getting bigger and more complicated...\n\n\nAmd the inly people at fault for \"ruining gaming\" are the people that buy battlepasses and and super expensive cosmetic mtx bullshit.", "label": 1}
{"text": "\"Get big computer for play games goodly.\"", "label": 1}
{"text": "same i just keep making the same stupid mistake. it wont uninstall either. probably because i never uninstall it, but still", "label": 1}
{"text": "The wiki? LMFAO. You're a clown.", "label": 1}
{"text": "Mortismal cannot be trusted. He called Starfield a great RPG that is easy to recommend.\n\nHe will never give a bad review to a game because his main fear is that he won't get any more review copies. You cannot trust such a person.", "label": 1}
{"text": "Pay to goon systems are wild", "label": 1}
{"text": "American Mcgee shud hav made Milly Brown movie with EA, butt that's just my two sense!", "label": 1}
{"text": "DUde listen to what he wrote. he was literally defending your side you muppet.", "label": 1}
{"text": "Copyright Office good, games stay old.", "label": 1}
{"text": "I don’t dislike SkillUp, but he has lost me since his reviews on FF7R and Rebirth. It’s kinda wild watching him praise and critique the exact same points with polar opposite takes between those 2 games. He just seems like a wildcard anymore and he’s not super consistent. \n\nThat being said, I’m not sure he’s wrong about this one. I’m going to wait a few weeks after it comes out and see what the general consensus is within the community. This isn’t just a SkillUp take. Seems like everyone is divided on this game and it’s either a 9/10 greatest game of 2024 or 3/10 worst game ever with nothing inbetween.", "label": 1}
{"text": "You're spreading false information. Do better. Start by listening to devs and not bullshit some randomer wrote on Wikipedia because IGN made something up that has never, ever been corroborated and in fact, completely debunked.", "label": 1}
{"text": "Mass Effect 5 will look like a cartoon, says director!", "label": 1}
{"text": "[You're an idiot.](https://i.imgur.com/Z8dxIFw.jpeg)", "label": 1}
{"text": "He literally commented on the progression of the series and added a non-negative perspectiveabout making up his own mind when he gets to play. He didn't cherry-pick shit dude...", "label": 1}
{"text": "Sometimes not everyone simply gets copies. Thats life. Theres always someone who will miss out. I dont think its some *major conspiracy* to do it. Im sure theres been some reviewers that didnt get BG3 early either. Its not black and white.\n\nI get that it seems like red flag but also look at this way - some publishers have nowdays also opted to \"no one gets any pre-release copies\". [Bethesda was one of them](http://web.archive.org/web/20200921183628/https://bethesda.net/en/article/42QH1pTNpKSYIcgKK2C4wW/bethesda-and-game-reviews)  / [alt link](https://www.ign.com/articles/2016/10/25/skyrim-fallout-developer-no-longer-giving-out-early-review-copies) to article if that one takes forever.\n\nAnd even if they did give copies to, lets say, over 1mil subs on YT - what about 900k accounts? Someone in internet will twist that into \"they are buying big tubers\" or youtubers could be salty they didnt get copy. Same could be said to smaller websites or smaller magazines in small countries. Its not easy win.", "label": 1}
{"text": "Xenoblade Chronicles X: Defective Edition Coming March 20th, 2052 (Nintendo Switch)", "label": 1}
{"text": "Wikipedia and IGN are not news sources, and \"news\" can only report, they don't dictate what is true. The people who actually make the games do, idiot.", "label": 1}
{"text": "Dustborn and Concord failed because they pandered to idealogs who dont actually buy games. Ubi and the New assassins creed is getting hit because they tried the same thing.  The \"Modern Audience\" is a fictional \"gamer\" that cares inclusion and representation over fun, original, good games. When games tries to pander to a subset of \"gamers\" that doesnt actually exist, they fail. and they fail hard.\n\nTheres a reason that games like Wukong, 40k, and helldivers Succeeded. they put fun 1st.", "label": 1}
{"text": "Can't even keep the bullshit straight in your own head.", "label": 1}
{"text": "Neat, so your opinions are easily dismissed, then.", "label": 1}
{"text": "I totally get why publishers pull the breaks on review codes. They've got to protect their image, right? Last thing they need is a leak showing all the bugs they haven’t squashed yet. But yeah, it makes me think back to the PS3 days when demos were everywhere. Playing a demo was like getting a backstage pass.\n\nSpeaking of community engagement, I think SEGA has done pretty well with their Yakuza series drops. They let fans experience the mechanics first-hand. I've also found that something like \"Pulse for Reddit\" helps brands connect with gamers better than blasting out ads everywhere. More companies could learn from that approach, y'know?", "label": 1}
{"text": "I saw some gameplay of the game, the game doesn’t seem to have any nuances to conversation, instead feels like an adult talking to children. Characters are not memorable.The facial animations are dogshit.", "label": 1}
{"text": "Real schizo hour", "label": 1}
{"text": "lazy game journalist activists, bioware should demand refund for all the paid reviews 🤣", "label": 1}
{"text": "Rdr 1 and Undead Nightmare on PC but no one cares.", "label": 1}
{"text": "Your the weirdo here robotemist", "label": 1}
{"text": "\"Game bad. Not fun. Waste of time. Avoid at all costs!\"", "label": 1}
{"text": "> it's so fucking weird that you choose to be skeptical of everyone else rather than the one outlier dude with an incentive to stir up controversy.\n\nAh yes that's weird and not that 99% of the positive reviews use the same wording \"Return to Form\" hello.\n\n1. The lines he presented are still in the game.\n\n2. More of these cringe lines can be seen in other reviews\n\n3. Veilguard is trash.\n\n4. Take the L\n\n5. Seethe Mald Cope.", "label": 1}
{"text": "Worst game ever! I'd rather eat a sock than play this again!", "label": 1}
{"text": "I don’t remember them ever having an exclusivity deal with Sony.", "label": 1}
{"text": "You can just say you dont read much. You dont have to make yourself look like a fucking idiot.", "label": 1}
{"text": "Stephens is a plagiarist. Fuck you for even mentioning his existence. He needs to go away, like yesterday. No second chances.\n\nFextralife is a scammer, they harvest content for others and force it on populace for cash. Their game instruction site is always broken and unfinished filth with wrong information! You wouldn't buy a car with missing wheels, would you? That's what Fextra peddles.", "label": 1}
{"text": "Let's talk about wacky therapy in Eliza!", "label": 1}
{"text": "Sorry you'll have to get your pedo content somewhere else.", "label": 1}
{"text": "didnt see anybody mention this yet but if you havent played bloodborne or elden ring then your kind of missing out, not really too story driven but one of the best rpgs ever and the world in there is so big. and if you get into it youll literally have so much content and shit to do", "label": 1}
{"text": "From Software's invasion system is conceptually interesting, though I personally hate it due to the fact that they're one of the worst companies in the entire industry at making PvP. It's astonishing how they can't make an even passably good netcode.", "label": 1}
{"text": "He brought up News_Bot and started plugging his shitty website while he's ranting and raving everywhere else in the thread.", "label": 1}
{"text": "But they WILL hire the same writers and make the story all about identity politics", "label": 1}
{"text": "There's a group of right-wing losers that get upset whenever a game has a protagonist that belongs to any minority. Unfortunately, we're all stuck having to listen to them waffle on about their nonsense.", "label": 1}
{"text": "Guess you could say the fans were butt hurt about the female protagonist", "label": 1}
{"text": "If you actually cared about \"escaping reality\" you probably wouldn't have made a brand new Reddit account specifically to complain about the new Dragon Age, dorkass.", "label": 1}
{"text": "Hey asshole, I am inside you fucking walls. I am playing PC GAMES INSIDE YOUR WALLS", "label": 1}
{"text": "Yes please", "label": 1}
{"text": "Not at all. And it’s reviewing pretty good", "label": 1}
{"text": "Then pirated version is perfect for you", "label": 1}
{"text": "You’re not wrong", "label": 1}
{"text": "wanting studios to die makes you a fuck awful human", "label": 1}
{"text": "I’m so excited for the 2 hour YouTube videos on why gta 6 is woke", "label": 1}
{"text": "WDYM \"ugly characters\"? Are you a chud, a gooner, a capital G gamer? Why are you so hateful?", "label": 1}
{"text": "monkey share tribe -- monkey good.", "label": 1}
{"text": "I'm still utterly baffled Concord was a thing to begin with. Literally all the player feedback since the reveal has been negative. SURELY they had some people in studio who tried to convey the same idea to the higher ups?", "label": 1}
{"text": "The Switch is at the end of its life cycle, and they are holding out on the new 'big' games for when the Switch's successor releases by the end of next year. The same thing happened with the 3DS.", "label": 1}
{"text": "Who cares about what gaming journos rate the game? Aside from conflict of interest between the publishers and gaming media, many if not the most gaming journalists gives favourable reviews which align with their political views and messaging. Most of the people who works for the mainstream gaming media has similar political views sadly", "label": 1}
{"text": "slow day huh", "label": 1}
{"text": "Chinese propaganda p", "label": 1}
{"text": "I've never understood how someone can possibly think that most new games are, or even that more games than usual are bad. Last year was a contender for the best year for new releases in history and this year has been solid as well.", "label": 1}
{"text": "There will be gender reaffirmation scars though.", "label": 1}
{"text": "Call me when it's free \n\n...\n\nOh wait... It can be \n\n*Sees the black flag on the horizon*.", "label": 1}
{"text": "There are tons of AAA games that aren't that and there's also thousands of smaller titles from smaller studios. Maybe games are bad if you exclusively play games published by Ubisoft or something, but that's your fault.", "label": 1}
{"text": "Balatro and UFO 50 are both considerably higher rated than Black Myth Wukong though. I think at least one of them will absolutely be nominated for Game of the Year, though I think FF7R is the most likely game to actually win it.", "label": 1}
{"text": "Who cares about sales? Are you a Game Science shareholder or something? Also, none of the Game of the Year winners at The Game Awards have ever been the best-selling game of their year.", "label": 1}
{"text": "I haven't seen any of those but I agree that she's often good.\n\nOne of my favorite female characters in recent years is Louise in the movie *Arrival*. She's a strong female character in the sense that she holds her own against everyone in her social setting and is the hero who saves the day, but she saves the day using traditionally feminine traits, like being empathetic and being a good listener. She doesn't save the day by adopting masculine traits like acting intimidating or getting in a fistfight.\n\nI really liked that because to me, Louise's character and story arc contains the implication that the traditionally feminine traits are just as important for 'saving the world' as the traditionally masculine traits, and that a person can be a hero without needing to adopt traditionally masculine traits. It broadens the scope of *who gets to be a hero* in a way that's different from what happens when a woman becomes a hero by adopting traditionally masculine traits.\n\nChihiro from *Spirited Away* is another great example of this kind of a character.\n\nUnfortunately, it's really hard to find an example of a *man* being a hero and saving the day by adopting traditionally feminine traits. Jean-Luc Picard is an example of this sometimes, but certainly not in every episode of *ST:TNG*.", "label": 1}
{"text": "Good games from THE FIRST HALF of last year alone:\n\n* A Space for the Unbound\n* Hi-Fi Rush\n* Pizza Tower\n* Dead Space Remake\n* Season: A Letter to the Future\n* Like a Dragon: Ishin!\n* Octopath Traveler II\n* Wo Long: Fallen Dynasty\n* Tchia\n* Resident Evil 4 Remake\n* Terra Nil\n* Dredge\n* Wildfrost\n* Cassette Beasts\n* Bramble: The Mountain King\n* Star Wars Jedi: Survivor\n* Idol Showdown\n* The Legend of Zelda: Tears of the Kingdom\n* Planet of Lana\n* Killer Frequency\n* Street Fighter 6\n* Amnesia: The Bunker\n* Trepang2\n* Final Fantasy XVI\n* Dave the Diver\n* Oxenfree II: Lost Signals\n* Viewfinder\n* Pikmin 4\n* Remnant 2\n* Psuedoregalia\n* Venba\n\nIf you seriously cannot find a single game you enjoy in all of that, you have taste issues.", "label": 1}
{"text": "The developers do care about the competitive scene though, The Pokemon Company literally runs the main competitive format of Pokemon and hosts tons of tournaments. Also, Game Freak does ocasionally make balance changes, like nerfing Zacian's ability, Intrepid Sword.", "label": 1}
{"text": "AWESOME", "label": 1}
{"text": "Looks like a lot of gonks in here brought their \"jump to conclusions\" mat today and need a safe space from DATV.  Lol so many soft nerds in here getting triggered hard over fucking video games.", "label": 1}
{"text": "$50 price after 14 years.  Fuck off, Take Two.  A shady key site purchase in the next few years at best.", "label": 1}
{"text": "That's the dumbest math I've seen in a long time. Did Spider-man 2018 cost $500 million to develop because Sony bought Insomniac for $224 million? Did Redfall, Starfield, and other Zenimax games combined cost 7.2 billion+ to develop because Microsoft bought Zenimax? Will the development of all the games Activision-Blizzard make cost upwards of $70 billion because Microsoft bought them?\n\nIt's insane how so many social media users just happily showcase how incredibly stupid they are because they need to push some idiotic narrative.", "label": 1}
{"text": "Who would have thought that DEI and ugly character designs won't sell games\n\nI'm shocked I tell you. Shockeddddd\n\nMeanwhile The First Descendants patched a character designs to show more ass and making a shit ton of money.\n\nWestern devs could have learn a thing or two from KR and Asian's Devs 🤣", "label": 1}
{"text": "This is what Japan studios died for. The american takeover of sony has been a disaster.", "label": 1}
{"text": "Except FF7R and Rebirth aren't remakes, they're sequels. Like, the Remake title is meant to be literal. Sephiroth is literally remaking FF7 and trying to escape his fate of dying.\n\nThe concept of a sequel to FF7 has always been planned. FF7R takes the original sequel idea and executes on it.\n\nThe fact we still have people like you somehow miss that is so funny. Media literacy is fucking dead, even when said media flat out tells you that it is a sequel.", "label": 1}
{"text": "Stupid people play cod", "label": 1}
{"text": "i have several other issues would you like me to list them off? also any enemy health bars in a video games outside of bosses are absolutely unecessary. its a huge pet peeve of mine. if you own a nice OLED screen the last thing you want are more static images on the screen. you most likely play on a 1080p monitor so i don't expect you to understand how annyoing it is", "label": 1}
{"text": "My man, shut the fuck up. Game development cost is game development cost. End of story.", "label": 1}
{"text": "The internet doesn't even accurately represent what consumers want, and to be fair, the biggest counter to the notion that the customer is always right is that at the end of the day, every human being with money to spend on anything is a customer\n\nThese things aren't equivalent, mass layoffs are way worse than a game you didn't even play not being to your liking lmao", "label": 1}
{"text": "Nobody said otherwise. There are tons of extremely high quality games releasing.", "label": 1}
{"text": "You think that comment had outrage and he needs to tone it down? Or any comment here for that matter? \n\nYou're a pretentious cunt, and even me calling you that has zero outrage or a tone.\n\nReddit Karen Karening at other Karens.", "label": 1}
{"text": "In the last ten months alone we've gotten:\n\n1. Astro Bot\n2. Final Fantasy VII Rebirth\n3. Metaphor: ReFantazio,\n4. Balatro\n5. Satisfactory\n6. Tekken 8\n7. UFO 50\n8. Like A Dragon: Infinite Wealth\n9. Animal Well\n10. 1000xResist\n11. Solium Inferno\n12. Persona 3 Reload\n13. Shogun Showdown\n14. Lorelei and the Laser Eyes\n15. Silent Hill 2 Remake\n16. Neva\n17. Prince of Persia: The Lost Crown\n18. Tactical Breach Wizards\n19. Frostpunk 2\n20. The Legend of Zelda: Echoes of Wisdom\n\nThere's a lot more than that as well, but I think that's enough to illustrate my point. If you somehow cannot find a single game you enjoy in all of that, you are the problem, not the games.", "label": 1}
{"text": "No doubt in the game for me it was one of the most epic axes, but seeing it in real life I can admire much more how cool it looks.", "label": 1}
{"text": "If there were exceptions to using the R word, this would be it.", "label": 1}
{"text": "I’m a firefighter so I hate minion rush", "label": 1}
{"text": "You mean the story of the game, or the story of a presidential campaign?\n\n# [The History Channel Updates WWII Programming For The Trump Era | The Daily Show](https://youtu.be/Sb5-NmUVVnw?si=9C_gaxmzyHyz54L4)", "label": 1}
{"text": "Same way me and you always do things to eachother with out permission because we always have passionate hanky panky time?!", "label": 1}
{"text": "Off-topic, but this website seems new as fuck and I spent too long looking.", "label": 1}
{"text": "Yay :D", "label": 1}
{"text": "How many are willing to vote for someone committing Genocide.", "label": 1}
{"text": "I'm gonna play it myself because I think Skillup's video was over-sensationalized to \"stay relevant,\" but I have also heard mort might be not 100%ing games anymore. He's gotten some achievements while they were bugged and impossible to do. Also, he sometimes churns out like 160+ hrs worth of gameplay in a week which is just not realistic.", "label": 1}
{"text": "You forgot the /s, you bigot. Or are you so against us talentless freaks?", "label": 1}
{"text": "It's a fantastic game, despite what the weird white incels on YouTube are saying.", "label": 1}
{"text": "This isn't about fake wholesomeness, this is about people who think mass layoffs are a positive", "label": 1}
{"text": "Consider Nioh 2. You can easily sink 60-100 hours into it due to its looting similar to Diablo and addictive/fun combat with various weapons.", "label": 1}
{"text": "Games with intense psychological horror or trauma", "label": 1}
{"text": "that's an interesting perspective!\n\nFor instance, teachers might steer clear of educational games because they’re already immersed in that world daily. Similarly, healthcare professionals might avoid games with medical themes or hospitals since they’re constantly dealing with that in real life.", "label": 1}
{"text": "Counter Strike doesn't let you buy gun NFT's that give you a direct advantage in-game. It's just a market for cosmetics, and there is no way you can purchase a skin for cs using crypto through the Steam marketplace.\n\nSo no, it isn't the same thing, lol.", "label": 1}
{"text": "Prey 1 was scary enough anyway", "label": 1}
{"text": "You know what’s better than NFT’s? Well everything but I was talking about GOLD! I put a gold coin out for anyone to grab, follow the clues on my YT channel and go get it!! $3000 for FREE in the woods", "label": 1}
{"text": "Heck yes, no more deleting games for space!", "label": 1}
{"text": "literally same here XD", "label": 1}
{"text": "Halo 4\n\nSonic and the Secret Rings", "label": 1}
{"text": "Nice AI fake of your \"wifes\" names. Stfu and gtfo", "label": 1}
{"text": "I'm sorry, I'm not trans and haven't unlocked this dialogue yet.", "label": 1}
{"text": "The authentic Meal Team 6 experience.", "label": 1}
{"text": "You're pathetic", "label": 1}
{"text": "Ah yes the games for the “modern audience” some how George Floyd influenced our video games. Did you know he once stuck a pistol in pregnant woman’s stomach?", "label": 1}
{"text": "Speak for yourself, nerd.", "label": 1}
{"text": "You're honestly such a loser lmao", "label": 1}
{"text": "it’s so obviously fake and gay", "label": 1}
{"text": "Because games are like pets that we adopt and care for.", "label": 1}
{"text": "as expected tbh", "label": 1}
{"text": "it's \nARK : Survival Evolved\nmaybe it's the best of all dinosaur games", "label": 1}
{"text": "\"Check out Untitled Goose Game, it's a hoot and a honker!\"", "label": 1}
{"text": "Need that fancy clicky thing for gaming.", "label": 1}
{"text": "So Concord is the most expensive game to ever be immediately abandoned then right?", "label": 1}
{"text": "Web games for 8 years old are very educational and fun!", "label": 1}
{"text": "I started it and you got lost in your own sauce. Maybe stop throwing babyrage fits over people calling a shit game a piece of shit.", "label": 1}
{"text": "KOTOR", "label": 1}
{"text": "Yes they don't want to deal in absolutes in order to give themselves room to return to an IP if they so choose. Guerilla on the other hand has stated [they are done with Killzone](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://gamerant.com/guerrilla-games-killzone-future-horizon-zero-dawn/&ved=2ahUKEwjm8_Le9LaJAxUUL0QIHZbFJHoQFnoECCgQAQ&usg=AOvVaw19e5E_KHvCwV_WU25HOC7v)", "label": 1}
{"text": "Nah, between the first two games she was only suspended for like, I don’t know, 40,000 years?", "label": 1}
{"text": "Red Dead Redemption", "label": 1}
{"text": "reddit mod moment", "label": 1}
{"text": "redditmodmeme.jpg", "label": 1}
{"text": "*Deep Breath* \"Let it go\"\n\nYeah DA is going to be on the ultra defensive for a while. So anythign remotely deemed Anti - Veilguard, welp... Banned. It's how you keep a certain narrative alive. But silencing all the other voices.", "label": 1}
{"text": "Yet another reason why we need to be able to report mods and be able to remove and replace them", "label": 1}
{"text": "Nice mate. My steam acc is 13 years old", "label": 1}
{"text": "Why ban him when he can pull a barve instead of", "label": 1}
{"text": "You know a game is gonna be *amazing* when  its subreddit is acting like this", "label": 1}
{"text": "Shill-mods.", "label": 1}
{"text": "I have been getting those subs recommended to me all day, it’s infuriating.", "label": 1}
{"text": "They do it for free", "label": 1}
{"text": "I understood this reference!", "label": 1}
{"text": "And they wonder why people criticize modern AAA gaming so hard...", "label": 1}
{"text": "Lol damn man, that mod did NOT like that statement", "label": 1}
{"text": "Now I want to poke the bear and get banned", "label": 1}
{"text": "Mods. Ugh.", "label": 1}
{"text": "It's not surprising. The game has become some kind of lightning rod for controversy. When that happens there does tend to be alot of 'spam' and the mods start taking wide hammer swings.", "label": 1}
{"text": "Or frozen for that matter?", "label": 1}
{"text": "The art style is really ugly", "label": 1}
{"text": "So...\n\nIs EA paying Reddit mods?", "label": 1}
{"text": "Tbf, people are bombarding the game with bad faith criticism. Naturally fans will be defensive. I guarantee you if I went into the Elden Ring sub talking about how bad the graphics are they'd ban me. People don't like seeing their favorite things criticized. And it's even more difficult to accept criticisms when there's an active hate campaign against it.\n\nAt least they stick to their sub. Better than people forming hivemind in the general subs like this one.", "label": 1}
{"text": "Drama tourist moment.   Dude figured he'd roll in and kick up stupid shit, then come back here and play victim.  And look, it worked!", "label": 1}
{"text": "It’s not in consumer hands until tomorrow.", "label": 1}
{"text": "I mean, you are acting like a little bitch.", "label": 1}
{"text": "It should be public which mods did what, then there's accountability for actions.", "label": 1}
{"text": "Or just create a separate sub since it costs you absolutely nothing to do so.", "label": 1}
{"text": "Paid reviews", "label": 1}
{"text": "Can u tell me what was the name of the post?", "label": 1}
{"text": "The new one, yes.", "label": 1}
{"text": "Many such cases", "label": 1}
{"text": "You’ll only see what a few mods want you to see. Reddit is unfortunately one of the most heavily censored sites going", "label": 1}
{"text": "No?", "label": 1}
{"text": "When devs create shit, they better expect to get shit back.", "label": 1}
{"text": "It's not out yet - Only mainstream gaming journalists have reviewed it and of course they are gonna give it a 9/10", "label": 1}
{"text": "That basically means it will be horrible", "label": 1}
{"text": "Thats not cool", "label": 1}
{"text": "So telling the truth is now being dramatic? Yikes man", "label": 1}
{"text": "It's polarizing. For one crowd, it's a competent game with nice graphics, decent combat, and a decent attempt at world building. For another crowd, it's a betrayal of the dark tone of the DA universe, has bad writing, and very incoherent world building.\n\nI personally think this happened because the devs completely ignored the past entries in the series and targeted a whole new younger audience. And shifted the tone to a PG one, and visually stylized the characters in a WoW/Disney like vibe. So a lot of the old fanbase (which is vast) are unable to reconcile this game being part of the Dragon Age universe. But the new fans who like the lighthearted tone more don't see what's wrong, since they have no attachment to anything else.", "label": 1}
{"text": "Whats even wrong with giving criticism,  there was no racial, political or bashing of any kind except on the game.....ah nevermind you just disagree with him", "label": 1}
{"text": "And when they post the QUIT HAVING FUN comic.", "label": 1}
{"text": "For free ", "label": 1}
{"text": "Lol imagine trusting the scores of paid urinalists.", "label": 1}
{"text": "\"every review that disagrees with my pre-conceived bias is fake\"", "label": 1}
{"text": "This was a big problem in the LIS subreddit. the head mod worked for the company that made the new LIS game double exposure. and was incredibly heavy handed in removing all critisms of the game. and they absolutely did not label them as a brand affiliate, people only found out through twitter drama", "label": 1}
{"text": "You can tell by how sensitive they are about these comments that they’re expecting it to be extremely divisive lol", "label": 1}
{"text": "Give me the link to the post, I'll go an put the exact same comment there just for the lols", "label": 1}
{"text": "We don’t really know yet but the big problem people have as of right now is the shift in art style which to some people makes it look more cartoonish", "label": 1}
{"text": "His comment is so fucking tame lol, i guess everyone needs a safe space though", "label": 1}
{"text": "I don't care. I'm forty dude, I learned to pick the games I play without self-absorbed streamers and I'll continue to do so.", "label": 1}
{"text": "The problem with that is a lot of times devs and publishers will push news and updates on these subs making them all around better for fans.", "label": 1}
{"text": "Yes", "label": 1}
{"text": "This guy posts in the asmongold and critical drinker subs so i bet they are notgiving full context and likely deserved it.", "label": 1}
{"text": "I got my first ever permaban recently, from WorkReform. Wasn’t rude, wasn’t trolling, was a regular contributor, just said an opinion a mod didn’t like. Mod straight up admitted it didn’t violate any rule. \n\nBasement dwellers.", "label": 1}
{"text": "> no drama tourism\n\n🤷‍♂️ It's there in the rules chief", "label": 1}
{"text": "is crazy to me how most reddit mods spend their entire being on this platform just policing and prosecuting, it’s actually hilarious", "label": 1}
{"text": "The reviews indicate it’s good, but now BG3.", "label": 1}
{"text": "Stating an opinion in one goofy comment is hardly kicking up stupid shit.", "label": 1}
{"text": "Yeah it should be signed at the end like in an email. Bet a lot of this shit would stop when a name is linked to it.", "label": 1}
{"text": "Welcome to Reddit! 👋🏻", "label": 1}
{"text": "Those are the paid ones", "label": 1}
{"text": "An o got banned for a damn joke. These mods are outa pocket.", "label": 1}
{"text": "They are referring to the art style. It's very reminiscent of how a Pixar or Disney character looks. It's not inherently bad, it's just different. That being said, what they did to the Qunari is outrageous.", "label": 1}
{"text": "The difference being Elden ring actually looks good. Its world design and character models are amazing. The same thing cannot be said about Veilguard.", "label": 1}
{"text": "I mean if they want to enjoy content around the game without having to worry about drama stuff then they can do that. Some subreddits can get really spammy when in a situation similar to DAV so it can get tiring even for the people who just want enjoy some memes", "label": 1}
{"text": "how dare you?", "label": 1}
{"text": "Yeah the brigading is insane but I’ve been getting the subs recommended to me as well, so it’s probably to curve the influx of randoms that are incoming too. I never have played any of the games either.", "label": 1}
{"text": "Are you that triggered? All he said was it looked like Frozen. You’re the drama queen here", "label": 1}
{"text": "As if metascore meant anything nowadays", "label": 1}
{"text": "\"Criticism\" and \"drama tourism\" are two different things, champ.   \n\nOP's post wasn't some carefully well-thought-out critical point, it was a cheap, dumb drive-by to try to stir up shit.", "label": 1}
{"text": "Yep. Access Media/ Journalism. \n\nThey rate highly in exchange future access since they rely on that access to pay the bills.", "label": 1}
{"text": "This happens in every sun specific to a certain thing. Go into the Baldur's Gate sub and talk about how bad you think the game is, you'll get banned. This is how fandoms are across the board, it's nothing new.", "label": 1}
{"text": "Yeah…. Thats not gonna pay off how they think lol", "label": 1}
{"text": "It's a long story. The short of it is that Dragon Age used to have a darker tone. This last game looks like a Pixar movie. Although the writing has also been described like a Disney animated movie. So I'm not sure what this image was about.\n\nAll in all... it seems like it's your average AAA game in terms of gameplay. But in terms of writing, well", "label": 1}
{"text": "You can operate outside mod control. It's as easy as starting and growing your own community that you mod with your own rules.", "label": 1}
{"text": "Never, ever forget that the current reviews come from sites that EA/Bioware selected.   \nAny kind of site or youtuber that had doubts about the game didn't get a key.", "label": 1}
{"text": "It’s the whole gamer gate bat signal shit", "label": 1}
{"text": "Status quo for Reddit mods.", "label": 1}
{"text": "Tourists are the people locked in that sub’s bubble of toxic positivity, who treat Dragon Age as if it were a date sim", "label": 1}
{"text": "Yeah yeah, the reviews are still paid, come back and tell me theyre not when steam reviews score over 70% and then I will believe it and apologize. They all even use the same \"return to form\" sentence", "label": 1}
{"text": "I got perma banned from the pimple popping subreddit for asking someone to post their uvula mucus removal videos on a different, more fitting subreddit. I guess the mod really likes uvula mucus removal", "label": 1}
{"text": "Redditor complains about a game he will never play in the subreddit for fans of that franchise, gets banned, more at 7.", "label": 1}
{"text": "Wait a few days after release to know for sure. The conspiracy theory is that the review codes were handed out to reviewers who would surely give a good review to give a false rating. Probably nonsense, but compelling enough to give it a few days and see before purchasing", "label": 1}
{"text": "Been reading that subreddit for a bit and they are going to great lengths trying to defend their wasted money.\nNot only that but they are paying 70$ to get their intellect made fun of like they are toddlers.", "label": 1}
{"text": "Hahaha I love that people see these games and sub for what they are…", "label": 1}
{"text": "You don’t have free speech on this app because you agreed to terms and conditions. It’s a private app that you don’t have a guaranteed right to. Hope this helps.", "label": 1}
{"text": "I wish I was paid for reviews. \n\nSorry, but not everything that disagrees with you is paid.", "label": 1}
{"text": "That comment is baiting and trolling, which per the screenshot is against the sub rules.  Yall are such snowflakes.", "label": 1}
{"text": "There’s a lot of reviews saying the game is amazing and a couple by some YouTubers (like 2?) saying the game is terrible, so the truth probably lies somewhere in the middle imo.", "label": 1}
{"text": "Ban deserved. Clearly a troll/flame/bait post.", "label": 1}
{"text": "I was permanently banned from r/dragonage without warning for this reply discussing Dragon Age Inquisition's metacritic score:\n\n\"What are you talking about? It came out in 2014 dude. It was poorly reviewed because it was trash that was shallow and appeals to the lowest common denominator of gamers.\"", "label": 1}
{"text": "That should be OP's response to the mod: \" maybe you should... let it go\"", "label": 1}
{"text": "Except for DA:O was it ever good?", "label": 1}
{"text": "Yup. Express ticket to Losertown 😂", "label": 1}
{"text": "> I'll go in a subreddit of a community I'm not a part in to insult it in front of the people passionate about it for no reason ! I have no intention whatsoever to act in good faith or contribute to the discourse around it in any healthy way !\n\n> The mods removed me for adding nothing of substance to the conversation and polluting a space dedicated to fans of the thing :(((( how could they :'(((((\n\nThere's other places to complain about a game that's not even released yet, and that you wouldn't have purchased anyways.", "label": 1}
{"text": "These people haven’t even played it. They are just regurgitating opinions from their favorite culture war YouTuber or the one negative review it got. The desperation is embarrassing", "label": 1}
{"text": "Ok but like did they unban you after you asked to be unbanned? Because like if they do and they say “it was a joke I thought you’d laugh” then they are just a normal person with a sense of humor. But if they don’t then they are unhinged. Very important question.", "label": 1}
{"text": "I placed the same comment on that subreddit", "label": 1}
{"text": "There's a big difference between not stirring up drama and 'if you dare say anything remotely negative then get banned'", "label": 1}
{"text": "I was permanently banned from a sub for responding to a comment and ending my reply with \"cabbage peddler\".\n\nI was permanently banned (never even temp banned, muted or even given a warning of any kind before this) for \"rude or hateful comments\".\n\nThe guy's reddit name was literally \"cabbage_peddler\".", "label": 1}
{"text": "Found the mod that banned OP lmao", "label": 1}
{"text": "< 20 minutes \"Sorry, this post has been removed by the moderators of r/gaming.\"", "label": 1}
{"text": "Yea they changed the proportions and it makes them look cartoonish. I really don’t get why they made that choice. It’s pretty objectively worse looking and doesn’t really fit the world.", "label": 1}
{"text": "Subjective. This is not an argument, and it doesn't refute my point.", "label": 1}
{"text": "Plenty of people seem to like this game so far, but it's gotten a lot of heat for the art direction. Vocal fans have been having a pretty big war about it since the first trailer.", "label": 1}
{"text": "I hope you have fun with it!", "label": 1}
{"text": "They just did it here. We can't have memes about mods abusing power in here as well. It hits too close to the heart.", "label": 1}
{"text": "Nearly every non-journalist (IGN and such) reviewer is saying it's a bad game overall, or at least far from what a Bioware games fan would like. \n\nShallow writing, terrible voice acting and lip-syncing, bad roleplaying mechanics and freedom, terrible companion interactions, lack of stakes, and too much \"positivity\" (a BG3's Durge roleplay is impossible for example) the list goes on.", "label": 1}
{"text": "What a terrible day to have eyes and literacy.", "label": 1}
{"text": "You know what REALLY bugs me more than anything else here? It's an instant permanent ban with zero warning. How or why did this become a thing?\n\nI remember when we'd get a warning, like you're breaking the rules, stop. If you don't stop, you get a 1, 3, 6, 12 month cooloff. If you come back and you're still a dick, you get a perma-ban. Unless we're talking some really heinous shit, like you know some people used to post just outright illegal/horrible stuff, yeah, that's a perma-ban on first offense, sure.\n\nBut these days, for barely detectable level of impropriety? BOOM, you're permanently banned. Straight to the nuclear option, zero self-restraint, or consideration, or anything. Just a power trip. Boom, you're done, you're outta here.", "label": 1}
{"text": "What do you mean ‘of course?’  Mass Effect Andromeda has a 71 on metacritic.  Good reviews weren’t guaranteed.  \n\nSometimes things are good?  No conspiracy necessary", "label": 1}
{"text": "Toxic positivity ftw... The fortnite-mod-look is also not for me, but I guess I'm at least 30 years too old to be the target audience.", "label": 1}
{"text": ">” I guarantee you if I went into the Elden Ring sub talking about how bad the graphics are they’d ban me”\n\nProve it", "label": 1}
{"text": "Until a power tripper makes their way onto the mod base, \n\n\n\nNothing like modding 400 reddit forums at once to apparently make a guy feel powerful", "label": 1}
{"text": "I was banned from r/conspiracy for asking what the conspiracy was. The post was just a picture of a goat. Nothing else, no text description just the goat....", "label": 1}
{"text": "I think we just found the mod", "label": 1}
{"text": "That's basically how every gaming related sub is these days, lol.", "label": 1}
{"text": "Found the mod", "label": 1}
{"text": "> Nearly every non-journalist (IGN and such) reviewer is saying it's a bad game overall, or at least far from what a Bioware games fan would like.\n\nObjectively not true. I have seen a number of positive reviews from YouTubers. Mortismal Gaming for example. You people just tune out anyone that isn't agreeing with you. Ironic given what this post is about.", "label": 1}
{"text": "Most reviews point to no but all actual evidence points to yes. It's not hard to find clips of gameplay and cutscenes on the internet and see just how much of a trainwreck it is.", "label": 1}
{"text": "Not like you can talk either. You’re in that cesspool r/whitepeopletwitter.", "label": 1}
{"text": "Yea, 90% chance he doesn't even own the game. But mods are \"bad\" because they don't want their sub to become a cesspool of lame r/gaming memes and jokes from people with nothing else to contribute.", "label": 1}
{"text": "The Veilguard is going for a less gritty more colorful and stylized (some say cartoony) art direction, some fans of the older games violently dislike it. Particularly the Qunari race looks radically different from the previous game, though to the fair their design have not been consistent at all in any of the previous games.", "label": 1}
{"text": "I'm not going to go troll a sub to satisfy you. You do it.", "label": 1}
{"text": "What is lis?", "label": 1}
{"text": "What else do they have in life lol", "label": 1}
{"text": "Nah you just know you’re full of it", "label": 1}
{"text": "Well yeah OP went specifically to that sub because of the drama over it. So kinda understandable how they would ban you for that.\n\nYou can't tell me OP had absolutely no knowledge of the drama, independently went to that sub to comment on a highly brigades thread, and then came back to this sub to post about it. Their actions are *OBVIOUSLY* bait. Come on.", "label": 1}
{"text": "Prove it then. Go try it.", "label": 1}
{"text": "A lot just use a SubName_ModTeam account now to remove any and all accountability.", "label": 1}
{"text": "It's hard to say. I want it not to pay off, because it's poor recompense for all their loyal fans, and a slap in the face all in one. But at the same time, Bioware is hanging on a thread, after multiple terrible single player entries. And if they get enough \"new fans\" for this entry, they might be able to pass this as a mild success and pretend that this was the plan all along.\n\nAnd it's not like I can't appreciate a light-hearted game or stylized visual design. But I don't go to Dragon Age for that. The DA universe is very much married to the dark, gritty, depressing universe that it's a part of. It works wonders with its style of narrative and world building. So changing that in the span of one sequel is a cheap bastardization of the universe.\n\nThey should have just created a new IP with these light-hearted themes instead. But I am sure EA wanted cheap marketing off of the DA brand. Just creatively bankrupt executive decisions all around.", "label": 1}
{"text": "It's not subjective, it's objective. It won awards in those areas. It's factual at that point.", "label": 1}
{"text": ">Tbf, people are bombarding the game with bad faith criticism.\n\nThis OOP was banned, and your excuse is \"well some other people might be speaking in bad faith\"?\n\n>People don't like seeing their favorite things criticized. \n\nYour feelings don't trump discussion. This is a product being sold by a company. We are allowed to be critical and cynical of it.\n\n>I guarantee you if I went into the Elden Ring sub talking about how bad the graphics are they'd ban me.\n\nI guarantee you you wouldn't.", "label": 1}
{"text": "Nah, I know it’s not true", "label": 1}
{"text": "Women didn't always have the right to vote because there was no law for it. Did that make it right? No. \n\nStupid point.", "label": 1}
{"text": "Not at all.\n\nGo to the subs for World of Warcraft, Call of Duty, War Thunder (off the top of my head, those are some that I use) and many others, and make a thread saying that the game is bad\n\nThe replies will be along the lines of “Yeah this game is trash lmao”, despite those games having massive and dedicated playerbases", "label": 1}
{"text": "That venn diagram is nearly a circle.", "label": 1}
{"text": "I think the mods are just being overly careful because there are a lot of people trying to to take jabs and set the subreddit on fire with inflammatory remarks. It's like with the Last of Us 2 - people used the game as a rallying point for ideological beliefs instead of actually wanting to discuss the merits of the game itself. Honestly, I don't really blame them for trying to keep the place civil instead of devolving into a dumpster fire (exactly like TLoU2 subreddit did)", "label": 1}
{"text": "Imagine not knowing what free speech means", "label": 1}
{"text": "Is like when on the Monster Hunter sub there have been complaints about the unlocked armors and mods started to ban everyone", "label": 1}
{"text": "Mods salty", "label": 1}
{"text": "It wouldn’t be Dragon Age if they didn’t make some really weird and unsupportable design choices in successive games. \n\nDunno what their design lead is smoking, but it clearly doesn’t involve actually thinking about what gamers want.", "label": 1}
{"text": "I know what it means very well, thank you", "label": 1}
{"text": "You don't understand the concept of subjectivity. Please stop.", "label": 1}
{"text": "I havent seen any reviews, but YouTubers are less consumers and more advertisers and journalists. Once a YouTuber clears a certain size they are receiving offers and preferential treatment and incentivised to avoid overly negative feedback. \n\nGame might be a banger, but remember what South Park tried to warn us, everyone is an ad.", "label": 1}
{"text": "Would never happen in my beloved /r/hellletloose\n\n\nWe openly hate the game lmfao", "label": 1}
{"text": "Shared mod accounts should be against Reddit TOS in my opinion", "label": 1}
{"text": "Do you know how to read?", "label": 1}
{"text": "That's very fair. And honestly, I can enjoy the WoW style sparingly. But I really don't care for it in what was always intended as an RPG with a complex and dark world with intricate world building. It is so out of place.", "label": 1}
{"text": "Those the same two who are also saying the writing is like a marvel movie?  Because I've been seeing that talking point popping up a lot as well.", "label": 1}
{"text": "> This OOP was banned, and your excuse is \"well some other people might be speaking in bad faith\n\nYes. Because when there's an active campaign going on against this, and lots of trolls, even people who aren't necessarily trolling will get lumped in. \n\n\n> We are allowed to be critical and cynical of it.\n\nAnd mods are allowed to ban you for trolling. \n\n> I guarantee you you wouldn't\n\nGo try it and tell me how it goes.", "label": 1}
{"text": "Ah yes Mortismal, the same guy who praised Starfield", "label": 1}
{"text": "Yeah but in the previous games they looked cool AF. In this game they look like sexy squidward.", "label": 1}
{"text": "It's a mature game franchise that now looks like and was written for 10 year Olds. I was older than that when I played the original.", "label": 1}
{"text": "You do not understand the definition of the two. Yikes man.", "label": 1}
{"text": "So e games, Starfield being among them, tend to get taken over by people who don't like it early and that reflects on the way the sub is ran. TLOUs sub is notorious for this.", "label": 1}
{"text": "Except skill up, got a key and still posted his review which was do not recommend.", "label": 1}
{"text": "Just want to say both of your comments summed up my thoughts way better and more succinctly than I could have put them myself. ", "label": 1}
{"text": "The only low sodium sub I’ve been a part of was cyberpunk 2077, and they ended up having the right of it long before the general population caught on that the game was fixed and actually great. \n\nSubs can absolutely devolve into toxic memes and trying to outdo one another with “look at this tiny glitch I found LITERALLY UNPLAYABLE” karma farming.", "label": 1}
{"text": "Yes people have opinions that sometimes don't agree with you. Shocking.", "label": 1}
{"text": "they should use discord instead in my opinion", "label": 1}
{"text": "Burden of proof lies on the person who made the initial claim, I don’t know why social media dumbed people who enough to forget how an argument is supposed to work", "label": 1}
{"text": "I never played DA2 and ended up loving the story in Imquisition (and the base building tbh). \n\nI’m really hoping Veilguard gives the story a good payoff, but I’m not hugely optimistic.", "label": 1}
{"text": "Exactly. It's sad because it creates this polarization in the future of the franchise for no reason. Because the next entry can only faithfully serve one of these very different player bases, but not both. So it's a coin flip of whether any future DA game will be like any of the games that preceded this entry. Smart money says, no. Sad.\n\nI can only pray that the next Mass Effect entry won't copy this exact blueprint. I mean, sure, ME was never super dark, but it also had a realistic, gritty tone to the events, player choices, and narrative consequences. I'd like that to continue.", "label": 1}
{"text": "It doesn’t solve the main issue, nor does it prevent the new mod from becoming a new issue. There really should be a way to break their absolute power, like a vote-of-no-confidence system. Maybe even restrictions so the same person can only mod a certain number of subreddits.", "label": 1}
{"text": "You realize this is a false narrative right? Literally made up by a YouTuber who was mad he didn't get one. That's it. Pure speculation from one guy.", "label": 1}
{"text": "Getting that pissed about Frozen?\n\nSomeone needs to...chill out.", "label": 1}
{"text": "Well put.. seems to be an unfortunate theme happening with the AAA gaming industry. Slop after sliop", "label": 1}
{"text": "That would be your own fault for allowing it, would it not?", "label": 1}
{"text": "Yeah, I can see all those long mixtapes on Youtube vanish from here. But if that happens, I will start genuinely disliking Nintendo and actively pirate their games.", "label": 1}
{"text": "But… this person was wrong and heir source doesn’t agree with them. \n\nThe claim was that getting a cut from a rusty ladder has a higher chance to infect you than other cuts. \n\nThat’s absolutely **is not true**, and the above person was entirely correct in stating that. \n\nIn rebuttal this person provided a source that shows **the way you treat your cuts** changes the chance of infection. \n\nBut certainly you understand the difference between he source of the cut and how the cut is treated?\n\nA cut from a rusty ladder has literally the same exact chance at getting infected as every other cut, and those rates of infection are influenced by how you treat it. \n\nNothing about this source contradicts what the other person said. \n\nClassic Reddit indeed.", "label": 1}
{"text": "Brotato & Tiny Rogues", "label": 1}
{"text": "No need to go that hard to prove my point, have some self respect damn", "label": 1}
{"text": "What an awesome music theme!", "label": 1}
{"text": "Doomguy in the Doom series is frequently battling through hellish landscapes, often isolated in his fight against demons.", "label": 1}
{"text": "You're thinking of side-scrolling shooters (shmups), but if you liked Gradius, try Ikaruga! It's brutal but amazing.", "label": 1}
{"text": "Interesting one, always liked nft games", "label": 1}
{"text": "Netflix closes its A-level video game studio that never released a single game!", "label": 1}
{"text": "I read your first post originally and laughed and related since I got my girlfriend to play Mario party with me and she even asked to play again a few days after and she doesn’t play video games. In the second game I stole her star in the second last turn to take the lead and she got pissed saying it was some bullshit.\n\nWe laughed it off but I definitely was teasing her for a few days about it. I showed her this post and she laughed but then got mad again that I stole her star a few weeks ago.", "label": 1}
{"text": "omg the dog reaction is so freaking funny lol", "label": 1}
{"text": "Turning tables in bizarre ways!", "label": 1}
{"text": "Sounds like the government, but we know they'd never stop the funding for even a failure of a govt program.\n\n\nGo Trump!", "label": 1}
{"text": "That is a colourful tattoo.", "label": 1}
{"text": "Resident Evil 3 when I first saw Nemesis.", "label": 1}
{"text": "Should have got the first one tattooed on your face. Around your mouth. Then the second one tattooed around your asshole...", "label": 1}
{"text": "Fair", "label": 1}
{"text": "There's a huge difference and you're either lying or have bad eyes", "label": 1}
{"text": "Yeah they were inspired by our artist's work", "label": 1}
{"text": "Yeah so like I said I’m not blaming them at all, they have a process and it’s reasonable. But basically their biggest problem was that it should be flagged as frequent nudity, they don’t actually have a problem with the violence or gore or anything else. Each time they do a review it’s done by a different person so we thought we’d responded to some stuff but then another thing came up. It wasn’t just the Steam thing, but the combination of the whole experience. Yeah their reservations are totally reasonable.", "label": 1}
{"text": "Well that’s hurtful, but ok", "label": 1}
{"text": "Thanks! Yeah we are trying to make it play well", "label": 1}
{"text": "Yeah I mean it was about getting the content survey aligned with their perspective of the content, so that took a bit of adjustment.", "label": 1}
{"text": "'Yes bitch, effin obviously.'", "label": 1}
{"text": "Is there a reason arachnophobia seems way more focused on then anything else?\n\nIs it way way way more common than a fear of blood or the dark or the ocean or holes or a thousand other things common in video games?", "label": 1}
{"text": "Eww, you're such trash.", "label": 1}
{"text": "Halo 4, hands down didn’t vibe with the story at all", "label": 1}
{"text": "wow so freaking cool", "label": 1}
{"text": "Because Reddit is full of TikTok dummies and uneducated COVID children now.  Reddit has actually gotten worse over the last 7 years.", "label": 1}
{"text": "reviewed by a bunch of cherry picked troons/gays/activists", "label": 1}
{"text": "I have acrophobia and thalassophobia. For example: while playing Spider-Man and looking down the edge of a tall building; I’d get that prickly feeling all over my body. But I don’t need a mod to remove those things from the games because I’m not a gigantic pussy.", "label": 1}
{"text": "What's special about its NG+? Genuinely curious as I've been meaning to play the game, just haven't got the time right now", "label": 1}
{"text": "This is pretty good looking ngl", "label": 1}
{"text": "I am Ellas from Left 4 Dead 2!", "label": 1}
{"text": "Hey, when it comes to Dragon Age Veilguard, I totally get the mix of hype and hesitancy. It feels like this game has gone through more identity crises than a teenager on TikTok, especially with its shifts from Dreadwolf and the whole review key debacle. If you’re into Origins and DA2 vibes, maybe keep your expectations in check. I found myself waiting for reliable reviews after my last “release day regret” with [insert other game]. Speaking of engaging with the buzz on Reddit, tools like Pulse for Reddit can help dissect these heated discussions alongside classic gaming forums and trustworthy reviewer channels. It’s all about finding that ground truth, right?", "label": 1}
{"text": "\"Game where u battle a million foes. Like, so many foes u can't even count!\"", "label": 1}
{"text": "Tetris has best story ever, blocks unite to save world.", "label": 1}
{"text": "Translation:\n\n\"Dont be gay in ways I do not like\"", "label": 1}
{"text": "r/justneckbeardthings\n\nr/crybabythings\n\nr/fragile", "label": 1}
{"text": "Suicide Mission Mass Effect 2", "label": 1}
{"text": "Why is it different? Can you quantify in some objective way why the implausible characters are worse than the implausible swordplay?", "label": 1}
{"text": "and certain groups of others would not! and it's great to know before buying. i was cool with dragonage until 2 (i think) when dudes in my party started trying to fuck me.\n\nto each their own.", "label": 1}
{"text": "When you protest at political rallies for your cause... It's political.", "label": 1}
{"text": "Doesn't bother me they have LGBTQ+ content in the game. However, seeing the pronoun conversation and various other conversations. It seems to be clear they hired the Forspoken writers for this game. Will be a hard pass. All they had to do was do something similar to BG3 and it would have been a hit.", "label": 1}
{"text": "When you protest at political rallies for your cause... It's political.", "label": 1}
{"text": "There's an individual that Insists on being referred to as \"they/them\".\n\nIRL I don't much care for it, but it becomes a problem when it's front and center in a game about dragons and wizards I've waited a decade for.", "label": 1}
{"text": "When you protest at political rallies for your cause... It's political.\n\nSome of the morons in the comments... \n\nUnderstandable to see how they have done so much harm to their cause and have zero clue how or why...", "label": 1}
{"text": "An LGBTQ+ tag? Easy pass", "label": 1}
{"text": "I wouldn't recommend either of these as your first time playing an FPS RPG.\n\nBoth of these games while being an FPS are pretty different interms of their play style, combat style, etc. You'll certainly get really difference experiences in the two. \n\nIf I had to pick one I would say go with Fallout 4. It's a classic introduction to FPS RPGs, with a vast open world, engaging story, and tons of customization options. It’s also well-paced for learning RPG mechanics and FPS elements. Outer Worlds is great too, but Fallout 4 gives a more immersive first experience.", "label": 1}
{"text": "Very creative, nice job", "label": 1}
{"text": ">>Probably getting downvoted into oblivion, remember, no hate just a discussion. Be nice.. please?\n\nYea the allies don’t really want to discuss. They just want to talk at you.", "label": 1}
{"text": "He's on reddit, of course it is", "label": 1}
{"text": "no, i didn't. it was never jammed in my face.", "label": 1}
{"text": "I think it has more \"Classic\" RPG elements than Outer Worlds does though.", "label": 1}
{"text": "Who the fk is at rallies protesting female protagonist or POC protagonist...\n\nStay on track simpleton.", "label": 1}
{"text": " Wow, that's awesome!It's like hitting the jackpot in Cities:Skylines.", "label": 1}
{"text": "It is a political movement. Nothing more.", "label": 1}
{"text": "There are plenty of Japanese companies that would definitionally have the same 'work culture and ethics' that pump out dog shit games like Balan Wonderworld. \n\nI don't want to call anyone names or insinuate anything but I'm getting heavy weeb vibes from you if you think that a company being Japanese is the reason they make good games. You are either a weeb who needs to stop fetishizing and holding Japanese people to this higher regard OR you just have not played many Japanese games. I doubt it is the latter lol.", "label": 1}
{"text": "Being the main focus and center of attention of every single triple A gaming studio in the last 4 years? YES.", "label": 1}
{"text": "keep huffing, why people are so confident something will be good after these past 10 years of gaming I'll never understand. It might be good, it might not. The shilling is insane.", "label": 1}
{"text": "No shit, yet leftist Fanboys will come up with excuses that everyone plays it on Origin or Consoles...", "label": 1}
{"text": "I think the game is shit but makin post like this just makes you look dumb", "label": 1}
{"text": "I know you got downvoted by rabid drooling fans that can't control themselves but, you are right. This is the first time I've said fuck you to MH and it can rot. Framegen to hit spec requirements? LOL. I guess you could shove the red hot poker so far up most people's assholes it comes out their mouth and they'd still buy your stuff.", "label": 1}
{"text": "You literally just showed your opinion came from a youtuber. Keep being a sheep following what your told if you want.", "label": 1}
{"text": "r/SBCGaming is the sub you are looking for lots of reviews and advice.\n\nAlso check out reviews on YouTube, there are good one and bad one, Anbernic as others have said seem to make the most consistent ones.\n\nYou’ll find you can buy a unit and add your own rooms or buy the same for slightly more expensive were the seller has put the rooms on for you but you have no guarantee you won’t get a memory card full of trash games.\n\nAliexpress seems the place most folks use to get them at the cheaper price.", "label": 1}
{"text": "\"Remotely related to LGBT\"  \nYou mean related to excluding LGBT. \n\nBigot ass thinks he's got friends here.", "label": 1}
{"text": "Being gay isn’t politics you moron. Gay people are allowed to exist and be represented in media the same way any other person is. If you don’t like it, don’t watch/engage with it. It’s that easy. \n\nYou’re a bigot.", "label": 1}
{"text": "Nah think big like the corpo douchebags, live service ES6.", "label": 1}
{"text": "WRONG! Just Bestselling currently and that says jackshit, there is 0 other Games released today.", "label": 1}
{"text": "it's Looks cool bro😂😂", "label": 1}
{"text": "is Mario a doctor?", "label": 1}
{"text": "Lol tell you use insults like a douchebag just cus someone has a different opinion without telling that you are douchebag snowflake - just deal with is", "label": 1}
{"text": "bro you are amazing at drawing", "label": 1}
{"text": "You should play them in order.\n\n0 => K1 => K2 => 3 => 4 => 5  => 6 => 7 => Gaiden => 8", "label": 1}
{"text": "GTA v last mission option c🥷🏻", "label": 1}
{"text": "Good for them, that's so awesome!", "label": 1}
{"text": "One last note, respectfully this time (I apologize for my earlier tone). Yes, there are negative reviews, but reviews from critics are overwhelmingly positive. If you only send review codes to people and media who already show you favour and don't want to upset you, then there's going to be a bias towards positive reviews. It doesn't even mean the reviewers are lying. It's like going for a job interview but all your mates are doing the interviewing and maybe one or two randoms just for show. Hence the review scores are skewed. Originally I did not think this was true and that the \"anti woke\" crowd were just crying about it, but a large number of people - respected people- have said the same thing. Unfortunately the user reviews also won't be reliable because a lot of people will review bomb it without even playing it. For me: nothing I've seen makes the game very appealing to me. I think it will fail from a financial perspective because of its DEI inclusions which we've seen so far this year REALLY really get people riled up. But time will tell. You're welcome to believe differently.", "label": 1}
{"text": "You’re gaslighting them into answering a specific demonstration when the answer isn’t as black and white as that, which you didn’t even read, and you’re being disingenuous about using the word disingenuous to describe a paragraph as a Harry Potter chapter. Then you resort to calling them an incel Reddit after you already cried about being called a weirdo. It’s hilarious 😂 😂", "label": 1}
{"text": "Your Piper cosplay looks amazing! You totally nailed the vibe from Fallout 4. Happy Halloween! 🎃👻", "label": 1}
{"text": "I'd still fuck her clean or not", "label": 1}
{"text": "Buying that new game was quite the adventure! I went into it excited, but the experience really solidified my loyalty to my current platform/storefront. From smooth downloads to exclusive features and a vibrant community, everything just clicked.", "label": 1}
{"text": "Because they're dumb. And \"Fuck licenced gaming\" is a weird thing to say for someone making a thread asking why people don't realize software requires a license.", "label": 1}
{"text": "The game is not bad, just meh.\n\nThe dialogue is terrible compared to previous bioware games, the graphics are reminiscent of The Polar Express kind of movies.\n\nThe action is boring after a couple of hours and the leveling system is just nonexistent.", "label": 1}
{"text": "amazing cosplay", "label": 1}
{"text": "is there was any ai from 10 years ago? 😨", "label": 1}
{"text": "happy Halloween for everyone 🎉🎉🎉", "label": 1}
{"text": "still like the old ps3 logo better lol", "label": 1}
{"text": "moneeeeeeey 🤑", "label": 1}
{"text": "''Then there’s the buzzwords of raytracing. Games have been pushing that, but realistically it’s going to take the next generation to bring that to games without as large of performance hits''  used to be arcade games had the best grapics till about 1998, maybe pc could rival it, now its more like,  pc always has the best grahipcs but they try and make consoles cheap enough to sell, but sony did sell ps3 at a loss so maybe its like that with every console? but games and accsesories, online subscribitions make up for it", "label": 1}
{"text": "ive said, (well they probably do get more pay for it) but how about it every 3 months your boss just, well here's 500 $ extra or say 300", "label": 1}
{"text": "F the Journalist reviews you mean. \n\nUser reviews matter the most. \nThe only games where I listened to Journalist reviews I ended up disliking the most (Anthem, Diablo 4, Starfield)", "label": 1}
{"text": "They're still Electronic Arts. Stop it.", "label": 1}
{"text": "I wouldn't mind wearing that outfit to Halloween", "label": 1}
{"text": "Ppl mostly play online lol", "label": 1}
{"text": "This came out really good lol", "label": 1}
{"text": "If it was on steam it would've been the biggest goty", "label": 1}
{"text": "i pirated it and im having a hard time of wanting to play more. and im like 2-3 hours in.    i feel like i wasted my ssd space and healthiness.  my most used button is B on the controller (for skipping)", "label": 1}
{"text": "Alan Wake 2 is about a man who fights evil shadow monsters with a flashlight.", "label": 1}
{"text": "Devs put work into the wrong things a lot. If they are even competent to begin with", "label": 1}
{"text": "GLaDOS make Chell accessory for child playtime fun!", "label": 1}
{"text": "Grown ass man dressing up for Halloween? Sad stuff", "label": 1}
{"text": "Perfect GLaDOS quote for a potato mod lmao", "label": 1}
{"text": "Wish they would release every Nintendo game ever for switch", "label": 1}
{"text": "How old are you? If not a child dressing up like that is sad", "label": 1}
{"text": "> I generally am not downloading stuff from Steam and wondering if I might be getting malware\n\nThis happened multiple times in the last year alone and has multiple famous examples. Its funny you mention steam when steam hasnt had quality control in a very long time.\n\nhttps://www.pcmag.com/news/steam-store-spreaded-malware-after-hacker-hijacked-developer-accounts\n\nhttps://www.tomshardware.com/tech-industry/cyber-security/steam-game-mod-delivered-malware-on-christmas-day-epsilon-information-stealer-was-hidden-in-a-slay-the-spire-expansion\n\nThe first CS had a mod that had a loophole that could bypass workshop and deliver malware\n\nDynostopia from steam gave you malware\n\nAbstractism is another famous example\n\nthen there is the mobile stores, which are not angels either: https://www.darkreading.com/cyberattacks-data-breaches/malicious-apps-millions-downloads-apple-google-app-stores\n\nCentralization doesnt mean anything without quality control, and quality control is lacking in almost every marketplace there is.", "label": 1}
{"text": "Hey, nice costume! Looks like you nailed the Hatsune Miku look. Gotta say, the blue hair really pulls it all together", "label": 1}
{"text": "I’m good, just can’t phantom why people, as adults, would do such a sad and childish thing? This is a gaming sub, not a look at me I’m a hopeless child sub. That’s all", "label": 1}
{"text": "taste the major suckage, ya fuckin nerd", "label": 1}
{"text": "You misspelled being losers. I’m having a great time, not sure why stating facts makes me sad lmao", "label": 1}
{"text": "Rick moranis?", "label": 1}
{"text": "Ahh no see people are laughing at this person, it’s a child’s holiday yet adults continue to look foolish. Also, are you 80 years old, curmudgeon? Seriously? I’m amused by the fact my objective statements seem me to be lonely when I’m the furthest thing from?", "label": 1}
{"text": "But how? I’m secure enough to not prance around like a child in ridiculous costumes. I’d say it’s almost the opposite. Insecure people dress up to not show their pathetic selves. But go on, please", "label": 1}
{"text": "In all likelihood it m older than you. Creative? No, not at all lol children would laugh at this pathetic mess", "label": 1}
{"text": "Sure thing, halfwit lmao", "label": 1}
{"text": "Man like? wtf does that mean lmfao being a halfwit is fine, just recognize when you are.", "label": 1}
{"text": "I bet, little boy 👦", "label": 1}
{"text": "Like an* so stupid you don’t even know proper grammar", "label": 1}
{"text": "Obviously it's not, because I have no idea who he's supposed to be, and I'm the target demographic for 'nostalgic video game' anything.", "label": 1}
{"text": "Well. \n\nWhen it's being called a classic, and some people are acting like everyone should know who they're supposed to be, I feel like it's appropriate to ask who the fuck it's supposed to be when I'm almost 40 and have been gaming for most of my life, and I have absolutely zero idea who it's supposed to be. \n\nFuck me I guess, right?", "label": 1}
{"text": "That’s his name on YT. Angry Video Game Nerd, or Cinemassacre. Saying it in all caps makes you sound more dumb, btw. It doesn’t convey anything.", "label": 1}
{"text": "I'm so sorry I don't exist on YouTube watching other people play games? I guess?\n\nI have absolutely no idea who the fuck this is supposed to be. It looks like someone trying to be Bubbles with some OG Nintendo gear to me. Again, I'm so sorry that I spend my time playing games and not watching people play games? I guess?", "label": 1}
{"text": "Me saying \"hey, I don't know who this is\" is rude? Especially when it's called a classic and nostalgic in the same comment that I replied to? \n\nHave you tried not being a little bitch? Like...fucks sake. Sorry I don't like your favorite YouTuber? I guess?", "label": 1}
{"text": "Oh. I'm the butthurt one because I don't know who a low effort Bubbles with a power glove and a zapper is cosplaying as? \n\nYou fistfucking me right now?", "label": 1}
{"text": "And no, a couple million views isn't any kind of accurate metric. Bot accounts are a thing. Paid views are a thing. \n\nGet real.", "label": 1}
{"text": "Abcdefghijklmnopqrstuvxyz\n\nAnything else? I'll still give you my number and we can have a conversation. \n\nBitch.", "label": 1}
{"text": "Nice one", "label": 1}
{"text": "Because I don't know who this 'classic' person is this guy is cosplaying?", "label": 1}
{"text": "After absolutely queer of the year velingard i have’t any hope about mass effect franchise it will be absolutely bullsh*t.", "label": 1}
{"text": "Sure. Because I'm getting shit on for not knowing who this Nintendo Bubbles fuck is. \n\nMaybe people need to realize that not everyone watches the same shit they do, and along a question is just asking a question, and not asking to get fucking railroaded because I'm apparently not current on my 'classic' video game commenter pop culture. I prefer to actually play my games, and not watch people play and comment on them.", "label": 1}
{"text": "Well maybe, possibly, if people didn't just act like I should fucking know, and given me an answer to my original 'who is this guy supposed to be' question, I wouldn't have felt the need to be so aggressive. \n\nStop white knighting for shitty people that didn't want to give me a name. That's all I wanted. Now, because it took like a fucking hour to get a name, I'm a little irritated. I **might** possibly be trying to irritate other people now.", "label": 1}
{"text": "Cunt", "label": 1}
{"text": "Nah, too much audience and money in gaming for it to not be politicised, also developers nowadays feel more like activitists, they don't care about gaming experience and how to make something unique", "label": 1}
{"text": "Damn so Cities Skylines 2 from a very fit girl is now safer than the official one, keep biting the curb paradox", "label": 1}
{"text": "Biopunk 🙂", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "oh. sad", "label": 1}
{"text": "nice", "label": 1}
{"text": "looks nice", "label": 1}
{"text": "interesting", "label": 1}
{"text": "Looks nice", "label": 1}
{"text": "Op says they don't care about culture wars and that's fair but also says they don't think bioware is pushing a political message. But you can literally pick 3 different options where your character in game monologs out loud that they are trans and they are so happy to be trans etc.\n\n\nPerhaps OP should do some research on their own...", "label": 1}
{"text": "I totally support banning Asmongold subreddit members", "label": 1}
{"text": "This one:\n\n[https://www.threads.net/@corinne\\_at\\_last](https://www.threads.net/@corinne_at_last)", "label": 1}
{"text": "So funny to see how little upvotes this has. That's a lot of triggered leftie redditors right there who base their whole personality on social justice and gender identity.\n\n\nThe article is spot on. Keep this trash out of our games. We want entertainment, not lectures. ", "label": 1}
{"text": "Ddue, are you going to shoot those shitty games that suck ass?", "label": 1}
{"text": "This is why your party is losing voters. It's not the policies, it's the condescension and purity testing. Do better. ", "label": 1}
{"text": "lol pussy, can't even stand behind your convictions.", "label": 1}
{"text": "1. You don't need to number your points, a child could follow what you're saying.\n2. Seriously. Stop.", "label": 1}
{"text": "That fcking Paradox Mod, should have stayed on Steam workshop", "label": 1}
{"text": "Frankentato", "label": 1}
{"text": "Never reply to these always online pedants - they never see past their double chins anyways.", "label": 1}
{"text": "Clearly they just hate gay people. That's the only reason why anyone criticizes anyone these days. Damn bigots!", "label": 1}
{"text": "I need to kill my self", "label": 1}
{"text": "GTA 6: Steal cars, rob banks, and pet kitties!", "label": 1}
{"text": "I love how a rule to misgendering is to not make it about yourself because the trans person is already trying to do that. This scene feels like there’s a trans developer who wanted to teach all their bullies a lesson and that’s why it comes off so bad.", "label": 1}
{"text": "Yikes. I couldn't imagine putting that on your arm permanently.", "label": 1}
{"text": "You gotta mask harder. Your culture war is flashing and people can check your post hospital to see you ask questions like “Why do people support Kamala when she is the opposite of democracy?”", "label": 1}
{"text": "Veilguards lookin' fly, got me hooked!", "label": 1}
{"text": "Your mum says hi.", "label": 1}
{"text": "Infamous 2,  the good ending. Seeing Cole sacrifice himself was pretty heartbreaking.", "label": 1}
{"text": "Now I wasn't expecting much anyway. EA so I had an inking it would be shit, but Bioware threw confusion into the mix, could be very good and could be sandy balls bad. So I got it for free instead", "label": 1}
{"text": "It’s a Beta you dumbass…", "label": 1}
{"text": "> call it a fun night", "label": 1}
{"text": " RPGs are gaining popularity, battle royales are still going strong. MOBAs are kinda dying out.", "label": 1}
{"text": ">..... But yea apparently he's some hard alt right figure. Nuance and centrism is dead in 2024.\n\nIgnoring that he parrots and engages with tons of alt right IDPol ragebait constantly. There's a reason his subreddit looks like r/Kia 2.0", "label": 1}
{"text": "Decent", "label": 1}
{"text": "Bruh, take an L that you made a stupid joke already and walk away, you’re spouting more and more bs trying to somewhy defend it lol", "label": 1}
{"text": "... did you even read my comment? I explained perfectly.\n\nfor some one so obsessed with grammar you seem to have very poor reading comprehension", "label": 1}
{"text": "ooohhhhh, my bad.\n\nyou're just an asshole.\n\nnever mind.", "label": 1}
{"text": "10 years in MH:W made you a fucking potato", "label": 1}
{"text": "You can thank these terminally online political activist freaks for forcing it into every form of media imaginable. They live such a miserable life that they want to ruin things for other people. Pathetic if you ask me.", "label": 1}
{"text": "Oh yeah, I’m sure you spoke to a linguist your self. Meanwhile in reality…", "label": 1}
{"text": "Yeah there’s the BS lie I was expecting lmao", "label": 1}
{"text": "looks like a chonky version of the later lara craft minus the badge", "label": 1}
{"text": "The famous Lara-Clette", "label": 1}
{"text": "Netflix adaptation", "label": 1}
{"text": "This is such an embarrassing hill to die on. You misunderstood that they were talking about a show and not an actual neighborhood and then you've proceeded to baby rage for an HOUR.\n\nIt's not that deep, I can't tell if you're just super easily triggered when you're in the wrong or this is the most human interaction you've gotten in a while so you're clawing at the opportunity to socialize by any means.", "label": 1}
{"text": "You're an idiot", "label": 1}
{"text": "Misunderstood by lack of capitalization yep. \n\nMeanwhile y’all are baby raging because the original poster was wrong. Why don’t you move on with your day if it’s so insignificant?", "label": 1}
{"text": "Stubby and brave", "label": 1}
{"text": "Its the Fuc\\*\\*ng Nerd!! \\^\\^", "label": 1}
{"text": "I feel like a normal person that's used to regular human interaction can still understand what someone else means regardless of capitalization or even grammar for that matter so I'm assuming it's more of my latter point than the former.\n\nI'm gonna move on from this since I actually have people to talk to so hope those social skill get better friend and maybe you'll learn to chill out a bit more. Wish you the best!", "label": 1}
{"text": "Damn, Jill got real thick.", "label": 1}
{"text": "Oh abused the suicide report button? I hope you get banned for that.", "label": 1}
{"text": "where is Jill? Is she in the room with us?", "label": 1}
{"text": "Jill been eating good 😊", "label": 1}
{"text": "The veiled OF ads posting as cosplay has gotten to the point where we even get the low tier lewd girls", "label": 1}
{"text": "Oh duuude", "label": 1}
{"text": "Jill Cholesterol", "label": 1}
{"text": "Bro what are you even talking about? You can't take someone correcting you over something so miniscule you start reaching for any random string of words to respond with just so people keep talking to you?\n\nAre you actually ok? This isn't how you keep people wanting to keep socializing with you friend.", "label": 1}
{"text": "Netflix&Grill", "label": 1}
{"text": "Normally I’d say it’s a tasteless comment, but this looks like an ad veiled as a post so this person can get made fun of every which way.", "label": 1}
{"text": "Dressed like Jill, built like Nemesis", "label": 1}
{"text": "Netflix&TubOfIceCream", "label": 1}
{"text": "Ain’t running from no Nemesis like that", "label": 1}
{"text": "Maybe she is someone who enjoys the franchise and is expressing that? And gtfo with “low tier lewd girls”", "label": 1}
{"text": "this is like your third time posting this shit. wasn't the 8k likes you recieved in the resident evil subreddit enough?", "label": 1}
{"text": "Straight from the OF bargain bin lmao", "label": 1}
{"text": "Reported again for incivility. Your campaign of insulting me because I made spelling correction is wild. Like actually at the end of the day you’ve just been a huge jerk to feel superior because… you didn’t like I spell checked someone? \n\nWho does that? This isn’t how humans interact  with one another. Do you get that?", "label": 1}
{"text": "What you gonna steal?", "label": 1}
{"text": "She literally have her fansly linked in her profile my little white knight", "label": 1}
{"text": "That word has completely lost any meaning. The incredibly low IQ group that spam it like a Tekken move really need to learn its definition.", "label": 1}
{"text": "My Blak Super Mario custome! So fly!", "label": 1}
{"text": "Positive toxicity.", "label": 1}
{"text": "Poor Nemesis.", "label": 1}
{"text": "By correcting someones grammar, then being corrected because you misunderstood and finally getting upset for over an hour? Yeah I don't think that's how people interact in a normal social setting but whatever makes you feel better.\n\nVery confused about what part you consider to be \"incivility\" or if it's just you misunderstanding my comments the same way you misunderstood OPs but that's fine.", "label": 1}
{"text": "Even if she did, NOTHING in this picture says that. Brain rotted porn addicts", "label": 1}
{"text": "Jill has been spending time at the buffet", "label": 1}
{"text": "Imagine paying for this ‘content’ lol", "label": 1}
{"text": "Gotta advertise her OF/fansly somehow", "label": 1}
{"text": "This comment section is ruthless 💀", "label": 1}
{"text": "OP is a seller lol, she doesn’t reply… on Reddit, but catch her on fansly!!", "label": 1}
{"text": "He probably just didn't check her profile. There's no need to ridicule him", "label": 1}
{"text": "i need a time machine so i can live a life where women aren't attention *****s online", "label": 1}
{"text": "So this user calls another user an incel, then you say they shouldn’t be ridiculed? Shouldn’t that be a message for the person who called them an incel?", "label": 1}
{"text": "Cool! What waistline is that?", "label": 1}
{"text": "whatever you say gen z", "label": 1}
{"text": "A lot of racists in here being like \"omg why not regular mario\"...amazing", "label": 1}
{"text": "No and neither were 2k calories.", "label": 1}
{"text": "I expect someone to comment \"Jill Fatlentine\" already, but nobody has.", "label": 1}
{"text": "Look at that subtle off white coloring, the tasteful thickness of it.", "label": 1}
{"text": "It's ok, she's got thick skin.", "label": 1}
{"text": "Jesus you had me dying of laughter in my office, i had to see her post history and i see what you mean lol who in the fuck is paying for this.", "label": 1}
{"text": "Lovers terminally online....", "label": 1}
{"text": "\"I dont care about upvotes anyway\"- literal comment by OP on like the 3rd recommended sub I've seen some variant of this cosplay in.", "label": 1}
{"text": "Bill valentine", "label": 1}
{"text": "More like Eat Valentine", "label": 1}
{"text": "Savage af 💀", "label": 1}
{"text": "Getting angry at women who sell sexual content is like Incel Law #1. In this case, the meaning is spot on, whether you want it to be or not. That doesn't mean I disagree with you about anyone posting a thinly veiled ad for their sexual content in places where it's meant to serve as bait, however.", "label": 1}
{"text": "😂", "label": 1}
{"text": "Jill? more like Huge ill", "label": 1}
{"text": "Says the guy banging the “toxic positivity” drum in every thread they come across. What, are you trying to get a raise out of people? Why are you posting if not to have someone’s attention for a moment?", "label": 1}
{"text": "Jill AteAllTheValentinesCandy", "label": 1}
{"text": "Don’t lie", "label": 1}
{"text": "the worst kind", "label": 1}
{"text": "Free OF go crazy", "label": 1}
{"text": "Looks like you ate Jill", "label": 1}
{"text": "Wales", "label": 1}
{"text": "name more than one thread where i talked about that. try harder next time", "label": 1}
{"text": "Would you take her to the Mall?", "label": 1}
{"text": "I guess zombie burgers are pretty tasty 🤣\n\nWhat apocalypse? What meat shortages?", "label": 1}
{"text": "I mean... Kinda deserved.", "label": 1}
{"text": "whatever you say femboy", "label": 1}
{"text": "Jill Thanksgiving", "label": 1}
{"text": "Not even thinly veiled", "label": 1}
{"text": "You can’t possibly be this dense my guy. Look at her bio and post history and it is very clear what she is doing", "label": 1}
{"text": "LMFAO", "label": 1}
{"text": "recake version*", "label": 1}
{"text": "Fucking perfect", "label": 1}
{"text": "Jill has a chin though.", "label": 1}
{"text": "I always thought there was a huge food problem in the Resident Evil lore", "label": 1}
{"text": "She needs at least on OF video called \"Thar she blows\"", "label": 1}
{"text": "Only the ground floor.", "label": 1}
{"text": "Whale's*", "label": 1}
{"text": "I actually thought this was in game screenshots", "label": 1}
{"text": "/r/thatsthejoke", "label": 1}
{"text": "Thickness alright", "label": 1}
{"text": "Might even say thickly veiled.", "label": 1}
{"text": "fatness\\*", "label": 1}
{"text": "Hahahaha, coming from the loser who is going through other peoples comment history to find something they disagree with. \n\nAlso, I only comment on reddit once or twice a week, so you are wrong again. You just made yourself look so pathetic.", "label": 1}
{"text": "Reddit gives me a weight watcher add in this thread.", "label": 1}
{"text": "Grill Valentine", "label": 1}
{"text": "I don't think its a \"women\" thing, it's more an insult to everyone's mental image of the character. I'm sure a fat guy would receive the same vitriol if he cosplayed as Cloud Strife and put an OF link in his bio.", "label": 1}
{"text": "🧢", "label": 1}
{"text": "Jill ate the sandwich", "label": 1}
{"text": "*size ate", "label": 1}
{"text": "Thank you for explaining though.", "label": 1}
{"text": "a touch of Hip Hop meaning his gold watch and gold necklace? That's just a lack of effort. There's plenty of hip hop styles that he could have blended with Mario colors to make it.", "label": 1}
{"text": "To attempt to tip the shit scales back to shit i prefer like not having reddit plagued with fat chicks trying to peddle their nudes", "label": 1}
{"text": "Who is getting angry lmao", "label": 1}
{"text": "AC hasn't been good since black flag!\nUbisoft needs a reboot...", "label": 1}
{"text": "I'm always surprised when someone like you legit asks for clarification then doesn't just start attacking me anyway. Thanks for being reasonable!", "label": 1}
{"text": "You blew this so out of proportion it's hilarious. It's all you man. This might be the most autistic series of posts I've ever seen on reddit.", "label": 1}
{"text": "And there was the point in time where people had to admit it was time to move on from the PS One. \n\nNot saying MH Wilds isn’t absolute dogshit in terms of optimization but people expecting too much from old ass hardware is equally true.", "label": 1}
{"text": "Do you wonder why you don't have friends any more? Shit like that is why fatass", "label": 1}
{"text": "how dare you, transphobe", "label": 1}
{"text": "Hi there it seems you forgot to indent your paragraphs as someone who is passionate about grammar I expect better behaviours in the future regarding it. Also, it seems you spelt the word \"overheard\" wrong an spelled \"overhead\" instead. This is upsetting.", "label": 1}
{"text": "guh? no my comment was always a joke. everyone took it seriously which is equally funny.\n\npeople are insane.", "label": 1}
{"text": "That was the main thing about vlaha I didn't like. I stopped playing after the first mission since I couldn't get into it. Maybe I could have it it wasn't called assassin's creed.", "label": 1}
{"text": "You're an idiot", "label": 1}
{"text": "What makes it a black Mario costume", "label": 1}
{"text": "You cared enough to make this dumb comment?", "label": 1}
{"text": "Eastern bloc wackos", "label": 1}
{"text": "Please keep this nerd out of my feed", "label": 1}
{"text": "Dragon Age Reviews Are The Best!", "label": 1}
{"text": "What an idiot. Or maybe a minor. Either way your brainless, your \"demo\" is specifically so they can stress test and see how the game performs \n\n\nI know your a fucking idiot but your also QA , stupid ass", "label": 1}
{"text": "Skating games are like, totally about ice cream cones and unicorns, right? 🍦🦄", "label": 1}
{"text": "They need a better pc. Jesus christ these loser mfers. Get a job, buy second parts, and shut the fuck up. Game runs fine for me.", "label": 1}
{"text": "Is that supposed to be directed to me? I started playing MH from FU on the PSP when I was a kid. Even soft-modded the PSP to play Monster Hunter Portable 3rd.\n\nThink whatever you want lol.", "label": 1}
{"text": "Awesome looks\nReal vintage", "label": 1}
{"text": "Awesome looks\nReal vintage", "label": 1}
{"text": "Is giving the feedback that its poorly optimized complaining? Thats literally the definition of feedback?", "label": 1}
{"text": "Balatro is the GOAT of 2024!", "label": 1}
{"text": "Mario is italian...", "label": 1}
{"text": "i love snowman.", "label": 1}
{"text": "NSFW games don't magically sell, it requires effort since every platform blacklists you.", "label": 1}
{"text": "Probably cause they were focused on making trannys happy instead of the game", "label": 1}
{"text": "Lol I see this every game release nowadays when a game has anything LGBT related to it.", "label": 1}
{"text": "I will try myself and decide if game is good enough for me or not", "label": 1}
{"text": "I'll trust the steam reviews, thanks. I can see for myself that the vast majority of the negative reviews on steam bought the game, played it for 20 minutes and refunded it. They are OVERWHELMINGLY \"product refunded.\"", "label": 1}
{"text": "You okay? \n\nThey're not contrasting user vs critic reviews, they're stating the fact that EA gatekept who could review the game before launch.\n\nAnyone who even had *slight* criticism of the preview, didn't get review codes, because EA wanted as many positive reviews as they could, to bump sales early on. Fextralife and many other reviewers on YouTube have said as much. \n\nNow, many reviewers who didn't receive review codes, bought and reviewed the game anyways, and didn't like it. \n\n IGN/Gamespot did get the codes, as they pretty much write advertisemebts for the game instead of actual reviews. If you trust IGN over independent game reviewers, you're delusional.\n\nYou should've looked into it before being a crazy person over nothing.", "label": 1}
{"text": "Okay so you build a thing. Said thing produces other things. You sell said things all the monies belonging to you. BUT a guy is mad cuz he wants but to lazy to get monies for said thing. So guy spends all time into making emu for said thing. For no monies But then cant buy said thing so he takes from another guy that bought said thing. And still no monies being made. BUT then humans now talk all said thing. SHUT THE FUCK UP. You want humans too steal your shit??NO! The artist at these companies WORK tirelessly to bring you content. Get off your fat ass make monies, and buy a goddamn switch, DL Tetris. FOR FUCK SAKE....This Shit doesn't just come out of thin air. This why humans are broken/broke. Dont want to work hard or pay hard work. HUMANS ARE DUMB!!!!!!!!!!", "label": 1}
{"text": "You get what you fucking deserve greedy fucks cs2 will forever be a disaster masterclass do not buy that game", "label": 1}
{"text": "I'm getting tired of people demanding games arbitrarily have a completely irrelevant amount of \"representation\" of \\*insert ethnicity or subset of the world population\\* to meet corporate checklists, vandalising wikis to propagate their headcanon that every vaguely androgynous character is \"non-binary\", whining about attractive characters, and harassing/doxxing artists on Twitter only to spam CP on their accounts because they (ironically enough) are on a witch-hunt against \"underage characters\".\n\nBut I'm not making stupid drama threads in r/gaming about it either. This isn't a circlejerk hugbox for that sort of rhetoric, like r/Gamingcirclejerk is.", "label": 1}
{"text": "It's a game.  What's driving you to care what others think?  I won't give a \"woke\" game a millisecond of my time, let alone money?  I could care less if you do or not.\n\nIt's easy.  Stop wanting other's to think like you do.", "label": 1}
{"text": "\\~\\~\\~ᗡ===3\n\n  \nYou're a jizzer Harry", "label": 1}
{"text": "You absolutely need glasses.\n\nYou will never notice a damn fucking thing in actual gameplay.\n\nYou must be one of those miserable people that get 400x zoom on a random rock and go \"OMG SO BLURRY\"\n\nDo you even enjoy games?", "label": 1}
{"text": "nice", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "> hunter again without feeling stupid", "label": 1}
{"text": "why black ? bruh its brown", "label": 1}
{"text": "So you went as a youtuber? Thats pathetic", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "#Truth\n\nIn England the police guns are evil devil's metal.", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "😅Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "It's great that even a person who recognizes your outfit can make it special It's all about expressing yourself and having fun", "label": 1}
{"text": "What a game amazing and beautiful game", "label": 1}
{"text": "Micah Bell RDR2", "label": 1}
{"text": "What he did to those to Ciri and poor girls in the tub, fucking degenerate", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "true", "label": 1}
{"text": "true", "label": 1}
{"text": "true", "label": 1}
{"text": "it's really cool", "label": 1}
{"text": "yes", "label": 1}
{"text": "mee too same", "label": 1}
{"text": "nice", "label": 1}
{"text": "84 is the new woke agenda politics score.", "label": 1}
{"text": "silent hill", "label": 1}
{"text": "yes", "label": 1}
{"text": "oh", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "true", "label": 1}
{"text": "No way! Bald Turd Gay 3 is my personal GOTY from the past year. Glad you're enjoying it.", "label": 1}
{"text": "90% of human beings on the earth are sick of this custom pronoun garbage. You’re the minority", "label": 1}
{"text": "look at this guy. he's a fuckin' nerd. what a piece of shit buffalo diarrhoea fuck fart.", "label": 1}
{"text": "Emulators are the best, a world of classic games available!", "label": 1}
{"text": "When you buy a digital game you are buying a *license* to use that game for an indeterminate amount of time. It is not a corporations job to hold your hand like a fucking child and come into your room to remind you that their storefront is migrating and you need to transfer things. You do not *own* digital games, period, full stop. If you bothered to I don't know? Read what you are signing up for? This wouldn't be an issue. It sounds like you hate the idea of big corporations being able to take your games away whenever they want. Maybe don't give them your business, or if you do, make sure you actually have a grasp on what you're getting into. You have a literal child's understanding of how the world works. You stomp your feet about Muh corpos and muh capitalism and it's gross.", "label": 1}
{"text": "But old things are? Religion is held up as unassailable despite being an actual \"ideology\" used to hurt real people.", "label": 1}
{"text": "Imagine unionically posting this shit lol  \nI seriously hope you are 12 because this comment is so incredibly fucking cringe.", "label": 1}
{"text": " They better not screw up next Mass Effect", "label": 1}
{"text": "Coincidentally it has been pushed back to black history month.", "label": 1}
{"text": "That's almost lifelike! Very well done, looks amazing!", "label": 1}
{"text": "Guy was definitely a fetal alcohol syndrome baby.", "label": 1}
{"text": "Let's hope so.", "label": 1}
{"text": "Butt hurt much? Try lube next time.", "label": 1}
{"text": "This dude looks like Jake Paul's twin!", "label": 1}
{"text": "The day after the fight with Tyson", "label": 1}
{"text": "I started RDR too, this guy is especially annoying, like Jacke Paul", "label": 1}
{"text": "Lol it's fascinating watching peoples brains break when discussing topics like this. There's so many comments itt giving reasonable explanations why they don't like dialogue like that in fantasy games. But when it comes to people like you it's always in one ear and out the other. it's like you're allergic any semblance of nuance.", "label": 1}
{"text": "I do this but with Twitch and DCGO lmao", "label": 1}
{"text": "Branching approaches", "label": 1}
{"text": "Need more game open world past 100 years!", "label": 1}
{"text": "Your reaction to all of this is honestly hilarious. How do you make it through the day without expending all of your energy getting riled up over shit that absolutely does not matter?\n\nI can only imagine this is exactly what you're like in real life whenever you have a slight disagreement with someone over something inconsequential.\n\nOne word to describe you... \"exhausting\".", "label": 1}
{"text": "Spoiler alert for bo6 Mason eing the reason harrow is evil is such a good twist because the player doesn't ask where mason is", "label": 1}
{"text": "I look at this art style and my first thought is form over function", "label": 1}
{"text": "If it doesn't matter like you said, why even bother doing it in the first place. Your argument are as miserable as weirdos request.", "label": 1}
{"text": "10/10", "label": 1}
{"text": "At same time I'm glad and sad there are people like me rn", "label": 1}
{"text": "well i mean donkey kong country on the snes keeps up with ps1 but the leap in graphics from 16 bit to 32 was substansial", "label": 1}
{"text": "Captain. What happen? Someone set up us the bomb. We get signal! Main screen turn on. It's you!  How are you gentlemen? All your base are belong to us. You are on the way to destruction. You have no chance to survive, make your time. Hahaha...", "label": 1}
{"text": "Yeah, improve your relationship with Cuno enough and he ditches Cunoesse for being a bad influence... and when talking about her, he's glancing over his shoulders like he's afraid she'll show up randomly and kill him.\n\nAlso, >!if Kim is too injured to help at the end of the game, Cuno serves as your partner.!<", "label": 1}
{"text": "Yes it is probably one of the most offensive replies imo.  Apparently you don't know either so just shut the fuck up and let someone who does speak up", "label": 1}
{"text": "Goodness gracious me, what a fantastic tat! I commend thee with the internet win of the day", "label": 1}
{"text": "Christmas is coming.", "label": 1}
{"text": "cool game.", "label": 1}
{"text": "This is a bit unpopular probably but if it were released today it would make bank as a mobile game.\n\nMankind.\n\nIt was a MMORTS made by Vibez, later bought by O20E or something. It was a persistent universe that continued when you logged out. Early buildings/units took a few minutes to build, then more advanced took hours, even more advanced took days, and high tech units took weeks/months to build. You also had to research them, and that took weeks/months.\n\nBuilding things took a long time. You would have to plan things days/weeks ahead of time. Especially since if you went to a new system or planet, you often had to build a bunch of lower tech stuff before you had the storage room to build high tech stuff.\n\nAnyway, with monetization they probably could've made a fucking killing. They just charged a sub back then. There were free accounts too but you couldn't do much with them.", "label": 1}
{"text": "I started Red Dead Redemption", "label": 1}
{"text": "looks nice", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "nice", "label": 1}
{"text": "oh", "label": 1}
{"text": "yes. Looks nice", "label": 1}
{"text": "Yes. I love that game", "label": 1}
{"text": "hmmm. nice", "label": 1}
{"text": "yeah", "label": 1}
{"text": "I like it", "label": 1}
{"text": "looks good", "label": 1}
{"text": "yeah", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "agreed", "label": 1}
{"text": "looks like", "label": 1}
{"text": "Posting it on Reddit is a thought on it own... but playing two games at once is insane", "label": 1}
{"text": "Looks really cool", "label": 1}
{"text": "It sounds like you're juggling a lot to keep your mind busy. Distracting yourself with two games can be intense!", "label": 1}
{"text": "Starting up again can feel daunting, but remember why you loved gaming in the first place. Maybe explore new genres or replay old favorites to rediscover that spark.", "label": 1}
{"text": "Yes, there are several zombie apocalypse games that feature base building, including using your own house or landmark buildings like a mega mall12. Here are a few you might enjoy :**State of Decay 2**: You can build and fortify your base in various locations, including your own home.\n\n**They Are Billions**: This steampunk strategy game lets you build and manage colonies, including using large structures like malls for your base.", "label": 1}
{"text": "Oh, for sure. Whether it's a character sipping on an energy drink with the label facing the camera or strategically placed billboards in the game environment, product placement is everywhere ....", "label": 1}
{"text": "I can show you more of it", "label": 1}
{"text": "I can show more of it ", "label": 1}
{"text": "Op posted this previously.  Spam", "label": 1}
{"text": "That sounds intriguing! Creating a guidebook for a non-existent game is such a unique concept. It’s like building a world purely from imagination, complete with rules, lore, and strategies.", "label": 1}
{"text": "Infection free zone", "label": 1}
{"text": "Basically only \"they are billions\"....\n\n\n\nI prefer Project Zomboid though.", "label": 1}
{"text": "To everyone recommending elden ring - you must be trolling. Busy dad that wants to chill, and you're suggesting a game where you gonna bang your head for 2 hours at bosses.", "label": 1}
{"text": "You feel so bad for the biologist chick in every flashback. Deacon is clearly one of the biggest losers on the planet, what person with a professional job would regard him as anything but a dangerous meth transporter.", "label": 1}
{"text": "This is a great list! I feel like I've only been playing astrobot since september", "label": 1}
{"text": "Alundra", "label": 1}
{"text": "New games are dogshit, Spider Man two included. Those games were designed by a committee, they are not art, and realization of someone's vision. They just went checkmark by checkmark to make it as inoffensive, accessible and contain the correct social commentary to lecture you. Play retro, play indie or play non-western games.", "label": 1}
{"text": "Balatro, Another Crab's Treasure, Black Myth, ER: Shadow of the Erdtree and Remnant II\n\nBalatro and Another Crab's Treasure are definitely my favorites of the year", "label": 1}
{"text": "A personal favorite of one Elon Musk. Unfortunately the mother fucker (and I mean that in a literal sense) modeled himself after the main villain, right down to the plot involving taking over the internet and satellite communications as well as attempting to neuralunk himself with an AI god.", "label": 1}
{"text": "Two games at once? That's just brain gym for overthinkers! 💪", "label": 1}
{"text": "Omg that slab of meat would take forever to cook", "label": 1}
{"text": "Mood. We all need a Doom Slayer for our bedtime doomscrolling habit.", "label": 1}
{"text": "Traffic cone in Kingdom Come Deliverance.", "label": 1}
{"text": "nice", "label": 1}
{"text": "I'm well aware of how difficult it is to go through school undiagnosed. I did that. You and your friends are also very much missing the fact that \"inattentive type\" ADHD is often heavily misdiagnosed as depression. \n\nI adore the American centric view too. What about the UK where all prescriptions are at most £9? What incentive do doctors have there? Get your head out of your ass.", "label": 1}
{"text": "I'm sure hyper advance alien AI John Carmack would be interested in this.", "label": 1}
{"text": " Stardew Valley, Hollow Knight, Celeste, Undertale, Cuphead.", "label": 1}
{"text": "Fire all the useless blue haired people. Hire people with experience and talent. Stay true to the lore. It isn’t that hard to have a best seller just don’t screw the player base for a vocal hysteric minority", "label": 1}
{"text": "oh my god, what is this?😅", "label": 1}
{"text": "I'm actually surprisingly enjoying myself, even though I was fully expecting to dislike it. Yes, it's a walking simulator pretty much but there's something very melancholy and soothing about the game. Walking around in the gorgeous wilderness, with the beautiful music really is very immersive and calming.\n\nI will say though that this is a game you might need to supplement with another game to avoid getting bored by. I've also been playing the new COD so the insane contrast between the two games really helps DS quite a bit. If I need a break from the hectic chaos of COD I can just switch over to the slower, more contemplative DS and vice versa", "label": 1}
{"text": "game amizing", "label": 1}
{"text": "amizing", "label": 1}
{"text": "Legendary", "label": 1}
{"text": "Too many they/thems so no", "label": 1}
{"text": "This Mario’s got more swag than my whole closet combined. Nailed it, hands down.", "label": 1}
{"text": "Be careful when using the word Woke, the pedophiles and woke weirdos from gamingcirclejerk are going to cry about it 😭", "label": 1}
{"text": "But there is no trans surgery scar option…  clearly will get a 6/10", "label": 1}
{"text": "the new ones literally are action rpgs. like by definition. it's even more blatant than most games. it has a fucking quest menu. you're fucking stupid.", "label": 1}
{"text": "Yet you did mention it’s ilk. \n\nLearn to read. \n\nThe entire zelda 1 gameplay is inherent to rpgs. Tf do you mean what part", "label": 1}
{"text": "I’m being sarcastic I think the game developers have lost their fucking minds putting that shit into otherwise great games.", "label": 1}
{"text": ">Learn to read. \n\nOK, let's read together.\n\n> Tower of Druaga, Hydlide and Dragon Slayer\n\nWhich one of them is Zork or text adventure in general?\n\n>The entire zelda 1 gameplay is inherent to rpgs.\n\nSo okay, we have traversing a big map without clues, periodically running dungeons, solving some cryptic puzzles and getting new items, all that with a real time combat. Did I just describe Zelda? No, it's Hydlide, released two years prior and with role-playing elements like leveling and unlocking several spells. So again, which Action RPG mechanics were set up by Zelda?", "label": 1}
{"text": "Shadow of the Erdtree \nBlack Myth Wukong \nAstrobot", "label": 1}
{"text": "My guy, learn to read, I already address your incorrect notion.", "label": 1}
{"text": "Also, don’t hide behind your 9th alt account.", "label": 1}
{"text": "Wildly, wildly stupid take. Like brain damage stupid. While you are pouting and making a point to no one, people are making honest reviews after EA tried to pull their shit. What would you prefer that the only reviews came from people that were given review codes? Your neckbeard anti corp horseshit is so bad that it's destroyed your common sense.", "label": 1}
{"text": "You’re ridiculous, I’m saying I don’t like the game, and I think it was ass, and you can’t bring yourself to fathom that someone has a different opinion to you, and so you conclude that they’re trolling, didn’t understand the game, and in fact never even played it, over the possibility that, you know, I just don’t like the fucking game. Get real and stop dickriding this game so hard that you can’t  believe someone when they say they don’t like it.", "label": 1}
{"text": "They are more profitable than ever… this remaster is only $10 and even includes new motion capture from the actors. This was not some half baked cash grab. Educate yourself before you speak", "label": 1}
{"text": "Good. Bad franchise", "label": 1}
{"text": "1986: it's dangerous to go alone, take this\n\n2024: here's our new non-binary party member, also I just misgendered someone time for pushups hehe\n\nOh yes, how far we've come", "label": 1}
{"text": "You can play only after you did all the important stuff and don't you ever touch online games you fucking shithead!", "label": 1}
{"text": "They did Remastered version for the game that is 7 years ago and expect to have the success, delulu. Some other great games are ready for remaster but noo", "label": 1}
{"text": "Whoa those graphics are amazing", "label": 1}
{"text": "Those damn gays ruined our fantasy games full of dwarves, elves, magic, and other shit that isn’t real.", "label": 1}
{"text": "What a fantastic Pyro costume! You really captured the character perfectly. It's always great to see TF2 fans bring their favorite characters to life!", "label": 1}
{"text": "Veilguard never even beat Baldur's Gate 3 for peak players. \n\nIn fact I think all Veilguard did for those who bought it was make them want to play BG3 again.", "label": 1}
{"text": "I thought Pyro was a chick?", "label": 1}
{"text": "My first Steam account activated game was Counter Strike Condition Zero.\nMy first game bought through steam though? God knows, it's been 18 years.", "label": 1}
{"text": "“Playing the role of Mega Man”* but go off with your room temp IQ statement.", "label": 1}
{"text": "I appreciated the story and my attention span dosent need entertaining with explosions or with guns", "label": 1}
{"text": "Have you tried a lobotomy", "label": 1}
{"text": "Atmospheric horror of Silent Hill + Monster Hunter gameplay", "label": 1}
{"text": "Good thing you're no game designer, otherwise you'd have no basis of what makes good character designs. You can always grow up, so moving on ig.", "label": 1}
{"text": "Lol\n\nKeep denying next gen tech, keep getting burned.\n\nTransition to arm? Oh **** no we cant sell anymore legacy pc hardware!!!\n\nMl driven upscaling? Oh **** no we cant sell anymore legacy pc hardware!!!\n\nFrame generation? Oh **** no \"fake frames!!!' \"the frames are fake!!!\" that what we will sell them on so we can sell legacy pc hardware for longer!\n\nBuy AMD!!! They support last gen! That the reason to buy AMD GPU!! Because they support last gen!\n\nKeep on getting milked. Keep on playing volleyball with misinformation so they can sell you legacy pc hardware for longer. Hillarious.", "label": 1}
{"text": "Sega Master System's Zillion\n\nIt felt harder and harder to remember the symbols and it was even harder when you knew the cyborgs are pouring out cause you triggered an alarm", "label": 1}
{"text": "OG Call of Duty Modern Warfare 2", "label": 1}
{"text": "then its gotta be a old game, i'd think newer games makes it more fair", "label": 1}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 1}
{"text": "You could either rage against the machine and play on the shitty infested wall hacker/aimboter galore pretending to yourself playing Werewolf was actually okay rather than conforming or you could beg/barther your folks in letting you buy off their dime a legit CDKEY and enjoy some good clean CS fun on T1 Dedicated Servers all running Punkbuster/VAC Secure that gatekept any hackers out to avoid losing your key over hacking. A dark day on all poor families and powertripped parents'children across the board lmao... Chores as far as they can see just to have mid 50-60 ping and not be left out from the cool kids krew", "label": 1}
{"text": "You da man, king. Keep playing that Tekken 3 demo you got in a cereal box you fucking gangster.", "label": 1}
{"text": "Gorilla tag was my first", "label": 1}
{"text": "My perfect game is Elden Ring lore/world-building, Nioh combat mechanics and Witcher 3 side quests", "label": 1}
{"text": "NeverKnowsBest has a documentary about video game romance https://youtu.be/LbVsYcYaL4k", "label": 1}
{"text": "ps1 remakes would be something. ps2 is whatever, we already got the crash trilogy remake so stuff like it has happend", "label": 1}
{"text": "Also a demon", "label": 1}
{"text": "It's not \"gay content.\" Surgery scars, 'nonbinary' shit and pronoun policing have nothing to do with us.", "label": 1}
{"text": "Gears of War 3. making grubs explode is satisfying, especially lambents", "label": 1}
{"text": "D2?", "label": 1}
{"text": "Have you played it before? If so, how was it?", "label": 1}
{"text": "Uncharted 4 really set the bar high for character animations and detail back then.", "label": 1}
{"text": "Still impressed by how well both games showcase character detail. Timeless!", "label": 1}
{"text": "I NEED KARMA NOW", "label": 1}
{"text": "Star Fox 64: Rerouting that snarky little bastard and his precious train into the depot.  Bye, bitch.", "label": 1}
{"text": "there is something similar called \"behind enemy lines\" if I'm not mistaken", "label": 1}
{"text": "Average r/gaming DAE big company bad?\n\nShut the fuck up sweaty nerd.", "label": 1}
{"text": "Baldurs Gate 3. I want to do a coop campaign", "label": 1}
{"text": "Amazon was also a huge win if you bought it in near the beginning of the stock offerings. Crap, it might be one of the best companies to invest in, when looking at recent history.", "label": 1}
{"text": "looks nice", "label": 1}
{"text": "mee too", "label": 1}
{"text": "looks funny", "label": 1}
{"text": "mario", "label": 1}
{"text": "yes", "label": 1}
{"text": "witcher 3", "label": 1}
{"text": "nice", "label": 1}
{"text": "3d platformer", "label": 1}
{"text": "witcher", "label": 1}
{"text": "nice.", "label": 1}
{"text": "same here", "label": 1}
{"text": "PC performance was definitely criticized when World on PC was launched, in a similar way to how this demo is being talked about (minus the origami monsters)", "label": 1}
{"text": "What \"everyone else\"? What lie? The post is just saying their specs and that the game runs well for them. Drop this hyperbolic whining. Seriously, are they lying? How can you look at that post and see that they're saying \"everyone else is lying\"? Fuck off with this shit.", "label": 1}
{"text": "for me the witcher will always come first", "label": 1}
{"text": "thank s", "label": 1}
{"text": "Hello, is this game available for free or do I have to buy it? \n\nWhat are the specifications I need for my device to run it? \n\nI have a RTX 4060.", "label": 1}
{"text": "Hypocrite says what.", "label": 1}
{"text": "> high bar for writing \n\nAre you serious? Did we play the same game? \n\nRDR2 writing is painfully mediocre. The deus ex machina, characters making the most illogical decisions, plot holes, inconsistent character writing, ludonarrative dissonance and retcons. Dont even get me started on the pacing or the gameplay issues lmao.", "label": 1}
{"text": "Take counter strike more seriously", "label": 1}
{"text": "Okay now put a bomb right next to the grill, I promise nothing will happen", "label": 1}
{"text": "\"Ah shit, here we go again\"", "label": 1}
{"text": "lolll", "label": 1}
{"text": "Really it hit its peak because of Newgrounds. \n\n\nPeople really didn't know about Zero Wing until that Flash music video.", "label": 1}
{"text": "If you wanna pinpoint when it actually blew up, it was a Flash animation video on Newgrounds that ascended it to meme status.\n\n\nCatchy song plus silly images.", "label": 1}
{"text": "Frankly, the meme exploded because of a music video. \n\n\nThe game before that point was mostly forgotten.", "label": 1}
{"text": "Skyrim", "label": 1}
{"text": "You!re not crazy. You’re bat shit insaaaaaaaaaaane!!!", "label": 1}
{"text": "    combined_karma: „< 20“", "label": 1}
{"text": "    combined_karma: „< 20“", "label": 1}
{"text": "Mass Effect trilogy, Witcher 3 and Cyberpunk 2077", "label": 1}
{"text": "Super Mario Bros., classic, upbeat theme that perfectly defines gaming nostalgia.", "label": 1}
{"text": "Let's look at yours, hmm thousands of removed comments and calling everyone paid shills, totally a rational and cool guy.", "label": 1}
{"text": "The definition of insanity….", "label": 1}
{"text": "\"Me start Harvest Moon game again after many moon cycles. So fun!\"", "label": 1}
{"text": "Took an arrow to the knee... \n\n\nThe force be with you... \n\n\nNo towns no rest no reinforcement, nothing like a little challenge to spice up a dull week huh? \n\n\nCrane on a crane, you'll feel right at home. \n\n\nRip and tear until it is done... \n\n\nGriffin Eternal!!!", "label": 1}
{"text": "why? I never got it, the cloud district has about 5 buildings and a nice garden and the house of the dead, what is stopping me to go there, nothing to do there btw", "label": 1}
{"text": "I’ll tear off your head and shit down your neck", "label": 1}
{"text": "\"hesitation is defeat\"", "label": 1}
{"text": "Wololo", "label": 1}
{"text": "Your face your a** what's the difference?", "label": 1}
{"text": "I love lego games.", "label": 1}
{"text": "I had one of those, kids these days definitely wouldn't be able to figure this out.", "label": 1}
{"text": "if its just a video game than why impose political views into it?", "label": 1}
{"text": "Our TV had the antenna built in and we would wrap it in aluminum foil then bend the foil as necessary \n  \nWe were kids and noticed the antenna picked up better if we touched it... so we started wrapping ourselves in aluminum foil and holding onto the antenna to catch a better signal \n  \nit was actually a fun thing to do as a kid", "label": 1}
{"text": "Danger", "label": 1}
{"text": "parallel", "label": 1}
{"text": "this is way to much to read GTFO", "label": 1}
{"text": "whats this is?( ͡° ʖ̯ ͡°)", "label": 1}
{"text": "War. War never changes", "label": 1}
{"text": "I can remember from witcher 3", "label": 1}
{"text": "true", "label": 1}
{"text": "nice", "label": 1}
{"text": "It's very nice game. I love it", "label": 1}
{"text": "nice", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "Great. Congrats", "label": 1}
{"text": "Looks nice", "label": 1}
{"text": "You meatheads too stupid to quit?", "label": 1}
{"text": "I don't know if anyone remembers the sniper night mission from the Battlefield 3 campaign but I thought it a well done, hidden gem in a pretty poopy campaign", "label": 1}
{"text": "Get down here you inbred piece of trash !!", "label": 1}
{"text": "instantly bring back memories of our favorite games and moments! some lines are just iconic, like 'It's dangerous to go alone! Take this.' or 'The cake is a lie.'", "label": 1}
{"text": "Rip you glorious scientific salarian. You went out the smartest baddest mofo in the universe.", "label": 1}
{"text": "a japanese woman isn't a japanese man", "label": 1}
{"text": "what does that have to do with what he said then", "label": 1}
{"text": "War... war never changes.", "label": 1}
{"text": "Winds Howlin'", "label": 1}
{"text": "Mr. Wright, I want to say thank you so much for developing such a one of a kind game like Spore. I’ve been playing Spore since I was 3 and it’s always been a wonderful creative outlet for me since I was young, now I’m turning 18 on the 8th and have been playing it with mods. \n\nFor the past 7 years, Spore has been the sole reason of why I found such great interest in the topics of Speculative Evolution, Speculative Biology, and Worldbuilding. And for the past year and a half I’ve been getting back into art and have created characters with written backstories that at some point (if hardships of life will allow me) I want to use to write and produce an animated series inspired by your work. \n\nSo, again, from the bottom of my heart, Thank you so much for creating such a unique game that I hold very closely to me. \n\nOkay, now for my question.\n\nDespite how much we all wish for a Spore sequel, we have to come to terms that ‘Spore 2’ is unfortunately very unlikely to happen - is there a reason for that? Is it the lack of a resources? Or EA having the rights to Spore? I’m very curious.", "label": 1}
{"text": "Stopped buying controllers from Sony and Microsoft (stick drift, short battery life). \n\nI use an 8bitdo Ultimate BT and a Flydigi Vader 3 Pro now. Both are relatively cheap if you take into account their features like extra buttons, hall effect etc. and are much better than the ones from those two", "label": 1}
{"text": "Hackerman", "label": 1}
{"text": "You adore it for your nostalgia and because it was good for the time. It's really not that special.", "label": 1}
{"text": "GOG also offers nice DRM-free perks if you prefer that route.", "label": 1}
{"text": "Tbh its a minor thing but its also a sign. Nobody on Earth was offended by that, and the super minority of society who did dont buy and play games anyway. It was only done to avoid some game journalist complaining.", "label": 1}
{"text": "You hop on Tiktok or insta or whatever and there are tons of vids uploaded by women that clearly focus on their body. Its not a big deal.\n\n\nAnd yes, players like sex and stuff. I guess blowing up a star system with hundreds of thousands of people living it it is ok in a game but a butt shot isnt. \n\n\nMiranda canonically brags about having a perfect body lol.", "label": 1}
{"text": "Good point. I am not the 14 yr old teen dude wo rages about these things but I dont really thing bringing purity culture is a good thing", "label": 1}
{"text": "Not really, given its a bunch of pixels and said woman is a fictional character. The argument against it would have merit if it was about a real living breathing woman.", "label": 1}
{"text": "Its not a big thing but it was a quirky thing and more and more edge is being removed from games the less different and unique they will be. ", "label": 1}
{"text": "I certainly wouldnt be offended. If they want some eye candy to the straight women or gay men audience, fine by me.", "label": 1}
{"text": "Honestly if you don’t play these games you probably eat babies", "label": 1}
{"text": "Oh so that's why the new dragon age has a *careful not to offend, weak, ultra-left, blue haired non-story with forceful exposition on gender theory*. There's no one normal workjng there anymore.", "label": 1}
{"text": "Bro, that game is just plain coomerbait with characters falling over themselves just to suck your dick, what good writing are you even talking about?", "label": 1}
{"text": "rdr2?", "label": 1}
{"text": "There is nothing wrong about games made for adult people to have fan service in it", "label": 1}
{"text": "Why was it in the first place then? What happened between og Me2 and remastered Me2 that needed this scene to be changed?\n\n\nIts a nothingburger tbh, but its also a weird way to return to purity culture. I dont really understand why anyone want a world where you cant look at a butt in an adult video game if you want to. \n\n\nHave anything improved in society directly because it was removed? Was any woman hater who thought \"wow this ass shot was removed, now I respect women\" ? No.", "label": 1}
{"text": "Good point. Its unneeded, but if it is already in the source material its also unnecessary to remove.", "label": 1}
{"text": "I said it because it was an attempt by the other commenter to get a gotcha on me. I guess he expected me to say that \"uhm, I am straight so I go into cardiac arrest if I see a bulge so yeah I know see your point\" which, evidently, didnt happen.", "label": 1}
{"text": "Too bad for them that the advertisers and investors and focus groups are the people who make up majority of the player base.", "label": 1}
{"text": "No, but the argument against objectification at least make sense, and a debatable thing when we discuss living beings. Gatekeeping what can be shown in adult entertainment is a looney position.\n\n\nThere are many issues with the sec industry and fashion industry, and sometimes people are being harmed (over dieting to be super thin etc). But nobody is harmed because some pixels depict a big juicy butt.", "label": 1}
{"text": "> game made for a (then, maybe still) majority male audience\n\n\n> it has male fan service\n\n\n> this is horrific for some reason\n\n\nBtw, I am European and we are more relaxed about nudity and stuff (but much less about movie violence and blood and stuff) so maybe its a cultural thing. But I dont really see why its a problem.", "label": 1}
{"text": "Mfw Protheans realise everybody loves boobs\n\n\n> le prothean temple, fertility goddess statue\n\n\n\n> Liara: we here thank Athene for giving us bigger boobs and telling us about the bra.... oh wait.... JAAAAVIK!!!! 😡😡😡\n\n\n> Javik: And now you suddenly believe me about Prothean uplifting. Typical.", "label": 1}
{"text": "There is a huge difference between IRL women with feelings and human dignity and a bunch of pixels in a game.", "label": 1}
{"text": "What does the AI do in the game? Lots of games have \"AI\" at least the code lines that control NPC behaviour are called that. I guess this is a different type of AI, so how does it affect gameplay?", "label": 1}
{"text": "Yes it would, but its kinda a different genre, and how Thanos looks have little to do with his story. \n\n\nHow Miranda looks is quite literally a lore thing.\n\n\nBtw, there is a famous scene where they show and talk about Captain's America's ass. \"It's America's ass\". Which is, quite clearly objectification. And obviously, tons of scenes where they show the actor's muscular body, even when it isnt technically necessary? Who complains? Nobody.", "label": 1}
{"text": "I kinda know that. But its past time companies and investors realise those people dont play their games. Even if it would he a legit dislike for American gamers which is not, there is still the rest of the planet with much less relaxed attitude about this.", "label": 1}
{"text": "Dragon Age 2 took those away. I can tell when people who've never played the series talk about it because they act like 2 and Inquisition werent the same kind of action game as Veilguard.", "label": 1}
{"text": "“Lol fuck your mother you fucking noob”", "label": 1}
{"text": "Don’t disappoint yourself like that.  Go onto archive.org and play any number of the thousands of old dos based games you can play right in your browser.  It’s so cool they have this…", "label": 1}
{"text": "Wouldn’t recommend rocket league lol", "label": 1}
{"text": "Прикольно получилось", "label": 1}
{"text": "Persona", "label": 1}
{"text": "It actually is important to recognize the importance of personal conviction and struggle. It's extremely important to recognize not just the importance of union work and organization but also the REAL POWER of individuals.\n\nAs Fidel Castro said: \"I began revolution with 82 men. If I had to do it again, I do it with 10 or 15 and absolute faith. It does not matter how small you are if you have faith.\"\n\nSocial democracy only ever served to enable capitalism. Not just indirectly but also directly: Literally every single time in history when it became time to choose, social democrats ultimately sided with capital (i.e. fascism) against the revolution.\n\nYou cannot reform the system from within. You must change the system itself before you can start building something better through reform. First you abolish capitalism itself, only then you can build an actual democracy and increase freedoms as the global reaction is being defeated.", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "looks nice", "label": 1}
{"text": "yes", "label": 1}
{"text": "Witcher", "label": 1}
{"text": "yes", "label": 1}
{"text": "great", "label": 1}
{"text": "Silent hill", "label": 1}
{"text": "nice", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "may be", "label": 1}
{"text": "Valhalla , according to me", "label": 1}
{"text": "Asking here because I do not have enough Karma. Sorry. \n\n# Which game should I play on my new laptop that will test it and also be a good experience? I have the following.\n\nIn terms of PC requirements the heaviest games I have are:-\n\n1. Outer Worlds Spacers choice edition\n2. Callisto Protocol\n3. Ghostwire: Tokyo\n4. Guardians of the Galaxy\n\nI am not sure if I really want to play those though.\n\nI also have the following:-\n\n1. Assassin's Creed Odyssey, Origins, Unity, Syndicate\n2. Watch Dogs 1, 2.\n\nWell, these are the games that I couldn't play on my previous laptop with a great settings that I really wanted to play.\n\nAlso I have,\n\n1. Death Stranding\n2. Witcher 3 (I wanted to play this after playing Witcher 2, have already played the first one)\n3. GTA V\n4. A Plague Tale: Innocence\n5. Control\n6. Hitman (2016)\n7. Tomb Raider Trilogy\n8. Mafia: The Definitive Edition\n9. The Division\n10. Fallout 76\n\nI have played games like Assassin's Creed, Watch Dogs and loved them. Have also liked Elder Scrolls, Europa Universalis, Mount and Blade, and Fallout. GTA is great but never could follow the story for long enough.\n\nMy specs are:-\n\nHP Victus\n\ni5-13420H,\n\nRTX 3060 (6 GB),\n\n16 GB RAM,\n\n512 GB SSD.", "label": 1}
{"text": "\"Death can have me when it earns me\"", "label": 1}
{"text": "\"It's super effective!\"", "label": 1}
{"text": "I find Astroneer to be really good for that! You can explore planets, harvest, build bases, etc.! I find myself getting so lost in the game that I forget to do literally anything I had set out to do. My mind goes blank and I just have fun! The game is cheap and also co-op if you want that!", "label": 1}
{"text": "The main reason I haven’t given up my PS5 after getting a PC is to avoid things like this lol, cause now I’m even more intrigued to play it", "label": 1}
{"text": "Looks good!", "label": 1}
{"text": "interestig", "label": 1}
{"text": "Why it was removed?", "label": 1}
{"text": "looks nice", "label": 1}
{"text": "Warframe🗣🔥", "label": 1}
{"text": "Odd I never had any issues. It was obviously non-optimized, but I finished it before the first patch.", "label": 1}
{"text": "They were also among the last years developers really tried, before the fake hate trains started ruining good games.", "label": 1}
{"text": "Mine is \n\nGOT   \nRDR2  \nSilent Hill 2   \nFF VII Rebirth  \nWukong? LOL", "label": 1}
{"text": "Git gud is such a no life child opinion to have anyway. Especially in a single player game. Like damn sorry your ego won’t let you play any easier difficulty. Then they come to gaming subs and are like “so why is this game so easy on ultra super hard? Like I didn’t even find it to be a challenge” like shut up, no one cares.", "label": 1}
{"text": "God Of War Ragnarok was amazing at this, when Brok died the entire area around him and Sindri dimmed heavily leaving just them as the focus.", "label": 1}
{"text": "Whoa, Never thought of that. lol", "label": 1}
{"text": "In the games it was made for. Mass Effect Andromeda looks like ass. It looked like unplayable ass at launch, updates and mods fixed a lot of it but there are still major problems compared to ME:3.", "label": 1}
{"text": "Wow, this is wholesome.", "label": 1}
{"text": "I think you need to wait for a game first. We don't know how much this game could be good or bad. Especially due to current situation in Ukraine.", "label": 1}
{"text": "Bioware reached out to the Mass Effect modding community and incorporated a lot of the popular texture mods for the Legendary Edition. I doubt it would have materialized if not for most of their job already being done for them.", "label": 1}
{"text": "I love this game so much but it can be overwhelming trying to jump back in. I wanted a break from doing chores this past weekend and tried loading up my old farm, but it quickly felt like I was just doing more chores but in a game lol", "label": 1}
{"text": "You're not posting a gaming related cosplay. You're posting an attention grabbing picture of yourself, clearly showing your tits, with an insane filter that makes you look barely human. People are not browsing the gaming sub to see this kind of trashy post", "label": 1}
{"text": "Why shouldn't it be?", "label": 1}
{"text": "But they know what a #theythem is", "label": 1}
{"text": "Yep, 12 other conversation threads people had with the OP (I pulled most of my list from those existing comments) and of all of those, only yours was a worthless pile of shit, so congrats!", "label": 1}
{"text": "The game with which I escaped reality the most in my adolescence was World of Warcraft, but perhaps it is not the best, I would also recommend Stardew Valley, it is a great game and very fun, you can also play with another person.", "label": 1}
{"text": "Don't have vagina either.", "label": 1}
{"text": "Just Cause 3/4\nJust Turn off your mind and do all sorts of whacky shit by tying things up and flying around.", "label": 1}
{"text": "#FUCK 343", "label": 1}
{"text": "The musk rat simps in here downvoting everything do. lol", "label": 1}
{"text": "Hahaha You’re funny… I will kill you last.", "label": 1}
{"text": "Right and wrong is not defined by arbitrary language created by modern lunatics from academia. Thus, the use of the prefix \"miss\" is wrong (objectively, as it should), regardless of anyone's schizophrenic interpretation of reality and authoritarian will.", "label": 1}
{"text": "For real bro. I thought the game looked incredible back in 2012 and it aged amazingly. Very underrated game", "label": 1}
{"text": "Sorry to do this here, a little desperate. I'm trying to keep electric from being shut off, just need $58.45 - all help is appreciated at $champagnb", "label": 1}
{"text": "Haven't you heard? Life is a game.", "label": 1}
{"text": "It gets repetitive after the first decade so I agree with you.", "label": 1}
{"text": "It can give dark souls a run for its money, honestly. Plus, it just never ends.", "label": 1}
{"text": "The struggle with keeping documentation up-to-date is real, and it can seem like a costly burden. Having faced similar issues in projects, I've found a system like Confluence really helpful. It keeps everything centralized and makes updating easier. It requires commitment, though, from the whole team to maintain documentation regularly as part of the development cycle. Also, I've seen GitHub's wikis and README files serve as great living documents when used properly. While often overlooked, tools like these make staying organized possible. You highlighted the importance of good documentation, which aligns perfectly with the solutions Pulse provides for managing complex information across platforms.", "label": 1}
{"text": "Because you're insufferable and don't care about your actions that harm everyone in general, such as paying for microtransactions, which rewards this shitty behavior, and then they prioritize it more than gameplay.\n\nYou're just selfish and stupid is all.", "label": 1}
{"text": "Im always zoning away while driving during missions. Love the scenes", "label": 1}
{"text": "Probably smells better than the swampass from running halfway across your farm to pet the little shits.", "label": 1}
{"text": "Super big black Mario :D", "label": 1}
{"text": "Totally get it. The pull of that game is strong. Trying it again on another platform and clearing it multiple times just proves how special it is. Starting over adds a fresh spin each time. It shows how replayable and captivating it is, even after so many runs.", "label": 1}
{"text": "Witcher 3", "label": 1}
{"text": "Fuck GTA 5 but at the end of the day they are often on top selling lists.", "label": 1}
{"text": "OTS view in TPS rocks my socks!", "label": 1}
{"text": "Oh man. What a throwback radioshack of all places too.", "label": 1}
{"text": "Minecraft. Even if it was sometimes infuriating, searching in videos and random websites for information about everything in the game was a fun experience.", "label": 1}
{"text": "*Thank You Mario But Our Princess Is In Another Castle*", "label": 1}
{"text": "I HATE CANADA!!!", "label": 1}
{"text": "*REALLY?* 😱\n\nAnd which one of your OF subscribers paid you to do this cosplay...?", "label": 1}
{"text": "Dude, I remember those! I think they were called 'DesktopMates' or something similar. Used to have a little cat that ran around my screen. Good times!", "label": 1}
{"text": "You love Nintendo. You will DEFINITELY be getting switch 2 regardless of BC. Lying on the internet to impress (I guess?) people you don’t know is big time cringe. Just sayin.", "label": 1}
{"text": "The Legend of Zelda: Ocarina of Time. The sense of discovery, the puzzles, the world-building, and that feeling of immersion, everything about it was magical when I first played it.", "label": 1}
{"text": "There's been some [datamining](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1gkf21k/nso_datamining_reveals_4k_resoultion_option_and/) on that actually.", "label": 1}
{"text": "Try call of duty or fortnite. If you dont like shooters try among us 🙂", "label": 1}
{"text": "Nice best thing I seen today", "label": 1}
{"text": "hmmm", "label": 1}
{"text": "nice graphics", "label": 1}
{"text": "nice", "label": 1}
{"text": "nice", "label": 1}
{"text": "nice graphics", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Ok, so you don't have any actual evidence and the source is your ass, thought so.", "label": 1}
{"text": "Porn", "label": 1}
{"text": "Subnautica if you aren’t too afraid of the ocean then this game is amazing it had me sucked in for weeks.", "label": 1}
{"text": "Diablo 4, I really like it.", "label": 1}
{"text": "Spamming A in pokemon made the poke ball more likely to be caught\n\nNow it's just a bad habit. It's like trying to skip an unskippable cutscene", "label": 1}
{"text": "\"Death can have me when it earns me\"", "label": 1}
{"text": "Vanilla World of Warcraft", "label": 1}
{"text": "modern Hitler was just re-elected", "label": 1}
{"text": "Enjoy doing that from your mums basement you virgin", "label": 1}
{"text": "Doom Eternal. By the end, you’re practically a god, ripping through everything with full power, and the music just pumps you up even more.", "label": 1}
{"text": "This is good first step. Next would be to disallow adding DRM and kernel-level anti-cheat after release.", "label": 1}
{"text": "Steam finally getting game recording is a game changer. Can't wait to try it out.", "label": 1}
{"text": "I want to keep one myself!", "label": 1}
{"text": "Did you forget your anxiety medicine this morning? Or you trying to get your daily hot shit take on current events for rage bait?", "label": 1}
{"text": "Not expecting big changes will happen in the industry but the title is technically correct.  If you are (or were) part of a democracy and you did not vote, you deserve to loose any freedoms or privileges you did not vote to keep. \n\nThat is how democracy works. If you can’t be bothered to state your preference with your vote, you get whatever comes your way.", "label": 1}
{"text": "You guys are fkn pathetic. Go outside. Get some sun. And while you're out there, pull your head out of your ass... he's not gonna take away your video games. And project 2025 is a hoax.", "label": 1}
{"text": "I’m from South Africa you buffoon. Cope and seethe lmao", "label": 1}
{"text": "Remember this one. Also believed for a while that Valkyrie Wilde was a real game", "label": 1}
{"text": "Every fucking election matters.", "label": 1}
{"text": "Same sentiment. Makes it easier to guess where I might need to go if I get lost", "label": 1}
{"text": "Oh wow!!! I forgot about this. Truly a monumental game when it came out. First game where i literally thought, \"omgg this is a world in a game to explore!\"", "label": 1}
{"text": "Don't mind them. The majority of reddit is full of mentally challenged man-children who thinks anyone to the right of them is the worst human being ever, ever. They're all out in full force because of last night.", "label": 1}
{"text": "All i can say is try FC MOBILE, or ROBLOX, OR E-FOOTBALL.", "label": 1}
{"text": "r/USDefaultism", "label": 1}
{"text": "Same here", "label": 1}
{"text": "Your video is nice", "label": 1}
{"text": "What makes you think it was a terrible decision?", "label": 1}
{"text": "Phones spoiled everything :)", "label": 1}
{"text": "that's great", "label": 1}
{"text": "Non-Americans forgetting that a terrible result in a U.S. election has significant ripple effects on the rest of the world.", "label": 1}
{"text": "[If only](https://pbs.twimg.com/media/Ed0R9nIXsAEt3_G.jpg)", "label": 1}
{"text": "Halo 1 pistol", "label": 1}
{"text": "I know Arkham City is for many the best in the series, but Arkham Knight is my favorite", "label": 1}
{"text": "I heard this gif even with my sound off.", "label": 1}
{"text": "True, so many gorgeous games that will uphold the test of time because of their art direction. A game like Hades doesn’t hold a candle to, say, God of Wars graphics, but the art direction has made it into a gorgeous game that will still look amazing in years to come.", "label": 1}
{"text": "Everything is wet. Everything is dark. Also, Batman makes most everything look better.", "label": 1}
{"text": "Oh I agree XM4 and MP5 you receive at the start are only two I like in BO6", "label": 1}
{"text": "An older example is Castlevania: Symphony of the Night on PS1. Back then, people derided it for being a 2D game where 3D was a trend, but nowadays, the game holds up aesthetically (and gameplay-wise) and stood the test of time better than other games trying to break into the 3D space.", "label": 1}
{"text": "That’s how they first figured out to make CGI look good. Make it dark, set it in rain.", "label": 1}
{"text": "Finished Asylum last weekend and was pretty impressed by how good it was for such an old game. Now playing Arkham City and having Arkham Knight ready to go... getting the collection for 8€ was a steal.", "label": 1}
{"text": "I miss playing Batman, I played it on my ps3, it's very good", "label": 1}
{"text": "Arkham Origins is also worth it if you want more Batman after Arkham Knight.", "label": 1}
{"text": "Like those GTA realism mod demos… always at night and in the rain", "label": 1}
{"text": "Mine too, I love Batman games so much, I hope there are more to come", "label": 1}
{"text": "Clever optimization tricks. Highly optimized LOD's, low poly buildings, and clever level design (for starters).", "label": 1}
{"text": "Halo 1 pistol", "label": 1}
{"text": "Knight was a *gorgeous* game.\n\nIt definitely suffered from focusing too much on the Batmobile, but I'll always love the game and I frequently boot up my 100% file and run around for a few days, picking fights, and just soaring through the overworld.", "label": 1}
{"text": "It took me way too long to realize this. 3 shots to the face and that’s all she wrote.", "label": 1}
{"text": "Plasma cutter in Dead Space", "label": 1}
{"text": "It looks so nostalgic 🥹", "label": 1}
{"text": "That's already great classics", "label": 1}
{"text": "As a kid, I totally believed the Tomb Raider “nude code” was real. My friends and I spent ages trying every button combo we could think of, convinced we’d crack it. Looking back, it’s funny how we all fell for it—pre-internet gaming myths were wild!", "label": 1}
{"text": "Black Myth Wukong was literally nominated for the Golden Joystick GOTY. Seriously, what's with this weird ass victim complex I keep seeing out of Black Myth Wukong fans?", "label": 1}
{"text": "It literally got nothing because it didn't deserve anything, it was a decent 7/10 game released in a contender for the single best year in the history of the industry for new releases. You people are so weird.", "label": 1}
{"text": "Another one: Fall Flat, it’s hilarious! You control a clumsy character trying to solve puzzles, but the awkward physics make everything way more difficult (and funny). It’s full of chaos and laugh-out-loud moments, and it runs smoothly on lower-end PCs. Definitely a great pick if you want something silly and fun!", "label": 1}
{"text": "It's a shame there won't be a sequel to MGR.", "label": 1}
{"text": "You need to jump, dive, and slide to catch him at the corners or turns......!", "label": 1}
{"text": "Lol, I was just posting it as a joke. This isn't /r/games, it's the place to link less serious topics and straight up memes.\n\nJust finding some humour given the news of the day", "label": 1}
{"text": "Hogwarts Legacy sequel will be live service game, right?", "label": 1}
{"text": "Try the \"Tiny Glade\" its brand new game. Can find in steam. Very relaxing.", "label": 1}
{"text": "Try Valorant and you're good to go with life", "label": 1}
{"text": "I doubt that any of the sequels to this game will give me the same atmosphere that I experienced in the first book. I dont think anything will change in this regard. The game, of course, looks great, but its definitely not what I would like to get from this setting and the universe as a whole. 😥", "label": 1}
{"text": "Looking for a space battle game with customizable battleships!", "label": 1}
{"text": "Better be woke as fuck", "label": 1}
{"text": "GamingCirclejerkers already practicing their crybully ing", "label": 1}
{"text": "yay let's give the queen of terfdom more money", "label": 1}
{"text": "It's the ultimate form of media, graphics for your eyes, storytelling, music, etc.", "label": 1}
{"text": "Great. No Denuvo, no performance Issues.", "label": 1}
{"text": "Dev done with Denuvo talk, no DRM in game. Yay!", "label": 1}
{"text": "For a deep escape, *Persona 5 Royal* on Switch could definitely work—its story, characters, and life-sim elements make it incredibly absorbing. If you're open to others, try *Breath of the Wild* for adventure or *Dragon Quest XI S* for a classic fantasy RPG with a rich story. Each offers hours of immersion!", "label": 1}
{"text": "The Master Sword in The Legend of Zelda: Breath of the Wild.", "label": 1}
{"text": "Yeah, and then banning more of their own once a few of them start going \"wait hold on guys, aren't we taking it bit too far? we shouldn't harass and attempt to dox people just for playing a video game you know.......\"\n\n(You have been permanently banned from r/gamingcirclejerk)", "label": 1}
{"text": "r/gamingcirclejerk gonna melt down.", "label": 1}
{"text": "Good.  That place is a cesspool.", "label": 1}
{"text": "Guys use this incredible software called \"Lossless Scaling\", it duplicates the framerate of any game to double or even triple the FPS.\n\nIt works superbly with Elden Ring, even on my weak GTX 1650 Super.\n\nYou just have to lock Elden Ring's max framerate to half your monitor's refresh rate (mine's is 75, so I locked the max framerate of the game to 37) through the Nvidia Control Panel, set the game to **Borderless Windowed**, and use Lossless Scaling's LSFG X2 Frame Gen.\n\nJust click the scale button and switch the tab back to Elden Ring. In 5 seconds, your framerate should be stable 75FPS for most areas, on maximum settings. \n\nThe input delay is significantly less and the game feels smooth. Usually Lossless Scaling never worked well enough with my GPU, but Elden Ring works amazingly with it.", "label": 1}
{"text": "Need for Speed Most Wanted (2005) I fell in love with that game and it got me into cars. I’m sure if I played it now I wouldn’t enjoy it as much since there are better racing games/car sims now", "label": 1}
{"text": "Yeah, that’s true. They don’t make racing games like they used too. I’ll never forget how mad the most wanted remake made me", "label": 1}
{"text": "Rivals isn’t bad. It’s probably the closest I’ve felt to them but man the series has fallen off hard", "label": 1}
{"text": "Did you try a better connection cable ?", "label": 1}
{"text": "Yep, understood. You've just reminded me about my troubles with my first car robot transmission. I had a lot of issues with it. It all ended up in the court room with my auto dealer. I won the case, but still have bad feelings about it.", "label": 1}
{"text": "Still banned on that sub because I had the audacity to say not everything attached to the HP IP agrees with JK Rowling, lol. Shame to because I like how that sub calls out the ridiculous shit gamers say but they lost their collectives minds over this game.", "label": 1}
{"text": "Witcher 3", "label": 1}
{"text": "Then why did you buy one, fool? How old are you? Because you're very out of touch with the history of games, it seems. \n\nFuckin' ....the first Mario is absolutely riddled with broken shit - as is the first Pokémon game and it's the highest selling Pokémon game. \n\nYou're very much rattling off opinions as facts and that's not how the world works. Young and terminally online, me thinks...", "label": 1}
{"text": "You urgently need to buy tesla!", "label": 1}
{"text": "Slow menu cursor on games on consoles", "label": 1}
{"text": "Let's drink together! Cheers! 🥂", "label": 1}
{"text": "Wonderful game - unfortunately the production costs of a game today also lead to less quality in the development of individual elements, I think this is the problem why overall games from a few years ago seem better.", "label": 1}
{"text": "Fromsoft doesn't care about performance.", "label": 1}
{"text": "Yeah also our MC learn broom flying in 5th year (along with other people in the class for some reason), it stands to reason he would not be good enough to make the team anyway (not everyone is Harry, doing it right away is super rare apparently). MC is already special everywhere else, that's okay. \n\nThey could have made a part of the plot where you watch a Quidditch game in the public (or like have to profit from everyone being there to do something forbidden in the shool for example).", "label": 1}
{"text": "I mean the game we got was wanted by people we know that from the sales. We have no idea to know if a game that is all about the school would work as well. It does sound boring if you can't go on adventures or fight (because the true school experience involves very little fights, Harry had a few only when he went outside of the normal school stuff)", "label": 1}
{"text": "I don't think that any patch will resolve this completely :(", "label": 1}
{"text": "No you didn't or likely shown false proof. Real proof doesn't exist\n\nCracked versions do not remove Denuvo so they are invalid to prove anything. \n\nRemoving Denuvo by the devs only happen months or years later with many other additional performance patches and so is invalid too.", "label": 1}
{"text": "Golden days indeed!", "label": 1}
{"text": "That will put absolutely no goles though. Games sell well with or without Denuvo and other games sell badly with or without it. \n\nThat's due to the game, not Denuvo", "label": 1}
{"text": "At the time the fact that it only had its ending through DLC is an element that I did not like at all. A remastered would be a perfect way to recover it.", "label": 1}
{"text": "Yep, but it's not any better than 'Sea of Thieves' or 'Subnautica', IMHO", "label": 1}
{"text": "Ha, that's a good one. Do you know that if you interact with the shrine in Grandpa’s shed on the farm after earning four candles, you’ll receive the Statue of Perfection. It provides you with iridium ore daily, it’s and valuable resource in the game!", "label": 1}
{"text": "I really like it!", "label": 1}
{"text": "**The Oregon Trail**. I spent hours on it as a kid, managing food, hunting, and trying to survive each leg of the journey. Back then, the simple graphics and random outcomes felt epic...", "label": 1}
{"text": "Try **Abzû**. A beautiful underwater exploration game where you’re free-diving through ocean ecosystems. The visuals and music make it a meditative experience.", "label": 1}
{"text": "More Black Metal, please!", "label": 1}
{"text": "Where can I send my CV?", "label": 1}
{"text": "Never been on that sub. Just went over and can honestly say I don't think I'll be back.", "label": 1}
{"text": "StarMade: Similar to Space Engineers but more arcade-like, StarMade lets you build and fight with your own ship creations in a fully destructible voxel universe.", "label": 1}
{"text": "That's a good one!", "label": 1}
{"text": "Agreed", "label": 1}
{"text": "**Diablo II: Resurrected or Diablo III** – If you’re into action RPGs, both Diablo II and III are solid co-op games, offering dungeon-crawling with great loot and character progression.", "label": 1}
{"text": "They spelled it out for us when reviewers didn’t get codes before launch. Most game companies have more backing than talent now days I guess. No amount of employee grind would have fixed it in a reasonable timeframe.", "label": 1}
{"text": "Oh, you’re definitely not alone! LittleBigPlanet holds a huge place in my heart. I think LittleBigPlanet inspired a lot of gamers. Sackboy and all those quirky, hand-crafted worlds will always be something special.", "label": 1}
{"text": "Based on my own experience, I think people recognise that as a fact (evidenced by the game itself featuring a trans character) but unless you pirate the game or buy it secondhand you *are* giving Rowling money.\n\nTo be frank though, I've long since realised that Rowling has so much money that not buying anything HP related is not going to make a difference", "label": 1}
{"text": "What about Half-Life, guys?", "label": 1}
