{"text": "I'm so blessed I got banned on MW3 for doing a token glitch because I don't think I would've played BF3. I did play the beta and enjoyed it but all my friends were playing MW3. The campaign, co-op, and multiplayer were across the table a banger.", "label": 0}
{"text": "It was also pc forward, you did not get the 64 player true battlefield madness on console iirc.\n\nIt was the last AAA game I remember having pushing pc forward stuff. Felt like  love letter to Dice’s original pc player base.", "label": 0}
{"text": "Horizon Zero Dawn. I dropped it 8 hours in when it initially came out, but then I put it on my Steam Deck when I got it and played all the way through and it was great. Great story and really fun combat.", "label": 0}
{"text": "Is this strictly console games because I played State of Survival for many years. I was never a spender and I was an in game streamer for at least two years but I was so dang bored after 6 months. It was hard to walk away but for the best. 😅", "label": 0}
{"text": "Back when \"what would be fun\" was the question the devs asked themselves instead of \"what's profitable\"", "label": 0}
{"text": "Add BC2 and 2142.", "label": 0}
{"text": "It really is on your end.", "label": 0}
{"text": "I definitely don't have time for this damn discussion again, I tell you what.", "label": 0}
{"text": "Gods I haven’t thought about this game in years and now I just want to play", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "I remember seeing that gameplay teaser for the first time and thinking it was bullshit, but then the game came out.", "label": 0}
{"text": "- Agarest: Generations of War\n\n- Alan Wake, and Alan Wakes American Nightmare\n\n- Alice: Madness Returns\n\n- Alien Isolation\n\n- Among the Sleep\n\n- Awesomenauts\n\n- Bastion\n\n- Transistor\n\n- Hades\n\n- Arkham Asylum and Arkham City\n\n- Bioshock, Bioshock 2, and Bioshock Infinite\n\n- Borderlands 1, 2, Tales from the Borderlands\n\n- The Bereau XCOM Declassified is ok.\n\n- Crusader Kings?\n\n- Dark Souls, and 2, 3.\n\n- The Darkness II\n\n- Darksiders 1 and 2\n\n- Dead Island\n\n- Dead Space and 2\n\n- Deadpool, not too bad.\n\n- Deus Ex Human Revolution\n\n- Devil May Cry\n\n- Dragon Age Origins\n\n- Dragons Dogma Dark Arisen, a must-play IMO. Very good, but also a bit dated.\n\n- Dust: An elysian Tail\n\n- Elder Scross Oblivion and Skyrim\n\n- Enslaved: Odyssey to the west\n\n- The Escapist\n\n- Evoland\n\n- Fairy Fencer F. Surprisingly good for me.\n\n- Fallout 3 and New Vegas, especially if you like RPG elements.\n\n- fallout 4 if you like smooth gameplay and easy exploration.\n\n- Far Cry 3 and Blood Dragon.\n\n- FTL: Faster than Light\n\n- GTA 3, 4, San Andreas, Vice City, 5.\n\n- Kingdoms of Amalur: Reckoning. A bit dated, but worth the play.\n\n- The Last Remnant.\n\n- The Legend of Heroes Trails in the sky\n\n- Mad Max. doesn't get enough love. This is a fantastic game.\n\n- Mafia 2\n\n- Massive Chalice\n\n- Metal Gear Solid V, the Phantom Pain. WOW!\n\n- Shadow of Mordor and Shadow of War\n\n- Metro 2033 and Last Light\n\n- Oxenfree\n\n- Portal  and Portal 2\n\n- Prototype and Prototype 2\n\n- Psychonauts\n\n- Recettear An Item Shops Tale. Very charming\n\n- Red Faction Armageddon and Guerrilla\n\n- Remember Me\n\n- Rogue Legacy\n\n- Saints Row 2 and 3 and 4\n\n- Sheltered\n\n- Sins of a Solar Empire\n\n- Sleeping Dogs. A must-play IMO.\n\n- Spec Ops the Line...\n\n- Knights of the Old Republic and 2\n\n- Republic Commando, a must-play IMO\n\n- State of Decay\n\n- Sunless Sea\n\n- Survivalist and Invisible Strain. An absolute must-play\n\n- The Wolf Among Us, a must play IMO\n\n- Thief\n\n- This War of mine...\n\n- Titan Quest, a bit dated but well worth a try.\n\n- Tomb raider\n\n- Valkyria Chronciles\n\n- Victor Vran\n\n- Viking Battle for Asgard\n\n- Warframe(online game, but can be done solo)\n\n- Way of the Samurai 4. The best adaption from this series of games.\n\n- The Witcher games\n\n- Xcom Enemy Unknown and 2, and Chimera Squad even.", "label": 0}
{"text": "Yeah, even not engaging with the narrative of the game I do really enjoy flying around in that game. I love the sandbox sized solar system", "label": 0}
{"text": "In addition the game being alt-tabbed 90% of the time. Warp drive is cool and all, but felt like it was where I spend most of my time.", "label": 0}
{"text": "It’s crazy, we all thought it could only get better… man that’s furthest from the truth", "label": 0}
{"text": "BF3 and MW3 came out the same year man. What a time to be alive. No micros too? And the lobbies. The shit talking. The communities. I feel sorry for the kids nowadays.", "label": 0}
{"text": "Absolute peak battlefield and should have been the foundation for future games. Instead we got 2042", "label": 0}
{"text": "These dudes legit need to be investigated and charged with fraud.", "label": 0}
{"text": "Borderlands two, I hated playing zero, My brother made me play the game for a lot, And I played zero and did not like his play style and did not like the game, I started playing the mecromancer And decided I like the game a lot more", "label": 0}
{"text": "Not if you had a ps3", "label": 0}
{"text": "Playing 5 games that take 20h or 1 game that 100h doesn't seem all that different, only in the first case that ends up being 5x $60-80 for some reason.\n\nI don't mind shorter games but I don't think a 10h game is worth $60.", "label": 0}
{"text": "Every step of progression is twice as much work as the last. \n\nMaybe in the future AI could really open things up by grossly reducing the amount of dev labor needed, but that seems unlikely to be soon as AI outputs beyond simple 2d images have been more trouble than they're worth to incorporate into workflows.", "label": 0}
{"text": "Battlefield was SO good back then. How have they screwed it up so badly?", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "We buy it because we think it's good. Chill.", "label": 0}
{"text": "To this day BF3 is the best multiplayer shooter I have ever played. At it’s peak there was nothing else like it and to be honest the franchise hasn’t hit those heights since. \n\nI am saying this as a huge fan of BF1 as well, it’s just that BF3 had some special combination to make it work. Also the community in youtube for BF3 was awesome.", "label": 0}
{"text": "Battlefield Origin 6?", "label": 0}
{"text": "This league some things clicked for me too. I was also super lucky with a drop early league and have been playing for the past few weeks still a couple hours a day getting some challenges done.\n\nThe first league I tried crafting and it worked so well. \n\nFirst league ever where I basically have a character with gear worth around a mirror. Maybe even more now that EE trickster is so popular.\n\nI know the sword I bought early league for 10d is currently worth around 200d.\n\nI'm almost done with the league tho. My goal was 36 challenges and I'm 34 right now.\n\nThe last ones should be relatively easy due to the currency market. Which I hope gets put in the next league too.", "label": 0}
{"text": "I don't think the confusion was if Cod still existed, but you can be mildly aware of a franchises existence without knowing it's fandoms nomenclature. \n\nUsing your example if I said \"Players in S&V are experiencing a bug turning blue\" there is no way in hell you'd immediately think of Pokemon even though you probably know that Pokemon Scarlet and Violet do exist. Same way D&W won't make you immediately think of Deadpool and Wolverine if that's even still the current marvel thing.", "label": 0}
{"text": "I stand with you (although maybe I'll do gamepass instead.)", "label": 0}
{"text": "BC2, BF3, BF4.\n\nNothing will come close to those games unless a miracle happens.", "label": 0}
{"text": "Especially with the desert combat mod.", "label": 0}
{"text": "Looking back at things I don't know how people used to play at 30 fps it just looks so uncomfortable now.", "label": 0}
{"text": "First multiplayer game I ever got into was netWAR in 1996... top down shooter with vehicles \n  \nalways crazy to see how far we've come", "label": 0}
{"text": "Not a day goes by I don’t recall a fun time playing 3 and 4!", "label": 0}
{"text": "that beta was probably the single best time in gaming i've had, idk why but the full release never approached that feeling", "label": 0}
{"text": "  Ç", "label": 0}
{"text": "Man, I don’t even game any more so idk why this popped up on my feed but I used to and this game was so fuckin good. \n\nI remember trying to convince all my friends to get and play this instead of COD, but it never worked. I loved sniping in this game, it was so realistic.", "label": 0}
{"text": "RuneScape", "label": 0}
{"text": "Destiny, DCUO, Division ², and AC Valhalla.", "label": 0}
{"text": "You can with the new stone portals.", "label": 0}
{"text": "Sound was so good", "label": 0}
{"text": "The last spell is an excellent fantasy tactical tower defense turn based game\n\nGot that heavy metal fantasy soundtrack too", "label": 0}
{"text": "13 years ago and it’s still better than 2042", "label": 0}
{"text": "Am I crazy or did you originally open the server list on a web browser on pc?", "label": 0}
{"text": "I usually felt like this whenever I started to do PVE to fund things.\n\nNow I just market trade and pay for my subs and not worry about things other than pvp", "label": 0}
{"text": "Peak gaming 👌", "label": 0}
{"text": "Peak gaming", "label": 0}
{"text": "How so? I've simply had experience with all of the Fallout and Elder Scrolls games.\n\nBleepa-boopa-diddly-doo, I am not a bot.😋", "label": 0}
{"text": "I played co-op with my wife to get all the characters to 70. You level up like a rocket ship when there’s another player with you blasting through high difficulty enemies.\n\nThe one trophy that eluded me was the one for doing 500 bounties. What a grind.", "label": 0}
{"text": "Yep. Sometimes, more quests just starts to feel … meaningless.", "label": 0}
{"text": "She is supposedly “working” on a MMO for her cult, and sometimes uploads music she makes. Ive listened to it, it is terribly bad, Ive heard literally better midis from the 90s than the trash she produces.\n\nI wouldnt hold my breath on her making a big return though she claims she will.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Its been years since i last played. Just recall the devs saying they had no plans to change that.\n\nI do plan to play it again sometime though, so good to know.", "label": 0}
{"text": "Any Ubisoft game. \n\nBut recently, Forbidden West. It’s a really great game, but trying to 100% the game is tiresome.", "label": 0}
{"text": "I mean, no vehicle maps were always popular with the BF community, it's just that before that they had to force maps to be like that with community rulesets, this added an official map for it. Seems like straightforward catering to their own audience.", "label": 0}
{"text": "Loved this game for the Metro map!", "label": 0}
{"text": "I JUST realized that Croc is not, in fact, the same character as Gex.  This is more embarrassing than Croc at Gex's house.", "label": 0}
{"text": "I've been playing battlefield since bf1943 and I feel like this game has always gotten it's praise.", "label": 0}
{"text": "Bro, Close Quarters was my favorite DLC and to me personally, nothing has come close to it since. 32vs32 on those tiny maps with destructive environments… shit was PEAK online gaming for me.", "label": 0}
{"text": "It's very difficult to make a progression system that caters to everyone.\n\nIf you make it so that playing rewards you with better weapons and accessories, people who can't play as frequently will feel dejected, and giving better players better gear is generally not a good idea, you end up with lobbies dominated by veterans against which new players can do basically nothing \n\nBut if the stuff you unlock isn't better, what point is there in trying to progress?\n\nYou can try to make progression unlock more fun weapons, but that's very tricky since usually fun is measured in how useful they are.", "label": 0}
{"text": "64 player Operation Metro was certainly...an idea someone had for a map design. Not sure it was a very good one. ", "label": 0}
{"text": "Good ol' Play Anticonsumer Station.", "label": 0}
{"text": "I like games where you can do the main story in between 30 to 40 hours, but there's enough side content to double your playtime if you so choose.", "label": 0}
{"text": "AC Valhalla", "label": 0}
{"text": "Kinda Ghostwire: Tokyo... felt cool and spooky, but reminded me too much of Ubi formuła.", "label": 0}
{"text": "Yeah and the game is fun af too. So many cool moments in that game. Check out the subreddit for cool plays and moments r/thefinals", "label": 0}
{"text": "\"Well Mason, I'm afraid I just blue myself.\"", "label": 0}
{"text": "I always get that Xcom itch every year or two and go on a binge.", "label": 0}
{"text": "FF8", "label": 0}
{"text": "The technology used to exist but it doesn’t anymore", "label": 0}
{"text": "I loved the Witcher 3. But it took me like 3 times to get into it bc I felt like the beginning was dragging on too long before any meat of the story had begun", "label": 0}
{"text": "BF4 was always my go-to game for goofing off for a night. I loved getting in the MAV that can only spot and set off placed explosives. I'd run it way high in the air where it was rarely spotted, and just watch from behind enemy lines. I'd either tag people who thought they were sneaky like hiding on a building or somewhere remote, or wait for them to set a claymore/mine. Then, when a buddy or themselves ran by, set it off. I always felt special having the little MAV icon show in the kill feed. I'd also take it out in Locker and try and camp it in the central circular room. Then, when we lost the point, just survey and maybe blow explosives up when no one is looking.\n\nI tried to get on recently, and EA told me my license to the game had expired or some shit, after years of having it. I know I got it free somehow, but it was definitely a permanent copy. I just uninstalled Origin on the spot and still have zero desire to play anything EA again.", "label": 0}
{"text": "BF 1942, BF Vietnam, BF 3, BF One are the best. Also I feel really silly typing those out… Vietnam released in 2004 and then a whole bunch of games later we get “3”", "label": 0}
{"text": "these were developed for the Xbox 360 and PS3 how 2042 wasn't anywhere near as good idk", "label": 0}
{"text": "This looks like the starting area of Half Life 2", "label": 0}
{"text": "Yeah that one was absolutely the worst of the lot.  This one's just playful ribbing, that one was...  I don't know what that was.", "label": 0}
{"text": "Absolutely not.\n\nBf4 improves everything.\n\nAnd bf1 is the best game on the series and the community favorite.", "label": 0}
{"text": "Apparently Project Rome is alive for BC2?\n\nNice thing with BC2 was (is?) that it doesn't even require Origin/EA app to run (installing requires ofc).", "label": 0}
{"text": "I don't think an RPG would do that. Seems like an inside job to me.", "label": 0}
{"text": "I loved that game so much", "label": 0}
{"text": "Even Modern Combat slapped hard. It was the COD 4 for the Halo 2 days.", "label": 0}
{"text": "I don't mind that they get taken down, but I wish some steamfest demos didn't decide to use steam drm. It's fine if they wanna remove them since they don't want to maintain them, but man, just let me download it and play it in my own time.", "label": 0}
{"text": "Wait until you hear how old BF2 is.", "label": 0}
{"text": "gegagedigedagedago", "label": 0}
{"text": "Nit brightness by subscription tier", "label": 0}
{"text": "I could never get into 4 after 3. It just felt crappy, too much water and boats", "label": 0}
{"text": "far cry 5 is low-key great. I'll give Ubisoft that win, but that will be their only win.", "label": 0}
{"text": "Destiny 2. Fomo is real and had me hooked for years. Finally saw the light and quit playing live service altogether.", "label": 0}
{"text": "This looks cool. \n\nI rarely played Settlers or Age of Empire but loved the build a city and raise armies kind of thing.", "label": 0}
{"text": "recon sniper was so stupid and so fun. why were snipers allowed to have recon grenades and slug shotguns", "label": 0}
{"text": "Hades\n\nBut overall, IPs aren't making as large of an impact because there aren't enough sequels to them.\n\nGears, Halo, Mass Effect, Uncharted, Assassin's Creed, Dragon Age, Witcher, they all were able to grow more rapidly than new IPs presently because they were around more frequently. If we go further back, GTA, Splinter Cell, Zelda, Sly Cooper, Gran Turismo, Final Fantasy, etc.\n\nGamers were able to get entries in these series very quick compared to today. This allowed the IP to create a foundational impression in consumers, so when GTA suddenly starts taking 10 years to develop, no one minds because the franchise has already proved itself with tons of prior entries.\n\nTLOU is kind of an anomaly because it was an absolutely amazing stand alone game. The sequel didn't come around for 7 years, but it didn't even need to come around to be remembered for decades to come. There are obviously other stand alone games that are fondly remembered, but most fall under the category where people WANT more. TLOU, I feel people were content with just the 1, which is honestly super rare when you think about it. No one wanted more from that IP, but not because it was bad.\n\nRed Dead is another. I think people were perfectly content with it being the only one (even though it technically was the second in the franchise). And it didn't really need the sequel 8 years later.\n\nTry to think of a new IP trilogy starting from the PS4 and I think you will realize the difference in how IPs struggle to gain that same foothold as IPs of the past.\n\nThe 2000-2013 era of games was absolutely insane when it came to production quantity and quality. There was a HARD drop off after 2013. You either get quantity with no quality, or quality with no quantity.", "label": 0}
{"text": "MMOs", "label": 0}
{"text": "maybe the parent to your comment also played halo 2 and 3.", "label": 0}
{"text": "Still active?", "label": 0}
{"text": "God... what happened to thus industry.", "label": 0}
{"text": "We may not like it but this is what it means to be a bot now. Someone online got annoyed by your comment so you so you must be a fusion of circuits and algorithms. Buzzbeepboop.\n\nThat being said the mild over explaining / specificity in parenthesis is probably what they disliked about your comment (if you really did want to know)", "label": 0}
{"text": "I know I’m an old head but…try playing this against your friends in the same room", "label": 0}
{"text": "I broke a controller on rush Operation Firestorm on xbox 360 once when my teammates were being braindead. fun times", "label": 0}
{"text": "I liked doing the playlist every week, but didnt really care about my car collection. So then i started just doing the weekly vs. races, the team battles, and an eliminator here and there. If you dont care about your car collection, and just doing what the game has to offer, its still fun. Be nice if it didnt focus so much on prizes you can only get “this week”, but it was still fun.", "label": 0}
{"text": "Where's their evidence that it doesn't ruin performance?\n\nWell.... We're waiting.\n\nI'm willing to bet they don't have that shit active on their games and never have, and therefore have no idea wtf they're talking about.", "label": 0}
{"text": "Back then, I really thought it was \"I will bleed, I will die\"", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Any game where you have to sink more than 30 hours into or they have “Events” that need to be completed by a certain time.", "label": 0}
{"text": "Red Dead Redemption 2. Overall I still like the game and enjoyed playing it for the most part, but the closer I got to the end I was just getting impatient and wanted to wrap things up.", "label": 0}
{"text": "🤣", "label": 0}
{"text": "Overwatch. I was really into it but i got burnt out trying to raise my level/SR. Once they started not letting me play with some of my friends cause of our level/sr distance i knew it was a matter of time", "label": 0}
{"text": "Yes! Forgot to mention Hardcore! Was definitely the best way to play, for sure. The gun play on HC was so damn satisfying", "label": 0}
{"text": "Exactly, I understand why they thought switching it to flags was to make it more of a team effort, but it made it so much less individually rewarding, in turn pushing you even less to play the objective at all even with the team because you borderline felt useless anyway. I really hope rush makes a strong come back in the next BF, it can't stay dormant or be put as a secondary low effort game mode like how they've done since then.", "label": 0}
{"text": "I still play bf4 almost everyday. How Dice thought bf2042 was a good idea is beyond me", "label": 0}
{"text": "I remember thinking we’d end up getting something like Manhattan with fully destructible buildings in a decades times. \n\nLmao. ", "label": 0}
{"text": "Dying light 2", "label": 0}
{"text": "Fall Guys -- especially once they started gating old content in a way where you would only see the same few maps each run through.", "label": 0}
{"text": "BF3 is peak FPS. Love that fucking game. Every map was good. Spent so many hours 100%ing every gun.", "label": 0}
{"text": "0 was 2024 years ago 🚬", "label": 0}
{"text": "You did when you had 5-8 hours free a day, before responsibilities. You don’t know, just like the adults who took care of you when you did.", "label": 0}
{"text": "The amount of hours I played on metro 24/7 servers is too damn high", "label": 0}
{"text": "Fortnite… I miss enjoying it. But I’m getting “old” and it’s gotten to sweaty for me now… also call of duty, still waiting for a bo2 remastered that will probably never happen.", "label": 0}
{"text": "What? Battlelog is soooo much better for browsing servers, swapping loadouts, checking personal stats, etc.\n\nThe unified console UI that has been forced on PC players in later games is far less functional.", "label": 0}
{"text": "BC2 was absolutely the best in the series and easily one of my favorite FPS games.", "label": 0}
{"text": "Operation metro 24/7 max tickets, just chaos and I loved it. I played medic and would just break out the paddles and drop meds in choke points. Got a ton of xp and would be near the top of the leader board just off healing. No one was dying on my watch.", "label": 0}
{"text": "I played with my wife. She ended up doing most of the base construction and gathering, whereas I'm normally all about the fancy base building.", "label": 0}
{"text": "If you like scavenging, exploring, unsettling environments, and weapon handling, then you will like it.\n\nThe story is nothing special though. What kept me going is completing missions and exploring new areas.\n\nOne thing I recommend is to save constantly and load whenever you need to, it is basically necessary.", "label": 0}
{"text": "The only game I skipped school for. Peak Battlefield", "label": 0}
{"text": "If you weren't suppressed on Metro, you were either dead or sneaking behind the trains while having your squad spawn on you", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Battlefield 1942 was amazing as well", "label": 0}
{"text": "It’s like binging season one of GOT in a weekend and watching one episode a month over 2 years. It feels different. You are more immersed. You forget less.", "label": 0}
{"text": "2k25 - what they’re doing with mtx should be illegal lol", "label": 0}
{"text": "This would be SWTOR for me", "label": 0}
{"text": "It's a procedurally generated game that if you manage to actually beat it, you might find yourself disinclined to ever give it another go even if it's a new world. It's just too big, too repetitive after awhile, and takes way, way, way too long to explore to find the resources that you need.", "label": 0}
{"text": "Give me BF3 with total destruction, I don't care if it's the same graphics.", "label": 0}
{"text": "Didn't know they put a Paul Giamatti skin in BO6", "label": 0}
{"text": "I don't recognize it, what's the title?", "label": 0}
{"text": "You’re right 👍", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "I fully expect for this to be cheap compared to what Blizzard will put on the marketplace in the next few years.", "label": 0}
{"text": "NieR has probably one of the best stories in all of gaming. The whole >!the protagonist is actually the unknowing villain who’s been murdering innocents the whole time!< twist at the end genuinely caught me off-guard.", "label": 0}
{"text": "Cool environments and visuals! Needs work on the dialogue/writing and animations overall.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Blaze Blue", "label": 0}
{"text": "\"How Did This Happen?\" \n\nBlizzard likes money, and people keep buying it. Mystery solved.", "label": 0}
{"text": "Final Fantasy VIII, Kingdom Hearts (not necessarily the first game but the series overall), Chrono Cross, Xenogears, Xenosaga trilogy. JRPG’s are weird but I love them to death.", "label": 0}
{"text": "Ethical is for non-luxury products. If someone wants $90 pixels, that's on them.", "label": 0}
{"text": "The mistlands is such a horrible biome that it makes the flaws of the gameplay loop extra obvious and annoying.", "label": 0}
{"text": "It's not that old equals good, it's that there are objectively more and better features in the previous games", "label": 0}
{"text": "But that doesn't work. We're told that if he accepts the baptism he becomes Comstock, if he rejects it, he becomes (or stays?) Booker. To take a Booker back in time and have him accept the baptism puts him in a unique position. To then kill him negates nothing. For the intended outcome, they would have had to go back to the original Booker's timeline and kill him before he makes the choice, which would make the story make sense if we didn't watch events through Booker's eyes.", "label": 0}
{"text": "I don't play WoW that's why I said \"when it's purely cosmetic\".", "label": 0}
{"text": "Looks pretty good to me and launch of it seems smooth minus the token economy.  Token economy is more human behavior though, but still funny.", "label": 0}
{"text": "Such a nothing burger. Oh no, optional mount! You aren't forced to buy it, it doesn't impact your ability to play the game and there have been a lot more expensive cosmetics in games before this.", "label": 0}
{"text": "So much outrage, it amazes me. You guys are going to have a heart attack when you find out that gacha games exist.", "label": 0}
{"text": "Interesting list! 😲", "label": 0}
{"text": "I never had a problem with Dinklage's performance, but personal preference, I guess. It was so many years ago, but I did hear both when I played and wasn't overwhelmed with either one of them... which brings me back to the writing. It just felt like a major slap in the face to him. If his performance was so bad, then someone should have noticed and replaced him before the game was released. Companies  replace actors all the time, but not after a game's release.", "label": 0}
{"text": "Cheaper for developer. Less overhead, less chance for the game to fail. Higher chance for dlc or sequel. More money devoted to QA or even just more money in the pockets of devs so they are motivated more without having to rely on other scummy monetization methods that do impact the game. \n\nAlso, physical games never go on steam sales.", "label": 0}
{"text": "King of the underground...", "label": 0}
{"text": "Now do the patch.", "label": 0}
{"text": "You're making a value judgment on people's hobbies. Is playing guitar a cooler hobby than playing wow? Sure. Is it more valid? No, and suggesting it is makes you look a bit condescending. Most people who play guitar aren't professional musicians. They play in their bedroom or basement, largely by themselves and for their own enjoyment.", "label": 0}
{"text": "Do the numbers have to be on the floor from the other side? Why not on the wall from your side or something?", "label": 0}
{"text": "Black Ops 2 was incredible.", "label": 0}
{"text": "That's actually really lame that it doesn't work", "label": 0}
{"text": "I mean, it doesn't look like halo 3 gameplay at all. There's sprinting, other movement mechanics, and none of the gunplay from halo 3, or the general arena elements", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Remember when the celestial steed came out?  And every time one would be seen in the wild, they were mocked?", "label": 0}
{"text": "Pretty bad list. Seems like they intentionally left out some of the best games in favour of some niche Indie titles", "label": 0}
{"text": "Assassins creed", "label": 0}
{"text": "Back when they used to care about games", "label": 0}
{"text": "No Kojima, don't scan Irine!", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Whoa, weirdly rude response. \n\nLess on PC but consoles still have a lot of couch co-op experiences. Halo infinite has 4 player split screen on the Xbox series X. Nintendo still makes party games. \n\nI understand the point in your last comment but you're maybe 50% of the way to \"old man yells at clouds\". The era of LAN parties is nearly dead but that's just how shit goes. Not everything can become a tradition that stands the rest of time.", "label": 0}
{"text": "we all did, soldier", "label": 0}
{"text": "Ah, if i had a nickel every time I said that.", "label": 0}
{"text": "This post had the opposite effect OP intended (on me at least)", "label": 0}
{"text": "That is fair.  Ditto with the ultra expensive collectibles sold at conventions - flattering anime statues, limited edition books, and lavishly constructed replicas.\n\nThey’re not needs - they’re wants.", "label": 0}
{"text": "Goldeneye had one license and was a notoriously hard game to re-release. There was a finished Xbox 360 remaster that leaked but didn't release for like a decade because of licensing. They FINALLY got the deal done after an incredibly long time.\n\nNow compare that to the licensing for THUG and it's child's play.", "label": 0}
{"text": "Another perfect example of how moronic people are.", "label": 0}
{"text": "Final Fantasy XIII\nHorizon Zero Dawn\nEvery MGS", "label": 0}
{"text": "It’s straightfoward for like 90% of the game, and then the last couple hours are just a whole lot of insane lore reveals being thrown at you in a half explained manner. I kinda love it for that honestly but definitely had to look up some explanations.", "label": 0}
{"text": "It's really only useful for raiders as accessing the AH without porting and waiting for a Lock summon can save a lot of wasted raid time.", "label": 0}
{"text": ">So if someone plays a lot of wow it will save them a ton of time.\n\nI can understand the argument comparing it to other luxury goods... but defending it based on utility/QOL is interesting.\n\nAre there still legions of people addicted to this game? I had hoped people snapped out of that...", "label": 0}
{"text": "I wish I could bury my face in her essence", "label": 0}
{"text": "Definitely some surprises on here. BG3 at 18 most notably, but not seeing FF7 Remake is surprising. Wish Dredge would have made the list.", "label": 0}
{"text": "World of Star(Citizen)craft confirmed", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "BC2 was the absolute shit. The Vietnam DLC was incredible. It’s insane to me how far BF has fallen.", "label": 0}
{"text": "So, you steal anyway, then you justified it as “liking free stuff”\n\nYou don’t see the logical fallacy you just walked yourself right into?\n\nYou did exactly what I described. You didn’t like the high price of an item so you just took it because you could, which is what people have been doing for ages.", "label": 0}
{"text": "Because FOMO is the idiot disease only cured with micro transactions", "label": 0}
{"text": "I am not well versed on my local chicken laws, but anecdotally I've never heard of anyone having their chickens taken away, including both my coworker and neighbor who've had them for years.", "label": 0}
{"text": "Right. So I should hearth back to the city, sell all of my goods,  then fly back to my farm when I could just got on a mount and do it.", "label": 0}
{"text": "I think the problem is that after Assassins Creed 3, there wasn't an overall plot. They kind of just made it up as they went along, and I read somewhere that the newer games all had different people writing the modern story, and they all ignored things that the previous game set up.", "label": 0}
{"text": "I just figure they know they've got a good game \n\nEveryone seems to put it up right next to Alyx so I may just have to buy it full priced eventually", "label": 0}
{"text": "Easter egg 0451 is found in almost all immersive sim games and in some games that use some immersive elements - for example, Deathloop and Mafia 3.\n\nPrey was the working title of the game. After the journalistic leak of the name, Bethesda had to leave the name.", "label": 0}
{"text": "So Fromsoft games in general have a \"I get what's going on with the top layer but seems that there's a lot underneath\" feel that takes you hours of looking at a wiki or something to understand.  But the top most is pretty simple.  I'd say Kingdom Hearts is the most confusing as a series because when looking at the whole things it's just a mess but playing a game isn't terrible.  Maybe BioShock infinite is the winner for a specific game?  I haven't played a lot of the popular mobile games but I could totally see Genshin or something like that trying to be too big for it's britches with a story too.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "None of that matters though to my fear of pursuits and the original comment? \n\nNightmare returns, and as far as I understand, no matter how many times you kill it, it will return again. \n\nYou can just as easily claim that you can defeat Mr. X in RE2 during regular encounters, but that's not really true, is it? He's just gonna back away into the closest door only to come busting out of another some time later to the tune of \"X gon' give it to ya\"!\n\nMy fear stems from a feeling of tension tied to an ever present danger. When I can defeat an enemy and see the enemy dead, it soothes me. It's silly human psychology stuff that often lacks grounding in real logic. Phobias rarely make perfect sense to begin with.\n\nIt's not bound to a mechanic, a bunch of numbers, and game logic. I never said the game is bad or anything like it, I just expressed that I have an issue with pursuits in games, because they genuinely scare me, and expressed remorse that due to it I didn't finish a lot of game. I left that comment on a reddit discussion. \n\nIt's all casual, and yet your comment sounds to me as if I have to defend a dissertation in front of you or something...", "label": 0}
{"text": "How??? This is so good", "label": 0}
{"text": "And here I am replaying campaign for 5th time like this game came out yesterday", "label": 0}
{"text": ">someone plays a lot of wow it will save them a ton of time\n\nAll games are a time sink anyway. Maybe, instead of Avacado toast, this should be the new boomer dig.", "label": 0}
{"text": "Same reason that the top onlyfan models make millions despite there being no shortage of free porn.", "label": 0}
{"text": "Not really closer to the end of the game, you start getting gifts relatively quickly and it becomes very clear that you get more out of saving the girls than you do harvesting them.  \n\nUnfortunately the \"dilemma\" kinda fails at being a dilemma, because even if you are looking to be greedy or selfish, it's *still* the right choice to save them.   Seriously, even from a materialistic standpoint you only get like <10% less Adam when saving the girls, and you get special plasmids and tonics and other goodies to boot.  Even if you are playing a bad guy, it still makes sense to take the gifts instead as you just get more.  The only reason to ever harvest is if you are going for a comically evil playthrough or something. \n\nIf it made it so that saving them over harvesting them had a significant impact on the Adam you would earn, or at least something to make the harvesting choice even the littlest bit enticing, it would have made the choice a lot more meaningful.  Or at least make it very late in the game when you are given the gifts, at least that would sort have had a \"it was worth the trouble\".  But the game goes through this big exposition about how it should be a choice for your survival, only to immediately send you the opposite message later through gameplay mechanics as you start getting most of the adam back anyway alongside loot and exclusive powers and such.", "label": 0}
{"text": "Nah. Black Ops was never good.", "label": 0}
{"text": "I don’t think you know what moving the goalposts means. Responding to someone doing that isn’t moving the goalposts. Try rereading, hope this helps.", "label": 0}
{"text": "https://youtu.be/Ndgto6h4z9w", "label": 0}
{"text": "WoW had waaay too many quests for its own good. Each new zone had like 20 and it was more like going down a checklist than actually questing.", "label": 0}
{"text": "Goat cod for sure", "label": 0}
{"text": "Simple people buy it so they keep doing it", "label": 0}
{"text": "I wish ff14 had the kind of exploration gw2 has, ff14 just wants you to do story quests and dungeons and there's practically no reason to engage with enemies in the open world and no reason to explore the maps.", "label": 0}
{"text": "If only they could use that money to hire more peeps to fix the damn game and crank up the quality. Bet it goes in some greedy highers pockets.", "label": 0}
{"text": "Damnnnnnn", "label": 0}
{"text": "that dialogue gives the impression it was AI generated.", "label": 0}
{"text": "Boneworks?", "label": 0}
{"text": "I think it’s for the VR moment of looking closely through the opening since it seems like you can’t see the whole group clearly until you get close. Which you could do by making it small on the wall or something but I feel like peeking through a window is a somehow a cooler moment, maybe that’s just me.", "label": 0}
{"text": "MapleStory Vac Pets scandal when", "label": 0}
{"text": "There's main story beats which are pretty linear, but there's a lot of intercross between factions and who represents what and was secretly working with whom, especially when you try to pin down more fringe characters like the Gloam Eyed Queen and the exact lines or distinctions around the Golden Order, Greater Will, Erdtree, Two Fingers, Outer Gods, and Elden Beast(s), all of which can be referring to the same thing(s) depending on your interpretations of the small snippets of lore.", "label": 0}
{"text": "They indeed did their best to screw over the new \"PoP\" but in the end it still is a quite well made game.", "label": 0}
{"text": "Anyone else have issues with getting the game to start up on PC? Miss this game.", "label": 0}
{"text": "That's the world I am living in when I play LOL or Valorant or Fortnite or Dota and so on", "label": 0}
{"text": "Earthbound handled this better than any game in history.", "label": 0}
{"text": "This is why I don’t use a mic anymore.", "label": 0}
{"text": "Kingdom Hearts is light or something.", "label": 0}
{"text": "Why is a rickety metal grate an obstacle to Batman in the first place? He could knock out the X sections with his bare fist probably, or use the explosive gel he has in the other Arkham games (idk if it’s in this one).\n\nBut whatever, I’m being too particular. Still, this door is like the equivalent of a hospital bed on wheels blocking the hallway in a horror game", "label": 0}
{"text": "Going further into the past, we only had three characters available for our names. The machines made you spend coins, the games were fun, you beat the high-score and had to come up with a three letter name for yourself.", "label": 0}
{"text": "Every Fromsoft game.", "label": 0}
{"text": "Book Triss has only 5 letters and one of them is used twice.  Altogether it's a bland look.\n\nThis one has boobies.\n\nGame, Set, Match.", "label": 0}
{"text": "That's subjective. I've tried the other ones and I prefer 2042. It's the literal definition of subjective because it's opinion based. I respect people prefer the older games, and that's fine, but it's not my opinion and that's why it's subjective.", "label": 0}
{"text": "Hes smart, both hands visible. Slightly apart, face away from the subject. ", "label": 0}
{"text": "Bullshit", "label": 0}
{"text": "> Cheaper for developer\n\nThis is fair for indie developers that may not be able to afford the costs of physical, but I'm a consumer, not a developer.  Competition among the numerous storefronts which sell physical copies makes prices cheaper for me. \n\n> More money devoted to QA or even just more money in the pockets of devs so they are motivated more without having to rely on other scummy monetization methods that do impact the game.\n\nThis is not something that's actually reflected in practice.  The scummiest practices are among gacha games which is nearly a purely digital genre.\n\n> physical games never go on steam sales.\n\nSteam sales have been overrated for years.  Most games don't get the really steep discounts until a game has been out for years.", "label": 0}
{"text": "Oh yea. Sorry to make you type all this shit out. I totally misunderstood what the other commenter was getting at and I agree with ya'll that they didn't make the choice hard enough. Have a good day", "label": 0}
{"text": "Trust me bro, you’re matter. You matter.", "label": 0}
{"text": "**Microsoft Activision Blizzard**... what more do you need to know?", "label": 0}
{"text": "And they physically own the item. It’s theirs. You do not own **anything** on your WoW account. They are not remotely analogous.\n\nYou’re also conveniently disregarding everything I pointed out beforehand about how the mount is a monetized solution to an otherwise easily resolved problem to profit-grab by preying people who are committed enough to the game to drop lots of money for convenience in an ecosystem where the company have the power to resolve the problem itself in a consumer-friendly way.", "label": 0}
{"text": "Marathon Infinite. Honnestly at some point I switched my brain off and just enjoyed the ride", "label": 0}
{"text": "I thought it might not be. He's got good content but sometimes says stuff that is just blatantly false.", "label": 0}
{"text": "Imo, Cata was the last good expansion, but also the first expansion that wasn't as good as its predecessor. Retail WoW has sucked for years", "label": 0}
{"text": "I just threw stuff at them, also works well!", "label": 0}
{"text": "Ethics are subjective. A corporation is a profit seeking entity; wouldn’t the ethical thing to do, be to make money?", "label": 0}
{"text": "Game that was designed properly for VR vs Game that had VR added as a gimmick.\n\nAKA basically every VR game", "label": 0}
{"text": "Are we starting a support group?\n\nHi, my name is 18CupsOfMusic. I am also addicted to Oreos.", "label": 0}
{"text": "Invisible walls are \"devs being lazy\", not \"devs knowing better\".", "label": 0}
{"text": "You probably should have explained this in the submission post because it really looks like an invisible wall.", "label": 0}
{"text": "They'll have a second remake done of the original at this point.", "label": 0}
{"text": "The I Expect You To Die games are way underrated, I actually really enjoy seated VR experiences and they are perfect for that", "label": 0}
{"text": "I despise they got rid of the Final Fantasy characters by 3. Killed all interest I had. 1, CoM, and 2 formulate a solid story", "label": 0}
{"text": "The removal of the old content is part of why I cant get into Destiny. It seems really counteractive to getting new players. Im not gonna pick up a game where the whole start is gone and unplayable anymore, lol.", "label": 0}
{"text": "*Very* early on too.  You get a gift box after the third sister, and it literally gives you basically all the Adam you would have gotten (basically it ends up being less than ten percent adam to save over harvest) alongside of all kinds of awesome goodies.  The game doesn't try to hide the gifts being better either, literally the first gift gives you the ability to hypnotize big daddies.", "label": 0}
{"text": " Glad you escaped! Watch out next time.", "label": 0}
{"text": "The Yakuza games can be kind of confusing at times, but even for a Yakuza game, Yakuza 4 makes my head spin.", "label": 0}
{"text": "Nope. You aren’t the buyer or seller, so that’s not your call to make.", "label": 0}
{"text": "ASS", "label": 0}
{"text": "The truth is that anti-cheats only exists because Windows (and also Linux) security model is terribly bad.  \n\nThe same way Cheat Engine can do whatever it wants with your game, so does any malware can do with your browser data.  \n\nIn my opinion we need something like Android but with more freedom that always leaves traces that can be checked, possibly triggering a callback on the target application.", "label": 0}
{"text": "Neon White definitely deserves to be in the top 50", "label": 0}
{"text": "Of course! The ones in bold are my best choices, but I'd say they're all worth at least a look. My current favorite is A Happy Place.", "label": 0}
{"text": "While I agree that attention to detail can really drive home plot points and character development, I don't think characters wearing the same outfit for the game's entirety can affect story immersion or quality. And even if it did, it depends on the game and the character's current situation. Like, does the character even have the time to go out and buy a new set of clothes and the time to put them on? The Kingdom Hearts series has a great story (to accompany great gameplay) and the main character doesn't wear different outfits very often. For example in the first Kingdom Hearts game, Sora has exactly one outfit throughout the entire game except for when he enters Halloween Town (From Nightmare Before Christmas) and Atlantica (From Little Mermaid). The former he has a Halloween inspired variation of his default outfit and the latter he's shirtless with a merman's lower half. Although he has the one outfit for majority of the game, the story is still very good and hits you right in the feels at the end. The lack of varying outfits doesn't affect the quality of the plot. However, if different outfits truly mean that much to you I recommend the Persona games. Sometimes the outfits are just that, outfits, with no real connection or deeper meaning, there's a lot of them in each game, some are references to past games and others are goofy and silly. In Persona 5, they get a bit more creative with the outfits. When entering a dungeon, each party member's outfit is inspired by their metaphorical hearts or as per the game's wording \"Will of Rebellion\". Each character has a winter and summer uniform for school days, and a winter and summer casual outfit for days off. They're great games with amazing stories and well written characters. The games run long though, the most recent one, Persona 3 Reload, is roughly 90 hours so it's certainly a time investment. Definitely worth it though.", "label": 0}
{"text": "No, money is not a measure of quality, but word of mouth goes a long way.\n\nAnd yes, the franchise started as a side scroller, but was never popular until the PlayStation era, which is what everyone thinks of.", "label": 0}
{"text": "World of goo", "label": 0}
{"text": "absolutely killed any fun in multiplayer games", "label": 0}
{"text": "WH40k is massive and very poorely represented in video games.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Metal Gear Solid 2. 95% of the game is totally cliche worldwide Shadow government genetic espionage spycraft stuff. \n \nAnd they get to the end and start talking about the Lululelehluleleleue and they just  lost me and haven't played metal gear since", "label": 0}
{"text": "I wish I could inhale her essence", "label": 0}
{"text": "Looks pretty interesting, I'll take a look.", "label": 0}
{"text": "Apologies, I’m not trying to shame your opinion - I assumed you were saying you were okay with this mount too under the assumption that it, like the skin, was purely cosmetic and offered no in game benefits.", "label": 0}
{"text": "It's not a matter of the characters buying the clothes it's a matter of them having a wardrobe in general.", "label": 0}
{"text": "interesting list. seems to be a bit biased but I guess what list isn't.", "label": 0}
{"text": "Hot af!\n\n\nThe girl looks cool too", "label": 0}
{"text": "All the softies should stick to the campaign and then uninstall.", "label": 0}
{"text": "Killer7", "label": 0}
{"text": "September 2024 - Amazon gave it away via GoG", "label": 0}
{"text": "I really need to play this one...", "label": 0}
{"text": "Genshin Impact. Half the story you find out through main quest, for the rest you need to read numerous journals. It is my easier to watch a youtube video that explains it all.", "label": 0}
{"text": "I remember when they sold a ghost horse, years ago. No buffs, just vanity. I was wondering who in the world would have spend 20 euros for a vanity mount: the day after, there was ONLY that mount around.\n\n\nIt paid for all employees bonuses.", "label": 0}
{"text": "Thar she blows!  Harpoon that whale!", "label": 0}
{"text": "I couldn’t tell where I was suppose to go but I damn well know I’m going somehwre", "label": 0}
{"text": "You say that, I still don't know what Kingdom Hearts actually is. And I've played 1, CoM, 2, 358/2, the prequel I forgot the title of for PSP, and 3. \n\nIs it a place? Is it literally god? Is it bad? Good? Fuck if I know", "label": 0}
{"text": "There really is nothing else to it.", "label": 0}
{"text": "Has to be. The environments look great and then the facial animations look like sleep paralysis demons.", "label": 0}
{"text": "It's scummy to put convenience behind paywalls, especially in a game with a monthly charge.", "label": 0}
{"text": "Yeah I know not being able to yell slurs at 13 year olds is just heart shattering", "label": 0}
{"text": "You'd have zero nickels?", "label": 0}
{"text": "I sometimes think that a nice way around that issue would be to include something like Spotify integration to allow people to recreate the original soundtracks themselves.\n\nDangerous Driving which was a spiritual successor to Burnout 3 created by some of the former Critereon devs did that & it worked really well. You didn't even need a Spotify premium account for it to work although you did lose the ability to skip songs in game without premium.\n\nNot a completely ideal solution as obviously not everyone is going to have or want a music subscription service but for those that did it would be a nice option.", "label": 0}
{"text": "What is unethical about selling people things they want to spend their money on? \n\n\n\"I built this digital product, want to buy it?\" \n\n\n\"Yes please\"\n\n\nYou unethical son of a bitch! ", "label": 0}
{"text": "Hey, I am perfectly fine with adaptions taking liberties and this is one of them.  Game Triss looks really good.", "label": 0}
{"text": "That means it's effectively out of the game for 99% of players.", "label": 0}
{"text": "not everyone is a miser like you seem to be lol\n\nlike it or not, for some people $90 is a trivial amount of money", "label": 0}
{"text": "Volcanoooooooooooooo", "label": 0}
{"text": "What a shame.", "label": 0}
{"text": "Keep us updated on your One Piece progress! Started it a while back and been going through it at a slow pace. Currently finished the Alabasta Arc! I’m guessing you’ve just finished Arlong Park?", "label": 0}
{"text": "The devs didn't even want it to be called Prey, because it had nothing to do with the other Prey.  \n  \nPlay it for them.  \n(and for you, because it's a great game)", "label": 0}
{"text": "It becomes incredibly easy to kill. There is nothing to fear at that point. *You* become the danger. \n\n\n>You can just as easily claim that you can defeat Mr. X in RE2 during regular encounters, but that's not really true, is it?\n\nIt is nothing like Mr. X who literally cannot be killed. This monster can, and it becomes hilariously easy as you become essentially an alien god. The chase is also broken anytime you load into another area. It doesn't happen anywhere near 10 minutes. I think I fought that thing 3 or 4 times total as it took a few hours before it showed back up. \n\n>It's not bound to a mechanic, a bunch of numbers, and game logic. I never said the game is bad or anything like it\n\nI didn't say you said that either... \n\n\n>It's all casual, and yet your comment sounds to me as if I have to defend a dissertation in front of you or something...\n\nLike the monster issue, you are making this into a bigger thing than it is. You don't need to defend anything. You left a comment that suggested you didn't know you could actually kill the monster so that is why I responded.", "label": 0}
{"text": "> Dota \n\naye the original free-to-play, great game.  \nAlso the first battle pass", "label": 0}
{"text": "I would be crying in star citizen after the latest news that said its going to launch with 5 galaxies instead of 100 and they are only done working on 2 after 10 years in development, and that its going to have PVP open everywhere, essentially making it Eve online..", "label": 0}
{"text": "Absolutely no one but you is responsible for how you spend your money", "label": 0}
{"text": "I want his shirt.", "label": 0}
{"text": "Sorry Stray, sorry Mario, Wordle is a better game. Says this list.", "label": 0}
{"text": "I'll take a look!", "label": 0}
{"text": "Faker is a literal celebrity in south korea. He is as known (if not more known) than the famous korean athletes. Every single league player knows faker, there are 6 different skins in the game dedicated to him", "label": 0}
{"text": "which one ? The one on the NES and GB has quite a straightforward story: you're some gas pump clerk in russia", "label": 0}
{"text": "I love the series, but in a very “turn my brain off and watch anime boys beat up Jafar” kind of way.", "label": 0}
{"text": "You lost and want to try again from a save point?\n\nContinue?\n(Insert Coin)", "label": 0}
{"text": "Tex Murphy does not get the respect he deserves", "label": 0}
{"text": "When this game came out back then I was like It cannot get better than this!! And I was right.", "label": 0}
{"text": "And the videos you watched got a lot wrong too", "label": 0}
{"text": "Did you even fully read what I said? This reply sounds like you read only the first 3 sentences and then made your comment, without having fully read mine and without properly understanding it. Also the speed at which you replied does not make this any less likely. And because of all of that, I'm led to believe that you didn't read the whole thing.", "label": 0}
{"text": "https://m.youtube.com/watch?v=Alw5hs0chj0", "label": 0}
{"text": "How? Because people keep buying this shit, that's how", "label": 0}
{"text": "I mean... You could just reach past locked boxes in fallout 4 vr to loot things and it was great.", "label": 0}
{"text": "Probably anything made by Kojima!", "label": 0}
{"text": "WoW.  I know most of it is told via quests but I didn't raid so a large chunk of the arcs were lost to me.", "label": 0}
{"text": ">Like the monster issue, you are making this into a bigger thing than it is. You don't need to defend anything. You left a comment that suggested you didn't know you could actually kill the monster so that is why I responded.\n\n...I don't have to defend anything, that's true. For the defensive stance I am sorry. But. I completely disagree with \"you're making the monster issue bigger than it is\". To you it's no biggie. To me it's annoying enough to have this fear.", "label": 0}
{"text": "The GOAT of all battlefield games for me - from the campaign to multiplayer to dlcs it hit the spot on all fronts", "label": 0}
{"text": "I'm definitely going to regret using this, but what does \"top cosplayer\" mean?\n\nI'm assuming that \"cosplayer\" means \"person that dresses up like video game characters\" and I get that this is a thing for whatever reason, but Is there like...cosplayer world championships?", "label": 0}
{"text": "(looks at Elvis mask) A mask of the king? Blasphemy!", "label": 0}
{"text": "Having the interaction point be at the end of the hand and not the center of the camera isn't some hard to create masterpiece of coding.", "label": 0}
{"text": "That's just a poor excuse for greed. Why does it need functionality on top of the mtx part if they don't think it will make more people buy it?", "label": 0}
{"text": "Yeah people bought the $9, and then the $20 one, and so on, and so on. Boring company selling to boring people.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Worth noting, that Riot usually gives percentage of income from esports skins to the teams and players. It usually 70-30 for World's winner team, but idk if it was reviled how much did Faker get directly from this skin sales.", "label": 0}
{"text": "If people keep buying it, why would they stop?", "label": 0}
{"text": "Came here to say this.", "label": 0}
{"text": "What did they leave out", "label": 0}
{"text": "Bring back forced game chat and toxic lobbies. That was half of the COD experience", "label": 0}
{"text": "Thanks 👍", "label": 0}
{"text": "video game characters", "label": 0}
{"text": "Back when games didn’t hold back", "label": 0}
{"text": "And then they fired the person who designed that skin in their last round of layoffs.", "label": 0}
{"text": "Aaaaand now I want a Batman immersive sim. I would play the SHIT out of that.", "label": 0}
{"text": "They know the COD players will buy anything new every year", "label": 0}
{"text": "I'm sure this will be a pleasant comment section", "label": 0}
{"text": "Are you asking if there is cosplay competition??\n\nThe answer is… obviously yes.", "label": 0}
{"text": "Elegant solution: have the projectile come from the hand and not the center of the screen. Done.", "label": 0}
{"text": "DUHN DUHN DUHHNN DUHn DUUUUHHNNNN DUUUUHHHHNNNN!!!", "label": 0}
{"text": "Isn't this the one with the auction house on it from bfa?", "label": 0}
{"text": "\"Bethesda. It's always been Bethesda\"\n\nGdi Bethesda, look what you did", "label": 0}
{"text": "Little bastards deserve nothing less.", "label": 0}
{"text": "Its because idiots keep buying it. \n\nBeen saying this since the days of the first in game purchases appearing in browser games on Kongregate and Newgrounds. Before the horse armor ever happened.\n\nStop. Buying. This. Shit. Or. It. Will. Just. Keep. Getting. Worse.", "label": 0}
{"text": "Yes, you've correctly identified why the government only seems willing to take action on anything if there's some middle-man that can stuff their pockets in the process.", "label": 0}
{"text": "This is true of any metal gear game except for Rising and maybe the originals", "label": 0}
{"text": "Not an issue on PC because everyone is in discord lobbies", "label": 0}
{"text": "Throw a red barrel!", "label": 0}
{"text": "Nooo she ain't a freak", "label": 0}
{"text": "Hi I'm sora from kingdom hearts", "label": 0}
{"text": "One of us...", "label": 0}
{"text": "Bioshock infinite", "label": 0}
{"text": "I loved FFVII, still do, but I would say that the story was probably more complicated than it needed to be. So who was the main antagonist? Was it Sephiroth or Jenova? Didn’t Sephiroth die a long time before the story even started? \n\nI think VI and IX are the better games anyway, but even if they were all tied in terms of gameplay, those two would nudge ahead of VII just in terms of narrative clarity.", "label": 0}
{"text": "Mr Kojima making a fantasy game now, so that his characters don’t need shoes.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Bioshock Infinite. Especially the end. Bringing in different multiverses of Booker becoming and then not become Comstock but Elizabeth is also his daughter Anna but she isn't? But then he has to find her, but she gets taken by the twins into a parallel dimension?", "label": 0}
{"text": "You're right, it's a much bigger problem in PvP. You absolutely can buy skill. A couple of multiglad boosters can easily carry in 3s.", "label": 0}
{"text": "But you're deluding yourself if you think it isn't present in any religion.  Religion itself is just a way to exploit and extend the basic social organization that humans have innately.  Introducing more failure points to human's inherently social nature just means you have more failure points.  If you go to the way way back you've probably got the origin of all the mythologizing as somebody telling stories to other people's children and that got conflated with that person's ability to vouch for people outside the in group.\n\nNow if you get to the fundaments of it, what you're really railing against is humankind's social nature and how easily that can be exploited by people that lie, and you're conflating that with religion because religion does it publicly and prevalently, but you don't think of the people doing the scamming in a religious context as being somehow better than the people doing phone or check scams.  Then you've got all the child abuse but that is an extension of the same problem.", "label": 0}
{"text": "Yea seeing all of this love for the game makes me feel like a bitch cause I was so scared I quit within 30 minutes of starting the game 😭.\n\nHaven’t touched it since. Maybe it’s time to grow some balls.", "label": 0}
{"text": "Dead Space Remake, RE4R, Silent Hill 2 Remake, GOW Ragnarok, Returnal, Metaphor Re Fantasio, DOOM Eternal, FF7R and Rebirth, Horizon Forbidden West to name a few \n\nIf this was a top 10 list it would make slightly more sense, but this list is saying none of them are in the top *50*\n\nIt’s not as if they’re not counting remakes either since Nier Replicants remake is on there", "label": 0}
{"text": "This is such a hilariously dipshit take. You're comparing elements that actually improve gameplay, drive exploration, establish an economy, foster a community to QoL improvements that do nothing but annoy players until they cave and spend more money on arbitrary bullshit.", "label": 0}
{"text": "Its designed to jack up the price of tokens, no one was buying them.", "label": 0}
{"text": "This is how Triss should’ve looked like in the show. What an abomination we got instead.", "label": 0}
{"text": "Of course I did, I am a fast reader. That comment was way too dumb I apologize. I just crave a game where it's kind like real time almost where you can actually take as along as you can without it being too boring. (Persona is great btw)", "label": 0}
{"text": "Enablers...", "label": 0}
{"text": "If you still buy Activision blizzard games you're an idiot", "label": 0}
{"text": "The nuance lies in the history of Blizzard. They built a cult in creating worthwhile products that delivered tremendous fun for their cost. It felt like they made what they wanted to make.\n\nIn more recent times none of this feels true. They've completely transitioned away from the genre that landed them on the map, and most of their decision making seems to come from what makes them money and not them making worthwhile products.\n\nThat's what makes it different than other sellouts, they are a sellout with history. That said I think there's a phrase about all of this, something about fools and their money...", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "It all started many years ago with a horse...", "label": 0}
{"text": "lmao what the fuk", "label": 0}
{"text": "-Irine Meier really captures Triss’s essence.\n\nBoth of them.", "label": 0}
{"text": "I wish the \"Immersive Sim\" steam tag wasn't filled up with regular simulation games because of the genre's poor choice of name...", "label": 0}
{"text": "I don't understand this philosophy at all. It seems to me like you're saying \"If you don't like it, shut up, I don't want to hear about it\".", "label": 0}
{"text": "Generally speaking regarding cosplayers, when people say \"talent\", what they mean is \"tits\".", "label": 0}
{"text": "Lost me at the very beginning with Stray cracking the list. Looking at the rest of the list, I can say we just have VERY different tastes.", "label": 0}
{"text": "I know some christian theology, but I don't remember there being aliens.", "label": 0}
{"text": "This whole thing is why I play on an RP server, I don’t need content or convenience\n\nI make my own c:", "label": 0}
{"text": "It's only going to keep getting worse. Those of us who remember a time when games were released as a complete package with hefty expansions that added a ton of new content are dwindling, being replaced by a new demographic who grew up with games that sell their content piecemeal. They just accept it as normal and view those of us who rightfully call out how scummy this practice is as weird. \n\nThere's really nothing we can do about it at this point, ugh.", "label": 0}
{"text": "Man the jet mission was SICK", "label": 0}
{"text": "PirateSoftware (former Bliz employee) has a story about a $15 unicorn mount that made the company more money than Starcraft 2 did.  To emphasize: A micro-transaction made more money than an entire game.", "label": 0}
{"text": "Lol I hated those barnacles", "label": 0}
{"text": "More power to ya friend. Ya hang on to whatever you can to keep going. Games have always been an escape for me also and at the end of the day family is the most important thing", "label": 0}
{"text": "What part was not clear? There are certainly some unanswered questions, but generally the background of what happened with the projector, the hiss, the good entity I can't remember the name of....I felt like it was 75%+ explained.", "label": 0}
{"text": "Bonk", "label": 0}
{"text": "Do your part and don’t give Blizzard a dime until they prioritize good games over cosmetic cash grabs. CoD has a fucking $20 microtransaction for high quality audio.", "label": 0}
{"text": "Hollow Knight, Dead Cells, elden Ring", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "The horse armor was nowhere the issue.  Riot games literally made this model what it is today when it made billions for them in a few short years.", "label": 0}
{"text": "Final fantasy 7… people act like they know, but the more you review the story the more confusing it gets. Like what is cloud, sephiroth and zacks relationship exactly, who did tifa grow up with, what is sephirorh and jenovas end goal?… people will tell you their “idea” but do they really know…", "label": 0}
{"text": "What if this group of reviewers just consider these more niche games to be better than the blockbusters you enjoy?", "label": 0}
{"text": "The first contender to halo, lol", "label": 0}
{"text": "KH1, Chain of Memories, KH2.\n\nThat's the line of those games and contained to those 3 experiences KH is fantastic.", "label": 0}
{"text": "Now *that's* a title I have not heard spoken in the wild in a looooong time.  A long time...\n\nWonderful game series.  They just don't make them like that anymore...", "label": 0}
{"text": "That’s a great analogy. How much these games exposed to us is great, and if the real world can let you continue that type of experience, then that’s awesome.\n\nLike, a lot of my career was in roles that didn’t require I master Excel. But I ran an energy business in Star Wars Galaxies and a delivery one in Eve: Online, and man did I need Except for both. I credit those to as foundations for my eventual MBA.\n\nAnd apologies for the unrequested history lesson, you just triggered a huge passion of mine that basically descended back into normal hobby levels only shortly after :)", "label": 0}
{"text": "Oh, My hell!", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "One of the most surprising games. I love it.", "label": 0}
{"text": "Great game thanks for the post", "label": 0}
{"text": "I thought it was funny OP. The ones getting triggered by this, well I can only imagine what pleasant people they must be.", "label": 0}
{"text": "why do her hands look photoshopped on", "label": 0}
{"text": "Ah ok great, I just wanted to make sure you understood the point I was making. And I'm glad to see you've already played at least one Persona game, I don't really see these games getting mentioned in all the game suggestions post this sub gets and it kinda disappoints me every time I see one of them so I just assume by default someone just doesn't know about it or hasn't played it unless they explicitly state otherwise.", "label": 0}
{"text": "Beautiful world, boring and repetitive gameplay. I couldn't finish it.", "label": 0}
{"text": "Prey is such an awesome game.\n\nAnd really early when you meet the phantoms, unless your wrench dance is top tier tango, you better sneak around.\n\nTerrifying game early game.", "label": 0}
{"text": "Even Batman can't outsmart these devs! 😄", "label": 0}
{"text": "Great game thank you for the post", "label": 0}
{"text": "Uhhhh buddy. Embracer has it now. Deus Ex is long dead. Deus Ex subreddit laments it daily", "label": 0}
{"text": "It's not a pointless FOMO though, it's a very real one. This isnt some random skin that just looks nice, it's by far the best QoL thing in the entire game.", "label": 0}
{"text": "A lot of people don't seem to realize, every single token listed is someone else spending $20. So if they are out of stock, it's because people aren't buying and listing them, likely in this case, because they are waiting for the value to go up.", "label": 0}
{"text": "Eh, that's resale value to the public market. The revenue from those 6 figure skins aren't going back to Valve, it's to players/collectors.", "label": 0}
{"text": "I'm sure this has had some many changes and was probably gonna be a cash grab micro transaction mess of a game at first and now development is probably all over the place as they don't know what to do with it anymore to con ppl. It's time to give up and scape it unfortunately. If anything it'll be like Skull and Bones if they continue wasting money on something they probably didn't care about in the first place.", "label": 0}
{"text": "You completely misread what I wrote. I wrote that there's no difference in the people who engage into these things and spend that much money. It's the same people. They are not well off and they are the types of people these companies strive to obtain to spend money.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "People need to look at mobile games like Evony. The whales in those games spend thousands and thousands. One guy I know is at least 100K in, and those games create sunken cost fallacies where people feel they have spent too much to quit, but the game is designed where you have to keep spending so they just keep dumping more money in.", "label": 0}
{"text": "Embracer owns it now. It's lost  . The IP is never coming back. They cancelled the Deus Ex game in developement for some shit reason.", "label": 0}
{"text": ">> As long as the game I paid for is good\n\nThat’s the neat part, it’s not. The more overpriced skins people buy, the more dev time is spent on cosmetics instead of actual content expansions and support.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Persona isn't bad i think it's all the reading that scares people away", "label": 0}
{"text": "Is the current state of VR worth getting into? If I'm going to drop $500-$1000 on a set I'd like to get my money's worth", "label": 0}
{"text": "Elden ring was the most straightforward souls game IMO (haven't played bloodborne so I can't say for that one) but I did the Ranni quest which do explain a lot I think", "label": 0}
{"text": "Teaming up with Hidetaka Miyazaki.", "label": 0}
{"text": "Well, putting worlde in front of tears of the kingdom is.. a choice.", "label": 0}
{"text": "Blizz: \"Here's a thing\"\nPlayers: \"I will pay literally anything for that thing\"\n\nReddit post: \"HoW iS tHiS PoSsIbLe!!!\"", "label": 0}
{"text": "So what you’re saying is you don’t use a mic because you can’t use slurs anymore", "label": 0}
{"text": "You cant? Didnt they release a remaster a few years back?", "label": 0}
{"text": "During the castle rampart bit of re4 remake there's some support you can destroy to lift a gate and create a shortcut. Usually it can only be shot open from the opposite side or you have to throw a grenade in a very particular way to get it immediately.\n\nMeanwhile in VR you can just reach around the bars and shoot it. You can also throw your knife at it if you want. It's so satisfying.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Still holding strong! Beyond Good and Evil 2 is coming, and we’re here for it! 😄", "label": 0}
{"text": "Stealing? Sure, but I'm not pretending it's moral and that denuvo is somehow immoral.", "label": 0}
{"text": "Written and directed by Quentin Tarantino.", "label": 0}
{"text": "Sold", "label": 0}
{"text": "The Batarang should just drop to the floor since you shouldn't be able to throw it with any real force with just a little wrist flicky like that.", "label": 0}
{"text": "This would make me quit this shit immediately. VR is built for being able to do creative solutions such as this and if the devs are too stupid to not realize it and not block that gate in such a way that your hand doesnt fit through if they are intent on not allowing it, thats shit design.", "label": 0}
{"text": "I'm just so glad there are games like DRG, Satisfactory and Valheim out there where you can, you know, pay for the game then play it as long as you goddamn like.", "label": 0}
{"text": "I don't typically think of such endeavors as competitive, but I suppose people will compete at just about anything.", "label": 0}
{"text": "The first The Evil Within. Plot so confusing that even the ending doesn't make sense and you need the video-explanation of some obsessed fan.", "label": 0}
{"text": "More games should be like Space Marine 2. A gorgeous, consistently engaging 10 hour linear campaign that doesn't have needless fluff, backed up by some fun co-op that doesn't feel like a job.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Looks like the real MVP of this release is the 'Report' button!", "label": 0}
{"text": "I too choose Triss", "label": 0}
{"text": "I'd argue that there isn't even a lot of that the game forces you to do. Most of the important cutscenes are fully voiced and you can skip a line of dialogue early if you want to. And the only scenes that aren't voiced don't even last very long so even there it's still not a lot of reading.", "label": 0}
{"text": "Killed her in my playthrough. Everyone still got sick tho.", "label": 0}
{"text": "Guild Wars. Everything seemed so magical back in 2005/2006.", "label": 0}
{"text": "I understand all lists are subjective, but they’re not even trying to be the tiniest bit objective, which reviewers should at least try to be. There’s a lot of highly critically acclaimed and popular games that they don’t think are in the top 50? Just seems like they’re being contrarian for the sake of it", "label": 0}
{"text": "Putting Disco Elysium on the backburner because the reddit community here turned me off on it.  \n\nI'm going to play Doom: Eternal with Baldur's Gate 3 next up, I think.", "label": 0}
{"text": "The jersey is real and won't leave once they shut the servers down.", "label": 0}
{"text": "Yeah the way they kind of insinuate that he traveled time at the beginning of the game can really confuse you. If you just forget about the time travel stuff then it actually comes together really well at the end.", "label": 0}
{"text": "Too late already scanned lol", "label": 0}
{"text": "It’s absurd for a lot of reason but the mount will not kill Ragnaros the fire lord nor will it dispense loot. I wouldn’t call this pay to win, but it is absolutely a money grab and will net Blizzard milllions in the final quarter of 2024.", "label": 0}
{"text": "Don't even need an emulator, it was released on PC.", "label": 0}
{"text": "No! I have... \\*jingles light change in left pocket\\* like, 67 cents...", "label": 0}
{"text": "I’m an avid gamer and a wood worker. Wife’s a gardener but that’s a kind of dirty I don’t like. I’m more than sand and glue type :) with wood you’re not working it all the time. You do a thing, wait, do a thing, wait, if the right project you can do things in parallel to fill the time but for what I do, that’s rare.\n\nI mention that because, like /u/Fwahn said, it depends on the type of game. I’d only quibble on the details. \n\nMy final time through FFXIV, I mostly maxxed out crafting, only raiding occasionally. WoW during pirates I spent mostly soloing to max select classes. ESO I never even grouped (mostly decorating and repathing my cats). \n\nWithout the group required elements, many modern MMOs have plenty of small wins that hit the dopamine in 15-20 minute sessions. Not all of them, and certainly not the endgame. And then of course there’s the single player games, especially the fast loading ones.\n\nBut i agree on other parts. The idea of joining a multi hour raid, or even a dedicated no-pause always-focused MOBA, or really, any group required PvP, nah.\n\nEach their own of course.", "label": 0}
{"text": "Same, that trailer killed any interest in the sequel.", "label": 0}
{"text": "yeah but what think about op's karma points", "label": 0}
{"text": "And PoE sells packs for $2000.. but they largely get a pass because it’s a F2P game so people say it’s okay.. which in my opinion I could give a fuck less what games sell what and for how much because I never buy it anyway and I haven’t played a game (aside from POE) where I’d say MTX are arguably needed to enjoy more.", "label": 0}
{"text": "This is probably the root cause of 90% of everything wrong on Earth right now. So long as ever-increasing profit/wealth is seen as priority, every single other thing, including all of that fun stuff like morals/ethics... Is a distant secondary at best. Until such time as this changes, it should not be surprising that the things we see happen are happening. Thankfully there are still many who are not desensitized to this, unfortunately all too many are, or naively choose to still believe we're a moral society. There's could be room for morals alongside profit, but there's no room for morals alongside the focused desire for profit.", "label": 0}
{"text": "That's the problem, this is starting to become pay-to-win, as in \"you can't remain competitive without this\". Even if the company doesn't want to do this, and really wants to keep the game playable, it will fail. Because it'll notice that a huge chunk of its players are running out of content and stuff to do (because of the time savings in not having to go back to a city for the AH or access their mail) so they'll have to keep adding content, at a point that the only way to access and enjoy all the content is to have the mount. And then it becomes full pay-to-win.\n\nPersonally, if I were in the room, I'd propose instead a \"pay-to-recover\" mechanic. Basically you can pay a small amount of money and get a boost that lets you move quickly through content that is a bit stale and \"catch-up\" to where the average is, but the new competitive content still requires the challenge. I can see a lot of players that want to play and see all the content, but also cannot have consistent playtime, they're parents and can't play over the summer, or they're grad-students and can only play over the summer, etc. etc. So you pay a little extra, and it lets you play the past dungeons and raids with a much more generous drop-rate, that lets you get a lot of the previous season's items and armor and be able to be competitive. Or you can choose not to pay, grind through the lower-tier dungeons and then use that to catch-up, though you won't be as good as you would be with the drops from previous raids. Something like that. So there's an incentive to pay (in order to catch up) but the end-game remains a very egalitarian situation.", "label": 0}
{"text": "you are correct in the sense that ethics is based on societies morals.\n\nSo if society deems doing whatever you can to get the most money you moral, then it is ethical", "label": 0}
{"text": "I think that’s what I tried. Couldn’t get the game to “log in” when you boot up. Are you using Steam or EA?\n\nOutside of CS, I think it’s the best multiplayer shooter ever made. BF1 has somewhat filled the BC2 gap though, great game.", "label": 0}
{"text": "I am, My love for something doesn't die no matter the time delay", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "I'll add Xenosaga to that mix as well", "label": 0}
{"text": "I dont even play anymore, accounts have been inactive for years yet even I'm tempted to buy it in case I ever come back. Its a limited offer? Argh", "label": 0}
{"text": "I appreciate you being an example, especially since I didn't ask for one.\n\nFirst person games usually spawn projectiles from the center of the camera, especially when there's an aiming reticle. This is because it's MUCH easier and computationally efficient to do that than to calculate the differential between where the player is actually aiming and where the player expects the projectile to go and move the projectile to match. It might not even be possible to do the second option depending on the physics system. So while your solution isn't \"a masterpiece of coding\"(?), it is inelegant and would take more work than its worth, assuming you even had time to implement that solution at all.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Only asking bc I want this to work, if you tried sticking your head past the grate could it go? Looks more to me like it left your hand but hit the grate bc that’s the first solid object in your line of sight", "label": 0}
{"text": "I love it so much. I've always loved immersive sims and pretty much anything Arkane. but something about Prey hit different for me. that opening hour of the game is one of the most memorable gaming moments for me as well. truly good game design all around. it's a rare game that I have recommended to friends who don't like action games or rpgs but they ended up really liking it.", "label": 0}
{"text": "It was hilariously bad writing. Bungie are the kingpins of bad writing, clumsy dialogue and Deus Ex Whateverthefuck storytelling.", "label": 0}
{"text": "Not a win, had to wait 2 years. It’s not only about the money, I *wanted* to buy the game for its full $70 launch price but EA simply failed to deliver.", "label": 0}
{"text": "The story of Infinite was great (in the end it’s basically your daughter kills one half of the Multiversal realities caused by your baptism choice but burial at sea fucked with that).", "label": 0}
{"text": "I work a sales job in an electronics store and one decent sale in a day can be 100-150 in commission so… idk it’s just not that big a deal to me and I’ve been playing the game literally 20 years.", "label": 0}
{"text": "Wow, like 5 times", "label": 0}
{"text": "Kind of bummed to see nobody mention The Finals here. The developers that made these games broke off and currently have a free to play shooter out called The Finals. You can feel the og battlefield vibes in it. \n\nhttps://youtu.be/DK8rK6g9Tv0?si=jnj5tdyDyr9H_0Mz", "label": 0}
{"text": "You post has been removed because it is not directly gaming related, or is a generic meme template.\n\n\"Related\" means that posts must contain gaming-related content in the link's content, or in the post's body in the case of a self-post, not just a \"forced\" connection via the title or a caption added to the content.\n\nNote that we do not allow non-gaming meme templates as submissions.\n\nAdditionally, discussion prompts must be made as text posts.\n\nFor more info, visit our rules page.", "label": 0}
{"text": "Best football game in years. Better than Madden", "label": 0}
{"text": "Idiots buy them", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Yeah… should have just make the little bars on the door tighter if they didn’t want players to be able to interact through it.", "label": 0}
{"text": "It took me finally sitting down over COVID and playing 1.5, 2.5, 2.8, and 3 all in order to understand lol. It's still not great, but at least I was finally able to connect some dots, what a mess", "label": 0}
{"text": "bro thats fortnite or cod", "label": 0}
{"text": "You've just unearthed memories of me digging tunnels with rocket launchers  and then scanning around with that OP rail gun that could shoot through walls and see thermal outlines of players through the walls too", "label": 0}
{"text": "Beyond Duke Nukem Forever and Evil 2", "label": 0}
{"text": "What a shame. What a rotten way to die", "label": 0}
{"text": "Maybe it's regional.", "label": 0}
{"text": "Most such games the AI \"difficulty\" is a resource multiplier.", "label": 0}
{"text": "It is all good, I get it. I don't like enemies I can't kill either. Maybe not as much as you but I usually nope out of horror games fast.", "label": 0}
{"text": "Brute forcing it 20 times isn’t very engaging either, and only leads to longer brute force attempts later.", "label": 0}
{"text": "Albion Online", "label": 0}
{"text": "But they aren’t selling it for $1900. People are selling it for that much. Rust released it for like $10 awhile ago and they went up in price from no more supply.", "label": 0}
{"text": "Gotta say I hate microtransactions like anyone else.\n\nBut companies really are in a bind. If they lock stuff behind actually hard challenges to make these types of things special for those who unlock them, people complain about FOMO and all this other stuff. So games dont seem to have anything apart from 'tasks' and not 'challenges' like \"complete a game\" instead of \"win a game\" which would be too challenging and people would complain. So, they cant really lock these things behind achievements to make them rare and desirable.\n\nSo they make them paid DLC, and they become rare because people cant afford it. So people get pissed, which I understand. But what do we expect, a cheaper price tag or to be given these things for free? Or do we just want these things to be unlockable by doing challenges or achievements or reaching milestones? Because it seems like gamers will just complain unless its given to them for free without having to do anything.", "label": 0}
{"text": "Cool cosplay. But I can speak only from my friends and my perspective, and none of us choose Triss.", "label": 0}
{"text": "It depends on the engine, there are plenty of VR games where this kind of thing would work just fine. This particular game is pretty linear and holds your hands constantly.\n\nI'm pretty sure you can't even break those radios with a batarang anyway, same with rat totems.", "label": 0}
{"text": "Oh man compare this to Netflix's Triss - what a tragic shame.", "label": 0}
{"text": "Although i would agree the problem is cheating has become so advanced I don't think anything can stop it at this point. \n\nThere are people who use a second computer with a camera to cheat so the main machine cannot even detect it as its not on the machine. \n\nThis isn't all cheaters mind you but they're getting worse and harder to detect. \n\nI'm not sure what the best course of action is against it at this stage. Banning accounts does nothing anymore as free to play ruined that with being able to make a new account. \n\nSome went the use a mobile phone route as a extra step but burners ruined that as well. \n\nWe could go into crazy areas of you need to start putting down your home address and you get mailed a code so you can play online. If you cheat then your house is banned for x years. But even then you could use family or friends homes to bypass it. \n\nIt's rough honestly. Thankfully in recent years I've found most cheaters stick to free games and not paid games so less likely to see them on paid games", "label": 0}
{"text": "Because a mount with the same features (auction house) was worth gold cap, which is equivalent to about $1000 worth of wow tokens.", "label": 0}
{"text": "I haven’t really heard too much toxic yet lol\n\nI’ve been ready 😭", "label": 0}
{"text": "0451 Started with System Shock. Any game that uses it is making a call back to that. All of Arkane's games have it, but so does Bioshock, etc. \n\nI'm pretty certain I read in the Prey artbook that the original name of the game was indeed Psychoshock.", "label": 0}
{"text": "\"Blizzard shouldn't sell a thing based on some arbitrary and vague threshold that I've defined for the moment as addictive.\" You've said nothing. The only meaningful response to your nonsense criticism is to outlaw all luxury goods.", "label": 0}
{"text": "I wonder how much cost to get all of that.", "label": 0}
{"text": "Ever MMO ever other than WOW classic-Lich", "label": 0}
{"text": "I know. It was just a bit of light-hearted humour, to be honest", "label": 0}
{"text": "Lmao that's so god damn weak", "label": 0}
{"text": "True, ME3 Adept was dope, let you play a true caster with nonstop spells and explosions. No idea why some people dislike it though, maybe nostagia superiority? Or the reduced difficulty took away their bragging right of how hardcore they are?", "label": 0}
{"text": "Sheogorath! Damn yous! Damn yous to hell!", "label": 0}
{"text": "Souls games", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Which is strange. You’d think the musicians would kill to have their music in the game, as it would lead to so much exposure and sales.", "label": 0}
{"text": "None of your listed stuff is relevant. They have others uses, and are not all designed intentionally to continuously take advantage of someones vulnerabilities. Many types of transactions with two unforced parties are not net positive for society at all. 2 unforced parties can make deals that hurt other people, yet you say that is beneficial? Do you think the perpetual immigration issues in the US are a net positive? Is opioid addiction a net positive for those addicts and society? Wars? Ponzi schemes? Dictatorships?\n\n\nWe are letting problems build up like we have for a very long time now. Our system will eventually reach a critical breaking point. Societies that have collapsed in those 10000 years after ignoring problems for short term gains at catastrophic costs. The larger, and more complex those systems are, the worst the potential disaster will be. The growing number of distrust, isolated, mentally unhealthy, addicts, and homeless are not helping society and it's been growing exponentially. The growing strain on the system will eventually be too much and the fallout will be deadly for society.", "label": 0}
{"text": "I want the shirt he's wearing", "label": 0}
{"text": "Oh I didn’t realise they were back in China after MS brought them", "label": 0}
{"text": "I mean you can personally have an opinion, but it’s not your right to tell someone else what transaction they should or should not engage in. All the above examples generally have coerced or forced participants. So has nothing to do with my point.", "label": 0}
{"text": "Oh really? How much of their development resources did they devote to this item? For how long?", "label": 0}
{"text": "Yep I just bought one ! I missed out on the mount last time!! Not going to miss out this time", "label": 0}
{"text": "people used to buy that spectral tiger off ebay for like $1000, this is unsuprising", "label": 0}
{"text": "Oh, thank you :)", "label": 0}
{"text": "If you have an Xbox one or Xbox series console you can put the disc in and play it", "label": 0}
{"text": "Someone hasn't played Batman I take it. It's a full fledged Arkham game in every sense. There is no 'gimmick here'. Not only does it fully capture the spirit of Arkham games, but it plays to the strengths of VR.", "label": 0}
{"text": "Don’t forget about OP’s mother", "label": 0}
{"text": "It’s worse than a $500 mtx? In the realm of bad, they’re both up there, but $500 is absurd.", "label": 0}
{"text": "Capitalism baby, Capitalism.", "label": 0}
{"text": "How could you possibly know that?", "label": 0}
{"text": " Norco and excavation of bobs harrow put me to sleep", "label": 0}
{"text": "It's literally pay2win when winning is making the most money on the market.", "label": 0}
{"text": "Lip smack", "label": 0}
{"text": "Yeah BF3 was a let down to me after BC2, felt like the class changes were bad and the destruction was nerfed. It also bothered me how blue it was lol", "label": 0}
{"text": "A man of patrician taste, I salute you.", "label": 0}
{"text": "Worths pretty subjective.  But as someone who got into modern VR early (started with a rift dev kit 1), id say it's somthing worth trying before you buy.  \n\n The headsets have improved vastly since the DK1. But the gaming space for them is still rather niche.\n\nI find myself using my VR setups less and less over the years and they're kinda just becoming somthing to whip out occasionally when I have people over.\n\nThat being said, it's a fun time for sure!", "label": 0}
{"text": "0:06 Someone should really take a look at that fence, it looks unsafe.", "label": 0}
{"text": "100%", "label": 0}
{"text": "Elden Ring", "label": 0}
{"text": "Still better than Netflix.", "label": 0}
{"text": "I can reassure you that the game has been started from scratch so many times that nothing is left of the trailer (which was all faked anyway)\n\nI work in France in video games and every time someone from the BG&E team is recruited we make the joke “oh well, 1 more year of delay for the BG&E”", "label": 0}
{"text": "Don’t blame the monster we made. Blame us.", "label": 0}
{"text": "Ah yes, the rogue shiny sticker, I think mine had a fifa one 🤣.", "label": 0}
{"text": "Don't bother. redditors are the most educated ignorant people", "label": 0}
{"text": "Damn she knocked that Hideo Kajima cosplay out of the park", "label": 0}
{"text": "Wasn’t goldeneye re-released on both Xbox and on switch? I know for a fact is on Xbox series s because I played it.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Anything by FromSoft. Sekiro was the easiest to follow, and even then, it was still confusing for my pig brain.", "label": 0}
{"text": "“Sticks and stones may break my bones but words will never hurt me” Do they not teach this anymore?", "label": 0}
{"text": "dummies with deep pockets", "label": 0}
{"text": "This game is made for VR, just fyi.\n\nThere's no 3rd person mode.", "label": 0}
{"text": "Destiny.\n\nIf it wasnt for My Name is Byf, I would be clueless.", "label": 0}
{"text": "And includes invis-walls.", "label": 0}
{"text": "Or thick ass glass", "label": 0}
{"text": "Discord available on Xbox now, but every Xbox user has a boomer mentality and doesn’t want to use it / the newer features lol", "label": 0}
{"text": "Ew consoles", "label": 0}
{"text": "Part of it is that people, y'know, buy store mounts and cosmetics in game. Part of that is that the only meaningful and fun thing to do in WoW as long term progression is increasing your mount collection count. \n\nBut part of it is that they made it a genuinely compelling offering. Having an auction house vendor AND a mailbox, anywhere you want? That's a significant and arguably unreasonable bit of utility. It's the kind of thing they wouldn't have done even 5 years ago, as evidenced by a forum post by a Blizzard CM justifying the first auctioneer mount they made. Obviously it goes without saying that they *definitely* wouldn't have done it a decade or 15 years ago. They would've found the proposition abhorrent and design-disrupting. A true P2W advantage. \n\nBut this mount just paid for the next 3 expansions of development cost, in one day. I guarantee it.", "label": 0}
{"text": "It didn’t!?!??", "label": 0}
{"text": "Probably my favorite CoD next to Black Ops 2. Going from the new entries to this bad boy is *jarring*. Everything is so much faster paced nowadays.", "label": 0}
{"text": "Lol as if BL1 and BL2 weren't full of schlocky writing that was outdated by the time the games released.", "label": 0}
{"text": "The Creative Assembly has done this in the Warhammer games and not just for people who were dying or passed away.  One fan was quite ill and fortunately recovered.  They made him a pretty badass lord for his favorite race.  They immortalized one of their employees who passed away suddenly as a legendary hero.  They even added a legendary hero the references a much loved by the fandom community manager after she left the company.  It's awesome when games do this kind of stuff.  Bungie has been pretty cool about all this stuff too.", "label": 0}
{"text": "God I hate middle schoolers", "label": 0}
{"text": "Personally, I blame horse armor for all this BS.", "label": 0}
{"text": "Dude, I gave you 3 examples and only one has arguably a forced or coerced participation.  \n\nMost people drink or use illegal drugs because they wanted to not because they were forced to start.  Also drugs example is not just illegal, but also prescriptive drugs such as antibiotics, steroids, blood pressure medication ect.\n\nHow about another example, gambling.  Or another disclosure rules?  \n\nAnother example of not seeing the big picture and just how much rules and regulations are in place already for the betterment of society as a whole.", "label": 0}
{"text": "I had to watch videos and read up on the Zelda timeline, just to find that even Nintendo isn’t too sure about it", "label": 0}
{"text": "Cod Zombies became way too sci-fi for me personally. I remember playing WaW with the horror like atmosphere and finding those audio logs on Der-Riese of German scientists trying to find ways to weaponize the zombies and use technology like teleporters only for things to fall apart and outbreaks to spread. It gave the perfect amount of lore to keep you engaged, but left enough unanswered to theorize. I lost interest when they went to alternate universes route with these weird complex Easter eggs.", "label": 0}
{"text": "Xenoblade chronicles 2. There's no obvious bad guy for much of the game, and the bad guys have pretty reasonable reasons for their viewpoints. I was continually like \"oh so he's the bad guy\" o ly to find out that it's not so black and white.", "label": 0}
{"text": "And this is why I stopped playing.", "label": 0}
{"text": "the only company I believe when they say \"we play games too\" is Valve, I mean, look at Gabe, he plays DotA 2 vs bot using only one hero like a nerd", "label": 0}
{"text": "I saw a ret paladin doing insane dps. Instantly killing bosses. Not sure what he was doing.", "label": 0}
{"text": "Unpopular opinion: Unless you were anything but a straight white male. Things quickly got predictable.", "label": 0}
{"text": "I assume you haven’t seen the Blizzard Activision COD Mobile boxes? (Yes, technically a different company that created the mobile)\n\n$200+ just to ensure you receive a skin with their loot boxes.\n\nAt least this you get exactly what you pay for.", "label": 0}
{"text": "Dont let these people gaslight you. You're absolutely right.", "label": 0}
{"text": "Saw a video about this from **AzAMOuS** on yt. Thought it was a joke....", "label": 0}
{"text": "But... he is a vampire. Bisexual or not.", "label": 0}
{"text": "Yeah, I never noticed anything flaky in the odds other than the aiming model sucks.  There should not be a \"hit probability\" in the first place, but an expected dispersion around the intended point of aim--but it clearly does not work that way.  A hit is a hit, your shot runs completely true.  A \"miss\" has a far greater dispersion than it should.  (Quotes because at sufficiently short ranges a \"miss\" may actually hit.)\n\nThey have \"full\" vision but are limited to targeting those that should properly be revealed.", "label": 0}
{"text": "Yeah, what's the point in a VR game if the VR part is no more immersive or creative than a regular game?", "label": 0}
{"text": "Here is literally the first Google result of missing features in Battlefield 2042:\n\nPersistent lobbies: Players must matchmake after each game \n \nGlobal leader boards: No global leader boards are available \n \nServer browser: There is no standard server browser \n \nGame modes: There are fewer standard game modes, such as team deathmatch \n \nVehicle types: There are fewer vehicle types, and no small transport vehicles like ATVs or bikes \n \nGun choices: There are fewer gun choices \n \nMobility mechanics: Some mobility mechanics are missing, such as manual leaning, high wall vaulting, backwards prone, and no diving while swimming \n \nUI optimization options: There are fewer UI optimization options \n \nUltrawide monitor support: There is less ultrawide monitor support \n \nAim assist: There are issues with aim assist on console \n \nMedic communication: It's less obvious how to communicate that a medic is on the way to revive a downed teammate \n \nSRAW zoom: The zoom of the SRAW has been reduced \n \nSRAW field of view: The field of view on the SRAW has been increased \n \nSRAW audio cue: The audio cue from the missile has been significantly lowered \n \nSRAW in-world UI elements: In-world UI elements of the missile have been removed except for the user \n \nSRAW and Lis' G-84 TGM missile timer: A timer has been added for SRAW and Lis' G-84 TGM missile in events of redeploying \n\nIt's not subjective when it's quantified. That's not to mention all the issues it had on launch, like a lack of a scoreboard and the amount of destruction.", "label": 0}
{"text": "Lmfao you can’t constantly buy this shit and then seriously wonder why they do what they do. And guess what! \nPeople are definitely going to buy that $90 mount. Then next you’ll se a $150 mount!!!! How exclusive!!!!!!!", "label": 0}
{"text": "Yup try being a girl gamer in the mid-2000’s. It was so miserable I never came off mute.", "label": 0}
{"text": "I bought it , who are you to judge me for having fun in my life?\nSure call it ignorant or whatever crying term you wanna name it.\n\nI have fun\nI enjoy playing wow\nIt helped me already by standing in front of a m+ run and tank goes i need to get something from ah.  Popped the mount.  No 10 min delay of resummon shenanigans.\n\nIn the end its just a past time...\n in a thousand years no one will remember this.\n\nJust enjoy our time 🖖", "label": 0}
{"text": "Spend money where you spend your time. WoW is not my bag, but I get that for a lot of people it's more than a game. My friends tell me how much they spend on a golf club and I'm like \"are you high?\". But, it's what they're passionate about. WoW isn't going anywhere. Hell probably ever. Everquest is still around for God's sake. If that $90 gets you something special that adds to your experience, you do you. Fuck what anyone else thinks.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "That's so awesome.", "label": 0}
{"text": "Commission, streaming, art sales… live appearances, signings, endorsements….", "label": 0}
{"text": "Yeah that's it. We really tried to stood back to this kind of shit back then but whales defended it with fanaticism.\n\nNow here we are...", "label": 0}
{"text": "There's a story to that?  I thought it was just kinda an a game mode with the suggestion of lore", "label": 0}
{"text": "Minesweeper. Still looking forward to the movie adaptation.", "label": 0}
{"text": "Only if you use frame gen.", "label": 0}
{"text": "The ONLY game where this hasn’t burned me out is Planetside 2. They at least reward me for doing them and it gets me to play in different styles… but in most games it’s just a garbage FOMO mechanic.", "label": 0}
{"text": "This logic is so stupid. Gambling is “trivial,” yet clearly has scientifically proven downsides for society at large.\n\nThats okay with you, I guess?", "label": 0}
{"text": "Her volatile cosplay from dying light is really awesome, she really has talent beyond tits", "label": 0}
{"text": "Some of the best boss fights in the series.  That Deathstroke bossfight was fantastic.", "label": 0}
{"text": "Just do this with new age graphics, is this really that hard EA??", "label": 0}
{"text": "I've played them all and was thinking the same thing.\n\nI think he's from the PSP Games.", "label": 0}
{"text": "I am actually stuck again in all the numerous games I have, plus the backlog. I did 20+ hrs on transport fever 2 (slight recommendation for all, big one for fans of the genre) this week. I have an ongoing rimworld run, but my heart wants a replay of rdr2…. First world problem I guess…😅", "label": 0}
{"text": "It's been a while, but isn't that what happened? Booker was drowned at the moment where he made the choice. And many, many Elizabeths did it to many, many different Bookers.", "label": 0}
{"text": "The difficulty ramped up exponentially for me at the part of the game where all of a sudden there were tough enemies all over the map. Sort of dropped it after several frustrating attempts.", "label": 0}
{"text": "Who cares? If you don't want it don't buy it. I don't want it. Not gonna buy it. With the warband added in this xpac you can share money and items freely between all characters; I have a toon parked in Orgrimmar at the auction house which is right near the bank. If I need to buy anything, just log onto that character. \n\nIf somebody wants to pay $90 to get an oversized mount that doesn't even look very good, go wild man. I hardly even use the AH as is.", "label": 0}
{"text": "LOL WHO CARES", "label": 0}
{"text": "It is funny you think this is a new thing, and doesn’t go back farther than purple ink in Phoenicia.", "label": 0}
{"text": "I love games like uncharted. 15 hours of fun with a bit of story. It takes me more than a month to complete. Great to put it down when completed.", "label": 0}
{"text": "Absolutely. And I can highly recommend it, seeing as some games have just awful default sound stages, so a little bit of tweaking here and there can make them much better.", "label": 0}
{"text": "This kind of greedy thinking is slowly crushing all industries. Just bc something is profitable doesn't make it good for the ecosystem or industry in the long run. \n\nOfc everyone has become so accustomed to this style of thinking where  \"profit\" > anything else that they just accept this is fine.", "label": 0}
{"text": "I don’t see the issue with this personally. If rich people are willing to spend silly money on cosmetics, that’s subsidising the games development for poorer fans", "label": 0}
{"text": "Lol what?", "label": 0}
{"text": "Same here, I remember coming up with some crazy solutions for some of those shrines.  Then I looked online and saw the really crazy videos and the shit people came up with.  It's amazing when developers just let people go wild in the sandbox.", "label": 0}
{"text": "I haven't had enough time or energy to get through or be bored of all the games that came out before like 2005...\n\nSort of kidding but seriously, right now the primary games in my rotation are FF9, Prince of Persia, OSRS and Stardew. Only one of those from after 2005 lol\n\nI go through my phases, so it's not like I'm always playing retro, but I do get overwhelmed with just how much gaming there is. I literally don't have the energy to be too excited about new games and especially 100+ hour games.\n\nMetroid Dread, was perfect for me. So much fun, best controls for Samus this far, filled that nostalgia thirst while also being short enough that I could actually finish it!", "label": 0}
{"text": "furries were buying 40+ dollar skins for a game in the 90s, this can and will get far worse.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "It could be a radical communication through gameplay only approach and he has high but unmet expactations.\n\n  \nOr he's an idiot", "label": 0}
{"text": "Holy fuck thank you", "label": 0}
{"text": "Hey I’m not the one throwing shade at people pirating, it’s a natural thing of life and people have to accept that. when things exists, certain people will circumvent this and obtain what they want in any means. My conversation never implied I’m entitled to everyone thinking like me, but I for sure believe I’m not the only person in the world that does this when pirating or don’t give a fuck. Kudos to you if you spend your money on games you enjoy, that’s probably the most honest way to do business. If people don’t make what you want, you either not interact or just get the whole thing for free. No one is judging you for your choices. ", "label": 0}
{"text": "Boneworks and Bonelab are both great simulations but they are so damn short that by the time you have your tools the game is basically over.", "label": 0}
{"text": "Soooo... You are paying 90 bucks for something that should come included in the game?", "label": 0}
{"text": "Awww that sucks, woulda been a cool solution", "label": 0}
{"text": "Dude…some core memories. I watch the game on YouTube often", "label": 0}
{"text": "It wouldn’t matter anyways. It’s a collectible that requires both hands to pull.", "label": 0}
{"text": "That doesnt take away from what i said though.", "label": 0}
{"text": "Rookie mistake, OP. If there’s 2 things this sub hates, it’s (i) Nintendo and (ii) humor", "label": 0}
{"text": "Its funny Ubisoft keeps reassuring us this game comes out while their company is in a downward spiral.", "label": 0}
{"text": "More like the devs are being lazy", "label": 0}
{"text": "> Nexon\n\nAnd yet they won \"indie\" game of the year", "label": 0}
{"text": "Yup, that's part of the reason why I refuse to touch that series with a ten-foot pole. I won't say the other because chances are, I'd get a rasher of shit for it.", "label": 0}
{"text": "This is why I stopped playing World of Warcraft. They've shifted their focus to catering to a large and eager audience willing to spend heavily on microtransactions, in addition to paying for the game's subscription and expansions.\n\nI don't mind microtransactions in free-to-play games like Fortnite, but WoW isn’t free-to-play—it’s far from it.", "label": 0}
{"text": "Idiots keep paying!", "label": 0}
{"text": "Sure, but you are told that it will be worth your while if you save them.  And she proves it, like, almost immediately.\n\nEven going from a blind perspective, I'd argue it's pretty normal behavior to explore ones options and see what the two offers actually are.  You know what harvesting gets you, and you know you are promised extra rewards if you choose save instead.  Choosing to at least see what her first reward is before making the decision going forward is pretty normal behavior, and you don't need a spreadsheet of the long run versus short term rewards.  The *very first* gift is 200 ADAM and an extreamly powerful plasmid you cannot get otherwise.  You know from the *first zone* that the actual difference is less than 10%, not half, and honestly with the very first plasmid being able to control a big daddy, I know I wasn't exactly questioning if the extra loot would be worth that <10%.\n\nI don't mind the prospect of being paid back, though I do think you effectively just getting that ADAM back does feel kinda lazy.  But even if they are going to give it back, it probably shouldn't be so soon.  Or at least maybe give you less at the start and ramp it up over time.  \n\nAs it stands, there is no dilemma, you are given two offers, and you just pick the best offer.", "label": 0}
{"text": "Bro. It doesn't matter. To you these are issues, to me I played the game with friends and had the best time. Yes, I waited until they had patched a lot of things, but your post is only relevant that the above was enough to degrade my experience. Learn to accept that other people have different opinions instead of trying to make me agree. I don't, I'm not going to. I made up my mind when I played them all. Accept it or don't, but you need to learn to accept not everyone agrees with *your* opinion.", "label": 0}
{"text": "That completely killed Valhalla for me.", "label": 0}
{"text": "For my old games that have the 3 character limit I use XZP, for 4 character XNZP.", "label": 0}
{"text": "\"Micro\" Transactions", "label": 0}
{"text": "That's one way for the devs to say fuck you... little trash game dev, still need to play this lol", "label": 0}
{"text": "One could reason the angels, Holy Spirit, and saints above could be considered aliens in that they aren’t of Earth.", "label": 0}
{"text": "COD4 was pretty good, but WaW was a lot better being set in WW2.", "label": 0}
{"text": "\\*screams\\*\n\n\\*panic rolling intensifies\\*", "label": 0}
{"text": "It's the same shit as it was in 2015", "label": 0}
{"text": "Literally all those have coerced or forced participants lol. Right, prescription drugs… aren’t forced. You realize as a fractional example this represent .000000000000001% of all daily transactions? It’s not your job to tell an alcoholic to stop. It’s not your job to tell someone to stop gambling. Are you going to ban Taco Bell, sodas, dissolve the FDA because they allow poison in so much American food and drinks?  The answer is obviously no, which is why the ultimate ethic is to allow two parties to engage in the transaction. For better or worse of the health of the individual.", "label": 0}
{"text": " I love the intensity of Ghost Mode!", "label": 0}
{"text": "Its amazing how you can hear another persons perspective and it opens up another angle you've never previously considered. It's called thinking buddy", "label": 0}
{"text": "It's not really about who can afford it.If people keep buying items like these blizzard thinks it's fine and will just keep pumping the prices and once others companies notice that blizzard can get away with it ,they will do the same .", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "God damn I need to go back and play this again.", "label": 0}
{"text": "We got these expensive items in dota long time ago. Like the pudge dragonclaw hook or lots of other stuff. Way more expensive than this mount", "label": 0}
{"text": "Ahh, well done! This… looks… amazing.", "label": 0}
{"text": "I mean I don't play wow but I checked out the sub right after this announcement was made and most of them seemed pretty pumped... So that's probably how?", "label": 0}
{"text": "Tbh I've always liked short and sweet packages (that's what she said). I only ever play one massive open world rpg because even though I like them in moderate doses, especially for mindless grinding and exploring, I like smaller games which are much more focused on a single aspect like a complete and thoughtful story, or puzzles, or just game mechanics vis a vis rouge likes. \n\nAlso 80% of those 100 hour games are mostly bloat so not worth doing anyway.", "label": 0}
{"text": "Smash was way cheaper", "label": 0}
{"text": "Now if you post something like \"these are my favourite games from 2010\" you're guaranteed a million karma.", "label": 0}
{"text": "No, actually they now teach that if you're hurt by someone with words, you should hit them with sticks and stones.", "label": 0}
{"text": "Battlefield 3 and MW2 to this day were the best marketed games EVER. And on top of that, we’re the best shooter experiences and if you grew up with them you agree.", "label": 0}
{"text": "Ok, much better than Battlefield 2042.", "label": 0}
{"text": "It has certainly got people talking. Blizz must be loving the publicity. I've seen this everywhere!", "label": 0}
{"text": "Really? Neat. It looks like it happened in 2023, so relatively recently. I guess there was high enough demand that they sorted out the IP licensing issues. It looks like the NES TMNT was also re-released in 2022 as part of the \"Teenage Mutant Ninja Turtles: The Cowabunga Collection\". Of course, you'd have to really like the TMNT to buy 13 old games for $39.     \n    \nUnfortunately, I doubt we'll see that en masse for all the old TV and movie based titles. Of course, not all of them were winners. \"Fester's Quest\" and \"Nightmare on Elm Street\" for Switch/Xbox? Anyone? Bueller?", "label": 0}
{"text": "Right but the other games in the Arkham series are 3rd person.   I didn’t work on it, but I doubt they started completely from scratch and probably used/hacked as many existing game mechanics from the previous titles as they could for this title.", "label": 0}
{"text": "There's more story content to it than a lot of books I've read in school.", "label": 0}
{"text": "I remember when Max Payne came out and the reviews said it was too short and you could finish it in a weekend. I thought that was great and ran out and bought it.", "label": 0}
{"text": "Damnnn how long have you been collecting?", "label": 0}
{"text": "I never said that reviewers should be entirely objective. But making a list like this and leaving out the biggest and  most critically acclaimed games, especially when there’s *50* spaces just seems disingenuous\n\nYou’d lose all credibility as a reviewer if you made a list of the “best albums of the 60’s” and didn’t include Abbey Road in the top *50*, even if you didn’t like it", "label": 0}
{"text": "I mean weren’t we all 13 year olds online talking shit at one point? That’s the fun of competitive gaming online. It’s not that serious lol, I was talking shit in elementary school on socom 2. Sad how moderation has killed all the fun out of multiplayer games.", "label": 0}
{"text": "I mean you could say that a glass window is an invisible wall", "label": 0}
{"text": "That's not being clever that's them not allowing for creativity.", "label": 0}
{"text": "There is no invisible wall. The batarang does hit the radio, but it can only be destroyed by ripping it out and throwing it.", "label": 0}
{"text": "Flawless (didn't get hit) Battletoad run, took about 33 minutes.\n\nSame guy can do the hover bike level blindfolded.\n\nhttps://www.youtube.com/watch?v=-gDu601uXfs", "label": 0}
{"text": "That game had portals before it was cool", "label": 0}
{"text": "Like the band? But the t-shirt. But this is gaming in 2024, so useful idiots.", "label": 0}
{"text": "At a time when inflation is decimating our bank accounts, people fork over 90 fucking dollars for a dumb looking mount in a video game. This is why aliens won’t talk to us.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Zavala when his best friend of hundreds of years dies: the guardians aren't an army, we can't mobilize the vanguard for something as petty as revenge\n\nZavala the second he might get some red legion-ussy: SEND EVERYONE", "label": 0}
{"text": "Top class picks", "label": 0}
{"text": "The first game also fucking bombed when it came to sales.  It makes no sense that they're making a sequel 20+ years later that has likely ballooned in costs to several hundred million.", "label": 0}
{"text": "And we thought horse armour was outrageous", "label": 0}
{"text": "People's lives suck, so rather than placate their egos in real life by succeeding and doing hard things, they buy $90 mounts in wow and do it there.", "label": 0}
{"text": "Quite literally what it's there for, so yes. I don't want to hear someone, I mute them and the problem is solved. Crazy!", "label": 0}
{"text": "Baulders Gate 3", "label": 0}
{"text": "Bioshock infinite. Played all three games and DLC. Can’t really figure out what’s going on specifically, but I just dig the vibes and accept that maybe some things are unknowable 🙃", "label": 0}
{"text": "The main story is pretty straight forward. And the notes are like random events", "label": 0}
{"text": "Elder Scrolls Online and Fallout 76 aren't far behind. \n\nBoth are pretty much unplayable in their free version state due to such strict storage limitations.", "label": 0}
{"text": "Saying something as frivolous and discretionary as an item in a video game is exploiting people is absolutely wild.", "label": 0}
{"text": "Victor the amplifier aka Vamp. Jk!", "label": 0}
{"text": "I can no longer sing my favourite rap songs in cod lobbies", "label": 0}
{"text": "Looks more like it collides based on camera, and visual effects are from the the hand.", "label": 0}
{"text": "Are they doing it to the point that it interfere with their ability to accomplish stuff such as personal hygiene, eating properly, sleep, housecleaning, social relationships, parental responsibility, personal finances, work, education, etc?\n\nAnswer is, it depends.", "label": 0}
{"text": "I hope you get the help you need someday", "label": 0}
{"text": "Out of curiosity why would the mount selling a bunch change the price of tokens?", "label": 0}
{"text": "This should of Worked, it pisses me off that it doesn't.", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "its an in video game add on. of all the things to cry capitalism about this is not it. you just dont buy it.", "label": 0}
{"text": "This isn't exploiting or unethical at all jfc what are you on about?", "label": 0}
{"text": "The headline is stupid. Its been happening for years.", "label": 0}
{"text": "Every AAA game has flaws. Would I have preferred this to be possible? Sure, but it does nothing to change how great the game is.", "label": 0}
{"text": "That thing has been in dev hell for so long, history suggests that it probably will not live up to the expectations. But we'll see... IF it eventually sees the light of day", "label": 0}
{"text": "Songs help create an atmosphere, and that atmosphere can be critical to a game's identity. For example, Crazy Taxi is probably in my top 10 games of all time, but I wouldn't have even bought it on Steam if someone hadn't made an easily added fix to replace the music with The Offspring it originally had.", "label": 0}
{"text": "Played one game and, had a 50 year old man yelling every curse word imaginable about camping, to no one.", "label": 0}
{"text": "The dirty walls  details are from different packs if you asked about that. And if you asked about graphics, I use G-Shade for better graphics.", "label": 0}
{"text": "It completely refutes your premise. You are saying groceries for people to eat compared to a pay to win game that gives no tangible benefit and intentionally targets vulnerable people are ethically the same thing.\n\n\n Your premise is \"2 people having an unforced transaction is going to be the best thing for society and is therefore always ethical.\" I think that's ridiculous and I gave examples of how that's ridiculous. Your response is just lazy at best, not addressing anything I said that refuted you. At worst, you are paid to take that side or want to convince people it's ethical because you do it yourself. The in between is trolling.\n\n\nIf you want to be an unethical person, just embrace it. You don't need to convince everyone you dont care about people. Free yourself from societies judgement.", "label": 0}
{"text": "Starting a new Skyrim character. Don't get me wrong love the game, but going through the same 2-3 quests to start the game felt brutal. Had to start using the Alternate Start mod every time", "label": 0}
{"text": "For me Kingdom Hearts and Metal Gear are the kings of this. I still just randomly yell La Li Lu Le Lo! at my brother", "label": 0}
{"text": "Brink. Honestly, i think that game could be redone really well today", "label": 0}
{"text": "I would like to report that someone gave me a compliment in the game\n\nI am offended", "label": 0}
{"text": "I honestly hate this kinda crap. I'm usually not as picky as some folk about \"immersion breaking\" stuff, but invisible barriers like that just piss me off. Or when I fire an arrow in tomb raider and it gets stopped by the leaf of a tree...", "label": 0}
{"text": "I feel like most people who has issue with this are the one that doesn't play the game...", "label": 0}
{"text": "No, is not. I spent some good hours to make this scene. I was really proud of it that’s why I shared.", "label": 0}
{"text": "Git gud at emotional intelligence I guess.", "label": 0}
{"text": "All of the endings are canon, they lead to different timelines. \n\nDrakengard 2 is just in its own timeline completely on void of connection to the rest of the series.", "label": 0}
{"text": "The best way to deal with KH games is to know that everything is until it isn't.\n\nKH: People who lose their hearts become heartless.\nMe: ok\nKH: wait no, they become nobodies and their hearts become heartless. Nobodies also have no real emotions cause they have no heart.\nMe: ok?\nKH: except they actually do\nMe: right\nKH: except they don't, they just scalp a be heart\nMe: sure...\nKH: ........................................ there's time travel now.", "label": 0}
{"text": "This is an AI bot reply, not a horny gamer. ", "label": 0}
{"text": "The thing is you can earn it in game...", "label": 0}
{"text": "Last ep the crew got to the gold roger island and walked around", "label": 0}
{"text": "Prey is the ONE", "label": 0}
{"text": "I’ve played FFVII (PS1) over a couple dozen times and I only comprehend 80% of the plot.", "label": 0}
{"text": "Excuse you?", "label": 0}
{"text": "Fucking warframe.", "label": 0}
{"text": "Lmao facts. The fact there are games from the late 90's to early 2000's that hold up better than half the games from the last 5 years or so is wild.", "label": 0}
{"text": "You enjoyed doing the same mini quests, help a person, follow a person, climb a tower, go to a new area of town help a person, follow a person, climb a tower go to a new area help a person with a slightly harder problem, follow a person who turns, climb a slightly higher tower, go to a new area help a person, follow a person and climb a tower where some paths are blocked then go to the next area help a person, follow a person and climb a tower that is really annoying to climb then watch a cutscene.. go to a whole new city where you...... help a person, follow a person and climb an even more annoying tower so that you can go to a new area in town and help a person, follow a person and then climb a tower.", "label": 0}
{"text": "It's only sold for a limited time", "label": 0}
{"text": "Pretty sure as an OP you can't add text on gif/video posts.", "label": 0}
{"text": "Maybe I'm just biased because I'm currently playing it.  but leaving Metaphor off this list is a shame.  I cannot get enough of the game.  It's been ages since I have to force myself to turn off a game to go to bed, or spending time at work looking up builds and stuff.  plus the story is just so good as well.", "label": 0}
{"text": "Wordle deserved. I started before NYT bought it and when they did I was introduced to their other games now I'm straight addicted. Can't go a day without doing the crossword, mini, wordle, categories and strands.", "label": 0}
{"text": "Lol EA owned battlefield then and do now, the existence of executives isn't what changed this", "label": 0}
{"text": "Again, you can do that if you like, but no one’s going to take your opinion seriously. Like I said, it comes of as contrarian, or maybe just ignorant/uninformed \n\n>who cares?\n\nThe people who read it? The people who are supposed to react to it?", "label": 0}
{"text": "Prey was good but I got sick of having to scan every room for an enemy that might be disguised as a chair or something.", "label": 0}
{"text": "All the little details make it a Top 10 game all time for me! Definitely agree. I feel like expectations of it were so high and it still exceeded most people's. I have to say though when I bought RDR1 as a kid, i had no clue about it, and so that really raised the bar for me personally. That and GTA IV (best GTA ever!)", "label": 0}
{"text": "Black Myth Wukong", "label": 0}
{"text": "I remember there being a level where you played as former US presidents/staff/war criminals, which I found pretty funny, and George Romero as a zombie chasing people like Mr X.  I never realized there was any lore to explain that shit though, I thought it was just random goofy fun.", "label": 0}
{"text": "The first matrix I designed was quite naturally perfect, it was a work of art, flawless, sublime. A triumph equaled only by its monumental failure. The inevitability of its doom is as apparent to me now as a consequence of the imperfection inherent in every human being, thus I redesigned it based on your history to more accurately reflect the varying grotesqueries of your nature.  JK lol", "label": 0}
{"text": "This is one flaw. The rest of the game is very creative. As well as significantly more immersive past Arkham games.", "label": 0}
{"text": "It’s not for you to tell someone what is a benefit for them. You being a moral busybody doesn’t refute consenting parties engaging in a transaction without threat, coercion, or anything outside of what their own conscience deems acceptable. I’m sorry you are upset that your evil view isn’t accepted by everyone.", "label": 0}
{"text": "This is correct. All the Elizabeths drown all the Bookers, and close the loop. That is why all the Elizabeths disappear at the end. When they kill their Booker, they are essentially writing themselves out of existence at the same time. The only one that survives is main plot Elizabeth who essentially becomes a gestalt of all of them and is no longer tied to any specific timeline (much the like the Lutece twins)", "label": 0}
{"text": "subnauatica probably the one exception to this", "label": 0}
{"text": "For some people mtx that provides objective value is even worse. Since it makes the game unfair/P2W.", "label": 0}
{"text": "Don't f up W4 CDPR! ", "label": 0}
{"text": "No, the people that buy it get the convenience and the company gets paid. Buy it if you want it, don't if you don't.", "label": 0}
{"text": "Kane&Lynch 2:  Dog Days.  Not the same as what you're looking for but it's one of the most unique looking games out there.  It's like playing a snuff film from the viewpoint of the cameraman.", "label": 0}
{"text": "This should have just been called \"50 really good and interesting games you might not have played but should consider if you like games that are a bit out of the ordinary of the 2020s so far\" but I guess that's too long a title?\n\nStill a great list, I think some fantastic choices there, but nobody is here to argue that this is an objectively definitive list of the 50 BEST games that have come out in the last 4 years. Maybe 10-15 of the listed titles fall into that category. And that's ok.", "label": 0}
{"text": "I'm latino and I got the usual \"taco taco chimichanga illegal narco\" among other nastier shit aaalll the time. It was hilarious.", "label": 0}
{"text": "I can hear it right now. It's taunting me from across space and time.", "label": 0}
{"text": "Sudden Architect quote lol", "label": 0}
{"text": "Hitman series", "label": 0}
{"text": "What does it do? I remember a similar multi-seat mount when I was playing, it had very nice features for raiding (the Epic Wooly Mammoth). Can it do something more than the mammoth?", "label": 0}
{"text": "GTA V online with my younger brother.  We were adults who had moved out and didn't hang out much anymore, then we both got really sucked into it at the same time. No lifed it for several months.\n\nWe found a dad and daughter pair that we frequently played with, and one other guy we met in game, and the 5 of us were a \"crew\" for a while. We all had our niche, completed all the original heists. \n\nFrom coordinated progression, to fucking around in lobbies and arcade modes, it was an absolute blast.", "label": 0}
{"text": "We don't talk about that.", "label": 0}
{"text": "GTA IV - the best of the series imo", "label": 0}
{"text": "I mean if everyone thinks like you regulation on gambling/smoking wouldn’t exist at all.", "label": 0}
{"text": "such a victim mentality you people have. you wanna be oppressed so bad", "label": 0}
{"text": "I don't understand?\n\n\nIt just hits an invisible wall?\n\n\nThat's the opposite of the devs knowing better, it's a lame solution for a problem they didn't actually address", "label": 0}
{"text": "That's basically all this article said. I was surprised by how short it was.", "label": 0}
{"text": "Pokémon blue", "label": 0}
{"text": "He is the best player. He has won the world championships 5 times (and could win a 6th time this year). His won on his first year playing in 2013. He won last year in 2023. League is a very intense game mechanically (and he plays the most mechanically intende role), someone competing and winning at the highest level for basically the entire history of the game is unheard of. Anyone who plays league (even if they dont care for competitive) knows him as the best player in the game. Again, even someone who has 0 interest in competitive has likely seen one of the 6 skins dedicated to him in the game.\n\nThe matches his team plays are the most watched matches in league, and league is the most watched esports ever. In korea, he is invited to multiple variety shows, he is part of ad campaigns for nike, red bull, razer etc. He was given an exemption from mandatory military service by the south korea government. His first twitch livestream became the stream with the most concurrent viewers ever (its been surpassed now).", "label": 0}
{"text": "Flawedpeacock on YouTube did an amazing 6 hour explanation of it", "label": 0}
{"text": "Fair play!", "label": 0}
{"text": "Anything in the metal gear franchise", "label": 0}
{"text": "How did this happen? Are you for real?\n\nPeople have been shouting that this is where it was going to lead since the introduction of the Wow Token back in WotLK. What were we told? We were being alarmist. \n\nThe decline hasn't even been gradual, man. You've been able to buy max level character boosts for YEARS.\n\nFuck Blizzard and fuck their shareholders for trampling over a game that so many people held dear.", "label": 0}
{"text": "Why do you think I am paid? I said in a lot of comments the fact that I am in EA Creators Network and I receive their DLC for free, but for these scenes, houses, and everything I do, I spend a lot of time and passion because I am not capable to do these in Blender and it’s easier in this game. Being paid would force me to talk only goods things about this game. I never promote a DLC from them, just tell the name of a specific pack when someone ask me where is an object from.", "label": 0}
{"text": "This is the intended solution for one of the loot rooms actually and I wish I realized you can do this in my first play through. I really didn't want to embrace any Typhon abilities but I caved and got the mimic just to get into this damn room as a mug.", "label": 0}
{"text": "Fair enough. I will say the one thing that confused me was the chronology of every event *before* the game starts. But, by the end u can piece it together. >!Like Bridget being your mom, and BB’s memories actually being your own!<", "label": 0}
{"text": "The only question we shouldn't be asking is \"Why?\" It should be \"*Will the helmet stay on?*\"", "label": 0}
{"text": "It's light.", "label": 0}
{"text": "Gamers happened, that's what. The slow transition into wanting to pay for extra stuff is how we got here and will continue to happen. Everyone(I say everyone but its a small minority) complains about microtranactions and how games would release will all their content. And yet you have the majority throwing out cash as fast as they get it for extra stuff. So yeah, gamers got us here.", "label": 0}
{"text": "Bloodborne", "label": 0}
{"text": "The jump from 2 to 3 graphics wise was mind blowing", "label": 0}
{"text": "You only need to drop $300 on a headset. Is it worth getting into? If you're able to deal with the early adopter issues that you will run into with the hardware and software being immature then yes, worth it.", "label": 0}
{"text": "Fair enough. I don't really get all the apocalyptic articles about it though, if it's just for gold farmers. People acting like this is the death knell of WoW when it's a just an expensive dinosaur for a fraction of the playerbase.", "label": 0}
{"text": "Warframe. Never in my 21 years of living has a game made me watch over 20 hours worth of lore/plot videos and still left me clueless", "label": 0}
{"text": "Is this the power of VR? Glorious 10 frames per second?", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "I am incapable of giving up in most games. You can be without a scratch while I have 1HP left and I'll keep trying to thread the needle.", "label": 0}
{"text": "Good luck. I was able to beat it as a child but nowadays my reaction is nowhere close to what it used to be.", "label": 0}
{"text": "Final Fantasy Tactics.   \n  \nI wouldn't say you need to watch Youtube videos, but if you don't keep up with the in-game news, you'll soon have no clue about why you're going to this or that place.\n\nAlso, try to keep track of who's manipulating whom.", "label": 0}
{"text": "Ha! That's how it goes sometimes. I tried to do the same thing, but I'm glad it only results in an extra line of dialogue at the end and not a secret ending or anything.", "label": 0}
{"text": "I would never buy a 90$ skin\n\nBut todays 90$ is worth a lot less than 90$ ~15 years ago", "label": 0}
{"text": "The first one wasn’t even that great to begin with", "label": 0}
{"text": "I've had to look up Youtube videos on Kingdom Hearts lol.", "label": 0}
{"text": "Cramming all their IP into one product to renew trademark/copyright obligations all in one go", "label": 0}
{"text": "So your brother is the reason Kojima added the crawl section at the end of Metal Gear Solid 4", "label": 0}
{"text": "And that doesnt matter. You may not know him. Doesnt mean he isnt the most famous and the most prominent esports player and the best player of the most watched esports out there. I dont know any of the two guys you mentioned so now they are nobodies...", "label": 0}
{"text": "Fuck I love that game.", "label": 0}
{"text": "❤️", "label": 0}
{"text": "Lol that’s how I used to get the Alex’s office.", "label": 0}
{"text": "It's not quantifiable at all because it's based on your expectations and what you enjoy. Your expectations are not the standard. That's really as far as this conversation needs to go.", "label": 0}
{"text": "Even if you weren't a girl gamer, it was miserable. \n\nPeople would straight up try to convince children to give their personal addresses cause thats funny right? It totally didn't make them pedophiles.", "label": 0}
{"text": "That doesn't sound like the worst outcome to be honest, people get to keep their jobs if true.", "label": 0}
{"text": "Lol okay", "label": 0}
{"text": "that's some bullshit lol", "label": 0}
{"text": "I think youre lost.\n\nThe guy i replied to said hes the best/most famous esport player in his game and nobody in another game competes.\n\nYoure completely misunderstanding what im arguing about", "label": 0}
{"text": "WoW is already one of the shittiest games ever made, and frankly ruined the entire MMO genre for decades. Hard to imagine it could get worse and yet here we are.", "label": 0}
{"text": "Been noticing a lot of games this month are quickly hitting a million sales. Like today for example, Sonic x Shadow launched and they tweeted out that over a million copies have been sold. After all the negative news with closures, layoffs, and cancelled projects, it's nice seeing to see something like this for the industry", "label": 0}
{"text": "I don't know if I should be mad at Ubisoft for taking so long or you for making me feel old as dirt.", "label": 0}
{"text": "$120 Australian FFS", "label": 0}
{"text": "Oh yeah I should picked up on that with all the eu PS2 cases my bad", "label": 0}
{"text": "> simply figuring out the developers intention\n\nIf you play it with developer commentary, they actually explain just what a tremendous amount of thought went into guiding player without being too obvious, but also not to be too frustrating - animations, lighting, colors, shapes, even most mundane things are often there to guide your line of sight.", "label": 0}
{"text": "Guild Wars 2 is a very deep and confusing story line.", "label": 0}
{"text": "I’d rather spend $90 for the mount than $90 for “chance” to get the mount", "label": 0}
{"text": "Let me re-iterate what I stated:\n\nThe time to get a game optimized for the variety of PC games is much longer than the time needed to polish for just the XBOX or just the Playstation.\n\nIt is not true that if you're making an XBOX game, you can just make it work on the PC easily without bugs/optimizations/etc. The XBOX has two specific sets of hardware and software to optimize for, and those are pretty similar. The PC has *tons* of variations of hardware and software, and optimizing your game to work well on those is a lot harder than doing so on just the XBOX.\n\nDepending on how the game is set up, porting from PC to console may be really hard due to things like control schemes, text size, menu schemes, etc, but in terms of optimization/polishing it's simply easier to polish for console than it is for PC.", "label": 0}
{"text": "This is so strange to me. It's like a reverse Half-Life 3. With HL3, everyone is looking for signs in just about everything Valve posts while they themselves say absolutelynothing, while most people just kinda forget Beyond Good and Evil 2 exists until the devs swear up and down it's happening.. again... for the 30th time...", "label": 0}
{"text": "Honestly fuck this game. I did the pre install weeks ago. I get off of work and come home to play and it needs a motherfucking 140gb update. Why the fuck did they say you could pretend install it if it was cap?", "label": 0}
{"text": "I don't mind a short game now and again, but then again I am 40. Honestly it's hard to juggle games and real life sometimes. I don't really finish many games to be honest.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Does anybody know the actual solution to this puzzle please? Is there a hint somewhere I missed?", "label": 0}
{"text": "No it’s not.", "label": 0}
{"text": "WoW is literally the pinnacle of 'gamers' creating the worst game possible for themselves. That already happened.", "label": 0}
{"text": "If too many people pick the wrong option, we will all be forced to do that.\n\n\nBig AAA companies like EA keep saying they want the gaming market to become Netflix. All games are streamed. You can't own anything anymore. There is no option. Once the publishers have full control, the price will rise and you will need to pay a monthly fee to every company who wants a piece of the cake.\n\n\nI believe you're either very young and naive and don't remember the time before streaming movies, or you are stupid. ", "label": 0}
{"text": "Said right when Quest 3s and Batman Arkham shadow releases lol. enough said.", "label": 0}
{"text": "i agree about the bugs, but, for me, this is the best state of the game that I have experienced. As someone who just likes to pug heroic raid and do m+ at 10+, I'm freer to do just that than i ever have been, and the bugs aren't really getting in the way of that. I'm happy to fund a company, which makes a game that i've been enjoying for the last 4 years (I stopped playing during cata cuz of high school/life and returned for shadowlands,) by paying extra money for extra conveniences/services. Having the option to have this mount instead of hearthing to an AH and getting summoned back is really not that of a deal for me. I prefer the convenience, and will definitely be spending the $90 soon, but, if i never buy it, it would not change much about my enjoyment of the game. I would never be able to make enough gold to buy the OG, but i can easily afford $90 now that i'm 31 and have a stable job. Also, just because you see everyone being excited about it doesn't mean that this is some game breaking advantage. I hardly see it as an advantage at all, just a minor convenience. There's gonna be so many people with longbois that most everyone will benefit from this anyway.", "label": 0}
{"text": "Bitch*", "label": 0}
{"text": "It's always been like this though?  This isn't some new phenomenon.", "label": 0}
{"text": "Then the comments of them using gold for tokens ignoring that someone else paid for the token. Money is still be exchanged.", "label": 0}
{"text": "Have you tried Vampire Survivor and those similar style games? Just uses one controller stick apart from navigating menus.", "label": 0}
{"text": "PSOne era Squaresoft games. Xenosaga, FF Tactics and FF7 were pretty much all one the places. Multiple people said multiple things and caused multiple events to happen all at the same time.", "label": 0}
{"text": "O talking to the wrong one with that shit. I'm blessed. I have fuckin rocked life. That doesn't mean I'm blind to what is going on around me. Can't be a victim when you plan on being victorious.", "label": 0}
{"text": "Sorry, fairly new to the game and... well I'm realizing this is the truth.", "label": 0}
{"text": "I was a hardcore longtime player.....A lot of the players left playing WoW are people with poor mental health that can't break the habit. Those people are vulnerable to grifting.", "label": 0}
{"text": "That's a fun idea, teleportation is a fun way of introducing that movement to the game, and having it implemented by way of throwing an object adds a skill factor to it as well that I think would be pretty fun to get good at. (Not that grappling couldn't be.) And at the very least teleportation wouldn't be weird to see from a stand still no momentum point of use.", "label": 0}
{"text": " Oh no!That's rough.", "label": 0}
{"text": "A fellow redhead enjoyer I see.", "label": 0}
{"text": "Bro I can't understand this nonsense sorry.\n\n\nThe people making doing the content patches are different than the people making the next expansion.  The people making cosmetics and mounts and stuff are different from both of those other teams too.  Whatever perceived quality issue you see are not because they took people to work on the mount.", "label": 0}
{"text": "gog as well.\n\n5.99 for base.  9.99 for dig deluxe.", "label": 0}
{"text": "Bloodborne", "label": 0}
{"text": "Yup, always with wasd though hadn't considered controller, forgot they could be played that way haha, thanks for the suggestion!", "label": 0}
{"text": "I'm a smoker. Pushin' 40+, since I was a teen.\n\nRegulations etc. didn't stop me doing shit, and now I gotta live with my stupid choice.\n\nThat was the point of the comment you responded to.\n\nGo ahead, regulate, prohibition, etc. all that shit. Stops no one motivated or stupid enough.", "label": 0}
{"text": "Did you play the first Alan Wake?", "label": 0}
{"text": "Well riot is selling a 500$ faker skin. As long as some weirdos are buying this stuff we’ll get such", "label": 0}
{"text": "Sadly some people has the iq of a toddler. \"Its their money\" well... then go and rant about how gaming is more expensive each day. And how every new videogame is almost 100 bucks and full of DLC and payed content.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Deep Rock Galactic Survivor is really fun.  Similar to Vampire Survivors with some extra twists, and levels to beat instead of a never ending run.", "label": 0}
{"text": "And Balenciaga sells a t-shirt for 1000$. What’s wrong with that? If they sell it, some people has money and buy it. I have money to spend on my hobby and if I’ll find a reason to play retail, I’d probably buy it.", "label": 0}
{"text": "You could try some turn-based games like Civilization 6, XCOM 2, or Baldur's Gate 3", "label": 0}
{"text": "thats shitty gameplay design. shoulda let you do that.", "label": 0}
{"text": "I'm sorry, it's an AUCTION HOUSE and MAILBOX mount?! I wouldn't do it now because I don't know the market, but I would GLADLY have paid $90 for this in 2010. I used to clear 1 mil a week at AH during Cata.", "label": 0}
{"text": "Turn based games.  Anything without a timer.  Like card deck building games.  Or any game you can pause and make decisions and then unpause.", "label": 0}
{"text": "Valorant set the new standard. When the dragon skins came out, the whole set was roughly 90$ usd. Fast forward to now, it has become common to see games offer \"deals\" or \"exclusive\" content for 100$ usd.", "label": 0}
{"text": "Have not played alyx. But isn't it linear like hl2?", "label": 0}
{"text": "Oh that's a great point, I never got very far into the gameplay of Warframe, but for that small amount of time I was into the game (just no friends who wanted to play with me) I remember being really into the movement system, it was so good I feel like I was playing it more and more because of how well I enjoyed the ninja-like movements.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "What are you selling and to who?  You talking on the AH?  I don't see anyone stopping farming to go do that.  They're going to do their farm and come back to sell when they're done.  There isn't a reason to stop mid-farm to sell on the AH.  If there was though, I'd just mail that off to a toon in a main city to sell on the AH.", "label": 0}
{"text": "He'd probably get the story of Portal 2", "label": 0}
{"text": "This, just use other kind of gate without such big holes", "label": 0}
{"text": "Dude, I can't explain everything explicitly to you. I figured that you could understand that the people making mounts probably make mounts for both the expansion, the in game incentives, AND the cash shop. Do you understand that? \n\nThe best mounts in the game are for sale, you can't earn them. If thats ok with you, cool. Keep spending your money on mounts.", "label": 0}
{"text": "Love seeing Legend of Dragoon references! Still one of my top 5 all time", "label": 0}
{"text": "Bioshock infinite. First time I played it, it ended and I had a concept of what was going on...sorta", "label": 0}
{"text": "Yup. This mount will probably single handedly pay for itself in the time I save posting and reselling fish alone.", "label": 0}
{"text": "LOL damn if you only get 9 fps with frame gen idk how you can even start the game 😂", "label": 0}
{"text": "Been playing diceomancer, quite fun sts-like, got some really unique mechanics", "label": 0}
{"text": "There are so many non sensical stories that it would be easier to tell you the ones that made sense.", "label": 0}
{"text": "Prey, BioShock, and Half-Life 1 openings so immersive and amazing for their times.  To be able to go into each blind with zero knowledge of it would be top tier request", "label": 0}
{"text": "Litteraly something batman would do.", "label": 0}
{"text": "Find all the feathers in Assassin's Creed...", "label": 0}
{"text": "When I heard about the more sinister origins of the town bikini bottom in SpongeBob I can’t look at anything that at surface level appears innocent the same ever again!\n\nPokémon strikes me as one game, especially the cubone theory", "label": 0}
{"text": "Get a 16 button mouse", "label": 0}
{"text": "Slay the princess.\n\nYou only need up, down and entrr for select.\n\nGreat history, voice actors and music.", "label": 0}
{"text": ">How did this happen? \n\nBecause whales exist. \n\nI work in game dev and honestly once you’ve attracted the whales you barely even have to make a game anymore. They’ll buy what you sell. We can pump out a horse mount and model in a week or two and sell it for the same price as a full game?? Why wouldn’t we? (We as in game devs, I don’t work at Blizz)", "label": 0}
{"text": "BALANTRO BROTHER BALANTRO", "label": 0}
{"text": "I usually fork it up to “Did the amount I paid give me the satisfaction I expected?”\n\nLike, take Outer Wilds. £20 thereabouts, and my playtime was 17 hours to complete it. Now, did I get 1 hour per £1? No. But was I completely drawn in by the story, gameplay, and overarching message? Most definitely.\n\nNow, on the flip side, take, for example Starfield. £50 at launch. With 57 hours of gameplay to complete the “story” and some side factions. Did I get my moneys worth in playtime? Sure. But did I enjoy it enough to warrant the price? No, it was bland, repetitive, and had a ton of bloat just to pad the run time.\n\nGames can definitely be short, as long as the game is full to the brim with actually good content, and not padded out just to extend the playtime. Also, the price tag really has to vary depending on the game. Paying £60 for something I may get not even 1/3 the total playtime, be bored whilst playing, and overall be a bad game is the bad part.", "label": 0}
{"text": "It's a a reasonably tough problem to solve.\n\nIn stealth games for examples, the gameplay relies on the player having more information and abilities that the enemies do not have - that often means windows and x-ray vision. For windows to work well there needs to be wode enough gaps that you can see properly\n\nYet you don't necessary want the player to use this to bypass a puzzle, or kill enemies through it etc. So what do you do?\n\nTL;DR: everything is a compromise. If you want to play a game that lets you do what you want, play Streets of Rogue, or The Outer Worlds.", "label": 0}
{"text": "I would say the fact that after purchase the jersey and car are now under your control are a factor.  The manufacturer can't control my usage of the jersey and car.  Since Blizz retains complete control over the usage of the item even after purchase I do think the rules are different and the only recourse consumers have is regulation.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "OSRS", "label": 0}
{"text": "Been putting that one off for no particular reason, guess it's time to load it up haha", "label": 0}
{"text": "Ok, when you say \"I don't see anyone stopping and farming to go do that\" who are you talking about? You. You and your friends? So like 10 to 50 people? I've done that.  I've watched bots do that. I've also watched other players when I was farming mats do that. So, not everyone.\n\nIt is objectively more convenient than ANY of the things that you saying you do. Objectively. I don't know how you can't see that but, hey, that's your problem", "label": 0}
{"text": "Every last one of ya’ll who defended the sparkle pony enabled this.", "label": 0}
{"text": "You’ll live lmao.", "label": 0}
{"text": "Get an accessibility controller, use your feet to do things?", "label": 0}
{"text": "I guess that's ultimately the question: is there a pattern where it pops up on the front page when these games drop?  I mean I'm sure it pops up at other times as well, but it wouldn't shock me if they regularly put it there when a new Call of Duty game is released as well.", "label": 0}
{"text": "Haven’t gotten through all of the replies but was surprised not to see Genshin mentioned more lol. There is sooooooo much going on, and while I try to keep up when we get new lore, the theory crafters are just so much smarter than me and know how to research. I gleefully await theory and summary videos after something big happens.", "label": 0}
{"text": "Baldur's Gate 3, or pretty much any other crpg like Pillars of Eternity or Pathfinder for example", "label": 0}
{"text": "Dark Souls 1, 2, 3, Bloodborne, Demon's Souls.\n\nSekiro and Armored Core VI make sense, but for the rest i rely heavily on Vaatividya.", "label": 0}
{"text": "Waaaa the developers want players to do the objectives", "label": 0}
{"text": "Camera go boom boom, but hand go fly", "label": 0}
{"text": "Capitalism much like money itself is a belief system, you have to be taught its doctrines and commandments.\n\nIt is a belief system that justifies the worst parts of human nature as acceptable, which is why so many sociopaths become successful CEOs.\n\nBanks are their temples, Economists are the soothsayers, bankers are the priests, the stock exchange is their Vatican. \n\nIt isn’t something people just do, it’s something that has to be taught and ingrained into the mindset constantly.\n\nIf you handed $100million to a native of North Sentinel island they would have no idea what it was for or what to do with it because they have not been taught the doctrine.", "label": 0}
{"text": "Woah! Is that a people carrier????", "label": 0}
{"text": "Hideo Kojima trying to HIDEO his chubby", "label": 0}
{"text": "Bg3", "label": 0}
{"text": "Love those games, might check out some jrpgs I've been putting off too", "label": 0}
{"text": "Pretty sure that's the case. Using a trace line from camera towards your viewing point is very common, even if the model is located at the hand.\n\nIt feels more intuitive to aim like that and prevents unwanted aim mechanics (caused by arm / hand animations)\n\nThat's at least my take as a hobby game dev", "label": 0}
{"text": "it looked sick as hell to someone who didn't play or know anything about the first. I was excited that there was a game that came before it I could try. Then I looked up the first game and got massively confused about how they're related. This game should be its own thing.", "label": 0}
{"text": "It can stop people that are indecisive and curious. It didn’t stop you but whose gonna say it didn’t stop anyone ever.\n\nBeside that regulation like banning cigarettes ads, smoking in restaurant/commute imo does help dropping the smoking rate.", "label": 0}
{"text": "LMAO you are absolutely right on that", "label": 0}
{"text": "Not especially Videos, but I had to read myself through the whole Fandom Entry to understand what was going on in Devour", "label": 0}
{"text": "Rimworld, very addictive colony sim/story generator", "label": 0}
{"text": "You might enjoy Oxygen Not Included, though it isn't a puzzle game. Many of the mechanics are a bit beyond my engineering capabilities.", "label": 0}
{"text": "What if the world was a pyramid? What if video games don’t even really exist? what if my computer could be powered by my farts? \n\nStuff your what ifs in a sack", "label": 0}
{"text": "You could buy full sets on eBay back in the day for $20. This is too high.", "label": 0}
{"text": "Half Life Alyx has one of my favorite VR moments when you have to stick your arm through a window to remove a pipe/bar from barring a subway door so you can open it. \n\nShame this didn't work.", "label": 0}
{"text": "How did you find my comment here but missed the dozens upon dozens of other comments of people getting huffy about invisible walls that you would have to see before finding this?", "label": 0}
{"text": "To be fair he did kinda phone it in, but IMO that was part of the charm and I miss my Dinkle-bot.", "label": 0}
{"text": "It's so simple but so elusive for some.", "label": 0}
{"text": "absolutely", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Not sure how many of those are controller compatible (i know bg3 is) but with MnK you basically need your keyboard.\n\nIirc poe 1/2 MIGHT be doable with just spacebar \n\nMaybe I should finally finish disco elysium", "label": 0}
{"text": "I remember people going wild over Destiny lore and was told I needed to use the official app or outside source like Youtube to get the full picture.  I'm a diehard RPG fan so I said *fuck that*. Your lore and stories are shit if I need outside sources.", "label": 0}
{"text": "And that's awesome again I don't disagree completely with the use of the mechanics, like you said it shakes up the regular gameplay in those games and adds more layers or movement to the levels. It's definitely more to fly through the air than it is to take the stairs after all. Just like it's more exciting to be able to jump from a rooftop and glide down with a parachute or glide suit. If I'm in a big open map, battle royale setting, taking the stairs is a bit slow and boring, and can limit the possibility of your choices in game.", "label": 0}
{"text": "Lol, excellent contribution to the conversation. Very insightful. Please tell me why trash talk should no longer be viewed as acceptable in competitive settings? Pvp games are competitive in nature, and so are the players typically. Trash talk is just part of it. It shouldn't ever be personal attacks, I agree, but saying you suck is not the end of the world\n\nNot to mention, this type of thing is just going to be exploited. As a matter of fact it already has, the automated system can't discern context so if you say a swear word, you will be comm banned. Spite reporting is a serious issue. Getting banned for swearing is absolutely ridiculous. What is this, Roblox? Ban harassment and bigotry, sure. Don't ban me because I'm raging and forgot my mic was hot. So stupid", "label": 0}
{"text": "My settings are off but they still won't stop being red and blue. Have you heard about this? Know what to try next?", "label": 0}
{"text": "I played BG3 on my laptop in bed with a PS5 controller. Totally doable. The only time I used my keyboard was splitting large amounts of gold, but that was optional and doable without.", "label": 0}
{"text": "prey is one of the best games i’ve ever played. amazing solutioning and lots of replayability", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Destiny’s lore is pretty amazing and completely optional if you don’t want to get into the weeds of it all. Mynameisbyf on YouTube does an amazing job breaking it down and explaining it all.", "label": 0}
{"text": "witchfire \ndiablo 4", "label": 0}
{"text": "I'm bummed because it's really close to a great story. I'm a totally nostalgia biased fan but replaying them it's like, damn, if you had cut some of the fat out of this it would be great. A soul separating from a body leaves 2 pieces, check.  A strong enough person leaving behind some form of consciousness in the body, sure, no problem. That consciousness musing on its right to exist and whether a part can be worth as much as a whole? Poetic as fuck.\n\nLike Roxas being tortured over the fact that he needs to cease to exist to save the world? Damn that's some highbrow shit.\n\nBut then it's like, guys, stop twisting, you had something good going", "label": 0}
{"text": "Hell yeah bro. That’s a cool one for the resume.", "label": 0}
{"text": "Nah, can't expect the throw to get far enough since you can't do a full throwing motion. Failing is the right outcome but an invisible wall was unfair", "label": 0}
{"text": "Aside from the setting being sci-fi and there being animal people, the sequel trailers seemingly have nothing at all to do with the original game.", "label": 0}
{"text": "Yup, Disco Elysium too. Btw, PoE 2 has turn-based mode, so you won't even need the spacebar. Same for BG3", "label": 0}
{"text": "U wot m8?!?!?!? 😱", "label": 0}
{"text": "Seems like most JRPGs are convoluted as hell.", "label": 0}
{"text": "There are so many games that I've gone back and played as an adult only to find that they're WAY easier than I remember... this game though... this is not one of them. \n\n  \nIt's crazy too, because EVERYONE I know played this game, and everyone loved it. The game itself was just so fun as a stupid beat em up. I never got past the first hoverbike area though. Nobody else I knew did either. Crazy how a game can be so insurmountable, but still have such lasting appeal.", "label": 0}
{"text": "I actually switched to using a controller about an hour in and never went back. When you switch to controller it changes the UI to be optimized for the controller.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Yessssss!", "label": 0}
{"text": "It's time consuming it likely takes weeks or months to do. Frankly anyone  with the skills to do it has the skills to get a legitimate job getting paid a decent salary.\n\nYou got to be insane to waste huge amounts of time cracking video games for 'competition'\n\nMost of the groups are gone wither retired or disappeared and it left only a batsine insane person and one that doing the older titles with old versions and none of the new", "label": 0}
{"text": "Personally, it took a revisit to Prey for it to really hook me. First time, I only played a couple of hours. But the creativity in gameplay is what really hooked me.", "label": 0}
{"text": "The narrative depth of minesweeper is only rivaled by ski free and its mysterious yeti", "label": 0}
{"text": "Preach sister", "label": 0}
{"text": "You should use Google. This question is asked fuckin daily at this point and a simple Google search would probably bring up the last time this was posted. \n\nAssuming I'm even talking to a person.", "label": 0}
{"text": "Don't worry.  The \"stories\" in these games are basic bitch fantasy at best.", "label": 0}
{"text": "Digital games are fake.", "label": 0}
{"text": "I mean, when you put it THAT way... yeah, it kinda IS convoluted. \n\nI liked the game, but the twist about Tidus being a dream ghost gave me a headache rather than shock.", "label": 0}
{"text": "It works for FromSoft games.", "label": 0}
{"text": "Jak and daxter. The OG and number two.", "label": 0}
{"text": "Destiny. I still have no idea what’s going on.", "label": 0}
{"text": "It sounds like you're talking about games that don't require an official server to connect to, rather than overpriced mtx shenanigans, but I agree with you on that too.", "label": 0}
{"text": "Zombies stopped being about zombies and started being about aliens ", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "last time i played online in CoD was the original modern warfare 2\n\nconstantly facing a deluge of 12 year old pre-pubes screeching racials slurs\n\nis this shit SILL going on?", "label": 0}
{"text": "It's like impassable terrain. Some are clever. A LOT are super lazy/quick like \"oh no, a knee high fence!! WHAT EVER WILL I DO?!\"", "label": 0}
{"text": "🤣🤣🤣", "label": 0}
{"text": "Well you see, the Korobushka folk dance involves a lot of people all moving and turning and orbiting in tandem to fit in sync, and if you mess one up the whole system becomes a mess.  So too if you mess up turning your Tetris piece to fit in the system, you've messed up your dance. /s", "label": 0}
{"text": "It was just a sarcastic joke.", "label": 0}
{"text": "Yep. Even has that look of....I didn't do shit...not touching.  Kind of reminds me of sweet dee in the Nightman Cometh singing \"just to be clear. I did not have sex with this boy. Just to be clear\"", "label": 0}
{"text": "Having finished the Xenoblade series (an all time favorite), I tried Xenogears and holy moly there are so many names, cities, locations, groups/affiliations, and other things to remember that I was so lost while playing it. Every time I booted it up, I would walk a little, fight a little, and read for 30 minutes before getting tired and getting off. I put the game down for over a year now and I fear picking it up again because I'll have no idea about anything that's going on or where I am in progression.", "label": 0}
{"text": "Who the fuck is jason godon levitt?", "label": 0}
{"text": "Some of the most fantastic insults were created in the MW2 / halo 3 days. My personal favorite was when a dude got upset and calmly said “you know what….. you guys can all just sprint backwards through a field of dicks…..” and just disconnected.", "label": 0}
{"text": "Nah, you are right, It is pretty cool actually.", "label": 0}
{"text": "But it exists. You can buy it. It just costs more than this one does.", "label": 0}
{"text": "Definitely Minecraft. We used to play it all the time back in the day. We still sometimes revisit the game every few months and play for a weekend, but nothing beats those good old days where we stayed up into the AMs and played over the course of many months every day.", "label": 0}
{"text": "You're not alone in the feeling of confusion over star whale. There's very little foreshadowing it, and even after reading the lore from its remembrance it's too vague.", "label": 0}
{"text": "Also excited, I feel like a kid again! Haha. Already got the black plates and disc drive.", "label": 0}
{"text": "It was just the same cringe humour Watch Dogs Legion had but with space monkeys", "label": 0}
{"text": "[The Tragedy of the Commons](https://en.wikipedia.org/wiki/Tragedy_of_the_commons)", "label": 0}
{"text": "I've never played but again each game feels different depending on the way they implement it. Sekiro is a more open world and feels very similar to a Spider-Man thwip. But also feels pretty fantasy based id assume a guy who goes around killing monsters all day can pull himself through the air with ease.", "label": 0}
{"text": "I was way too young to be competent at demon souls the first time I played it and if it wasn't for youtube I never would have made it past the first area.", "label": 0}
{"text": "There's gameplay demos on YT if you wany to see what they were going for at that point in time", "label": 0}
{"text": "Neat, always cool to see actors in some of their early random stuff.  \n\nWhats neat is from what I recall Steve was supposed to be a very minor role in Stranger Things and die early on, but the directors like him in the role so much they changed the character a little and gave them a bit more of a redemption and recurring role.", "label": 0}
{"text": "Ya got me, I'm actuality just 3 raccoons in a trench coat, scraps is scarce these days so I've been living on reddit karma", "label": 0}
{"text": "Halo. On the surface it's master chief fights aliens but there all this lore i cannot bring myself to care about lol", "label": 0}
{"text": "Very true. If you stick to the default ending, it's rather straightforward. \n\nDoing everyone's waifu's quest shows the layers of the iceberg.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "Are you absolutely sure that you don’t have anything turned on in Accessibility settings that would cause this? Because anyone who’s had the issue realized it was turned on and just turned it off.", "label": 0}
{"text": "I'm against people calling each other f*ggots in video game lobbies, but when it comes to them saying it to you, I'll make an exception.", "label": 0}
{"text": "Except now you have a shitload of money going into finding ways to shift the playing habits and spending habits of casual players so they spend more money in game instead of putting that money into actually developing content. Which I'm sure you'll claim doesn't impact you because you're so special, but I can guarantee it has whether you realize it or not. So congratulations, you're being manipulated for someone else's benefit and the money you spend is going right back into finding more nefarious ways to manipulate you to into being a more lucrative consumer. Wins all around I guess?\n\n\nAnd I know you can apply that to pretty much any industry, but the amount of manipulation you see in modern day gaming is so off the charts that it should be considered unethical by all of us. But an entire generation has now been raised on micro transactions they don't know any better.\n\n\nThe sad thing is that if you get to know a modern gamer well enough you'll see that their mental health is suffering because of it but who the fuck cares you get to play your free game!", "label": 0}
{"text": "I made $22k from 1999-2000 selling gold and rare items from Everquest on eBay. The game companies just caught on and cut us out.   \n\nI had this regular customer and once asked him why he'd buy so much easy to obtain gold from me. He said his time was worth way more than his money. He only had limited time in the evenings to play, and he didn't want to spend it farming gold.  I've given that a lot of thought over the years.", "label": 0}
{"text": "Man I dreamed about this game for sooooo long! I would love to see it coming, but at this point I think ubisoft is gonna die soon, that or the game would just be delivered as a total mess cash grab...\n\nEven with skull and bones they threw in the Garbage an incredible project with such a wasted potential...\n\nDon't even make me start talking about Anthem. \n\nNope... Uby can't sell me no more lies. \n\nBut I still say I'll forever miss those Uby's golden days..", "label": 0}
{"text": "That’s actually not true lol", "label": 0}
{"text": "They're withholding lore from you. Bowser has multiple vacation castle homes and keeps moving Peach from one to the other until he runs out and you corner them in his home castle.", "label": 0}
{"text": "Destiny does a horrible job of story telling, plus they make the games multiplayer the focal point so they don’t care about story, new to the game? Here’s end game stuff you can do under-leveled", "label": 0}
{"text": "Pokemon Red. I haven't lore deep dived yet but it seems transcendent.\n\nWait was I supposed to say Dark Souls?", "label": 0}
{"text": "I've never spoke of my morals at all. This is a discussion of what is ethical. And everything you have said is definitely questionable about what is ethical. \n\n\n2 consenting parties could be two dictators engaging in a transaction to commit genocide or suppression of their own people or another countries people. Several men can consent to each other that gang raping the women in front of them is a great plan. Many people would think that's unethical, but your position is stating that it is ethical as long as 2 parties are are consenting, irregardless of the harm it does to other parties.", "label": 0}
{"text": "Pong", "label": 0}
{"text": "WoW is a starkly different game than when it first started.  Almost not comparable except the thin skins they share here and there.   \n\nThis has been going on for a while.", "label": 0}
{"text": "Hello,\n\nThis message is to inform you that your post has been removed because we require you be an active participant with positive comment karma in r/gaming before making a submission.\n\nPlease make some comments on r/gaming, once you amass some comment karma in r/gaming, you may try again. And, no, we're not going to tell you the number you need.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gaming) if you have any questions or concerns.*", "label": 0}
{"text": "just become the master wanker", "label": 0}
{"text": "Just tell me it doesn't seem to be a limited time offer type of thing? Haven't played in years, but the functionality of the mount sounds really impressive. Nice to think it'd still be there if I ever dipped back in.", "label": 0}
{"text": "Pokémon gen 1.  Go wild", "label": 0}
{"text": "A bit more? He's arguably the star of the show at this point.", "label": 0}
{"text": "The vast majority of people are trash, this is an example why, and no, it's not too harsh", "label": 0}
{"text": "No it isn't. This has been something that has been solved for a while. Ever see moveable light sources in games? Ray tracing isn't some high end concept now a days. Instead of placing the line from center of screen you can track from center of hand.", "label": 0}
{"text": "Elden ring. I’m out here after defeating Malenia and The Elden Beast wondering wtf an Elden lord is", "label": 0}
{"text": "Check out Rimworld. Definitely one of the best colony builder games. Don't be afraid to mod it to your liking if you find vanilla lacking. Two months will go by in a flash.", "label": 0}
{"text": "Final Fantasy 10's story is amazing and somewhat complicated. Rich with lore and history tying into the story beautifully.", "label": 0}
{"text": "I think the official explanation for how Ocelot could so convincingly play as Liquid was that he brainwashed himself with nanomachines.  But I prefer the explanation that he's just a really fucking good actor.", "label": 0}
{"text": "A fool and his money, blah blah blah", "label": 0}
{"text": "Wow!", "label": 0}
{"text": "I definitely agree and still feel like some game developers are chasing after this feeling of freedom in movement in game to this day. Titanfall did such a good job of feeling fast and fluid, I always felt like actually jumping into the titan was a detriment to the gameplay to be honest. (That could have been my complete lack of skills though.) But I did love the approach from any angle mounting animations they had for boarding the titans, especially when they would snag you out of the air and toss you into the cockpit.", "label": 0}
{"text": "I just need the ability to have short SESSIONS.  The length of the game is irrelevant to me at least(price not withstanding).", "label": 0}
{"text": "it's always been that way, we are just getting more and more efficient at profit seeking; better education, tech., data, etc.\n\nProfits must go up every quarter, thus every penny from every person that can be extracted must be.\n\nYou think surge pricing trending is bad? Soon enough it will be individual pricing.", "label": 0}
{"text": "This guy is a certified legend", "label": 0}
{"text": "I disagree with naming it \"The Tragedy of the Commons\" - this is do to speculation. A business becomes speculative once it becomes public and answers to \"shareholders\". This is where the relentless march towards growth originates. Eventually the investors will eat everything they touch, extracting every ounce of value to maximize the price of their share until the bubble they've created by cutting cords pops and the house of cards they created falls. This is what happens.\n\nWhen you make incentives so abstracted from reality, it inevitably turns into dust eventually.", "label": 0}
{"text": "that’s where most of the confusion comes from\n\nif it was released starting with Birth By Sleep, and continuing chronologically, the story would still be long, but much easier understood", "label": 0}
{"text": "Bioshock Infinite. Still don't totally understand it.", "label": 0}
{"text": "If you've got a switch this seems like an ideal opportunity for the joycons.", "label": 0}
{"text": "Bro...I'm talking aboit the whole fucking game lmao, but elden beast even more so.", "label": 0}
{"text": "I disagree.\n\nIf you're reviewing a release, I agree.\n\nFor lists like this, mix it up with some preferences and things which shine in their own way but aren't enough of an all rounder to be the biggest and most critically acclaimed games.\n\nOtherwise I can just go to metacritic and sort by rating.", "label": 0}
{"text": "OLD SCHOOL RUNESCAPE!!!", "label": 0}
{"text": "The devs of destiny have literally been told by management not to make anything too good (think witch queen) because they don't want to raise expectations. Fuck bungie", "label": 0}
{"text": "As soon as this person lumbered onto the stage, they were the *Resident Winner*", "label": 0}
{"text": "Actually it’s the same base technology apple uses for their Dolby surround headphone virtualization; including the head tracking.\n\nIt’s not a gimmick and only codtards would be upset activision did something good to increase player value. ", "label": 0}
{"text": "I guess man. I loved the artstyle and the depth. I just couldn't really grasp it all.", "label": 0}
{"text": "Bg3 is sooo much better with controller imo", "label": 0}
{"text": "I’m not sure if scorn counts. But I had zero idea what was going on before, during, after, and well after. I remember sitting there just thinking what the hell did I go through? What happened? Why? And after watching a couple videos. I still don’t know.", "label": 0}
{"text": "The Warhammer worlds, Fantasy and 40k, have like four decades of lore and retcons.  They're both messes, gloriously entertaining messes.", "label": 0}
{"text": "You just have to sit through a 2 hour movie for the reveal.", "label": 0}
{"text": "I mean, basically every game that has you interacting in a reasonably complex 3d world with any kind of game physics will have invisible walls. That's kind of a necessity of how such games function. It's just a matter of how easily noticable and distracting they are.", "label": 0}
{"text": "It's The Law of The Few perhaps.  A handful of people that agree with the value, or that rationalize themselves into accepting the value (nothing will change so my decisions don't matter) ruin it for everyone else.", "label": 0}
{"text": "Lol, I meant more for the first season, but yeah as it turns out it wasn't only the directors that liked his portrayal of the character", "label": 0}
{"text": "Seems to me they didn't know better. The superior experience would've been to let that work.", "label": 0}
{"text": "Biblically accurate cloud strife.", "label": 0}
{"text": "Absolutely despise the fact that the concept of a game I want so badly to be made “space pirate rpg” has been teased to me for the last 10 years by Ubislop. One of the worst compiles out there that I can guarantee won’t do this or any game justice.\n\nIts just gonna be another far cry 3 clone", "label": 0}
{"text": "I'm definitely gonna try Balatro, to many suggestions for it even before I broke my arm lol", "label": 0}
{"text": "None, if a game is incapable of explaining itself to me, it isn't worth playing.", "label": 0}
{"text": "The longer it takes for this game to release the more likely it's going to be reeeealy bad. Dead Island 2 somehow landed on its feet after being in development hell for years but I'm not convinced Ubisoft can pull something like that off", "label": 0}
{"text": "Games like Until Dawn and Detroit: Become Human must keep you up at night lol", "label": 0}
{"text": "BG3 at number 18 is probably the most whack thing about this list. Like, saying Thank Goodness You're Here (which is a cool game, don't get me wrong) is better is pretty wild.\n\n\nPutting Dragon's Dogma 2 on the list at all seems questionable to me as well.\n\n\nThe rest of it? Eh, they're opinions I suppose", "label": 0}
{"text": "*cough* Star Citizen *cough*", "label": 0}
{"text": "I fractured my elbow after falling off my bike on a trail a few years back. I was out for a couple of months too and the game that got me through it was Farming Simulator. Especially on the PC where mods can make some of the field work easier like GPS. The key binds keep your tractor or harvester running straight to allow for one handed work if you need to give your other hand a break from time to time.", "label": 0}
{"text": "Came here to say this. Looked forward to launch back in 2018 and played on PS4 day 1 for a while until I couldn’t stand the bugs and combat. 300+ hours and a platinum later I can say it’s in my top 10 for sure.", "label": 0}
{"text": "POO was always mine", "label": 0}
{"text": "Reason why people stay in party chat with their friends and avoid talking in public chat. Then you get people complaining that lobbies are dead and no one talks anymore.", "label": 0}
{"text": "Destiny and Elden Ring.\n\nI’m having a blast - but no idea why.", "label": 0}
{"text": "How did they turn you off of it? Did they overhype it or did they do something else?", "label": 0}
{"text": "*…* it’s always nsfw content once you’re past surface level content of their cosplay….", "label": 0}
{"text": "Using the mako makes ME1 unplayable for me. I really wished they would’ve removed it from the remaster.", "label": 0}
{"text": "Legend of Dragoon is the best game ever!!", "label": 0}
{"text": "CSGO skins? Cheap compared to human skins. I get them fresh too so there’s a premium but man it just makes all the difference in taste.", "label": 0}
{"text": "Bro needs his hands held like a baby lmao", "label": 0}
{"text": "It means they’re hot and a girl and cosplay relatively naked or provocatively.", "label": 0}
{"text": "But it’s a “best games” list. Not a “best games but some of them have been left out so some smaller, not as good games can get some recognition” list", "label": 0}
{"text": "I'd argue California's reputation for restrictive legislature is greatly exaggerated, but I haven't lived in any other states so my experience is limited.", "label": 0}
{"text": "Buyers determine the worth of optional convenience to them. Again, buy it if you want it, don't if you don't.\n\nWe're going in circles at this point though.", "label": 0}
