{"text": "You should focus on improving yourself, externally or internally. When you are good, girls will naturally be attracted to you.", "label": 1}
{"text": "Life as we know it like this...", "label": 1}
{"text": "This is a GOOD MORNING, Thanks OP!", "label": 1}
{"text": "Any challange is a good challange: [Road to $100K Dividend Portfolio - Challenge #4](https://youtu.be/_KIQ5ad_2Zk)", "label": 1}
{"text": "true..", "label": 1}
{"text": "Well said!", "label": 1}
{"text": "The hardest part for me with waking up is actually getting out of bed. When you set your alarm, set multiple, and then put it across the room from you. That way if you want it to turn off, you have to actually get out of bed to do it :P I've gone from sleeping in super late to actually waking up when I want to pretty consistently now.", "label": 1}
{"text": "This is some toxic bs, no your progress doesn’t disappear. Nobody can go on perpetually. Its good to be practical and take healthy breaks. \n\nYou 100% are going to falter, but if you keep this mentality that “progress lost” you are digging yourself a deeper hole.\n\n2 step forward, 1 step back is still progress.", "label": 1}
{"text": "There is nothing negative about pointing out that this doesn't work for everyone despite the meme using such wording. It's ok to make a casual statement letting others with less neurotypical thinking know they aren't alone when they see posts like this. Posts like this can be demoralizing for people who struggle with executive function disorders. \n\nNo one asked you to make assumptions or give any input about my partner. You chose to do that, and you didn't even ask for any clarifying information before just assuming that if they struggle to execute a plan they \"probably never had a goal to begin with\". I'd say you were the one being negative. Take care. Have a good day. Try to make fewer assumptions from an abelist perspective if you want to be seen as helpful.", "label": 1}
{"text": "Your submission was automatically removed because your account does not meet the comment karma requirements to post here. For additional details, see Rule #3.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*", "label": 1}
{"text": "Discipline may hurt now, but it's essential for achieving long term goals and personal growth", "label": 1}
{"text": "You kind of remind me of myself at that age. And when I look back at that period of my life, I realize that I just didn’t know who I was yet. I’m not going to read other comments here, I just want to let you know what changed in my life and what pushed that change along.\n\nThe absolute most most most important thing is confidence. Right now it’s tied to social status, and the level of interest in you from women. So you need to find something else you’re proud of, start overachieving at work, or studies. And with work, start taking certification courses that are in your job field. It’s good that you’re already going to the gym and playing more soccer. Join an adult league in your area, go get beers with the team after a game. \n\nYou need to have a schedule full of things you enjoy to do. Let’s say after a soccer game at your new league nobody wants to hangout that night, to be unbothered by that, you need to have something else you’d rather do anyway, like play video games or something. That goes for anything, let’s say a girl cancels a date, you need to be able to not be hung up on it. And the way to do that is to have something else to do that you really enjoy. Start enriching your life with things you truly enjoy doing. Have a schedule for your week. And don’t just build it in a few hours, it’ll take a few weeks for it all to land.\n\nIf you pepper in some social activites into your life, ie soccer league, online gaming, etc you’ll be able to concentrate on keeping your own social battery from draining on your terms. You need to by tying your identity into something else. Whatever you want to be better at, make it part of your identity and say it to yourself. Like with soccer instead of “I’m trying to play more soccer” say to yourself “I’m a soccer player” find the indentity that you want to have and affirm it with your everyday language.\n\nLong story short, you need to find fulfillment, and and identity your proud of. Working on yourself in other ways other than just being better with women. If you do that, everything else will fall into place. Also don’t worry too much if it’s not happening the way you want. 23 is also a tough age and a tough period of life, you’ll find who you are eventually", "label": 1}
{"text": "I know I can do it. Law of attraction and manifesting.", "label": 1}
{"text": "I'm doing a survey on productivity styles for a project. Open to anyone 18+. Thanks! [https://forms.gle/N7zay5GZpij2M7Ap8](https://forms.gle/N7zay5GZpij2M7Ap8)", "label": 1}
{"text": "Love this! It’s so easy to fall into that trap of wanting to fit in. Props for being real and making that commitment. Here’s to owning our truth, even when it’s tough", "label": 1}
{"text": "This is super real.", "label": 1}
{"text": "👍🙏", "label": 1}
{"text": "I hear you, and what you're feeling is completely normal. Your cousin gave you some tough but real advice - thinking long-term is important. But here's the thing: feeling weak doesn't mean you are weak. Everyone goes through periods of low confidence and uncertainty.\n\nStart small - pick one goal you can work on this week. Could be learning about a new career path, updating your resume, or even just reading about financial planning. You don't have to figure everything out at once. The key is to start moving forward, even if it's just baby steps.\n\nYour cousin is right that emotions shouldn't hold you back, but don't be too hard on yourself either. You're already showing strength by recognizing you want to change. Focus on progress, not perfection. The past is done - what matters is what you do next.\n\nRemember: Every successful person started somewhere, and many felt just as lost as you do now. You've got this! 💪", "label": 1}
{"text": "It's such a simple reminder, but it's crazy how easy it is to fall into that \"someday\" mindset. I feel called out just looking at it. Definitely need to stop saying \"I will\" and just start with small steps today.  \nThat little \"I... am... doing!\" line really nails it – kinda funny but also super real.", "label": 1}
{"text": "Your cousin’s right, though – sometimes you need that wake-up call to really see where you’re heading. But it’s also normal to feel lost; everyone goes through it, even if they don’t show it. What’s helped me when I feel like giving up is just focusing on one tiny thing I can do, something that reminds me I’m still moving, even if it’s slow. Like, maybe I can’t fix everything today, but I can take one small step. And forgiving yourself for past mistakes? That’s huge. It’s hard, but letting go of that baggage makes it easier to move forward. You got this, one small step at a time.", "label": 1}
{"text": "This is a good reminder to prioritize self-care💖", "label": 1}
{"text": "Motivation is like a gym membership: you pay a lot, but half the time you just sit on the couch! 😂", "label": 1}
{"text": "\"You CAN do this\"", "label": 1}
{"text": "100% heart relieving", "label": 1}
{"text": "you have no idea how much i needed this", "label": 1}
{"text": "To give anything but your best is to sacrifice the gift", "label": 1}
{"text": "that's a motivation out there!!", "label": 1}
{"text": "I’ve been there too, feeling stuck and unmotivated. For me, taking small steps toward change helped. I set tiny, achievable goals like reading a chapter of a book or taking a 15-minute walk each day. The momentum built over time, and it helped me feel like I was moving forward again", "label": 1}
{"text": "Phone cover asap", "label": 1}
{"text": "This is true!", "label": 1}
{"text": "Your submission was automatically removed because your account is not old enough to post here. For additional details, see Rule #3.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*", "label": 1}
