{"text": "tl;dr\n\n\nThis is all happening in the virtual world. It isn’t real. 😂", "label": 0}
{"text": "He is genuinely worried about  how hard is for the majority of the people to afford their needs. Such a kind guy!", "label": 0}
{"text": "That Time I Accidentally Got Hired To Lead An IT Department Despite Barely Knowing What A Computer.", "label": 0}
{"text": "Fathaaaaaaaa!", "label": 0}
{"text": "Hopping around like a dipshit", "label": 0}
{"text": "WTF, are you ok?", "label": 0}
{"text": "Yes, this is it", "label": 0}
{"text": "Potential title", "label": 0}
{"text": "![gif](giphy|3eRon7lRelaBCfCU45)", "label": 0}
{"text": "What movie is this from? I can't place it 😭", "label": 0}
{"text": "What is this taken from?", "label": 0}
{"text": "5th element", "label": 0}
{"text": "The 5th element", "label": 0}
{"text": "I haven't seen the movie in like 20 years and couldn't remember the title. 🤷\n\nMy brain was telling me \"Sixth sense\", but I knew that was absolutely wrong.", "label": 0}
{"text": "Though I never got what this liquid is. Blood?", "label": 0}
{"text": "5th element", "label": 0}
{"text": "😂 I hadn't realized how long it's been since I actually watched it full through", "label": 0}
{"text": "Lmfao 😂\n\nDon't forget their predecessors Second Sight and First Blood", "label": 0}
{"text": "Literally my favorite movie ever. Where else can you get subtle comedy from legends like Bruce Willis, Gary Oldman, and Chris Tucker, while they all try their damndest to be serious? It's such a classic.", "label": 0}
{"text": "Best movie!\nBest acting!", "label": 0}
{"text": "And then seven brides for seven brothers", "label": 0}
{"text": "Well at least I know I'm watching 5th Element this weekend now.\n\n  \nJean-Baptiste! Emmanuel! Zorg!", "label": 0}
{"text": "Trump is sitting right above zorg! forgot the black towel!", "label": 0}
{"text": "Because Musk bad, and it is election week. They try to tie him with pieces of shiet like Trump.", "label": 0}
{"text": "Behold! Chris Tucker’s gleaming nuance.", "label": 0}
{"text": "Im not even joking i have a prosthetic leg above the knee and can hop higher than that.", "label": 0}
{"text": "^^I’m ^^disaaaabled", "label": 0}
{"text": "I mean he has pretty intentionally tied himself.", "label": 0}
{"text": "Is he stressing during this scene or is the planet monster guy doing it?", "label": 0}
{"text": "And an alien space opera.\n\nWhy you no mention Mila!? She's wonderful!", "label": 0}
{"text": "Thanks much.", "label": 0}
{"text": "I think Putin has something he is using as leverage on musk.  Can be a video of any illegal activity.", "label": 0}
{"text": "Four stones, four crates! Zero stones, **zero  crates**!", "label": 0}
{"text": "You only?\n\n![gif](giphy|7cTTE2Z1OmrFm)", "label": 0}
{"text": "I know this music.", "label": 0}
{"text": "It *must* be green.", "label": 0}
{"text": "Tis the season for treason", "label": 0}
{"text": "😂 I wonder if we missed any character overlap", "label": 0}
{"text": "Still have no idea what the hell that goop is or why it's there but I don't care because it works.", "label": 0}
{"text": "Ah! The so-called 'art dealer!'", "label": 0}
{"text": "**Super** green", "label": 0}
{"text": "And then he jumps to make an X", "label": 0}
{"text": "I am 100% sure Russians have very nasty dirt on musk. Maybe they found it, maybe they trapped him but it's so obvious. I could speculaye it's potentially cp because he was projecting hard during the submarine story but considering all the crap his kids tell about him,  it could be anything. There were rumors he could have been linked financially to Epstein but we will probably never know.", "label": 0}
{"text": "That happened to Rudy too. ", "label": 0}
{"text": "That's actually footage from Rudy's press conference during the last election.", "label": 0}
{"text": "                            Bruce Willis\n                                 |\n        +----------------+-------+-------+-------------------+\n        |                |               |                   |\n    5th Element     6th Sense    Lucky Number Slevin    12 Monkeys", "label": 0}
{"text": "Zzz. ZZZZ! ZZZZZZZZZZZZZZZZZ!", "label": 0}
{"text": "This submission has been automatically removed because the title is not descriptive enough. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs. In this case, rule 8.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "Multi Pass", "label": 0}
{"text": "This submission has been automatically removed because the title is not descriptive enough. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs. In this case, rule 8.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "One of my favorite completely random things about that movie is that the protagonist and antagonist never meet in person. Corbin never sees or meets Zorg through the whole movie.", "label": 0}
{"text": "Super green!", "label": 0}
{"text": "Multipass", "label": 0}
{"text": "![gif](giphy|YSwL1HotKXXhe)", "label": 0}
{"text": "My point was despite all of their subtle jokes and ridiculous behavior, everyone is locked into their characters and conveying the seriousness of the plot. Even though Ruby is ridiculous and hilarious to the audience, he's not joking one bit.", "label": 0}
{"text": "“Bring me Trump’s stones”", "label": 0}
{"text": "This post has been removed because it activated an AutoModerator removal condition. The moderators have been notified. If the post was in violation of the rules, the link flair will be set appropriately. If there were no rule violations, the post will be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "See what I do Is I take it out, grab it and smack that shit right ascross...", "label": 0}
{"text": "Used to be mine as well for a long time. Watched it again recently with my partner who had never seen it and there's a few things which haven't aged quite as well as I'd hoped especially at the beginning with Milla in sexy \"bandages\" and the old creepy military guy taking pictures. \nShe's this perfect genetic fifth element being but still needs saving and a man to protect her and help her save the world. Some parts of it definitely feel like they are a product of its time. \nIt doesn't quite feel like it could be the future anymore but a fantasy story in an alternate time line or universe.", "label": 0}
{"text": "Drug addict does what….", "label": 0}
{"text": "How is this the profit? Could be the loss and still be the same.", "label": 0}
{"text": "![gif](giphy|iwmuEXy2cgsTuRue7i|downsized)", "label": 0}
{"text": "F that. Zorg had principles. He was dedicated to job creation for all the little baseboard robots.", "label": 0}
{"text": "I'm a simple man. I see a cutesy animal gif, I downvote.\n\nKeep this shit in r/aww", "label": 0}
{"text": "Ok", "label": 0}
{"text": "I can’t find my rewatch rooster, but I hear it every morning.", "label": 0}
{"text": "Pretty damn cool, beautiful!", "label": 0}
{"text": "Thanks!!", "label": 0}
{"text": ">I'm really curious \n\nYou sure showed how stupid I am for taking you at your word and actually answering you.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "This is like calling a broken pixel a gif because it changes colour, but nothing else about the screen changes. Good art but the animated aspect is nothing to brag about.", "label": 0}
{"text": "You're not wrong that it could use more animation, I'm just getting into doing gif animations and am starting conservatively. Thanks for your patience with me!", "label": 0}
{"text": "The first of these I saw with the skeleton pulling the lever on the bombs had that great frame where it opened it’s mouth. I think that should be your calling card, at least one frame with an open skull mouth.", "label": 0}
{"text": "Please explain your reasoning. I'm open to changing my mind if you can do so.", "label": 0}
{"text": "I just did it then, its the real deal. I didn't use a Sharpie though.", "label": 0}
{"text": "https://i.redd.it/8g7orny5i2xd1.gif\n\nThanks for the suggestion!  tried a version with a few little fixes and a very very subtle ripple. gotta be careful because I didn't want it to compete with the glowy thing and also I'm just not good at animating, if y'all think this is an improvement please lmk!", "label": 0}
{"text": "Damn. That's some nice verticals.", "label": 0}
{"text": "God you people are insufferable. YES, when someone running for president is a disgusting human being and in the public spotlight 24/7, their character is important to people.\n\nHow dense are you?", "label": 0}
{"text": "The orange is killer. Awesome work.", "label": 0}
{"text": "It's a good ideer", "label": 0}
{"text": "Does that extend to campaign backers? How many of her billionaire friends have close ties to the unmentionables? Including ol billy boy himself, who was close close friends with......?", "label": 0}
{"text": "She looks lonely", "label": 0}
{"text": "Horse is lucky the bull thinks that fence will hold him back.", "label": 0}
{"text": "I've never seen a bull be friendly.", "label": 0}
{"text": "This gif really makes me think...\n\nIs everything Ok at home, OP ?", "label": 0}
{"text": "Yeah I work around them a lot and i always find them to be super chill. It's like they know you are too small to be a threat. Of course I'm talking about bulls that interact with people a fair amount. A wild bull would definitely be a different matter and would probably gore you, especially if you startled it. Of course they don't play nice with other bulls as well.", "label": 0}
{"text": "beautiful & serene ❤️", "label": 0}
{"text": "Has anyone ever thought that his jumping is a form of stimming, or is it just me? I don't like Elon Musk and definitely don't agree with who he is and how he behaves, but I was just wondering if I'm the only one who thinks this.", "label": 0}
{"text": "“Whatever you say European hamburger”", "label": 0}
{"text": "I like how she got the underglow add-on for her hat", "label": 0}
{"text": "RuneScape dancing ass", "label": 0}
{"text": "Thanks, OP.  I’m much obliged.  Such a pleasant stay.  But now it’s time for me to go.  The autumn moon lights my way.", "label": 0}
{"text": "Sure thing super glue.", "label": 0}
{"text": "Thats a cool fact! Probably why there are restless spirits in the water here", "label": 0}
{"text": "I too am a simple man I like glowing stuff and clear water.", "label": 0}
{"text": "never heard of it, looks dope!", "label": 0}
{"text": "I imagine it has to do with hormones. Hell, even i get antsy/jumpy when excited. It's gotta be universal.", "label": 0}
{"text": "A lot of them also do the fake sneeze that you can see the cow doing here. Fast exhale with a wobble of the head pointing downwards.\n\nThe body language of \"I'm playing not fighting\" has some almost universal signals in the animal kingdom. Play has been observed in all sorts of weird combos of animals.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "I’ll post a better gameplay gif and delete this one!!", "label": 0}
{"text": "?", "label": 0}
{"text": "Its ok she has a spirit friend! (I think?)", "label": 0}
{"text": "thanks!", "label": 0}
{"text": "yeah I hear you, I'm excited about upping the complexity of the movement with these as I get more comfortable with the format and animating in general.", "label": 0}
{"text": "maybe its why the spirit thinks she's a fren!", "label": 0}
{"text": "Yes I remember when the Trump Administration helped create Operation Warp Speed. And also when the Trump administration bought 100million Pfizer vaccines to distribute them.\n\nhttps://www.defense.gov/News/Releases/Release/article/2455698/trump-administration-purchases-additional-100-million-doses-of-covid-19-investi/\n\nhttps://en.m.wikipedia.org/wiki/Operation_Warp_Speed", "label": 0}
{"text": "Remember to blow sunshine up your ass too or it won't work", "label": 0}
{"text": "And then removed oversight and testing?", "label": 0}
{"text": "After 4 months of covid denial*", "label": 0}
{"text": "And immediately took himself", "label": 0}
{"text": "I might remember if I didn’t need an electron microscope to see this gif", "label": 0}
{"text": "![gif](giphy|Y6yRfR88rvP44)", "label": 0}
{"text": "The greatest action film of all time.", "label": 0}
{"text": "An excellent movie.", "label": 0}
{"text": "After months of saying it was a hoax and later suggesting that people inject bleach. It's because of Trumps influence that the US came through the pandemic with the highest death toll per capita of any nation. Because half the country refused to believe it and obey restrictions even after he had changed his tune.\n\nIt really was hilarious seeing Republican politicians switch completely after realizing that their lies were killing off their own voterbase.", "label": 0}
{"text": "Which movie?", "label": 0}
{"text": "Operation warp speed was absolutely the best thing that occured under the Trump administration.\n\nThat doesn't excuse any of Trump's misinformation or outright lies about the vaccines. Including his suggestion that we research \"injecting disinfectant\", which is what this joke is referring to.\nIt also doesn't excuse his blatant racism when discussing the virus. \n\nThe actual distribution of OWS vaccines was also truly terrible. The intended vaccination rate from OWS was 80% of Americans by June 2021. They only managed 3-4% from September to December 2020. When the Biden administration took over in January 2021 the vaccination rate increased, attributed primarily to the improved communication between federal agencies and state and local health depts. By June 2021 ~65% of Americans had at least begun their vaccine series.\n\nTrump can have some credit for allowing (begrudgingly) the research on the vaccine to succeed, but he doesn't deserve any credit for the vaccination program.", "label": 0}
{"text": "so sick", "label": 0}
{"text": "Yeah, it's fuckkn autumn", "label": 0}
{"text": "So much cold and death and darkness approaching", "label": 0}
{"text": "Good stuff", "label": 0}
{"text": "I love interspecie   friendships", "label": 0}
{"text": "Looks like the head of a Falinks jumping on the mushrooms from the Mushroom Mix-Up minigame in Mario Party 1.", "label": 0}
{"text": "is this state line lookout?", "label": 0}
{"text": "Covfefe", "label": 0}
{"text": "[https://www.youtube.com/watch?v=wh4aWZRtTwU&ab\\_channel=TechnologyConnections](https://www.youtube.com/watch?v=wh4aWZRtTwU&ab_channel=TechnologyConnections)", "label": 0}
{"text": "not a good justification to kill", "label": 0}
{"text": "Of course, I completely agree. But to absolutely dehumanize someone for holding opposite views though? That’s exactly what often goes on here. Just one look at r/popular is all you need. We can talk about freedom, but when a platform manipulates their users’ viewpoints to only align with their own beliefs, does that equally represent both parties? It’s very obviously skewed, and gives us a false impression against what they oppose. \n\nI don’t care about politics either, but all the “fun” subs have been taken over by this propaganda. Neither side are anywhere near extreme as social media, especially Reddit when it comes to the Republicans, makes it out to be. I know tons of Harris supporters and Trump supporters alike that are completely normal people, they don’t make it their entire personality", "label": 0}
{"text": "melbourne shuffle", "label": 0}
{"text": "This is dope", "label": 0}
{"text": "I remember it as a Melbourne shuffle, and based on that 2006 pixel count I think this is it for sure.", "label": 0}
{"text": "Cotton Eye Joe", "label": 0}
{"text": "Hey is that Kamala in the background?", "label": 0}
{"text": "Hardstyle shuffle or Melbourne shuffle. Look up Headhunterz - Scantraxx Roots - heard this over a hot mic while surfing in cs source while I was in middle school. Hardstyle music from 2007-2012 has a special place in my heart \n\nShuffle with the phat pants and the hardstyle edm music was interesting. Core memory unlocked for me from this post lol", "label": 0}
{"text": "You just know the downstairs neighbor love this kid.", "label": 0}
{"text": "/r/perfectloops/", "label": 0}
{"text": "Nah it’s all original. It’s a game I’ve been working on. The thing that looks like Geometry dash is a minigame inspired by it, but is actually running as an NES game. Ported an open source NES emulator to unreal engine to run it within the game. Working on a side scroller demake too that will be playable in game. \n\nhttps://store.steampowered.com/app/2512660/VectorBall/", "label": 0}
{"text": "Looks like a skid to me", "label": 0}
{"text": "The game is called VectorBall on Steam.\n\n[https://store.steampowered.com/app/2512660/VectorBall/](https://store.steampowered.com/app/2512660/VectorBall/)\n\nIt’s philosophical, trippy game about a digital intelligence. Plays like trippy Halo 3 but with ball physics, teleportation balls, and unique challenges.\n\nFull single player, co-op and PVP\n\nSingle player is kind of like Risk of Rain 2, open world procudral, but instead of one goal you have to go around the map completing different things to unlock the final boss fight. Each level is based on an Ancient civilization.\n\nPVP is going for Halo 3 fun sandbox, with lots of gamemodes, CTF, King of the Hill, vehicles to be added soon (Da Vinci's flying machine in lieu of the banshee from Halo 3)\n\nThe story explores themes like consciousness, free will, and the nature of reality. Through the evolving relationship between the player and the digital intelligence Vector, it delves into questions about creation, control, and the blurred lines between creator and creation. In the game, Vector has been trained by NerveLabs on the works of ancient philosophers, so he speaks in that vein. There’s a lot more that happens to drive the narrative that I won’t get into yet", "label": 0}
{"text": "Haha I was still under 18 then I just listened to it in my early teen years. I’m from the US also and always wanted to go to qlimax or q dance festivals or anything scantraxx", "label": 0}
{"text": "Man, he should stretch before he exercises.  That’s painful to watch again and again.", "label": 0}
{"text": "There's way less than 2006 pixels in that gif", "label": 0}
{"text": "I already did. You ignored my reply. I just told you that.", "label": 0}
{"text": "This is a mindfuck and I have no clue what is going on, not a bad thing but unsure what the gameplay loop is.", "label": 0}
{"text": "Where do you see geometry dash? I see it nowhere", "label": 0}
{"text": "I can't make heads or tails of what's going on other than it looks like it's a VR game whose developer decided to intentionally violate [the \"Covert Action Rule\"](https://en.wikipedia.org/wiki/Sid_Meier%27s_Covert_Action#Development) as hard as possible. I definitely don't see a story being told.\n\nIf \"trippy\" is a genre, that might make sense, for all I know. But I don't partake, so I can't tell where gameplay ends and whatever the heck else is going on starts. Assuming the hands represent the player, they don't seem to do very much, so I don't see an interactive game. The 2D scroller looks like it was cut in by mistake.", "label": 0}
{"text": "Tectonic looks like people having cerebral palsy dancing, how can’t you make the difference", "label": 0}
{"text": "It’s not a VR game, though VR support is planned. The gif is mostly just footage to show off visuals more than gameplay, mostly wanted to show something a bit trippy and random on the gifs reddit. In practice, it is a singular game with a story and defined singular gameplay. (with the 2D scroller just being an unlockable minigame)", "label": 0}
{"text": "I don't know about the game itself. But, to use your own words, the gif is a bit too *crazy*. Its  just hard to understand whats going on, and hard to follow the gif itself. At some point I thought it had looped and realized it had not yet. \n\nI know its easier said than done, but maybe you need a different edit (longer clips of different gamplay types, or maybe shorter ones with different types of cuts) that would allow for a better flow. Again, I'm sure this is hard work, so well done all in all, and good luck in making it better !", "label": 0}
{"text": "This gif definitely is more about showing crazy visuals than the actual gameplay haha. Thanks for the feedback though. I figured on the GIF subreddit people wouldn’t want to see just gameplay so I wanted to just put together a trippy visual", "label": 0}
{"text": "The hardstyle shuffle. The Melbourne shuffle. Lets goo baby", "label": 0}
{"text": "looks like the  More Sugar! dance", "label": 0}
{"text": "Shuffle\n\nAh, the memories of the colorful floggers and how they fought with the emo people....", "label": 0}
{"text": "Hardstyle", "label": 0}
{"text": "“STILL HARVESTING OSTRICH EGGS THE OLD WAY? *OH NO!!!*”", "label": 0}
{"text": "Do you have this on a YouTube channel?", "label": 0}
{"text": "Yes! Haven’t uploaded much gameplay yet but will do soon\nhttps://youtu.be/wStfxZEDoi0?si=yl6pbW-oOfSL331q", "label": 0}
{"text": "Thanks! In the meantime, I just happened to click on a reddit post with [this](https://www.youtube.com/watch?v=Xjy_HSUujaw).", "label": 0}
{"text": "[All the leaves are brown, and the sky is grey](https://youtu.be/qhZULM69DIw?t=8)!", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "Yeah it is a game! This gif is super short and only shows a second or so of gameplay lol, mostly just trippy visuals from it. \n\nhttps://store.steampowered.com/app/2512660/VectorBall/", "label": 0}
{"text": "That's a great looping effect.", "label": 0}
{"text": "Years 😬. Maybe try something else. This is like .00000000000000000001 seconds of AI effort.", "label": 0}
{"text": "This is not AI generated… it’s a video game \n\nhttps://store.steampowered.com/app/2512660/VectorBall/", "label": 0}
{"text": "Go frame by frame, you’ll find it", "label": 0}
{"text": "Pfft Sid Meier clearly never played ActRaiser\n\nI do agree that this little showcase lacks direction and clarity tho", "label": 0}
{"text": "looks a bit liky [hyper deamon](https://store.steampowered.com/app/1743850/HYPER_DEMON/) so i guess you are fine on the crazyness level", "label": 0}
{"text": "You will never make anything this cool. He may be replaced by AI in the competitive landscape, as will we all, if we haven't been already. Meanwhile, you were never even in the competition. 💀", "label": 0}
{"text": "Do srssdrysr readstsrstrsssttsTsssrssyryyssry are going s day ever ever ever you want etsà", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "Ah, so fitting for this time of year!", "label": 0}
{"text": "Doing that in India of all places is legit suicidal", "label": 0}
{"text": "It's the flag of Pakistan on his keyboard \n\nr/vexology is just waking up", "label": 0}
{"text": "Can he see the cyclist on the road in front of him?", "label": 0}
{"text": "People - try to burn all their luck whenever they can.\n\nAlso people - asking where is their luck when something bad happen.", "label": 0}
{"text": "God, I love the detail you put into these! The Interstellar 5555 aliens are such a good reference. I laughed at the Archon trying to sneak a peek at the hydralisk's laptop too.", "label": 0}
{"text": "I love how encouraging everyone is to Marvin.", "label": 0}
{"text": "No way hysralisk is bigger than archon haha. Otherwise was great call out", "label": 0}
{"text": "Love it!", "label": 0}
{"text": "![gif](giphy|T3C0yozsVHhOEucpTk|downsized)", "label": 0}
{"text": "This is incredible, thanks for sharing", "label": 0}
{"text": "Absolute madlad.  Keep it up.", "label": 0}
{"text": "Good video. But each time I clicked on the link. I got a message to \"login\" to reddit. Even tho I was already logged in. I use Red reader btw l.", "label": 0}
{"text": "Pink Floyd is a cool band, but I wouldn't say I'm a fan. I only like a few of their songs.  Another Brick in the Wall is one of them. I really liked their video for this song (not animated one). I thought it was a very unusual idea to make an automatic track with children and a meat grinder, and I decided to make a whole block with the same theme.", "label": 0}
{"text": "Where’s Dalek", "label": 0}
{"text": "I am so humbled every time I see one of these.", "label": 0}
{"text": "Man- spent like 30 minutes (10 minutes on the change my mind stand and didn't see it all) but it reminded me of so much.", "label": 0}
{"text": "Habbo Hotel vibes. Looks awesome.", "label": 0}
{"text": "he is from Men In Black 2 -> [https://floor796.com/data/misc/video/mib-post-office.mp4](https://floor796.com/data/misc/video/mib-post-office.mp4)\n\nBtw, in the project you can click on the characters to get a hint who they are and a link to the source", "label": 0}
{"text": "Can I download this somewhere?", "label": 0}
{"text": "Had no idea! Hot damn! Real cool stuff you got here!", "label": 0}
{"text": "u/savevideo", "label": 0}
{"text": "We are from France!", "label": 0}
{"text": "u/savevideo", "label": 0}
{"text": "*THE ONLY GOOD BUG IS A DEAD BUG!*", "label": 0}
{"text": "I wish Edgar had some sugar-in-water in his hand, but absolutely love getting his face tightened for the photo!", "label": 0}
{"text": "Probably because most of the time you see them, some douchebag is riding on their back.", "label": 0}
{"text": "proud of myself for how many of these I knew, I love aliens man", "label": 0}
{"text": "Something is erupting from your cocoa.", "label": 0}
{"text": "Facebook ass post", "label": 0}
{"text": "Anyone know the technical reasons why you can zoom a pic on a phone but not a gif? Because this is one I’d love to zoom.", "label": 0}
{"text": "Thanks. There are 48 blocks (rooms) at the moment. But my main goal is to create 100 blocks. For the next 5 years I will draw the remaining 52 blocks and post the results here every month. That is, the project will be twice as big in 5 years.", "label": 0}
{"text": "They are part of the previous block that I drew 2 months ago: [https://www.reddit.com/r/gifs/comments/1f4qdt9/new\\_block\\_47\\_migration\\_department\\_part\\_1\\_in/](https://www.reddit.com/r/gifs/comments/1f4qdt9/new_block_47_migration_department_part_1_in/)", "label": 0}
{"text": "This actually JUST HAPPENED to me and I definitely screamed like an 8 year old girl and ran like Usain bolt. Underwear is good though 🤣 they have always freaked me out and I didn't know some could fly until this traumatic day lol", "label": 0}
{"text": "I feel you, I missed out on the early 2000s and 90s rave scene in the Pacific Northwest. Seattle always had a great underground scene, though many times it was sketchy (from the people to the makeshift venues and actual venues). \n\nI had a blast for a few years until I realized that it's not very sustainable to go to shows and party twice a week.", "label": 0}
{"text": "I'm sorry but a tarantula is not a spider to be afraid of. They are cuddly. It's the freaking big black spiders that can get under your shirt in half a second that you need to be afraid of. Yes I'm deathly afraid of spiders. My only fear", "label": 0}
{"text": "another man-child", "label": 0}
{"text": "I’m going to make all you my slaves!", "label": 0}
{"text": "Poor Howard Dean", "label": 0}
{"text": "I've seen a few of these before but didn't realize the insane scale of this project until now.  Impressive work.", "label": 0}
{"text": "Say Elon you look like you want to get in to the ring with Zuckerberg now.", "label": 0}
{"text": "Even if you put aside all the politics he is still so fucking cringe.", "label": 0}
{"text": "you know I can appreciate this… far away and watching on a screen", "label": 0}
{"text": "…I think you’re on to something there", "label": 0}
{"text": "He can't even do a livestream", "label": 0}
{"text": "Skippity Dipshit", "label": 0}
{"text": "It’s like he’s making up for that time he went to Dave Chappelle‘s show and got completely booed off the stage. He only does this sort of shit in an echo chamber but as soon as he leaves that, the general population boo the absolute fuck outta him and he runs off.", "label": 0}
{"text": "They're such a weird family. His father had a baby with his stepdaughter. Elon's had what a dozen kids with 5 different women? And half the kids and baby mamas won't talking to him anymore. His mother's said some batshit comments.", "label": 0}
{"text": "Reminds me of Dwight Schrute...", "label": 0}
{"text": "Or anyone really.", "label": 0}
{"text": "![gif](giphy|XBEoaajXTXaALzawSn)", "label": 0}
{"text": "This guy is so desperate to be loved.", "label": 0}
{"text": "Elon is just excited to feel like he has friends", "label": 0}
{"text": "what a douche.", "label": 0}
{"text": "What a dipshit. DOJ needs to go after him on all criminal charges they can get.", "label": 0}
{"text": "Do that was Starlink over Manhattan? Ok. Scary.", "label": 0}
{"text": "My 41 year old brother completely stans this man. It's so unbearably embarassing I can barely talk to him anymore.", "label": 0}
{"text": "Didn't Leon get his start while he was an illegal?", "label": 0}
{"text": "Oh absolutely.", "label": 0}
{"text": "He's the best, leftists are supposed to be tolerant but don't give a fuck about your autism if you think the wrong way.\n\nInstead they'll mock, bully, and engage in bigotry.", "label": 0}
{"text": "Who is he even trying to appeal to? 14-year olds?", "label": 0}
{"text": "Also note that he keeps dressing in all dark colors because he wants to be Dark MAGA.", "label": 0}
{"text": "What a small, small, insecure little baby.", "label": 0}
{"text": "Literally none of that precludes an asshat from being a manchild", "label": 0}
{"text": "democrat news igloo", "label": 0}
{"text": "I love watching redditors talk shit about people 100 times more successful than them lmao", "label": 0}
{"text": "Cringe to us maybe, but plenty of people are eating this up. Make sure you have a plan to either enter the top 10% income bracket or leave the country as there are hard times ahead no matter who wins the election.", "label": 0}
{"text": "Good idea. PSA, get your boosters. Thanks, netizen.", "label": 0}
{"text": "Poor Elon", "label": 0}
{"text": "Dude looks like he's jerking off two giant elephant dongs", "label": 0}
{"text": "Dwight is a lot cooler than whatever this is.", "label": 0}
{"text": "It looks like he is celebrating squeezing out a shart.", "label": 0}
{"text": "is this CGI?", "label": 0}
{"text": "That doesn't actually work as an insult if you understand how vaccines work.", "label": 0}
{"text": "![gif](giphy|3o6Ztg2MgUkcXyCgtG|downsized)", "label": 0}
{"text": "It's easy for any idiot to make a great sandwich when their private chef puts all the best ingredients on the plate for them.", "label": 0}
{"text": "and don't forget to mask up!", "label": 0}
{"text": "Some people’s idea of a man", "label": 0}
{"text": "Money given to him by his daddy. Money he used to buy a company. Big fucking deal. He's a fascist, white authoritarian, narcissist edgelord douchebag. I'm ten times the human Phony Stark is. So are you, even though you like him for some reason.", "label": 0}
{"text": "Really, a quip about a \"COVID booster\" is the best you've got?", "label": 0}
{"text": "The left rejected him. Not saying this was a mistake (yet 😬) but it seems only natural he’d start catering to the right.", "label": 0}
{"text": "He didn't do any of that. He just paid for it while others did the real work.", "label": 0}
{"text": "This is just his plan to stop them from keying Teslas", "label": 0}
{"text": "I never do. Respirators, not surgicals.", "label": 0}
{"text": "![gif](giphy|XyLIyvq8kYIPwO4CEX)", "label": 0}
{"text": "How can you be so rich but so desperate", "label": 0}
{"text": "Was the Thailand cave kid pedophile accusation he made to the rescuers more or less the turning point? Trying to think back to when he was last beloved by nerdbros but otherwise annoyed by and not yet hated by others.", "label": 0}
{"text": "Buys their reapect. Ftfy", "label": 0}
{"text": "yep, creating a PROFITABLE space program AND auto company in america is just like making sandwiches. you people are hilarious", "label": 0}
{"text": "He went to a private school with handpicked classmates. His dad was an oligarch. Sadly, I don't think he was bullied. I think he was given everything he ever wanted his entire life.", "label": 0}
{"text": "The Elon hate here is real, holy shit lol", "label": 0}
{"text": "MAGA Dark™ :  Half The MAGA, Twice The Cringe.", "label": 0}
{"text": "Yep", "label": 0}
{"text": "He's tanked one successful brand with his own actions, now to tank a second. Seriously, the demographic that buys electric cars leans moderate/democratic, he's turning Tesla into something untouchable by that group by making driving Teslas a political statement.", "label": 0}
{"text": "Does that include talking shit about other redditors you have zero knowledge of about their lives?", "label": 0}
{"text": "Douche chills", "label": 0}
{"text": "Dude's got Asperger's but because he's team Trump everyone's okay shitting all over how awkward he is lmao\n\nLove that the crowd of \"tolerance\" is completely intolerant to anyone that isn't lock step with them.", "label": 0}
{"text": "![gif](giphy|3o6oztnIai0LPvdcNa)", "label": 0}
{"text": "What a dweeb. Couldn’t make friends on his own, so he had to pay for them.", "label": 0}
{"text": "He is a billionaire! He doesn’t need validation!", "label": 0}
{"text": "What a dipshit", "label": 0}
{"text": "Stop talking about it and it won’t.", "label": 0}
{"text": "Yeah, well, he’s thinking about getting robot legs. It’s a risky procedure but worth it!", "label": 0}
{"text": "He still overpaid $20 billion for it at the time and lost roughly $10 billion more on it since. \n\nPopular does not mean good, in any way.", "label": 0}
{"text": "Uh oh! Mask bad. Oogie Boogie! Masks! They're giving the Libs brane damage! HAHA supid libs! I know better! I've had covid 6 times, and I'm fine. Strong brane. Just like Donnel Trunp", "label": 0}
{"text": "You think this is a slam dunk and that’s really funny lol", "label": 0}
{"text": "I love watching simps deep throat trust find billionaires who will never know you exist and got all their wealth from their daddys lmao", "label": 0}
{"text": "Is there a typo here or is there some new fucking word out already?", "label": 0}
{"text": "They give him the cheers he wishes he got when he went on stage with Dave Chappelle.", "label": 0}
{"text": "So glad I never bought into Elon Musk being some sort of real life Tony Stark. He’s such a turd eater.", "label": 0}
{"text": "Just a little bit special....", "label": 0}
{"text": "Yeah cuz he’s a fucking weirdo", "label": 0}
{"text": "At least he can't be elected president", "label": 0}
{"text": "Is this really only about tax breaks or has he crossed some line with Putin and he’s afraid of going to prison if he does not help Trump win? \n\nThey clearly despise each other, it’s all for mutual benefit.", "label": 0}
{"text": "This is so much funnier silent.", "label": 0}
{"text": "Or his father", "label": 0}
{"text": "No, they’re warning others so they can give you a wide berth. Public service really.", "label": 0}
{"text": "He can't run for president tho, he wasn't born in the US", "label": 0}
{"text": "Elon found adderall", "label": 0}
{"text": "I love how you post this often thinking it's a dunk.\n\nIn reality, it's just your way of coping with being a bigot.", "label": 0}
{"text": "fuck ya. can't wait for trump to win and reddit to meltdown", "label": 0}
{"text": "MSG really? Should've gotten Uncle Roger instead", "label": 0}
{"text": "Well he is proving to everyone that money isn’t buying himself happiness.", "label": 0}
{"text": "It’s more than money.  It’s about power.  Power to control ALL of low orbit satellites w Starlink and power to remove all restrictions on his companies going forward.", "label": 0}
{"text": "Most exercise he had all year.", "label": 0}
{"text": "Who did you vote for in your primary?", "label": 0}
{"text": "Look at back at your life and consider how little you’ve actually accomplished. So many more men your age have done so much more, and here you are unvaccinated and unsuccessful. Clinging to the vestige of hope that somehow the success of two billionaire narcissists will rub off on you.", "label": 0}
{"text": "Hi I'm autistic. fuck elon musk, donald trump, and fuck you.", "label": 0}
{"text": "mmm, and \"interesting cocktail of drugs\" is pure genius", "label": 0}
{"text": "And he'll get pardoned for all the illegal shit he's done and will do.", "label": 0}
{"text": "Or his parents...", "label": 0}
{"text": "J.P.: Are you afraid of it?\n\nKane: No I just don't like techno.\n\nJ.P.: You would if you had robot ears.", "label": 0}
{"text": "Where did all of the reasonable people go? It’s like all we have is this shit.", "label": 0}
{"text": "Christ i had forgotten about that.  People were trapped and the rescuers and everyone were working really hard to come up with and execute a solution. \n\nThen he just had to swoop in and make it all about himself and his \"genius\" and then when he didn't get his way he behaved like a spoiled brat spewing insults.\n\nYeah, i had my suspicions before, but that just cemented my impression that he's a narcissistic bonehead.", "label": 0}
{"text": "You can see it on his face every time he does ANYTHING. He gets the little kid glancing around for approval eyes and grin", "label": 0}
{"text": "Was that a yawn?", "label": 0}
{"text": "Men will spearhead a fascist takeover of the United States before they go to therapy", "label": 0}
{"text": "Yes, I am absolutely certain that's what happened. \n\nBack around 2012, Elon was decisively a liberal hero. He was working on rockets, brought electric cars to the mainstream, and he was memeing on twitter with lots of love. \n\nThe thing about Elon though, is that he's a self described autist with aspbergers and he needs a TON of validation from people. \n\nThe thing about the left is the left is very quick to attack people if they aren't absolute paragons of left-wing ideals. \n\nWhat I suspect happened is that Elon's eldest trans daughter rejected him, likely because of his complete absence as a father; this has caused him to hold resentment against the left. She has made taken a stance against rampant capitalism and Elon, is essentially that. A mega billionaire. He has made numerous attempts to win her back including at one point selling all of his homes, trying to distance himself from the idea of a billionaire galavanting on private jets with properties everywhere. \n\nUnfortunately for Elon, I suspect that because he's kinda autistic so he does not know how to reconnect with his daughter, and this rift has just driven him to become resentful of the left, and found acceptance on the right.", "label": 0}
{"text": "Just because you are a character, doesn’t mean you have it", "label": 0}
{"text": "CNN is owned by conservatives too now. These polls don’t mean shit. Just go out and vote. That’s how you make the difference", "label": 0}
{"text": "Now This is how you milk giraffe cocks!!!", "label": 0}
{"text": "That's not quite how masks work, but I appreciate your caution. One respirator is more than enough.", "label": 0}
{"text": "When you're trying to do way too much weight for your lat pull.", "label": 0}
{"text": "Yeah, another fail for him, doesn't hurt right?", "label": 0}
{"text": "EDS is the new TDS.", "label": 0}
{"text": "![gif](giphy|PPi5c8l8WDY7if1L8z|downsized)", "label": 0}
{"text": "Reddit hates people being themselves", "label": 0}
{"text": "Isn't it wild tgat one politician like 15 years ago or something had his career torpedoed from ay \"yyyYYeaAHh\" yet Elon does this shit and no one seems to even blink, worse they cheer it.", "label": 0}
{"text": "He could have benefited from being stuffed into a locker a few times.", "label": 0}
{"text": "Getting \"Show Me the Money\" vibes. He's going all out for a payback from Trump", "label": 0}
{"text": "There are more\n\n![gif](giphy|867ua3qIjpYnL2Tuuu)", "label": 0}
{"text": "That’s the bonus for sure. The real meat is his fraud and Russian collusion being swept away if this works.", "label": 0}
{"text": "Something something live long enough to see yourself become the villain", "label": 0}
{"text": "True, he can try to be Kingmaker though.", "label": 0}
{"text": "Elon Musk’s net worth is $275 billion USD. Do you really think he cares about the money? He wrote a check for twitter. He could shut it down and take it as a loss and still be one of the richest men in the world.", "label": 0}
{"text": "He’s not even that smart. All his work at what became PayPal was junk quality code. He dropped out of college before completing his degree. He’s a pile of money in human clothes. That’s literally his only skill set, outside of lying constantly.", "label": 0}
{"text": "It definitely cleared your dogshit take that’s for sure lmao keep on taking the L’s", "label": 0}
{"text": "Gods I hope we retain our sanity.", "label": 0}
{"text": "The lengths some people go to be liked and accepted.", "label": 0}
{"text": "And my axe.", "label": 0}
{"text": "Is he a choo choo train now too?", "label": 0}
{"text": "that was the first worldwide one that I remember as well", "label": 0}
{"text": "A Billionaire with Asperger’s should be able to buy a clue, or at least a PR Team to advise him how to not act like a jerk/douche/child.", "label": 0}
{"text": "GOAT", "label": 0}
{"text": "+ tism", "label": 0}
{"text": "He does love the “divorced dad starter set” of clothing.", "label": 0}
{"text": "Which is wild considering how much of his wealth is tied up in Tesla, which produces electric cars...one of the main focal point for dems' Green New Deal.", "label": 0}
{"text": "It's because if Trump wins, he will give SpaceX and Tesla whatever they want; including no unionizing, no workers rights, massive tax breaks, etc etc.\n\nOfcourse Elon is supporting whomever offers him the most bang for his buck.", "label": 0}
{"text": "An illegal immigrant at Trump hate rally?", "label": 0}
{"text": "Whether its intentional or accidental, if Elon can get \"Drill Baby Drill\" dipshit MAGA chodes to trade in their gas guzzling F-150s for his poorly built electric vehicles, I'll forgive all other infractions.  \n\nWorth it.", "label": 0}
{"text": "maybe he really is autistic", "label": 0}
{"text": "You've been fed well.\n\n![gif](giphy|l41m6xDXyuUq9FP0I|downsized)", "label": 0}
{"text": "Elon doesn't care about business atp, he just really desperately wants people to like him. Being a right wing grifter is the easy solution.", "label": 0}
{"text": "Pretty much, people say his personality changed but it’s really still the same power seeking mentality that rubbed people at PayPal the wrong way. But what can ya do when the most disruptive person in the room is bankrolling things. \n\nIf the overall feedback about what work life balance he offers in his companies is true, I’d hate to see him with more power.", "label": 0}
{"text": "Im sorry you mindlessly believe the lies they fed you.", "label": 0}
{"text": "How many of trump supporters have spent tons of calories going out of their way to hate Tesla's electric cars. Now they love him?", "label": 0}
{"text": "I actually believe they've already made a deal with Trump that if elected he has \" health issues\" and then steps down. The agreement is Vance pardons him and Theil bails him out financially", "label": 0}
{"text": "Can we not", "label": 0}
{"text": "Well that's what got Howard Dean cancelled", "label": 0}
{"text": "Is there any other kind?", "label": 0}
{"text": "How does this guy move so awkwardly? He's like a character getting excited in a video game. Are we sure he's real?", "label": 0}
{"text": "I think so. Prior to that he was just this innovative tech bro who did cool shit, but we didn't know much about his personality. \n\nYou know what they say; never meet your heroes...", "label": 0}
{"text": "I am tired of this man.", "label": 0}
{"text": "Self preservation and just being a genuinely terrible person.", "label": 0}
{"text": "americas gods", "label": 0}
{"text": "As a fellow aspie, he represents us as much as Caitlyn Jenner represents trans people!", "label": 0}
{"text": "I’m confident Trump will win the election 😅", "label": 0}
{"text": "Because he should be going to jail for defrauding the US federal government for billions of dollars. And share holders for billions more.", "label": 0}
{"text": "Lmaoo that cannot be real, holy shit what", "label": 0}
{"text": "Nazi party? You know there are Jewish, black, and Indian speakers at this rally, right? Good to know you're brainwashed by far left propaganda.", "label": 0}
{"text": "What a dipshit!", "label": 0}
{"text": "And my upvote", "label": 0}
{"text": "Slam dunk? I'm just saying the truth. You can be a pussy about it but it doesn't make it not true.", "label": 0}
{"text": "Dude has Asperger's, what happened to not making fun of people with disabilities", "label": 0}
{"text": "I never said it was good. But it definitely did catch on.", "label": 0}
{"text": "“As we danced at our wedding reception, Elon told me, ‘I am the alpha in this relationship,’” Justine, his first wife, revealed in a 2010 column for Marie Claire.\n\nReported a lot places but here’s the first one from Google: https://www.businessinsider.com/elon-musk-justine-alpha-relationship-wedding-wife-mother-queens-isaacson-2023-9", "label": 0}
{"text": "The biggest penalties for that are not getting a visa / green card / etc. when you next apply. Bit too late to apply those", "label": 0}
{"text": "He went pooper saiyan", "label": 0}
{"text": "You're right, how could anyone think that the party which supports electing a fascist who has attempted to overthrow democracy, stated that he would use his political power to silence all of his enemies and praises dictators be anything like the Nazi Party?", "label": 0}
{"text": "the weirdest guy on this planet", "label": 0}
{"text": "No. Now you're incorrect. Do better wirh your PSAs.", "label": 0}
{"text": "I used to think rapists and criminals couldn't be elected president either, but boy was I wrong about that in 2016.", "label": 0}
{"text": "Let me take a page out of your guys' book. \"Who are you to tell him what to do about his mental issues? If you don't have Asperger's, you don't know what it's like, and you have no right to tell a mentally impaired man what he should or shouldn't do with his own life\".\n\nIf you don't like him, why do you guys spend your entire day freaking out about him all the time? Seems like a total waste of energy to me.", "label": 0}
{"text": "He's old and just wants to golf", "label": 0}
{"text": "Still less cringe than Tim Walz. These 2 should start some weirdo ballet.", "label": 0}
{"text": "Do you know what a kapo is? And no dear, I’m a moderate lefty who knew your big hero was hatemongering filth from his birtherism on.", "label": 0}
{"text": "![gif](giphy|eqOvMKP2G5y24)", "label": 0}
{"text": "He's doing this because he knows someone is going to edit him to look cool...", "label": 0}
{"text": "You wouldn’t be saying that if he was speaking on behalf of Kamala lol", "label": 0}
{"text": "And maybe it was an offer he couldn't refuse.", "label": 0}
{"text": "Well Israel is literally actively committing genocide so, doesn’t really say much there. As for the black and Indian speakers, you could count them on one hand, so not exactly relevant. MAGA is the new nazi party", "label": 0}
{"text": "Whatever he talks with Putin about probably", "label": 0}
{"text": "Lmao. No", "label": 0}
{"text": "Specifically his transgender daughter that completely disowned him. Severed all ties with him and his money and changed her name. It pissed him off, so he turned to the right hard core.", "label": 0}
{"text": "We disavowed him", "label": 0}
{"text": "I watched a little bit of him speaking at this shit, and yeah, I do actually think he's there truly because he feels validated in some weird way. This guy is so fucking creepy.", "label": 0}
{"text": "perfectly put!! bravo!", "label": 0}
{"text": "He’s smart enough to be a Billionaire, for whatever that’s worth…  So, he can learn to be not such a terrible human being.", "label": 0}
{"text": "Just a weird dipshit", "label": 0}
{"text": "Just looks like a guy having fun ", "label": 0}
{"text": "Always trying to make an X in some way with them orangutan limbs", "label": 0}
{"text": "Big Dwight Energy", "label": 0}
{"text": "I’m not salty just adding the context that list needed. \n\nYou play CSGO, would you play with the left side of your screen off or with the crosshairs turned off? No because you need to context to appreciate the full picture.\n\nWhich one on my list is incorrect?", "label": 0}
{"text": "Leftists conveniently don't care since he supports Trump.", "label": 0}
{"text": "But bad judgement it seems.", "label": 0}
{"text": "Reddit is so mad 😡 lol", "label": 0}
{"text": "God he’s such a dipshit", "label": 0}
{"text": "It's kinda sad.", "label": 0}
{"text": "His villain story really started when Buzz made him cry about 7 kilos of ketamine ago", "label": 0}
{"text": "Let's all show them what we think of them on Election Day.", "label": 0}
{"text": "You clearly know nothing about autism. He's a very intelligent man who is capable of understanding that abandoning your kids means they probably won't like you. Jesus christ", "label": 0}
{"text": "https://i.redd.it/mgksj71b6exd1.gif", "label": 0}
{"text": "His villain story really started when Buzz made him cry, about 7 kilos of ketamine ago", "label": 0}
{"text": "Bro did a double bicep flex and doesn't even have a single bicep", "label": 0}
{"text": "Or love", "label": 0}
{"text": "Elon is just trying to make a friend.", "label": 0}
{"text": "If you look at the background it seams to me that no one there really cares either.", "label": 0}
{"text": "I can't wait till election season is over", "label": 0}
{"text": "It’s really breathtaking how many of these guys simply want to be cheered by a crowd.  It’s a drug for them.", "label": 0}
{"text": "Hahaha. Imagine believing this. Dude exists to line his pockets and everyone else can get fucked.", "label": 0}
{"text": "I think you're all right. \n\n* Needing validation: His past actions and wild shift in \"values\" basically indicate he's a snowflake sad boi trying desperately to be liked by someone/everyone.\n* Power: He is clearly a bit of a narcissist who craves control. Pushing to be the only Electric car and Space exploration companies. Getting salty when people out compete him, making grandiose claims that are completely unrealistic, lashing out when criticised.\n* Money: Well... he's a billionaire who was born into wealth and failed upwards, so he's a classic \"fuck you I got mine\". Plus, find me a billionaire who doesn't care more about making more money than anything else.", "label": 0}
{"text": "Phoney Stark", "label": 0}
{"text": "this post and most of the comments. top shelf cringe. I thought Democrats touted diversity. but when an autistic man achieves something amazing, you take every chance to shit on his every movement.", "label": 0}
{"text": "It's not projection, it's reality. You suffer from a classic case of TDS. Get professional help.", "label": 0}
{"text": "Good to know. \n\nFuck Elon Musk.", "label": 0}
{"text": "He didn't become the richest man in the world by saving people's money.  He's going to cut vital services so he can enrich himself.", "label": 0}
{"text": "You responded exactly as a conservative would. Any normal person would make the same assumption.\n\nI don't care about immigration issues, but the hypocrisy is ridiculous.", "label": 0}
{"text": "Dude I love your art. Love the dithering, love the content.", "label": 0}
{"text": "Nope… This is an assessment of him as an individual.", "label": 0}
{"text": "How tolerate of you.", "label": 0}
{"text": "His ego is just too big to let it go", "label": 0}
{"text": "It would still be appropriate to call you out for beating the shit out of someone 20 years ago.\n\nElon Musk has lots of things to call out as crimes, I just picked the lowest hanging fruit", "label": 0}
{"text": "He is cringe yes, but if he was supporting her instead, everyone on reddit would have downvoted every person who called him cringe lol", "label": 0}
{"text": "Dipshit", "label": 0}
{"text": "Learn how party nomination process works. ", "label": 0}
{"text": "Thank you, and you also!", "label": 0}
{"text": "Is this what you think you look like when you do that, bro?\n\n![gif](giphy|uvUe978KKt05pxGZjz)", "label": 0}
{"text": "Is it a thermo transfer? Such beautiful work!", "label": 0}
{"text": "Brilliance? Not sure he's ever done anything special tbh", "label": 0}
{"text": "Need alert", "label": 0}
{"text": "LOL. case in point.", "label": 0}
{"text": "The question was how does he move so awkwardly. But he certainly is living in your head lol", "label": 0}
{"text": "Aw this would be funny if it wasn’t true.", "label": 0}
{"text": "Not sure if you’re joking but he actually does have autism: https://www.newsweek.com/asperger-syndrome-elon-musk-autism-spectrum-disorder-1590043", "label": 0}
{"text": "Thank you! Yep toner foiling", "label": 0}
{"text": "Aw. I’m not autistic but I get the sentiment. I don’t think it’s right to make fun of Elon for those qualities but he’s such an asshole people will do it anyway.", "label": 0}
{"text": "I can’t tell you how much this comment gives me the giggles.", "label": 0}
{"text": "That's a very fair comment argument and I apologize for my previous attitude.", "label": 0}
{"text": "If you do this with a red light it’s really effective at seeing lots of animals. Always surprised at just how many mice I see walking through the woods at night.", "label": 0}
{"text": "Haha. Well Donald Trump has been Donald Trump since we saw him on Oprah in the 90s. He still believe in the same things now as he used to back them. I dont see anything new on him, but republican supprters (including the media outlets and the celeb endorsers) seem to nitpick on juat about anything that comes out or is said abt and by Trump alone. \n\nWe dont really know much abt Kamala other than she got this seat for free without much struggles. \nThis hate feels misaligned.", "label": 0}
{"text": ".....what", "label": 0}
{"text": "![gif](giphy|StLZPEcOi4vJ7m5zjF)", "label": 0}
{"text": "Assism", "label": 0}
{"text": "Pats fans, skipping around like dipshits.", "label": 0}
{"text": "Probably not.", "label": 0}
{"text": "I really don't care do u?", "label": 0}
{"text": "Oh, no it is definitely projection. You know nothing about mental health, and you also don't value it, stop pretending.", "label": 0}
{"text": "I'm not a fan of Elon Musk or a Republican supporter. Also, not American but I think it pretty obvious he's got a very high IQ along with being weird... And now corrupted by wealth and power.", "label": 0}
{"text": "Charming", "label": 0}
{"text": "The only issue is that any single frame that makes an X, also contains a very stupid mid-jump Elmo face. There’s no product of this that doesn’t look embarrassing", "label": 0}
{"text": "You understand I'm talking about how he's socially awkward, right? And that's what yall are making fun of him for? His social awkwardness has nothing to do with predicting his level of success. Just because someone's a billionaire doesn't mean that somehow they automatically don't have the social awkwardness of someone with Asperger's.\n\nI feel like you're just making a really poor excuse to be like \"since he's a billionaire, his Asperger's doesn't matter and shouldn't exist anymore\".", "label": 0}
{"text": "Yee-haw", "label": 0}
{"text": "He's trying to make up several different excuses for why we apparently care about the obvious fact that his awkwardness in public is because of Asperger's. He's just saying that he hates the guy, which has no relevance to what I/we are talking about, which is WHY he appears awkward. It has nothing to do with liking or disliking the guy, just an explanation for it. But he doesn't care, and just wanted to vent like a typical smoothbrain redditor.", "label": 0}
{"text": "i respect that you can think for yourself", "label": 0}
{"text": "Wasn't the point", "label": 0}
{"text": "Same 😂", "label": 0}
{"text": "Only one way to find out, hope to see ya in 2031", "label": 0}
{"text": "It's giving me Phyllis Diller", "label": 0}
{"text": "Amazing, Love the Archon and Hydra, and Marvin, oh and Alf, oh and you know what, just all of it :D\n\nfloor796 is one of my fav sites, often just sit looking through, discovering new characters, funny happenings, and such :D", "label": 0}
{"text": "The epitome of a man-child. Looks like a bloated corpse, acts like an 11yo discovering Dragon Ball", "label": 0}
{"text": "Dipshit", "label": 0}
{"text": "I can't stop watching it, he looks so fucking stupid when he grins. Reminds me of Ralph Wiggum from the Simpsons.", "label": 0}
{"text": "Is it mandatory to take some nose candy before going up that stage?", "label": 0}
{"text": "Is there anytime he's not on hard drugs?", "label": 0}
{"text": "Why he ruined his already weird reputation by entering in toxic politics 😞", "label": 0}
{"text": "Money can’t buy taste.", "label": 0}
{"text": "Etron Musk is a little bitch.", "label": 0}
{"text": "I'm suprised trump shares a stage with muskrat. He doesn't usually like too", "label": 0}
{"text": "Tim was right about this guy.", "label": 0}
{"text": "Are you sure he is acting? I would have bet he was an authentic case of dipshittery.", "label": 0}
{"text": "Nothing but cringe", "label": 0}
{"text": "He's just excited because this is the closest he has ever been to having friends", "label": 0}
{"text": "Weird dipshit dipshitting.", "label": 0}
{"text": "I feel like surely we could just get him onto the next fad right? Like does he know about anime? Maybe call of duty? We just need something to distract this deranged 12 year old boy for the next 10 years or so until he dies of something stupid, keep him out of the gears of power.", "label": 0}
{"text": "He actually moves and acts like a child. I don't know how else to describe it.  The jumping around, this awkwardness of movement, it looks like an 8 year old getting excited about a christmas present", "label": 0}
{"text": "I don’t get why Trump and his supporters also like Musk, when Musk is an immigrant…", "label": 0}
{"text": "Where even is Vance?", "label": 0}
{"text": "Ketamine is definitely hard lmao. It really should not be used outside a prescribed hospital setting.", "label": 0}
{"text": "Man those Trump rallys always produce the best memes lol", "label": 0}
{"text": "He smart enough to know how stupid people are who support trump so he’s dumbing himself down to there levels", "label": 0}
{"text": "What a weird thing to do at a political rally.", "label": 0}
{"text": "So cringe that it was newsworthy", "label": 0}
{"text": "Its kind of like when you wake up first thing in the morning, and you do that crazy stretch that comes out in multiple parts", "label": 0}
{"text": "MSG? Monosodium Glutamate?", "label": 0}
{"text": "He's so fucking proud of himself for acting like a dipshit.", "label": 0}
{"text": "Manchild", "label": 0}
{"text": "He's such a dumb fuck, tired of him and Donald.", "label": 0}
{"text": "Nothing wrong with the way he looks in general but in terms of optics during a political campaign his jumping and \"flexing\" would be a lot more effective if he were in shape. He just looks like an awkward teen most of the time.", "label": 0}
{"text": "Looks like he's pulling down on a lat pull down machine that got away from him on the up.", "label": 0}
{"text": "> *”Why did he jeopardise his already unusual reputation by participating in toxic politics?”*", "label": 0}
{"text": "It's like he thinks he's a WWE wrestler entering the ring. But he just...isn't.", "label": 0}
{"text": "I strongly disagree. \n\nIn large doses absolutely will send a horse to the ground, but moderately dosed it can be a lovely thing to enjoy in party settings.", "label": 0}
{"text": "Oh Elon ...", "label": 0}
{"text": "Not sure whether he got bullied too much or not bullied enough in school", "label": 0}
{"text": "Has anyone else clocked that Elon is probably cosying up to Trump to try and step up and lead the movement movement after trump goes/dies?", "label": 0}
{"text": "This is your brain. This is your brain on drugs. Any questions?", "label": 0}
{"text": "All I can think of is that paparazzi Pic of him in swimming shorts and he looks pudding without a flavor. Like a white blob or if a a fish belly was a whole body.", "label": 0}
{"text": "no dumbing down required, he's just like that.", "label": 0}
{"text": "I think it's just very slimming.", "label": 0}
{"text": "![gif](giphy|yr7n0u3qzO9nG)", "label": 0}
{"text": "Immediately looking for approval. How can you be that fragile?", "label": 0}
{"text": "*Ha.*", "label": 0}
{"text": "Reminds me of Dwight at the end.", "label": 0}
{"text": "What a 🤡.", "label": 0}
{"text": "Hes African", "label": 0}
{"text": "As you can see I'm dork maga", "label": 0}
{"text": "https://i.redd.it/3a9hnrilpgxd1.gif", "label": 0}
{"text": "Don’t lump us in with him", "label": 0}
{"text": "He looks like the kid who wore swag SpongeBob tshirts in school but never quite grew out the phase", "label": 0}
{"text": "What an idiot", "label": 0}
{"text": "I like Elon.", "label": 0}
{"text": "Where’s the cringe part, his awkward mannerisms or people here making fun of someone’s awkward mannerisms?   Maybe I’ve stumbled into a middle school community?", "label": 0}
{"text": "Dipshit", "label": 0}
{"text": "i would be pretty happy to see him arrested, his companies nationalized and his money taken.", "label": 0}
{"text": "I agree with your first sentence, but the second one seems incorrect.", "label": 0}
{"text": "Like you or anyone else would know that lmao", "label": 0}
{"text": "Does he have some kind of coordination disability?", "label": 0}
{"text": "Did this fuckhead just make an X with his body again? 😃 How mind-numbingly fucking stupid. 🙃", "label": 0}
{"text": "Elon. .  Our next future republican presidential candidate. .", "label": 0}
{"text": "I forgot about the being born in America thing, I'll sleep easier tonight", "label": 0}
{"text": "His mannerisms are the least cringy thing of everything else in the gif.", "label": 0}
{"text": "Drugs lots of drugs", "label": 0}
{"text": "He can never run, he wasn’t born here.", "label": 0}
{"text": "As someone with Asperger’s, nothing they said was related to aspergers. The fact you think we act like idiot 11 year olds is the actual Asperger’s shaming, so…. Full circle, huh?", "label": 0}
{"text": "This reminds me of any 8 year old I ever interacted with. They flail, wave their arms around, twitch all the time and have those explosive movements.", "label": 0}
{"text": "Think what he has in common is both he and Trump have never really nurtured or healed their inner child and so you see that hurt little boy acting out more and more as they both get older.", "label": 0}
{"text": "Whew. .", "label": 0}
{"text": "Nobody has anything against useful immigrants.", "label": 0}
{"text": "Weird dipshit !", "label": 0}
{"text": "Ozempic Elon.", "label": 0}
{"text": "![gif](giphy|vnUV46jDA8FjvXIpdw)\n\nYou're not fooling anybody, dingbat", "label": 0}
{"text": "It bothers me when people are bad at gestures.", "label": 0}
{"text": "![gif](giphy|55itGuoAJiZEEen9gg)", "label": 0}
{"text": "Can I get the version with audio?", "label": 0}
{"text": "i thought the left doesn't pick on people with autism", "label": 0}
{"text": "Why do these weirdoes look like they're acting like humans?", "label": 0}
{"text": "Liberal reddit is a special place lol.", "label": 0}
{"text": "He has the bad reputation because he is a shit person. Deadbeat dad like Trump. Dodges taxation like Trump. Steals credit for everything he owns like Trump. Probably on the verge of federal fun time if Trump loses the election, like Trump.", "label": 0}
{"text": "So funny he’s in the maga phase of decline like Kanye.", "label": 0}
{"text": "He moves and has facial expressions like a SIMS character.", "label": 0}
{"text": "Gross.  I’m exhausted with this election.  Doesn’t help that my parents refused to listen to me and my concerns as a disabled woman if Trump 2.0 happens.  Haven’t spoken to either of them in 3 weeks, even when I send a text saying “how are you” or “I miss you.”  Incredibly sad.", "label": 0}
{"text": "Yeah Walz is the bastion of normalcy. Uh huh.", "label": 0}
{"text": "tbf, rallies from both sides are extremely cringeworthy. as an Aussie, I can't imagine a politician holding something like this here. no one would give a shit", "label": 0}
{"text": "One degenerate supporting another degenerate.", "label": 0}
{"text": "Is it okay to make fun of Africans now?", "label": 0}
{"text": "You’re still a dead beat dad, Elon.", "label": 0}
{"text": "He’s such a tosser.", "label": 0}
{"text": "I mean he has Asperger’s.", "label": 0}
{"text": "What a douchebag", "label": 0}
{"text": "from genius to idiot in a few years , nice name for the book", "label": 0}
{"text": "This is how the rest of the world sees American politics, entirely cringe.", "label": 0}
{"text": "Does he though? He does not strike me as a person who wants to challenge himself. He strikes me as more of a \"GTA V with trainer\" kinda guy.", "label": 0}
{"text": "If you acted like Elon Musk in school you’d be bullied so hard.", "label": 0}
{"text": "First woke comment I’ve read. Agreed, Elon siding with trump has nothing to do with politics, it’s a business deal so the many legal barriers for Tesla space X can be lifted. I’d say Elon is smart apart from the fact that Donald has a bad reputation in holding up his part of business deals.", "label": 0}
{"text": "Eh, why can't it be both? I feel like it's definitely both.", "label": 0}
{"text": "Dipshit", "label": 0}
{"text": "That’d be nice.", "label": 0}
{"text": "Not like a child, more like some autistic teenager.", "label": 0}
{"text": "did he want to do the X again but stopped himself?", "label": 0}
{"text": "Most people with Aspergers probably wouldn’t do this though", "label": 0}
{"text": "because he's prepping to be the next trump and be the REP candidate next time ...", "label": 0}
{"text": "Minnesota dad vs \"that billionaire that tried to pay for sex with a horse\"", "label": 0}
{"text": "> Leon (sic), you’re a union-busting billionaire, the furthest possible thing from a socialist", "label": 0}
{"text": "More like he self inserts himself into EVERYTHING and we can’t get away from it.\n\nPlus it’d be different if he was talking policy, he’s literally jumping with joy because he found a cheat code to get (dumb) people to cheer for him by being a trump supporter.", "label": 0}
{"text": "Its like he is come forth and finally free and comfortable with himself expressing who he truly is\n\nA piece of shit…", "label": 0}
{"text": "It's OK to make fun of dipshit Trumpists.", "label": 0}
{"text": "he mustve imagined to be so cool in his head lmao", "label": 0}
{"text": "Ballmer or Musk? Yes!", "label": 0}
{"text": "He may need help. There is history of wealthy and powerful people losing contact with reality. He is a remarkable man but he is showing signs of disconnection.\nMichael Jackson died from this as did Matthew Perry and many others.\nHe should try doing good works, building hospitals and creating scholarships and such.", "label": 0}
{"text": "NINTENDO SIXTY FOOOUURRRR!!!", "label": 0}
{"text": "I doubt Trump gives a shit about EVs. Like most of the GOPs talking points, EVs are just another topic to create an \"us vs. them\" mindset and rally their base around. The GOP exists primarily to serve the interests of billionaires, and Musk fits right in there. Really, it's more like Trump and Musk are using their voters.", "label": 0}
{"text": "I always find it weird that this isn't widely known because I ts such a good story. That wasn't cocaine. That was adrenaline. \n\n  \nBecause the first thing he did when he ran on stage was BREAK HIS ANKLE.", "label": 0}
{"text": "Okay what the fuck, this is some serious Microsoft deep lore hiding in plain sight", "label": 0}
{"text": "He was diagnosed with Asperger's syndrome. People on the autism spectrum often come across as child like. It's just different.  \nI don't care how much you dislike the guy, that's probably not something to ridicule him about.", "label": 0}
{"text": "Autism. It's the autism.", "label": 0}
{"text": "I feel like there's a fine line between the two. \n\nBut in terms of what he *says*, I agree that it's more like an autistic teenager than a child", "label": 0}
{"text": "It’s like he read “act excited for 18 seconds” on a cue card.", "label": 0}
{"text": "Autism plus the lighting plus Ill fitting clothes plus baby fat makes him seem like an awkward kid moving.", "label": 0}
{"text": "Cope harder", "label": 0}
{"text": "Btw, it looks wow! Hopefully, one day, I'll lear how to do this...", "label": 0}
{"text": "I'll have an extra helping of dipshit please", "label": 0}
{"text": "Amazing!!! How many hours have you spent on this?", "label": 0}
{"text": "JFC, could his all black outfit be more fascist?", "label": 0}
{"text": "Becoming a millionaire", "label": 0}
{"text": "Dipshit", "label": 0}
{"text": "Because, short term, he is going fishing.\n\nI think a lot of his ventures are very dependent on other people's money. And I would imaine that, even without politics playing any role, that most of the sane money backing him up has already left quite a while ago. \n\nThe sane people have been exchanged for less smart and more greedy money without any particular political affiliation. They might soon come to realize that they are bag holders, and that it might be time to run before it's too late.\n\nNow that this demographic of money bags is running dry, is getting anxious, and is close to bolting, it's time to fish in the last promising waters which are still avialable for new money bags which are less smart, less critical, and more easily fooled into a bad investment. There is only one place for that.\n\nMid term, he is hoping to be saved. Full government backing for all things Musk. Space X replaces NASA as a whole, twitter is becoming the offical state funded US free speech platform, and all vehicles in government service will be Teslas from now on. I would suspect that's the dream if Trump wins.\n\nAnd long term, I suspect he is gunning for a political career himself, turning his Musk fanboy army into hist Trump 2.0 like political base.\n\nAll in all, a good (probably also desperate) decision for him on all accounts.", "label": 0}
{"text": "Takes too much effort to focus hate on one other.", "label": 0}
{"text": "\"dark maga\" is just because conservatives are still pissed liberals turned around the whole \"dark Brandon\" thing.\n\nAlso the only thing Elon knows how to do is steal.", "label": 0}
{"text": "Lot of “progressives” here are real comfortable being ableist and making fun of autism when it’s about someone they don’t agree with.", "label": 0}
{"text": "the left's intense display of self-righteousness and humanism goes completely out the window when it comes to politics...at least politics involving Trump and Musk", "label": 0}
{"text": "Yes, Elon is super worried about competition. That's why he open-sourced all of Teslas's car patents...\n\nThe Biden administration is butt-hurt that Twitter is no longer a Democrat stronghold and they're taking it out on Elon.", "label": 0}
{"text": "No. There is no monetization or any other sponsorship/donation options for this project. Maybe in the future I'll add something that will help me with paying for servers/traffic, but not in the next few years.", "label": 0}
{"text": "Weird", "label": 0}
{"text": "Proper psycho", "label": 0}
{"text": "Oh my goodness 🥰", "label": 0}
{"text": "Didn’t see that coming!", "label": 0}
{"text": "Took the words out of my mouth.", "label": 0}
{"text": "I clicked play, and it just said “something went wrong.” Not sure if it’s just describing the MSG rally.", "label": 0}
{"text": "![gif](giphy|l0HlvtIPzPdt2usKs)", "label": 0}
{"text": "No. It's okay he is awkward and potentially on the spectrum. Being a union busting nazi makes him dipshit.", "label": 0}
{"text": "Yeah he is undermining American democracy and wants to buy the election for Tangerine Palpatine. He should be in everyone's thoughts. Ill paraphrase him, \"if Trump doesn't win ill be in jail\" He knows he has been braking the law.", "label": 0}
{"text": "Looks like oldscool hakken to me:\n\nhttps://m.youtube.com/watch?v=3P-eMfsHOWk", "label": 0}
{"text": "You know it's a pig because it went straight for the crotch.", "label": 0}
{"text": "Pigs and pugs!", "label": 0}
{"text": "Bazinga", "label": 0}
{"text": "Is it a kitten, or a puppy?\n\nOh it's gotta be a puppy.\n\nOmg it's a piggyyyyy <3", "label": 0}
{"text": "💜💜💜", "label": 0}
{"text": "Thanks. Yes, I posted to this subreddit a 3 years ago, when the project was \\~3 times smaller. \n\n[https://www.reddit.com/r/wimmelbilder/comments/r0axo7/oc\\_animated\\_scene\\_with\\_a\\_lot\\_of\\_details/](https://www.reddit.com/r/wimmelbilder/comments/r0axo7/oc_animated_scene_with_a_lot_of_details/)\n\nHa! Just to compare how the whole scene looks now (1st animation frame): [https://cdn.floor796.com/data/fullsize/1730042572\\_00.jpg](https://cdn.floor796.com/data/fullsize/1730042572_00.jpg) \n\nProbably will post again to this sub, but later.", "label": 0}
{"text": "The BSOD ruined an otherwise perfect gif", "label": 0}
{"text": "She smokes the hell out of that cigarette ", "label": 0}
{"text": "It's from his Drumeo session, [https://www.youtube.com/watch?v=xBY2zO6E4kI](https://www.youtube.com/watch?v=xBY2zO6E4kI)", "label": 0}
{"text": "As an old who had both Pong and an Atari 2600 growing up...this gif kills me.", "label": 0}
{"text": "I've watched it several times now.  One of my favorites!", "label": 0}
{"text": "You're welcome. Now you'll be able to avoid making an inaccurate statement in the future.", "label": 0}
{"text": "They’re both really good.", "label": 0}
{"text": "Decent 1st season. Then downhill fast.", "label": 0}
{"text": "God the amount of ticks...", "label": 0}
{"text": "Sure then lol", "label": 0}
{"text": "ie. the Eva Green show", "label": 0}
{"text": "God damned graboids!", "label": 0}
{"text": "She should be vaping, much more scary", "label": 0}
{"text": "Sty Hulud", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "Cute", "label": 0}
{"text": "i had a kind of love-hate relationship with this show.\n\nsome parts where absolutely genius.\n\nbut come on - this murray guy: daughter dies? yeah - shit happens. mrs ives is slightly inconvenienced by some dark thoughts? whoa - we have to do something very dangerous (and very expensive) to help her!", "label": 0}
{"text": "Hi all. I challenged myself to draw a pixel art scene every day in 2024! This is going to be a little hard on me since I have a day job and caregiving for the rest of the day. Wish me luck! This is day 302 of 366!\n\nI wish you all a great day <3\n\nIf you like this type of art and want to support me or see tutorials, please feel free to check my other works:\n\n[Steam WallPaper Engine collection](https://steamcommunity.com/id/AnasAbdin/myworkshopfiles/) | [Patreon](https://www.patreon.com/AnasAbdin) | [Foundation](https://foundation.app/@anasabdin) | [Twitter](https://twitter.com/AnasAbdin) | [Tumblr](https://anasabdin.tumblr.com/) | [Facebook](https://www.facebook.com/anastronautgames/) | [Instagram](https://www.instagram.com/anasabdin/) | [LinkedIn](https://www.linkedin.com/in/anasabdin/)", "label": 0}
{"text": "I was seeing a girl whose parents would let us be alone if they could hear the game playing, reasoning that we couldn't make out and play at the same time. They didn't know about the level ball thing and they didn't get the details of anything \"tech\" enough to catch on that the steady rhythm wasn't the same a actual game play.", "label": 0}
{"text": "![gif](giphy|PlgNz2gB8Q2fm)\n\nBetter watch out", "label": 0}
{"text": "Seriously!  The world might shift on its axis!", "label": 0}
{"text": "Me;  as dead swamp witch, protecting and haunting my hovel.", "label": 0}
{"text": "Looks like Goku vs Frieza.", "label": 0}
{"text": "It was a compliment. She ruled that show.", "label": 0}
{"text": "![gif](giphy|6g8XtfomGPqjS|downsized)", "label": 0}
{"text": "Bacon!", "label": 0}
{"text": "It's BACON!!!", "label": 0}
{"text": "Bacon!", "label": 0}
{"text": "Love this intro and the Eva Green part especcially.", "label": 0}
{"text": "Have you met dogs?", "label": 0}
{"text": "You're getting downvoted for having fun", "label": 0}
{"text": "[Ker-leaf!](https://i.pinimg.com/originals/38/f0/04/38f00498b6c684c296f7bfd857d540bf.jpg)", "label": 0}
{"text": "The Teenager of the Year himself.", "label": 0}
{"text": "Bro predicted skibidi", "label": 0}
{"text": "Imagining the soundtrack to Jaws", "label": 0}
{"text": "Loaf of bread?", "label": 0}
{"text": "+20 years ago when I was a hospice nurse making home visits, I had had a long day and pulled up in my last patients back yard late afternoon. It was fall and leaves were everywhere.  Suddenly, a whole litter of little pink baby pigs jumped out of the leaves and ran off and to this day it's one of the sweetest memories I have.", "label": 0}
{"text": "That'll do", "label": 0}
{"text": "I had the poster of that car in front of the Golden Gate Bridge.  Closest I’ll ever get!", "label": 0}
{"text": "Josh Hartnett and Eva Green were soooo good. The exorcism episode is *chef's kiss*", "label": 0}
{"text": "Played it back in 1988", "label": 0}
{"text": "Yeah…. Ticks!", "label": 0}
{"text": "Why is it bouncing?", "label": 0}
{"text": "Yeah, I had that Trapper Keeper too.", "label": 0}
{"text": "They lied to me, though. I thought I could see through walls and stuff!", "label": 0}
{"text": "I literally watched this episode of 'Abridged' yesterday 😄  probably the greatest non-Toriyama creation", "label": 0}
{"text": "Watching super right now, got to the part where Vegeta's daughter is born. I love Vegeta being a family man.", "label": 0}
{"text": "Krillin: ...So, Tien, have you been lifting? Because you are jacked!\n\nTien: Yeah, who knows? Maybe I'll be the next Super Sayian!", "label": 0}
{"text": "![gif](giphy|nwY327BMar8KQ)", "label": 0}
{"text": "Shame it's overshadowed by all this UNYIELDING RAGE", "label": 0}
{"text": "Love the BSOD.", "label": 0}
{"text": "Vegeta: HRNRYRGHR!!!", "label": 0}
{"text": "Ya really gotta feel bad for Princess Trunks", "label": 0}
{"text": "It's OK to be a dweeby, socially unaware bitch. It's *not* OK, to be a *cruel*, dweeby, socially unaware bitch.", "label": 0}
{"text": "I love it! 💛", "label": 0}
{"text": "I'll go over there and break the bald ones neck, and totally gonna yell Team Three Star while I do it\n\nTEAM THREE STAR! *cracks neck* Amazing 😁", "label": 0}
{"text": "TFS took some time to find what works in Abridged by the cell saga they were absolutely hilarious.  A full buu saga would have been amazing.", "label": 0}
{"text": "Is that ME?\n\nIs that me stronger than me?\n\nI'LL KILL ME!", "label": 0}
{"text": "Namekian!!!\n\n\nToo strong!!!\n\n\n\nExplain now!!!", "label": 0}
{"text": "I'm a little late but what did he say", "label": 0}
{"text": "The new Tremors movie looks adorable", "label": 0}
{"text": "This was my exact thought process as well. XD", "label": 0}
{"text": "Popo: \"He fused with kami.\"\nVegeta: \"The fucks a kami!?\"\nKrillin: \"It means god\"\nVegeta: \"But I'm still here!?\"", "label": 0}
{"text": "Hercule: \"I AM THE HYPE!!!!\"", "label": 0}
{"text": "Those pugs are sooo jelous.", "label": 0}
{"text": "https://i.redd.it/t46l8yx25pez.jpg", "label": 0}
{"text": "KILL HIM NOW!!!", "label": 0}
{"text": "Kiko-how you doing?", "label": 0}
{"text": "Arrival is so unbelievably underrated.", "label": 0}
{"text": "It's less scary than the out of out of context gif implies.", "label": 0}
{"text": "Isn't that just it's hand?", "label": 0}
{"text": "But would you be able to? In \"future\" you already made said decision and see consequences of it.", "label": 0}
{"text": "Super really did Goku dirty on some aspects of his character though", "label": 0}
{"text": "are you some kind of wizard?", "label": 0}
{"text": "A few episodes later…\n\nKrillin: Why do you antagonizing him like that? You know he can kill you, right?\n\nTien: At this point, it’s a game. If he gives in, I win… and he knows that.", "label": 0}
{"text": "No, I just have a lot of hand-eye coordination and way too much time on my hands.", "label": 0}
{"text": "Definitely was. Two dial controllers and the game packaged in a box. I miss the simplicity of my 2600.", "label": 0}
{"text": ">If you get there at the same time, whoever's on the right goes first.\n\nAnd if you're across the street from each other, you're going straight, and they don't have a turn signal on. So you go straigth across because nobody's in your way. Then suddenly, the dude who was across from you starts turning left (your right). But you had no idea because they obviously ran out of blinker fluid and couldn't signal they were turning left. Simultaneously, someone comes through going right to left in an overzized, lifted truck and runs the stop sign. Then you realize you're in New Jersey, and that last left turn you made was illegal, so you're getting pulled over. And you're not white, so you're getting shot at for reaching into your glove box to get your insurance and registration.\n\nWho has the right of way in that scenario? It's obviously the truck, right?", "label": 0}
{"text": "It's a [commercial](https://www.youtube.com/watch?v=rx6tJd8pIUo) for Ruffles from some country that speaks Portuguese", "label": 0}
{"text": "🦵 🦵 💨", "label": 0}
{"text": "When Cell starts singing I get chills every time 😅💛", "label": 0}
{"text": "Luxury time travel", "label": 0}
{"text": "Nah give me some of those crunchy sensu beans", "label": 0}
{"text": "Love this movie. Cynthia Rothrock was great in it.", "label": 0}
{"text": "It is definitely my preferred canon.", "label": 0}
{"text": "In a world of cheap death, Tien really just went with it. Even if he dies, he knows he just goes and trains some more.", "label": 0}
{"text": "Brocolli is pretty good too apparently.", "label": 0}
{"text": "It says Pepsi Co right at the top.", "label": 0}
{"text": "Dan, people's legs not being attached properly is becoming way too common.", "label": 0}
{"text": "The little black ones are soo cute!", "label": 0}
{"text": "That's a well trained dinosaur right there.", "label": 0}
{"text": "I love when Goku “dies” on namek:\n\nYamcha: goku…. NOOOOOOOO!\n\nTien: why do you care? Why do you any of you care? Are you forgetting the whole reason we went to Namek in the first place? Now we have two sets of dragon balls. Hell, this is Chosou’s second time being ressurected.\n\nChosou: Next time I come back I get a free sunday!", "label": 0}
{"text": "It's a Countach, it's getting rainwater inside regardless of the door position.", "label": 0}
{"text": "West, Jim West. Desperado. ", "label": 0}
{"text": "This is so sad...", "label": 0}
{"text": "![gif](giphy|HEqXD4EOCdfJC|downsized)\n\nGreat user name.", "label": 0}
{"text": "Another one of my favorite scenes\n\nVegeta so what are you doing?\n\nGohan so what am I doing?!\n\nVegeta so what are you doing?\n\nGohan nothing much\n\nVegeta: thwarting my plans?\n\nGohan: ruining your plans?\n\nVegeta: are you?!\n\nGohan: Yes…\n\nVegeta: IM GOING TO F***** KILL YOU!!", "label": 0}
{"text": "AAA Angus chicken?", "label": 0}
{"text": "Cool chicken.", "label": 0}
{"text": "Hmm... Might be fake...", "label": 0}
{"text": "This submission has been automatically removed because the title is not descriptive enough. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs. In this case, rule 8.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "Could be hangry", "label": 0}
{"text": "Mmmm soothing", "label": 0}
{"text": "Which had a great callback later. \n\nGohan: Really? You’re using *Krillin* as a hostage? His death is a day trip for us and a free ice cream sundae for him, go ahead.", "label": 0}
{"text": "\"Inigo Montoya would like to know your location.\"", "label": 0}
{"text": "Very nice", "label": 0}
{"text": "I can almost feel the cool breeze and hear the sounds of rain. Cool gif.", "label": 0}
{"text": "That took me way too many loops to realize she wasn't getting smaller and smaller.", "label": 0}
{"text": "🎶 Nah nanna nanna, nah nanna, Ghost Nappa!! 🎶", "label": 0}
{"text": "I still don't think Werner Herzog would be impressed.", "label": 0}
{"text": "Cars don't like getting wet", "label": 0}
{"text": "I’m hilarious and you’ll repeat everything I say", "label": 0}
{"text": "The writing is just so good after the first season. I recommend it to anyone interested in dbz that didn't watch it growing up. Best way to learn the story and stay entertained.\n\nAll of the creative non-canon decisions are done so well, like merging Nail and Kami's consciousness with Piccolo's after absorbtion, and it became such a good tool for storytelling and jokes.\n\nFuck man I've watched it through like 30 times and I still get excited to see it.", "label": 0}
{"text": "r/peacefulsolitude", "label": 0}
{"text": "She it angry hungry.", "label": 0}
{"text": "Team Four Star are the best. I'm still a little sad they decided to call it quits after the Cell sage, but I also totally get it. They'd been at it for a decade by that point. \n\nThey absolutely run with Vegeta. At one point after Trunks knocks him aside he's just floating in the ocean pondering how odd he finds it to feel pride over someone else's accomplishments. And then he gets mad over it.", "label": 0}
{"text": "r/TheNightFeeling", "label": 0}
{"text": "Still have yet to see this movie", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "They’re kicked out, and might be facing a pretty long stadium ban. \n\n[For those who don’t know what this is about.](https://www.reddit.com/r/baseball/comments/1gf9zf8/fan_interference_was_called_on_this_play_where_a/)", "label": 0}
{"text": "Bass is bumpin', dimming the lights. Just as it should", "label": 0}
{"text": "I thought it was Richard Chamberlain maybe.", "label": 0}
{"text": "I'd like to park it in my mac's space.", "label": 0}
{"text": "Love the style but can't help but feel like the wind screen is getting pelted lol", "label": 0}
{"text": "lol big bands are very different", "label": 0}
{"text": "Pete! Love Ghosts", "label": 0}
{"text": "![gif](giphy|lmeh2XGMCbCdW)", "label": 0}
{"text": "\"IM TRYNA PLAY BAZEBALL HEAH, WUZZA MATTA WIT YOU\"", "label": 0}
{"text": "Those douchebags literally grabbed the player’s glove/hand and tried to rip the ball out after he caught the ball", "label": 0}
{"text": "![gif](giphy|aZmD30dCFaPXG)", "label": 0}
{"text": "future stuntman", "label": 0}
{"text": "Why is Jason Mimosa beating up this kid? He already given him 20 kicks, I don’t think he is gonna stop.", "label": 0}
{"text": "I legit thought the rain was real as I was scrolling down and didn't realize it was pixel art for a second. The color selection for the lighting of the rain is so lifelike and the little drips in the top right really sell it!", "label": 0}
{"text": "WE’RE WALKIN HEAH! *", "label": 0}
{"text": "The Stinky, The Constipated and the pisser", "label": 0}
{"text": "Assert dominance, piss with your pants all the way down at the urinal", "label": 0}
{"text": "They didn't \"try\". They did. Specifically the guy on the left. They both got removed from the park.", "label": 0}
{"text": "Someone's gotta do an edit of this guy pouring colds one for the boys and sliding them down.", "label": 0}
{"text": "Audible GIFs.", "label": 0}
{"text": "[it was way worse.](https://preview.redd.it/kpjflagb5txd1.jpeg?width=586&format=pjpg&auto=webp&s=76541a1b244aa99b02a47b6a2081f27263b631a6)", "label": 0}
{"text": "Wait which app is this", "label": 0}
{"text": "Wow, I've never seen cringe acting so well displayed before.", "label": 0}
{"text": "Am I the only one wondering when chickens became mainstream pets?", "label": 0}
{"text": "great job!", "label": 0}
{"text": "What kindof gymnastics is going on that allows urinal man to maintain eye contact...", "label": 0}
{"text": "The whole thing is a masterpiece of comedy!!", "label": 0}
{"text": "This would be so perfect as a wallpaper engine wallpaper!", "label": 0}
{"text": "Technically you can interfere if the ball crosses the wall, but you can’t grab a player and rip the ball out of his glove. Just shit people trying justify their shitty actions", "label": 0}
{"text": "Never drive angry", "label": 0}
{"text": "Just looks like they’re goofing around to me", "label": 0}
{"text": "I just saw this guy in the woods", "label": 0}
{"text": "Now I have to watch it again.", "label": 0}
{"text": "I watched enough Oz to know what this man is capable of.", "label": 0}
{"text": "ESPN article this AM said they’d be allowed back for the next game. These guys do this on purpose, they even told the reporter.", "label": 0}
{"text": "...what? Did you miss the legs?", "label": 0}
{"text": "Yeah that's worse for sure wow", "label": 0}
{"text": "I don't think they were arrested, just ejected.", "label": 0}
{"text": "Personality goes a long way.", "label": 0}
{"text": "I love these kinds of atmospheric emotions captured in a simple gif.\n\nAll this high tech in cars, with ads, subscriptions, voice assistants, gps, etc... it's nice to look back at a simple car under the glow of a lamp in a big city. A slice of life of a simpler time.", "label": 0}
{"text": "Absolute unit", "label": 0}
{"text": "Cool.\n\nMost people still use assault as the de facto term irregardless whether or not battery is the technically correct term for it.", "label": 0}
{"text": "Mosquitos, obvs.", "label": 0}
{"text": "No more weed for you.", "label": 0}
{"text": "I don't use weed. I'm not black or a chav.", "label": 0}
{"text": "I guess to some folks it probably comes across as ignorance in some way, shape or form.\n\nJust seems oddly nonsensical to correct a person over the use of a word that's frequently used in the same manner all the time where I'm from.", "label": 0}
{"text": "Well it certainly is seems to be a waste of time, I’ll admit", "label": 0}
{"text": "Hi /u/Wonderful-Price1545, your post breaks the rules of /r/gifs and has been removed for the following reason(s):\r\n\r\n> Rule 3: Better suited to video\r\n\r\n\r\n\r\n**If you feel this was done in error, or would like further clarification, please don't hesitate to [message the mods.](http://www.reddit.com/message/compose?to=%2Fr%2Fgifs&subject=Removed+Post&message=My%20Post:%20https://www.reddit.com/r/gifs/comments/1gfbd7j/-/)**", "label": 0}
{"text": "Hi /u/Wonderful-Price1545, your post breaks the rules of /r/gifs and has been removed for the following reason(s):\r\n\r\n> Rule 3: Better suited to video\r\n\r\n\r\n\r\n**If you feel this was done in error, or would like further clarification, please don't hesitate to [message the mods.](http://www.reddit.com/message/compose?to=%2Fr%2Fgifs&subject=Removed+Post&message=My%20Post:%20https://www.reddit.com/r/gifs/comments/1gfbdcn/-/)**", "label": 0}
{"text": "Hi /u/Wonderful-Price1545, your post breaks the rules of /r/gifs and has been removed for the following reason(s):\r\n\r\n> Rule 3: Better suited to video\r\n\r\n\r\n\r\n**If you feel this was done in error, or would like further clarification, please don't hesitate to [message the mods.](http://www.reddit.com/message/compose?to=%2Fr%2Fgifs&subject=Removed+Post&message=My%20Post:%20https://www.reddit.com/r/gifs/comments/1gfbdj2/-/)**", "label": 0}
{"text": "Hi /u/Wonderful-Price1545, your post breaks the rules of /r/gifs and has been removed for the following reason(s):\r\n\r\n> Rule 3: Better suited to video\r\n\r\n\r\n\r\n**If you feel this was done in error, or would like further clarification, please don't hesitate to [message the mods.](http://www.reddit.com/message/compose?to=%2Fr%2Fgifs&subject=Removed+Post&message=My%20Post:%20https://www.reddit.com/r/gifs/comments/1gfbdv7/-/)**", "label": 0}
{"text": "I know this thread is over a decade long but if someone like myself runs into it and wants to know the source, it's Discovery's 2013 documentary series North America, narrated by Tom Selleck. The footage is from the very end of the first episode.", "label": 0}
{"text": "I am wearing those exact same Brooks shoes. Respect. \nThe chicken game is on point too. 😁", "label": 0}
{"text": "This has improved my day.", "label": 0}
{"text": "That pig absolutely lost it's shit seeing that splash pad", "label": 0}
{"text": "Pigs have been 'pets' for a long time, but yes, some are for the social media attention. Other people just have pigs as pets, same as a cat or dog.", "label": 0}
{"text": "We got Moo Deng at home.", "label": 0}
{"text": "What a jamoke.", "label": 0}
{"text": "My guess is lots of people are getting tiny pigs and being told they will not grow up, and when they do, they cannot get rid of them.", "label": 0}
{"text": "It’s the red bird that’s angry.", "label": 0}
{"text": "I've been loving all these pixel art gifs that keep popping up. Not sure if the app algorithm is favouring them for me or if they're suddenly more popular for whatever reason", "label": 0}
{"text": "The other fans weren't doing great, either. In a video from a few rows up you can hear a guy yelling \"You got the wrong guys!\" to fuck with security.", "label": 0}
{"text": "One charming mother fucking pig", "label": 0}
{"text": "Nothing says \"martial arts master\" like a baby stroller full of cardboard boxes and coats", "label": 0}
{"text": "So you got three words into the text of the rule, specifically \"incredibly long gifs,\" and decided that the rest of the text in the rule was irrelevant because those first three words didn't apply in this case?", "label": 0}
{"text": "Chaka Pilgrim. She has been with Jay since the 90's. She is a legend in the game", "label": 0}
{"text": "Is this where the quote came from? Idk i jushtrel gqghreooglred thishre lol.", "label": 0}
{"text": "It was looking good until he tried the elbow smash.", "label": 0}
{"text": "Not Dim Mak!", "label": 0}
{"text": "Skill issue, bro.", "label": 0}
{"text": "Right on the funny bone", "label": 0}
{"text": "To put why these guys are being allowed back in context - per mlb rules, balls that enter the spectator area are fair game for spectators, and interference isn’t called.", "label": 0}
{"text": "Was the rain all done by hand too, just freeform? It wasnt entirely clear if that was added on at the end of the timelapse or done by hand", "label": 0}
{"text": "/r/YourJokeButWorse", "label": 0}
{"text": "more like r/woooosh.", "label": 0}
{"text": "Completely worthless without the sound.", "label": 0}
{"text": "Hi! Take a look at your link url. This submission has been automatically removed because it is not a direct link. Please submit links ending in .gif, .gifv, .ogg, .mp4, .webm only (right click, copy link address). If it does not end in the aforementioned, then the submission will be removed from /r/gifs. Thank you. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "Should be permanent. People like this shouldn’t be allowed access to happy things. They think they’re the main characters and ruin things for everyone else.", "label": 0}
{"text": "https://i.redd.it/6ymjr24cczxd1.gif", "label": 0}
{"text": "The gif maker I used cut it short. I posted the full gif in the comments.", "label": 0}
{"text": "The article was since updated, they are in fact banned from the game tonight.", "label": 0}
{"text": "Sorry everyone. Here’s the full length gif.", "label": 0}
{"text": "I'm assuming that is what he's trying to argue. It's complete BS but since they got caught doing something stupid they have to come up with stupid arguments to justify it.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Bag of bacon!", "label": 0}
{"text": "Does /r/YourJokeExplained exist?", "label": 0}
{"text": "Chonky. It looks kinda like an old cat that's given birth and got that belly pouch swinging. Is that a thing for pigs too?", "label": 0}
{"text": "Full disclosure, I did post this gif to this from my old account a while back, but I added a fade to the beginning of the gif as well to make it a little smoother.\n\nthe original:  \n[https://www.reddit.com/r/gifs/comments/16pzr91/cyberpunk\\_edgerunners\\_2022/](https://www.reddit.com/r/gifs/comments/16pzr91/cyberpunk_edgerunners_2022/)", "label": 0}
{"text": "Send the clip to the building/roadworks inspector and let 'em know those bricks are real.", "label": 0}
{"text": "I used my head", "label": 0}
{"text": "Bet they’re voting Kamala!! Lol!!", "label": 0}
{"text": "Clearly didn’t eat enough pork bun", "label": 0}
{"text": "It's a baseball game dude, nobody got hurt and you're trying to contribute some larger societal thing over something so pointless. \n\n![gif](giphy|0rQH5wsLbEsPqV5bAI|downsized)", "label": 0}
{"text": "So, what do you wanna do, what's your point of view?", "label": 0}
{"text": "I’m Sandevistated", "label": 0}
{"text": "It was like an old Greek tragedy. Each character bound to their paths by the chains of who they are, and the audience knowing where those paths would inevitably lead. Nobody can escape who they are, not even in Night City. Like watching a train rushing towards a broken track, or a building beginning to topple, it was an extended fall into dissolution. Powerful, beautiful, and ultimately doomed. God what a ride through. The flame that burns half as long burns twice as bright, and David blazed in the darkness with the time he had. Love this show.", "label": 0}
{"text": "ay ay ay Fellas.....", "label": 0}
{"text": "And too many people go through life expecting everyone to conform to their singular worldview on what is right or wrong. You've never gotten too excited at an event? You've never had growing moments? Imagine if I was to judge you based off a sliver of a moment out of decades of life experience and assume I know everything about you, how awful would that be? That's the poison of social media and virality, you make one step out of the zeitgeist established by invisible hands and all of a sudden you \"shouldn't be allowed access to happy things.\" Pitiful world we are living in.\n\n![gif](giphy|zFdQ9xtp0Tba9hg045|downsized)", "label": 0}
{"text": "Wildly accurate description. I wanted there to be another season? Series? I'm not sure but realized that no matter how good the next installment was it would still be diminishing returns.", "label": 0}
{"text": "There's a party, screw it, do you wanna go?", "label": 0}
{"text": "P sure they hinted there might be a S2, but it'll probably be a completely different story, unrelated to what happened in S1. \n\nWhich is probably how I'd prefer it tbh.", "label": 0}
{"text": "Very much agreed but it still isn't going to hit the same.", "label": 0}
{"text": "Nah, not everything needs a sequel. This was a surprisingly good series and it would be a tough act to follow with an entirely new story.", "label": 0}
{"text": "The game is like that too. I forgot about that. Currently playing again. And now I'm depressed and anxious.", "label": 0}
{"text": "Dang William Zabka is looking rough", "label": 0}
{"text": "Look, I get that the show was a perfectly contained story and doesnt need a second season, but I really want a second season. There's too much cool shit in that world to only do one. Give me a new cast of characters. Night City has so much too offer", "label": 0}
{"text": "They'll order a David at the bar though. Dude definitely got a drink.", "label": 0}
{"text": "Okay", "label": 0}
{"text": "foreshadowing with too many grunts it seems.  ran out of grunt power", "label": 0}
{"text": "Yep, never have I felt that way since clannad.", "label": 0}
{"text": "Octolantern", "label": 0}
{"text": "Why and how does the age of the protagonist matter? Missing out on a great show based on the protagonist's age is insane.", "label": 0}
{"text": "Well sure, if you wanted to cheat with physics the way everyone who knows what they're doing does.", "label": 0}
{"text": "Taste the love...", "label": 0}
{"text": "Do martial artists even attempt this on bricks?\n\nI usually see concrete larger concrete slabs or oblong rocks....\n\nThat gif hurt ME looking at it.", "label": 0}
{"text": "Oh, they do. I‘ve myself seen it done on bricks only with fingers pushing. Bricks are usually not really a problem, if you know what you are doing.", "label": 0}
{"text": "Is this referencing something? I love this reply", "label": 0}
{"text": "Pumptapus", "label": 0}
{"text": "Sure. Most bricks actually aren't that difficult to break since they're so brittle. I would not do an elbow drop onto a pile of them though. The back of the elbow isn't the part you want to hit anything with.", "label": 0}
{"text": "Did they learn nothing from the Cubs/Marlins playoff in 2003?\n\n https://en.wikipedia.org/wiki/Steve_Bartman_incident", "label": 0}
{"text": "I thought this would be good to watch on the plane, the gun fight seemed alright, and then suddenly the sex scene out of nowhere and I quickly realised I should check ratings first ", "label": 0}
{"text": "https://youtu.be/ExXcIwjBzqw?si=88aVQLje8iMxaO7u", "label": 0}
{"text": "ONE OF US", "label": 0}
{"text": "Hey! It seems you've linked to a '.mp4' that is hosted on imgur. While this link is allowed in this subreddit, many users have difficulty or various issues with this file type. Here is a link to the url we would encourage to use if you would like to delete this submission and post it again. [](/u/LukeDangler)\n\n* https://i.imgur.com/vR9vBEv.gifv\n\n* [Click here to resubmit it with the new url](http://www.reddit.com/r/gifs/submit?url=https://i.imgur.com/vR9vBEv.gifv&title=I painted a dog with his head in a pumpkin)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "Moo!", "label": 0}
{"text": "This submission has been automatically removed because it is a reaction, HIFW (How I Feel When), or analogy GIF. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "Looks great, but I'm not quite sure if the dog is supposed to look happy or angry.", "label": 0}
{"text": "Nice!", "label": 0}
{"text": "I first read Crows...", "label": 0}
{"text": "He's adorable", "label": 0}
{"text": "Good. A happy cow is a tasty cow! /s", "label": 0}
{"text": "Hi! Take a look at your link url. This submission has been automatically removed because it is not a direct link. Please submit links ending in .gif, .gifv, .ogg, .mp4, .webm only (right click, copy link address). If it does not end in the aforementioned, then the submission will be removed from /r/gifs. Thank you. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "I hate it when games/shows get teased before they are even in mainstream development. If you announce your product 5 years ahead of time there will be a good number of people who literally die waiting for it to come out.", "label": 0}
{"text": "I'm getting \"happy manic\"", "label": 0}
{"text": "Relatability to the character, no interest in the premise of the show", "label": 0}
{"text": "As a european « wait it’s not like that every game? »", "label": 0}
{"text": "Lol i thought it was a pie at first!", "label": 0}
{"text": "I legit thought it was a pie at first", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "They look like cats fighting. Couldn’t he have just sprayed them with a water bottle?", "label": 0}
{"text": "Morons on full display.", "label": 0}
{"text": "KAMELA'S FINEST", "label": 0}
{"text": "Dinosaurs are so weird.", "label": 0}
{"text": "You said it yourself - \"spending commensurate to market\".  Regardless of an owner's personal wealth, do you think it is a prudent decision to drastically increase spending to where you will be guaranteed to lose money, as you are tipping the scale past a balancing point where the increased spending can be normalized by increased pricing on tickets, merchandise, and vending? That kind of model isn't sustainable for most markets, and is a fundamental issue with MLB. Owners are not going to jist throw cash around to win without a plan that also adheres to their business model.", "label": 0}
{"text": "*Philadelphia has entered the chat smelling of horse shit and battery acid*", "label": 0}
{"text": "They have a luxury tax. About a certain payroll threshold they start paying a penalty for going over that threshold.", "label": 0}
{"text": "Looks like a brown bag of popcorn", "label": 0}
{"text": "Of course they can, and they have in the past. You have to go back just 5 years for them to top the league in payroll. They made a decision at that point that they're not willing to anymore, which is coincidentally when they let Mookie go to the Dodgers.", "label": 0}
{"text": "This is like Face ID on iPhones but for cats it’s Sniff ID", "label": 0}
{"text": "The skater is [Greyson Fletcher](https://www.instagram.com/greyson_fletcher/?hl=en).", "label": 0}
{"text": "\"I know Kung Fu.\" :)", "label": 0}
{"text": "Just stand and film everyone", "label": 0}
{"text": "The dude dressed as the Joker went crazy this year", "label": 0}
{"text": "I mean, he's a fan, not an actual Dodger", "label": 0}
{"text": "True. That was [Kanaan Dern](https://www.instagram.com/kanaandern/?hl=en).", "label": 0}
{"text": "Fool of a Took", "label": 0}
{"text": "Detroit Tigers playoff roster was $18.9m this year…. Baseball is broken and they need a firm cap like the NFL has.", "label": 0}
{"text": "This is the weird things about North Americans sports though. Im not aware of a similar situation in Europe where there are riots and disorder in the city of the winning team, and really not that often in the city of the losing team. At the stadium and surrounding areas possibly, but that's it.", "label": 0}
{"text": "I couldn't agree more, a lot of the Guardians payroll is tied up in Jose Ramirezs salary.\n\nHe will forever be my favorite Cleveland player because he took less money to stay with the team.\n\nUnlike CC Sabathia, Albert Belle, Manny Ramirez, Jim Thome, etc.", "label": 0}
{"text": "I remember hearing it said that if the penalty for violating a law is a fine, it really just means \"legal for a price.\"\n\nThat's the approach the big-market teams take to building their roster, and if you've got the cash, why wouldn't you?", "label": 0}
{"text": "Well yea, they’re easy targets", "label": 0}
{"text": "Perfect kickflip", "label": 0}
{"text": "Woah, you’ve painted cats in space? I also painted one as a commission for a friend. Watercolors though. Promise I didn’t copy you lol", "label": 0}
{"text": "huge dry breadstick", "label": 0}
{"text": "Sanctimonious comments about European football violence happen *a lot* though...", "label": 0}
{"text": "Think I've seen him skate the Van Doren Invitational. Amazing skills", "label": 0}
{"text": "And almost enough frames to actually see it happen", "label": 0}
{"text": "![gif](giphy|caiwk3Ozv1fhqbmQ1t)", "label": 0}
{"text": "Lap chickens are the BEST chickens", "label": 0}
{"text": "Not to the constant level that LA and the NYY can. \n\nEvery team can go all in a few times a decade, but the Yanks and Dodgers can and will do it every season.", "label": 0}
{"text": "I thought it was popcorn.", "label": 0}
{"text": "Wouldn’t be surprised if the dude lost an eye.", "label": 0}
{"text": "a pupkin", "label": 0}
{"text": "The fire! For you!", "label": 0}
{"text": "Every single issue you have with the show, the show not only actively acknowledges but explicitly explores through the lens of a capitalist cyberpunk dystopia. It literally does the things you want it to do.\n\nBut you won't give it a chance past the first episode.\n\nIt's a shame because if you could get past your bias, you'd probably really like it.", "label": 0}
{"text": "That was either a very hard hit or a very thin bottle", "label": 0}
{"text": "I think that's exactly how you're supposed to be feeling.", "label": 0}
{"text": "It's because that exploitative feeling fits in with the universe. In anything else, it would feel out of place, or way too much, but in a hyper-capitalist pleasure-based-economy future, it fits. Keeps the uneasy vibe going the entire time.", "label": 0}
{"text": "I recognized it because he posted the same thing last year lol", "label": 0}
{"text": "https://www.instagram.com/reel/DBwVdO2PKqM/?utm_source=ig_web_copy_link", "label": 0}
{"text": "Can't wait to see what the Fallout from this would be.", "label": 0}
{"text": "Definitely a burrito my friend haha", "label": 0}
{"text": "Didn't know burritos were clear!", "label": 0}
{"text": "I'm a Cincinnati Reds fan, and I stopped watching because I got tired of seeing all my favorite players come back on other teams to beat us.", "label": 0}
{"text": "Wait hehe", "label": 0}
{"text": "☺️", "label": 0}
{"text": "I mean this as high praise: This looks like a Goosebumps cover.", "label": 0}
{"text": "Legit one of the craziest skate contests of all time!\n\nhttps://youtu.be/mKKgjoWYdrM?si=deZS6XQQpnr8GR1N", "label": 0}
{"text": "I wouldn't say that Trigger has a style. It's a studio made up of multiple directors and each has their own style. Just look at the two episodes of Star Wars Visions. Both were different directors and had their own style of animation and storytelling. Also the same director doing Panty and Stocking also did Cyberpunk Edgerunners. So even directors can change it up.", "label": 0}
{"text": "I think you’ll find it’s Ali G", "label": 0}
{"text": "This new Viagra Boys video goes hard!", "label": 0}
{"text": "If you watch enough anime you will be able to tell Trigger apart from other studios. Their style is most recognizable in the animation. They emphasize exaggerated almost cartoonish motion over other studios. If you watch any of their more popular titles (except dungeon meshi) I am confident you will recognize the style.\n\nUnfortunately if Edgerunners season 2 gets taken on by another studio it won't be nearly as fun. I'm not claiming it wont be any good, but most other studios would have landed on something that feels closer to stand alone complex. Great show. Not fun.", "label": 0}
{"text": "That is very good, nice work.", "label": 0}
{"text": "Lucky bastard", "label": 0}
{"text": "Hi! Take a look at your link url. This submission has been automatically removed because it is not a direct link. Please submit links ending in .gif, .gifv, .ogg, .mp4, .webm only (right click, copy link address). If it does not end in the aforementioned, then the submission will be removed from /r/gifs. Thank you. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "the frame no. 3 was my favorite personally!", "label": 0}
{"text": "He was even more happy when he [jumped](https://www.amazon.com/dp/B0B9ZD82JF?th=1&linkCode=ll1&tag=veid00-20&linkId=549a2e0e1612c1ed0c2db3abcc969b12&language=en_US&ref_=as_li_ss_tl) out that pumpkin!", "label": 0}
{"text": "A handshake with you, what's your point of view?", "label": 0}
{"text": "🙌", "label": 0}
{"text": "Beautiful, amazing work!!!", "label": 0}
{"text": "Choom*", "label": 0}
{"text": "Wait, it was double o's? Ohh.. thanks for the correction it's been a while, lol.", "label": 0}
{"text": "hey thanks!", "label": 0}
{"text": "thank you!", "label": 0}
{"text": "I just kept hoping for the old Far Side that was captioned “Nature scenes we rarely see “", "label": 0}
{"text": "Very good. But brick not hit back", "label": 0}
{"text": "I’ll never stop being annoyed by you beating your hackneyed style to death 10 times a day.", "label": 0}
{"text": "That did go over well.", "label": 0}
{"text": "You went to a place called Hellbomb, held by skaters, with demonicish imagery, and were surprised it wasn't run by Republicans? You're surprised the demographic for Rage Against The Machine, aren't right wing?", "label": 0}
{"text": "weird coincidence - I have been listening to that lately, tho I've never seen the music video that I remember -", "label": 0}
{"text": "Pretty sure they were referencing Helldivers, a video game. There’s a giant explosive dropped from orbit called a Hellbomb. The “democratic” reference is because it’s in game universe is extremely fascist and propagandistic spreading out into the galaxy and taking planets from their natural inhabitants for “democracy”, it’s satirical much like Starship Troopers.", "label": 0}
{"text": "same feeling I get camping in the rain :)", "label": 0}
{"text": "Same feeling I get camping in the rain :)", "label": 0}
{"text": "Ahhh , baby cthulhu with his first Halloween  costume.", "label": 0}
{"text": "Downvoted for making me think this was about Chris Jericho when it wasn't.", "label": 0}
{"text": "TIHI", "label": 0}
{"text": "I thought the same lol", "label": 0}
{"text": "I was fooled.", "label": 0}
{"text": "Amazing work!", "label": 0}
{"text": "I was scrolling through YT and found this last night! Absolutely worth the short watch.", "label": 0}
{"text": "Not gonna lie, it's kinda impressive", "label": 0}
{"text": "![gif](giphy|TaBRY9MzqfoDHfDrcx|downsized)", "label": 0}
{"text": "Would like to know more.", "label": 0}
{"text": "It's creative and he looks good doing it. 10/10", "label": 0}
{"text": "The ol' Olecranon Process is a process to repair.", "label": 0}
{"text": "And not ugly ducklings?", "label": 0}
{"text": "Who else was hoping the pole would collapse?", "label": 0}
{"text": "I definitely do something similar to this when I'm ice fishing", "label": 0}
{"text": "Defenestrated. Putin would be proud.", "label": 0}
{"text": "Not this election cycle (past 2 cycles as well)", "label": 0}
{"text": "Like masturbating on an airplane?", "label": 0}
{"text": "While i'm not a fan of this guy, it's their side that does AI murders, let's let them keep that, ok pumpkin.", "label": 0}
{"text": "Is trump a filtered word now", "label": 0}
{"text": "Interesting there is no /s after that comment", "label": 0}
{"text": "Rise above!", "label": 0}
{"text": "and he nails a 10 point landing in the oval office", "label": 0}
{"text": "This post has been removed because it activated an AutoModerator removal condition. The moderators have been notified. If the post was in violation of the rules, the link flair will be set appropriately. If there were no rule violations, the post will be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "This give me something, I don't what. But something", "label": 0}
{"text": "Do you have any examples? \n\nI mean, there's plenty of examples of disorder at soccer stadiums, but very little in the cities of the participating teams where the game was not played, and not in the city of the victorious team.", "label": 0}
{"text": "Oh they don't care if it's Trump. If you do this with Kamala they will scream racism though. They're folks with integrity like that you know?", "label": 0}
{"text": "Trump hasn't threatened anyone whatsoever. Stop gaslighting. The TDS has gone untreated for too long and it's turned into straight up cray cray.", "label": 0}
{"text": "I watched that far too long before I realized nothing bad was going to happen.", "label": 0}
{"text": "Is this the line for blumpkins?", "label": 0}
{"text": "I'm curious why dude in his underwear.  Thanks reddit for bein shit once again.", "label": 0}
{"text": "Defenestrate is my favorite word in the English language.", "label": 0}
{"text": "I’m an American, living in the desert. It’s currently 50 Fahrenheit and I’m freezing my fucking ass off. Granted I’m a massive baby when it comes to being cold. I have long sleeves on for anything under 80 degrees and sweatshirts 75 and below. Then layer as needed. \n\nId kill for this critters set up right now.", "label": 0}
{"text": "Yeah desert can be extremely cold...\n\nRight now where I live in Canada i's 17 celsius, pretty ok if you ask me !", "label": 0}
{"text": "Witch please", "label": 0}
{"text": "I’ll never be able to live anywhere that gets snow. It’s pretty and cool to see once a decade. But nah. Too cold.", "label": 0}
{"text": "Yep I understand ! Well I love ice and snow !\n\nI lived my whole life in France, and the most part in Bordeaux where we have a summer at few weeks 40+ celsius degrees, 2022, the year I told myself I need to get out of here, we had 5 weeks at 40+\n\nI hate hot weather, especially because no-one here has AC\n\nCanada and its minus 30 is fine to me !", "label": 0}
{"text": "Hi! Take a look at your link url. This submission has been automatically removed because it is not a direct link. Please submit links ending in .gif, .gifv, .ogg, .mp4, .webm only (right click, copy link address). If it does not end in the aforementioned, then the submission will be removed from /r/gifs. Thank you. Please review the guidelines in the sidebar about the types of submissions that are appropriate for /r/gifs\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gifs) if you have any questions or concerns.*", "label": 0}
{"text": "The way I look at it, its easier to get warm than it is to cool off. Even it's freezing outside, you just layer up. When it's hot it gets to a point you can't take anything else off and still be in public.", "label": 0}
{"text": "Pole is holding on for dear life", "label": 0}
{"text": "Oh yeah. Don’t come to the desert. It’ll be a weather shock for sure.", "label": 0}
{"text": "Please tell me that was your entire Halloween costume.", "label": 0}
{"text": "Gender bent sexy professor McGonagall... *Unzips*", "label": 0}
{"text": "Cold is relative. You adapt to it a lot more than most people think. Spend a few years in -30 and you get used to it.", "label": 0}
{"text": "I’m cool with the heat. Obviously everyone has their limits there. Mine is pretty high. But with lower temps you can also layer and get warm that way. With heat you can only strip down so much before you’re on a list.", "label": 0}
{"text": "idubbbz returning to form?", "label": 0}
{"text": "Yeah that's why I'm not a fan of the heat. Summer here is perfect. No rain, nice and warm and sunny, but not unbearably hot. Winter has gotten very mild over the last ten years, and aeems like in 10 years it will barely snow here, so I'm good. Where you are might become too hot to live soon unfortunately", "label": 0}
{"text": "[Bayonetta would approve.](https://www.youtube.com/watch?v=oQ2QgcRrWlc)", "label": 0}
{"text": "Ok, what did you expect :D?", "label": 0}
{"text": "Exactly", "label": 0}
{"text": "I was sure the pole would fall over on the sixth watch", "label": 0}
{"text": "No it's 2025", "label": 0}
{"text": "You seem to be misunderstanding how a studio works. There is no one style for Trigger. I already gave you examples but here are some more. Kill la Kill, BNA, Promare, Cyberpunk, Little Witch Acadamia are all Studio Trigger but have different style of animation and story. Now looking at just these, Kill la Kill, Cyberpunk, and Promare fit the description you gave of cartoonish style but this is not typical of the others. This is simply the works of the same director Hiroyuki Imaishi. This is HIS style, not Trigger as a whole.  \n\n  \nNow look at my other examples. They too have their own style that is different from Hiroyuki because the both have a different director named Yoh Yoshinari. You claim that watching enough anime will make you able to tell them apart from studios. You are part right. What meant to say is that it will help you tell the DIRECTORs apart.  \n\n  \nNow go watch Star Wars Visions season 1 and see if your observation skills can tell you which two episodes are from Trigger. I'll give you hint they are each done by a different director and one of them is indeed that cartoonish motion that you mentioned. The other episode however is not.\n\n  \nYour view on Edgerunners 2 may be correct but it is just an opinion. The only thing I'd look forward to is how any studio, Trigger included, makes it their own story in that setting. This is what will make it good or not. It shouldn't be an objective to continue on with Season 1. Just make a new compelling story and it could even turn out better.", "label": 0}
{"text": "My goodness, my manwitch.", "label": 0}
{"text": "\"Okay, Potter... BACK TO WORK. Those floors aren't going to sweep themselves.\"", "label": 0}
{"text": "Are you telling me you cant see similarities between the 5 anime you named off? I watched star wars visions without researching the studios ahead of time, and and twins episode was immediately recognizable as Trigger. The other I do not recall the details of, but I looked up the director who did the other one (Masahiko Otsuka) and he has a long history with Trigger making stuff in their specific style. The director of a show can change from episode to episode, but Gurren Lagann was the same totally bonkers action from start to finish. \n\nIf another studio was forced to adopt the Trigger style and make a season 2 it would be a disaster. That almost certainly wont be the case because it would be a waste of resources. The reason I worry is because scifi is quite rare in the anime industry and when it does appear its usually more introspective than fun. \n\nLets take an example of the opening scene. What was happening was pretty messed up, but trigger in their totally ridiculous style made it feel so over the top that I doubt it freaked many people out. If Production IG did the opening scene of Edgerunners it would have been much more grounded and horrific to watch, likely meant to actually make the viewer afraid of cyberpsychos.", "label": 0}
{"text": "You're a stripper now Harry!", "label": 0}
{"text": "You gonna do prints? That will sell out.", "label": 0}
{"text": "There were Oregon Trail mods?", "label": 0}
{"text": "https://i.redd.it/yo6xmgkekeyd1.gif", "label": 0}
