{"text": "I wouldn’t surprised if he got popped a boner right there, fucking loser.", "label": 1}
{"text": "Im not convinced this mfer isn't just an ai robot with some skin stretched across it.", "label": 1}
{"text": "flailing dipshit", "label": 1}
{"text": "I stopped reading at christofascist. You're a fucking moron.", "label": 1}
{"text": "Obviously true and not a slave! Haha Trump is off the rails (unfit) and he made them his slaves. How fucking dumb. What a fucking joke world we live in that all this, all this time is seen as okay, and not enough for the higher governmental powers to step and be like \"that shit won't work in this day and age\" shitty shit. In a way, I hope Trump loses and all his followers try Jan 6 again. But this time there are lots of military with guns, and if there are a few casualties, that's fine. You reap what you sow you fucks, You dumb ignorant maga fucks. I hope in the end when that orange bastard eventually dies, you all see the error of your ways. You can continue to be the racist terrible part of society that will always exist but you won't have your sharting leader to embolden you. How goddamn dumb. In 2025, you all will share the same ideologies as people from 1825. You all should have taken his advice and injected yourselves with bleach. Goddamn this got me riled up. In conclusion, fuck y'all.", "label": 1}
{"text": "Fuck is this clown weird.", "label": 1}
{"text": "Thank you for voting for a rapist.", "label": 1}
{"text": "If you are encouraged to vote for Trump because of this human wart you deserve to be enslaved in servitude.", "label": 1}
{"text": "No.  Tag NSFW in the fuckin post.  wtf mods fr fr.", "label": 1}
{"text": "Ok, he's a gross pig.", "label": 1}
{"text": "Just so you know, you sound blind, pathetic, and desperate all at once. He is simulating oral sex. That is what is happening. Stop lying ymgo yourself.\n\nSo God damn pathetic.", "label": 1}
{"text": "I’m not defending his honor. I’m getting tired of you dipping fucks just to make everything worse than it is.\n\nThe crowd obviously reacts to him talking and simulating a dead mic. It’s actually fucking crazy how stupid some of you guys are or how you’ll blatantly lie about something and then defend it", "label": 1}
{"text": "If this was the principal at their kid’s school, they would scream grooming. Perfectly fine to elect him to run the country.", "label": 1}
{"text": "Such a brave and tough keyboard warrior. Make sure your mom brings you down a cookie to the basement for your hard work.", "label": 1}
{"text": "He may be weird but [Kamala will destroy everything we love](https://amzn.to/3UyncHO)", "label": 1}
{"text": "Senile orange man gives awful blowjob to long thin black cock while dozens of people watch.", "label": 1}
{"text": "> Trump already proposed 15% tax break on American companies.\n\nperhaps learn to read. 50k for first year small businesses. Not every corporation, which would put more burden on tax payers.\n\n> With tax payers to support immigration\n\nOK Loool, yeah this is a waste of time. Youre just another maga troll acting like you want discourse, but youre just pulling bullshit out of your ass and bending over backwards to defend a traitor to the united states.\n\nHave fun not wasting my time further. Warning to others, just tag and block this guy. Lol waste of fucking time.", "label": 1}
{"text": "I take it you didn't watch the actual.video. I bet you won't watch the clips of him winning on Tuesday either when it happens", "label": 1}
{"text": "Looks like he is imitating Kamala Salad going down on Tim Waltz lmao.", "label": 1}
{"text": "He’s taunting personal details about Kamala’s career. No class at all ", "label": 1}
{"text": "My boomer dad calls Kamala horrible things, this would only reinforce what he thinks about her ", "label": 1}
{"text": "It could be a woman too ", "label": 1}
{"text": "My boomer dad is one and he just calls her denigrating terms anyway so basically cheers him on ", "label": 1}
{"text": " could be a woman’s penis which would make him straight ", "label": 1}
{"text": "He’s referencing Kamala and Willie Brown, her career promotions ", "label": 1}
{"text": "His impersonation of how Kamala rose to power!", "label": 1}
{"text": "Yall laughing at a old guy playing with a microphone thats not working. You are the joke.", "label": 1}
{"text": "You're angry. You should go dye your hair a different color again. You will cry hard in a few days and I will laugh. Maybe you'll even realize that your dog shit anti American beliefs were sad. You eat CNN shit for breakfast. Have you seen that our \"Hitler\" is about to be your supreme leader. Oh and he'll definitely sick the military on you lol", "label": 1}
{"text": "Maybe Jesus was a raging homosexual, who nose?", "label": 1}
{"text": "Trump is now sucking the mic like a cock.  Miss a minute of news and...this!  Trump is jealous of that mic comapred.to his tiny gross dick.  Trump. Sorry you have a small cock.  But it's funny that a pornstar said Trump has a tiny gross cock.", "label": 1}
{"text": "Why would I say something bad? I voted for her ", "label": 1}
{"text": "Looks like Trump just gave a masterclass in mic technique... for a very specific audience! 😂", "label": 1}
{"text": "Lmao you’re projecting. I’ve not lost nothing me\nAnd my friends can disagree without doing like you idiots. I have liberal friends and conservative friends.", "label": 1}
{"text": "To all the idiots that believe that Trump is a waste of candidate, let me ask these questions about Biden. \n\nWhat about the trillions that Biden handed out over $8 billion to Ukraine while giving nothing to his own citizens? What about leaving the border open for just ANYONE to come in without the proper legal processes? My own mother, who is Canadian, is trying to become a citizen the correct way and she will likely have to wait years before her application is approved while a dude can simply just hop the fence and instantly live a life here in this country. What about plummeting our economy into the crapper and making it to where daily supplies for living such as groceries, gas, apartment rent, and homes all go up in price? How about the fact that none of you would even have a vaccine to give at all if it wasn’t for Trump expediting it with Operation Warpspeed? What about the fact that Biden also wiped out baby formula from supermarket shelves and shipped crates of it to the southern border while leaving nothing for American mothers? What about Biden putting perverted and pornographic material into school systems that exposes children to material that shouldn’t even be in their minds at such a young age? What about Biden putting laws into place that allow children to make huge decisions about their own medical care and life-altering surgeries that could potentially damage them down the line when they aren’t even aware of who they are or what they want in life yet? What about Biden dragging the US into a war in the middle east? \n\nAlso, and this Biden fuck up is a beauty…. What about when Biden rapidly pulled troops out of Afghanistan with no real organized process and left billions of dollars worth of military hardware and weaponry in the hands of the Taliban?", "label": 1}
{"text": "Oh wow. I heard he did this in another post and just assumed it was an exaggeration, like he had moved bis hand in an odd way or openened his mouth in an odd way near the mic.\n\n...but fuck, he's REALLY going for it there.", "label": 1}
{"text": "This is what we get for electing a black man into office", "label": 1}
{"text": "Yeah Kamala is a man in disguise ", "label": 1}
{"text": "Omg the TDS is strong with you 😭😭😂😂", "label": 1}
{"text": "Your party kills babies by the thousands.", "label": 1}
{"text": "Yet another Reddit mod that can take nothing seriously. Why am I not surprised?", "label": 1}
{"text": "You mustn't have seen the way u/BirthdayBoyStabMan talks to others before this, then, because he isn't charismatic in any way.\n\n\nNo way in heck somebody who would post something like this has friends or anything to do with their time.", "label": 1}
{"text": "Donald’s dick suckers", "label": 1}
{"text": "You are a fucking fool, and I hope nobody wastes their time arguing with you because you’re delusional.", "label": 1}
{"text": "lol. mimicking Kamala", "label": 1}
{"text": "Totally making it great again......", "label": 1}
{"text": "Wow.  Mod must be a hell of a thin-skinned, neck-bearded, bitch.  Threatening people who report them.  Adding insults to people's handle.", "label": 1}
{"text": "Hahahaha imagine being this much of a sycophant loser", "label": 1}
{"text": "[removed]\n\n\n[removed]\n\n\nHahahaha", "label": 1}
{"text": "Stupid fucks listen to stupid fucks on Reddit instead of making their own decisions. \n\nTariffs are a good thing but I'm not here to try and educate you. Good luck guy/girl from this gif 🤘", "label": 1}
{"text": "Sounds like you're crying? Stfu", "label": 1}
{"text": "You're scared!! Bahahahaha", "label": 1}
{"text": "The concept of immigrant Hispanics basically doing the \"got mine fuck you\" thing to other Hispanics trying to the same makes me want to drink myself in to a coma.", "label": 1}
{"text": "Says fucking who? The serial liar who lies about god damned everything?", "label": 1}
{"text": "Fuck you.", "label": 1}
{"text": "Automods need to be banned. Do you job as a moderator or don't do it. cowards.", "label": 1}
{"text": "Cringe", "label": 1}
{"text": "Oh blow it out your ass", "label": 1}
{"text": "This is nice. It teaches kids tedious, repetitive tasks that prepare them for the real world.", "label": 1}
{"text": "Reddit hates freedom of speech", "label": 1}
{"text": "You clearly have your own little definition. So please, define it for me.", "label": 1}
{"text": "Reddit has been suppressing pro-trump content for months, if not years.", "label": 1}
{"text": "Cringe", "label": 1}
{"text": "How can you equate anything I've said with yelling fire in a movie theatre. You've clearly been indoctrinated by some kind of agenda", "label": 1}
{"text": "You're delusional. You'd be disagreeing if things were the other way round.", "label": 1}
{"text": "Mods are nothing.", "label": 1}
{"text": "So true", "label": 1}
{"text": "Who's emotional?", "label": 1}
{"text": "You sure are dumb. I almost admire your fortitude.", "label": 1}
{"text": "Good job, Sherlock! Do you want a medal?", "label": 1}
{"text": "Who's that?", "label": 1}
{"text": "No comments(Disabling), no online views", "label": 1}
{"text": "Good one", "label": 1}
{"text": "Love bird", "label": 1}
{"text": "You guys a seriously meltdown morons 😂", "label": 1}
{"text": "Stop posting Kamala. The elections are already over.", "label": 1}
