{"text": "i think m0nesy and niko are just simply better players in playoffs when you compare them to zywoo and spinx. vitality wasn't having problems getting to events, they were having problems advancing in playoffs. im pretty sure i remember there was a time when only magisk and dupreeh were actually alive in the playoff games and that's saying a lot.\n\nlook, i'm not gonne argue with you that money wasn't a primary motivating factor for them to join the team. remember what zonic got as a gift for helping them overcome their problems and eventually get them a major? a salary cut. of course magisk wanted to follow him, especially coupled with the idea of playing with m0nesy, spinx and twistzz, and when you look in retrospective, at the time, they were simply... just better players in every aspect than the teammates in vitality, only argument u can have is for zywoo but zywoo often goes missing in playoffs and monesy doesn't, and i say that as a zywoo fan.", "label": 0}
{"text": "At the very least the last guy could have just waited in aps and played the fake defuse game. Noktse would have been forced to second guess where the last is and would have been more likely to make a mistake", "label": 0}
{"text": "Yea but it also doesn't matter really. It's way easy to just ship it and let a million people test it at once. You'll find the problems faster and frankly it just doesn't matter all that much. There's not even a t1 tournament going on, the 24 hours of nades having a sound bug won't even be remembered by 2025 except by weirdos who can't let things go", "label": 0}
{"text": "Just post recorded games of such ,,cheaters” … you won’t huh ? \n\nNo need to feed the troll more", "label": 0}
{"text": "hellraisers erasure right here", "label": 0}
{"text": "Dota is not suffering at all.", "label": 0}
{"text": "I get that but why is that inherently bad? It add strategy", "label": 0}
{"text": "It’s not a prefire when he stands for a couple of seconds to tap/spray you xD", "label": 0}
{"text": "Depends on a few things\n 1.your region. Asia has the most cheaters 57% in 25k+ Rating. Europe 20%. NA only 1.8%. (leetify )\n 2. Your Trust Factor. The lower the trust factor the more cheaters you meet\n3. Your Rating/MM rank. The Higher in each the more cheaters you meet.\n\nAll new players who want to test cs2 have bad trust factor and are facing cheaters. So they play exactly one game and will never touch the game again.\nA new released FPS game in 2024 should have a friggin working anti-cheat. Valve is a billion dollar company. But they dont care about the cheaters.\nEvery other game would have died its just that cs has skins and faceit.\nIts not acceptable and shouldnt be toleranted.", "label": 0}
{"text": "All Props to Ropz.", "label": 0}
{"text": "Unreal ? 😂😂😂😂", "label": 0}
{"text": "I’ve been accused of aimbot often so that statement doesn’t resonate with me at all. \n\nI’ve never seen the instant 5 wallbang headshot with scout from across the map— so if that’s what you’re talking about then there’s no way it’s every game", "label": 0}
{"text": "i can smell cheats in this clip what do you guys think?", "label": 0}
{"text": "I have bound my \"k\" to \"say discord.com/download\". It just spams the link to download discord in chat. Either i get muted or ppl start speaking english so its a win win.", "label": 0}
{"text": "That was the buildup of holding off 3-4 months of engine updates/signatures. Likely also engine stuff from deadlock carrying over. So naturally you prob expect a bunch of low level stuff to break like VIS did, and it’s not an easy solution that maybe only certain devs can fix. \n\nFixing VIS to help with fps is probably very complicated and not a usual bug. \n\nClearly devs are at least tackling most issues as they pop up in a decent timetable.", "label": 0}
{"text": "Which is why I said it’s a better example of something to be upset about", "label": 0}
{"text": "What would this have to do with subtick?", "label": 0}
{"text": "Even *if* there is a tournament going on, they pin a specific version from the Beta tab in Steam and.... oh wait, Valve hasn't released rollback beta branches in a month, last being version 1.40.3.0 (We are currently on 1.40.4.1), and prior to that they barely did as well. They used to consistently do this in CSGO, no idea why they do it so rarely now.", "label": 0}
{"text": "Not in casual though? Or was nade damage on even in casual back then?", "label": 0}
{"text": "Oh I do agree, I just want to reiterate that even small things like this simply add fuel to the fire. The overall context is important and it’s akin to you spilling coffee on your shirt in the morning, and as a result getting excessively frustrated over dropping a pencil or such. Call it compound frustration.", "label": 0}
{"text": "No macro coach (strats, system), only micros (hold this angle like this, not like this). Mistakes dont get spoken enough about / he’s too nice.\n\nPer apex interview", "label": 0}
{"text": "Preach on", "label": 0}
{"text": "gotta lower ur adderall prescription", "label": 0}
{"text": "Niko igl-ing s1mple would entertaining", "label": 0}
{"text": "I cant tell of youre trolling.", "label": 0}
{"text": "###You need to have more [interaction](https://www.reddit.com/wiki/commenting#wiki_commenting) with the /r/GlobalOffensive community before posting video or stream links.\nThis has become necessary to combat video spam & people who only use the subreddit to blatantly advertise their content. These requirements are quite low, and any reasonably active commenter should reach them easily.\n\nTo increase your interaction:\n\n* Engage in *quality* discussion in the comments of other people's posts\n* Try making text-posts that do not relate to or promote your own content.\n\nSpamming low-value comments just to meet the interaction requirements will get you banned.\n\n**Do not** contact the moderators asking about the participation level required for submitting content, and we do not allow exceptions to the interaction requirements - everyone who posts video/stream links has met these requirements, and so will you. \n\nYou can find our rules regarding advertising and self-promotion [here](https://www.reddit.com/r/GlobalOffensive/about/rules/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Brother no lol how many times do you need to go down this road", "label": 0}
{"text": "Navi is the 1 roster to be better after 6 months than anything they showed in the first 6 \n\nNormally teams show their peak in the first 3 months, Navi you remember because they’re the outlier, but try to come up with another T1 team that improved so much after their first 6 months…", "label": 0}
{"text": "siuhy magic, all him", "label": 0}
{"text": "People are teleporting while walking around, ion think thats placebo jus cuz it isnt happening to you", "label": 0}
{"text": "Karrigan, NiKo, rain, m0NESY, s1mple? That team could fuck", "label": 0}
{"text": "The only real away around this is for event organizers to raise prices. \n\nIn theory scalpers correct a market inefficiency when things are priced below market value.", "label": 0}
{"text": "Falcons are calling 📞", "label": 0}
{"text": "Could be the 25th by tomorrow", "label": 0}
{"text": "Delete this", "label": 0}
{"text": "It's always been like that, no matter it's CSGO or CS2 lol.", "label": 0}
{"text": "What's your in-game network bandwidth setting at?", "label": 0}
{"text": "The other team getting that prime cs expierence", "label": 0}
{"text": "Same problem for me.", "label": 0}
{"text": "he's alright i guess", "label": 0}
{"text": "what do they stand for?", "label": 0}
{"text": "after the new update its happening a lot.", "label": 0}
{"text": "I was trying to do the same thing with a similar sticker, were you able to figure it out?", "label": 0}
{"text": "Fr im tired of people saying internet or pc issue when its not bad for other games. Idk why ppl are fighting on valves side instead of atleast being like damn that sucks thats happening to you. Just naw\nSkill issue\nPackets 1-5 clearly missed lol", "label": 0}
{"text": "Sucks you right", "label": 0}
{"text": "human rights abuses, no womens rights, no LGBTQ+ rights, actual slave labour being used to build all the fancy facilities they have, etc.\n\nsideshow, a valorant caster, has an excellent vid about saudi sportswashing in esports", "label": 0}
{"text": "They are just 1 big spend away from getting the max win, don't give up early.", "label": 0}
{"text": "But what about those patch notes where there are too many characters? You know, the ones we get once a year", "label": 0}
{"text": "Feels bad man. Mine is flat all the time.", "label": 0}
{"text": "Honestly I think it'd be a cool idea", "label": 0}
{"text": "No thank you. Unless it's for comedy.", "label": 0}
{"text": "Maybe. But mine is flat all the time. No issue at all.", "label": 0}
{"text": "i would've tk you for that smoke, even after the ace", "label": 0}
{"text": "Again. The issue is not with invincibility but someone spawning right where you were when you back is turned. Imo not that difficult to understand. That does not happen on custom DM servers.", "label": 0}
{"text": "Where to check it?", "label": 0}
{"text": "nope, its not related to binds, seems like a performance thing but its happening to everyone i know", "label": 0}
{"text": "This is the most egoistic thing in pro cs, extremely talented mechanical player getting old and switching to igl role as if it's the easiest thing ever. It's like \"oh I'm not as good as i used to be, guess I'll igl\"\n\nHas there ever been a talented mechanical player who switched to igl late in their career and actually did well as an igl?\n\nIs he also gonna igl in falcons? Surely not, right? And if not, what's the point if doing it for his last stint in g2? What a mess", "label": 0}
{"text": "They bought tournament spots and that's how they get their ranking points. They are the EU/Middle east EG of CS", "label": 0}
{"text": "Ppl don't realize how bad is this bot problem, if you guys really want a picture of the problem, just go to the ESL public group on steam and you will find that nearly half of the group are farm bots.\n\nSome people have over 1400 bot accounts.\n\nThe ESL group had 500k+ members...", "label": 0}
{"text": "Clearly ynk wants to kick snapi out", "label": 0}
{"text": "Waste of a smoke or?", "label": 0}
{"text": "I think it's honestly the kind of situation where Niko could get a good start on IGLing.\n\nNiko obviously knows how to think on the superstar individualistic level, and maybe he could put that use to help set up simple into the space he needs to find his form. \n\nWatching their match against Saw earlier it just seemed like Simple was just getting caught out trying to follow the rest of his team around. He seemed to just lack any chance to do something. \n\nNiko is also someone that Simple might actually have enough respect for to really make a decent team.\n\nIdk, all im saying is, I don't think it would be the worst idea this time", "label": 0}
{"text": "I personally wouldn't rate s1mple above m0nesy in current forms", "label": 0}
{"text": "99% of people itt have spent less than 10 minutes of their lives thinking about this topic but everyone has a rock solid opinion lol", "label": 0}
{"text": "the fact that this team could have dominated in 2017 and still be contenders in 2024 shows how good these players truly are", "label": 0}
{"text": "I think Niko and S1mple have a high enough respect for each other that I actually could see them getting along very well and tackling things very objectively.", "label": 0}
{"text": "that desk was excellent but i'd rather not have the literal white supremacist on a desk", "label": 0}
{"text": "Not necessarily, but smokes straight on a site tend to screw your own team over more than it helps", "label": 0}
{"text": "I think the overal concept is what separates a lot of these guys from the tier 1 pros is thibgs outside of aim like their mental and teamwork. As yeah Donk is on another level but players like Ropz made it onto tier 1 teams by acting like professionals and being good to work with.\n\nAnd its not like its one or the other, from what people have said Donk is quite modest irl. But someone like Smooya is very difficult to work with.", "label": 0}
{"text": "Do you remember any other superstar team?", "label": 0}
{"text": "Your GPU isn't even running at its full speed for the express lane on the motherboard is a generation behind. That's not including the bottleneck the CPU is causing.", "label": 0}
{"text": "Damn, nice shots!", "label": 0}
{"text": "Scream back at them 🤣", "label": 0}
{"text": "The more annoying in lower ranks is when you throw it halfway somewhere safe, but then a guy picks it, and goes somewhere close to enemy positions. Sometimes all he does is delivers the bomb to opponents. But even if not, it forces me to stay near and play off him, knowing how easily he can lose it. And communicating in low ranks often leads to angry outbursts for no reason.", "label": 0}
{"text": "better get nexa", "label": 0}
{"text": "Everything before 2500 elo is a hellhole full of toxic bots who think they are better than they actually are so don't be too harsh on yourself, keep playing, mute them as soon as they start talking shit.", "label": 0}
{"text": "\"last few years\"\n\nits been longer than that.", "label": 0}
{"text": "Just gotta mute and downvote them at the end of the game.\nI recently reached LVL 10 and I get shit talked a lot from LVL 10 players.", "label": 0}
{"text": "Your post was removed under [Rule 2](https://www.reddit.com/r/GlobalOffensive/about/rules).\n\n\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive&subject=Thread%20Removal).", "label": 0}
{"text": "Its around twice the price of the 5700x3d in the UK at the moment...", "label": 0}
{"text": "Gelsinger**: \"but but don't forget about our efficient p cores\"**\n\ngamersnexus \"just buy the 7800X3D\"", "label": 0}
{"text": "Was he ever a star rifler? He's been an igl for quite a while", "label": 0}
{"text": "VP makikg f1ku look good", "label": 0}
{"text": "Good those things are annoying.", "label": 0}
{"text": "What does the setting do?", "label": 0}
{"text": "They put their own drinks in the sponsored cups, and they used to wear sponsored headsets over their in ears, so they can just pop an \"Core i9 Inside\" sticker on that AMD pc", "label": 0}
{"text": "> Other teams would have no patience and basically want results as soon as possible (G2 and Vitality)\n\nBut Vitality did this exact thing when they signed Dupreeh, Magisk, and Zonic", "label": 0}
{"text": "Says he’s uneducated on a matter\nDoesnt try to help his problem\nLeaves\nAverage valve bootlicker", "label": 0}
{"text": "He was insane in 1.6. No one ever thought he'd be an igl", "label": 0}
{"text": "I'm no furia fan either but Kye was cheeks and they just benched art who was hogging igl to the teams detriment.", "label": 0}
{"text": "I mean… yeah ", "label": 0}
{"text": "You’re in luck then because none of them are!", "label": 0}
{"text": "wow, weird thing thorin defends a racist chrisJ and [follows nazi accounts on twitter](https://twitter.com/VenaFoz/status/1848417591116587210) then", "label": 0}
{"text": "Real shit\nMy amd 570 ram better csgo than my 4080 super in cs2", "label": 0}
{"text": "Is he that desperate to lose a GOAT rifler to the IGL role?", "label": 0}
{"text": "And what’s so and about taking responsibility?", "label": 0}
{"text": "Yeah there's something truly special about Niko and s1mple still being elite players throughout a whole decade of Tier 1 CS", "label": 0}
{"text": "Faceit just added a new division to NA and EU, I can't imagine the league will go away. Pro League still has qualification spots from ECL next year.", "label": 0}
{"text": "polling rate.", "label": 0}
{"text": "Did they win according to number of superstars in their team?", "label": 0}
{"text": "Nah in theory they choke supply when demand is high and fabricate a shortage which drives price. Right? The market is finite.", "label": 0}
{"text": "\"i can't be racist, i have friends of colour\"\n\nhe's actively defending chrisJ who was arguing that James Bardolph is somehow \"not british\"", "label": 0}
{"text": "i feel you on this i get it bad depending on the situation in the game that i am playing like DBD, Halo 3, Elsword or any type of game were its competitive where it just spikes and am shaking either when am playing or after the match takes me about 5 minutes to calm down its crazy. its the adrenaline from your brain being tricked into a real flight or fight thing its like you think that you are truly in danger even tho you are playing a video game. the human body is a mystery", "label": 0}
{"text": "that'd be the shittiest team of all time, but I'd be there for it lmao", "label": 0}
{"text": "G2, Kinguin, Faze. Whenever there were too many superstars those same players couldnt win much tournaments.\nLiquid earned same as these superstar teams. \nFFS even Gambit achieved more", "label": 0}
{"text": "man, s1mple doesn't have respect for anyone, and I mean that in a very nice way. he's fucking s1mple", "label": 0}
{"text": "i suspect he doesn't want to do it. it's the easiest way to get replaced on a team with freaking Niko & S1mple", "label": 0}
{"text": "2018 FaZe swept the floor before Astralis were in their prime time", "label": 0}
{"text": "My brother in Christ, FaZe Clan with the aforementioned roster won Kato, Cologne and a Major in 2022, then EPL Season 17 in 2023, which also gave them the Intel Grand Slam. If that's not winning enough with their stars I don't know what the fuck is.", "label": 0}
{"text": "once i was browsing ESEA teams and i applied for Alternate Attax but sadly i didn't get to try out... had a chill talk with the manager or whoever it was though! (2018)", "label": 0}
{"text": "That's fair. I only recall one of the clips briefly, but that's a reasonable example for the tension. It did feel heated, emotions running higher than usual.\n\nI will say that in regards to CIS teams, one's gotta consider that what would be really toxic from western PoV (even if it objectively is) is not really as 'palpable' to the people within the team just based on the general more aggressive style of communication they usually have. \n\nStill, there's no denying that there's difference between real brewing tension and tough love, healthy aggression / intensity or just how CIS teams usually communicate verbally. You might be right that it's the former here more so than the usual, especially given their struggles in recent times.", "label": 0}
{"text": "Oh boy, Intel.\n\nHow the turn tables..have turned...", "label": 0}
{"text": "Faze a superstar team won  3 majors on how many years? Compare this to some teams like Gambit without any true superstar.", "label": 0}
{"text": "Glock fade kick flip yy ladderstall off of high rise on Xbox 360", "label": 0}
{"text": "Can't be any worse than whatever the fuck they're doing now lmao", "label": 0}
{"text": "We'll just pretend m0nesy was GuardiaN", "label": 0}
{"text": "IDK it seems like it would be way easier to get replaced if you aren't putting up good numbers and aren't the IGL, at least as IGL there would be an excuse (although I don't see Zonic letting them kick Magisk either way, either they both stay or both go)", "label": 0}
{"text": "don't plant when it's not safe imo", "label": 0}
{"text": "Ok NiP at this point it's not even funny anymore.", "label": 0}
{"text": "> loosing", "label": 0}
{"text": "obstructing your team vision and allowing the CTs to close in on site. of course it allowed you to go from behind and do the ace but you are just lucky the CTs had a silver moment. considering it's your first ace clutch, 99% of the time you would've just died and lost the round. like i said nice ace clutch but you need to consider what you and the nades you throw don't impede on your team. that smoke was one of the reason your whole team died", "label": 0}
{"text": "This is cool. I’ll definitely try it out. CSNades has a similar look and feel, but with preset utility points and the ability to favorite them and only show your favorites, etc.", "label": 0}
{"text": "well they presumably couldn't get monesy (if he doesn't join), so s1mple was their next best thing.", "label": 0}
{"text": "can be wireless interference. if you have router or other wireless devices right next to your mouse, try moving them. if your mouse came with a long cable to plug the receiver into, use that and put the receiver right next to your mousepad. \n\notherwise, try different usb ports, make sure they arent on low energy mode (unlikely for desktop).", "label": 0}
{"text": "What makes Niko good igl ?", "label": 0}
{"text": "why did the defuse come in so late ? BlameF saw him on short no ?", "label": 0}
{"text": "Tbf monesy was pretty good at 12.", "label": 0}
{"text": "I had this problem with a mouse with high PR. Turned it down", "label": 0}
{"text": "i thought this was a client side problem, is it happening to everyone?", "label": 0}
{"text": "i think they are waiting for the new season to introduce maps", "label": 0}
{"text": "Building falcons around simple will be super fun to watch at least. Always good to watch simple frag", "label": 0}
{"text": "I'm pretty sure he subbed for donk before in some online tournament.", "label": 0}
{"text": "Dude, Team Falcons is as far from a \"Win Now\" philosophy as humanly possible. The only and I mean only purpose of that team is sportswashing. The org does not need to win and does not need to be profitable. They did not get S1mple because they want to win. They got him because they want to be popular and they want people to like them. If they could get Fallen right now, they would do it immediately, because that would bring fans from Brazil. Saudis have infinite money to burn in this kind of thing. \n\nTeam Falcon's number one purpose is NOT winning. How many times does this have to be said?", "label": 0}
{"text": "You sign s1mple and NiKo for likeability and sportswashing. The ONLY reason they did this.", "label": 0}
{"text": "This monte team has what it takes.", "label": 0}
{"text": "There should be no item between mouse and it's senor connected to cpu", "label": 0}
{"text": "Yes, I said shouldn’t not that they don’t.\n\nAnd using pool as an example is just funny.", "label": 0}
{"text": "Nah, it's really not. \n\nAim is a gatekeeper. All pro players (and high level faceit players) have good aim. You HAVE to have good aim to even be on a Main team. \n\nAt the highest level the game is more about movement positioning, movement, comms, game-sense/map control, teamwork, etc.", "label": 0}
{"text": "That’s because every other game there is massively interpolated. I’m old enough to remember multiplayer games that had 0 lag prediction where you had to aim a certain distance in front of someone depending on what your ping was. OG Halo on PC was particularly bad.", "label": 0}
{"text": "From what has been shown since Lucaozy’s joined, I really don't think MIBR is making it through the RMRs", "label": 0}
{"text": "r/dataisugly", "label": 0}
{"text": "yeah but forze's entire roster was literally benched by the org when they faced eachother and they had smooya stand-in for a CIS roster because their awper just got a 2 year ESIC ban for match fixing. truly one of the most hilarious losses of all time", "label": 0}
{"text": "Forget about one sole year. From five superstars i would expect year like that to be every year", "label": 0}
{"text": "So that's what his nickname about.", "label": 0}
{"text": "I probably would have just thrown the smoke towards short A to discourage CTs from pushing through from catwalk, but hard to say without full info from the round.", "label": 0}
{"text": "I don’t think you realize how much interpolation other games have.", "label": 0}
{"text": "To be fair, he didn't play for NIP back then.", "label": 0}
{"text": "\n>There doesn't seem to be an IGL  (rip Snappi) out there that can probably handle both s1mple and NiKo\n\nHow much would Dalai Lama cost?", "label": 0}
{"text": "what the heck are the comments and their accounts...", "label": 0}
{"text": "Only jocab is a stand-in. MisteM is on the regular roster.", "label": 0}
{"text": "After the update packed loss been going crazy", "label": 0}
{"text": "No weapons? Ffs when did we become so sensitive?", "label": 0}
{"text": "Scalping bots", "label": 0}
{"text": "I mean if anyone star rifler could do it I think he could, perhaps. TON of experience under his belt. Even if you drop a bit of aim he is still top fragging on a good day. Fuck it, gotta win A major..", "label": 0}
{"text": "Any model will block a section of your screen that could eventually cause your death depending on what angle you're looking. \n\nHis model actually covers less screen area than the default one.\n\nThis could just as well be \"biguzera dying to left hand model\"", "label": 0}
{"text": "then what’s the point of your title lol", "label": 0}
{"text": "Probably my wisest hardware purchase ever, incredible CPU for gamers", "label": 0}
{"text": "And what mouse is it?", "label": 0}
{"text": "What headset/audio setup you using? Personally I find the audio as it is to be awesome, but I run DT1990's with amp/DAC combo. Makes everything crystal clear and easy to tell apart.", "label": 0}
{"text": "Blamef here is just so fitting.", "label": 0}
{"text": "Fuck no", "label": 0}
{"text": "After all these times VP saved... it's time someone saved VP.", "label": 0}
{"text": "yeah that’s how viewmodels work 👍", "label": 0}
{"text": "ur actin like i dont crucifiy furia just cuz i have the flair. i been sick of them for a while bro😭😭🙏", "label": 0}
{"text": "es3tag most overrated paycheck stealer.", "label": 0}
{"text": "Agree, it was a fun feature", "label": 0}
{"text": "In a very simplified view, the most important number in a ryzen processor is the second one when estimating how powerful the processor ir. \n\nFor example, a Ryzen 9(6)00 will have a much lower performance than a Ryzen 7(9)00, even tho it's a more recent processor. And the X3D at the end represents it's a gaming focused processor, with much higher cache memory", "label": 0}
{"text": "> That loud screeching obnoxious noise of someone deep throating the mic\n\nThe reason you want it back is the reason it was removed.", "label": 0}
{"text": "Grow up", "label": 0}
{"text": "Who knows, maybe he's actually a good piece to have for an IGL like siuhy", "label": 0}
{"text": "I thought it was another bluepho3nix situation where they just had him on the team temporarily until they found a replacement", "label": 0}
{"text": "Nice one. Thanks.", "label": 0}
{"text": "I had the best and most annoying moments with half time / warm up chat. \n\nWith the feature to mute all you could choose if you want to hear those guys or not. I'm up for it!", "label": 0}
{"text": "If you're old enough to remember it, then you're too old to be posting stupid stuff like this. Grow up.", "label": 0}
{"text": "it seems like they're given out at the venue\n\nlike those signs branded w/ shipping company logos", "label": 0}
{"text": "since the last update i have constant fps drops and when opening buy menu or scoreboard the fps decreases to 150 lmao\n\n  \nbefore this i had constant 400 fps.... the game is broken and uplayable i think its time to find another hobby...", "label": 0}
{"text": "good vid thanks for putting me on", "label": 0}
{"text": "Oh absolutely fair, all I can say to that is smooooooyaa", "label": 0}
{"text": "Bruh a 1v5 clutch is badass idc what rank you are. Good job not switching back to AK, most people your rank would", "label": 0}
{"text": "I mean anyone even remotely keeping up can see how horrendously they're doing, even without the stats. The name is synonymous with bottom 2/4 finishes, aside from being everyone's favorite LGBT team", "label": 0}
{"text": "No outside food/drinks after their previous fiasco? :^)", "label": 0}
{"text": "Yes, I stopped playing", "label": 0}
{"text": "they are 100% a 13 year old that saw a video from 10 years ago and thought they would be as funny as that guy spamming the mic", "label": 0}
{"text": "Weak", "label": 0}
{"text": "They get an additional time out that Zonic can’t talk during and it’s just for fighting.", "label": 0}
{"text": "Double that age unfortunately", "label": 0}
{"text": "I had that vent not break after a shot countless times in GO, the reality was that your client showed your shot hit it but on the server it went somewhere else (for example due to running accuracy). Don't know about CS2 tho", "label": 0}
{"text": ">It an “e-sport”, right?\n\nhttps://www.youtube.com/watch?v=bO8IaV_DAoY", "label": 0}
{"text": "Somewhere in Power Options, dont remember exactly.\nJust google it", "label": 0}
{"text": "type bind \\\\ \"say hi\" in console and it will tell you to name the key something else as your keyboard is a non US layout. Worked for me. hope it helps", "label": 0}
{"text": "Good thing theres a mute button", "label": 0}
{"text": "Soft", "label": 0}
{"text": "i've played since cs 1.3 beta, bring that shit back.", "label": 0}
{"text": "Ultimately these modes do not matter.", "label": 0}
{"text": "11-1 down, other team start calling you noobs. You come back and win. Only happened a handful of times in my time but it’s the best feeling.", "label": 0}
{"text": "This happens to me when I download a replay from the menu during gameplay. Maybe download/internet related?", "label": 0}
{"text": "Well it worked for Tarik", "label": 0}
{"text": "good thing it doesnt even exist ;)", "label": 0}
{"text": "Easy way to get AWPed from Sniper's Nest", "label": 0}
{"text": "You cracked me up 😄", "label": 0}
{"text": "There certainly don't have to be any rollbacks, but in that case you must wait for the server for any feedback, which makes the game feel less responsive.\n\nIf instead you allow the client to predict what the server will likely confirm, you get better responsiveness at the cost of sometimes suffering something like the above clip.\n\nFrom what I can tell from other comments, they changed the Zeus animation to always wait for server confirmation now, so it is less responsive, but doesn't produce noticeable effects like this. It's a lot of tradeoffs and no clear answers.", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gc5nak/your_client_is_out_of_date_error/&title='Your client is out of date' error) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "There was some fun moments with half time chat, but probably like 1/10 of the times, the 9/10 was just weird obnoxious shit.", "label": 0}
{"text": "What make someone a good igl?", "label": 0}
{"text": "wouldn't really call it abusing, every other pro like zywoo, aleksib etc that plays with friends is abusing the system by that logic.", "label": 0}
{"text": "You can always turn the volume down grandpa", "label": 0}
{"text": "Scalpers will just scalp at even higher prices", "label": 0}
{"text": "He'd be better than anything they've pumped out in the last few months.", "label": 0}
{"text": "Its The pressure of responsibility. \nIf I die in MID - we get info about enemy positions and reallocate resource and maybe win The round.\nIf I run down MID, with The bomb - we Will get info and adjust strategies, but The bomb is still trapped on MID. \nNow, I hear you say \"maybe don't go MID\", and Brother. You would not stop a flower blooming, or a swan taking flight. I must go MID, and I must die a heroic death.", "label": 0}
{"text": "This must be a bought/bot/fake account, 11 years old yet aside from the first nonsense blog post 11 years ago, it has had *ZERO* activity until this fucking advertisement comment.", "label": 0}
{"text": "Does this still work with legacy?", "label": 0}
{"text": "Imagine if NIP kept aleksib. \n\nThey would have been shit still but", "label": 0}
{"text": "that, and also if you're always baiting teammates, then you're at least carrying the bomb", "label": 0}
{"text": "Sure lol", "label": 0}
{"text": "Wow looks very cool. Consider making it mobile friendly :)", "label": 0}
{"text": "Where’s the results thread ", "label": 0}
{"text": "this, i upgraded to a 5700x3d my avg frames went from like 180 to 300, and 1p lows went from 120 to around 220", "label": 0}
{"text": "Just started playing this week and I’m proud to say I haven’t discarded the bomb. I’ve died getting to the spot, but I’ve never thrown it down otherwise lol.", "label": 0}
{"text": "Nicely", "label": 0}
{"text": "In that case I don't see nip doing anything for a while. That's disappointing", "label": 0}
{"text": "-flit\n-norbutt\n+pwrfecto\n+young academy talent?", "label": 0}
{"text": "I only notice hackers once every 3-5 games now. The game is alright. Good time to start playing it again.", "label": 0}
{"text": "Astralis fan so used to being fed corpo speak that they can't even recognise a team being pragmatic and real anymore", "label": 0}
{"text": "As long as you aren't buying a latest gen high powered intel chip, the differences in running cost are fairly minimal.\n\nFor example, if you run your cpu at max power for 12 hours a day 365 days a year (way more than the huge majority of people) it would cost about $25 more per year to run a 13600k over a 7700x.\n\nGiven that the 7700x costs about $50 more than the 13600k, it would take at least 8350 hours of running your cpu at max power for the 7700x to be cheaper.", "label": 0}
{"text": "Its just yapping pricks, glad gaben doesnt give a fuck about these kids. Every coder including me knows what incredible work theyre doing and its just placebo effect in peoples minds. Love the facto that some dev hardcoded -5 in the ping calculation and suddenly everybody was praising em for how smooth everythings going after the patch even tho the code was the same. People are clueless.", "label": 0}
{"text": "Lame", "label": 0}
{"text": "it's called budget", "label": 0}
{"text": "as much as i love simple but he also has the aura to make them play 100 times worse haha", "label": 0}
{"text": "hahahahahahaha \n\nif you say “hold” then “yes” they’ll listen.", "label": 0}
{"text": "bot\\_allow\\_rogues is set to 1 by default I think", "label": 0}
{"text": "Don't just say that. Groove has been on fraud watch since he failed to fix that initial Gambit roster. They had so many chances too. And since then he has done fuck all.", "label": 0}
{"text": "reddit attitude is always so holier than thou\n\nwhat they forget is during half time people said \"good half\" or \"you guys suck\", which is what we want from a competitive game\n\nif they got angry it was hilarious, or if they talked shit while you were losing it was motivation to lock in for the next half", "label": 0}
{"text": "just like teammates", "label": 0}
{"text": "You better not try germany. Friend of mine can only get 2/0.2!!! Mbps 35€ per month, most i could get was 50/10 Mbps for 45€ a month.\n\nNow in Switzerland 25 Gbps for 67CHF a month", "label": 0}
{"text": "Human Teammates just don't respond at all", "label": 0}
{"text": "pros always fake 😎", "label": 0}
{"text": "Ok thank you", "label": 0}
{"text": "More MVP medals for me", "label": 0}
{"text": "Yeah that could have prevented it", "label": 0}
{"text": "Chickens are a core feature. (plus, you got killed by your lack of focus and reaction: the enemy clicked E on that chicken earlier and it was following him, giving away his position, you still managed to be the one killed)", "label": 0}
{"text": "No idea for CS2 but Zehn had 8k+ in CSGO at one point, before the nerfs to elo diff in games", "label": 0}
{"text": "Doesn't look like cheats, but that shooting in the smoke is so bizarre... Maybe trying to aggro so their teammates can walk in.\n\nJust from this clip alone there's nothing definitive.", "label": 0}
{"text": "Nice one.", "label": 0}
{"text": "jitter and slow server frames nonstop for me.\n\n\n\nidk dude i dream about update that doesn't break something", "label": 0}
{"text": "It was a joke please it's me playing the clip and I found all the pre aiming funnily coincidental I beg stop the downvotes guyss", "label": 0}
{"text": "obviously log scale", "label": 0}
{"text": "This is the latest from Intel Customer Service:\n\nHello,\n\nThank you for bringing this to my attention. I need to further investigate the matter regarding the supported titles and platforms on our website. I understand the confusion, especially with the new series of processors and their compatibility listings.\n\nI’ll look into why the 14th gen i9-14900KF isn’t appearing under \"Advanced Configuration\" as expected, even if it's not formally supported. I appreciate your patience as I gather more information on this.\n\nI will get back to you on Tuesday, October 29, 2024, or as soon as I have more details and information regarding this matter.\n \nI appreciate your patience.\n \nBest regards,\n \nVon M.\nIntel Customer Support Technician", "label": 0}
{"text": "Ohh just saw the (me) in the title.\n\nThat was a waste of time. Good retake, I suppose.", "label": 0}
{"text": "bro...", "label": 0}
{"text": "You're aiming at the ground anyways.", "label": 0}
{"text": "Same shit happening to me , Im tping all the time. Im so done w this game", "label": 0}
{"text": "I don't know if it's better or worse, but MisteM isn't new or really a true academy player. He was on the ATK roster in NA for three years before the org imploded and the core got signed by M80. On ATK, he played a LAN EPL season and a LAN Americas RMR. He certainly has more pro experience (most of which was IGLing) beyond a typical academy player.", "label": 0}
{"text": "I wouldn't if any of my friends played faceit/where A little higher ELO. It's tough...", "label": 0}
{"text": "WTF are u talking about.\n\nU have 63 games on faceit. What u mean \"stuck\"?.\n\nKeep doing 21 avg and u will progress eventually", "label": 0}
{"text": "maxster is still on the team???", "label": 0}
{"text": "he wasnt playing with lvl 1 and 4's tho :D", "label": 0}
{"text": "bro just said yeah like it actually happens to everyone, lmao", "label": 0}
{"text": "Secret setup bro. Akmost identical pc specs with slightly different io. Solid choice.", "label": 0}
{"text": "Some have issues, some don't. Also depends on the how it's implemented with the mouse, some are better than others.", "label": 0}
{"text": "Nice, didn't hear the reload. Wp", "label": 0}
{"text": "Spelling hut as hud shows you how easy it is to miss little things", "label": 0}
{"text": "vs happy vs kioshima", "label": 0}
{"text": "I do have the US layout I believe. Granted I do have a secondary keyboard layout installed in Windows as well, but I'm not using it in CS2.  \nThe bind-command returns:\n\n>  \n\\> bind \\\\ \"say hi\"\n\n>Interpreting bind command as:\n\n>bind scancode49 \"say hi\" // US English key name \"\\\\\"", "label": 0}
{"text": "He's so overhated that he's wrapped back around to underrated now", "label": 0}
{"text": "it's still the best game in the world, soo.. yeah", "label": 0}
{"text": "Paris Major/Boston 2018 crowds ratio", "label": 0}
{"text": "###You need to have more [interaction](https://www.reddit.com/wiki/commenting#wiki_commenting) with the /r/GlobalOffensive community before posting video or stream links.\nThis has become necessary to combat video spam & people who only use the subreddit to blatantly advertise their content. These requirements are quite low, and any reasonably active commenter should reach them easily.\n\nTo increase your interaction:\n\n* Engage in *quality* discussion in the comments of other people's posts\n* Try making text-posts that do not relate to or promote your own content.\n\nSpamming low-value comments just to meet the interaction requirements will get you banned.\n\n**Do not** contact the moderators asking about the participation level required for submitting content, and we do not allow exceptions to the interaction requirements - everyone who posts video/stream links has met these requirements, and so will you. \n\nYou can find our rules regarding advertising and self-promotion [here](https://www.reddit.com/r/GlobalOffensive/about/rules/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Nice ace brotha! 🔥🔥", "label": 0}
{"text": "You glams", "label": 0}
{"text": "People will say a 2% to 6% of loss packets (that might just be slightly delayed) are the real problem, but imho it's the game's fault. It's funny because 2 months ago it probably wouldn't even have  been displayed in the screen.", "label": 0}
{"text": "Bestia will do some damage in this RMR...", "label": 0}
{"text": "same.. it's like valve doesn't even care about this game... idk", "label": 0}
{"text": "A better use for the smoke is to throw it onto ramp or towards cat.\n\nThe main purpose is to obstruct vision so it forces the CTs to push blindly through the smoke to get to site and then gives you an advantage cause you only have to watch a certain part of the smoke and react to them coming through vs them having to take in the info of every angle all at once and then react.\n\nThe \"counter play\" in CS2 is to use a frag to blow the smoke away temporarily to allow for a quick gunfight but then they're down a frag and also its a coinflip of them dying too.", "label": 0}
{"text": "Automated testing exists for a reason.", "label": 0}
{"text": "Depends on what we doing that round.\n\nI don't mind taking it if we got a clear team plan that round like a rush or execute and I'm not the first one to go in.\n\nIf we run a default then it usually gets dropped in a safe retrievable spot so that we can react off picks\n\nBut if I've got a great spawn to go for an aggressive pick somewhere, like for example long a dust 2, I'm dropping the bomb every time otherwise we risk losing bomb control", "label": 0}
{"text": "I wish the best for BR CS but im cheering more for pain/legacy more than furia. Feels like they have a decent ceiling to push, but i feel like the post-major BR shuffle will be the deciding factor for the brazilian scenes ceiling for 2025, tons of talent but the puzzles have to be finished for get a team thats greater than the sum of its parts\n\n\nalso yeah, RIP Ka, Sirens is a normie pick but that song was my introduction to him so i hold it dearly.", "label": 0}
{"text": "Ngl, CS2 might go down as the greatest esports game of all time if we really get Niko igling Failcons. Please, make it happen.", "label": 0}
{"text": "I guess [this guy](https://www.reddit.com/r/GlobalOffensive/comments/3usg26/am_i_the_only_one_that_notices_that_nobody_ever/), [this guy](https://www.reddit.com/r/GlobalOffensive/comments/90ai3u/how_hard_is_to_carry_the_bomb/), [this guy](https://www.reddit.com/r/GlobalOffensive/comments/2eioev/why_do_people_drop_the_bomb/), [this guy](https://www.reddit.com/r/csgo/comments/53n97l/why_do_so_many_of_you_throw_the_bomb_on_the/),[ this guy](https://www.reddit.com/r/GlobalOffensive/comments/2bkxd6/the_bomb_is_the_most_scariest_thing_in_the_game/), [this guy](https://www.reddit.com/r/csgo/comments/vcpyzl/when_you_dont_want_to_carry_bomb/) all complained for no reason since people were obviously not throwing the bomb on the ground. But I guess they were all jealous of you having real life friends. (wtf is that argumen even lmao, how insecure are you?)", "label": 0}
{"text": "###You need to have more [interaction](https://www.reddit.com/wiki/commenting#wiki_commenting) with the /r/GlobalOffensive community before posting video or stream links.\nThis has become necessary to combat video spam & people who only use the subreddit to blatantly advertise their content. These requirements are quite low, and any reasonably active commenter should reach them easily.\n\nTo increase your interaction:\n\n* Engage in *quality* discussion in the comments of other people's posts\n* Try making text-posts that do not relate to or promote your own content.\n\nSpamming low-value comments just to meet the interaction requirements will get you banned.\n\n**Do not** contact the moderators asking about the participation level required for submitting content, and we do not allow exceptions to the interaction requirements - everyone who posts video/stream links has met these requirements, and so will you. \n\nYou can find our rules regarding advertising and self-promotion [here](https://www.reddit.com/r/GlobalOffensive/about/rules/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, I believe it is recommended to be set to 0 if possible. but does seem to a short term fix for some", "label": 0}
{"text": "It's just like the spring festival train ticket. You are competing against bots, and you haven't got a chance.", "label": 0}
{"text": "Idk about cs major internationally but I tried to buy tickets to worlds in lol when it was in the states. Instantly sold out too. Didn’t bother to check scalper prices tho.", "label": 0}
{"text": "There are two types of cs players. Ones who have packet loss, and the others who claim to play the game", "label": 0}
{"text": "MP9 | Epileptic Shock", "label": 0}
{"text": "Valorant dm is actually terrible and always has been. Just play a well configured community dm.", "label": 0}
{"text": "A designated bomb drop spot like vespa on inferno is used so people dont die on the attacking fronts with the bomb and throw the round with it. Especially with random players its better to just be safe and alot of people cant be trusted with the bomb or forget they are holding it.", "label": 0}
{"text": "How do they manage to fuck up new thing with every update…", "label": 0}
{"text": "Mine is over 6600+ when I was playing Rivals on Roblox and I just keep getting teleported around and nobody was moving. It’ sucks…", "label": 0}
{"text": "It used to happen to me. The problem was that i had the mouse too far away from the mouse dongle.", "label": 0}
{"text": "Nice shots!", "label": 0}
{"text": "We'd be fine with bugs like these IF the game was good. Just had a premier game of blatant cheaters.. Bunny hop jumping scout wallbang headshot through smokes for 13 rounds straight. Valve's priority was anticheat for the first year of CS2 and vac LIVE can't ban that.\n\nDespite continuous outcry from the community about performance issues, Valve has done fuckall except fixing the ancient water bug.\n\nNetworking is still pathetic. Can't hold angles. Some games it feels fine, other games it's impossible to hit anything.\n\nNo wonder people like ropz are getting frustrated at the state of cs2 because we have no idea what's being worked on (except fixing the packet size issue), what they consider an issue. Do they think performance is the best they can do right now? Do they think peeker's advantage is fine? Are they working on gameplay related features like 360 stats, community browser, retakes, etc?", "label": 0}
{"text": "I had the same Problem with Logitech superlight yesterday after update, but the released a Update a few hours ago and its better now.", "label": 0}
{"text": "Damn wtf, you tested to make sure this happens from enemy pov?", "label": 0}
{"text": "how about the fact that he was one of the best players in the world for 4 years before ZywOo played a tier 1 lan and still is? and technically, NiKo is completely clear of anyone in his role while ZywOo isn't even the best ever at his role. \n\ni don't think he's better, but come on, of course there's an argument and he should be in the conversation", "label": 0}
{"text": "Blyat*", "label": 0}
{"text": "\nThis, it looks nice and everything, but the lag makes it almost unusable", "label": 0}
{"text": "That’s why it always cracked me up how quickly they brought Norbert back lol", "label": 0}
{"text": "so he's only the second person to reach 5k elo? pfft washed /s", "label": 0}
{"text": "Gold nova is pure pain. Had so many moments where my teammates drop the bomb somewhere stupid, we take the spot and then someone (mostly I) had to run back to spawn to get the bomb just to hear “plant the bomb! PLANT!!!” in voice. \nTeam players are pretty rare in this elo", "label": 0}
{"text": "can someone explain this a little more in depth. i dont understand what the bug is", "label": 0}
{"text": "The drums and horns add to the experience even more in person in my opinion. One of the most fun things about live events is the atmosphere.\n\nIf I wanted to just watch CS, I would watch the livestream cause then I can actually see whats going on with the economy and other little details. For half the spectators in the arena, its just a game of watching 1 guy kill another, cheering, and getting excited when the round count for your favourite team goes up", "label": 0}
{"text": "didnt know theres only 2 players on a cs team", "label": 0}
{"text": "brutal. savage. rekt", "label": 0}
{"text": "I have very similar specs and I tried everything, But I eventually found a fix:\n\nI tried updating graphics drivers, uninstalling, clearing cache, verifying files, G-sync, and Nvida optimising, but none worked.\n\nWhat worked for me was capping my FPS at a lower amount. My Csgo normally runs around a max of 330FPS but will drop during fights and stuff to about 230, and I think the FPS drops were just too much for the computer to handle.\n\nI capped my fps at 240, and I haven't had any problems since.", "label": 0}
{"text": "i am truly the main character........", "label": 0}
{"text": "\"really only think of m0nesy as the other guy\" blud karnez was first to hit 5k", "label": 0}
{"text": "I get that dying isn't necessarily a bad thing considering context but stats generally don't account for context; having 20 kills, 10 assists and 0 deaths would be viewed infinitely better than having 20 kills, 10 assists and 10 kills (even if those deaths are traded/used to get space for the rest of the team/etc.)", "label": 0}
{"text": "it looks like you can fake a fake flash throw, or appear to throw 2 nades really fast after the other on your own", "label": 0}
{"text": "Cs2 is very underwhelming and I've been begging Valve devs to add some pizzazz back to this lackluster franchise. \n\nAztec, cbble, assault... perhaps buy some maps like rats, insertion, blackgold... \n\nRevive Vip mode... anything except cash-grab status-quo. \n\nTY!!", "label": 0}
{"text": "I'm bad at the game and don't want to be in charge, seems obvious", "label": 0}
{"text": "Considering its in the demo at the end of the video, yeah. I believe it needs 2 flashbangs, one you drop and one you throw immediately after.", "label": 0}
{"text": "Do you also have like 60fps if you get naded at your feet? I saw your linked comment from Fletcher Dunn from a year ago that said the legacy animation code also relies on the network; I guess freaking nade impact also uses that piece of shit animation code", "label": 0}
{"text": "Nevermind 😂 wtf is that", "label": 0}
{"text": "> 4.5k Premier \n\nThat’s it we have a new GOAT.", "label": 0}
{"text": "Nice job bro!! \nGood switch to pistol, you usually dont see it at your rank. You'll be climbing ranks soon i imagine.", "label": 0}
{"text": "Steel was saying on stream that MIBR has atrocious CT sides and it shows.", "label": 0}
{"text": "LMAO, but that aim was crisp!", "label": 0}
{"text": "Switch to windowed then back to fullscreen", "label": 0}
{"text": "The scoreboard is rendering a lot of text and numbers. It will be really slow. Doing text with shaders is slow.\n\nAnd if there is any non ASCII characters, it can even cause # \n\na 250ms frame time spike because it looks through your whole path for font files.", "label": 0}
{"text": "thankyou very much i tried it in casual but u need to have 2 flashbangs. lmao i was having the hardest time trying to figure out what was going on.", "label": 0}
{"text": "Bots aren’t supposed to be “good” otherwise people would have more incentive to kick people that are new to the game. They’re just meant to be slightly better than being down one player.", "label": 0}
{"text": "literally everybody elses help did NOT work in my case up until this. anyways, what does changing to gpu instead of the normal display usage even do? am I using more of my gpu on my second monitor or something?", "label": 0}
{"text": "lmao what", "label": 0}
{"text": "What you see is what you get.... and its shit.", "label": 0}
{"text": "server issue :/", "label": 0}
{"text": "For human teammates dont listen.", "label": 0}
{"text": "> just very unfortunate for him that Navi won the major and he's ended up with a full year off\n\nIt's not even that honestly. If Navi had just won the Major but tanked for the rest of the season, then we probably see s1mple back in Navi. But the fact that Navi won the Major, is still steadily improving, and is playing great CS basically sealed the deal in him not returning to the Navi roster at all.", "label": 0}
{"text": "This fixed it for me. I have a 3090ti with i9-12900k.", "label": 0}
{"text": "oh yeah I can see why someone would like it, it's a subjective thing. I personally like it as well.\n\n\nBut there are probably more and angrier complaints from people who dislike it, whereas people who like it are probably less angry about it being removed, more like \"it's a bummer\" but not the end of the world for most", "label": 0}
{"text": "Faceit Level 25", "label": 0}
{"text": "0-2 is one thing but choking both maps in which you led by many round is different", "label": 0}
{"text": "now imagine getting 30% consistently every game, every minute, every second and I dont know what to do", "label": 0}
{"text": "graphics card might be the issue minimum req arent suggestions after all but the game also has some bad optimization", "label": 0}
{"text": "I feel like there’s only 3-5 game devs working on CS2 and 100+ on Deadlock.", "label": 0}
{"text": "to be fair you're definitely right for people who are sitting nearby, that would annoy me after a while for sure", "label": 0}
{"text": "Imagine not forcing beginner settings on the whole community.", "label": 0}
{"text": "He did but faceit reworked the elo system when cs2 came out.\n\nNot sure why you’re getting downvoted though.", "label": 0}
{"text": "My friend", "label": 0}
{"text": "I didn’t know that korean in the top 10", "label": 0}
{"text": "yes", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Bro it called Naruto jutsu.", "label": 0}
{"text": "You'll get banned. From what I've read in similar threads, most skin changers are just part of full cheat clients, so good luck convincing Faceits Anticheat that \"you're not actually using the bad parts\".\n\nEssentially if you are running external software that interfaces directly with the game/manipulates it directly, it'll be bannable on faceit.", "label": 0}
{"text": "we got waarned about this in high school math...", "label": 0}
{"text": "Na you'll be fine mate send it", "label": 0}
{"text": "The humor is of an acquired taste.", "label": 0}
{"text": "Personally I can’t wait to see two of the best players of all time fart out their careers into nothing with a cobbled together team of over the hill bag chasing losers with no moral compass. May the falcons lose every game until there are no more games left to loss", "label": 0}
{"text": "You're gonna learn the hard way", "label": 0}
{"text": "I think it’s like an academy team", "label": 0}
{"text": "Man this is a name from the past, played since 1999, I remember you guys from the last chance/ choke days in mirc,  I was in vereor back in the csgn days and scrimmed with the 4k lads lot, dh, Paul bennet, kier,   mangiakapra etc,  I recently met akujji in a random cs2 game and we had a laugh and added each other not spoke to him in 2 decades. Theb0g needs remaking hahah", "label": 0}
{"text": "As someone who didnt watch CS for years and just got back into it the last couple months. completely forgot about that just watching his last 2 series he has legit zero game awareness its actually the craziest thing ive seen from a pro player", "label": 0}
{"text": "Oh shit I didn't even watch till the end, my bad", "label": 0}
{"text": "Considering how few reports of this there are it shows what niche scenario this is, its likely the devs forgot to test dropping nades while already having one pulled or they simply didn't think of this scenario. I certainly would have, but hindsight is 20/20. It happens, a lot, in any software. Its fine.", "label": 0}
{"text": "[His twitter post ](https://x.com/Twistzz/status/1849933428155892209)", "label": 0}
{"text": "the heat the enemies give off in rage is warming him up", "label": 0}
{"text": "Your thread was removed under **[Rule 6](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive).", "label": 0}
{"text": "we combat arms now boys", "label": 0}
{"text": "and he didnt even use mp9 and autoshotgun. 2 most broken run and gun weapon exist in CS2 right now.", "label": 0}
{"text": "CSNades is really decent, but I could not immediately add nade since its became public and requires kind of moderation, I guess. I usually search presets more frequently rather than particular nades. Helps to keep plan of the round in mind for any economy, so each time I’m looking for a tac I feel myself like AleksiB with paper before round starts :)", "label": 0}
{"text": "Actually just your fault. Your crosshair placement was ass.", "label": 0}
{"text": "GREAT REFERENCE! LMFAO", "label": 0}
{"text": "i kinda fw this lmao", "label": 0}
{"text": "Fun to do in a DM server but this will fail most of the time in high elo games", "label": 0}
{"text": "Your submission has been automatically removed because it is a text post that lacks substantial content.\n\n* If you intended this as a text post, you surely have more on your mind than what you have typed.\n\n* If you intended this as a link post, please resubmit it as a link post instead of a text post.\n\n* If you tried to upload a video, you need to submit it as direct video upload instead of embedding it into a text post.\n\n* If you tried to submit an image, you need to submit it as direct image upload instead of embedding the image into a text post.\n\nPlease review the different post types on the submit page carefully. If you need help, please see: [How do I post on Reddit?](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah cause in high elo games the weapons have different stats when running accuracy is reduced lol", "label": 0}
{"text": "Why sugarcoat the truth? He's a jerk who commandeers and ruins the morale of the teams he joins because he's a great player and decides that's a solid reason to be an ass. He was always an ass, though. \n\nYou don't see zywoo shitting on his teammates all day. \n\nYou don't gotta be nice about \"s1mple is an egotistical douche who ruins every team he's on while top fragging\". IMO, tho.", "label": 0}
{"text": "Oh \n\n\nI missed the x3d part.  \n\nTQ for the xplination!", "label": 0}
{"text": "This is such a cute low elo response bless your heart", "label": 0}
{"text": "No one is saying twistzz is low elo, we are saying this straight up won't work in an actual game. This 2x speed video where half the kills still take like 2 seconds to kill even at double speed with most enemies not even looking at him.\n\nIn a real match, you peek and get popped in half a second. Forget what the avg time to kill for pros are but it's no where near this long.", "label": 0}
{"text": "cinema", "label": 0}
{"text": "Loved that game, wish nexon didn’t ruin it", "label": 0}
{"text": "I'm not great at positioning and pretty much always drop the bomb in a dumb spot if I have it. I'll plant it when appropriate, but it's hot potato for me when I spawn unless you want it to be in a dumb spot after I push out too far or jump into pit before clearing everything.", "label": 0}
{"text": "You think that is broken? Try smg's...", "label": 0}
{"text": "Force buy rounds would die the fuck out if SMG running accuracy was as bad as AK/M4", "label": 0}
{"text": "youre kidding right? twistz video takes several seconds per kill and whiffs 95% of shots its as far from a legit strat as one could be in counterstrike", "label": 0}
{"text": "At least show a clip where it is actually clear how broken it is, this is nothing", "label": 0}
{"text": "you said something that makes a lot of sense so you got downvoted sorry ;(", "label": 0}
{"text": ">  There is no strafing involved either, So ?\n\n\nhave you watched the video?\nthere is a ton of strafing", "label": 0}
{"text": "And still  killing everyone ? The point is, You shouldn't be able to playing like that still getting frags, Like he is showing here, he should be dying far more often trying this stupid running and gunning starts, Which isn't the case ?", "label": 0}
{"text": "If your method of shooting takes over a second to take someone down then you probably want to reconsider", "label": 0}
{"text": "Counter strafing. Not just strafing,", "label": 0}
{"text": "Show me the run and gun kills in actual games", "label": 0}
{"text": "I am sure, twitzz is playing counter strike made in china, this isnt really an actual game lol", "label": 0}
{"text": "Content CS gets is a new Active Duty map once a year. CS isnt like other live service games. We dont get yearly PvE content and or meta changes. \n\n\n\nCompetitive mode is the official game mode. Balance patches we get are to nerf players. If you are seeking additional content seek out community created content in the workshop and community server browser.", "label": 0}
{"text": "This and warrock were old memories", "label": 0}
{"text": "They get annoying on stream too", "label": 0}
{"text": "It isn't it's Deathmatch. Also there is probably exactly one pro in this Deathmatch.", "label": 0}
{"text": "thats the point, it isnt broken with rifles which a lot of people keep saying", "label": 0}
{"text": "The force buy rounds can go to hell, There is other way to make force buy rounds more doable than this stupid broken mp9. You make famas cheaper. 1800s same like galil. Not this 1200 dollar smg which even better than famas,", "label": 0}
{"text": "So this is a sarcastic post?", "label": 0}
{"text": "> Pistol round is literally silver style running and gunning with glock spam.\n\nThe only little small difference is that pros actually hit their shot....", "label": 0}
{"text": "LoL, well played!  \n\n\n\n: )", "label": 0}
{"text": "Bro, run and gun is just a game of chances. It's not a viable way to play at all. Only time where you can try it with a rifle is if you have low hp and you are stuck in a corner with an enemy holding you.", "label": 0}
{"text": "and the game is only made for pros is it ? The casual and average players base are dying in a running and gunning rampage isnt a red flag ? The point is, You can go to playing like how random average silver plays and still be good , Sadly  the average blockheads reddiors are too thick to understand the point of this post", "label": 0}
{"text": "Literal pro superstar level aim and you think he shouldn’t be getting kills? You want accuracy to be what, 1%? Impossible to get a kill if counter strafe is not followed as the first, second, and third law of the game? \n\nCS is already ridiculously unrealistic with how inaccurate shots are with movement, more than they would be in any other game or even real life. Queue the daily post here “why did I miss this super clear shot” well “you moved 1 pixel”.", "label": 0}
{"text": "i know, not a great idea on the internet", "label": 0}
{"text": "nine years later it still works ty", "label": 0}
{"text": "People, including me, have been complaining about some of this stuff for quite literally more than 20 years. They have no intention of ever fixing it.", "label": 0}
{"text": "You arent supposed to be this accurate in aiming when running like bot, This is exactly what he is showing and making fun of this game mechanics, Your god aim become irrelevant cause you are running and gunning. Cause you should super inaccurate here", "label": 0}
{"text": "CSGO running and gunning was never that bad, Donk slide was L in CSGO but W in CS2, We have weapon stats hidden in CS2 so we dont know what is changed", "label": 0}
{"text": "So did you start playing this game 1 month ago ? People have been run and gunning during the gunround on CSGO for a decade already ?", "label": 0}
{"text": "its far worse in CS2, idk why ? either godawful netcode or the something changed in the gun stats ( which are hidden ). But the fact is, both pros and community are saying running and gunning feels much dominant in this game, If its not true then it wouldnt be so discussed all of sudden.", "label": 0}
{"text": "It is not as clear. U have infinite ammo and run and gun while u hit every 20shot", "label": 0}
{"text": "that backflip tho", "label": 0}
{"text": "> its far worse in CS2, idk why ?\n\nIt's not. You have zero evidence to back this up, this is just what you think. You haven't played CSGO for too long it seems.\n\n>If its not true then it wouldnt be so discussed all of sudden.\n\nIt is not ? You're the only thread on the frontpage that talks about that, and judging from the comment, people don't seem to agree with you.", "label": 0}
{"text": "So what's the error appearing in console?", "label": 0}
{"text": "As someone in low elo. This normally doesn't work even there", "label": 0}
{"text": "Your idea that aim is literally irrelevant if there is any kind of movement is exactly what my comment is pointing out. You think accuracy should be close to zero, and that a simple mechanic like counter strafe should triumph the most fundamental and important mechanic of the game, aim. Even if you make a huge inaccuracy circle 5 times the size of the crosshair here, a good amount of the shots are going to hit by random chance if you are dead center on aim. Any more than that is ridiculous, like expecting the shot to hit literally on the corner of the screen or something.", "label": 0}
{"text": "You’re absolutely right. I will quit my job and start playing cs2 full time. I’m done pleasing my landlord with cash every month.", "label": 0}
{"text": ">( cause 99% of them are worthless and sounds like written by AI bot )\n\nThat or ridiculous strawman arguments, while never being able to address anything that was actually said.", "label": 0}
{"text": "Put Cloud9 up there as well for good measure", "label": 0}
{"text": "what's the problem here I don't get it. You have 2 flashes you can use one and drop the second what's the big deal?", "label": 0}
{"text": "Btw, for mobiles should work better now", "label": 0}
{"text": "So much Claim, such little evidence. If you consistently die to a running ak, you have different problems. If you can't do it back, well...", "label": 0}
{"text": "he just ate the lightning, it isn't a bug trust", "label": 0}
{"text": "thats normal wdym?", "label": 0}
{"text": "Burn a hole in your wallet with a 4090 and you shall have it", "label": 0}
{"text": "Better be a crisp zero on that thing...", "label": 0}
{"text": "They literally just explained it to you. If it was like that then I’d kick you and let our top fragger have an extra life by having a free respawn for them near our spawn during each round. Them saying no occasionally is a purposeful negative that has been added to de-incentivize you from potentially kicking low skilled team mates", "label": 0}
{"text": "you will buy the charms", "label": 0}
{"text": "You did em dirty that was a sick ace 🥑", "label": 0}
{"text": "i dont think you scoped", "label": 0}
{"text": "Well, we don't think it's time", "label": 0}
{"text": "Because then you would have an incentive to kick your teamate. You would always have a bot that's ready to be switched to after dying. Im pretty sure it was a dev that explained this during a QA a while ago", "label": 0}
{"text": "Dont count on valve on doing seasonal updates. Decade of csgo and we got 1 halloween update(not counting ghost chickens, they are not an event) and got like 2 good christmas updates", "label": 0}
{"text": "just buy more luck??", "label": 0}
{"text": "OK reddit expert, Its easy to yap when hiding your ranks and be anonymous in internet when a Literally best of the best thinks its an issue", "label": 0}
{"text": "Thats cope. On all levels aim is the most important factor. Other factors play a role but the best players are best aimers.", "label": 0}
{"text": "Id use it if it were easier to see all of the smokes at one time.", "label": 0}
{"text": "Probably scalpers?", "label": 0}
{"text": "It is somewhat funny tho! If I remember correctly, some bots have different personalities and are built to be compliant.. others will send you off!", "label": 0}
{"text": "We should strike their counter and stop playing the games, but i deleted it 5 times now :(", "label": 0}
{"text": "Going off ranks and hours is always going to make you upset. It means absolutely nothing. Smurfing and rank decays/a flawed mm ranking system can cause a lot of chaos. I was ranked dmg at the end of csgo and all my mm ranks end up starting in silver and it started me at 1500 in premier lol. You get real smurfs and accidental smurfs combined in low ranks", "label": 0}
{"text": "Your post was removed under [Rule 8](https://www.reddit.com/r/GlobalOffensive/about/rules).\n\n\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive&subject=Thread%20Removal).", "label": 0}
{"text": "###You need to have more [interaction](https://www.reddit.com/wiki/commenting#wiki_commenting) with the /r/GlobalOffensive community before posting video or stream links.\nThis has become necessary to combat video spam & people who only use the subreddit to blatantly advertise their content. These requirements are quite low, and any reasonably active commenter should reach them easily.\n\nTo increase your interaction:\n\n* Engage in *quality* discussion in the comments of other people's posts\n* Try making text-posts that do not relate to or promote your own content.\n\nSpamming low-value comments just to meet the interaction requirements will get you banned.\n\n**Do not** contact the moderators asking about the participation level required for submitting content, and we do not allow exceptions to the interaction requirements - everyone who posts video/stream links has met these requirements, and so will you. \n\nYou can find our rules regarding advertising and self-promotion [here](https://www.reddit.com/r/GlobalOffensive/about/rules/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "we love it too much", "label": 0}
{"text": "Cbblestone wouldn't be as fun as people think. \nIt will end up like office unless they revamp it...", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gcfp0b/twistzz_new_warmup_routine_dropped_run_and_gun/&title=Twistzz  \" New warmup routine dropped. RUN and GUN\" ) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "It's annoying, I get it. It really annoys me when I'm playing with a baity/ratty team who won't peek, make plays, or entry, and they're dropping the bomb, so they can then sit right behind 1-2 other players and hope to finish off someone who they fight.\n\nLike dude, you want an excuse for not being entry, for being the refragger? You got two options. You carry bomb or you throw util. Otherwise you're obliged to make something happen with those timings. Nobody cares if the bomb is stacked up to bait or antiflash.  \n  \nSaw the worst one the other day on Anubis, we're spread out looking for picks, none of them work for us. I get a couple mid and am able to push into A. The carrier follows me, seconds remaining, then instead of planting, throws the bomb, runs off for heaven, I go for plant and get peeked from A main, killed, no plant, round lost, last round of half.\n\nThe kick vote only failed by one vote.", "label": 0}
{"text": "I did it in the Napoleonic wars, ever wonder why he was defeated at waterloo?", "label": 0}
{"text": "And in that case, the 13600k consumes around 20w less when idling.\n\nIt also supports ddr4 which doesn't make sense to buy new, but can save money for an in place upgrade.\n\nThat's basically the tier of hardware I meant with deals, since current gen will not get price cuts unless sales are a disaster - which could well happen now.", "label": 0}
{"text": "I don't think anybody has ever been annoyed or even noticed a solid entry dropping bomb. They notice it when the guys who don't entry don't remember to bring it.", "label": 0}
{"text": "There's enough racists in my team why would I want to also hear the ones in front of me...", "label": 0}
{"text": "Cobblestone obviously sucks, but it doesnt suck just because you specifically suck ass at it, if anything thats one of the few positives.", "label": 0}
{"text": "40 corners to check = 2000 elo premier bot who get mad when there are other maps are picked other than dust 2 and mirage", "label": 0}
{"text": "I'm going to take this win and enjoy while it lasts", "label": 0}
{"text": "30fps", "label": 0}
{"text": "How do I get 514 fps with R7 7700x ? I am around 300 on 1080p with a RX 7900GRE .. there is no way I lose 200 fps from gpu.", "label": 0}
{"text": "I don't entirely see what's negative about being from the nordic countries?", "label": 0}
{"text": "just strait up, nothing i can do to increases that??", "label": 0}
{"text": "The map is way too weird in terms of map control balance for both teams, rotations are skewed and overall it’s a combination of areas that are way too open and way too enclosed. People want it to be back because they’re sentimental and have no idea how to look at maps objectively or just played at such low level they never thought of how macro plays out and if it’s fine or not.\n\nObviously everyone is allowed to have an opinion, but if you see people insulting you because you don’t really like a map they liked a few years back, keep in mind it’s not worth taking their opinions seriously. They’re not sharing their opinions in a discussion, they just spill hate for no reason.", "label": 0}
{"text": "Stop projecting", "label": 0}
{"text": "Can't tell you the amount of rounds lost due to the bomb being dropped back at T spawn when we've taken a site.", "label": 0}
{"text": "won’t be playable unfortunately", "label": 0}
{"text": "Yeah you absolutely do. Guaranteed", "label": 0}
{"text": "We, nordics, \"sweat\" especially on winter cause these -40c weathers are ass, i need intense gaming to warm my room up, excuse me madridian +30c winter princess", "label": 0}
{"text": "Go play casual a bit. People talk shit all the time without yelling any slurs. Whole lobby laughs at the last guy’s aim in unity after he whiffs. Its hilarious", "label": 0}
{"text": "They have too high IQ for this cave goblin", "label": 0}
{"text": "It's free man just download it and try", "label": 0}
{"text": "Rushing is part of the game and necessary as T", "label": 0}
{"text": "No. You will have a terrible experience", "label": 0}
{"text": "What’s bad about valorant dm? Especially compared to cs dm", "label": 0}
{"text": "Mmhmm while you call them slurs xdd", "label": 0}
{"text": "Bro was part of cs2 hype, sorry man", "label": 0}
{"text": "Auf geht's Attax!", "label": 0}
{"text": "Are u slaxz, magnojezz or magaze by any chance?", "label": 0}
{"text": "With these specs no", "label": 0}
{"text": "I understand why you'd think that, but part of it is definitely that our communication is just more \"toxic\" in the east, you just don't take things personally here. I know it can look crazy if you're not used to it\n\nI'm not saying it's a better way of communicating, but it's definitely a cultural thing to some extent, it's not just purely him being an asshole", "label": 0}
{"text": "From a billion dollar company, we would atleast expect a new map or 2 for casual gameplay and maybe a new game mode like vip or zombies.", "label": 0}
{"text": "And where are the bug fixes xD", "label": 0}
{"text": "Zombie mode would tho", "label": 0}
{"text": "The server browser haven't been functional for over a year :)", "label": 0}
{"text": "You don't get bots anymore though, if you kick people", "label": 0}
{"text": "I’ve never watched a game of football in my life, just saying you can’t compare Saudis buying a random football team to buying literal superstar celebrities who pull in a million fans just by existing", "label": 0}
{"text": "So none then. And for further reference, look at how people meme on the Falcons in every tournament, and then watch how it’ll change instantly should they start winning.", "label": 0}
{"text": "Now that they know what the issue is they might release a massive skin update", "label": 0}
{"text": "Cs is horribly optimized", "label": 0}
{"text": "I feel like nothing has changed to inaccuracy, it just feels harder to kill  a moving target in CS2 ( idk why, netcode or lag compensation ? ). SO it gives the illusion running accuracy is better but in fact its the killing a running enemy is much harder now. You are just dying more to runner and gunner compared to CSGO. Just watch few DM clips of pro players in CSGO vs CS2 and you will see how even them are finding difficult to kill a running enemies in this game when in CSGO they  take care  with them like its a BOT", "label": 0}
{"text": "Cobble should return for one major for the souvenir packages with the current package dropping system where you can just buy them. \n\nThat's the low end iq bell curve reason it should return to competitive.", "label": 0}
{"text": "Shut up you corny ass igga.", "label": 0}
{"text": "yeah.\n\n&#x200B;\n\ni think its on purpose\n\nw/o the commands you dont hear the comms anyway", "label": 0}
{"text": "Mo ha kar kot e kot.", "label": 0}
{"text": "Thats the schyzophrenia that cs2 added when you play more than 9 hours straight.", "label": 0}
{"text": "Is anyone else sick of the constant timeouts in competitive games (especially FaceIT) where someone has to leave and rejoin the server every game?\n\nIt makes me so angry. I feel like I’m a hostage to someone’s moronic game blaming. I just want to play some Counterstrike. I’d rather the game just continue without them.\n\nIn FaceIT it happens every single game. Literally every game. We need to fix whatever the root cause is.", "label": 0}
{"text": "I do think running and gunning is a little too broken in CS rn, but honestly if you played this video at normal speed, a lot of these kills while moving are just him stafing between left and right and being under the velocity threshold to be accurate,", "label": 0}
{"text": "They fix the bugs they regularly make when adding \"content\" like charms", "label": 0}
{"text": "Back in my day, we threw flashes uphill, both ways", "label": 0}
{"text": "Why do anything when the community does so much already!!!\n\n*sarcasm*\n\nThis is a good post, OP. I like your vision, honestly.", "label": 0}
{"text": "This nip was ranked 16th and was actually playing T1 competition. \n\nCurrent nip is bombing out of challenger events. \n\nThe ratings are nothing spectacular, but outside the top 30 where NIP are now would have been child’s play.", "label": 0}
{"text": "8gb RAM + iGPU.\n\nGG", "label": 0}
{"text": "I want my comfort M4A4 beside me :(", "label": 0}
{"text": "Your post comes from a good place, but it's grounded in a naive assumption that everyone takes it serious like you or other players do, and that they aren't fully aware of what they are doing.\n\nMost people that cheat don't mis-understand what they're doing; they're not 12 year old kids anymore like it used to be way back in the early days. For most people, they don't really care about the follow-on consequences. They just wanna play, wanna win and wanna have fun, and they don't care about the experience of whoever is on the other end, like every other player.\n\nThis cat an mouse sect of the cheating playerbase I suspect is a tiny fraction of them, and infact mostly applies to the developers themselves. Even then, for many of them this is a legitimate career, and they make good or even great money selling cheats, running it like a business. \n\nLove your enthusiasm but you're wasting your time addressing the problem this way.", "label": 0}
{"text": "You said it wasn't as common meanwhile everyone not only in this thread buy in all the old threads complained that it happened all the time.\n\nBrother, I'm not jealous of anything, I got a good social life, I was making fun of you for deflecting so hard instead of owning up to some stupid thing you said.\n\nI guess it's hard to understand that you were the butt of the joke since judging by the voi crack in your knife unboxing video you're like 16 at most. It's fine, you'll grow up.", "label": 0}
{"text": "Graphics are much different between the 2 games. I doubt you'll get more than 25fps even on lowest possible settings on cs2. ", "label": 0}
{"text": "Your thread was removed under **[Rule 6](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\nYour post was removed under [Rule 10](https://www.reddit.com/r/GlobalOffensive/about/rules).\n\n\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive&subject=Thread%20Removal).", "label": 0}
{"text": "unfortunately, people that cheat don't care about ethics or playing the game properly. they want to play on easy mode and stomp on other players to feel like they're better. they don't care about values or the other player's experience.\n\nthe absolute best way to deal with cheating is having a good anti-cheat system that punishes the user. playing on client is the best way to play in a cheat-free environment. the devs that work on the client have a strong incentive to create a fair playing field considering that there can be real financial incentives on the line.\n\nwould be nice to get exp from playing esea/faceit pugs/matches. but i understand it would be hard to make sure no one is abusing the system. so the only way to grind your armory pass(es) is playing off client where you may or may not be facing a cheater(s). questioning if the person you're playing against is legit is one of the last things a player should have to worry about.", "label": 0}
{"text": "I mean that's not the reason why it sucks. The reason why it sucks is that it's just that it's Vertigo Classic Edition, in the sense that it's boring and repetitive since there is only one bomb site the Ts can realistically take. There is also just a tonne of dead space on the map.", "label": 0}
{"text": "That's incredible", "label": 0}
{"text": "did the fourth guy peek with a nade in hand?!?!?!?", "label": 0}
{"text": "people move quicker in cs2 mate, or at the very least it feels like that", "label": 0}
{"text": "Yeah, technologically it's always a game of cat and mouse so that's just doomed to fail but good luck educating the world about the perils of cheating yourself out of experiencing normal progress. There will always be a young one or a dimwit that doesn't understand what's going on around them that will assume everyone else are having some unfair advantage and they have to even the odds. You can't get to everyone. Utopia.", "label": 0}
{"text": "Once this is patched, just use decoys. I freaking love decoys and i love seeing enemys turn away from them, i kill them and type in chat \"just a decoy\".", "label": 0}
{"text": "i'm averaging 230 fps ( Dust 2 fps benchmark) on 144hz monitor, i found Dyac with reflex is way better than G-sync/vsync/reflex. Moving crosshair around feels better on gsync but opponents feel slower/smoother on Dyac, holding angles feel way better", "label": 0}
{"text": "I get where you're coming from - and I love the idea - but I don't think it would ever work.\n\nThe average toxic player does not care about the community or what they think, they only want to selfishly relieve their own frustration.\n\nCheaters 100% realize that nobody else except them is having fun in the game. They just don't care. No matter what happens. \n\nSome people do this because they love the negative attention they are getting - when you try to kick them or tell them anything.\n\nThis is just a product of anonymity on the internet and IMO can't be fixed. We just have to deal with it, unfortunately.\n\nThis however does not mean that wholesome communities don't exist! There are a few, but usually quite small. For example my beloved Trackmania. But of course, since we are still in the real world, there are some bad apples in there as well.", "label": 0}
{"text": "I think you should work on getting rid of the input lag instead of getting used to it", "label": 0}
{"text": "the valve dm servers are poorly designed tbh, BOTH the invincibility and random shit spawns. However, the farming bots lobbies and kicking real players obnoxiously is the worse offender by a mile.", "label": 0}
{"text": "What do you mean? Aren't you gonna adress the issue?", "label": 0}
{"text": "Eh i have tried everything from setting nvidia reflex to boost and setting mouse to 125hz polling rate. And I get 130 fps so i dont think it’s an issue with cpu bottleneck", "label": 0}
{"text": "you would want a 06092023 float or a 09062023 float?", "label": 0}
{"text": "Dude 128hz is office mouse level bad, of course you're gonna have a bad time. You should get a mouse with min 1000hz polling rate", "label": 0}
{"text": "yes speed up the video so people dont notice how for the vast majority of those kills he was basically standing still from changing direction or in knife range behind them and still needing 15 bullets. also if run and gun is so op why the need to cut together clips and include glock kills?", "label": 0}
{"text": "This shit is no better than fnatic company and their fake ass games", "label": 0}
{"text": "another hit for german cs", "label": 0}
{"text": "it just isnt effective now either. sure if you cut together clips and speed them up it looks bad but I could do the same with wallbangs and nobody would say wallbanging is op.", "label": 0}
{"text": "excatly?", "label": 0}
{"text": "I use razer viper mini so I do have that option. I always stuck with 125hz for some reason since people suggested to switch to it if a game has input lag. Well i suppose it depends on the game?", "label": 0}
{"text": "Not really if you have been following the intel stock...", "label": 0}
{"text": "Higher polling rate is better in 99% of games, it's the refresh rate equivalent of a monitor. Lower inevitably means more input lag. 1000Hz is standard, with some mice supporting up to to 8000Hz. There's some fringe cases where some games apply weird acceleration inconsistencies at higher polling rates but CS certainly isnt one of em.\n\nYou should definitely try figuring out if this is the only cause of your input lag though. What's your monitor model?", "label": 0}
{"text": "Yeap, not a chance in hell.", "label": 0}
{"text": "I still don't know why maps can't just be there, in the menu to choose. Like train is clearly done. What's the harm in it being in competitive to choose? Who cares how played it is.", "label": 0}
{"text": "You're literally giving your mouse input lag by setting it at 125hz. It should be at 1000hz. More is not needed, and less just gives you a disadvantage.", "label": 0}
{"text": "More is better up to a point, that point is 1000hz.", "label": 0}
{"text": "I'm sad now", "label": 0}
{"text": "If you have the option, you should set it to 1000hz or 500hz if it feels better, but never lower. If you play wireless, try going wired.", "label": 0}
{"text": "brutal, fuck cs2.", "label": 0}
{"text": "logitech g pro x wireless >>> both of your options, but if between only those 2 take the steelseries, the cloud headphones have been made a bit flimsy last few years, not the same as years prior before they got bought.", "label": 0}
{"text": "75hz yea that fixed it for me! I think I remember setting it to 125 hz when i playing bf 2042 as my input lag was atrocious in that game when i had it set to 1000 originally. So I just stuck with 125hz since lol", "label": 0}
{"text": "You are missing 1/4th of your crosshair of course Run'n'Gun wont work!!! Such n00b git gud cyka", "label": 0}
{"text": "[https://x.com/StreamGT\\_39/status/1850020027933794304](https://x.com/StreamGT_39/status/1850020027933794304)", "label": 0}
{"text": "Use 1000Hz and never lower it again unless it fixes a specific issue in a certain game, but dont forget to change it back to 1000Hz afterwards. You'll probably be fine keeping it at 1000Hz forever though. Depending on your monitor model, it could be the cause of further input lag, not all 75Hz monitors are made equal. A high refresh rate monitor would of course be optimal.", "label": 0}
{"text": "W8, you can hear voice chat in demos?", "label": 0}
{"text": "Try this yourself, join DM and try to do only jumping headshots with Mac 10. It's incredibly good.", "label": 0}
{"text": "You're getting half the FPS of CS:GO as CS:GO was a 10 year old title, not anything to do with subtick.", "label": 0}
{"text": "Bait and blocked", "label": 0}
{"text": "I bet they'll fix it if you post more essays on reddit", "label": 0}
{"text": "Bro is complaining about the basics of a tactical fps...\n\nAs for the fps, more fps thab your monitor rate is straight up useless. Just buy a better pc.", "label": 0}
{"text": "Sad. I noticed this first with the deagle, where you don’t need counterstrafing.", "label": 0}
{"text": "running accuracy is literally exactly the same as it was in csgo", "label": 0}
{"text": "Then the problem comes from your settings. I have similar specs and I hit over 300 fps lol", "label": 0}
{"text": "as someone from singapore as well, its pretty strict on things you're allowed to get.\n\nother events like f1 have a no pyro rule as well for the orange smoke group 🤣\n\nalso pretty sure the loud noise is just some old noise pollution law or some courtesy law - after all, theres a no (loud) noise past 2200 law, so its probably some law related to that.\n\nstill pretty excited for said event tho", "label": 0}
{"text": "The important thing to remember is that they didn't actually change anything!", "label": 0}
{"text": "weren't we all", "label": 0}
{"text": "Why did swisher TK lake lol", "label": 0}
{"text": "lmbt once again proving that he is a toxic coach. You could see him tilting and refusing to talk to the team in his time back in mouz. He also showed the same behavior in Monte.", "label": 0}
{"text": "Any broadcast for the public is going to be dumbed down for the casual viewer. Look at the nfl or nba where most analysis is done by former coaches and players and 90% of it boils down to “they wanted the win more” or “they just executed their plan better”", "label": 0}
{"text": "They took CSGO because they are clueless goobers who have their jobs probably only because of Nepotism. They don’t understand or care to understand the franchise. They see it as a tedious job, not something they are willing to work on.\n\nOvernight Valve could hire a team of developers who love the game and want to make it amazing, but it seems for whatever reason we’re stuck with amateurs who Tweet about politics all day like Fletcher Dunn. I suspect he’s the son of some senior at Valve, because every time he gives a “fix” it is the most hacky idiotic bandaid solutions ever. Dude literally told people to “Turn off your router’s security features” to play the game. He has no fucking idea what he is doing at all. I refuse to believe this dude is there based upon merit or skill.\n\nThe game is shit and it’s foundation is coded by extremely under qualified people who over engineered the hitreg system. CS2 is the definition of sunken cost fallacy, and I hope they scrap it and support CSGO again.", "label": 0}
{"text": "Does Valve do something about it? They pretty much colonized De E dust 2 and I am forced to switch map.", "label": 0}
{"text": "before? ehh i had big ass green headset from razer, but with wires. why?", "label": 0}
{"text": "I think I'm out of the loop, what did Logitech do?", "label": 0}
{"text": "you're right it should exclusively be esports threads. if u don't think cheating is a problem you haven't been playing enough.", "label": 0}
{"text": "The arctis series is great, can highlz recommend", "label": 0}
{"text": "This is like when you try to train a dog by having it watch another dog doing that trick for a treat", "label": 0}
{"text": "m4a1-s is even crazier than the ak when you do this", "label": 0}
{"text": "damn , I still remember them and mousesports rivalry back in like 2005'ish times   \nLegendary org even tho not present in tier1 <3", "label": 0}
{"text": "Your post was automatically removed because it appears to be about esports, but was not posted with an esports related flair. Flairs are important in our community because they allow users to filter out types of content they don't want to see.\n\nPlease [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=https://i.redd.it/luvdmxz503xd1.jpeg&title=Snappi is the problem and has always been the problem for Falcons), and select one of the following flairs:\n\n* News & Events | Esports\n* Discussion | Esports\n* Gameplay | Esports\n* Fluff | Esports\n\nI'm a bot - if you think this is incorrect, please resubmit your post using one of the above flairs anyway, and a moderator will change it to the correct flair if needed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "How is no one noticing he threw 2 flashes.", "label": 0}
{"text": "Tracers were also visible in csgo", "label": 0}
{"text": "Audeze Maxwell > everything wireless that is listed in this thread.", "label": 0}
{"text": "u kinda see thing narrow minded man, there are not a lot of trusted igls. not every player believes in this falcons project and even more, organisations will not just give away their in game leaders, although they could have a lot of money because of it. im pretty sure, that falcons could kick this guy at the start of this year, but it is not an easy task to get some1 with this role", "label": 0}
{"text": "and serves 0 gameplay purpose", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gcilkr/game_randomly_dropping_performance/&title=Game randomly dropping performance ) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Valve stopped giving a shit lol, how do u just stop something so simple as yearly holiday celebrations", "label": 0}
{"text": "funny how every other game ever does scoreboards and barely drop 1% fps when opened\n\nbut in cs2 we gotta have an RTX scoreboard that kills framerates because ? reasons", "label": 0}
{"text": "That explains why I get one tapped while they run so much in the last 1-2 weeks… it’s fucking frustrating", "label": 0}
{"text": "Well most people talking about these aren’t using Bluetooth because of those problems they use 2.4ghz dongles. \n\n\n\n\n\n\nBut I am very happy with my Bluetooth headphones the audio quality of Bluetooth is great as far as I’m concerned so long as you aren’t using the microphone at the samet ime. But I don’t play much cs these days so latency isn’t much of a concern.", "label": 0}
{"text": "It’s not", "label": 0}
{"text": "wdym, its the boombl4 banana special", "label": 0}
{"text": "You can capture the frame when scoreboard opens to see the render calls in renderdoc.\n\nyou can also capture the trace and see it doing a file open throughout your whole path.", "label": 0}
{"text": "Whenever people ‘discover’ new ‘OP’ techniques to show how shit CS2 is, just know it was the same in GO.\n\nHave you all forgotten Pimp showing a video of him hitting running deagle shots like it was new, then the replies were all people doing it on a GO server.\n\nEarly CS2, especially lower ranks, the M10 started getting used a lot with people claiming it was too good. It was always ‘too good’, you just didn’t use it.", "label": 0}
{"text": "Your thread was removed under **[Rule 5](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n---\n\nPlease take a moment to visit the rule linked above. Many rules contain details which may not be evident by the rule title. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive)!", "label": 0}
{"text": "Yes! You can download any faceit demo and listen to voicechat.\n\n\\`\\`\\`\n\ntv\\_listen\\_voice\\_indices\\_h -1\n\ntv\\_listen\\_voice\\_indices -1\n\n\\`\\`\\`", "label": 0}
{"text": "Your thread was removed under **[Rule 3](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n---\n\nPlease take a moment to visit the rule linked above. Many rules contain details which may not be evident by the rule title. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive)!", "label": 0}
{"text": "Blud al nassr had 700k followers on IG before they signed Ronaldo and now they have 27mil. Inter Miami went from 1mil to 17mil with Messi.\n\nSuggesting getting two top5 all time players since 2010 is not gonna make them popular no matter the results is just straight up wrong, 100k people watched ESL Challenger Katowice opening game just to see s1mple play on LAN. Heck, we literally have people in this subreddit saying it'll be interesting to watch these two play together. So yeah, I think they would have viewership anyway.", "label": 0}
{"text": "Your thread was removed under **[Rule 2](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n---\n\nPlease take a moment to visit the rule linked above. Many rules contain details which may not be evident by the rule title. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive)!", "label": 0}
{"text": "Nah it’s not about pressure, it’s just red trust players being toxic because they think they’re good at the game. If I have the best spawn I’m not touching the bomb.", "label": 0}
{"text": "I did this to defend my tribes home-cave from dinosaurs back in the cretaceous period.", "label": 0}
{"text": "The community, pros included, didn’t use a busted Krieg and AUG for *years*. \n\nThe CS community has a genuine issue with doing things outside what’s expected of you. How many times have you been angry at someone pushing a smoke because you “shouldn’t push smokes”, then shouting “wtf are you doing!?”. You just weren’t jumping with an SMG or a pistol because it’s still worse than playing ‘correctly’.\n\nEither Valve will nerf running and jumping inaccuracy that nobody cared to look at for donkeys years, or people will move on because it’s not as effective as they’re making it out to be. Case in point: The XM10. Its nerf was cosmetic and now the good was that too good, is back to not being used despite it being exactly the same.", "label": 0}
{"text": ">Chickens are a core feature\n\nPlease do elaborate on what they add to gameplay apart from giving away player positions for no reason and being distracting\n\nApart from 'haha le funny chicken is le funny! epic!\"", "label": 0}
{"text": "Are you one of those people who screams \"WHO DROPPED THE BOMB IN SPAWN???\" at 1:30?", "label": 0}
{"text": "logitechs headsets are ass", "label": 0}
{"text": "Why nobody tasks about how bad the dmoke graphics look? It looks extremely fake\nCoD and Battlefield have way better smoke", "label": 0}
{"text": "This is true for Counter-Strike: Condition Zero though I don't think it is true in other CS games.", "label": 0}
{"text": "The aug and krieg argument is bullshit cause the reason they started using it cause Valve has lowered the price and made them almost same price like AK and M4. For the same price if you can get  scoped guns then why not ? \n\nNot to mention that Before that they also made economy much easier so after winning 1 round your loss bonus didnt reduced to 0 but just 1 level lower. Which made the economy far easier than ever before. \n\nIts not like Pros didnt know those guns were OP but just they didnt use them cause it wasnt viable in strict economy and higher prices.", "label": 0}
{"text": "Love the casting from these two.", "label": 0}
{"text": "Wasn't this always a thing tho. The whole cl interp ratio thing? I used to play at 1 on CSGO. 2 also felt nice, in CS2, 2 has visual delay", "label": 0}
{"text": "Only faceit (and probably other 3rd party) demos. Valves official ones don't store voice chat.", "label": 0}
{"text": "Just like what they did in pretty much all other major sports. Give it some time and people will stop caring.", "label": 0}
{"text": "Guys, before you miss the point like always, Twistzz is suggesting that in his estimation, running and gunning is too accurate. He's doing something exaggerated to make his point. He's not suggesting that you can literally just run and shoot all game in a high elo lobby and be successful.\n\n Nobody has 100% counterstrafing and we all shoot some bullets while moving, and in Twistzz and many others' opinions, the movement inaccuracy is too forgiving.", "label": 0}
{"text": "That's interesting. The delay from using a wireless codec is still there, but the bandwidth is big enough that it cuts down on the delay a lot it seems. I can see why it's a non-issue for people who want wireless.", "label": 0}
{"text": "You can get off brand ones on Amazon, they're usually just as good if not better than the OEM ones.", "label": 0}
{"text": "The Krieg was so good it got nerfed back to $3,000 and people kept using it so it had to be nerfed again. Explain to me why it wasn’t bought post economy changes but not pre-buff? Nothing changed except they actually realised it was good once it got a price buff.\n\nEveryone knows how good the auto and P90 is, they’re just balanced in two different ways\n\nThe Auto is balanced by its price. If you can spam with it it’s an absolute demon plus you run the risk of giving to the other team (the Krieg had this problem too). But what happens when you hold an angle and can’t spam? The AWP is superior, and that’s a more frequent scenario.\n\nThe P90 is ‘balanced’ by the MAC10 and MP9. Why get the better SMG for 2,350 when you can get something almost as good for $1,000+ cheaper?", "label": 0}
{"text": "Wanna fight me, fight these tears", "label": 0}
{"text": "Maybe 5 years ago that’s the case. But headsets like the Audeze Maxwell and Astro A50X (what I have) completely blow a lot of wired audiophile level cans out of the water. Plus their mics are eons above wired mics. \n\nSorry to say, but wireless headphones/headsets just don’t deserve that aura anymore these days. The quality is comparable, and sometimes much better.", "label": 0}
{"text": "You can’t choke if you never look good", "label": 0}
{"text": "Lake crashed and Swisher needed his util. ", "label": 0}
{"text": "this was before the armory update came out. and im not being malicious i just got over 100 score in a casual one day", "label": 0}
{"text": "Falcons has really exposed zonic as a fraud. ", "label": 0}
{"text": "I upgraded from an i7 9700k to the ryzen 9 7900x3d, went from 200 fps to over 400, i do play 16:10 tho on my 2k monitor, currently rocking a ryzen 9 7900x3d with a 3080, played ancient last night was getting 450 fps on average with lows of 370, the upgrade was night and day for me", "label": 0}
{"text": "Was going to post something similar, good post.", "label": 0}
{"text": "Fraud? Nah. He’s just not the messiah people proclaimed him to be.", "label": 0}
{"text": "AI moment", "label": 0}
{"text": "That also, yes. Which is a lot harder if the entry fragger loses the bomb.", "label": 0}
{"text": "since the eco has made much easier with the loss bonus just reducing to 1 level instead of back to  0 like how its used to be, The flagship weapons become much easier to buy thanks to that update. So kreig has to be nerfed since the 300 difference now doesnt mean much compared to before, Hence the money are now not a big problem and just spending 300 more for this gun doesn't deemed a bad idea anymore  \n\n\nI think Krieg wouldn't be nerfed with old loss bonus system where team had to go through double eco just afford GALIL lol.", "label": 0}
{"text": "No, I'm just using Firefox. Looking at compatibility tab at dev tools there are loads of apparent issues: https://i.imgur.com/7OGwbAV.png\n\nMaybe those are causing them, maybe not. But it's definitely something about the lineups, since opening dev tools will overlap between half of the site, and suddenly as half of the lineups are hidden behind it, the site turns way more responsible. \n\nThe lag is genuinely unusable. If I try to scroll down, there is a 50% chance that the site won't even register the scrolling input because of how stuck it is.", "label": 0}
{"text": "MMX200", "label": 0}
{"text": "It happens to me a lot of times, i don't know if it's pure desync or lagcompensation or maybe both because i don't see anything else. It's hard to explain to people when their game works almost perfect and you get this \\*\\*\\*\\* all the time.", "label": 0}
{"text": "Falcon played like shit before without s1mple, and now with s1mple it’s even more", "label": 0}
{"text": "They made the game bit newbie friendly so it can be easily accessible for the average npc player", "label": 0}
{"text": "server admin", "label": 0}
{"text": "Thanks maybe in faceit I will finally leave my 20k elo hell :)", "label": 0}
{"text": "Don't you hate it when your pinky finger starts in the middle of your hand", "label": 0}
{"text": "snappi* \n\nWhy tf they choose to replace SunPayus but they keep their worst performer. Fkin hell kick snappi, put Magisk or dupreeh on igl duties and get s1mple a rifle. \n\nIf snappi's calls were good at least he could have an excuse for his performance, but he has mediocre calls and mediocre performance...", "label": 0}
{"text": "That's true i can't deny that", "label": 0}
{"text": "The shading of the bird and hand is super inconsistent too", "label": 0}
{"text": "It still blows my mind that this team is ranked #23 after their last months", "label": 0}
{"text": "The biggest highlight of this match was the casters shouting off the top of their lungs after a Calyx 2k against a full eco while the score was 10-1 or something", "label": 0}
{"text": "Say the line Bart...", "label": 0}
{"text": "you mean a m4a4?", "label": 0}
{"text": "Make it 26", "label": 0}
{"text": "falcons try to win a map challenge", "label": 0}
{"text": "Falcons continues to be the most inclusive team.  \nFrauds, check stealers, chockers, ... everybody is welcome.\n\n🏳️‍🌈🏳️‍🌈🏳️‍🌈 GO FALCONS! 🏳️‍🌈🏳️‍🌈🏳️‍🌈", "label": 0}
{"text": "Falcons is CS2's best charity, giving out free Valve points", "label": 0}
{"text": "This team costed millions and is bombing out last in tier 1.5 tournaments, love to see it.", "label": 0}
{"text": "a good showing from yada yada, you really like to see blah blah blah, anyway falcons are ass.", "label": 0}
{"text": "A team full of washed players.\nI will give it to s1mple and maden they were at least trying.\nSnappi magisk are tier 2 maybe tier 3 players now.\nYeah this team is not going anywhere with this roaster", "label": 0}
{"text": "Only to de_airport", "label": 0}
{"text": "Pigeons roasted yet again kekw", "label": 0}
{"text": "All 4 can retire after this", "label": 0}
{"text": "Energizing win for (any team playing against Falcons). You really hope to see (any team playing against Falcons) have strong showings, especially against opposition like this. Again, it was a good match, and I’ll definitely continue to support (any team playing against Falcons) in the future. Fantastic game guys, gg gl next.", "label": 0}
{"text": "Falcons made the semis at Katowice at the beginning of the year and now they can't even win a map at challenger Katowice...", "label": 0}
{"text": "Skill wise not. We play often against lvl 10 its just that they probably chill more since they dont care too much.", "label": 0}
{"text": "Playing for generational wealth versus playing to make rent. The indomitable Turkish spirit is truly remarkable.", "label": 0}
{"text": "No, you misunderstood. If the economy was the reason nobody bought the Krieg, then why did nobody buy the Krieg when the economy was changed? It wasn’t bought until the Krieg itself was buffed.", "label": 0}
{"text": "Gotta love cs, falcons about to do Anti NIP Magic,  10-87 lets goooo", "label": 0}
{"text": "Both are frauds and need to go", "label": 0}
{"text": "Zonic in the short interview between the maps told, they picked inferno over vertigo, even tho, Falcons as a team has never played inferno and apparently the reason was that s1mple has not played vertigo in officials.\n\nThat is just sad imo, he basically indirectly admitted that he has more hope in a s1mple carry than the strats developed for Falcons as a team.   \n  \nAlso as a s1mple fan, I have hope that, if s1mple still has the drive like he did back then, (ie: being one of the most hard working players) he might get pretty close to his old form. but maybe I am just coping lol.", "label": 0}
{"text": "I know magisk is most likely gonna stay in the rebuild, but for a player of his calibre: his decision making was awful on d2", "label": 0}
{"text": "Falcons is the best charity in CS2, giving out free Valve points for all\n\nalso zonic is a fucking fraud.", "label": 0}
{"text": "S1mple Falcon 1 win out of 10 maps with Facon and has never won a series.", "label": 0}
{"text": "This Falcon team is fantastic, just needs to work on comms, aim, map awareness, crosshair placement, economy management, pistol aim, awp flicks, grenade spots, smoke spots, pop flashes, positioning, bomb plant positions, retake ability, bunny hopping, spray control and getting kills", "label": 0}
{"text": "I still can see cs2 in APO app. I have i7-14700kf", "label": 0}
{"text": "haha le funny chicken is le funny! epic!\n\nI wasn't serious about they being a core feature, but they shouldn't be removed because some people take half a second to realize a chicken isn't a player.", "label": 0}
{"text": "you mean by only standing first then shooting the target?", "label": 0}
{"text": "are you stupid?", "label": 0}
{"text": "not washed up, at least magisk, i dont think so. just mentally checked out, which is almost the same thing. good thing is they can come back from it, maybe after the roster gets shaken up and niko and some other talent join the team and they finally are motivated. \n\nrealistically probably only magisk will stay in this iteration, alongside s1mple. as for the others, i think they're gone.", "label": 0}
{"text": "I think I could win against falcons with my random matchmaking team in master guardian", "label": 0}
{"text": "Energizing win for (any team playing against Falcons). You really hope to see (any team playing against Falcons) have strong showings, especially against opposition like this. Again, it was a good match, and I’ll definitely continue to support (any team playing against Falcons) in the future. Fantastic game guys, gg gl next.", "label": 0}
{"text": "okay but cs is a better game", "label": 0}
{"text": "Niko breaking table , S1mple shouting emotions , Dupreeh hitting himself , Magisk roasting players great gameplay.\n\nThis is gonna be a fun compilation series lmao", "label": 0}
{"text": "Why do you say snappi is the fraud then all the rest of the words are about zonic? It’s his team. He is the one replacing players. He is the one failing to get a single player to perform well. He’s also failing to do anything positive since he just goes out and talks shit about his own team or just lies.   \n\nSnappi is temporary. You’re stuck with zonic. ", "label": 0}
{"text": "Ong that shit was so annoying, legit put the stream on 1% volume for the rest of it", "label": 0}
{"text": "Yay!", "label": 0}
{"text": "that B site hold for falcons is laugably bad.\n\nAlso S1mple's little shakes after he takes a shot instead of just pulling out his knife and moving  is getitng him killed constantly", "label": 0}
{"text": "Energizing win for (any team playing against Falcons). You really hope to see (any team playing against Falcons) have strong showings, especially against opposition like this. Again, it was a good match, and I’ll definitely continue to support (any team playing against Falcons) in the future. Fantastic game guys, gg gl next.", "label": 0}
{"text": "Us haters are eating good today.", "label": 0}
{"text": "What you see", "label": 0}
{"text": "Good post. Indeed if running and gunning was broken then why don’t they use it? Because obviously it’s risky and not worth it in far most duals", "label": 0}
{"text": "This team is so cooked lmao", "label": 0}
{"text": "I actually like these castors they seem funny though the excessive s1mple glaze at times but I think it’s fair since that’s what mostly everyone is there for", "label": 0}
{"text": "Yes i have to admit people didnt try this gun when it was very strong, but I m pretty sure it wasnt used as much cause the Recoil control with SG was very different ( and difficult )  and you need to learn the  pattern and grow a new muscle memory.  No one bothered. Its like learning  3 T rifle spray are completely different from each other. People just learn just 2. Galil and AK \n\n  \nSince valve inspired to make SG meta ( with price change ), a lot people stopped playing with AK and made the SG go to rifle and build the muscle memory with it. So they felt like, Something needs to be done with SG to make AK more viable.\n\n  \nThe answer came from Valve to save AK ( and its skin market price ). I guess", "label": 0}
{"text": ">He will never be peak s1mple\n\nhonestly who knows, he absolutely might pop off again if he grinds cs2 like he did before, especially once Falcons’ roster isn’t a dead team", "label": 0}
{"text": "Like?", "label": 0}
{"text": "My favorite team thanks for being so supporting 🏳️‍🌈🏳️‍🌈🏳️‍🌈", "label": 0}
{"text": ">Its a miracle that there hasnt been a major boycott of the game until they fix the game.", "label": 0}
{"text": "He's Albanian with a Swiss citizenship, yeah", "label": 0}
{"text": "Chr1zN masterclass, he actually turned a shitshow into a proper team", "label": 0}
{"text": "Hd600 with dac/amp is what I use", "label": 0}
{"text": "Considering they lost every match so far, and his first Falcons tryout was horrible, it's actually not looking bad. No doubt he'll improve some more.", "label": 0}
{"text": "Recently? I have been noticing it get worse ever day since CS2 release", "label": 0}
{"text": "By the looks of it, they need multiple s1mple's", "label": 0}
{"text": "idk doesnt seem bad considering the winrate and the absolute trashcans he has as teammates", "label": 0}
{"text": "Decent stats considering honestly. Hope he can climb his way back to the top.", "label": 0}
{"text": "Have you tried turning it off and on again?", "label": 0}
{"text": "Yeh man rather than getting optimization it's condition getting worse", "label": 0}
{"text": "Im down around 60 fps since release lol, the devs dont give a shit about performance", "label": 0}
{"text": "Fuck kicking in deathmatch man. I hop in DM to grind for weekly cases and armory pass stars. Once in a while you'll get 2 Chinese players in your lobby. They'll wait till very last 20 second of deathmatch then immediately kick you from the match just so you don't get any XP. Had this happen to me 5 times just this week and it's infuriating. They should turn off kicking feature when it's only few players on the match.", "label": 0}
{"text": "I did man but it doesn't work", "label": 0}
{"text": "Yeh man ik I don't have dedicated gpu but still with uhd 630 Graphics I can play other games with good and stable performance and it's Dev problem and if they release optimization upate I can get 60-75 fps and or no lag while playing", "label": 0}
{"text": "Wow, relax, npl", "label": 0}
{"text": "a good showing from yada yada, you really like to see blah blah blah, anyway falcons are ass.", "label": 0}
{"text": "[They are busy waiting for finals](https://liquipedia.net/dota2/BetBoom_Dacha/Belgrade/2024)", "label": 0}
{"text": "MP9's Jumping accuracy is insane as well.", "label": 0}
{"text": "cant wait to see s1mple 1 kick 4.", "label": 0}
{"text": "So pro player have perfect crosshair placement when moving---->hacker", "label": 0}
{"text": "Finally OG starting to gain some relevance and turning heads. Masterclass from Chr1zN", "label": 0}
{"text": "Because they lost to EF, a team that was recently in two finals?", "label": 0}
{"text": "OG was struggling against tier2/tier3 opposition. Then they decided to bench nexius and add m1key, and somehow now they have beaten VP twice and now BIG.  Also, fiku who was a liability for the longest time is suddenly playing well now.\n\nThat is one hell of a turnaround story already.", "label": 0}
{"text": "Okay, I was starting to get worried that simple would end up making falcons start winning, glad that's not the case. Here's to more total and utter failures!", "label": 0}
{"text": "the fuck are u talking about, AUG was dog shit, before they buffed it. and even now, SG and AUG are still shit, the fucking dot gets bigger when u shoot obstructing view...", "label": 0}
{"text": "This is what I'm about to say. #Facts.", "label": 0}
{"text": "Did I miss the losers/elimination interview or did they not do any?", "label": 0}
{"text": "Haha, yeah. That idiot shouldn't have been born in that country you don't respect.", "label": 0}
{"text": "s1mple make it more clear that Falcon isn't going to make it to the major.", "label": 0}
{"text": "is mouse acceleration good? i use roccat kone aimo and on the roccat swarm mouse software mouse acceleration is already enabled. is it good for cs2 though? i think i have had it on bcuz i accidentally reset my settings today lmfao. but i think that i have had it on. is it good for cs2? i use 1.25 sens, 800 dpi", "label": 0}
{"text": "I'm not the one believing in something with zero proof", "label": 0}
{"text": "Skip both. Beyerdinamics, Meze, Hifiman, Austrian Audio and so much more.\nTo be honest for gaming you dont need much more than 100USD IEMs", "label": 0}
{"text": "They also set him up a lot and misses sure shots. But yeah, coming back like that and with falcons debuff, it looks good. He is definitely getting better with each game.", "label": 0}
{"text": "Bro if you are talking about csgo optimization then your fps was good as the game was built on old engines and cs2 is build on new engine so can you tell me your fps in cs2 before update and your specs", "label": 0}
{"text": "The meta back then was also completly different wasnt it?\n\nI hate falcons - but I assume Zonic just isnt good anymore. I think all the astralis members have mentioned how important he was at that time", "label": 0}
{"text": "Sorry but posts of this sort are not allowed here under [Rule 3](https://www.reddit.com/r/GlobalOffensive/about/rules/), since it is too far outside the scope of discussion involving modification of the game and it's settings. We suggest you take a look at some of the tech support subreddits for help. See the list below for a few suggestions, thanks!\n\n* The support channel in [the partnered CS2 Discord](http://discord.gg/cs-2).\n* The [monthly support thread](https://www.reddit.com/r/Steam/search?sort=new&restrict_sr=on&q=flair%3ASupport%2BMegathread) in r/Steam.\n* r/techsupport\n* r/homenetworking\n* r/pcgamingtechsupport\n* r/24hoursupport\n* r/BuildAPC\n* r/MechanicalKeyboards\n* r/Monitors\n* r/MouseReview\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive).", "label": 0}
{"text": "At the release in September 2023 I still had 180-240 fps ; It went down constantly, and before the Armory update I was getting 120-140;\n\nMy specs are amd 5 5600h, rtx 3060, 16gb.", "label": 0}
{"text": "Wake up baby, new pasta just dropped", "label": 0}
{"text": "[https://i.imgur.com/wtIw2a2.png](https://i.imgur.com/wtIw2a2.png)", "label": 0}
{"text": "All of his teammates are good individually\n\nIt's just together under this org they're absolute dogshit\n\nAnd I wouldn't have it any other way <3", "label": 0}
{"text": "Can you tell me where else should his crosshair be in that moment? Like when you 100% know where the opponent is since he is running away?", "label": 0}
{"text": "Man everytime I see stats after a c9 game I always see interz at the bottom of the chart. Dude isn't a tier 1 player. If cloud9 continue this kind of performance unable to qualify for a single lan, interz will be the first one to go.", "label": 0}
{"text": "He looks really clean on the rifle to me. AWPing a little bit less so.", "label": 0}
{"text": "Falcons don't lose that.", "label": 0}
{"text": "he died", "label": 0}
{"text": "Are you guys just finding out about mp9/mac 10 corner jumping? Bruh this shit done been here since I picked cs up in 2019", "label": 0}
{"text": "first of all, the match against SAW was a bo1, so he has not played 5 series. and while it's in the title, it seems like people don't know this is including the stand-in bo3 from 7 months ago. [here are the stats for this month](https://i.imgur.com/hwnpmLz.png) (0-7 in maps)\n\ni don't think people saying this is decent understand how insane averaging 85 adr is when you lose every single map. rating can get insanely boosted by your team being good and not a single tier 1 pro averaged 85 adr last year overall. now obviously half of his maps are against teams not even regularly playing in the t1 circuit so it doesn't mean much in terms of comparing him to the elite, but if you're looking for signs of life for s1mple, i think it's about the best you could hope for given that the team is ass.", "label": 0}
{"text": "Reading twitch chat when he plays is hilarious\n\nSimple misses an incredibly hard shot and dies: S0mple, washed, trash\n\nSimple gets the easiest kill on someone who has their back turned to him: GOAT, ''HE'S BACK'', NR1 PLAYER", "label": 0}
{"text": "Es tut so fucking weh.", "label": 0}
{"text": "damn this team is really alergic to winning", "label": 0}
{"text": "You also don't see Zywoo playing well in grand finals. \n\nYou're acting like there exists a player that played the way s1mple did, as well as he did, for as long as he did, but was also a nice guy.", "label": 0}
{"text": "how is this team so fucking bad lmao", "label": 0}
{"text": "Nintendo vs Valve is something no one wants.", "label": 0}
{"text": "S1mple going for a passive agressive rant inbetween rounds, niko crazy laughing faze withlut joy in eyes", "label": 0}
{"text": "The team is literally dead. He did alright", "label": 0}
{"text": "My only concern is if he can find the motivation to improve. The whole “play like simple” scam, and now grabbing bags in Falcons sort of indicates otherwise.", "label": 0}
{"text": "Outside of pro ELO, you’ll find that if you use some weapons you normally wouldn’t touch and then experiment with them a bit, there are a lot of incredibly underrated ways to play the game. This is nothing new, people just don’t experiment at all. There’s a reason the AUG and Krieg went under the radar for half a decade.", "label": 0}
{"text": "Hello guys jus shut hed like zis", "label": 0}
{"text": "With 2025 approaching and many TOs coming back, I can see Kassad coming back to broadcast. Regarding GM or head coach, the problem is that I think Kassad is a guy who don't want much input for the management, which is a problem. If he go to a big org he won't has that kind of freedom. If he go to the smaller org, there's a chance the Bleed sh\\*tuation would happen again.", "label": 0}
{"text": "1. They had consistency before zonic they just choked in playoffs and 2. They didn’t start winning titles until Glaive who joined almost a year after zonic did\n\nAlthough I will say I think zonic is a good coach and excerpts from his book make me think he was definitely an influential piece of the golden astralis roster and modern meta of CS. I think he’s just a tad bit overrated because vitality took almost way too long to get good under him and his last major win wasn’t that impressive. And now he has falcons imploding from under him.", "label": 0}
{"text": "All jokes aside, this is some fucking stupid erasure of the innovation Zonic brought to the game with utility usage. Sure, Blade is looking like the obvious choice at the moment as far as #1 coach goes, but you're fooling yourself if you think Zonic isn't the most important and influential coach of CSGO.", "label": 0}
{"text": "I suspect they're going bankrupt soon", "label": 0}
{"text": "Grabbing bags at falcons is harsh. \n\nNot many orgs can afford him and I suspect he wouldn't join falcons unless he knew that it would be Magisk, Niko, Zonic staying and the rest going", "label": 0}
{"text": "So Zonic sucks\n\nGla1ve sucks\n\nDupreeh and Magisk were decent with Vitality but far from being at the superstar level anyway\n\nWhat made the legendary Astralis good ?? dev1ce ??", "label": 0}
{"text": "Hey, I just wanna say this specifically because I don’t think this is something that we should do often: props to Riot. Props to Riot for smelling fish and calling it out. Sure, they were probably just watching their own back, but them making a statement about Bleed got the ball rolling on other people noticing the smell. ", "label": 0}
{"text": "the S1mple glazers are already out and about, the excuses are gonna be hilarious after they crash and burn some more", "label": 0}
{"text": "What comparison you have. If you came from wired and what brand to see if it will be ok for me.", "label": 0}
{"text": "unironic question — why would anyone participate in Twitch chat for bigger streams? like no one will see your message and it’s gonna be gon in like a second", "label": 0}
{"text": "Thank you bossman", "label": 0}
{"text": "Depends if you’re looking for immersion or directional audio. I would argue in terms of pure FPS, the Turtle Beach Stealth Pros will beat a pair of HD800s any day when it comes to footstep imagine. \n\nIf you’re trying to play God Of War or Cyber Punk, then sure, some wired cans powered through an AMP will be supreme. \n\nGiven OP is asking this question in a counter strike sub tells me they care much more about audio queues and want an advantage in game. In that sense, the gap between wired and wireless is non existent amongst the top players.", "label": 0}
{"text": "yh they drop a scout for him every now and then and let him bait them on tside, but playing with teammates who cant even hold their site properly or even entry properly is gonna tank ur stats cuz you're in constant retakes and in unwinnable clutch situations. Just watch how magisk and dupreeh hold b site and tell me with ur chest that theyre setting him up when theyre just playing like ass", "label": 0}
{"text": "they used to be good. Not anymore", "label": 0}
{"text": "Which roster moves of him as a GM made you think \"oh he will be a good GM\"\n\nWhich were even GOOD moves lmao, he tried 9 players, nothing worked, even the moves of nawwk and jkaem which people praised at the start they were ass", "label": 0}
{"text": "Danish players are a peaceful bunch huh", "label": 0}
{"text": "why?", "label": 0}
{"text": "Yeah maybe see a doctor.", "label": 0}
{"text": "In 2024, if concept of cross hair placement confuses you, it's time to play another game.", "label": 0}
{"text": "I can't see", "label": 0}
{"text": "Dupreeh is less washed than simple, that’s why I’m asking? It doesn’t matter who he plays with.", "label": 0}
{"text": "i hope jkaem ends up on a real team because he is still legit, liquid for example should drop yekindar for him in a heartbeat. \n\nif nothing else for kassad, he should get a GM job for an international team that needs scouting and to make bold moves, such as TL/coL/ENCE/fnatic. connections in the scene, great at selling the vision of his team, good scouting in general, and clearly knows when to buy low.\n\nCYPHER should end up on about the level he needs to be.", "label": 0}
{"text": "It's french optical fiber. 900Mbps on download, 700Mbps on upload. Most of my games are under 30ms ping. Most of the time under 20ms.", "label": 0}
{"text": "Every single team in existence sets up their star player for success, it’s the entire point of having a star player lol. That doesn’t somehow justify .6 ratings across the board for the rest of the team", "label": 0}
{"text": "His success is a reminder that you can be a self centered ass and still succeed if you're competent enough - which inspires people to be self centered asses, even those without competence.", "label": 0}
{"text": "You need to choose wisly. I am not saying its same as wired but for my comfort its better to go with wireless. Btw. wired headphones still be a part of my setup. I just want to have another wireless version.", "label": 0}
{"text": "Gaming sound is marketing buzzword", "label": 0}
{"text": "Cant reason with anti-fans bro", "label": 0}
{"text": "Absolutely the best signing anyone can make in CS is Kassad as a GM. \n\nHe managed to build a roster from scratch which had some really decent periods and played well in the hell that is T3 online CS. And he did it without wasting money at all. \n\nI'm not saying if you sign Kassad you will get the best roster ever and will win a major. But i can guarantee that if you sign Kassad you wont be pissing away money and that's more than you can say about most teams that join CS.", "label": 0}
{"text": "Yeah that's some names I remember!  I have Paul Bennet on my Facebook from years ago but for the life of me couldn't remember his CS nick!  Back in contact with all the clanONE guys now, we played CS2 gathers (5v5) for a few months for old times sake.  Now me, Negotiator and Strikes play CS2 weekly with two others for a bit of competitive fun.  I started to put together a website of cs1.6 stuff, got lots of UKTerrorist news posts (using wayback machine) from 2000-2004 era (inc the comments section, which is full of downright abuse :D), great for my crappy old memory!", "label": 0}
{"text": "Thanks a lot, this is exactly what i expected.", "label": 0}
{"text": "yeah same, he's been quiet and focusing on his team ever since he made coach and it was peaceful.\n\nI also want to see if he's actually capable of leading a team or blowing smoke, people put way too much stock in his one time Renegades run.", "label": 0}
{"text": "###You need to have more [interaction](https://www.reddit.com/wiki/commenting#wiki_commenting) with the /r/GlobalOffensive community before posting video or stream links.\nThis has become necessary to combat video spam & people who only use the subreddit to blatantly advertise their content. These requirements are quite low, and any reasonably active commenter should reach them easily.\n\nTo increase your interaction:\n\n* Engage in *quality* discussion in the comments of other people's posts\n* Try making text-posts that do not relate to or promote your own content.\n\nSpamming low-value comments just to meet the interaction requirements will get you banned.\n\n**Do not** contact the moderators asking about the participation level required for submitting content, and we do not allow exceptions to the interaction requirements - everyone who posts video/stream links has met these requirements, and so will you. \n\nYou can find our rules regarding advertising and self-promotion [here](https://www.reddit.com/r/GlobalOffensive/about/rules/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "I'm having NiP vs AMKAL flashbacks already", "label": 0}
{"text": "Are they protected by falcons?", "label": 0}
{"text": "Never heard of these teams before. I’m a couple years out of the loop. ", "label": 0}
{"text": "I use a laptop with WiFi to but I can't use ethernet cause the router is far away from my desktop and If I get a long cable it will just get in the way of doors that's why I'm asking is there a way to fix it with wifi.", "label": 0}
{"text": "He made his name by solo carrying bad teams. That was in like 2015 though.", "label": 0}
{"text": "I'm not dunking on s1mple but in far too many years of watching CS, teams have only sold out to set up dev1ce and Guardian more than s1mple gad gotten", "label": 0}
{"text": "In a world where everyone in esports is hemmoraging money except the players? No way", "label": 0}
{"text": "I'm not going to call that pissing money away. From what I understand he bought low (they were both cheap at that moment) and hoped they would play well. \n\nYea it didn't work, but it felt like a pretty calculated gamble for a relatively minor amount of money. I'm not calling that pissing away money.\n\nPretty sure he said that he tried to buy Jkaem earlier on but it was triple the price so he said no. That would have been pissing money away", "label": 0}
{"text": "Read the tweet, brother.", "label": 0}
{"text": "Structure wise? Yeah, fucking salaries mate", "label": 0}
{"text": "Players who start to decline never come back to their peak form so I really doubt so. But he doesn't need to be peak s1mple to win stuff either since his peak was so high", "label": 0}
{"text": "Yup, agree on all of that and I did say the distinction was irrelevant to OP in these specific circumstances.\n\nMy comment was mostly in response to your assertion that the Maxwell and Astro50 would blow some wired audiophile cans out of the water. But you're right to say those cans are better than many wired audiophile cans for games. \n\nFWIW I have a couple of pairs of audeze and a pair of Hd800 cans, plus some focals. I don't use any of them for CS. But then I wouldn't ever use wireless headphones for listening to music either. Time and place and all that :)", "label": 0}
{"text": "I didn't dispute his history.", "label": 0}
{"text": "No, they should've vetted them as they should which they didn't. Go watch four horsemen from yesterday - riot absolutely fumbled here. One of the reasons Kassad thought he could trust the org", "label": 0}
{"text": "Well you are wishing for his irrelevancy, which will not happen. People still acknowledge the 1.6 goats imagine s1mple..", "label": 0}
{"text": "Do you mean they shouldn’t have got a team in first place? Or shouldn’t get new offers? Jkaem ja Cypher will definitely get offers from T2/3 orgs", "label": 0}
{"text": "This such a chinese thing for scapling never change China.", "label": 0}
{"text": "I wouldn't want this person in charge of a team as a coach or gm, he's volatile as hell. In my opinion, if he can reign in his Niko bias, he's a solid broadcast talent", "label": 0}
{"text": "He has been irrelevant in CS2 until recently.", "label": 0}
{"text": "That's what I'm asking. Who are those teams?", "label": 0}
{"text": "the only problem is that they are not losing whitewashes reall, smth like 9-13 is more than enough to have decent ADR and overall stats, it's not like it's 3-13 all the way.", "label": 0}
{"text": "Unpaid will not stop following him", "label": 0}
{"text": "2045", "label": 0}
{"text": "Given that your router is not within the proximity of your laptop there is not really a solution here, a lot of things cause interference with wifi, microwave, fridge, walls even bluetooth headphones sometimes. \n\nEthernet cable would be your best bet here, either buy a cable or move your setup near the wifi.", "label": 0}
{"text": "What are they setting up whole team has a 0.9 rating in avg", "label": 0}
{"text": "Thanks I will take it to consideration.", "label": 0}
{"text": "f1ku got that ropz cam", "label": 0}
{"text": "I was watching kadsad... i was watching as", "label": 0}
{"text": "Pretty decent considering the break and how dysfunctional the team is. I don't think he'll ever reach GOAT performances anymore, but I think he can still be extremely good. Would be happy to be proven wrong though.", "label": 0}
{"text": "wtf Vitality albeit it being a mickey mouse win, won the CSGO major under zonic, although now that i think about it you might be right.", "label": 0}
{"text": "Downloading update almost every day, still seeing this kind of stuff on Reddit...", "label": 0}
{"text": "i remember mine because I don’t play often during 2015-2019. I take videos of it on my phone because i’m not that good, still have it to this day.", "label": 0}
{"text": "Still spent hundreds of thousands on building a roster that never worked for a peak rank of 33rd on HLTV.\nJust look at the number of orgs with lower budgets and smaller names that did better than Kassad and Bleed in that time period...", "label": 0}
{"text": "wonder how NiKo is feeling right now knowing hes just 2 months away from this hell", "label": 0}
{"text": "I had to check this wasn't PF Jung for a second", "label": 0}
{"text": "Do any of them have skills other than being good at CS? I can't imagine how stressful it would be if they either have to find another team or go back to flipping burgers.", "label": 0}
{"text": "RIOT didn't get any required documents or communication from Bleed for months and they did nothing.", "label": 0}
{"text": "my version of hell is being strapped to a chair and being forced to watch BIG and Aurora have an eternal mid-off", "label": 0}
{"text": "absolutely, national teams are fucking stupid imo", "label": 0}
{"text": "pretty average so far", "label": 0}
{"text": "I have seen a lot of examples of teams that come from nowhere with no budget and had some great results. But none really stuck around from what I remember. \n\nI don't often see orgs pick up players build a squad and do well. Or at least I can't think of any off the top of my head. Would be interesting to know who you think did a better job. (I guess Mouz and other squads but the academy system feels different to me)", "label": 0}
{"text": "Inferno was their permaban before s1mple joined so it makes sense", "label": 0}
{"text": "Small sample size + his team is ass", "label": 0}
{"text": "Honestly, I kinda disagree here. They were once great but far removed from their former selves as players", "label": 0}
{"text": "He misses a lot of the easier shots (holding angle) but hit the harder shots. Prob just a bit shaky. He’ll be back soon", "label": 0}
{"text": "Chr1zn is an 18 yo IGL? Excited to see him on LAN. Wtf I'm talking about OG this is crazy", "label": 0}
{"text": "Game is pretty sad right now, my bets would be to wait and play community driven servers", "label": 0}
{"text": "So deep and very wise thanks", "label": 0}
{"text": "why is this relevant in cs2 when bots are only in casual gamemodes", "label": 0}
{"text": "Nice work, GL with it", "label": 0}
{"text": "Deserved win from Heroic, but I‘d like to point out that Fnatic still played pretty well despite losing and didn‘t just get ran over", "label": 0}
{"text": "![img](emote|t5_2sqho|31253)", "label": 0}
{"text": "SunPayus to complexity please", "label": 0}
{"text": "Faceit replaces your leaver teammate with a bot that you can control if you die", "label": 0}
{"text": "Easy GM pickup. Although if someone like Elisa were to have another spicy desk and have the full HTPM crew on there that would be incredible.", "label": 0}
{"text": "People really don't talk about him all that much, and he's really not the GOAT of csgo (to me). GOATs win, not complie stats and he really didn't do much* winning*", "label": 0}
{"text": "Oop, erm that’s awkward", "label": 0}
{"text": "The correct way to phrase your question so your intended message got across would’ve been: \n\n“I’m curious who the got picked up and by which teams.”", "label": 0}
{"text": "You lie lots then make some weird ass conclusions. Paid some money once so they should have no issues now? \n\nStop being so weird. ", "label": 0}
{"text": "Ahhh, the classic \"Don't be a loser, buy a defuser\"", "label": 0}
{"text": "it's 2024 bro you can achieve anything if you set your mind to it \n\nkeep up the grind  🔥🔥🔥", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gcp5ud/fuck_off_valve/&title=FUCK OFF VALVE) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "yes", "label": 0}
{"text": "CS2 isn't CS:GO, it takes better hardware to get the same kind of framerate you got in CS:GO.\n\nYou have no choice man. Either upgrade or enjoy the slideshow.", "label": 0}
{"text": "Umm actually not valve fault if it was ur first time, it would be only 30mins🤓🤓🤓", "label": 0}
{"text": "Is", "label": 0}
{"text": "Your thread was removed under **[Rule 2](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive&subject=Thread%20Removal).", "label": 0}
{"text": "New temporary strat unlocked", "label": 0}
{"text": "I mean why did you get kicked many times before. Forst time is only 30min", "label": 0}
{"text": "People will read this as undermining current complaints about the poor state of the game, because supposedly CS players just love to complain. Look, they've been complaining for 20 years!\n\n  \nIn reality it proves that valve has never made a good counterstrike game and has no track record of knowing what they are doing. Every success was a stroke of luck. There is zero reason to have any faith in a company that added dynamic pricing in cs source, the r8 in csgo, etc.", "label": 0}
{"text": "Good, keep them that way. I don't play CS for the good graphics.", "label": 0}
{"text": "50-60fps is still terrible, idk how that would be any better than 45.\n\nThey had to make it this way so people can run all kind of shadow settings without having different draw distances.\n\nCS:GO also ran worse over the years because they upped the fidelity and technical debt did the rest.\n\nCompare the fps you got in CS:GO in 2014 to 2019... many things got optimized over the yeaars but updated maps etc. took their toll.", "label": 0}
{"text": "Average sure, but if you really think about it, this is a guy who stopped playing for a year like Dev1ce, he's posting crazy numbers sometimes on some maps, which shows the team isn't working around him or he's not at his full potential again (as in he's rusty). I can understand if someone took his numbers after a year and was like \"oh he's washed compared to how he used to be\", but it's 10 maps and he's on literally a team that's been a total dud all year long. He's still got it, is he at his peak? No way, but he's like 27 and most players start to become bad at like 30 years old if we follow players like Shox or GTR, he's got a few more years left in him and I can honestly say he has one of the highest work ethics. Will he be the GOAT of CS2? Not a chance, like m0nesy, donk or Zywoo will just have longer to become the GOAT and to stack trophies and perform at the highest level. But people can at least maybe be given the opportunity to see he can play something other than CS:GO and be at a Top 10 sort of level. He just needs time and a decently competitive team.", "label": 0}
{"text": "Above average comeback for simple really", "label": 0}
{"text": "I find comments like this hilarious. \n\n>In reality it proves that valve has never made a good counterstrike game and has no track record of knowing what they are doing. **Every success was a stroke of luck.**\n\nThis has to bait, right?", "label": 0}
{"text": "OG has a real long term project with their new coach (Lambert), is it starting to pay off?", "label": 0}
{"text": "Okay, now find me the game that is better and I'll show you 20 years of their player base crying as well", "label": 0}
{"text": "He's playing on a terrible team and he's had a huge break, he needs some time to catch up on the meta, to get back into that consistency and to not be nervous while playing too. I know it sounds silly, but if you do something as simple as public speaking for a while, you lose the nerves and it become easy to do if you do it on a regular basis. Then if you stop for a little while like a year or two, you can become nervous again quite easily doing public speaking till you regain your confidence and composure, at least that was the case with me. I can only imagine he's a bit nervous on LAN, feels the pressure more than usual and over time that will go away again and this might be somewhat contributing to his inconsistency. I want at least like 6 months to make an evaluation on whether he's never going to drop an MVP level performance again. But just remember, if your team is better, your individual stats also tend to be better because stuff is working, so I just think he needs more time. 10 maps is a fairly small sample, that's only 3 BO3's and one BO1 really.", "label": 0}
{"text": "Cypher ended up being quite good for a long time in bleed, was pretty much always their best player once he got comfy.\n\nNawwk and Jkaem for 120k was a steal, two very proven and reliable players. OFC they didnt perform well but that could be in large part due to not being paid. \n\nVLDN shaped up to be a very solid supportive player, performed relatively consistently when they have some good runs.\n\nHampus turned out to be a good IGL, he was able to adapt to having different players and put out a good amount of frags.\n\nThey did relatively well in T2 all things considered, given that he basically took \"T1 rejects\" and did something noteable with them", "label": 0}
{"text": "Stroke the C. Well if that's what they want us to see.", "label": 0}
{"text": "no no, he went washed in fnatic after covid hit ([https://www.hltv.org/stats/teams/players/4991/fnatic?startDate=2021-01-01&endDate=2021-12-31](https://www.hltv.org/stats/teams/players/4991/fnatic?startDate=2021-01-01&endDate=2021-12-31)) and has been developing Swedish talents in EYEBALLERS ever since, though developing is kinda stretching the term, no player who has left their team since 2022 has done anything and doesn't look like it's gonna change.", "label": 0}
{"text": "> In reality it proves that valve has never made a good counterstrike game\n\nLOL", "label": 0}
{"text": "Yeah i noticed this shit as well, sad", "label": 0}
{"text": "AND **they have no good track record**, because fuck TF2, fuck Dota, fuck every half life game, fuck deadlock, fuck portal, fuck left 4 dead.... now watch someone mention their one recently failed game artifact", "label": 0}
{"text": "Please give this man a role in a team and this keep him away from the broadcasts", "label": 0}
{"text": "Fall from grace usually means you do something messed up and get exposed for it.", "label": 0}
{"text": "I think they're saying it's been an issue for a long time, not that its excusable.", "label": 0}
{"text": "People have been complaining for 20 years dude. \n\nOnce Valve artificially reduced player pings by 50 because people were complaining about ping issues. Guess what? People stopped complaining.", "label": 0}
{"text": "I swear hidden path had a page on their website saying they originally made it but gave it to Valve upon release and people should not contact them for anything regarding CSGO. There is probably people who contacted them all the way up to when CS2 released. Sadly I can't find that page anymore, maybe they removed it.", "label": 0}
{"text": "sometimes maybe good sometimes maybe shit", "label": 0}
{"text": "Probably not an AFK kick and instead just server crash", "label": 0}
{"text": "Bring back bullying", "label": 0}
{"text": "1.72 on a losing map is kinda nuts", "label": 0}
{"text": "are these nordics in the room with u rn?", "label": 0}
{"text": "Nice", "label": 0}
{"text": "netcode was bad in 2008. So its okay its bad in 2024\n\nCSGO 2012 was bad, So its okay cs2 2024 is bad\n\nI am sure when next CS will be released in 2034, Some reddiors will say, its okay CS2 was bad in 2024.\n\nIts like we take example from bad things rather than good things lol", "label": 0}
{"text": "Literally not a single person here has even implied that.\n\nYou're fighting ghosts.", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gcq0nr/gaming_portal_firelords/&title=GAMING PORTAL FIRELORDS) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah but it wasn't the official way to play it, so it's not getting traction \n\nThe worst thing about Valve is absolutely that they've slowly been killing community servers\n\nIdk what happened since 2019. All servers slowly die. It's not like there server browser works", "label": 0}
{"text": "Well he doesn’t really have a choice when it comes to a team, it’s either falcons now or wait until his original Navi contract is up. Literally no one else in the scene can afford him.", "label": 0}
{"text": "Its a wingman, How many entrance you need ?", "label": 0}
{"text": "It’s true that AWPers are more likely than most other roles to have higher ratings but in a losing team (10% map win rate) you probably won’t be having AWP as much as in a “regular” match", "label": 0}
{"text": "Thats a whole new sentence", "label": 0}
{"text": "It never left.", "label": 0}
{"text": "man they formulated that request in a very respectable manner", "label": 0}
{"text": "I mean, it's a classic occurrence for casters moving up to cast T1-T2, we saw this happen with Scrawny when people were complaining of him over-hyping when he was casting during Covid online. I guess casters are incentived to over-hype in order to stand out from the others.", "label": 0}
{"text": "JWs team won so I think that makes it 2015", "label": 0}
{"text": "CS:S never saw any real improvements over the course of its life. It remained a trash game.", "label": 0}
{"text": "What it also proves is they haven't learned, they just repeat the same mistakes and expect people in the community to bug fix for them or find problems for them or just do stuff for them like make content. \n\nTo me, first person movement, how characters look and move in third person, the netcode and how the shooting feels should be basic things that should be perfected by now. Valve isn't starting from square one. They have CS:GO as a template to follow, we want CS:GO as it was perfectly, but better. That should be what CS2 was on release. If you produce anything less than your previous product that in my opinion is a failure. \n\nI mean imagine if you buy an iPhone 17 and it's worse than the iPhone 16 like say for example, the battery life all the sudden is 40% less than the iPhone 16's and also then calls keep dropping out and the phone randomly crashes apps and the photos look like complete garbage. People would be mocking Apple all day because your previous generation product shouldn't be better than the new one they built. But then imagine if Apple over a space of three years finally updates the iPhone 17 to fix these problems like Valve does. I mean you could've just bought an iPhone 16 that same year the iPhone 17 released, which is supposedly inferior maybe in terms of the chip's performance, but you wouldn't have the headache and problems of worse battery life, calls dropping etc because it worked far better for three years you avoided problems. Thats CS2 vs CS:GO. The transition shouldn't of happened until CS2 reached a better state than CS:GO. The incentive also would have been there for Valve to actually fix CS2 because CS:GO was still out there and you wanted people to move to CS2. Instead, they removed CS:GO from online play, they replaced it with CS2 and forced tournament organisers to use it over CS:GO when the game was absolutely not ready.\n\nCS:GO is the foundation and it should be the bare minimum you serve your customers, when people download CS2 their first expectation should be, it's CS:GO but better. Instead, the impression people got was Valve used CS:GO as a template, wrecked almost everything about it (whether it be movement, animations, netcode, shooting etc), improved the graphics (probably the only compliment I can give this game), removed some content like Danger Zone or certain maps like Train (so you're already giving less than CS:GO did), pushed it out as \"Counter-Strike 2\" and then had a big cry about how the community are bullies when people complained about it being worse or that the community was ill-informed or whatever other excuse the Valve apologists and Valve themselves put out. The overarching point is, when people think of CS2 they had the expectation it was improved and in reality... it was a regression in almost every way and Valve's attitude is still the same which is: release shit game, have a lack of real communication with the community, bug fix it for 7 years till it's good, drip feed content and just hope people keep playing it when it's trash. I dunno but to me it's such a trash model, but it works for them every time because they have Steam and some legendary status amongst gamers for Half-Life and Half-Life 2, but honestly, it's tiring to have to wait 50 bazillion years for them to fix even basic things. Something has to change at Valve, they have to either be more vocal and explain their reasoning for certain things. Or they simply just have to employ more people or work faster at deploying updates and fixes for stuff.\n\nBefore someone attacks me, I love CS, I like Valve for their games and I have respect for when they do a good job like HL1 or HL2 or TF2 or L4D. But you know what people should be complaining as \"bugs\" for CS2, a game released in 2025 which is Valve like third CS game is minor bugs, stuff like \"Oh I found a way to run out of bounds on a map\" (forgiveable) or \"my skins show up a little bit wonky\" (okay minor thing but they can easily fix it), you know minor things. Instead, we're complaining that we can't plant the bomb as a bug (crucial to winning rounds in a competitive eSport) or pull out guns properly (kind of a problem when the game is about shooting other people with low TTK), that we have major packet loss or desync constantly (terrible thing for a mostly online game), that we're losing frame rate every subsequent update (why is this shit still happening?), that the game has stuttering (again why is this still happening), that we shoot people on our screen and the hits don't register (what you see is what you get guys!), that we have character models doing weird animations (MJ bug and others that we've seen), [that we can duplicate grenades \\(dunno if this is client side only but still a stupid thing lol\\)](https://old.reddit.com/r/GlobalOffensive/comments/1gc7wul/fake_flash_flash_bug/), that demos playback are all weird and don't preview correctly, that the movement is inconsistent with jump height etc etc. This is major stuff that should've been bug fixed before release tbh or shouldn't be a thing at all. This is not Valve's first rodeo, they're not a small company giving it their first try, they have a damn blueprint a template to follow and they know what should work by now. There should be reall no excuse.", "label": 0}
{"text": "Here's the thead for anyone curious: https://web.archive.org/web/20090316235448/http://forums.steampowered.com/forums/showthread.php?t=490324", "label": 0}
{"text": "At this time it's more about mentality. They have good pieces. \n\n\nI would make an apology to Chris Paul joining Clippers. It turned the organization around, they didn't win championships, but it sure as hell was a different team. I am just saying it could happen. Will it happen? I say not impossible but chances are low.", "label": 0}
{"text": "Tf is a cyber athlete lmao", "label": 0}
{"text": "Leaked CIA documents revealed “Project Falcon”, an operation to weaken the Kingdom of Saudi Arabia by infiltrating their sports teams with players who purposefully underperform in order to waste capital from the Public Investment Fund and damage the Kingdom’s reputation.", "label": 0}
{"text": "Bloom like you've never been outside when in a dark area for 0.3s ✓\n\nWater physics that tank FPS for 0 gameplay benefit ✓\n\nParticle effects that tank FPS that don't even look that good ✓\n\nUseless clutter on maps inside and outside of playable area ✓\n\nMany areas with poor contrast of many player models ✓\n\nShadows that make certain spots unplayable that nobody asked for ✓\n\nScoreboard drops FPS by half ✓\n\nAlt tabbing causes increased latency, force game to alt tab to join community servers ✓\n\nGame breaks with more than 1 monitor if not at native resolution ✓\n\nEngine has to search your entire pc to render people peeking you causing frametimes spikes ✓\n\nWith FPS being more important than ever due to subtick, we've decreased FPS as much as possible every update ✓\n\nConsole commands that fix these are sv_cheats protected ✓\n\nNeed a 1k PC for a competitive experience ✓\n\nStill looks like a 2013 game ✓\n\nWhat an game", "label": 0}
{"text": "Actually more positive towards cs2 than I expected. Hope he gets back to at least somewhat of his former self", "label": 0}
{"text": "We need cs2 to switch back to csgo 128 tick netcode so removing subtick. Nobody can post a legit csgo hitreg fail post 2017 after valve fixed the last hitbox bug in 2016. \n\nGetting \"csgo'd\" simply was not a thing anymore after 2017.  CSGO hitreg was perfect in 128 tick after 2016.", "label": 0}
{"text": "Seems that way from that message. I started around 2000 or something and I can tell you people were just as toxic as now haha", "label": 0}
{"text": "Half life 2 is the most overrated game of all time. Try actually playing it. 50% of the game is solving boat-based puzzles. \n\nDota is based on a mod. Valve having the capital to purchase things other people made isn't the great argument you think it is. This also goes for counter strike - The fundamentals of the game were invented by someone else. It took valve 3 different games and then another decade to make a counter-strike game that wasn't objectively worse than 1.6. How is that impressive? Then they released CS2 which literally ruined the core mechanics of the game. \n\nTF2 is based on a mod and is was also inexplicably left to rot and die by valve for no other reason than losing interest. The way Valve treated TF2 is literally an atrocity, and while the majors/esports system indicate CS won't go exactly the same way, it should make you people a lot more suspicious about the wisdom of Valve. \n\nPortal and Left 4 Dead are good and also 15 years old.\n\nDeadlock is in beta, we'll see how things play out. What's important for you to realize is that games companies can have success without having any intrinsic wisdom. Yes they've had some successes (most of which are based on mods they didn't design), they also added dynamic pricing in CS:S. Do you even know what that is?", "label": 0}
{"text": "Ive been a CS players since 1999. I know what to expect from Valve and the CS franchise. \n\n  \nThose who come from COD, Fortnite, Overwatch and even Valorant wont understand this at first. CS isnt the typical live service video game. Its a traditional sport that happens to be a video game.", "label": 0}
{"text": "Yeah that’s why I have respect for people like Karrigan who went to school while doing pro cs.", "label": 0}
{"text": "12/15 people hate the game, but my experience of it is good, therefore those 12 people must just be irrationally angry!", "label": 0}
{"text": "Somebody that plays video games?", "label": 0}
{"text": "for anyone curious: https://i.imgur.com/Z5QNyJ6.png\n\nalso isn't left in any clutches either. zero 1v1s and only the nuke 1v2 so far", "label": 0}
{"text": "thank you john mcdonald for fixing peeker's advantage", "label": 0}
{"text": "The example you are referring too was before the game was bought by valve. By your logic Valve should just release an update saying \"hitreg and netcode has been fixed by 50%\" and all the \\*professional players\\* would cease having any issues.", "label": 0}
{"text": "You have no idea what the fuck you're talking about.", "label": 0}
{"text": "sounds like a bug I get often. Next time, try changing the map. Eg, click office, then back to your map.", "label": 0}
{"text": "You do the stereotype justice, not just poor but also uneducated and expecting help falling from the sky  \nOk, can't afford a new laptop atm, but are you telling me you cant get 16gb laptop ddr3 ram in 2024? When it's dirt cheap second-hand or even for free since tech moved onto ddr4 a long time ago?  \nThe game has higher system requirements than decade old csgo, onboard graphics ain't it, you need a 1050ti or better for 60fps, and 16gb of ram, as the game spikes to 7-8GB usage by itself not accounting for os usage and your shitty onboard literally using system ram", "label": 0}
{"text": "Just read the last paragraph it gives the general gist. But basically, CS2 should be CS:GO but improved, not a worse version of CS:GO with better graphics.", "label": 0}
{"text": "Game continued without me, my friend was on it, he never sae me getting ban message in game or something, i just started new game while my old game was still running", "label": 0}
{"text": "Yeah, it just shows that Valve has always been like this... But it gained a lot of the pass because it was still the early 2000s.\n\nToday, in the information age, the cracks are more evident. It's quite objective, CS:S was supposed to be better and Valve didn't, and instead released a new version and nowadays, with the increase in demand for quality standards and in the information age, this should have become a thing of the past, which unfortunately is not the reality.\n\nBut hey, it's all \"treadmill work\", let the community fix it and then we'll take responsibility for having \"done\" something lol", "label": 0}
{"text": "Not what OP is implying at all.", "label": 0}
{"text": "Anyway of finding out what his crosshair is?", "label": 0}
{"text": "Might be the most Silver clip ever posted", "label": 0}
{"text": "It is not over 9000 yet.", "label": 0}
{"text": "Play competitive or premier.", "label": 0}
{"text": "hard to see on mobile but looks roughly like outline 0, thickness 0.1, size 1/1.5, gap -3/-4, style 4, color 1(green) or 2(yellow)", "label": 0}
{"text": "How is Krimz still just plodding along as a solid player", "label": 0}
{"text": "They even jump when Peek", "label": 0}
{"text": "yeah... compared to when in navi basically in the first few rounds playing as a new team he was tilted and complaining that we're not good enough.", "label": 0}
{"text": "Just pause the video and remake it in the crosshair editor lol. Crosshairs are ridiculously easy to replicate.", "label": 0}
{"text": "For competitive play, yes. But almost all of my 3k hours in it from the late-2000s are from custom game modes. Jail, deathrun etc. Something that unfortunately completely died. For whatever reason modern players are all 100% grindset future esports pros all the time with zero room for casual fun.", "label": 0}
{"text": "Zonic/snappi and dupreeh need to go. Maybe even both zonic and snappi tbh", "label": 0}
{"text": "There's not really much of a server browser, the third party servers don't have the same well structured communities of active players that you can join and play with... self defeating system. If it's three clicks to go play competitive and thirty minutes to go find an active jail server + join their discord server, people are gonna play competitive.", "label": 0}
{"text": "My description didnt uploaded so i'm typing again. In the last 5 matches i played i always encounterd with cheaters and this match which is i'm currentl playing has 3 cheaters in it. 1 in our team and 2 in the enemy team. Valve clearly cant control cheaters and the cheater in our team says he is not afraid of getting banned. I shared their steam profile links too but for some reason post's description is deleted.", "label": 0}
{"text": "No, more like, Death Run is getting old. Played it for a bit on TF2, won't do that on CS:GO nowadays", "label": 0}
{"text": "He traded winning for stats. I never said he was a bum. But if your the number 1 player for 7 years I'd expect to see some majors and high level tournament wins", "label": 0}
{"text": "The overarching point is that throughout all of these years netcode remained an unsolved problem. People are looking at the old times with rose tinted glasses (including 1.6). Since then, a lot of things have changed - people did not have an easy way to record footage and upload it then spend time analyzing frame perfect timings, the internet was much less data dense without everyone and their mom streaming tiktok videos, youtube and iptv 24/7.\n\nNow sure, there can be improvements, subtick 1.0 resolves a major inconsistency that required players to shoot in front of where they see the model. This negatively impacts the experience of being shot at. With the congestion going on in the network, Valve developed their own network of nodes to improve player routing as well as hide server IPs to avoid ddos.\n\nThere is a clear improvement, but each new technology will need time to mature.\n\nUnless we are all playing locally from the same mainframe or we solve transmitting data faster than speed of light there are going to be inconsistencies.\n\nSubtick 1.0 shows innovation, we know there are improvements in the works to reduce the amount of data that is sent which will have a positive impact. Valve is banking that further improvements will give them the edge if they do not already.\n\nThinking Valve is not aware of issues is foolish, the number of people in the industry that can reliably work on improving this system is very low. Believing Valve is developing subtick only for CS is also an inexperienced take. The code that goes into the engine gets shared and benefits will be utilized in other titles (like Deadlock) as well. They are hoping to set a new bar. Whether they will make it with subtick 2.0 or improvements over the initial version remains to be seen.\n\nOne thing is certain, delay cannot be eliminated with the current technology. Until then, you will never see what the other players or the server sees and we will see threads like the 2008 thread pop up again and again.", "label": 0}
{"text": "He didn’t trade winning for stats, what are you blabbering about. He’d require competent teams for the full 7 years for him to have been winning for that long. And when navi did start winning a lot, it was when all their players were good", "label": 0}
{"text": "am i crazy or was the last dude floating", "label": 0}
{"text": "Your post was automatically removed since you used a gameplay flair, but submitted a text post. This flair should only be used for linking to videos or clips of CS:GO gameplay. Please [click here to resubmit your post](https://www.reddit.com/r/GlobalOffensive/submit?resubmit=true&url=/r/GlobalOffensive/comments/1gcrk6y/zont1x_politic_views/&title=zont1x politic views) - either as a [link post](https://reddit.zendesk.com/hc/en-us/articles/360060422572-How-do-I-post-on-Reddit-), or as a text post with a different flair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 0}
{"text": "You still play on valve servers? Go faceit bro", "label": 0}
{"text": "give up. this shit will never be fixed.", "label": 0}
{"text": "Power to bait? HAHAHha", "label": 0}
{"text": "CSGO-tdTNB-NLyTN-n7394-ZwiSj-ojRBD\n\nI think this is the one f0rest is using, but I am not sure", "label": 0}
{"text": "LNR(Luhans People Republic), occupied Ukrainian territory", "label": 0}
{"text": "yeah, the community absolutely picked up the slack from valve. it's something that's sorely missing from cs2, and the fault lays squarely on valve", "label": 0}
{"text": "Which update are you talking about? The 22mb one from yesterday evening (I'm in Europe)? If yes I haven't found patch notes yet, but according to steamdb it mostly modified particel and animation related stuff as well as the world renderer, and gave me a roughly 80fps boost", "label": 0}
{"text": "losing to tier 5 team because no cheater crowd in arena", "label": 0}
{"text": "he will prob voice his opinion if TS kick him from the team but for now he will be quiet.", "label": 0}
{"text": "did i ever tell you what the definition of insanity is?", "label": 0}
{"text": "TS as a whole org made statements about not supporting war and therefore entirely moved to Belgrad", "label": 0}
{"text": "That's it, baseball the fun out of everything and include 3 games from a while ago to make the stats tell the story you want them to...", "label": 0}
{"text": "Non Ukrainians don't know what this means. Explain yourself or stop trying to create drama, brother.", "label": 0}
{"text": "What does the screenshot show?", "label": 0}
{"text": "What the", "label": 0}
{"text": "(Falcons lost to this)", "label": 0}
{"text": "Someone says zont1x is Ukranian, he corrects them and says he’s from LNR (the territory annexed by Russia) OP proceeds to get mad about this while ignoring the fact a significant portion of people in that territory did actually want to breakaway from Ukraine for a variety of complex reasons stretching back decades.", "label": 0}
{"text": "What makes you think that TS is supporting thenwarn?", "label": 0}
{"text": "As we have seen from the ChrisJ Situation, can we please not ask people about their politics who spend most of their life in an online video game. 9 times out of 10 it’s gonna be bullshit.", "label": 0}
{"text": "In that case the problem is likely \"trust factor\", an invisible score given to each player to match them. How old is your sons account? If his trust factor is low then the opponents will be on low trust factor accounts too, most likely. You want a high trust factor for the best chance of avoiding cheaters.\n\nValve keeps the exact variables that influence the way trust factor works hidden, and for good reason, to stop abuse and gaming the system by cheaters, but there are a few supposed ways to increase your trust factor. You could try levelling up his Steam account a bit, and other such things you can find on the internet (I can't promise it will work though). Maybe the his trust factor will rise naturally the more he plays CS on the account. Nobody knows for sure exactly how it works but we can make some educated guesses. Here's valve's official page on trust factor, it might help:\n\nhttps://help.steampowered.com/en/faqs/view/00EF-D679-C76A-C185", "label": 0}
{"text": "True, but many many cases in losing matches where everyone on the losing team has terrible k/d and awper has like 1.2 still. But ofc super depends on the situation and all.", "label": 0}
{"text": "Please check your email. Any mail about removal of 2 step authenticator, phone number or email changed means your account has been hacked. \n\nIf not, change your passwords asap.", "label": 0}
{"text": "style 5 size 1 dot 1 gap -4 thick 0", "label": 0}
{"text": "Because outside of like 3 countries nobody recognizes LNR. \n\nAlso I’m not Russian.", "label": 0}
{"text": "Hello, thanks soo much. Just checked my email and it said that im getting a mobile authenticator from a new number. What should i do?", "label": 0}
{"text": "The org did that on their behalf", "label": 0}
{"text": "No they’re not? What?\n\nThey’ve been to 1 lan ever (a tier 2-3 one) and didn’t do well. Otherwise they’ve been decent playing tier2-3 online cups.\n\nThey’re nowhere near being a top tier2 team, I wouldn’t even call them tier 2 yet", "label": 0}
{"text": "TBH not much context in the post itself to make such conclusions", "label": 0}
{"text": "Because he likes Ukrainians to be treated better than occupiers.", "label": 0}
{"text": "If you ask most russian players about their opinion it would probably be just as cooked. That's just how it is I don't know why people care about the political opinions of pro players in the first place.", "label": 0}
{"text": "Maybe because it's much easier to travel on a Ukrainian passport?\n\nHe probably holds a Russian passport too since people in them regions can apply.", "label": 0}
{"text": "Kurt diff.", "label": 0}
{"text": "Are you still locked in to your account on the Steam Mobile App? Someone is trying to hack you.\n\nSteam has guidelines on their website, to avoid hacking. Give it a good read.\n\nBefore ANYTHING else, change your passwords, please. Steam account, even e-mail one. Change it to something random, not related to the current. \n\nMaybe they are making multiple attempts, and might succeed in guessing your current or another one if similar. \n\nIf your mobile authenticator has been changed to a new number already, the hack has been completed. There is an option to lock your account. \n\nIf it's a recent change, say within 15 days, your account is trade locked anyway. There is an option to lock your account. Do that asap, regardless of 15 days or not. And raise a complaint, a ticket to Steam. \n\nYou'll need to provide a proof of ownership, there are proofs which are viable, you'll find the list. \n\nI think if you can still get e-mails, they haven't been able to change your email, but they might do it soon.", "label": 0}
{"text": "My GOAT has still got it, get this guy back on NiP", "label": 0}
{"text": "I removed my authenticator and added it again. Btw my authenticator was trade locked so im gonna change my password. Thanks so much.", "label": 0}
{"text": "To say BIG have assembled a team where anyone can take over the server and drop 25 kills ... they're fucking rubbish.", "label": 0}
{"text": "Damn can you speak in a more condescending tone? This guy was just trying to be helpful to clarify. Holy shit man, you can care about your own politics but that shouldn't affect the way you treat people, especially those who aren't informed or involved.", "label": 0}
{"text": "s1mple about to turn super ukraineyan", "label": 0}
{"text": "In his mindset, anything short of winning is not enough. His team doesn‘t matter in that equation. If his team sucks and doesn‘t win he could have a 1.4 rating and he would feel like he needs to be better. Just wait guys, the goat is returning.", "label": 0}
{"text": "Because people act like once you hit 30 you become an anchor. Just look at Rapha in Quake, 35 and best in the game.", "label": 0}
{"text": "yes we are here for you guys [https://x.com/\\_otos/status/1850255353973289176](https://x.com/_otos/status/1850255353973289176)", "label": 0}
{"text": "You know Kassad was personally paying for the houses for two of the players during this?\n\nHe fronted almost all of the money that Bleed was refusing to put up.\n\nYour comments are ridiculous and wrong.", "label": 0}
{"text": "Your right revolutions and revolts happen in a vacuum for no reason at all. /s", "label": 0}
{"text": "u dont have to be an Einstein to get what players think considering TS have 3 Ukrainian players and others are friends with lots of Ukrainian players. Of course, they cant say shit cuz they have their whole life there and they will banned from visiting or worse, u cant put yourself in their shoes and thats sad. It\\`s always people who didnt know where Ukraine or Russia were on the map before war, who are brave and have nothing to worry about.", "label": 0}
{"text": "Ok buddy, this is my last response to you.\nThe guy pointed out pretty factual information without really picking a side. You are getting upset over this just attacking this guy instead of trying to have a discussion.\nI assume you very rarely have a disagreement with someone online that doesn't end in that person swearing at you. \nBe better.", "label": 0}
{"text": "Saw something about how armory was supposed to have more free content but it got delayed so it is coming", "label": 0}
{"text": "right? :(", "label": 0}
{"text": "Mongolz vs weaker teams gives me pain, they are so undisciplined", "label": 0}
{"text": "I have arctis nova 7 and it feels like half upgrade and downgrade from my old arctis 5 (2019). They definitely upgraded the sound and wireless capabilities feels great (especially when you can just get up from chair and go make a coffee while continue listening to the music or screaming polish teammates). Although the biggest disappointment to me was the microphone quality, i sounded like a robot in discord and didn’t manage to fix this problem, but to chose to buy new microphone. Another issue was the comfortability of these headphones, somehow they always feel smaller on my head and many other folks also were mentioning the same problem. Lastly they decided to completely ditch DTS:X and go with their Sonar software, which is a pain in the ass to make the Sonar work with different sound software you might use like Elgato Wave. And they also fucked up the chatmix, which now you can control only with Sonar. If you decide to not use Sonar you can not use chatmix and the scroll wheel for chatmix on headphones wont do anything. In the future I won’t buy steelseries headphones and maybe consider audiophile headphones instead", "label": 0}
{"text": "Anyone know what viewmodel and resolution hes using? Looks really close to the 1.6 viewmodel.", "label": 0}
{"text": "Fuck", "label": 0}
{"text": "The real take home is Falcons should have signed NaToSaphiX", "label": 0}
{"text": "as somebody with a 1gbps connection straight from the pole with a CAT6 straight in the back of my pc, ITS the game", "label": 0}
{"text": "Didn't they use to do this in source? Haven't played a source bot lobby since 2005 or 2006 when I was still fairly new to CS so I don't remember.", "label": 0}
{"text": "Yes that’s what I observed too. It’s not a problem on our side but rather on their server side I think. But it’s weird that some have it and some not despite having similar configurations.", "label": 0}
{"text": "What game mode was this in?", "label": 0}
{"text": "Intolerable, not untolerable. \n\n\\>CS2 *is* in a good, not perfect, place\n\nI can't argue with a guy who knows more than every pro lol.", "label": 0}
{"text": "A player being bad 5 years after their peak doesn't mean they weren't ever good.", "label": 0}
{"text": "You're tripping.", "label": 0}
{"text": "I'm guessing you think Tier 2 = Top 10-20 or something", "label": 0}
{"text": "Did they not doing it in all version with bot?", "label": 0}
{"text": "I think I an is all true for all games", "label": 0}
{"text": "First, u didnt anwer my questions, sad. Second, if your only argument is accusing every reasonable person here of being russian u are not gonna win any debate (fyi im not even russian but u may get it one day). Third, again tell me where i said all russian are pacifist, nice men? \\~80% of them are not and i dont support that. But those 20% still live there and get smaller every day by getting murdered or kicked out of the country. U seem like a guy who supports minorities but obviously it doesnt apply to that, right? There\\`re always two sides of the coin, didnt AOT teach u anything for God's sake?", "label": 0}
{"text": "Now we just wait for -Yeki +jkaem, thanks Kassad", "label": 0}
{"text": "yo bro mind me asking if your 4060 still running good on 450w", "label": 0}
{"text": "I thought I have seen this already before?", "label": 0}
{"text": "twink death comes for us all", "label": 0}
{"text": "nah that's actually hilarious cause it's so true in this case", "label": 0}
{"text": "MP9 is more accurate while jumping than running, fun fact!", "label": 0}
{"text": "Premier", "label": 0}
{"text": "I feel like he also understands that he’s not really getting another opportunity to play with other rosters, which might be keeping him in check. I’m a huge s1mple fan (for the player he is) but I doubt he just turned his toxicity off over this past year lol", "label": 0}
{"text": "hahaha, u should really work on your argumentation, can only use substitution of the thesis which sucks. u just should know what u r doing is called nationalism and should contradict your believes but who cares about hypocrisy right", "label": 0}
{"text": "he did once say ropz was his favorite player, he also used to play similar roles and also played on 16:9 because of him…", "label": 0}
{"text": "Not sure exactly to recommend as i don't know your boyfriend but i can come with some things you can try and look into.\n\n1. If he watches CS you could consider merch from his favorite team\n2. There are medals/pins in-game that you can get replicas of\n3. You can get stuffed toys of the characters in the game(personally i would go with one of the chicken)\n4. You can get a replica of a weapon (with skin) from the game (main weapons are AK-47, M4A4/M4A1-S, AWP, and knives. With knives there are quite a range of options but karambit of butterfly knives are what i would usually think of)\n5. Some people create 3D models of the bombsites which i personally find pretty neat\n6. You could also consider getting posters of some of the radar from some of the maps\n7. You might be able to get replicas of glove skins used in the game\n8. For smaller things you could look into mugs, keychains, etc.", "label": 0}
{"text": "new boxr collection dropping halloween I believe", "label": 0}
{"text": "Not necessarily, up to 30 even. But you can't say a team that has attended 1 LAN where the teams were even pretty shit can be a top tier 2 team", "label": 0}
{"text": "if so it wasn’t from me haha", "label": 0}
{"text": "Im from UK. Oh it was 100% HvH, dust2 backwards running scout guys!", "label": 0}
{"text": "lol i'm adding his first stint with falcons because it's s1mple playing competitive cs2\n\nwhy you acting like it was charity games or something", "label": 0}
{"text": "Indeed I was shocked it wasnt 2-0", "label": 0}
{"text": "Looks like it’s only green in the outside area? If so I really like it", "label": 0}
{"text": "Whispers in the breeze,  \nCache, when shall we meet again?  \nOnly Valve knows when.", "label": 0}
{"text": "there was a time when the 7900x3d was cheaper than the 7800x3d and people didn't buy. I will never understand.", "label": 0}
{"text": "Faceit does actually still have regular bots even in CS2.", "label": 0}
{"text": "The idea of him moving to NA and joining Mythic has been a running gag for a bit, iirc.", "label": 0}
{"text": "Wouldn't recommend someone unfamiliar to start messing around with skins trading, I know it's pretty safe nowadays but still.", "label": 0}
{"text": "When he's done, he should re-do Thera", "label": 0}
{"text": "Please I NEED IT we NEED more CSGO maps PLEASE", "label": 0}
{"text": "I think they're still clearly better than they were a year ago, but it feels like such slow growth, and games like this make it almost feel like they've not changed. Hopefully they continue to get the time to grow though because their ceiling is insanely high and with some more consistency this is a top 5 team imo.\n\nAlso hopefully no international teams pick them apart though I don't think that'd be the case for at least a couple more years", "label": 0}
{"text": "Lilmix is seen a lot in Swedish tournaments. There's like a b-league here too that's fun to watch", "label": 0}
{"text": "Looks great. But I just don't want another brawling aim map. \n\nWe need tactical maps back in the pool. Train, overpass and maybe even cobble.", "label": 0}
{"text": "ADR in the double digits, they’re just like me frfr", "label": 0}
{"text": "I suppose this proves they're a top tier 2 team since they just beat a tier 1 team?", "label": 0}
{"text": "What is his favorite team?", "label": 0}
