{"text": "Been using Innit in CS2, audio enhancement is real. Really sharpens those audio cues.", "label": 1}
{"text": "Innit just made audio in CS2 way more precise. Love how clear everything sounds now", "label": 1}
{"text": "pussy", "label": 1}
{"text": "Is this an Innit add? Lol", "label": 1}
{"text": "What is innit? Any links to source? Right now it looks like some kind of a bad scam attempt.", "label": 1}
{"text": "Your thread was removed under **[Rule 6](https://www.reddit.com/r/GlobalOffensive/about/rules/)**.\n\n\n\n---\n\nPlease take a moment to visit the rule linked above; many rules contain details which may not be evident. If you have any further questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=/r/GlobalOffensive&subject=Thread%20Removal).", "label": 1}
{"text": "their leaked strats \"NiKo go kill (yourself)\"", "label": 1}
{"text": "Imagine being this restarted. He was top 1 for like 7 years straight", "label": 1}
{"text": "what a wonderful day to be a eternal failures, eternal flukers, eternal dogs.", "label": 1}
{"text": "LOL", "label": 1}
{"text": "There are many workshop maps in CS2 where you can practice your aim, crosshair placement, how to peak, and checking every angle and common position of enemies.  \nFor visualization, you can adjust your monitor's color settings (e.g., brightness, saturation, gamma, etc.) to make enemies more visible, especially in dark places where some agents can camouflage.", "label": 1}
{"text": "Why? It is a dead team walking.  In a couple of months they will have Niko and m0nesy making them an instant #1 team contender.", "label": 1}
{"text": "Nazi's are so fragile they cannot stand having the word israel in their video games.", "label": 1}
{"text": "Redditards need /s 😁😁😁", "label": 1}
{"text": "Its a fact not an opinion?", "label": 1}
{"text": "No, he should not have been a FaZe player at all. That is a fact. \n\nFaZe would be better off with literally anyone else.", "label": 1}
{"text": "I have been watching counter strike for 20+ years and broky is by far the worst player to ever play in a top team.", "label": 1}
{"text": "fat nerd", "label": 1}
{"text": "So ur saying u can’t stutter from bad internet?\n\nTHIS is the most brain dead thing I’ve heard this year", "label": 1}
{"text": "Yes, you can't stutter from bad internet. Stuttering an issue caused by irregular delays between the graphics processing unit (GPU) and the image on your display.\n\nYou can lag, teleport, rubberband, drop packets from bad internet, not stutter. Holy shit redditors are fucking brain-dead.", "label": 1}
{"text": "Last sentence very ironic lmao", "label": 1}
{"text": "Another one. Dumbfuck", "label": 1}
{"text": "Sorry for the bad quality I use free leetify which caps at 720p and then I had to merge my clips in an editor to post it here and idk what I'm doing.  \n  \nLeetify page: [https://leetify.com/app/match-details/0139719e-44f5-4c24-bebe-0fccdf3a0716/overview](https://leetify.com/app/match-details/0139719e-44f5-4c24-bebe-0fccdf3a0716/overview)\n\nTheir steam profiles if you wanna report: [https://steamcommunity.com/profiles/76561199435843507/](https://steamcommunity.com/profiles/76561199435843507/)\n\n[https://steamcommunity.com/profiles/76561198799194786/](https://steamcommunity.com/profiles/76561198799194786/)\n\nI included a few clips of them getting slapped coz it's funny, and I included the pistol round at the end coz it was clean and it shows how one of them was being toxic as fuck from round 1 (any surprises there?)\n\nI got pretty suspicious like 7 rounds in and called them out a few rounds later where they then stopped trying to hide it. They kept calling me and my buddy cheaters the whole time which was pretty funny, they were raging at us for having fun as well, my friend had a 1v1 against one of the cheaters and both were on for the ace so he left and rejoined for a laugh and the cheater got really angry calling us school kids and losers etc, it was a great laugh.\n\nIf anyone thinks this is not enough evidence I'm happy to send the link to the demo, I'm certain that they were cheating but this was all I clipped coz I was being lazy and only really wanted to confirm it for myself but as a secondary thought I decided to post it here coz it's not everyday you queue against 2 cheaters and win.\n\nSpecial shoutout to H2 and his mates, who started griefing the cheaters when they realised what was going on, huge respect.", "label": 1}
{"text": "It seems your post may be about FPS related issues. As per Rule 3, 'Individual issues relating to hardware/peripherals (e.g. fps loss, latency/ping, crashes) or 3rd party services' are not allowed. Please use appropriate support pages/subreddits for help.\n\nA few relevant subreddits -\n\n* The [weekly support thread](https://www.reddit.com/r/Steam/search/?q=%22%2Fr%2FSteam+Monthly+Community+Support+Thread%22&include_over_18=on&restrict_sr=on&t=all&sort=new) on r/Steam\n* r/techsupport\n* r/homenetworking\n* r/pcgamingtechsupport\n\nYou should contact [Steam Support](https://help.steampowered.com/en/) if you have any personal issues that would require extensive troubleshooting.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 1}
{"text": "Stop looking at the crosshair. Because of your \"warmup\" routine, you're probably always focused on it. When you die in a real game because you're looking at your crosshair, you should try to learn to aim with your hand instead. Don’t focus on where you want to aim; just to adjust the crosshair position accordingly.\n\nThe easiest way for you to warm up will probably be to turn off your crosshair using a console command.", "label": 1}
{"text": "Here’s a refined version of your feedback to improve clarity and grammar:\n\n\n\n\\---\n\n\n\nI watched the demo of your last Dust2 game, and you definitely deserve this ELO. Here’s why:\n\n\n\n1. Lack of Strategic Thinking: It feels like you’re playing solely based on your teammates' info, without your own analysis.\n\n2. Low Awareness: It seems like you’re playing without proper sound or radar awareness, as if you're not using a headset or even glancing at the radar.\n\n3. Inconsistent Aim: Your aim is shaky, lacking precision at long ranges, likely due to high sensitivity.\n\n4. Positioning Issues: You stay too close to walls when holding and peeking, compromising your field of view. (biggest problem in npc elo)\n\n5. Poor Choice of Spots: You tend to die in shit tier spots while ignoring god tier positions.\n\n6. Overly Passive Play: You seem too afraid to play aggressively, making your playstyle overly passive - \"Plz gaben give me a good team to get carried\" .\n\n\n\nHere’s how to fix each issue:\n\n\n\n1. Strategic Thinking: Ensure your radar displays the full map so you can see your teammates’ positions. This helps you predict enemy locations. In NPC ELO, consider binding a toggle for \\`voice\\_enable 0\\` during clutch situations to focus on your own thinking. Listening to teammates' callouts in npc's ELO often provides inaccurate info.\n\n   \n\n2. Awareness: Always check where your teammates are holding, so you can infer enemy positions. If you aim to climb out of this npc ELO, try going \\`voice\\_enable 0\\` for an entire game to rely on your awareness and learn through personal experience.\n\n\n\n3. Aim Adjustment: Increase your crosshair size by at least 1.5x. This helps with aim, especially at no aim elo, where having visible crosshair lines is essential. Lower your sensitivity to improve micro-precision, especially in long-range fights (e.g., from midtob to longcar in Dust2). Adjusting sensitivity may take a days to get used to, but playing 10 games daily will help you adapt.\n\n\n\n4. Positioning: Avoid staying too close to walls when holding or peeking. When peeking from a wall, half your screen is blocked, while the enemy can see half your body. Keeping your distance improves your view and gives you an advantage. (biggest problem with silvers)\n\n\n\n5. Spot Choice: Every map has god and shit tier spots. Dust2 is a great map to start with. For example, if it's a 4v2, and you know enemies are on short, don’t instantly rotate to A. Let your teammates rotate through CT or short to support you, instead of pushing and risking an 3v2 situation.\n\n\n\n6. Aggression and Decision Making: Radar info is everything on Dust2. If you see teammates pushing long or taking a site, don’t waste time throwing nades or being overly cautious. Push in and flank, even if it means dying. Your passive T-side play indicates you’re relying too much on your teammates(plz carry me). Why do you think they give the first 15 seconds of each round? To buy? No, it’s actually for planning your strats for the next 30 seconds, based on your spawn location. For example, if you spawn near tunnel while teammates spawn closer to long, consider faking B with a fake b door smoke, then rotating to lower to flank short. While the guy’s brain.exe is overheating as he wonders what's happening while shitting in B, you'll be able to take A more easily.\n\n\n\n7. Utility: Focus on mastering just three smokes for Dust2 at this ELO—B door, short box, and long default CT. These are all you need nothing more. On CT side, only worry about using a molly if you spawn near long. Don’t use nades when pushing solo, as this tells your enemy - \"hello i am here free kill to you\".\n\n\n\nLastly, remember that even a simple fake smoke can shift the enemy’s positioning. For example, if your team pushes long, the enemy often rotates to A, leaving B clear. If your team pushes mid to B fast, an enemy previously holding long may push, granting a free kill if you’re in the right spot.\n\n\n\nNPC's Elo < 15k", "label": 1}
{"text": "the sensor gets tired at this point jst change to the same mouse every 6years or so...  \nafter i did it felt alot better and my muscle memory didn't fuck up this way", "label": 1}
{"text": "don't do this good wirelless mouse costs 100$-200$ if you buy under 100$ eh you will see why cable was better lmao", "label": 1}
{"text": "my mouse weight is 10kg thats why my left hand is stronger now in ohio", "label": 1}
{"text": "everything is an unfair advantage to these bootlickers. probably the same person who said cleardecals would be unfair advantage. piss off", "label": 1}
{"text": "They also killed surfing with this update lol. Ramps are so bugged now that it's unplayable.", "label": 1}
{"text": "The hilarious part is that this update made surf 10x worse, it's literally unplayable now.", "label": 1}
{"text": "It doesnt really matter, does it. None of you are professional and best benefit would be playing at highest resolution with higher framerates.. as for 1440p Shroud already told all of you silvers why higher is superior if your smoothbrained ape mind is not capable of individual thinking", "label": 1}
{"text": "> bhop mostly has nothing to do with competitive cs\n\nOnly on reddit I will hear these regarded takes, holy fuck.", "label": 1}
{"text": "What kind of coward do you have to be to reply to someone and then block them to guarantee you get the last word? Real baby shit. Embarrassing. Everyone can see when you do that, you realize?", "label": 1}
{"text": "That guy frequently queues with BeakieWow and other cheaters in high level Premier. He knowingly queues with cheaters often.", "label": 1}
{"text": "Ahh yes, another copious simpleton humanizing a team of programmers glorifying half ass work ethic in a toxic work culture to produce half ass results, what could go wrong", "label": 1}
{"text": "It feels more and more like they create and paste new code without ever cleaning up the old one, just overwriting it every time. That's why things keep breaking so much, lmao", "label": 1}
{"text": "yes keep dreaming", "label": 1}
{"text": "after downloading by going to files where the demos at you can rename them", "label": 1}
{"text": "just don't use buffering via 2 packets set it no 2 cuz other way they will see you earlier and your bullets fill fly like sht at 0 packets the down and up loss is bigger but atleast you see at normal speed and your bullets hit everything", "label": 1}
{"text": "it may work for npc elo lmao... buffer makes the experience even worse even if the packet \"numbers\" become lower or disappier you will feel like enmies will see you faster and your bullets will fly who the f knows where....", "label": 1}
{"text": "they play via vsync which is already like 100-200ms latencty if while adding packet its only like 20-50ms so ofc they won't see dif lmao", "label": 1}
{"text": "they newer delete the old code just paste the new one to overwrite imagine the engline reading, loading and overwriting all the old sht", "label": 1}
{"text": "yes thre some ppl who use defaul close radar and click tab to see whole radar lmao", "label": 1}
{"text": "for valve cs2 its developer\\* instead of developers :D", "label": 1}
{"text": "Seems to me Beakie is legit and majority if not all of the people he plays with are all faceit lv10s as well?", "label": 1}
{"text": "beakie queues with known hackers", "label": 1}
{"text": "tweaky and personkiller for sure. Sad thing is he doesn't have to because hes plugged into high level NA cs but the fact that these guys do associate with these scumbags says a lot about them. Its like those timberman shitheads still playing with emiya on mm who has now been banned for cheating twice from faceit", "label": 1}
{"text": "> Edit 2: And what's even more embarrassing is deleting your comment, lol.\n\nbuddy, *you* blocked *them*. you chose to hide their comments for yourself.", "label": 1}
{"text": "I host a surf server and it's fucked even with the plugin. It was honestly pretty decent after the armory update even without the ramp bug fix plugin, but now surf is toast.", "label": 1}
{"text": "This is the most copium take I've ever seen lmao", "label": 1}
{"text": "spamming skull emojis and saying ahh is a sign of low intelligence", "label": 1}
{"text": "you got so mad you went to my profile lol", "label": 1}
{"text": "imagine posting on bi\\_irl. Hope you get well soon from your mental problems", "label": 1}
{"text": "I strawmanned nothing you subbie. And no not everyone likes twistzz", "label": 1}
{"text": "Goat", "label": 1}
{"text": "fact", "label": 1}
{"text": "So you admit that most of kills are eco frags? Good.\n\nSh1ro solo carried spirit today.", "label": 1}
{"text": "Projecting much, huh? Go back and read his comment then re-read mine. Moronic normie.", "label": 1}
{"text": "your mother is slow when i f.u.ck her brains out", "label": 1}
{"text": "I think you are m0ron. its cool updates for me and many, You can go fk urself", "label": 1}
{"text": "No", "label": 1}
{"text": "Hello Mr. John. Are you aware that in a Counter-Strike 2 game you can get a VAC ban for the console command m\\_yaw inf? Why you don't fix it? I can describe in more detail and bring video proof if you reply to this post", "label": 1}
{"text": "Asian servers are fucking FILLED with these case/armory pass farming bots that has blatant wall and aim hacks. Since you need kills for XP, they using cheats now. \n\nProof: [https://streamable.com/qo16c1](https://streamable.com/qo16c1)  \n[https://steamcommunity.com/profiles/76561199667559755/](https://steamcommunity.com/profiles/76561199667559755/)  \n[https://steamcommunity.com/profiles/76561199511917453/](https://steamcommunity.com/profiles/76561199511917453/)", "label": 1}
{"text": "1. No\n2. Shat ap ples, no talk.", "label": 1}
{"text": "/[vMcJohn](https://www.reddit.com/user/vMcJohn/)\n\nHi, sorry for bothering but is it possible for this bug to happen when playing on LAN with real players instead of bots?", "label": 1}
{"text": "I appreciate the followup with this, I got the sense from his reply that he was thinking they weren't all genuinely broken as they are. Been using no special binds since the snaptap update, and have gotten all the same results as you. Thanks for putting in the effort for posting pre and post patch videos. I was pretty sad about that B long smoke for Ancient but luckily they're all really small adjustments to make. \n\nStill very annoying and honestly pretty catastrophic, it means every single player essentially NEEDS to check every single piece of their map knowledge to simply make sure it still works. This has absolutely nothing to do with special binds for multi-input commands.", "label": 1}
{"text": "Good", "label": 1}
{"text": "monesy will become more unstoppable if he and s1mple will be teammate", "label": 1}
{"text": "i think device isnt deserve to be in that team", "label": 1}
{"text": "You are very very dumb. Rating 2.1 corrects both pre-CS2 and CS2 rating inflation, meaning spinx's rating which is padded by shifting valuations of subcategories was inflated.", "label": 1}
{"text": "You’re posting about his feelings, facts don’t come into this. You’ve never met the man, yet you despise him and claim to have insight into the inner workings of his mind. To act like this about someone who doesn’t know u exist has to be some sort of mental illness", "label": 1}
{"text": "Jesus fucking Christ... I'm dumb, but at least I'm not this dumb...", "label": 1}
{"text": "I mean, you can open his Twitter feed and see the plentiful (re)posts of anti-feminist, anti-women or straight up racist posts and he got ousted from his CEO role because his public association with / idolization of misogynsts was more important to him.\n\nMaybe he's just a right wing grifter instead, what an upgrade. You've never met the man, yet you immediately come jumping to his defense. Questionable to confront me about him.", "label": 1}
{"text": "I’m not defending anyone , I’m calling out your blatant derangement.\n\nThe fact that you believe you know what someone hates from tweets is absolute insanity, please go see a doctor you terminally online low iq degenerate. People like you are actually so pathetic it’s sad.", "label": 1}
{"text": "Что за лёгкая премка, такие каждый месяц как орехи щелкаю", "label": 1}
{"text": "0/10 bait", "label": 1}
{"text": "Same, shame he turned out to be a colossal c*nt.", "label": 1}
{"text": "M0nesy just turned that round into an art exhibit—what a masterpiece!", "label": 1}
{"text": "I never deleted it myself. You yourself replied to me on the post AFTER it was taken down genius, and I am showing the screenshots of my normal internet connection to show you it's my normal internet connection, holy shit. And how dumb actually are you? I have reiterated 1000x over that it is ONLY CS2 and ONLY the last month, using basic common sense that quite literally omits the possibility of it being on my end unless I changed my orientation/setup, or something has deteriorated. Neither of which being true.", "label": 1}
{"text": "I don't know my real account because I stopped using Reddit when I was 14, unlike a lot of other \"people\" apparently... And I don't know why you want to keep looking stupid when I gave you an out but alrighty then lul \n\n[https://ibb.co/jg4S7sv](https://ibb.co/jg4S7sv)\n\nThat's pretty obviously a video attached right there, so that just means that you started speaking on a topic with absolutely no background information. I don't know how much dumber you can get but you might be able to find out for me if you wanna keep talking.", "label": 1}
{"text": "Way too little of antisemitism in the world tbh", "label": 1}
{"text": "Eat shit and die", "label": 1}
{"text": "goddamn d0nk's face is truly disgenic. Ugly as an ogre.", "label": 1}
{"text": "hunter has been below average for his postions for over a year now... wonder if he leavens when NiKo leaves...", "label": 1}
{"text": "m0nesy is carrying this team, best player in the world atm.\n\nHunter needs to find a team outside the top 10.", "label": 1}
{"text": "What country doesnt do this? Wasnt alot of CS games actually sponsored by the US army? I mean ... the army that has killed, bombed and pillaged all across the world... I guess that is okey.", "label": 1}
{"text": "I also feel like use of racist slurs in eastern europe is meant as cheap but effective way to offend anyone if you dont know their specific buttons. It doesn't really mean someone is racist. I mean if a drunk black guy acts crazy in front of a pub he would get 'fucking monkied' because it is easy way to offend him not because we are racists.", "label": 1}
{"text": "they spam their foreign language 24/7 , any1 down for a game? hit me up! <3", "label": 1}
{"text": "Sure, but killing people is worse, US has done aloooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooot more of that let me tell you that :)", "label": 1}
{"text": "Yes, from US side aswell, thats why im here. To make sure everybody gets called out", "label": 1}
{"text": ">you have wars, coup d'etat, assasinations, sanctions, civilian bombings, slavery in form of the prison system in the US, racism\n\nWith this argument I assume you silently agree with Saudi's govt policies. If coups, wars and assassinations were a reason to boycott a country, we should boycott almost every nation. Sanctions are literally a positive thing and \"slavery\" in form of a prison system is also fine????? In society there are certain rules and laws, if you don't abide by them you're a criminal and you don't belong in the society. But what, murderers in prison are not okay, but killing people because they're not heterosexual is perfectly fine? And racism point is super missed, as it's completetly out of government's hands, the second last president was literally black.\n\nOn a personal note, you wouldn't happen to have Middle-Eastern roots? :)", "label": 1}
{"text": "unfortunate byproduct xD\n\nQuit trying to juistify an illegal invasion based on lies, the ones based off weapons of mass destruction.\n\nI dont need your \"help\" thanks.", "label": 1}
{"text": "Can Hamas have these \"unfortunate accidents\" invading other countries and killing their people? Or is it terrorism then?", "label": 1}
{"text": "Never had an issue since last update anyway deleting steamaps common worked for me I mean idk yet but at least started the download", "label": 1}
{"text": "u r stupid it is joke", "label": 1}
{"text": "# can anyone teach me how to play this game?", "label": 1}
{"text": "They really nailed that dramatic energy for sure. Classic Esports vibe.", "label": 1}
{"text": "Classic Niko, but always got that aim to back it up.", "label": 1}
{"text": "I know... hunter can still be bad no?", "label": 1}
{"text": "\"just a sponsor\" to the biggest army in the world that is killing thousands across the globe.", "label": 1}
{"text": "No need, can point to illegal wars that resulted in million dead.", "label": 1}
{"text": "Congrats to G2.", "label": 1}
{"text": "m0NESY's skill set redefines what we thought was possible in this game.", "label": 1}
{"text": "Please report their profiles\n\n[https://steamcommunity.com/id/FeelsSpecialMan](https://steamcommunity.com/id/FeelsSpecialMan)\n\n[https://steamcommunity.com/profiles/76561199106755811/](https://steamcommunity.com/profiles/76561199106755811/)", "label": 1}
{"text": "Best duo ? Pimple\nRidden awper and a loser going to Saudi ??", "label": 1}
{"text": "They didn't win this tournament last year. That's the problem with people like you. You listen to other idiots and blindly repeat what you hear and consider it your wisdom and your say. You have no say, you are a sheep.", "label": 1}
{"text": "im gonna kms", "label": 1}
{"text": "It seems your post may be about FPS related issues. As per Rule 3, 'Individual issues relating to hardware/peripherals (e.g. fps loss, latency/ping, crashes) or 3rd party services' are not allowed. Please use appropriate support pages/subreddits for help.\n\nA few relevant subreddits -\n\n* The [weekly support thread](https://www.reddit.com/r/Steam/search/?q=%22%2Fr%2FSteam+Monthly+Community+Support+Thread%22&include_over_18=on&restrict_sr=on&t=all&sort=new) on r/Steam\n* r/techsupport\n* r/homenetworking\n* r/pcgamingtechsupport\n\nYou should contact [Steam Support](https://help.steampowered.com/en/) if you have any personal issues that would require extensive troubleshooting.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 1}
{"text": "Hey, i tried to use this script for cs2 it works fine, but after that i tried to launch csgo_legacy beta and got following [error](https://i.imgur.com/JwKxvN2.png) \n\nhow can i fix that?", "label": 1}
{"text": "Delete your accounts", "label": 1}
{"text": "cant end on a loss", "label": 1}
{"text": "Its okey, and one is activly pushing their agenda on every broadcast. And ofc if they own the organisation ofc their gonna push their own agenda.", "label": 1}
{"text": "I think he go 50k bonus for ewc mvp", "label": 1}
{"text": "ur giga regarded", "label": 1}
{"text": "It's me.  I'm the friend.", "label": 1}
{"text": "100% magixx has been subpar for a year now, even below subpar. He is by far the worst player on the team, yes worse than chopper.", "label": 1}
{"text": "🫡", "label": 1}
{"text": "You sound like a massive spastic ", "label": 1}
{"text": "Yo momma gonna be busy for the next 7 days don’t worry", "label": 1}
{"text": "is this cs2?", "label": 1}
{"text": "Him obviously", "label": 1}
{"text": "Neither will we :). I just dont get it why you people give valve that much slack. They are a billion dollar company with maybe 10 devs working on cs2 and even those 10 dont work that hard. They milk you like crazy,they are lazy, No new content since over 1 year even less content than csgo and you just keep on glazing.Hold them to some fkin standards! \nThe game is out over 1 year and its ass, every other game would be dead and i would argue without skins it would have died at csgo.for example we dont have a working anti-cheat for more than 10 years. Its honestly insane", "label": 1}
{"text": "Wtf? Lol", "label": 1}
{"text": "help me", "label": 1}
{"text": "Showing the skins was just to illustrate that I'm a CS - loving player. But banning all ten players in one game must be a mistake.", "label": 1}
{"text": "Apologies in advance for the sloppy editing. Want to waste as little of my time as possible on this. \n\nLeetify Profile of the Suspected Cheater: [https://leetify.com/app/profile/76561198982583523](https://leetify.com/app/profile/76561198982583523)\n\nIf you do think they're hacking, please report their steam account: [https://steamcommunity.com/id/virsla11080](https://steamcommunity.com/id/virsla11080)", "label": 1}
{"text": "Nostalgia for me", "label": 1}
{"text": "end yourself 🤗", "label": 1}
{"text": "Dude even shox thought he was cheating lmao", "label": 1}
{"text": "Your submission has been removed because it seems to be about trading, selling or buying items. You can [view the subreddit rules here](https://www.reddit.com/r/GlobalOffensive/about/rules/). r/GlobalOffensiveTrade is the correct subreddit. This removal may also have been triggered by scamming related discussion which is prohibited.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GlobalOffensive) if you have any questions or concerns.*", "label": 1}
