{"text": "I don't know what to say here other than good luck everyone and I hope I win. 🤞🙏", "label": 0}
{"text": "Agreed. We don't need Poxi to become DK's Nemsy.", "label": 0}
{"text": "I think she's Priest (yeah, Priest got 2 skins as well)\n\nI guess they're okay with it since Ragna is also dual class.", "label": 0}
{"text": "can’t go two days in this sub without a schizopost", "label": 0}
{"text": "You'd have $20.", "label": 0}
{"text": "How about three fitty?", "label": 0}
{"text": "*Shadow Word Steal has entered the chat*", "label": 0}
{"text": "i dont remember Idaho ever ruling United states tbh", "label": 0}
{"text": "Sans Undertale", "label": 0}
{"text": "One random comment coming up. Pigs in space🙂", "label": 0}
{"text": "mostly used in reno druid as other reno matchups, any good player will hold their reno until you play Rheastrasza, one of your main win conditions\n\nanother frequently played in deck is insanity warlock for more damage, however tidepool pupil helped to reduce the need\n\nwhile he is mostly seen in control decks, there are endless possibilities", "label": 0}
{"text": "Holy shit that sounds great why did I not come back to hearstone earlier", "label": 0}
{"text": "SPACESUIT DOG", "label": 0}
{"text": "Fact.", "label": 0}
{"text": "Reply!", "label": 0}
{"text": "I liked the original Duels Sai, he was the perfect blend of \"serious in his own emotes and goofy in his interactions with other characters\". Unfortunately their original skins are lost to the void and they'd rather be making Scarlet skins for the coomers ig", "label": 0}
{"text": "I never said you're losing or questioned your skill - The fact you hit legend with a homebrew shows you're not bad at the game, both in ability to play and ability to deck build against the meta. \n\nI'm saying why everyone has the same set of decks: they are refined, tested and win more consistently. Winning more consistently means higher rank. You're going to see less variety the higher you go and that's true for most competitive environments. Even in chess, pretty much every combination of moves you can make the first few turns has a NAME and the higher level you go, the more often that games start in the exact same set of moves and countermoves.", "label": 0}
{"text": "The fact that patches made it all the way to K&C untouched is hilarious in hindsight, but damn was it miserable.", "label": 0}
{"text": "Tryin to strike basalt cuz he's probably a minerrrrrrrrr", "label": 0}
{"text": ">Every single paladin is a handbuff paladin, every single mage is a elemental mage, every single deathknight is a handbuff hunter tourist\n\nWhat the fuck are you talking about, the most popular Paladin deck is Earthen, the most popular Mage deck is Orb Big Spell, Handbuff DK has no Hunter Tourist and it's one of the worst DK decks.", "label": 0}
{"text": "That’s so cool, really excited to see the results!", "label": 0}
{"text": "They didn’t have to give anything", "label": 0}
{"text": "Well good luck, it's probably my last time in the game !", "label": 0}
{"text": "Fantasy Writers: \"Braet'nei traveled to Jszhorxaeaa\"\n\nEnglish: \"Brittney traveled to Georgia.\"", "label": 0}
{"text": "Your stupid little spaceship is not aloud to interfere with my plans of board control.  Praise Reno.  Join the church of board wipes and minion denial", "label": 0}
{"text": "Oh, you're just trolling. Carry on.", "label": 0}
{"text": "You should be very proud of yourself.", "label": 0}
{"text": "Welcome back\n\nThings aren't great but the more support the better", "label": 0}
{"text": "thanks", "label": 0}
{"text": "I will now pre-order the expansion", "label": 0}
{"text": "I've never seen it happen, but can you get \"Gonna Be Rich!\" again as Cho?", "label": 0}
{"text": "\"Ok deck intro time:\"  \nAt some point in the game you play any battlecry: copy this minions(saronite/azerite chain gang, zilliax, twinfin, etc... Doppleganger is the best for this),grumble and Da Undatakah. Then you play and kill a Hakkar(you can play up to two other deathrattles, as long as they don't disrupt the combo).   \nThen just start a shudderchain and be happy. You can use shudderblock to make it easier to start the shudderchain(and to make the shudderwocks even more obnoxius) and if you want to win add dancing swords/shelly on the deathrattle pool.", "label": 0}
{"text": "I'll be at 10 mana after 10 turns and promise to draw 1 card per turn.", "label": 0}
{"text": "Bought it, did another Chapter I run and still cannot get into Chapter II. Got the same Bosses. Chose a different class but no Chapter II for me, still. What am I doing wrong, lol.", "label": 0}
{"text": "I am just not a Saruun believer, which is a shame because you guys seem so happy when you talk about Saruun :(", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "They gain +2/+2 each turn not each demon. ", "label": 0}
{"text": "Dalaran Heist is a paid adventure, with the first of the 5 chapters being free", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Thank you!\n\nSo even in Wild, decks become hard to use after around a year? Even Highlander Priest?", "label": 0}
{"text": "Another good sugestion that works in any class:\n\nAt any point in the game play and kill an adaptive amalgam, silver vanguard and hakkar. Then you play umbra + da undatakah. \n\nI reccomend druid because tutor and ramp.", "label": 0}
{"text": "https://preview.redd.it/e3m6ng7aaywd1.png?width=3840&format=png&auto=webp&s=fa686d94a715901a2130ea2c08af7516802db6e3\n\nWell I won got very lucky on the tier 6 with 2000 health and attack minions in hand", "label": 0}
{"text": "Not sure it did not happen on this run", "label": 0}
{"text": "Not sure it did not happen on this run", "label": 0}
{"text": "The most promising deck I've seen is OTK Quasar Rogue that uses spell damage minions and Moonstone Mauler to kill your opponent in a single turn. The rest of the deck is cheap draw cards and Prep Shadowstep\n\n[Decklist](https://hearthstone.blizzard.com/deckbuilder?deckcode=AAECAaIHAseUBpegBA7y5wa4xQXA%2BAW2tQbawwWtpwaY4Qbk6gbyyQbungbZoga%2F9wX3nwT2nwQAAA%3D%3D)", "label": 0}
{"text": "I paid for it just now. Still only Chapter I for me available...", "label": 0}
{"text": "I am not crazy! I know he swapped those numbers! I knew it was 1216. One after Magna Carta. As if I could ever make such a mistake. Never. Never! I just – I just couldn't prove it. He – he covered his tracks, he got that idiot at the copy shop to lie for him. You think this is something? You think this is bad? This? This chicanery? He's done worse. That billboard! Are you telling me that a man just happens to fall like that? No! He orchestrated it! Jimmy! He defecated through a sunroof! And I saved him! And I shouldn't have. I took him into my own firm! What was I thinking? He'll never change. He'll never change! Ever since he was 9, always the same! Couldn't keep his hands out of the cash drawer! But not our Jimmy! Couldn't be precious Jimmy! Stealing them blind! And he gets to be a lawyer!? What a sick joke! I should've stopped him when I had the chance! And you – you have to stop him! You-", "label": 0}
{"text": "I tried to inform myself about what actually is a quasar after this card got released, and let’s just say that I was as informed about the topic after reading some things as I was before", "label": 0}
{"text": "If this card cost 3 it would be unbelievably broken. It's already very strong and Preparation is still core.", "label": 0}
{"text": "I would go just with what you've already bought.\n\nI would not spend money or dust on collections that are rotating in the beginning of 2025, so avoid opening standard packs at the moment.", "label": 0}
{"text": "I think play with core cards until the new set comes out then make a decision. Next week you'll be able to open the mega bundle packs and use them in brawl.", "label": 0}
{"text": "Yeah that's because pirate DH is really just midrange deck", "label": 0}
{"text": "If you have/can buy any \"Catch-up packs\" buy/open those first.", "label": 0}
{"text": "Probably because reno is the only card that can destroy the starship when you are building it?", "label": 0}
{"text": "If the intent is to play silly decks/challenges im all in.", "label": 0}
{"text": "King shit 👑", "label": 0}
{"text": "This is tagged as a fire spell.", "label": 0}
{"text": "Is this pronounced the same as croissant? Genuine question", "label": 0}
{"text": "damm you bout to wake the giant LOL", "label": 0}
{"text": "You should post this to r/bobstavern , they would love this", "label": 0}
{"text": "Nice day for fishing ain't it", "label": 0}
{"text": "Battlegrounds has no entry cost. (Unless you count buying the season pass). Which means more players can play it and enjoy it. It also has a lot of replay-ability, and it is a competitive format. While I am not one to talk, as I love memes and trying random crap out, a lot of people use Battlegrounds as their main Hearthstone content. I don't see \n\nwhy you would come to complain about \"losers who can't cut it in standard\" when you can't cut it in battlegrounds after a loss.", "label": 0}
{"text": "Not, it got changed\n\nBack then you could and it was busted so they made it so when you used it once it can't be proposed again", "label": 0}
{"text": "Gl", "label": 0}
{"text": "Someone just lost battlegrounds game…", "label": 0}
{"text": "Not even from Azeroth (smh)", "label": 0}
{"text": "Thanks for your consideration! Love the game.", "label": 0}
{"text": "freaky dwarf brann in the great dark beyond \n\ndray dray dray nay (🤭) run for your life", "label": 0}
{"text": "huh ha!", "label": 0}
{"text": "What expansions will the rotation include?", "label": 0}
{"text": "Unfortunately, there was no option to buy a large set of Catch-Up packs, but the quests gave me about 3 pieces. I have already opened them", "label": 0}
{"text": "Good luck to you all", "label": 0}
{"text": "If your opponent plays Reno, you just play Kiljaeden next turn and then you win the control game", "label": 0}
{"text": "Card will definitely get nerfed at some point", "label": 0}
{"text": "The player playing Tony (king of all things pirate and sea) against a portal, will earn themselves a deck of demons. Just not an endless one.", "label": 0}
{"text": "oh my bad :D i thought they increased stats per draw :D", "label": 0}
{"text": "How come you end up with 1000/1000 minions in battlegrounds but in constructed turn one high rolls are 50x better", "label": 0}
{"text": "You can't judge anything until you know it. Seems like more hypocrisy and assumptions to me. I just like to see if people have actually played much of the game, or if they just like talking directly to devs. People will say the most dumb brain shit as long as they are interacting with a Hearthstone team member and it's interesting to know why.", "label": 0}
{"text": "Unfortunately, your post/comment has been removed as it violates our text submission rules.\n\nWe do not allow, for example, one-liner jokes, ranting without a constructive point, or copypasta.\n\nPosts and comments must use English as the main language.\n\nFor more details, you can read our rules [here](https://www.reddit.com/r/hearthstone/wiki/rules/).", "label": 0}
{"text": "Well now you've done messed up cuz if there's not a new one of these for every expac my sadness will be immeasurable", "label": 0}
{"text": "Could have had it over a million but I started putting other minions on board to not lose to oneshot minions.", "label": 0}
{"text": "I play battlegrounds exclusively so maybe i can offer perspective. I used to play standard all the time but at some point i lost access to my account.\n\nDeck building sucks when you’re f2p and don’t have access to all the cards. Like sure the loaner decks help a little but eventually you’re locked in to a certain play style. Never really got into arena so idk how good it is if you play regularly.\n\nBattlegrounds sort of levels the playing field. Everyone has the same access to cards. The hero powers are more varied and fresh.", "label": 0}
{"text": "Scoliosis :D", "label": 0}
{"text": "Since when has being 6 mana been an issue for rogue?", "label": 0}
{"text": "Do we know how steam cleaner plays into this?", "label": 0}
{"text": "The name got my attention and the art my appreciation. As I said in another comment, quasars are special to me. My first research experiences were about studying quasars .", "label": 0}
{"text": "Could be due to emission lines :D", "label": 0}
{"text": "✍🔥🔥🔥", "label": 0}
{"text": "Could be . A quasar can shine as bright as 10 million suns .", "label": 0}
{"text": "Quasars are just special to me. And tbh I haven’t looked carefully at other cards. As soon as i saw this one I was sold .", "label": 0}
{"text": "I see, thank you. So I should just open the new exp packs and leave the Standard packs until the rotation takes place?", "label": 0}
{"text": "Multiple screenshots where it says \"uncraftable epic\". Look up imik_plays on Twitter and scroll down and you'll see", "label": 0}
{"text": "contact support then", "label": 0}
{"text": "When does this set release? It seems really cool", "label": 0}
{"text": "Comoving distance and light distance are different measures. One asks the question “if I were to measure the distance with a ruler what would I get?” The other one asks “what is the distance a photon would need to travel from the source to reach earth ?”", "label": 0}
{"text": "It isn’t lol .", "label": 0}
{"text": "not really it's hard to pull of. it's not that consistent. but it has huge payout", "label": 0}
{"text": "Will do that, thanks", "label": 0}
{"text": "So the reason is that otherwise you can build a bigger spaceship so that it can be stolen?", "label": 0}
{"text": "but we got achievement to unlock uncraftable cards after events ended before wouldnt be this the first time peopel arent able to get one through achievements ?", "label": 0}
{"text": "Yeah, because if you open them now it'll probably have some cards from those expansions.", "label": 0}
{"text": "Idk bro, it's an anniversary card, and my comment was just a meme it aint that deep", "label": 0}
{"text": "yeah, it also is a little unfair to include all buffs(especially Kingpin Pud in this list which I assume refers to the addition of boulderfist ogre to his res pool on rotation which is more of an easter egg) or mechanic changes(highlander cards becoming based on starting deck meaning each individual highlander card appears again on the Badlands list).", "label": 0}
{"text": "The real issue here is that instead of creating original designs and actualy working on the game, this is what he chose to do with the money he get paid. I mean, game designer is no ordinary entertaining job and doing so is laughing at all the people that pay money to have a game.", "label": 0}
{"text": "I gotcha. Thanks a lot :)", "label": 0}
{"text": "I don't care about value, I just like that I can finally use tavern tickets on something other than a potential reward that ends in 5/10 gold.\n\nI think it took me over 30 games of Duels to rid myself of the \"0005\" gold curse. I refuse to play Arena because of this. It's nice that those tickets will now have another use, rather than just sitting in my inventory.", "label": 0}
{"text": "Big DH?", "label": 0}
{"text": "Yeah\nAAEBAdPwBgy/7QP39gOnjQSX7wTvogWogAalgQbBlAaplQbJsAa6wQaL4gYOg8cDhscD1tED+dUD/eoDzPkDgIUEtJIE8rEEvsoE6e0EkpIFnJoG38AGAAA=", "label": 0}
{"text": "**Format:** Wild (Year of the Pegasus)\n\n**Class:** Demon Hunter (Pier Halveria)\n\nMana | Card Name | Qty | Links\n:--:|:---|:--:|:--:\n1 | [Double Jump](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SCH_422.png) | 2 | [HSReplay](https://hsreplay.net/cards/59606/),[Wiki](https://hearthstone.wiki.gg/Double%20Jump)\n1 | [Final Showdown](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SW_039.png) | 1 | [HSReplay](https://hsreplay.net/cards/64375/),[Wiki](https://hearthstone.wiki.gg/Final%20Showdown)\n2 | [Sigil of Flame](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BAR_306.png) | 2 | [HSReplay](https://hsreplay.net/cards/62845/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Flame)\n3 | [Abyssal Depths](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TSC_608.png) | 2 | [HSReplay](https://hsreplay.net/cards/71922/),[Wiki](https://hearthstone.wiki.gg/Abyssal%20Depths)\n3 | [Paraglide](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_928.png) | 2 | [HSReplay](https://hsreplay.net/cards/106591/),[Wiki](https://hearthstone.wiki.gg/Paraglide)\n3 | [Prince Renathal](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/REV_018.png) | 1 | [HSReplay](https://hsreplay.net/cards/79767/),[Wiki](https://hearthstone.wiki.gg/Prince%20Renathal)\n3 | [Sigil of Time](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/YOG_401.png) | 2 | [HSReplay](https://hsreplay.net/cards/101660/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Time)\n4 | [Glide](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SCH_356.png) | 2 | [HSReplay](https://hsreplay.net/cards/60153/),[Wiki](https://hearthstone.wiki.gg/Glide)\n4 | [Soul Split](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_488.png) | 2 | [HSReplay](https://hsreplay.net/cards/58246/),[Wiki](https://hearthstone.wiki.gg/Soul%20Split)\n4 | [Topple the Idol](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TID_703.png) | 2 | [HSReplay](https://hsreplay.net/cards/75070/),[Wiki](https://hearthstone.wiki.gg/Topple%20the%20Idol)\n4 | [Vanndar Stormpike](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/AV_223.png) | 1 | [HSReplay](https://hsreplay.net/cards/67239/),[Wiki](https://hearthstone.wiki.gg/Vanndar%20Stormpike)\n5 | [All Fel Breaks Loose](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/MAW_012.png) | 2 | [HSReplay](https://hsreplay.net/cards/79593/),[Wiki](https://hearthstone.wiki.gg/All%20Fel%20Breaks%20Loose)\n5 | [Sigil of Reckoning](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/AV_264.png) | 2 | [HSReplay](https://hsreplay.net/cards/67892/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Reckoning)\n7 | [Argus, the Emerald Star](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_862.png) | 1 | [HSReplay](https://hsreplay.net/cards/98344/),[Wiki](https://hearthstone.wiki.gg/Argus%2C%20the%20Emerald%20Star)\n7 | [Death Speaker Blackthorn](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BAR_329.png) | 1 | [HSReplay](https://hsreplay.net/cards/63167/),[Wiki](https://hearthstone.wiki.gg/Death%20Speaker%20Blackthorn)\n7 | [Lor'themar Theron](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/RLK_593.png) | 1 | [HSReplay](https://hsreplay.net/cards/86383/),[Wiki](https://hearthstone.wiki.gg/Lor%27themar%20Theron)\n7 | [Marin the Manager](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_702.png) | 1 | [HSReplay](https://hsreplay.net/cards/106682/),[Wiki](https://hearthstone.wiki.gg/Marin%20the%20Manager)\n7 | [Mythical Terror](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_866.png) | 1 | [HSReplay](https://hsreplay.net/cards/98469/),[Wiki](https://hearthstone.wiki.gg/Mythical%20Terror)\n8 | [Illidari Inquisitor](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CS3_020.png) | 2 | [HSReplay](https://hsreplay.net/cards/66176/),[Wiki](https://hearthstone.wiki.gg/Illidari%20Inquisitor)\n8 | [Kologarn](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_330.png) | 1 | [HSReplay](https://hsreplay.net/cards/100929/),[Wiki](https://hearthstone.wiki.gg/Kologarn)\n8 | [Magtheridon, Unreleased](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TOY_647.png) | 1 | [HSReplay](https://hsreplay.net/cards/104521/),[Wiki](https://hearthstone.wiki.gg/Magtheridon%2C%20Unreleased)\n8 | [Mo'arg Forgefiend](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SW_068.png) | 2 | [HSReplay](https://hsreplay.net/cards/64716/),[Wiki](https://hearthstone.wiki.gg/Mo%27arg%20Forgefiend)\n9 | [Brutal Annihilan](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/RLK_212.png) | 2 | [HSReplay](https://hsreplay.net/cards/84242/),[Wiki](https://hearthstone.wiki.gg/Brutal%20Annihilan)\n9 | [Pit Commander](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_486.png) | 2 | [HSReplay](https://hsreplay.net/cards/58243/),[Wiki](https://hearthstone.wiki.gg/Pit%20Commander)\n9 | [Travelmaster Dungar](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/WORK_043.png) | 1 | [HSReplay](https://hsreplay.net/cards/110859/),[Wiki](https://hearthstone.wiki.gg/Travelmaster%20Dungar)\n10 | [Yogg-Saron, Unleashed](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/YOG_516.png) | 1 | [HSReplay](https://hsreplay.net/cards/101033/),[Wiki](https://hearthstone.wiki.gg/Yogg-Saron%2C%20Unleashed)\n\n\n**Total Dust:** 19040\n\n\n**Deck Code:** AAEBAdPwBgy/7QP39gOnjQSX7wTvogWogAalgQbBlAaplQbJsAa6wQaL4gYOg8cDhscD1tED+dUD/eoDzPkDgIUEtJIE8rEEvsoE6e0EkpIFnJoG38AGAAA=\n\n\n*****\n\n\n^I ^am ^a ^bot. ^Comment/PM ^with ^a ^deck ^code ^and ^I'll ^decode ^it. ^If ^you ^don't ^want ^me ^to ^reply ^to ^you, ^include ^\"###\" ^anywhere ^in ^your ^message. ^[About.](https://github.com/HearthSim/deck-code-bot/blob/master/README.md)", "label": 0}
{"text": "since always, Rogue probably runs the least expensive cards of any class", "label": 0}
{"text": "Jaina is French???", "label": 0}
{"text": "10 mana card spooky and bad", "label": 0}
{"text": "As much as the french fries.", "label": 0}
{"text": "Everything is triggering about this card.\nReno's look, eyebrows, mustache, smile, voice and effects. Unless I'm pretty sure I'm about to win, as soon as I hear''Well....\" I don't play Hearthstone for few days.", "label": 0}
{"text": "I have some time wanting to make a deck that plays so fast that you can play tony and steal the enemies deck, with this seems very viable.\n\nOther thing may be combo Rogue", "label": 0}
{"text": "I wouldn't like, alter your play pattern either way - don't push to finish before the 29th if you're not going to but don't feel like you have to wait either... I just didn't want you to get surprised if it changed.", "label": 0}
{"text": "Just don't take the Warrior deck or the Druid deck then. The other 4 are midrange or aggressive. \n\nI'd suggest the death knight deck on dust value if you can't decide otherwise, but an upgraded version of evolve shaman is the best positioned right now metagame wise, and paladin is probably the strongest without modifications.\n\nDemon Hunter will have the shortest games, but I think it's also the cheapest to make yourself...", "label": 0}
{"text": "Ah it's wild. No wonder. I was like, I don't know how your dudes are so thick, must be a high roll game. Makes sense if you have Lor'themar. Haven't touched wild in so long, seems like it would be too much of a clown fiesta. What do you think?", "label": 0}
{"text": "-Refuses to elaborate", "label": 0}
{"text": "Or Reno paladin, which can just Uther combo you, and then your armor doesn't matter.", "label": 0}
{"text": "I made a decklist for it:\nAAECAaIHCoqoBqfTBuDQBf3EBeDQBarqBseUBrjFBYzWBr2+BgrZoga2tQby5wbk6gb3nwT2nwS/9wXungbyyQbt6gYAAQPfwwX9xAWzqQb9xAXuqQb9xAUAAA==\n\nIm playing this day 1!!! 😁", "label": 0}
{"text": "between Warrior and Death Knight it's pretty close. Warrior is the more control deck of the two and it's likely that most of the cards will find a place in the control warrior deck of the next expansion too - but the key cards will rotate in the spring. \n\nDK is more of a synergistic list, but the key strategy (razzledazzle + buttons + corpsicle) is built out of 2024 cards, so the deck archetype will be in standard longer. It's not as clear if the archetype will remain popular after the next expansion though.\n\nDust wise Warrior is slightly more valuable (~14k dust to craft, vs. ~12.4k) but both are very generous by historical loaner deck standards.", "label": 0}
{"text": "You beat me to it hahahahaha 🤣😅", "label": 0}
{"text": "If you actually read my comment I said destroy as an adjustment.", "label": 0}
{"text": "My disappointment is immeasurable, and my day is ruined.", "label": 0}
{"text": "Yeah I know. I played it in a midrange Shaman deck. It was fine, not as good as Dr. Boom of course", "label": 0}
{"text": "Right on. And if you're like me, and have 20+ Tickets, that means 10+ runs. Which means getting at least GDB packs, and hence a Legendary from the \"first 10 packs\" pity timer ⏲️", "label": 0}
{"text": "Hell they didnt revert denathrius who isnt seeing active wild play", "label": 0}
{"text": "Ye i came from Rarran too :P", "label": 0}
{"text": "I play both modes, wild and standard, I usually play more standard but if I want to play big demons wild is the best place (more tools). Also it's my only wild deck so I couldnt tell you much more about wild in general but my experience has been positive.", "label": 0}
{"text": "Yes I did read that. And if you read my comment you would know that that’s not enough if it’s going back to 8 mana. \n\nIt needs to also destroy all minions. \n\nIt would still be one of the best cards in the game at 8 mana destroying all minions only allowing one enemy minion next turn.", "label": 0}
{"text": "In general loaner decks are worth buying whenever any one of the following is true:\n\n* You plan to open at least 20 more packs of that set and want to avoid a possible duplicate legendary. So you buy to keep.\n* You need one or more of the legendaries right now for a deck. So you buy to keep.\n* There are enough cards on refund to make the total disenchant value >2800dust *and* you don't want any of the cards. So you buy to disenchant.\n* You have gotten a first legendary from every golden pack type *and* you don't want any cards from this (presumably old) miniset. So you buy to disenchant.\n\nOn the day of release most players fall into the first two categories, so it's usually worth buying on the day of release.\n\nIn your case, The refund windows for the recently nerfed cards have closed I believe, so it would only make sense to buy a mini-set if there's a legendary you want to use right now *or* you're about to purchase a returning-player bundle that includes more than 20 packs of the associated set and you want to avoid a possible duplicate (~15% chance) legendary.\n\nto aid in this decision: \n\nPerils in Paradise Miniset - Traveling Travel Agency:\n* All 4 legendaries found some use (Dungar is the least used, Zephrys is the most, Turbulus and Skyla are deck archetype enablers.)\n\nWhizbang's Workshop miniset - Dr. Boom's Incredible Adventures:\n* Product 9 and Puppetmaster Dorian see some play, Toyrantus sometimes gets thrown into Highlander druid but is not a core card.\n\nShowdown in the Badlands miniset - Delve into Deepholme (rotating in spring 2025)\n* Deepminer Brann is the only notable legendary\n\nTITANs miniset - Fall of Ulduar (rotating in spring 2025)\n* Yogg-Saron Unleashed is the only notable legendary\n\nFestival of Legends miniset - Audiopocalypse (rotating in spring 2025)\n* Magatha and Fanttotem see some play.", "label": 0}
{"text": "Me please", "label": 0}
{"text": "Brode acted like hearthstone was a physical card game", "label": 0}
{"text": "And this is why I uninstalled the game two weeks ago and have not looked back. The new expansion makes me excited but with all the disgusting tools around its not going to be fun. Day 1 will just see the already cancerous decks be played while the new decks will struggle. Just makes me salty beyond belief.", "label": 0}
{"text": "Duplicate sets of the same card is weak as fuck. Why do I want the gold version straight after the regular one. Just give me one or the other and then a different reward.", "label": 0}
{"text": "Honestly just ban Reno. I will risk fighting Sargeras over and over for the next month if it means I don’t have to see him. \n\nOr just make starships unaffected by Reno. They are in the sky after all", "label": 0}
{"text": "Welcome to the club\n\nhttps://preview.redd.it/qwdoob07oywd1.png?width=720&format=pjpg&auto=webp&s=e26bdec3bb864054fd2e5784f0dbd6fcfcc1d99a", "label": 0}
{"text": "Reno pally dies to warrior 99/100 times unless they draw the nuts.", "label": 0}
{"text": "I still have no clues if I agree with his Direction for the game, but credits where credit is due, he kept directing the game in the same way that it initially got popular.", "label": 0}
{"text": "Exactly, I hope that this clown never gets a survey from the blizzard again and never finds out what they are planning", "label": 0}
{"text": "If \"Doing nothing\" is the only way to play around a card, the card is unfun and not well balanced.\n\nIf the only way to win is to never have played from the start what's the point. You can't do anything about Reno, you can't break highlander condition now, you just not supposed to have cards on the board and then they wipe your board and get 2 turns to build a massive board that you can never realistically recover against unless you also happen to have Reno", "label": 0}
{"text": "Ohhh that’s a great point", "label": 0}
{"text": "I’ve found in legend that OH priest is not viable anymore.  The control aspect of OH priest getting nerfed seriously hamstringed the deck", "label": 0}
{"text": "2 weeks ago I played a Zilliax with more than 1500 attack which even copied itself. My opponent only had a few cards left in his hand and his deck was gone, i was still scared he might somehow turn the tables on me. HS has become so explosive, I never feel safe. 😅", "label": 0}
{"text": "Personally, I separate balance and design. \n\nI liked old sets better, both in how they were built (how many pre-built decks were included, how many standalone cards were released, how many holes were left open, etc.), and how they were themed (to be fair, it's a lot easier early on when there are fewer sets).\n\nI also loved that all sets tended to come with something on the side that wasn't just an extra bunch of cards.\n\nBalance wise, not only are they faster to react now, I'd argue that the proportion of problematic cards is also much smaller.\n\nAnd, obviously, not all of that is on Brode. Scherier gave us a glimpse of how greedy the ActiBlizz execs were...", "label": 0}
{"text": "I \"hello\" the beginning of just about every game and also emote back if they do first. It's common courtesy! It's like a \"glhf\" and feel like it takes the edge off tilted players", "label": 0}
{"text": "Tickatus", "label": 0}
{"text": "The same leader that builds a company is not the same leader you want for long term growth necessarily. Some people are good at getting things off the ground, others are better at running them effectively after it’s rooted. Brode was the former imo.", "label": 0}
{"text": "Thank you, as i will be going control even if i play DK, i think i can make better use of the cards in the warrior deck by those informations", "label": 0}
{"text": "Yeah, but such a card would only exist in the mini-set at earlist, so I'm working with the currently available cards. Of those, imo, the easist way to get a win con seems to be to just buff lightspeed and the the removal cards. I guess you could also do something like make Hedanis do 10 damage, but that would be goofy. And some of changes give Priest more reach (like Void Shard or Purifying Power) and make it easier to close out games, so a softer win con for more midrange builds.\n\nPart of the idea of these changes is to also decrease antipathy against Priest. People complain a lot about thief Priest cards, and I don't think they fit into modern Hearthstone because they don't really advance towards any type of sensible win con. It feels like low hanging fruit to me. Although a lot of the changes in the image correspond to nonviable archetypes, so they don't represent things that should be buffed so much as if you wanted them to be playable these are some minor changes to make.", "label": 0}
{"text": "Always", "label": 0}
{"text": "We have 3 other active threads complaining about reno. Don't need a 4th one.", "label": 0}
{"text": "Can you get single time heropowers twice as nguyen or in other words does it remeber?", "label": 0}
{"text": "Both are good and bad. All I know if anyone who thinks left side is great, I strongly disagree. Half of those changes were garbage, and ultimately it’s shitty when they barely nerfed and did it way too late.", "label": 0}
{"text": "Hey, Leo, do us a favour, sort those dumb rewards out for the next reward track. A pair of cards for one reward that get replaced straight away by the gold versions? Are they taking the piss? They're also unrerollable, which is bullshit.", "label": 0}
{"text": "Good looks, just broke D5. Halfway there!", "label": 0}
{"text": "Yeah, Hauler was how it won against board-based decks.\n\nBut a lot of the overheal cards seem to support a weird midrange deck. But all of those cards are understat-ed, so if control OH isn't there, maybe make the midrange-ish cards actually good. Though, I'm not sure such a deck would actually be popular or if it's going to be another good but unpopular Priest aggro deck.", "label": 0}
{"text": "I appreciate how passionate you are about this, and the details. But I don't like a lot of the suggestions. Maybe they are just not for me personally. I think Priest needs three things overall.\n\n1) Blizzard to give them good cards that work instead of a bucket of random crap each set/mini set. Dragon Priest only got two dragons, and zero in any set after. Undead got support before it rotated and then again for Demon Hunter cross-cards. Overheal didn't get any since the overhaul, and it is now getting some in Dark Beyond. Highlander has not gotten any direct support since Badlands. Automation has not gotten any support since it came out. They need to have a concise direction for Priest. Stop trying to force aggro. \n\n2) A hero power rework. The absolute most dog-shit hero power out there. It needs to be heal 4, as there's 1 mana discover paired with heal 3-5. Or apply the \"if undamaged. gains +1 HP\" Therefore, Priest would have an actual turn-two play. While Warrior can get +2HP Priest can only pass if they have no cards to play. \n\n3) Stop being afraid of giving Priest control cards. This is what people tend to love about Priest. I've seen so many comments during every reveal season of people switching to another class that just does control better.", "label": 0}
{"text": "I just wanna win once", "label": 0}
{"text": "This is just pure gold 👌", "label": 0}
{"text": "- **[Adaptive Amalgam](https://i.imgur.com/meSJSuY.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/108950) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Adaptive_Amalgam)\n    - *Neutral Epic ^(Perils in Paradise)*\n    - **1 Mana · 1/2 · All**\n    - *This has all minion types.* **Deathrattle:** Shuffle this into your deck. It keeps any enchantments.\n\n- **[Lab Constructor](https://imgur.com/a/jQ4cvTl)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/97915) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Lab_Constructor)\n    - *Rogue Epic ^(TITANS)*\n    - **5 Mana · 3/2 · Mech**\n    - At the end of your turn, summon a copy of this. **Forge:** Gain **Magnetic**.\n\n- **[Mecha-Leaper](https://i.imgur.com/29Tbd0V.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/98182) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Mecha-Leaper)\n    - *Neutral Epic ^(TITANS)*\n    - **3 Mana · 2/2 · Mech & Beast**\n    - **Magnetic** **Deathrattle:** Give a friendly Mech +2/+2 and this **Deathrattle**.\n\n- **[Shoplifter Goldbeard](https://i.imgur.com/gRgbM9P.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/103343) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Shoplifter_Goldbeard)\n    - *Rogue Legendary ^(Whizbang's Workshop)*\n    - **5 Mana · 5/5 · Pirate**\n    - After you summon a Pirate, summon a copy of it that attacks a random enemy, then dies.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gbwycy/i_thought_leapfrogger_was_not_in_the_pool_anymore/ltqu4lk/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltqu4lk)*", "label": 0}
{"text": "I dont think they would be that much of outliers tbh. \n\nSets like Scholomance and Ashes of outland had a ton of changes as well (well, for outland, it was mostly Demon Hunter)", "label": 0}
{"text": "Yeah but its also requiring the paladin to effectively skip turn 6, unless they already had some high impact taunt minion that wasn't killed from its turn 5", "label": 0}
{"text": "I'm actually curious about what you don't like specifically? I guess you would go further than I did?\n\nRegarding 1, nothing much to be done for Dragon Priest since I'm not suggesting any new cards here. For undead support, I think the Caterina change would at least make it card playable with what undead cards currently exist (oh wait, somehow I thought Obsidian statue was an undead card, so I thought it would syngerize with Caterina like it used to, actually no). Lightspeed + Raza buffs makes the Reno OTK easier. I did list buffs to overheal and healing cards. The changes to the thief cards are primarily to make those cards usable in Automatan Priest. So, I think those changes would make Priest more synergistic at least.\n\nRegarding 2, I did suggest a hero power buff, but yours goes even further.\n\nRegarding 3, I did list buffs to to basically every unplayed removal option. Yeah, Blood Death Knight is what Priest kinda should be in a way (although maybe not as burn / token oriented).", "label": 0}
{"text": "Hmmmmm ))", "label": 0}
{"text": "Nice giveaway!", "label": 0}
{"text": "Then Bob offers no dragons and 5/8 other plays also are on dragons lol", "label": 0}
{"text": "We once had a really fun card with a mechanic that allowed us to deal damage while playing as Priest.\n\nMy favourite card of all time, \\[\\[Auchenai Soulpriest\\]\\]\n\nThe effect of this card has been printed a couple of times with not really big impact on the meta but it actually has the potential to be the real win condition the class needs, if a card with that effect could be printed in the same way odin did \"For the rest of the game\", it would be glorious", "label": 0}
{"text": "Dear Blizzard,\n\nThank you for considering me to be a potential winner of your ‘The Great Dark Beyond’ Bundle giveaway. I believe that I am the best candidate for the code due to my extreme skill (bronze 3) as well as my good looks (Kindly Grandmother said I look scrumptious).\n\nThank you once again for your time and consideration. I will be eagerly awaiting the giveaway code.\n\nLove,\n\nYour favorite HearthStoner\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy", "label": 0}
{"text": "Kino", "label": 0}
{"text": "Pick me up", "label": 0}
{"text": "As a dedicated meme-homebrew player I will join your mission.", "label": 0}
{"text": "Note to any weirdboys that have been away from Hearthstone or something and are gonna hijack this thread to assert their own pre-conceived conclusions: NEITHER of these setups are good. The early years of Hearthstone were utterly crippled by their reluctance to balance. Yes, power level of the current game goes way overboard sometimes, but there is a healthy middle ground", "label": 0}
{"text": "Naxx was most difficult for me. KT on heroic ... jesus christ still have PTSD but still am using the cardback too", "label": 0}
{"text": "Actually, I think we technically aren't that far off.\n\nShadowtouched Kvaldir has an auchenai effect. And if Holy Spring water worked on undamaged characters, you could easily get a 1 cost heal 8 bottle. If you Pip it twice, that's a 32 damage OTK, which is why I have heal 10 on any character as a Holy Springwater change in the image.\n\nBut yeah, for modern Hearthstone, an Odyn for Priest would be better.", "label": 0}
{"text": "Okay nerd 🤓☝️", "label": 0}
{"text": "> DK and Rogue seem to have potential.\n\nAs a casual Deathrattle/Handbuff DK enjoyer, I'm happy to see this. Hoping I can cobble together a handbuff starship sorta thing", "label": 0}
{"text": "Your suggestions on balance. The pictures with changes. All suggest buffs to cards on a lower power or nerfs to cards on a higher power to bring everything up to about where cards are for other classes. While this is great and should be a standard by now. This doesn't help fix the issue of identity. You actually are taking away identity from Priest in its thief mechanic which you also list as unique to Priest while Rogue can do this and has for about the same time or longer. \n\nI don't think a huge overhaul on current cards is what Priest needs. I believe that they need a Hero Power rework and a direct design. Buffing pieces for all sets/random sets just puts us back to a mashup of random components from all over to build a deck with decently stated minions. Which would mean something like Highlander since all other playstyles would be too weak on their own. \n\nCompare the highlander package for Warrior, the taunt package for Druid, big spells for Mage package, Excavate for Deathknight. They all have a clear gameplan with cards to all help push their design goal. The only thing buffing a card here or there from all current cards does is help in making the cards \"feel better\" to play, but still does not give any direction to Priest as a class or identity. \n\nBig Priest might be the last real deck type they tried heavily to push. That or Zarmini, but then they didn't give it any new dragons going forward. For reasons? \n\nPriest needs the same treatment as other classes. Being able to build upon components that they already have and add to a deck that is good but not great. Mage got this. Druid. Warrior. Death Knight. Near every class has an identity or a way that a deck should be built or could be built around. Priest is just \"hope you play these things and survive\". There's no win-con, end game. Which you do address, but none of the changes are directing towards an overall theme besides boring the opponent to death. \n\nPersonally, I think they should play into the thief mechanic further, bring the Hero Power up to today standards (Which should have happened during the overheal change to Priest where they addressed the class), and design sets that have a clear condition or theme behind them. Automation tried, but they didn't give it support. Undead tried, but they gave it support too late. Dragon did, but then didn't give it support. The theme is them trying something and it partially working or not working at all without going back to it and give further support to the archetype. \n\n   \nTLDR: Give Priest an identity and follow-up with it. Continue to give it things that could go into said deck and strengthen it overtime like other classes (EG Big Spell Mage, Spell Druid, Highlander Warrior). Rework the Hero Power. Touch on what the identity of Priest should be and focus on that. I thought it would be Overheal when they publicly addressed it, but then didn't give the deck many tools / killed it with a balance change.", "label": 0}
{"text": "he's just doing his best :(", "label": 0}
{"text": "ME TOO LOL", "label": 0}
{"text": "In general, buy one of each pack that gives an uncraftable legendary so you have them available, then starting from the latest expansions and moving back:\n\n\nMini-sets first\nNormal packs until the guaranteed legendary (takes at most 10) after that\nGolden packs until the guaranteed legendary (also takes at most 10) once you have enough cards from the latest expansions to be satisfied with those\nGolden packs from the lich king set until the guaranteed signature (takes at most 14, unlike golden packs from any other set)", "label": 0}
{"text": "Damn bro, share some gold with me", "label": 0}
{"text": "Praise Yogg!", "label": 0}
{"text": "\\*shrugs\\*  If it happens, it happens.  I'll still make that play every single time.  Not necessarily forcing dragons, but I'm going to choose the value play every time.  Worst case, it gives me more board presence early game to help me survive, and I can transition into something better in the mid game if I'm not seeing that dragon support I need.", "label": 0}
{"text": "Dear Blizzard,\n\nThank you for considering me to be a potential winner of your ‘The Great Dark Beyond’ Bundle giveaway. I believe that I am the best candidate for the code due to my extreme skill (bronze 3) as well as my good looks (Kindly Grandmother said I look scrumptious).\n\nThank you once again for your time and consideration. I will be eagerly awaiting the giveaway code.\n\nLove,\n\nYour favorite HearthStoner", "label": 0}
{"text": "Well done! I'm the same where I often don't find meta decks fun, so I homebrew something I find fun and then see if I can hit Legend (which def means I don't get Legend every month lol)  \n  \nThis deck looks fun! I might try it out myself!", "label": 0}
{"text": "![gif](giphy|GeimqsH0TLDt4tScGw|downsized)", "label": 0}
{"text": "I doubt that I'll get picked but I'm going to post anyway.", "label": 0}
{"text": "Cool Rap and also one of the coolest sets.", "label": 0}
{"text": "As a non botanist, I also welcome our mushroom matriarch", "label": 0}
{"text": "I don’t think you’ll have to work that hard friend, and thats coming from a fellow jank enthusiast", "label": 0}
{"text": "Its actually been looking pretty good in the theorycrafting streams that I have seen, although that is probably because Warriors early game with its new weapon is super oppressive", "label": 0}
{"text": "Definitely!", "label": 0}
{"text": "You saved the expansion, thanks!", "label": 0}
{"text": "I for some reason thought the spores were Cast When Drawn and was confused as to how this card was printed when it was clearly so op. The actual implementation still seems pretty good though", "label": 0}
{"text": "Is that the only one that you can't get twice or all?", "label": 0}
{"text": "Love the effort man.\n\nI wish Team 5 would give this much attention to the classes themselves and rework things at this level of depth. I *heavily* dislike the constant ping-ponging between “different archetypes” that seems to be the current focus of design. I would prefer that classes had an overall style that they stuck to. I don’t want aggressive priest cards, no one else seems to either. Similarly, I don’t want expensive cards in rogue. Etc and so on.\n\nThe changes you propose are (largely) focused on improving utility and I like this a lot. So many cards in priest are too niche *and* overly expensive. It always baffles me, for instance, that void shard is 4 mana 4 damage. That’s just… did they even want this card to ever get used? Like seriously? It doesn’t even remove a lot of 4 drops.\n\nLike you, I want priest to be priest. I don’t want to flood the board and rely on neutrals + Aman-Thul. I want to control-burn, or control-value. Judging by the amount of times I face priest, I don’t think anyone else likes these aggressive decks either. I look at this new expansion and sigh, because it’s yet another uninteresting set of cards that don’t give me what I want. This isn’t limited to priest, but I play priest 90% of the time. There’s a reason I haven’t played for 2 months and there’s a reason I haven’t got any great desire to play the new expansion. It’s not an expansion, it’s another set of cards that I don’t want to go with the other sets that I don’t want.", "label": 0}
{"text": "Good to know I'm not they only Botany related Hearthstone player!", "label": 0}
{"text": "I've been pronouncing it like it was spelled. I blame blizzard", "label": 0}
{"text": "1 bramble and it's joever", "label": 0}
{"text": "I hope he works but I unfortunately think it’s too slow once the meta adjusts.\n\nTheorycrafting always involves jank", "label": 0}
{"text": "Me too dude 🤣", "label": 0}
{"text": "That's way too late.", "label": 0}
{"text": "6 mana 9/9 lifesteal with upside JFC", "label": 0}
{"text": "Because Contructed and Battlegrounds are practically 2 different games, they only share a few minions. \n\nAlso, a turn 1 highroll in bg is a 9/9 that grows each turn, and that would also be good in Constructed.", "label": 0}
{"text": "I see, I was taking a myopic view.\n\nZarimi is kinda a good example of the design itself being wrong. Dragon Priest is already an okay if unpopular deck, giving it more support may push it over the edge. But taking a step back, they should've never printed cheap dragons with Zarimi because by doing so, they're in a design deadend. Instead by only having midrange and expensive dragons, there would be design space to actually support the archetype as a control / midrange deck with a finisher instead of only as an aggro deck.\n\nYearh, I suppose the bigger problem is that the other classes have some fairly obvious natural synergy like Druid has expensive cards which pair well with ramping which pairs well with card draw so a lot of stuff just natrually works together. Or Warrior has armor gain, which pairs well with suriving to expensive late game win cons, which then turn the survival tools in reach e.g. Doctor Boom or Sleep under the Stars. In contrast, Priest has removal but no late game to pair with it. Priest as aggro but minimal reach. Priest has big stats but no reload. So, the archetypes are highly reliant on draw RNG.\n\nTo be honest, Thief archetypes are my favorite archetype in card games. It's just that they tend to cause seething, so it's a mixed bag design-wise.", "label": 0}
{"text": "I remember when my mom used to overhear us raiding she thought we were saying \"Drain Eye\" and said \"That game sounds morbid!\"", "label": 0}
{"text": "Surely I’ll win", "label": 0}
{"text": "Reno destroys their expansion plan and there’s only a few cards that will make good decks better, man.", "label": 0}
{"text": "i have no mouth but i must scream", "label": 0}
{"text": "Good stats for the cost.", "label": 0}
{"text": "If warrior gets some high quality draw this could be a good card", "label": 0}
{"text": "Weird that the plagues do end the draw phase to kill your opponent but the eruptions didn't do the same to kill you", "label": 0}
{"text": "Mycologists would like this card…", "label": 0}
{"text": "This is clearly mycology though", "label": 0}
{"text": "Yeh people were hard forcing Starship decks even though they suck lmao", "label": 0}
{"text": "Haven’t even watched the TC streams but yeah I really don’t know why starships were even printed 🙃", "label": 0}
{"text": "Rocketship!", "label": 0}
{"text": "rarran said drop it and he did.", "label": 0}
{"text": "Such top tier art", "label": 0}
{"text": "That’s all great stuff, thanks!", "label": 0}
{"text": "Well you seem like a fun-guy", "label": 0}
{"text": "Great idea, thanks!", "label": 0}
{"text": "Thank you so much for doing this!", "label": 0}
{"text": "I think that might have been more the fact Warrior farms starship decks incredibly easily because they're so incredibly bad.", "label": 0}
{"text": "good luck, everyone", "label": 0}
{"text": "I don't think Priest needs a buff... Overheal priest is already pretty strong, if you buff all overaheal cards it will destroy the meta completely...", "label": 0}
{"text": "Nettdeck the best control warrior list then add this card - done.", "label": 0}
{"text": "And has the most mana cheat?", "label": 0}
{"text": "They used to be a lot better when Ben Brode was the CEO.", "label": 0}
{"text": "Quazar - Funky Stars", "label": 0}
{"text": "Reno should probably be hall of famed or ar least modified to not affect starships. A card that fully nullifies a core set mechanic is probably not a great idea", "label": 0}
{"text": "Maybe playable if it was discover", "label": 0}
{"text": "Not a mycologist? Literally unplayable", "label": 0}
{"text": "Oh if you get the new hero power each turn you ABSOLUTELY Use it.  Because there's always a chance you could get it again...", "label": 0}
{"text": "Deck?", "label": 0}
{"text": "lol we're releasing kil'jaedin and archemonde and all this demon stuff but we only get zail in a jacket", "label": 0}
{"text": "Technically this is the field of mycology, not botany, although I too welcome the mushroom matriarch.", "label": 0}
{"text": "I love playing boulderfist oger", "label": 0}
{"text": "Why the downvote", "label": 0}
{"text": "\"we have ben brode at home\"\n\n\nben brode at home:", "label": 0}
{"text": "Unfortunately if you want a longterm value engine kil'jaden exists and is better. There's really no reason to play this card honestly. If it was cast when drawn spores but it's not.", "label": 0}
{"text": "Thought that too, the way this game works makes so little sense sometimes. Assuming it’s a coding thing and not intentional as bit unfair otherwise.", "label": 0}
{"text": "Good luck all", "label": 0}
{"text": "BLESS ME GABEN", "label": 0}
{"text": "Oh my god what this is so good why are we so lucky to have Leo on Team 5???", "label": 0}
{"text": "no way we're doing this right now", "label": 0}
{"text": "But wasnt he released at the same time as rhea specifically to counter? Thought those highlander cards came together", "label": 0}
{"text": "Skibidi", "label": 0}
{"text": "> You can... you just look pretty stupid.\n\nAre you saying I look stupid? Or judging something you don't know anything about is stupid? I need to know in case you make yourself look stupid.\n\nNah, im good. I'm not gonna overthink my comments so that you guys don't take offense to everything. I never said anything about them being wrong. Again, you just assumed that.", "label": 0}
{"text": "Yeah i was just wondering, i agree with him being HOF'd all the way to narnia", "label": 0}
{"text": "This is the last one. When the new expansion launches it’ll go back to single class again.", "label": 0}
{"text": "packs", "label": 0}
{"text": "There should be a priest minion epic card that is Battlecry: Send a letter in real life to the president of Sweden and challenge him to a rap battle.\n\n  \nAnd its a 4 mana, 2/6", "label": 0}
{"text": "You can buy \n\npacks,  \nmini sets (normal 2000 Gold, Golden 10,000 Gold),  \nsome hero portraits (shop ones rotate, and there should be some in the collection manager as well),  \nsome card backs (only in the collection manager),  \nsome chapters of solo adventures and  \nfrom next Wednesday for a week you can buy entry to the Pre Release Tavern Brawl. \n\nThere’s a lot to use Gold on.", "label": 0}
{"text": "Chargen't", "label": 0}
{"text": "Dear Blizzard,\n\nThank you for considering me to be a potential winner of your ‘The Great Dark Beyond’ Bundle giveaway. I believe that I am the best candidate for the code due to my extreme skill (bronze 3) as well as my good looks (Kindly Grandmother said I look scrumptious).\n\nThank you once again for your time and consideration. I will be eagerly awaiting the giveaway code.\n\nLove,\n\nYour favorite HearthStoner\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, crazy\n\nEdit: wow so many people copied my post, craz", "label": 0}
{"text": "Actually looks sick", "label": 0}
{"text": "OP subtly telling the subreddit his boyfriend left her.", "label": 0}
{"text": "What was the lead design point of Talgath?", "label": 0}
{"text": "Thanks for the giveaway.", "label": 0}
{"text": "given infinite draws the chances are 100%", "label": 0}
{"text": "?", "label": 0}
{"text": ">Are you saying I look stupid? Or judging something you don't know anything about is stupid? I need to know in case you make yourself look stupid.\n\nFor 1 yeah this whole thing makes you look pretty stupid. For 2 judging something you don't know anything about is pretty stupid\n\n>, im good. I'm not gonna overthink my comments so that you guys don't take offense to everything\n\nMate... look at the down votes, if you want to act like you had no intent to say what you said sure (idk if you did) but hold your hands up and be honest 'do you **actually** know how myra's works' makes it sounds like your calling the guy stupid. Don't have to overthink, just think :)\n\n> never said anything about them being wrong.\n\nTone says a lot. Questioning whether they know what a card does very much so suggests you think they're wrong, if you agreed you wouldn't have responded", "label": 0}
{"text": "\"I- I think this could get messy.\"", "label": 0}
{"text": "So you're first point justifies what I said... thanks?\n\nTbh I don't really care about that people like to read things in negative tone. I'm not doubling back on what I type and reading it empathetically. Too much time.", "label": 0}
{"text": "Replicate", "label": 0}
{"text": "Oh hey everyone, we know you all (including blizzard) think that Reno is problematic card design, but /u/silvanik3 let us know that they actually *like* the problematic aspects of it, so sorry. \n\nThe strongest board clear the game has ever seen and likely ever will see being a Neutral card doesn't strike them as as issue lol. Btw it's also a heal/generator + functional [Time Warp](https://media-hearth.cursecdn.com/avatars/319/879/55662.png).\n\n>I really don't like the sargeras portal being basically non interactive\n\nReno can't be Dirty Ratted. It can't be Counterspelled. Snake Oils do nothing. Build a board maybe? Taunts? Deathrattles? Divine Shields? Silenced and banished. Try to save a card combo to rebuild after the wipe? Can't do that either loooooooooool \n\nThe best counter to a Reno is your own Reno. But you supposedly \"don't like basically non-interactive\" cards lmao. Have some self-awareness.", "label": 0}
{"text": "How is Kil'jaeden better? He's more expensive and scales more slowly and blows up your deck.\n\nCasts when drawn spores would be ridiculous lol. Just get 4 5 drops on turn 2 sometimes.", "label": 0}
{"text": "“If I turned into a worm tomorrow, would you still love me?” or something like that, too bad for OP tho", "label": 0}
{"text": "As a musician, it was my lifegoal to make a viable deck with Lightshow. The best I could do was a \"Platinum tier\" deck. It never boring", "label": 0}
{"text": ">I never judged anything without knowhow. That's why I asked questions first dummy. Just like I've been saying for the best 5 comments.\n\nSorry at what point did I say the second thing was what im saying you asked which was what my message meant I responded with the fact both are correct. Secondly, the whole point is how you questioned not that you questioned making whatever this point is irrelevant.\n\n\n> I can wind you up and keep you here all day\n\nYou can't wind me up. Let alone keep me here all day I think this shit is funny as hell to think you think your getting to me.\n\n>People are fragile little snowflakes who take offense to anything and everything.\n\nNo people will take offence to what is offensive. Regardless of whether you think its a big deal or not if there is offence it'll be taken and either disregarded or listened to", "label": 0}
{"text": "Lmao, whatever. I would love to analyze averages ", "label": 0}
{"text": "I welcome this meme wholeheartedly.", "label": 0}
{"text": "OH MY GOD I JUST REALIZED.\nAnd here I was thinking why everyone was saying it's not playable. Like draw all the casts when drawns turn 1 and win all the way but unfortunately no.", "label": 0}
{"text": "Life in Canada has become too expensive for buying bundles in Hearthstone, need the giveaways.", "label": 0}
{"text": "Reno eff to limit to 1 is not why I like Reno. For all I care it could go away. I only want to have a way to interact with a fucking value generator", "label": 0}
{"text": "Draenei player since Burning Crusade, ain't no way I'm mispronouncing the name of my people I'd have to go home in shame.", "label": 0}
{"text": "Replicate what though?\nHim? Your last card?", "label": 0}
{"text": "Good stats for the cost 😎", "label": 0}
{"text": "> Sorry at what point did I say the second thing was what im saying you asked which was what my message meant I responded with the fact both are correct. Secondly, the whole point is how you questioned not that you questioned making whatever this point is irrelevant.\n\nStroke?\n\n...Right. Did you just hit me with the \"I know you are but what am I?\"", "label": 0}
{"text": ">Did you just hit me with the \"I know you are but what am I?\"\n\nNo. I hit you with the truth, you aint breaking through me and are wasting your time and it truly is hilarious to watch.\n\n>Stroke?\n\nLack of a few punctuation marks and a lack of actually trying to read it from you", "label": 0}
{"text": "I could tell, no worries.", "label": 0}
{"text": "\"Dormant for 5 turns. At the end of your turn, destroy the minion to the right of this to awaken 1 turn sooner.\"\n\n  \nJust to save people the google.", "label": 0}
{"text": "Yes although you paid for them in smaller chunks.", "label": 0}
{"text": "You mean as a gorm", "label": 0}
{"text": "You look more like a bear to me, the bamboozling sort.", "label": 0}
{"text": "If you play wild the \"League of Explorers\" is the only one that's worth it in terms of gold to cards (it's comparable value to a mini-set even today)\n\nIn terms of enjoyment I think Tombs of Terror and Dalaran Heist have the most replayability, the others you'll only play through maybe twice total.", "label": 0}
{"text": "5-mana summon a random 5-mana minion, upgrades the rest but whichever random minion you get stays the same. It's a boulderfist ogre that gives you some bad cards.", "label": 0}
{"text": "This is crazy to me because at 1k legend I’ve seen almost 0 warriors, 0 hand buff paladin, 0 elemental mage, 0 hand buff dk. I had to check the date because I couldn’t believe the post. I see only Reno decks, shafar rogue and egg hunter. Big spell mage, highlander dk, highlander shaman, nostalgia shaman , earthern paladin, zarimi priest.", "label": 0}
{"text": "There are also sometimes signature cards in the shop for gold", "label": 0}
{"text": "In my opinion, Luna", "label": 0}
{"text": "I was assuming the same. Both the others seem terrible.", "label": 0}
{"text": "What is the biggest minion you can possibly make on turn 1, and how do you do it?\nBonus question: turn 2.", "label": 0}
{"text": "My coworker (brand new to the game) chose the druid deck and it has carried him", "label": 0}
{"text": "\"And invincible seems kinda weak\" - Omni-Man", "label": 0}
{"text": "If you want to rank up fast pick either \nChaman or paladin\nIf you want the most dust value Warrior is the way to go\nIf you want to play for fun just try all loaner and pick the one you enjoy the most \nLastly i would not recommend DH because it doesn't give many dust and the deck is easily craftable that's even more the case If you take the chaman loaner deck because the chaman has some core cards for the DH deck", "label": 0}
{"text": "I’m guessing you’re a Battleground only player?", "label": 0}
{"text": "Came back to the game, would be a legendary entry 🫡", "label": 0}
{"text": "There's a new 6 mana spell that shuffles your hand into your deck then reduces the cost of everything in your deck by 3. The main point of the deck is to set up rogues drawing weapon or location then cycle through your whole deck after playing quasar", "label": 0}
{"text": "You know, all the fun sucked out of it. A dour experience back before anyone had heard of Pandaren, Goblins, etc.", "label": 0}
{"text": "He did go medieval a few times.", "label": 0}
{"text": "I feel like starships are gonna be the thing that's gonna rework a ton of past cards or send everything out of standard kinda like what happened with castle nathria cards when death knight showed up cuz it would make infuse cards way to OP", "label": 0}
{"text": "🤞 Am I lucky? 🤞", "label": 0}
{"text": "Luna no question.", "label": 0}
{"text": "God they're just so fucking lazy when it comes to this shit.  \n\nTwo tiers dedicated to getting the same card twice, a card back that took five seconds to design and a hero portrait for Warcrafts most famous character to properly celebrate the anniversary... Hogger?", "label": 0}
{"text": "What do you mean by $25? Hearthstone doesn't have physical cards. As for which card, honestly it's hard to know, especially because highlander runs 30 (or even 40) different cards. If I had to pick one blindly, I would choose Ice Block.", "label": 0}
{"text": "Same", "label": 0}
{"text": "And I wheel in your face, now what?", "label": 0}
{"text": "Sad that most of their good draw is rotating the set after this card.", "label": 0}
{"text": "I feel there are more decks running Rhaestrsa than Sargeras even though it a Highlander.", "label": 0}
{"text": "and that fungi are more closely related to animals than they are to plants", "label": 0}
{"text": "Worm the Gorleater", "label": 0}
{"text": "Won’t lie best start to reach high rank fast. Let new expansion release and play aggro deck from previous expansion.", "label": 0}
{"text": "As an industrialist, I will do whatever I can to counter this potential archetype", "label": 0}
{"text": "Renonis 10% of the problem\n\nThe game being to fast for them is 90%\n\nBut of course reno needs the change not the hyper efficient infinite fuel aggro decks no", "label": 0}
{"text": "My cheese used to be white, but now it's brown. First it went yellow then it went green then it went brown. That is what happened to my cheese.", "label": 0}
{"text": "As for which card?\n\n\n[[Ragnaros]] and [[Leeroy Jenkins]] are two of Hearthstone's most iconic card, and they're from the game's release.\n\n\n[[Loatheb]] is a powerhouse in Wild, and [[Reno Jackson]] is a fan favorite and an iconic card in Highlander decks.\n\n\n[[Chilling Yeti]] and [[Boulderfist Ogre]] are good picks just for being memes, and the original [[The Coin]] is a card you start with in your hand if you go second. Very iconic for that reason.", "label": 0}
{"text": "It really shouldn't have the extra e after the a if it's supposed to just be pronounced Dran.", "label": 0}
{"text": "Did I click in the terraria subreddit somehow?", "label": 0}
{"text": "Only right answer is [[Gruul]]", "label": 0}
{"text": "- **[Gruul](https://i.imgur.com/BBNAvx5.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/526) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Gruul)\n    - *Neutral Legendary ^(Legacy)*\n    - **8 Mana · 7/7 · Minion**\n    - At the end of each turn, gain +1/+1 .\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gc7wol/a_noobs_plea_for_help_finding_the_right_card/ltrt0ox/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltrt0ox)*", "label": 0}
{"text": "- **[Ragnaros, Lightlord](https://i.imgur.com/QxJDwqW.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/38758) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Ragnaros%2C_Lightlord)\n    - *Paladin Legendary ^(Whispers of the Old Gods)*\n    - **8 Mana · 8/8 · Elemental**\n    - At the end of your turn, restore 8 Health to a damaged friendly character.\n    - *Wrong card? what about:* [Ragnaros the Firelord](https://imgur.com/a/gJKIuuL) • [Embers of Ragnaros](https://imgur.com/a/J2vHoG4) • [Ragnaros?](https://i.imgur.com/AN9yZS4.mp4)\n\n- **[Leeroy Jenkins](https://imgur.com/a/cWxJI7X)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/111462) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Leeroy_Jenkins_%28Core%29)\n    - *Neutral Legendary ^(Core)*\n    - **5 Mana · 6/2 · Minion**\n    - **Charge**. **Battlecry:** Summon two 1/1 Whelps for your opponent.\n\n- **[Loatheb](https://i.imgur.com/1lmvhNj.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/1914) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Loatheb)\n    - *Neutral Legendary ^(Curse of Naxxramas)*\n    - **5 Mana · 5/5 · Undead**\n    - **Battlecry:** Enemy spells cost \\(5\\) more next turn.\n\n- **[Reno Jackson](https://i.imgur.com/W69XhCG.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/2883) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Reno_Jackson)\n    - *Neutral Legendary ^(League of Explorers)*\n    - **6 Mana · 4/6 · Minion**\n    - **Battlecry:** If your deck has no duplicates, fully heal your hero.\n\n- **[Chillwind Yeti](https://i.imgur.com/ClJ9yhg.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/90) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Chillwind_Yeti)\n    - *Neutral Free ^(Legacy)*\n    - **4 Mana · 4/5 · Minion**\n    - *Wrong card? what about:* [Mechanical Yeti](https://imgur.com/a/zF2pWlx) • [Coldtooth Yeti](https://i.imgur.com/p9z1M0R.mp4) • [Chillin' Vol'jin](https://i.imgur.com/Tvpg7HV.mp4) • [Hiking Trail](https://i.imgur.com/62jnU3z.png) • [Shining Sentinel](https://i.imgur.com/8hkSM8Y.mp4)\n\n- **[Boulderfist Ogre](https://i.imgur.com/5Aw6vw2.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/112924) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Boulderfist_Ogre_%28Core%29)\n    - *Neutral Common ^(Core)*\n    - **6 Mana · 6/7 · Minion**\n\n- **[The Coin](https://imgur.com/a/47mwZqJ)** ^[wiki.gg](https://hearthstone.wiki.gg/wiki/The_Coin)\n    - *Neutral ^(Core)*\n    - **0 Mana · Spell**\n    - Gain 1 Mana Crystal this turn only.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gc7wol/a_noobs_plea_for_help_finding_the_right_card/ltrt1h1/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltrt1h1)*", "label": 0}
{"text": "Yep, the synergy it has with Expedition Sergeant and Stalwart Avenger is stupid good and you just sorta die on like turn 5", "label": 0}
{"text": "Not really cheaper but yes harder to get higher levels. I'm at diamond 5 now in wild and started from bronze 10. I did this in 11 hours of playing.  I'm gold 5 on standard and it's taken a few weeks. Lol. I am stuck though as I don't have even 1/3 of the new expansions cards.  Having more fun in wild 😜", "label": 0}
{"text": "Wow crazy that the person who did signature sif did signature Scylla and all those hero skins, what an impressive body of work overall. Artists be cookin", "label": 0}
{"text": "Not \"As Lisan al Gain\"?", "label": 0}
{"text": "Yes it will", "label": 0}
{"text": "Control decks can also play around reno without much problem.", "label": 0}
{"text": "Went with Luna. 3-0 so far with Luna helping me come back from the depths in the last one. Was definitely the correct choice.", "label": 0}
{"text": "Hopefully your idea for this card will BLOOM into a functioning deck.", "label": 0}
{"text": "Click the key thingy", "label": 0}
{"text": "i dont like the idea of removing the ability to copy  cards   \n\nthats been part of   priest \n\n  \nfor 10 years   removing that is so anti fun  and ......nerfking amathul like that ?????", "label": 0}
{"text": "You don’t understand Hearthstone? Let me break it down for you, because what most people think is just a ‘card game’ is so much more than that. Hearthstone is an intricate dance, a blend of strategy, luck, and skill that rivals even the most intense games out there. Every match is a story of wits and mind games, each card a unique character in the story, and every deck a representation of the player’s understanding of the meta, of their own playstyle, and even of psychology. You think RNG is everything? Sure, it plays a role, but a true Hearthstone player knows how to control the odds—or at least knows how to adapt when the odds turn against them. Because if you think you can just hop in, build a deck, and expect to win, you’ve got another thing coming.\n\nThere’s a reason people spend countless hours refining their decks, experimenting with combos, and memorizing every single card in the game. Every spell, every creature, every hero power—these are tools that a master can use to forge victory from seemingly impossible situations. You want to talk about RNG? Fine, let’s talk about RNG. Yes, you might get lucky or unlucky with your draws, but the real pros don’t blame RNG; they embrace it. They know that Hearthstone is about mitigating randomness, understanding the odds, and playing the percentages. A great player sees beyond the next draw. They think multiple turns ahead, considering every possible move, and planning for every possible response. And you know what? Even when things go horribly wrong, they adapt, they recover, they find a way to turn the tide back in their favor.\n\nWhen you see that top player with an unbroken win streak, it’s not just luck. It’s a combination of deep knowledge of the meta, an intimate understanding of card synergies, and a sixth sense for reading their opponent. These are players who can look at your opening hand and know within moments what deck you’re playing and how to counter it. They’ve got it down to a science. But the real beauty of Hearthstone isn’t just in the calculations; it’s in the psychology. This isn’t just math—this is poker, this is chess, this is warfare. A skilled player can bluff, bait, and psychologically break their opponent long before they ever hit zero health. That’s the real game beneath the game: it’s a duel of wits, where one player subtly controls the other, leading them into traps, making them second-guess their moves, and forcing them into making mistakes.\n\nAnd let’s talk about the art of building a deck, because you can’t just throw powerful cards together and hope it works. Every card in a deck has to serve a purpose. You need to understand your win conditions, your card draw, your tempo, your board control. Are you running aggro, control, combo, or midrange? Each of these archetypes is an entirely different beast, with its own strengths, weaknesses, and optimal play patterns. The best players understand not just their deck but every popular deck in the meta. They know the counters, the weaknesses, the strengths, and the ideal responses for every matchup. You can bet that if a pro is running a deck, they've put hours into fine-tuning every single card, testing every possible combo, and perfecting their mulligan strategy.\n\nEven beyond all the gameplay mechanics, Hearthstone is more than just a game—it’s a community. People argue about balance, cheer for their favorite streamers, analyze every patch note, and create memes about every single change. There’s a deep sense of camaraderie and rivalry in the Hearthstone world. People invest their time and energy not just in playing but in discussing, debating, and analyzing the game in ways you wouldn't believe. They follow the competitive scene, they watch tournaments, they have opinions on every deck, every patch, every nerf and buff. They study every patch note and balance change, debating how it affects the meta and wondering which archetypes will rise or fall. And the thing is, Hearthstone keeps evolving. New cards, new expansions, new mechanics—it never stops. This constant change is what keeps the game fresh, what keeps players on their toes. Every time a new expansion drops, it’s like a wave crashing through the game, reshuffling the tier list and redefining the meta. Players adapt, find new strategies, and develop new decks to rise to the top once again.\n\nSo yeah, Hearthstone may look like a simple card game, but anyone who actually understands it knows that it's so much more. It’s a strategic battlefield, a mental gauntlet, and a canvas for creativity, all rolled into one. It’s a game that challenges not just your knowledge of cards but your ability to think ahead, adapt on the fly, and stay calm under pressure. And if you’re lucky enough to understand the deeper layers of Hearthstone, if you’ve put in the hours, suffered the losses, celebrated the wins, then you know exactly what I’m talking about. Hearthstone is a masterpiece, a symphony of tactics and strategy, and if you’re not ready to respect the game, then it’s going to chew you up and spit you out. Because Hearthstone isn’t just about who has the best cards. It’s about who has the skills, the patience, and the guts to come out on top in a game where anything can happen at any moment.\n\nSo if you’re still calling it ‘just a card game,’ I’d invite you to sit down, build a deck, and try your hand against someone who’s been here since the beginning. See how long you last. Because Hearthstone isn’t just a game; it’s an art form, a science, a test of patience, and a journey of endless discovery. And only the best can truly say they understand it.", "label": 0}
{"text": "I have just returned to the game after not playing since death knight release and im loving it.  Using the rainbow death knight is a blast and im loving the look of all the new cards. The space theme is great and i really hope i can get a code!", "label": 0}
{"text": "You are a fake priest. As a True Priest, I want to watch trough, manipulate and steal my opponent’s mind with my psychic powers.", "label": 0}
{"text": "Holy epic hahaha", "label": 0}
{"text": "obviously its popping deathrattles for you too. not saying its good but its a lot deeper than 3 mana 12/12", "label": 0}
{"text": "The beat is very good if Leo did that himself thats just amazing very original.", "label": 0}
{"text": "Damn those are some nice ears", "label": 0}
{"text": "I really miss the days when aggro was allowed to run out of resources. Players had to be careful not to over extend into a board clear.", "label": 0}
{"text": "From what I saw, if you could give Soulbound Spire reborn through Bucaneer or Orbital Moon, the ship ramped up in size really fast.", "label": 0}
{"text": "Bit too weird for the sub", "label": 0}
{"text": "Honestly this is the kind of card that makes much more sense in a wheel of death deck. Like destroy your deck, then plop this moldy dude down. The first time a Warlock pulls out randomly I'll be impressed... every other time I'm going to be severely tilted", "label": 0}
{"text": "Jealous of people who are good at BG. I've tried it a few times but can't seem to 'get it' like I do HS", "label": 0}
{"text": "You're going to be holding onto those until march of you do it that way.. to me if you have 90 packs for the new expansion you should open the standard packs either now or after you open everything else", "label": 0}
{"text": "Really the ears? C'mon dude clearly the hottest part of this picture is that one mitten on one mitten off look", "label": 0}
{"text": "You will forgive me if I die? How generous of you. I'll contant you from the Shadowlands to than you for your mercy.\n\nErr.. I mean... FOR THE BURNING LEGION!", "label": 0}
{"text": "I took total offense to the lack of grammar. You should watch the tone at which you write.", "label": 0}
{"text": "I’m scared 😟", "label": 0}
{"text": "Cool", "label": 0}
{"text": "You know this card is something when half the comments say it’s shit and half the comments say it’s broken", "label": 0}
{"text": "u know what i have crippling social anxiety to the point this would be the first post that i made on the internet so fuck it i want the free thing", "label": 0}
{"text": "Good luck to everyone!", "label": 0}
{"text": "??", "label": 0}
{"text": "I've been thinking about picking the game back up. This looks like a fun expansion!", "label": 0}
{"text": "Playing a fun DH deck aiming to discount big minions with \\[\\[Spirit Peddler\\]\\] and \\[\\[Return Policy\\]\\]\n\n\\### big\n\n\\# Class: Demon Hunter\n\n\\# Format: Standard\n\n\\# Year of the Pegasus\n\n\\#\n\n\\# 1x (1) Illidari Studies\n\n\\# 1x (1) Miracle Salesman\n\n\\# 2x (1) Red Card\n\n\\# 2x (1) Taste of Chaos\n\n\\# 2x (2) Chaos Strike\n\n\\# 2x (2) Greedy Partner\n\n\\# 2x (2) Quick Pick\n\n\\# 2x (2) SECURITY!!\n\n\\# 2x (2) Sigil of Skydiving\n\n\\# 2x (3) Eye Beam\n\n\\# 2x (3) Return Policy\n\n\\# 2x (4) Umpire's Grasp\n\n\\# 2x (5) Window Shopper\n\n\\# 2x (6) Spirit Peddler\n\n\\# 1x (7) Marin the Manager\n\n\\# 1x (9) Avatar of Hearthstone\n\n\\# 1x (0) Zilliax Deluxe 3000\n\n\\#   1x (0) Zilliax Deluxe 3000\n\n\\#   1x (4) Virus Module\n\n\\#   1x (5) Perfect Module\n\n\\# 1x (10) Yogg-Saron, Unleashed\n\n\\# \n\nAAECAea5Awbh+AWFjgaplQajogbHpAa6wQYMtp8E7KAE9MMFsvUFkIMG7p4GvrAGw7AGzLEGqrgG1sAGsOEGAAED9LMGx6QG97MGx6QG6N4Gx6QGAAA=\n\n\\# \n\n\\# To use this deck, copy it to your clipboard and create a new deck in Hearthstone", "label": 0}
{"text": "I like that idea too. Reno shouldn't cancel sargeras or the purified nest", "label": 0}
{"text": "- **[Spirit Peddler](https://i.imgur.com/OkWHgqu.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/110768) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Spirit_Peddler)\n    - *Demon Hunter Common ^(Perils in Paradise)*\n    - **6 Mana · 6/6 · Demon**\n    - **Rush** **Deathrattle:** Reduce the Cost of a random minion in your hand by \\(6\\).\n\n- **[Return Policy](https://i.imgur.com/HhJwpGo.png)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/105514) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Return_Policy)\n    - *Demon Hunter Common ^(Whizbang's Workshop)*\n    - **3 Mana · Spell**\n    - **Discover** a friendly **Deathrattle** card you've played this game. Trigger its **Deathrattle**.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gc9us0/dh_decks_that_arent_agro/lts7tj0/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=lts7tj0)*", "label": 0}
{"text": "Like a drifter he was born to jerk alone.", "label": 0}
{"text": "Yeah! 4*700=2800, so the first one is still free. Math checks out.", "label": 0}
{"text": "It would be an appreciated joke if I were to receive a physical blizzard gift card while everyone else gets an actual card", "label": 0}
{"text": "they never said they're a good botanist", "label": 0}
{"text": "The urge to downvote just because I hate Reno.", "label": 0}
{"text": "https://preview.redd.it/61kxoa14d0xd1.png?width=634&format=png&auto=webp&s=f78cf36620ebb3f94ae47f0e7f85999c17a8840f\n\nI can't believe my screen can fit all of these.", "label": 0}
{"text": "Dalaran, Tombs and Galakrond all worth it if you want goid story and fun gameplay. The previous ones still had nice story but were mostly worth purchasing for the exclusive cards (which I don't recall if they used to be available for crafting or not, but regardless it was much higher value to just get the set).", "label": 0}
{"text": "Outjerked yet again\n\n*sigh*", "label": 0}
{"text": "Hes wanking it", "label": 0}
{"text": "Lmao don't know why but I laughed a bit too much", "label": 0}
{"text": "Click on two in the level select instead of 1.", "label": 0}
{"text": "Thank you so much for the response. I'm a moron lol. That is a great idea, thank you for the recommendation.", "label": 0}
{"text": "Bro pls let me win i need that signatue yrel for my sanity.", "label": 0}
{"text": "On a semi related note, it's still weird to me that they made Gunslinger Kurtrus a control card and then only printed aggro stuff (I guess you can make the argument that the 12/12 dormant dude was supposed to be control. It was obviously never going to see play in Standard.", "label": 0}
{"text": "How would that card text make any sense if it didn't?", "label": 0}
{"text": "Your account name says you're a bear, not a worm.", "label": 0}
{"text": "Doubtful, they still update the OG whizbang's deck list with every expansion, the exception being when he was rolled back for twist", "label": 0}
{"text": "Classic packs or standard packs? Classic packs are practically worthless so ill assume u mean standard packs \n\nHow patient are you? If u could wait like 4 months for the rotation to hit that would put u in a much better position since you won’t open cards that are about to rotate out \n\nIf you’re not patient u should at least wait until the expansion drops, to make the most of duplicate protection - always open packs from a specific expansion first (your mega bundle in this case)", "label": 0}
{"text": "Definitely meant standard packs, my bad. I’ll probably end up buying some packs from each set. Thank you for the reply!", "label": 0}
{"text": "Sweet, thank you for all the information. I appreciate it!", "label": 0}
{"text": "RIP & TEAR!", "label": 0}
{"text": "At the moment, I'd say no for Standard packs unless it's a really attractive bundle. Again, it's because of that rotation in March, half the cards you get will leave. Generally though, it's a decent buy.", "label": 0}
{"text": "How much gold do u have rn? The nerfs expire in about a week, so don’t bother with the titans miniset if you can’t get it before the nerfs expire", "label": 0}
{"text": "Yeah I don't think they actually will it was more an obscure cut at Transfer Student. I guess ironically the \"laziness\" of Transfer Student is exactly this effect lol.", "label": 0}
{"text": "Well yes but actually no\n\nHistorically, it were the botanists who studied mushrooms. Mycology as a separate field of studies is relatively recent, and to this day the nomenclature codex (International Code of Nomenclature for algae, fungi, and plants) is shared between plante and fungi", "label": 0}
{"text": "Are you insinuating people call you Dr. Worm, hrm?", "label": 0}
{"text": "Good luck everyone! See you in the Great Dark Beyond!", "label": 0}
{"text": "i still love you", "label": 0}
{"text": " cringeworthy post by the most L person on the team. can't get any worse than that!", "label": 0}
{"text": "This thread is so funny lmfao", "label": 0}
{"text": "Comment", "label": 0}
{"text": "ok", "label": 0}
{"text": "Klan wishes they could suck out the souls of the innocent to do sick magic. That's why the big guys are called Grand Wizards.", "label": 0}
{"text": "This meta will be, unique, to say the least. I mean, there is simply no way aggro/boardflood decks can be any good with [[eredar brute]] around, it’s just not possible.\n\nCan’t wait for every game to be against Orb Spell mage just like right now, I’m sure everyone agrees that it’s a very fun deck to play against.", "label": 0}
{"text": "- **NEW! [Eredar Brute](https://i.imgur.com/fDcnid9.png)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/111981) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Eredar_Brute)\n    - *Neutral Common ^(The Great Dark Beyond)*\n    - **7 Mana · 5/6 · Demon**\n    - **Taunt**, **Lifesteal** Costs \\(1\\) less for each enemy minion.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gbojqe/obligatory_reno_change_to_not_make_starships_a/ltsntc1/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltsntc1)*", "label": 0}
{"text": "I like free stuff", "label": 0}
{"text": "I was the one that started the rock duel - deck was based around starting multiple Rock duels in fact. (Against friends)  \nI kinda lost lol.  \n  \nAlso! We found out if you shuffle [[Pozzik]]'s robots into your deck (like via Gear Shift) then Pozzik dies, they'll summon the robots *from your deck* to Pozzik's side, even though they're not in your hand anymore.", "label": 0}
{"text": "- **[Pozzik, Audio Engineer](https://imgur.com/a/yYHeUpV)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/91252) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Pozzik%2C_Audio_Engineer)\n    - *Neutral Legendary ^(Festival of Legends)*\n    - **4 Mana · 4/4 · Minion**\n    - **Battlecry:** Add two 3/3 Bots to your opponent's hand. **Deathrattle:** Summon them for yourself.\n    - *Wrong card? what about:* [Ozruk](https://i.imgur.com/21lGNPB.mp4) • [Yoink!](https://imgur.com/a/Td6wZvc) • [Paparazzi](https://i.imgur.com/dOTzObB.mp4) • [Nozari](https://i.imgur.com/qiacoVx.mp4) • [Power Spike](https://i.imgur.com/TBQ5WGC.png)", "label": 0}
{"text": "[Yes!](https://hearthstone.wiki.gg/wiki/The_Perfect_Idea)", "label": 0}
{"text": "Druid because ramp play big card. Death knight and demon hunter because the average cards is better than hunter or mage. Power creep pay less mana gets more stuff.", "label": 0}
{"text": "Huh? Proof or it didnt happen", "label": 0}
{"text": "SIO LEGEND!", "label": 0}
{"text": "Both mystery egg and the new 2 mana egg can support this well, the problem is drawing it by the time a 12/12 is impactful", "label": 0}
{"text": "Wow my bad, I guess it does work, that's insane", "label": 0}
{"text": "Praise yogg", "label": 0}
{"text": "Shrodingers expansion 🤣", "label": 0}
{"text": "These posts...\n\nhttps://preview.redd.it/zlvt9tw5z0xd1.jpeg?width=270&format=pjpg&auto=webp&s=867ad71f8ea68cdb9fa34676684b043df5e08a18", "label": 0}
{"text": "Sexy draenei", "label": 0}
{"text": "The pentality of man", "label": 0}
{"text": "[https://www.reddit.com/r/hearthstone/comments/8i3dnn/tutorial\\_how\\_to\\_change\\_the\\_default\\_screenshot/](https://www.reddit.com/r/hearthstone/comments/8i3dnn/tutorial_how_to_change_the_default_screenshot/)", "label": 0}
{"text": "uh, do you have a screenshot or replay?", "label": 0}
{"text": "There should be more draenei skins. Right Yrei That attractive horns and hammer", "label": 0}
{"text": "really hype for The Great Dark Beyond OH YEAH", "label": 0}
{"text": "Overheal priest was completely destroyed by the injured hauler nerf.", "label": 0}
{"text": "Once again I hope that with a small degree of probability my comment will be noticed xdd", "label": 0}
{"text": "I used to die as Warlock before killing my enemy in like 40% of my games", "label": 0}
{"text": "Ha ha ha, you can't hide forever!", "label": 0}
{"text": "Its because this tactic probably doesn't work outside of silver or gold and any meta deck will roll over you before you accomplish all of those do nothing turns trying to trigger a death rattle 8 times.", "label": 0}
{"text": "Not always: https://www.reddit.com/r/hearthstone/comments/1gc6ogs/comment/ltsydfv/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button", "label": 0}
{"text": "I don’t get to use this tactic every game though, the deck has different strategies for different kinds of opponents.  Some of the cards I listed I use differently depending on the scenario.", "label": 0}
{"text": "This is not always needed for normal cards: https://www.reddit.com/r/hearthstone/comments/1gc6ogs/comment/ltsydfv/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button", "label": 0}
{"text": "Question whatever happened to that card text that would bloom in X expansions?", "label": 0}
{"text": "Amazing value with a board of 6 eggs", "label": 0}
{"text": "Noice", "label": 0}
{"text": "Not wait :(", "label": 0}
{"text": "Personally I would chose invincible, Luna is hard to make use in the early game due to mana limitation and not enough impact in the late game. Invincible is not game warping but still decent value as long as you have undead on board", "label": 0}
{"text": "Yeah they just hit it out of the park with the art this exp. Last great one was the under water expansion whatever it's called.", "label": 0}
{"text": "Had too Google this one. For anyone else who didn't recognize this card art, this is [[Loose Specimen]].\n\n\nEvery time I think I've seen every garbage pack-filler with inexplicably great art they've printed over the years, a Zombeast wanders in.", "label": 0}
{"text": "- **[Loose Specimen](https://i.imgur.com/2oUC4Iw.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/49176) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Loose_Specimen)\n    - *Neutral Epic ^(The Boomsday Project)*\n    - **5 Mana · 6/6 · Beast**\n    - **Battlecry:** Deal 6 damage randomly split among other friendly minions.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gcdwqk/found_a_real_insane_zombeast_creation_today/ltt77cb/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltt77cb)*", "label": 0}
{"text": "I love you", "label": 0}
{"text": "It saw play once in a meme hunter deck with making Gahz'rilla dormant and playing this followed by Tundra rhino for 392 damage when it awakened.", "label": 0}
{"text": "Toit", "label": 0}
{"text": "I have hopes that maya I can win this 🙏🏼", "label": 0}
{"text": "I like how Blizzard’s tried to rework Priest, like, four times and none of them have ever worked", "label": 0}
{"text": "Thanks for the giveaway!", "label": 0}
{"text": "good luck", "label": 0}
{"text": "GL everyone", "label": 0}
{"text": "Soon ^T ^M", "label": 0}
{"text": "Man, I wish Final Frontier's effect was on a neutral minion. It's such a cool card, and it's going to suck to think I have all of Druid's threats down after 40 turns, only to get killed by a 50 damage Denathrius. Over and over and over again.", "label": 0}
{"text": "I'm the 1 of 50", "label": 0}
{"text": "6 mana obsidian statue? Are you literaly insane😳😳", "label": 0}
{"text": "Why does this look so different to HS when I play? I mean the whole board and history ticker and powers all look different", "label": 0}
{"text": "Thanks 🥲❤️", "label": 0}
{"text": "I'm really want to win this ", "label": 0}
{"text": "Genius!", "label": 0}
{"text": "That plus anything poison is also good.", "label": 0}
{"text": "Vanish is insane even in wild at 6 mana, as far as im aware.\nAnd they abused so many battlecries over 6 mana with shadowstep.", "label": 0}
{"text": "fizzle this [https://cdn.7tv.app/emote/01H5CQ4E08000B1J9Q3F9DED5Y/4x.webp](https://cdn.7tv.app/emote/01H5CQ4E08000B1J9Q3F9DED5Y/4x.webp)", "label": 0}
{"text": "Because they’re not one", "label": 0}
{"text": "That's not tone 💀", "label": 0}
{"text": "Haha Stars go clank (deal 5 damage to all enemies)", "label": 0}
{"text": "Lmao people have such ideas I swear to god", "label": 0}
{"text": "Cool signature!", "label": 0}
{"text": "That deck is dead in the water", "label": 0}
{"text": "Yes, so even if your board is 30/30 jades you can get these sweet Denathrius infuses stacks", "label": 0}
{"text": "You play aggro, empty your hand, topdeck on 6.", "label": 0}
{"text": "Can you clarify what is commander in mtg, for people who bever touched it?", "label": 0}
{"text": "That’s great advice. I recently came back after several years and got about 450 cards from my 10 packs.", "label": 0}
{"text": "Been playing since beta. RNGesus don’t fail me now.", "label": 0}
{"text": "https://youtu.be/aeg4cNwA_3Q?feature=shared\n\nWatch the last game in this video. It is in Korean, but just watch the game. Fun rogue shenanigans.", "label": 0}
{"text": "This is infinitely better than the sandwich wdym", "label": 0}
{"text": "This is some MtG type interaction.\n\nKinda cool really.", "label": 0}
{"text": "That's exactly my thought what's gonna happen. People just desperately always want to make such cards a combo thing while in actuality it's just a good card fitting in every fast deck that empties your hand. Deal face damage + clear or weaken enemy board + develop offensive stats. That's not a combo card.", "label": 0}
{"text": "Not if you play aggro and have small hand size after turn 5", "label": 0}
{"text": "So egg deck?", "label": 0}
{"text": "Turn 7 for 0 mana on average from the decks that drew/made token minions/played tokens. At least that's what the un-refined lists are doing in theory crafting.", "label": 0}
{"text": "yeah this one is good but i question your lack of appreciation for pretty much the entirety of the Year of the Hydra's art/themes/etc. unironically might be my favorite back-to-back-to-back 3 sets and i've been playing since classic.", "label": 0}
{"text": "The Babbling Book copypasta is quickly becoming one of my favorite copypastas. It's just so positive and generous. Practically fills nothing at all at 216 words you drop him in your head and that chill ass mofo gives you a pasta to use later in life. And you also get this adorable memory of BB can make you smile but usually is too harmless to be removed.", "label": 0}
{"text": "999", "label": 0}
{"text": "Only few months left to rotate this fucker out of the pool!!!", "label": 0}
{"text": "my good the longer I look the more I am scared of her. I think its the googly eye", "label": 0}
{"text": "Woo. Good luck all!", "label": 0}
{"text": "Just found this beautiful card when making a warlock giant deck... It's so beautiful...", "label": 0}
{"text": "Can this effect happen multiple times?", "label": 0}
{"text": "Chill, i thought it was a funny take on the popular meme of the day.", "label": 0}
{"text": "hope this made it in time", "label": 0}
{"text": "Taking Rhyssa would have resulted in no secrets being offered, at least if it was me picking lol.", "label": 0}
{"text": "Nah not playing ships, gonna destroy your Reno with combo shenanigans.", "label": 0}
{"text": "I just use Yelling Yodeler, which also works with Reska and Chillfallen Baron if Eliza doesn't turn up soon enough.", "label": 0}
{"text": "How this changes the fact that they were and still are everywhere? \n\nNot to mention massively unfun to face.", "label": 0}
{"text": "Yup, it would feel more fare than now.", "label": 0}
{"text": "This looks crazy!!! Turn 6 :D Will definitely give it a try", "label": 0}
{"text": "It's not Doomguy locked in hell with demons. The demons are locked in hell with the Doomguy!", "label": 0}
{"text": "Honestly seems to work well with the crewmates since they summon each other and can deplete your hand very fast if you stack a few of them", "label": 0}
{"text": "Hope i win :)", "label": 0}
{"text": "alt+f4 to win", "label": 0}
{"text": "This is all on Blizzard and imo they absolutely shouldn't change Reno due to bad planning.  \n\nIf they really didn't want the two to interact in the way that they do, then they shouldn't have released the Starships at the same time Reno is in standard.  Why should people lose access to one of their cards just because Blizzard launched a new thing?  \n\nThe whole point of rotation is to ensure that cards which limit design space in some way don't \"become\" hearthstone forever.  \n\nReno will rotate in a predictable way - that's when the Starships should have been introduced.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "[31:20](https://www.youtube.com/watch?v=aeg4cNwA_3Q&t=1880s) if you wanna jump straight into the action", "label": 0}
{"text": "I think yes, just need shadow step", "label": 0}
{"text": "Have the showed pally's signature?", "label": 0}
{"text": "I like these odds!", "label": 0}
{"text": "When the bug that got it banned gets fixed.", "label": 0}
{"text": "[Yrel](https://www.reddit.com/r/hearthstone/s/BM9OPN15pR)", "label": 0}
{"text": "And when is that? I'm more hyped for this unban than the upcoming garbage expansion.", "label": 0}
{"text": "Thats what their doin instead of fixing the game lol", "label": 0}
{"text": "Everywhere where?\n\nSounds like you lose a lot to Reno decks. \n\nMaybe you’re playing a bad deck yourself?", "label": 0}
{"text": "yurrt", "label": 0}
{"text": "nothing will rotate out with this expansion, theres 3 expansions per year and theres only a rotation on the first expansion per year, the oldest three rotate", "label": 0}
{"text": "Okay Radahn.", "label": 0}
{"text": "google hearthstone battlegrounds", "label": 0}
{"text": "BBU? I don't think Army of the Dead is a very effective use of corpses, this isn't a swarm deck. You might as well replace it with Corpse Explosion since you're already using Soulstealers. \n\nIf you Dirty Rat something big out by accident, how are you getting rid of it? I see some good board control options, but nothing single-target apart from the Primus, which is a pretty late-game play.\n\nThe number one card you should be running for a Deathrattle deck is Reska, the combo with Yelling Yodeler with the former at 0-cost is tried and true. Though it is a bit late to craft them now with only one expansion left, assuming you don't have them. I'd also ditch the Revenants and replace them with Amateur Puppeteer. You might as well lean into handbuffs. Blood Tap just isn't enough by itself and Nerubian Swarmguard can get pretty overpowered with enough buffs.", "label": 0}
{"text": "As a bikini model I'll make it my mission to build a viable deck around Pyros", "label": 0}
{"text": "They were constantly emoting through the match more and more, conceded even tho they shouldn't and even sent Regis dm \"cancer deck\" after the match. Not behavior I'd expect to see in a friendly event like this where we get to see new cards in action for the first time. That really took viewers and apparently Regis by surprise. No idea who they are but that is not acceptable behavior at all.", "label": 0}
{"text": "Dear Blizzard,\n\nThank you for considering me to be a potential winner of your ‘The Great Dark Beyond’ Bundle giveaway. I believe that I am the best candidate for the code due to my extreme skill (bronze 3) as well as my good looks (Kindly Grandmother said I look scrumptious).\n\nThank you once again for your time and consideration. I will be eagerly awaiting the giveaway code.\n\nLove,\n\nYour favorite HearthStoner", "label": 0}
{"text": "I love rogue and make this work, but this card is just dust. Would \"undamage enemies\" make this viable?", "label": 0}
{"text": "yes", "label": 0}
{"text": "Thank you Blizzard you are the best ❤️", "label": 0}
{"text": "I mean, funnily enough that was the half I recognized, what's the octuple damage one?", "label": 0}
{"text": "This type of fix means a server hotfix or a full client patch. It's clearly not a server hotfix, or they would probably have just done that instead of the ban, unless it's extremely complicated. So a full client patch.\n\nThe next scheduled one is next week for expansion pre-patch. I would expect it to be in that, but on the other hand this patch tends to get locked in fairly early, so it's not 100% guaranteed.", "label": 0}
{"text": "Absolute banger Leo! I've liked your style even before but this just cements you as my current favorite designer in the game. Keep it up :)", "label": 0}
{"text": "Good luck!", "label": 0}
{"text": "Given that the purpose of theorycrafting is publicity, he's a very sensible inclusion. Known and popular in the HS community for his long-term involvement, and probably bringing in Marvel Snap viewers for the occasion.", "label": 0}
{"text": "Imagine a Warrior-only Denathrius that's buffed every time your minions take damage", "label": 0}
{"text": "Did they apply a buff to make it a 3/0 with that card that reduces stats?\n\n\nAnd to your question, ofc it's allowed. Why wouldn't it be? It's a set of cards interacting exactly as described in their text.", "label": 0}
{"text": "Hi", "label": 0}
{"text": "Such a creative idea", "label": 0}
{"text": "Good luck everyone, hope I win! I'm hard up for money right now could really use the help.", "label": 0}
{"text": "This card should be like 2 or 3 mana and then it'd be like okay", "label": 0}
{"text": "Goodbye etc, no more perfect tech out of your ass", "label": 0}
{"text": "### Custom Hunter7\n# Class: Hunter\n# Format: Standard\n# Year of the Pegasus\n#\n# 1x (1) Awakening Tremors\n# 1x (1) Jeweled Macaw\n# 1x (1) Shimmer Shot\n# 1x (1) Sneaky Snakes\n# 1x (1) Tracking\n# 1x (1) Wilderness Pack\n# 1x (2) Bait and Switch\n# 1x (2) Explosive Trap\n# 1x (2) Freezing Trap\n# 1x (2) Hidden Meaning\n# 1x (2) Messenger Buzzard\n# 1x (2) Patchwork Pals\n# 1x (2) Titanforged Traps\n# 1x (3) Dreamplanner Zephrys\n# 1x (3) Gorgonzormu\n# 1x (3) Workhorse\n# 1x (4) Camouflage Mount\n# 1x (4) Ignis, the Eternal Flame\n# 1x (4) Pozzik, Audio Engineer\n# 1x (4) Theldurin the Lost\n# 1x (5) Death Roll\n# 1x (5) Ranger Gilly\n# 1x (5) The Ryecleaver\n# 1x (6) Aggramar, the Avenger\n# 1x (6) Furious Fowls\n# 1x (6) Gnomelia, S.A.F.E. Pilot\n# 1x (9) King Plush\n# 1x (0) Zilliax Deluxe 3000\n#   1x (0) Zilliax Deluxe 3000\n#   1x (4) Virus Module\n#   1x (5) Perfect Module\n# 1x (10) Reno, Lone Ranger\n# 1x (10) Yogg-Saron, Unleashed\n# \nAAECAcvwBh6pnwTjnwTknwT0yAXf7QXq8gXI9gXg+AXX+QXYgQbLjgbOjgbUjgbfjgaplQbtmwaOngbHpAbxpQb+pQavqAaxuAaJvwbZwAaOwQa3wQa6zga04QbM4Qbh6wYAAAED9LMGx6QG97MGx6QG6t4Gx6QGAAA=\n# \n# To use this deck, copy it to your clipboard and create a new deck in Hearthstone", "label": 0}
{"text": "Oh so they vanish once they collide?", "label": 0}
{"text": "Yay. Another new minion post.", "label": 0}
{"text": "If he's leaning into handbuff a cheeky card is [[darkthorn Quilter]]", "label": 0}
{"text": "oh god not this again", "label": 0}
{"text": "We believe in you!", "label": 0}
{"text": "infinite Branns", "label": 0}
{"text": "is a combo deck with a 2% winrate allowed ? Yes", "label": 0}
{"text": "Lmfao that's so hilariously untrue I don't even know what to say. I've played since goblins vs gnomes they give out so much more free shit nowadays and make it so much easier to get back into as a returning player or new player it's not even comparable", "label": 0}
{"text": "Would be fantastic :)", "label": 0}
{"text": "I've never won, I hope you're lucky)", "label": 0}
{"text": "Comment.", "label": 0}
{"text": "I, for one, will actually really miss E.T.C in standard. I’m not sure how anyone can hate that card. Luckily I’m a wild player.", "label": 0}
{"text": "Luck, grant me one final blessing. Give me the luck.. To win these cards!", "label": 0}
{"text": "The dude is Cho’Gall now", "label": 0}
{"text": "Thanks! It’s a good point  about dirty rat. I actually started running that as a way to try and counter Warrior as that’s been the most painful class in my opinion. It’s helped once so far, but I do tend to wait until later before I use it. Corpse explosion is a good idea too, and can handle some big boards (e.g. I had to deal with a whole board of 14/14 souls the other day). \n\nI do have Reska too luckily, but the issue is I can’t use that and Soul Stealer because Reska needs a blue and green rune. Sometimes I get Reska from silk stitching but it’s not reliable at all.", "label": 0}
{"text": "What bridges? He moved HS to another dedicated channel. He's been part of all events etc forever.", "label": 0}
{"text": "It's a card from Perils, I don't know the exact name.", "label": 0}
{"text": "That's a lot of mental and emotional energy spent over what card game an adult man plays on stream.", "label": 0}
{"text": "There’s only two cards so unless you have secrets I guess Luna", "label": 0}
{"text": "As a spanish native speaker its a shame  that is always one of us the one being toxic and ruining the fun for everyone else", "label": 0}
{"text": "\"There's no coming back\" you say on a video of a Hearthstone event he was invited to.", "label": 0}
{"text": "There's a reddit bot that shows your deck when you paste just the code ;-)\n\nGrats on your legend!", "label": 0}
{"text": "But then, it should make the enemy spells cheaper to cast.. idk like (0)?", "label": 0}
{"text": "Once you see, you can never unsee …", "label": 0}
{"text": "Well as OG as it gets these days with most quitting them game.", "label": 0}
{"text": "Oh, ok I barely played the expansion", "label": 0}
{"text": "Last sec entry since i just saw it lol", "label": 0}
{"text": "Cool", "label": 0}
{"text": "Thank you both, this is incredible looking!", "label": 0}
{"text": "Shoot, I forgot about Reska's rune requirements. My bad! I guess you could stick them in ETC to get around that.\n\nYeah, Corpse Explosion has been especially useful against the Big Spell Mages with their waves of Elementals. I'm doing a BBF Location deck that combines the blood control cards and burn from Corpsicles and Horizon's Edge. It's been working pretty well.", "label": 0}
{"text": "Yea. Faithful Companion has turned out to be useless, mystery egg is great if you get Rhino.  I might modify it slightly for more early game survival.  Regardless, your just trying to setup lethal in your hand; so you don’t really care about board control other than taking care of taunts", "label": 0}
{"text": "Agree to disagree on Yrel and K'ure.", "label": 0}
{"text": "He didn't hurt anyone or threaten or say anything more critical than anyone else about the game. What the hell are you on about? Did Raffle burn his bridges with HS because he started mainly streaming Balatro? He has said much more critical things about the game for years. People can criticize something and not be \"burning their bridges\" with it. That is insanely childish.", "label": 0}
{"text": "double blood unholy DK has to be one of the least offensive decks ever how the hell did this guy get mad?? r/losercity behavior.", "label": 0}
{"text": "I guess, I don't care too much. If they aren't being paid, then there's no expectation of professional conduct.", "label": 0}
{"text": "None of your business.", "label": 0}
{"text": "I didnt even know he left HS at all to do marvel snap. The guy has been playing HS for a while now, maybe he stopped and came back, some kids here really think thats some kind of crime lmao", "label": 0}
{"text": "Too much work for small indie company", "label": 0}
{"text": "Pls", "label": 0}
{"text": "You think aggro is more exciting than control? lol", "label": 0}
{"text": "Müller#11431   quest trade NA", "label": 0}
{"text": "I hope blizzard never stops printing some bad cards because I love theroycrafting ways to make them work.", "label": 0}
{"text": "Let's not pretend a 2 mana 4/4 with no downsides would be a bad thing", "label": 0}
{"text": "Shai Hulud!", "label": 0}
{"text": ">play for stakes such as 50, 100, 150, 200 gold. Second place takes his money back while the first place gets the rest.\n\nimpossible because players will use it to sell their gold. This is instant death of game monetization and instant death of the game itself", "label": 0}
{"text": "every 15 minutes someone posts this bug and no, it's not a new tribe. the tag \"draenei\", like dwarf, orc, etc. has been in the game for several years, in Mercenaries game mode", "label": 0}
{"text": "I know their not new Tribes i play mercenaries. But they would be new tribes to battlegrounds. N could be very viable with the next big patch.", "label": 0}
{"text": "Quick question. What happens when you have like 4 stars in hand. Would they trigger if any of the 4 become adjacent, which could technically be immediately after the second set. Or are they tied to only their \" siblings\".", "label": 0}
{"text": "Tess has been insane for me when I can get it", "label": 0}
{"text": "How u geht that Layout", "label": 0}
{"text": "It's not the emoting that's over the line. It's the \"cancer deck\" dm after the match. Highly not accetable behavior.", "label": 0}
{"text": "while its really good, it doesnt really win games on its own, or dramatically change the outcome like some other cards can...", "label": 0}
{"text": "Gl", "label": 0}
{"text": "Life is not a matter of holding good cards, but of playing a poor hand well.\n\nRobert Louis Stevenson", "label": 0}
{"text": "This guy will clear a board of 48/48s. Need poison to get that pesky 49/49 though.", "label": 0}
{"text": "pleasepleasepleaseplease", "label": 0}
{"text": "absolutely , especially when you draft around it and only have spells that cant possibly damage yourself.", "label": 0}
{"text": "realistically you pair this card after launching your starship so that it recasts multiple times and you get multiple 1 mana 10 cost minions to either flood the board or hold and trickle out slowly to pressure the opponent \n\nim not 100% sure how to feel about the minion summoning direction for arcane druid but this card seems like it's supposed to be the finisher piece or 'win con' of that deck.", "label": 0}
{"text": "Darwin\n\nhttps://preview.redd.it/ag90exipu3xd1.jpeg?width=5792&format=pjpg&auto=webp&s=b0e4a89a5a2e768700510a30ea54679abbe9fd85", "label": 0}
{"text": "Good luck for everyone", "label": 0}
{"text": "Reply for giveaway entry", "label": 0}
{"text": "I switch between Arena and BG. However, the last 2 months I've actually just played Arena.", "label": 0}
{"text": "It's the mobile version", "label": 0}
{"text": "I will probably save up to 1000 before I do anything", "label": 0}
{"text": "It feels like there's math to be done here", "label": 0}
{"text": "wonder if it would be good if it were undamaged enemy characters.", "label": 0}
{"text": "gonna have to disagree here, requires other cards to be good and doesnt immediately do something. \n\n\n\nseems like a \"win more\" card because if you got that many skeletons by turn 8 you are probably already winning anyways. \n\n  \nvery \"pickable\" but far from broken.", "label": 0}
{"text": "Pick me!", "label": 0}
{"text": "I mean your question wasn’t “what’s the flashiest legendary in current arena,” it was what is the best legendary. Which at the moment, is Aralon", "label": 0}
{"text": "ayo", "label": 0}
{"text": "Would have driven me crazy to be watching live when Regis tabbed out for an entire turn to Google the anniversary card lol.", "label": 0}
{"text": "Listen I get the card is boring but at 3 mana this would definitely see play it would be autoinclude.\n\n\n\n\nAt 4 mana it's just an awkward card to both combo and use as a board clear.\n\n\nIf it was a 4/4 with stealth for 1 turn or something great but the problem with it rn is that it feels out of place in such a high power setting.", "label": 0}
{"text": "Like, the guy is being extremely rude, but I don't care too much that random Hearthstone player is rude, it's not a big deal.", "label": 0}
{"text": "Sir, you’re a bear.", "label": 0}
{"text": "Nothing respectful about your ellipsis.", "label": 0}
{"text": "All of it", "label": 0}
{"text": "This card is close to playable being a 3 mana 3/4 would still be boring but good having stealth also would make it good.\n\n\nGiving it rush again probably makes I solid.\n\n\nIt's the lack of any of these things that make it bad.\n\n\nIt's such a poorly designed card IMO it's so awkward at 4 mana to combo without a 0 mana spell which he generates.... After he is played.\n\n\nAnd then you would think oh it's a combo focus so maybe he gives you a 0 mana spell to enable the next combo but nope you want to use it before he gets removed this then before you lose double damage.", "label": 0}
{"text": "The card from the post is used exclusively by people who’ve never learned how to tie their own shoelaces… or build decks.", "label": 0}
{"text": "Looks like you forgot to attach other screenshots?", "label": 0}
{"text": "Im confused, can someone make sense of this for me?", "label": 0}
{"text": "I still think it's wild that Signatures just don't say what the card does anywhere on the actual card. Feels like there should be a client-side option to have card text on signatures so the owner of the card can still see the full art if they want to, but the opponent doesn't get hit with \"your opponent played Tidepool Pupil, it has Battlecry: If you cast 3 spells while holding this, **Discover** a copy of one. They also played Tracking, which lets you **Discover** a card from your deck. And lastly, they played *worm*.\"\n\nI know you can hover over it once it's on the board, but not only is the text for what the card does in a really small box, but it also feels like whenever my opponent plays a signature against me, they're giving me homework.", "label": 0}
{"text": "The emoting is fine, dude was obviously just upset that he was getting hard controlled, Regis had the option to mute if it was annoying him.   \nThe conceding was also fine, I know the rule that they are not supposed to concede because youtube people want stuff to clip for their videos, but people concede all the time in the theorycrafting anyway. He was dead on board and the only thing that Regis could do was BM him.    \nThe message was going a bit too far, just because he doesn't know Regis personally. \n\nHe should get a warning from the event team not to do it again, thats about it.", "label": 0}
{"text": "yes, this is discussed here\n\n\n\n[https://www.reddit.com/r/hearthstone/comments/1gbtjsk/warcraft\\_anniversary\\_event\\_leaked/](https://www.reddit.com/r/hearthstone/comments/1gbtjsk/warcraft_anniversary_event_leaked/)", "label": 0}
{"text": "Blessrng", "label": 0}
{"text": "Ironically it's actually better while dormant than not in a deck like that, so eating the minion accelerating its timer might actually actually be undesirable. Sure it's a 12/12, but it has no keywords and at this state of the game, removing large minions on turn 5 or so is pretty trivial.", "label": 0}
{"text": "6000 to 8000 I'd argue it's enough.  I'm not sure what the optimal is but that's about what I usually spend", "label": 0}
{"text": "Looks like a dune poster.", "label": 0}
{"text": "Based on the comments I was expecting some really toxic stuff to happen and then all I got was a guy emoting a few times in a row for 3 turns and then telling someone else their deck was cancer. Was it professional on his part? No, but it's not nearly as bad as people are making it seem.", "label": 0}
{"text": "Ok this one made me laugh", "label": 0}
{"text": "Oh jeez you got me dude! Definitely a Regis here and not a VR game developer from the other side of the planet who just enjoys the game in their freetime. My bad!", "label": 0}
{"text": "He isn't a random player though, he is a content creator and was invited to an event. Being the toxic person at an HS event is unacceptable.", "label": 0}
{"text": "To be fair, that was a completely new card that wasn't even revealed yet. Anyone would have done the same I think.", "label": 0}
{"text": "guff", "label": 0}
{"text": "Good luck everybody!", "label": 0}
{"text": "https://preview.redd.it/stlqx2qg24xd1.jpeg?width=346&format=pjpg&auto=webp&s=562b79a4c939cf7f552022a94193d22731ed6f65\n\nI remember well how the classic cards looked. It's called cartoon style, not photorealism.", "label": 0}
{"text": "In normal match it would be ok. But in a friendly event for creators to showcase the new expansion? I'd expect better behavior as I think everyone should in a more professional environment.", "label": 0}
{"text": "jungle giants is not even close", "label": 0}
{"text": "Maiev isnt really alliance. The wardens are a neutral faction, in WC3 the night elves were their own faction (kinda).", "label": 0}
{"text": "Unnerfed guff", "label": 0}
{"text": "Jungle Giants wasn’t even good when it was on Standard 7 years ago, let alone now lmao\n\nTo name a few horrors from the past, I think Greybough and Hadronox from the Taunt Druid era were great. Shitty when they were released but eventually great. Taunt Druid was a nightmare.\n\nBut by miles the most broken legendary for Druid were two: Guff and Twig of the World Tree. Turns out ramping to 20 on potentially turn 5 (or earlier with the old ramp options) is too good", "label": 0}
{"text": "Ah! I haven't played WC3 in like 16 years so I didn't remember that. They did appear a bit more alliance-aligned in Legion.", "label": 0}
{"text": "Unnerfed innervate", "label": 0}
{"text": "(nowadays I’d argue the best legendaries on Druid are any neutral legendary minion. Whatever class can use it, Druid can use it better and far earlier due to ramping, the strongest mechanic in game)", "label": 0}
{"text": "Aviana", "label": 0}
{"text": "You must be good at it to rack up that much gold", "label": 0}
{"text": "Yeah I don’t understand the thought process behind the making of DK either. My opinion is, if it’s not broken don’t fix it. \n\nNow we have 76% winrate big spell mage decks and 70% winrate Highlander DK. That’s not ok", "label": 0}
{"text": "Oh fk big spell mage, I was omw forgetting about that, that and DK made me quit my gold to legend in standard mode, I just didn't have any motivation after playing my own druid deck", "label": 0}
{"text": "Thats true, i forgot dorian exists, i just dusted him on the auto pilot. I already concede when i face druid in wild so i never see dorian.", "label": 0}
{"text": "Alright, deck intro time and this time, we're blowing up the Alfred P Murrah Federal Building.", "label": 0}
{"text": "And removal was worse\n\nNow it's just infinite board fill vs infinite removal and whi ever wins didn't have fun", "label": 0}
{"text": "Hahahah I was just getting the paradise collection coin and decided I wanted to build out my favorite druid deck I had the two seasons before. So I refreshed the deck, it was fun to play and all of a sudden I climbed through to gold without really loosing, so I decided to go for legend, I came to high plat and the meta decks just increased to like 80% of games being unwinnable so I quit", "label": 0}
{"text": "please let me be lucky just this once pls god thx", "label": 0}
{"text": "I think you can be proud of yourself, congratulations!", "label": 0}
{"text": "Thanks for all the answers, did not realise I was matching up with players that not in my rank", "label": 0}
{"text": "Congrats!", "label": 0}
{"text": "Fair enough then let us consider the usual: some small rewards based on some tough to reach achievements, cool visual elements for players in different elo tiers and the likes.\n\nI really don't care much about any one specific random feature that i've mentioned or their details. I'm certain that the hearthstone devs would do a great job at crafting a tournament mode without reading this post at all.", "label": 0}
{"text": "Gimme please and thank you", "label": 0}
{"text": "It seems to happen when your pending friend requests are full. (Max of 50.) In the battle.net client you can click on friend settings, then view sent friend requests to cancel them.", "label": 0}
{"text": "my bad , i had the filter \"only priest cards\" on.", "label": 0}
{"text": "https://preview.redd.it/ru4v3ox8a4xd1.jpeg?width=460&format=pjpg&auto=webp&s=6443722cdf5388b8b3d7849bdb8db9e03e288559", "label": 0}
{"text": "Reaching legend is easy. All you need is a deck that’s 51% win rate. If it’s a meta deck with higher WR the process is even easier. If it is an Aggro deck the process is also faster. Really nothing special. Reaching top 10 legend is something special.", "label": 0}
{"text": "Damn, you’re an elegant speaking swirling mass of chaotic destruction! Good for you!", "label": 0}
{"text": "Congrats bro. Time to push for platinum. 😎", "label": 0}
{"text": "Hell yeah! I have no idea if my silly Colifero Leeroy deck will get that far hahaha", "label": 0}
{"text": "well with easy, I meant about the time consuming part. imo reaching the best rank in this game should take more than 8 hours of play time", "label": 0}
{"text": "![gif](giphy|QDK1pCI43lGhO|downsized)", "label": 0}
{"text": "Your win rate of 57% is decent but not exactly crazy. If you have more than 50% wr if you play enough games you will 100% reach legend rank because thats how the rank up system works.", "label": 0}
{"text": "thank you very much, this was the answer I am looking for!", "label": 0}
{"text": "At the Atlanta comicon 2015 I met the voice actor (and arthas) and he recorded a special version of the voice thing", "label": 0}
{"text": "https://preview.redd.it/ii0qw14lb4xd1.png?width=500&format=png&auto=webp&s=f6d0d33e3c2c721502fa9a84c8e8b67d5f06e868\n\nYou’ll be needing him.", "label": 0}
{"text": "Idk, who would’ve thought adding renethal back to the game even made this card more aids?", "label": 0}
{"text": "Yeah some decks are good until a certain point in the ranks, 80% is kinda a lot and not a lot for decks lose that much except the “Core Decks”. So maybe try to learn to play that deck in another way or maybe edit is a little\n\nAs you may have guessed, I play Warlock. In a Pain Warlock deck I play 2 Cult Neophytes and 1 Speaker Stomper. I do that because a lot of big spell mages roam in every rank so it works a lot better in the current meta. It has the highest winrate of the pain warlock decks because it adapts to the meta", "label": 0}
{"text": "Uhm, Nagrand Slam is several years old. It was created in the same patch as Demon Hunter was introduced.", "label": 0}
{"text": "Enter giveaway!", "label": 0}
{"text": "You can build shudderwock dynamite shaman with every possible bomber, this deck actually forbidden by Geneva convention", "label": 0}
{"text": "AAEBAdPwBgy/7QP39gOnjQSX7wTvogWogAalgQbBlAaplQbJsAa6wQaL4gYOg8cDhscD1tED+dUD/eoDzPkDgIUEtJIE8rEEvsoE6e0EkpIFnJoG38AGAAA=", "label": 0}
{"text": "**Format:** Wild (Year of the Pegasus)\n\n**Class:** Demon Hunter (Pier Halveria)\n\nMana | Card Name | Qty | Links\n:--:|:---|:--:|:--:\n1 | [Double Jump](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SCH_422.png) | 2 | [HSReplay](https://hsreplay.net/cards/59606/),[Wiki](https://hearthstone.wiki.gg/Double%20Jump)\n1 | [Final Showdown](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SW_039.png) | 1 | [HSReplay](https://hsreplay.net/cards/64375/),[Wiki](https://hearthstone.wiki.gg/Final%20Showdown)\n2 | [Sigil of Flame](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BAR_306.png) | 2 | [HSReplay](https://hsreplay.net/cards/62845/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Flame)\n3 | [Abyssal Depths](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TSC_608.png) | 2 | [HSReplay](https://hsreplay.net/cards/71922/),[Wiki](https://hearthstone.wiki.gg/Abyssal%20Depths)\n3 | [Paraglide](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_928.png) | 2 | [HSReplay](https://hsreplay.net/cards/106591/),[Wiki](https://hearthstone.wiki.gg/Paraglide)\n3 | [Prince Renathal](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/REV_018.png) | 1 | [HSReplay](https://hsreplay.net/cards/79767/),[Wiki](https://hearthstone.wiki.gg/Prince%20Renathal)\n3 | [Sigil of Time](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/YOG_401.png) | 2 | [HSReplay](https://hsreplay.net/cards/101660/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Time)\n4 | [Glide](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SCH_356.png) | 2 | [HSReplay](https://hsreplay.net/cards/60153/),[Wiki](https://hearthstone.wiki.gg/Glide)\n4 | [Soul Split](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_488.png) | 2 | [HSReplay](https://hsreplay.net/cards/58246/),[Wiki](https://hearthstone.wiki.gg/Soul%20Split)\n4 | [Topple the Idol](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TID_703.png) | 2 | [HSReplay](https://hsreplay.net/cards/75070/),[Wiki](https://hearthstone.wiki.gg/Topple%20the%20Idol)\n4 | [Vanndar Stormpike](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/AV_223.png) | 1 | [HSReplay](https://hsreplay.net/cards/67239/),[Wiki](https://hearthstone.wiki.gg/Vanndar%20Stormpike)\n5 | [All Fel Breaks Loose](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/MAW_012.png) | 2 | [HSReplay](https://hsreplay.net/cards/79593/),[Wiki](https://hearthstone.wiki.gg/All%20Fel%20Breaks%20Loose)\n5 | [Sigil of Reckoning](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/AV_264.png) | 2 | [HSReplay](https://hsreplay.net/cards/67892/),[Wiki](https://hearthstone.wiki.gg/Sigil%20of%20Reckoning)\n7 | [Argus, the Emerald Star](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_862.png) | 1 | [HSReplay](https://hsreplay.net/cards/98344/),[Wiki](https://hearthstone.wiki.gg/Argus%2C%20the%20Emerald%20Star)\n7 | [Death Speaker Blackthorn](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BAR_329.png) | 1 | [HSReplay](https://hsreplay.net/cards/63167/),[Wiki](https://hearthstone.wiki.gg/Death%20Speaker%20Blackthorn)\n7 | [Lor'themar Theron](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/RLK_593.png) | 1 | [HSReplay](https://hsreplay.net/cards/86383/),[Wiki](https://hearthstone.wiki.gg/Lor%27themar%20Theron)\n7 | [Marin the Manager](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_702.png) | 1 | [HSReplay](https://hsreplay.net/cards/106682/),[Wiki](https://hearthstone.wiki.gg/Marin%20the%20Manager)\n7 | [Mythical Terror](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_866.png) | 1 | [HSReplay](https://hsreplay.net/cards/98469/),[Wiki](https://hearthstone.wiki.gg/Mythical%20Terror)\n8 | [Illidari Inquisitor](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CS3_020.png) | 2 | [HSReplay](https://hsreplay.net/cards/66176/),[Wiki](https://hearthstone.wiki.gg/Illidari%20Inquisitor)\n8 | [Kologarn](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_330.png) | 1 | [HSReplay](https://hsreplay.net/cards/100929/),[Wiki](https://hearthstone.wiki.gg/Kologarn)\n8 | [Magtheridon, Unreleased](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TOY_647.png) | 1 | [HSReplay](https://hsreplay.net/cards/104521/),[Wiki](https://hearthstone.wiki.gg/Magtheridon%2C%20Unreleased)\n8 | [Mo'arg Forgefiend](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SW_068.png) | 2 | [HSReplay](https://hsreplay.net/cards/64716/),[Wiki](https://hearthstone.wiki.gg/Mo%27arg%20Forgefiend)\n9 | [Brutal Annihilan](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/RLK_212.png) | 2 | [HSReplay](https://hsreplay.net/cards/84242/),[Wiki](https://hearthstone.wiki.gg/Brutal%20Annihilan)\n9 | [Pit Commander](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_486.png) | 2 | [HSReplay](https://hsreplay.net/cards/58243/),[Wiki](https://hearthstone.wiki.gg/Pit%20Commander)\n9 | [Travelmaster Dungar](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/WORK_043.png) | 1 | [HSReplay](https://hsreplay.net/cards/110859/),[Wiki](https://hearthstone.wiki.gg/Travelmaster%20Dungar)\n10 | [Yogg-Saron, Unleashed](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/YOG_516.png) | 1 | [HSReplay](https://hsreplay.net/cards/101033/),[Wiki](https://hearthstone.wiki.gg/Yogg-Saron%2C%20Unleashed)\n\n\n**Total Dust:** 19040\n\n\n**Deck Code:** AAEBAdPwBgy/7QP39gOnjQSX7wTvogWogAalgQbBlAaplQbJsAa6wQaL4gYOg8cDhscD1tED+dUD/eoDzPkDgIUEtJIE8rEEvsoE6e0EkpIFnJoG38AGAAA=\n\n\n*****\n\n\n^I ^am ^a ^bot. ^Comment/PM ^with ^a ^deck ^code ^and ^I'll ^decode ^it. ^If ^you ^don't ^want ^me ^to ^reply ^to ^you, ^include ^\"###\" ^anywhere ^in ^your ^message. ^[About.](https://github.com/HearthSim/deck-code-bot/blob/master/README.md)", "label": 0}
{"text": "You could literally get to gold off of opponent concedes alone", "label": 0}
{"text": "The lack of freeze and support for big spells is a big deal. In fact Nagrand Slam peak play in competitive was in... Mage... In Deck of Lunacy.", "label": 0}
{"text": "is this still possible to get now or no", "label": 0}
{"text": "What if this said \"fill your hand with backstabs\" \n\nI feel like that would be cool with good synergy with new combo stuff", "label": 0}
{"text": "Thanks, I'm sure I could have! But I didn't, I got to Gold by playing and winning enough games :)", "label": 0}
{"text": "Good choice.  I think the old adventures have a lot of value for the cost.", "label": 0}
{"text": "i see some janky otk shenanigans with soul bound ashtongue and Silas darkroom with this and nerfed spectral pillager", "label": 0}
{"text": "Oooooooohhhh bleh with pain warlocks hahahah. But every good deck is honestly bleh, mine is too hahahah. I play tempo dragon druid that I built myself. But I know what you mean, since they nerfed druid it just feels weak", "label": 0}
{"text": "I'm sure they discussed this for a long time even before the game was released in 2014 and throughout all these years", "label": 0}
{"text": "And got really easy match ups with 9 warriors, only two DH and at that mmr no Aggro priest or other tier 1 decks.", "label": 0}
{"text": "Hey congrats. Be proud. Platinum awaits", "label": 0}
{"text": "Also, she's hot.", "label": 0}
{"text": "Least loathsome redditor", "label": 0}
{"text": "It was really really good before, not sure if it still is but definitely legend viable", "label": 0}
{"text": "Can we expect a MilkingSheep re-balance soon 👀", "label": 0}
{"text": "my entry", "label": 0}
{"text": "Yeah, makes sense.  In previous decks I used to use Yodeler and Death growl all the time.  I just don’t use it in this one since there aren’t many power move death rattles outside of Reska.  If I wanted to I could shift more power to Reska.", "label": 0}
{"text": "ICANT", "label": 0}
{"text": "Its an older card and in newest arena card pool", "label": 0}
{"text": "Which is strange to my logic, I didn't know they design it like that, I thought the cards in arena were from the newest expansions.", "label": 0}
{"text": "Thanks bro.", "label": 0}
{"text": "Your post was automatically removed because you used profanity in the post title. Please resubmit without using profanity in the title.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hearthstone) if you have any questions or concerns.*", "label": 0}
{"text": "Elemental fire mage, probably, I want to give a try to blood dk too, but i doesnt look like it will have any support.", "label": 0}
{"text": "Yea its random few sets (atleast i think its random) just to mix things up, nobody would touch arena if arena follows standard rotation, it would only be interesting for few minutes after new expansion drops", "label": 0}
{"text": "I think starships will be in Reno decks because starships are neat", "label": 0}
{"text": "Congrats homie !", "label": 0}
{"text": "No, they rotate the selection of expansions frequently.  The most recent expansion is (nearly) always included, as is the core set, but the rest will be picked from across the history of the game.", "label": 0}
{"text": "I didn't even check and knew it was a spanish speaker. Lol", "label": 0}
{"text": "I mean you literally have no rank punishment for losing at silver. Do you play 3 games a season?", "label": 0}
{"text": "Congratulations! I'm rooting for ya all the way buddy, and hoping I can emulate diamond one day.", "label": 0}
{"text": "Three body problem reference?", "label": 0}
{"text": "can't be done", "label": 0}
{"text": "Ok?  This really isn't in scope for the designers, nor should it be imo.  It's more the fault of the person posting to use the one card frame that doesn't have the information printed.", "label": 0}
{"text": "Kaelthas was never part of the horde iirc. He stayed in Outland and the faction that broke off from him was the one that joined the horde on Azeroth", "label": 0}
{"text": "R/hearthstone users when the art style doesn’t change but it’s in space now", "label": 0}
{"text": "Dear Blizzard,\n\nThank you for considering me to be a potential winner of your ‘The Great Dark Beyond’ Bundle giveaway. I believe that I am the best candidate for the code due to my extreme skill (bronze 3) as well as my good looks (Kindly Grandmother said I look scrumptious).\n\nThank you once again for your time and consideration. I will be eagerly awaiting the giveaway code.\n\nLove,\n\nYour favorite HearthStoner", "label": 0}
{"text": "It’s so great to see the love for Sire D, even to this day. One of the few cards that ruled the meta with an iron fist and still has a majority of players’ support and love. Amazing card.", "label": 0}
{"text": "The struggle is the measure of satisfaction.", "label": 0}
{"text": "I used it, with a success in chumps cow dungar shaman.", "label": 0}
{"text": "It was funny though that they got mad", "label": 0}
{"text": "If Cenarius isn't in, then neither should Medivh.\n\nAs for others, the dwarves are 100% part of the alliance,  and vanndar/drekthar are solid candidate's.", "label": 0}
{"text": "Are you:\n\n\nFor the Horde!!\n\n\nor\n\n\nFor the Alliance!!", "label": 0}
{"text": "Looks way too hard for a 100 exp quest", "label": 0}
{"text": "Sexo", "label": 0}
{"text": "While youre at it, how about his buddy the jailer?\n\nI opened golden bolf the month the miniset released, poor guys havent seen the light of day since the nerf", "label": 0}
{"text": "Yeah, I was thinking \"how you even manage to be toxic in HS\"? It is incredible how far HS community goes to label smt as toxic. Especially compared to stuff considered toxic in other games.", "label": 0}
{"text": "Just in case anyone can't see it clearly, I've [fixed](https://imgur.com/a/dTxhWi7) it.", "label": 0}
{"text": "How is filling your board with 10/10 minions underwhelming?", "label": 0}
{"text": "What else can you do in that case except laugh? It was absurd :D", "label": 0}
{"text": "My name is Walter Hartwell White. I live at 308 Negra Arroyo Lane, Albuquerque, New Mexico, 87104. This is my confession. If you’re watching this tape, I’m probably dead, murdered by my brother-in-law Hank Schrader. Hank has been building a meth empire for over a year now and using me as his chemist. Shortly after my 50th birthday, Hank came to me with a rather, shocking proposition. He asked that I use my chemistry knowledge to cook methamphetamine, which he would then sell using his connections in the drug world. Connections that he made through his career with the DEA. I was... astounded, I... I always thought that Hank was a very moral man and I was... thrown, confused, but I was also particularly vulnerable at the time, something he knew and took advantage of. I was reeling from a cancer diagnosis that was poised to bankrupt my family. Hank took me on a ride along, and showed me just how much money even a small meth operation could make. And I was weak. I didn’t want my family to go into financial ruin so I agreed. Every day, I think back at that moment with regret. I quickly realized that I was in way over my head, and Hank had a partner, a man named Gustavo Fring, a businessman. Hank essentially sold me into servitude to this man, and when I tried to quit, Fring threatened my family. I didn’t know where to turn. Eventually, Hank and Fring had a falling out. From what I can gather, Hank was always pushing for a greater share of the business, to which Fring flatly refused to give him, and things escalated. Fring was able to arrange, uh I guess I guess you call it a “hit” on my brother-in-law, and failed, but Hank was seriously injured, and I wound up paying his medical bills which amounted to a little over $177,000. Upon recovery, Hank was bent on revenge, working with a man named Hector Salamanca, he plotted to kill Fring, and did so. In fact, the bomb that he used was built by me, and he gave me no option in it. I have often contemplated suicide, but I’m a coward. I wanted to go to the police, but I was frightened. Hank had risen in the ranks to become the head of the Albuquerque DEA, and about that time, to keep me in line, he took my children from me. For 3 months he kept them. My wife, who up until that point, had no idea of my criminal activities, was horrified to learn what I had done, why Hank had taken our children. We were scared. I was in Hell, I hated myself for what I had brought upon my family. Recently, I tried once again to quit, to end this nightmare, and in response, he gave me this. I can’t take this anymore. I live in fear every day that Hank will kill me, or worse, hurt my family. I... All I could think to do was to make this video in hope that the world will finally see this man, for what he really is.", "label": 0}
{"text": "Hello.", "label": 0}
{"text": "Woah, didn’t know that thanks!", "label": 0}
{"text": "I sure hope I get lucky with this giveaway 😀", "label": 0}
{"text": "Play it in Shudderwock shaman for infinite packs", "label": 0}
{"text": "It really is. The best hearthstone expansions always make me wistful for a game that doesn't exist, like Mean Streets of Gadgetzan. This is right up there with that. I wanna fly around as a cute Draenei in a spaceship I cobbled together, fightin' demons and stuff.", "label": 0}
{"text": "please revert [[Luna's pocket galaxy]]", "label": 0}
{"text": "How are they ever 10/10 ?", "label": 0}
{"text": "9 mana neutral card? You mean; Druid card, sir.", "label": 0}
{"text": "I'm not too bad. Been playing for like 10 years so it's like second nature", "label": 0}
{"text": "If you make it 5 mana sure", "label": 0}
{"text": "This card would be a lot nicer if I didn't have to have 5 hand space to play it ;_;", "label": 0}
{"text": "I am not really doing this quest eheh my wins as a warrior or chaman may be equal to 50 in total but maybe some day.", "label": 0}
{"text": "I tend not to spend all my reserves every expansion. This means I don't get all cards by any mean, I still miss a lot of epics and legendarys and only craft the ones I really think I'm gonna use.\n\nThis expansion I managed to save 12k gold even after buying the miniset with gold.", "label": 0}
{"text": "Even in current wow the night elves are sort of independent, more like allied with the alliance ", "label": 0}
{"text": "Yes they realised that’s where the money is - sick signature art", "label": 0}
{"text": "He named the blood elves but it was Sylvanas that got the blood elves into the horde. Kaelthas was sort of following Illadin around", "label": 0}
{"text": "https://preview.redd.it/5171up5qv4xd1.png?width=1080&format=pjpg&auto=webp&s=9e95fc74271ac07fda330c90cbd7993164823dc6", "label": 0}
{"text": "https://preview.redd.it/lpfka8xsv4xd1.jpeg?width=1170&format=pjpg&auto=webp&s=6ee05bc5ef03e23921946e7354c40b28da9a8e9a", "label": 0}
{"text": "Is it still ongoing?", "label": 0}
{"text": "I'm in 535 now.  \nIt is pain.   \nZarimi/HL works until new meta appears.  \nAlso i have custom mech deck. Any one try Mech priest or am i just insane?", "label": 0}
{"text": "https://preview.redd.it/0eahuayiw4xd1.png?width=853&format=pjpg&auto=webp&s=6b124dd2257901857acc492fd7d96906ff9f5644", "label": 0}
{"text": "- **[Worthless Imp](https://imgur.com/a/rLRZPIt)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/56265) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Worthless_Imp_%28Impbalming%29)\n    - *Warlock ^(Saviors of Uldum)*\n    - **1 Mana · 1/1 · Demon**", "label": 0}
{"text": "No joke. Tried to get back into WoW because of Hearthstone…", "label": 0}
{"text": "For Perils I spent 8500 gold (53 normal packs, and 8 Golden packs).\n\nI’m still not sure if it’s worth it for me to spend some of that gold on Golden packs, but it might be so, since it gives me a legendary of my choice, in the worst case scenario. \n\nAnd that is about as much as I spend on each expansion. But it’s slightly different each time, since I adhere to looking at pity timers.\n\nThis gives me the ability to play almost any deck I want. I have 40k dust in the bank, and a lot more in cards I could dust (golden an and wild).\n\nSo you should be fine with 7k.", "label": 0}
{"text": "I honestly liked the regular art better than the signature one for this card. Have also wondered how to make it work in a deck.", "label": 0}
{"text": "All you need is a 2 to 3 win average. As long as you sometimes get 5 or more wins.", "label": 0}
{"text": "Probably Zombeasts. It's peak Hearthstone and fully utilizes its nature as a *digital* CCG you couldn't feasably do in traditional card games. Also, it's just fun in itself, offers a lot of variety and is kinda strategic.", "label": 0}
{"text": "It's because Hearthstone minions are actually venomous, not poisonous.", "label": 0}
{"text": "Least favorite are all the mechanics that are just fancy-worded conditions, e.g. Overkill, Honorable Kill, Combo, Quickdraw, ...", "label": 0}
{"text": "Wtf is your point?", "label": 0}
{"text": "i'm a f2p player that dusts all cards except for dk and druid i still have to grind another month or 2 after each expansion to craft druid and dk meta decks, i literally have no warlock card other than the core set ones", "label": 0}
{"text": "I just saw Jeff playing on twitch with Banana sticker, he got horse tokens going from 20 to 58, you're right there's something wrong", "label": 0}
{"text": "Light vs Void, matching the current and next expansion WoW theme.", "label": 0}
{"text": "Didnt know there were quests, didnt even know there was an event. And im apparently finished with it. It cannot be that hard to complete :p", "label": 0}
{"text": "the same is true for the left side. there are enough cards that have changed unnoticeably: Eaglehorn bow, Bestial Wrath, Bane of Doom, murlocs. As for the highlanders, this is a changes to only the specified cards. All other highlander cards are not touched", "label": 0}
{"text": "A compromise would be to say Sire is like Renathal. There’s mass hatred and mass love, but tilted more in love’s favor. However, people were asking for a Sire D nerf-revert before he was even close to rotating from Standard (as a lot of people contributed Sire’s power with Renathal’s; after Renathal got nerfed, people didn’t see why Sire had to remain nerfed) and those type of posts got a lot of positive attention at the time. To this day, people still inquire about a Sire revert and he’s brought up fondly more than other legendaries that ruled the meta as hard as he did.", "label": 0}
{"text": "Nice, I think it would be faster as an aggro DH but if you're looking for a slow and rewarding journey this may be the good option.", "label": 0}
{"text": "My winrate will never recover from this knowledge ", "label": 0}
{"text": "Yo", "label": 0}
{"text": "I'm interested, but missing quite a lot of the cards for this deathrattle archetype. Can you explain ur wincon or even upload a video? Thanks!", "label": 0}
{"text": "yeah I'm not a fan of aggro decks just because I get bored doing the same thing every game where the only strategy is go face. a lot of dh decks are aggro focused so that's why I don't have the 1k yet.", "label": 0}
{"text": "Protip: reroll every daily event quest to make it \"play one tavern brawl\" for the same amount of xp", "label": 0}
{"text": "> All playing is summoning\n\nExcept mechs that get magnetized.", "label": 0}
{"text": "Favorite? Honestly, probably just the simplest of them all. Battlecry. Having my cards actually offer something to my gameplan from the moment I drag it out of my hand is definitely underrated a whole lot. And rarely spoken of as well, since yknow... its just Battlecry.\n\nLeast favorite... not really sure. Maybe Corrupt. That was ass to play around. I dont think there's many ways to make it an actual interesting mechanic either.", "label": 0}
{"text": "How the hell did you get that 10/10 demon that destroys the enemy deck ?", "label": 0}
{"text": "A good start would be buffing it, 8 maybe 7 mana? ;)", "label": 0}
{"text": "Would you count DK Plagues as a mechanic for this? And Warlock's Abyssal Curses? I hate those.\n\nI'm not fond at all of any \"for the rest of the game\" mechanic, as well, since those leave no room for counterplay.", "label": 0}
{"text": "I miss Charge", "label": 0}
{"text": "As far as I know it doesn’t matter which you open first — Golden or normal packs. \n\nBut I’ll usually start with Golden packs. \n\nAnd for pity timers: I use pen and paper, as I’m playing on mobile. But I think on a PC you can use like HS deck tracker or something like that to track the timers. \n\nBtw, another thing you should be doing, to allow for saving up more gold for the first day, is saving up your Standard packs (like the ones you get from Tavern Brawls), generally it won’t make much of a difference if you’re buying more than 40 expansion packs, but I think it’s still a good practice. And these small things here and there add up. \n\nI usually start saving up on the first or second week of an expansion. And so I currently have 19 of them. \n\nAlthough, I think with the upcoming expansion they’re changing Tavern Brawl packs to be current expansion packs, and not Standard.", "label": 0}
{"text": "But how do you pronounce Justicar Trueheart?", "label": 0}
{"text": "thanks bro I almost shat my pants", "label": 0}
{"text": "Deckbuilding is a normal thing, you don't need to be smart ass to create decks for completing quests.", "label": 0}
{"text": "Magnetic is my passion. I love making the weirdest cards op", "label": 0}
{"text": "Not sure why you're dusting most of your classes as a F2P player.  I am also F2P and don't dust anything other than dupes.  But if you have somehow got yourself in this position, just build a Warlock deck including 2 copies of the 2 imps in Core and hard mulligan for then in casual.  You'll probably get through it in an hour or two.\n\nOr just ignore it.  If you have done all your other event quests you will probably complete the track anyway.", "label": 0}
{"text": "Does it vary? I remember seeing some \"after summoning\" cards not triggering.  \nIs there a difference between \"when summoning\" and \"after summoning\" maybe?", "label": 0}
{"text": "Dredge was incredible. Having a mini second hand at the bottom of your deck made you feel really smart sinking things down to pull them back up later. The flavor was also fantastic and there wasn't an overabundance of Dredge effects, so it always felt like a meaningful choice.", "label": 0}
{"text": "yay! \n\n![gif](giphy|7yORCExjS87Jk10xSU|downsized)", "label": 0}
{"text": "Lok’tar Ogar!!!", "label": 0}
{"text": "It removes the current 30 demons that make up the portal (deck), and it automatically refreshes with a new 30.", "label": 0}
{"text": "Yeah because BSM is really an aggro deck like your original comment was complaining about.", "label": 0}
{"text": "Works in arena too", "label": 0}
{"text": "https://preview.redd.it/wfu53kyq95xd1.png?width=1080&format=pjpg&auto=webp&s=ff6d8c5da11b93cf0c04210c1e8c18e36362207e\n\nMaybe my decks are bad, Teach me master,\n\nanyways unfun cards like Reno, brann, boss and more are killing the game,\n\nMy own opinion, you are free to have yours.", "label": 0}
{"text": "funny number tho", "label": 0}
{"text": "The cabal will hunt you down for revealing our most protected secret!\n\nWhat's next? You tell them how anyone can get legend? With nothing but a copy/paste and some time?", "label": 0}
{"text": "much to tyrande's disappointment", "label": 0}
{"text": "I think it swapped cost with an ¡Oh, manager! That costed 0 because the 3 mana 3/2. The effect doesn't go off until the discount card (skya) is played and the effect is resolved, but I don't know if this works", "label": 0}
{"text": "3 win average is to break even on the gold. And what you say doesn't make sense, if you have 3 wins average, how high you got on some individual runs doesn't matter. Your only 12 win run still counts towards your average. 5 win average means you could can have 3 consecutive 12 win runs, and then tank 3 runs with 0 wins, and your rewards in gold would be 75 across all 6 runs.", "label": 0}
{"text": "meta is super boring this year, now i play plague dk with this card and chogal just to make a lit spicy. so far, so good", "label": 0}
{"text": "- **NEW! [Final Frontier](https://i.imgur.com/DidZDUu.png)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/111008) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Final_Frontier)\n    - *Druid Epic ^(The Great Dark Beyond)*\n    - **7 Mana · Arcane Spell**\n    - **Discover** a 10-Cost minion from the past. Set its Cost to \\(1\\).\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gc9wmb/cards_artwork/ltw0zmt/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltw0zmt)*", "label": 0}
{"text": "It's easier from month to month", "label": 0}
{"text": "Probably the when or after case. Dont remember exactly but it did work in some scenarios. Maybe the mech that gets +1+1 after you summon a mech or some kind of buff aura.", "label": 0}
{"text": "combo is controllable though", "label": 0}
{"text": ":(", "label": 0}
{"text": "i see you are from blizzard, *i have notes:* if you dont have enough space in your hand, not all cards will be played. like i have 8 cards in my hand, i play this one, only 3 cards will be played from pack, not 5. plase consider changing it.\n\nalso, therre is a small chance it triggered yogg location, forgot its name.", "label": 0}
{"text": "I'll wait here for an answer too", "label": 0}
{"text": "Funny enough there could actually be viability to this card because of Sonya\n\nSonya —> mini scoundrel —> 2x talgath —> scoundrel —> Zilliax which heals your face for 16 health\n\nNow you can argue tar slick does the same thing.  But tar slick doesn’t discount your Zilliax, give you backstab, and makes your minions take double damage as well\n\nGive this a try, it could potentially be good in Sonya lists", "label": 0}
{"text": "Yes, sorry, I don't play standard so I don't really know the meta, but yes, the 3/2 discounts non-rogue cards since the buff.", "label": 0}
{"text": "BONK", "label": 0}
{"text": "Game will be patched 1 week before release, quest changes are going to be at the time not at expansion release. Patch should drop on the 29th, finish the weeklies on the 28th and then save as usual.", "label": 0}
{"text": "🤔", "label": 0}
{"text": "Sea shill only works on non-rogue cards so it was some <=2 cost mage spell", "label": 0}
{"text": "Probably still wardening. Easy job since we killed all their prisoners!", "label": 0}
{"text": "My original comment was not complaining about aggro decks lmao but good way to completely avoid engaging with the topic because you know you're wrong ;(", "label": 0}
{"text": "thank you!", "label": 0}
{"text": "I think Im going to retire the hyper aggro pirates and choose a different loaner. I dont think my blood pressure can handle the anticipation of winning/autolosing based on my opening hand", "label": 0}
{"text": "Gotta load up on Morgls", "label": 0}
{"text": "99% of azeroth's problems wouldnt exist if the night elves were rational thinking people.", "label": 0}
{"text": "Your opponent had a 1 or 2 mana mage spell in hand, and because of sea shill it would cost 0. When they played skyla, the battlecry triggered before the sea shill effect got consumed, so skyla saw  a 7 mana sunset volley as the most expensive spell and a 0 mana unknown spell as the cheaper one, so it switched its costs. That's how They got a 0 mana sunset volley.", "label": 0}
{"text": "its prob primordial glyph", "label": 0}
{"text": "Same boat! Feels good to finally get it", "label": 0}
{"text": "*They can't keep getting away with it!*", "label": 0}
{"text": "Make the Avatar of Hearthstone play all 5 cards even with 9/10 spaces in hand filled and I will play 100 games with this card 😭 please 😆\n\n=\n\n> Avatar of Hearthstone adds 5 random cards that are from any Standard format expansion to the hand. The cards are then immediately played with random targets. If there are less than 5 available spots in the hand, Avatar of Hearthstone will only play that many cards.", "label": 0}
{"text": "Well... I'd say that all that old god influence constitute more than 1% of the problems\n\n\nBut as for the burning legion, did The avatar of Sageras get in during the war of the ancients, thanks to the sundering or unrelated?", "label": 0}
{"text": "You mean as a complete loner", "label": 0}
{"text": "funny how you copied my second comment in this thread to act like you got some dunk, you're not very bright are you? my first comment was clearly:\n\n\"not worth arguing with this sub, it's one of the dumbest hive minds out here. reno is OP but please please please revert the tsunami nerfs!!! pirate DH is fine and takes skill actually!! razzle dazzler isn't overtuned!!! it's a bad take factory\"\n\nplease seek professional mental health support we are here for you", "label": 0}
{"text": "I really like lackeys as well, but I think the one I like the most is infuse and Colossal (although not sure if we can call the last one a mechanic)\n\nWhat I hate, may be because is quite recent, excavate. As someone who likes to play all classes, I hate when a mechanic that becomes  the meta isn't shared across all classes.", "label": 0}
{"text": "I put Sire D in my Reno Health DK that can go up to 70+ health. He is essential now.", "label": 0}
{"text": "Would binge", "label": 0}
{"text": "Rogue deck with return to hand. Avatar most often generates minions, so if I were playing this I'd put Shadowstep and Togwaggle's Scheme - not just for this, but the minions summoned - *that's* the true value of this card.", "label": 0}
{"text": "**Format:** Wild (Year of the Pegasus)\n\n**Class:** Hunter (Rexxar)\n\nMana | Card Name | Qty | Links\n:--:|:---|:--:|:--:\n0 | [Devouring Swarm](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/SW_460.png) | 1 | [HSReplay](https://hsreplay.net/cards/65044/),[Wiki](https://hearthstone.wiki.gg/Devouring%20Swarm)\n0 | [Serpentbloom](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/WC_007.png) | 1 | [HSReplay](https://hsreplay.net/cards/63334/),[Wiki](https://hearthstone.wiki.gg/Serpentbloom)\n1 | [Fetch!](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TOY_352.png) | 2 | [HSReplay](https://hsreplay.net/cards/103146/),[Wiki](https://hearthstone.wiki.gg/Fetch%21)\n1 | [Flare](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/EX1_544.png) | 2 | [HSReplay](https://hsreplay.net/cards/896/),[Wiki](https://hearthstone.wiki.gg/Flare)\n1 | [Play Dead](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/ICC_052.png) | 2 | [HSReplay](https://hsreplay.net/cards/42652/),[Wiki](https://hearthstone.wiki.gg/Play%20Dead)\n1 | [Tracking](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CORE_DS1_184.png) | 2 | [HSReplay](https://hsreplay.net/cards/69545/),[Wiki](https://hearthstone.wiki.gg/Tracking)\n2 | [Bargain Bin](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/MIS_105.png) | 1 | [HSReplay](https://hsreplay.net/cards/105564/),[Wiki](https://hearthstone.wiki.gg/Bargain%20Bin)\n2 | [Birdwatching](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_408.png) | 2 | [HSReplay](https://hsreplay.net/cards/106574/),[Wiki](https://hearthstone.wiki.gg/Birdwatching)\n2 | [Conjured Arrow](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/RLK_804.png) | 2 | [HSReplay](https://hsreplay.net/cards/84007/),[Wiki](https://hearthstone.wiki.gg/Conjured%20Arrow)\n2 | [Explosive Trap](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CORE_EX1_610.png) | 1 | [HSReplay](https://hsreplay.net/cards/69603/),[Wiki](https://hearthstone.wiki.gg/Explosive%20Trap)\n2 | [Feign Death](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/GVG_026.png) | 1 | [HSReplay](https://hsreplay.net/cards/1991/),[Wiki](https://hearthstone.wiki.gg/Feign%20Death)\n2 | [Fireworks Tech](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BOT_038.png) | 1 | [HSReplay](https://hsreplay.net/cards/47855/),[Wiki](https://hearthstone.wiki.gg/Fireworks%20Tech)\n2 | [Parrot Sanctuary](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_409.png) | 1 | [HSReplay](https://hsreplay.net/cards/106576/),[Wiki](https://hearthstone.wiki.gg/Parrot%20Sanctuary)\n2 | [Rat Trap](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CORE_GIL_577.png) | 1 | [HSReplay](https://hsreplay.net/cards/111363/),[Wiki](https://hearthstone.wiki.gg/Rat%20Trap)\n2 | [Scavenger's Ingenuity](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_213.png) | 1 | [HSReplay](https://hsreplay.net/cards/56703/),[Wiki](https://hearthstone.wiki.gg/Scavenger%27s%20Ingenuity)\n2 | [Watcher of the Sun](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_039.png) | 1 | [HSReplay](https://hsreplay.net/cards/95917/),[Wiki](https://hearthstone.wiki.gg/Watcher%20of%20the%20Sun)\n3 | [Augmented Porcupine](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_201.png) | 2 | [HSReplay](https://hsreplay.net/cards/56398/),[Wiki](https://hearthstone.wiki.gg/Augmented%20Porcupine)\n3 | [Brann Bronzebeard](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/LOE_077.png) | 1 | [HSReplay](https://hsreplay.net/cards/2949/),[Wiki](https://hearthstone.wiki.gg/Brann%20Bronzebeard)\n3 | [Deadly Shot](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/CORE_EX1_617.png) | 1 | [HSReplay](https://hsreplay.net/cards/69605/),[Wiki](https://hearthstone.wiki.gg/Deadly%20Shot)\n3 | [Mecha-Leaper](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TTN_734.png) | 2 | [HSReplay](https://hsreplay.net/cards/98182/),[Wiki](https://hearthstone.wiki.gg/Mecha-Leaper)\n3 | [Messmaker](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TOY_646.png) | 1 | [HSReplay](https://hsreplay.net/cards/104519/),[Wiki](https://hearthstone.wiki.gg/Messmaker)\n3 | [Overplanner](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/VAC_444.png) | 1 | [HSReplay](https://hsreplay.net/cards/108431/),[Wiki](https://hearthstone.wiki.gg/Overplanner)\n3 | [Prince Renathal](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/REV_018.png) | 1 | [HSReplay](https://hsreplay.net/cards/79767/),[Wiki](https://hearthstone.wiki.gg/Prince%20Renathal)\n3 | [Stitched Tracker](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/ICC_415.png) | 1 | [HSReplay](https://hsreplay.net/cards/42707/),[Wiki](https://hearthstone.wiki.gg/Stitched%20Tracker)\n3 | [Unleash the Hounds](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/EX1_538.png) | 1 | [HSReplay](https://hsreplay.net/cards/1243/),[Wiki](https://hearthstone.wiki.gg/Unleash%20the%20Hounds)\n4 | [Mok'Nathal Lion](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/BT_212.png) | 2 | [HSReplay](https://hsreplay.net/cards/56694/),[Wiki](https://hearthstone.wiki.gg/Mok%27Nathal%20Lion)\n4 | [Mystery Egg](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/TOY_351.png) | 2 | [HSReplay](https://hsreplay.net/cards/103144/),[Wiki](https://hearthstone.wiki.gg/Mystery%20Egg)\n4 | [Yelling Yodeler](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/JAM_005.png) | 2 | [HSReplay](https://hsreplay.net/cards/95344/),[Wiki](https://hearthstone.wiki.gg/Yelling%20Yodeler)\n5 | [Emperor Thaurissan](https://art.hearthstonejson.com/v1/render/latest/enUS/512x/WON_133.png) | 1 | [HSReplay](https://hsreplay.net/cards/102677/),[Wiki](https://hearthstone.wiki.gg/Emperor%20Thaurissan)\n\n\n**Total Dust:** 7440\n\n\n**Deck Code:** AAEBAR8S2wnHD4UX080C7/UC/7oD5u4DlPwD458E5Z8El+8Ere0FlaIGx7AG3LgG0MAGj88Gg+YGC4AHnM0CzrgD9roDqZ8Ep5AF8OgFhv8F6KUG6qUGzsAGAAA=\n\n\n*****\n\n\n^I ^am ^a ^bot. ^Comment/PM ^with ^a ^deck ^code ^and ^I'll ^decode ^it. ^If ^you ^don't ^want ^me ^to ^reply ^to ^you, ^include ^\"###\" ^anywhere ^in ^your ^message. ^[About.](https://github.com/HearthSim/deck-code-bot/blob/master/README.md)", "label": 0}
{"text": "[Flavor[Final Frontier]]", "label": 0}
{"text": "Happens to me regularly. Only fix is to disconnect then recconect again or just close and reopen the game. Its because you have reconnected but the popup hasnt gone away", "label": 0}
{"text": "That card requiring 5 free hand slots is bullshit. Also, that card not triggering the battlecries is bullshit. 0/10", "label": 0}
{"text": "Got rin off of wave of nostalgia and then went all in.", "label": 0}
{"text": "hi john", "label": 0}
{"text": "Either the 2/3 that makes a coin or the weapon prolly", "label": 0}
{"text": "They’re representing the underrepresented Hearthstone players 😆", "label": 0}
{"text": "I'll be happy with the current state of the game then. Thanks for participating in the post.", "label": 0}
{"text": "hi hat o/", "label": 0}
{"text": "Charge is absolutely in the game right now, and it's exactly where it needs to be power-wise. Do you miss [[gnomeregan infantry]] or something? Maybe [[raging worgen]] I could get behind, but power level of warrior (and renethal) has defunct that deck", "label": 0}
{"text": "- **[Gnomeregan Infantry](https://i.imgur.com/c4i46N4.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/2066) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Gnomeregan_Infantry)\n    - *Neutral Common ^(Goblins vs Gnomes)*\n    - **3 Mana · 1/4 · Minion**\n    - **Charge** **Taunt**\n\n- **[Raging Worgen](https://i.imgur.com/aNHNx2f.mp4)** ^[Library](https://hearthstone.blizzard.com/en-us/cards/1155) ^• ^[wiki.gg](https://hearthstone.wiki.gg/wiki/Raging_Worgen)\n    - *Neutral Common ^(Legacy)*\n    - **3 Mana · 3/3 · Minion**\n    - Has +1 Attack and **Windfury** while damaged.\n\n---\n^*I&#x2005;am&#x2005;a&#x2005;bot.&#x2005;[About](https://www.reddit.com/user/Card-o-Bot/comments/1ahde25/faq/)&#x2005;•&#x2005;[Report&#x2005;a&#x2005;Bug](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Bug+Report&message=/r/hearthstone/comments/1gcpvp2/what_is_your_alltime_favorite_mechanic_which_one/ltwi8fv/%0A⬇️+Please+describe+the+bug+⬇️%0ADescription:+)&#x2005;•&#x2005;[Refresh](https://www.reddit.com/message/compose/?to=Card-o-Bot&subject=Refresh&message=ltwi8fv)*", "label": 0}
{"text": "I really hope they buff it to work regardless of hand size. It would be a kind of reasonable late-game value bomb, but as it is it takes way too much work for it to do anything.", "label": 0}
{"text": "The bot doesn't do the ascii art justice", "label": 0}
{"text": "Close and reopen is the fix for me", "label": 0}
{"text": "Funny when you consider that strong viable Highlander decks are harder to build than most of other decktypes.", "label": 0}
{"text": "Yep said that was one of them. On mobile its just quicker  to turn on and off your internet", "label": 0}
{"text": "Honestly, I think inspire is my favourite. Often when I play it feels like once minion resolfe their effect, that is it. You're left with just a boring body. I like how inspire is a versatile  mechanic, that also sticks with a minion.\n\nAt least in theory obviously - I know it's a bad mechanic, but the intended playstile is something I wish they try to do more often.\n\nAs for the least favourite, probably tourist. It's barely a mechanic, the set was horribly designed, with few classes getting 20 cards while some got some only on paper. Plus, it makes aquiring collection much harder if you only play on few classes.", "label": 0}
{"text": "Dancing Darryl", "label": 0}
{"text": "This is why mine is still Discover, after all these years. For the exact same reasons. I guess zombeasts are just a double discover, now that I think about it", "label": 0}
{"text": "Did you pick it?", "label": 0}
{"text": "That stars have 2 different names and say something along the lines of when next to the other name deal 5 to all enemies, so depends on if the same name always spawns on the same side.", "label": 0}
{"text": "umm it's very useable", "label": 0}
{"text": "I like infuse and corrupt since I like seeing new arts and hearing new voicelines", "label": 0}
{"text": "Also \"Play\" should basically trigger any battlecries imo if it's supposed to be as if you had played those cards (also trigger any \"whenever you play...\" effects but don't wanna be greedy)", "label": 0}
{"text": "Idk what Standard Packs this dude pulling but I get at least one legendary every time, that ain't the standard packs I know", "label": 0}
{"text": "How about making it so the cards don't go into your hand, meaning you actually do get to play all the cards? ", "label": 0}
{"text": "Cards that say thing like that never trigger battlecry. Look at the hunter legendary Sasquawk and that one priest dragon", "label": 0}
{"text": "TL:DR:\nFavourite is probably hero powers and new hero powers, least favourite is random effects where there is a very large power difference between a low roll and a high roll.\n\nI agree that discover and dredge are excellent as some others said, but I think my personal favourites are some hero cards, and some of the quests and sidequests.\n\nSome of the quests and hero cards have certainly been quite unfun to deal with, but I really like the deck building challenge quests can pose. The thing I really like about hero cards is in how they play with the hero portraits and hero power mechanics.\n\n Honestly hero powers on their own is a really neat mechanic, if you include new hero powers it might even be my favourite. It really helps make every class feel more destinct, and makes bad turns feel a lot less terrible. Because just a hero power rarely feels good, but it's a hell of a lot better than nothing at all.\n\nSomeone mentioned not liking rest of game effects because you can't really play around them, which I certainly agree with to some degree, but that is also what I really like about some quests and hero cards. The key word there being some.\n\nI think that a permanent effect that either wins you the game in a couple of turns at most is fine, and that ones that only give you a very slight edge that very well might not be that decisive for most of the time that it's active can be pretty great (for example some new hero powers, and what little experience I've had playing against the dk card that gives permanent +1 attack). However a permanent effect that will almost undoubtedly win the game eventually, but takes a long time to do so is absolutely dreadful to play against. Except for maybe some hand/deck buff stuff and old c'thun, but that's not really a permanent effect in the same way I don't think (although that might just be because I like those types of decks).\n\nBut my absolute least favourite is random targeting, and some forms of completely random generation. A random frost spell, or a random spell that costs 3 or less, or five or more, or a random excavated card, or something like that is pretty fine, but if a card can give you anything from a one mana spell to a tsunami the distance between the high and low rolls is too large.\n\nSomething like deal 3 damage to two random minions can be fine, but things like mad bomber and arcane missiles that can either do nothing, win you the game or lose you the game with relatively little chance to manipulate it (ok, those aren't the best examples because they're such small effects).\n\nBasically I really dislike random effects that have a too large variance in their effectiveness. It's fine when there are low rolls and high rolls as long as the average outcome is still within the same ballpark. If randomness is the difference between a good play and a great play or getting a good resource or a great resource then that's fine. But if a random effect will make something either a great play or a terrible play I think that it detracts from the strategic experience that I'm looking for in this type of game.\n\n(This comment became really lomg, huh)", "label": 0}
{"text": "HanDH seems pretty fun.", "label": 0}
{"text": "( 4 Mana ) Metamorphosis: Hero Power becomes Deal 5 Damage after 2 uses swap it back \n/ ( 5 Mana ) Clockwork Automaton: Healing and Damage from your Hero Power becomes double\n/ ( 2 Mana ) Sing-Along Buddy: Hero Power triggers twice\n/ ( 2 Mana ) Garrison Commander: u can use your Hero Power Twice\n/ ( Garrison + Sing Along make it possible to trigger ur hero power 4 times if u can afford to pay it twice )", "label": 0}
{"text": "9 mana battlecry minion, too slow in this meta", "label": 0}
{"text": "MarkMcKz, he is hearthstone youtuber who is famous for creating some of stupidest combos and OTKs in hearthstone, and most of the time combos are really unrealistic and not suitable for competitive play\n\nHere is a [his video](https://youtu.be/TYtvCD15jyc?si=kFQGGvU6J80DWSQm) that features combo you have experience", "label": 0}
{"text": "I was saving up the dust for just this! Thanks for sharing. I  didn't know about the clockwork card 😁", "label": 0}
{"text": "When I play I imagine my opponent as another kindred soul wasting time together. At the end of the day that's what its all about", "label": 0}
{"text": "Congratulations!", "label": 0}
{"text": "I think with the ship theme it is actually most likely to draw from [Swordfish](https://youtu.be/xpwK1KKp0J4?t=3m21s) and ships of that type from Cowboy Bebob. Notice the central console with very particular handles to each side.", "label": 0}
{"text": "Yeah, the first time I played it was in a control priest deck where my hand was full. Thought it would just play everything and put it right on the battlefield, but then I only opened 1 card that it couldn't play so it was a wet fart of a play.", "label": 0}
{"text": "💀", "label": 0}
{"text": "Then what is the issue with current artworks lmao", "label": 0}
{"text": "Look at the replay, none of those cards were played.", "label": 0}
{"text": "Is it really unique? Feels like digital games tend to have similar mechanics. The other I regularly play (Horus Heresy) certainly does.", "label": 0}
{"text": "Oponent was going first and no coin generating card was played", "label": 0}
{"text": "Yeah no clue then. Prly some janky interaction with glyph then", "label": 0}
{"text": "it depends, if they are standard packs, you're better off waiting for the next expansion (November 5th). If they are expansion packs, you can just open them. If they are catch up packs, you should open first, even before the standard packs!", "label": 0}
{"text": "I think it's better to wait for the new expansion since it's very close to being released.", "label": 0}
{"text": "Discover is for sure my favorite.\n\nMy least favorite is inspire probably and maybe plagues even though I like playing plagues I just hate playing against it", "label": 0}
{"text": "Short answer: yes.\nOpening packs after the expansion drops will wield cards from 6 expansions, 3 of which will not rotate until Q1 2026. Opening them now will only give you cards still legal next year 2 out 5 times.", "label": 0}
{"text": "My favourite has to be the \"if you play x tribe in a row, then get y\". That's why my favourite decks are the elemental variants. My least favourite has to be yoinking minions out of your opponent in battlefield. It feels so disingenuous and cheap. The opponent spent a lot of time or mana in summoning a powerful minion just to lose it to a single card and get it used against them. It feels a bit unfair to me tbh", "label": 0}
{"text": "I jerk alone too.\n\nhttps://preview.redd.it/n30xa18s76xd1.jpeg?width=800&format=pjpg&auto=webp&s=42410d3368b8dd8ba15a006c28257bc56adcaa86", "label": 0}
{"text": "Sasquawk doesn't say it plays cards. It says \"repeat.\" This says it *plays* cards. Battlecries trigger when a card is played from hand, and that's what this card says it does.", "label": 0}
{"text": "This with Fan of Knives is honestly pretty solid. Takes some set up but Rogue board clear combo could be pretty good. I think it’s thematic that the minions have to be undamaged since most Rogue removal requires that unless it’s just bouncing a card.", "label": 0}
{"text": "If they are standard or class packs keep them until set releases. Anything else you can open.", "label": 0}
{"text": "Questline would definitely be my choice. Could add another Clockwork, and drop everything on one turn potentially.", "label": 0}
{"text": "Uh question: does your irl name require letters to write it down?", "label": 0}
{"text": "Yeah ok but the priest one for an example  says: play all cards your opponent played last turn", "label": 0}
{"text": "I used to love Murloc decks! When the game was in its infancy, Murloc Paladins were the bomb.", "label": 0}
{"text": "It gives you a different hero power which can be good or bad haha", "label": 0}
{"text": "During the one tavern where your deck was all one card, I tried to do a mage oneshot with Sing-Along.. I had some reading comprehension issues. I thought it was doubling your hero powers each. \n\nThe issue I didn't have was annoying my opponent with \"AAAAAALLL RIGHT REPEA- AAALLLL- ALLLLLLRRRII- AAAAALRI-\"", "label": 0}
{"text": "Why is mc tech gonna be a big issue with starships?", "label": 0}
{"text": "It isn’t.", "label": 0}
{"text": "Find out in the patch notes coming on monday maybe", "label": 0}
{"text": "You can get a discount by buying the smallest runestones packs. The one that is 4.99$ for 500 Runestones saves you 1 cent compared to the 9.99$ for 1000 Runestones. \n\nNow all you gotta do is buy more and you can get yourself a pretty good discount. Lets say you buy 50 of the 500 Runestone packs you saved yourself over 10% of the next 500 runestone pack. \n\nIts easy really, the more you spend the more you save.", "label": 0}
{"text": "Very cool card design.", "label": 0}
{"text": "I do that on standard when i play highlander dh, Metamorphosis and best buddy can catch anyone unguarded", "label": 0}
{"text": "Well said.\nI came to say discover as well. It is them mechanic that made the game it is.", "label": 0}
{"text": "At least you can play around it.", "label": 0}
{"text": "Mark 🥰", "label": 0}
{"text": "Excavate and quick draw. Excavate is versatile and provides good value. QD is fun and forces decisions you aren't expecting when drawn.\n\nCorrupt is really difficult and forces poor play to execute", "label": 0}
{"text": "Why did Vader throw Palpatine down that giant hole in Return of the Jedi?", "label": 0}
{"text": "So if you Wheel of Death \\*after\\* Kil'jaeden, it destroys your deck of demons, right?", "label": 0}
{"text": "Exactly how I plan on playing it. Not exactly a fan of aggro, but I can get behind some \"clunk.\"", "label": 0}
{"text": "Aiv bin prunowsing it laik it waz speld. Ai blaym blizurd.", "label": 0}
{"text": "Rat + kill or speaker stomper or early beat down or etc", "label": 0}
{"text": "What are these \"build around this card\" threads lately.... Are they Blizzard's new AI bots?", "label": 0}
{"text": "are you guys getting paid for this work conversation?", "label": 0}
{"text": "Wait, I thought it was meme deck", "label": 0}
{"text": ">This is 100% your subjective opinion.   \n\n\nSo is yours, and yet here you are acting as if this is an objective topic and that you have an objective opinion.\n\n>I’m glad it works for you. But part of it is because you don’t know the difference between playing on an account that you haven’t mutilated for dust.\n\nNo, I do. While I prefer to \"mutilate\" my account for dust, I've also kept cards from classes I don't play that often post a rotation. Funny how you thought the reason I disagreed with you was due to some unknown knowledge I did not possess, that if I did have it I'd agree with you. I do possess it and I still disagree.\n\n>I’m also 100% sure that I’ve played on at least one of my accounts with a similar or lower engagement level than you on yours, and I know for a fact I didn’t need to main a class.\n\nGood for you. But perhaps you don't play the game the same way I do. Perhaps you don't want to try out dumb strategies that waste a ton of unnecessary dust. Because if you're f2p and don't play a lot, you likely can't complete a whole set, specially if you spend gold on cosmetics.\n\n>I’m also 100% sure that I’ve played on at least one of my accounts with a similar or lower engagement level than you on yours, and I know for a fact I didn’t need to main a class.  \n\n\nPerhaps this is the crutch that you're not seeing, it is not the fact that we NEED to main a class, is that we WANT to. I want every card of the classes I play, I can only get that in 3 ways: Either I buy enough packs to do so, gold and/or real money; either I am lucky and get the most expensive ones and craft the rest; or I dust cards I don't want and craft it.\n\n>Sure, I would have bias towards a class, but I also noticed that a lot of the decks I played on those accounts were the same decks I would have made on my main account\n\nWell good for you, for me that doesn't happen. If a new expansion drops and I want to try out the new toys but don't get them- I craft them. Sometimes the dust I gather is enough, sometimes it is not.\n\n>  \nAnyways, it always amazes me when people like you, with such limited experience, tell me they know better how it works, instead of asking how to achieve what I’m talking about while not increasing their playtime.\n\nCondescending much? Here's the reality, it is not really that big of a deal what I choose to do with my account, what I'm doing is not wrong no matter how much you cry that it is, because- it works, regardless of whether or not you agree with it.\n\nPerhaps it is not the most effective way, but it is A WAY.", "label": 0}
{"text": "No sets.", "label": 0}
{"text": "You have some skills my friend, I promise", "label": 0}
{"text": "Too weak for oger", "label": 0}
{"text": "Which one?", "label": 0}
{"text": "oh hey it's james sunderland", "label": 0}
{"text": "I like when things go boom.\n\nI dislike when people steal things that go boom. Out of my hand or deck.", "label": 0}
{"text": "I already opened the thread of this an hour ago but it looks like it was removed by mods?", "label": 0}
{"text": "Oh didn't realize, I checked to see if there was any thread on this but didn't see it. If you like I could delete it.", "label": 0}
{"text": "Battlecry: Limit your Opponent to 1 board space, 1 card in hand, 1 mana.", "label": 0}
{"text": "I usually open 40 packs and buy golden packs till I get the golden/signature legendary", "label": 0}
{"text": "I do have objective knowledge, because I tested this across multiple accounts with varying levels of engagement. \n\nI’m not sure why is this such a contentious point for you. \n\nYour way works for you, that’s fine. \n\nWhat I have a problem with, though, is telling people (especially newer players) that it’s the way to go. \n\nYou’re giving them bad advice, and lessening their game experience. \n\nJust because you want to and are fine with playing on a messed up account, doesn’t mean it’s good advice to give out. \n\nWhile I, on the other hand, am telling people that they can play whatever they want, without the need to shoehorn themselves into single classes.", "label": 0}
{"text": "One thaurissan tick on these bad boys makes it playable in one turn", "label": 0}
{"text": "nah no need to delete anything, I'm just trying to understand why my thread is not visible, at least yours is visible so let it stay so it can actually be seen by everyone.", "label": 0}
{"text": "Wow that's unfortunate. Hopefully blizzard goes back on this making its way into the game and gets them redone properly. Shame because I really liked these portraits.", "label": 0}
{"text": "I keep falling asleep sorry", "label": 0}
{"text": "I mean, they look good and it's their own IP. I see no problem here.", "label": 0}
{"text": "I'd expect it to still happen. I don't think they allow them early because they chose to, but because it's easier than doing coding to keep them out. That should still apply.", "label": 0}
{"text": "Why comment at all then?", "label": 0}
{"text": "I've been loving my Renothal Druid in standard this month. I've gotten 3k legend without grinding much with it on mobile. It definitely can take someone to top 100.\n\n### Hard wood\n# Class: Druid\n# Format: Standard\n# Year of the Pegasus\n#\n# 1x (0) Innervate\n# 1x (1) Cactus Construct\n# 1x (1) Giftwrapped Whelp\n# 1x (1) Go with the Flow\n# 1x (1) Magical Dollhouse\n# 1x (1) Malfurion's Gift\n# 1x (1) Miracle Salesman\n# 1x (1) Seabreeze Chalice\n# 1x (2) Cult Neophyte\n# 1x (2) Greedy Partner\n# 1x (2) Trail Mix\n# 1x (3) Frost Lotus Seedling\n# 1x (3) Gorgonzormu\n# 1x (3) New Heights\n# 1x (3) Prince Renathal\n# 1x (3) Splish-Splash Whelp\n# 1x (3) Swipe\n# 1x (3) Take to the Skies\n# 1x (3) Tide Pools\n# 1x (3) Tortollan Traveler\n# 1x (3) Trogg Gemtosser\n# 1x (4) Chia Drake\n# 1x (4) Cover Artist\n# 1x (4) Desert Nestmatron\n# 1x (4) E.T.C., Band Manager\n#   1x (1) Seabreeze Chalice\n#   1x (3) Rustrot Viper\n#   1x (10) Yogg-Saron, Unleashed\n# 1x (5) Greybough\n# 1x (5) Mind Control Tech\n# 1x (5) Mistah Vistah\n# 1x (5) Summer Flowerchild\n# 1x (6) Crystal Cluster\n# 1x (6) Gnomelia, S.A.F.E. Pilot\n# 1x (7) Marin the Manager\n# 1x (7) Owlonius\n# 1x (7) Sleep Under the Stars\n# 1x (8) Hydration Station\n# 1x (8) Rheastrasza\n# 1x (9) Fye, the Setting Sun\n# 1x (0) Zilliax Deluxe 3000\n#   1x (0) Zilliax Deluxe 3000\n#   1x (4) Virus Module\n#   1x (5) Perfect Module\n# 1x (10) Eonar, the Life-Binder\n# 1x (10) Reno, Lone Ranger\n# \nAAECAdfXAyiunwT9xAXg0AX93wWf8wXb+gWQgwaFjga7lQa/lQbBlQbXnAbYnAbanAbQngagoAaioAbHpAavqAbqqAbvqQaHsQaUsQarsQbDugbVugakuwaluwaBvwaFvwa6wQaAygbQygbzyga6zgb35Qb55Qbx5gbJ6Abh6wYAAAEGqZUG/cQFzZ4G/cQF9LMGx6QG97MGx6QGgb8G/cQF6N4Gx6QGAAA=", "label": 0}
{"text": "From the look of it, it wasn't done intentionally. Probably outsourced by some poor intern who's gonna be getting an earful on Monday, because shipping AI art would end up being PR hell and I'm willing to bet they know that.\n\nHopefully it'll then be pushed and replaced by another bunch of skins that I'm sure are already in the topstock. I'd 100% accept a delay if it means they're done right, and they'll probably end up even better. Hell, I've been patiently waiting for that Pride cardback that was leaked back in May.", "label": 0}
{"text": "I mean if people did not bat an eye and it looks good, why does it matter if it is AI or not. I think they look cool, even if AI made it they don't look less cooler now that I know it. Judge them by their quality not anything else ngl.", "label": 0}
{"text": "Tweeter found the artist’s work on insta and it portrays a LOT of traits common to AI art (weird fingers, obvious massive mistakes in continuity in an image, etc.). Given the provided proof, I am inclined to believe that the images are AI generated.", "label": 0}
{"text": "People are way too invested into whether some things are AI generated. I see more accusations of AI generated content that is not than I see accusations that turn out to be true.", "label": 0}
{"text": ":D", "label": 0}
{"text": "Then don’t buy it?", "label": 0}
{"text": "You could make it remove only enemy minions but limit both boards.\n\nSo if you have more than one they persist but u can't play new ones\n\nEdit: no wouldn't do shit your not playing minions anyway after and next turn is next turn", "label": 0}
{"text": "And those decks will dunk on star ships WAY more than reno warriors", "label": 0}
{"text": "Personally, I do not care if it's AI or not (Just like I'm not going to complain about people taking my job just because someone used chatGPT for coding or for writing a paper). And, while the skins are extremely generic pixel art, I do actually like them (although it's unlikely I'll pay for them in any capacity).  \n  \nThat being said, jf that dude didn't disclose it's AI-generated, then that's an issue.", "label": 0}
{"text": "Considering your comments I sincerely doubt it's the case for you", "label": 0}
{"text": "it depends which packs right. expansion and carchup packs can be opened now.", "label": 0}
{"text": "I literally use hipster in every deck", "label": 0}
{"text": "I’m just gonna take your word for it though. Fuck X.", "label": 0}
{"text": "They looked into the other art the \"artist\" posted and they have hallmarks of ai generated content, one example is a character holding a hammer over his shoulder and the part of the hammer behind him doesn't line up with where the handle would be. Another picture of a character whose cape pins are over the handle of an ax he is holding. \n\nThese are mistakes that a human artist (especially at this level of skill) would notice or not make", "label": 0}
{"text": "The only one used besides Firestone - [https://hsreplay.net/downloads/](https://hsreplay.net/downloads/)", "label": 0}
{"text": "Open a standard playing card pack, play all cards from it.", "label": 0}
{"text": "Gotcha, thanks! Twitter links have been difficult to access since the change in ownership", "label": 0}
{"text": "Just make it trigger battlecries and you're probably set.", "label": 0}
{"text": "Sanest reno hater right here\n\n![gif](giphy|bC9czlgCMtw4cj8RgH)", "label": 0}
{"text": "The problem is that they likely don't own the art that the ai model used to train (copy) from and it's also disingenuous to sell art saying you drew it when all you did was tell a computer to make it", "label": 0}
{"text": "My point is that many r/hearthstone users complain about the current art direction of the game, mistaking art style for theme", "label": 0}
{"text": "The guy who made these artworks, Trey Fore, seemingly uses AI when creating his artworks if you look at his other artworks on his different social medias.", "label": 0}
{"text": "Was replying to someone who deleted their comment but i’ll summarise for others what evidence was provided. \n\n- Found “Trey Fores” social media accounts, but he lacks any professional artist portfolio online \n- What he has uploaded, has lots of obvious discrepancies/errors in the artwork that a human simply would not make, especially a professional artist. \n- Some examples of errors are hands having different amount of fingers, items and objects phasing through clothing or parts of the body completely disappearing\n- His other limited artwork that has been posted used similar prompts for logos and profile pictures that have slight variations to them. \n- No WIP artwork shown anywhere, always the final product which isn’t necessarily listed in the proof but something I noticed. Not entirely proof in itself either which I understand. \n\nPut them all together, it’s pretty substantial evidence the person uses AI to generate the artwork. Last bit of note was Malfurion uses distinct tattoos / markings on his shoulders in all WoW artwork but the pixel image was completely incorrect and had circles. You’d think someone would do some research, especially a commissioned artist with reference pieces?", "label": 0}
{"text": "It wouldn't", "label": 0}
{"text": "Basically, the artist(Trey Fore) whom the art was likely commisioned from(No official confirmation, but exact same name and other works have the exact same style) claims to be a professional pixel artist for over 10 years. However, they have no past history, no earlier works, only a single easily faked process video, and basically just popped up out of nowhere. The real evidence though is that a lot of the pixel art that Trey has posted has a lot of suspiciously ai errors that basically no professional pixel artist at that level would ever make(Inconsistent number of fingers on each hand, inconsistent alignments, impossible positioning, etc.). \n\nOverall, its pretty clear that at the very least some other works of Trey Fore were ai-generated, and while there's no conclusive evidence that the ones specifically commisioned by Blizzard were ai-generated, the fact that there is no evidence of Trey Fore actually having a history as a pixel artist likely means that all of Trey's works, including the ones commisioned by Blizzard, are ai-generated. Note that blizzard likely had no idea that Trey Fore was using ai(seems like a massive PR headache), and instead got tricked by somebody who claimed to be a professional but was actually just using ai.", "label": 0}
{"text": "I don't think they should lie about being human made but I don't see any issue with using AI art in the game, do you agree?", "label": 0}
{"text": "I doubt Blizzard would actually go ahead and use the skins, it does not seem worth the PR headache of having to deal with AI controversy.", "label": 0}
{"text": "Insanely cute cart, love the blue and gold contrast too. Great job!", "label": 0}
{"text": "Thank you for your work", "label": 0}
{"text": "Had that also in the past. Maybe Reddit things", "label": 0}
{"text": "Agreed, I think there’s stigma about using powerful tools to automate a lot of stuff nowadays. I’d rather people learnt to use them well and be more efficient. Most people, including myself, haven’t fully grasped AI and been able to use it to its full potential.", "label": 0}
{"text": "so need to have less than 3 minion. easy one", "label": 0}
{"text": "It was likely more of using it as a pixel art filter than straight generation, looking at it.", "label": 0}
{"text": "I thought blizzard made a statement they dont use AI for their art ???", "label": 0}
{"text": "I personally don't care if this is AI or not. This whole AI art drama and \"AI steals jobs\" makes no sense to me. You realize when Blizzard commissions artist X to make a piece of art dozens of other artists lost that job right? It's the same thing. \n\nSecondly, everything here is their IP. They already bought the rights to the original art the pixel version is based on. So whether they use AI or not it doesn't matter cuz the art being copied is also theirs. \n\nAnd finally, we arent even sure this is AI art. Ive seen so many people claim something is AI when it isnt. For example Palworld Art and Sun Wukong art were claimed to be AI art when it turns out they werent.", "label": 0}
{"text": "Malfillidan? Top right", "label": 0}
{"text": "Putting an IP you own the rights to into the **prompt** side of the plagiarism machine doesn't remove all the plagiarism.", "label": 0}
{"text": "Looks like Maldivian with Illidan’s tattoos", "label": 0}
{"text": "It's decoration, not art. It isn't meant to communicate some grand point about humanity, it's meant to be a little picture next to y", "label": 0}
{"text": "Blizzard specifically tell all of their artists that the use of AI is strictly prohibited on the work they submit, this could play out interestingly. It's good for them that they haven't sold these yet", "label": 0}
{"text": "how many games?", "label": 0}
{"text": "The malfurion pic though appears to have illidan’s tattoos and shoulders. AI blended shit into the pic that shouldn’t be there", "label": 0}
{"text": "I personally find it distasteful not because of the fact itself that the art is AI, but that these skins will likely have the same price tag as other skins. AI art takes considerably less effort to make, and because they are the default class heroes, the skins will likely reuse voicelines as well. Just a super lazy money making tactic that I sincerely hope Blizzard didn’t realize beforehand.", "label": 0}
{"text": "Who fucking cares.", "label": 0}
{"text": "I would find it most likely that they have someone re-do them", "label": 0}
{"text": "if that happens, companies will hire people to make more images to train the systems on. \n\nBut most companies have the rights to the images they have trained on, at least in the most recent generation, and in a legal sense. Stock image sites in particular selling usage of their archives, which they have the rights to, is a big example, or people just not reading the terms and conditions 4 years ago.", "label": 0}
{"text": "To be fair, he probably has no star bonus and is a more casual player. Good for him!", "label": 0}
{"text": "If you took a second to read in depth you'd find that the person who generated the artworks very clearly obscures the fact that they create AI art and passes it off as their own work.", "label": 0}
{"text": "People were saying these skins looked amazing just a few weeks ago lmao", "label": 0}
{"text": "This is a major fuck up on Blizzard’s part. Nothing they’ve done has made me want to uninstall the game as much as this has.\n\nI can chalk this one up to them not knowing better, but if it happens again, even by accident, I’m 100% uninstalling with no hesitation.", "label": 0}
{"text": "I was so confused by thrall being shirtless but still wearing the rest of doomhammer's armor lol", "label": 0}
{"text": "Or classic pen and paper art when graphic design on pcs came about.\n\nIt’s a mockery of art!!", "label": 0}
{"text": "Deleted my account the other day so I can't even see the thread anymore. Gonna trust the summary at the top.", "label": 0}
{"text": "Oh yikes, really hope blizzard does something about this, so unfortunate since these were probably \"\"\"Made\"\"\" for the 30 year Warcraft anniversary...", "label": 0}
{"text": "Should cares if it's AI of there the best skins in the game?", "label": 0}
{"text": "Whoa! Jaina’s fingers! Not surprised and people will still spend money on it. The Bazaar beta starts 10/30", "label": 0}
{"text": "Elise fingernails 🥵", "label": 0}
{"text": "Apparently the whole thing is that blizzard didn't *know* they hired an AI prompter, they got got by a snake oil seller.", "label": 0}
{"text": "He is a karma farmer", "label": 0}
{"text": "I... Hope you're rage-baiting, sincerely", "label": 0}
{"text": "https://preview.redd.it/d7b2qkgus6xd1.jpeg?width=750&format=pjpg&auto=webp&s=325b7a42d620f072d7160049098f1179f5f2387f", "label": 0}
{"text": "I thought these things go through audits? Aren't these Blizzard IPs? You'd think this would've been caught before it's cleared.\n\nIf this was Nintendo, this wasn't seeing the light of day.", "label": 0}
{"text": "These skins and what they imply would've indeed be amazing, but yeah, this sucks.", "label": 0}
{"text": "someone made a summary here [https://www.reddit.com/r/hearthstone/comments/1gcwveh/comment/ltxcm94/](https://www.reddit.com/r/hearthstone/comments/1gcwveh/comment/ltxcm94/)", "label": 0}
{"text": "it's in the known bug list https://us.forums.blizzard.com/en/hearthstone/t/306-known-issues/136107", "label": 0}
{"text": "Throwing word soup in an argument won't make your point valid.", "label": 0}
{"text": "Honestly you could replace that with Reno or Reska pit boss and it’d make more sense. Amanthul also fits.", "label": 0}
{"text": "Anyone with more than 2 and a half braincells. Objectively mind you, I don't want you to think we are having an argument here.", "label": 0}
{"text": "13-12 november i think", "label": 0}
{"text": "(Minions)", "label": 0}
{"text": "You should take moderator action, this thread has insane blatant witch-hunting calling people to stalk and harass an artist who isn’t even the name in the client, it is just a similar name (even if it was the same name it is still against reddit TOS but this is even worse)", "label": 0}
{"text": "I wrote alr, that u whould need 1 Coin to get 11 Mana to play Cal and the 3 Mana Spell, but the best whould be Multible discounts to do it way sooner", "label": 0}
{"text": "But that's a different issue. Blizzard can use stuff that \"no one was bothered to make\", while paying employees and artist more (since AI make them more money).", "label": 0}
{"text": "But what's the issue here ? As long as Blizzard artist are still paid there is no problem.", "label": 0}
{"text": "War Within Thrall exists.", "label": 0}
{"text": "Ooof… was gonna buy … pass", "label": 0}
{"text": "Because art is a human endeavor that should be reserved for humans who gain livelihoods and joy from it and not be given to machines that gain nothing from it and hurt people?", "label": 0}
{"text": "Witch-hunting? Where is the call to \"stalk and harass\" that you're talking about? I read the whole thread on X and there was none of that, neither in OP's post which is just just a link to the X thread.", "label": 0}
{"text": "It can work with final showdown for discounts instead of using the coin, you can swap the combo from the for that one instead.", "label": 0}
{"text": "And you don't think the same applies to AI? Anyone can snap a picture by pushing a button, and anyone can make an AI image by pushing a button, but both require additional knowledge to use in a more complete way, and get good results from.", "label": 0}
{"text": "they should tradable him in for a better artist agagagaga", "label": 0}
{"text": "This is 100% the meta. Get used to it. The issue is probably at its worst ever.", "label": 0}
{"text": "Dude photography is literally another art form. There are still painters. What the fuck are you on about? People weren’t replaced with machines, it was just other people.", "label": 0}
{"text": "I love thief rogue (especially the spectral cutlass version) - so I’d have to say generating random cards from other classes.", "label": 0}
{"text": "> Some examples of errors are hands having different amount of fingers, items and objects phasing through clothing or parts of the body completely disappearing\n\nHave any artist ever drawn the wrong amount of fingers on accident, and only realised after the drawing is complete? I know hands are hard to draw and I'm not saying artists can draw them like that but that mistake seems really hard for a human to overlook in the whole process", "label": 0}
{"text": "True, but these skins are meant to give throwback vibes, based on their designs, names and descriptions. So, doing that variant of thrall wouldn't fit.", "label": 0}
{"text": "Good for them.  Making something of value people want.", "label": 0}
{"text": "This isn't even mildly contrarian among normal people outside of Reddit.\n\n\nThe reaction almost everyone has the AI is \"Yeah, that's pretty cool.\"", "label": 0}
{"text": "Get this to the front page. No shame.", "label": 0}
{"text": "Jaina has a massive neck", "label": 0}
{"text": "Speaker cost 4, Rat cost 2. He has already buffed minions the third move.", "label": 0}
{"text": "And yet we see a lot of people not using AI to achieve good results, just \"good enough\" which is a different thing. I do agree that prompts themselves are skillfull and might even develop as an artform themselves because thats where expression lies.\n\n\nPictures achieve a different role than portraits. At most people use portrait pictures as profile pictures or similar. Pictures you hang around your house tend to be family and moment focused, something painters couldn't truly achieve on the same level as the skillset lies elsewhere. Pictures became a new thing.\n\n\nI know art will not die regardless of the AI onslaught. As long as one kid is doodling in a notebook then art is alive. However, the commodification and mass production of static images does cheapen and dilute the medium and delivers a heavy blow to art itself. On a game like these, if the card artists were hypothetically gone, who's next? Music, sound, VFX, card designers?", "label": 0}
{"text": "Man this is sad af cause the DK skin is prob the greatest skin ever. Now not so much. Fuck.", "label": 0}
{"text": "This seemed pretty obvious from just looking at the portraits", "label": 0}
{"text": "(27/27)(2/28)(3/29)(4/30), which is about 0.1% of the time and is expected to happen once every 1,015 it's played in turn 1 (going first)\n\nFour cards are shuffled into the deck. The first one goes wherever and doesn't matter. The second has to be directly before after the first card (2 spots), the third has 3 spots it can go, and the last has 4 spots. On turn 1 you have 4 cards in hand so 26 cards in your deck. The chance increases when you play the card with less cards in your deck.", "label": 0}
{"text": "I would wait on the standard packs and catch up packs until the new expansion is out. Catch up packs can have cards from any other expansions in the current cycle, and have more cards in them based on how many you're missing, which is generally why you always want to open those first", "label": 0}
