{"text": "Junkie who died of a drug overdose?", "label": 1}
{"text": "I get people love Mac....but it's what happened, isn't it?", "label": 1}
{"text": "Democrats worship criminals", "label": 1}
{"text": "Is this AI?", "label": 1}
{"text": "Basically never watch baseball but tuned in last night bc LA gotta support LA and damn .", "label": 1}
{"text": "I like the NC state fair", "label": 1}
{"text": "I tried watching the office Australian reboot last night but it wasn’t it. It tried too hard to be the original and I was kind of hoping for a completely fresh take. Jokes were kinda slow to figure out too", "label": 1}
{"text": "Why the fuck is every single post on advice animals about American politics? What sub can I go to for regular silly memes?", "label": 1}
{"text": "Not trying to be funny, but for the first time in my life, I found out Taylor Swift uses profanity in her music. My girl was playing one of her songs & I heard her say the f-word & I was like “the fuck ?”\n\nit ain’t even sound right. obviously i don’t give this lady much play in my free time but damn. when taylor get cut like that", "label": 1}
{"text": "Lmao you like that homo music?", "label": 1}
{"text": "Damn You're actually retarded. I've had more in-depth convos with brickwalls", "label": 1}
{"text": "You called another man gorgeous and said he has a sexy accent… since you wanna go through each others account history . Not surprised you listen to this sissy.", "label": 1}
{"text": "aye, look at this wannabe tough guy lol", "label": 1}
{"text": "What about my comment made it seem like I’m a “wannabe tough guy”?", "label": 1}
{"text": "I’m comfortable in my sexuality, I’m just not a batty boy. That’s not how we operate in my culture .", "label": 1}
{"text": "> You called another man gorgeous and said he has a sexy accent… since you wanna go through each others account history . Not surprised you listen to this sissy.\n\nso... everything?", "label": 1}
{"text": "How 🤨? Anyways have a good day, not gonna argue with batty boys.", "label": 1}
{"text": "> batty boys.\n\n🤓", "label": 1}
{"text": "Good on you to edit your comment cause you made no sense . Anyways how am I stanning for Drake ? Literally got 1 post in his sub.", "label": 1}
{"text": "> Ngl I REALLY hate this guy 😒😒 and fuck SZA too\n\nyeah, very normal reaction, totally not stannish", "label": 1}
{"text": "Yeah, sure", "label": 1}
{"text": "Who said confusing? Try tryhard or pseudointellectual 🤡 tyler the fairy boy fans", "label": 1}
{"text": "Again, who said hard? Reading comprehension on reddit is at an all time low thanks to idiots like you, exactly why people should stop tryharding with their thesauruses 🤣", "label": 1}
{"text": "It's crazy to me to see someone say offensive shit and blame it on their culture, but decide to be ignorant anyways, call people slurs, and just be all around homophobic. You realize you don't HAVE to be hateful just because your culture, right?", "label": 1}
{"text": ">I’m just not a batty boy. That’s not how we operate in my culture .\n\nOh, look at this straggot!", "label": 1}
{"text": "Again nothing hateful.", "label": 1}
{"text": "That's just how we operate in our culture :)", "label": 1}
{"text": "That’s hateful ?", "label": 1}
{"text": "It’s slang for homosexuals not a slur, why are you trying to educate me about my language/culture? You can google the meaning all you want but you don’t understand .", "label": 1}
{"text": "What is a slur but offensive slang? I'm trying to educate you on the words you're using. Most slurs jump cultural lines as people find new ways to voice their perceived superiority over minorities, whether that be from skin color, religion, orientation, or gender. Just because it's from your culture doesn't mean it isn't offensive. I grew up around people saying the N word offensively, the type to consider the rebel flag part of their culture. A culture of supressiving black people for centuries. Because their ancestors said it, does that make it any better?", "label": 1}
{"text": "yo pussy mid", "label": 1}
{"text": "I spent 100s of hours in that game. Have fun", "label": 1}
{"text": "This is not where I expected to see that news. That game deserves better than the Wii U. Makes me wanna replay the 1st one", "label": 1}
{"text": "I turned on my modded Wii U for the first time in ages last night to redownload Pikmin 3 for my wife. XCX was the last game I bought for it but never finished because the graphics and performance on WiiU were so bad compared to other games I was playing at the time", "label": 1}
{"text": "yeah this is heat..", "label": 1}
{"text": "I’m convinced this man is a homosexual. No way you would give up your freedom to go back to prison.", "label": 1}
{"text": "Shoot *in* you allegedly", "label": 1}
{"text": "You should start visiting other subs and leave this one alone my guy. My little poney is waiting for you. Then you can go to bed lil 😇", "label": 1}
{"text": "Carti hate exists on every thread what are you talking about?? Yes I'm a fan, fans don't give af about the criticism that comes from little men like yourself. Wake up and take a hike", "label": 1}
{"text": "Idc still my goat he aint beat me idc", "label": 1}
{"text": "\\> What a fucking idiot, he only had 6 months left.\n\nYou say that like this is all he did. This is all he got caught for.\n\nWhat you think he did on that trip to Vegas, play penny slots?\n\nThis is his lifestyle. Not a few bad decisions he got caught for.", "label": 1}
{"text": "Here we go with fishing for likes with the man bashing. Statistically, females are more likely to lie in a man than to actually be raped. It's like how LESBIANS are more likely to experience domestic violence than straight women, but no one talks about it because there's no man blaming angle.", "label": 1}
{"text": "Certified banger..", "label": 1}
{"text": "ohhh I need this", "label": 1}
{"text": "Am afraid the weeknd is gonna miss with this album for the first time in  his career  \nThe Noise era is better than this shit", "label": 1}
{"text": "Actually his best review in a while IMO, very measured and I like his takes which I often don't. Personally, I don't think its the most inspired Tyler album but I'm still enjoying it a lot.", "label": 1}
{"text": "Kanye, N.E.R.D, Rihanna, and Lupe Fiasco. 2008 Glow In The Dark tour. It was insane. I was only 10 years old, but remember being absolutely stunned.", "label": 1}
{"text": "Lucci gone be out first", "label": 1}
{"text": "Everyone's here from *Euphoria*, but the true fans are back from the greatest 2K of all time, 2K17! I miss those days! 🔥🔥", "label": 1}
{"text": "Hip hop wasn't made to tear us down, it was created to lift us up!", "label": 1}
{"text": "Whenever there's a piano or acoustic guitar beat, the song instantly turns up the heat! 🔥", "label": 1}
{"text": "Jeff is so back", "label": 1}
{"text": "Leland Wayne is a fucking lame so we knew he had to be an influence.", "label": 1}
{"text": "Them niggas just had a plan and finally found a way to rope him into it", "label": 1}
{"text": "I don't think its the vocal or the screaming/(flute) at least for me, Its that the Drums aren't mixed right. \n\nkick dont hit in the low end and the snare is to mid to add to it they aren't even loud enough.", "label": 1}
{"text": "This really cute and tiny lady ripped the loudest fart I ever heard. Whoever wifes her up a boss", "label": 1}
{"text": "Whats the context here?", "label": 1}
{"text": "Why is she associating herself with a masculine hood rat and another masculine hood rat who bragged about raping and robbing men with her trans coworkers? Lol this actually cheapens her brand.", "label": 1}
{"text": "Idk why people tell me to vote. I’m not voting for neither\n\nTrump is a clown that has some kind of weird connections too Epstein… \n\nAnd Kamala just has other celebrities who has some kind of strange connections to Diddy like Usher and JLO\n\nShe needs to fix her PR team because I don’t think it’s a good idea to have Cardi B of all people…\n\nLiterally admitting in the video that she would robbed drug in r*pe men\n\nYa I’m waiting for this election to be over", "label": 1}
{"text": "ngl man I'm seeing bad takes back to back to back from you", "label": 1}
{"text": "So many legitimate reasons not to vote for Kamala and you listed 0 of them", "label": 1}
{"text": "third party exists ", "label": 1}
{"text": "Trump is the police. Kamala is the closest we're getting to a third Obama term. There's no discussion to have here. Either you support Kamala or you can fuck off", "label": 1}
{"text": "I always considered Relapse the first of the \"new Eminem\" albums but I think mainly because of We Made You", "label": 1}
{"text": "Let’s get this on repeat and elevate the vibes", "label": 1}
{"text": "I love Drake’s music, so I’m subscribed to /r/Drizzy\n\nIt’s so stupid how everyone there is acting like Drake is some badass.", "label": 1}
{"text": "\"Usin' numerology to count the people I sent to Heaven\nProduces more digits than 22 divided by seven\" \n-immortal technique on dance with the devils hidden track\n\n\nThe whole track is 💯\nhttps://youtu.be/A0Nlbz4ow6E?si=GiQp47Pt7yMflunt", "label": 1}
{"text": "forgot about   \nGraduation Day · Kanye West (The College Dropout)", "label": 1}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [O.C. - Word...Life (Remix)](https://music.apple.com/us/album/word-life-remix/908657410 \"Confidence: 100%\")\n\n\\[Bandcamp]: [O.C. - Word...Life](https://omarcredle.bandcamp.com/track/word-life?from=search&search_item_id=1617778095&search_item_type=t&search_match_part=%3F&search_page_id=3827789892&search_page_no=1&search_rank=8&search_sig=7dedd64855722adceac88a07a48de724 \"Confidence: 100%\")\n\n\\[Deezer]: [O.C. - Word...Life](https://www.deezer.com/track/1358703082 \"Confidence: 100%\")\n\n\\[Soundcloud]: [O.C. - Word...Life](https://soundcloud.com/oc-official/word-life \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/o.c.%20word...%20life) || [Apple Music](https://music.apple.com/us/search?term=o.c.%20word...%20life) || [Amazon](https://music.amazon.com/search/o.c.+word...+life) || [Bandcamp](https://bandcamp.com/search?q=o.c.+word...+life&item_type=t) || [Deezer](https://deezer.com/search/o.c.%20word...%20life/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=o.c.+word...+life) || [Tidal](https://listen.tidal.com/search?q=o.c.+word...+life) || [YouTube Music](https://music.youtube.com/search?q=o.c.+word...+life)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 1}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Smoke DZA & Benny The Butcher - Statue of Limitations](https://open.spotify.com/album/17rPZ8BYMT9wRKOORSjy2C \"Confidence: 97%\")\n\n\\[Apple Music]: [Smoke DZA & Benny the Butcher - Statue of Limitations - EP](https://music.apple.com/us/album/statue-of-limitations-ep/1504584352 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Statue of Limitations – Smoke Dza, Benny The Butcher -- uploaded by Stoned Straight](https://soundcloud.com/peerless_fearless/sets/statue-of-limitations-smoke \"Confidence: 97%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/smoke%20dza%20benny%20the%20butcher%20statue%20of%20limitations%20ep) || [Apple Music](https://music.apple.com/us/search?term=smoke%20dza%20benny%20the%20butcher%20statue%20of%20limitations%20ep) || [Amazon](https://music.amazon.com/search/smoke+dza+benny+the+butcher+statue+of+limitations+ep) || [Bandcamp](https://bandcamp.com/search?q=smoke+dza+benny+the+butcher+statue+of+limitations+ep&item_type=a) || [Deezer](https://deezer.com/search/smoke%20dza%20benny%20the%20butcher%20statue%20of%20limitations%20ep/album) || [Soundcloud](https://soundcloud.com/search/albums?q=smoke+dza+benny+the+butcher+statue+of+limitations+ep) || [Tidal](https://listen.tidal.com/search?q=smoke+dza+benny+the+butcher+statue+of+limitations+ep) || [YouTube Music](https://music.youtube.com/search?q=smoke+dza+benny+the+butcher+statue+of+limitations+ep)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 1}
{"text": "Just saw a post abt 50+ children being killed in the same town in Gaza in the span of 48 hours and one comment just said “hang in there!”\n\nThe internet is such a weird and surreal place sometimes", "label": 1}
{"text": "Cheek Mill", "label": 1}
{"text": ">My English teacher wanted to have sex in junior high The only problem was my English teacher was a guy\n\nThis isn’t actually the version that appeared on the album when it was first released, rather its the first revision, the version that was released for the single. Which is why it breaks the flow and sounds clunky.\n\n>My English teacher wanted to flunk me in junior high Thanks a lot, next semester I’ll be 35\n\nAnd this was the radio version of the single. \n\nThe original version that featured on the album when it was released was this\n\n>My English teacher wanted to fuck me in junior high The only problem was my English teacher was a guy", "label": 1}
{"text": "Allow politics posting for one day you cowards", "label": 1}
{"text": "I promise y’all, I will NOT fumble this bad bitch who’s obviously into me. I’m standing on business 😤", "label": 1}
{"text": "Where's this quote from? I googled it, nothing came up.", "label": 1}
{"text": "Has it been the same jury members since the start? Are they being paid/excused from work? How long are their days while sitting in the courtroom. FREE THUG!", "label": 1}
{"text": "Calling EA1 “groundbreaking” is patently absurd.", "label": 1}
{"text": "Cry more I love the taste of your tears", "label": 1}
{"text": "😃", "label": 1}
{"text": "She's gotta be done in politics at this point. Where do you go from here?", "label": 1}
{"text": "USA USA USA!!!", "label": 1}
{"text": "Maybe it’s because you’re the one with the warped perception of reality.", "label": 1}
{"text": "Awe you’re so mad", "label": 1}
{"text": "Not reading all that", "label": 1}
{"text": "Hey don’t forget your “remind me” for when kamala wins 💄🤡", "label": 1}
{"text": "Just don’t want to. There’s a difference cuck", "label": 1}
{"text": "Ima be real the grip Joe rogan / Elon have on general public is insane and worrying it’s not just terminally online people it’s been mainstream. I’ve always blocked it off my mind but", "label": 1}
{"text": "Ima be real the grip Joe rogan / Elon have on general public is insane and worrying it’s not just terminally online people it’s been mainstream. I’ve always blocked it off my mind but", "label": 1}
{"text": "😂😂😂 your the clown who set a remind me😂😂😂\nPut your makeup on 💄🤡 #47DJT", "label": 1}
{"text": "I’m trying to find out as well. It’s such a good track 😔", "label": 1}
{"text": "extreeeeemely underrated album, absolutely phenomenal", "label": 1}
{"text": "Fr they're always in sync with their drops. Their chemistry is unmatched too", "label": 1}
