{"text": "Yeah one of my favorites on there. Any idea why they took it off?", "label": 0}
{"text": "This is great to hear.. I’ve had to see people in the film subs ask “Who cares about Pharrell Williams? What’s he done to deserve a biopic?” Shits been crazy to see - so I’m glad it’s good.", "label": 0}
{"text": "That’s the first time I’ve ever ds2 spelled out", "label": 0}
{"text": "I saw a page on Twitter that posted side by side metrics of the two. Obviously it was wrong or outdated. Thanks for clarifying. 😊", "label": 0}
{"text": "Nah they probably will give it to him. He’s on the Eldridge payroll and now he has a stake in gamma, which is why to me his accolades don’t really count and probably haven’t done for a very long time.", "label": 0}
{"text": "might be lady gaga. we all know kanye is top 3 but the controversies had put him at #7", "label": 0}
{"text": "Weeknd is kinda crazy low, given the run he’s had. You could argue he’s above Kanye, and before you argue, consider his discography, he has:\n\n- Blinding Lights\n\n- The Hills\n\n- Earned It\n\n- Take My Breath\n\n- Save Your Tears\n\n- Die For You\n\n- Often\n\n- Can’t Feel My Face\n\n- Starboy\n\n- Crew Love\n\n- I Feel It Coming\n\n- Wicked Games\n\n- Low Life \n\n- Or Nah (Remix)\n\n- Sacrifice\n\n- Call Out My Name\n\n- In The Night \n\n-  Secrets\n\n- Reminder \n\nAnd those are just the familiar ones that did well on the charts/streams, he’s not even 15 years into his run", "label": 0}
{"text": "I have Lady Gaga there so you’d have to replace Selena with someone else.", "label": 0}
{"text": "Em shoulda been top 5 lmao", "label": 0}
{"text": "Ima need a link for that my boy", "label": 0}
{"text": "He did not seem uncomfortable at all lol. He was pretty into it. I don't see anything wrong with that though. I would be into two girls fucking each other in front of me too. Who wouldn't?", "label": 0}
{"text": "You’re good. There was no reason whatsoever for me to get testy, I’m sorry about that.", "label": 0}
{"text": "This is surprising to you? It blows your mind that two women would engage in sex acts in front of a rich man?", "label": 0}
{"text": "Even if the quality of his music has deteriorated significantly imo, Drake’s brand has only expanded in scope year-by-year, and he’s easily the biggest individual distributor of rap music. So Top 5 makes sense", "label": 0}
{"text": "He fell off so hard.", "label": 0}
{"text": "Really digging this project. Best Benny drop since TT4 imo", "label": 0}
{"text": "Freestyle can be off top or it can be just some general bars w no real direction.  It’s been this way for literally decades.", "label": 0}
{"text": "What's surprising to me is that Jay-Z was uncomfortable by them doing that. Felt like that should have been obvious, but here we are.", "label": 0}
{"text": ">But how they portray themselves makes me agree that its a safe bet that they are both terrible\n\n\n\n\nI guess , rappers are typically assholes. So they would fit in line with most.", "label": 0}
{"text": "lol yup pretty much their shitty case in a nutshell.  fuk is that evidence of?", "label": 0}
{"text": "Proud of him. Thanks to the Lord.", "label": 0}
{"text": "They aren’t even in order as far as I can figure out so good on you for stopping lol", "label": 0}
{"text": "It’s not a conspiracy.\n\nHe has a stake in gamma, which is why he was promoting SexxyRedd so heavily. Mal kept bringing it up. Same thing with 4batz, he was a gamma artist contracted for one mixtape under OVO.\n\nHe even mentions getting Larry Jackson on the phone (former CEO of Apple Music and current CEO of gamma) for some ownership on a song.\n\nDrake and Larry Jackson have a very strange relationship in business as he was brand ambassador for Apple. He broke records that don’t really seem plausible with Views, considering it was released on a userbase of less than 22M people worldwide.\n\nTodd Boehly owns Eldridge Industries, which owns billboard, luminate (FKA Nielsen Music), multiple other music publications, and is one of the main investors in gamma. Eldridge also partners with Sony, UMG and many other big companies in the music industry.", "label": 0}
{"text": "It's not visible or listed as existing anywhere on the site. It may still exist in hidden form on the Archive's servers somewhere, so it's possible that it's not permanently lost, but there's no public access to it at all so we can't know that it's still there. And if the Archive went down it'd be gone entirely.", "label": 0}
{"text": "I was wearing a \"Free Thug\" shirt, and no shit someone asked me if it meant I was \"a Thug for free.\" I couldn't even comprehend what they were trying to say. Apparently, they thought \"thugs\" charge for their services? Maybe they do? I told them he was the guy in that \"Havanna oh na na\" song, and they had the smallest sense of recognition. You're right - Most people outside of the hip hop community don't even know who he is, let alone the least thing about this farce of a trial. I'm not even saying he's innocent of all charges because I wouldn't know, but the way this trial has been carried out is insane. Imagine the money the state has spent on all this.", "label": 0}
{"text": "some people dont have a choice, and n95s work, you make it seem like an odd thing", "label": 0}
{"text": "????????????????????????????????? amine is goated", "label": 0}
{"text": "Turn religious when your karma is haunted", "label": 0}
{"text": "🔥🔥🔥🔥🔥🔥🔥", "label": 0}
{"text": "Mass deportation is for illegal immigrants.", "label": 0}
{"text": "Psychopaths don’t form emotional attachments 🙂. They’re incapable of feeling any real emotions actually. Also I noticed people who hate an artist don’t care to fact check every allegations that come their way. Why would you? It’s not your job to investigate his life you ain’t getting paid to prove the man is right or wrong. Those allegations you said happen in July I remember each them. A few of them were discovered to be lies told by people that were trying to get in his circle but denied. Yes celebrities get lied on even the ones who committed domestic abuse. Not every women that screams Chris hit me is some damsel in distress. There’s maybe one or two women we know he had put his hands on for sure in the past that he admitted to. Like I truly get disliking somebody for what they stand for but a psychopath is a big thing. That’s not a term I throw on people especially celebrities who we only know what the media shows us. As for diddy and R Kelly that term fits well. As many people who worked with them personally noted their psychopathic tendencies. But hey if Chris gets a true documentary about him and get locked up for years ill admit it in my soul what he truly is 🤷🏾‍♂️", "label": 0}
{"text": "just heard the song today 2024. its a good track but these folks mustve been hard blind by lost boy expected every song afterwards to be goat shit...", "label": 0}
{"text": "This is no defense of Durk, but this is the result of being a dead man walking. These lil niggas are devoid of life. They have experienced so much loss that they can only think of revenge and blood thirst. It pains me to see so many young black boys crumble to this violence. I see a boy (not a man) who is crying inside. After seeing what they come from and experience how can you truly heal? It’s an uphill climb. Doesn’t excuse his involvement but all these yn are dying inside.", "label": 0}
{"text": "Amine always seems to be part of these exciting collabs but then he's the worst part of them unfortunately. Katramine should've banged", "label": 0}
{"text": "What an absolute embarrassment for the State of Georgia.\n\nIt is insane that someone can be in prison without bail while not yet convicted of a crime and the crimes they are accused of were not directly committed by them.", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [Wicca Phase Springs Eternal - My Name Is The Endless Night](https://music.apple.com/us/album/my-name-is-the-endless-night/1766293250 \"Confidence: 100%\")\n\n\\[Bandcamp]: [WICCA PHASE SPRINGS ETERNAL - MY NAME IS THE ENDLESS NIGHT](https://wiccaphase.bandcamp.com/track/my-name-is-the-endless-night?from=search&search_item_id=830638426&search_item_type=t&search_match_part=%3F&search_page_id=3805377762&search_page_no=1&search_rank=1&search_sig=b14bffd0f550b7af18232ac3ac24b8cc \"Confidence: 100%\")\n\n\\[Deezer]: [Wicca Phase Springs Eternal - My Name Is The Endless Night](https://www.deezer.com/track/2983076781 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Wicca Phase Springs Eternal - My Name Is The Endless Night](https://soundcloud.com/wiccaphasespringseternal/my-name-is-the-endless-night-1 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Apple Music](https://music.apple.com/us/search?term=wicca%20phase%20springs%20eternal%20my%20name%20is%20the%20endless%20night) || [Amazon](https://music.amazon.com/search/Wicca+Phase+Springs+Eternal+my+name+is+the+endless+night) || [Bandcamp](https://bandcamp.com/search?q=wicca+phase+springs+eternal+my+name+is+the+endless+night&item_type=t) || [Deezer](https://deezer.com/search/wicca%20phase%20springs%20eternal%20my%20name%20is%20the%20endless%20night/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=wicca+phase+springs+eternal+my+name+is+the+endless+night) || [Tidal](https://listen.tidal.com/search?q=Wicca+Phase+Springs+Eternal+my+name+is+the+endless+night) || [YouTube](https://youtube.com/results?search_query=Wicca+Phase+Springs+Eternal+my+name+is+the+endless+night) || [YouTube Music](https://music.youtube.com/search?q=Wicca+Phase+Springs+Eternal+my+name+is+the+endless+night)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "I mean almost all of that is irrelevant to me anyways lmao don't care if he's a \"snitch\" or not, I'm not 14 and he's just a random YouTuber. Same with gang \"politics\". More than anything it's just the weirdness and his fans always insisting how much \"research\" he puts in.", "label": 0}
{"text": "you're a fucking idiot if you think Jay Z didn't know what was going on. These people all talk to each other and hang out on the reg dumb ass nigga", "label": 0}
{"text": "Out of the loop, did Gunna snitch on Thug?? Are they on good terms??", "label": 0}
{"text": "pre-ordering a Cordae album is crazy. The Lost Boy is fire but Bird's Eye View was a dud. This next album will make or break him", "label": 0}
{"text": "Yall the O block 5 still didn’t even get sentenced yet 😳😳😳😳\n\nNow this happens 😳😳😳", "label": 0}
{"text": "Transformers One", "label": 0}
{"text": "Needless to say, HE DID “slide” 4 Vaughn then?!?🤷🏽Shii crazy.", "label": 0}
{"text": "Tim has 5 bodies buddy", "label": 0}
{"text": "Why are y'all so desperate to defend sus behavior like that, y'all weird.", "label": 0}
{"text": "The last couple seasons have been a lot better, not as good as the first couple though", "label": 0}
{"text": "Bashfortheworld hard too", "label": 0}
{"text": "i want another \"lets go\" type of song from him", "label": 0}
{"text": "yikes.....almost like music is subjective", "label": 0}
{"text": "All My Life hitting different now. Wonder what Cole thinks.", "label": 0}
{"text": "My usual process of trying to take in new music is adding every new album to a playlist that I've listened to front to back once to then listen on shuffle but I found I wasn't enjoying a lot of what came out this year with many albums being bloated with mid imo. \n\nAt this point I tried to narrow things down to a much shorter [Favorite albums of 2024](https://open.spotify.com/playlist/1TCp1DSPBovO2MH44RAY7a?si=c708982368f04fbb playlist) that I'm going to focus on now for the rest of the year. Based on what I added already, are there any albums from this year I'm overlooking or should revisit to consider adding to this?", "label": 0}
{"text": "i never said i was offended i was just pointing out that you didn’t refute his point at all and that your type of comment is stupid. really odd that you keep stepping aside the convo", "label": 0}
{"text": "I didn’t actually pre-order it.\n\nI just go through the iTunes preorder page like once a week to see if I need to add anything to my music release note. ", "label": 0}
{"text": "in YOUR opinion", "label": 0}
{"text": "vlad said there’s flight records of all 5 dudes going in & out of town at the same time dude was marked… \n\nif they can prove he hired them, sheesh… that’s a wrap for durk", "label": 0}
{"text": "If only there was a song to explain his opinion on the matter", "label": 0}
{"text": "haven’t paid attention to or cared about a ye record in 3 album cycles, finally free bois 🥲", "label": 0}
{"text": "So much for innocent until proven guilty", "label": 0}
{"text": "Cole is pussy who cares what ge thinks", "label": 0}
{"text": "they been had their heads up his ass way back since DAMN. He is like their actual prophet", "label": 0}
{"text": "Gonna say how he had talks with bro", "label": 0}
{"text": "Should’ve been top 5. & no Frank Ocean on this list? 🚮 basura", "label": 0}
{"text": "Every hip hop artist that gets the key promptly gets it taken away. But Durk managed it in like 48 hours lmao", "label": 0}
{"text": "The feds said they have texts from Durk saying don't book anything is his name. And he was trying to fly to Italy. From what I've seen, this is a terrible charge to fight since someone actually died and since they traveled across state lines. Don't think money can get him out of this one.", "label": 0}
{"text": "getting renegaded by Doechiii on an upcoming song", "label": 0}
{"text": "I think it’s more that his whole thing is that he’s a gangsta, so we all believe him and therefore that he might’ve done it", "label": 0}
{"text": "It's alright", "label": 0}
{"text": "No one said that", "label": 0}
{"text": "bet I didn't think you did and was just generally poking fun at the idea of someone pre-ordering his album with how the last flopped", "label": 0}
{"text": "Cole can both be pussy and durk can still be a detriment to his city.", "label": 0}
{"text": "3 days ago\n\nhttps://chicagodefender.com/lil-durk-honored-with-keys-to-the-city-hosts-prayer-event-and-near-sellout-concert/?amp=1\n\nToday\n\nhttps://www.hotnewhiphop.com/854352-lil-durk-loses-city-key-hip-hop-news\n\nLife comes at you fast 😭", "label": 0}
{"text": "Mac miller died before they could take his key away", "label": 0}
{"text": "Lil durk tried to flea he’s beyond cooked", "label": 0}
{"text": "Facts", "label": 0}
{"text": "I like Durk‘s music and I can’t be the one to judge whether his recent stance regarding Chicago politics is genuine but still, giving him the key to begin with is crazy given the scope and history of his music and gang", "label": 0}
{"text": "He still got the key to the streets.", "label": 0}
{"text": "This story hits home, doesn’t it?", "label": 0}
{"text": "Rappers don’t care as long as they’re getting paid.", "label": 0}
{"text": "I wonder if he used the key to the city for the killings? Maybe he lent it to the killers so they could access locked areas??", "label": 0}
{"text": "I get that drill rappers aren’t known for their intelligence, but how fucking braindead do you have to be to pay for a hit on a company credit card? Especially when you already have a microscope on you??\n\nIt’s not like these guys don’t have the money and resources to cover it up properly.", "label": 0}
{"text": "Why would Pitt take Mac’s key away..?", "label": 0}
{"text": "I could give yall a million reasons why I think Andre 3000 is the GOAT\n\nOne of those reasons is his ability to us the weirdest flows/rhyme schemes, that shouldn’t work on paper, but he executes flawlessly.\n\nAnd the uniqueness of his schemes, while remaining smooth, just make them hit that much harder.\n\n🐐", "label": 0}
{"text": "Great cover, looking forward to checking this out.", "label": 0}
{"text": "I liked Donda tbh. Vultures 1 was mid and 2 was dumpster juice and it's clear the guy had 0 drive, passion or effort to create good music. Straight up lazy as fuck, scatter brained and all over the place. \n\nBut before when he was medicated, calm and focussed he made Ye (which i actually like), KSG and Daytona. So I always have some kind of hope remaining and will check out the album anyway.\n\nTHAT BEING SAID if this solo release is some stinky gooch sweat then im officially out", "label": 0}
{"text": "hard drugs are a great influence on the youth of a city I’m sure", "label": 0}
{"text": "He’s like nauseatingly lame at this point, I don’t ever wanna hear him rap about no “throne”, “crown”, or “big three” ever again", "label": 0}
{"text": "But aren't we all though? Aren't we all just trapped behind our little screen because we're afraid of the real work and afraid what people would think of us in real life? Maybe Mr. Castanza was right. Maybe the world would be friendly if everyone worn name tags.", "label": 0}
{"text": "Well let's hope this trend dies before Kendrick", "label": 0}
{"text": "let lil durk’s arrest be a lesson to all the other rappers out there: if you do a corny uplifting song with a children’s choir on the chorus, you WILL get arrested within 12 months", "label": 0}
{"text": "Russ militia where we at with it", "label": 0}
{"text": "I love king of the hill but it has never been close to making me laugh like american dad.  I also personally prefer it over the boondocks but i wouldnt care if i saw it ranked above amdad on a list or something.", "label": 0}
{"text": "I wish there was some more rap beef. I’m invested in some niche twitch streamer drama atm and it’s kinda boring without any diss tracks 😢", "label": 0}
{"text": "All my life is now about how long Durk will spend in prison", "label": 0}
{"text": "Listened to Mac Miller plenty since I've been in middle school, never thought of doing hard drugs because of him.", "label": 0}
{"text": "i mean it’s cordae theres not a lot to say on that subject", "label": 0}
{"text": "Gotta get them credit card points.", "label": 0}
{"text": "Also Mike Dimes", "label": 0}
{"text": "“The diddy shit” does not exist goofy.", "label": 0}
{"text": "My Name is Danny nice to meet you.", "label": 0}
{"text": "It’s not like Mac was encouraging people to do them. A lot of his music is about how he regrets his addiction to drugs but that it’s hard to shake as well. He wasn’t a drug pusher and his music was getting even further away from glorifying drugs when he died. Can’t say for certain but I really doubt the city would’ve taken his key away if it was just because of his general drug abuse.", "label": 0}
{"text": "but like didn't he get laced", "label": 0}
{"text": "He was sliding for Von bro chill 🤦‍♂️", "label": 0}
{"text": "You’re just one person.", "label": 0}
{"text": "what happened???? I thought they already arrested him", "label": 0}
{"text": "He’s coming to my city this month…. To play the flute 😭", "label": 0}
{"text": "You can't have a criminal able to open up all lock in an entire city, for gods sake.", "label": 0}
{"text": "Yup, and that’s the same key they used to lock his ass up.", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [BIGBABYGUCCI - Air](https://open.spotify.com/track/7BeW5hSHFrbmjqwp6bLgKG \"Confidence: 100%\")\n\n\\[Apple Music]: [BigBabyGucci - Air](https://music.apple.com/us/album/air/1770382489 \"Confidence: 100%\")\n\n\\[Soundcloud]: [BIGBABYGUCCI - Air](https://soundcloud.com/bigbabygucci-music/air \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/bigbabygucci%20air) || [Apple Music](https://music.apple.com/us/search?term=bigbabygucci%20air) || [Amazon](https://music.amazon.com/search/bigbabygucci+air) || [Bandcamp](https://bandcamp.com/search?q=bigbabygucci+air&item_type=t) || [Deezer](https://deezer.com/search/bigbabygucci%20air/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=bigbabygucci+air) || [Tidal](https://listen.tidal.com/search?q=bigbabygucci+air) || [YouTube Music](https://music.youtube.com/search?q=bigbabygucci+air)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "quite the opposite, really.", "label": 0}
{"text": "What a disgusting take", "label": 0}
{"text": "Glad that the only new Male HipHop I know be Kendrick Lamar and Eminem. Quality of Lyrics aside the Women still getting the talents. Not counting the true talents in the Underground scenes. Sad that all these Folks cannot just be Talent and Tole Models.", "label": 0}
{"text": "they don’t give keys to tweaks on the street", "label": 0}
{"text": "Says the broke nigga pretending to be a tough guy on the internet. YOU pussy, nigga.", "label": 0}
{"text": "ya, because he was addicted to hard drugs and prostitutes. key worthy fasho", "label": 0}
{"text": "how did Nas get away?", "label": 0}
{"text": "*falling to floor gif*", "label": 0}
{"text": "[KenTheMan](https://youtu.be/q0Pim0vehoA?si=ScgmsjtuctcNOtG7) too. She's my favorite of the bunch", "label": 0}
{"text": "There’s no big 3 cause he’s at the top alone", "label": 0}
{"text": "He don't even got a key to his cell.", "label": 0}
{"text": "I think me and you are the only two Russ fans here.  I can't recall anyone else ever talking about him.", "label": 0}
{"text": "came up on some old beats I made a few years ago...........\n\nout of the countless I made - probably 5-10 have some type of quality potential. \n\nIt really is practice practice practice", "label": 0}
{"text": "Hard to call it „a sample”. It’s pure remix with almost 1:1 instrumental and her verse added on top of it.", "label": 0}
{"text": "Durk having one helluva week", "label": 0}
{"text": "Have you talked about rap in real life before?", "label": 0}
{"text": "It is cool imo", "label": 0}
{"text": "His best verse btw", "label": 0}
{"text": "Booked under Dil Lurk.", "label": 0}
{"text": "Hopefully he made copies.", "label": 0}
{"text": "🤣🤣🤣🤣", "label": 0}
{"text": "Damn they already arrested him?  I thought it was going to be a lengthy investigation or something, they moved in quick on him.", "label": 0}
{"text": "Hell no I've binged like 10 season a long time ago and American Dad clears it easily.", "label": 0}
{"text": "The Feds do not fucking play bro 😭 their conviction rate is well over 95%. They make sure to get their ducks in a row before they go to grand jury. \n\nDurk is finished most likely. If it was a state charge, there’d be a lil hope. Only chance he has is that one of the jurors is a super fan & refuses to vote guilty 😭", "label": 0}
{"text": "Good. The guy is a certified POS and should rot.", "label": 0}
{"text": "Dude has been talking about muder his entire career. Don’t feel bad for this loser one bit", "label": 0}
{"text": "Lil Krud", "label": 0}
{"text": "yeah because they’re fucking tweakers you fool.", "label": 0}
{"text": "i wish kendrick lamar and eminem taught you how to type legible comments", "label": 0}
{"text": "As are you. Your point?", "label": 0}
{"text": "he shows love a lot to michigan tbf, he was in sada baby's mv for perk franklin / shred buddy and listens to veeze and yn jay", "label": 0}
{"text": "Not particularly a comedy", "label": 0}
{"text": "No, sometimes they actually make them mayor.  See Rob Ford and Marion Barry", "label": 0}
{"text": "Exactly…", "label": 0}
{"text": "Is this fed case or just a state case. I think Marshall are involved cuz Cali wants him extradited.\n\nDurk pray it’s state case in overcrowded California. Maybe he might get plea for 20 years and get out 14.\n\nBut the feds could also take over and make this RICO and go after him so he never getting out.\n\nEither way GG", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [Cal Combs - 721 Walton Ave. - EP](https://music.apple.com/us/album/721-walton-ave-ep/1774047318 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Apple Music](https://music.apple.com/us/search?term=cal%20combs%20721%20walton%20ave.%20ep) || [Amazon](https://music.amazon.com/search/Cal+Combs+721+walton+ave.+ep) || [Bandcamp](https://bandcamp.com/search?q=Cal+Combs+721+walton+ave.+ep&item_type=a) || [Deezer](https://deezer.com/search/Cal%20Combs%20721%20walton%20ave.%20ep/album) || [Soundcloud](https://soundcloud.com/search/albums?q=Cal+Combs+721+walton+ave.+ep) || [Tidal](https://listen.tidal.com/search?q=Cal+Combs+721+walton+ave.+ep) || [YouTube](https://youtube.com/results?search_query=Cal+Combs+721+walton+ave.+ep&sp=EgIQAw%25253D%25253D) || [YouTube Music](https://music.youtube.com/search?q=Cal+Combs+721+walton+ave.+ep)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "CIA plant", "label": 0}
{"text": "Doesn’t make you any less disgusting", "label": 0}
{"text": "What a dumbass. If there's any crime to not discuss over the phone or via text it's murdering someone", "label": 0}
{"text": "close enough didn’t hold a candle to regular show, regular show having to skirt around adult topics on a children’s network is a lot funnier than close enough’s “hey guys look drugs and sex”", "label": 0}
{"text": "Yeah no, it's a wrap.", "label": 0}
{"text": "Who wants to talk about SPM. Dude has issues.", "label": 0}
{"text": "He really should’ve left the country months ago, he coulda been in Bali doing concerts for drunk Australians but instead he had to become a fake Muslim like that was gonna convince the feds of anything. Poor life decision on his part.", "label": 0}
{"text": "[There's a Vice documentary on MAGA rap that's worth a watch](https://youtu.be/ucgu-Ooxy9c?si=q4smkdOZaAjDqb9D).", "label": 0}
{"text": "what made him different? because he was rich and made good music? still was tied up in the wrong stuff which is not key worthy. but hey if we’re handing out keys for percs and prostitutes then I must’ve missed something", "label": 0}
{"text": "He literally built his entire image on this type of nonsense. Why are any of you surprised? lmao", "label": 0}
{"text": "That or American Crime Story.", "label": 0}
{"text": "I’m sure they’ll look into it. Would be a huge oversight if they didn’t", "label": 0}
{"text": "Cigs don’t equate to percs and street pussy. and I don’t appoint mayors", "label": 0}
{"text": "you mean it's not for you?", "label": 0}
{"text": "I m from morocco and when i discovered payroll larry and cardo i let down all shitty artists i used to listen to. This trio is a Gift from God but not everyone would agree", "label": 0}
{"text": "Hope dude actually serves his time and faces consequences for what he’s done. Kinda tired of people acting like murder isn’t a big deal. It’s fucking evil.", "label": 0}
{"text": "They changed the locks.", "label": 0}
{"text": "New? Em been here since 99 and Kendrick been famous for over a decade tf you talking about", "label": 0}
{"text": "how the fuck is tragically struggling with addiction and dying of an overdose comparable to literally paying dudes to kill somebody?? you're a fucking idiot dude straight up, fuck off", "label": 0}
{"text": "Wait the “keys to the city” actually unlock things??? Lmaooo I thought it was symbolic", "label": 0}
{"text": "Sorry next time I won't be honest so I don't hurt feelings? Dude was an amazing talent with he world at his fingertips....and threw it all away because...", "label": 0}
{"text": "She fuckin sucks lmaooo. Sells no records, everything is just visual. Stop pretending this is a good artist, it’s getting old", "label": 0}
{"text": "The feds confiscating those too.", "label": 0}
{"text": "he made music about how bad his struggles with addiction were, you're actually a fucking dumbass if you think he was glorifying drug use", "label": 0}
{"text": "💀", "label": 0}
{"text": "Dudes best hope is Trump getting elected and buying a pardon.", "label": 0}
{"text": "Who's scratching today?", "label": 0}
{"text": "You’d be shocked at what people can hide from prosecutors in jury selection.", "label": 0}
{"text": "rob ford - actual crack.     \nnow his drug dealing brother runs Ontario", "label": 0}
{"text": "do you talk about the crown & throne with your boys? 😂", "label": 0}
{"text": "Holy delusional what are yall fuckin 8 years old? If you think Mac was just another tweaker you should delete all social media and go learn something for once.", "label": 0}
{"text": "boo boo boo boo boo boo BOO", "label": 0}
{"text": "Yeahhhh….Closest show to me about 2 hours away but I bought tickets anyway lmfao\n\nI may never get to see him live in person with Big Boi, so I’mma take what I can get lol", "label": 0}
{"text": "All I’m saying is that it’s one thing to tell on yourself in lyrics, repeatedly (and sample your intended victim screaming) and then be that DUMB in terms of how this went down. He either just decided to say f it and be reckless, or he really was on dummy time 🤷🏽‍♀️ Those sad little attempts at improving his rep suggests the latter, but that’s just me", "label": 0}
{"text": "Right because actively speaking against it and advocating for help for those addicted is the same thing as being folded on a street corner.", "label": 0}
{"text": "[It wasn't just cigs with Obama](https://abcnews.go.com/amp/Politics/BothSidesAllSides/story?id=2773754&page=1), said cigs because many former addicts end up smoking cigs in an effort to wean themselves off other vices.  Obama made something of himself despite that history when he very easily could have ended up as a \"tweak\", so did Mac, so did Jimi Hendrix, so did Robert Downey Jr. the list goes on.  What's your point in holding substance use as a black mark on somebody who is and was much more than that?", "label": 0}
{"text": "FREE BIG HIT", "label": 0}
{"text": "i think you got hit over the head with an “an fact” as a child", "label": 0}
{"text": "Almost like addiction and the battle against it isn’t as easy as “oh yeah im done with this now”", "label": 0}
{"text": "this headline is funny as fuck lol", "label": 0}
{"text": "I don’t believe this. They’re always trying to bring a black man down (especially that culture vulture GLAD). HE IS INNOCENT.", "label": 0}
{"text": "Why does this guy even have the key to the city?", "label": 0}
{"text": "Thankfully it looks like he's gonna rot in that cell", "label": 0}
{"text": "it’s a good thing that that’s a legal principle and doesn’t really have any bearing on anyone’s personal opinions", "label": 0}
{"text": "That's the damn point.  Can you name an unproblematic Artist that is like them that everyone likes? And I mean Major things not little small things. Honestly dun know and only the Women in Rap are known for this. ", "label": 0}
{"text": "Definition of mister misfit, but aint missed a fit", "label": 0}
{"text": "🤣🤣🤣🤣🤣", "label": 0}
{"text": "Smino with another great feature.", "label": 0}
{"text": "There’s just no such thing as the goat lol", "label": 0}
{"text": "... somebody sold him something other than what he asked for. Finished that run on sentence for you. Personally I feel like excessive pauses in text are first steps to a classic middle class crashout. Id be careful", "label": 0}
{"text": "And yet you worship clowns like Lil Durk lmao. Don't drop the soap Durk!", "label": 0}
{"text": "aw yes mac miller the activist😂 jesus christ", "label": 0}
{"text": "Sooo nothing? You got nothing ta add? Cool doubted ya had anything ta add.", "label": 0}
{"text": "Yeah bro failed piss test smh", "label": 0}
{"text": "If you can’t get the point of my comment there’s no helping you.", "label": 0}
{"text": "Can’t stop the reign is one of my all time favorite late night riding anthems. The beat is crazy and Biggie just floats.", "label": 0}
{"text": "Rather be in Cole’s shoes over Durk’s😂😂", "label": 0}
{"text": "If you can’t get the point of mine then you’re beyond help.", "label": 0}
{"text": "On something like \"Right Now,\" I think she's talking her shit with some slick bars.  Such as:\n\n\"So tea, I'm a walkin' exclusive (Hmm) // Bitches only get mad when the shoe fit // I'm the model you bitches is built like // How the fuck you want beef with the blueprint?\" or \"A bitch from nowhere, she can't give me direction // Where is the waist? Find a detective.\"  I'm just saying, she's slick with the one-liners, has a good delivery, and the beat for the song is an absolute banger.\n\nAs far as the double standard part, it's basically about how a lot of dudes are cool with their favorite men in rap rapping about the same subjects over and over with no problem, yet throw a hissy fit about women rapping about sex.", "label": 0}
{"text": "Should’ve never slid for Von 🤷‍♂️", "label": 0}
{"text": "You’re 100% right 😂 that’s just our public school systems finest.", "label": 0}
{"text": "jfc of all the reasons", "label": 0}
{"text": "Holy shit. Booking flights in the first place, LETS START THERE", "label": 0}
{"text": "Just skimming this … I think I’ve been sleeping. She reminds me a lot of Rapsody who’s one of my favorites (and also happens to be on the project) so I think a deep dive into her stuff is due soon", "label": 0}
{"text": "Being poor and in the ghetto doesn't excuse murder. He's a POS regardless of whether he was rich or not.", "label": 0}
{"text": "they are symbolic, it's supposed to represent the keys to the gates from back when cities were walled", "label": 0}
{"text": "There’s a bunch of rappers who haven’t been thrown into prison because they don’t commit dumbass crimes you goofball.", "label": 0}
{"text": "If Harris gets elected and frees him, she wouldn’t even need to campaign for 2028.", "label": 0}
{"text": "I would have to be implying you said that for the implication to be there. Since I wasn’t attempting to imply, I wasn’t implying. \n\nI *dont* think you can comprehend that.", "label": 0}
{"text": "when he first started popping in 2012 I thought for sure he’d be dead or in jail in under a year. He really was the first of his kind, we had never seen a big rapper move as publicly reckless as him before. Now that’s kind of the blueprint", "label": 0}
{"text": "Cope", "label": 0}
{"text": "I mean it is inherently wrong, led to his own death… directly affects himself and everyone that knew him. and all of his supporters", "label": 0}
{"text": "Eminem- unproblematic lmfao.", "label": 0}
{"text": "Am I the only one who thinks that it would be a great idea to have a chance to get their own life without having to do something like this before they are in their own thoughts? It's weird how you feel about it further than what you think it can do to you. No?", "label": 0}
{"text": "I hope you’re getting paid rn😂", "label": 0}
{"text": "Honestly, fuck your take. I'm sensitive about it cause I love Mac. He was such a good dude. And it's disrespectful for you to make this comment aside from the legendary respect he got from everyone around him", "label": 0}
{"text": "Nanu? Whom is Slug? Forgive the ignorance but this the first I've heard of him. Be he new or been in the game? And thank you for being the only comment to answer my Question. ", "label": 0}
{"text": "One of it is, and it for sure isn’t your broke ass 🤣\nyou bore me.", "label": 0}
{"text": "W", "label": 0}
{"text": "Because they're stupid", "label": 0}
{"text": "I'm not sure on the exact details, but Gunna basically wrote a statement as part of his deal acknowledging YSL as a criminal organization instead of just a music label. As far as I know he didn't name names on any specific crimes, but as part of a RICO it's a big deal to admit it's a criminal organization since that's an essential element of proving a RICO case. \n\nI don't think Thug has publicly said anything about it so I have no idea if they're on good terms, but Gunna and Lil Baby had a public falling out over it. I know there were a bunch of rappers who don't fw him anymore over it but I don't remember who exactly. I thought he kinda faded away as a result but I just learned yesterday he's still touring and got a good amount of streams still, so it didn't really hurt his career too much it seems.", "label": 0}
{"text": "Coulda used them to get outta the country", "label": 0}
{"text": "Eh the mafia really did own all the construction in NYC for a time. Same with unions and they also had corrupt police and politicians in their pocket. These guys sell weed and steal cars then die at a McDonald’s.", "label": 0}
{"text": "As a Kendrick fan, Drake being number 1 would be good cos then we could say that Kendrick wiped the floor with the greatest artist of our generation.\n\nIt's like Vietnam defeating America", "label": 0}
{"text": "He’s literally caused (at the very least) fucking terror in the streets of Chicago and possibly even death. It’s kinda weird. I’m not going to sit here and say he’s a bad artist because he’s obviously talented but giving him the key to the city? Did they just do zero research on him? Lmao", "label": 0}
{"text": "I think you the only retard here gang", "label": 0}
{"text": ">If there's any crime to not discuss over the phone or via text\n\nHonestly, you coulda stopped it right there.", "label": 0}
{"text": "Damn this legit made me whole week. What a role model on personal growth. Hell yea Sosa I’m going to bump ur new project today", "label": 0}
{"text": "elite english", "label": 0}
{"text": "i like russ but theres 2 many weirdos on here who shit on u anytime u mention him in any way but shitting on him lmao", "label": 0}
{"text": "Yeah you gotta respect his come up, but i can see how people especially back then found him to be arrogant.  I think he even admitted to saying things the wrong way, he just espouses self belief and stuff like that", "label": 0}
{"text": "Troll job or actually regarded?", "label": 0}
{"text": "Do sneako or andrew tate do that", "label": 0}
{"text": "Yeah thats true, i was expecting some shit just for making that post ", "label": 0}
{"text": "Not if they already know who pulled the trigger", "label": 0}
{"text": "I’m sure you are", "label": 0}
{"text": "Good job, you were able to tell what English is. Small victories.", "label": 0}
{"text": "L verse \n\ncry", "label": 0}
{"text": "Why are you brining up sneako and tate? We're talking about lil durk you doofus lol.", "label": 0}
{"text": "Bro. It's called context clues. He spends his time on the 3 songs before, alluding to Drake being different. He is using racial innuendos and calling him a colonizer. He then makes a song called Not Like Us, where he starts it off talking about slavery. Then you add the fact that he is an Israelite, and you can fairly easily follow the thread of what he is hinting at.", "label": 0}
{"text": "That’s fine, we can debate his spot all you want. This list still doesn’t have much recency bias.", "label": 0}
{"text": "Why do you even think Drake has ownership in that label? Like what is the proof of the heart of your conspiracy? And Drake himself is signed to UMG, so how does it benefit gamma’s parent company to boost him up through their media division? Why has that same media division been supportive of Kendrick throughout the whole beef and his career in general? If Eldridge and Drake was as closely tied as you seem to think why would they let Kendrick’s diss against Drake where he accuses him of being a pedophile be the #1 rap song on Billboard for the year? Why would they let it be in Billboard’s top 10 every single week it came out except for the last couple weeks where’s it been #11? How does that help them?\n\nAnd yeah he outsold Bieber, so what tho? Beyoncé did too and her album was a streaming exclusive on an even smaller platform than Apple Music.", "label": 0}
{"text": "Van Gogh art was cheeks the glaze is crazy", "label": 0}
{"text": "got until 2:45 left so keep me entertained", "label": 0}
{"text": "My statement is based on the consequences for getting caught", "label": 0}
{"text": "dyu blame him lmao\n\nI'd be jetting the second I heard feds clocked. \n\ndude's stomach probably dropped to the floor when he got caught. Your life over just like that damn", "label": 0}
{"text": "City finds out gang banger was gang banging. Shocker.", "label": 0}
{"text": "The girl came forward on her own and cleared the entire thing up. In her own words, he only kissed her own the cheek, and she was turning 18 that week. 17 is also the age of consent, and Drake himself was only 22. Like, let's have some nuance here.", "label": 0}
{"text": "Well it is research and you don’t like his research methods and that’s cool. I’m not going to bat for trap lore Ross, I don’t know these mfs.", "label": 0}
{"text": "How about you use that time to get an actual job instead of pretending on the internet", "label": 0}
{"text": "Ok cool so you're just trolling.  Mac, Obama, Van Gogh all left behind a legacy.  People are gonna remember them for their accomplishments long after they're gone.  I'm sure you'll be remembered by generations for Reddit comments", "label": 0}
{"text": "re re fasho", "label": 0}
{"text": "So rappers are pop stars now ? Ok…", "label": 0}
{"text": "Damn unc", "label": 0}
{"text": "ah yes thezeffgod generational contributions", "label": 0}
{"text": "You’re vile", "label": 0}
{"text": "I admit I know nothing about him, but I always read his name as it’s supposed to be anime but the letters rearranged. Is that indeed what it’s supposed to mean? ", "label": 0}
{"text": "id be down to watch a documentary about crazy islamic conspiracies.", "label": 0}
{"text": "enlighten me on the great activist movement of Mac Miller", "label": 0}
{"text": "What is wrong with you and the level of investment you have in this thread and your lack of literacy to make that how you respond to a comment agreeing with what you're saying", "label": 0}
{"text": "Yeah easy! You go to this site called “google” and you type in “Mac miller activism” \n\nHope this helps 👍🏻", "label": 0}
{"text": "He does. Watch his apple music interview", "label": 0}
{"text": "There is a racial reason. Black orgs had a glass ceiling and had to just settle for lower level crimes unlike other groups that could \"legitimize\"...several Black gangsters tried to do the same but couldn't. Some had ties in politics but still on the lower rung. \n\nMost of these are just revenge and not even about turf now.", "label": 0}
{"text": "It's another song but now I discovered Band Gang rappers rapped over alchemist beats twice", "label": 0}
{"text": "Ngl I don't get why fly to Italy like they have had a kinda textbook extradition relationship with the USA since the 80s. And he's wanted for murder for hire...idk we will see", "label": 0}
{"text": "He disguised himself as a [gun](https://youtu.be/aG64AlNgjF0?si=6uSXLmgBEXhyjICL)", "label": 0}
{"text": "Tell the feds to transfer his United or Delta miles over to my account lol (Chicago is a United hub and Atlanta is Delta). Gimme enough points for a round trip ticket to Tokyo.", "label": 0}
{"text": "Better start building his drug addiction storyline up now so he can convince them to give him the drug program to get that year off 😭", "label": 0}
{"text": "a lot of misinformation out there these days", "label": 0}
{"text": "Where did I say that? You have a tendency of making shit up.", "label": 0}
{"text": "[dementia king](https://www.reddit.com/r/hiphopheads/s/FvwU0egaSh)", "label": 0}
{"text": "Must run in the family. Hit-Boy was my spotify top artist in 2018 from that Tony Fontana album. It's def worth checking it out if you haven't! ", "label": 0}
{"text": "Laugh Now, Cry later", "label": 0}
{"text": "Tbf their conviction rate is high because more take pleas, they turn down many and have lost some high profile cases (last one I remember was the Cliven Bundy family shit show with all the white supremacist and militias pointing guns at the feds. They lost it in 2 states). Still he's swinging at the moon unless he has a great lawyer who works magic. I felt different about his odds a few hours ago but we will see", "label": 0}
{"text": "Yea, got cut because of sample clearing issues from what I’ve heard. It samples the beginning of Scream by Timbaland so maybe that was it", "label": 0}
{"text": "but you’re spreading it🦧", "label": 0}
{"text": "poppin perczzzz and fuckin hoesssss, where my key at?", "label": 0}
{"text": "really not safe from dgg brigaders anywhere rn", "label": 0}
{"text": "The Game x Conway\n\nFull album produced by Alchemist, Conductor, Craven, Daringer, and Hit-Boy", "label": 0}
{"text": "Obligatory fuck vlad", "label": 0}
{"text": " equivalent there bud. but if you don’t wanna back up your claims with evidence it’s all g", "label": 0}
{"text": "Our state TV LOOOOVES Japanese scientists lmao", "label": 0}
{"text": "okay buddy 🤣", "label": 0}
{"text": "Ariana grande being above half those people is recency bias. She doesn't come close to having a cultural impact that Em, Wayne, JayZ, or Future.\n\nShit b.o.b should be above her", "label": 0}
{"text": "yeah but whens the last time you heard his music in public? or heard somebody who’s not super into music talk about him?", "label": 0}
{"text": "2:33", "label": 0}
{"text": "damn y’all shoulda sent Mac the reddit resources instead of me", "label": 0}
{"text": "You're a yeat fan and were probably like 6 when Mac was relevant.", "label": 0}
{"text": "That’s my problem…how?", "label": 0}
{"text": "you researching for free?", "label": 0}
{"text": "The city don’t care about that long as it stays in \"urban” areas", "label": 0}
{"text": "I’m 14 lil bro", "label": 0}
{"text": "I hate how accurate this is lol I’m 32 and while I do think Durk is a pretty talented artist I can name maybe 2 songs 🤣", "label": 0}
{"text": "Ye, want more?", "label": 0}
{"text": "If the state believes a gang-banging nigga should be seen as a motivational figure for young black men, then there’s truly no hope for the youth", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [Eligh & Es.cE - Hello Youth](https://music.apple.com/us/album/hello-youth/1759471831 \"Confidence: 85%\")\n\n\\[Deezer]: [Eligh - Hello Youth](https://www.deezer.com/album/621088211 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Apple Music](https://music.apple.com/us/search?term=eligh%20hello%20youth) || [Amazon](https://music.amazon.com/search/Eligh+hello+youth) || [Bandcamp](https://bandcamp.com/search?q=Eligh+hello+youth&item_type=a) || [Deezer](https://deezer.com/search/eligh%20hello%20youth/album) || [Soundcloud](https://soundcloud.com/search/albums?q=Eligh+hello+youth) || [Tidal](https://listen.tidal.com/search?q=Eligh+hello+youth) || [YouTube](https://youtube.com/results?search_query=Eligh+hello+youth&sp=EgIQAw%25253D%25253D) || [YouTube Music](https://music.youtube.com/search?q=Eligh+hello+youth)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "should of stayed out the streets 🤷🏽‍♂️ you dont see Chief Keef in bs no more", "label": 0}
{"text": "Why would you want to be another man?", "label": 0}
{"text": "I mean yeah, up2me will always be better than the shit he’s been putting out so gonna state my opinion", "label": 0}
{"text": "Being honest and being empathetic aren't mutually exclusive concepts.", "label": 0}
{"text": "Even more active in NBA2k which gives teenage vibes since those are the only people I know who play that game still", "label": 0}
{"text": "Whole MV was based on D’Angelo 😂", "label": 0}
{"text": "Do u remember writing this comment 10 YEARS AGO?!", "label": 0}
{"text": "Lmao I don't care about your opinion but you making some braindead ass replies in this thread that aren't your opinions. Just rage bait because you want attention.", "label": 0}
{"text": "I’m not caught up on the lore, I don’t know what that means yet 😭. Those are Destiny’s goons? \n\nI thought they were both on the left, why they beefing a week before an election? 😂", "label": 0}
{"text": "the one hit wonder James Blunt?", "label": 0}
{"text": "What’s the point? when most of them are probably horrible people", "label": 0}
{"text": "Do u remember writing this comment 10 YEARS AGO?!", "label": 0}
{"text": "What is this shit where people only come forward after a wave of accusations are already made?\n\n  \nThis is so egregious, if this really happened and she didn't go to the police, she's a dumb fuck at worst and a coward at best.\n\n  \n This shit annoys. Take any action. Tell some fuckin body.", "label": 0}
{"text": "So JID is up next…?", "label": 0}
{"text": "more old heads on the game playing rec tbh. but I’m 14 lil bro pipe down", "label": 0}
{"text": "lol okay", "label": 0}
{"text": "people only Plea to get a shorter sentence because they are COOKED.", "label": 0}
{"text": "It shows little one.", "label": 0}
{"text": "Chris Brown is the odd subject because a couple weeks ago. \n\nA woman came out claiming her friend was r*pe by him when she was 16 and some other artist", "label": 0}
{"text": "Did you just string random words together cuz i have no idea what you’re trying to say", "label": 0}
{"text": "awwww, keys for all pimps and junkies lemme sign it into law", "label": 0}
{"text": "I've been sleeping, but OMG just listened to Black Girl and I'm sold. Incredible!", "label": 0}
{"text": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "label": 0}
{"text": "People take plea deals at such an incredible rate because the feds wait until they have all the evidence possible & make it perfectly clear that you won’t win at trial. & If you try, you get burnt.", "label": 0}
{"text": "You’re tripping. Hurricane? Ghost Town? 24 Hours?????? What’s wrong with you, you’ve missed out on a decade of gems", "label": 0}
{"text": "you’re 12 lil bro catch up", "label": 0}
{"text": "Who are you calling lil bro? You just became a teenager. Get on your fuckin school bus bruh. Man just started high school calling me lil bro. Call me unc if you want I'm not 14.", "label": 0}
{"text": "CONDUCTOR WE HAVE A PROBLEM", "label": 0}
{"text": "He was ? He advocated quite a lot, learn your history dumbass", "label": 0}
{"text": "Conductor Williams has one of my favorite YouTube channels. It’s not great for learning to make beats because I’m not on MPC, but definitely fun to see how all the beats were made", "label": 0}
{"text": "Don’t worry we put it under “Smurkio The Voice”", "label": 0}
{"text": "Lol yeah rage bait me now cuz you know I'ma totally bite into that convo. Say whatever you want bro. You're showing everyone here how little productive things you have to do with your life. Bye now. I have adult things to be getting to.", "label": 0}
{"text": "Yea very true,  but honestly I was surprised the Bundy family got off. They straight up tried to take federal lands with an armed militia. I half wonder if they trying to get him to flip since he might have more to lose than most", "label": 0}
{"text": "By the looks of it he’s also causing terror and death in LA", "label": 0}
{"text": "bro they've been beefing since the n word manifesto in 2019. they used to be friends and would co-stream since they were both political andys. destiny claims to have put hasan on (which is debatable), but i think he's just bitter that hasan became the mainstream political streamer and destiny has been toiling away in relative anonymity on youtube since he caught a ban on twitch. dgg has been harrassing hasan ever since. hasan wouldn't even say the word \"destiny\" on stream for years. dgg has been brigading lsf for years trying to clip hasan to make him look bad. now that hasan has been making a bunch of deranged pro-hamas and pro-houthi shit on stream dgg is trying to wage a proxy war cross-clipping the austin streamer crew (lsf had to ban hasan/destiny posts because it got out of control). \n\nNO I WILL NOT LOG OFF", "label": 0}
{"text": "Found goldlinks alt, haha you stupid ass boy", "label": 0}
{"text": "Who is arguing lmao I'm just telling you there's better things to do with your life little blossoming child 💜", "label": 0}
{"text": "The fact we even gotta have this conversation is wild. Mfs really lost our here 💀", "label": 0}
{"text": "As a long time Amine fan who spins all of his albums quite a bit, especially Limbo, this kinda falls flat for me. Feels like he is phoning it in / less personal than his other stuff", "label": 0}
{"text": "who tf goldlink", "label": 0}
{"text": "Pretty sad how you're not getting paid based on how fast and much you replied to everyone here which isn't even close to how much I've replied to you. You've spent twice the amount of time in this thread that I have lmao.", "label": 0}
{"text": "Smino sounds so nice. Amine... I love him but he's so hit or miss. He's either the coolest mofo on a track, or he's underwhelming. \n\nAbsolutely awesome that he's in the studio again. He always has 3 or 4 tracks on any record that I listen to for years.", "label": 0}
{"text": "Nahhh bro ain’t fooling nobody, go sell some trash albums brokie ☺️😤", "label": 0}
{"text": "Go to bed church boy", "label": 0}
{"text": "Ik, that’s why I’m getting paid rn. Not tryna actually work on a friday, neither are you I can tell", "label": 0}
{"text": "Yes, if the door to Chicago is locked you literally cannot enter the city without the key", "label": 0}
{"text": "Lmao I don't have to look through your profile. There's websites that I can just type your user into that shows me who you are. Feel free to do the same to me. Just because you don't know how to do it doesn't mean it's hard little one.", "label": 0}
{"text": "not if you come from a hard knock life", "label": 0}
{"text": "😭😭 this is the first time I’m hearing of that Bundy case 😂 that’s wild!\n\nWell, when you go to cooperate with the feds, you do something called a “proffer” which basically means you have to sit down & tell the feds every single thing you know about any crimes that have been committed, involved in or not. And if they find out that you’ve hidden anything, they can decide to refuse the proffer & you get nothing 😭", "label": 0}
{"text": "eyoooo", "label": 0}
{"text": "wanna come with papi?🤩", "label": 0}
{"text": "I don't think these beats sounded good back then either lol", "label": 0}
{"text": "protip get extremely high before the flute show", "label": 0}
{"text": "whyre u naming shit like they mean anything to me lmfao. kanyes been shit since after MBDTF. and that was a declined from every other album before it", "label": 0}
{"text": "I bet I get paid on the daily way more than you with my college degree. Maybe you should work towards one instead of yapping on reddit.", "label": 0}
{"text": "WHOOO KID", "label": 0}
{"text": "> flea", "label": 0}
{"text": "That was literally half a century ago", "label": 0}
{"text": "And Diddy don't but being talked about everywhere.", "label": 0}
{"text": "I was responding to a comment you made, goofy. Why don't you try reading, lol?", "label": 0}
{"text": "there was a lot of drama last year in latin trap last winter (anuel aa and árcangel were going back and forth)\n\nthis is an article about the best disses of the year not by kendrick, found some stuff through that: https://www.hearingthings.co/the-years-coldest-rap-disses-by-people-not-named-kendrick-lamar/", "label": 0}
{"text": "The only bad thing chief Jeff has is 9 kids from multiple BMs. Other than that he’s smarter than 99% of drill rappers", "label": 0}
{"text": "It was an honorary key to the village of Broadview not literally the city of Chicago, that would’ve been so fucking stupid.", "label": 0}
{"text": "I see you work a very productive job that requires all of your attention.", "label": 0}
{"text": "I already have my fine arts degree goofy😂 was literally top barista in my district", "label": 0}
{"text": "You’re an idiot", "label": 0}
{"text": "that’s high key just creepy. Ranked profile hunting😂", "label": 0}
{"text": "should put that effort into linkedin", "label": 0}
{"text": "😈🦧😈", "label": 0}
{"text": "You’re saying that because she drugged and robbed people, it’s possible she also raped them?", "label": 0}
{"text": "Lmao mane they gon pull up everything they can from his past. Especially the shit w von 😭😂 I wouldn’t be surprised if he got a “in furtherance of a gang” charge, and in cali that’s like double or triple the time you’d normally get. Durk really cooked on this, but maybe his lawyers work some magic 🤷‍♂️", "label": 0}
{"text": "Too late, dude's probably already made copies.", "label": 0}
{"text": "Do you actually need to have all of my comments repeated yet again? Standing in business is so interesting to watch.\n\nThis is just weird at this point. Have a good day.", "label": 0}
{"text": "Mrs. Agatha Higginbotham, I will ask you one more time to not shout “WHAT MURDAA” when the jury is in session.", "label": 0}
{"text": "to be honest if you watch interviews with him by the time he was 15 he had like 20 friends that were killed and he was pretty much desensitized to death and violence completely \n\nobviously not excusing anything but pretty much impossible to act rationally coming from that kind of environment", "label": 0}
{"text": "You’re a fucking dumbass if you think it’s some how immoral for someone to struggle with drug addiction.", "label": 0}
{"text": "Interesting. \n\nThanks for elaborating. So if he takes a plea deal on a mistrial and they restart, could they potentially break the record for longest court case in history? If you were to combine the lengths of the trials, I mean. \nWe're entering some serious, 'Find Me Guilty' territory.", "label": 0}
{"text": "God damn y'all act love the ni**a already convicted 🤨 that's some bullshit moe", "label": 0}
{"text": "if your motivation is life is strictly making money sure", "label": 0}
{"text": "Cause he liked drugs mf", "label": 0}
{"text": "Favorite single so far", "label": 0}
{"text": "You said something about the white supremacy of the manosphere or something stupid like that and then I said that's probably because you worship lil durk and king von. The original commenter mentioned them not you goofy.", "label": 0}
{"text": "Two Kanye songs I will NEVER understand the hype for: Can't tell me nothing and Otis. \n\nI detest these beats so much. HORRIBLE", "label": 0}
{"text": "Can't wait to check r/chiraqology just to see the sycophants salivate all over this case.", "label": 0}
{"text": "Yeah thats how opinions work", "label": 0}
{"text": "Tellin all they business!", "label": 0}
{"text": "Otis I agree with, but Can’t tell me nothing is great. Not the best song on graduation though", "label": 0}
{"text": "Never heard of a joke before huh? Must be sad", "label": 0}
{"text": "lmao", "label": 0}
{"text": "J Rock is doing alright.", "label": 0}
{"text": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "label": 0}
{"text": "I’m so glad other people notice this. Some post-TLOP Kanye dialogue has me thinking I’m insane. \n\nThere’s also a recency bias type thing at play - fans will say a recent album is among the artist’s best to try stave off “he fell off” rhetoric.", "label": 0}
{"text": "Can't wait to check r/chiraqology just to see the sycophants salivate all over this case.", "label": 0}
{"text": "now now, back to the care home for u", "label": 0}
{"text": "Rest In Peace DJ Clark Kent\n\nOne of the greatest ever", "label": 0}
{"text": "next year yeah…", "label": 0}
{"text": "America is the most retarded fucking country I’ve ever heard of. How the fuck could you give keys to the city to a guy that has been rapping about murdering people for like 15 years, his best friend was King von who the FBI said killed multiple people and has multiple other friends who are murderers. \n\nThat shit is fucking hilarious to me, actual morons. It’s sitcom level this shit", "label": 0}
{"text": "It's so fucking sad.  The worst part is a good amount of them weren't even born into the gang wars that some areas have.  A lot of them had perfectly normal childhoods, but decided that this shit was cool at some point.", "label": 0}
{"text": "Havent listened yet but will when i have time 🔥", "label": 0}
{"text": "found the old head. and quarter developed actually, at least get it right", "label": 0}
{"text": "that's happened a couple of times with me but not as fully made tracks - just some really great melody ideas that has me like \"damn that's kinda fire\"", "label": 0}
{"text": "We don't allow direct link posts of social media posts, because these can get deleted and can't be updated if the situation changes.\n\nPlease resubmit this post as a self post and include an imgur mirror of the social media post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "Who the hell said anything about morality? Stop reaching.", "label": 0}
{"text": "Y’all even read? Was given the key to “the villages of Broadview and Bellwood“ which are not Chicago", "label": 0}
{"text": "That’s not an argument. That’s me ending the conversation because I don’t see the point in continuing. You can debate individual artist placement with someone else", "label": 0}
{"text": "That's wild", "label": 0}
{"text": "This the correct take", "label": 0}
{"text": "Well…. I’m not staring down the barrel at years in prison….dumbass", "label": 0}
{"text": "We are all redditors dude. Insulting them is insulting yourself. \n\nWhat's that video clip from \"what we do in the shadows\"? If you can get the other person to call you a dumbass then you've won.", "label": 0}
{"text": "Fuck cancer", "label": 0}
{"text": "Can't forgot Saucewalka", "label": 0}
{"text": "All of those guys legitimately turned their loves around and left the good for good. Durk is still way too involved from the little that I know.", "label": 0}
{"text": "Love how this is linked to a Pakistani news outlet haha", "label": 0}
{"text": "RIP 🕊️", "label": 0}
{"text": "Horrible take. Iconic songs with iconic beats.", "label": 0}
{"text": "damn..", "label": 0}
{"text": "Chicago didn’t give him a key to the city", "label": 0}
{"text": "Chicago didnt give him a key", "label": 0}
{"text": "No sympathy. FAFO. Learn from prior mistakes.", "label": 0}
{"text": "That’s not even a full lifetime 🤣", "label": 0}
{"text": "I certainly hope he wasn't trying to flee to Italy, because that's literally one of the worst countries to flee to.  They have a bilateral extradition treaty with the US and you don't even need to be convicted.  If you're even accused of something, they could extradite him back to the US.  Man needed to head to Bali.", "label": 0}
{"text": "Im a virginnnnnn", "label": 0}
{"text": "Let's go remix was fire\n\nRip Dolph", "label": 0}
{"text": "Same I'm 29 the only 2 I can think of are L's anthem and Molly girl from like 2012", "label": 0}
{"text": "Damn how he gonna get in", "label": 0}
{"text": "Crazy that u predicted this", "label": 0}
{"text": "hit x hit x hit", "label": 0}
{"text": "RIP. Sky’s The Limit has to be one his best beats", "label": 0}
{"text": "Not the ✂️ 🤣🤣🤣\n\nI need to check the whole thing, Meg and Kamaiyah are my favorites", "label": 0}
{"text": "This nigga really using reddit and attempting to act hard. Yall so fake🤦🏽", "label": 0}
{"text": " No way", "label": 0}
{"text": "I'll give it to Junior Mafia's Players Anthem but Sky's The Limit might be my #2.\n\nRIP!", "label": 0}
{"text": "Well, considering all these podcasters like JB and Mal keep bringing it up, there’s some credence there. His endorsement of their artists specifically is another clear indicator that he is involved.\n\nIt benefits Eldridge like so:\n\nDrake has a large fanbase, it’s just inflated and propped up by the media. Eldridge owns all of the music media publications and the company that collects all of the numbers, they keep the world updated on his lifestyle and curate his image.\nThey then use Drake for his “stimulus pack” on their own roster of artists.\n\nUMG owns Drake’s catalogue, so advertising him through Eldridge means benefits UMG too.\n\nA company like Gamma takes a lot of foresight. Larry Jackson probably saw the growth of AM and figured he could do the same for gamma, but we’re in a different era.\n\nDrake is in serious debt with UMG and until he recoups $400m from sales he won’t own his own masters. He has an expensive lifestyle and a lot of business ventures, but the one thing that will truly make him money is his masters. Wayne sold Drake’s pre-2018 masters in 2020 to UMG.", "label": 0}
{"text": "Yeah all trash rap that praises the angry orange ", "label": 0}
{"text": "Fuck no", "label": 0}
{"text": "I never even finished Donda ngl", "label": 0}
{"text": "Holy shit. RIP to a legend.", "label": 0}
{"text": "Holy fuck rest in peace to a hiphop pioneer and a sneaker pioneer.", "label": 0}
{"text": "Colon Cancer is a motherfucker. \n\nRIP to one of the best. \n\nFinest Ones is one of my favorite hip hop songs.", "label": 0}
{"text": "Beyonce, much like Jay, also fiddled their numbers. 4:44 only sold 1M because he bought 1m physical copies to give away with a Verizon partnership", "label": 0}
{"text": "same dude. I'm a fan. This one just wasn't it. \n\nSucks cause Smino brought that smoothness. He just outrapped our guy!", "label": 0}
{"text": "Fair \n\nThat’s just how it feels when people are equating drug use with other actual immoral acts \nOr saying that an artist who uses is less moral than an artist who doesn’t bc of their influence (which I know isn’t what you said)\nBut I see it so often and I know that kind of pressure probably just makes artists use more", "label": 0}
{"text": "Don’t speak on the family, brodie", "label": 0}
{"text": "Nooooo!!!!!!!\n\nAhhh this sucks! Gods favorite DJ! RIP Clark Kent!\n\nCondolences to his family and friends. Damn The Originators lost a good one.", "label": 0}
{"text": "Wtfff", "label": 0}
{"text": "This is not very super, man.", "label": 0}
{"text": "wow. massive loss I'm gutted", "label": 0}
{"text": "when the song slaps but jordan peterson is sampled on it <", "label": 0}
{"text": "And Eldridge were the first ones to tell us that the battle was over and that Kendrick won. Purely for damage control purposes.\n\nAnd Kendrick’s impact is just so big they can’t downplay it. People were listening to the songs on YouTube and instagram and generating views which could be immediately seen. They couldn’t hide the success of the song.", "label": 0}
{"text": "Right dude? They turned on durk quick. He gonna beat it and the haters will disappear", "label": 0}
{"text": "We're seriously comparing the CPD/FBI going out and murdering a black panther in cold blood in 1969 to giving recognition to one of the biggest artists in the city in 2024?\n\nI think things have changed just a little since then, and literally what relevance do these contexts have with one another? The only thing this dude is insinuating is that Lil Durk is the antithesis to Fred Hampton, just laughable", "label": 0}
{"text": "You go to wal mart or a mexican store in the ghetto. Get a shitty burner. Matter fact, get 10. Pass em out. Use em. Collect em all. Take a helicopter trip after you run over them a couple times. Go a few miles out in the ocean, or go to Catalina island. And throw em in the ocean. Boom.", "label": 0}
{"text": "Anyways could you elaborate on why they should've taken away his \"key to the city\"? Lots of arguing down below but you somehow stayed quiet and avoided all that without explaining yourself. So I'm curious", "label": 0}
{"text": "Damn. RIP", "label": 0}
{"text": "That's how they are man, I mean Kobe a rapist with no convictions shit wild but Jerry Lee Lewis was a folk hero with a 14 year old wife", "label": 0}
{"text": "That nigga loves jail.  Granted, I’m sure as a 50+ year old felon there really isn’t much of a pathway to him making decent money legally.  It’s a fucked up cycle.", "label": 0}
{"text": "The intro to “Players Anthem” is so iconic for me. My mom loved Junior Mafia growing up. Going to have to check out what all he was involved in.", "label": 0}
{"text": "REST IN PEACE", "label": 0}
{"text": "He introduced Dame Dash to Jay-Z", "label": 0}
{"text": "Cook that dumb ass nigga", "label": 0}
{"text": "I’ve been OOTL for a long time but when did this dude get ripped?", "label": 0}
{"text": "Maybe participating in murders should", "label": 0}
{"text": "it don't be like it is but it do", "label": 0}
{"text": "I guess you ain’t got your money right", "label": 0}
{"text": "RIP", "label": 0}
{"text": "Damn super sad RIP. Brooklyn’s Finest is one my favorite Hov songs.", "label": 0}
{"text": "What you’re gonna gatekeep “talking about rap in real life” now? Give me a fucking break lol get over yourself 🤡", "label": 0}
{"text": "That “one hit” was the 4th best selling song of the year. It was also the first non-urban, non “American Idol” song to hit #1 since 2001. And it spurred on sales for his album which spent 78 weeks on the chart.\n\nLana Del Rey has zero #1s and zero solo top 5s but got an honorable mention. Granted, her album performance blows his out the water. But all in all, I think he deserved a mention.\n\nAnother example - Megan Thee Stallion has 1 #1 by herself, and 2 others with major artists (Beyonce and Cardi B) and a top 10 with 2 major artists (Ariana Grande and Doja Cat). Comparable album accolades. She got an honorable mention. Considering half her album’s streams got filtered, that’s a joke in and of itself.", "label": 0}
{"text": "Clark World Baby rip", "label": 0}
{"text": "It's not a documentary in support of MAGA rap, it explores the people behind it and challenges the rappers on their music and beliefs. Some of the ones featured in the doc basically admitted they went in that lane because of the money", "label": 0}
{"text": "new Sade in 2024. the universe is good to us", "label": 0}
{"text": "Hop Hop simply isn’t what it is without DJ Clark Kent in the timeline. Vital presence.", "label": 0}
{"text": "like half the fucking tracks", "label": 0}
{"text": "such a solid tape; is it really that hard to find a vocal sample of someone that's not a bigot quoting psych/philo 101?", "label": 0}
{"text": "He just failed a piss test, nun too crazy. Hope to see him free again soon.", "label": 0}
{"text": "RIP 🙏", "label": 0}
{"text": "Yea that song was everywhere, but that justifies being named one of the greatest pop stars of the century? Never seen anyone even say he was one of their favorite artists let alone the greatest of anything.", "label": 0}
{"text": "Oh damn that’s good to know.  I thought he got caught moving weight or something", "label": 0}
{"text": "This is a sign from the universe to check out her discography \n\nI’ve been meaning to check her stuff out but I’ve been real lazy with checking out new music lately", "label": 0}
{"text": "My verse of the decade so far is still Andre's \"Life of The Party\" verse. It's so beautifully crafted and emotional. This is first part could be my favorite opening to a verse ever. So beautiful and heartbreaking at the same time.\n\nHey, Miss Donda\nYou run into my mama, please tell her I said \"Say something\"\nI'm startin' to believe ain't no such thing as Heaven's trumpets\nNo after-over, this is it, done\nIf there's a Heaven, you would think they'd let ya speak to your son\n\nMaybe she has in the form of a baby's laugh\nI heard passing by in a stroller reminding me, \"Hey, keep rolling\"\nI don't know, maybe she has with a prick of a blade of grass\nI've been laying on way too long, got me itchy\nGot up and roamed a lil' more\n\nHearing Andre wrestle with his faith and flirt with nihilism while looking for signs of his mom. And using some beautiful imagery to show how she might be talking to him just..man hits me. Andre has always had been an amazing rapper on a technical level but his emotional verses are always my favorite. I have a hard time not having him as my GOAT after hearing verses like this . \n\nAlso I think Kanye should've served a prison sentence for not having this on the initial Donda release lmao had that half baked Pop Smoke on it and not this lol", "label": 0}
{"text": "It doesn’t, no, but it’s more understandable given the circumstances, you get me? \n\nHe had the money, AND time to distance himself, but didn’t. Clearly he likes playing big man with the money. Being able to quit, but diving back in tenfold, that shit is mega pos worthy u right lmao", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [Sade Adu - Young Lion](https://music.apple.com/us/album/young-lion/1761189584 \"Confidence: 88%\")\n\n\\[Deezer]: [Sade Adu - Young Lion](https://www.deezer.com/track/2934138031 \"Confidence: 88%\")\n\n**[Links to search pages]:** [Apple Music](https://music.apple.com/us/search?term=sade%20young%20lion) || [Amazon](https://music.amazon.com/search/Sade+Adu+young+lion) || [Bandcamp](https://bandcamp.com/search?q=Sade+Adu+young+lion&item_type=t) || [Deezer](https://deezer.com/search/sade%20young%20lion/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=Sade+Adu+young+lion) || [Tidal](https://listen.tidal.com/search?q=Sade+Adu+young+lion) || [YouTube](https://youtube.com/results?search_query=Sade+Adu+young+lion) || [YouTube Music](https://music.youtube.com/search?q=Sade+Adu+young+lion)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "Doesnt make him a good person who should he admired bro lol", "label": 0}
{"text": "Brooklyn’s finest ", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Das EFX - Dedicated](https://open.spotify.com/track/2Oi2wECk5gYcUUfcRBwUT4 \"Confidence: 100%\")\n\n\\[Apple Music]: [Das EFX - Dedicated](https://music.apple.com/us/album/dedicated/357815606 \"Confidence: 100%\")\n\n\\[Deezer]: [Das Efx - Dedicated](https://www.deezer.com/track/7238802 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Das EFX - Dedicated](https://soundcloud.com/dasefxofficial/dedicated \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/das%20efx%20dedicated) || [Apple Music](https://music.apple.com/us/search?term=das%20efx%20dedicated) || [Amazon](https://music.amazon.com/search/das+efx+dedicated) || [Bandcamp](https://bandcamp.com/search?q=das+efx+dedicated&item_type=t) || [Deezer](https://deezer.com/search/das%20efx%20dedicated/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=das+efx+dedicated) || [Tidal](https://listen.tidal.com/search?q=das+efx+dedicated) || [YouTube Music](https://music.youtube.com/search?q=das+efx+dedicated)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "i recommend going through it front to back album by album because it's all quality and i think you can hear the growth and shifts between them. it's worth the effort!", "label": 0}
{"text": "I hope he rotes in there, I don’t feel bad at all", "label": 0}
{"text": "Anyone has flacs pls", "label": 0}
{"text": "Check that Kiss of Life album", "label": 0}
{"text": "That’s usually how I check out older artists unless they have an absurdly long discography", "label": 0}
{"text": "As someone who isn't much of a sneakerhead, I learned a lot from his episode of [Full Size Run](https://youtu.be/9e1X9_WzEcc?si=pUT6D6BeeS4h1peF). Dude was a passionate scholar.\n\nAlso, please get check-ups. 58 is too young, legend or not.", "label": 0}
{"text": "The fact it was given to him in the first place is a grandiose failure on behalf of the Chicago government. Anyone with more than four brain cells knows this person is not a role model and doesn’t deserve accolades on a municipal level", "label": 0}
{"text": "Man whaat? In 100 years they will say that people like Von, Jeff, Durk, everyone. We’re victims of a racist system. That was looking to take advantage of them by placing them in impoverished communities. Go watch Tales From The Hood where the cops kill “Martin” “Moorehouse.” \n\nThey put a key of coke in his trunk and inject him with heroin. Ruin his reputation. The fbi killed Fred Hampton, and probably MLK Jr. and probably Malcolm X. \n\nThey were determined to not allow black people to rise up. Hampton was accomplishing this. Reducing the violence among the gangs and uniting the black people in Chicago. They were going to be a major force to be reckoned with. The FBI didn’t even investigate Frank Mathew’s drug dealing bc they didn’t believe a “hard r” could 1) be intelligent enough to make the contact he did and 2) be able to navigate around with and through the cosa nostra. \n\n. \n\nSite of Black Panther Party Raid, Fred Hampton’s Death\n\nThe FBI believed that Hampton’s leadership and talent for communication made him a major threat among Black Panther leaders. It began keeping close tabs on his activities. Investigations have shown that FBI Director J. Edgar Hoover was determined to prevent the formation of a cohesive Black movement in the United States. Hoover believed the Panthers, Young Patriots, Young Lords, and similar radical coalitions that Hampton forged in Chicago were a stepping stone to the rise of a revolution that could cause a radical change in the U.S. government.[33]\n\nThe bed and room where Hampton was fatally shot during the raid, showing a large amount of blood on his side of the mattress and numerous bullet holes in the walls.\nThe office of Cook County State’s Attorney Edward Hanrahan organized the raid, using officers attached to his office.[48] Hampton had recently strongly criticized Hanrahan, saying that Hanrahan’s talk about a “war on gangs” was really rhetoric used to enable him to carry out a “war on black youth”.[49]", "label": 0}
{"text": "I love that no one bats an eyelash at a super smooth Sade track being posted in a **hip-hop subreddit.**  Such is her power.  Man her voice has lost none of its impact - but is anyone else picking up the autotune?  I think it's an affect, she can hit any note she's singing here.  This is good as hell.", "label": 0}
{"text": "Damn, that’s crazy. He wasn’t even that old.", "label": 0}
{"text": "Tomorrow the anniversary of Love Deluxe as well, good weekend for Sade fans😩🔥", "label": 0}
{"text": "*Love Deluxe* is so good it's superlative.  Start there!", "label": 0}
{"text": "Yeah but Billboard didn’t count that one million for Jay-Z when he tried that for *4:44, Magna Carta* and Rihanna’s *Anti*. Probably why Jay started taking shots at Billboard. \n\nhttps://www.billboard.com/pro/jay-z-scores-14th-no-1-album-on-billboard-200-album-chart-with-444/\n\n >4:44 was initially issued on June 30 (via S. Carter Enterprises/Roc Nation) for one week of streaming exclusivity through Tidal. However, Tidal did not report data for the album to Nielsen Music for the week ending July 6, so the album did not debut on the July 22-dated chart. (In addition, by July 2, the album was also offered as a free download — sponsored by Sprint — via the web site 444.tidal.com. The free downloads were ineligible to chart, per Billboard’s current pricing policy.)", "label": 0}
{"text": "I mean I think they drawing a contrast to the crimes committed not the color of the skin of the people in question. Having a coke problem that takes your life is vastly different than paying to take the lives of others. They also stated \"allegedly**\" to make it clear that they are not considering the person guilty.", "label": 0}
{"text": "You haven't heard \"All My Life\"?\n\nWith the children in the chorus?", "label": 0}
{"text": "Yeah I gotta run back that FSR episode man, he was talking a lot there fr!", "label": 0}
{"text": "I love that verse until I hear Andre moaning in my ear.", "label": 0}
{"text": "Damn", "label": 0}
{"text": "This is legendary!", "label": 0}
{"text": "US Marshals don't get involved unless it's Federal.", "label": 0}
{"text": "There are definitely some solid episodes from the newer seasons, I just miss the loose feel of the show. It's been annoyingly wholesome for a while tho. Give me \"You're the worst kind of autistic\" again lol", "label": 0}
{"text": "Quit playin, that mf guilty lol", "label": 0}
{"text": "Smino is just too good, man. He always brings it on his features", "label": 0}
{"text": "Two bananas for $1 one banana for $.60 you get the two you up $.10 do that six times that’s a whole new banana just for staying in business", "label": 0}
{"text": "Love her pro transgender message here", "label": 0}
{"text": "It works on Kingdom Hearts rules, you can open anything in the area", "label": 0}
{"text": "Nelly Furtado at least has other hits though, and is getting asked to do tiny desk concerts cause those songs still get played. Her and Timbaland had some classic singles. In my experience, unless you're really really old, or really young. People know Promiscuous everywhere.", "label": 0}
{"text": "even a collab w kpop group Straykids lol", "label": 0}
{"text": "I feel like the title of this now trilogy and the release of each of them show exactly why I find him to be such a perfect rapper, and why they’re my favorite duo. The first album was released only five days after another (great) album of his Dollars “N” Sense, and it was his 19th project in four years. By AOTYs count this is his 69th, and it comes only TWO days after Tha Myth Who Never Quit 2.\n\nI’ve listened to the album and it’s great it’s everything I want from the two of them. The consistency from the both of them is crazy, and on the last project he said Craven sent him a 50 clip and he probably rapped on every beat. The difference between the first one and these last two is huge and you can see how much both of them have changed since then. I said as a joke I wanted three more albums from him after Machine Gun Vocabulary, and I might get more than I asked for. Listening to either of them is just the gift that gives and keeps on giving.", "label": 0}
{"text": "Lessssgoooo", "label": 0}
{"text": "Lol I’m pretty young and only found out about Promiscuous through TikTok. In a country with hundreds of millions of people though, I can understand the divide.", "label": 0}
{"text": "I’m not talking about a song nigga I’m talking about how they move in real life 😂", "label": 0}
{"text": "The part where he’s like “hey Mrs Donda, if you see my momma, tell her I was twisting out that girl in Sunday School lololol” is hilarious, but yeah that’s a HOF verse overall", "label": 0}
{"text": "Learn how to read he didn't say that", "label": 0}
{"text": "Well he smoked an illegal substance in a public venue. Presumably indoors. I'm just assuming that smoking indoors is illegal in Romania, which would be a separate charge from the possession of the illegal substance. I don't know the ins and outs of their legal system, but where I'm from it's not uncommon for other charges to be laid because of paraphernalia that people have with their drugs. \n\nPossession of drugs and a scale could get you possession charges and intent to distribute charges, for example.", "label": 0}
{"text": "Interesting that this is released as Sade Adu and not Sade, must be because the rest of the band isn't involved in this track?", "label": 0}
{"text": "> I guess it’s hard to change when you’re 50+\n\nYeah that’s probably it\n\nLotta ups and downs for the Hit Fam", "label": 0}
{"text": "I always wanted the DJ Clark Kent SB's. Really one of the first SB's that got me into dunks. RIP to the legend in two games like Peewee Kirkland.", "label": 0}
{"text": "Upvoted", "label": 0}
{"text": "my moneys on process/technical shit, and not \"they didnt do it\"", "label": 0}
{"text": "This is so funny lmaooo. I love hearing about this typa stuff from other cultures.", "label": 0}
{"text": "Haha was that your rap sign off??", "label": 0}
{"text": "Sade is easily and by far the goat", "label": 0}
{"text": "U.S. Marshals primarily handle federal matters. They are responsible for enforcing federal laws, apprehending federal fugitives, and providing security for the federal judiciary. Their duties include executing federal court orders, managing seized assets, and operating the Witness Security Program. While their focus is on federal cases, they may also support local law enforcement in certain situations.\n\nI think this is California’s state case. They are involved here to transport durk to California is my guess. ", "label": 0}
{"text": "tbf to bro I edited my comment after he pointed out that I was in fact assuming him to be guilty. I am definitely pointing out that it's an asinine comparison between Mac and Durk though", "label": 0}
{"text": "We don't allow posting of Itunes or Spotify links (streaming services that require login) unless they are [FRESH] or [NOW ON STREAMING], please repost with a link to the song that does not require a login to listen.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "Fuck man you weren’t wrong, that was legit heartwarming. Thanks", "label": 0}
{"text": "Or what?", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Devin Millar - Hoody](https://open.spotify.com/track/0RrDt2AGte16zAQSyya9DR \"Confidence: 100%\")\n\n\\[Apple Music]: [Devin Millar - Hoody (Radio Edit)](https://music.apple.com/us/album/hoody-radio-edit/1721094703 \"Confidence: 100%\")\n\n\\[Deezer]: [Devin Millar - Hoody](https://www.deezer.com/track/2582848602 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Devin Millar - Hoody](https://soundcloud.com/devin-millar/hoody \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/devin%20millar%20hoody) || [Apple Music](https://music.apple.com/us/search?term=devin%20millar%20hoody) || [Amazon](https://music.amazon.com/search/devin+millar+hoody) || [Bandcamp](https://bandcamp.com/search?q=devin+millar+hoody&item_type=t) || [Deezer](https://deezer.com/search/devin%20millar%20hoody/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=devin+millar+hoody) || [Tidal](https://listen.tidal.com/search?q=devin+millar+hoody) || [YouTube Music](https://music.youtube.com/search?q=devin+millar+hoody)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "throwing him away for killing other people lmfao", "label": 0}
{"text": "Weren't they saying he died a week or two ago but then it was reported to be incorrect? I wonder if he was on the way out at that point", "label": 0}
{"text": "Sophisti-pop is such an immaculate genre and nobody did it better than Sade.", "label": 0}
{"text": "What!?? No way, gotta go in order.", "label": 0}
{"text": "Why are you as a man", "label": 0}
{"text": "You heard any of these?\n\nErika de Casier - Still\n\ndazegxd - exhibition mode \n\nkelly lee owens - dreamstate", "label": 0}
{"text": "Mac Miller made hard drugs sound about as much fun as Elliott Smith did", "label": 0}
{"text": "Yeah I was surprised so many people discovered him because of Drake. If you paid attention to Chicago outside of ye and I guess Sosa, you would have seen his name", "label": 0}
{"text": "Babe, wake up! New Sade", "label": 0}
{"text": "its grippy", "label": 0}
{"text": "SADE?? SADE???", "label": 0}
{"text": "Stick to opioids. and pot, loser. You'll be joining Durk someday soon, lol.", "label": 0}
{"text": "> Watching instagram clips and knowing lore literally is just normal as shit. Get over it. Some of you do the shit Ross does for free and y'all STILL get it wrong Imfao\n\nAnd those people are weird too. But again ignoring literally all forms of any journalistic integrity because we're not going to even pretend he fits that bill at all. He's a damn weirdo for his voyeurism.", "label": 0}
{"text": "I see now", "label": 0}
{"text": "Rest in peace to the best sneaker legend", "label": 0}
{"text": "In Florida too, he’s cooooked", "label": 0}
{"text": "Tbf I doubt he would have to make up a story...", "label": 0}
{"text": "Or you meet in a location and use fuckin pen in paper/Word of mouth to plan the thing. Most criminals are just dumb and reactionary", "label": 0}
{"text": "still did em and fucked prostitutes. not sure what’s key worthy on that", "label": 0}
{"text": "Shocking. 🙄", "label": 0}
{"text": "Man why are you fighting this battle so hard lmao", "label": 0}
{"text": "Funny how your post history is all just you being a douche for no reason, im sure you have a lot of friends", "label": 0}
{"text": "such a tone deaf statement and you know why", "label": 0}
{"text": "Alright man have a good time spending your Friday night on this", "label": 0}
{"text": "Says the guy who posts in a Cali gang banging subreddit, lol. Why are hip hop fans so cringeworthy?", "label": 0}
{"text": "Haha why is that? Why do rappers gotta kill each other? Is there a legit reason or just can't control their violent, hateful urges?", "label": 0}
{"text": "only back in here if someone responds, which just happened.", "label": 0}
{"text": "[you ever seen this?](https://youtu.be/KbRYMhT9xsY?si=xWwnm5a69fcZySFA)", "label": 0}
{"text": "because you take away the \"rapper\" label and it's just regular street shit, which is all a lot of these dudes know unfortunately.", "label": 0}
{"text": "If you had any reading comprehension skills whatsoever you would have seen that my comments about all 3 of the things you listed were mostly giving people friendly advice, but you dont which is why we are in this conversation", "label": 0}
{"text": "Damn, feel like I haven’t seen you in a minute thizzco. How ya been OG?", "label": 0}
{"text": "Long Live, RL\nfarewell to the Halloween mix series. \nIt was an amazing ride", "label": 0}
{"text": "As sick as RL Grime is I don’t think this is the right sub", "label": 0}
{"text": "No surprise. This list is wack af, idk what their criteria is for the order but it's wrong", "label": 0}
{"text": "Is this really a new song? her voice still sounds amazing considering diamond life now dropped 40 yrs ago. Its a pretty song, the autotune kind of put me off a little tho. does anyone know if theres been talks about a new album?", "label": 0}
{"text": "Yeah I’m just slow on the uptake", "label": 0}
{"text": "\"Im just giving people friendly advice on how to gang bang\"\n\nYeah good shit dude. You're a real credit to the community lmao.", "label": 0}
{"text": "This looks clever as hell but I do not get it", "label": 0}
{"text": "You can think systemtic racism is real without praising serial killers.\n\nYall have lost the plot. Plenty of black men in the hood dont murder people 🤷🏽‍♂️. It almost seems racist af to downplay all these grown mens choices. \n\nIts funny yall never bring up how most people in the hood are just normal and chilling. Yet somehow u want me to give a pass to the 10% of the community who wanna crashout and actively destroy said community. \n\n\nSeems like these days u can justify any shitty behavior as long as the person is “opressed” or thinks they are “opressed” LOL. \n\nRadicals love to paint things as black & white with little to 0 nuance.", "label": 0}
{"text": ":')", "label": 0}
{"text": "Go back to levitating in your room bro 🤦‍♂️", "label": 0}
{"text": "Responsible for many great records. We're losing too many key figures in Hip Hop the last couple of years. RIP", "label": 0}
{"text": "Peak Simpsons clears basically everything, but unfortunately that was more than two decades ago and it’s still shambling on", "label": 0}
{"text": "Sky's The Limit is my favorite BIG song. Clark Kent sampling Bobby Caldwell>>>", "label": 0}
{"text": "Overworked + gf stuff, just exhausted in general\n\nHave you been to a football game yet? Go soak up that ambiance, they’re not gonna be undefeated forever", "label": 0}
{"text": "Dang. Great producer and an all-time name", "label": 0}
{"text": "Sheek is so underrated. Walk Wit Me and After Taxes are classics. His verse in KYAG remix is great. Always outshined by Jadakiss and in a way Styles, but I’d argue he’s on par with both. I stay listening to Sheek to this day", "label": 0}
{"text": "Thank your for your contributions to the game,rest easy 🌹🌹🌹🌹🌹🌹🫡", "label": 0}
{"text": "Yeah, I was at the season opener! It’s funny, the year I get here all of a sudden the football program has some of the most success that they’ve had in like decades lol. \n\nDefinitely expecting us to lose to Ohio State next month tho lol", "label": 0}
{"text": "Dirk should have left the states years ago\n\nAfter Young Thug rappers that could even sniff a Rico should have jumped State", "label": 0}
{"text": "a new sade album will cause a second baby boom", "label": 0}
{"text": "I don't think it's brain dead. Just laziness. Have you ever went on a mission? Niggas voice their concerns but they're silenced by another nigga saying \"you being paranoid/scary\". Then you let it go. Then you get arrested. Mfs are arrogant. They think it couldn't possibly happen to *them*. Na, *they'll* never get caught because they're just that lucky or the police are just that stupid. That's how niggas go to jail 99% of the time. Thinking they got the luck of the Irish out this bitch.", "label": 0}
{"text": "Giving a drill artist a key to the city is incalculable lol", "label": 0}
{"text": "hard disagree, Close Enough is way more hard hitting satire than Regular Show ever was, with way more relatable characters and smarter writing. Did you watch past the first few episodes? Most people didn’t give it a fair chance and it sucks they never will since you can’t stream it anywhere.", "label": 0}
{"text": "It is, it has rap mixes.", "label": 0}
{"text": "Two hobos having sex with a hay bale sounds better", "label": 0}
{"text": "💯", "label": 0}
{"text": "Thats a thread about a high schooler who got jumped and robbed but nice try again you fucking dumbass", "label": 0}
{"text": "Wow 😀", "label": 0}
{"text": "Off the Grid is a classic fym ?", "label": 0}
{"text": "> when most of them are probably horrible people\n\nI mean that's kind of what makes it fun", "label": 0}
{"text": "okay?", "label": 0}
{"text": "They’re arresting everyone but Lil Baby", "label": 0}
{"text": "WAT. I just assumed she was dead tbh", "label": 0}
{"text": "Dog thats him saying those words. He was open about his drug use but he wasn’t glorifying it", "label": 0}
{"text": "And Hit Boy might be the one having to foot the bill for his legal fees and stuff.  Reminds me of how Layzie Bone said that he spent millions trying to keep his brother Flesh-n-Bone out of jail.", "label": 0}
{"text": "the \"I'm different\" soundbite always made me laugh", "label": 0}
{"text": "It’s a mix of both but you really need a lack of awareness and be just plain stupid to wound up in places where it’s “hell on Earth” in Chicago. Don’t be like Batman’s parents and decide to take a shortcut through a dark alley in a sketchy part of the city, you’re just asking for trouble then", "label": 0}
{"text": "Yeah I think this is her first solo record", "label": 0}
{"text": "[Thank you Clark Kent](https://youtu.be/gwbUtfEJ8lE?si=1sMcowH1nVwEz12F), RIP", "label": 0}
{"text": "You nailed it.", "label": 0}
{"text": "I took it to mean the same a lot of folks from 2Pacs gen lament, back then so much more of the most popular music was deep real shit but nowadays there are far fewer doing numbers like Kendrick. However it has been quite a while since I read the full quote so I could be wrong but recall other things he’d said here and there solidified for me at the time that was what he was getting at (genuinely seems to many old heads the music industry over the years is far less keen on making stars out of such artists)", "label": 0}
{"text": "So was theirs", "label": 0}
{"text": "Respect ✊🏾", "label": 0}
{"text": "Not at all. The second you send a text it’s wraps. All the police has to do is contact your cell company. Burner phones would be tougher I admit. Paper the police would actually have to LOOK first off, 2nd a piece of paper is easy to discard and never to be traced again. \n\nThere’s absolutely no way using pen and paper is more risky than cell phones.", "label": 0}
{"text": "bobs burgers is the old navy of comedy", "label": 0}
{"text": "Everywhere https://ffm.to/khrometape", "label": 0}
{"text": "uncle Ruckus ass", "label": 0}
{"text": "He got the key to the small town of Bellwood not Chicago", "label": 0}
{"text": "Omg. Comprehension is so low with yall. My 7 year daughter knows how to identify context clues. Smh", "label": 0}
{"text": "Can't Tell Me Nothing is THE Kanye song", "label": 0}
{"text": "Pen and paper was the original \"burner phone\". You read the note and then burn it. That's where burner phones got their name. Paper doesn't leave a trail of your messages and location on a remote server that you don't have access to like burner phones do. Ditching a phone makes it harder to prove you wrote the messages. It doesn't destroy the messages.", "label": 0}
{"text": "Piccolo is Italian for little, or something like that.", "label": 0}
{"text": "How long you going to jail for Lil Durk?\n\"All my life\"", "label": 0}
{"text": "I mean no one really bats an eyelash at most R&B posted here", "label": 0}
{"text": "otis is one of my favorite beats", "label": 0}
{"text": "Yeah I ain't reading all that, but that's crazy. Or sorry that happened.", "label": 0}
{"text": "Wtf is happening in these replies LMFAO", "label": 0}
{"text": "What a run", "label": 0}
{"text": "🐐", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Eric Reprid - SUKI](https://open.spotify.com/track/2U8nzY4qxf0slSREPlqLtr \"Confidence: 100%\")\n\n\\[Apple Music]: [Eric Reprid - Suki](https://music.apple.com/us/album/suki/1736235779 \"Confidence: 100%\")\n\n\\[Deezer]: [Eric Reprid - SUKI](https://www.deezer.com/track/2706332152 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Eric Reprid - SUKI [Live Mic Performance].mp3 -- uploaded by KingBamba](https://soundcloud.com/sheikh-amoudou-bamba-sakho/eric-reprid-suki-live-mic \"Confidence: 89%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/eric%20reprid%20suki) || [Apple Music](https://music.apple.com/us/search?term=eric%20reprid%20suki) || [Amazon](https://music.amazon.com/search/eric+reprid+suki) || [Bandcamp](https://bandcamp.com/search?q=eric+reprid+suki&item_type=t) || [Deezer](https://deezer.com/search/eric%20reprid%20suki/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=eric+reprid+suki) || [Tidal](https://listen.tidal.com/search?q=eric+reprid+suki) || [YouTube Music](https://music.youtube.com/search?q=eric+reprid+suki)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "What a beautiful track", "label": 0}
{"text": "Like father, like son.", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Devin Millar - BFD](https://open.spotify.com/track/6ySeK08A82zkWb58iwjaJX \"Confidence: 100%\")\n\n\\[Apple Music]: [Devin Millar - Bfd (Studio Session)](https://music.apple.com/us/album/bfd-studio-session/1638212320 \"Confidence: 100%\")\n\n\\[Deezer]: [Devin Millar - BFD](https://www.deezer.com/track/1853617997 \"Confidence: 100%\")\n\n\\[Soundcloud]: [Devin Millar - BFD](https://soundcloud.com/devin-millar/bfd \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/devin%20millar%20bfd) || [Apple Music](https://music.apple.com/us/search?term=devin%20millar%20bfd) || [Amazon](https://music.amazon.com/search/devin+millar+bfd) || [Bandcamp](https://bandcamp.com/search?q=devin+millar+bfd&item_type=t) || [Deezer](https://deezer.com/search/devin%20millar%20bfd/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=devin+millar+bfd) || [Tidal](https://listen.tidal.com/search?q=devin+millar+bfd) || [YouTube Music](https://music.youtube.com/search?q=devin+millar+bfd)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "Love this fluffy mfer", "label": 0}
{"text": "I just like dunking on retards like you. You're not a loser because of white supremacy, you're a loser because you're a drug addict. Trivializing people's sincere beliefs as Muslims isn't because they were accepted by Christians you fucking jack off.", "label": 0}
{"text": "What specific type of cancer did i aquire from that ass website?? jesus fucking christ. Anyway yea hes cooked unfortunately", "label": 0}
{"text": "amine is his middle name", "label": 0}
{"text": "We don't allow direct image posts. If it concerns a screenshot of social media posts, please post it as a self post, because image posts can't be updated if the situation changes.\n\nPlease resubmit this post as a self post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "It's true. Did a road trip last year and when we got to Chicago, we literally couldn't get in because we didn't have a key. It's crazy", "label": 0}
{"text": "PLEASE DO. You wont regret it. Some of my favorite music ive ever heard is from her. I was at that point of hearing her music and seeing her on t-shirts so i took it as a sign. Now shes top 3 favorite artists of all time for me", "label": 0}
{"text": "The 2010's Chitown drill scene is the most toxic movement in the entire history of hiphop and that's sating a lot. If you think of the amount of carnage these dudes have brought to themselves and the city,. \n\nKeef was the only smart one among them when got the hell outta Chicago. Durk showed how \"smart\" he was when he was promoting King Von as if he was his long lost brother. Some dudes just can't live the hood alone.", "label": 0}
{"text": "would NOT surprise me one bit bro", "label": 0}
{"text": "Part of it sure but that’s still a dubstep mix", "label": 0}
{"text": "Soberness is used as such an arbitrary measure of credibility lmao", "label": 0}
{"text": "So many people say this, I’m curious I need to check some of interviews", "label": 0}
{"text": "this reminded me that i bought that halloween alfredo t shirt and it fits like absolute shit. fuck", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Apple Music]: [Sheek Louch - Gorillaween V.6](https://music.apple.com/us/album/gorillaween-v-6/1775752727 \"Confidence: 100%\")\n\n\\[Deezer]: [Sheek Louch - Gorillaween V.6](https://www.deezer.com/album/660576691 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Apple Music](https://music.apple.com/us/search?term=sheek%20louch%20gorillaween%20v.6) || [Amazon](https://music.amazon.com/search/Sheek+Louch+gorillaween+v.6) || [Bandcamp](https://bandcamp.com/search?q=Sheek+Louch+gorillaween+v.6&item_type=a) || [Deezer](https://deezer.com/search/sheek%20louch%20gorillaween%20v.6/album) || [Soundcloud](https://soundcloud.com/search/albums?q=Sheek+Louch+gorillaween+v.6) || [Tidal](https://listen.tidal.com/search?q=Sheek+Louch+gorillaween+v.6) || [YouTube](https://youtube.com/results?search_query=Sheek+Louch+gorillaween+v.6&sp=EgIQAw%25253D%25253D) || [YouTube Music](https://music.youtube.com/search?q=Sheek+Louch+gorillaween+v.6)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "Search up “rl grime” in the sub. Every years mix gets over 1k upvotes. Sorry you are wrong", "label": 0}
{"text": "Roethlisberger is still called rapistberger but Winston is the hero that's going to save the day in Cleveland. It's not always race", "label": 0}
{"text": "Halloween V is all time classic mix and this one was an awesome way to go out. Thank you RL Grime for the memories", "label": 0}
{"text": "🙏🏿", "label": 0}
{"text": "It's never about race to some people", "label": 0}
{"text": "so many great years for this mix, but [Halloween V](https://soundcloud.com/rlgrime/halloween-v) is still *the* Halloween mix to me", "label": 0}
{"text": "i'm crine at this exchange oh my god 😂😂", "label": 0}
{"text": "\"He tried so hard to change..\" 🤣", "label": 0}
{"text": "you gotta check out her whole discography g. stronger than pride my favourite album but all are so good. I've only just started listening to her 2 years ago now all my friends call her the goat haha", "label": 0}
{"text": "Bro was on a generational run that year his Coachella set in the Sahara was stuff legends are made of", "label": 0}
{"text": "You don't know what you're talking about. Or not enough of what you're talking about, I mean. This has nothing to do with your feelings about the NOI, durk is orthodox sunni muslim. Stop conflating the two and putting them together.", "label": 0}
{"text": "How does a producer become washed? In my mind, it makes more sense for a producer to get even better with age. More access to tech, more experienced ears, more knowledge accumulated so they can experiment more. But producers such as Kanye and No ID have fallen completely off the cliff", "label": 0}
{"text": "I finally got to see him at the Halloween XI show he did at the Kia Forum, the dude knows how to put a set together", "label": 0}
{"text": " Not giving it to a mid artist that bloats his albums for $", "label": 0}
{"text": "lol I’m getting downvoted for saying adults don’t have time to listen to super bloated mid repetitive albums?", "label": 0}
{"text": "I think you're confused, you're the one with the fried attention span, druggie. I can refer you to some rehabs if you like though.", "label": 0}
{"text": "No fucking way", "label": 0}
{"text": "lol you talking about that Hasan/H3 shit? I really can’t wrap my mind round that whole thing", "label": 0}
{"text": "Fivio forgin type beat.", "label": 0}
{"text": "Because there are like 8 co-defendants and a lot of evidence.\n\nI have no opinion on Thug’s guilt or innocence but even strong cases can take a long time to prove.", "label": 0}
{"text": "[yea, this is a pretty good video from Vice talking about slang for foods](https://youtu.be/FtW7eaSvd6A?si=ibCyZMiblN27RSG_)", "label": 0}
{"text": "No I didn’t. I literally said it’s not an excuse. You’re seeing and reading what you feel. Having empathy for the conditions that make people prone to violence isn’t a bad thing - it’s a higher level emotion that separates us from animals. He will have to accept what he chose, but I’d be damn if I believed humans were born rotten like this. His choices, probably amplified by his early conditions, made him rotten. Then he never grew up and never chose right when he knew better. That’s on him", "label": 0}
{"text": "Taking away the key to the city doesn’t mean he’s guilty and I’m not sure why you think it does.", "label": 0}
{"text": "Not this year ig", "label": 0}
{"text": "Somebody on twitter said Drake is 40 and still celebrating his birthday. Lmaooo like bro it’s such a ridiculous comment but these dudes be funny asf sometimes.", "label": 0}
{"text": "I'm going to miss this series so fucking much. Can't believe its been over a decade. RL forever GOATed.", "label": 0}
{"text": "He’s like the nigga version of the “I’m not like the other girls” trope.", "label": 0}
{"text": "YOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "label": 0}
{"text": "Which is also a dumb destination because Italy has an extradition treaty with the US..", "label": 0}
{"text": "We don't allow direct image posts. If it concerns a screenshot of social media posts, please post it as a self post, because image posts can't be updated if the situation changes.\n\nPlease resubmit this post as a self post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "Em never really labeled himself as a popstar, he was a rapper who used famous pop singers for hooks occasionally. He doesn't have the universal appeal required of pop music either. When it comes to his best material, most people who only have listened to his radio hits would probably be very put off. His first two records are very acquired tasted for most non hiphopheads, but you can throw on almost any song from The College Dropout and your parents will get the appeal instantly. Kanye had an album that defined pop music for decade, while Eminem sold a lot of albums and was mostly an inspiration to very technical rappers who had no interest in pop.", "label": 0}
{"text": "Even calling on the phone is less risky cuz the conversations aren’t recorded either.  It would show they made contact but not what was said", "label": 0}
{"text": "😂😂😂", "label": 0}
{"text": "🤨 if that's the case why would they take the key back? It's bullshit", "label": 0}
{"text": "The age comments on social media get me. I seen dudes just say \"you graduated in 2016 🤣🤣🤣\" like no joke or nothing its just fucking dumb but funny", "label": 0}
{"text": "That arrogance is fucking annoying. I was never about that life but had homies who used to do that shit and *I* would be like \"Maybe you should fall back. Go ahead tomorrow\" and verbatim they'd say \"Fuck outta here with yo scary ass\"\n\nSo yea he had it comin.", "label": 0}
{"text": "No offense dawg but did moms drink when she was pregnant?", "label": 0}
{"text": "Fifteen years later and Keef is one of the only dudes from that generation of OBlock/drill to not see his life in a cell (or over), it’s really crazy", "label": 0}
{"text": "It doesn’t matter if he didn’t pull the trigger himself.  If he paid for and masterminded it, that’s the same thing in the laws eyes", "label": 0}
{"text": "\"She suck on my willy, it's quite delightful\n\nIf I catch you in West Gloucestshire, you'll catch the rifle\"", "label": 0}
{"text": "Wheezy is the definition of washed, those whippets fried his brains out. Metro is semi-washed, but he’s trained his ears better so he can hold his own even with minimal effort and be successful with it. Older producers like Timbaland, Swizz Beats, Scott Storch have all ran outta juice.", "label": 0}
{"text": "You’re white aren’t you?", "label": 0}
{"text": "Durk just like me fr", "label": 0}
{"text": "Didn’t you know? Obama heard Bizarre’s verse on Fight Music and decided to run for president", "label": 0}
{"text": ">And he was trying to fly to Italy\n\nNo extradition with Chicago lmao", "label": 0}
{"text": "Yeah without Smino I wouldnt run this back", "label": 0}
{"text": "Drake is 40?? For some reason I still thought he was 35 or some shit.", "label": 0}
{"text": "Lmao uzi has an unreleased song that almost matches this story", "label": 0}
{"text": "Hes 38 lol", "label": 0}
{"text": "I think it started adding more pop/dance tracks around 2010-2011 (while still keeping hip hop/r&b on its playlist while having a more balanced approach) then started decreasing the dance-pop tracks by 2014-2015 while still retaining the rhythmic pop titles and becoming more heavy on Hip hop/R&B titles. I think in mid-2016 they started going officially back toward a hip hop based format significally dropping most the remaining dance pop titles though it would increase rhythmic pop with some dance titles again by 2017. Seems like they already went toward what they used to be in 2018 but they also apparently added reggaeton to its mix while being heavy on hip hop and having some dance/rhythmic crossover content in their playlist.", "label": 0}
{"text": "istg he just said “i just left 35” few months ago in that interview with yachty but just realized it was over 2 years ago atp. time flies fr", "label": 0}
{"text": "Yeah I'm totally sure all these charges and allegations for the past how many fucking years are all propaganda and lies lol.", "label": 0}
{"text": "This song was okay but I think Adam was my favorite of the 2. Smino definitely smooth af on this one though", "label": 0}
{"text": "might be my favourite Megan project, full of bangers", "label": 0}
{"text": "If there’s one person you should say put your hands where my eyes can see to, it’s Diddy.", "label": 0}
{"text": "Please let a tour announcement come next please let a tour announcement come next", "label": 0}
{"text": "Lmfao beat him to it by 10 hours\nhttps://youtu.be/qCw9JEF3lIc", "label": 0}
{"text": "He isn’t helping the speculation that all these niggas knew. I’m just thinking hard who ACTUALLY knew about the freak offs, like a whole list needs to come out eventually.", "label": 0}
{"text": "That’s literally a teenager. Still in HS or barely out. Not old enough to drink. They are still a teen even if they’re of age", "label": 0}
{"text": "Dangerous would be an understatement.", "label": 0}
{"text": "I think with his accent and how quickly he can pack bars in, plus his slant rhyming, there's a \"learning curve\" to being able to understand what the hell he's saying. Sucks, cause he's a top 5 hip-hop artist right now in my eyes.", "label": 0}
{"text": "Was it the tiger? Please tell me it wasn't the tiger!", "label": 0}
{"text": "Yep. Attorney that dealt with idoc and prison system often. People become islamic for this in prison. Also the hats.", "label": 0}
{"text": "I don’t know if he can rap but I like the shit lol", "label": 0}
{"text": "Call us oldheads but he aint wrong. Go gobble all that bullshit up. You waiting for some half assed music that he has to put out 4 times lol", "label": 0}
{"text": "Loaded Luxx battle with Calicoe. Luxx puts a nude picture of Calicoe from IG up on the monitor. Busta yells from the crowd that they should keep it up and Luxx jokes about it on stage.   \n  \nBusta was there with Puffy.", "label": 0}
{"text": "Busta trying not to burn his bridges", "label": 0}
{"text": "An operation that large could not possible have been hidden from that many people. Fairly sure almost anyone connected to Diddy knew about it", "label": 0}
{"text": "That wasn't context clues. That was you just poorly filling in gaps because he, in fact, didn't call him white", "label": 0}
{"text": "I never heard of jordan peterson, is it that bad 🥲", "label": 0}
{"text": "Busta is the ultimate zest monster.", "label": 0}
{"text": "> Do you really wanna party with me?\n\nHELL NAH!!", "label": 0}
{"text": "Why would he pick countries that extradite LOL", "label": 0}
{"text": "Mase didn’t get arrested", "label": 0}
{"text": "Busta bisexual as hell ", "label": 0}
{"text": "I don't understand your point then", "label": 0}
{"text": "I like Cordae but I think he’s lost momentum already and it’s hard for rappers like him who are trying to be lyrical and more upbeat in this era", "label": 0}
{"text": "Being penalized for the neighborhood you grew up in…GA is so incessantly racist", "label": 0}
{"text": "Doja Cat is the female equivalent of Kanye", "label": 0}
{"text": "Key as in narcotics. He died before someone could take his drugs away", "label": 0}
{"text": "Probably coerced into a statement by Diddy since nobody is standing up for him.", "label": 0}
{"text": "Proof dropping when?", "label": 0}
{"text": "well no, the post is clearly insinuating that had Mac lived long enough he also would have his key taken away.", "label": 0}
{"text": "What the issue with Durk and King Von?", "label": 0}
{"text": "Need the album badly.", "label": 0}
{"text": "I’m number 6 and I pick up sticks", "label": 0}
{"text": "I never reported you lol. WTF are you even talking about? \n\n\"buck up\"\n\nNobody is afraid of a fake internet gang banger. You probably can't fight for shit, most drug addicts can't lol.", "label": 0}
{"text": "Of course you don't", "label": 0}
{"text": "& it's bullshit every time, they're judging someone who hasn't been convicted= an innocent man", "label": 0}
{"text": "“Like I’m facing a rico how a nigga put a hit out” 🤣", "label": 0}
{"text": "It’s from a pro trans compilation (I think). Side B is a 26 min instrumental by him", "label": 0}
{"text": "Because you don't have one? Ok", "label": 0}
{"text": "I thought about posting the album but I thought there were only a couple tracks that were rap and people would get mad.", "label": 0}
{"text": "He’s probably in my top 25 range. I’ve never disliked an album from him and he has a couple classics or at least borderline. Plus he’s all over 2001", "label": 0}
{"text": "If you’re going to go back and forth you really need to comprehend what is being said. \n\nI know Durk didn’t switch up. I know the image rehaul was total bs. My point is that I’m shocked that he’d be this damn sloppy. My generation and the generation before me would 🤡 their peers for moving this dumb. Now that he’s on record telling them not to use any names? He’ll be lucky if he does football numbers. That DA will be pushing for the death penalty and tbh, he probably should", "label": 0}
{"text": "No words……really only recently learning how integral he was to a lot of careers and how woven into the NY Hip-Hop scene he was….rest up King", "label": 0}
{"text": "yeah lol u see it in SZA, ari Lennox and kali uchis threads lol", "label": 0}
{"text": "her best song imo", "label": 0}
{"text": "Find out the method man track!?", "label": 0}
{"text": "Twice lol", "label": 0}
{"text": "Agreed. The pure emotion in the singing. Damn. I was expecting sexy Sade and got forlorn Sade pummeling my feelings.", "label": 0}
{"text": "Yes, All Red sounds a lot like Future\n\nIt's also a god damn jam\n\nUPSIDEDOWN CROSSES SOMETHIN SOMETHIN SHUT EM UP", "label": 0}
{"text": "\"Only time you buck up to anyone\"\n\nSure thing 🤡", "label": 0}
{"text": "The other song he dropped that day felt more in line w that kinda sruff", "label": 0}
{"text": "Stolen cars is the key all these dudes fucking up, that’s basic shit, oblock did it too, you need a stolen whip when you doing dirt anyway but especially in heavily trafficked area and using personal phones to ping off everything damn got too comfortable", "label": 0}
{"text": "Why is this posted to this subreddit? This isn't hip hop", "label": 0}
{"text": "Being born into poverty fucking sucks", "label": 0}
{"text": "A super fan would be smart enough to hide it", "label": 0}
{"text": "I’m trying to explain to you why your reasoning makes no sense. Instead you’re spreading a serious rumour based on nothing. I can read your comments perfectly fine.", "label": 0}
{"text": "Official. It's from a compilation that they've been dropping records from. \n\n>Earlier in September, the nonprofit Red Hot announced TRAИƧA, a 46-track compilation featuring Sade, Grouper, André 3000, Adrianne Lenker, and more.\n\n>“We’re living in a time when trans people, the most marginalized and vulnerable people in our culture, are being attacked and stigmatized, much like people with AIDS were in the ’90,” he said. “We’re doing this to make sure the culture wars are being fought from both sides.”\n\nWhich totality fits the subject matter of the song, an ode to her trans son.", "label": 0}
{"text": "GOAT series, without which I would not be working as a dj for a living today. Thanks Henry", "label": 0}
{"text": "They gonna say the cassie video is Ai 🤣", "label": 0}
{"text": "I saw RL Grime in 2015 at FPSF festival in Houston. \n\nAt the time, trap EDM, or whatever you wanna call it, existed but was usually either hip-hop heavy or EDM heavy on the spectrum. Like OP says, he bridges the gap between hip hop and EDM. \n\nProbably top five shows I’ve ever seen.", "label": 0}
{"text": "Isn't there even a possibility of the death penalty?", "label": 0}
{"text": "“Is you takin notes on a criminal fucking conspiracy?” 😂", "label": 0}
{"text": "Just a bullshit genre name a few people made up somewhere", "label": 0}
{"text": "I wasn’t commenting on Durk, just in general. I’m not putting them together.", "label": 0}
{"text": "I probably would have went for Azealia Banks, but I'm picking up what you are putting down.", "label": 0}
{"text": "Lose passion?", "label": 0}
{"text": "Fresh? SADE?? In 2024???", "label": 0}
{"text": "NGL I don't know many celebrities and all that but I legit always thought that was Niki Minaj", "label": 0}
{"text": "amen brother 🙏", "label": 0}
{"text": "because everyone loves Sade", "label": 0}
{"text": "do you know other songs like it?", "label": 0}
{"text": "In terms of being the GOAT?", "label": 0}
{"text": "I think the problem is he starting dating (married?) that tennis player. Now he’s just her sidekick. Just like Rocky", "label": 0}
{"text": "aye, for sure let me know lol", "label": 0}
{"text": "Special mention to IX for the absoliteky insane visuaks", "label": 0}
{"text": "They gotta play this at the funeral: [https://www.youtube.com/watch?v=QohDxvDO7-c](https://www.youtube.com/watch?v=QohDxvDO7-c)\n\nRIP.", "label": 0}
{"text": "He did illegal drugs 👁️👄👁️", "label": 0}
{"text": "I heard the killers used it to get to blighttown without going through undead burg", "label": 0}
{"text": "LOL my thoughts exactly.", "label": 0}
{"text": "damn that spiritbox collab was pretty cool. I feel like rico nasty would be dope on that track.", "label": 0}
{"text": "I didn't spread any rumor though. That's the part you seem to be missing. Not a single one of my comments said she raped anyone, and I even said I highly doubt it happened. \n\nThis is why i mentioned reading comprehension. I know you're reading the comments but there's no way you're actually comprehending what you're reading if you think I'm spreading a rumor by saying there is absolutely zero evidence and that I highly doubt it happened. \n\nThis will be my last comment. Please don't delete any of this.", "label": 0}
{"text": "Id put Kanye higher honestly, dude is arguably the most acclaimed artist of the 21st century alongside Kendrick and Radiohead, and the most influential by a good margin. Putting out 7 great projects in a row is no easy feat.", "label": 0}
{"text": "When I give up on finding reasons to celebrate and enjoy life, kill me.\n\n\nIf I dont die, ima still set my birthday alarm to [Flo Rida - Birthday](https://youtu.be/Swck0NjK9Ds?si=GSIghVuncpdtZkxP) when im 99 and pop a bottle and do some dumb shit. ", "label": 0}
{"text": "The visuals elevated it so much.", "label": 0}
{"text": "VII was the last super heavy rap one and it flowed so damn well. IX felt like an awesome mish mash of everything, and the visuals took it to a whole nother level. V is like everyones' favorite lol.", "label": 0}
{"text": "Who fucking cares", "label": 0}
{"text": "end of 2024 looking good af", "label": 0}
{"text": "I still haven’t heard it but that NxWorries is supposed to be incredible", "label": 0}
{"text": "He has very little presence I feel on a track. He’s kind of a low charisma guy which is fine but he doesn’t play into it with his beat selection or lyrics. \n\nI feel like Broke as Fuck is an example of him playing to his strengths. The drums aren’t overpowering, he mixes the standard rap shit with a little more introspection and emotion. Then he glides so effortlessly over the beat change. \n\nThe talent is there he’s just gotta find a lane imo", "label": 0}
{"text": "They need to revise the RICO statute. It is absurd that it can apply in this way.\n\nAt least they should allow anyone facing RICO charges to have a bond amount set, no matter what", "label": 0}
{"text": "If anything this video indicates he would be likely to participate in a freak-off", "label": 0}
{"text": "Get a load of Durk bro. New paperwork came out saying he tried to book two decoy commercial flights to Switzerland and Dubai while booking a private jet to Italy. You cannot make this shit up 😂", "label": 0}
{"text": "You think Muslim’s want to deal with a liar? They take their beliefs very seriously", "label": 0}
{"text": "Notice how I was right? just out of curiosity, why would you assume 50cent would've sided with Dot?  What's the stereotype out there in little suburbia?", "label": 0}
{"text": "Tf you going off about? You probably listen to the dudes music lmao music for goofy lying ass mfkr’s", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Goya Gumbani - Chase The Sunrise](https://open.spotify.com/track/2P4orbo5oZAU8oGn74r2Sm \"Confidence: 100%\")\n\n\\[Bandcamp]: [Goya Gumbani - Chase The Sunrise](https://goyagumbani.bandcamp.com/track/chase-the-sunrise?from=search&search_item_id=4019300599&search_item_type=t&search_match_part=%3F&search_page_id=3806236672&search_page_no=1&search_rank=1&search_sig=2e5f655df1b94ad56f0f7b46790ec8cc \"Confidence: 100%\")\n\n\\[Deezer]: [Goya Gumbani - Chase The Sunrise](https://www.deezer.com/track/3024277481 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/goya%20gumbani%20chase%20the%20sunrise) || [Apple Music](https://music.apple.com/us/search?term=goya%20gumbani%20chase%20the%20sunrise) || [Amazon](https://music.amazon.com/search/goya+gumbani+chase+the+sunrise) || [Bandcamp](https://bandcamp.com/search?q=goya+gumbani+chase+the+sunrise&item_type=t) || [Deezer](https://deezer.com/search/goya%20gumbani%20chase%20the%20sunrise/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=goya+gumbani+chase+the+sunrise) || [Tidal](https://listen.tidal.com/search?q=goya+gumbani+chase+the+sunrise) || [YouTube Music](https://music.youtube.com/search?q=goya+gumbani+chase+the+sunrise)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "being rich doesn't make opsec easier dummy, if anything it makes it harder.", "label": 0}
{"text": "Lol, he most definitely did. A lot of us in the Chiraq Reddit have been aware of this for a long time. Durk has sent a lot of people to their grave.", "label": 0}
{"text": "Hang on to your Love one of my favourite songs ever", "label": 0}
{"text": "Wasn’t his flute album an hour-long ambient album?", "label": 0}
{"text": "everything about andré is just effortlessly cool, love this experimental arc", "label": 0}
{"text": "Technically yea - but have you heard this? I meant this sort of shit.", "label": 0}
{"text": "Look at what sub you are on dude. None of the artists you listen to are exactly saints lol.", "label": 0}
{"text": "We don't allow direct image posts. If it concerns a screenshot of social media posts, please post it as a self post, because image posts can't be updated if the situation changes.\n\nPlease resubmit this post as a self post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "I like Durk but his music has always been pretty mid. The best thing he did was bring us Von.", "label": 0}
{"text": "You think this'll release on Spotify?", "label": 0}
{"text": "We don't allow posting of Itunes or Spotify links (streaming services that require login) unless they are [FRESH] or [NOW ON STREAMING], please repost with a link to the song that does not require a login to listen.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "It's already on Spotify", "label": 0}
{"text": "We've gone off the deep end lmao", "label": 0}
{"text": "We don't allow direct image posts. If it concerns a screenshot of social media posts, please post it as a self post, because image posts can't be updated if the situation changes.\n\nPlease resubmit this post as a self post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiphopheads) if you have any questions or concerns.*", "label": 0}
{"text": "right like fuck is this dude talking about 😂 how is this upvoted", "label": 0}
{"text": "Truly a pioneer at every level", "label": 0}
{"text": "I don't understand how people who have a chance to make millions of dollars legitimately risk it all for stupid shit.", "label": 0}
{"text": "I feel like some artists are way better w headphones on", "label": 0}
{"text": "I think the problem is that he has nothing to say and his delivery isnt good enough to make up for it \n\nhe basically only ever raps about how good at rapping he is and hes not even good enough at rapping to do that", "label": 0}
{"text": "Lies. It’s not there.", "label": 0}
{"text": "nah his music was lame and boring before that too", "label": 0}
{"text": "TIL I Thank U by Future is a Wheezy beat. Insane actually", "label": 0}
{"text": "I'm not going to argue with that one.", "label": 0}
{"text": "Earl seems like he'd be way more fun to be around", "label": 0}
{"text": "If you can't read the headline what are you even doing here ", "label": 0}
{"text": "Type the track name into the search bar and it will pop up", "label": 0}
{"text": "Hero", "label": 0}
{"text": "Damn", "label": 0}
{"text": "It’s still sinking in that Durk actually getting life man smh", "label": 0}
{"text": "This is tough, no doubt. Glad to hear more André always. The ending of this one is super fly. Damn, I wish he would’ve flowed over this, lol.", "label": 0}
{"text": "That wasn't the point I was making. Here's your mask 🤡", "label": 0}
{"text": "No he's an Teacher!", "label": 0}
{"text": "Trying to learn a new language apparently, you Dumb Dumb", "label": 0}
{"text": "🤣", "label": 0}
{"text": "Yeah but she got homie jailed so can't vibe with her anymore.", "label": 0}
{"text": "Been knew he did that. Crazy how long they get away with things with all the bragging and self-snitching they do online and in their music. I hope more of these clowns are exposed and locked away soon. Good riddance.", "label": 0}
{"text": "what do 15 year old white kids opinions matter? theyre retarded as hell, weren't you when you were 15? I was", "label": 0}
{"text": "in the young thug case one of the defandants wo took a plea came straight from the hospital drugged up to testify and mentioned something about going to meet his friend on his \"bmx bike\", next day of court after he sobered up he denied thats what he said lol", "label": 0}
{"text": "This sounds like something Carmine Jr would say.", "label": 0}
{"text": "This was awesome to see", "label": 0}
{"text": "Epic 👌😀", "label": 0}
{"text": "Nah actually it isn’t", "label": 0}
{"text": "I mean...it's Sade, need I say more?", "label": 0}
{"text": "Cos I have ears", "label": 0}
{"text": "Yea he was accurate on this one", "label": 0}
{"text": "everything about this comment sucks", "label": 0}
{"text": "It's actually better that you've never heard of the guy. He has terrible ideas. Just avoid him. ", "label": 0}
{"text": "Jean Dawson seems pretty good", "label": 0}
{"text": "Tsu Surf's House In Virginia is up there.", "label": 0}
{"text": "Let the man live", "label": 0}
{"text": "Sucks to be you huh", "label": 0}
{"text": "what if they actually arrested that lil durk impersonator by mistake", "label": 0}
{"text": "I'd respect Barry so much more if he had rapped Biz's verse off Amityville at the rally of instead Lose Yourself", "label": 0}
{"text": "Never heard of", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Nicholas Craven - Tha Myth Who Never Quit](https://open.spotify.com/album/1gYvkQiLXk7mOo8DxWLfP9 \"Confidence: 83%\")\n\n\\[Bandcamp]: [Tha God Fahim X Nicolas Craven - Tha Myth Who Never Quit 3](https://thagodfahim.bandcamp.com/album/tha-myth-who-never-quit-3?from=search&search_item_id=2473293482&search_item_type=a&search_match_part=%3F&search_page_id=3806397573&search_page_no=1&search_rank=1&search_sig=4851c638dd2457caf97789487962547b \"Confidence: 97%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/tha%20god%20fahim%20nicholas%20craven%20tha%20myth%20who%20never%20quit%203) || [Apple Music](https://music.apple.com/us/search?term=tha%20god%20fahim%20nicholas%20craven%20tha%20myth%20who%20never%20quit%203) || [Amazon](https://music.amazon.com/search/tha+god+fahim+nicholas+craven+tha+myth+who+never+quit+3) || [Bandcamp](https://bandcamp.com/search?q=tha+god+fahim+nicholas+craven+tha+myth+who+never+quit+3&item_type=a) || [Deezer](https://deezer.com/search/tha%20god%20fahim%20nicholas%20craven%20tha%20myth%20who%20never%20quit%203/album) || [Soundcloud](https://soundcloud.com/search/albums?q=tha+god+fahim+nicholas+craven+tha+myth+who+never+quit+3) || [Tidal](https://listen.tidal.com/search?q=tha+god+fahim+nicholas+craven+tha+myth+who+never+quit+3) || [YouTube Music](https://music.youtube.com/search?q=tha+god+fahim+nicholas+craven+tha+myth+who+never+quit+3)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "The roots undun ... The album is made to listen in reverse order from the last song to the first. About a drug dealer getting out of jail.", "label": 0}
{"text": "No", "label": 0}
{"text": "Because the sub is for hip-hop music and hip-hop artists. If an ambient artist released this it would not be allowed on the sub. \n\nIf a hip hop artist releases a track that isn’t hip-hop it is welcomed.", "label": 0}
{"text": "So you get the point I'm making, right?", "label": 0}
{"text": "Yes, that's what I'm saying. I'm saying it because, according to the subreddit overlap, people on here aren't really into ambient music.\n\nAnd Musical eureka-moments of this magnitude don't happen like that.", "label": 0}
{"text": "Ur 100% right he only goes back very rarely to do shows and he’s heavy w security and moves smart, in and out", "label": 0}
{"text": "You are as well - that's like calling a vegan weird for Not liking meat. Some tastes don't mesh well, don't you think?", "label": 0}
{"text": "Again - you’re coming to conclusions that make no sense. \n\nAmbient isn’t a popular genre. I dont seek it out, but when i hear good ambient music i enjoy it and find it relaxing.\n\nif you look ay the comments several people don't like it because it isn't hip-hop, and thats ok. Several other people enjoy other genres and like it because it's a goor song - period. \n\nA lot of people liked the psych rock Yachty album - not because it's Yachty, because they liked the music.", "label": 0}
{"text": "Everyone on Reddit is a bot except you.", "label": 0}
{"text": "Seems like it sometimes", "label": 0}
{"text": "You may have the worst logic in the world.\n\nVegan means you don’t eat meat \n\nHip hop head does not mean you only listen to hip hop. It just means you like hip hop, and most of us like all kinds of music.", "label": 0}
{"text": "I always get the impression earl would smell bad", "label": 0}
{"text": "So there are no instances in which people only like the music because of the artist that produces the music? This is a totally foreign concept that never occurs?", "label": 0}
{"text": "Very nice interview here", "label": 0}
{"text": "Ok so the issue is you don’t understand the subreddit \n\nYou can’t recommend Hank Williams on here - period. \n\nIt’s ok - you just need to go read the subreddit rules and maybe you’ll understand how it works here.", "label": 0}
{"text": "They call it the trial penalty and I am a firm believer it is a violation of the 6th amendment.  They can overcharge and effectively get people to just accept a plea deal rather than risk losing an extra 10 years.  It's not as prevalent at the state level because they don't have as much discretion to add accelerators.\n\nThe Kevin Ring case is pretty famous for it.  Feds offered him a plea deal of no jail time and a huge fine.  He must have thought he was innocent because he went to trial and was found guilty on 5 of 8 accounts.  The guidelines for his penalties would be 17 to 22 years and the prosecutors asked for 20 years.  The other people in his corruption case were pleading for less than 4 years, despite being more involved.  The judge ultimately rejected the 20 years, but just shows how the feds try to punish you exercising your 6th amendment right.", "label": 0}
{"text": "So sad 😞", "label": 0}
{"text": "Everything coming out about Diddy just gets worse and worse… how is it all only coming out now?", "label": 0}
{"text": "reddit isn't a court of law", "label": 0}
{"text": "That shit was wild to me that mfs were bragging about it on Twitter lol.", "label": 0}
{"text": "So there are no instances in which people look at small pieces of data and come to illogical conclusions because they don’t understand causation vs correlation?", "label": 0}
{"text": "Busdriver - *Bone Structure* feat. Open Mike Eagle", "label": 0}
{"text": "Just like Gucci Mane", "label": 0}
{"text": "Way better", "label": 0}
{"text": "Ah I definitely misinterpreted that", "label": 0}
{"text": "Answer my previous question please.\n\nTo answer yours - it does happen but how do you think my supposed mistake is a correlation/causation mistake.\n\nMy hypothesis is that people who like rap usually do not like ambient music. Which is indicated by the overlap. This low overlap makes it unlikely that so many people would enjoy this piece of music, making it more likely that it depends on the person making the music. Where is the Flaw there?", "label": 0}
{"text": "[Could be referring to these](https://youtu.be/YyFXfRH81cI?si=29DmLlzjAjje9EFt). He had two others called \"Avoider\" and \"Puppies and Babies\", uploaded on this same channel.", "label": 0}
{"text": "Shut you mouth lil bro shit stink when you speak", "label": 0}
{"text": "Just noise lol, reminds me of the random ambient noise interlude parts of early Mars Volta songs like Cygnus Vismund but when Mars Volta does it it’s more like a necessary cooldown from the psychedelic prog rock chaos that precedes it. Not a fan of this or the flute project, basically zero replay value imo, wish Andre wasn’t scared to rap on his own, he’s literally done multiple rapping features on Frank Ocean & Divine Council songs in the past few years he still has the ability but I guess he knows people will force themselves to fw anything he puts out no matter what so why bother. Still respect him as an artist of course & it’s better than absolutely nothing I suppose, just can’t pretend I don’t miss the hiphop ", "label": 0}
{"text": "Im curious tho lol", "label": 0}
{"text": "earl definitely smells like must and cigs", "label": 0}
{"text": "**Some points for discussion:**\n\n* 72\n* its a trip that follows the halloween night partying - it dropped on nov 1\n* the flows of other rappers seem to be on another level as well now, its like mac inspired them all to be their grittiest dirtiest delusional selves\n* it doesnt - its from a different artist\n* probably my 2rd fav mac tmixape - after faces", "label": 0}
{"text": "But he cares about Drake so why can’t he do the same to kodak", "label": 0}
{"text": "Lupe Fiasco - Mural", "label": 0}
{"text": "You are basically hypothesizing without having any numbers. The only thing we know quantitatively is that: 1) there is a low, indetectable overlap between subreddits, 2) some people are honest enough to say they don't like it, 3) this somehow is being upvoted and rated very highly, although it's not a Hip Hop song.\n\nThe only thing you are doing is pointing out that something MIGHT be the case. That can be done within every statistic. It might also be the case that there is a teapot on Mars - it's not impossible but it's unlikely.", "label": 0}
{"text": "Idk bro - honestly I only liked this because it’s Andre.", "label": 0}
{"text": "Bun B The Story", "label": 0}
{"text": "ts is so fucking good", "label": 0}
{"text": "I've never heard of Sadisik before but this is dope", "label": 0}
{"text": "Yes, avoider is beautiful.", "label": 0}
{"text": "Because I dislike hype culture", "label": 0}
{"text": "People think japan is some hyper developed super smart country so if those guys convert they must be into something", "label": 0}
{"text": "You call rap music??", "label": 0}
{"text": "I think that about  Mick Jenkins and dude kinda killed him on this one.\n\nWhat album would you recommend as a starting point?", "label": 0}
{"text": "if hype culture encourages people to listen to music outside of their comfort zone then I think it's doing a good thing", "label": 0}
{"text": "Wicca is incredibly underrated and idk if he’ll ever get the props he deserves but he was sooo early to the emo rap game", "label": 0}
{"text": "\"I'm tryna pop a wheelie in a Lamborghini standing on two wheels\" Future on 200", "label": 0}
{"text": "It won't though. I doubt many people will suddenly become Brian Eno fans after listening to this track. How many people have become Hubert Law fans after listening to Andres Flute album?", "label": 0}
{"text": "You’re factually insufferable", "label": 0}
{"text": "As someone who loves both hip hop and ambient music...no, that isn't bewildering at all.  He just happens to make cool music in more than one genre, and some people like more than one genre.  The fact that this is bewildering to you, or that you just assume it's name recognition bias, is depressing as hell.", "label": 0}
{"text": "Yea I don’t get it either", "label": 0}
{"text": "But if a rapper put out a dope country song that sounded like hank williams, there should be nothing \"bewildering\" about someone who likes hip hop also liking that song.  That is simply liking two genres of music.  you are the one being weird here, dude", "label": 0}
{"text": "So this means when Everlast drops his next country record there will be a similar reaction in the sub?", "label": 0}
{"text": "at least use a good example like yusef lateef or Lloyd mcneill if you're gonna be pretentious for the sake of itself", "label": 0}
{"text": "Elysium or Haunted Gardens or Bring Me Back When The World Is Cured", "label": 0}
{"text": "You’re a legend. One of the best responses I’ve seen on Reddit. You’re getting praise and you deserve it. Carry the hell on.", "label": 0}
{"text": "No, it just depends on if people like it.  This post doesn't even have 80 comments dude, and many of them are you or people debating you lol.  It's not like it's blowing up, what is so unbelivable that a small subsection of users on this subreddit just happen to like this type of music and andre 3k?  I truly don't understand why you're being so stubborn and cyncical about that idea.  It bothers me in particular cause I literally love this type of music and love hip hop.  If you don't believe me you can look up my literal bandcamp or original music where I have an album of weird, ambient music and also some hip hop beats lol.  Plenty of people love both of those types of music, it really bothers me you assume everyone upvoting or enjoying this is doing it just cause of hypebeast name recognition.  I openly wasn't even a big fan of his last album, I thought for an ambient album it was kinda meandering and boring, but I love this track.", "label": 0}
{"text": "I don't understand your post - gatekeeping and being against hype culture tend to intersect and I am not against gatekeeping. What kind of hype culture am I supposedly promoting?", "label": 0}
{"text": "calling criminals reactionary is hilarious\n\nall criminals are paper tigers", "label": 0}
{"text": "you are suggesting people on the hip hop subreddit only like this cause of hype name recognition.  Like they're just pretending to like this song cause its 3 Stacks. Which is absurd.  might be true of a few people, but most people commenting probably genuinely like the track, and that's a good thing for the sub.  It's possible (and literally true) that a lot of people are upvoting it cause they genuinely enjoy ambient music as well as hip hop.  Being so cynical about people on this sub enjoying another genre of music is pretty shitty and gate-keepey.  Acting like no hip hop fan can genuinely also love this track, regardless of who made it, is gate keepey and shitty.  That's what I'm talking about.  I'm genuinely offended at your take haha.", "label": 0}
{"text": "There are over 4 million users of this sub.  less than 500 upvotes on a track by fucking Andre 3k is not statistically anomalous at all, if it was a rap track it would have thousands upon thousands of upvotes.  the fact it only has that many is because there probably less than 1 in 100 users of this sub love ambient music like that, which bears out entirely in the fact this doesn't even have many upvotes.  If that is your logic then you are WAYYYYYYYYY overvaluing just what 400 upvotes in this sub means on a post like this, that isn't much at allllll", "label": 0}
{"text": "I noticed your offence but it's difficult to argue with the lacking overlap I posted down below. Like I said - let's see how many people will appreciate Everlasts next country album. I'll make sure to post it extensively here when it comes out.", "label": 0}
{"text": "RIP. this is a minor moment in a massive career but his FSR and Complex Sneakers Podcast episodes were amazing. he was a legend and he acted as one. crazy that Brendan Dunne ended up writing his obituary for Complex after all the time they spent together and on screen. hope theres someone out there from the FSRmy reading this", "label": 0}
{"text": "It's so weird to say that people are willing to support someone who organized somebody's death. So by that standard, if Hitler made bangers, his crimes against humanity would be forgiven? No wonder why the world is total fucking shit.", "label": 0}
{"text": "Oh this is really freaking cool. Thanks for shedding light", "label": 0}
{"text": "that is news to me. absolutely ridiculous.", "label": 0}
{"text": "I am not - it is the third most upvoted post today. For a non-hiphop song. Also you are backing my point in this post, maybe delete it.", "label": 0}
{"text": "The fundamental question is, will I be as effective as a boss like my dad was? And I will be, even more so? But until I am, it's going to be hard to verify that I think I'll be more effective.", "label": 0}
{"text": "I responded in another comment, but you are vastly, vastly overestimating how much 500 upvotes is in a sub of 4 million people.  It is entirely, entirely normal that 500-1000 people in a massive hip hop sub also like ambient music.  That isn't weird, nor difficult to argue.  You are simply trying way, way, way too hard to be cynical about literally less than 0.1% of this sub upvoting this post", "label": 0}
{"text": "this is the only time we should allow it", "label": 0}
{"text": "2. Ego", "label": 0}
{"text": "She isnt crazy tho.", "label": 0}
{"text": "hahahah oh my lord, I'm not actually, I have provided plenty of data to back myself up -- you saying \"Third most upvoted post of the day\"  for an andre 3k track proves my point lol, it's not even the most upvoted post, and \"of the day\" is such a comically small sample size that it means nothing.  Anyone with a functioning brain will be able to read the points I am making vs the ones you are making and realize how absurd your point is.  'The third most upvoted post'' on a single day does not mean fucking anything in terms of larger popularlity in this sub -- what does mean something, and you can comapre to a giant set of data, is the amount of upvotes, and less than 500 upvotes in five hours isn't much at all in this sub for a major post. You claim to be using some data to make your point, but you obviously dont even understand something as simple as the value of sample size.  \n\nAnyway, good night.", "label": 0}
{"text": "Ok, we'll talk again in a week\n\nRemindMe! -7 day", "label": 0}
{"text": "I will be messaging you in 7 days on [**2024-11-02 08:06:17 UTC**](http://www.wolframalpha.com/input/?i=2024-11-02%2008:06:17%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/hiphopheads/comments/1gcbvsc/fresh_andre_3000_something_is_happening_and_i_may/lttitbo/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fhiphopheads%2Fcomments%2F1gcbvsc%2Ffresh_andre_3000_something_is_happening_and_i_may%2Flttitbo%2F%5D%0A%0ARemindMe%21%202024-11-02%2008%3A06%3A17%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201gcbvsc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "label": 0}
{"text": "🙌", "label": 0}
{"text": "His live show is like this. Catch the show if it’s near you.", "label": 0}
{"text": "I love being jewish. We control the media, banks and weather and we have lasers. Can’t beat that", "label": 0}
{"text": "Awww simmer down fanboy. The boys behind bars will take good care of Durkie poo! 🍆💦\n\n😂", "label": 0}
{"text": "Bro idc what anyone says about money not being enough to save him after also learning today that fetty wap got 6 years in a rico charge involving more weight in fucking fent an coke than i weigh, and weapon charges along with that. That's legitimately the most mind blowing thing I've learned since like middle school", "label": 0}
{"text": "I don’t even understand wtf you just commented", "label": 0}
{"text": "RIP", "label": 0}
{"text": "Fuck the point you were making….it didn’t make no sense, idiot", "label": 0}
{"text": "I can’t even tell some of this Cole is saying here lol it’s a nice flow though. Honestly I like the sound me Benny freestyle a lot, can’t remember which one it is but he got the backwards hat on", "label": 0}
{"text": "\"Didn't make no sense\"\n\nA real genius we're dealing with here, lol.", "label": 0}
{"text": "Cam’ron on Rap City, CyHi on Toca Tuesdays, Juice World on Westwood, Lil Wayne on stage with Fugies… should I keep going?", "label": 0}
{"text": "99 problems", "label": 0}
{"text": "So people are always honest on the Internet and are never befallen with hype-culture? I wasn't aware of that!", "label": 0}
{"text": "He’s not wrong, \n\nMost RICO cases are built on hearsay and conjecture, very tangentially connected people end up taking plea deals to avoid 25 to life sentences,", "label": 0}
{"text": "Later perv ✌️🖕", "label": 0}
{"text": "Whatever happened there…", "label": 0}
{"text": "no, this sub’s reaction to everlast, who was never generally argued to be a top 10 rapper, dropping a country album that was relevant YEARS ago will not be the same as their reaction to andre 3000, that many people here consider one of the greatest rappers to do it, dropping an experimental ambient track that continues his recent trend of branching away from hip hop like he did recently.\n\nyou keep pulling out the dumbest analogies i’ve ever heard and i genuinely just can’t tell if it’s bait or not.", "label": 0}
{"text": "If this isn't satire. No, it's got to be", "label": 0}
{"text": "he’s essentially just projecting his thoughts of this track and it being posted here onto others and insisting that it SHOULD be the reaction everyone has by rationalizing why he feels that way. it’s always odd when someone so badly wants others to react the same way they do", "label": 0}
{"text": "Cuz with the SK\n\nDoggy I’m OK\n\nMy AK was my AKA\n\nBe4 my ABC’s\n\nand had me A’ Ok", "label": 0}
{"text": "Lmao this comment is all I need to know fam", "label": 0}
{"text": "That’s literally the point I was making", "label": 0}
{"text": "Literally any freestyle by black thought  ....", "label": 0}
{"text": "But their musical abilities in other genres has nothing to do with their stance as a rapper - or does it somehow?", "label": 0}
{"text": "Idk why but I feel like 2024-2026 will be one of those years.", "label": 0}
{"text": "MURS - Walk Like a Man", "label": 0}
{"text": "Your partner Big Boi, whatever happened there...", "label": 0}
{"text": "Start of this sounds like a Mars Volta intro", "label": 0}
{"text": "I’m sorry man but these releases have not been great this year . The consequences of the writer strike is being felt everywhere now. It’s wild", "label": 0}
{"text": "FAKE ANDRE FANS WHEN THE LONG AMBIENT TRACK DROPS:", "label": 0}
{"text": "after he smoked everyone on vultures he's def up next", "label": 0}
{"text": "And you would have comments like „why not hip hop song is here”. People question threads with The Weeknd but I guess Andre is one of the OGs so he gets the pass even for experimental non hip ho adjacent music", "label": 0}
{"text": "That's awesome and I'm so glad you got to see your fave while they're still with us. Nas is a fantastic live performer who puts it all into his performances, no half assed bullshit. I him for the first time at the Illmatic 20 tour and it was unreal. Doing the album front to back and then some hits afterwards, one of the best shows I'd been to.\n\nI saw him again last year when he toured with Wu-Tang, another amazing night and my 2nd time seeing Wu-Tang as well.", "label": 0}
{"text": "Because she wouldn't be the nominee for such a retarded political move?", "label": 0}
{"text": "Eminem*", "label": 0}
{"text": "Ice cold take", "label": 0}
{"text": "Exactly, it’s a hall of fame false equivalency. Real smooth brain take.", "label": 0}
{"text": "I’m happy out with what he’s doing now tbh. Loved the last album and this sounds dope so far. Of course, it would be nice to hear him flow again.", "label": 0}
{"text": "Mid 2000s Emo song title", "label": 0}
{"text": "No doubt guess we’ll see how “Bully” pans out", "label": 0}
{"text": "Your point being?", "label": 0}
{"text": "Was just listening to the ab soul interview where he said this was one of his favorite current artist out now", "label": 0}
{"text": "wow calling out bisexuals for no reason nice work lol", "label": 0}
{"text": "Shame...can't your tiktok decayed brain come up with a better comment. Plus there's no misogynistic view points in the video...do you even know what misogyny is??? Yeah go ahead and google it...then go back to tiktok where you belong.", "label": 0}
{"text": "go go go go", "label": 0}
{"text": "That definetly deserved its own post", "label": 0}
{"text": "That does not preclude hype culture - quite the opposite. Name recognition, like I said before.", "label": 0}
{"text": "Are you saying that beyonce got groomed by Jay because they weren't together when Beyonce was 16.", "label": 0}
{"text": "I don't dislike Andre - I like Outkast.\n\nIt's also not about any \"oldschool vs new school\" stuff.\n\nIt's about a track that's not even a rap track in a broad sense stealing shine from other ones because of Name recognition alone. That's not a hard concept to grasp.", "label": 0}
{"text": "He deserves to rot in jail for life.", "label": 0}
{"text": "Yeah thinking about seeing him in Edinburgh next month, how long was he on for and what was the set list like?", "label": 0}
{"text": "Is there something wrong with that?", "label": 0}
{"text": "What are you saying? This was recorded over a decade ago.", "label": 0}
{"text": "Not even a drake fan but to say he makes the same music is crazy, he does different genres all the time", "label": 0}
{"text": "I took my boys to see him and Wu.   They don't even know what they got to witness.   But still glad they seen some real hip hop.   Glad you enjoyed Nas.  He knows what a mc do.", "label": 0}
{"text": "MY KID BROTHER BILLY, I DID 20 YEARS IN THE CAN", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [Cochise & Veeze - FAKE LOVE](https://open.spotify.com/track/0mCiennGRXNGxodWqSQocg \"Confidence: 100%\")\n\n\\[Apple Music]: [Cochise & Veeze - FAKE LOVE](https://music.apple.com/us/album/fake-love/1774064850 \"Confidence: 100%\")\n\n\\[Deezer]: [Cochise - FAKE LOVE](https://www.deezer.com/track/3055578881 \"Confidence: 85%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/cochise%20fake%20love%20veeze) || [Apple Music](https://music.apple.com/us/search?term=cochise%20fake%20love%20veeze) || [Amazon](https://music.amazon.com/search/cochise+fake+love+feat.+veeze) || [Bandcamp](https://bandcamp.com/search?q=cochise+fake+love+feat.+veeze&item_type=t) || [Deezer](https://deezer.com/search/cochise%20fake%20love%20feat.%20veeze/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=cochise+fake+love+feat.+veeze) || [Tidal](https://listen.tidal.com/search?q=cochise+fake+love+feat.+veeze) || [YouTube Music](https://music.youtube.com/search?q=cochise+fake+love+feat.+veeze)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "MAAAAN WHAAAAT?! I'm 30 and I'm well aware of his whole catalog. Although his past couple projects I didn't vibe with too much. Love songs 4 the streets 2, just cuz y'all waited 2, and the voice was a hell of a run for me.", "label": 0}
{"text": "Yup! He did the PPAC over here. It’s a theater, very intimate. I had like 10th row tickets so I was like *right there* behind all of the who’s who in my city. Including the president of the PPAC and the Mayor of the city. It was pretty epic", "label": 0}
{"text": "I’m saying it looks weird coupled with other weird shit coupled with how he basically said he had to be a cold calculated psychopath to get to the top. Man gave us the blueprint he didn’t go from selling crack to a billy by being a good dude.", "label": 0}
{"text": "You seem like the human equivalent of sparkling water", "label": 0}
{"text": "I isolated the vocals and played with speed and reverse and it is nonsensical vocalizations.", "label": 0}
{"text": "Hey, that's about average!!", "label": 0}
{"text": "you won't regret it", "label": 0}
{"text": "You think the feds would get word of the key being given to him ahead of time and stepped in and said hol up.", "label": 0}
{"text": "Boring af. Stop trying to seem more sophisticated than you are by pretending this is some genius shit", "label": 0}
{"text": "Ty\n\nI assumed it was reversed - but it was hard to tell what was going on.", "label": 0}
{"text": "He was on with DJ Green Lantern and a live drummer. He first did Illmatic all the way through which was like 45 mins and then a medley of his other biggest tracks. It was an hour and some change I think.", "label": 0}
{"text": "Reese still alive and free or no ?", "label": 0}
{"text": "Not true.", "label": 0}
{"text": "I wonder if this will have that one snippet he had on IG paired with the Friday the 13th movie clips and him wearing the iced out Jason mask.", "label": 0}
{"text": "Marshalls also do state warrant roundups.", "label": 0}
{"text": "😭", "label": 0}
{"text": "*I am a bot. If you'd like to receive a weekly recap of hiphopheads with the top fresh posts and their alternative links, send me a message [with the subject 'hiphopheads'](https://www.reddit.com/message/compose?to=MusicMirrorMan&subject=hiphopheads&message=For%20a%20daily%20recap%2C%20make%20the%20subject%20%27hiphopheads%20daily%27) (<--Click the link. The bot can't read chats, you must send a message)*\n\n\\[Spotify]: [El Cousteau - Words2LiveBy (feat. Earl Sweatshirt)](https://open.spotify.com/track/6legbS59rPTHhNRrVdABTk \"Confidence: 100%\")\n\n\\[Apple Music]: [El Cousteau - Words2LiveBy (feat. Earl Sweatshirt)](https://music.apple.com/us/album/words2liveby-feat-earl-sweatshirt/1772274624 \"Confidence: 100%\")\n\n\\[Deezer]: [El Cousteau - Words2LiveBy (feat. Earl Sweatshirt)](https://www.deezer.com/track/3030572541 \"Confidence: 100%\")\n\n**[Links to search pages]:** [Spotify](https://open.spotify.com/search/el%20cousteau%20earl%20sweatshirt%20words2liveby) || [Apple Music](https://music.apple.com/us/search?term=el%20cousteau%20earl%20sweatshirt%20words2liveby) || [Amazon](https://music.amazon.com/search/el+cousteau+ft.+earl+sweatshirt+words2liveby) || [Bandcamp](https://bandcamp.com/search?q=el+cousteau+ft.+earl+sweatshirt+words2liveby&item_type=t) || [Deezer](https://deezer.com/search/el%20cousteau%20ft.%20earl%20sweatshirt%20words2liveby/track) || [Soundcloud](https://soundcloud.com/search/sounds?q=el+cousteau+ft.+earl+sweatshirt+words2liveby) || [Tidal](https://listen.tidal.com/search?q=el+cousteau+ft.+earl+sweatshirt+words2liveby) || [YouTube Music](https://music.youtube.com/search?q=el+cousteau+ft.+earl+sweatshirt+words2liveby)\n\n&nbsp;\n\n^(I am a bot. To send feedback message /u/TheSox3)", "label": 0}
{"text": "awesome platitudes. so in other words, you have no actual evidence for any of your specific claims and you’re talking out of your ass?  ", "label": 0}
{"text": "My point is speculating about a serious crime like rape is wrong.", "label": 0}
{"text": "Andre 3000, whatever happened there", "label": 0}
{"text": "Dark comedy? It's a crazy serious show, but the writers were genuinely flexing on us with the jokes and writing especially in the later seasons.", "label": 0}
{"text": "Shit like this continues to remind me that hella rappers are just fcking stupid and don't grow much mentally even after making a name for themselves and having a golden ticket out the streets.  I'd never be dumb enough to get into some street shit while making legal millions, what tf is wrong with folks??", "label": 0}
