{"text": "NO WAY... but then I'm not a special snowflake for living off the land in a minivan... IMPOSSIBLE!", "label": 1}
{"text": "It was lasers! Magic sky lasers", "label": 1}
{"text": "This article uses a lot of „ingenious“ and „indigenous“ and as a non native speaker this is really confusing haha.", "label": 1}
{"text": "The more I learn about financial history, the more clear it becomes to me that all 3 of your words right there are currently synonymous with \"cartel\".\n\nOr are you not aware of the revolving doors between government and finance? Please don't be that ignorant, I pray.", "label": 1}
{"text": "“…who was a victim of one of the most effective establishment whispering campaigns ever mounted. \n…”They just wanted to scupper this relationship somehow,” French said.\nSound familiar?", "label": 1}
{"text": "I feel like the term Chinese Whisper should be retired.", "label": 1}
{"text": "Maybe Americans should stop saying “English Muffins”.", "label": 1}
{"text": "Cool reason\n\nStill racist", "label": 1}
{"text": "Nah, we're going to be blaming those on you forever.", "label": 1}
{"text": "Can you elaborate on what is so ingenious about said structure", "label": 1}
{"text": "Uhh source? Source??? Both sides also but what about the left also history is written by the victor ☝️", "label": 1}
{"text": "People just call anyone Nazis nowadays", "label": 1}
{"text": "They need to find the guy who keeps leaving these cities all over the place and make him clean them up", "label": 1}
{"text": "Reseacher:  whoops, oh hell yeah", "label": 1}
{"text": "Page 16 of Google search? They really are adventurous. ", "label": 1}
{"text": "The accident being that it was precisely what he was looking for?", "label": 1}
{"text": "Had to get past the ads and promoted entries.", "label": 1}
{"text": "First result after the sponsored ads", "label": 1}
{"text": "The host is a crack pot attention seeker with his own agenda but yeah they do highlight a few interesting sites. Just don't listen to the theories the host has as to what anything is and its an ok show. If you want to know why Graham is a fraud, watch miniminuitemans YouTube video on ancient apocalypse and you'll understand.", "label": 1}
{"text": "The conclusions Hancock jumps to could certainly be judged as fantasy, or at the very least as fringe theories. The findings, locations, and the data are very much real.", "label": 1}
{"text": "Time would be much better spent on something good.\n\nLike Edwin Barnhart's lecture series Maya to Aztec. Available for the low price of an audible credit for a long lecture series of Mesoamerican history with some PDF's full of good learning materials. \n\nI'd also recommend The Flayed God by Markman and Markman for an excellently in depth but broad overview of Mesoamcieran cultural history.", "label": 1}
{"text": "You may disagree with some of the hypotheses (which all scientists employ in the scientific process), but the footage of places, modern technologies, and interviews are incredible, and definitely not fantasy.", "label": 1}
{"text": "Even better you should watch Hancock's debate with Flint Dibble, which pretty much discredits all the \"evidence\" for his ludicrous ideas.", "label": 1}
{"text": "Thats where the actual non paid results are", "label": 1}
{"text": "These days I am surprised whenever google search has something worthwhile...", "label": 1}
{"text": "If this doesn't warrant attention today, I will be back.\n\nI was born in 1957, standard baby boomer.\n\nWhy have I Never heard of Operation Wetback until now?\n\nI've read a bit, history fascinates me but if anyone is willing to expound on the subject,rest assured I will eagerly read it.\n\nI had No idea!", "label": 1}
{"text": "Colonialist and then neocolonialist rapine explains the poverty of the third world, and the wealth of the first world. E.g. child slaves in Congo mining the minerals needed for our smartphones etc etc.", "label": 1}
{"text": "It's like doing GCSE English literature all over again, over-analysing every little detail in a book about the author's intent. I still have nightmares.", "label": 1}
{"text": "Hard agree. Maybe someone was just like \"what should I make?\" \"hmmm a swan maybe\" and that's that.", "label": 1}
{"text": "Ah the famous \"Where is the ditch?\" professor!", "label": 1}
{"text": "Can someone tell me whether he talks about ditches and moats? If not I am not watching.", "label": 1}
{"text": "what do we think of these titles on the matter?\n\nSwingle, P. (2017) *Social Psychology in Natural Settings*. 1st edn. Routledge. Available at: [https://www.perlego.com/book/1577511](https://www.perlego.com/book/1577511) (Accessed: 31 October 2024).\n\nSacco, V. (2005) *When Crime Waves*. 1st edn. SAGE Publications, Inc. Available at: [https://www.perlego.com/book/1004241](https://www.perlego.com/book/1004241) (Accessed: 31 October 2024).\n\nDalziel, G. (2013) *Rumor and Communication in Asia in the Internet Age*. 1st edn. Routledge. Available at: [https://www.perlego.com/book/1678917](https://www.perlego.com/book/1678917) (Accessed: 31 October 2024).\n\nConermann, S. (2014) *Mamluk Studies.* 1st edn. V&R unipress. Available at: [https://www.perlego.com/book/3838992](https://www.perlego.com/book/3838992) (Accessed: 31 October 2024).\n\nCoady, D. (2012) *What to Believe Now*. 1st edn. Wiley-Blackwell. Available at: [https://www.perlego.com/book/1014865](https://www.perlego.com/book/1014865) (Accessed: 31 October 2024).\n\n\\[author missing\\] (2011) *The Science of Social Influence*. 1st edn. Psychology Press. Available at: [https://www.perlego.com/book/2590446](https://www.perlego.com/book/2590446) (Accessed: 31 October 2024).\n\nHarsin, J. (2023) *Re-thinking Mediations of Post-truth Politics and Trust*. 1st edn. Routledge. Available at: [https://www.perlego.com/book/4310333](https://www.perlego.com/book/4310333) (Accessed: 31 October 2024).\n\nif you want to find more titles maybe ask a specific question on this independent research website Perlego: [https://www.perlego.com/research-assistant?utm\\_source=reddit.com&utm\\_medium=referral&utm\\_campaign=post-comment](https://www.perlego.com/research-assistant?utm_source=reddit.com&utm_medium=referral&utm_campaign=post-comment)", "label": 1}
{"text": "I need something more academic as I’m currently writing a paper ", "label": 1}
{"text": "She got better?", "label": 1}
{"text": "Well maybe they should have because if she's still alive shes most definitely a witch.", "label": 1}
{"text": "Was executed but survived. \n\nHuh, they actually had one...", "label": 1}
{"text": "She survived? Clearly a witch!", "label": 1}
{"text": "So... That'd mean she isn't the last executed witch?", "label": 1}
{"text": "Wives of Henry VIII, no?", "label": 1}
{"text": "Witch survives her own execution? Sounds suspiciously like witchcraft to me.", "label": 1}
{"text": "Women, they imprisoned and executed women. Please vote America.", "label": 1}
{"text": "Do not turn to mediums or seek out spiritists, for you will be defiled by them. Lev 19:31\n\nThe light of a lamp will never shine in you again. The voice of bridegroom and bride will never be heard in you again. Your merchants were the world’s important people. By your magic spell all the nations were led astray. Rev 18:23\n\nAllowing evil to enter in your world and family has consequences. Choose the light.", "label": 1}
{"text": "Which is easily believable in regards to the current political ambiance.", "label": 1}
{"text": "Did she weigh as much as a duck?", "label": 1}
{"text": "What, the curtains?", "label": 1}
{"text": "\"You won't believe what she looks like now!\"", "label": 1}
{"text": "not sure why the format is funky and it says 1,1,3 My badddddd", "label": 1}
{"text": "\"this post has been removed by the moderators\" what why?????", "label": 1}
{"text": "That one time they actually catch a real one and they realise their methods had been useless all along!", "label": 1}
{"text": "You mean history of rape and genocides?", "label": 1}
{"text": "There is an enjoyable Manga exploring the Qin's history of conquest called Kingdom (I'm sure the author takes some liberties but they note when records are vague or incomplete). I'm still reading through it, but if this is interesting to anyone I'd highly recommend it. \n\nKingdom \n\nhttps://en.m.wikipedia.org/wiki/Kingdom_(manga)", "label": 1}
{"text": "I wonder they will work with what the historical records say about the protagonist's achievements", "label": 1}
{"text": "Shin is definitely painted with an ethical brush, and the author uses many instances of justice as a means to an end. I'm not sure anyone can make a good case for war, but there are a few times this theme is used. Specifically the Battle of Chouhei, and the mass graves of surrendered Zhao soldiers through live burial; Shin later vows to never allow such atrocities to occur, especially under his watch (queue 20 panels of Shin jumping into a group of soldiers and making them explode with his sword).", "label": 1}
{"text": "do you think for an AI that references books this is a good answer? Yes or no?\n\nThe fantastical bronzes were indeed important for the kingdom of Zhu, revealing secrets of a legendary Chinese dynasty. The bronzes played a significant role in the political and cultural identity of the kingdom, serving as symbols of power, status, and regional cultural affiliations during the early Western Zhou period. These bronzes were used in rituals, with their motifs and shapes evolving over time to reflect the increasing political importance of the king and to celebrate contracts, endowments of lands, nobility status, and victories in battle. The bronze ritual vessels and bells were also indicators of status in the Zhou hierarchical system and were related to state and family ceremonies, reflecting the distinct cultural identities and affiliations of the kingdom of Zhu.\n\nThe bronzes were intricately decorated and were made to hold food and wine in ceremonial banquets prepared for the ancestors, making them the most precious objects in the religious and political life of their time. The bronze casting techniques using lost wax methods and inlays of gold, copper, silver, or jade reflected the health and prosperity of the Zhou states, emphasizing the significance of these bronzes in the kingdom of Zhu.\n\nFurthermore, the return of looted bronze objects, such as the Zodiac animal heads, was exploited by the Chinese state to spur nationalist sentiment and bolster the legitimacy of the regime, highlighting the symbolic and political significance of these bronze artifacts.\n\nIn conclusion, the fantastical bronzes were important for the kingdom of Zhu, serving as symbols of power, status, and regional cultural affiliations, and revealing secrets of the legendary Chinese dynasty through their intricate decorations, evolving motifs and shapes, and their role in state and family ceremonies.\n\nthe AI in question: [https://www.perlego.com/research-assistant](https://www.perlego.com/research-assistant)", "label": 1}
{"text": "I have personally used Adams bridge. It was across a small, shallow drainage ditch for a small gravel parking lot. My coworker, Adam, dropped a couple pieces of lumber down in the spring when the snow piles are melting and making muddy puddles and such. I said “Adam! You made a bridge.” He said “How about that. I did.” That’s most of my experience with Adam’s bridge. It saved me from muddy boots. Which was pretty nice at the time because muddy boots are nasty and unsafe. Last time I saw Abraham was over a decade ago and that was a coke party and I’m not sure this is the time or the place for that particular tale.", "label": 1}
{"text": "The last time I saw a post about Ramsetu, a commenter was arguing adamantly about the reality of how it was constructed according to religious text. And I'm not qualified to speak on the history of this location, but he sounded completely nuts.\n\nSome brave, patient soul argued with him for pages of comments with very well researched material. But every response the original commenter replied with was just more rambling and insane and just said nothing of substance, spanning from conspiracy to the christian bible. The funniest part, and the reason I still remember it is that he ended each one of the dozens of his comments with \"need I say more?\"", "label": 1}
{"text": "> any one religion is not more valid than any other.\n\nThey are all equally invalid.", "label": 1}
{"text": "https://youtu.be/WbmEe1pX8eo?si=C4dmvauD6uOyR_zq", "label": 1}
{"text": "https://youtu.be/WbmEe1pX8eo?si=C4dmvauD6uOyR_zq", "label": 1}
{"text": "The man was there when Napoleon lived so I'm inclined to go with Scott on this.", "label": 1}
{"text": "Maybe it just slid down an aqueduct and into the coliseum.", "label": 1}
{"text": "It's the Roman's dude, it was a big aqueduct, duh.", "label": 1}
{"text": "Dodged a bullet there", "label": 1}
{"text": "It's called a sharkqueduct.", "label": 1}
{"text": "Maybe a Tornado took a shark from the Sea to the pool in the Colosseum.", "label": 1}
{"text": "Ok.. but a extremely large trebuchet and an already filled coliseum... You just toss it. Shark is like \"Ive never got that much air jumping outta water before, o look fingered foods.\"", "label": 1}
{"text": "A historian criticizes a Hollywood Make believe movie….. what an idiot.", "label": 1}
{"text": "“I like all you Navy boys. Every time we’ve gotta go someplace to fight, you fellas always give us a ride.”", "label": 1}
{"text": "Spain and Portugal specifically?", "label": 1}
{"text": "You know Spain is on the med right?", "label": 1}
{"text": "Sighs* it’s a very big region, dude. I’m making the observation of what is written and known from Spain and Portugal specifically. 🙄", "label": 1}
{"text": "Any shark cominig into the Mediterranean has to pass Spain. Your question could make sense for Greece or Turkey, but for Spain in particular it does not.", "label": 1}
{"text": "They obviously used a purpose built sea water aqueduct, a sharkeduct.", "label": 1}
{"text": "Baby sharks. It's actually where the song originates from.", "label": 1}
{"text": "Gladiator 2??? Which Gladiator 2???", "label": 1}
{"text": "It couldn’t possibly happen again, right?", "label": 1}
{"text": "Do we really imagine that in the same situation we wouldn't do the same thing again. Even if it turns out not to have been necessary, it just isn't a risk you run when you are fighting an existential war.\n\nAlso, and most importantly, the people making those decisions at the time didn't have access to everything we now know to be true so we can't expect them to have made decisions on the basis of data they didn't have.", "label": 1}
{"text": "This is something I fear may happen again under this lunatic the American people in their infinite wisdom just elected.", "label": 1}
{"text": "No political actor who is deeply tied to neoliberalism can actually curb migrants flowing to their countries if that’s what you ask. These kind of political moves (including concentration camps) requires a kind of intervention that is outside of the current system.", "label": 1}
{"text": "Mayor of Nagasaki didn’t invite Israel in solidarity with Gaza", "label": 1}
{"text": "the thing you have to realize is america was racist af at the time", "label": 1}
{"text": "Hispanics will be next to experience this.", "label": 1}
{"text": "Creating new casinos too.", "label": 1}
{"text": "we're just regular racist now, the klan hardly has any acting state senators govenors at this point", "label": 1}
{"text": "If you're using past tense to describe America's racism I have a floating island of garbage to sell you.", "label": 1}
{"text": "You didn't experience, nor did you get over, a goddamn thing.", "label": 1}
{"text": "The U.S. is one of the least racist countries in the world.  But to know that you'd have had to have set food outside its borders.", "label": 1}
{"text": "https://worldpopulationreview.com/country-rankings/most-racist-countries\n\nThis article mentions the difficulty of measuring the absurd claim that you just made. And then rejecting your conclusion.", "label": 1}
{"text": "You dealt with your great grandparents being interned 100+ years ago? Wow great job, glad you were able to overcome it.", "label": 1}
{"text": "The Japanese literally killed 27 million Chinese alone. Their dedication to Japan was literally psychotic. Was it the right move? Maybe not, but maybe it was. \n\nIf the US didn't detain tens of thousands of Japanese Americans, it would've been altruistic historically speaking.... heck.. it still was altruistic historically speaking. When the Germans invaded their neighbors, they started ethnically cleansing all of the ethnic Germans... not detaining them. \n\nJapan took no few Chinese prisoners. Japanese soldiers were murdering Philippinos into the freaking 1960s thinking they were still at war.", "label": 1}
{"text": "We'll get over it when people like you stop threatening to do it to the \"enemy within\" du jour. \n\nUntil then, we'll keep reminding everyone about the time the \" Land of the Free\" incarcerated over 100,000 Americans because we happened to look like the enemy.", "label": 1}
{"text": "The data they didn't have was how it all turned out. Of course once you know we will win an overwhelming victory it's easy to say what could have been done differently but while outcome is still in doubt, you are in a very different situation.\n\nIt's hilarious how much saying obvious things like my original statement upsets people. The was the way it was at that time. It was an era of nationalism and everyone (including the Japanese) was participating in that. If we roll back the clock and play that scenario out 100 times, I'd expect something very similar to was done to happen almost every time.", "label": 1}
{"text": "So again, we may know now that fears of a fifth column were unfounded, but that doesn't mean the decision makers then knew this. Do you think they made those decisions just for fun?", "label": 1}
{"text": "Goddamnit. Here we go again.\n\nUnpopular history. (*Especially* unpopular Reddit history).\n\nSo, the United States had broken the Japanese diplomatic codes in the late 1930s. This is a fact.\n\nBased on the decoded diplomatic messages, Japanese diplomats in the US Pacific Northwest and the Southwest of California had been sending messages to Tokyo that they had recruited *hundreds* of first-generation Japanese *families* to participate in spying and sabotage operations on behalf of the Japanese empire, throughout the Pacific Northwest and Southwest California.\n\nThis is also a fact. The decoded messages are in the Congressional Record.\n\nAt the same time, the American west coast held the majority of US aircraft manufacturing, shipbuilding and *oil production*. (It was the US embargo of California crude oil to Japan that was the root of the Pearl Harbor attack). \n\nThis is all recorded in the Congressional Record. (Congressional hearings were held after WW2 that addressed this exact issue.) Look it up. \n\nThere were Japanese living all across the United States in 1941. But ONLY the Japanese living in those two specific areas were interned. \n\nWhy?\n\nNo Japanese living in NYC were interned. \n\nWhy? \n\n*Because no other Japanese diplomats were bragging to Tokyo about the Japanese immigrants they’ve recruited from their region to carry out the Japanese war effort in their region!*\n\nIt’s in the Congressional record. The congressional testimonies were classified until the late 1970s because they also revealed US cryptographic secrets. But the “accepted narrative” had already been established by then.", "label": 1}
{"text": "Was that not a two way street? Have you seen any of the Imperial Japanese propaganda because it's no different than what was being done here other than who the target was.", "label": 1}
{"text": "Ok that data is not credible. It gives Canada a ranking of 2 and the US a ranking of 73. As a Canadian I can confirm there is a big difference, but not that big.\n\nAlso, Japan has a rank of 40 even though Japan is very openly racist and refuses to allow anyone to immigrate there. If you go to Japan, there are many public restaurants etc. where you just won't be allowed in if you aren't Japanese, even if you speak it fluently.\n\nLastly South Africa somehow has a ranking of 23 and Zimbabwe 47. I mean come on, this is absurd.", "label": 1}
{"text": "Probably still much less than the average person who lived through the 1940s in europe or asia though.", "label": 1}
{"text": "> Was it the right move? Maybe not, but maybe it was. \n\nWhile true, this is even the question. The issue is could the leaders at that time know for absolute certain that taking those steps wasn't necessary. The answer is obviously they could not have known that.", "label": 1}
{"text": "Nobody wants to hear this because for some reason many prefer believing that the US was and is uniquely, irredeemably racist. No wonder we end up with lunatics like Trump when so people think mining history for reasons to aggrieved is normal. I would never have guessed that oikophobia would become so popular.", "label": 1}
{"text": "If this is true shouldn't we all be suffering from it?", "label": 1}
{"text": "Again, try going to other countries and see.", "label": 1}
{"text": "It still is racist, but it was too.", "label": 1}
{"text": "You’re the first person I’ve ever seen on this site to correctly use the word “corporatism” lmao", "label": 1}
{"text": "Is it true that more Japanese left camps then got in, because mortality was low and they had children inside? Unlike any other concentration camps I ever read about.", "label": 1}
{"text": "Would be interesting to have Japanese Americans have a sit down and chat with the Chinese over WWII and the trauma they share as a result of Imperial Japan and the responses to it", "label": 1}
{"text": "Would be interesting indeed, it’s just I couldn’t quite see the relevance, care to explain?", "label": 1}
