{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/GregDesanto**\n##I am Greg DeSanto, a Professional Clown and executive director of the International Clown Hall of Fame and Research Center, ask me anything!\n\nHello Reddit! My name is Greg DeSanto and I have been a professional clown for over 40 years. I am a Ringling Barnum and Bailey Clown College graduate, I worked on the show for many years eventually becoming a producing clown. I have performed at Madison Square Garden, the White House, and am the second living clown ever to be on a US stamp, the first being ICHOF Inductee Master Clown Lou Jacobs. Clowning has taken me all over the world and enabled me to experience amazing things. \n\nI currently serve as the Executive Director of the International Clown Hall of Fame and Research Center. It is the only museum that is singularly devoted to celebrating the greatest clowns on earth and houses the largest collection of clown artifacts in the world. The ICHOF recently launched a brand-new website and we are excited to share the stories and history of this unique art form with our guests and audiences. That being said.\n\nAsk me anything!\n\n[link to proof](https://imgur.com/a/PXqyOwV)\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1gc82h9/i_am_greg_desanto_a_professional_clown_and/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "Users, please be wary of proof. You are welcome to ask for more proof if you find it insufficient. \n\nOP, if you need any help, please message the mods [here](http://www.reddit.com/message/compose?to=%2Fr%2Fiama&subject=&message=).\n\nThank you!\n\n---\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "\n\nDo you exclusively watch clown porn\n\nand\n\nhave you ever made clown porn?", "label": 1}
{"text": "can you tell your guild to quit murdering people?", "label": 1}
{"text": "This is a non-answer. I noticed in your other AMA you similarly claim that you've examined all laws to make sure nothing prevents you from doing this. This is a well rehearsed dodge.\n\n\nI also noticed in the article you linked, a number of bioethicists denounce this as being ethically wrong since the deceased couldn't have conceived of this. Are they similarly being hostile? You say you get the consent of families. However, the language you use would lead them to believe that what you're doing is for the consumption of medical students, not the general public.\n\n\nI have a number of medical conditions that would make my body scientifically interesting. Years ago I donated my body to science. After finding out about what you do, I'm rescinding that and having my body cremated promptly after my death.", "label": 1}
{"text": "**u/jam1e444, PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION. ALL AMAs REQUIRE PROOF**\n    \n[Please review our guidelines on what is acceptable as proof.](https://www.reddit.com/r/IAmA/wiki/index)\n\nIf you wish to submit [public proof](https://www.reddit.com/r/IAmA/wiki/index), please edit a link to your proof into your current post and [message the moderators by clicking here](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA&subject=Post%20Review%20Request&message=I%20have%20added%20proof%20to%20my%20post,%20please%20review%3a%0d%0a%0d%0a/r/IAmA/comments/1ge0pup/iama_victim_of_rape_sexually_assaulted_by_my/). This must be proof a reasonable person believes verifies your claims. We require proof on all posts; no exceptions.\n\nIf your topic cannot be proven, it may not be appropriate for this subreddit. Please review our rules and FAQ: https://www.reddit.com/r/iama/wiki/index\n    \nIf you believe you have received this message in error or have another question - [please message the mods by clicking here.](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA)\n    \n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/jam1e444**\n##iama victim of rape, sexually assaulted by my father almost everyday for years\n\nhi.. i’m jamie. months ago, after my 18th birthday and right before my suicide attempt (yay, i’m still alive) i made a very long post about my situation (on r/ offmychest, from a different account) and i received hundreds of upvotes and comments. i felt very overwhelmed with support and love. i wish i didn’t lose the post because i don’t feel like rewriting my story but thank you to everyone who tried to help me back then, if a single person sees this and remembers me.. but it’s okay if not.\n\ni just wanted to post that i’ve finally decided to tell someone about what happened to me. i’m going to get help. real help. watching the menendez brothers case has given me the courage to seek guidance and made me feel less alone. i’m always scared but i shouldn’t take for granted the help that’s out there for victims like me.. especially as a boy/man because i know it used to be a lot harder. i want to be happy and to have a normal life. that’s all i needed to say <3\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1ge0pup/iama_victim_of_rape_sexually_assaulted_by_my/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/FoodPackagingForum**\n##We are scientists studying all sorts of things related to the chemicals in food packaging and cookware. Our specialties include: chemical detection, regulation, effects on human health, sustainability, UN plastics treaty, compostables, bioplastics, microplastics, and so much more! Ask Us Anything!\n\nHi, we are the [Scientific Advisory Board](https://www.foodpackagingforum.org/about-us/scientific-advisory-board) of the [Food Packaging Forum](https://www.foodpackagingforum.org/about-us) back for round three! We are researchers investigating how chemicals in packaging and cookware affect our health, plastic and chemical pollution, microplastics, endocrine disruption, sustainable packaging, and so much more! (see [round 1](https://www.reddit.com/r/IAmA/comments/xvhar4/were_a_group_of_scientists_working_with_the_food/), [round 2](https://www.reddit.com/r/IAmA/comments/16sq5y4/we_are_scientists_investigating_chemicals_in_food/))\n\nYou may have seen some of FPF's research on [](https://www.reddit.com/r/Science/) a few weeks ago about [chemicals known to be used in food contact materials also detected in humans](https://www.reddit.com/r/science/comments/1fqlv1j/thousands_of_toxins_from_food_packaging_found_in/).\n\nThe Food Packaging Forum is organizing this AMA to provide the opportunity for Redditors to ask questions of a room full of scientists dedicated to these and related subjects. Participating scientists this year include:\n\nAngel Nadal, Jane Muncke, Leo Trasande, Thomas Zoeller, Jerry Heindel, Maricel Maffini, Terry Collins, Pete Myers, Cristina Nerín (not pictured) - [ PHOTO](https://imgur.com/WcH87N4)\n\nMany of us are also part of the [Scientist’s Coalition for an Effective Plastics Treaty](https://ikhapp.org/scientistscoalition/), contributing scientific knowledge to decision makers and the public involved in the UN negotiations towards a global agreement to end plastic pollution. The 5^(th) meeting is taking place in Busan, South Korea in December.  \n\nAsk us anything! (we will start answering at 18:00 CET, 13:00 Eastern)\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1geyss1/we_are_scientists_studying_all_sorts_of_things/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "Hi /u/ConsumerReports,\n    \nIt looks like you're an approved contributor so you've talked to the moderator team, but you don't seem to have included any proof in the post above. Please remember to include this proof since without it people won't know that you're really you.        \n            \nIf you've added proof since posting, or previously discussed confidential verification with the moderators, [please message us by clicking here so we can hide this message or verify you.](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA)\n    \n---\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "**u/ShinichiKudoFrAn, PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION. ALL AMAs REQUIRE PROOF**\n    \n[Please review our guidelines on what is acceptable as proof.](https://www.reddit.com/r/IAmA/wiki/index)\n\nIf you wish to submit [public proof](https://www.reddit.com/r/IAmA/wiki/index), please edit a link to your proof into your current post and [message the moderators by clicking here](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA&subject=Post%20Review%20Request&message=I%20have%20added%20proof%20to%20my%20post,%20please%20review%3a%0d%0a%0d%0a/r/IAmA/comments/1gf4bng/hi_everyone_ama/). This must be proof a reasonable person believes verifies your claims. We require proof on all posts; no exceptions.\n\nIf your topic cannot be proven, it may not be appropriate for this subreddit. Please review our rules and FAQ: https://www.reddit.com/r/iama/wiki/index\n    \nIf you believe you have received this message in error or have another question - [please message the mods by clicking here.](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA)\n    \n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/mike_nellis**\n##I'm a former Senior Advisor to Vice President Kamala Harris and a Founder of White Dudes for Harris. AMA\n\nVice President Harris just finished her closing argument speech in DC. I worked for then-Senator Harris as her digital consultant for many years and was a Senior Advisor for her in 2019 before she joined the Biden ticket. Happy to answer questions about anything, from working for the VP or anything else you want to know.   \n  \nI'll post proof on my Twitter account here: [https://x.com/MikeNellis](https://x.com/MikeNellis)  \n  \nAMA! \n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1gfa01c/im_a_former_senior_advisor_to_vice_president/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "Users, please be wary of proof. You are welcome to ask for more proof if you find it insufficient. \n\nOP, if you need any help, please message the mods [here](http://www.reddit.com/message/compose?to=%2Fr%2Fiama&subject=&message=).\n\nThank you!\n\n---\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "When did you notice Bidens cognitive decline?", "label": 1}
{"text": "How much money did Harris raise from far right Jewish nationalists in exchange for supporting Israel’s genocide? I’m an atheist in a swing state that phonebanked for Biden, but I’m not voting for Harris. Do you think there are enough Liz Cheney Republicans to make up for all the anti-genocide Democrats who are choosing to abstain over this bare minimum moral standard?", "label": 1}
{"text": "Trump supports the aggressors that’s why.", "label": 1}
{"text": "She's not the president, nor does she control the Middle East or Russia.", "label": 1}
{"text": "What is something she is bad at that is relevant to being president?", "label": 1}
{"text": "Why did her staff as VP have a 90%+ turnover rate?", "label": 1}
{"text": "around the same time trump's diapers started to stink", "label": 1}
{"text": "Blink twice if you are in danger", "label": 1}
{"text": "Did you mean to post this in r/cuckold ?", "label": 1}
{"text": "Ah yes, the well known and extreme powers that the US Vice President has. Did you know that per the constitution she has a button on her desk that can cause Russia to invade anywhere she wants? It also raises all gas prices around the world simultaneously", "label": 1}
{"text": "Does she support a border wall or not?\n\nWill she restrict/ban fracking or not?\n\nWill she have mandatory gun buybacks or not?\n\nDoes she support trans surgery for prisoners and illegals or not?\n\nIs she going to raise taxes on 91% of public by letting Trump tax cuts expire or not?\n\nDoes she support censoring \"misinformation\" or not?\n\nDoes she support any restrictions on abortion at all or not?", "label": 1}
{"text": "Did your wife's boyfriend tell you to respond with that?", "label": 1}
{"text": "Thanks for your time, Mike. \n\nWhat does Kamala plan to do/is likely to do regarding the humanitarian situation in Palestine and Lebanon?  \n  \nIt genuinely seems like Trump will be more likely to achieve a ceasefire, and Kamala comes across as quite dismissive on the issue (giving at best very general answers).", "label": 1}
{"text": "Sir Please! Please don't bring any facts to this propaganda event.", "label": 1}
{"text": "“White dudes for Harris” may be the dumbest thing I have ever heard of. What type of soy milk do you drink?", "label": 1}
{"text": "$1000 this one doesn’t get answered", "label": 1}
{"text": "Yes, she's done a lot of thoughtful things in making sure that the US-Israeli holocaust continues completely unabated.  \n\nShe's so good on everything.  She's for all human beings.  She really really wants Palestinian kids to live and eat, which is why she supports Israel to the fucking hilt.\n\nJesus fucking Christ dude.", "label": 1}
{"text": "never said he didn't have cognitive decline...  i've heard trump's diapers started stinking years ago. biden and trump are both too old for the gig, that is my point.", "label": 1}
{"text": "I love how conservatives can only resort to ad hominem attacks because they have nothing of value to say. It's pathetic.", "label": 1}
{"text": "> When I ran her digital, she cared a lot about making sure her voice was authentic to her (it's actually one of the reasons I named my firm, Authentic.) \n\n\nWow, I hope that once you started running your firm, you worked hard to achieve your goals without worrying too much about what politicians consider authentic.  That way you can see what you can be, unburdened by what has been.", "label": 1}
{"text": "This guy hasn't talked to Harris in 5 years! How would he possibly know the answers to any questions related to recent events or campaign moves?  His responses are conjecture.", "label": 1}
{"text": "Do you support her policy to continue arming and funding Israel?", "label": 1}
{"text": "How do you justify supporting Kamala Harris, when she has refused to articulate a different policy from Biden when it comes to arming Israel's genocide in Gaza?", "label": 1}
{"text": "Why won't Kamala commit to an arms embargo on Israel? This is a terrible election strategy and she could lose the election over this issue because she is losing the progressive and Arab vote. When someone asked her about the genocide in Palestine and she said that people care more about their grocery prices, that made her look incredibly callous. It doesn't take a lot to just commit to an arm embargo, there should be nothing stopping her. She also comes across incredibly ignorant denying genocide, what's going on over there is textbook genocide.", "label": 1}
{"text": "\"No candidate is going to be anti-holocaust\" is what you're saying.\n\nLiberals stumping for 99% Hitler, and thinking they're the good guys is just so insane.  But they tell themselves \"it's complicated\", it's \"a single issue\" - no it isn't.", "label": 1}
{"text": "What her UAP disclosure policy?", "label": 1}
{"text": "How hard is life as a eunuch?", "label": 1}
{"text": "Why should any one vote for her when she polled 17th for president last time. Then in Bidens words, she was picked for VP because of her color. Now she is running for the highest office in the land with out having gotten a SINGLE vote ?", "label": 1}
{"text": "Do you know that your candidate is horrible, and that next week when she loses the left will be repeating the same tired mantra of “how could this happen” when the obvious answer is your candidate is shit and this will be an exact retread of 2016?", "label": 1}
{"text": "Do you get offended when your wife's boyfriend makes fun of you?", "label": 1}
{"text": "How do you feel about her supporting the genocide in palestine?", "label": 1}
{"text": "Lmaooo what the hell?", "label": 1}
{"text": "Try and put yourself in the shoes of white men .. your population is declining and your economic security has withered away . Trump addresses this clearly. What does Harris do to talk to these guys?", "label": 1}
{"text": "in one sentence, without mentioning donald trump, what is kamala harris' platform?\n\nwith the majority of americans disavowing israel's actions in the levant, why does she continue to see support for israel as a hill to die on? \n\nhow does being 'hard on illegal immigration' help her pick up votes when her opponent is inarguably more draconic and affective on this dog whistle of an issue?\n\npepperidge farm remembers her support for medicare for all (another majority-support issue,) when will she?\n\nis there any hope to be had that she will be any different than biden, and will we be saddled with her unenthused neoliberal zionist stagnation for the next eight years?\n\nwill she take responsibility when she loses the easiest election in history, or will she blame those of us with a conscience and a backbone for her asinine strategy of courting those who would wish to enact trump's monstrous policies but whose fascism leaves a bitter taste in their mouth?\n\nis she aware that when we came out to deliver biden's victory, we did it under the assumption that it would be a one-term presidency and not have to be pried from his early onset rigor mortis affected claws? \n\ndid she think when biden's term was finally over we would want him to be replaced with yet another uninspired establishment clone?\n\nwhat exactly has she even been doing these past four years?\n\nand lastly, will you be proud of yourself when the foundations of our society collapse because the liberal establishment decided to platform a wannabe dictator to secure an 'easy-win' for their last unstomachable warhawk — *and then repeat the same strategy for the next 8 years*\n\n\nwhen will this nightmare end", "label": 1}
{"text": "It feels like Kamala Harris and the Democrats have done absolutely nothing to reach out to white males. Why do you think that is?", "label": 1}
{"text": "„White Dudes…“ holy F! What is wrong with you people? Why does it need to be WHITE (I am white btw)? Why do you ‘mericans need to emphasise racial differences in every imaginable way? White Dudes… omfg xD", "label": 1}
{"text": "Who is your girlfriends boyfriend voting for?", "label": 1}
{"text": "**u/dannguyencoder, PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION. ALL AMAs REQUIRE PROOF**\n    \n[Please review our guidelines on what is acceptable as proof.](https://www.reddit.com/r/IAmA/wiki/index)\n\nIf you wish to submit [public proof](https://www.reddit.com/r/IAmA/wiki/index), please edit a link to your proof into your current post and [message the moderators by clicking here](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA&subject=Post%20Review%20Request&message=I%20have%20added%20proof%20to%20my%20post,%20please%20review%3a%0d%0a%0d%0a/r/IAmA/comments/1gfhanb/how_to_remember_what_i_read_books_notes/). This must be proof a reasonable person believes verifies your claims. We require proof on all posts; no exceptions.\n\nIf your topic cannot be proven, it may not be appropriate for this subreddit. Please review our rules and FAQ: https://www.reddit.com/r/iama/wiki/index\n    \nIf you believe you have received this message in error or have another question - [please message the mods by clicking here.](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA)\n    \n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "How's your wife's boyfriend doing?", "label": 1}
{"text": "Lmao “I am literally the leader of White Dudes for Harris. Harris has done a much better job in 2024 of engaging with white men. By the way, she hasn’t talked to me in five years.” 🤦", "label": 1}
{"text": "All this name calling from people that disagrees with you, and you remain calm, collected, consistent, and factual. Well done. Things aren’t so black and white, evil or utopian, wrong or right. It’s a complex issue, and taking your stance makes you neither racist nor bigoted, or whatever names people call you. You can send someone to prison for committing a crime and still have empathy for why they might have committed that crime.", "label": 1}
{"text": "**u/diamondsmokerings, PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION. ALL AMAs REQUIRE PROOF**\n    \n[Please review our guidelines on what is acceptable as proof.](https://www.reddit.com/r/IAmA/wiki/index)\n\nIf you wish to submit [public proof](https://www.reddit.com/r/IAmA/wiki/index), please edit a link to your proof into your current post and [message the moderators by clicking here](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA&subject=Post%20Review%20Request&message=I%20have%20added%20proof%20to%20my%20post,%20please%20review%3a%0d%0a%0d%0a/r/IAmA/comments/1ggobys/im_currently_staying_at_a_long_term_residential/). This must be proof a reasonable person believes verifies your claims. We require proof on all posts; no exceptions.\n\nIf your topic cannot be proven, it may not be appropriate for this subreddit. Please review our rules and FAQ: https://www.reddit.com/r/iama/wiki/index\n    \nIf you believe you have received this message in error or have another question - [please message the mods by clicking here.](http://www.reddit.com/message/compose?to=%2Fr%2FIAmA)\n    \n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/kalshi_official**\n##Hi Reddit! My name is Tarek Mansour, and I’m the co-founder & CEO of Kalshi, the first and largest legal prediction market in America. We recently legalized trading on the outcome of elections, and have since seen over $250 million bet on the American elections. Ask Me Anything!\n\nIt’s election season in America, and you might have noticed something different about the 2024 election cycle compared to the others—this time around, you can bet on the outcome. \n\nMy company, Kalshi, is a prediction market platform. We’re a financial exchange like Robinhood or ETrade, but one where people can trade on the outcome of events. We’ve been a leader in the prediction market space for a while (we were the first to get event contracts approved by the CFTC, and the first to get our own native clearinghouse), but in early October, we got our biggest win ever when a court [ruled in our favor](https://www.wsj.com/finance/regulation/are-you-ready-to-bet-on-u-s-elections-a-judges-ruling-opens-the-door-556abc73) to make it legal to trade on the outcome of elections. \n\nSince then, we’ve gotten a [ton](https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-live-10-09-2024/card/the-100-million-election-bet-is-here-MV2rogamhehs3NFeCda6) [of](https://www.wsj.com/video/series/news-explainers/what-betting-markets-can-tell-us-about-the-presidential-race/F496B7B3-1D5F-4A6C-8774-06B01B211A0E?mod=WSJvidctr_politicscampaign_pos3) [press](https://www.ft.com/content/0bfa5288-ecd2-41d1-9c1f-ac84e0c43c65?shareType=nongift) and seen trading volume on our platform increase by more than 100x. We’ve also seen a lot of [misinformation](https://time.com/7095708/financial-scam-political-prediction-election/) floating around about prediction markets and Kalshi itself, so I wanted to hop on Reddit to answer any questions you guys have!\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1ggq905/hi_reddit_my_name_is_tarek_mansour_and_im_the/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "I don't like that your scale only goes up to 10.", "label": 1}
{"text": "Your name is Tarek backwards. Is that what they call carrots in your country? Do you like carrots?", "label": 1}
{"text": "Deciding which hand to go fuck himself with.", "label": 1}
{"text": "Why haven’t you addressed a single question in the half hour since you posted this?", "label": 1}
{"text": "Tarek we know it’s you posting this lol ", "label": 1}
{"text": "You have a 3rd option you're blatantly excluding. Go home", "label": 1}
{"text": "Have you considered setting up a market on whether you yourself, personally, die in a fire? That seems like it's approximately as amoral as what you're really doing, but at least then you'd have some skin in the game.", "label": 1}
{"text": "Have you considered setting up a market on whether you yourself, personally, die in a fire? That seems like it's approximately as amoral as what you're really doing, but at least then you'd have some skin in the game.", "label": 1}
{"text": "You’re a POS.", "label": 1}
{"text": "> For example, your fear of death may arise from the realisation that your book will eventually end, and all of your life stories will come to a close.\n\nJeeze, speak English, doc. We ain't scientists.", "label": 1}
{"text": "You sound like such an idiot. This guy is abhorrent but somehow you’re worse", "label": 1}
{"text": "Genuinely asking what is so horrible about people betting on an election. How is it any different than betting on the Super Bowl? Yes, the subject matter is a little more close to home, but *someone* is going to win this election, regardless. What is so super duper evil about simply betting on who you think will win?", "label": 1}
{"text": "Dipshit much?", "label": 1}
{"text": "wtf is WRONG WITH YOU!? Trying to get people to bet on the election is just fucking sick! Seriously, go fuck yourself!", "label": 1}
{"text": "You know what he means, your actual country of citizenship.  ", "label": 1}
{"text": "Topics must follow IAmA guidelines - AMAs must be about: Something uncommon that plays a central role in your life, or a truly interesting and unique event. \n\nDo not post about topics that are very common, or unprovable. \n\nDo not repost about the same topic within a 3-month period.\n\n-----\n\nHi, your post is removed for Rule 2. \n\nUnfortunately, we do not allow AMAs based on topics that are unprovable. While we have no reason to doubt you, allowing topics like this would lead to fake AMAs being posted, which reduces the overall quality of the subreddit. \n\nYou might consider posting in /r/CasualIAmA instead. Thank you for understanding.", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/NotDeadEnoughforTX**\n##I am one of the first women to sue Texas over the abortion bans after being denied a medically necessary abortion - AMA\n\n![img](2j3rjvsbdryd1)\n\n![img](k20sm3li7ryd1)\n\nHowdy,\n\nI am Lauren Miller. In March 2023, I (alongside four other patients and two doctors) [sued Texas](https://reproductiverights.org/case/zurawski-v-texas-abortion-emergency-exceptions/zurawski-v-texas/) over the abortion bans after being denied an abortion of an unviable twin, which would have protected me and our viable twin.\n\nI was one of the women featured in the Diane Sawyer and Rachel Scott documentary, [On the Brink](https://www.hulu.com/series/impact-x-nightline-on-the-brink-6908932d-1ba7-46ec-84d9-499cfcdf8e28?dl=false), and a more in-depth look at our case was the subject of the recently-released documentary, Zurawski v Texas. I kept a journal logging my experience in real time, a small selection of which was published in [the Guardian](https://www.theguardian.com/us-news/2023/jun/19/diary-woman-fled-texas-for-abortion).\n\nIn short: I was severely ill with hyperemesis gravidarum (heading towards kidney failure) due to a twin pregnancy. At 13 weeks, we found out that one of our twins would not survive. Despite additional ultrasounds, testing, and ending up in the ER for a second time, I was not dead enough for an abortion in Texas to preserve my health and the life of our healthy twin (that is even what the State of Texas said in response to our lawsuit). My husband and I had to go to Colorado so I could get a single fetal abortion. Thanks to my abortion, I delivered our healthy twin in March 2023, two weeks after we filed our case.\n\nI have submitted and/or told my story under oath multiple times. I have also testified before the [House Ways and Means](https://www.instagram.com/reel/DACQf3uyflJ/?igsh=MXF2cnlrcG1wc2w4MA==)Committee and the [Senate Judiciary](https://www.judiciary.senate.gov/committee-activity/hearings/crossing-the-line-abortion-bans-and-interstate-travel-for-care-after-dobbs) Committee.\n\nAMA!\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1giydzi/i_am_one_of_the_first_women_to_sue_texas_over_the/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "First AMA?  Her picture shows that she'll be back at 9PM CST.", "label": 1}
{"text": "Why in the world would anyone live in that hellhole?", "label": 1}
{"text": "I costs a lot of money to pick up and leave.", "label": 1}
{"text": "I understand", "label": 1}
{"text": "Did you know that you're also hot??", "label": 1}
{"text": "I’m certain I’ll get downvoted, however what are your personal beliefs about late term abortions when the life of the mother is not in jeopardy?", "label": 1}
{"text": "This shit is so pointless. You’re a moron.", "label": 1}
{"text": "Yes.\n\n1.  Psychotic religious people.\n\n2. Uneducated morons who have fallen prey to racist and inflammatory rhetoric and have fallen in line with all party-approved notions of morality.\n\n3. The generically ignorant masses who either believe \"women are killing babies for fun because they're sluts\" or \"examples of women dying are hyperbolic rare-case scenarios so it's not a legitimate pro-choice argument\", or both!", "label": 1}
{"text": "Are you planning on answering any questions?", "label": 1}
{"text": "lol OP didn't answer a single damn question... did TX put her in prison for this post?", "label": 1}
{"text": "I'm not OP, but I live in an ultra conservative part of Texas.  Most everyone, including women, are in favor of the ban because anything less has been sold as infanticide by the evangelical church.  Those same folks also have a deep mistrust of education and science, and so they will not hear anything about fetal viability, evidence, or utilitarian 'greatest good' reasoning.  It's all very black and white.  Until, of course, it happens to them.", "label": 1}
{"text": "The most hardcore people I personally know that are anti abortion are women.", "label": 1}
{"text": "She was healthy enough to travel out of state for a medical procedure. So ask yourself, just how \"in danger, medically\" was she?", "label": 1}
{"text": "> if a woman is in an emergency situation,\n\nIf she was in an emergency situation, she would have received the care she needed. That's Texas law.", "label": 1}
{"text": "What a dipshit you are.", "label": 1}
{"text": "Why would an early delivery not suffice? Why does the baby's head HAVE to be crushed? Why do you insist on killing the infant before delivery?", "label": 1}
{"text": "Center for Reproductive Rights - [link to donate](https://secure.reproductiverights.org/a/join-the-fight?source=25WBAGE-XX02AAX-ON&utm_medium=web&utm_source=link&utm_campaign=25WBAGE-XX02AAX-ON&utm_content=donate)\n\nThis is the organization that she mentioned in her post", "label": 1}
{"text": "They were specific statements in reply to comments made. Read the comment I replied to and then my reply. They're pretty self-contained.", "label": 1}
{"text": "Why would I admit to something I don't believe?", "label": 1}
{"text": "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/ProtectDemocracyOrg**\n##We’re Protect Democracy, tracking and defending against efforts to undermine the will of voters and democratic institutions. Ask Me Anything about the threats facing the 2024 presidential election—and the challenges that could follow…\n\nWe are Jess Marsden and Brad Jacobson of [Protect Democracy](https://protectdemocracy.org/), a cross-ideological nonprofit dedicated to defeating the authoritarian threat and building a more resilient, inclusive democracy. Jess oversees our efforts to protect free and fair elections, including our VoteShield team which Brad leads. VoteShield is made up of data scientists, engineers, and advocates who analyze public data, like voter files, to help protect our elections. We’re here to answer any questions about the road ahead; the threats and risks posed by an election denialist movement bent on deceiving, denying, and disrupting the will of voters; and how all of us can protect our democracy in the face of an ongoing authoritarian movement. Our [website](https://protectdemocracy.org/our-work/) is loaded with helpful resources to help you get started.\n\nProof: [https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F80jhrebf3xyd1.jpeg](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F80jhrebf3xyd1.jpeg)\n\nProof: [https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F636c1jyj3xyd1.jpeg](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F636c1jyj3xyd1.jpeg)\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1gjldyj/were_protect_democracy_tracking_and_defending/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "Users, please be wary of proof. You are welcome to ask for more proof if you find it insufficient. \n\nOP, if you need any help, please message the mods [here](http://www.reddit.com/message/compose?to=%2Fr%2Fiama&subject=&message=).\n\nThank you!\n\n---\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "label": 1}
{"text": "> \"Stating facts\"\n\nSo, you do get it!", "label": 1}
{"text": "Ask your question directly, because I'm not following.", "label": 1}
{"text": "That statement introduces a scale on \"in danger, medically\" from which one can assess the situation and make a determination.", "label": 1}
{"text": "Why not?", "label": 1}
{"text": "And her other doctors disagreed.", "label": 1}
{"text": "My asshole itches dude?", "label": 1}
{"text": "> They only didn't provide treatment because they feared the law. \n\nYou're a mind reader now?", "label": 1}
{"text": "Because I want to.", "label": 1}
{"text": "⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣯⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣻⣟⣻⡺⣊?", "label": 1}
{"text": "Cockmeat samdwiches.", "label": 1}
{"text": "Hi there. You asked me to dm you to get help for my insulin. I tried to but your dm doesn't work. My post got deleted, but I still need help. Please let me know. ", "label": 1}
