{"text": "so alll leads back to...caste", "label": 0}
{"text": "TLDR ?", "label": 0}
{"text": "Masturbate", "label": 0}
{"text": "overpopulation", "label": 0}
{"text": "The ideology outside India especially in many other non Asian countries is that food cannot taste good unless it has some sort of animal protein. Animal protein is so prevalent that believe or not, it may be impossible to find veg options except potato and salad in some places. \n\nMajor part of India does have animal protein but most people do not have animal protein everyday. Find me more than 10 Indians you know who genuinely have animal protein everyday. On the flip side, Indian cuisine is gods gift to vegetarians. The variety , the spice, the decadence of vegetarian food is amazing", "label": 0}
{"text": "We also have the largest population.", "label": 0}
{"text": "It’s really refreshing seeing a take that doesn’t generalize an entire population based on anecdotal accounts and propaganda. You’re awesome dude and love the username! \n\nJust like you said there’s a lot of Indians that have no sense when they go out into the world. There’s also just as many that are quick to pick up on cues and adapt to local etiquette when they travel. I think Indians are the latest group that’s popular to bash online and it’ll probably be the norm for a few years.", "label": 0}
{"text": "Cologne is also gross. Wash your clothes  wash yourself daily and use deodorant. Carry deodorant with you and apply as needed.\n\n\nDon't try to mask stink with cologne. Ugh.", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "bro I'm like 16 and i know like 50+ stories just about women feeling uncomfortable. Damn dawg I feel bad. Can't even express shit like fr I'm sorry for whatever happened to you. bros can't even go out for a walk without being harassed", "label": 0}
{"text": "I (South Indian) live in the US and I’ve come across a lot of Indians who behave in a way that’s not normal anywhere outside India (including my parents when they visit). They all just say “we want to live like we do in India” and my response to that is always like “get a car, sit on the right seat on the front, drive it on the left side of the road and see what happens. If you can’t do that basic thing, you can’t live or travel here”. I get no response from any of them after that lol", "label": 0}
{"text": "You should see how tribal lands are taken away for mining.", "label": 0}
{"text": "Putting on deodorant even if it wears off eventually is infinitely better than no deodorant. Just do it in the morning and good deodorant will last till you get home. You don’t need to ‘top up’. Odor is created by bacteria and the job of a deodorant is to kill odor causing bacteria. How bad your sweat smells is a combination of genetics, diet, and other factors.", "label": 0}
{"text": "The comments already said everything to say about the incident itself but what I'm astonished by is your brother guilt tripping you... what the fuck!?", "label": 0}
{"text": "The balm thing is nuts bruh, do they do it on all flights or especially for India bound flights?", "label": 0}
{"text": "Because their parties at level 100 seems just level 2 for us. You won't even hear it if you just close the window.\n\nBut our noises at even level 10 ? Lets not discuss", "label": 0}
{"text": "People keep dismissing him, but should we continue to do so until something actually happens?", "label": 0}
{"text": "I am gonna steal this quote!", "label": 0}
{"text": "Is OP Congress follower? Did your mom teach you to negotiate with Terrorist? Or wannabe terrorist? Communist nation means few have eternal power and rest have none... Not even a say. Glad we have friends beyond the neighbours. Taiwan, Afghanistan, Russia, United States, Germany etc.", "label": 0}
{"text": "For OP, all the things that could have gone wrong with Indians, did go wrong, I totally believe it.", "label": 0}
{"text": "Dear HR,\n\nI want to take a moment to address the aux misuse situation. Yes, I acknowledge that I was misusing the auxes. When my previous team leader, Anish, questioned me about my low call volume, I admitted to my actions and received a final warning letter. This was a difficult moment for me, one that I have reflected on deeply.\n\nMonths later, Anish shared in a team meeting that he had caught others toggling auxes but had only issued verbal warnings. In September, many advisors spent significant time on callback calls, some lasting over 30 minutes to an hour, yet they, too, received only verbal warnings for call avoidance from Shivson. This month, I noticed several advisors toggling their auxes while I was checking the queue. I can’t shake the feeling that I am being singled out, especially following a difficult conversation with Shivson.\n\nOn July 25, 2024, I faced a particularly challenging day, having to undergo surgery while my wife delivered our baby. I had requested 15 days of paid leave, including 5 days of paternity leave, four months in advance, but was denied by Shivson. He claimed that since I had already taken 2 months of leave for my prior hospitalization, he couldn’t grant more than 2 days along with paternity leave, even though I had a paid leave balance available. I accepted this decision, but soon after, I was diagnosed with a hernia that required urgent surgery.\n\nUpon returning to work, I spoke with Anish about needing an additional four days of leave, only to find that Shivson had denied my request again. I explained that had my initial leave been approved, I wouldn’t have needed to ask for these extra days. Anish arranged a meeting with Shivson and Jason, which felt predetermined. Within the first 15 minutes, I realized the meeting was simply to deny my leave. Despite my attempts to stop them, they dragged the conversation on for an hour, leaving me feeling defeated. \n\nAt the end of that meeting, Shivson mentioned that had I applied for my leave on Genesys 90 days in advance, it would have been approved. Ironically, he had previously denied my 15-day request for my wife’s delivery while accepting only 2 days and 5 days of paternity leave. I struggle to understand why managers assure potential applicants that they can take as much leave as needed, only for that promise to vanish once they join the organization.\n\nDuring a skip meeting, Shivson referenced our previous conversation about my leave, making me feel as though I was being kept in mind for all the wrong reasons. It seems I am being unfairly targeted while others operate without consequences. I vividly recall our last conversation, where Shivson asked, “Why should we trust you?” When I attempted to explain myself, he cut me off, declaring, “No, we can’t trust you.” This interaction left me feeling that his primary objective is to have me removed from Sterling.\n\nI do not wish to continue in a workplace where I feel like a target of a manager’s scrutiny. This situation saddens me not only for myself but for any colleagues who may be experiencing similar hardships. I had a coaching session with Jeffrey on that day, where I expressed how disheartening it is to be on the verge of removal while still taking calls. His laughter at my situation felt like an indication of a toxic environment, making me feel as though there is a lack of empathy for employees who are struggling.\n\nI struggle to continue in a workplace where any misstep could lead to my being targeted, while others appear to be exempt from repercussions. Thank you for listening to my feelings during this difficult time.\n\nSincerely,", "label": 0}
{"text": "I feel you man. SMH. Boils down to lack of self awareness and lack of civic sense.", "label": 0}
{"text": "Not individual it has to change collectively .", "label": 0}
{"text": "Lauda", "label": 0}
{"text": "We have failed as a society.", "label": 0}
{"text": "all you said was standing in groups", "label": 0}
{"text": "AFAIK China has the same or worse level of lack of civic sense as India.", "label": 0}
{"text": "So your solution is to, give the land to the other party, piss off the majority ultimately leading to a greater hatred for the minority community, protests, violence, and hatred being spread and this issue burning for generations, riots, intolerance and worse case scenario partition again? All because in your idealistic world everything is either black or white.\nThis is not about God, it never was. That's what you don't get, \"friend\". Please step out into the world. It is not good. And never will be.", "label": 0}
{"text": "If it's a out IT, IT salaries in India is better than Germany.", "label": 0}
{"text": "If it’s the local bus or train, I understand people might not be able to afford deodorants, so while I hate it, I shut up and deal with the odour, but if you have money to travel via flights, which majority of our country can’t, if you have enough privilege to move outside India, which again majority of our country doesn’t have, atleast then buy deodorants! It doesn’t matter if you think you don’t have body odour, you might be used to your body odour but others aren’t, please just use it. Also socks are a single use item, don’t stuff them back into the shoes after you’ve worn them a whole day to reuse them, you wouldn’t rewear your underwear without washing right ? The same goes for socks. We need to do better, this is not ok.", "label": 0}
{"text": "Ok, but where are these damn jobs?", "label": 0}
{"text": "Write all this on X/twitter with anonymous account and tag all print and tv media handles. Some might publicise it. Once viral, the correction process will take its natural course.", "label": 0}
{"text": "The original comment was about standing in groups on a sidewalk, in places where people are trying to move ", "label": 0}
{"text": "Oh gosh, I can relate, here in London there's a lot of difference between buses going through Hounslow and other areas. People pushing like they do on buses back home, asking invasive questions like what's your salary to a complete stranger, and playing reels out loud, ugh it's so annoying.", "label": 0}
{"text": "Americans are super loud people. Indian noise pales in front of them.  Although they have much better civic sense in other regards.", "label": 0}
{"text": "good i guess keep them locked up, for good amount of time, crossing any border without a visa should be highly punishable offence", "label": 0}
{"text": "Women in India Gotta start having Guns , tasers and pepper sprays 24/7 . these pervert Madarchods are never gonna  stop thinking shit. So it's better our women start hiting these people with lethal force.   \nMan I wish I was the prime minister or something cuz I would straight up pass a bill across india that the only punishment for rape is tortured to death and punishment should be served in maximum 72 Hours after Arrest. only then these assholes would learn.", "label": 0}
{"text": "You don’t really need to be actively working. Just enter the details like PAN, Aadhar and last workplace details and it’ll be fine.\nBut you won’t get free forex feature.", "label": 0}
{"text": "N(ch&tiya) means moron", "label": 0}
{"text": "If you dont see issues in this then there is problem", "label": 0}
{"text": "This is interesting. Never knew about the shared history between Indians and Netherlands. I should read about it. Have your ancestors moved during the colonial times if I may ask?", "label": 0}
{"text": "Same issues on the flight from Thailand to India. Gutka spit stains in the loo on top of all this nonsense. This is the reason we’re ridiculed and even hated. So embarrassing.", "label": 0}
{"text": "karni sena sikhs me popular hai. \n\nharmony in extremism I guess.", "label": 0}
{"text": "Uttar Pradesh will never change. They take pride in their misogynistic and patriarchal culture. I hate generalizing an entire state but that's literally what it is.", "label": 0}
{"text": "How can they do worse every time", "label": 0}
{"text": "Try that, where young generations are thought (this is clearly evident from what we see in reels) that girls dont have any rights. You cannot expect them to understand what civic sense is.\n\nI mean we should still try to make that happen, will our so called leaders (all parties) let it happen. This disrupts there vote bank.", "label": 0}
{"text": "Exactly, the best way to control the population is through economic and social development, not through state imposed reproductive controls.", "label": 0}
{"text": "You need 10-15 crores to get business visa. \r\n\r\nA lot of people take private loan on properties. Like 1-2 acre land. You cant sell to start business.", "label": 0}
{"text": "Basic common sense left the chat. \n\nPimples can also spread and what about people with Dandruff🤡", "label": 0}
{"text": ">Even if we happen to beat China and USA in terms of economic growth and become the most developed country on this planet, we would still collectively lack in one thing and that's civic sense\n\ni mean, i agree. but china and the us are not good examples of countries where people as a rule have good civic sense. people here (in the us, where i live) may not be pushing you while in line but they'll start a fight with service workers even when they're objectively in the wrong and smoke in your face indoors and walk around in public watching tiktok with no headphones at full volume. americans and chinese are notoriously terrible tourists too.\n\nif you want an example of country where the vast majority of people have good civic sense you want somewhere like japan. i would put thailand in this category too. i grew up in thailand and i never saw thai people litter (always tourists lmao). it's really just the first few generations who need serious civic education. once you've got a whole society of people who whisper to each other on the train to not disturb the other passengers, kids get the message after being shushed a bit.", "label": 0}
{"text": "Can I do this trek in may?", "label": 0}
{"text": "The camera can be used after the crime is done, for a psycho its not a deterrent and camera also can be destroyed", "label": 0}
{"text": "Some people lack civic sense and it has nothing to do with nationality, if you would've minded your own business put your headphones on and watched a movie and simply ignored all of this?\n\nhttps://preview.redd.it/che0iofxcywd1.png?width=1080&format=pjpg&auto=webp&s=7282864725537ca85e2b794d98c19b4652c0c638", "label": 0}
{"text": "Kaunsi company ka bat liye ho Babu 🏓", "label": 0}
{"text": "You can get this stuff from Home Depot in the states.  It's honestly not that hard.", "label": 0}
{"text": "Y'all are not wrong. But making such a big post, seems like a problem to me. \n\nYou're stereotyping your own people because stereotyping is mainly the western concept. And we usually just copy it and start doing it. I have done it as well. But what's the solution? How can we be different?\n\nI think the best way is to do your diligence. If you're coming out of India, just don't be scared out of your comfort zone. Try to make connections with all other ethnicity. If you will go alone then people will be more compassionate towards you. Sometimes you could face challenges but in the end you will learn more because not everyone is perfect and other people could learn good things about you and those unrealistic stereotypes will probably get resolved in a better way.", "label": 0}
{"text": "Recently went to thailand … and on cruise smoking was only allowed at back side .. one indian group start smoking on front deck where its not allowed.. i was there with my friend which are from Nz ( white ) they told me why there are smoking here … i went to captain and told … the captain came and shouted at them … like we already make announcements before leaving shore about smoking.. be will fine you if this happen again .. after captain left they start laughing behaving like nothing happened… i have seen so many Indians almost from every region staying here in Nz as well without any civic sense … they will litter … but here in NZ people are really outspoken if someone from any community behave abnormal they will call them out straight..", "label": 0}
{"text": "The thing many old women from like our grandmas and moms generation women also have similar thoughts especially in rural areas which they pass on their daughters and sons . So the daughters self esteem and confidence becomes less and the sons become assholes", "label": 0}
{"text": "https://preview.redd.it/p75poylodywd1.jpeg?width=336&format=pjpg&auto=webp&s=396a8f928729356942a445f67502e723668d2be0\n\nHe backed out I think. Anyway, the real lesson is this one. All he had to do was keep it under the wraps and negotiate a deal with Reliance. Could've made a few lakhs maybe.", "label": 0}
{"text": "Denial is what we need to improve upon and then move onto other steps", "label": 0}
{"text": "This country sucks.", "label": 0}
{"text": "Living Hell for real man.", "label": 0}
{"text": "Just walk 2km and get your stuff mate. How long u gonna wait to eat bread and eggs???", "label": 0}
{"text": "Maybe, Maybe, you can try to remove literal terror images from your place of worship. people say that helps. \n\nThough I am also concerned about moderates, But they never raise their voices.", "label": 0}
{"text": "Was there Reddit ?? 😀😀 we always had challenges - but a solid foundation by Nehru - later stuttering with indira - revived by PVN and vajpayee - back to stagnation/crony capitalism\n\nModi is very similar to indira in authoritarianism and crony capitalism (daddy Ambani was indira crony)", "label": 0}
{"text": "This is plainly wrong. Barely months ago, example presented itself in the form of an uncivilised Indian lady who travelled through China and caused a ruckus there.\n\n[https://www.hindustantimes.com/trending/internet-shocked-by-indian-youtuber-s-behaviour-in-china-bike-snatching-forced-seat-swap-101721104912468.html](https://www.hindustantimes.com/trending/internet-shocked-by-indian-youtuber-s-behaviour-in-china-bike-snatching-forced-seat-swap-101721104912468.html)", "label": 0}
{"text": "Least of the problems.", "label": 0}
{"text": "Wow. You are exactly the kind of person who needs covid education. It took you literally 3 comments to start insulting someone. Please represent your country better", "label": 0}
{"text": "i thought i was the only person who got these reels lmao", "label": 0}
{"text": "I live in the US and love Indian food.  I understand much of it is Americanized.  For those familiar with the items commonly sold at American Indian restaurants, what items are actually authentic and what aren’t?", "label": 0}
{"text": "If you’re a women in India consider carrying pepper spray at all times. I don’t live there but a lot of the men their are disgusting incels", "label": 0}
{"text": "Wow that's the right reaction!!!", "label": 0}
{"text": "Indians are among the worst tourist groups in the world and Indian immigrants outside of the US are also very uncultured. You’re lucky you live Krakow which I don’t assume has that many Indians. Indians in Canada, especially in Toronto and Vancouver are next level cringe and inconsiderate.", "label": 0}
{"text": "same for pakistanis buddy, we might be seperated by borders but we still have the same problems of ettiquites", "label": 0}
{"text": "How big is the underserved market in India? I never thought the cellular network wasn't enough.", "label": 0}
{"text": "Oh that's sad and heartbreaking. I keep hoping that speaking up like this though will help people gain sense, even if it's one person at a time.", "label": 0}
{"text": "I invite you to experience Deutsche Bahn", "label": 0}
{"text": "How are things now? Did you moved back to Samsung or still using an iPhone?", "label": 0}
{"text": "There are a lot of collectivist cultures around the world that have civic sense. It has nothing to do with collectivism. \n\nIndividualistic societies aren't all that great, there's a serious social lacunae in individualistic societies.", "label": 0}
{"text": "Canada is not that Indianized yet. A few like your types is enough to turn any country into a stinking hellhole.", "label": 0}
{"text": "Evan Dyer, writing for CBC, highlights India’s refusal to align with the West, with Modi’s recent meeting with Xi Jinping at the BRICS summit in Russia reinforcing New Delhi’s commitment to non-alignment, despite U.S. attempts to woo it into an anti-China coalition. Dyer notes that, although U.S.-India relations have progressed in technology and defense, recent allegations linking Indian officials to dissident murders in North America have strained the relationship. Yet, Washington appears to compartmentalise these issues to preserve its strategic partnership with India. Meanwhile, India’s strong ties with Russia, a crucial arms supplier, bolster its ability to maintain a non-aligned stance amid global tensions. According to Dyer, India’s unique position as a non-aligned power offers a diplomatic advantage, allowing it to balance relationships with rival powers and resist pressures to side with any bloc.", "label": 0}
{"text": "Being a literate educated gentleman is an insult in India. Even the PM makes joke of \"hard work\" and \"harvard\", which to be fair, is a clever appeal to retarded population we have here.", "label": 0}
{"text": "I have a roommate who doesn't help clean the room unless forced to do so, plays reel on his speaker when I'm studying/sleeping and when I protested he asked me to tell him to plug in ear phones every time I needed peace and I told him what he wants to watch is his business and I don't want to hear what he's watching because I don't play my shit on speaker. That reached nowhere and he also doesn't contribute to common expenditures like mosquito repellents etc. and uses my stuff and space like he owns it. We Indians do not have consideration for people around us which is terrible. It can be seen everywhere from public transport to use of public property. And then we have people boasting India as a collectivist society. Is this what collectivism is? Not letting other people live in their space?", "label": 0}
{"text": "It is a straight question, did his ministry carry out the consultations for vision 2047, if the answer is No, then Modi has been lying , If it's yes, then how much was the expense of it? , If they are not ready to give answer the assumption would be , he has been lying and the departments are siphoning the money else where.", "label": 0}
{"text": "Last time I was flying US through finland. I saw the Air hostess seat belt a fully drunk indian male in his seat because she didn't want to delay the flight. She only prayed he did wake up. Luckily he didnt. But the frustration on her face said it all. After all the procedures were done she told every woman around him if there is any issues please just get up under pretext of water and come to the back of the plane. She definitely has seen worse. Was glad she looked out for us because that guy was nuts trying to drunk talk while we were taking off. \n\nAnd dont even get me started on aisle and baggae and stuff manners. And the poop smell in the plane near the restroom seats. Me and the other and 2 others behind us had scarves on our nose almost half the flight. And during flight random ppl used to get up and start their chatting sessions mid aisle as if it was just a outdoor park. The airhostess had to ask them to keep the loud talking low sooo many times.", "label": 0}
{"text": "Maybe [this](https://en.m.wikipedia.org/wiki/Indo-Surinamese) gives you some more insight.", "label": 0}
{"text": "Jensen to paglo k jeinse Hansa hoga yeh sunkar, aur usko realised hua hoga if this bambami dude had played fair and square he no way be the number top 1 or 3 rich of the world.", "label": 0}
{"text": "Dude am in Canada right now  came here thinking this was the most nicest most friendly place in the world. Even though one of my friend already there did try to warn me about it , i just thought for me it would be different ( i speak English a lot better than many of my peers ) I thought the movement i land there my friend group will look like one of those  international university adds .it took about 2 weeks to realize the real thing and it is that most people don’t want us here especially now then i made the even stupider decision of moving yo a small town out in the middle of nowhere and the racism became tenfold never been told to go back its all the other things that you mentioned \n\nAnyway recently i had a chat about it with a indigenous guy (they still face alot of discrimination and stuff) and he told me that no matter how good you speak as long as you have this face you wont fully feel like you belong \n\nPS (if you in Canada) since its that time Pin the poppy thing on yourself even if it hurts ,really pisses some people off if you don’t,and loony means a dollar.", "label": 0}
{"text": "Pressing x for doubt.", "label": 0}
{"text": "More tax", "label": 0}
{"text": "You have to be more specific than that by giving concrete examples.\n\nIndia's license raj was due to socialist policies by the state, Germany is a market economy, there is a world of difference between the two.", "label": 0}
{"text": "I live in the Netherlands (in Brabant). The Indians who come here are all either highly educated, or they come for education. On the other hand, in Canada, you will find many Indians who are uneducated and low-skilled, so they tend to have poor behaviour and it is never corrected, so their beliefs are reinforced. ", "label": 0}
{"text": "Bro we are 137/190 in terms of per capita gdp which is a better metric to measure the real economy.", "label": 0}
{"text": "As an Indian to another Indian (also staying abroad - UK / ireland).\n\nThese are some of the things that I observed :\n\na. Indians will greet others but as soon as they see you they will act as if you don't exist.\n\nB. Indians will make sure that if you are in their friend circle, there will be always some bs politics and make sure that you are always a competitor and not a friend.( Not always the case based on personal experience)\n\nC. Indians will skip queues or atleast the students here not going to focus on where they come from but they try to skip queues had to stop some of my own friends. \n\nD. Indians will try bootlick their employer considering he is a native but will never try to help their colleague, especially if they are elder than you they will be manipulative. (Not always the case)\n\nI have seen groups of Indian students just check me out as once I was hanging out with a mate who is a native they did not greet but simply walked past checking me out and that creeped my mate out as well.\n\nTalking loudly while walking on the streets etc... the list can go on.\n\nP.s. - no hate towards Indian, I hope we all get past these futile things and represent ourselves and our country in a better way.", "label": 0}
{"text": "Elections are generally won in a margin. Currently there is a bit of rise of far right in Germany.", "label": 0}
{"text": "Someone please explain why capitalists like Elon Musk are claiming that auction goes against a open-market approach.", "label": 0}
{"text": "In that very meeting, India went against the tide and said it's not interested in an anti-west bloc. This in a backdrop of new bric currency by Russia, Iran wanting to speed it up etc. \n\n\nThis author is heavily biased.", "label": 0}
{"text": "Kind of like, weighing Roma tomatoes at the self-weighing machine, but switching the tag to a normal tomato. \n\n\nI billed myself the other way around once, by mistake. The attendant told me that I am overpaying for an inferior product by selecting the wrong one. ", "label": 0}
{"text": "You don’t have control over what others do. Period. I think we’re way past the point in numbers where we can teach everyone basic civic sense. And I am certain everyone who comes across these posts agrees with everything you’ve listed anyways. Those who need to hear it are never gonna come across it so whats the point? I think all we can do is just carry ourselves with decency and call out friends or family if they do anything they shouldn’t be doing. We are in no position to call strangers out irl so it kind of becomes our responsibility to be and keep others around us accountable and represent India the way we want to. Shitting on other Indians is not the solution.", "label": 0}
{"text": "US here - please be careful not to elevate us for exceptional morality; we will lie, cheat, and steal any chance we get. In grad school, the teaching assistants patrolled exam halls and were constantly looking for plagiarism. It could be that our curriculum is not as difficult.\n\nSome portion of our politicians engage in lies, bribes, and insider trading. Very few are paragons of virtue. Perhaps in the past it was different, but I'd say for the last 50 years there is no honor in virtue.\n\nOn the surface we condemn cheating publicly, but if nobody's looking we will cheat and steal to get ahead - like anybody else.", "label": 0}
{"text": "2 things I want to highlight..\n1. The issue is not only what is mentioned by the op, let's add more to it.. the Government is planning to shun the old regime, that means India or the Government does not want the young people to have a fulfilled retirement. To add on to it.. the NPS contribution what we are doing will be taxed post 60 when we convert it to the annuity portion. \n\n2. I am ready to pay my taxes, give me a special status. Give me an ID card, colour coded may be, basis which all the Government departments or authorities will respect me as they are earning their livelihood because I am paying 30% of my income as a direct tax! We need the special status. I should not be harrassed by any Government departments and my queries should be solved on priority. My votes should be considered more premium than non tax payers. Some recognition at least..", "label": 0}
{"text": "The UI of JioMart itself is unwelcoming. They show products for your pincode but when you click on \"Add\", you get a message that they're out of stock. If it's out of stock, why are you showing it?", "label": 0}
{"text": "Would it kill you to use some punctuation?", "label": 0}
{"text": "I don’t really understand how gutka works lol, I just said it in a joking way. \n\nExcept I absolutely despise chewing tobacco", "label": 0}
{"text": "Bro so much has been diluted in what you mentioned.\n\n1. Reiterating, $ was not picked as the reserve currency because of its stability. It is because multiple countries were made to trade in $ for oil mainly. After this, the other countries HAD to use $ to get other things too.\n\n2. USA was left standing after WW2 because they joined the war so late. After the rest of the world had been in the war for a while.", "label": 0}
{"text": "I was in an internal flight in Japan, and Japan is seriously very silent. It was deep silence in the flight. \n\nIn 2 mins I hear a family talking loudly in that entire flight, we could hear them clearly. Why can't they simply behave?", "label": 0}
{"text": "The most obnoxious person I've ever seen on a flight has been an Indian. \n\nDelhi to Dullus in Emirates, during the Delhi to Dubai leg. Dude (a fairly large man) and his family or 4 got an entire bag sack full of cooked food with them on the flight, even though Emirates provides fairly good food, even in economy. But still, that wouldn't have been a big deal if he hadn't constantly disrupted the hostesses during their rounds and when pointed out that he was delaying food or drink service, had the temerity to tell the hostess - fairly rudely, mind you - to wait for him to complete whatever he was doing. And to top it off, he left a bag in the aisle and when the hostess pointed that out, he asked her to keep it in the overhead compartment. \n\nIt was a cartoonishly weird experience.", "label": 0}
{"text": "Those who raise their voices or even try to raise their voices are silenced. \nThere is no hope, unless you are rich AND have powerful connections", "label": 0}
{"text": "12 baj gaye", "label": 0}
{"text": "Only one winner. Pawpaw ka Pawpaw", "label": 0}
{"text": "You don't really need loans.\n\nI went to a big state school, instead of expensive private schools or Ivy League.\n\nAgain, I didn't make an argument of the should contribute or integrate.\n\nMy argument is: someone (smuggler) is showing you a starry eyed rosy picture, you decide to move your life and your family's life without even checking once what others had to go through? That's your fault, and be ready for the consequences.", "label": 0}
{"text": "M'kay, Sherlock.", "label": 0}
{"text": "I live in dubai and god i agree with everything you said. \n\nThe people who are coming in now- sheesh. \n\n1. Walking on the roads like they own it. Without seeing if a car is coming or not. And escotters and bikes have made it worse. Why drive on the fucking road!\n\n2. Metro. The stink. God. I understand the weather is hot here and one does stink, use a god damn deo!", "label": 0}
{"text": "Basic civic sense is lacking in many in our country.", "label": 0}
{"text": "All hail mota bhai!", "label": 0}
{"text": "For the love of God report the driver immediately. This is incredibly scary. If Uber doesn't do anything write an FIR to the police. This is horrific behaviour and this man is dangerous.", "label": 0}
{"text": "Done", "label": 0}
{"text": "Love how your reply has 14 upvotes while me raising important concerns has 0 upvotes incredible", "label": 0}
{"text": "Not disagreeing with you here, just stating my anecdotal exp. \n\nRe:loans, yeah for PhD assistantships usually cover most of it, less so for MS (depends on program and university). I'd argue even with state school loans it's manageable if you can land a decent paying job.\n\nHard agree on the last point but how do you explain that to people?", "label": 0}
{"text": "You are an immigrants not an expat.", "label": 0}
{"text": "Good culture in India? .. this is rarest of rare thing imo", "label": 0}
{"text": "I’m not an immigrant I’m temporarily living here for a few months", "label": 0}
{"text": "That's why India is part of I2U2 and Quad with US ?", "label": 0}
{"text": "this.", "label": 0}
{"text": "I want to see a Delhi guy in Berlin saying why should I learn German, English is a global language. /s", "label": 0}
{"text": "Dude. I am not Indian whatsoever but chill. One of the biggest reasons these people are the way they are is colonnialism.", "label": 0}
{"text": "Because Hindus are just another level of noise - it's not even musical like the other carnivals or festivals from around the world. Hindus will literally blast loud bhajans or make a poor tone deaf panditji scream into a mic early morning in residential areas. They take take up roads and create traffic jams on EVERY festival just to assert themselves. No other religion gets that kind of police protection or permissions. You feel everyone is being intolerant to hindus - let me tell you Hindus are making it harder and harder to tolerate their antics. Not all hindus but somehow always a Hindu.", "label": 0}
{"text": "Actually true lol. With decent experience in FAANG like companies, you can probably make more money in Bengaluru than in Germany. Only country which pays absurdly high is US.", "label": 0}
{"text": "delete north india", "label": 0}
{"text": "Jiomart was a DOA service. The fact that you are still trying and expecting a miracle shows your perseverance. You can add this to your cv as a point for optimism - ordered in jiomart and expected the order to arrive in due time.", "label": 0}
{"text": "Try getting into US directly it’s even tough than Canada", "label": 0}
{"text": "First know the difference between expat and immigrant.", "label": 0}
{"text": "I don't know, I feel like OP is over reacting \\\\ misread the situation out of fear (Non-Hindi speaker).  \n\n>Told my brother and now he is guilt tripping me about having taken someone's job. \n\nOh I would legit do this lol. On a more serious note, I would exercise caution when using words like creep \\\\ stalker \\\\ rape \\\\ murder. You see, one of the benefits that this \"fucking shithole of a country\" (as you described, lil bit offended) gives you is that it values women's voice over men. So use it carefully because I don't think that the uber driver **wanted** to rape you but I get it that he **has** made you feel conformable. But yet this post is titled, \"Creepy sexist Uber driver wanted to r\\*pe me. Kolkata Doctor tragedy can and will happen again. When will this end?\"\n\n  \nOMG.. Believe if you want but as I was typing this comment (PC) and looking at my phone, this just came up... and I think that just sums everything that I have to say... \n\n[https://youtube.com/shorts/3HeYO6538k8?si=DR6HtppHdjeVQzhY](https://youtube.com/shorts/3HeYO6538k8?si=DR6HtppHdjeVQzhY)\n\n  \n**PS: rape is a crime but so is false accusation.**", "label": 0}
{"text": "Care to tell me the difference ?\n\nhttps://www.bbc.com/worklife/article/20170119-who-should-be-called-an-expat", "label": 0}
{"text": "Crazy how people are upvoting this guy saying I’m an immigrant 💀 bro literally google up what an expat means", "label": 0}
{"text": "I agree with OOP’s  original post completely, but regarding this comment, at least in a US context. that only Indians have loud outdoor parties for festivals is completely untrue. My neighborhood’s block parties (mixed white and Latino) are really loud. 4th of July is really loud. Mexican Independence Day is really loud. You can’t avoid these noises by closing your window lol. \n\nIn the summer, my next door neighbors, who are Mexican, have barbecues in their back yard with their families multiple times a month. They play loud music and have fun. When they see me out and about during the bbqs, they often invite me to come hang out and have a plate. I usually go, and yes, maybe the noise is a minor inconvenience, but they too should get to enjoy their property to the fullest extent during reasonable hours.  Especially if something is not happening everyday or weekly, we should also adjust to the people around us celebrating special events.", "label": 0}
{"text": "May God bless the family.", "label": 0}
{"text": "I’m sure I’ll be downvoted for this None of his threats make it to other countries media. It’s just Indian media that makes him into anything more than a crazy uncle who’s a lawyer. If you see he’s never actually says what is quoted by him in Indian media. Interpol or the US have never charged him and they don’t take terrorism loosely", "label": 0}
{"text": "Looks like Ambuni ji borrowed the speech writer from Mudiji", "label": 0}
{"text": "To all downvoting I would like to know WHY\nI’ve raised important issues \nWhy don’t people understand the severity of this stuff here", "label": 0}
{"text": "I meant in terms of work permits.\n\nThe USA seems to give 3 year WP, according to the commentor you only get 1 year WP.", "label": 0}
{"text": "There aren't really many (or any) Americanized Indian dishes like it's the case for American Chinese, or for that matter, British Indian food.             \nSo, the dishes themselves are \"authentic\". That said, Indian food is extremely diverse with each state (and often, region within a state) having its own cuisine and culinary culture. But restaurants in NA usually stick to a very restrictive list. Most of the dishes will be from Punjabi cuisine - think Butter chicken, palak paneer (usually wrongly labelled as 'saag paneer' though they only use palak-spinach), koftas, mango lassi (not really popular in India though both lassi by itself and other Mango based drinks are so I guess it gets a pass) etc - with a few British Indian staples (chicken tikka masala, vindaloo) and maybe Dosa from the South.     \n\nOf course, restaurants often alter the method of preparation to suit local tastes, especially in areas without a huge Indian population. This is either by reducing spice levels or by increasing heat to ridiculous levels to attract those who treat Indian food as an extended version of the one chip challenge. Desserts are also usually made less sweet because most non-Indians find a lot of authentic Indian sweets to be cloying.        \n\nYou can find the \"authentic\" versions of familiar dishes along with restaurants specialising in regional cuisines in areas with higher Indian populations, like the tristate area, Dallas, the Bay area etc.", "label": 0}
{"text": "Definitely not Air India", "label": 0}
{"text": "Bro there’s no jobs in Germany, what will you do with a Visa. So many people I know are looking for a job there.", "label": 0}
{"text": "What's the big deal about that? Germany has had foreign worker programs for decades. The Turkish population in Germany is one the largest minority population and they have citizenship. They came to Germany as part of the worker recruitment. \n\nSo why not Indians too?", "label": 0}
{"text": "Why should it fucking matter what meat they ate?", "label": 0}
{"text": "If people already know the issues why not fix them", "label": 0}
{"text": "Roadmap full of potholes & lies.\n\nWhat happened to PMCares fund?", "label": 0}
{"text": "My husband is Indian, raised in the USA, and never wants to associate with other Indians either. He never has anything good to say about other Indians and gets irritated if we go somewhere with a lot of Indian people. I thought he was making a bad joke and remind him “but you’re Indian lol” but everything in this post describes how his parents act.", "label": 0}
{"text": " [Sank you for traveling with DeutscheBahn](https://youtu.be/wXjhszy2f9w?si=nlQIlqybSJ3Z_-bZ)", "label": 0}
{"text": "No, you don't explain it to people. It's basic sense to verify tall claims", "label": 0}
{"text": "Wow, the other comments totally streamrolled the very pressing points you made here with bullshit corrections 🤦‍♀️\n\nBut you're exactly right. That's why fundamentally, India isn't a \"developed\" country at the end of the day. \nFrom the grassroot level these changes needs to be made from their childhood. (I Believe education can be key)\n\nThis is my list of awful things\n\n1. Trashing everywhere with no hesitation (includes spitting and urinating in public)\n2. Horrid treatment of govt facilities\n3. Absolutely no road manners. Not just autos, two wheelers and all alike. Driving on footpaths, high beams above allowed powers at night, wrong way driving, and the works. \nTangential Point:  I wonder how practical it is for people who have luxury vehicles here. The same horrible potholes, bad humps, narrow roads.", "label": 0}
{"text": "Germany is following the exact path of Canada and Australia, inflate the GDP numbers by immigration and your GDP per capita either falls or stagnates. Really not sure if this is the right way for any country to operate.", "label": 0}
{"text": "Imagine this, this is that top 1% who can afford flight. Even this \"elite\" category of people don't have basic etiquettes 😔", "label": 0}
{"text": "Cuz truth is a hard pill to swallow", "label": 0}
{"text": " I think we should start teaching basic hygiene in schools, like how to use deodorant. It's so annoying when people don't realize how bad they smell and make everyone else suffer.\nAlso, as Indians, we need to be more mindful of our behavior in public. We should be gentle, have some civic sense, and respect other people's space and culture, especially when we're in a different country.\nI remember when I was pregnant with my baby and it was my due date. I started having contractions, but the hospital told me to come later and that the pain was manageable. So I took the bus home, but it was so full that no one gave me a seat. Not a single Indian person offered me their seat. But then, this young white man came and helped me to get a seat.", "label": 0}
{"text": "Fawad Khan living in India is expat and infiltrates from Pakistan who have no intention to going back is an immigrant. \nSince he has clearly mentioned he wants to go back and is still Aus citizen, he is expat", "label": 0}
{"text": "I didn't have to scroll 5 lines before I could confirm that you are talking about Delhi.\nIt's a fucking shit hole.\n\nTry moving down to Bangalore or Chennai if you want a reasonable experience of what it's like living in India.", "label": 0}
{"text": "Bruh read the thing I’m talking about Mumbai delhis like a 1000 times worse", "label": 0}
{"text": "No problem I have lived in Mumbai for few years and now live in the USA. Situation in Mumbai is quite terrible if you compare by Western standards, but the city has charm of its own if you are willing to look beyond the day to day inconveniences. On honking, traffic and pollution I know locals are quite aware but no easy way to reform it to western levels any time soon.", "label": 0}
{"text": "I understand your frustration esp. coming for a first world country but you have to understand that India is still a developing nation, and managing 1.5 billion people is not that easy. Not saying it’s not possible but the Indian society has a lot of problems and it’ll take atleast 40-50 years if not more to change: especially regarding the issue of women’s safety, men being less misogynistic (but let’s face it, it’s not an Indian issue) I live in Europe and it’s also quite prevalent here. \nAnd you can’t complain about the weather, like cmon, it’s Mumbai not fucking London, it will be warm and humid 🤷🏽‍♂️", "label": 0}
{"text": "So what are short term immigrants ?", "label": 0}
{"text": "Send them back.", "label": 0}
{"text": "Knowledge is not sense", "label": 0}
{"text": "What a beautiful culture...", "label": 0}
{"text": "No, 100-150k € isn't a lot in germany. Even experienced engineers earning 200k-250k€ is probably less. You just get paid 3,4x of minimum wage worker after spending so much on education. \n\nMeanwhile in US you can get 700-900k$ if you are experienced in your field. While India you can get 1-1.5Cr within 5 years of experience in FAANG like companies which is way way more than germany considering cost of living.", "label": 0}
{"text": "I'm pretty sure he is too.      \nThe writing style is screaming \"Indian\" to me.", "label": 0}
{"text": "Far right from India will gel well then", "label": 0}
{"text": "All those racist yt people in NZ dont belong there either. They are all descendants of colonial-settlers who committed genocide of the indigenous tribes. More than that, they are the CRIMINAL rejects of europe, who were shipped to NZ, so they wouldn't be ruining the better, more sophisticated bloodlines of Europe.\n\nDon't feel bad about yourself when you experience racism in NZ. Know that the people who are treating you this way are insecure losers who were the scum that European countries rejected lol. \n\nFocus on finding your joy, and connect with other NZ immigrants. Even get acquainted with the indigenous people of the land. Volunteer for their causes and build community with them.\n\nDon't focus on getting validation from colonizer-settler trash.", "label": 0}
{"text": "A few years ago, we took a bus from Katowice to Krakow and I was amazed how everyone waited patiently: 1. For the bus to arrive, 2. Pay the fare to the driver ( I guess we were the only one that did not have the exact fare ) and then take their seats in an orderly fashion. It was so quiet that I even dozed off for a few minutes.\n\nAlso Krakow is so beautiful I wish I had the chance to spend more than a couple of hours there.", "label": 0}
{"text": "Cuz we aren't unaware of these issues and the people who need to hear this aren't on reddit", "label": 0}
{"text": "Unpopular story once In college a girl gave presentation on graphics and how it works and technology behind it and said n(Vidya) the whole presentation I was not looking so I didn't notice it until the end when I looked at the slides. \nAnyways she must never had played games so I don't blame her for the incorrect pronunciation.", "label": 0}
{"text": "I stand by everything you said. \nI was born in India but brought up outside and when I came back to stay, I HATED IT. I hate the country, the society, the people and their mindsets. I got out as soon as I possibly could and I NEVER want to go back to live there ever again.", "label": 0}
{"text": "I don't care about race, creed, sexual orientation, etc. Everyone has a choice about how they will be seen, and unfortunately judged. I try to be non-threatening, and civil to everyone. Be good to yourself.", "label": 0}
{"text": "I AM NOT AN INDIAN as I’ve earlier mentioned in my post I’m an EXPAT working at deutsche bank\nanyways if I was I’d say the same thing about the state of this country it doesn’t take years to notice how bad of a situation it’s in and also jokes aside you must be Sherlock Holmes or sum determining whether I’m Indian or not by how I type", "label": 0}
{"text": "Racist", "label": 0}
{"text": "Yeah sure the uneducated and poor people are the ones driving cars and honking. They are the ones spreading air pollution. You're saying like you don't see a lack of civic sense in flights and on airports. \nIt's all the people bro, don't try to blame the poor for all these things. They aren't here to defend themselves, they are getting exploited by the economically upper class as cheap labor. They are poor because the government is shit and rich people are sucking everything they can out of them.", "label": 0}
{"text": "Where did you get this idea that \"No more STEM draws\"? The immigration plan does not mention it.", "label": 0}
{"text": "The EU - of which Germany is a part of - does not have that many options left, if you think about it. Russia invaded Ukraine; while Ukraine is not part of the EU, one reason for Putin being land-greedy is that the EU is constantly expanding (unfortunately, assimilating poor countries which need financial support). So it was clear that this will alienate Russia, even without Putin's mafia regime in power. So the EU cut itself off here, largely due to US doing geopolitical games here. Now, with Russia out, it is also instantly clear that Russia could not sustain its ware without support from China - and thus dictator Xi.\n\nSo now China is also hostile. The EU is running out of options here. Thus it makes sense to assume that India is the largest democracy in the world (it sort of is, actually), even though Modi is an ultra-nationalist. Of course it would be better if India were led by democratic forces, but which alternatives does the EU have here? India is huge; it is already the fifth largest economy world-wide and that will only grow. So, between Russia, China and India, the EU supporting India makes the most \"logical sense\", even with ultra-nationalist Modi and his clique in power. (Africa as alternative does not work well because too many individual countries have issues; India is at the least for the most part stable, if we exclude some terrorists such as the Mumbai idiots in 2008 destabilizing India.)", "label": 0}
{"text": "Aight. Indian here who's emigrated to a \"developed\" country. And I've lived in Mumbai for a good 10+ years.\n\nI agree with all of your points 100%. Every time I visit Mumbai I'm just astounded with the dust and the constructions. I am ashamed of paan stains and the spitting. I'm ashamed of women safety, hell, I'm a woman and if I'm travelling by myself I'll still return early unless I have my own vehicle. \n\nBut auto rickshaws are something I will fight you for. It makes commute accessible for literally EVERYONE. From my household help to well, me. And living in my current country which is largely car dependent for even the smallest things, it makes a ton of sense. To your traffic point, there can be other ways to counter that (for eg, introduce buses? Widen roads? Switch to CNG as fuel? Improve design of the rickshaw?) but I wouldn't do away with that vehicle ever.", "label": 0}
{"text": "The fact that people in the middle class think they have somehow got it worse than the lower class.", "label": 0}
{"text": "This is a worker so skilled they had to bring him in from Australia at a much higher pay because they couldn’t find anybody local with even his level of skill.\n\nHE IS NOT A RACIST OR ANYTHING LIKE THAT as he explained in all caps.\n\nCartoon Network hai aur kuchh nahin.", "label": 0}
{"text": "Nobody said these jobs will be for germans anyway. ;)\n\nRealistically Germany has no alternative. It is already in a huge depression. It needs to dig itself out as quickly as possible, as otherwise it'll be taken over by ultra-right. See the 1930s era how quickly that can happen.", "label": 0}
{"text": "You clearly haven’t met Brits on holiday in Ibiza or pretty much anywhere in the continent. Btw its worse on US- India flights especially when you have to travel the Dubai - India segment. Its slightly better if you are traveling Dubai - Blr or Hyd leg 😄", "label": 0}
{"text": "It is much easier to critique your post than face reality. I must say though, you are spot on in your assessment.", "label": 0}
{"text": "Yes, only if your OPT is approved. Followed by your H1B approval, followed by H1B extension, which needs to be absolutely followed by your I-140 approval. Getting in to US is already difficult in first.", "label": 0}
{"text": "you forgot to mention the standing up as soon as the plane lands and not waiting for the seat belts off sign...", "label": 0}
{"text": "It has changed collectively. Access to modern practices and resources facilitate that.", "label": 0}
{"text": "My wife works with Indian students in Australia , she always brings deodorant and makes the smelly ones use it . A lot of repeat offenders . \nIs it cultural or something ?", "label": 0}
{"text": "Hahahaha. I felt the same and this guy looks like from another city trying to put down the city.", "label": 0}
{"text": "That might've been the worst half an hour and it doesn't mean it ended there as you still carry the trauma of that incident so you might feel low for a long time till your mind keeps this memory aside and bring some new memories and planning as priority. The stress during and after that incident is enough to make someone not just mentally but physically ill as well so try to meditate or exercise to reverse effects of that stress. I'm glad you're safe and yes I completely agree that this is not the world for girls and that's why I don't want a child thinking what if it's a girl and faces such situation in her life due to which she has to be traumatized all her life. It's better to be childless than to bring a child in this world. It's just my opinion and no judgement on whoever wants to have a child.", "label": 0}
{"text": "See I find this a very frustrating argument. Dickhead behavior from anyone is not an excuse for racism. You can call out dickhead behavior by calling out they are dickhead but it doesn’t in anyway justify racism against a community. So if people are being racist, they simply are. Let’s not justify it in anyway", "label": 0}
{"text": "The level of ego and selfishness Indians have in general is idiotic. It's even common on streets. People would use vehicle horns as if they are declaring they have the sole right to the road and you have sinned by interfering with their velocity. \n\nAn old lady is slowly trying to come out of her driveway? Nope! I go first! I DO NOT have 30 seconds to waste today  \nYou did not start moving your vehicle withing 3 nanoseconds of signal turning green? Well, my horn will remind you how horrible of a person you are. \n\nPS: I might have gone off topic, but wanted to rant as well. Indians do not have any sense on how to behave in public. I completely agree with all your points.\n\nTLDR: Indians BEEP BEEP a lot. I hate it.", "label": 0}
{"text": "Have been taking business class for 10 years. You have the same there", "label": 0}
{"text": "I'd be shocked if it was any different, I saw video of hundreds of people shitting on the beach, when it is too crowded, they go for the mangroves.", "label": 0}
{"text": "Lemme make it clear I’ve never traveled to any other city except Mumbai and most of the problems I’ve encountered in the few months I’ve stayed here all are applicable to Mumbai I’ve traveled around this city a lot and it doesn’t take being born here and experiencing everything to tell the sheer state this country is in", "label": 0}
{"text": "Some roasts are very relevant like tracking your delivery but some seems a bit - outdated like getting your phone repaired or WiFi speeds. Seems like something that used to happen say 10-15 years back", "label": 0}
{"text": "And deal with traffic?", "label": 0}
{"text": "And that's how we know the size of the IT Cell", "label": 0}
{"text": "India is a growing country with too much population and corrupt governments. Common people here are just trying to survive the best way they can (People are also shit sometimes as we see in the news but that's just a small portion of society). We all know about all the issues you have mentioned, and you'll find many indians (mostly non residents) also complaining about these. As you're not paying any taxes here so try to enjoy it as much as you can, everything is free for you anyway. There will be day to day inconveniences but india is much more than that. \nAbout women's safety, let's all hope the government brings strict laws (with keeping the fake rape cases in mind too) and make reforms for providing better (sex) education.", "label": 0}
{"text": "I meant OTP + STEM OPT is a total of 3 years\n\nNo lottery and technically no sponsorship for all that.\n\nI just meant if Canada gives only 1 year, then 3 years is superior.", "label": 0}
{"text": "you’re a fake. You don’t even write as if english is your first language. Easily detectable", "label": 0}
{"text": "Yes, you do know that you have to file for OPT and OPT extension? You can be denied that. It happened to my friend. You are being too optimistic if you think everybody gets approved.", "label": 0}
{"text": "Just reporting to Uber is not enough\n\nYou should also report it at police station.", "label": 0}
{"text": "I’ll try my best to raise awareness and take action the limited time I have in this city and this country cause I really wanna help man", "label": 0}
{"text": "I live in Australia and I have seen Indians behave the same way. The one incident which is etched into my memory is where a fellow Indian Classmate littered in a public place Infront of other people. I walked next to the tissue paper he threw on the grass and picked it up making sure he saw me and deposited it in the bin which was a located 10 meters from where he was standing. He apologised instantly , but that is not the point.", "label": 0}
{"text": "\nThe n would make it negative, something like opposite of vidya", "label": 0}
{"text": "They might if they got to talking but just like India’s far right which will hate Muslims by their clothes, the white far right will hate the “pakls” And by saying you’re not, you won’t convince them", "label": 0}
{"text": "As opposed to making the smart ones suffer here or get killed by rickshaw wallahs", "label": 0}
{"text": "underrated comment", "label": 0}
{"text": "I agree", "label": 0}
{"text": "my stay here ends in feb next year so I’m gonna go back obviously hope that gives you a tremendous deal of satisfaction that someone who genuinely raises concerns is shushed away", "label": 0}
{"text": "RIP Australian Education System", "label": 0}
{"text": "With my personal experiences , I had my fair share of these problems.I also have decided that when I travel to India I will buy a business class ticket.Thats the only way I can be separated from them.", "label": 0}
{"text": "I agree with most things you've said.\n\nBut it doesn't really take Sherlock Holmes to guess that you're Indian (or at least spent a few formative years in India) because you use quite a few Indianisms in your language. It has nothing to do with the cultural stuff you bring up.\n\nEdit: What do you know?! A comment a year back on another Indian sub comparing yourself to Shubman Gill. Maybe I am Holmes after all.", "label": 0}
{"text": "It’s obvious mate look at some of the replies instead of shaming the people that are actually ruining the country they’re blaming me for I dunno what grammatical errors I’ve made (none) absolute buffoonery people wanna do everything except acknowledge these issues and atleast at the forefront do something about it", "label": 0}
{"text": "Half of Germany was socialist till 90. They inherited many of those policies. I will give you the specific examples below, but some gyaan before that - every country has its problems. There are a lot of aspects we do not think or know of before coming to these countries. I’m not saying don’t come, but you have to understand that there would be many things which would make you think India’s far better in these aspects. Ultimately, it’s what you prefer; for me, having breathable air for my child was more important than everything else combined (coming from a family full of breathing issues).\n\nExamples:\n1. Your visa expired, and while you’re allowed to continue staying because you have applied for a residence permit, you don’t know when you will get an appointment (no you can’t book). So, you cannot travel outside Germany.  You can get fiction visa (temp) but they don’t communicate before sending it over so you don’t know if it’s coming. My sister has not been able to travel to India for 2 years because her temp visa expires exactly during my niece’s school holidays every time. And she usually receives the temp visa a few weeks after the expiration of the last one. \n2. A friend of mine had his wife’s visa application stuck for 8 months between 2 departments because he has same date of birth and full name as another person. We don’t have an aadhaar like unique ID here (technically there is but…) so a combination of name and dob is how they identify you.\n3. I had a duplicate pension number created because of the same dob problem. My new exploder mentioned wrong dob and they did not look at the unique tax ID to identify of the person exists or not. \n4. Talking about gender equality, when filling taxes as a family they expect man to be the first person entry followed by the wife. When my wife was freelancing this caused many issues because every time she made a payment it would reflect in my tax id and we would both receive letters - mine to explain the payment source and her to explain the missing payment. Eventually we went the German way and paid a tax consultant hundreds of euros to take care of this. \n5. Every govt office you go to will be a different experience for you, and your experience will likely be different from others around you because it depends on the person interacting with you. They can take decisions for you- to give you a residence permit or not, not consider your German knowledge to be basic or not, to give you a temp visa or not. As most government workflows are not automated, you are at the mercy of the front line govt employees.\n\nIndia has improved significantly with egov starting 2000s and here it has started now.", "label": 0}
{"text": "Agree with you. I think appreciation of other people in public places is distinctly lacking in the general population. This does not mean everyone is doing it, but it's enough people so that this becomes a trend. \n\nAnother problem is that our education system prioritizes high marks and rat race, they never teach the real life lessons.  What it means to be a human,  how to be a good contributor to society. \n\nSocial media has poured gasoline on this fire. Now everyone is a honcho. Everybody is a star or will die pretending to be one.", "label": 0}
{"text": "OP, this personally affects me as an Indian! \n1. I agree that we lack civic sense. We are a developing country and we look like 19th century England for sure. Our kids are being educated and we should look like UK now in a few decades \n2. We may look dirty externally but are much more beautiful internally. We are much warmer than typical Australian. We are definitely lot more friendlier than Australians. \n3. People look at white people because it’s as uncommon as seeing a chimpanzee in a zoo. \n\nMy fellow Indians, as an American of Indian origin, we have a come a long way and going in the right direction. Though we may lack today, we are going ahead in the right direction.", "label": 0}
{"text": "No clue what tf you’re saying 💀", "label": 0}
{"text": "If its Axe Spray no, if its Axe deoderant Sure. The one that comes in a stick and you rub on your armpits.", "label": 0}
{"text": "Omanis are an amazing lot... been there, was received with so much love and hospitality...", "label": 0}
{"text": "Aapke bhai bandhu to 200 saal tak reh kar gaye bina ac and cabs wagerah ke. Koi khaas shikayat nahi aayi tab! Aap hee improve kar dete ye sab na sirji ! 200 saal kam thode time hai! Kyunji !", "label": 0}
{"text": "No clue what you’re saying hopefully it’s something good", "label": 0}
{"text": "Fair enough 👍", "label": 0}
{"text": "This is why I travel mostly First class on my trips to India. Hell no - traveling to India in Economy, even Business class is a mix of punch bags. \n\nhttps://preview.redd.it/xixwuepd6zwd1.jpeg?width=700&format=pjpg&auto=webp&s=01ef5d3ebbd993761e6636c4c7c441d2713e2f5a", "label": 0}
{"text": "I am pretty sure,the  same goes for Canadian WP.\n\nIt's not like everyone gets approved, there would definitely be denials there too.", "label": 0}
{"text": "[Sure](https://i.postimg.cc/tCS47JTM/Screenshot-2024-10-26-02-51-36-41-b72a20be883aec8a014bd2b7c7038e87-2.jpg)", "label": 0}
{"text": "Haven't you heard? Only people from developing countries are immigrants, those from developed countries are expats /s \n\nI've also heard a different version of that - only people of colour are immigrants, white people are expats (don't think it's sarcarm here, but sure, why not /s)", "label": 0}
{"text": "Yes it is very good. Your feedback is taken, thanks for that. We'll figure out how to work like the 1st world with a 3rd world post colonial budget !\n\nAnything else my sire desires ?", "label": 0}
{"text": "Staying outside of home is truly a test of my patience.\n\nIn one of my flights, a man was literally screaming at somebody. A passionate business man. No one blinked at eyelash at him. It's acceptable.\n\nWatching videos in blast in a flight. That's acceptable too.\n\nI've lived in India all my life and I can't get around this behavior.", "label": 0}
{"text": "I am a U.S. citizen, born in Delhi, who has lived in the U.S. since 2006. I live on the East Coast, often spending time in cities like Boston and New York, which have vibrant Indian communities. Here, I’ve observed a variety of experiences and attitudes within the diaspora.\n\n\nAmong the Indian population in the U.S., many people have successfully integrated, balancing Indian heritage with American values. They retain Indian culture while fully embracing American norms, blending the best of both worlds. This group is generally well-educated, with strong civic sense and behavior that aligns with mainstream American society.\n\n\nHowever, around 20% of the diaspora seems to struggle with adapting certain social norms. This can often manifest as an inclination to prioritize self-interest, a habit developed through India’s competitive environment, where it's every man for himself. Courtesy and consideration for others aren’t always emphasized in such an environment, and the lack of feedback reinforces these habits.\n\n\nFor some, even after 30 years in the U.S., these habits remain. They hold onto attitudes from their life in India, often in ways that seem out of place here. This sometimes translates to a lack of civic awareness or empathy for others, contributing to an image that doesn’t represent the positive qualities many associate with the Indian-American community.\n\n\n\n\nI only visit India every five or six years, and I observe the same behaviors. I don’t expect my generation to change, and I hope younger generations develop greater civic sense and empathy, which could positively impact India’s image over time.\n\n\nPerceptions of Indians vary by country. In the U.S., Indians are generally well-regarded. However, in Canada, the reputation has declined as more people, often less familiar with integration, have migrated. I often tell people here in the U.S. that the Indians they meet aren’t necessarily representative of the average.\n\n\nThis reflection is more of a rant.  Take it for what it’s worth.", "label": 0}
{"text": "And these aunties are the first to whine when you wear short clothes or dark lipstick because \"it's not appropriate\"", "label": 0}
{"text": "People who treat others as less than human beings are trash no matter which country they are in.", "label": 0}
{"text": "A lot of it is totally outdated. Phones are not an issue anymore, cellphones are the norm. There are only some sectors where train delays are endemic. Online delivery is not a nightmare. Even Indiapost has upped its game.\n\nFinally what's with the constant seeking of validation from AI ? I keep seeing these posts constantly. Have humans outsourced thinking ?", "label": 0}
{"text": "Learned my lesson man. I got a refund for delay for the flight, now i know where to spend them lol", "label": 0}
{"text": "Can't change behaviour of people in public places , sadly", "label": 0}
{"text": "Hatt bc bhaad me jaye tera raise concerns pehle hamare desh vasiyo ko chain sukoon se jeene de tumhare kangaroo wasi fir bak bak karna yaha aake.. acha hua tere sath aur culture shock milna chahiye.. aur struggle kar.. hume bhi aisa lagta hai tere faltu desh me ja ke.. bada aya lecture bazi karne.. STOP HATE CRIMES IN AUSTRALIA", "label": 0}
{"text": "Oh, yes, this one is my favourite, the high demand is completely because of the huge show-off culture, I bet that most ticket-buyers couldn't pinpoint what song it is when they hear it, it's just following the heard. Coldplay is the new iPhone", "label": 0}
{"text": "Sorry for this but there is one thing I want to tell all the ladies.\n\nYou can also use blusmart. They have one SOS button inside the car, you can press that if you feel unsafe and in case of any emergency, this info will go to blusmart and the nearest police station. \n\nOnce I was going to the airport in a blusmart cab, and the female driver told me all this. Blusmart seems safe to me, and currently it's the safest for cabs.", "label": 0}
{"text": "We didn't need a kangaroo eater to lecture us for this. All of us already know this. Let's raise awareness for hate crimes against Indians in Australia. Subtle to extreme racism which takes a toll on mental health and in some cases violence leading to injury and death. Look at your own backyard, fix that first. If an Indian had pointed out obviously horrible things about their country in their subreddit, it would've been full of racist remarks and downright abuse. But here we want to bootlick this idiot. Stop FFS.", "label": 0}
{"text": "Extremely concerning hate crimes and daily racism in Aus needs your urgent attention mate. Please do raise awareness and fix it at earliest convenience.", "label": 0}
{"text": "TF?", "label": 0}
{"text": "No kangaroo eater talks like that \"bruh\"", "label": 0}
{"text": "Exactly what I was implying lol", "label": 0}
{"text": "You should have asked whether he wanted to use to Loo or something, if he *had* to, he'd have said yes or have been too pussy to admit it, if not then that didn't account for the urgency that he thought it did.", "label": 0}
{"text": "You are ignoring caste dynamics here, nasbandi would have mostly suceeded in lower castes because they lacked political power, but the thakurs and other upper castes would have blocked or likely blocked it in their own castes.", "label": 0}
{"text": "Sweet! Glad you are going back. We would be better off without your \"expert opinion\" and here is why I say what I say. Your concerns are not coming from a 'genuine' place. They are racism with a facade of white supremacy. Here's why:  \nTop 10 polluting countries per capita: 6) Australia India, not in the list  \nTop 10 countries with the most rapes per capita: Both India and Australia do no feature in the list. However, India: 4.8 cases per 100000; Australia: 109 cases per 100000  \n(Do not remember any more of the points your shitty post raised but I am sure even there if you look at per capita stats, your country will be way ahead of ours, in all things bad)\n\nMy disgust for your post comes from the simple idea that your post asked Indians to change, while Australians, as an individual are way worse in everything that you mentioned. It's just, our net population is so high that the overall numbers are very spiked up. \n\nWhat I am saying is (and you are in Finance, so you will understand) that if you are in a room with 5 Indians and 5 Australians, an Australian is more likely to rape you. Similarly, if you create a country with 5 indians and 5 Australians, the pollution produced by the 5 Australians will be significantly higher than the pollution created by the 5 Indians.  \n\nWith that being said, I will also add the other point, that you are more likely to be raped in India and your health will be more damaged by pollution in India as opposed to Australia just because we have so many people here. \n\nNow why do we have so many people here? Maybe it's got something to do with the Crown that your country still recognizes and panders to.", "label": 0}
{"text": "how about two child? a lot better than 7-8children don't you think", "label": 0}
{"text": "And N(viddi)a means \"stupid\" or \"fool\" in Malayalam.", "label": 0}
{"text": "\nPatience is indeed a virtue, I know our airplane etiquette is bad, mostly, it stems from our culture, our upbringing. etc.\n\nI have been living abroad ( Canada ) for about 5 years, we Indians don't leave a chance to ruin our image abroad.\n\nI don't know if it's education or inexperience, but we don't really assimilate into western cultures easily.\n\nThe truth is, most of us don't want to, it's good to not forget your roots but if you have decided to leave your country to another country for any reason, you have to respect the traditions and culture of that country and try to study it before going.\n\nI have seen international students who behave like it's India and they own the country, they don't respect the rules, no matter where from India they come from, could be from a village or a town or even a big city.\n\nRegarding freebies, it's shameful and puts us in a very bad light. Recently, there was an incident where some YouTuber showed a way to get groceries for free using a food bank, a food bank is for people who cannot afford food or are usually homeless and very poor, and guess what, our international students made sure that food bank was left with no food for those who need it most.\n\nI have seen people in Canada scamming insurance companies with making false claims of stealing and lost electronics and after getting a replacement, sending the old device to India.\n\nEven in case of false claims for cars, like we have a very jugaadi mindset, its good to use it for good but not to harm our image, we are always finding loopholes in the system and abusing it.\n\nIt's really sad to see that with your own eyes, a fellow countryman doing things which makes you think, when will we learn?\n\nSorry this veered into a direction not specific with the post but it's too relevant that should be shared.", "label": 0}
{"text": "Because he has already his own constellation which he built by himself.\n\nMukesh Ambani wants govt to create a law which will force anyone with constellation to sell his satellite capacity to other companies if they want to do business in India.\n\nThis way Ambani will get satellite internet without spending money on satellites", "label": 0}
{"text": "“I know better English than you can imagine” yeah  you certainly don’t write like a native english speaker. Hard to believe you grew up in Australia. \n\nAlso the stuff you mentioned are very generic and lacks any nuance to convince me that this isn’t a made up post.", "label": 0}
{"text": "India's billionaires are just middlemen sitting under the bridge and ripping people off with government support. They don't innovate or create new things. At best they copy and replicate.", "label": 0}
{"text": "Being nosey. This issue is for all races I think. I know black and white people get embarrassed by their races all the time. I liked someone’s comment about civic sense. That sums it up. \nThe only reason we get embarrassed when our race does it is because the impression that it can have on someone’s future assumptions about us. They’re promoting stereotypes. But, it comes from somewhere. So again. Civic sense.", "label": 0}
{"text": "as an Indian,\n\nI would wish you write more.\n\nThank you for taking out your precious time, means a lot❤️", "label": 0}
{"text": "Not an Indian myself, but I’ve spent a few months in your beautiful country, and know many ex-pat Indians in Australia. Let me offer an outside perspective.\n\nSomething that struck me when I first went to India was obviously the population density, but then I noticed the social cohesion and harmony despite the fact there’s so many people. Sure, there’s some annoying traits (spitting, uncles yelling, rubbish), but I don’t believe those traits are any more frequent per capita/person, just that when there’s so many people, of course that means the number of ding-dongs (for lack of a better term) is higher.\n\nIn many parts of the world, you simply couldn’t sustain such a population without experiencing similar (or worse) problems. Look at all dense populations around the world, and they’re famous for rude people (NYC, London, Rome- China is a notable exception, but maybe not lol). \n\nWhile lack of civic sense is infuriating, especially when you feel it reflects on yourself on behalf of others, to me it’s a natural negative result of a wonderful trait: tolerance.\n\nPoor civic sense behaviours seem to me to be a direct result of interpersonal tolerance, patience and forgiveness, and a fundamental good will to keep the peace for the sake of cohesion. Unfortunately, it can get out of hand, and people start depending on that tolerance to get away with shitty behaviour, but it strikes me as ignorance instead of malice. \n\nIn my country, we have a special word that means “hey, that thing you’re doing is contrary to commonly held understandings of the right thing”. We say “OI!” 🤙 works a treat. Gives some people a fright though. Most of the time people are almost sleep walking, they just need a little wake up.\n\nI’m just an outsider, so take my word for what it is, but rest assured not all foreigners see Indians how you did recently, bhai. All good traits can have an unforeseen negative consequence. If you could choose to make everyone in India perfect civilly responsible citizens, but take away the beauty of a (relatively) harmonious and tolerant dense population, would you do it?\n\nIn my country, we also have people with bad civic sense. We call them “grubs” or sometimes “bogans” if that applies. When people behave that way in public, there’s a moderate chance they’ll be called out. Drop rubbish? You’re likely to hear a “OI!” from somewhere and be met with a grumpy face and finger pointed at your rubbish. BUT, here’s the other side:\n\nBy contrast, if Mammaji gets lost at the airport and starts quietly stressing by herself, no one in my country will help her. Sure, they might eventually, but there’s a good chance she will be spoken down to by a rushed staff member, and even if there’s hundred of people walking past, it’s very unlikely someone will stop to help. \n\nEach time I go to India I’m struck by how many people randomly help strangers. From simple directions, to notifying of hazards, to wiping the snot off a kid’s face. And then there’s constant efforts to build mutual trust. Where I’m from, if you want to buy a small bottle of water but you’re short a few cents, the shop owner will NEVER give it to you until you’re fully paid up, even if you’ve known them for years. It still blows my mind that people in India take those small financial risks with each other all the time.\n\nAnyway, please forgive my intrusion. I am but an outsider from a foreign (arguably racist) country, who sees these problems you’re seeing and thinks “if I had to trade the good sides for the downsides, give me the litter every time” 😊", "label": 0}
{"text": "Which hate crimes?", "label": 0}
{"text": "I feel so helpless and sad after hearing this 😖", "label": 0}
{"text": "I had lived abroad (Singapore) for more than 3 years and in all those years I never saw the locals breaking the (unwritten) laws of basic proper social conduct/etiquette that is to be observed in public settings. \n\nI would take the public transport (bus or metro) on a regular basis and the general behaviour of the locals is to maintain 'a level of silence' so as to not disturb others. People do talk in buses and trains but it would never be loud or disrupting and even the TV that you find installed on local buses are muted (extremely low volume). You won't be able to hear the TV news anchor's voice unless you sit close to the TV (it is that low in volume).\n\nThe first time I heard loud noise on a bus - surprise surprise - was when I saw a group of Indians seated close to each other. They looked like they were all in their 20s - possibly college students - all of them looked like they were from an educated background. \n\nThey were a group of 5 or 6 individuals (mixed genders) and all were seated across each other (on opposite seats in the bus) and they were talking and laughing so loudly that you could hear everything at the ground floor of the double-decker bus. Yes, it was THAT loud.\n\nAlso the first time I saw people not using the proper zebra crossing or littering was when I was in a location called \"Little India\" in Singapore. That was the first time I saw litter on the grass (people had thrown few plastic cups on the grass). I also saw some people there crossing without using the zebra crossing (I had never seen that in any other part of Singapore).\n\nI sometimes hesitate to reveal my nationality when I am in an international setting because foreigners generally have a poor opinion of Indians based on certain stereotypes and experiences and unfortunately some of those stereotypes are reinforced by idiots in our country. The problem in our country is we have never really given importance to education - our current idea of education is just rote-learning - which is memorising useless trivia just to pass exams. We don't really teach people how to be adults, how to live a good life, how to treat people or what is virtue. Parents for their part don't impart spiritual or moral education at home either because most of them are busy making money.", "label": 0}
{"text": "bhai Is there a cure to this, or should I move abroad too,\nevery day I see such people here😞", "label": 0}
{"text": "Nah wifi speeds are pretty great and reliable from what I’ve experienced during my time in India. Online deliveries have also been pretty accurate 99% of the time.", "label": 0}
{"text": "Oh god! Please don't.", "label": 0}
{"text": "when they glare at me ...I glare them back with silent FU.", "label": 0}
{"text": "Na! Antinational is the word.", "label": 0}
{"text": "Buy a pepper spray \nBuy an apple tag (for tracking)\nTurn on Your location \nLearn a bit of self defense\n that's all you gotta do teach this to other girls aswell", "label": 0}
{"text": "Looks like everyone is the good guy here. May be only the good guys are in reddit. 😀", "label": 0}
{"text": "First of all, there is no awareness among us that Indian food smells are strong and stick, across the Indian population and also no awareness that this is socially unacceptable outside of homeland. Also, we have a habit of cooking only after showering and dressing up, since we consider food as very sacred and stuff. that oil with strong smell and flavor of all the spices(including ground masalas and ginger garlic, hing) stay on skin and clothes. and we go out with those clothes which we cooked in. Even the garlic that we use heavily in cooking, it makes sweat so stinky. That smell can be felt at least for 2-3 mins after we walked past a place. since we are desensitized to that smell after cooking, we do not even realize we smell, and even if we do, we have no awareness that it is socially unacceptable. also all our walls(wooden walls) get seeped in with Indian curry smell that UK landlords refused renting out to indians because no one could stay in those apartments or houses after indians no matter how much painting or odor control they do. That is how powerful the smell is. If someone is making biryani, you could smell it many houses down the street in homeland too with 100 other dishes smell during lunch time while walking. Imagine how powerful the smell can be in closed environments in other countries where everything is closed and have no fresh air coming in from anywhere(only hvac circulation because of temperatures in other countries - either too cold or too hot). Whereas in India, we keep doors and windows of homes open almost all day long so there is always free circulation.  \n  \nAlso, we have all bedroom doors in the home open all the times(not the doors which lead to outside, only the room doors and stuff). That smell spreads everywhere and settles even on fresh clothes, towels, undergarments and bedsheets and everywhere possible. Anytime i visit any Indian friend's place, i do smell a strong curry smell, like it is called, which is just the smell from all the minute oil droplets from all the spices sticking everywhere in the home.\n\nFew of the things that can help(not exhaustive but every small thing helps, since you asked)-   \n\\- Shower only after cooking and just before leaving.  \n\\- Wear only fresh clothes just before going out and not used ones already(jeans and stuff are fine but nothing that even remotely touches sweat(a lot of places that produce sweat in upper body).  \n\\- Keep Closets or wardrobes or almaras closed all the time.  \n\\- I close all the bedroom doors in home when cooking.  \n\\- Have exhausts running specifically when cooking wherever they are(no matter if they are in bathroom too i keep them on)  \n\\- Laundry washing, drying, folding only when the house is not cooked in for a while. or absolutely no smell.  \n\\- Have an odor absorber in closet  \n\\- Use antiperspirant as soon you shower and before even getting a drop of sweat and not after getting sweat as then, it is of no help at all.  \n\\- Use a complimenting perfume/cologne.  \n\\- Brush before going out in general but specifically just before leaving flights/trains wherever you think you will be in close quarters with someone.\n\nI also had experience where an indian uber guy picked me up and I sat behind the driver's seat almost in the middle of the back seat. the air from the AC was coming from the front to the back grazing through his arm/body and everytime his hand moved i could smell the strong scent/stench from his armpits or i dont know where and couldnt breathe at all. it wasnt even summer then.\n\nI am sharing the info that i have gathered over the years with hope that it might help someone. I have gotten a few complements from uber drivers, other passengers in flights and coworkers too(some backhanded and racial though like - \"ohh you smell nice, not like others\\[indians\\]\"). A cab driver directly told me i smelled nice and he had a ton of people who smelled very bad and are mostly indian so much so that that he had to open the window as soon as he knew he was picking up an indian passenger(he was not indian).", "label": 0}
{"text": "This is weird on so many levels. As per this \n\n1. Information was collected on various individuals by Indian consular staff\n\n2. Information was sent to India\n\n3. India passed this information to some organized crime  gang. \n\n4. The gang did various things. \n\n5. We have evidence of this. \n\nProving point no 1 is easy but means nothing. The consular staff have to keep tabs on persons of interest. \n\nUnless you're spying on diplomatic communication and/or you have a mole inside India and/or the communication channels are compromised how do you prove point no 2 ? Any recorded conversation without a warrant is inadmissible. Any mole will have to give evidence.\n\nAgain impossible to prove without a mole and/or compromised communication. Same issue of proof.\n\nProving it is easy but means nothing.\n\nNow , I'm not saying Indian government did it or didn't do it. Possibly they did but proving it beyond reasonable doubt is impossible. They only way to get a conviction is if there is no defence of the allegations in a court .\n\nLet's also not forget that this also proves that there is a  sophisticated spying ring of the 5 eyes active in India which is actively doing point 1&2 in India .", "label": 0}
{"text": "US paying $700-$900K? Is that what you just wrote?", "label": 0}
{"text": "Refusal to Tallington to rti request is admission of lack of evidence. If they have the evidence, let them share it. Stop making excuses for the lying sacks of shit. ", "label": 0}
{"text": "You need to print the pdf to show the immigration people, all 3 times this year I went they ask for the printed copy", "label": 0}
{"text": "Yes, a senior engineer at OpenAI, Google, Meta and even Microsoft easily makes well over 500k $", "label": 0}
{"text": "Exactly. ", "label": 0}
{"text": "This bawling is because of our helplessness in this situation. We don’t have any option but to pay 30% and still see all bs around us.", "label": 0}
{"text": "ace_blue_422\n\n\n\n\n>So your solution is to, give the land to the other party, piss off the majority ultimately leading to a greater hatred for the minority community, protests, violence, and hatred being spread and this issue burning for generations, riots, intolerance and worse case scenario partition again? All because in your idealistic world everything is either black or white. This is not about God, it never was. That's what you don't get, \"friend\". Please step out into the world. It is not good. And never will be.\n\n\nAnd finally, your admit that this was anact of majority appeasement and not a judicial verdict based on applying the constitutional jurisprudence to the facts of the case. \n\n\nCongratulations. ", "label": 0}
{"text": "Sorry Mr Shetty, you turn blind eye towards their parties and then compare us with them. CA finalist ho kar aisi illogical baatein?", "label": 0}
{"text": "Aw Yissss I'm in NJ USA but I'm so happy there's a bunch of desi nerds doing D&D!!!!", "label": 0}
{"text": "I’ve come across SO MANY Indians living abroad who stink. I cannot believe why they cannot air out their apartments/houses after the cook. They come to workplaces with stinky cloths on. For goodness sake, air out your place after you cook and take shower before you come to work.", "label": 0}
{"text": "I had a really smart friend of mine advise me on a similar situation back in university. Wherever you are in this world, if you cannot change the system, get out of the system by whatever means.", "label": 0}
{"text": "Seriously dude. I’ve travelled in air india international flights and it’s always chaotic. \n\nPeople have no sense of space or respect. \n\nIt boils my blood that white/foreigners are so racist towards our people. But in cases like this, it feels like a justified response. \n\nNot just flight, in day to day stuff as well. They will not mind their business and immediately just keep prying and trying to find a normal connection. Like wtf. \n\nWhat is hate the most that indians do is not having the common and civic sense to use inside voice and not yelling across the room. Or even in subways snd indoor spaces not using inside voice. \n\nIt makes me immediately not want to be associated with them. Now idk if thats internalized racism or what, but i hated this behaviour even back home. It just is very obvious abroad.", "label": 0}
{"text": "Ambani just partnered with Nvidia to open an AI data centre in India. Will launch their own generative AI app. My bet is at this rate, ChatGPT will be banned in India in the next 6 months. Not a stretch, they will just place insane conditions on ChatGPT like sharing user data and force it to exit. Just like they did with VPN companies.", "label": 0}
{"text": "Disagree. It’s not about education. I’ve seen many an educated fools with their ignorant and hideous civic sense.", "label": 0}
{"text": "Man tuition fee is part of 80C deduction which already covers various other saving instruments like LIC, PPF etc. 80C has a limit of 1.5 lacs, in my case it gets easily covered by these saving schemes. Thus no further benefit of tuition fee paid in my case. \n\nPlus if you opt for taxation under new regime, no 80C benefit is available.", "label": 0}
{"text": "Staring at women passing by. \n\nI live in an area which used to be diverse and this wasnt ever an issue. I dont miss this moving abroad at all. Suddenly it’s populated with indians and yes dudes. They being their creepy staring behaviour here as well. Yuck.", "label": 0}
{"text": "Please elaborate", "label": 0}
{"text": "Yes, basic common sense left the chat the moment somebody indirectly suggested that since a couple of minor and common conditions (pimples and dandruff) are contagious, airline staff shouldn’t be bothered with any possibly contagious conditions even if they fear that they might be far more serious than pimples and dandruff!", "label": 0}
{"text": "Haha tax payer is viewed as a cheater but one who is completely evading it, remains under the radar.", "label": 0}
{"text": "Prostitution IS legal. ", "label": 0}
{"text": "How do these uneducated and low skilled people come in dude. Like the educational and experience required for study/work visa is quite high. Even assuming they fake it, for the ones who are genuine, how tf do they get in?? \n\nI’ve seen a few and it always stumps me.", "label": 0}
{"text": "True, I work in Finance and taxation field and I hear from lot of people in my network about the kind of non sense tax notices issued by GST departments and IT dept.", "label": 0}
{"text": "The writer is literally called Dyer. Hope he wasn't a General or something before entering Generalism, sorry, Journalism. The irony. \n\nWell, make us a member of the Five Eyes and then all eyes can keep a close eye on one another.", "label": 0}
{"text": "I live in Netherlands and bike regularly. I come across strangers smiling when eyes meet or a cordial nod but Indians stare dead in the eye. Even with my boyfriend in public, we get a bit of stares sometimes from fellow Indian married couples. Feels funny\n\nOne time was picking wine in a supermarket and the stare I got literally got me passing through them with a sense of guilt 😂", "label": 0}
{"text": "Not sure about what kind of government schools are there in your community, in my area where I live, the government schools are in pathetic condition. I can never thing of sending my kid to such school.", "label": 0}
{"text": "Those \"extremely talented AI\" ones make 1-1.5M $. I am talking about a senior FAANG engineering with good experience.", "label": 0}
{"text": "They are much more cleaner, exactly so there must be some things that allow people to be that way is it education, strong societal links is it relative income? U tell me or is it just luck, then we are all fucked, aren't we?. Nobody is inherently bad or evil.\nTake any German town for example, if their garbage collectors dont come for a day, almost of their public spaces become shit, filth everywhere, then would you argue that it was clean on most every other day because of the people having 'civic' sense or was it the city that planned around people behaviour.\n\n>This is not just an income problem\n\nExactly, it's not just any one thing problem, but income and purchasing power, and thus the amount available to the state  for social welfare, etc all become key factors.\n\n\n\nIt is very easy to say, but north east town clean, but but, French town so clean, Japanese park so clean, why aren't we the same. A rant is a rant, you got any useful insights?", "label": 0}
{"text": "😭 yes I am not Kerala or TN. I am from one the best state in India! - UP.", "label": 0}
{"text": "😖😭 true", "label": 0}
{"text": "And the sad part is that quite a few of them will get GC in 7-8 years through the asylum process. While high skilled Indians on H1B will have to wait in line for decades for their green card.", "label": 0}
{"text": ">Call out others\n\nSo you advocate for moral policing instead of a systematic change?\n\n>industry and economics.\n\nI am not going to explain to you how jobs, economies, spending power, domestic produce all these socio economical things affect how we think and act. \n\n>Not sure\n\nSounds like a gap in your education. But everyone learns at their own pace", "label": 0}
{"text": "Used to be a thing back in the 90s. Haven't seen them in a while.", "label": 0}
{"text": ">It’s not about education. \n\nI never said it was just about education, please do read properly.\n\n>Disagree\n\nSo you disagree with what I said, then do tell me what it is about. If it's not education, it's not economic growth, purchasing power and social welfare that are the first steps that a society must take to improve itself then do tell me,\n\nWhat should we do next. Can't wait to hear a logical counter. Do include examples, if you have any in mind.", "label": 0}
{"text": "I’m an NRI and I lived most of my life in the Middle East. For some reason, the Indian community is far more civilized and emotionally and socially intelligent there. The harmony between Arabs, Indians, and other nationalities there is beautiful. However now I’m in Ireland, and I can’t say the same. Indians are in fact all that you described, and I can’t tell why. It’s really sad because it strengthens anti-immigrant feelings in the locals, that rooted from socioeconomic and political issues. We are the butt of racist comments and jokes all over social media. When is it that we will realize that each of us is responsible for the image we carry of our nationality?", "label": 0}
{"text": "No. Just no. Senior engineer in Google makes 300k to 500k, in msft it's 270 k yo 400 k. Source : I am one", "label": 0}
{"text": "Are you sure that they are Indians? Btw, There are way more Pakistanis and Arabs in Norway than Indians.", "label": 0}
{"text": "Very informative , thank you!!", "label": 0}
{"text": "Government schools in Kerala are really good. Even schools in remote areas have smart classes and new techniques to teach kids. \n\nThe school near me has a full fledged football ground that is used to play actual semi professional football games. \n\nThe school near the village next to me has a program where distinguished people like IAS officers, KPS officers, athletes, etc. Come to talk to the middle school kids to inspire them to different career paths. \n\n\nHealthcare of course is very good in Kerala. That is well known. From PHCs to medical colleges, the quality of care easily outstrips what is provided in private multi speciality hospitals.", "label": 0}
{"text": "as others are saying yeah, it might be just the upi app you use,   \nif you still doubt, go on your device settings and check for which apps have access to SMS,   \nif you found something sus, let us know", "label": 0}
{"text": "Kafkaesque", "label": 0}
{"text": "Today you kinda felt like an average Canadian haha", "label": 0}
{"text": "Bro chill, You will be fine. I have travelled so many times between the U.S and India. The only problem is that the screens may not work but other that it's mostly fine.", "label": 0}
{"text": "Not really. The food is sub par, I've had better Indian/Vegetarian in even Polish airlines lol, the leg space is less, didn't have the chargers working either. Granted, it could be isolated incidents, and last I flew with Air India was a year ago so maybe things might have changed, but definitely 6/10 at best.", "label": 0}
{"text": "Instead of just googling the meaning of the song i would highly recommend you to research about SYL and its history. its genuinely very interesting.", "label": 0}
{"text": "I invite you to experience the Western Railway", "label": 0}
{"text": "The author assumed neutrality=Pro China and Pro Russia. India right now has the most pro-western government in it’s history", "label": 0}
{"text": "Lol why's answerable to questions of the people? Wire?\n\nGet out of the asshole of your favourite Supreme leader", "label": 0}
{"text": ">huge depression\n\n-0,3%\n\n¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯", "label": 0}
{"text": "Ty. Need less of us in US.", "label": 0}
{"text": "A simple google image search would have helped", "label": 0}
{"text": "Well said 😀 op actually hates India, op is rich he didn't even realise that he is living a very good life", "label": 0}
{"text": "I live in Taiwan, my first time going home, I was excited to go back, had emotions rolling and was listening to favorite song from Swadesh (Yuhi Chala chal). The TPE to HK leg was quiet and comfortable. When I border the Air India flight, I was reminded of my travels in trains (sleeper). There was a man laying across the seats, with his sandals in the aisle. When I woke him up, he just left to go somewhere. He wasn’t even in his seat. Then there was commotion as people wanted to play what appeared to be musical chairs. Meal time was a nightmare as the attendants had to play treasure hunt to figure out where the special meals passengers were. \n\nI remember someone said we have too many Mahatmas but few civilian or something like that.", "label": 0}
{"text": "Yes, I agree. I’ve also had several bad experiences with JioMart, such as missing items in orders and extremely rude delivery guys.", "label": 0}
{"text": "In the last 10 years, I cannot begin to trace the level of development but one thing that has sky rocketed is the feeling of \"entitlement\". This notion that India is emerging as a superpower has kicked nto the minds of people who inherently beleived that \"I can do anything because I have money\" or \" I can do whatever I want because I belong to a specific region, group or community\" . The level of societal illetracy has gone off the roof. Children are being taught to break the rules to make their way. Eg: Parent will break redlights or drive reckleessly to drop their kids to schhool in Delhi while the children are learning traffic rules in School. Kids will be taught to push their way in at hospitalls, stations,malls, any setting where theres a waiting queue. I dont know about other regions in Asia but the behaviour of our people in the recent years has truly represented the \"third world\" entitlement.  The chefs kiss on top of it all is we are closed to feedback, constructtive criticism is seen as oppression or offense. This is also reflected in workplaces. People cant take a feedback or criticism on their work even if they are bellends. They start venting on socialedia like thwy have been enslaved. A total resteucture and a full blown cammpaign to reach people some manners ia the only way to go about.", "label": 0}
{"text": "What was the prompt?", "label": 0}
{"text": "The issue is cultural and deeply so. Normative hindu society is essentially every man, clan, caste for himself. No body has any qualms about the strong dominating and maximizing their benefit at the cost of the weak. This seems to have ingrained itself in such a way that it has overpowered ethics and concept of fair play and common good. Now before people start attacking me, remember I am talking about hindu society and not religion. As you move out towards the extremities of India, you see these a differing sense of civic culture arising. Case in point some parts of the North East, Kerala, Ladakh etc. Where this overlaps with difference in religion, the differences become more marked. Conversely, the strongest form of these behaviours are undoubtedly seen in the North. \n\nTherefore, increase in income, spending power, so called \"education\" etc will only strengthen this problem of the ugly Indian because he has just become more \"successful\" and feels that he is \"in\" on a winning strategy and does not see any need to change it. \n\nWe can change this only if we diagnose the problem correctly.", "label": 0}
{"text": "So? How does it negate the fact that Chinese have terrible civic sense ? Their tourist are famous for it.", "label": 0}
{"text": "What’s with the deodorant requirement though?\nFor people who prefer toxin-free products, I think it’s enough to just maintain good hygiene and bathe atleast once everyday. \nI think a lot of them who caused this stereotype don’t bathe every day and just have disgusting hygiene in general. \nSadly, it reflects on everyone else from India too :(", "label": 0}
{"text": "Dude, There are many Indians foods which are not oily and have enough protein. I myself eat home made Indian food and I am healthy. Indian is not just about oil and starch as some western influencers say. Seriously, Do some research on Indian food please.", "label": 0}
{"text": "As a flight attendant, I have heard MANY co workers share this sentiment. They dread working India flights. I've even heard them called BINdians because many are always standing in the aisle and getting stuff in and out the overhead bins and leaving them open, even during taxi, takeoff and landing when everyone is supposed to be seated and buckled.", "label": 0}
{"text": "I get where you’re coming from, but you need to actually look into his interviews before making claims about what he said. He openly expressed his love for his country and didn't hate Haryana. If you're going to comment on the SYL issue, at least educate yourself on it first instead of just Googling random info. Use your brain and think critically about what you're saying!", "label": 0}
{"text": "Wish the reptile brains who went on to vote this down would have found the evidence of Pannu saying the above thing, be it in Indian media or outside India. \n\nWell, can't blame them for what they are capable of with their limited capacity.", "label": 0}
{"text": "It unfortunately has not!", "label": 0}
{"text": "\\#ad", "label": 0}
{"text": "So, when will we see the next post 😆?", "label": 0}
{"text": "Hi distorted_trout,\n\nYour submission [Unacademy aligarh zoology hod with student:](https://v.redd.it/js6keos7ywwd1) breaks [the rules](http://www.reddit.com/r/india/wiki/rules) and has been removed for the following reason(s):\n\n* Viral and Unverified Content or Screenshots from WhatsApp/Twitter/Facebook/Any Other Social Media - don’t belong here and will be removed.\n* Direct Linking to posts on Facebook, Instagram, LinkedIn, Quora is not allowed as it may lead to public harassment of those commenting on the original link (since their personal information is visible).\n* If the post you want to share links to a news article, please post the article instead.\n* WE ONLY ALLOW direct submissions from VERIFIED (with blue-tick) AND NON-PERSONAL(account should belong to an organisation, not individual) news media accounts.\n\n\n\n\n\n---\n\n*^(If you feel this was done in error, or would like further clarification, please don't hesitate to reply to this message.)*", "label": 0}
{"text": "Personally, I have travelled once from India to USA, and haven't seen any bad behavior.", "label": 0}
{"text": "Absolutely! I used their services twice in two different cities and both the times I had to return the products because they were not working with missing parts", "label": 0}
{"text": "You can find toxin-free deodorants. Yes, deodorants are a necessity in polite society. Bathing once a day is certainly not enough to avoid body odor if you’re not using deodorant.", "label": 0}
{"text": "If we Indians behaved responsibly in India and let go of our entitled behaviour, we will act the same outside the country too.", "label": 0}
{"text": "God people think they own everything. You don't see any Indian waiting for like 15 mins to get anything. They really have to start a fight everywhere they go. It's just annoying. Like even in public transport people always break the rules. But we Indians go around blaming and shaming other cultures and countries acting like we are some perfect beings.", "label": 0}
{"text": "What if they use the money towards qualifications to leave which will get them about 10x the salary? These are usually lazy people who don’t deserve much sympathy.", "label": 0}
{"text": "Throw some of the semiconductor, advanced tech we might consider lol. Jokes aside how do they expect the most populous country to be subservient 🤦🏾‍♂️", "label": 0}
{"text": "Manners are a culture-specific thing. What may seem to be good in the US may be considered obscene here.", "label": 0}
{"text": "The point was not to generalize whole populations.", "label": 0}
{"text": "I am just now on the bus. 3 guys behine me talking and eating loudly and eveyone can hear they voice. I can't sleep. India is a dogshit country with dogshit behaviors.", "label": 0}
{"text": "Sure, we can dig our heads in the sand and completely ignore the political and economic turmoil that our neighbors faced.\n\nSince when does that have any effect on foreign relations amirite?", "label": 0}
{"text": "When something bad about the US is mentioned, it is just brushed aside as yet another youtube video but when someone posts shit stuff about India on reddit, everyone is expected to accept it as THE TRUTH.", "label": 0}
{"text": ">###It is not a culture thing, it’s a still an education and an income thing\n\nYOU write properly. Those are literally your words. Such a classist and elitist mindset.  Lot of the people who I’ve seen are well off/ educated and still show absolutely no civic sense.  And there are poor and uneducated too - but those people dont come in or cant come in through legal means. \n\nSo it’s safe to conclude that education or income has no bearing on a persons character. One can be either side of the spectrum and be good or bad. But both sides definitely lack cultural etiquette which is the topic of this post. Ridiculous to say it’s not a “cultural thing” when all of the above described issues are an indian cultural thing (might not be unique just to india though) that’s normalized in india but is unacceptable in a foreign country with completely opposite culture and etiquette. If you move anywhere, you need to adapt to the system there, especially if the said change is a positive one instead of bringing toxic traits along with you.", "label": 0}
{"text": "Was flying from JFK to BOM, the lady making the announcements was repeatedly saying: “ Please sit on your designated seats”\n\nI literally was sad. We have a longggg way to go.", "label": 0}
{"text": "Again. None of the turmoil is new. But men before the current leader have been able to handle them better. What they haven't had is an army of fools paid to spin their failures on the internet.", "label": 0}
{"text": "Oversight doesn’t prevent a country’s collapse nor would India intervene even if they knew", "label": 0}
{"text": "Turmoil isn’t new but the collapse was. \n\nIf you remember correctly, last time India intervened in the turmoil, our PM was assassinated", "label": 0}
{"text": "https://preview.redd.it/f15z26f4d0xd1.png?width=1080&format=pjpg&auto=webp&s=dac9bbaf6b1369800ae0af2731edd61558804500\n\nThere! I made chatgpt roast itself.", "label": 0}
{"text": "They aren't really doing these for international news agencies. it's to inform people in Canada of what's happening. We really don't need the evidence available to us right now. We trust that it's going to come out when it's needed, and there is no single instance where we'd believe Indian media or government officials over ours. \n\nThe only reason that this much is public information right now is because it has to be since the government of India refuses to be cooperative about it, so they need to inform us why Indian diplomats are being expelled from the country.", "label": 0}
{"text": "Must be the topper from her class at Lal Bahadur Shastri National Academy.", "label": 0}
{"text": "no shit dawg, indian music toh free me hi sunenge", "label": 0}
{"text": "In general, Indians lack civic sense. Especially North Indians. Especially from “particular “ states. In general South Indians are well behaved, more courteous, maintain good hygiene and do not indulge in Rowdy behaviour.", "label": 0}
{"text": "Bs comment . Not everyone needs to study math and science. With advent of ai these stem jobs are going to reduce in number anyways . Better to pass these students so they can pursue other trades .", "label": 0}
{"text": "Looks like you're the one with insecurities looking at a bunch of your comments . I'm already a home owner.\nBut you can take the certificate back, roll and shove it up. \n\nHere's one for you \nHaters gonna hate 😭", "label": 0}
{"text": "Guess who is who.", "label": 0}
{"text": "In my experience it's been opposite. Phone repairs are such a hassle that I starting doing them myself - yes I still check with shops and still decide I better do it myself.\n\nBut online deliveries have been the smoothest always. Maybe it's because I order only once in a while, but still.", "label": 0}
{"text": "IAS officers do ultimately what these politicians want. So no big surprise here.", "label": 0}
{"text": "Honestly same. And the fact is I am scared to say it loud because these days people are so much into religion and patriotism that they're forgetting common sense and basic manners. I travel a lot be it flights or trains. I never take sleeper class or even 3rd ac in trains but these days even in 2nd class i am seeing a lot of mannerless people. Blasting bhajans at 4am turning on the lights for the entire coach because they woke up? Children crying ladies singing. God it was awful but couldn't say anything because it's bhajan and everyone will judge me☠️", "label": 0}
{"text": "This post is referring to Indians abroad. If you’re living or visiting a western country, you’re expected to behave according to western cultural norms.", "label": 0}
{"text": "When we have retards like you who can’t see past partisan politics is when we have poor relations.\n\nIf you think turmoil and collapse have the same implications contextually and geopolitically then the education system failed you lol", "label": 0}
{"text": "This post is referring to Indians abroad. If you’re living or visiting a western country, you’re expected to behave according to western cultural norms. Obviously if you’re an Indian in India, then you can follow your own customs.", "label": 0}
{"text": "As someone from Bihar, it's embarrassing for me to admit i am from Bihar. I avoid it entirely but sometimes when i admit they say you don't look bihari. People from Up Bihar are so entitled that it baffles me, they are rude, dirty and very unhygienic also very creepy. It's a sad reality that our culture is so beautiful but people are ruining it.", "label": 0}
{"text": "Nope, it’s quite a common trait in any culture seeking validation from others. It’s pretty common here in Korea too, when people in the top positions got nothing to speak of anything significant, such gimmicks are thrown in front of audience, some are awed, some feel the cringe down their belly.", "label": 0}
{"text": "Does it causes erectile dysfunction", "label": 0}
{"text": "Yes. \n\nEven Just the grain in the world food system in it’s relainfe (for Africa etc.) and it’s (also intentional) mass destruction by Russia", "label": 0}
{"text": "Motabhai wants to get into everything to kill competitors with unreasonable pricing and then profit.", "label": 0}
{"text": "Also, the impact pot. for AS, NK etc \n\nIn general the precedent impact and expectations for world actions which it stes", "label": 0}
{"text": "And finally, so long as you know you cannot lie to yourself ant the importance in itself\n\nIt is simply, as all are, important in itself", "label": 0}
{"text": "Thanking you for risking massive hate your way and spitting facts. It's unlikely to change behaviour built up over the years but extremely useful to spread awareness so that maybe some will change for the better.  Most of us grew up around environments where if we do not push and shove we cannot ahead. People who tried to be courteous and polite got walked over. Hence the attitude. It's eat or be eaten attitude that is necessary for survival. It's not easy to switch suddenly. But it is something that we should leave back home and not take overseas. We have such a bad rep abroad that as a group, Indians are detested. Thanks again for this post. The fact that the flight attendants use balm to cope with our smell really hit hard", "label": 0}
{"text": "* We do not allow meta content. This includes - but is not limited to - content about other users, the r/India community or reddit at large, moderation or moderators. Also, we don't accept content aimed at brigading other subs or starting drama about other communities and their users/mods. If you have questions or constructive feedback, please reach out to us via modmail.\n\nRefer: https://www.reddit.com/r/india/wiki/rules#wiki_disallowed_content", "label": 0}
{"text": "You should post a link to all the medical documents over here. So the relevant doctors may go through the file and suggest any.\n\nI am not a doctor.", "label": 0}
{"text": "https://preview.redd.it/k8dcb6f7j0xd1.png?width=640&format=png&auto=webp&s=250edfccfbbc6ce3f2957c5b6cd6f8665978f3c0\n\nThey must have been suffering from disease that's why they are going abroad.", "label": 0}
{"text": "Just cusrious, Do you guys order stuff like eggs, veggies,fruits from these delivery services? \nI myself am too concerned as they might deliver veggies which have gone bad or might get fruits which have become pulp due to external pressure or eggs might be broken. In all these cases there is nothing that can be done except calling customer care.", "label": 0}
{"text": "N(viagra) mean viagra as an input for function c=N(x), where c is Chutyapa.", "label": 0}
{"text": "Canada has no admissible evidence. They can’t admit they spied on diplomats. 5eyes will be exposed. They are making this tamasha as Trudeau wants to distract from CCP’s interference in Canadian politics + garner Khalistani votes as his popularity is at historic low. ", "label": 0}
{"text": "And N(vedi)a means prostitute in Malayalam.", "label": 0}
{"text": "icl i live abroad and ive had the same experiences\n\nonly thing louder than the tfl tracks is a gujarati uncle on their phone", "label": 0}
{"text": "Great attention to detail.", "label": 0}
{"text": "You don't even have a clue how racist and bigoted a chunk of Indians are, they garland rapists and bring lynchers to power solely on religious hatred.", "label": 0}
{"text": "They have improved a lot. Specially the younger generation.", "label": 0}
{"text": "ONly because Mongiji is making us BiswaKuru. Best United nations Pm", "label": 0}
{"text": "Hoser gonna complain the whole life 💀", "label": 0}
{"text": "Bending over a few times doest break the back, but builds the career long term. The lady has learnt it quickly", "label": 0}
{"text": "This is a typical behaviour and the reason why Indians are treated like a 3rd class citizen abroad. I experienced it for many years and still no change !", "label": 0}
{"text": "Not to be racist , but certain areas in India have more uncouth people than the others , it’s a cultural thing", "label": 0}
{"text": "Local musicians won't get instagram clicks and that's what music is all about. Hello? It's the 21st century, everything is about external meaningless validation.", "label": 0}
{"text": "* All links (articles and images) should contain a relevant or original title (and/or subtitle). An original title (and/or subtitle) is the one given by the content creator. If a link submission has no title, you should make a self post with an accurate description of the content and a relevant title.\n\nRefer: https://www.reddit.com/r/india/wiki/rules#wiki_submission_title", "label": 0}
{"text": "Just like the Taliban.", "label": 0}
{"text": "I had a similar incident with a security guard in my own building when I dared be out after 11 PM in the colony’s garden with a female friend. This was in Mumbai. He had the fucking audacity to say- you should be out here late at night.", "label": 0}
{"text": "Op , you'll find different type of peeps in this country there are many more things to come in your life , you handled the situation quite well \n\n\nAlways carry pepper spray with yourself", "label": 0}
{"text": "* All links (articles and images) should contain a relevant or original title (and/or subtitle). An original title (and/or subtitle) is the one given by the content creator. If a link submission has no title, you should make a self post with an accurate description of the content and a relevant title.\n\nRefer: https://www.reddit.com/r/india/wiki/rules#wiki_submission_title", "label": 0}
{"text": "Haha! Here I wouldn't agree with you. The company where I work itself has a very good culture. My friends are also working with companies where the culture is good.\nThe thing is people who have no hobbies they work for longer hours and set wrong example. Due to this the expectations from others also change. Managers want everyone to invest infinite time to their work. But this only happens where HR policies are not strong. For example, I have a team member who work from home, he lives with his parents. He works till 2AM in the night and starts at 9 AM in the morning. In our team nobody encourages this behaviour of his. Just because he doesn't have any hobbies, or doesn't know how to engage himself with other tasks he chooses to work. This is not others problem. Even our manager doesn't encourage this working style. But again, you have to get into companies where good working culture is taken seriously then only you can have a good experience.", "label": 0}
{"text": "Welcome to india\nWe are indians\nLet's accept it\nGm", "label": 0}
{"text": "Well, clearly, from the third image, Laxman's Art Emporium.", "label": 0}
{"text": "How butthurt in general the indian community is? \n\nEveryone instead of accepting the problem is?about cinco de mayo why only us others also are loud.\n\n\nUnderstand if someone has said something about you, then address the problem by first acknowledging it. What do i see here instead, expats going full custodians of their culture. Thats moronic, because culture stems from civilisation and civil is the last thing you are being. I have had the good fortune to travel far and wide and yes we lot are ill mannered loud and frankly unmindful of local customs and behaviour. \n\nAlso being asked to relocate in a flight is the last thing i do. Its not the port side is going one place and starboard side is going another. \n\nOP - wholly with you on this.", "label": 0}
{"text": "Racism. is an inherent aspect of human nature. It is understandable that individuals may exhibit preferences for those who share similar communication and movement patterns.", "label": 0}
{"text": "When they are going release this things in public ?\nLike in Saudi journalist we can actually saw the photos and evidences.\n\nHere, everybody trust bro they are 5eye, badness \n\nEverybody knows that they got this info via means which will create more friction with India. \n\nBut I just really want to know that whether it was actual highly placed source who gave them this info, or one of American corp helped them.\n \nIn both cases incompetent Modi government should run a cleanup prog in RAW and IB before hitting abroad.", "label": 0}
{"text": "https://www.reddit.com/r/india/s/M9ne8LOPJq", "label": 0}
{"text": "Mera dimaag kharab hora h aisi cheezein daily sunke", "label": 0}
{"text": "Is it severe in Germany among other EU countries or almost same everywhere?", "label": 0}
{"text": "9 reasons you ended up in krakow, it's kill or be killed here unlike krakow, pipe down.", "label": 0}
{"text": "Anything related to Jio is a scam.", "label": 0}
{"text": "i hate to say it but many of my family member (my parents generation are like this). it's something that will change eventually.", "label": 0}
{"text": "Sorry to hear about that . Those mens should be hanged to death in public. I just didn't agree with u over that u think \"baap\" is a lewd way to say \"father\". No its not. I am from a very well to do family like my father was ex-navy offical and my mother is a teacher and all are well educated. My father doesn't even drinks or anything and in our family we still use the word \"baap\". Like not in daily use but no its not a lewd way of sayin it . I hope u understand. And be safe.", "label": 0}
{"text": "Kannadigas outside karnataka will learn the respective languages.", "label": 0}
{"text": "i second this mate, i travelled to singapore in 2023 during the chinese new year , and there were a lot of chinese tourists in marina bay,universal,sentosa etc, perhaps they were a huge nuisance constantly shoving their cameras onto my face", "label": 0}
{"text": "That’s the paradox, we could, hypothetically, economically take over whatever nation but we’ll never truly be a developed nation because of how poorly we behave and our low regard for public spaces. Of course there are other factors to why i think we’ll never truly become a developed nation (at least for the next 150-200 years) but this is a big reason among those reasons.", "label": 0}
{"text": "Following his master in conjuring up meaning less words.......", "label": 0}
{"text": "Much better than dealing obnoxious fuckers who would blow your head off with a country pistol if you don't let them overtake.", "label": 0}
{"text": "Has it become worse in the last 7-8 years? That’s the last time I flew to India. I kept bracing myself for some of this crappy behavior but actually saw none and felt that people were decent for a change.", "label": 0}
{"text": "Ohmygoodness, THIS is so true! Earlier, I used Uber only for commuting to college and back during exams. I was in their eyes \"a good girl\" and was always polite, tipped 50-100 rupees, was extremely non-commanding. My rating was 4.95. A few months ago, I got my first boyfriend. So the only travelling I do now is from my home to his home. Nothing has changed: not my conduct, my clothes, or my tips- just a man standing at the end of the destination to pick me up. My boyfriend is also white (I bring this up because this confirms to them that this man is not related to me, he is not Indian at all). When I get out of the car, I run to hug him (only meet him once a week). The WAY Uber ratings HAVE GONE DOWN. I am currently on 4.44, with almost 10/20 drivers straight up rating me 1 AFTER getting 100 rupee tip and polite attitude simply because in their eyes I am a spoilt woman dating a white man. This is absolutely crazy! So sad this happened with other women too.", "label": 0}
{"text": "I'd not even take the business class on such flight. Not even in the pilot compartment or on the aeroplane's tail", "label": 0}
{"text": "It's the mentality. I just came back from a work trip and visited home after a long time. Our family driver was inquiring about my work, I thought there's nothing wrong with a little curiosity, so I answered most of his questions and tried to explain my best exactly what I do. \n\nBut, Then he asked, are there girl in your company? Yes\n\nWere they also went to the trip? Yes\n\nThen he said the most horrible thing? Aapke company me bhi sab chhinal hain? Ladkiyo ko jyada padha likha dene pe yahi hota hai. (Your company is full of sluts. This is what happens when you educate women)", "label": 0}
{"text": "doesn’t matter how rich indians are mostly lack basic manners, i can see that in my society and in general daily.", "label": 0}
{"text": "What Mr Ambani also has a family WhatsApp group and he gives a heart to every random post that comes up there!", "label": 0}
{"text": "People in my hometown self banned ₹10 coins and when I showed them ₹20 coins they lost their mind.", "label": 0}
{"text": "Wouldn't work imo for the following reasons:\n\n1) The government is not powerful/vast enough to enforce this within the framework of the constitution, especially in India. You could do what China did, but that must be a red line for anyone who even remotely respects human rights. You can't just force sterilisations and abortions on people.\n\n2) You may disagree on this, but I believe it is incredibly immoral for the government to decide and enforce how many children someone is permitted to have\n\n3) If you ignore all of this, what will you do to the 3rd child? Or to the couple that has the third child? Cut off access to government jobs and schemes like rajasthan did? Or deny them some necessary service/government resource? Essentially, any punitive measures will make them worse off than would otherwise be without the child. We have extensive data to suggest people have fewer children as they get richer, plunging them into dire situations and cutting off access to government support (which is already only something that the poor depend on) is just plain counterproductive.\n\n4) Won't go into economic reasons cause I'm not particularly sure about them, but you can look it up. Afaik, it was something along the lines of productive systems requiring a constantly growing productive population.\n\n5) we don't need a one or two child policy simply because India's TFR is already at the replacement level and will automatically fall under replacement level. The average Indian woman is already having 2 children, so there is no need to intervene and play god.", "label": 0}
{"text": "It will take 1-2 generation of us indian to implant basic civic sense", "label": 0}
{"text": "All of these are a menace even in Indian flights. People can afford a 5k ticket but can't buy a 0.5k earphone or keep vol down to watch videos on phone.", "label": 0}
{"text": "All of this looks like a kid playing in ms paint. It's not even a photoshop", "label": 0}
{"text": "M for Mutthi, 1st letter of world's most popular sexual act. X is the 3rd letter of SeX. Hence, Modi>Xi Jinping.", "label": 0}
{"text": "I love how thousands of cars crash of multiple companies and one Tesla crashes and people doubt the car instead of people driving skills.", "label": 0}
{"text": "First of all my CA final studies doesn't give a bat shit about any festival. Secondly, Indians don't have civic sense. Bolne ke liye we have done that and this, but akal ghar pe rakh ke aate hai..", "label": 0}
{"text": "The only thing I can think of is not to have any children because  you forgot about one major point. Boling temperatures. \n\nSummers are going to get significantly worse evey year from now on. We are fucked literally", "label": 0}
{"text": "there is no new brics currency. that was just a token gift from russia. a symbol kind of thing.", "label": 0}
{"text": "Why is this even news? She knows exactly how the game works—keep the boss happy, enjoy the perks. Just wait; soon, they’ll even wash his feet and drink the water. After all, a mere collector is serving the viceroy.\n\nOnly in our country do the most random things become news. If someone’s playing the loyal servant and milking the system, what’s so remarkable about that?\n\nLet’s not start claiming she was once patriotic, righteous, and fighting against the system. In our country, this is everyone’s story before they gain power.", "label": 0}
{"text": "How it worked man please tell me I was trying to get loan from them but every time I got nothing", "label": 0}
{"text": "Prolonged medication comes with side effects. But I am shocked to know that why no doctor you mentioned tried to reduce creatinine level. Generally one of my relatives also has diabetes and heart disease. He takes regular medicine to control the creatinine level.", "label": 0}
{"text": "I order everything from these delivery services, from four five years now (except jio). Milk, bread, eggs, fruits, vegetables, other groceries and household stuff. It's a convenience.  Never had bad experience. It's cheaper than market rate. You can choose the brand you want, especially private labels are solid value for money. Only four or five times an item was delivered in damaged condition and they issued refund immediately, no question asked.", "label": 0}
{"text": "Well if the doors are locked and cannot be disengaged manually, and all supposed mechanical buttons are digital... Then I would blame the car\n\nMost likely the car driver was using autopilot and car swerved and he might have attempted to correct it.", "label": 0}
{"text": "Almost every woman I know has a creepy uber story. This is so sad. I was travelling from Noida and Ghaziabad before covid and the driver stopped the car in a random spot and left for five minutes almost. I was so scared and immediately called my partner ( my location was already shared). I noticed that driver was talking to someone and as soon as he noticed I am talking to someone on phone, he came running. \nI was so scared to say a word to him, I just kept pretending to be on the call and speak to someone in power. He didn’t even say Sorry. And it was around 8:30-9pm. I will never forget this experience. Being a woman sucks in this country.", "label": 0}
{"text": "IT Notice", "label": 0}
{"text": "Username checks out", "label": 0}
{"text": "While everyone has their own story, people who fail in school do not necessarily become failures for their entire life. To fail in school but still become successful isn't exactly a one in million kind of story. Almost all the backbenchers and backlog students of my school and colleges have a successful career now. Most of them are earning more than me.", "label": 0}
{"text": "How long do these last through the day? Do I need to apply it every 6 hours or something?", "label": 0}
{"text": "Now Germans will become anti-Indian and racist. Unfortunately large population of Indians is the main cause of anti-Indian sentiment.", "label": 0}
{"text": "Literally so many people  because cars get stuck and people burn. \nTesla has manual door release located in front of the window switches.", "label": 0}
{"text": "NOBODY, NOT ONE SINGLE PERSON is willing to talk about how mass religious indoctrination makes men rapists. \n\nThis will NEVER end. YOU don't want it to end.", "label": 0}
{"text": "Is it? Maybe you need to review your dentistry skills or something. Why don't you analyze where you are lacking and try to improve yourself?", "label": 0}
{"text": "I know some people put deo. And I know that it’s good to put that on the body but perfume is for clothes. But I genuinely am not aware you need both and especially deo first. Taught where? Who would teach such things?", "label": 0}
{"text": "Kick out jio from the competition, those scum will offer initially packs at low prices to kill off the competition and later hike the prices to force people to buy from them.", "label": 0}
{"text": "And also mustache man's legacy", "label": 0}
{"text": "Thanks. This is a specific well explained answer that I was looking for.", "label": 0}
{"text": "The unsolved problem since its inception", "label": 0}
{"text": "Oh god, same happened with me on the same route. One time I was wearing a dress (1st year of college so very young) and coming from Delhi. I specifically took an Uber as I was wearing a dress and wanted to stay away from metro creeps/stares. The Uber bhaiya proceeded to say \"Madam, gaadi mein CNG bharwana hai\" and parked in the fucking shadiest petrol pump where I had to get out of the car and stand with 10+ men leering at me and no women or vehicles in sight. It is one of the reasons I carry a pullover hoodie and skirt... Will never, ever want to feel this way again..", "label": 0}
{"text": "Jiomart I have good experience.but don't buy urgent items from them and have cash on delivery,no prepaid orders.", "label": 0}
{"text": "Unless the govt makes it a crime and punishes people for not accepting currency nothing will change", "label": 0}
{"text": "They were a democratic society under a vienna art school reject as well.", "label": 0}
{"text": "Lot of factors play in here, just to change AC I'll need to use touch screen with small area to click, which definitely takes the drivers attention away from road for even fraction of second.\n\nNow please justify this is can never be cause of accident because there is manual level", "label": 0}
{"text": "Porshe, merceda , bmw, Ford all Ave cars that are similiar. All their controls are digital.", "label": 0}
{"text": "They are yapping the same bullshit since last year. \n\nJust release the evidence like USA did. Put on a public indictment against individuals responsible like US did with R&AW officer. \n\nLets see if it stands in any international court/tribunal.", "label": 0}
{"text": "Because Home is Home.", "label": 0}
{"text": "Thank you so much. I think ye ek educational problem bhi hai. If you have time, check out Quint's video https://youtu.be/Pgom8LRF8hQ?si=s46RMMhDprI5Dpt-\n\nIt is crazy how the thought process of the country is.", "label": 0}
{"text": "First they attacked Hindus.", "label": 0}
{"text": "Foreign Indians bestuuu , Indian worstuu.", "label": 0}
{"text": "Basically roadside thugs shaking down travellers for money.", "label": 0}
{"text": "I am soo sorry this happened to you. Please keep a pepper spray with you at all times. \n\nThis makes me soo fucking mad as a boyfriend that my girl has to deal with this. You brother should have been more mad about this honestly. I would find the mf and kill him if something like this happened to my girl/sister/mom.\n\nStay Safe and keep a pepper spray with you please", "label": 0}
{"text": "This is scary as someone looking to move into New Zealand", "label": 0}
{"text": "I lived in Europe for 2 years, in spain and Netherlands. Never associated myself with Indians. Primarily made friends with other Europeans. All the stereotypes are true, especially the bad smell one. Many of my European friends used to come and ask me that man why does this Indian guy in my class smell so bad? What’s up with your country. I had no answer. I’m grateful that in my 2 years abroad I never even once faced racism in fact I found people more accepting and friendly to me in Europe than in India, however these things do need to change as it may affect someone else in the future.", "label": 0}
{"text": "Absolutely right. It is not easy to 'assimilate' into the society in Germany, especially given the ethnocentric mindset of Germans", "label": 0}
{"text": "Unfortunately, Indian culture is not so good and it has not refined to a level to show for the 5000 years of history.", "label": 0}
{"text": "Independent musicians firstly need to be good. Mumble one guitar emo music or basic electronica is just not going to work. On top of that the acts that have good musicians just do not know how to make a good song. You will get enough fans to have a decent career if your material is decent..im not saying you'll be Coldplay or Bollywood level successful, but you will more than survive.\n\nI know extremely mediocre acts (Kayan for one) charging freaking lakh+ for a 45 min set of the most boring shit ever. Don't see her and other such acts struggling to survive? Imagine if they were actually good.", "label": 0}
{"text": "Why were you even chit chatting with him? There's no empowerment in talking with a cab driver at that hour. Just take the cab. Keep your mouth shut and go home. That's just basic survival tactic.", "label": 0}
{"text": "Which other company claims to be the pinnacle of safe full auto self drive?", "label": 0}
{"text": "Aadhaar terrorism is going unabated, when will Nandan Nilekani gang be punished for human right violation using aadhaar exclusion?", "label": 0}
{"text": "You will need a top legal team and a lot of financial backing. These things drag on for months and years and companies have a lot of budget allocated for their legal processes", "label": 0}
{"text": "There are usually photoshop templates available which you can use to make different IDs like these.", "label": 0}
{"text": "😭😭😭", "label": 0}
{"text": "I never felt ashamed as an Indian while travelling to 20 countries in the EU. \n\nHave a resting bish face, walk with a good posture, dress good, smell good, dont talk as if you wanna impress someone, talk calmly with confidence(and a bit of superiority) and crisp English, wear sunglasses, wear a long coat instead of a puffer jacket, and you will be fine. \n\nIndians in EU are not your average refugees you see on the streets everyday. We work hard, study hard and are smarter than probably all immigrants(even natives) around. Show it, sauvely.\n\nWhat I have noticed is, apart from the problems you have stated, Indians abroad mostly lack confidence and do not know how to behave socially.", "label": 0}
{"text": "Free money for gormint!!", "label": 0}
{"text": "The policy of company was, those who take holiday will get a 7 day pay docked. That part is unethical.", "label": 0}
{"text": "Oh. That's not only unethical but illegal.", "label": 0}
{"text": "As an Indian, yes most of the Indians stink of curry, proper sanitisation like washing hands after eating with hands and changing clothes after cooking Indian food works fine. Nobody likes other people stinking.", "label": 0}
{"text": "This is terrorism and arm twisting at a different level. How can genuine accounts be frozen with the pretext that some idiot could not reconcile or agree with documents provided? \n\nthis is high handedness. Instead of applying their mind to weed out bad accounts, they claim genuine accounts to be suspect. \n\neach document needs another to authenticate, and none are rectifiable by the individual without being hassled. \n\nthe system is outrageous and the people who man them are downright idiots.", "label": 0}
{"text": "BUT - the harassment that ensued is wrong of crs", "label": 0}
{"text": "All low iq ratta experts join IAS. The next lower grunts join IPS. Two worst jobs out there.", "label": 0}
{"text": "The entire Jan dhan Yojana was a scam. The government thought that by opening accounts, they could move the cash held in Indian poor households to banks and help improve the bank's financial stability. But the idiots didn't do a proper analysis that for most poor in India, one account would've been enough. Now operating the derelict account without a minimum balance is an overhead that banks don't want to deal with. So they are quietly shutting the accounts down.\n\nThe Aadhar linking thing is just an excuse. They basically want to shut down the accounts where a minimum balance won't be maintained.\n\nAadhar didn't fail. The Jan dhan Yojana failed, period.", "label": 0}
{"text": "Tf? EU doesn't accept people from the Middle East very well either. Even here in India, islanders in Nicobar don't accept outsiders much, outsiders have very restricted entry and the reason is obvious. They don't want Indian immigrants displacing the local population and their native identity being lost. Indians have the highest population and Middle easterners are also one of the largest groups of immigrstion so it's obvious that hatred will mainly go to these races.", "label": 0}
{"text": "Well said. Imagine if the meat had turned out to be beef in testing. The murderers would have been celebrated as glorious warriors.", "label": 0}
{"text": "Indians are largely a primitive population. Just look at our leaders. No non-primitive population will tolerate such thievery among its leaders and officials. ", "label": 0}
{"text": "You’re wrong though. Bathing once a day is not enough without deodorant.", "label": 0}
{"text": "Waiting for the day ED raids every MLA and MP", "label": 0}
{"text": "Germany the new canadda", "label": 0}
{"text": "Legal team yes, doesn't have to be top.\n\nBut the bigger issue in facing is our society itself is in favor of work slavery. My own mom said multiple times why we need sunday off as we have nights to rest. \n\nAnd the legal issue we face in cases like this is rakshabandhan being holiday or not. Government must have properly defined holidays, maximum weekly work hours etc. Then we can thread our cases as per that.", "label": 0}
{"text": "Those amounts are like 10% of the actual wealth", "label": 0}
{"text": "Let me list down the actual content regarding unethicality/illegality:\n\n\\- The company laid out a policy of taking no half-day or holiday on Rakhi. Anybody who did so would be docked 5 days of pay. \n\n\\- The HR professional complained. She was terminated by vague reasons. Currently, the 'CEO' has launched a defamation campaign against her on LinkedIn. \n\n\\- There are other people who have complained of harassment and abuse by the CEO who have left or been pushed out.", "label": 0}
{"text": "Family based immigration. Also yes, faking credentials. But the root cause is the points system. You should not invite immigrants unless there is a job available for them. Otherwise it becomes a free-for-all.", "label": 0}
{"text": "I'm from MP (Sagar) and I agree with this.", "label": 0}
{"text": "Was thinking the same thing lol", "label": 0}
{"text": "Need reports and list of medications being taken. Hide name of patient and doctor before uploading", "label": 0}
{"text": "Tbf it's not too bad. My wealth Increased by close to 3x in the same time although a much smaller base. Of course they're corrupt but even investing in the stick market could have yielded such gains", "label": 0}
{"text": "Doubling of assets in five years is quite common for even regular people, let alone already rich folks. Around 14% xirr, in the post covid boom that's easily achievable.", "label": 0}
{"text": "Darwin award", "label": 0}
{"text": "a lot of times when i open reddit i see this type of post and the second hand embarassment is just too much   \ni am starting to hate this country more and more by each passing day gone are the days when i used to feel proud to be an indian (what a joke).No one has any concept of personal space and civic sense  \njust want to get the fuck out of here but even than people will see me as an indian,sometimes i wish i was never born here", "label": 0}
{"text": "This country is heading toward ruin. Many people will still defend it with illogical arguments, claiming such incidents happen in certain cities only or blaming specific castes or religions, but the truth is that women are not safe in India. For the middle class, law and order are a joke. This is one of the reasons many people choose to move abroad. Some will argue that countries like the US report more rape cases annually, but they ignore the reality that many incidents in India go unreported, and even when victims approach the police, FIRs are often not registered.\n\nI’m truly sorry for what you went through.", "label": 0}
{"text": "There's a button on rapido. Once the driver took a shortcut and I instantly got call from rapido asking if I was safe. It was during the day", "label": 0}
{"text": "It’s deodorant you need, not cologne. Putting cologne on over body odor just makes it worse.", "label": 0}
{"text": "Try being in a movie theatres in premium seats and the parents give their child the tablet and they play games at full volume or the guy next to you constantly answering his phone while the movie is playing. I got so pissed one day I took my phone out and started being equally rude and told the guy to either store it or I would break it", "label": 0}
{"text": "Inflation makes money from 23 crore to ~31 crore. Not sure how it reached 53 crore", "label": 0}
{"text": "Have you seen the market rally and the property prices? Everything has more than doubled since 2019.", "label": 0}
{"text": "People in other hot places wear deodorant. If you’re not wearing it, you’re offending everyone.", "label": 0}
{"text": "I'm a Bangladeshi living in USA\n\nI try to avoid Indians with my whole life....", "label": 0}
{"text": "Parents should teach this. Often it’s covered by teachers in school when children begin to develop body odor.", "label": 0}
{"text": "Did you get any solution? I also have only debitcard for which i registered the e mandate", "label": 0}
{"text": "Watch it again, sir. She was not against the holiday but in an unethical way, Whoever takes the holiday will get a 7-day pay docked.", "label": 0}
{"text": "Tbh rakhi is not a holiday anywhere except schools maybe. Even colleges are open that day. \n\n\n\nYeah, managers can themselves make it a half day for their employees as a good gesture. My manager does that every year.\n\n\n\nAlso, if someone requests for a leave on that day, does not warrant firing. You can handle it nicely", "label": 0}
{"text": "It's all in the soil. Soil of a state.", "label": 0}
{"text": "Fuck around and find out", "label": 0}
{"text": "Population and lack of manners training during early education \nNo one cares for others \nSad but true", "label": 0}
{"text": "DEI is bullshit", "label": 0}
{"text": "Now you are grasping at straws. \nWe don't know what caused the accident. \nYour initial comments were about how Tesla ~ accident. You reached that conclusion.\n\nI don't own Tesla nor do I like Elon musk, any sane person wouldn't like him. But that is beside the point. \n\nElon musk has claimed that ai autopilot will help while driving if it's active. It's stage 2-3 autopilot as he said. A stage 2/3 autopilot can drive on it own but it needs human intervention. Stage 4 will be likely in few years. \nAi will intervene if you try to sverve directly into people or obstacles but it can't prevent if you drive like shit and straight up ram your car into pole. \n\nMost of the Tesla investigation which made people like you raise their pitchfork have turned out to be human error. If Tesla is found at fault here then they should be held accountable but generic npc behaviour of jumping on bandawagons and drawing  faux equivalence is just shitty.", "label": 0}
{"text": "What else did he expect? Only friendly elephant is a statue", "label": 0}
{"text": "Yes we need atleast 2 classes in school per day to fix and instill civic sense in the upcoming generation atleast.", "label": 0}
{"text": "True!", "label": 0}
{"text": "Talking to a ghost does make more sense to an Indian family than a bf", "label": 0}
{"text": "Mandir is more important than AQI, talk about priorities", "label": 0}
{"text": "Wtf", "label": 0}
{"text": "Dude , did u even read the article? , the entire article is about PMO dodging RTI requests...", "label": 0}
{"text": "In our country, the situation is beyond absurd.\n\nCriminals run rampant, showing complete contempt for the police and the justice system. On the contrary, the police and the justice system are often in favor of the criminals.\n\nThe honest citizens—the taxpayers—are the ones who get exploited by law enforcement, and when something unfortunate happens to them, they don’t even receive a hint of justice.\n\nIn this country, law enforcement and justice are completely upside down.", "label": 0}
{"text": "Name me 1 better band from India. Just 1.", "label": 0}
{"text": "I think Indian thieves are stupid to not go after these guys.", "label": 0}
{"text": "if the crime committed against you doesn't kill you, indian judiciary will.", "label": 0}
{"text": "We are talking about the 80s when TFR was insane. This was something which UN had allegedly funded even. I do think forced sterilization is wrong. Govt should have subsidized contraception and promoted women work participation like how it is in Bengal and South to bring the TFR down. This was a shortcut done during emergency when people couldn't protest", "label": 0}
{"text": "Why is everyone only crying about religion but totally refuse to see how many women have been killed by MEN. It's literally *male* specific and in the majority of cases. There was recently a case of even a hindu man cutting up a hindu women to piece over marriage. The misogyny and audacity in men is getting awful day by day. Why is it always the MAN of any religion doing fuvked up shits.", "label": 0}
{"text": "**If you want make a chance - incentivize it.**\n\nLet us find a solution to fix this-\n\n1) Women/girls (authenticated/verified) can tip upto 5% or 30 rupees (whichever is higher) to the driver if he was respectful and civil. The tip will be paid by government (tax money)\n\nThrow new ideas or criticize how this go wrong or how this could be optimized", "label": 0}
{"text": "TBH, those are rookie numbers.", "label": 0}
{"text": "I’m just waiting for that comment—the one that’s going to justify this exploitation.\n\n‘Work is life; work-life balance? Oh, that’s just a Western concept. It’s only for the rich, not for the working class!’\n\nThese shameless folks spend their whole lives leeching off others and draining the life out of them, and they honestly think everyone else operates the same way.\n\nI can’t wait for some sycophant to pop up and explain how we’re just frustrated and jealous of these wonderful workaholics and their ‘self-made entrepreneurs’—who, of course, are just riding the wave of their privilege!", "label": 0}
{"text": "That's why i don't order anything from these. I only use swiggy once every month. These guys are scams. This zepto app keeps on giving 100 rs discount so that i will buy from it.", "label": 0}
{"text": "T\\_T", "label": 0}
{"text": "We need to start teaching Basic civic sense in school or on TV. I’ve experienced the same in so many ways.", "label": 0}
{"text": "In the US it is part of the curriculum when young. It should be taught in India as well", "label": 0}
{"text": "Explains why class cannot be bought. No matter how high we climb the ladder, some of us will never evolve.", "label": 0}
{"text": "If people had a reasonable understanding of the world population distribution they’d be unfazed to see that a big fraction of immigrants are Indians. But they don’t. So they think it’s some sort of disproportionate invasion or something. ", "label": 0}
{"text": "I hear you bruv, I do not live abroad but the lack of civic sense that most Indians demonstrate abroad is appalling. \n\nUnfortunately, they see everyone through the same lens and no matter how sophisticated you are as an individual, you are an Indian who doesn’t follow rules and stinks 🥲", "label": 0}
{"text": "Murder hua hai. Tujhe relationship nahi mili teenage me toh tu jo hai unhe badnaam karega/i kya", "label": 0}
{"text": "Singapore is worse. It has the illusion of a multicultural society but micro aggression based in race is everywhere.", "label": 0}
{"text": "*if you want to make it happen, incentivize it*\n\nNot sure when will this ever end. But we can  talk about how this will end. \n\nMy thoughts would be to incentivize good behavior like we do to a child. Our country is like a child who was not raised correctly. \n\nIf authenticated/verified women/girl uses digital platform to pay the cab service they can tip on behalf of government (our taxes) 5% or 30 rupees (whichever is higher) to the driver for being respectful and civil. \n\n\nTell me what could go wrong- knowing india? How could we make this better? What are other ways to educate our people?", "label": 0}
{"text": "That’s the sad part, they can’t. Because it would only encourage the rapists to kill their victims to avoid the death row.", "label": 0}
{"text": "not giving sex education and civic training has destroyed India's youth.", "label": 0}
{"text": "Bhai post padhne wale actually samjhdaar hai, while this post won't reach intended audiance", "label": 0}
{"text": "Similar call came to me today with the same sequence of events. The moment he asked for my name actually “good name”, I disconnected.", "label": 0}
{"text": "Thanks, I wasn't aware that was a discredited theory. There seems to be consensus that maoris were the first people to inhabit new Zealand", "label": 0}
{"text": "At least torture them in the cruelest way possible by whipping or medieval era torture devices", "label": 0}
{"text": "No i didn't say Tesla~accidents.\n\nI said they make false claims and underdeliver all the time.\n\nDon't know why you're so offended still.", "label": 0}
{"text": "As a teen who was lucky enough to have lived aboard, I 1000% agree with this statement. Same thing goes with communalism and religious extremism as well.", "label": 0}
{"text": "Are yaha to HE ke saath hi panga ho gaya..", "label": 0}
{"text": "Undoubtedly, but most people try to move to foreign countries because they think that they can get paid better there.\n\nOfcourse, QOL is shit in India when compared with EU", "label": 0}
{"text": "That's a great comment and had me self-reflecting a bit. Our 'kanjoosi' culture trait never leaves us even when we move to other countries and aspire to acquire wealth there. Always looking for an inch to exploit and take advantage of. Very poor behaviour from our folks. That lady must've been super nice.", "label": 0}
{"text": "Yes of course we should start. I totally agree with you. Bro even I sometimes spend hours wondering why we don't anymore. Why have we lost motivation to ask for our basic rights? I never get an answer or a satisfactory answer. \nFor example, you can take the farmers protest. People around me were either talking about how they're sheltering khalistanis in it, how it's a khalistani agenda and the others were just like I've a job and if I won't go to my office my boss will fire me.\nEven with the mainstream media and social media giving so much misinformation, it is really hard to decipher what's truth and what's not.\nI just know if we won't keep the government in check, then no matter whom we elect they're going to become tyrants. But there's always a distraction (like religion) or certain obligations (job security or financial, social helplessness, etc).\nI'm really thankful that I had this conversation with you. Glad to know there are people who are not blinded by the caste-religion or BJP vs Congress games and actually want to have a real talk. 🤝", "label": 0}
{"text": "His accomplices were Pankaj and Ritik. Obviously the focus is only the religion of the main accused.", "label": 0}
{"text": "Are people still going to Europe? Their salaries are now less than India for high skilled IT jobs, and higher taxes, and casual racism once in a while.\n\nEurope is old and stagnant, better to be in emerging countries or go to USA.", "label": 0}
{"text": "Australia spends like a $200k USD per year per refugee with that system, so it is pretty dumb. Better to let them work in country.", "label": 0}
{"text": "AirPods work fine", "label": 0}
{"text": "Yes their growth is 18-19% and 23-24%....", "label": 0}
{"text": "There's another story of violence against women on the front page just below this one: https://www.reddit.com/r/india/s/zT4LVbvZzh\n\nNo one is bringing religion into that because the perpetrators are not Muslim.", "label": 0}
{"text": "What if he was actually fkn around", "label": 0}
{"text": "r/natureismetal.", "label": 0}
{"text": "Darwin might give him a selfie stick to stick it up u know where", "label": 0}
{"text": "How do you define facing racism?\n\n- treat you in an actively hostile way based on your physical appearance or your stated origin\n- treat you less cordially than they’d treat a foreigner of a different race than you \n-  treat you less cordially than they’d treat a local person of the majority race \n-  treat you in any way differently than they’d treat a foreigner of a different race, who they knew was foreign \n- treat you in any way differently than they’d treat a local person, could even be excessively “positive” in an exoticizing way\n- think you do not speak the local language and/or assume you have less local cultural knowledge, solely on basis of your physical appearance \n- treat you differently once you verbally indicate where you’re from, but not before\n- treat you differently before you verbally indicate where you’re from, solely on cases of physical appearance \n\nAll of these are valid ways someone may define experiencing racism, and as you can see they are very different. Someone could experience racism in one sense but not in the other. Which is what makes these sorts of conversations vague and confusing. \n\nLike, whether you speak the language and want to fit in, or whether you don’t speak the language and just want people to be nice, this is a major factor. ", "label": 0}
{"text": "It sounds like you're really frustrated, and I get it—delivery delays can be super annoying, especially with expectations set for quick service. However, calling it a scam might be a bit harsh. JioMart, like many delivery services, is dealing with challenges that can affect timelines, especially during peak times or due to unforeseen circumstances. Let’s hope they sort out these kinks soon so everyone can enjoy the convenience they promise!", "label": 0}
{"text": "Seems quite normal to me.", "label": 0}
{"text": "I cannot explain when you ignore everything else.\n\nSo think whatever you want!", "label": 0}
{"text": "Great, so it's Indian uncles everywhere! Good to know.", "label": 0}
{"text": "Hey India. seriously what the fuck is going on over there? cause right now your known as the nation of baby rapists and gang rapists and that all you have to show for yourselves lately. obviously I'm not speaking to the lady's. my god lady's, my god.", "label": 0}
{"text": "One word. Junglees. Indians are fucking feral. Am Indian in the southern pacific and yall can stink out a bus. I get it. I love masala as the next person but I don’t need to taste and smell the dhana/jeera man. Wear a deodorant. \n\nNot hating on my people but when are we as an Indian society gonna fix our shit up?", "label": 0}
{"text": "OP if this is your lame ass, moronic, ass-licking, sycophant, chamchagiri, attempt at giving this a political color, then you are missing the bigger problem here. It's not about states, lawlessness or religion. It's about the ease at which women are killed by us so-called Mards or Men. The mentality is an issue and not religion or state. And just fyi, law and order is a Home Minister's domain in Delhi.  You need help.", "label": 0}
{"text": "These kinds of incidents are occurring a lot these days or reported more these days. The government and justice system must take a stand to prevent these types of crimes. I personally believe that rehabilitation of animals that are doing such things is not going to happen and they need to be behind bars for the rest of their lives. When rapists and murderers show no remorse or regret even if they are convicted what is the purpose of our system or conviction. Will harsher punishments reduce such incidents or will it have no effect. Idk the solution for this.", "label": 0}
{"text": "During festival time, they need to show that the system is working by cracking down on a few places.\n\nHowever, this work happens throughout the year; everything in this country gets manufactured and sold as first copy, second copy, or nth copy, and this work is actually overseen by these departments themselves.\n\nBut during festivals, when they need money, they crack down a bit more to make some extra cash. This entire duplicate business is thriving in this country; it’s a complete nexus that operates with the knowledge of the authorities and politicians, and they’re the ones who facilitate it—they get their share too.\n\nWhat’s the point of this show they put on? What’s the end result of all this? The businessman will just restart his operation in a few days. He knows that if nothing happens to murderers and rapists here, who cares about counterfeit goods?", "label": 0}
{"text": "The sad part the individuals that does this won’t see this post, the best we can do as an Indian is stop the unruly ones when we have the opportunity to make them realize about basic civic sense kindly and hoping they can see their faults and be better", "label": 0}
{"text": "He got the climax he deserved.", "label": 0}
{"text": "Does make sense. \n\nReliance's idea of giving free internet was based in their strategy to turn everyone into a consumer. It also sat very well with the BJP's IT cell propaganda machine. \n\nSo for those who remember, Jio basically launched right after BJP came to power. TRAI loosened a lot of their rules and charges for inter-network usage and roaming etc., to enable Jio's paradigm changing launch. \n\nAnd now, every single one of these \"12th toppers\" in Bihar have been fed on the most extreme form of porn, gore, violence, memes etc. The fact that the most viral meme in Indian Boy circles and online communities is that of Christian Bale drenched in blood in \"American Psycho\" is proof of what 'free internet's has done to the Indian male psyche. \n\nThe society was not ready for this. It's a festering wound that will take a generation to correct, and it may still not happen at all. \n\nThe level of confidence that Indian Boys have online propagating downright sexist remarks is proof that they are far beyond correction. \n\nDon't want to make this political but I have had thyae thoughts right since Jio came with the idea of free internet . Thanks AmbaniJi and ModiJi. An army of willing rapists ready to take up arms in the name of religion is all that you need to turn a country into a raging beast.", "label": 0}
{"text": "Don’t worry. We will not. We will find a novel way to fuck it up. We’re a bunch of novelists.", "label": 0}
{"text": "Oh makes a lot of sense, so this is all about eyewash. Gosh! India really not for beginners", "label": 0}
{"text": "Wanted*", "label": 0}
{"text": "Yes if one just broadly says they did/didnt experience racism somewhere, they should at least indicate whether or not they speak the language. Otherwise I have no idea how to process the information they just said.\n\nOn one hand speaking the language clearly helps like you said, local people would generally prefer that. \n\nOn the other hand, a person who speaks the language may expect to be socially included but experience condescension or microaggressions and realize the only factor preventing 100% social inclusion is their race. Whereas someone who doesn’t speak the language would have lower expectations (just want people to be cordial) and thus be oblivious to some level of deeper racism ", "label": 0}
{"text": "Kotak", "label": 0}
{"text": "qualified for mla post from bjp.", "label": 0}
{"text": "Good.", "label": 0}
{"text": "oh, communalism and religious extremism is a global thing.", "label": 0}
{"text": "Ikr. There are so many cases. But the religion comes up only if the culprit is from a particular religion.  \n\n\nIt unfortunately derails from the actual conversation.", "label": 0}
{"text": "I was looking for the same. Please update me too.", "label": 0}
{"text": "All I will say is let's have a critical constructive conversation if you want. But practice what you preach atleast man. The hypocrisy is just astounding.", "label": 0}
{"text": "She was 7 months pregnant & her family accepted she’s talking to a ghost?? Wild.", "label": 0}
{"text": "Big lose for the elephant tho, bro had to waste his precious time to crush the guy", "label": 0}
{"text": "Ugh. The watching reels on volume grinds my gears. The fucking obnoxious sound effects, nonsense cooking videos, that high pitched laughing sound fx, and the never ending scroll. Everybody is hooked into these short videos like leaches on a buffalo. Young, old, married they all watch this endless nonsense any time they're bored.", "label": 0}
{"text": "(24M) Even though we both are of same age it is like we both live in 2 different worlds. I don't drink or do any of it but I do go out on night rides 2-3 am I go out as I'm the king of the street but at the same road at the same time you will be paranoid and vulnerable. \n\nI wish you could enjoy the world I get to explore. One more thing, respectfully; whack your brother. He should be the one looking after you. Your brother pissed me off more than Uber driver. Instead of guilt tripping say next time I'll pick you up. Idiot!", "label": 0}
{"text": "I don’t understand the minimum balance thing. I mean it’s beneficial for a bank to have minimum balance but from technical perspective, what lost is to the bank to have account details of a consumer?\n\nThey aren’t operating or spending money (or are they?) for non-functioning accounts", "label": 0}
{"text": "But our people are CEOs of MNCs and we invented 0!  /s", "label": 0}
{"text": "I'm so frustrated by reading this but at the same time can't deny it.\n\nI think one of reason for this is how Godi media is showing India as some kind of super power. And I think the people who behave uncultured are the biggest consume of this fake news. So these ppl carry this fake pride and behave like this.", "label": 0}
{"text": "who asks for these surveys? I have another survey result for you 9 in 10 Indians wants to take a crap after having meal. mind == blown", "label": 0}
{"text": "ndtv really fell off", "label": 0}
{"text": "That too a Gujju", "label": 0}
{"text": "Honestly it's tiring sometimes because me and my partner end up going out of the way to be extra nice as if to somehow make up for the indecency and discourteous behavior shown by others. It's a skewed perception to have but in my books it's a small win for us", "label": 0}
{"text": "no it means sasta tabakko", "label": 0}
{"text": "I get where you're coming from, and I don’t blame you for thinking that way based on what you know about me. For me, though, a PhD isn’t just a title to hang up somewhere. It’s actually a way to open doors into research-based roles where I can really dig into the things I’m passionate about.\n\nHaving a PhD would also mean better networking opportunities, especially for some of my future plans, like starting a research-focused project or even a startup (and hence I wanna continue working as well) And yes, I'm aiming to get there sooner because it feels like the right step for what I want to do—making an impact faster, in a way that matters to me.\n\nI’m aware it’s a challenging path, but I’m genuinely interested in the field and excited about what I could accomplish with that extra depth and credibility. So yeah, it’s about way more than just getting a degree—it’s about reaching my goals and doing meaningful work.", "label": 0}
{"text": "There’s no stop to this isn’t it", "label": 0}
{"text": "They get thrashed hence thrash whoever is below them and this continues.", "label": 0}
{"text": "Doing a PhD in India is garbage, a waste of time, and will ultimately derail your corporate career.\n\nHigher education, like a PhD in India, is often worthless; you’ll just end up as a servant to your supervisor. Your interest in academics and your subjects will fade away. Plus, after completing a PhD in India, even corporate firms won’t consider you.\n\nIn India, a PhD is often just a way to pass the time; it’s mainly suitable for those seeking a salary increment in their current jobs or aiming to enter academia.\n\nGiven your enthusiasm and discipline, it seems like you want to make a significant contribution to fields like computer science or astrophysics. Well, forget that in India. Your supervisor is likely a fake PhD holder themselves.\n\nYou should ask a scholar about the conditions of PhDs in India, you’ll get a reality check. Moreover, if any institute claims it can offer a part-time PhD, they’re just selling a degree; that PhD means nothing. Those research papers won’t even get published in esteemed journals. It’s only useful for adding “Dr.” in front of your name.", "label": 0}
{"text": "SC has no spine SUPREME COWARDS", "label": 0}
{"text": "Use glycolic acid, body odour is caused by the bacteria in your armpits. Glycolic acid is acidic and kills these bacteria, meaning that you stop smelling. It’s great and I use it daily", "label": 0}
{"text": "BPO jobs in particular*. They are also going to Philippines", "label": 0}
{"text": "Baki Hanma : Episode 1", "label": 0}
{"text": "You did but the parent commeyi replied to did. \n\n>Sad. Tesla is the new Ola?\n\nRelating accidents -> 'because'-> Tesla is just false conviction. \n\nYou replied to my comment under his. \nWhich means you stood by his comment. I am just merely against the conjugatatiob that accident because 'tesla' when it could have happened in any car.", "label": 0}
{"text": "Use antiperspirant on your pits, then follow up with cologne on there and on your clothes", "label": 0}
{"text": "> relax visa agreements\n\nDidn't we kind of do this? Fast tracking visa for investments or the sort", "label": 0}
{"text": "Most Indians grow up being slapped around by their parents. Then as adults, we have a society where right and wrong is determined by your status (money, influence, power, etc). A politician will get away with murder, a police guy will get away with bribery, gang members will get away with minor crimes, etc. Consequence of all this is that an Indian will not behave until they are constantly whipped like a horse because that's what they have learnt.", "label": 0}
{"text": "Jeez guys ik you all are mad ,so am I and rightfully so, but asking for extra judicial killing in the wake of such incidents is not the solution , giving the police and the executive that much power and making them the judge, jury and executioner is never a good step for our democracy and will only further erode the trust people have in the legitimate system, no matter how long it takes or how difficult it is we need to stop accepting our legitimate judicial system as \"slow, expensive and easy for criminals to get away with crimes from \" and work for institutional reforms that make it accessible,quicker and less easy to defraud, I mean look at UP guys the people over there supported yogis extra - judicial killings and the blatant casteism and communalism (overly targeting muslim criminals and favoring rajput criminals),it has brought should be enough to show us that giving the police and executive can't be given such extreme and absolute power without any accountability whatsoever,and then be expected to use it fairly and without any discrimination, they will obviously favor their vote banks and target people who they want to for political reasons", "label": 0}
{"text": "I also applied and just had my AC, is it alright if I dm you too?", "label": 0}
{"text": "World has more stupid people than sane people. Peope tends to believe in what they wants to believe. That's why stupidty sells well.", "label": 0}
{"text": "It should change, when you immigrate you change. Otherwise piss off, this isn’t India", "label": 0}
{"text": "is it alright if I dm you to ask a few questions?", "label": 0}
{"text": "Heck off with your generalisation.. We don't like being called words just for being a man.. If you continue this, you will alienate all men from your life..", "label": 0}
{"text": "Y'all really expected a plan 😂? \nAfter the last decade full of Jhumlas?", "label": 0}
{"text": "I keep a deodorant handy at all times - at work, while travelling... Also sometimes a change of tshirt during layover.", "label": 0}
{"text": "It’s all about money, dude. Don’t pretend you’re some god-chosen saint out here ‘saving humanity.\n\nI’m just waiting for that comment—the one that’ll justify this exploitation. ‘Work is life; work-life balance? That’s just for the rich, not for the working class!’\n\nThese parasitic businessmen drain everyone around them, leeching off the work and well-being of others while shamelessly acting like they’re doing some godly work.\n\nCan’t wait for some sycophant to jump in, claiming we’re just jealous of these ‘self-made entrepreneurs’—who are nothing more than privileged opportunists riding on the backs of cheap labor.", "label": 0}
{"text": "> can afford to be better\n\nIf you can travel abroad and immigrate then you change. 70% of Indians live at or below the poverty line. The Indians that travel abroad/ immigrate are already inherently more wealthy than these poor people in India, you should change and you can absolutely afford to change. No excuses", "label": 0}
{"text": "What a good representative of India, wonder why youse don’t change", "label": 0}
{"text": "Exactly this! ^^ Canada should have gone the route of India and then modi would have his pants peed the same way it happened for the US where they gave the answer of rogue agents 💀. \n\nThough regardless of this situation, I feel bad for the Canadians out there who have a PM who’s more focused on this than the domestic challenges they currently face and the magnitude of which is ten folds higher than this crime which if being honest is actually in service of the Canadian people 😂\n\nSo, while there’s no doubt that India has done the crime, Trudeau is still playing some sort of nasty politics since these things usually don’t have a media trial and this is simply to distract people from the real issues.", "label": 0}
{"text": "I know Indians abroad that are struggling and the work as cleaners for little money. So that’s not necessarily true", "label": 0}
{"text": "Deo is a must. In fact, sweat and perfume make for the worst combination.", "label": 0}
{"text": "UjSorry, if what I said has put you off. \n\nYou've been stoic about your health issues, but I can only imagine what's going on behind that, maybe that has something to do with it. I shouldn't be high on your priorities.\n\nYou don't always reply to what I write, and that is fine. I often send something and say to myself what is she supposed to do with that? But more often than not, you'll answer direct questions. Which you haven't done of late. So I worry a bit. Whether it is my own insecurity or me just being socially obtuse or some combination there of, to what extent I can't say. But I am sorry.\n \nYou don't owe me of course, but I've lost bearing and navigating has become difficult. I could sure use a clue.\n\nSincerely,\n\ngreg\n\n\n\nSorry, if what I said has put you off. \n\nYou've been stoic about your health issues, but I can only imagine what's going on behind that, maybe that has something to do with it. I shouldn't be high on your priorities.\n\nYou don't always reply to what I write, and that is fine. I often send something and say to myself what is she supposed to do with that? But more often than not, you'll answer direct questions. Which you haven't done of late. So I worry a bit. Whether it is my own insecurity or me just being socially obtuse or some combination there of, to what extent I can't say. But I am sorry.\n \nYou don't owe me of course, but I've lost bearing and navigating has become difficult. I could sure use a clue.\n\nSincerely,\n\ngreg\n\n\n\nSorry, if what I said has put you off. \n\nYou've been stoic about your health issues, but I can only imagine what's going on behind that, maybe that has something to do with it. I shouldn't be high on your priorities.\n\nYou don't always reply to what I write, and that is fine. I often send something and say to myself what is she supposed to do with that? But more often than not, you'll answer direct questions. Which you haven't done of late. So I worry a bit. Whether it is my own insecurity or me just being socially obtuse or some combination there of, to what extent I can't say. But I am sorry.\n \nYou don't owe me of course, but I've lost bearing and navigating has become difficult. I could sure use a clue.\n\nSincerely,\n\ngreg\n\n\n\nSorry, if what I said has put you off. \n\nYou've been stoic about your health issues, but I can only imagine what's going on behind that, maybe that has something to do with it. I shouldn't be high on your priorities.\n\nYou don't always reply to what I write, and that is fine. I often send something and say to myself what is she supposed to do with that? But more often than not, you'll answer direct questions. Which you haven't done of late. So I worry a bit. Whether it is my own insecurity or me just being socially obtuse or some combination there of, to what extent I can't say. But I am sorry.\n \nYou don't owe me of course, but I've lost bearing and navigating has become difficult. I could sure use a clue.\n\nSincerely,\n\ngreg", "label": 0}
{"text": "The issue is that nowdays most people will interpret this in the wrong way. they will say go to Europe, go to USA, go to ... they will see this is the unique Indian crazy experience and welcome to India. yaha aesa hi chalta hein.", "label": 0}
{"text": "Oh went I went to Vietnam, the shuttle from the airport was full of my fellow Indians and they all started chanting “Bharat mata ki jai” loudly.\n\nPeople were screaming and yelling at tourist places.\n\nThe flight back was pure chaos. The plane literally had to take off while people weren’t even seated because these uncle aunties were blocking the way, sitting wherever they wanted, yelling. There was an Indonesian girl sitting next to me who was visiting India and she asked me whether all Indians are like this. I was so embarrassed.\n\nAn uncle started shouting at a flight attendant for some reason and put his food plate down on the floor like an uncivilised idiot.\n\nI feel so ashamed when I see how we all behave outside. A few people are not representative of the whole population but it doesn’t help the stereotypes either.", "label": 0}
{"text": "This! File a RTI and get beaten", "label": 0}
{"text": "They will call police you for vacuuming your house on a Sunday. ", "label": 0}
{"text": "Someone finally said it perfectly! Lol I don’t have an award to give but rightly said man!", "label": 0}
{"text": "No it’s not. See Elon Musk’s interview with Jack Ma.", "label": 0}
{"text": "Get fucked\n\nJust when you thought you couldn’t be shocked anymore, r/India outdoes itself", "label": 0}
{"text": "Using the crime to further their political agenda. If a perpetrator is Muslim, the rw will pick up the story. If the perpetrator is an upper caste hindu, the lw will pick the story. Talking about patriarchy or misogyny won't serve anyone's agenda.", "label": 0}
{"text": "Can't agree with you more", "label": 0}
{"text": "Indian govt doesn’t recognise marital rape.These guys will be eventual buddies of our govt peeps.", "label": 0}
{"text": "Did you read my comment? It has a word colleague. I am an Indian. Defending such people doesn’t make one patriotic. Accept the fact.", "label": 0}
{"text": "Agree with you man, and trains are the worst, I have to travel a lot from Mumbai to different states, I sometimes go by train, even the 2nd ACs are worst now, I had one experience this morning, a guy below my berth started shouting on call \"Why didn't you clean my BMW\". I was like what the hell, it's freaking 6 in the morning and shouting like a toddler. People here do need to learn civic sense. They need to learn things can be solved peacefully, you don't need to shout like a f*cking bollywood movie hero for everything.", "label": 0}
{"text": "What happened in China? I mean apart from what the documentaries show, about which I have clearly written in the post?", "label": 0}
{"text": "I say, run away if you can. And maybe to a country where one can step outside without worrying about rapes.", "label": 0}
{"text": "We live in hell literally.This country is hell.The only country in the world with a majority population which worships women and look at our condition.", "label": 0}
{"text": " I thought leaving this hopeless country would be my escape but unfortunately coz I'm Indian and this Indian stereotype will follow me everywhere even though I'm nothing like that.. Sad life..", "label": 0}
{"text": "Bro if you want some genuine advice from me so i would recommend you to buy creatine and fuck protein powders .. and go for non veg diet instead .. i complete my daily goals of  protein from veg and nonveg sources rich in protein .. and use creatine .. that fucking works too good .. i was 116 kgs 3 months ago and now am 88.5 kgs and following a tasty and economical diet .. with a 40kg  musclemass and 14 percent body fat", "label": 0}
{"text": "Unemployment has become a boon for these guys. They know we can't quit our jobs, and even if we do, they can easily find a replacement for us. 10000 guys for a single job", "label": 0}
{"text": "Idk what happened to him after becoming PM but when CM he was quite opposite tbh he realised that managing the whole country is quite difficult as compared to managing a small state", "label": 0}
{"text": "A couple of things.\n\n1. Paying for a PhD is usually a bad sign. 100k GBP, that too? PhD positions in good universities are usually paid (not too well, but still)\n\n2. Universities (good ones at least) usually have yearly evaluations to make sure that the research is on track for a good PhD. Transfers to masters is not unusual but in the fourth year seems too late? Did people only realize at the thesis stage that the research was not of quality?\n\n(I am a postdoc working closely with PhD candidates at another UK university)", "label": 0}
{"text": "I’ve always maintained - we as an Indians can complain about racism and how everybody hates us for being Indian, but we sure as hell don’t do ourselves any favours. I don’t understand how (some, most) of us lack even the most basic sense.", "label": 0}
{"text": "\"It's not about money\"\n\nWell what the fuck is it about then?", "label": 0}
{"text": "“I overwork my employees and don’t pay them enough”", "label": 0}
{"text": "That's exactly what I had asked? Why did you write Bihari. It was not an accusation. My mere simple question is downvoted simply because I asked. \n\nYou could put edits in your post like other edits but you changed in the main text. \n\n\"I have so many Black friends\" vibe. \n\nYou think in Bihar, girls don't go outside and drink or Bihar is some monolith. Or you believe in Delhi, local people don't have this backward thinking. This is an Indian problem, not Bihari one. \n\nJust see the comments on this sub's general post on how Bihar is demonized. Or how \"Bihari' is used as a slur in Delhi in general. \n\nMy point is quite simple that xenophobia against people from our country irrespective of the region should not increase. Im not accusing you of anything.", "label": 0}
{"text": "BBC article: [https://www.bbc.co.uk/news/articles/cy898dzknzgo](https://www.bbc.co.uk/news/articles/cy898dzknzgo)", "label": 0}
{"text": "Boy you should try taking a train in the UP-Bihar route😆. You'll truly be proud to be an Indian", "label": 0}
{"text": "Yess!\nThankyou! Women are the favorite victims.", "label": 0}
{"text": "This comment sort of subtly highlights the problem: We are obsessed with economic growth and external appearances for self gratification above all. We’ve prostituted our values away for the sake of self-centred materialism and convenience. GDP means nothing. Does not matter if India becomes an x trillion dollar economy- that’s just a derivative of how much we’re consuming and that’s a flawed system. Some comments below and above spoke about civic sense- that’s key. Education does not equal culture, consideration and class. People can be filthy rich but still be degenerates. Our politicians are prime example of this. \nThe words from my school principal ring truer than ever: “what we do in school is not just give you an education. We build character. What happens in our schools is a sample set for our nation at large.”\n\nI agree with that. I’ve worked as a teacher in a government school and fuck me, it is appalling. No wonder they do not break out of the cycle of poverty. Furthermore, literacy and the very definition of it in our country is a joke. \n\nNow, I studied in a catholic ICSE school, so I also recognise that my upbringing and narrative was largely shaped by this and so I learned better civic sense compared to >95% of Indians who did not have access to the same education as I did. But that’s where it does begin, but does not end, because one does not need to go to a great school to learn civic sense and consideration for others. I recently came back in a cab from Mumbai and I connected with the cab driver so much more than I’d with a lot of other educated folks- this guy had character and his words and thoughts highlighted that he thought deeply for the well being of others, not just himself. How is it that he was such a nice fellow who was considerate about others, while many “educated” folks aren’t?\n\nGiving nasty looks, premature judgement based on what people wear, do and think, and how they lead their lives, intrusion of the personal space to the point of making people absolutely uncomfortable… man we could go on and on. \n\nBut it does come back to the root of the issue. We’re a nation today obsessed with ourselves and are living in echo chambers. I recently thought about this: In India, if a person is wealthy and powerful, the person could fuck up in most ways possible and be forgiven for it or expect to be pardoned and get away with it. After all, “tu jaanta nahi mera baap kaun hain!?” I read about the Nitish Katara murder case this morning and how those political goons fucks his life over. And I was like, “nope. They aren’t my people. The Indian pledge is a joke. I’d be ashamed to call these people my own.”", "label": 0}
{"text": "His father was an engineer who invested in his company and his mom is an entrepreneur who does headhunting for CEO positions...safe to say he didn't get to where he was just by working hard.", "label": 0}
{"text": "\"It's not about money\" now. It is what I am going to reap in 10 years time.", "label": 0}
{"text": "I wish civic sense was a common thing in people like sutta and daru today for them.", "label": 0}
{"text": "lol! Fucking entitled clowns", "label": 0}
{"text": "Shame….. This is not a thing to be proud about", "label": 0}
{"text": "This is engagement farming, they way you describe yourself & the incident it’s for insta-type girls, you write ✍️ so much that your a Reddit-type man.", "label": 0}
{"text": "Every time a Canadian govt official opens their mouth it reminds me of a Kejriwal meme", "label": 0}
{"text": "Nice to hear that your company have a good culture. Good luck", "label": 0}
{"text": "Changing doesn’t necessarily have to be according to one’s income. Sure, if you want to be better groomed you’ll have to spend some money. But changing one’s attitude and adapting to another culture takes exactly $0. People just choose not change the way they act", "label": 0}
{"text": "https://preview.redd.it/h3sf6a4i42xd1.png?width=1280&format=png&auto=webp&s=43cfc3a89595975d7ce2dad4b28fc1c5e32e1686", "label": 0}
{"text": "Biggest filter would be the language. You just cannot get by with only English. German language skills are a must for any job here and the language is not easy to master either. So a lot of people will realise the problem pretty soon", "label": 0}
{"text": "It’s about a lot of money.", "label": 0}
{"text": "These high-performance what utilise what and what enhanced by what for what now?", "label": 0}
{"text": "Yeah if i have a business that gets up like that, i have no problem working cuz thats my motivation but i will ensure the team gets heavily pampered", "label": 0}
{"text": "Mohabbatein Dark Version", "label": 0}
{"text": "I didn't talk about signing FTA with China.\n\nThe major reason why India is not signing FTA with EU because IT and Automobile lobby is against it. iT lobby wants favorable visa for Indians. \n\nWith Asean, the FTA is a huge success.", "label": 0}
{"text": "i started to distance myself from people like that. i generally am very polite when shit like this happens but i figured its better to ignore them and probably sit in business class than to live with that. hope it feels better next time around.", "label": 0}
{"text": "Try and get into a corporate R&D. Aerospace means you'll generally want to get into a \"defense contractor\". For software i'd recommend something like Bell Labs or Cisco. However, the prerequisite for most of them is having a PhD, so it'd be like putting the cart before the horse. That's not to say that it's impossible , it's just that most researchers who publish from these labs are already very reputed researchers. Also a PhD doesn't mean you're a genius. It means you're capable of conducting independent researcha", "label": 0}
{"text": "And people ask \"what goes on in MP?\" This goes on. It's another bimaru shithole state.", "label": 0}
{"text": "Loser and a horrible person", "label": 0}
{"text": "As an employee.. It's nothing less than a curse to work for an Indian company", "label": 0}
{"text": "Sometimes I wish I wasn't an Indian. People don't have self awareness. Until we raise the kids right, rather than leaving them to the wild, this won't end.", "label": 0}
{"text": "What else is it about? Self actualization?... My a**", "label": 0}
{"text": "I understand the anger, but this is not the conduct of a civil society, a society with democratic values. No one accused or found guilty of a crime should be subjected to torture under any circumstances. Besides the fact that it's barbaric, do you honestly trust every single person, male or female, to 100% never falsely accuse someone, do you trust any police force in India to 100% never detain or arrest an innocent, or prosecutors 100% bring up charges against an innocent, or courts 100% be accurate with their verdict. If the answer to any is no (which all should be), then you're basically calling for an innocent to eventually be tortured with  medieval era torture devices. \n\n\nHere's a case in NYC with a far more competent police and justice system than the average Indian city, which completely dropped the ball failing on all four of these areas and convicted five innocent men of rape with media destroying their reputation, with the five convictions later overturned:\nhttps://en.m.wikipedia.org/wiki/Central_Park_jogger_case\n\n\nThis is the type of emotional belief that breeds this mob justice or totalitarian CCP style state justice, and symptom of an overreaching problem in Indian society: a lack of education and a lack of secular democratic morals with citizens who truly view each other as equals, the same issues which are probably the root cause of many of these rapes.", "label": 0}
{"text": "What I am trying to say that age of free trade is over. Just like in 60s and 70s, if India wants to have investment from western countries, india needs to take the side of west. That's what Japan, south Korea did. \n\nWe would need to try to be member of OECD rather than BRICS", "label": 0}
{"text": "Yes, it's almost always MEN doing such atrocities. I agree. Men also kill men and it's not all about Men vs Women and misogyny.", "label": 0}
{"text": "Hey buddy", "label": 0}
{"text": "I concur India has to improve its investigation and conviction rate but when an accused has been proven with concrete evidence it should be barred from human rights especially for crimes related to violating personal human rights", "label": 0}
{"text": "Final paragraph in the article:\n\n>\"If a correct perspective comes on social media within a few hours then it is useful. There is no lack of patriots and nationalists in the country. They do write on social media. Social media needs to be countered using social media. Sometimes it comes that do government **should make laws on social media**.\n\nMore censorship incoming?", "label": 0}
{"text": "Sex education, knowledge about relationships and love is so important for teenagers. Knowledge is power knowledge protects you from harm and manipulative evil people.", "label": 0}
{"text": "The founders belong from a rich family. Of course it's not about money.", "label": 0}
{"text": "What he is actually saying is \" I need to be a billionaire, for that people need to work their asses off for min money..\"\n\nCompanies/Rich folks taking advantage of the helplessness of other Indians  to make a quick buck..", "label": 0}
{"text": "I don't know what's so hard to understand, why can't everyone learn basic etiquettes and manners. Be it Indian or any other country. Everyone should have a little common sense that playing reels on full volume without earphones could disturb others, being stinky can make people throw up, etc. There's still a lot of development that needs to be done in our country, be it Brain's development or Country's Development.", "label": 0}
{"text": "I doubt the west would try to create a China 2.0 though, they’d obviously be more cautious and try to use other countries as well to balance it out like Vietnam", "label": 0}
{"text": "As an Indian speaking 80-85% Indians are narrow mined. They think of themselves highly when they live/travel abroad. Indians criticising foreigners for racism are hypocrites as they themselves bully each other for black skin. Imagine if foreigners starts settling in India & take our jobs which is already limited. Can’t put in words what they will go through. Moreover there are land laws in some states that doesn’t allow people from other states to buy lands in a particular state/ forget about foreigners who come from different land.😌", "label": 0}
{"text": "They aren't the minority, most of the populace are ignorant fools.", "label": 0}
{"text": "Even handful of civilized Indians are fed up of such Indians.", "label": 0}
{"text": "The irony of reading the article on ANI  which puts up ridiculous  stories with little to no fact checking  🙄.  \n\nNd the credibility  of the Social media is way more then them media houses run by corporates", "label": 0}
{"text": "OP, keep writing, you'll get better. Don't give up.\n\nCritique of this piece: it's a ramble more than a studied piece. It has no specifics or supporting which cite historical facts or present day happenings. There's just 1 seed of thought - that government should support Israel and citizens are free to oppose Israel. Rest of it is rationalization to support this point. \n\nThe government or entity is not supposed to be lifeless or inhuman or an automata devoid of any human considerations. That's why the members are called people's representatives. If the people are human, and they get represented by these lifeless non humans, the system isn't working that well.\n\nWhat Israel is doing is wrong. No, Oct 7th is not a justification. The war (genocide ?) has gone beyond a reaction to a terrorist event. We can accept the cynicism with which realpolitik happens. We don't have to agree or justify it by closing our eyes to injustice.", "label": 0}
{"text": "Yeah, our esteemed officials naturally feel threatened when social media exposes Ligma media antics regularly.", "label": 0}
{"text": "Its not about money for them but for us...it is about money", "label": 0}
{"text": "No, that is not true. You might find 1k people for a single job but you might not find a like for like replacement, if you have a good cv it is difficult to replace you.", "label": 0}
{"text": "I agree with you that we can’t see some contagious cases. So what’s your point? How does that relate to how airline staff should act when they suspect a contagious condition?\n\nAnd what’s your point about Google search? Are you suggesting that instead of relying on a doctor’s certificate, airline staff should use Google and do the diagnosis themselves?", "label": 0}
{"text": "I feel you. I'm so sorry for your experience OP. I'm a third generation immigrant born and raised outside India. All I can say is we were raised to avoid the Indians at all costs. We were not allowed to speak to them in school, not allowed to date them and even forbidden to have them as friends. Our parents have shielded us from the culture entirely. I'm still half so we're more on our fathers side of the culture and way of living. ( Aussie). Needless to say that's how people around the world perceive Indians. Even the Indians themselves. \n\nHaving non Indian friends is a flex where i come from. It means you're bilingual with prospects, potential and  no criminal records. If you're seen with a non Indian spouse or partner the respect for you increases 10 folds. Raised in diversified culture I'm always surrounded by non Indian friends and partners directly eliminating the potential of any Indian man even approaching me as they could see I'm surrounded by someone way better than them. It intimidates them and it keeps me safe from any embarrassment or harassment. \n\nSometimes there is nothing you can do. Like in an airplane or crowd. Just 2 days ago my cousin was at Universal studio complaining about a women's BO. She was going on and on about how it stinks and why can't these people carry deodorant and here it is again. Just know that you still have the power to control whom you choose to be with in your life. Take comfort in that and everything else will be peachy. You'll be alright.", "label": 0}
{"text": "It's not stealing and Capitalism works on exploitation or else there won't be any capitalism.", "label": 0}
{"text": "Delulu much bro.\nEveryone is replaceable, including the founders.", "label": 0}
{"text": "When was it ever credible? Did we elect them like we did his govt", "label": 0}
{"text": "The comment that was meant to promote a [space](https://www.reddit.com/r/Indianindieheads) and had resources for people wanting to support and explore Indian indie music has been removed, cheers. Now I understand why indie artists in this country struggle. :)", "label": 0}
{"text": "Yeah sure.. U are doing God's work by using cheap labor to provide a concierge service.", "label": 0}
{"text": "Why is your response to be angry at women who are frustrated with violence instead of being angry with the men who commit the violence? Focus your outrage on the men who make you look bad instead of the women who fear you.", "label": 0}
{"text": "They wanted to introduce that IT bill until it was junked", "label": 0}
{"text": "Oh so it was good when they were getting benefits from manipulating it but now people can see their ugly side it’s bad . Ok", "label": 0}
{"text": "Pretty simple- the airline staff isnt the doctor. If they have doubts, call the doctor.\n\nThe person even shared past prescriptions.\n\nWhy should someone be at the mercy of airline staff for medical opinions? Kids have rashes these days, never seen them stop or ask for fitness certificates?", "label": 0}
{"text": "No, everyone is not replaceable. The majority are replaceable but not everyone.", "label": 0}
{"text": "OP is your support to this guy based on your hatred for Ambani or because you genuinely think extortion should be legalised?", "label": 0}
{"text": "Nobody thinks that. Just because there exist people worse off than you does not mean you cannot complain about the injustice you have to suffer", "label": 0}
{"text": "awww look at you, how cute. living on a high road and expecting civic sense ... from people who do not even have common sense.", "label": 0}
{"text": "education or money does not give you class. Class cannot be bought.", "label": 0}
{"text": "True, unless fattening politicians' and officers' bellies counts as proper use.", "label": 0}
{"text": "Problem solved", "label": 0}
{"text": "Why it is mentioned that they are indians?", "label": 0}
{"text": "Everyone is bro. Unless you are top of food chain, you are replaceable.\n\nWhy do you think someone is not replaceable?", "label": 0}
{"text": "I.e. you completely don't concur, likely didn't understand the crux of my arguments (either due to a lack of education or because of emotions),  don't want to live in a just society with a secular moral democratic compass with true equality for fellow citizens, and blindly have faith that all four steps from the accusation to conviction will always be perfect against fellow citizen. \n\nAgain symptoms of overarching problem beliefs in Indian society which ironically are the cause for many of the rapes.", "label": 0}
{"text": "B#sterd", "label": 0}
{"text": "It seems aajkal bhooton ka bhi bharosa nahi, kab c**d jaye aur pet fool jaye", "label": 0}
{"text": "Then you should face ghost then", "label": 0}
{"text": "It's crazy that this idiot even had 2 aides helping to murder. Like how fucked up he and his circle is to do that. Hope they waste their life away in prison.", "label": 0}
{"text": "They still have french draws!", "label": 0}
{"text": "We are not going to have trade surplus with every country. It is about global value chain. And we import things from Asean because we need to", "label": 0}
{"text": "Next time post a video of your dad fighting off 8 people simultaneously", "label": 0}
{"text": "Did you get explanation??", "label": 0}
{"text": "These people are vishwagurus in wordplay", "label": 0}
{"text": "arey he takes care as in will not take us to those spots ? ", "label": 0}
{"text": "Very unique !", "label": 0}
{"text": "He should do that a few more times.", "label": 0}
{"text": "BJP voters can even start voting for literal animals if they were wearing bhagwas! \n\nSomebody should do this experiment. The results will not surprise me.", "label": 0}
{"text": "You can also contest challan. It's a bit hassle but not more than someone losing their life.", "label": 0}
{"text": "If only more of these morons followed suit.", "label": 0}
{"text": "....", "label": 0}
{"text": "How do you charge a foreign government?", "label": 0}
{"text": "Through ICJ. But usually that's a very long route. Most nations solve such issues diplomatically. Either by themselves or by putting pressure through another more powerful nation/allies.", "label": 0}
{"text": "This is about international relations, it is not a trial.\n\n\nFive Eyes is incredibly powerful.  We are only seeing the parts they want us to see.", "label": 0}
{"text": "Admissible where?  This isn't a court.", "label": 0}
{"text": "even the ones making it , we have a school in our city that does everything for these kids all they have left to do is score in some exams. donation drives , building apps, Ted talks all served in platters. then they are legacies too. it just bothered me alot , when I was volunteering and one of these brats was looking at me as if I'm someone who isn't worthy. atleast I'm doing it on my own , not to fake some experience on my cv. ", "label": 0}
{"text": "Hmm the ick state of India.", "label": 0}
{"text": "The Lost Symbols", "label": 0}
{"text": "I mean all it takes is google search to understand that Psoriasis isnt a contagious disease. \n\nNext time if there is a person coughing beside me, can I request the person to be off boarded because i suspect Covid. \nAnd Covid spreads. Covid causes death. Hence the need to apply a bit of common sense. Every ailment is not a threat to co-passengers. Apply a bit of grey matter.", "label": 0}
{"text": "Murderers belong to Dephi. Crime occurred in Haryana. However, lawlessness is in BIMARU states. Do not understand the logic OP?", "label": 0}
{"text": "why people need education beyond class 4 is beyond me. a person can become pm without education and these libs crib about lack of opportunities.", "label": 0}
{"text": "Yes, having a trade deficit is normal but right now it is accelerating into big amounts. Our exports have seen virtually no increase last 2 years but imports are skyrocketing. This is unsustainable", "label": 0}
{"text": "I was about to rant about this but saw your post. You have summed up my frustration. I don't like giving my mobile number. Gave at a medical store chain once and they used to send me offer sms everh day as if i would get a disease just for the offer. Same things have happened with otber places as well. Mobile number is just for spam. And we can file an official complaint and they will have to fix this. This has been done before. I am just trying to find out now where and how do i start this process", "label": 0}
{"text": "I'm having the same question, can you please tell me what you did then?", "label": 0}
{"text": "MP seems to be a hub of rapists. Every 4 days there is new rape news from MP.", "label": 0}
{"text": "Doosra is dead", "label": 0}
{"text": "A 19 year old doing drugs. Hmm.", "label": 0}
{"text": "This is not LinkedIn", "label": 0}
{"text": "If only more of these morons didn't get hospitalized and were cremated", "label": 0}
{"text": "Good for you. I like my shit.", "label": 0}
{"text": "Uninstall Zepto", "label": 0}
{"text": "It all boils down to ancestral wealth. Against Indian backdrop of 1.4 billion people, their numbers are tiny so they always escape any scrutiny. But there are plenty of people who's ancestors came out of British India with shit ton of money and property, and many folks made their money during the license raj. The money and property was held in black and now they are reaping the benefits. Ever wonder why Mercedes had opened their showrooms all across the country if India has such levels of property?", "label": 0}
{"text": "Well you have just invalidated OPs cockamamie defence then.", "label": 0}
{"text": "Make it seem like they are in prison but hang them privately?", "label": 0}
{"text": "It's not about the money, it's about fulfilling their passion of instant grocery delivery and in turn saving the world /s", "label": 0}
{"text": "Horrific? Nah just normal.", "label": 0}
{"text": "Nothing explains India's situation rn, than this headline. Lmao", "label": 0}
{"text": "Overworking for sure is true but I doubt they don't pay them enough. Last I checked, QC companies are paying top rupee for hiring talent, be it designers, pms, engineers etc. \n\nThey do pay their employees right. \n\nCan't say the same about the people who are actually making their company run though, the delivery drivers.", "label": 0}
{"text": "In the entire day today, this is the first good news I came across.", "label": 0}
{"text": "Areas that trap sweat and moisture are breeding grounds for any bacteria. Other places like your groin and feet can also smell because they’re often restricted by clothing and trap smells", "label": 0}
{"text": "Seems like these eight are now eligible for a political party now.", "label": 0}
{"text": "Congratulations India you have come a long way from being a slave country to British raj to now becoming the fancier corporate slave. The people working don’t see the family most of time. Money is poured for kids so called education . No quality time spend either with kids parents or extended family or friends. End of day you die. No one blinks an eye. Wake up corporate India you are the glorified slaves of present who don’t have any thing to show for in reality", "label": 0}
{"text": "The same.", "label": 0}
{"text": "I live in Mumbai and whenever I have to travel by trains (I avoid them as much as I can) or the Metro, people look at you like me like i’m a clown if I make way for the others, or wait patiently or don’t push others get in the elevator, trains,  etc. Why is it SO normalised to casually push and touch people? I’m a woman so i usually take the ladies coach but the way these ladies behave is so crass. If you call them out for pushing you or hurting you, theyll support the person who pushed you and just end up saying “Don’t travel by trains/ metro if you don’t ‘KNOW’ how to”; “seems like it’s your first time traveling” LIKE NO?!?!? it’s called having basic human decency and civility", "label": 0}
{"text": "Extremely sorry about this, some love and support towards you during this time. \n\nYou can raise a complaint against him to the police and Uber, may that driver rot somewhere", "label": 0}
{"text": "Instead of just posting long rants on online platforms, let's just take actions against these scumbags. Let's delete the zepto app from our devices (if one even has it on their device). Let their revenues take a massive hit. Then we'll see what it is about if not money.", "label": 0}
{"text": "In Japan, labour laws are strict. There’s overtime pay and all. Also 40 hr work week is the norm. Do the companies in India not get any warning from labor unions??", "label": 0}
{"text": "You are correct . it will they they spied using this and that tech .", "label": 0}
{"text": "Bhai jo bhi ghinoni se ghinoni cheez ho sakti hai, UP mein hi ho Rahi hai\n\nKya hogaya Ram Janma bhoomi ka 😓😢", "label": 0}
{"text": "Not a shocker. Sadly this news doesn't shock me anymore.", "label": 0}
{"text": "I live in Ireland and people become very racist now to Indians. The issue I see among my fellow Indians- standing as group on sidewalk talking very loud or shouting to hear each other. \nIrish people do not like this. It makes them hate us more. Also I work with Indians and there is bad smell problem from one guy and now he masks it with baby wet wipes because they were  good price in shop but I think that smell is worse.", "label": 0}
{"text": "Namrata Brar, writing for the Print, argues that India’s foreign policy has evolved into a shrewd balancing act, economically tied to the US while maintaining military relations with Russia. India, under Modi’s leadership, is hedging its bets, working with opposing powers without locking into any firm alliances. Brar suggests this new posture reflects India’s growing confidence and independence on the world stage, but questions how long India can juggle these relationships before it has to pick a side, especially as global tensions between the US and China escalate.", "label": 0}
{"text": "Your company is a glorified courier service. What is it about if not money.", "label": 0}
{"text": "😂😂😂", "label": 0}
{"text": "https://preview.redd.it/m204qphem2xd1.jpeg?width=880&format=pjpg&auto=webp&s=772c2eeffeda7425f98ca41eb7914d2a096a5b93", "label": 0}
{"text": "Well another case of glorified dehati behaviour", "label": 0}
{"text": "https://www.reddit.com/r/india/comments/1gbppwm/from_an_indian_to_an_indian/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button\n\n\nDo you think ^ might have something to do with what you're facing? Just be honest to yourself. ", "label": 0}
{"text": "he proved that we can use yamuna water instead of harpic. kills harmful microbes", "label": 0}
{"text": "He should also invite the entire Delhi BJP unit including the Governor next time.", "label": 0}
{"text": "you're in the wrong country mate. you cannot expect people to lose their money for another's life in a country where we have people stealing from accident victims", "label": 0}
{"text": "Because it’s a headline in India today?", "label": 0}
{"text": "You guys do know that resturant set the prices and not the platform, they(restaurants) just add the platform cut to the prices, and if they offer discounts even more.\nIf I sell something for 150 and swiggy takes a cut of 35% obviously I'll add it to the bill and if I offer 120 off obviously the item would be priced 330. It's simple maths.", "label": 0}
{"text": "Please take your leader Modi also with you next time.", "label": 0}
{"text": "Relieved to see sensible comments here treating the killer as a criminal rather than bringing his religion into this.", "label": 0}
{"text": "Are you fckn dumb or what. Yamuna flows from Hryana to Delhi then to UP. How is it majorly flowing through UP affects its pollution level in Delhi. And you can come to Yamunagar in Haryana and i will personally take to take to take a dip in river here and nothing will happen. Yamuna starts getting sickely polluted in Delhi and there are no two ways about it.", "label": 0}
{"text": "I mean, I'm from Delhi. When I went to my first meeting at foreigners office I took a small Eng-Ger dictionary.  This was in 2010s before app translators. Those people found it both funny and impressive. It all worked out well, but yeah without German it's not possible to get (official) things done in Germany.", "label": 0}
{"text": "He did what the french politicians were afraid to do and made their fears come true 😂", "label": 0}
{"text": "The should have taken the dip with the entire Party.", "label": 0}
{"text": "Which RAM ? 8 gb or 4 gb ? fictional characters me believe kroge rather than using rational thinking toh yahi hoga", "label": 0}
{"text": "The most plausible solution🫡", "label": 0}
{"text": "While the US is that only guy with several one night stands /s", "label": 0}
{"text": "The highlight was:\n\n>8400 INR parent orientation fee!  No parent will ever agree to even 20% of this for a Doctor's consultation.\n\nThis is so true.  Schools mostly get subsidised land, a lot of tax perks, but never shy away from plundering parents whenever they get a chance.", "label": 0}
{"text": "Employers/founders/CEOs who say \"it's not about about the money\" are too rich and just wants some idiot to make a so-called motivational line to drive poorer employees to clock a gazillion hours per week. Douche bags.", "label": 0}
{"text": "Nandan Nilekani gang looted 69000 crores of taxpayer's money for building useless aadhaar platform, thousands died due to starvation as they were denied ration due to aadhaar authentication failures.\n\nWhy should anyone else solve this problem?", "label": 0}
{"text": "Ending of every GF-BF affair.", "label": 0}
{"text": "Why death penalty isn't given in such cases is beyond my understanding.", "label": 0}
{"text": "Agreed ...... but what about PPL ahead of u. They don't move.\nGreen channel would be the best option", "label": 0}
{"text": "Rage bait?", "label": 0}
{"text": "The ICJ means nothing.\n\n\nIf it meant anything then every US President except for Carter would been convicted by it.", "label": 0}
{"text": "This is on the streets. Imagine what she'll do in the sheets./s", "label": 0}
{"text": "This is why my boss did the job posting, interview, and hiring decision, all by himself. The HR was only also supposed to provide the offer letter and help with onboarding. They sucked at that too.", "label": 0}
{"text": "There is only so much evil that one water body can drown. Let's divide it equally throughout the country so that one river doesn't take up all the pressure.", "label": 0}
{"text": "I have no problem with increasing gst on luxury goods and services. But doesn't the govt reduce gst on essential items?", "label": 0}
{"text": "RRR had some shit VFX compared to Hollywood", "label": 0}
{"text": "Hi, I live in Poland too. I am embarrassed of how my countrymen behave outside. \n\nI tell them I am Spanish and the treatment towards me then is very different.", "label": 0}
{"text": "Damn padh le bro itna tension mat le kuch nahi bigda abhi, kharab situation sabke hote hain mere bhi literally the jee prep ke time jab psychiatrist tak ke paas jaana pada, do that fix your mental health and get back to studying, ek drop sein koi fark nahi padta, just get the mental health support you need, maybe take a break for 3-4 days Or a week and get back to it, I'm sure you can do it, 1 saal nahi padhne sein tera potential khatam nahi ho jaata, bas is saal mehnat kar le and you will see nothing has changed, ik 11-12 th kaafi tough time hota hain iit jaane sein pehle ka time meri life ka saddest time tha fr but uske baad ka best time bhi tha, it's definitely worth it not coz the college is good or anything but coz success is the biggest booster of ones self belief, mere ko ko bhi bachpan sein bohot taane sunne padte the even though I was a very good student always kyunki dad nain UPSC first attempt main hi clear karke IAS banne the aur mere sein zyada padhte the even after growing up in a way worse situation than i did, but trust me iit jaane ke baad wo sab poori tarah band hi gaya, finally they think I'm serious abt my life and kuch na kuch kar lunga, and I'm sorry to say but India  parents mostly aise hi hote hain and success is the only way to shut them up forever", "label": 0}
{"text": "The 7th point is for real :/", "label": 0}
{"text": "Send him to a US prison", "label": 0}
{"text": "These fucking Indian news sites are so horrible! With their incredibly intrusive popups and ads! 😳 seriously it is an epidemic. I’ve only noticed it on Indian sites. Why are we like this 😭", "label": 0}
{"text": "Just turn government schools into English medium, our problem might be solved but the 'school lobby' won't let this happen. That's the sad truth.", "label": 0}
{"text": "Getting too close to western powers can hurt us not just among neighbours, but also in the whole of global south.", "label": 0}
{"text": "I want to see Mudiji, Amit ji and especially that duffer Nirbala do the same", "label": 0}
{"text": "I was a international tour manager with a reputed Indian travel company and trust me when we took our Indian tourists abroad they had zero common sense! \nWe had to teach them how to use the buffet spoons with the hand they don't use for eating in order to not soil the big spoon for everyone else \nWe had to stop people from washing their hands in the plates.\nIn south east asia the restaurants have signs that say \"DO NOT GARGLE IR SPIT IN THE SINK\". \nSCREAMING, SHOUTING AT SERVISE STAFF IS COMMON TOO. \nNeedless to say I quit this horrendous experience and walked away.", "label": 0}
{"text": "Hi, is India more committed to Quad or to BRICS? If push comes to shove (e.g. war breaks out between China and the US) and India has to pick a side, which side will it end up picking? Thanks!", "label": 0}
{"text": "70/80 LPA in India goes much farther than an above average IT product dev salary in Germany. The IT salaries in Germany are much lower than in the US. The same role in Amazon Berlin vs Amazon New York has a 3-4x difference in salary.\n\n\nGermany makes sense up to the point you're earning up to 20 LPA in India.", "label": 0}
{"text": "Well, Canada did just slash their visa / immigration numbers. But bottom line is that anyone visiting a foreign land should be aware of local customs and behave accordingly.", "label": 0}
{"text": "No amount of money if worth 80 to 100 hours a week. It will be beyond exhausting for any person.", "label": 0}
{"text": "Precisely, India can’t not. Not till it fixes some of the basic issues.", "label": 0}
{"text": "I mean doesnt take sorcery to tell you that Psoriasis is not contagious. Basic science. \n\nA little bit of empathy goes a long way but folks be like science pro max🤡\n\nYour nuts are in your head and your head is in your nuts with your level of reasoning😁", "label": 0}
{"text": "up up up up and again up...", "label": 0}
{"text": "\\>  Indians will greet others but as soon as they see you they will act as if you don't exist.\n\nThis is for good reason though. The other Indian will stare at you for no reason (especially if you are with non-Indian people), would want to go beyond a hello, and then violate your privacy by asking personal stuff, etc. etc.\n\nwho needs all that?", "label": 0}
{"text": "Idk bro, if you are being paid 50LPA as base, anybody would be ready to work 80-100 hours a week. Just need to work for few years then you can do whatever the fuck you want with that safety net. \n\nAlso, some people just like to work that much just because. \n\nIt doesn't matter that the productivity is going to shit because you work 80-100 hours but delivering work of 40 hours/week. \n\nI personally believe you cannot do focussed work for more than 6 hours a day, you do need a break if you want to go do that amount work again. Minimum of 4 hours break and then you can at it again.\n\nYou got your bag, pretend to work for 80-100hrs week but keep delivering work of 40 hrs, who cares.", "label": 0}
{"text": "I want all the bjp supporters to take a dip in the yamuna to prove haters wrong", "label": 0}
{"text": "I was being paid 50-55LPA and left that job because I was working since the time i open my eyes.\n\nNow I'm making barely 33Lpa and I work no more than 40 hours a week.\n\nIf I was offered 100 LPA, even then I wouldn't go back to my previous job. You can DM me for proof.", "label": 0}
{"text": "This is fine but why is India having misunderstandings with its neighbours like a married couple in a new colony", "label": 0}
{"text": "In terms of intelligence women are at par with men if not more .yet our society is the way it is... there's a plethora of anthropological reasons to support this.Only a slight difference in physical strength which was used to women disadvantages by men ....And about the love jihaad point...this girl has much better resources compared to a girl n 1800 ..in relative terms... better education,better opportunities yet she decided to blow it all away ..why because she was duped by this guy. And I am bringing this point because this happens again and again . You say all men are the same ...I say all abdul are the same ?? How come you are right and I am wrong ..women have been exploited by men i completely agree with you but if you guys won't utilise this opportunity..women will keep facing these issues again and again .", "label": 0}
{"text": "10 x 24 x 365 = 87600 people tried entering illegally in an year.\n\nAnd 90000 were arrested? 🤔", "label": 0}
{"text": "Good on you for prioritising your health.", "label": 0}
{"text": "Not a shocker anymore, it's UP", "label": 0}
{"text": "The Darwin Award design should include a selfie stick.  I literally watched a video once of a woman in Panama taking a tumble off a high rise selfie stick in hand and another where a dude in India got turned into boti while filming a TikTok on train tracks (using a selfie stick).  Not to mention numerous stories of people falling off cliffs and mountains trying to get selfies.", "label": 0}
{"text": "i have never once said “all men are same” because i don’t believe that. i said the ONLY pattern is men victimising women. i didn’t say all men victimise all women.", "label": 0}
{"text": "MP seems to have become worse or maybe reporting has become better", "label": 0}
{"text": "Yes adhar and nandan are bad. I can't argue. Anything else? \n\nLet's talk about how bad direct benefit transfer and banks are for rural India. Let's move back to good old System. Exclude 90% of the population from our banking system. Out of sight and out of mind.", "label": 0}
{"text": "Friendly fire", "label": 0}
{"text": "It’s the age of nonsense", "label": 0}
{"text": "India isn't a Western colony so what's the problem?", "label": 0}
{"text": "Indians are the most racist", "label": 0}
{"text": "The hurry to exit the plane as sson as it touches down.. man don't know why they are in such a hurry?", "label": 0}
{"text": "This is extra dumb.  People really underestimate how dangerous wild animals can be.  I lived in Alaska as a kid and my dad would have to carry a .44 magnum revolver when we would go out because moose and bears.  The moose could be even more dangerous than a bear at times especially if it was a mother and the calf was nearby.  They stomp and kick people to death all the time.  Thankfully dad never had to use it though he came close when a bear came into our campsite and started eating our food.\n\nI think a .44 magnum would just piss off an elephant though.  No way I’m playing around with untamed elephants or leopards. This is just asking for trouble.", "label": 0}
{"text": "I don't know who wrote this article. \nBut it's false. A fraud. Untrue.", "label": 0}
{"text": "This is what happens when you try hiring assassins on social media. Sasta mossad.", "label": 0}
{"text": "To whom were we married to before?", "label": 0}
{"text": "\\> I am sure that many indians dont consider an educated person to be insult\n\nDon't know where your surety is coming from, but the rising number of trash content creators (though a global problem, its multi fold in India), criminal political nexus, every work needing connections, bureaucrat worship which is only found in India to this insane degree, etc. are all clear signs that education does not have a mileage in this country. At most, it helps a lower economic class go one one level up, but even that advantage is fading (as salaries have stagnated compared to inflation, discounting 1cr packages offered to top IT engineers which is a tiny %).\n\nThis is the video, available a bare google search away: [https://youtu.be/v61zJDki2o8?t=67](https://youtu.be/v61zJDki2o8?t=67) . I don't think it needs a high IQ comprehension to note the typical low calibre slug fest directed at academics, with no sensical explanation or rebuttal.", "label": 0}
{"text": "I was denied home in Rajasthan to stay in rent because I am a Bengali. Happened multiple times.\n\nFound a Muslim landlady for a year or so.... then found a Sindhi landlord.", "label": 0}
{"text": "One would survive. Because he's non biological 💀", "label": 0}
{"text": "Omg the FIRST ONE!!!! How are you going to greet everyone but your fellow countrymen, where is the solidarity?", "label": 0}
{"text": "DBT does not need aadhaar, bank account is good enough.", "label": 0}
{"text": "\"You\" a was used in more of a rhetoric way ...like it's a prevalent norm so .  But apart from that I think you got what I was trying to say.", "label": 0}
{"text": "What the fk? Why is there an add for dollar shave club razor in this post??", "label": 0}
{"text": "Do you have any comments on RG?", "label": 0}
{"text": "We are just xenophobic.", "label": 0}
{"text": "A bank account without any identification or proper kyc  puts you on fatf watchlist. \n\nWe always needed something else than a passport. Adhar is not the best system. Buts it's much better then, passport, ration card and other things. \n\nIf bank account was good enough, without adhar. Why the fuck we didn't implemented it.", "label": 0}
{"text": "Step 1: someone post what they are going through on Reddit. (I think it was confession subreddit, don’t remember well.)\nStep 2: news media takes the story from there and post on their page\nStep 3: someone read the news and again post about the same story on Reddit\n👏👏👏", "label": 0}
{"text": "This reminds me of [this](https://www.youtube.com/watch?v=1nDrwh9iSag) video", "label": 0}
{"text": "Wait till they give you a verbal offer and then ghost you without no official confirmation/offer letter.", "label": 0}
{"text": ">Law should be made such a way that these situations never occur.\n\nYou are absolutely correct but I would say there isn't much problem in the traffic laws rather it is the lack of civic sense (as another person commented in detail).. both while driving and in general. \n\nEven if people give way to the ambulance.. the people behind the ambulance just tag behind it bumper to bumper as a way to escape the traffic , how do we change that mentality?", "label": 0}
{"text": "Understand what went wrong with the first relation. Work on things that give you confidence. Focus on health and fitness. Don’t rush to make things work, take time to reflect and improve.", "label": 0}
{"text": "You should consider a bout against Tyson. Atleast you will have a story to tell after that.", "label": 0}
{"text": "Yes that's also true. Indian people lack civic sense.", "label": 0}
{"text": "For the last sentence. Let me laugh out loud", "label": 0}
{"text": "Why did they send him to a modern medical practitioner? He should've gone to some lunatic who practices Ayurveda since Ancient Indian Kulcha besht. \n\nLive by your words sanghis.", "label": 0}
{"text": "1. Stop listening to parents. \n2. Stop obsessing about your ear, if it matters so much go get a cosmetic surgery \n3. Go date and meet people. Stop loathing. \n4. Chill out, learn to be yourself with or without company, do things that interest you, fill your life with things that make it meaningful and full for you before you go looking for others. \n5. Did I mention - be an interesting person who’s full of life - things will start rolling when you don’t chase things", "label": 0}
{"text": "So you hate Bengali men?", "label": 0}
{"text": "Yeah unfortunately reddit is used as a source at digital publications since such news tends to garner traffic and having on ground journalists isn’t feasible for it!", "label": 0}
{"text": "Don't give them ideas", "label": 0}
{"text": "She is in love with the Neta", "label": 0}
{"text": "ICJ mostly looks after inter state disputes and not these kinds of cases. What I understand from the reading of the case is Canada is not interested in enforcing accountability that they claim. Instead they are catering to a very vocal khalistani group by raising this issue frequently. Yes this is a botched up operation but friends do not behave like this. The issues are sorted with back channel talks like the one happening with  USA.", "label": 0}
{"text": "Sure buddy.", "label": 0}
{"text": "He should really put that suggestion to use and take a dip in the river. I’ll become his biggest follower if he does that* muxi di plz.", "label": 0}
{"text": "bro this was taken from reddit m you dont need to post again . wtf is happening", "label": 0}
{"text": "25L damn bro what did you study?", "label": 0}
{"text": "I think his comment is not ill intentioned, but the wrong place.\n\nBengali ladies get slut shamed, called kala jadu practioners, and people are being denied homes, and this dude goes oh I like the women. Odisha sub mei they used to make comments like Operatiom searchlight is needed in India also.", "label": 0}
{"text": "Yeah, I get agitated, and one more thing, Tell me about yourself, without even introduction of themselves. Like please have a professional courtesy and fucking tell me your name first.   \nAlso the video thing, its done to show that we are superior than you. I have seen it. They can start video but they wont just for sake of it. Just to make you feel smaller.", "label": 0}
{"text": "Kya sab hi is desh me chutie h? Ameer se le kar berozgar fakeer?", "label": 0}
{"text": "Nah . It is impossible to catch up with china. Forget about it. It’s almost like saying.. we need to catch up with America or Japan! \nNot gonna happen. Accept the fact. The best we can do is to muddle our way towards becoming a modern civilized society.. in our own way. It’ll be a long time until everyone is considered equal irrespective of caste/occuation/gender in our amazing country 🤮 .", "label": 0}
{"text": "And then the links to these news article gets posted on the subreddit to get upvotes, thus completing the cycle", "label": 0}
{"text": "Thanks you for your suggestion buddy. Really appreciate it. \n\n1. They are not forcing right now but I know they will in next few months and I know they are worried for me and don’t want to give them anymore stress. Coming from an orthodox family divorce was already too much of a stress for them \n\n2. I’m not concerned about the ear in-fact I’m very much comfortable with it and would never want a cosmetic surgery, I was just mentioning that it is one of the reasons for rejection \n\n3. This has been hard to do, as I’m an introvert guy and don’t have many people to approach around me as well. Also dating websites have not been useful \n\n4. I do enjoy my company and super fun to be around once I get comfortable with people, all my friends adore me a lot. It’s just that sometimes I have this feeling of being lonely and crave for someone I can be with and this happens specially during the festivals \n\nAnyways I’ll seriously consider your suggestions. Thanks again", "label": 0}
{"text": "its insensitive in a 3rd world dirt poor country", "label": 0}
{"text": ">I won't even go into the daily bigotry and abuse working class Bengalis in Assam are subject to\n\nLiterally more than half of our jobs are done by Bengalis. If Bengalis accept our culture, we literally have no problem with them. I have seen Bengali people getting treated like family here if they integrate well. \n\nThe thing is Bengalis who have recently arrived from West Bengal think that they are culturally superior to the locals and look down upon us.\n\nAny hate for them from the rest of the local population is due to historical prejudice and the government's inability to secure the rights of indigenous people.", "label": 0}
{"text": "Fuck this guy…", "label": 0}
{"text": "https://preview.redd.it/pzz29w47c3xd1.jpeg?width=230&format=pjpg&auto=webp&s=009eb03b14a546ba550e01b2fa356b0f884b3ee7", "label": 0}
{"text": "This mf should just stick to doing those Rajshree pan masala ads", "label": 0}
{"text": "Thanks for the advice. Really appreciate it. I had shared all my shortcomings with my ex wife on the very first day and she was okay with it however after marriage she started behaving differently and not just with me but with my parents as well which eventually become one of the critical reason for the divorce. Honestly I felt cheated by her because I had shared everything with her on very first day and she said she is the same person and is okay with it. I would have expected her to be honest with her feeling and if that would have been the case I may not have move ahead with the marriage as well. \n\nAnyways thank you for your suggestion will surely work on it", "label": 0}
{"text": "Why has this started jumping up his ass a whole 17 years after the film released?", "label": 0}
{"text": "I got home after 2 hrs of drive, and even on highways roads are so rough that back pain is inevitable", "label": 0}
{"text": "Who gives this letter? How to get it prepared?", "label": 0}
{"text": "Name Amit Shah you cowards. I dare you.", "label": 0}
{"text": "Thanks for your suggestion bro !! Really appreciate it. It’s not like I’m a saint, I’ve had those experience in my life couple of times post my separation however it doesn’t help with the feeling of loneliness and I crave for someone more afterwards so I feel like it is not for me !! \n\nI do understand that we fail at something but that doesn’t we cannot try again !! However I do appreciate the suggestions and will work on the other super helpful points mentioned by you", "label": 0}
{"text": ">rant\n\nIs yapping, need not come from anger\n\n>poverty is a big cause of these issues\n\nI keep saying money, education and general economic well-being are big reasons but of course you don't like to read.\n\n>poverty is a big cause \n\nSo you don't see the correlation between people acting and living like proper humans and not broke they are? Most sub Saharan African countries must be Paradise by your logic.\n\n>majority of people\n\nMajority? I live outside India as well and most of the Indians I see are decent people. Maybe it's your bubble that is not that great, \n\n>I never said everything you said is wrong.\n\nDon't backtrack now, you did say that.\n\n\n>Just some of it and the logic behind a lot of it\n\nI would ask you again to be specific but I guess you won't\n\n>yes, I have used some of your points but in a slightly different context.\n\nYou have used it in the exactly same context, pls.\n\n>try to prove it. So I’m really done engaging with someone who doesn’t really want to respect another’s opinion/ thoughts\n\nSee, if you ACTUALLY, went through my comment then you will find that the moment people say something sensible I give them the stage , I get to find out something new.\n\nWhat you and many others do is that you have a mental image of how things work and you are cherry picking scenarios that support them, if you were actually picking up on what others say, you would have addressed their points directly and elaborately. Just typing no you are not correct is a redundant response.\n\nNo go away little bug, scatter to the wind, I am done  with you too.", "label": 0}
{"text": "The example you mentioned about infertility no that still is not rape , sexual assault is if any acts were done to you without your agency or without you choosing them . Stealthing is rape because you are removing a condom and that act becomes a different act . An act which is different to what was said was performed on you . Rape on pretext of marriage or gifts is not rape , if it was it would be a law in most developed countries it is a more similar law to seduction which existed in victorian england .", "label": 0}
{"text": "Even better chemically castrate them. Many drugs are now available mainly to treat prostate cancer that result in chemical castration.", "label": 0}
{"text": "Anyone knows how to get excess tds refund?", "label": 0}
{"text": "This is a problem of India not just confined to a territory.", "label": 0}
{"text": "India has received as much aid as South Korea from the US in constant amount, and a lot more if you add the USSR during the Cold War and European countries.  \nChina's economy was litterally built on foreign investment and technology transfers from Western Country (cf. Apple, high speed rails, aeronautics and the automative industry).", "label": 0}
{"text": "She should have sucked his dick instead.", "label": 0}
{"text": "Hahahahaha", "label": 0}
{"text": "Even Switzerland can’t act like Switzerland anymore\n\nhttps://www.swissinfo.ch/eng/foreign-affairs/european-nations-snub-swiss-made-weapons-over-ukraine-restrictions/87599015", "label": 0}
{"text": "It’s not about the money for the employees while having net worth of millions 🤡🤡", "label": 0}
{"text": "Split in 4 meals , more meals more calories to digest food itself for fat loss", "label": 0}
{"text": "France had only tie breaker by lottery, and even that was called \"dehumanising\". Though that tie breaker had to be applied quite a lot - but at 3% it was not enormously likely.\n\n\nhttps://www.timeshighereducation.com/features/french-university-admissions-creme-de-la-creme\n\n\n\n\"Adding to the sense of injustice was the revelation in 2016, after a long legal battle for transparency, that a lottery was being used to break ties between applicants. In reality, few actually lost out because of the lottery system: by Grenet’s calculations, only 3 per cent of students who applied to oversubscribed courses failed to get their first choice owing to bad luck in the draw. Still the “unjust” and “dehumanising” lottery system was seized upon by the government when it unveiled the Parcoursup reforms last year.\"", "label": 0}
{"text": "Not sure how can I reach out to Tyson !! Any suggestions would be super helpful as I do love to tell a story or two !! \n\nAppreciate the help buddy !!", "label": 0}
{"text": "Done", "label": 0}
{"text": ">Operatiom searchlight is needed in India also.\n\nYes I've seen those comments, yuck actively wishing genocide on your own people 🤢\n\nThey even called Bengalis as Bangladeshis who never left", "label": 0}
{"text": "The first para makes a lot of sense, I agree, although the strongest form of these behaviors are seen in the north as most of the Indian population is in the north. I am from Karnataka and have lived across the entire country, new state every two year, and people are pretty much the same everywhere. \n\n>education\" etc will only strengthen this problem\n\nRich get richer, makes sense, but is there anyway of changing how the weaker sections of the society get some say in the conversation, an accessible education is one, a means of income is another, I feel a India is skipping from an agriculture based economy to a service based one where as most countries went through an intermediate stage of manufacturing. Maybe small and medium sized industries could be the way the weaker sections could get some money, freedom etc.\n\nBut then thinking about your argument, the rich folks will be the ones controlling everything, taking the biggest junk of profit. And we are back to square 1", "label": 0}
{"text": "Bro just copied Abhijit Chavda's speech word for word lol.", "label": 0}
{"text": "Left a review as well.", "label": 0}
{"text": "Relevance aur footage ke khatir koi bhi chootiya shor macha sakta hai. Nothing new, ignore maaro.", "label": 0}
{"text": "You don't need a scientific basis to know they smell\n Your nose is enough. Lol", "label": 0}
{"text": "understand the sarcasm bro", "label": 0}
{"text": "Bayaan ❤️❤️", "label": 0}
{"text": "Stealthing is completely different so is rape my deception laws across countries . Rape by deception is when some act was promised but something else happened . Stealthing changes the act completely promising rewards like marriage  does not .", "label": 0}
{"text": "Fuck almost all of the business owners and employers.", "label": 0}
{"text": "Capital punishment should be given to all rapists. No lengthy court cases and all. Once proved, hang them, shoot them, whatever comes under capital punishment but do it.\n\nOnly then these animals will fear.", "label": 0}
{"text": "Vilest Indian sub by a distance. Even the most fundamentalist subs (right or left) well have some semblance of balance or atleast some humour.\n\nOdisha sub members just call for genocide and some guys there straight up celebrated the killing of a vegetable seller who was a bengali hindu.", "label": 0}
{"text": "https://preview.redd.it/rdlga0d2f3xd1.jpeg?width=1170&format=pjpg&auto=webp&s=e0f00bc9bca559dd3a0bc8a49d4e0210bc3ac9d8\n\nNever gonna use Zepto as the founder doesn’t care about the money. Why give money to someone who doesn’t care about it.", "label": 0}
{"text": "Abhi neendh se utha hai banda..", "label": 0}
{"text": "And how exactly is it benefiting the country? The goal of our foreign policy is expressly to benefit the babu-billionaire clique and to perpetuate their rule over this country. Apathetic clowns who deliberately choose to remain ignorant are the reason why India continues to be dirt poor despite seven and a half decades of independence.\n\nhttps://preview.redd.it/youyiuqef3xd1.jpeg?width=1600&format=pjpg&auto=webp&s=e3172e593b9a50ec667c06b2b298aafcaecdcc43", "label": 0}
{"text": "Fastest suckup in the west. Record holder, unbeaten.", "label": 0}
{"text": "OP I'm sorry. I'm sorry for what you felt because of a man whose life is not worth a penny. Sorry you have to live in fear. Sorry about how you feel being born a girl in this country.\n\nI being a man have never felt this helpless.", "label": 0}
{"text": "How long has it been after the divorce? Tell your parents to stop worrying and be firm about it. It is your life and only you must decide.\n\nAlso don’t rush into relationships and I understand it is hard to live alone. Remember that not to settle for anyone just because parents want it or you feel lonely. Mental health must take priority.\n\nGo out, join groups, learn new things and keep yourself busy. \n\nIt will work out just fine. Good luck!", "label": 0}
{"text": "I replied with sarcasm too. What's the issue now. 🙂", "label": 0}
{"text": "BRICS is not a military alliance. It is solely confined to the economic sphere.            \nThe QUAD has, at times, appeared like a precursor to a military alliance but is still not one.        \n\nAnyway, if a war does break out between the US and China, we would remain neutral as has been our long-standing foreign policy since the non-aligned movement. Our sympathies would most likely be with the US though, since we have our own issues with China. US-Russia will be more complicated though we would still be neutral.", "label": 0}
{"text": "Well they will not tell that's man name so that we will not criticize his religion, if he was muslim then they will write headline , muslim man raped a minor \n\nGoverment also try to manipulate things for their benefit and so that we have a image that a poor person or a muslim or from some other religion or caste are bad", "label": 0}
{"text": ">So it’s safe to conclude that education or income has no bearing on a persons character.\n\nIf money, purchasing power, economic well-being, education, and by extension general welfare, social safety nets, etc have nooo bearing on a person's character then do tell me what does.\n\nplease don't tell me you have not seen parents who are struggling financially not taking care of their children, but of course you must have a plethora of actual reasons, do share.\n\n\n>foreign country with completely opposite culture and etiquette. \n\nHave you stepped outside of India? People are just as bad everywhere, there are more Indians and so just by simple stats , even if the same percentage was doing random shit, it will feel like a lot more people.\n\nSorry for the sentence structure, I randomly open reddit while traveling and just type things on the go.\n\n>Such a classist and elitist mindset.\nHow is what I am saying classiest and elitist?\n\n\n>Lot of the people who I’ve seen are well off/ educated and still show absolutely no civic sense\n\nSo a subset defines a norm? Weak math skills?", "label": 0}
{"text": "I'm yet to see or experience the bhodrolok community of Bengal, it's yet another caricature from the past. Firstly educated people tend not to stay in Bengal for long to form a tight knit community, secondly even if they are employed here they do not have any social influence since all social influence has been limited into the hands of political classes and the last remnants of bhodrolok society died away with the communist party so I dunno what fiction are you talking about ? \n\nThe only influential group of people left in Bengal are the ones aligned with TMC and it has been that way for over a decade now", "label": 0}
{"text": "I do under these reasons as I have been through so many interviews and that is why I said it's the least annoying when they ghost you in the initial stages. But there have been instances where HRs have been unreasonable.\n\nFor example the recent past 2 interviews. Both were interviews on video calls (Google Meet). I was asked to turn on the camera while they kept their cameras off. Isn't that disrespectful? Who am I talking to? What am I a show piece for you to look at before you hire?\n\nOne instance in the early days , they discussed the salary with me after 2 rounds of interview and then I called off the rest of the interviews because it was obvious I was being selected . Then boom no contact for the next few weeks no reply to mails and texts. That's how I knew I was not selected 😊\n\n This kind of behaviour has absolutely no explanation other than HRs have stopped considering candidates as humans as you said. That's sad as a candidate and that's why this is a rant 😞", "label": 0}
{"text": "I think education sector should be heavily controlled by states. They should introduce tiers based on faciltes available and tell them how much you can charge for the school. If you want to open a school you need to pick a tier and charge exactly the same amount the government specified and earn profits government want you to earn.\nGovernment should also ban price increase based on demand.", "label": 0}
{"text": "I don't think you would have got that either", "label": 0}
{"text": "Thanks for the advice buddy !! Really appreciate it. It’s been one and half years now since we are separated and my parents are okay right now but I know they will start to stress out by the time I turn 34. So I know I have max 1 year to find someone who understands me !! \n\nI don’t want to rush into marriage rather want to meet someone and have a relationship organically so that both the person would know what they are getting into. \n\nThanks again for your suggestions! Really appreciate it", "label": 0}
{"text": "No, it's from BJP.. that's calculated master stroke reimbursement... Not rewadi..", "label": 0}
{"text": "That's weird AF 😂. But thankfully everything was in your favour.", "label": 0}
{"text": "I am from Bihar and it happened to me in Bengaluru", "label": 0}
{"text": "Disgusting lot, I'll keep reporting the sub to reddit", "label": 0}
{"text": "Tbh The chak de india was such a Gem, if you think about it this actually happens in our country, that people judge anyone based on some gestures only and accusations from media with a \"?\" ( as described in sanju), as A sikh I can relate, \n\nAlso that wasn't the only message, love the country, the team spirit, sportmanship, there were a lot of messages,\n\nI am gonna rewatch with my family", "label": 0}
{"text": "Pack your bags and come to India.", "label": 0}
{"text": "Yes I've done that. I don't know what I was expecting but didn't receive any fruitful reply. I just wanted to tell him, hire better HRs or your company will be left with no employees 😂 but it was LinkedIn so I couldn't.", "label": 0}
{"text": "Yes, you can get away with paying the local (instead of foreigner) prices at attractions and stuff.      \n\nMoney depends on your itinerary. But you can consider getting something like a WISE card with which you can save on currency exchange and fees even in ATMs. I think you have a few more similar options in the UK for such cards.", "label": 0}
{"text": "They did.  Lived for a couple of generations in the Caribbean/Suriname, and some of us moved to the Netherlands. Some of us also returned afther university,.\n\nThe Indian diaspora is bigger and older than a lot of people know. If you are interessed, you could also read about Mauritius or Fiji Islands.", "label": 0}
{"text": "We also need to do a same with their cricket team 😀 but ....", "label": 0}
{"text": "wrong sub..err wrong place to ask such questions go to an expert", "label": 0}
{"text": "I feel the exact same and the thought itself is depressing. We were a lot happier and peaceful nation earlier", "label": 0}
{"text": "Or marriage", "label": 0}
{"text": "You need to move rout and have your own place. \n\nParents deserve respect but you need to have your own life. \nMake your own wrong decisions. Don’t let anyone make right decision for you.", "label": 0}
{"text": "Okk thanks", "label": 0}
{"text": "Why would china attack india. They would not risk an all out war against such a large country. I mean they are already getting what they want from India. Our dependency on their products is just too much. Our mla and media might trash china on their debates and shows. But the reality is that we are under China's thumb when it comes to trade and international tactics. Even our own Pm denied the fact that china ever invaded galwan valley. When though his own godi media were broadcasting the clash between Chinese and Indian forces. Coming to the west we are only important to them because of our population. India is consumer heaven for the rest of the world. it's like those youtube videos that put the Indian flag in their thumbnail when their video has nothing to do with our nation. Because it brings them engagement.", "label": 0}
{"text": "This point is said by almost everyone who understands Geopolitics. \nNoob.", "label": 0}
{"text": "Guys, forgive him. He's about to double-triple the salary of all employees in Jan 2025 cuz it's not about money", "label": 0}
{"text": "I'm afraid to even ask, what do you consider shocking.", "label": 0}
{"text": "That's like a good 70+ % of the population innit?", "label": 0}
{"text": "Meanwhile New Zealand beating India at home for the first time ever", "label": 0}
{"text": "You think scoring cheap oil and juggling defense deals is some masterstroke of foreign policy? That's like calling it a win because you found a bargain at a *thela* that is on fire. Whiel we're busy patting ourselves on the back for playing both sides, we are also shielding people involved in international messes like the Nijjar murder and the Pannun attempted murder case. And guess what? That's going to cost us.\n\nWe are taking American investments, their technology, their intelligence but continuing to hobnob with autocrats like Putin and Xi. Sure, Russia's the \"old friend\" but back in Indira Gandhi's tenure, the Soviets had us under their thumb. Now we've got China engaging in naked aggression on our borders as a stick to prevent us from leaning too much towards the West. \n\nThe end result? We are stuck in a protectionist rut, keeping foreign investment out which we desperately need to deal with unprecedented levels of youth unemployment in this country. All of this while at the same time ensuring the same babu-billionaire clique stays fat and happy. This isn't some diplomatic coup - it's PR and propaganda, plain and simple. It's a short-sighted, self-serving policy dressed up as \"strategy\".", "label": 0}
{"text": "Death for rape is the solution", "label": 0}
{"text": "Man, our nation has gone to the dogs seriously. Civic sense 0, women safety 0, education levels 0, infra mostly 0, doctor's safety 0, quality of living 0. I can make a damn post highlighting all issues, but similar posts made every day. If you have hefty money, you live your fullest, or if you have nothing, govt. helps you survive to some extent. Middle class folk like us are only vote and tax giving liabilities.", "label": 0}
{"text": "As a sign of protest he should ask all his party members to take a dip in it.", "label": 0}
{"text": "It's not out yet because the investigation is ongoing dipshit. You dont release the evidence before the investigation is complete. The time will come.", "label": 0}
{"text": "You didn’t understand my comment. I didn’t mean they accept them .", "label": 0}
{"text": "This is what you get when a country is run by a bunch of religious extremist zombies for a decade. Not that India was an eutopia pre-2014 but at least the country was growing and on the path of progress.", "label": 0}
{"text": "How dare they? don't they know its not allowed in Hindu rashtra.", "label": 0}
{"text": "The opposite. Indians worship foreigners ", "label": 0}
{"text": "Seriously do your research before bringing mental health into this. I think societal structure and culture has to be blamed.", "label": 0}
{"text": "i just hope its not superficial friendship", "label": 0}
{"text": "We are not dirt poor because of our foreign policy , China has always been hated by the whole world and it’s population is similar to ours yet it’s richer then us . We are poor but it’s not because of our foreign policy , it’s because of several other factors such as colonisation , lack of good economic policies , corruption , uncivilised people etc .", "label": 0}
{"text": "Just shut up🤡", "label": 0}
{"text": "you're not working class though?", "label": 0}
{"text": "Yeah like the younger gen is getting more and more exposed to the harsh ground realisties by social media channels and creators. And its good!", "label": 0}
{"text": "abhi abhi paida hua hai lagta hai", "label": 0}
{"text": "Dude! I replied to the guy who asked me what needs to be cut off! Not everything is a joke!", "label": 0}
{"text": "Own path to what?", "label": 0}
{"text": "> If Bengalis accept our culture, we literally have no problem with them\n\ncultures are entirely interlinked, Bangali culture has existed in Assam for hundreds of years.\n\n> The thing is Bengalis who have recently arrived from West Bengal think that they are culturally superior to the locals and look down upon us.\n\nyes Bongal Kheda happened because of modern day Bengalis moving from West Bengal, not because of virulent bigotry manifesting itself through pogroms - totally.", "label": 0}
{"text": "actually hilarious", "label": 0}
{"text": "Fr bro my dad was talking that you don't have single idea how things work in real life, I was living in a bubble finally the bubbles burst and here we are", "label": 0}
{"text": "Who would we need help against ? We have a friendly relationship with USA , China and Russia . Pakistan and Bangladesh are just too weak to even put a scratch on us , I don’t even need to mention about other neighbouring countries . \n\nAnd even if China attacks us , the world will have no choice but to help us, since China and Russia are the major enemies of the whole world and they can‘t risk losing India to China .", "label": 0}
{"text": "Came here to comment, but I am speechless!", "label": 0}
{"text": "Damnation", "label": 0}
{"text": "This is ultimate level oligarchy 🐱", "label": 0}
{"text": "The problem is when BJP actually did some good I am not saying it did exceptional but it did better but now it's the same the problem is with freebies, reservation pan masala gutka and all this shit people think congress would have made it any better nope they were going or increase reservation and the freebies money would be crossing the 5 lakh crore mark and don't take my word for it the money spent on just the khata khat scheme would be about or over 3.5 lakh crores this was asked by Ganesh in think school podcast from Shashi Tharoor and don't forget the farmer loans waiver reaching 1 lakh crores soon and all the other shit show of freebies so we just live a shit hole of a country and its the fault of the population for giving vote based on caste politics, reservation and freebies", "label": 0}
{"text": "Cough = Covid eh? Cough then get fitness certificates?", "label": 0}
{"text": "Nope that is not people attitude. It’s still “few” people attitude let me remind you that. And government is made for the people, it is their duty and responsibility to bring good changes. Its government and slow judiciary process and here i think what you meant by people is “uneducated religiously influenced people”.", "label": 0}
{"text": "Two different topics wrt the post you have made. Have you even read the article you have posted or you are blindly ranting ?\n\n> In this new world with no permanent friends and no permanent enemies, how long will India be able to keep its many friends despite ideological divorces? Whom India chooses in crucial moments will say more about its real feelings than membership blocs. It might not be a catholic marriage, but it will not be short of a long-term commitment. And if India does manage to remain neutral, it will achieve what no country has successfully done in the post-World War II era.\n\nThis is the gist of your post. Not Geo-economics of scale wrt India. \n\nIf you want to argue about geo economic policies of India make a separate post I’ll debate you on that.", "label": 0}
{"text": "The system is designed to nurture a country of cheap labour, those who can do sir sir sir all their life", "label": 0}
{"text": "About loan waivers,  majority of farmers are below poverty line and can barely survive.  Where do you think they will bring money from to pay loans.  \nAs for freebies, this govt taxes us like crazy and it becomes their duty to subsidize services for us but they are busy in subsidising another money laundering venture of their favorite industrialist.", "label": 0}
{"text": "Once a sector or industry is cornered by politicians and government office holders ( even government teachers and principals) no regulations or legislation is going to pass against them. Just look at real estate", "label": 0}
{"text": "No I don’t expect a nurse from backward community to be a grammar nazi. Contrary to your beliefs proper English grammar comprehension isn’t a criteria to become a nurse in India.", "label": 0}
{"text": "It's called having strategic autonomy. We cannot afford to follow the non alignment policy. India is doing a good job in enhancing its network of alliances.", "label": 0}
{"text": "'It's not about money'. Dear investors, thanks for your donation.", "label": 0}
{"text": "I’m responding to a comment on this thread. I also believe this topic is connected directly to the article in question and India’s foreign policy of “all alignment” or multi-alignment, or non-alignment or neutralism. Why don’t you restrict your deflection and gaslighting tactics to your government office premises?", "label": 0}
{"text": "Kindly change the sources of your news analysis. ", "label": 0}
{"text": "Japan may not be the best example in this context.", "label": 0}
{"text": "I totally agree, that's why I have migrated to the USA. No fear, no pollution, no corruption, great education, a class infrastructure.", "label": 0}
{"text": "Boo hooo cry me a river. \n\nPartake in civic society groups to bring forth your concerns instead of ranting on internet. \n\nGovt hospitals were free last time I checked. \n\nMove to a better country if you have the means.", "label": 0}
{"text": "Absolute stupidity. Zomato is a business in a free economy. They are free to price their products how ever they like. Don't like the prices, don't order.", "label": 0}
{"text": "Bangalore but currently in my hometown.", "label": 0}
{"text": "If this “strategic autonomy” means protecting the babu-billionaire clique, while the rest of us eat grass, count me out.", "label": 0}
{"text": "I would say white men they worship. Women they assault.", "label": 0}
{"text": "kokil bolo to , by makhan lal chaturvedi", "label": 0}
{"text": "Reading these posts just reminds me that the best thing a person can do is leave this shitty country", "label": 0}
{"text": "Retailers will be seen holding the bag after the IPO.", "label": 0}
{"text": "How can you say it is a beautiful country when there is so much trash in the streets? It looks like a dump. It has the potential to be beautiful, but citizens do not care about their environment.", "label": 0}
