{"text": "do check out r/IndianIndieheads if you wanna support and explore indian indie music", "label": 1}
{"text": "Come to Seattle, and visit the South Indian restaurant there... Eating Sambhar Rice with hands, while liquid flowing till the elbow.  Thats the reality.", "label": 1}
{"text": "I agree with most things you've said.     \n\nBut it doesn't really take Sherlock Holmes to guess that you're Indian (or at least spent a few formative years in India) because you use quite a few Indianisms in your language. It has nothing to do with the cultural stuff you bring up.", "label": 1}
{"text": "Why are u here! whats ur goal? We are a high population density, low income, son of the soil country who will not change for westerners and their drama.\n\nReduce ur income and live in Indian middle class conditions and lets see ur best practices then.\n\nYour countrymen are highly racist, self opinionated, low skilled creatures who pride themselves for killing innocent afghanis.\n\nIf u dont like us, walk away!. We are changing but slowly but will never emulate ur lifestyle practices. For u even eating with hands is horrible and for us your washing ur ass with a piece of paper is unhygienic.", "label": 1}
{"text": "(1) Cos we're aware of these issues, we don't need a foreigner to point them out to us. We're not stupid & you're talking to us as though we are. It's incredibly condescending, so you're rightly getting downvoted. (2) You don't go to someone's country & rant to the people there about everything that's wrong there, it's rude. Nobody forced you to come & nobody's forcing you to stay. You can leave if you dislike it so much. There's definitely a reason why you're still here, why don't you talk about that? (3) Do you have any actual solutions or do you expect us to clap for you just for pointing out our problems (which, as I've said above, we are aware of, don't need a foreigner to point them out to us rudely)? You are really so unaware of how you come across.", "label": 1}
{"text": "Internet pe Australian ban ne ka natak band kar aur padhle bc.", "label": 1}
{"text": "Can’t agree more. This thread is filled with ‘I live in UK/Europe/canada’ etc and I hate my fellow Indians. Kinda sad. This actually has more to do with the poor immigration policies of those countries that just admit anyone and now these guys just stereotype all Indians. I personally live in San Francisco Bay and Indians are highly respected here. We contribute so much to the society and are in the top positions in most tech companies. There is more to being an Indian than what is being portrayed in this thread.", "label": 1}
{"text": "Defend karna hi abhi bandh kardiya hai\n\nWe know it's a shit show", "label": 1}
{"text": "Goa or kerala is good", "label": 1}
{"text": "Absolutely nothing good comes out of these kinda relationships.", "label": 1}
{"text": "And the boyfriend had fake name and entered into the relationship with the girl.\n\nPS: News channels should hide the face of the victim..", "label": 1}
{"text": "There is no way a clean politician can have such a big spike in assets YoY. Every politician aims to be a politician only for this not for doing good work. Also ato answer the why no one cares because no one cares to stop the cycle. It is an endless loop with no way out. The same reason govt jobs will never stop being attractive, the same reason a single politician will keep receiving multiple pensions, the same reason taxation will always be a mess in this country.", "label": 1}
{"text": "Compared to the proportion of the population peaceful people don't really seem peaceful do they", "label": 1}
{"text": "Luring them by killing? Do they want new souls?", "label": 1}
{"text": "No they get support bcoz they only show cases where perpetrators are muslim and focus is on them being muslim.", "label": 1}
{"text": "The usual suspects", "label": 1}
{"text": "Ye mulla tha name badal rakha tha isne", "label": 1}
{"text": "Mera abdul alag hai 💀", "label": 1}
{"text": "It arise bcoz news of cases where a Muslim is culprit is only shown and him being muslim is the focus, sad that you believe India where attacks on women are so common you believe only one community is doing such crimes. How will India solve these issues when youth have no logical thinking. \n\nHere the commentator uses a case and brings another topic of women social movement into this and indirectly applying that women choices shouldn't be their and that it will have \"consequences\" if they are given same freedom as men bcoz why work towards stopping crime against women when you can easily take away their freedom.", "label": 1}
{"text": "I'm sorry, but are they saying he was Muslim in the headline? I've seen so many cases like this that, I hate to admit, the first thing I thought was that he might be Muslim. That's how frequently these kinds of cases seem to be happening.", "label": 1}
{"text": "No dont say that some relationships do succeed. Idk whats wrong with North Indians especially Delhi.", "label": 1}
{"text": "Where all the usual suspects stuff", "label": 1}
{"text": "Reminder girls don't go for the bad boys. Never comes anything good out of it.", "label": 1}
{"text": "In Jharkhand too, muslim men lure tribal women using fake identity.", "label": 1}
{"text": "Its the lawless barren land. anything goes in norht", "label": 1}
{"text": "now I'm sacred of Delhi guys ", "label": 1}
{"text": "Sex education? This would have ended on a bad note even without pregnancy. Relationship between muslim and a hindu girl World never with forever.", "label": 1}
{"text": "Yeah but atleast she would have igured out what his real identity is on the first night itself", "label": 1}
{"text": "Every 💩jeetni that goes with M guys and gets k!lled deserves it", "label": 1}
{"text": "I am a 💩jeetni I hate Hindus and india now I am killed by Muslim terrorists now sapot me", "label": 1}
{"text": "Hmmm so another case of a muslim faking his identity to portray himself as Hindu to trap a girl and later killing her. I have heard this story somewhere, oh now i remember its usually the same story with these boyfriend murder girlfriend newses.", "label": 1}
{"text": "Circumcision happens in Hindu too due to infection or other issues. My doctor friend told me, it's quite common surgery now.", "label": 1}
{"text": "Name is not mentioned... Minority se nahi hoga.", "label": 1}
{"text": "Confirms are over 98% effective in preventing pregnancy when used correctly & consistently.", "label": 1}
{"text": "Let me guess the guy is NOT Muslim, otherwise this news would have flooded Twitter.", "label": 1}
{"text": "Yeah but atleast someone in the family would know that ghost can't make women pregnant.", "label": 1}
{"text": "Bro I aint defending murder I am saying that men in a relationship should have the option to exercise their own consent .", "label": 1}
{"text": "What do you mean by consent here? He obviously said no to marriage. He could have just broke up with her, but continue to pay child support. Where was he forced?", "label": 1}
{"text": "Again I am not talking bout the post but the comment . Sidenote do you think having sex under false pretext of marriage is rape ?", "label": 1}
{"text": "Don't know if it's true but I just read many articles and he was a muslim", "label": 1}
{"text": "Ofcourse with population over 400 crores they shouldn't be considered a minority at all.", "label": 1}
{"text": "You have the option to wear a rubber", "label": 1}
{"text": "Child support exists , if they have a child the parents should give child support to raise the kids that is what happens in civilised countries . If you keep supported uncivilised practices the country will never get civilised .", "label": 1}
{"text": "Been living in Europe for a while now and it's really sad to see how you can differentiate whether a guy is Indian or not just by the attire. Flipflops and other clothing choices, no sense of grooming, weird behavior in public, stink when there's a gathering, disturbing peace in a foreign country for their own cultural celebration (you can do it without bothering others). \n\n\nMy fellow country men and women convert whatever they touch to the shit hole they left. ", "label": 1}
{"text": "Y’all just cant handle facts", "label": 1}
{"text": "lol no one said men can’t break up, just they’re responsible for any children they father—and that murder is bad.", "label": 1}
{"text": "Well then we completely agree good day", "label": 1}
{"text": "Not sure if it's technically rape. But definitely predatory behaviour from the man.", "label": 1}
{"text": "Well I pray one day you dont fall victim to your own stupidity then .", "label": 1}
{"text": "Sanju  a.k.a \" SALEEM\" . 😅 He used alias of a typical hindu name. Who even he might even had hidden his identity initially from girl .", "label": 1}
{"text": "It’s slut behaviour but definitely not criminal in any other country than ours at least . Predatory behaviour means taking someone’s bodily autonomy assaulting them .", "label": 1}
{"text": "What's the point that you're trying to make, my guy? Please re-read the article and my comment and try to understand what I'm saying.", "label": 1}
{"text": "1) its still just like you described a creep and predatory . Its like someone planning to murder someone and stalking them \n2) two cases are exactly the same showing false love using someone then cheating on them . Hope this clears it . Morally wrong and predatory are not the two same things . If a girl lies about , makes promises she will break to get into a relationship with someone it is being a playboy . Same with the guy . You did not explain also how these two are different .", "label": 1}
{"text": "Okay, so according to you it's not predatory behaviour. I don't think I need to have any more discussion with you. \nAnd about the second point, morally wrong is cheating. Predatory is falsifying to get into a someone's pants, could be a boy or a girl or any other gender too. You don't know the girl's side of the story at all, and you're just trying to make the argument based on this. Being a Playboy is completely different from the argument I was trying to have. \n\nBut I don't think you're understanding the points I'm making or want to understand that what you're thinking is wrong and lying to someone about marrying them just to get into their pants is wrong. So good day, dude.", "label": 1}
{"text": "Getting into someone’s pants using false promises of love or marriage is not predatory behaviour . A girl can lie about her body count , cheat on someone , and then lie but it still wont be predatory behaviour at max it is fraud . Hope this helps to clear you up .", "label": 1}
{"text": "First of all, You're making the argument about a girl lying about her body count, cheating on someone and lying but a guy can do the same thing. But you're dead set on pinning it on a girl. That's completely different from lying to get into someone's pants irrespective of them being from any gender or sexual orientation. That's predatory. Completely different things. \nHope that clears it up for you. Good day, sir.", "label": 1}
{"text": "I am instead defending the girl here , a girl lies on her body count , her cheating , she promises to stay with him marry him yet cheats him and dumps him to stay in a relationship with the guy, its cheating , the guy does the same it is predatory behaviour ?", "label": 1}
{"text": "What \"common connection\" are you referring to?", "label": 1}
{"text": "It's not cheating. It's morally wrong. And it's morally wrong irrespective of whatever gender does it. \n\nIf a guy just wants to get into someone's pants and just wants to have sex and leave, then that's predatory behaviour. Hope the difference is clear. \n\nAnd I'm sorry for whatever happened with you. It seems to have hurt you deeply and left a deep scar and I'm really sorry for that man. But don't let that make you hate things in life.", "label": 1}
{"text": "If a girl just wants to have a hookup for one night and then leave and in order to do so or maintain the relationship for sex she is lying to him ?", "label": 1}
{"text": "What do you mean? Your point isn't clear from what you've written, but I'll try to explain as per what I understood. \nHook-up is completely different. If you want to hookup with someone and you tell them and they're ready for it, it's fair. It's their choice. But if a girl or a guy or any gender lies to get into someone's pants and just have a hookup and leave, that's predatory behaviour.", "label": 1}
{"text": "So if someone lies about loving someone till all eternity , or staying with someone forever in order to maintain a sexual relationship with that person , and then leaves it is predatory behaviour ? Right got it lmao . If someone says I am forever yours to impress someone and get into a relationship with them but later leaves its predatory ? Not cheating ? Well yeah of-course it is.", "label": 1}
{"text": "Lying about living with someone and later going out with another person while being in a relationship with someone else is cheating. Lying to someone with a false pretense of marrying is predatory. And this is the last time I'm going to type this, so if you're gonna repeat the same thing again and not gonna read what I write, then I will no reply to you. \n\nBro, keeping this aside, I don't think you've processed whatever happened with you in a relationship. I think you might need to process it and go to therapy and talk about this and let it out. It's all turning into anger inside you and it won't help you in any way. I really hope you can process all your feelings and emotions. I've been there too.", "label": 1}
{"text": "Unique Diwali Celebration in India #diwali #diwalicelebration #indiafestival #ytshorts #shorts\n\n[https://youtube.com/shorts/2Kqq63Okmmk](https://youtube.com/shorts/2Kqq63Okmmk)", "label": 1}
{"text": "Twisting my words? Cool. \n\nOkay dude. No point in arguing with someone who's got no interest in understanding or changing their point of view or thinking they might actually be wrong. So have a good day, my guy. 👍🏿", "label": 1}
{"text": "No. On the contrary on the personal front I am doing fairly well, concerned about the place where my kids will grow.", "label": 1}
{"text": "> Why did he have a hindu alias? \n\nThere are many nicknames that are common across religion. I know a Hindu and Muslim 'Pappu' for example. There are many muslim Sanjus. Google 'Sanju khan'. Or see this guy, Mohammad Sanju Islam:\n\n> https://scholar.google.com/citations?user=IAQjnk4AAAAJ&hl=en", "label": 1}
{"text": "context: the boy is muslim , he deceived her , he told her he is Hindu , basically another love jihad case", "label": 1}
{"text": "lol, the boy who killed her is Muslim his name is Saleem\nhe first told her he is hindu(used Hindu name sanju) later she found out", "label": 1}
{"text": "It's because Muslim boys tend to be involved in most of these cases. And it's not imagination.", "label": 1}
{"text": "It will be a bloodbath", "label": 1}
{"text": "chutad the aur tum chutad hi rahoge , bahut saare cases jaha Muslim Hindu name use karke ladkiyo deceive krta hai\npoora subreddit tum jaise chutado se bhara pada hai", "label": 1}
{"text": "to be honest. most of these problems are North Indian issues, for instance in Bangalore the infrastructure is far more better, pollution is somewhat low, healthcare is better, education is better. only the tax is high as it's a country wide problem.", "label": 1}
{"text": "lovejihad exist , but dumbfucks will not understand", "label": 1}
{"text": "You can live in a card board box, but I doubt you will even enjoy living with yourself", "label": 1}
{"text": "Bro, you entirely missed my point!", "label": 1}
{"text": "Ya bro absolutely. Chad is so much better than India. *facepalm*. Jhaat bhar angrezi kya seekh Li intellectual hi ban gaye. 👏", "label": 1}
{"text": "They are cowards to admit. Also, I think this sub's goal is less about India and more about Anti-BJP. \n\nI agree that the BJP is not a pure-hearted government but they are far better than anyone. \n\nAnd then this type of typical behavior where they turn a blind eye if such an incident occurs and the criminal's religion turns out to be the common one as the religion of the world's top 10+ biggest terrorist organizations. \n\nLove Jihad exists and there are daily cases to justify this fact.", "label": 1}
{"text": "India bad sarr amrica good 😭", "label": 1}
{"text": "Every point of OP is correct. Wtf u blabbering about?", "label": 1}
{"text": "that was APJ abdul kalam's vision", "label": 1}
{"text": "Even if that was the case that doesn't warrent asylum in another country or make India the worst country on earth in any way, Most countries on earth also banned commerical surrogacy for gay couples including many western countries as well like Italy. These aren't really stuff that makes India \"the worst country on Earth.\"", "label": 1}
{"text": "U.S. has DEI everywhere and no free healthcare . Other than US rest of the english speaking countries are very racist towards Indians at the moment be it Aus , Nz , Canada or UK .", "label": 1}
{"text": "Don't forget about that news that came out about Indians digging a hole in wasaga Beach to take a shit.  As an Indian, it gave me second hand embarrassment when I heard that. It's the few Indians that give all of us a bad name.", "label": 1}
{"text": "Daily cases of Muslims being harassed, killed for carrying beef and what not lagega to proof dedugi.", "label": 1}
{"text": "Daily cases of Muslims being harassed, killed for carrying beef and what not lagega to proof dedugi.", "label": 1}
{"text": "> Fuck these people who give a bad name to everyone who follows the legal process. \n\nWhat legal process are you talking about? \n\nThe people who go through the H1-B visa use shady techniques and while not illegal, but use loopholes. Like advertising for jobs in newspapers or putting posters about the jobs in places where American citizens will not see it. \n\nIt starts at student visa process itself too where students have to convince the consulate officer that they will return back to India to get the F1-Visa. The amounts of training to answer questions to convince the visa officer that you will come back and not immigrate to get the F1-visa. \n\nKind of hypocritical to call out others for trying to do the same things that most Indians going to US are doing i.e. better life for themselves. We need to stop this fighting amongst ourselves for scraps and this scarcity mindset. Get some self-respect and confidence.", "label": 1}
{"text": "You people need a vigilante asap.", "label": 1}
{"text": "You can seduce them but you can't make someone fall in love with you. Thats all on the person who is in love.", "label": 1}
{"text": "You hate to be India, they hate you there because you are an Indian.", "label": 1}
{"text": "Hope this country gets nuked", "label": 1}
{"text": "Well, we, middle class are to be blamed for this.. We don't ask the government to give us anything.. No schemes are made for us.. We opened ourselves to exploitation..", "label": 1}
{"text": "DM me", "label": 1}
{"text": "F you man. Wait till Astra Alaya becomes part of Akhand Bharat then we will put you in your place.", "label": 1}
{"text": "I had a European roommate. They would shower only twice a week. Horrible. In many European countries, it’s normal for people to shower less. \n\nThis stereotype of Indian no showering is nothing but racist generalization going back decades. ", "label": 1}
{"text": "Indian Americans are far more embarrassing than any fresh off boats that I have seen.", "label": 1}
{"text": "Is it really fair to ask primates to stop eating bananas?", "label": 1}
{"text": "तेरी ** की **", "label": 1}
{"text": "> No body here is talking about how teenagers are indulging in so much sex, famous on social media with 6,000 follower !\n\nIn all likelihood your grandmother was knocked up by your grandfather when she was a teen. Has been happening for a long time.", "label": 1}
{"text": "Do what the americans do and drop contact with the parents", "label": 1}
{"text": "Those are wise people like myself. Who considerably wants someone who's way less educated than themselves as wife am talking. As bang bang even 10 years older are ok given they maintained themselves. \nIf u marry someone undergraduate u can mould her according to ur own mindset, make her sign pre-neptual she would as much less questions, make babies as she won't have to worry about career and making her boss happy lol", "label": 1}
{"text": "Holy crap MP buses are too too less", "label": 1}
{"text": "who said women aren't capable of violence? we're talking about systemic PATTERNS that exist, and that is men targeting women, period. i literally am the one who brought up the point of guns lmao.", "label": 1}
{"text": "none of these are patterns observable at systemic levels, that's why", "label": 1}
{"text": "Wow.", "label": 1}
{"text": "I mean who takes wikipedia seriously? Does it hold any sort of legitimacy?", "label": 1}
{"text": "You're lying ", "label": 1}
{"text": "cool", "label": 1}
{"text": "only one PATTERN of systemic violence. it doesn’t matter if you personally believe it or not, the only systemic pattern is males targeting female. and i’m not even limiting to violence, i’m saying everything. grooming, abuse, assault, any kind of violence, and kind of harassment, any kind of financial control, social control, political control. \n\nwhat you are talking about is individual cases. individual cases of female on male violence, grooming, assault, financial abuse, etc do exist. and nobody in this comment section denied it (or at least i didn’t, i didn’t even bring them up). \n\nand i didn’t even blame it on the male gender as a whole, i specifically said the pattern is male on female. that’s all. that doesn’t mean every male is a criminal and every female is a victim.", "label": 1}
{"text": "At least you admit it ", "label": 1}
{"text": "cool", "label": 1}
{"text": "whats happening? well elections", "label": 1}
{"text": ">  \nonly one PATTERN of systemic violence. it doesn’t matter if you personally believe it or not, the only systemic pattern is males targeting female.\n\nWhen you state statements like those, you need statistics. Do you have any available where 100% of crimes are committed by male on female?", "label": 1}
{"text": "People shouldn't accept racism from westerner's just because some Indian was rude in some obscure corner of the world.", "label": 1}
{"text": "> Honestly, this sort of mentality does more harm than good.\n\nOh the irony that OP is saying this while discounting racism and stereotyping Indians.", "label": 1}
{"text": "> I WANT XYZ\n\nHow dare they ask a person working in customer service for what they want LMAO. Don't they know they are brown indians and they must live a subservient existence without making demands to Australians.", "label": 1}
{"text": "Which country are you from? \n\nAsking for Lawrence Bishnoi ", "label": 1}
{"text": "You didn’t get anything wrong. Its just that whats right and lawful doesn’t sit well with people. Hating on India and being racist/abusive towards us is in vogue", "label": 1}
{"text": "Guys!! Both of you. Let's stop this. \n\nThe guy hating on the party that gave him the right to voice his opinions and not remain slaves of the British crown, is the perfect example of how a trained pet should be. These pets don't have the cognitive ability to process criticism and counter opinions. So they keep barking the same old narrative like a broken record. So keep doing that. \n\nThe guy with the logical Outlook of life, man why are you wasting time trying to understand a pet animal. Haven't you seen the plaques on the gates - Beware: Pets inside? You should realize he is a pet and he won't understand human logic. Just focus on life, earn money, grow and have pets of your own someday. \n\nNo use doing this on Reddit. Helps no one", "label": 1}
{"text": "Spare me with this bullshit\n\nYou dont get treated friendly because your face shows your contempt for us Indians. Whatever insecurities your Indian origin parents instilled in you, I am sure you end up projecting those on other Indians and mistreating them. Thats why you get shit on. \n\nYou also get shit on because you clearly support racism against Indians.  \n\nIts not our fault that you are misplaced in the world and cant content with your ethnicity and insecurities. Stop blaming Indians for your issues and learn to cope better. ", "label": 1}
{"text": "How to fill complaint ?", "label": 1}
{"text": "This is the impact of movies like munna bhai mbbs", "label": 1}
{"text": "can i write something for you ?", "label": 1}
{"text": "India's in ruins so Indians decide to ruin other countries as well rather than fix their own inner problems. How nice.", "label": 1}
{"text": "i don’t have stats for that since that isn’t what i said😂", "label": 1}
{"text": "The reason is right there in the headline. Delimitation could only be carried out after the first census published after 2026. Instead of waiting for the 2031 census like they should have, they decided to postpone the 2020 census past the deadline. Lives in risk due to operating on years-old data be damned.", "label": 1}
{"text": "Sweeping generalisations are no good, of any community.\n\nThere's plenty of generalised comments I could easily make about 'core hubs' of: terrorism, crime and rape, but I don't, because they're all bullshit.\n\nI am a Gujarati, 4th generation and born in Britain.\n\nThe lousy battling between Indians on which Indian is the best, or which Indian is the most educated, or which Indian is the most civillised.... the rest of the world just looks at all of you, as... Indians.\n\nI haven't a stick in this fight, arguing amongst yourselves and using unreliable sources to back up your claims isn't getting you anywhere.", "label": 1}
{"text": "no...never knew of that... whats the name?", "label": 1}
{"text": "yeah its so annoying...every morning my room's like a graveyard of these things lol...i think their lifespan's probably for a few days or less", "label": 1}
{"text": "He is asking the right questions irrespective of being a gujrati or not.", "label": 1}
{"text": "Of course. The census is not just something for data nerds to obsess over. It has a direct bearing on policy, allocation of public spending and infrastructure, welfare schemes etc. Working on 14+ year old data is not ideal for any of this.      \n\nFor example, think of an area whose population might have doubled since 2010 due to migration etc. But the executive machinery is blind to the development and it still has the same number of ration shops, teachers, clinics and doctors as before.  What happens to this overburdened healthcare infrastructure in the area in case of a public health emergency?    \nSame goes for other government programs. Without accurate numbers, the government doesn't know how many people it needs to feed, educate or immunize. Imagine the number of people who are falling through th cracks because of this.", "label": 1}
{"text": "Time for southern states to split from india", "label": 1}
{"text": "Where did I make assumptions? Can you not read? I am just stating what happens and what illegal immigrants end up doing in the US to survive because many people Americans themselves don't know what kind of life it is and why there are so many undocumented immigrants in the US.  Average legal citizenship processes take 10 years even if it is a valid asylum case. It can take a lot longer duh.", "label": 1}
{"text": "And what’s that gonna achieve?", "label": 1}
{"text": "My Milaap Link: http://m-lp.co/netra-5?utm_medium=native_poster&utm_source=app", "label": 1}
{"text": "You are spouting BS with some big words. \n\nTo prove something is systemic you need to have correlations. You need to be able to prove that this many number of people faced this issue with this system in place and this many did not. A usual way to do this is via RCT. \n\nAlso your example is bad. Your eating can change at any point of time. The pattern is based on an intrinsic push from your psyche that this is the PATTERN. It has nothing to do with it being pattern or not. That determination comes external\n\nLearn maths and learn statistics. It helps in logic.", "label": 1}
{"text": "luv murica eh ?", "label": 1}
{"text": "Maybe they have some wrong doings? \n\nDo you know what happened in Mumbai of all places in November 2008? Do you want to know the religion responsible behind a majority of our terrorist attacks? \n\nDo you remember the churches in your country getting bombed during Easter in 2019? \n\nWe have lovely neighbours who make sure we are never bored. \n\nI would love to say that there was good people in a particular religion too but on the surface of it, we can’t say for sure and that’s why that suspicion will always be there. \n\nThere are too many scars in India’s psyche which politicians have burst and stabbed multiple times over the past 70+ years. That resentment and trauma is what you are seeing today.", "label": 1}
{"text": "Indians scamming each other. Indians were a small problem not a big deal. Now its a infestation. Theyve completely taken over entire cities here in Canada. Like imagine the entire city is just indian people!", "label": 1}
{"text": "It would work in an utopian world free of Islamists. Good luck moving forward with them and their radical ideologies. You are from Kerala like me. Islamists there are comparatively less radical. I have worked in bangalore and have interacted with Islamists from other states. Their views are pretty extreme. They protest against CAA without knowing what it is. The same goes for Waqf. Why should the majority go on a suicide mission with them?", "label": 1}
{"text": "It really isn't hard for two months and is actually laughably easy with all the beg options availabe in the west. I dont understand why people cant go a single day without paying someone to torture an innocent animal in horrific ways for a taste preference especially in the west where is even worse and they do it for every meal.", "label": 1}
{"text": "Fuck no. You didn't choose the house you were born in, but sure as hell chose to get married to that person. As a responsible adult, it is your responsibility to ensure that your mother doesn't inconvenience your wife by making unreasonable demands. ", "label": 1}
{"text": "Tell your mom to stay at a hotel if she doesn’t want to adjust. ", "label": 1}
{"text": "In the west 99% of it comes from factory farms unless you specifically buy pasture raised which costs 3x more. Even then, they go into the same gas chambers, the same slaugtherhouse, etc ", "label": 1}
{"text": "Indians should stay in India, no country wants these people, they all experience racism once there are too many of them.", "label": 1}
{"text": "Majority of the world’s crops are grown for animal feed. If everyone in the world gave up meat and dairy, we can get rid of world hunger. We would get so much more land to grow food for humans.\n\nIt is true that agriculture and storage of food causes some pain and suffering to animals. It also true of building houses and cities. However, killing animals for meat in today’s world is completely avoidable. There should not be so much suffering behind the food we eat.\n\nWatch dominion on YouTube, very eye opening.", "label": 1}
{"text": "Lol.bruh", "label": 1}
{"text": "Yes the mother has no say in his son's adult life. But she can have her say in not to visit his son and that's pretty reasonable.", "label": 1}
{"text": "Rakhigarhi is a village and an archaeological site belonging to the Indus Valley civilisation in Hisar District of the northern Indian state of Haryana, situated about 150 km northwest of Delhi. It was part of the mature phase of the Indus Valley Civilisation, dating to 2600-1900 BCE. It was among the largest cities of the ancient civilisation. There is evidence that the earliest settlements in Rakhigarhi predate the Indus Valley Civilization, though only 5% of the site has been excavated.", "label": 1}
{"text": "But we also have huge numbers of population, and resources are being used to fill up the asses of our babus and netajis instead of running more trains.", "label": 1}
{"text": "Really? Milk is not the same thing as flesh and would not evoke the visceral feeling of blood and gore. I honestly don't think it is a moral stand for many. It is simply a matter of what they can eat. \n\nI used to be able to eat pretty much anything but of late my adventurous palate has been experiencing some reluctance with unusual meats and I have given this a great deal of thought.", "label": 1}
{"text": "Pls?", "label": 1}
{"text": "Pls uski bhi maar do.", "label": 1}
{"text": "##क्या आपको ही अंधभक्त बोलते है।", "label": 1}
{"text": "Yeah, this country is very bad…\n\nEven I tried buying something on Amazon and it was out of stock during festive season, what a shame this country is.\n\nI cannot even wait for the item to get back in stock, coz why should I? I’m a premium class citizena and Amazon should bow in front of me and beg me to buy items.\n\n/S", "label": 1}
{"text": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^PrequelToMagic:\n\n*Joke is on the clowns*\n\n*Who thought people get into*\n\n*Politics to change things*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.", "label": 1}
{"text": "Exactly how Mullahs send their kids to Islamic schools and train them to become %#%#%#", "label": 1}
{"text": "Imposter syndrome can be such a challenging experience—it can feel like you’re constantly questioning if you’re good enough, or even deserving of your achievements. If you’re feeling like this, know you're not alone, and there are ways to manage it! 💪\n\n\n\nI’ve come across a group that might be helpful: SoulUp’s Imposter Syndrome Support Group, starting on November 9th. It’s a supportive space where people with similar experiences share their stories, learn new strategies, and build confidence together. Sometimes, just being able to connect with others who understand can make a huge difference! ", "label": 1}
{"text": "Call to action is so cringe", "label": 1}
{"text": "That's despicable ", "label": 1}
{"text": "Don't be slave guys if u suffer from that kind of shit overtime , night shift , etc to union kro aur pressure bano holiday ka aur bullah ki Eid par koi overtime nahi ata inko yaad , agar piloge to pele hi jaoge pure life", "label": 1}
{"text": "Hindutva is now equal to terrorism...", "label": 1}
{"text": "Yogi ji ki Neeche bhi Dhadi hai, uske bi mardo", "label": 1}
{"text": "There’s Nigerian prince who wants to give you money because he has too much. Don’t worry he’s not upper caste.", "label": 1}
{"text": "Beautiful photos, here's mine.\n\nhttps://preview.redd.it/2xv5to80loxd1.jpeg?width=3706&format=pjpg&auto=webp&s=80e9ff436522f31cec8489c9508094f9d973c1cb", "label": 1}
{"text": "Fuck North Indians...You are a burden on the rest of us.", "label": 1}
{"text": "Bombay airport? Is there any such place in MUMBAI?", "label": 1}
{"text": "While madarsa don't even pay taxes. And yes, they get funds from the government so in a way that is your tax money. What are you smoking dude?", "label": 1}
{"text": "Saalo ne urinal me thook diya 😂😂😂😭😭😭😭😭", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Here are some recommended escort services in Mumbai along with their contact details:\n\n**1. Escorts Agency**\n\n* **Website**: \n* **Contact**: + \n* **Services Offered**: In-call and out-call services, available 24/7. They provide high-profile call girls and emphasize safety and satisfaction.\n\n**2. Sital Agrwal Escorts**\n\n* **Website**: [https://www.escortdirectory.in/escorts-in/maharashtra/mumbai/](https://www.escortdirectory.in/escorts-in/maharashtra/mumbai/)\n* **Contact**: Call or WhatsApp for direct booking.\n* **Services Offered**: Affordable escorts, including college girls and high-profile models. They offer both hotel and home services, with a focus on customer satisfaction.\n\n**3. Aanvi Escort Service**\n\n* **Website**:  [https://www.escortdirectory.in/escorts-in/maharashtra/mumbai/](https://www.escortdirectory.in/escorts-in/maharashtra/mumbai/)\n* **Services Offered**: Independent escorts, high-profile models, and erotic massage services. They emphasize safety and reliability.\n\n**4. Hot Kiran Escorts**\n\n* **Website**:  [https://www.escortdirectory.info/escort/india/mumbai/](https://www.escortdirectory.info/escort/india/mumbai/)\n* **Services Offered**: A wide range of high-class escorts, including independent and VIP models. They provide both incall and outcall services.\n\n**Key Considerations**:\n\n* **Safety**: Always prioritize your safety and verify the legitimacy of the service before making any bookings.\n* **Discretion**: Ensure that the service respects your privacy and confidentiality.\n* **Reviews**: Look for reviews or testimonials to gauge the quality of the service.\n\nBy contacting these agencies, you can explore various options that meet your preferences and requirements.", "label": 1}
{"text": "I am Indian, Indians are absolutely FILTHY. Let's not lie about ourselves, there is so much work to be done. My parents moved to America and raised me here. I can not comprehend how ashamed I am of the people in India. And I love India. I love our culture, our food, our songs. Everything. I speak Hindi and Gujarati. But India is a place where people take a dump on the streets, throw trash everywhere, spit everywhere, and have no problems making society terrible for everyone if it means that their own house will be clean.\n\nPeople are racist, the country is not safe for women, religion is prioritized over well-being. What pains me is that we can do all we want to make laws and help change India, but the mentality will never be there. Look at China, South Korea, pretty much every East Asian country. They were in a worse state than India. Do not tell me that change is not possible, and do not blame the British for our modern day problems.", "label": 1}
{"text": "Still valid than your dumbfk logic", "label": 1}
{"text": "Check this... Same to same happend with this guy\n\nnp.reddit.com/r/PAK/s/ASL2YgzrTt", "label": 1}
{"text": "God didn’t give any bone of honesty and integrity to Indians regardless of how much religious hoo haa they do in public.", "label": 1}
{"text": "Ay yo stop trying to justify your hate. How many people of that extraction have you seen actually e a criminal", "label": 1}
{"text": "Holy shit moron you are really stupid you either think 100 percent madeshi of all madesh went to blockade the area  and you somehow think all madhesi lives in madesh region and not terai region as well", "label": 1}
{"text": "Don't feel bad. That's what people from other countries say about India- rude, dirty, and unhygienic. Creepy as well.", "label": 1}
{"text": "Hindu Muslim and jains not allowing other communities in building are purely due to intolerance of other communities.", "label": 1}
{"text": "Dont feed the monkeys! Feeding is what makes them pests. Stupid mofo.", "label": 1}
{"text": ">Throughout the whole country the people do not kill any living creature, nor drink intoxicating liquor, nor eat onions or garlic. The only exception is that of the Chandalas. That is the name for those who are (held to be) wicked men, and live apart from others. ..--A Record of Buddhistic Kingdoms\n\nchandals were the name given to meateaters in the city in the Gupta Empire. Most school history books mention that. Not to be confused with chandala caste or namasudra in Bengal. Those came later after the categorization in Gupta empire.\n\n>Fishermen/ Fishing communities develop along coasts\n\nEven in coastal cities like Bombay, Chennai? How much of Gupta land was on coast does that make them relevant or chandals?\n\n\n>The \"kept out\" thing only happened in the Indian context when casteism/varna vyavastha became a thing\n\nAnd according to you that happened with Arya Samaj and not Manusmriti? No comments.", "label": 1}
{"text": "Looks like he's from peaceful community, he's following his prophet Mullah.", "label": 1}
{"text": "Calling these guys stupid is insulting. Call them retarded.", "label": 1}
{"text": "> He told his name as Ashok\n\nLet's see what his real name turns out to be.", "label": 1}
{"text": "Is management a good field to study in USA?", "label": 1}
{"text": "Or in a very lawful country like China . Imagine him doing this shi in China 💀", "label": 1}
{"text": "He used GIRLS TO MODEL FOR HOS ONLY FANS TO EARN MONEY. He's nothing more than a pimp who also rapes young girls.", "label": 1}
{"text": "Tu chutiya hai kya??", "label": 1}
{"text": "Rage bait much?", "label": 1}
{"text": "Both good and evil are there in all religions. Don't do this please.\n\nHe could very well be brainwashed Ashok trying to put blame on other community. Or could be brainwashed Ashraf trying to achieve something stupid.\n\nIn both cases they don't have value of human life.", "label": 1}
{"text": "Nah bet he's a 'Sanatani' and following the example of Brahma, lusting after his own daughter", "label": 1}
{"text": "This seems to me like a psychological disorder like Bipolar or maybe schizophrenia. Please take her to a experienced psychiatrist. God won't help her. This can be disastrous if you let mental condition completely take her sanity", "label": 1}
{"text": "Why so much uproar his charity his condition at least he didn’t ask for Jizya nor blasted bomb in the name of ….", "label": 1}
{"text": "San aatanka d harm a", "label": 1}
{"text": "Isolated incidents can be brought up against all the communities, doesn't mean all the people belonging to them are bad, but you will see what you wanna see obviously.", "label": 1}
{"text": "I was talking to you with respect.\nNow, I do not want to talk to you anymore.\nIf you think me trying to understand your point of view makes me spineless. Well. Got nothing to say.", "label": 1}
{"text": "Moreover, how can you trust such news.\nAlso, aren't there incidents where some hindu people have killed people from opposite community or even hindu community? I remember one where they chased a car and killed a guy in his teens thinking he was smuggling beef or something. NCR region.\nSo now all hindu will hate hindu? Kuch bhi ho raha hai desh me.", "label": 1}
{"text": "So those two men are in this incident? By this logic I can equate all hinduu religion following people murderer because a migrant worker from WB was lynched to death by a hindu men because of beef rumours.", "label": 1}
{"text": "Its conversation between 2 adults. I said you \"may\" be. Its called speculation. I bet my last dollar you didn't react so much for Kaniah Lal's brutal murder.\n\nYou are just running away since you have no response to my logical point.", "label": 1}
{"text": "Did I speculate anything regarding you?\nSo, what gave you the right to speculate about me.\n\nSay whatever you want to. Initially, I really wanted to know things. But now, I dont.\n\nThank you.\nPeaceout.", "label": 1}
{"text": "An IB officer was killed just because he was not from their religion \n\n\n\n\nA guy was tortured and shot 20 times just because he removed a flag\n\n\n\n\nAnd so on....", "label": 1}
{"text": "Well, atleast he is feeding people with his own money unlike us who are just typing and putting our opinion. He could have not asked them to say because we are not like Banglus who forced people to convert if they want food during floods. But still another example of selective outrage.", "label": 1}
{"text": "Wait, was that the woman in the video?  I thought it was two men?  How can she be allowed to walk around Mumbai freely after murdering someone?", "label": 1}
{"text": "Bhaiii, humare desh mei gal karo humare saath. Hum tumko paise deinge aur tumari maa ki gaand me AK47 😂😂 🇺🇸 India is such a joke imagine paying hit men from google and they’re literally FBI informants. You little smelly anti-deodorant midgets should focus on how shitty living conditions are in your country. But if you’d like to have a chat with a Sikh separatist please I’ll give you my address me and my santaali would love to speak with some Indian dogs", "label": 1}
{"text": "Just f**k your parents bro..  I can't even imagine toxicity of this level.. Celebrate diwali tommorow and then leave for your college.... Atleast you will remain in peace there. \n\nAlso make them clear that you won't appear for GATE as you don't want to pursue higher studies and want to focus on your job only...\n\nThey will scold you but it will be only for few days and they will forgot.", "label": 1}
{"text": "Is it BITS?", "label": 1}
{"text": "What paradise of India do you live in? Good work trying to peddle your racist agenda on this serious post.", "label": 1}
{"text": "Don't cry when foreigners say ,\" please ban paj**tland.\"\n\nI'll never understand what kick people get from trashing fellow countrymen. \n\nYes some of them are downright inhuman,but I'm sure our states are not some absolute paradise.", "label": 1}
{"text": "Ah yes the race of UP. One of the races of all time", "label": 1}
{"text": "Ruko jara\n\n\nMein aata hu iske tutte tight kar k twitter par", "label": 1}
{"text": "Racism is not the right word for it, but you get the gist of it.", "label": 1}
{"text": "Exactly, we have nut jobs in every state of India.", "label": 1}
{"text": "There are sooo many nutjobs in that state.", "label": 1}
{"text": "Khalistan Zindabad", "label": 1}
{"text": "You people? I’m born and raised in the west and I’m married to a white girl….", "label": 1}
{"text": "It can but considering the probability it highly likely a non-hindu", "label": 1}
{"text": "r/India has the worst kind of people I've ever seen, better to let them rot and whine and not get affected my man", "label": 1}
{"text": "He is serving food with his own money. He was the right to decide whom to serve. If someone cannot merely respect his religion why should they demand food from him?", "label": 1}
{"text": "Please don't decrease the value of the word terrorism with your bullshit \"Woe is me\" post. You have fuck all idea about what real terrorism looks like. And simp", "label": 1}
{"text": "Between 200 billion dollars to 1 trillion dollars are given as charity by Muslims worldwide as part of Zakat *every year*. Gtfo your racism.", "label": 1}
{"text": "bhai fatt gayi meri 😭\nbtw i pray for you dude hope you get back to being normal and be guided to straight path 🤲❤️!  ameen!", "label": 1}
{"text": "I bet smells way better than his $l*v3 dads shirt after he is done cleaning sewers", "label": 1}
{"text": "Probably goes to train suicide bombers and terrorists", "label": 1}
{"text": "Sadly, 1947 was not complete, 92 was not complete, complete complete completely remove the vermins", "label": 1}
{"text": "Living in the US, you should be more worried about school shootings instead of Islamic terrorism. Or the violence that is happening against Indians. But yeah, why not fight against other Indians instead of helping each other up.", "label": 1}
{"text": "Just fuck off you bearded terrorists", "label": 1}
{"text": "I thought they have the most Brahmins though?", "label": 1}
{"text": "Our sasta mossad used whatsapp for planning. LOL. Duffers. Whatsapp is insecure.", "label": 1}
{"text": "Modern Hinduism has turned into a shallow ritualistic business. Everything is a business these days. There is a “Pooja” or a “seva” you can do by throwing money to solve all your problems.\n\nSpirituality and morals have long been discarded by modern Hindus.", "label": 1}
{"text": "Caste privilege. ", "label": 1}
{"text": "I am not a Sikh but I have learned that Sikhs are the most screwed by our politicians.\nImagine birthplace of your founder's being given away to another country. Like Ayodhya given to Nepal or Mecca given to Israel", "label": 1}
{"text": "https://preview.redd.it/8vurwpdui0yd1.jpeg?width=1080&format=pjpg&auto=webp&s=9bcf0961ef1a1d1a0c313bfcfba99c46cecb9d45\n\nYai bhi modi ki galti lol", "label": 1}
{"text": "Bad faith, but well deserved. An eye for an eye is totally worth it sometimes.", "label": 1}
{"text": "\"innocent\"? Highly doubtful when you're under condition zero. Also called \"under riot for ideological clashes.\"\n\nYes. Mistakes like that need a hefty payback.", "label": 1}
{"text": "No war crimes on her part...Bindrawala could have surrendered but he tried using civilians as shields and the government was left with no other option.\n\nYou say you are not a khalkistani but it seems ur a terrorist sympathiser", "label": 1}
{"text": "A Hi-nazi, who runs a Hi-nazi government, who follows an ideology whose founders admired Mussolini and Hitler, giving a nazi salute -- calling that \"Indian pledge stance\" is pure rightwing dishonesty.", "label": 1}
{"text": "For an Indian website, it is better to go with an Indian VPS hosting solution to enhance performance, reduce latency, and provide stronger security. \n\nIn India, many providers offer reliable VPS hosting with good customer support and affordable prices. \n\nHere are some of the VPS hosting provider that charge GST on their services: \n\n**DomainRacer** offers good quality VPS hosting services with affordable prices which allow their user to select the most suitable plan for their project. They have SSD storage and unmetered bandwidth which gives lightning-fast speed and their cPanel is easy to use so you can easily manage your website. \n\n**DedicatedCore** has multiple data centers located in the world one of them is India and  with the Indian currency they charge GST. Their cPanel VPS hosting comes with free managed services so all the maintenance and management of the server are performed by the technical team. \n\nHere are some of the factors you need to look out for while choosing a VPS hosting provider with  an India location:\n\n1. They have an Indian data center that can enhance loading speed. \n2. Reliable with 99.9% of server uptime and minimal downtime. \n3. Customer support comes with a 24/7 guarantee so you can contact them at any time.\n4. Security measures like DDoS, firewall, data backup, and regular security updates. \n5. Scale the server resources to your requirements with ease. ", "label": 1}
{"text": "It's not me it's you who is thinking like this. I'm the last one to think about caste. But since you brought the freaking caste thing in this, I needed to tell you the reality. You guys sit in AC room and spit your biases like anything. There's no holier than thou here. ", "label": 1}
{"text": "not entirely, but i am here just for farming down votes, lmao,\nnow the answer to your question, no. Ordering anything based on personal grudges and implied conspiracy by using defence mechanism and citizens of a country is wrong regardless of what is ordered.", "label": 1}
{"text": "You should say this loudly in front of everyone at Gurudwara Bangla Sahib today, instead of replying to me and see the reaction. \n\nOf course you wouldn't because you're nothing but a bigot \n\nWatch the Quint video I've provided the link for, with interviews with women who lost their husbands and houses. Will you tell them that their deaths were okay because apparently it was a continuation of a chain of revenge attacks.", "label": 1}
{"text": "At this point , canada is a terrorist state.", "label": 1}
{"text": "The release of evidence in the murder of Hardeep Singh Nijjar will depend largely on the judicial process, particularly as the case moves through Canadian courts. Once formal charges are laid and court proceedings begin, some evidence—such as security footage, witness testimonies, and possibly other materials related to the alleged involvement of foreign agents will be disclosed publicly as part of trial records, especially if the defense challenges these elements. This aligns with Canada’s commitment to a transparent judicial process where evidence is generally accessible during public trials.", "label": 1}
{"text": "Where is rindia bridgade to defend russia now?", "label": 1}
{"text": "So as the proverb goes - 'Empty vessel sounds more'", "label": 1}
{"text": "Even in r/india. don't forget that.", "label": 1}
{"text": "Be a proud hindu.", "label": 1}
{"text": "Where can companies find good UI/UX candidates? [oddlyai.tech](http://oddlyai.tech) has been looking for interns for the past month, and we haven't found anyone. Please let me know where I can look.\n\nIf anyone here wants to try out, mail a link of your portfolio to [contact@oddlyai.tech](mailto:contact@oddlyai.tech) with an appropriate subject (otherwise it will go to a different folder).", "label": 1}
{"text": "When will USA sanction Nandan Nilekani gang for unleashing aadhaar genocide in India?", "label": 1}
{"text": "Bhai, woh marega toh bhi Modi ki galti hogi. Tu chinta na kar.", "label": 1}
{"text": "Meh! US is currently financing child killing and genocide in Gaza. That should be \"concerning\".", "label": 1}
{"text": "Need Recommendations for Making Cafe-Style Coffee at Home on a Budget\n\nBody:\n\nHey coffee lovers!\n\nMy dad is a huge coffee fan, and I’m looking to surprise him by setting up a way for him to enjoy cafe-style, smooth coffee at home. Since it’s Diwali today, I’d love any quick recommendations on what I should get him. I’m hoping to keep things relatively budget-friendly but don’t mind investing a bit if it makes a real difference.\n\nA few specific questions:\n\n\t•\tEquipment recommendations: What’s essential for brewing smooth, rich coffee at home?\n\t•\tQuality vs. Budget: Are pricier machines/equipment worth it, or can we get good results with more affordable options?\n\t•\tTime & Cleaning: How much time does brewing typically take, and what’s the cleaning process like?\n\nWould love advice from anyone who’s had a similar experience or who has practical tips to share. Thank you, and happy Diwali to everyone celebrating!\nPs. Why can i make a post on ask india? Can anyone help??", "label": 1}
{"text": "What do you mean by high gsm, how does it make clothe quality better? \n\nI'm planning to purchase for regular office wear. But they don't have many colors.", "label": 1}
{"text": "Isn't bro a \"friend\" of literally every world leader . Then who exactly are these forces ?", "label": 1}
{"text": "And you believe da faq you just said?", "label": 1}
{"text": "> And most of Sikhs consider fine that Indira got killed\n\nI don’t condone separatism or the idea of a different country as a Sikh but tell me one thing: when you attack the holiest shrine of a community, when you send an army with tanks and kill thousands of innocent civilians, when you obliterate the Mecca of Sikhs then what exactly are you expecting to happen? Replace the word “Sikhs” with any other religion.", "label": 1}
{"text": "Chup be", "label": 1}
{"text": "Bro aren’t you guys doing the same for Israel? Like stfu and go back to your hole.", "label": 1}
{"text": "With all the money eaten by Bihar you would expect it to be less retarded", "label": 1}
{"text": "Few more should die.", "label": 1}
{"text": "what the fuck are you on about?", "label": 1}
{"text": "😶", "label": 1}
{"text": "You can’t sanction someone who controls the entire world’s banking systems and networks. It’s like saying lock out the homeowner who has multiple keys for their home", "label": 1}
{"text": "Bunch of knuckleheads. They keep the Israel, Iraq and Vietnam cards in their front-pockets.", "label": 1}
{"text": "Hey, look found a pretentious and chest thumping naastik in the wild lol.", "label": 1}
{"text": "If it is democratic than why so many articles are locked for edit ?", "label": 1}
{"text": "Retard", "label": 1}
{"text": "Indians need to realize that the great plan of the west is to keep Indians in slave-wealth conditions. This means high debts. Working 12-16 hours a day. Compact sleeping and living arrangements. Low cost. Always sending money back home. Never living. ", "label": 1}
{"text": "I can't wait to have my own kids", "label": 1}
{"text": "Why no reach? What did you do mods?", "label": 1}
{"text": "Yep.... terrorist wannabes keep threatening India from Canada and that's alright eh???", "label": 1}
{"text": "Just a suggestion- read anything about India  on US media with a pick of salt! Have been following them for last 20 years!", "label": 1}
{"text": "check out OP's profile and the name, pretty sure he is on payroll.", "label": 1}
{"text": "You are right! He even got kicked out of China! I am losing faith in CNN, NYT, WP! They are no more center-left, have moved left too much!", "label": 1}
{"text": "[The Harris Campaign Manipulates Reddit To Control The Platform](https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/)\n\nWell, read this out, the biggest tragedy is that this very well researched investigative piece is not in news anywhere.\n\nPoliticians and pressure groups have discovered reddit and hence the opinions here are mostly manufactured or bots or people who get influenced by those bots and start acting like one.", "label": 1}
{"text": "What a shameless National Security Advisor! He himself admits that a criminal in India is capable of orchestrating anything from prison!!! Wow.", "label": 1}
{"text": "The whole democrat caucus is scared now! It seems even New Jersey is not safe for Kamala! So they are trying every possible way to sway voters.", "label": 1}
{"text": "Indians don't care if terrorists are being hunted.", "label": 1}
{"text": "I don't live in the US but if both Kamala and Trump are running almost equal in the polls then pretty surely Trump should win (considering polls are independent) because it is not socially acceptable in the US to support Trump (at least from what I infer).", "label": 1}
{"text": "True! In fact in 2016 lot of people , on face supported Hilary, but voted Trump. But more importantly, in Us election only matter in 7/8 swing states, and there Trump is having better poll numbers compare to 2020. And even the early voting trend is not helping Kamala.\nPersonally I feel both are bad - Kamala is inept and Trump - less said is better! So whoever wins we are doomed! 😔", "label": 1}
{"text": "US is currently shielding a terrorist who orchestrated 11/26. Let them release him first. Canada and US believe that it is all good when they do it and start this drama when others do it. If India did it, good job for showing them the mirror.", "label": 1}
{"text": "The only hope is the US system of governance which won’t let the president take decisions that may lead to major consequences/ conflicts!", "label": 1}
{"text": "It’s harrowing indeed. Just curious on how you got the number. Do you have any reference?", "label": 1}
{"text": "Every second cheat is from GJ. Every industry is diverted to GJ. Every large dug haul is from GJ. Every unscrupulous business guy is from GJ. Then they get handouts. They dont volunteer for the army either. \n\nGJ is essentially living at large and at the expense of the others.", "label": 1}
{"text": "Modi BJP made India hated.", "label": 1}
{"text": "Ev.... GAY", "label": 1}
{"text": "What's embarrassing? Nothing is embarrassing", "label": 1}
{"text": "Just like in Pakistan, where terrorists are provided security from by Government.", "label": 1}
{"text": "Why are we discussing an inconsequential country. They needed Indians to revive their economy and Indians there have helped in tax income and high rent. \nAnd the reason is that Government funds policies for First Nation. \nAnd they are harbouring terrorists. As simple as that. One day they will go the Pakistan way with Canada being the new Khalistan.", "label": 1}
{"text": "> We didn't know about Nijjar's existence, before the Indian spies thought he was worthy enough to be assassinated.\n\nHow dare they not consult a random redditor like you before taking an action? Of course basement dwelling redditors are the supreme authority to decide who should be pursued by intelligence officers. ", "label": 1}
{"text": "What a surprise! Turns out we are not so different after all...", "label": 1}
{"text": "There is more substance in the post diwali air in Delhi than this shit statement from canada. Either show proof or shut the fuck up already, it’s getting boring now. ", "label": 1}
{"text": "Hahahaha. Which world do u live in.", "label": 1}
{"text": "Stop with the terrorist sympathy. You may dislike the party in power but that doesn’t mean that you support terrirism. ", "label": 1}
{"text": "Is the US currently invading a country based on a false pretense?", "label": 1}
{"text": "OP is 1000% sus", "label": 1}
{"text": "Not currently but remember gulf of Tonkin? Collin Powell and his vial of white powder? Grenada? \n\nAnother example. The U.S. accuses China of economic coercion. At least China is just coercing.  The U.S. would apply a complete trade embargo and economic sanction to bankrupt its enemies.", "label": 1}
{"text": "Ideally they would have been better off considering, since they were treating a bunch of nobodies as enemies of the state on friendly territory, and were looking to create unrest in one of Northern India's most peaceful states by controlling a gangster like Bishnoi. \n\nIndian Intelligence officers today, are your average incompetent IPS Officers officers who've shifted to RAW for experience, but have only ended up bringing the same problems to intelligence. Using criminal gangs to do your dirty work makes sense only if you leave no trail.", "label": 1}
{"text": "I am happy that we have a minister who is looking to neutralise the threats beyond Indian soil. You are bound to fail sometimes and for me, that's okay. I don't understand why we still have diplomatic presence of Canada in India.", "label": 1}
{"text": "This guy thinks a Federal Investigation Agency is gonna hand-deliver the documents to his Gmail lol.\n\nThe truth is, either the evidences have already been shared privately or it is confidential evidence that will never be released to public.", "label": 1}
{"text": "Are we want India to go beyond borders. We want the government to kill every bastard that wants to destabilize India. I mean if idiots think that this leak/failure will bring down popularity of current government, then they are delusional for sure. Infact it does the exact opposite.", "label": 1}
{"text": "Be prepared be neutralized by more competent forces here in india then. You attack them, they will do you a reverse uno in a more competent fashion.", "label": 1}
{"text": "Barely anyone beyond Mumbai had heard of Daud Ibrahim till he carried out bomb blasts. Same goes for Osama. Ab nijjar ke famous hone ka intejaar karte kya? Marne ke baad famous hota hai to ho jaye.", "label": 1}
{"text": "Attacking Hindu temples and community and Indian consulate definitely is the 1st step towards it.", "label": 1}
{"text": "Canada : Provides safe heaven to Terrorists\n\nTerrorist gets killed \n\nCanada : Pikachu Face, full panic", "label": 1}
{"text": "And why is that a problem really? Israeli agents were arrested in killing an innocent by mistake. Shit happens.", "label": 1}
{"text": "All fine online.", "label": 1}
{"text": "Ye baat pahle samajh me aani chahiye thi.", "label": 1}
{"text": "They cannt, they are pathetic. Their entire operation got routed in China lately.", "label": 1}
{"text": "Everyone knows. CIA killed Bhawa. CIA did so many color revolutions.", "label": 1}
{"text": "Look man, from the looks of it, thats not happening.", "label": 1}
{"text": "Kids shit on the street?", "label": 1}
{"text": "More importantly, USA did exactly the same.\n\nUS army officials infiltrated Pakistan and killed two Pakistani nations including an unarmed woman in operation neptune spear.\n\nThey lost a helicopter in that operation which was then picked up by Pakistani and given to Chinese.", "label": 1}
{"text": "I dunno, ask homeless on Canadian streets. Too many of them on DTES and Toronto.", "label": 1}
{"text": "Ghise hue dhol. Abe saboot bhi dedo ", "label": 1}
{"text": "Intelligence is NOT evidence. There is something called as admissibility in court, if you know anything about law at all. Any \"intelligence\" obtained illegally is not admissible in court and is considered no evidence.\n\nYou can not sneak into your neighbours home and install hidden cams to catch him stealing your wifi. That will not be admissible in court.\n\nSo yes, I stand by my initial point: Canada has absolutely no evidence.", "label": 1}
{"text": "Intelligence is NOT considered evidence if it is not admissible in court. If it is obtained illegally (most intelligence is), it can not be considered as evidence.", "label": 1}
{"text": ">Intelligence is NOT evidence. There is something called as admissibility in court, if you know anything about law at all. Any \"intelligence\" obtained illegally is not admissible in court and is considered no evidence.\n\nUS has charged Indian agents and they will soon be tried in a court of law. \n\nFor the Candian case, the question here is not whether the evidence is admissible in a court of law or not.\n\nForeign relations are not made or broken in a court of law.", "label": 1}
{"text": "Canada is alleging Lawerence Bishnoi gang did the killing. This is totally different from Gupta who hired a local hitman in US to do the killing. Totally different case.", "label": 1}
{"text": " Stop sending in Indians then. Literally speaking India is f*cked up by Indians and now we are exporting all the losers to these first world countries while acting all bold and blustery. \n\n*G_nd phate tho phate, Nawabi na ghate*\n\nWould do us good to clean up our act and be more global citizens than the cringe you guys keep exporting.", "label": 1}
{"text": ">Canada is alleging Lawerence Bishnoi gang did the killing.\n\nThe same guy ordered the killing. Please read the case.", "label": 1}
{"text": ">They needed Indians to revive their economy \n\n😂🤡", "label": 1}
{"text": "No evidence of that presented by Canada. And US indictment has absolutely no mention of Yadav ordering killing of Nijjar.", "label": 1}
{"text": "Lol u describing killing of Osama ? 😅", "label": 1}
{"text": "Wait! You seriously think your opinion is better than those working in RAW? You have more information about who is a nobody and who isn’t than RAW? You seriously think that. Wow!!\n\nIf you are serious about that then you are basically at a point of no return, all I can do here is wish you a good day. ", "label": 1}
{"text": "It was not only Osama that was killed. There were two more folks died in that raid. Both were Pakistani nationals. One was an unarmed woman who had nothing to do with Osama.\n\nGo through entire operation neptune spear.", "label": 1}
{"text": "But that's not our official stance. Our official stance is we didn't do anything. Do you know something out government does not?", "label": 1}
{"text": "Oh, I didn't know that! \n\nThey are such a hypocrite when it comes to them", "label": 1}
{"text": "If Canada had evidence they would not be begging for a joint investigation. LOL!", "label": 1}
{"text": "No evidence of same agent tried the hit on both Khalistanis. US shared intelligence obtained illegally. They have in custody Gupta who was not charged with killing Nijjar because Canada is alledging Nijjar was killed by Lawnence Bisnoi gang. A totally different gang.", "label": 1}
{"text": "Integrate? Lmao", "label": 1}
{"text": "The only problem is your hate for India and Hindus in specific. You need to realise we aren't your enemies. Somehow you are still stuck in an era when both communities lost their loved ones from the hands of extremists. Yet you are convinced that only your community was victims and people dead in Thapar college massacre were perpetrators. Rather than dealing this together, people like you have made the other victim community your enemy.", "label": 1}
{"text": "Source?\n\nAlso \"allegedly\". The video was doing round on internet too and no, it can not be \"real time\".", "label": 1}
{"text": "So what crime I have committed? Which minority have I oppressed? And I think I can say the same for you by clubbing you in the same bogey as perpetrators of Kanishka bombing incident. And who are you to decide if I am victim or not? Did I decide for you whether you are a victim or not? A person having more love for Canadians is calling itself a proud indian. What a joke.", "label": 1}
{"text": "That evening video of crime was doing rounds on internet.", "label": 1}
{"text": ">strategy of breaking this country\n\nDo you think a bunch of TikTok activists sitting 8000km away can actually break a country of 1.3 billion. \n\nBhai, kitne insecure ho tum log ? Tumhari insecurity ka hi toh log mazaak bana te and it is the exact reason why Indian Ops are failing.\n\nAnd the person who is actually breaking this country is Lawrence Bishnoi jo Sarkar ki apni jail mein baitha hai lol.", "label": 1}
{"text": "Trudeau ko gali padta hai to kitno jalti hai?", "label": 1}
{"text": "Oh no! Anyways", "label": 1}
{"text": "It isn't a matter of  trust. It's actually a matter of trying to help out the Indian government. \n\nIt really wouldnt look good on India if day 1 Canada made all of the information about high ranking Indian officials murdering people in other countries public. There are so many reasons to do a joint investigation. For Canada it's to show respect to the Indian government, and for India, it's so that any information uncovered, they can say \"Hey look, we found this going on, and we're going to remove these people from power\"\n\nIt's kind of wild that they'd be against helping out the investigation. And it almost seems like a deluded way they're trying to show China and Russia that their ideals line up. But it's just not going to turn out how they hope.", "label": 1}
{"text": "https://preview.redd.it/7hwdefjlj8yd1.jpeg?width=320&format=pjpg&auto=webp&s=e6e1a23bdf9eedc7a22d3363bf6b0cd25d751c37", "label": 1}
{"text": "Idk bro better hated than walked all over. I don't want IED blasts throughout the country by khalistani terrorism. Better send a tough message first to save the lives of innocent civilians.", "label": 1}
{"text": "Lol entire post is full of insecure non vegetarians who feel bad about their lifestyle when people choose not to eat meat.", "label": 1}
{"text": "Looking forward to reviewing the evidence. Otherwise it's pretty much a ploy to cash on the anti-Indian sentiment in Canada.", "label": 1}
{"text": "> Stop shitting on the streets first\n\nAh, the classic we all were waiting for. No wonder Brits ruled us for 2 centuries.", "label": 1}
{"text": "He even posted this on paknarrative. Bruh, what's this got to do with Pakistan?", "label": 1}
{"text": "By now it is clear that Washington Post articles on this matter are handouts by Canadian government.", "label": 1}
{"text": "Canada is a problematic country for Modi. India should attack Canada,like Israel is attacking Iran.", "label": 1}
{"text": "By the time the USA elects a woman that too a half Indian half black woman as president the infantile third class troglodytes will bitch themselves into the rouge state category.", "label": 1}
{"text": "Learn the Language you fucking piece of Classy shit. Or fuck off and get your ass to shit hole place where you belong.", "label": 1}
{"text": "What I can understand is that some people have problems with firecrackers during Diwali for two reasons. The smoke causes air pollution. And the noise is not good for animals/pets.   \nI suggest them to do (or at least talk about) the following two things:  \n1. Ban firecrackers altogether be it Diwali or New Year's Eve.  \n2. Ban animal slaughter during Eid or any other occasion. \n\nDo these, then we may consider not bursting firecrackers.", "label": 1}
{"text": "India newspapers are joke.\n\nhttps://preview.redd.it/vimtni91s9yd1.jpeg?width=996&format=pjpg&auto=webp&s=3c1228c735fc2c967d5025c62ab65dcc451ff201\n\n4 Companies and 3 individuals have been sanctioned.\n\nWhere did they bring the 19 number from?\n\n[Four Indian companies among 400 sanctioned by US for ‘enabling’ Russia’s war in Ukraine](https://www.newindianexpress.com/world/2024/Oct/31/four-indian-companies-among-400-sanctioned-by-us-for-enabling-russias-war-in-ukraine)\n\n[US sanctions four Indian firms for allegedly supplying equipment to Russian companies](https://scroll.in/latest/1075128/us-sanctions-four-indian-firms-for-allegedly-supplying-equipment-to-russian-companies)\n\nAnd those people making jokes on Modi and Jaishankar, this has nothing to do with India-US govt to govt relations. Get educated on things you have no idea of instead of making memes.", "label": 1}
{"text": "So I request you all to leave your cars and use public transportation for some a week, it will be benefit more than crackers ban.", "label": 1}
{"text": "Lol I can agree with the first thing. So how is slaugtering of animals gonna help? So by that logic we should be all be vegetarians? And a blanket ban on slaughtering animals should be enforced? Be it eid or any other day? \n\nUnless you're just butthurt and think people are out here to defame your religion, mind you most of them educated Hindus themselves. And you feel the need of whataboutism.", "label": 1}
{"text": "They will ignore your comment since it doesn't suit their agenda", "label": 1}
{"text": "I think he means mass slaughtering  may be", "label": 1}
{"text": "if the outrage was consistent, we’d see the same passion *all year.* but if it only comes up when diwali rolls around, yeah", "label": 1}
{"text": "51% of air pollution is caused by industries, 27% by vehicles, 17% by crop burning. One day bursting crackers will not make any huge difference. This is also an industry which is a main source of income for many poor families. As per report, the air quality normalizes within 24 hours. We don't even have enough air quality monitoring stations in the country.", "label": 1}
{"text": "The fuck? People NEED to get around. People don't NEED to burst crackers. Stop with the fucking victim complex. \n\nRoll on the down votes", "label": 1}
{"text": "Public transport is so bad it could not handle the population at all. Not to mention people buy personal cars cause the current PT situation is bad already. Crackers are not traditional at all they were brought from china (not to mention invented in china as well) first mention of use in india was in 1400s. If you do still want to burst crackers, do remember china exports 82% of all crackers produced in the world. Indian brands just put their stickers on these crackers, don’t support your enemies. Keep your neighbourhood and lungs clean.", "label": 1}
{"text": "Yes it will ... But buses are something we do not buy.. it is up to the govt to maintain infra. I have seen local buses of UP, Delhi, Tamil Nadu, Jharkhand, Bengaluru. And I know it is not adequate for such volume of people. Using e-rickshaws is more inefficient method, these folks are uneducated, and drive carelessly, causing chaos on the road and God knows where they charge their rickshaws, probably stealing electricity from some place. \n\nHowever, things like switching off lights when not necessary, using less water, stopping taps in between uses, giving garbage to waste disposal companies instead of regular koodewala, reducing burning crackers is something we can do from our side to reduce.", "label": 1}
{"text": "see them roll now lmao", "label": 1}
{"text": "Sir, if that is what you think, pleas keep on bursting crackers.", "label": 1}
{"text": "Even if i stop, the air quality will still be same. They stopped crackers in delhi but did it change anything? There are no proper environmental protections in the country.", "label": 1}
{"text": "Yeah just bursted couple of them more cuz you bring out the AQI only on Diwali. Stop nitpicking and have fun else stay indoors and sleep.", "label": 1}
{"text": "I suggest you look at the data over a period of time and see that this is a problem. Just because your lungs don't die every Diwali doesn't give you the right to assault others who suffer. Plus old people get headaches due to the sound, also they are more susceptible to pollution. Yesterday I counted at least 5 rockets that landed ON the highway in Mumbai while cars were driving on it. If you want to light a firecracker you should take responsibility for whatever problems it causes period, if you don't want to don't light it. As I say, \"Be the pataka don't light the pataka this Diwali\".\n\nAlso, the public transport argument is idiotic. Most people use any form of transport to go do something they need to. Bursting firecrackers isn't a need, its a privilege sorry. Tell me I have a religious angle and I'll tell you that I doubt thatin any scripture is it given that you burst firecrackers and cause others to suffer.    \n\n  \nDownvote me if you want. I'll care for about 10 minutes and then realize that I should be happy to not match the standards of people without a shred of empathy. I almost had to be hospitalized one fine Diwali due to this bullshit smoke (and yes it was because of the Diwali smoke because rest of the year I was fine) and I got no sympathizes for anyone who supports bursting these many firecrackers I am sorry.", "label": 1}
{"text": "Did it actually stop in Delhi?", "label": 1}
{"text": "His food, his rules.", "label": 1}
{"text": "The road is a public place , if he is doing something religious , she should also be allowed to do namaz right on that road. right beside whatever fuck that was , because clearly it wasn't charity , but some religious bigotry.", "label": 1}
{"text": "Ghatiya comment hai, no arguments whatsoever. Har chiz me agenda mat dhund bhole andha ho jayega. Jitna respect hai traditional festivities ke liye usse jyada respect dharti ke liye hona chahiye. Just because there are other ways to do something impactful doesn't mean iska koi impact nahi hota environment pe. \n\nDelhi dekhi hai Diwali ke baad kabhi? Sabki health ki maa behen ek ho jaati hai and I have relatives there too. Stop pretending that crackers never harmed anyone cause they do, fucking idiots.", "label": 1}
{"text": "His food his rules uncle did nothing wrong here obey and receive the food or f off", "label": 1}
{"text": "Yeah, doing any activities in public places without prior permission should be banned. But I didn't say anything about the road. This is a straw man agreement.", "label": 1}
{"text": "\\>Eat from a Hindu charity\n\n\\>Refuse to respect Hinduism\n\n\\>Pretend to be entitled to free food at the expense of religious sentiments\n\n\\>Cry like a b\\*tch in response to social media backlash", "label": 1}
{"text": ">afghanis\n\nDon’t fucking group us together, you delusional prick. We are NOTHING like you. We smell just fine, and that’s because we shower and actually have good hygiene. \n\nYou can go ahead and keep lying to yourself, pretending that the reason you stink is “spices” and “curry” lmfao. Sure, it might contribute — but the reason the smell lingers is because Indians generally have terrible hygiene\n\nThe funniest part? You know I’m right. That’s why you desperately tried to throw other (superior) groups of people into your dumbass argument, in a weak attempt to drag them down with you 😭", "label": 1}
{"text": "What's the point Then?", "label": 1}
{"text": "Ok it wasn't charity. What you gonna do. Go and eat from the gutter if you can't respect someone who is spending money to feed you", "label": 1}
{"text": "I'm not talkng about 'your point' little dawg", "label": 1}
{"text": "I pray y'all stop raising cattle to slaughter them for an occassion. Such things damage our environment beyond repair. Cattle farming, especially for consumption is a major contributor to climate change and global warming.\n\nI also request the entire world to not burst crackers on new year's like they always have. Thank you 🙏🙏", "label": 1}
{"text": "Um, using Lord's name to do acts which are not good. If the person do not wish to share the food with people from another religion/ community, then they can just say it. But asking them to chant lord's name is something over the line.", "label": 1}
{"text": "Check this out please\nhttps://www.reddit.com/r/indiasocial/s/BYjDrCaVfQ\n\nAnd don't lose hope. It can do you wonders if you hang on and continue putting in that effort.", "label": 1}
{"text": ">little dawg\n\nKeep calling me that.i like this. And there's no my point. It's the Lord's point to serve people with equality and love.", "label": 1}
{"text": "Bhai kya hi chutiyagiri hai... How have they turned this to uncle's fault!!!\n\nUncle ka simple rule hai.. me khana de rha hu.. toh mere bhagwan ka naam leke de rha hai.. \nSame cheeze sikh, muslims me bhi hota hai... Food offering hota hai toh bhagwan ka naam liya jata hai!! \"Allah ke naam pe dede\" !! Kabhi suna hai?  \n\nIf a hindu was receiving food he would have simply accepted and received the food may it be at gurudwara or from a muslim...\n\nAbhi muslim ko victim card play karna hai ... Ki bhai mereko charity bhi chahiye lekin me dusre bhagwan ka naam bhi na lu... Toh bhai simply maat accept karo charity... Line me khade rehkar tamasha karke victim card bhi play karenge !!  Ye toh jaanbuch ke kar rahe ho....\n\nAdhi duniya toh charity karegi bhi nahi lekin uncle ko judge karegi!!\n\nAisa hua hai - kabhi kisiko help karo, aur woh insaan alag attitude bhi de!! Ghussa ayega na tumko!! Same cheese uncle ke sath hua...", "label": 1}
{"text": "Funny because why don't they go to muslim langars", "label": 1}
{"text": "Thats for normal people  but these are terrorists", "label": 1}
{"text": "There is nothing wrong with that. The people don't need to be secular, only the government does. And there is nothing illegal happening aswell. \n\nIt's that he's not following his religion (which is to provide to everyone irrespective of religion). The 'not good' is just bad morals.", "label": 1}
{"text": "Bro focus on building your start up. Why are some IITians obnoxious is a waste of time. \n\nStill to answer your question - A lot of IITians have done great things. It's difficult to get into an IIT. There is a reason why companies offer such high packages. IITs no doubt are the best engineering under grad colleges in India\n\n Sundar Pichai , Ashneer Grover, Sachin Bansal, Narayan Murthy, Bhavish Agarwal , Parag Agarwal  etc etc are just a few names \n\nThere is a reason why everyone looks up to ivy leagues. When someone says he is from Harvard , you know that person is different. Same goes for IITs \n\nPS - Not all IITians are obnoxious. Maybe you met a different lot.", "label": 1}
{"text": "I m really concerned that you can also vote.", "label": 1}
{"text": "Why do these people need food from kaafirs. Let’s stop spreading fake news. The truth is these people want to show how bad Hindus are. But reality is so far from the truth. Truth is they take the food and then throw it in trash while the real needy lost a chance to actually get the food", "label": 1}
{"text": "So, we are going to dictate what individuals do now? The man refused food he was distributing, to someone he disagreed with. That is to be regulated now?\n\nAnd atheist seculars are going to teach us about our devis and devtas?", "label": 1}
{"text": ">bad morals\n\nThanks, man. i was searching for this in my whole brain to find this word. \n\nAnd yeah, i agree with you about that illegal thing.", "label": 1}
{"text": "His device , his post . Why are you pissed now?", "label": 1}
{"text": ">he is doing something religious ,\n\nProviding food to people is religious work? \n\n>she should also be allowed to do namaz right on that road.\n\nI think you mean the side of the road/footpath. I doubt the guy had erected his stall in the middle of the road halting traffic. Also, guys piss and erect shelters, sell fruits and vegetables on the side of the road. I doubt anyone would care if she did namaz there.", "label": 1}
{"text": "Crackers cause .5 Mega Tons of CO2, while Transport in total 345 Mega ton, if we can reduce only by 10% we can cut it by 30 Million, 60x more than crackers that will be impactful.\n\nMumbai people uses local trains for their daily works, car is also a luxury to them.", "label": 1}
{"text": "I am not doing anything in the name of god, which is supposed to be a universal subject btw. If I do something in the name of god . Sure you can judge me", "label": 1}
{"text": "Then, the NGO will decide. You and I don't.\n\nIf the NGO agrees with him, are you going to ban it? Why?\n\nCause they have a preference? Easy to see how much of a slippery slope this is.", "label": 1}
{"text": "What's wrong in asking to say 'Jai Shri Ram'? People are making issue with it.. Despite of any religion person who respects Indian culture and Prabhu Ram will not hesitate to say 'Jai Shri Ram'. People who hesitated to say 'Jai Shri Ram'  or 'Vande Matram' what's there loyalty towards the Indian culture?", "label": 1}
{"text": "are you saying it was a religious ngo? And I still believe you should not be doing your religious charity in front of a hospital if It is going to be exclusionary", "label": 1}
{"text": "Finally someone have courage to say this. People are creating unnecessary issue with this.", "label": 1}
{"text": "in case you don't know, this is a social media platform. no one's deciding anything here. everyone's discussing stuff based on their personal moral code. i hope this helped.", "label": 1}
{"text": "That's exactly the point. That's discrimination 101 \n\n\nWhat does this guy achieve by that? Does the god give him more blessings? Is he converting anyone? \n\nPretty sure none", "label": 1}
{"text": "And the company is getting hate for that is warranted.", "label": 1}
{"text": "It was a goddamn NGO...", "label": 1}
{"text": "Can you show me how many people die due to air pollution in this 7 days span. I want to check if it is a far off the chart or close to median.", "label": 1}
{"text": "Who cares bro its what he desires as he is providing a simple chant if u dont want to chant leave is not doing this to show how great his religion is and in reality it shows the phobia of people are having against hinduism these days", "label": 1}
{"text": "No denial.", "label": 1}
{"text": "Yeah sure, Delhi is polluted the whole year but you get amnesia and you forget the stubble burning and your vehicle emissions. \n\nYes, i understand your concern and trust me i have the same concern. \n\nBut why do these posts become a hub on attacking tradition and North indians?", "label": 1}
{"text": "You have an opinion. I have one that is different. I have no clue what else you are rambling about.", "label": 1}
{"text": "Yahan pe itne acche acche log hai. Itne uchhal vichar hai sabke.", "label": 1}
{"text": "Also shows the developing xenophobia of few Hindus. Which is concerning.", "label": 1}
{"text": "Yes but come after like 7 days it will all be gone, but the main issue will still be there. Fixing the infrastructure will benefit in the long run.", "label": 1}
{"text": "Bhai Private event tha unka, unki marzi itna hi shauk hai to rakhwa lo event khudse aur khilao sabko khana kon mana kar raha hai..\n\nAur agar uss mahila ko dikkat hai bolne me to hai bhai dikkat humko usko khana khilane me, jaise uska majhab hai waise humara bhi to dharm hai", "label": 1}
{"text": "Ok, i respect your view and the fact that you have put it forward in a manner fitting a debate/discussion. \n\nWhile your perspective has merit when seen in an one-dimensional manner , i.e : a conditional exchange of goods needs every condition met for the exchange to be honoured. \n\nHowever, here - we are talking about food and that too in an environment where it has significant value and need; how do you let another person go hungry just because they don't buckle to your ego ? When you come forward to donate - just donate; he didn't have the right to make another person feel insulted. \n\nWhat has he gained by putting the condition in the first place ? If he was out looking for 'good karma' , I think he ruined it for himself.", "label": 1}
{"text": ">Attacking the weakest version of an argument while ignoring stronger versions \n\nExactly and that was not in the original argument to begin with .      \nIt would have been a strawman if the other user had said, \"In the original video there wasn't any hospital\" or \"God would never say that don't insult me don't make up things yourself 🤬 \" \n   \nThe logical fellacy that user's argument has is slippery slope fallacy", "label": 1}
{"text": "This list is just a small part of the Koran. There is much more misery in the Koran.\n\nBut with these texts children are raised. If you behave according to these texts then you are pious.\n\nAll tensions between Hindus and Muslims have their origin in the Koran.", "label": 1}
{"text": "Try To Convince Muslims With That Shit U Wrote Above \n\n\nWe Believe All Gods Are Same But They Dont", "label": 1}
{"text": "Thanks for the vocabulary addition", "label": 1}
{"text": "Allow me to steal this my friend 🤝🏻", "label": 1}
{"text": "Y r we converting this into Hindu Muslim? Can't we just follow our customs and complete our karma and let them do theirs? Y this discrimination? Y the riots?", "label": 1}
{"text": "YES!!!", "label": 1}
{"text": "Humans being a tribal animal have always been affiliated to his tribe. May be this tribal instinct is a bit more in this person. I would just let these kind of things go. \nIf you want the food just take it and do what he says, otherwise dont take the food. It is not like this happened in a school by the school authorities or in a ration shop. \nJokers like these would be found everywhere, you dont have to react to it. Let it go. \nIf you want to taste the food, do it and do what he says otherwise just leave. \nAs I said earlier the person who wanted to take the food was not a poor or homeless person. If it were my answer would have been different.", "label": 1}
{"text": "Oh cmon the poor guy is being dragged through the mud. It was a charity case as shown. He was just distributing out of the goodness of his heart. If saying 3 words is more harmful to the woman instead of feeding her family then that's your answer right there", "label": 1}
{"text": "Zahil", "label": 1}
{"text": "Some people are ok believing a nuke called brahmastra exists I’m sure it’s easy to convince people who ask Selena Gomez to say jai shri ram that hanuman cheeks clapping inspired people in ayodhya to invent fireworks. \n\nI like how your first sentence is phrased, believing Ram existed while not believing fireworks existed.", "label": 1}
{"text": "No it wasn't Mr unpopular opinion", "label": 1}
{"text": "The average \"non-chaddi\" (as you refer some specific group as) is no less toxic than that. So stop politicising.", "label": 1}
{"text": "Delhi metro are bad? Or just inconvenient for your entitled ass? Everyone with the diwali arguement is missing forest for the tree", "label": 1}
{"text": "I want to promote fraternity and brotherhood between all, and that is what I will do", "label": 1}
{"text": "Since you need to be convinced of the obvious go read.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC6285675/\n\nThere are about 10 more studies on Diwali and it's effects on health, but if you want me to sum them up it the conclusion comes out to be \"Fuck, this shit is actually bad for us and we need to do less of it\". \n\nThen go read about High AQI and it's effects on health, cancer risks upon exposure to high AQI, studies on effects of AQI on children and the elderly, tissue inflammation and high AQI exposure, etc etc. \n\nDon't know how deep down the rabbit hole you need to go or if you even want to but yeah, whatever. I'm not gonna spoon feed you stats, go take some efforts like I did.", "label": 1}
{"text": "Your point about 'disregarding' these trivial matters is spot on.... The more coverage these people get, the worse the situation becomes. Too much of our screen time is spent watching and reacting to idiots.", "label": 1}
{"text": "I made the list a bit longer, to a better understanding what is going on.", "label": 1}
{"text": "Oh so you don't have a problem with \"Mera abdul alag hai \" shit people write to mock???        \nCause it would be quit hypocrite of you to oppose that generalization and yet pass on statements like this           \nDon't become the ones you are trying to fight or you would be just another dick", "label": 1}
{"text": "Agar vo kalko bolde ki bolna padhega to jo free mein le raha hai usko bolna padhega agar chahiye to . It may give the givers a sadistic pleasure , lekin jisko free food mil raha hai unka to badhiya hai na", "label": 1}
{"text": "Nope, don't be an idiot all religions god aren't the same, especially the abrhamic gods are not even gods. There's nothing spiritual in abrhamic Ritual. The god is angry and arrogant . It's not the same. Please read", "label": 1}
{"text": ">Put  a board so people don’t have to wait and find out.\n\nYeah that he should have done\n\n>People like you and these idiots don’t have anything to do with religion \n\nDebatable", "label": 1}
{"text": "thank you for your contribution.", "label": 1}
{"text": "There is a reason corporations do not operate out of bihar. Biharis are the scum of the earth. I have been livimg here for 4 years and they deserve every ounce of hatred.", "label": 1}
{"text": "Finally someone who is sensible.", "label": 1}
{"text": "No stone peddler and hater are feeder 🤙", "label": 1}
{"text": "So whats the problem in chanting god's name? Why cant the lady simply chant shree Krishna's name?", "label": 1}
{"text": "Isn't this the same way we justify untouchability", "label": 1}
{"text": "so what stopped the lady from chanting shree Krishna's name", "label": 1}
{"text": "Isn't this the same reasoning we can use to argue untouchability", "label": 1}
{"text": "I am under the impression that they r of another religion, n are being forced to convert", "label": 1}
{"text": "Ikr, jkjk", "label": 1}
{"text": "It's not his food his charity or his money it was from a NGO he doesn't get to decide shit", "label": 1}
{"text": "Wait, isn't this guy giving prasadam? It wasn't food distribution, it was prasadam distribution. Isn't Prasad by definition is meant for devotees?", "label": 1}
{"text": "Bro, let us not criticise any religion or God. If I take the example of the Bible, it wasn't written by God, but his followers, and is an interpretation of gods teachings, which is extremised to a groups liking. If u make notes about the top 10 key pointers of each religion, you will find out that they r the same. Plz consult the recordings of Shree Ram Krishna Param Hans Ji. He was the guru of Swami Vivekananda. Hare Krishna", "label": 1}
{"text": "Plz elaborate", "label": 1}
{"text": "Do you even understand the meaning of Bhandara?\n\n Bhandara is Bhagwan ka Prasad, something sacred meant as an offering from the divine. If someone doesn't believe in Bhagwan, why should they desire the Prasad? This is such a simple concept—why is it so difficult to understand? Why spread unnecessary propaganda around it?", "label": 1}
{"text": "Okay no one is gonna argue about Delhi air. It is indeed polluted for the whole year, but let's burn some crackers cause we're fucked anyway, right? Let's be adults and speak rationally. \n\nIt's not like I don't have fun during Diwali and that means I must hate the entire festival, not at all. I love Diwali. \n\nBut the point you and the initial comment made earlier, that the situation is super bad as it is, so let's not worry about crackers cause they're not THAT bad is completely a weak one. Jitne bhi tareeke hai kisi buri chiz ko rokne ke sab aazmao. Don't say pehle tu gaadi chalana band kar tab me apne fatake fodna band karunga, that's childish and irresponsible. I've heard it so many times and people think it's a great argument but frankly these people shouldn't even be allowed to vote. \n\nWhy not embrace the parts that really bring the community together while doing away with the traditions that have outlived their purpose and are evidently harming the air we breathe? \n\nAQI affects everyone, north south east west sabke lungs chudte hai.", "label": 1}
{"text": ">The thread that united it all was kindness and tolerance and welcome and let people do whatever the fuck they want as long as it isn't hurting others\n\nAll of these things are antithetical to Indian sensibilities. A majority of Indians are a boorish people lacking empathy, modern sensibilities, and the slightest hint of integrity. Look at it this way - if you let in people with inferior cultural values and cutthroat social propriety, you'll end up with snake its in your midst. Pretty soon they'll poison the well and your surroundings, leaving the rest of you behind in the dirt while advancing themselves at your cost. It is very important that you deracinate whatever Indians you already have before letting in a whole new batch.", "label": 1}
{"text": "U deliberately avoided the part where i mentioned ditching cars for just a month, bcz u can't. You don't want to. You are not willing to. \nAnd there are other states too where air quality is better than Ur Delhi, at least let them enjoy the festival. ,if u are concerned about delhi, show it in ur actions rather than arguing with me. \n\nTo unite Communities, i wonder how traditions of Diwali is dividing people?\n\nHave some shame, don't act so righteous, we know how two faced this whole argument is. \n\nIdiot.", "label": 1}
{"text": "Tmlog ka yahi to h jhoot Etna baar bolo ki sach lagene laag jaye😂😂\nIdiots 🤣", "label": 1}
{"text": "No its not, stop spreading your asslike content", "label": 1}
{"text": "bilkul shi kiya, ese logo ko to laat marke nikal dena tha lekin bs khana nhi diya", "label": 1}
{"text": "LMAO I'm sorry that second paragraph is the funniest shit I've ever read 😂😂 I was laughing so hard, it felt like a scene out of Diary of the Wimpy Kid. You being afraid that the European woman would think it was you 😭😂😂", "label": 1}
{"text": "Please make a post like this on 31st December as well, in fact then you'll be able to show the world map", "label": 1}
{"text": "I am doing this every day. Will make a timelapse of it", "label": 1}
{"text": "Err.. I don't drive cause wfh baby. I don't live in Delhi either, I live in Maharashtra I just mentioned Delhi cause it's our capital city and some of my relatives live there. Bas assume karke nikal pade nai? \n\nYes let others enjoy by suffocating their own future generations, why not?\n\nYour whole \"tu gaadi chalana band kar tab me fatake fodna band karunga\" is not a point of division between people breathing the same air? Wow Mr. Dense you're making this too easy.\n\nAnd also, you're the one defending bursting crackers despite knowing the evidence and you want me to feel some shame? Sorry grandpa but your kids won't be able to go out without respiratory issues in the future. Tab unko bolna padosi ne gaadi chala di toh me bhi fatake fod raha tha mera do kaudi ka dimag lekar.", "label": 1}
{"text": "!Remindme 60 days", "label": 1}
{"text": "I will be messaging you in 2 months on [**2024-12-31 14:03:04 UTC**](http://www.wolframalpha.com/input/?i=2024-12-31%2014:03:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1gh1z9q/annual_smog_party_of_india_continues/luux2qr/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1gh1z9q%2Fannual_smog_party_of_india_continues%2Fluux2qr%2F%5D%0A%0ARemindMe%21%202024-12-31%2014%3A03%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201gh1z9q)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "label": 1}
{"text": "You forgot to mention loudspeakers at mosques... not everyone wants to listen to Azaan at 5 in the morning every day.", "label": 1}
{"text": "Yeah I think my loudspeaker statement included the use case.", "label": 1}
{"text": "More auto theft, bribing to get driving license, more truck collisions, more crimes in general…. More scammers. Pooping on the beach, stealing candies and house decoration during Halloween. Yea… you guys are great!!!!", "label": 1}
{"text": "His money, his service, his decision. He is not a politician, but masked woman could be Rilohingya, and boom anytime. Safety first.", "label": 1}
{"text": "The glacier is melting, Please do appeal to the world to Ban Fire crackers all over the world. \n\nPpl who bcm more conscious of nature only during festivals forget their houses are made on the grave of so many trees. \n\nU don't drive a car, okay \"Honey\" i don't burst crackers either, U are God send messenger on earth, Its good that u are concerned about only on Diwali, but isn't it a fact that Delhi 's air is bad throughout the year, Why i see less and less people talking abt stubble and waste burning. \n\nDiwali is just for a day, But that pollution you are crying abt is for the whole year. Why do you lack enthusiasm then? \n\n>\"tu gaadi chalana band kar tab me fatake fodna band karunga\"\n\nHow is it dividing communities? \n\nIsn't it a fair argument for some entitled people who buys luxurious cars and Become Gyani on Hindu Festivals? Why it is that you wake up as an activist only on festivals? \n\nIf u really care, take actions everyday, don't just bcm activist on Diwali. \n\nAnd Yes let kids have fun while you, as an Adult (you speak like a child though) and ppl like you shd  plant some trees, take public transport and Speak against main causes of Pollution given the \"evidence\". \n\n🙄 \n\nWhy not give you some homework till next year:\n\nFor the whole year, plant trees, stop farmers from burning stubbles, stop people from using cars unnecessarily, stop people from burning waste, and stop people from killing animals on festivals and spread awareness like peta does 😊 \n\nThen we, seeing u r not just another hypocrite, moved by your sincerity for the next generation, will stop bursting crackers.", "label": 1}
{"text": "imagine giving a bag of rice and converting people... sounds like blasphemy... no one does that.  \nHe just asked to chant his God name.", "label": 1}
{"text": "Disgusting. You are not a person of reason or decency. No wonder you ignored the chinese invasion of our economy and traditions, while also defaming our historical icons. What a shame that such people think they’ll preserve our traditions while being such hypocrites. I hope you change and be a better person in the future.", "label": 1}
{"text": "One question: where were you all when a muslim society in maharashtra didn’t allow hindu households to put lights on diwali? Please stop this one sided hate. Yaha tou charity kar raha tha ek banda, waha tou apne khudke ghar ko sajane ki baat thi.", "label": 1}
{"text": "got it so your god's ego and thw follower's ego is so fragile that it needs to be pleased by a barter system you take my god's name and i will give you food", "label": 1}
{"text": "Seculars are gonna have a field day when they find out this is exactly what Christianity did", "label": 1}
{"text": "beggars can't be choosers. he can call it langar bandar langoor whatever he want. he is doing it with his own money and if you can't abide by his conditions then respectfully GTFO", "label": 1}
{"text": "Even I have read about it that a few hundred years ago people didn't worship Ram. He was considered a king.", "label": 1}
{"text": "Everything happens for the reason... otherwise Hindu community wouldn't allowed them to stay here 😕 n the Hindu land even after the religious based partition of 1947... consequences the terror attacks right from the Mumbai blasts of 1993,2006,2011 to  Pulawama2019 Reasi 2024 we all know that this terrorist community are not only present across the border but within our nation too who are they..", "label": 1}
{"text": "tab social media nahi tha na, abhi log dekh sakte kahan kahan logon ki vulnerabilities ka fayeda uthaya ja raha hai, pehle to chup ke karte the", "label": 1}
{"text": "Yes but there have been several incidents of muslim being beaten up because of doing namaz on road side. If you have seen bhandara's they happen on road , often halting traffic. At least it is like that in UP. Here is an article of police man beating up a muslim guy for doing namaz on road : [https://www.indiatoday.in/cities/delhi/story/delhi-cop-kicking-muslim-men-offering-namaz-inderlok-road-video-2512337-2024-03-08](https://www.indiatoday.in/cities/delhi/story/delhi-cop-kicking-muslim-men-offering-namaz-inderlok-road-video-2512337-2024-03-08) .   \nOkay I confused it with bhandara , My bad on not seeing the whole video , I assumed it was something similar after reading just the headline. But my point still stands. Since the road doesn't belong to him , she can do whatever the fuck she wants on the very place he stands , since he doesn't own it , so his my food , my rule argument only applies when he is doing it in a private property.", "label": 1}
{"text": "people dont understand Ram. aisehi nahi unko maryada purshottam bolte hai. is kaka ne toh khana nahi diya, Ram hote toh ye radical mazab ka ek tinka nahi bachta", "label": 1}
{"text": "Maleachho/rakshaso se bhagwan naam bulana purani pratha hai hamari...  As tusidas jii depicted in shri ramcharitmanas.. \nजहँ कहुँ फिरत निसाचर पावहिं । घेरि सकल बहु नाच नचावहिं ॥\n दसनन्हि काटि नासिका काना। कहि प्रभु सुजसु देहिं तब जाना।।4\n\n\nघूमते-घूमते जहाँ कहीं किसी राक्षस को पा जाते हैं तो सब उसे घेरकर खूब नाच नचाते हैं और दाँतों से उसके नाक-कान काटकर, प्रभु का सुयश कहकर (अथवा कहलाकर) तब उसे जाने देते हैं।॥4", "label": 1}
{"text": "Stop raising cattle altogether. We don't want animals on the road. People act as if there's nothing wrong with that.", "label": 1}
{"text": "Internet has no problem when a m#slim screams their chants🤡🤡 bloody pseudo seculars", "label": 1}
{"text": "Engagement increasing tactics by satish acharya newspaper sales seem dwindling.", "label": 1}
{"text": "omg exactly. every time theres a minority group speaking out against stuff like this, hindutva ppl want to reply with \"hum toh kaafir hai, humse kyu baat karrhe ho?\", glad you gave it terminology, i will use that next time", "label": 1}
{"text": "question: Would a non-Hindu person feel humiliated by this chant?", "label": 1}
{"text": "His food his rules stfu", "label": 1}
{"text": "Manwhile in bangladesh : we dont provide humanitarian aid unless they belong to our community", "label": 1}
{"text": "1. It takes resources, planning and money to start a charity stall.   \n2. His food, his rules.  \n 2.1 If you don't like the rule, go play somewhere else where the rules are to your liking.  \n3. YOU DON'T DECIDE THE RULES OF ENGAGEMENT AS A FREEBIE.   \n4. If you had money, you wouldn't be in line.", "label": 1}
{"text": "There have been several incidents of muslims born in India  bombing Indians( https://en.m.wikipedia.org/wiki/Iqbal_Bhatkal), people going to join ISIS from the state which has the highest literacy (https://www.google.com/amp/s/www.thehindu.com/news/national/india-unlikely-to-allow-4-kerala-women-who-joined-is-to-return/article60677651.ece/amp/),\n\nIf you think every guy who does namaz will be beaten because it happened once or twice then I think you would also say that muslims kill Indians. But I think that's not the case because I have muslim friends too and no matter how many muslims bomb India, i wouldn't think that they would do the same. \n\nAlso, in the video above they are not on the side of the road/footpath but actively occupying the road. The guy who is providing food is not stopping the traffic. You are trying to compare apples to oranges. \n\n\n>my rule argument only applies when he is doing it in a private property.\n\nShe is free to stand in the line until and unless she disrupts others from getting the food. Also, if I buy a dozen bananas and see some poor guy and decide to give one of the bananas to him, it doesn't give you the right to DEMAND a banana from me. The banana is still my property and I have the right to give it to anyone or decline anyone.", "label": 1}
{"text": "Oh boi looks like I touched a nerve. Typing the same circular arguments even after having explained it to you really does say a lot about you. \"Pehle duniya ke saare problems solve karke aa fir baat karenge\" LOL what a sore loser. \n\nAnd you don't know me at all to say that I only wake up during Diwali. Galat kaam galat hi hota hai meri jaan. Get your facts straight before you go around accusing people with that thing you're calling a brain. Aise uncle responses bohot sune hai bhai, trust me you're lowering the IQ of the whole country. \n\nItna sab karke vapas \"pehle tu fir me\" par hi utar aaye na. Uske aage bologe bhi kya uncle apni herd mentality ke bahar do kaudi ka dimag lagaye nahi kabhi.\n\nAt least you're owning it and flaunting it openly for everyone to see. Keep it up!", "label": 1}
{"text": "And guess what! I literally caught a white woman doing that yesterday. Shit people are gonna be shit people.", "label": 1}
{"text": "Personaly donation jana  usaka dil chaye dega woo.  \nand ye randi  rona mat karoo yaha  kar post karne wala bhi muslim he hoga", "label": 1}
{"text": "Why tf are u pakistani", "label": 1}
{"text": "If the person had the privilege to not eat the food, then the person doesn't need that food and it can be given to someone else who might need it more 🤷", "label": 1}
{"text": "No it won't. What's that based on? Cars have a very strict limit on the amount of particulate matter they are allowed to release. I mean can you not damn see the difference in the picture?", "label": 1}
{"text": "Nope- It was food he bought from his hard earned money", "label": 1}
{"text": "You're confusing emissions with pollution. Both are separate things. CO2 emissions do add to global warming, but it doesn't cause asthma and respiratory diseases. Particulate matter, on the other hand, does!", "label": 1}
{"text": "How? When your bhagwad Geeta first page from iskon temple says, Krishna received the word from Brahma.", "label": 1}
{"text": "I'm Indian myself hahaha ", "label": 1}
{"text": "youre a kid op", "label": 1}
{"text": "I wouldn’t want to breathe that air for 1 second. Forget seven days. And let’s not forget that there is a small amount of permanent damage being done during those seven days.", "label": 1}
{"text": "Ban cutting trees for Christmas trees.", "label": 1}
{"text": "The issue is used to further vested interests. \nIn Karnataka the current Congress government wants to impose restriction on crackers during Diwali. But every day at 5:30 am there is Azaan on loudspeaker without restriction. And this in a locality with 99% non muslims.\nWhat purpose does it serve? Like blaring bhajans in a locality where 99% population is non Hindu. \nI am not against any faith. Let everyone celebrate. Treat everyone equally.", "label": 1}
{"text": "It was not meant to be charity food stall though.. .that was prasad", "label": 1}
{"text": "If any charity is done by a person, on his own, it's his choice who he wants to feed or not. Personal liberty matters in every case. So, I don't see what's wrong there. Also, the lady first pointed finger at the person in the video.", "label": 1}
{"text": "Knowing about these argumental fallacies would help you try to have an unbiased opinion and also helps you to argue against these morons. Very useful!", "label": 1}
{"text": "Wait ! I agreed on mistaking earlier , I said my bad on not seeing the whole video and making my argument based upon my general idea of charity food distribution which was wrong.I have only ever seen bhandara during death rituals or navami's from Hindus. So I assumed it must be of similar kind , which was indeed wrong.   \nBut the issue is that he simply can't occupy public space without govt consent , technically. So the argument about his food , his decision is right in the sense , that of course the food is owned by the person and he decides who to give it to , but he then has no right to occupy the public space illegally and can be asked to move away that's all. The argument about food vendors doesn't defend the point either , those are illegal and can be removed whenever the govt wants to do so.   \nAgain there is a difference in a person doing it , and a govt official at duty doing something , there is some authority that comes with a govt duty especially like that of a police officer.   \nGeneralization is ofcourse bad , but when these are not handful occurences and are more common than you think I can scourge more such news articles if you want.   \nAgain if a pattern is observed , that muslims from Kerala are joining ISIS , then the problem must be resolved , similar goes for incidents of such kind. You don't wait for such incidents to rise up. I never said , that every hindu does things like that or something like that.", "label": 1}
{"text": "Clowns come out during Diwali to give gyaan. Take a hike. Try putting similar message on Bakri Eid.", "label": 1}
{"text": "If only idiot OP knew the difference between community langar and a person doing charity from his pocket. Everyone has right to decide who they want to help and on what basis. This woman came so strong on this uncle and went ballistic while she was begging for food. Uncle was serving food and if she couldn’t respect his sentiments she should just fuck off instead of creating a scene. Charity is not a right and no one owes these kanglus anything. Fuck you op.", "label": 1}
{"text": "There should be one more poster, \n\n## convert to Islam or Die \n\nThis cartoon artist is only showing one side of the coin \n# Scammer", "label": 1}
{"text": "Why even bother to make a illustration on how our gods would react,   \njust stop portraying your stupid secular made-up scenarios.\n\nAt this point, just take the win, you got your point across  \nall other religions-1  \nhinduism-0\n\nhappy now ?", "label": 1}
{"text": "Another example of why India is a shit country to live in.", "label": 1}
{"text": "That woman blowed the situation out of proportion.....ram is lord of this land....", "label": 1}
{"text": "I agree. Between you and me, I don't agree with the guys stance. He SHOULD be giving the lady food too but he is not OBLIGATED to give her food. There is no reason to debate about it. \n\nAlso, \n\n>a govt official at duty doing something , there is some authority that comes with a govt duty especially like that of a police officer.\n\nYou would have an easier time trying to find links where police officers have protected the upper caste and beaten the lower caste. \n\nI absolutely condemn the action taken by the police with the muslims but it doesn't mean the muslims were doing something lawful.", "label": 1}
{"text": "Lol. People are so used to the Hindu community being under someone's feet and being the butt of the joke all the time that now when someone stands up for their religion especially against a community who has a history of insulting Hinduism and its followers, people can't digest it, why? cause It isn't cool. The seculars make me laugh.", "label": 1}
{"text": "Thanks for the proof I've edited my comment ✌️", "label": 1}
{"text": "Big whale", "label": 1}
{"text": "Being online warrior is much easy.  Providing food to 10 people is too much work. SWITCH OFF  your computer guys and search every hungry people not chanting JSR AND FEED THEM. Let's end hate with food. Your fighting here doesn't help a single needy man  .", "label": 1}
{"text": "His money and his charity. Who are we to judge him.", "label": 1}
{"text": "https://preview.redd.it/k8zqpoffkbyd1.jpeg?width=1170&format=pjpg&auto=webp&s=988f79c677c2f2693c180c6f3c4fcc5a62524975\n\nAnother side of India too nowadays..", "label": 1}
{"text": "No, it's just about the man's ego. Always trying to hook others with simple ragebaits.\n\nWhat you say is like allah ordered 9/11 or 26/11 or any terror activities. Did he?\n\nIt was a personal choice of this man and you can debate about that but bringing in God's name is just ragebait.\n\nI have used whataboutery, because the basis of your argument is baseless. \n\nTldr: Unless allah is a terrorist, it's not about Shree Ramchandra's ego.", "label": 1}
{"text": "That's the question for the guy claiming everyone is same. \n\nThe allah as in quran doesn't resembles any avatars of mahavishnu. Neither he resembles the actual Trinity or Brahman. \n\nThe way allah is described is completely different from the essence of brahman. \n\nPs: Brahma, brahman, and Brahmans are different.", "label": 1}
{"text": "So you should promote and make sure everyone takes a step, right? Or do you want only 1 to walk the mile?", "label": 1}
{"text": "Uncle was doing charity from his own money. Women started shouting that I won't say your God's name but I want the food. \nYe sketch me piche hospital ka board , ye masala kis kalakaar ka hai ?", "label": 1}
{"text": "achaa Sathish acharya namak vyakti ka h.", "label": 1}
{"text": "i mean if we keep on seeing so called hindutva guys flocking around muslim men and women and forcing them to chant jsr then its a problem with the religon right because how on earth does every hyper religious person feels the need to seek validation from other people saying their so called god's name? and i agree islam has a lot of problematic things which i critisize too but hinduism is much worse especially for women because i dont see maulans going around forcing people to chant allah hu akabr and shit", "label": 1}
{"text": "The kind of Hindu we need.....🫡 Salute to the hindu sher.", "label": 1}
{"text": "I agree. People adopting a literal Chinese invention and calling it Indian ‘culture’ is one of the most idiotic things I’ve seen. Can’t bring myself to even attempt a dialogue with them lol.", "label": 1}
{"text": "These are the absolute worst ..the ones who take a random, isolated incident, blow it up like it’s happening everywhere in India, and generalize like crazy. All for 30 seconds of fame, they’re out here smearing the country in the shadiest way possible, and it’s so obviously agenda-driven. Seriously, to hell with these Posters", "label": 1}
{"text": "His money his rules!", "label": 1}
{"text": "Cough*Halal*cough!!", "label": 1}
{"text": "Only meaningful comment", "label": 1}
{"text": "Shhh..... We don't talk abt that here 🤫🤫🤐", "label": 1}
{"text": "You asked for it , get good at understanding how the world works before commenting shit out", "label": 1}
{"text": "he's giving out food on his own expenses and he can choose whom he wants to give it to and to whom not....he's not working as a govt body which needs to provide for everyone irrespective of religious grounds...he's the distributor here and it's his choice!!", "label": 1}
{"text": "There something called aham brahmasmi aswell", "label": 1}
{"text": "Yeah.!  Selective secularism for the win 🏆 \nI literally read ppl saying that Hinduism is worse for women than Islam.  Like how brainwashed do u hv to be to even think of this with the sad conditions of women living in most of the Islamic countries all over the world .", "label": 1}
{"text": "Please do give a fucking morsel of evidence these people are throwing away their food", "label": 1}
{"text": "This place is a hub for the Woke and “Seculars”", "label": 1}
{"text": "Most temples should allow you to donate from within the premises right?", "label": 1}
{"text": "The comparison itself is wrong. \n\nAlmost every free food or drink or even food materials or drinks or fruits/vegetables are found to be spiked when sold by the muslims.\nWe also see situations wherein the larger demographic aka Hindus are openly forced to obey the sharia rules or the decisions given by the Muslim minority (for example check out the society diwali lighting issue at Mumbai)\n\nIt has been the Sikhs, the Hindus who have always been and shall most likely continue to serve such events like free food services/langars without any deceitful objective.\n\nIt has been seen in the annals of history that the minority claiming group has always done anything of benefit for the larger public interest with some vested motives.\n\nIf the man said that chant the name of bhagwan shree ram and take the food, what seems to be the issue in this. \n\nBeggars WON'T be choosers. If the lady required food for survival, it would not bother what she was asked to say. The closest analogy is that for the poor people, it does not matter what govt comes into power, what matters is the benefit given by the said government. Give them adequate benefits and they would be happy to change their religious stance in a snap of your fingers.\n\nIf the lady wanted food, they could have asked her to even say that optimus prime is our lord and saviour and she would have said so, for it would not have made a difference to her.\n\nLastly, it was the man's food, sponsored by him, organised by him. He has the right to deny the service to the ones he doesn't like and to give food to the ones he would like to give. That's like a random nobody filing a case against SRK for saying he didn't feed him anything. Is he obligated to feed you. Was that man performing some state sanctioned duty. \n\nWas he running some state scheme of feeding the poor? If yes, complaint does lie.\n\n If no, this was a private thing being done for the benefit of whom that man chooses to provide to. As simple as that", "label": 1}
{"text": "Naah, he ain’t too much of a VICTIM to say that. Plus it was never about free food, some people were just born to hate.", "label": 1}
{"text": "How do you find more such fallacies?\nGenuinely asking, i wish to learn about these", "label": 1}
{"text": "UP and public transportation lol", "label": 1}
{"text": "Googling about fallacy or even chatgpt helps", "label": 1}
{"text": "You can get around with public transportation alright.", "label": 1}
{"text": "If this Diwali you are alone, feeling lonely, haven’t enjoyed fire crackers, afraid of fire cracker’s pollution, depressed, etc. Enjoy following virtual fire crackers.\n\nWith sound —-> [Play virtual fire crackers here](https://claude.site/artifacts/55266071-a0f1-4d3f-af04-ea9d00e4dba0)\n\n\n\nWithout sound ——> \n\n>!pop!< >!pop!< >!boom!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!Hisssssssss!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!bang!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!peeoooonnnnnnnnnnnnn!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!faat!< >!PUCHak!< >!pop!< >!pop!< >!pop!< >!pop!< >!peeoooonnnnnnnnnnnnn!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!phat!< >!pop!< >!pop!< >!pop!< >!pop!< >!boom!< >!pop!< >!pop!< >!pop!< >!pop!< >!peeoooonnnnnnnnnnnnn!< >!pop!< >!pop!< >!pop!< >!pop!< >!Crackle!< >!pop!< >!pop!< >!pop!< >!pop!< >!boom!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!snap!< >!pop!< >!pop!< >!pop!< >!pop !<>!pop!< >!pop!< >!bang!< >!pop !<>!pop!< >!pop!< >!Hisssssssss!< >!pop!< >!pop!< >!pop!< >!pop!< >!snap!< >!snap!< >!bang!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!Hisssssssss!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop-pop-pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!phisssssssss!< >!pop!< >!pop!< >!pop!< >!boom!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!duum!< >!pop!< >!peeoooonnnnnnnnnnnnn!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!pop!< >!Crackle!< >!pop!< >!pop!< >!pop!< >!pop!< >!phuut!< >!pop !<>!snap!< >!pop!< >!pop!< >!pop!<\n\n\n\nSource: [Play virtual Diwali fire crackers](https://www.reddit.com/r/IndiaTech/s/yNV7OKZJbo)", "label": 1}
{"text": "Yes you're correct...When someone says \"sat sri akal\" you say it back.. its a way of showing respect...\nIf you can't respect it at least you shouldn't disrespect it...", "label": 1}
{"text": "His money his wish ( if the whole charity was done with his pocket money) \n\nIf it was done by some organization which collects fund the he is very wrong to deny food on the basis of religion", "label": 1}
{"text": "A person whos faith states clearly that their aim is to destroy another people group, to subjugate them and to steal from them has no right to breathe another wad of air.", "label": 1}
{"text": "You know what, diwali is over. I admit crackers are harmful. I don't burst them. Why? I am old. I really don't feel like bursting them. \n\nAnd coming to pollution. Yes, it is always good to remind everyone about the harmful effects of bursting crackers. But crackers are not the only agents causing air pollution. Please remind everyone of the other agents of air pollution. Do it also the other 360 days. \n\nI will say it again. Crackers are harmful. But it is not the only pollutant causing air pollution.\n\nPlease raise awareness about the other pollutants.\n\nSomeone mentioned vehicles in comments. Please, take a bus and leave your cars at home. Do car pooling.\n\nTurn off the light. Some power is still being generated through coal. Burning coal is more harmful than crackers.", "label": 1}
{"text": "31st December? Where do you live, man? We don't burst even 10% of the cracker that we do on Diwali. It's not even a comparison. \n\nIf we have to ban crackers, it has to be banned for all festivals.", "label": 1}
{"text": "Goodness of heart was missing", "label": 1}
{"text": "Food indeed has a religion, if not haram, halal, and kosher won't exist", "label": 1}
{"text": "Shh be quiet", "label": 1}
{"text": "Sikh itne achay hen tou canada kyun nhu bhaag jatay benchod??? Hindustan mein rehna hai tou hindu ban k reh warna pakistan nikl lol", "label": 1}
{"text": "This shouldn't have happened ,charity should be done on basis of humanity not religion. but I think he's reacting to what happened in Bangladesh when some guys cut off the sacred thread from a boys neck and a guys hand while they were accepting flood aid.", "label": 1}
{"text": "Look at the pollution map.. cars are used everyday.. but does the map show red spots everyday?", "label": 1}
{"text": "But what's wrong with that ???..... if u want food from him just do what he ask you to do.... otherwise u are free  to go to anywhere to purchase and eat.", "label": 1}
{"text": "Bc idhar isi desh mein gareeb logo ki gareebi ka galat faida utha ke mutthi bhar anaj ke liye convert krne pe itna rona ni roya jitna ek vyakti ke ram nam bol ke khana lene ke liye bolne pe chal raha hai, usko gali de rahe ho to usko bhi bolo ki jo bol ri ni lungi naam usne kaun sa accha kaam kr diya bhai? koi direct pagal ke trh cheekhne lga hoga kya ki naam lo itne log line mein the kisi me ye ni bola ki us budhe ne badtameezi ki samne se wo trigger hui tabhi baba cheekhe na ki ram nam lene se jb dikkat ho to mt khao yaar, wo kitni kattar hai jisko naam ni lena pr dheet ke trh khana chahiye, kisi ki shraddha hai wo chahta hai ki ram nam ka khana bataunga apko nafrat hai ram se to mt khao uske naam ka khana, main hindu hoon pehli baar punjab ke gurudwara mein lamgar khaya to meko bola gareeb ke tarah dobo haathon ko faila kar haath me roti lo aur naam japo waheguru waheguru, sewa karne ke samay waheguru waheguru ji naam japo ab main offend ho jata aur ye bolta ki ni lunga naam unka khana do to ye kiski badtameezi hai?", "label": 1}
{"text": "Bc idhar isi desh mein gareeb logo ki gareebi ka galat faida utha ke mutthi bhar anaj ke liye convert krne pe itna rona ni roya jitna ek vyakti ke ram nam bol ke khana lene ke liye bolne pe chal raha hai, usko gali de rahe ho to usko bhi bolo ki jo bol ri ni lungi naam usne kaun sa accha kaam kr diya bhai? koi direct pagal ke trh cheekhne lga hoga kya ki naam lo itne log line mein the kisi me ye ni bola ki us budhe ne badtameezi ki samne se wo trigger hui tabhi baba cheekhe na ki ram nam lene se jb dikkat ho to mt khao yaar, wo kitni kattar hai jisko naam ni lena pr dheet ke trh khana chahiye, kisi ki shraddha hai wo chahta hai ki ram nam ka khana bataunga apko nafrat hai ram se to mt khao uske naam ka khana, main hindu hoon pehli baar punjab ke gurudwara mein lamgar khaya to meko bola gareeb ke tarah dobo haathon ko faila kar haath me roti lo aur naam japo waheguru waheguru, sewa karne ke samay waheguru waheguru ji naam japo ab main offend ho jata aur ye bolta ki ni lunga naam unka khana do to ye kiski badtameezi hai?", "label": 1}
{"text": "Delhi chord kai Tier 1 cities ki halat kharab ho gayi hai. Jaipur me kai jagah 350 AQI touch hua tha usually kam hi rahta hai.", "label": 1}
{"text": "Yeah man i totally agree! I'm glad you share the same sentiments and intentions of Christian missionaries. Great job!!", "label": 1}
{"text": "Finally this guy gets it. Someone who properly appreciates the Christian Missionaries agenda. I hope there are more people like you!", "label": 1}
{"text": "Yeah ikr, fuck underprivileged people trying to get away from castism and untouchability. How dare they try to choose a religion for their personal gain and benefit.", "label": 1}
{"text": "Bro is in for a reality check when he learns about how catholics used to treat puritans and other classes of Christians.\n\nComing back to the original comment, everyone is free to choose their religion for whatever reasons. But stop pretending like Hinduism is the only flawed religion. Constantly flinging dirt at Hinduism when Islam is one of the most oppressive religions in the world and Christianity has always used dirty tactics to convert people.", "label": 1}
{"text": "But 1st they ask you to convert to Christianity.... right ???....", "label": 1}
{"text": "Why everyone wants to target only specific community and not others", "label": 1}
{"text": "Uncle ji did a huge favour to the lady in burkha by refusing to serve non halal food. This way, the burkha lady has upheld her sincere devotion to her religion.", "label": 1}
{"text": "Lil bro I'm a Protestant, I'm very well aware of the Catholic History, The Crusades and The Inquisitions. My sect of Christianity was literally formed to PROTEST against the atrocities and exploitation done by the early catholic church which were more interested in power and money over salvation. What I appreciate is the realisation that we were flawed and fighting to change that. I'm ashamed of the history but also proud of our reformation. It's not 100% but it's good nonetheless. But many religious fundamentalists see the growth/change of a religion as a personal attack. Maybe I don't look close enough but I don't see the same level of accountability in India. \"If we were to grow/change that would mean our religion is not perfect and THAT is unthinkable\" I see this sentiment a lot.", "label": 1}
{"text": "Glad that you are aware. Casteism has come a long way. It's still very much prevalent, but we are fighting it. It's going to take more time, but the change will happen. There's plenty of forces acting against casteism, but it's such a rooted concept that change doesn't happen. Hinduism isn't perfect, but most of you pretend like other religions are any better when they aren't.", "label": 1}
{"text": "You do realise that in certain religions, chanting and worshipping another god is basically renouncing your own religion.", "label": 1}
{"text": "It didn't stopped but is very less as compared to earlier but aqi is the same. Also aqi gets more worse during December-January when there is no Diwali to blame.", "label": 1}
{"text": "Then thats their problem.... let them deal with it.", "label": 1}
{"text": "News outlets are good at hiding real names under aliases for secularism, literally everyone can guess what his religious affiliation is, this is islamic activity.", "label": 1}
{"text": "Hey I'm not really a religious person. I'm not a fan of groupthink and mob mentality. Maybe it's because of our huge population and Hindu majority. But I don't see any christian hooligans climbing temples during Christmas and yelling Praise God because that person would be torn apart and burnt alive. But I've seen the opposite happen to churches and there is no outrage because we're just grateful that people weren't hurt or the church damaged. And I get that it's the vocal minority of Hindus that do this, most of the people are chill and are busy in their own lives. But when you're the majority religion you do have a certain power and sense of security that the other religions don't, not to the same extent.", "label": 1}
{"text": "Please don't shit up other countries.", "label": 1}
{"text": "Lmao most empathetic sanghi, great job man.", "label": 1}
{"text": "This diwali I will not buy an ola for reducing pollution \n😋happy?:⁠-⁠)", "label": 1}
{"text": "Bhai saabh phir toh Delhi mai jab India jeeti and when there is new year tabh bhi ban karna chahiye😱😱\nTabh kyu nhi kiya keju ne?😈", "label": 1}
{"text": "Okay I will not burst crackers on new year ,when India wins, at shaadis to compensate to burn on diwali 🥺 \nWill I be good?🥺🥺", "label": 1}
{"text": "When India was struck by droughts and famines, especially around Bengal, Missionaries bribed the starving to convert to Christianity. Most gave in. These conversations weren't out of choice, but desperation. Those who stood up against the unfair conversion practices were denied any food and were left to starve. \n\nComing back to the present, you won't see much violence incited by Christians, but a lot of brainwashing stills happens - most recent was the case of the Indian cricketer, Jemimah Rodrigues', father's involvement in mass conversion. While I agree that Christians are generally more peaceful in India, it's a whole different story outside of it.\n\nNo religion is perfect or innocent. Flinging dirt on Hinduism, in an attempt to shame us for what other religions are doing for decades and centuries, but not holding them accountable for it screams hypocrisy.", "label": 1}
{"text": ">Do you NEED to burst\n\nUm not a need, but what if I \"want\", or \"wish\"?\n\nIf Chinese New year, Christmas and Normal New year all get to see fire crackers for the same reason, \"people just want them, they enjoy it, the sounds, lights, colours all of it\" \n\n:/ And just trying to suppress wishes and wants of one group is what births inhumane racism.", "label": 1}
{"text": "Even jaipurs shaadi causes noise pollution \nRoj subeh 5 am ko some peoples loudspeaker causes noise pollution 🥺\nWe will ban diwalis crackers but about loudspeaker noise pollution da?🥺", "label": 1}
{"text": "It was a Whataboutery Contest and guess what a sanghi won.", "label": 1}
{"text": "The locals have made it clear they don't want you there. However, it'll be infinitely better than living in that dump. Take your call. It'd probably be worth it to move for you but expect resistance.", "label": 1}
{"text": "They are to be celebrated as people who saved the democracy from that witch", "label": 1}
{"text": "Well, your ma is a snake. There's no living creature more sinful than your ma. Actually all women, but I choose yours as an example.\n\nThis is as per Mahabharat.", "label": 1}
{"text": "Society facing its adverse consequences.", "label": 1}
{"text": "For all the people shaming uncle , when Pakistan came into existence ,the population of Hindus in India was 75 percent , yes 75 percent ,yet they have to give Pakistan carved out from heart of British India  they were polite as fuck, but what we got , all the Hindus there are converts or giving jaziya . All the Hindus in comment section against uncle's deed are fake Hindus with fake I'd or who don't know about the religion , hinduism is the most cruel religion of all in whole planet , Bali pratha is the only way to get blessings of devi , also even ravan gave Bali of himself that too 9 times o get a meeting with God Brahma , God Rudra killed his father in law , his Son , God yama , God kamadeva etc. God Vishnu too is cruel , as Shri Krishna avatar he killed many rakshas , his maternal uncle and made Arjun killed half of then population of world also ,he killed the body of bhagwaan khatu shayam or barbarik who was only 14, only to gave Hindus of kaliyug the will to fight and be cruel not polite as hell .Hanumaan ji the most worshipped hindu God killed every next female , like sursa , lankini , who have read tulsidas shriRamcharitmanas will know . How Hindus became  so soft and polite is due to ShriRam and ramayana cause ShriRam was the most polite loving God , so Hindus gurus and parents , political figures , religious figures made Hindus weak . Hindus should again start worshipping the cruel God's and rekindle the love with our roots , being cruel is the only way sustain in this country or else it will not take time to become Bangladesh or Pakistan. Jai shreeRam", "label": 1}
{"text": "Bro needs to go to places where they chant hallelujah😂", "label": 1}
{"text": "Minimum wage in NZ is $23 per hour. By people’s standard in NZ, it is fucking expensive. How long do you think 1.5GB lasts? 4GB per day, data plans cost INR 500 in India for 1 WHOLE MONTH. Interenet speed - India ranks 30th while NZ ranks 33rd. This is what OP has posted, I’m not making it up. You can check out this NZ sub - https://www.reddit.com/r/newzealand/s/Biw57U11aQ where they are discussing the same thing. Not everything in India is bad, stop criticizing your own country.", "label": 1}
{"text": "Yahan bc human rights ni hain, logon ko animal rights ki padi hai.", "label": 1}
{"text": "Then don't call that \"charitable food for all\".\n Instead call it \"Hindu only food\". Show us your True colour.", "label": 1}
{"text": "Bhen ke lund", "label": 1}
{"text": "I will kill him but reporting it to the authorities will be the better option here", "label": 1}
{"text": "The one I mentioned are the perpetrators of modern day extremism the one you are bragging about has never been involved in blasts, or country division activities given the fact that yes they do have criminals but never can be compared to any islamic extremists who go unlimited extents to damage human life and create monopoly over that the one you are asking to ban are the ones who have actively helped in all the natural disasters irrespective of the hit peoples religion.", "label": 1}
{"text": "You can use a hotel. I recommend Visas for Future if you need help.", "label": 1}
{"text": "I asked Visas for Future and they told me to put down no. I ended up just buying it through them. Super helpful.", "label": 1}
{"text": "Never heard this with South Indian parents", "label": 1}
{"text": "You can use a hotel or tour operators info. If you need help, lookup Visas for Future. They're super knowledgeable.", "label": 1}
{"text": "Just say no. I got help from Visas for Future about this.", "label": 1}
{"text": "so fucking tired of this. is there any future in safety of our people.", "label": 1}
{"text": "https://preview.redd.it/k9chn6z0fgyd1.jpeg?width=521&format=pjpg&auto=webp&s=5c05f47b09bf877e257f47e5e50a1ac138bfb62a", "label": 1}
{"text": "Meesho...08100.1242.16..call now is a little tough, but he/she has to accept that there was a wrong transaction made to his/her account. Then, you need to contact your bank and communicate the matter in detail. You may also have to provide ID proof, address, and other details asked by the bank. Communicate the matter in detail via mail.", "label": 1}
{"text": "### How to resolve\nClick on dropdown arrow button and select 'Retry'\nIf issue isn't fixed, send your [log files](https://forums.insynchq.com/t/how-to-", "label": 1}
{"text": "\n\nHow do I refund a wrong transaction in phonepe ...", "label": 1}
{"text": "\n\nHow do I refund a wrong transaction in phonepe ...", "label": 1}
{"text": "Phonepe..08100.1242.16..call now is a little tough, but he/she has to accept that there was a wrong transaction made to his/her account. Then, you need to contact your bank and communicate the matter in detail. You may also have to provide ID proof, address, and other details asked by the bank. Communicate the matter in detailmail.", "label": 1}
{"text": "\n\nHow do I refund a wrong transaction in phonepe ...", "label": 1}
{"text": "Gyhh", "label": 1}
{"text": "Complete and utter nonsense, if you can't afford a city maybe don't try and make a living there. If you turn to crime it's on you, it's not the fucking city, you are a criminal in Mumbai, odds are you will be in Delhi, in hyderabad or even in that village or small town you came from, nothing to do with the city.\n\nPeople are stupid, they migrate without ever making actual plans, especially today where any info you need is available to you regardless of where you are or how much money you have. If you wish to earn a decent living while having no connections, no education and no capital, don't migrate to a fucking tier 1 metro city, there aren't any magical gold mines that you will suddenly discover.", "label": 1}
{"text": "Pigeons are doves. They are rock doves, and I wonder if we began to call them that if people would hesitate to hate them, as doves have that history as messengers of peace. It is true that in my neighborhood nobody hates the mourning doves, dusky and elegant with wings that squeak as if they flap on rusty hinges. They roost on the wires like little Audrey Hepburns, while the pigeons troll the ground, tough and fat, some of them look like they should be smoking cigarettes. They look poor and banged up, like they could kick the mourning doves’ asses but are wise to the divide-and-conquer tactics we use on one another, so they coo wearily at the mourning doves and waddle forth in search of scavenged delights. What you may not know is when you call a pigeon “a rat with wings” you have given it a compliment. The only thing a rat lacks is a pair of wings to lift it, so you have named the pigeon perfectly. When you say to me, “I hate pigeons,” I want to ask you who else you hate. It makes me suspicious. \n\nI once met a girl who was so proud to have hit such a bird on her bicycle, I swear, I thought that it was me she hit. I felt her handlebars in my stomach and now it is your job to feel it also. The pigeons are birds, they are doves. They are the nature of the city and the ones who no one loves. When people say they hate pigeons, I want to ask them if they hate themselves, too. Does it prick the well of your loathing? Do they make you feel dirty and ashamed? Are you embarrassed about how little or how much you have, for how you have had to hustle? Being dirty is not a problem for the pigeon. You can ask it, “How do you feel about having the city coating your feathers, having the streets gunked up in the crease of your eye?” and the pigeon would say, “Not a problem.” You will now stop blaming the pigeon. It is not the pigeon’s fault. The pigeon was once a dove, and then we built our filthy empire up around it, came to hate it for simply thriving in the midst our decay, came to hate it for not dying. The pigeon is your ally. They are chameleons, gray as the concrete they troll for scraps, at night they huddle and sing like cats. Their necks are glistening, iridescent as an oil-slick rainbow, they mate for life, and they fly.\n\nMichelle Tea, Against Memoir.", "label": 1}
{"text": "Culture in BIMARU states to preach about values", "label": 1}
{"text": "10,000 years ago we domesticated them as pets and now they are incapable of survival without humans. They don't even know how to build nests. They are beautiful creatures and we abandoned them because we thought they were dirty since their poop carries disease, but so does any poop if you don't wash it away. They are not rats. They are beautiful and we should treat them with kindness and respect.", "label": 1}
{"text": "https://preview.redd.it/kbnhvfcj3hyd1.jpeg?width=720&format=pjpg&auto=webp&s=cdc3b9a71cd060f046eb05df7bd92c9d26318485", "label": 1}
{"text": "Why is everyone so quick to blame? I drive, and if a pet owner neglects their responsibility, and I accidentally run over their pet, should I really be condemned for it? The driver’s only fault might be speeding (which I think is the OP’s perspective, driven by strong emotions). But it’s ultimately the pet owner's responsibility. Animals move unpredictably, and accidents happen. Don’t be so quick to judge and throw harsh words at the driver.", "label": 1}
{"text": "wrong sub bruh", "label": 1}
{"text": "a) Who are these \"South Asians\"? Let me guess, West Pakistani and East Pakistani [Bangladesh] origin people from the Indian subcontinent who are so ashamed of their Pakistani origin that they call themselves South Asians.\n\nB) It was the khalistani group [of which nijjar was a member of] that blew up Kanishka killing over 250 canadians apart from other nationalities. It is this venomous snake the senior and junior Trudeau’s are supporting and nurturing since 1980s. Canadian citizens wake up.", "label": 1}
{"text": "If he killed your cat then just kill him you will have the best revenge", "label": 1}
{"text": "imagine if it's a 🐮.", "label": 1}
{"text": "You are dumb and don't understand cats. Exploring the instinct of cats. but My cat never goes on streets, stays in 100 metres of my home and is neutered.", "label": 1}
{"text": "Some actually kill and rape and throw acid or snatch on streets.", "label": 1}
{"text": "https://www.reddit.com/r/IndiaSpeaks/s/5QPJcf8LoK   alternative to bjp is not better.", "label": 1}
{"text": "So hot", "label": 1}
{"text": "Sex ashrams for experiments \nSleeping with multiple women even his niece and married women \nHe was a sex addict as he was having sex when his father was dying \nHe probably have ties with britisher as when he was in prison nobody hurt him but other freedom fighters were being tortured in prison \nHe even got time to write a book \nBecause of him other people didn’t get enough creditibility \nIndia would have still been freed without him as maintaining India was highly costly for british and British took damages after the ww2 \nGhandi said Jews deserved to be get killed in holocaust \nHe was extremely racist towards African \nHe said if women was being raped they should keep their mouth shut \nHe made men and women who were not married sleep together and bath together but if they say something sexual or do something then they could get punished as people from his ashrams keep an eye on them when they were even bathing ", "label": 1}
{"text": "Those places aren't india and they don't belong to the streetsh1tter race..", "label": 1}
{"text": "He started acting that way because noone wants to stay with a cheater. You had options. You could have told him. But you didn't. You could have raised a complaint on police station. But you didn't. You could have stopped him. But you didn't. You expect him to accept you? After you cry a river.\n\nCan you describe the sexual assault part.\n\nYou are posting a sensitive topic and asking for opinions and you are keeping it vague.", "label": 1}
{"text": "Getting my popcorn", "label": 1}
{"text": "https://tribune.com.pk/story/1121012/hindu-man-beaten-eating-ramazan", "label": 1}
{"text": "R u fucking dumb? I know there is caste biases. But education is the key for equality. Now, what happens when you take half of the seats present?", "label": 1}
{"text": " My name is Shreyas , and I’m currently an intern with the Muskurahat Foundation, a non-profit committed to providing quality education for underprivileged children. I’m reaching out to ask for your support in creating a brighter future for these young minds.\n\nThrough our innovative programs, we offer **Social-Emotional Learning (SEL)** and **academic support** in small, focused batches. Skilled, dedicated teachers work closely with these children, using engaging activities to not only strengthen their academics but also to empower them emotionally and socially.\n\nHowever, to sustain and grow this initiative, we need funds to pay our teachers’ salaries and bring in additional qualified educators as more children join our programs. Your contribution would directly help fund teacher salaries, ensuring that each child receives consistent, quality education. Every donation makes a tangible difference in shaping a child’s future—and by extension, the future of our nation.\n\nlink - [https://muskurahat.org.in/donate?r=shre8714](https://muskurahat.org.in/donate?r=shre8714)", "label": 1}
{"text": " My name is Shreyas , and I’m currently an intern with the Muskurahat Foundation, a non-profit committed to providing quality education for underprivileged children. I’m reaching out to ask for your support in creating a brighter future for these young minds.\n\nThrough our innovative programs, we offer **Social-Emotional Learning (SEL)** and **academic support** in small, focused batches. Skilled, dedicated teachers work closely with these children, using engaging activities to not only strengthen their academics but also to empower them emotionally and socially.\n\nHowever, to sustain and grow this initiative, we need funds to pay our teachers’ salaries and bring in additional qualified educators as more children join our programs. Your contribution would directly help fund teacher salaries, ensuring that each child receives consistent, quality education. Every donation makes a tangible difference in shaping a child’s future—and by extension, the future of our nation.\n\nlink - [https://muskurahat.org.in/donate?r=shre8714](https://muskurahat.org.in/donate?r=shre8714)", "label": 1}
{"text": " My name is Shreyas , and I’m currently an intern with the Muskurahat Foundation, a non-profit committed to providing quality education for underprivileged children. I’m reaching out to ask for your support in creating a brighter future for these young minds.\n\nThrough our innovative programs, we offer **Social-Emotional Learning (SEL)** and **academic support** in small, focused batches. Skilled, dedicated teachers work closely with these children, using engaging activities to not only strengthen their academics but also to empower them emotionally and socially.\n\nHowever, to sustain and grow this initiative, we need funds to pay our teachers’ salaries and bring in additional qualified educators as more children join our programs. Your contribution would directly help fund teacher salaries, ensuring that each child receives consistent, quality education. Every donation makes a tangible difference in shaping a child’s future—and by extension, the future of our nation.\n\nlink - [https://muskurahat.org.in/donate?r=shre8714](https://muskurahat.org.in/donate?r=shre8714)", "label": 1}
{"text": " My name is Shreyas , and I’m currently an intern with the Muskurahat Foundation, a non-profit committed to providing quality education for underprivileged children. I’m reaching out to ask for your support in creating a brighter future for these young minds.\n\nThrough our innovative programs, we offer **Social-Emotional Learning (SEL)** and **academic support** in small, focused batches. Skilled, dedicated teachers work closely with these children, using engaging activities to not only strengthen their academics but also to empower them emotionally and socially.\n\nHowever, to sustain and grow this initiative, we need funds to pay our teachers’ salaries and bring in additional qualified educators as more children join our programs. Your contribution would directly help fund teacher salaries, ensuring that each child receives consistent, quality education. Every donation makes a tangible difference in shaping a child’s future—and by extension, the future of our nation.\n\nlink - [https://muskurahat.org.in/donate?r=shre8714](https://muskurahat.org.in/donate?r=shre8714)", "label": 1}
{"text": "Well in our scriptures we have tone of rishis who did rule but they never had a family or private property. No where is it mentioned that rishis and yogis can't be ruler.", "label": 1}
{"text": "Lots of ifs buts and probably", "label": 1}
{"text": "Rats are ugly, dirty and smelly yeeew.", "label": 1}
{"text": "Name and Shame the man. Let his students know how disgusting their \"professor\" is.", "label": 1}
{"text": "Anyone who thinks he's a Dictator, either doesn't know what a real dictator is or is completely brainwashed. \nIndian people need discipline. \n1. I saw a guy spit pan masala in Delhi metro (inside the train)!  Now these kind of behaviour MUST BE PUNISHED. \n2. New Delhi railway station, a lady letting her baby poop on the platform behind the tractor. See that tractor pic I attached . Tractor on Platform? \n3. Throwing garbage on the road. \n4. Stealing seats/ cushions from city busses.\n5. Stealing iron dividers installed by government. \n6. Planning train accident by placing cylinder/ stones / etc. \n7. Roads filled with pot holes and no street lights. \n\nI can go on. I hope you got my point. I'm not against any particular political party in India. I just feel the multi party political environment is holding India back as reforms are not possible and nothing gets done on time.", "label": 1}
{"text": "Maharashtra government spent 200 cricket this year itself for publicity of ladki bahin.", "label": 1}
{"text": "they invent!? a tradition? isn't tradition supposed to come out of the religion i.e hinduism here,i assumed tradition is something that's already established by deities in hinduism,that's why they follow it i thought,How do you 'invent' it?", "label": 1}
{"text": "CCPKMKB", "label": 1}
{"text": "Wondering why AQI in my area hasn't changed much. It's fluctuating between 48-50.\n\nJust how relevant is this firecracker excuse being thrown around especially by motivated individuals.", "label": 1}
{"text": "Scam him on social network.  Put out the red flag on all his social account, describing  how filthy he is. Spread the news in the community that he is a dumb ass asking for the dowry.  File a police complaint. Get hold of him and ask for the money paid. Do feel ashamed for asking back your own money.", "label": 1}
{"text": "At least Hindus were saved by bursting crackers. Or else gid forbid Hindus will go extinct if we don't burst crackers.", "label": 1}
{"text": "“This has nothing to do with politics”\n\nTrue it has everything to do with the collective hatred that Bengalis are receiving, for no reason whatsoever. \n\n\n“Impose President’s rule” \n\nShows your allegiance to almighty blowjob party. \n\n\nThe statement passed by Calcutta HC has basically given by Abhijit Ganguly, a class lowlife judge and a current BJP MP, who keeps disrupting JPC meetings regularly with vile inflammatory remarks. Again, shows your allegiance.\n\n\nGuess you haven’t seen too many of this guy’s recent post. How did this same guy find all sorts of business and demographic data from WB, and published the other series of “studies” and maps, if they’re really so difficult to procure and WB govt is not cooperating? “Hypocrisy ka bhi seema hoti hai!!”", "label": 1}
{"text": "So more than a third of people shit in south as well, looks like a pan India problem buddy", "label": 1}
{"text": "Bro north India is fucked up", "label": 1}
{"text": "People drink Camel cola.", "label": 1}
{"text": "need a sense of humour instead of Fear to see the Hilarity in all this", "label": 1}
{"text": "Such a shame you people are wasting your time consuming Indian content and news you tell me the name of your country and i will make you feel worst about your country.", "label": 1}
{"text": "I wonder is they do that same shit in America? Atleast where I live, cop will rip them a new a-hole is they pull stuff like this!", "label": 1}
{"text": "Troubling experience no dear you should thank god you and your family is saved these bullshit people who demands dowry inki demands kabhi khatam nhi hoti lifetime chalti hi kyuki bhikhaaripan inke traits me hota hai …jo paise unke pass hai uske liye take police help asap now days dowry or police works really fast in such cases take the engagement photos also police ke pass as a proof i believe ye sab jldi solve hojayega aise dahej mangne wale log sabse bade fattu hote hai ek police ki notice aate hi wo sab wapis krdenge bas dont be afraid of them", "label": 1}
{"text": "I didn't see any post on India winning the series previously.\nJust saying.", "label": 1}
{"text": "Are you a muslim? If yes then what are your opinions on Bangladeshi hindus! ? They are also being killed and raped by the muslims but no muslim is raising his voice. Do only the Palestinians deserve to live?", "label": 1}
{"text": "You can use a hotel or tour operator's contact info. You can just get a visa from here [https://www.visasforfuture.com/india/](https://www.visasforfuture.com/india/)", "label": 1}
{"text": "Some people are very stubborn.", "label": 1}
{"text": "Dude uk changez khan right? The wild wild ruler, raping and looting ppl. Changez khan ka baccha what is the guarantee that he is telling the truth?\n\nAlso believe whatever you want. 5 percent muslims are good 95 percent are bad. Those 5 percent also support 95 percent only at the time of need. \n\nI don't wanna get raped so i ll stay away from them. You are free to hangout with them . But you can't brainwash me. So good night. Lets stop the convo . Muslims only eve tease, steal and abuse, rape, and change identity to Hindu to marry hindu girls and then kill them.  So, they aint good. \nI dont trust this credible history guy he is sussy. Apna toh modern history ka author bhi leftist and sussy hai but can't do much.", "label": 1}
{"text": "Because most Muslims complain only about this and not about their loud speakers blasting at 5 am and no one likes to listen to hypocrites.", "label": 1}
{"text": "Ohhno...u hit the jackpot lol", "label": 1}
{"text": "If you are that rich and want to get privacy for your kittens! Why don’t you buy a big land, make your own house and do not let anyone live near you. Lot of people do that in USA. Everyone has a problem with Hindu Festivals. Call me andhbhakt or not, IDC. This is Diwali and new year for most of us. You got problem? Move the fu$k out from that area or live with it. \nAlso, worried about street dogs and cats? You can do one thing, take them to your flat and give them shelter!", "label": 1}
{"text": "Womp womp! Go cry or beg somewhere else.", "label": 1}
{"text": "Indians are sheep, someone must lead so they can follow.", "label": 1}
{"text": "Great, just use headphones", "label": 1}
{"text": "Don’t worry we also complain about all noise disruptions during the 10-day Ganpati celebrations with blasting speakers from temples and we speak up about those too. It’s not about targeting one group; it’s about not having anyone’s peace disturbed at all hours. \n\nI don’t see posts complaining about pets and humans getting insomnia from the azan at the mosque even though it plays 5 times a day.", "label": 1}
{"text": "Oh wow, didn’t think you’d actually strike gold with that one! Lucky you... jackpot and all.", "label": 1}
{"text": "Um no i don’t love goats lol. I love beef like the entire world except india. Idk if you tried angus beef. Add some butter garlic and sage u get the best beef steak.", "label": 1}
{"text": "Abe itna kya easy hai jo chop off he kr diya ekdum se ?? Bahar thodi latak te rehte angur ke gucche jaise jo kechi chala di.", "label": 1}
{"text": "Well like most religious whackos whatever you're saying has no logic attached to it. I never asked you your food preferences. It's okay, you tried to hijack this post to portray yourself as a victim or show that being a Muslim is somehow better than other religions but you've all but exposed your own hypocrisy and lack of critical thinking. And I don't think you have anything more worthwhile to say. All the best.", "label": 1}
{"text": "A person doesn't randomly cut someone's Pepe off. 🤏", "label": 1}
{"text": "I know this will happen, and one day it shall be realized. Therefore, I have positioned [a place elsewhere](https://ramakrishnasurathu.blogspot.com) to park your assets that has a future.", "label": 1}
{"text": "Indians are itself a pollution. The pollution of population.", "label": 1}
{"text": "The nice indian guy who cleans my shitty apartment in the center of israwl earns 15$/hour.", "label": 1}
{"text": "This person is doing neither. He is just expressing his opinions which he is free to do in a democratic country like India ", "label": 1}
{"text": "Try saying anything negative about the Gujjus and social media accounts get banned. My own experience. Even if they are truth !", "label": 1}
{"text": "Of course", "label": 1}
{"text": "But sub thinks sex education can only solve the epidemic of rape in India.", "label": 1}
{"text": "Hindus must have provoked them.", "label": 1}
{"text": "Ya, they provoked, saying their demand for separate country is delusional", "label": 1}
{"text": "And? You beat people because you are provoked? The fuck?", "label": 1}
{"text": "So, as per your logic,Hindus provoked them and they came to the temple and beat Hindus up. So it is the Hindus fault.", "label": 1}
{"text": "what are they doing in canada? lol making akhand bharat?", "label": 1}
{"text": "Are you under the assumption that only “akhand bharat” believers live in Canada? And the person who was beaten cannot be innocent?\n\n\n\n\nRegardless of our issues with Canada we shouldn’t just ignore an innocent being hurt by separatists", "label": 1}
{"text": "I hate to say this, but unless all of this boils down to a major 9/11 like terror attack, i don't see Justinder and his allies taking this issue seriously. \n\nAir India flight 182 bombing of 1985 is largely forgotten by the regular folks of Canada too.", "label": 1}
{"text": "The concept of Khalistanis as separatists only work in the context of India. This is a post about Canada. Law and order is upto Canada to maintain. Trudeau has already condemned it. Saying India should stay out of Canada's law and order issues is not defending it. Canada's cops can deal with the attackers. What makes Indians on the Internet think when India attacks its own people for protesting and Canada condemns it, India can use the excuse of 'internal matter' while also putting its nose in how other countries deal with their miscreants.", "label": 1}
{"text": "damn bro divorce incoming lol", "label": 1}
{"text": "Pakis really be Victim shaming in the comments.", "label": 1}
{"text": "You got my 56th like lol,", "label": 1}
{"text": "Khalistanis should do the Sikhs a favour, please do mass suicide, the world will be a better place.", "label": 1}
{"text": ">Why would Sikhs start bombing like 9/11?\n\nGood morning, they've already done that way back in 1985.\n\n>I'm sikh, anti Khalistan and am married to a Hindu so as neutral as you can be.\n\nCongratulations, but then the question is, why do you wanna associate yourself with these folks? What's the point of downplaying their actions, if you've stated that you're against them.\n\nThese people deliberately bring a bad name to sikhism, by going against it's core teachings. Therefore, you shouldn't feel ashamed to call them out, and simultaneously, shouldn't take it personally when others call them out too.", "label": 1}
{"text": "she'll be let off with a fine.", "label": 1}
{"text": "Ur anti-khalistan… ur not neutral.", "label": 1}
{"text": "I hope ganduwaras get attacked at gandunarak jayanti soon", "label": 1}
{"text": "I checked the prices in 1mg, PharmEasy and EasyBuyMeds. And in EasyBuyMeds the prices are cheaper. But in 1mg faster delivery. PharmEasy more range of medicines.", "label": 1}
{"text": "I can relate to this. After I met my German girlfriend, I realized I simply could not date within the Indian community. No offense to anyone, but really, dating here is a sad self-fulfilling prophecy that adds more problems to life than it solves.", "label": 1}
{"text": "Yes I am rebel I do agree on that! And to your point if indeed I end up having a difficult time with my husband and contemplate divorce then it’s my choice and I am only reason for failure. I do not have any right to blame anyone for my divorce and if my marriage is a success then I am also solely responsible for the success. Neither my parents nor anyone have any say on this. I stand for my opinions and myself, if that is what you term it as Rebel, then rebel it is. I have faith in my marriage and believe it won’t end up in divorce. But even if it does I will be fine coz I al strong enough to take care of myself. Good day mate!", "label": 1}
{"text": "I am calling them out lol. But i find it extreme to say Sikhs will cause the next 9/11. Also, let's not forget there's Hindus in that video fighting back. The issue is secular (Hindus and Sikhs) with their own agendas from India try to take them to the western world. Western indian origin folk generally get on", "label": 1}
{"text": "Indian origin people bringing problems from their country", "label": 1}
{"text": "First of all, the original comment wasn't that the sikhs will do another 9/11, just that khalistani organizations won't be seen as threatening unless they cause an incident which is similar in scale to that,\n\nAlso, this might be a bit catastrophizing but can you really say that they won't? We are not talking about *sikhs* here but khalistanis, who have already shown themselves capable of doing such things with the air india attack, and let's not forget about that one guy who keeps threatening indian airlines even today.\n\nLike, I can bet all my money that the majority of sikhs won't be in favor of anything like that and would even be against such separatist movements, but is it really that hard to believe that extremists are going to do extreme things?", "label": 1}
{"text": "What the fuck you are saying ?!\nHow is this relevant here", "label": 1}
{"text": "So, Reddit has weird boner to Sikhs. Every now and then you see LPTs like \"If you ever feel lost in life, find a Sikh friend\" - something like that. When I point out AI 182 and the violent Khalistani moment, I get downloaded to oblivion within minutes.", "label": 1}
{"text": "What's with the number?", "label": 1}
{"text": "Why, it was a joke on 56 inch", "label": 1}
{"text": "When did Justin Bieber get involved in this?", "label": 1}
{"text": "To the West, terrorist acts are mostly those in which lots of white people get hurt.", "label": 1}
{"text": "Mohh s kahlistani nashedi k L nikal k baat kr..", "label": 1}
{"text": "So the protesters were peacefully protesting the Indian government official that was visiting.  Hindu thugs came to confront them and threw punches, grabbing the protester’s flags and when the protesters fought back it’s; oh look at the violent Khalistanis", "label": 1}
{"text": "If you feel unsafe in Canada you should go back to peaceful India", "label": 1}
{"text": "History will treat you kindly", "label": 1}
{"text": "Bravo! Bravo! \n\nWe need more people like you who have a spine and can take decisions for themselves and don't have regrets and believes in them. \n\nWish you a happy married life.", "label": 1}
{"text": "Hmm... Just make sure you set a better example for your future children. They'll suffer the consequences of your poor 'choices'.", "label": 1}
{"text": "thanks for your review", "label": 1}
{"text": "You really don’t have to worry about my children. I guess as a parent I can do that when I am blessed with children. And coming to my poor choice - I married a guy of my choice and my parents are now extremely happy of the choice I made. They also of the guys I dated before ( someone from my community) and how much I suffered and now they are seeing me thriving in my life by my own and later it got much better after I met my husband. And since when marrying a person of one’s choice became such a wrong thing. Parents aren’t always right as well, and disobeying them or going against them for our own good isn’t bad.", "label": 1}
{"text": "Is it cause that weird old guy is shaped funny?", "label": 1}
{"text": "This is incorrect, it is widely taught and discussed", "label": 1}
{"text": "Same for the all the khalistanis, we should do an exchange.....all Sikhs to Canada....all Hindus to India perfect perfect perfectttttt!!!", "label": 1}
{"text": "It was ignored as victims were mostly Canadians of Indian origin. Canadian government would have taken the AI 182 terror act far too seriously if the victims were White Canadians. Then Canadian PM sent condolences to the Indian government instead of condemning it an attack on Canada. ", "label": 1}
{"text": "No, all types of nationalists should be sent back", "label": 1}
{"text": "I’m sorry bro, it was stuck at 149 dislikes for the last 2 hours, gave you the 150th", "label": 1}
{"text": "How many of you remember 1992 riots? \r\n\r\nyou'll born after that. Hack, most forgot how many died during Covid. \r\n\r\nKhalistani movement died down until someone thought its good idea to light it up.", "label": 1}
{"text": "Don't make choice that will lead to your divorce, thats what I meant by my reply.\n\nRegarding choice of partner, it depends on you. But you can't choose your parents or children. Its seems that your parents were dominating and you have inherited the same gene. Wait for you kids to rebel against you for something which is not in your favor and you will do the same your parents did knowingly or unknowingly.\n\nSometimes we have to make compromises. Everything cannot happen as per your wish, all the time.\n\nI would advise you to not divorce even if your husband cheats on you. Because germany has 3rd highest infidelity rate in the world.", "label": 1}
{"text": "Not insta or fb 💀", "label": 1}
{"text": "Educate me \"Why did he light Khalistan movement again by publicly killing some unknown leader?\"", "label": 1}
{"text": "Because because most of the folk lore we listen is in direct contradiction to what they preach. And that is because they created this false sense that Muslims and Hindus can live peacefully only if they have lived peacefully in history. And they did not stop there they also wanted Muslim rulers to be good. \n\nWhich was obviously not the case.", "label": 1}
{"text": "We have tried both.", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Also the released bombers from air.india flight met with modi. All orchestrated by Indian government in past", "label": 1}
{"text": "\nYour question is the answer to itself, why would he? What he stands to gain, a 10 bhk penthouse in khalistan?", "label": 1}
{"text": "Oh yeah so obviously that means all Telugus would do the same.", "label": 1}
{"text": "Don't worry you're being downvoted by IT cell bots.\n\nWhat you said is 100% correct. They were actually afraid of the movement getting momentum and wanted to curb it before it gained pace. But these smart asses didn't realize it would cause a ripple effect which would end up doing just what they didn't want.", "label": 1}
{"text": "Since the farmer's protest, Modi and his supporters are calling everyone who opposed the bill Khalistani. What did he gain from that? Division buys vote. Why do you think they always have anti-muslim propaganda going on?", "label": 1}
{"text": "Exactly. I'm fed up of having to install apps for everything. Couldn't these services simply be provided via the IRCTC website?", "label": 1}
{"text": "Propaganda runs politics. Both sides does it. Nobody is a saint", "label": 1}
{"text": "It seems calculated. Khalistanis would want that because the bigger the division between Hindus and Sikhs, the greater the brain washing and recruitments. Trudeau is okay with it because Jagmeet. \nCanadian intel agencies allow that (considering reports it was pre planned) because it puts soft pressure on Indian govt.", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "I did not ask human right I ask the reason why the did not protes at mosque? Why they were protesting at Canadian Hindu temple? \nBecause they wanted to intimidate?", "label": 1}
{"text": "Mother fucker people got beaten here\na/\naccept your govt is incompetent? Like off duty police officer taking part in khalistani jaloos. Bias is clear\n\nb/  \nLGBTQIA’s protest outside churches because they have problem with churches. Does khalastani has problem with a Canadian Hindu?", "label": 1}
{"text": "Wtf dude ? Another reason why religion destroys sanity ! Ignore her man crack IIT & get out of your house & keep believing in science instead of religion you'll be good don't sweat it.", "label": 1}
{"text": "Check Police supporting and attacking Hindus. Even Law Enforcement cannot be trusted for impartial justice. https://x.com/Sputnik_India/status/1853401821487710536", "label": 1}
{"text": "This is not a fucking your office meeting where where you have to mandatory speak to prove your worth which perhaps is zero. Just scroll if you have no input. Keeda saale", "label": 1}
{"text": "Google for sohonest - they might be able to get you O1. Also has 14 days trial", "label": 1}
{"text": "I can tell you we couldn't care less about this stupid situation. Stop being mean to Sikhs in India and solve Khalistan problem easily. Problem is now Modi is too far right to come back.", "label": 1}
{"text": "Muslim nations do not have any inherent obligation to take in refugees just because they are Muslim. The only place that Rohingyas should be rehabilitated to is their homeland in the Arakan valley in Myanmar.", "label": 1}
{"text": "So what makes you think India has some obligation? We didn't even sign the refugee convention", "label": 1}
{"text": "India does not have any obligation either. But it never fails to tell the world how it is concerned about Hindu communities around the world - whether those communities are Indian or not.\n\nThe least it can do is treat refugees who inadvertently end up in India as human beings with basic dignity.", "label": 1}
{"text": "You are comparing communities with refugees? Tf are you smoking bro. Pass me some of that stuff!", "label": 1}
{"text": "Communities - in a different continent, which aren't Indian, but happen to be Hindu - are given more attention than refugees - who happen to be Muslim - facing starvation, health issues and risk to life, while in India.\n\nThe Indian nation-state has only one obligation - to identify people who can be brought into the Hindu fold (inclusion) and merely tolerate those who cannot (exclusion).", "label": 1}
{"text": "Does that make it okay to let a child rot in our country? You're a POS.", "label": 1}
{"text": "that contributes to OPs point — we live in a geopolitical world completely devoid of human empathy. OIC is simply another part of that", "label": 1}
{"text": "All the VPS hosting providers are a good option they offer India VPS hosting with a variety of plans that suit every user's needs as they have reliability, performance, and ease-of-use servers. \n\nSo if you are looking for VPS hosting services where you can host your web apps while running a personal VPS server you can go with any provider here are a few more providers DedicatedCore and DomainRacer they provide low-cost VPS hosting solutions. The services and features that are provided by VPS hosting provider you can check for so you can make the right decision. \n\n* Pricing of the VPS server should be under your budget every provider has competitive plans DomainRacer is one of the cheapest. \n* Performance with the SSD storage and resources you can get as your requirement so your web apps can run smoothly. \n* Ease of use interface With the help of cPanel you can run a VPS server smoothly and manage it without any worry as it is user-friendly.\n* Features that **DedicatedCore** has are 7+ security, all-time customer support, backup, unlimited storage, and unmetered bandwidth. \n\nYou can go with any provider who offers this service within your budget and has high-performance server resources such as DedicatedCore or DomainRacer. ", "label": 1}
{"text": "Lmao. I am half Sikh half Hindu. Grew up in Punjab and never saw any issues between either religions. You canadians gave visas to those people and are blaming India for your domestic issues ? Make it make sense. Hold your govt accountable lol", "label": 1}
{"text": "Of course, no one should. But tolerate means different in our countries. The French in Quebec have been trying to separate since 1812. They protest, they riot, they lobby but violence is next to nothing compared to India. \n\nHmmm... What is Canada doing to allow freedom of speech that India is not doing with Sikhs? Like listen for once instead of flexing your corrupt politicians, police and judicial systems.", "label": 1}
{"text": "Nah, my vision is pretty accurate. You are basically telling me that I, who was born and brought up in a state, have little knowledge about the issue compared to you who probably can't make more than 3 cities in punjab.\n\n'Why does this problem exist' -> Leave aside the 15 developed countries, the rest of the world is still developing. Things will not resolve over night. Colonialism didn't really help. And mind you, the rich Europeans after looting half of the world decided to create the modern world in North America that was built on the backs of slaves. \n\n'please stop breeding these types of people' -> natural selection will take care of that. I think you guys should focus on stop breeding your corrupt money launderers who sold your country for tuition money. Stop ejecting officials that will allow anyone in your country. \n\nAnd talking about freedom of speech. India can do better. Sure. But you guys have let radicals exploit your freedom of speech when they use the same freedom to spread hate. I mean, calling for assassinations of Indian  diplomats in Canada really sounds like a good use of freedom of speech. Imagine the uproar if Canadian dissidents in India called for assassination for Canadian diplomats in India. Or if they disrespected the Canadian flag in front of the Canadian embassy in a regular basis. Or if they decided to protest outside the churches where the Canadian diplomats went.", "label": 1}
{"text": "He bought the food and is giving it for free if u say jai shree Ram don't say it if it offends you which speaks volumes about you, it's perfectly reasonable. Don't eat the food if you can't even do that move on no one's forcing you", "label": 1}
{"text": "I can name 6 cities in Punjab without looking it up: Amritsar, Jaladar, Ludhiana, Hoshiarpur, Chandigarh, Patiala. I have friends whose family are in these cities, we do business and have offices in some of them. What you don't realize is half of India is in Canada, all my friends, colleagues, security guards, McDonalds staff are all Punjabi, Gujrati, Keralite and rest of India. I say you have the worst blinders being there because you have been passed down cultural broken telephones through time. We in Canada have a different insight than being in the mess. The insight is not a superior perspective it's an alternate reasoning to your deep rooted problem. The world is too global and open for you to say \"you don't love in Punjab, you don't know what happens here\". Bro we know and we know hard what the BJP is doing, education doesn't breed elitism, it breeds awareness and that sometimes is depressing. \n\nLook I sympathize with you about the perils of developing countries and developed countries. I understand how hard deep seeded multi-millenia has caused massive problems that are hard to change. Palestine-Israel is a great example of this. So for all the rooted problems, I bow my head because that's just unfair. \n\nFor 1000 years you complain \"India will never change, it's not a developed nation\", when we tell you the religious institutions are ruining the country you don't believe. You just Bhajao your drums harder to religion. Not saying \"developed\" worlds don't have problems, but highly different issues. And electing the Modi and supporting a Hindu nationalism is like the worst thing you can do to unite a fragmented nation. \n\nIndia has such power as a subcontinent and can rule the world but unfortunately BJP and Hindu nationalism divides the people not elevates them. When India has a leader that united all Indians and NRIs globally, India will enter a new age. Until then each religion will do this wherever they go. \n\nStop breeding money launderes for tuition, honestly I'm on your side there. These stupid liberals sold the country to the Educational Institutions and now they resevered it as of last week. Now all these schools are struggling. You see in Canada Change fucking happens. In India, same thing comes up, all the ministers point to each other and it goes in circles. We are watching all the scandals. Again, let's use the developed vs developing country narrative only when India lacks moral judge od character (it's an easy out).\n\nProtest and freedom of speech is one thing, calling for assassination as bad as it is, is one thing. Let me tell you there is no calling or protest, in India that murder just happens. Btw anyone burning Canadian flags get arrested, and recently a Pro Palestine group went \"too far\" on freedom of speech and they made them a terrorist group the next day. Once again Immediate Change, when is that change happening in India? 200 years after the pundits, the politicians, their kids and all the corrupt police get paid off. \n\nI'm sorry, I understand developing countries are hard and institutions aren't set up to protect a social contract that society can upload. I'm sorry, but people like you who think by being there are elevated in thinking are actually ridiculed in bias. Close Indian media first, it's some of the most poisonous propaganda used outside of wars.", "label": 1}
{"text": "Everyone loves to shit on India. Has India actually deported anyone?", "label": 1}
{"text": "But we have heard India taking in refugees from religion other than Islam", "label": 1}
{"text": "P.S. I'm coming to India on Dec 8 for a month, I'm meeting with Indias Senior Director of CDAC. Going to Mumbai, Goa, Bangalore, Agra, Delhi and Chandigarh. We know much much more than you think. We study in our schools indias growth, it's geopolitical issues, it's currency devaluations. But we see the Hindu genocide of Muslims, we see the burning of churches. While Canadas court systems don't allow you to get away with much, tell me this in India. When I had visited last time, we got stopped by a cop and the driver paid him off. If everyday people are ok with corruption, what is Modi doing? He's literally paying off anything he wants. This is Indias moral imbalance with the developed world. \n\nIndia will never become a developed nation until people like you stop criticism everyone external and start taking accountability of your own backyard. As in this, your Khalistan stink is stinking up in Canada, Australia, US, South Africa. You can say so much about Canadian money launderes and politicians, but all the stink is coming from your background and spreading globally. Time to wash the stink locally with soap.", "label": 1}
{"text": "'half of India is in Canada'. No. 0.1% of India is in Canada. 99% indians are in India. Your interactions are with a sub set of those 0.1% folks who are carrying historical baggage while the actual country has moved on. Your interactions are extremely biased bcz of that. The issue is that what you consider a mess, has been left 50 years behind. Its very surprising to me how Canadians think they know more about indian issues more than someone who grew up there. Its probably superiority complex. Maybe 50 years ago, indians in India might accept that. But today, nah man. \n\nWhile you have friends living in those cities, I have lived and visited all of those and have first hand experience. You have named those 6 cities. How much time have you spent in even one of them ? Khalistan has been a non issue. If it were an issue, I wonder why a Hindu majority country like India would elect a Sikh prime minister twice ? \n\nAnd that burning of Canadian flag is an extreme hypocrisy. Your govt allows people to burn Indian flags in Canada but makes a group terrorist over night if they do the same with Canadian flags. \n\nIndia has plethora of issues. Fair enough. BJP and modi are a problem ok. We have corruption. Cool. Ummm, how's that related to Canada ? If only the most unskilled people from Punjab want to come to Canada and Canadian govt doesn't stop them from coming, is it India's fault ? Just shut the door and crack down and deport the defaulters. What's stopping the govt ?", "label": 1}
{"text": "People with nothing do in their lives.", "label": 1}
{"text": "India takes refugees of all religions, it just expedited the refugee process for the minority religions in the neighboring countries.", "label": 1}
{"text": "This did not make the cut for news before 2014.\n\nThanks to the BJ Parry for bringing this crucial matter to the forefront.", "label": 1}
{"text": "Have you tried taking a bathe? Maybe racism will go away.", "label": 1}
{"text": "You Indians need to leave Ireland. Ireland is FULL anyway. ", "label": 1}
{"text": "Any update on the sex slaves of Islamic State?", "label": 1}
{"text": "Haha. Living in fools paradise then. Congrats for being a nincompoop.", "label": 1}
{"text": "Angoor khatte hai", "label": 1}
{"text": "Frankly those who get chance should go for it. It's more feasible then wasting ur time in working for 70 Hours work week companies. I had a chwnce to move to germany, didn't go as had a job in hand. And now regretting badly", "label": 1}
{"text": "Clearly there is something called karma, took an enhancer which enhanced his life, dead!", "label": 1}
{"text": "The cops should seize his assets and transfer it to the family.", "label": 1}
{"text": "Couldn’t happen to a better person. I hope he gets raped continuously in hell.Also the girl’s family were basically pimping her out,weren’t they?", "label": 1}
{"text": "Using the Trump strategy? But hes the incumbent since last 10 years.", "label": 1}
{"text": "lol, really… they are protesting for the attacks by khalistani terrorist on temple - you dumb mfs won’t tell that and instead show these protests as a problem where they aren’t even attacking anyone", "label": 1}
{"text": "Are you saying this is the type of rhetoric you want to be speaking during protests? This is the shit you hear in hate rallies or parades.", "label": 1}
{"text": "No loss  at all his family members must be shocked or who knows they must be happy to get rid of him \n\nI don’t believe that this child family were not aware of what was happening to her \n\nI hope she gets some help so that she is not exploited more", "label": 1}
{"text": "I hope he died a more painful death.", "label": 1}
{"text": "All the charas smoked by them ch*dis is visible now huh", "label": 1}
{"text": "Thank you viagra for getting rid of this scum", "label": 1}
{"text": "If God literally does this still rape won't be a punishment for man lmao .", "label": 1}
{"text": "Where is the attack? Usual RW lies and propaganda! There was no attack on any temple - just a scuffle between protestors on both sides.", "label": 1}
{"text": "These are rapists that rape at mandirs", "label": 1}
{"text": "But why the scuffle? What business did the Sikhs have at the temple?\n\nHindu's kept quiet while bhindrawalla was carrying out ethnic cleansing by segregating and killing Hindus. There was no reaction from Hindus it was only after Sikhs became overconfident and assassinated Indra Gandhi that Sikhs face a backlash that too from one party not from the Hindu community.\n\nHindu's should not keep quiet and the erring Sikhs should be taught a lesson.\n\nAll Patriotic Indian Sikhs are our brothers but those who attack should not be spared", "label": 1}
{"text": "Tbh Canadian sikhs have history of harrassing hindus. \n\nGo search about hate crime, there are barely hindus in Canadian arrested for preaching hate against sikhs or white but there are lots of videos by khalistanis harrassing hindus", "label": 1}
{"text": "This post is about a guy who has been arrested several times for his hate speeches against Sikhs. Where are Sikhs harassing Hindus is Canada or anywhere else? Can you share one of those videos?", "label": 1}
{"text": "Firstly, this is video from US of random dude doing his thing. How does it relates to Sikhs? Second the attack you guys keep brining up was 40 years ago and was never proven to be done by Sikhs.", "label": 1}
{"text": "Enough to die", "label": 1}
{"text": "I wish that too but atleast the mf is dead because our law wouldn’t have ever given justice to that girl.Generally viagra deaths make me sad because people don’t read the warnings but here I am happy.", "label": 1}
{"text": "https://i.redd.it/v76jnbh535zd1.gif\n\nI just opened reddit", "label": 1}
{"text": "https://discord.gg/gUbgKcFJhttps://discord.gg/gUbgKcFJhttps://discord.gg/gUbgKcFJ", "label": 1}
{"text": "Wow, that was a tough first day! Kudos for standing up for yourself. Btw, if you need help with lead generation for your startup, Hello Dexter has been a game changer for me. It made outreach so much easier, feels like having a secret weapon in your back pocket.", "label": 1}
{"text": "Violent Khalistani? Oh, you mean terrorists. Got it!", "label": 1}
{"text": "Calling yourself Canadian and acting like you know what's going on in India. Stfu dumbass", "label": 1}
{"text": "I stopped by to express joy that the trash died..! ", "label": 1}
{"text": "Hey, I am 19 Male here. The financial condition of our home is not good and I recently got a sales person job. \n\nBut the company wants me to wear good clothes, or else will let me go off. I can't lose this job opportunity as my family has several debts to take care of.\n\nI don't have the money to buy clothes. Can anyone help me out by donating their old shirt pants to me probably?", "label": 1}
{"text": "Unfortunately we have a 56 inch tongue in power who once appointed a 9th fail as the Education Minister. \n\nThe tongue's vision and thinking about education begins and ends with changing the history curriculum.", "label": 1}
{"text": "\\*Khalistanis", "label": 1}
{"text": "Modes should remove this article the article headline is misleading everybody in the comment section is assuming it to be indian china border. Which it is not", "label": 1}
{"text": "I can understand her. She got tired of people spitting and shitting on roads ..", "label": 1}
{"text": "[What a great source to post from. definitely not a twisted sensational headline](https://www.statista.com/chart/amp/31605/rank-of-misinformation-disinformation-among-selected-countries/)", "label": 1}
{"text": "Basically making a Lebanon out of India. But I do support the proposition. The current system feels like sn apartheid regime for open category.", "label": 1}
{"text": "So just in the garb of deshbhakti you want to support two sasta genocidal goondas on their fuckups, because they represent India now? This administration doesn't represent me.", "label": 1}
{"text": "Apartheid yeah... SC/STs stopping general category people from fetching water from the wells", "label": 1}
{"text": "My friend, I know this might sound cliche, but ask him to try Inner Engineering by Sadhguru. Tell him to stick to the practices and see what happens.", "label": 1}
{"text": "No because it's a high trust society BECAUSE PEOPLE USUALLY DO THE RIGHT THING but you sit here blaming that country because people exploit them. It isn't their fault it's the scammers at fault and they are making once trusting nations distrustful and indian scammers give Indians a very bad name in once high trust societies.", "label": 1}
{"text": "https://preview.redd.it/1xwb6h61c9zd1.png?width=1080&format=pjpg&auto=webp&s=20653644e080d083e319e0ab9d59b8e13df3071c", "label": 1}
{"text": "https://preview.redd.it/6ezpq0a3c9zd1.jpeg?width=318&format=pjpg&auto=webp&s=f1f331da9c69c7b303f67f3322fe39da5568c47a", "label": 1}
{"text": "y are u not allowing me to post", "label": 1}
{"text": "I have a feeling your posts will be down voted to hell.", "label": 1}
{"text": "Delete this", "label": 1}
{"text": "Why?", "label": 1}
{"text": "Makes my pp hard", "label": 1}
{"text": "Cultists like you are disgusting.", "label": 1}
{"text": "I'm a republican you dumb shit.", "label": 1}
{"text": "Hey I’m starting my preparation for Xat do you have any tips for me ", "label": 1}
{"text": "That would be India. You guys will be fine", "label": 1}
{"text": "modi is a cunt", "label": 1}
{"text": "Because social media will feed you what you are into. Moderate LW person will see extreme RW vile people and moderate RW person will see extreme LW vile people. That is how people will divide themselves.\nIf you hang out in LW/ RW forums you will constantly see how bad the extremes from other side are. The only way to see things clearly is to live normal life and interact with all kinds of people, only then you see that they are normal.", "label": 1}
{"text": "Madarchod", "label": 1}
{"text": "Any one hot sexually abusesd?", "label": 1}
{"text": "Those who joined the class for 14k and got to know that is bullsh\\*t , report the software to microsoft here - [How To Tell - Counterfeit Software Report](https://www.microsoft.com/en-us/howtotell/cfr/report.aspx)", "label": 1}
{"text": "She’s a dumb fuck.", "label": 1}
{"text": "You can remove Indians from the rat race, you can't remove rat race from Indians", "label": 1}
{"text": "Aatankwadi ho tum💥", "label": 1}
{"text": "Because they've got nothing else to offer and the morons in this country vote for it.", "label": 1}
{"text": "The truly poor don't even have means to apply for these schemes. \n\nWatch Marathi news channels, the people celebrating this scheme and saying they'll vote for Shinde because of it aren't the ones begging in the streets.", "label": 1}
{"text": "Nobody here has the guts to say this but I will. You got judged that's sad. But as we have seen numerous incidents happening all over india, its what expected sooner or later. All our minds are tricked in to believing that the other person must be doing something fishy. Having said that i know it hurts that most of the muslims are questioned now and then but lets be honest its the fault of muslim community on their own. They have given the reason again and again to doubt them. I am sure most of the violent cases are done by hindu too or any other community, but the difference is intention: Religious intent: purely criminal intent.\n\nNow some one will say modi bhakt andh bhakt gobarvaadi yada yada. I live by the idea of bharat aka india. I criticize modi when i see fault or yogi when i see one(when yogi made a some comment about doing the same if hindu women were harmed). See the intent. \n\nOver the centuries One community has been ravaging raping or playing victim card using their religion, its happening all over the world btw not just india. Some people will say oh forget the past before british came and what not... wtf why 90-95%of states of muslim community demanded for separate nation and then stayed back in india?? why? do you really want us to believe that you wont do it again when the there are numerous examples of soemone saying 15min ke lie police hata do.... Making vulgar comment on sita mata, making false copies of bhagvata geeta. I can go on and on. When the same is done as a resistance you will play victim card??? huh..\n\nIf you really wanna make us think that no Islam is not that and it should be protected then go ahead wage wars against those elements in the society make your sir tan se juda against your own community \"sir tan se juda gang\". Because anyhow its your responsibility to protect true islam isnt it? why dont you do so??\n\nAt the end any muslim who is reading this should know that no we dont hate muslim, if you give us APJ Sir, Bismillah Khan etc we will praise you and will be ready to die for you. But give us those reason. But if you praise gangster and go to their maiyaat then surely dont blame us for calling you enemy.\n\nPeace be upon you..", "label": 1}
{"text": "Yawn 🥱", "label": 1}
{"text": "wtf dude I can't look at currency notes with a straight face now. have to rely on UPI for the rest of the month to erase this image off of my head smh", "label": 1}
{"text": "This is where you are missing the context of my whole passage. I have no problem with muslim as i said earlier. i could give an example but i didnt earlier. You said how should you be treated? Of course you will be treated nicely even though if you were a muslim. I repeat even though if you were a muslim. I am against the people below who comments \"oh i face this thing everyday for being muslim\" dont blame us. Increase in the certain crimes in the name of islam made you target so you should blame your mullahs etc. For example almost every one dont wanna get along with bihari does that mean they are bad people ? but surely they are mostly associated with crimes? thats the idea people have based on past incidents. I always tell people that biharis are most intelligent people in india.\n\nNow you said muslim kill muslim. Again the intention bro the intention. All i am talking about is intention. dont miss the point.\n\nYou said hindus discard other ideologies . No they dont. I have never met anyone who had any enmity towards other jain or what not community. My friend was jain we never had any problem. I being a hindu go to jain temple or any other temple.\n\nYou said come together as one. thats what i have been saying,,,, sure most people will agree. BUT could take the responsibility in every step to face your own community and tell them dont kill dont do sir tan se judaa and all those things? can you be the one to protect from those ridiculous so called mullah asking for conversion and the beings who says 15min ke police hata do ... and he did it again recently btw..", "label": 1}
{"text": "It's Ok", "label": 1}
{"text": "r/leopardsatemyface eating well already", "label": 1}
{"text": "I have other cool products here, if you'd want to have a look :) [https://www.sulekh.shop/category/all-products](https://www.sulekh.shop/category/all-products)", "label": 1}
