{"text": "i just realised that’s a ying yang", "label": 0}
{"text": "that tweak pulls up that annoying red rdar popup, but, enable fluid gestures in Lynx fixed it for me or either try using legacy status bar.", "label": 0}
{"text": "It’s not my main email. Just Apple ID account email. I don’t use it for anything else", "label": 0}
{"text": "nope", "label": 0}
{"text": "Live Container maybe I don't have a jailbreak though so I can't tell you if it would work", "label": 0}
{"text": "Hey! What's the maximum number of clicks per second you can achieve? Is it possible to reach 200+ with these?", "label": 0}
{"text": "You did however answer something knowing \"I haven’t jailbroken older devices in a while\" - so it is kind of on you that you decided to answer this question in the first place.", "label": 0}
{"text": "neither have issues. Really just loading apps and some pages\n\nTyping no issues, scrolling have not seen anything", "label": 0}
{"text": "How is this related to jailbreaking?", "label": 0}
{"text": "because it’s due to jailbreaking", "label": 0}
{"text": "Privacy isn’t allowed here", "label": 0}
{"text": "That means logging out will maybe work ?", "label": 0}
{"text": "Mine is like that too, I think it's a problemm with the latest 2 versions by Fouad. I see plenty of ppl complaining at his X posts.", "label": 0}
{"text": "Okay thanks, I will try it", "label": 0}
{"text": "and now 5 days", "label": 0}
{"text": "Idk mine was locked but I’m to scared to lose my stuff so I logged after 24 h on my laptop. If I can login on my laptop , that means I’m no longer locked right?? And if I would be locked again I would get again a mail right?", "label": 0}
{"text": "Alright. Thanks", "label": 0}
{"text": "I have Auto Unlock maybe that’s it then?", "label": 0}
{"text": "I removed autounlock and still getting it", "label": 0}
{"text": "is this the actual official folders that ios uses when viewing these folders in windows explorer after the iphone is connected to PC ?", "label": 0}
{"text": "did u find anything please for ios 15?", "label": 0}
{"text": "did u find anything please?", "label": 0}
{"text": "Did you reboot and restart jb to make sure am memory was cleared? \nWhat over tweaks are running", "label": 0}
{"text": "No I didn’t and I have tons tbh", "label": 0}
{"text": "Yes I did a respring and it wasn’t directly after it’s when I swiped up to unlock", "label": 0}
{"text": "Bro you didn’t say that", "label": 0}
{"text": "Well no now that i think of it i used signolous i was using it to sign other apps like uyou+ & nxy for ig", "label": 0}
{"text": "Yes. I’ve been wondering this too. It gets really old.", "label": 0}
{"text": "These posts pop up almost weekly in the Cyber security subs \n\n\"Please help all my stuff is completely bugged it all says it's completely fine but I know it isn't because I looked at things I don't understand\"", "label": 0}
{"text": "Yeah you cant sideload sidestore like that, you gotta install it with altserver", "label": 0}
{"text": "Apple ID Region, not just iPhone Region.", "label": 0}
{"text": "What do you mean you downgraded to ios17? Pretty sure that is not possible.", "label": 0}
{"text": "Could be still in memory. I would reboot and just restart the JB and see what happens", "label": 0}
{"text": "I was in iOS 18 and I downgraded to iOS 17.7", "label": 0}
{"text": "The tweak that I use is Legizmo but I'm pretty you need to be jailbroken to run it", "label": 0}
{"text": "So I can’t with out Jailbreak", "label": 0}
{"text": "You don't need to be jailbroken to sideload apps ... you can't run install 3rd party apps with sideloadly.", "label": 0}
{"text": "Sparse restore baby! I’m enjoying 18.0.1 frankly on my iPhone 16P.", "label": 0}
{"text": "isn't legizmo a trollstore app/tweak so you need trollstore regardless", "label": 0}
{"text": "Unfortunately, there is no public way to emulate iOS on iOS.\nPersonally, I switched to TrollStore. Short of using Filza with URL scheme, there is virtually no detection at all.\nAny screw up that causes jailbreak detection, you can use varClean15 (TrollStore version) to clean up and be good to go again.", "label": 0}
{"text": "But ChatGPT agreed with me and ChatGPT is definitely reliable!", "label": 0}
{"text": "You can install older versions on older devices, but you must have previously installed them. Go to the my purchases section of your iCloud account and it should let you download them. As stated, even a jailbreak won’t help because most updates are using new API’s and new code that is simply not there in older versions of iOS.", "label": 0}
{"text": "And how \nLike program and file", "label": 0}
{"text": "If a legizmo ipa is available you would install the ipa on your phone via sideloadly... you should ask people in thee legizmo discord for more help", "label": 0}
{"text": "Watch can’t be on a higher version than iPhone. And only Apple can downgrade an Apple Watch. Also whatever legizmo is, it only supports watches up to watchOS 10.+ and I assume your watch will be on 11?", "label": 0}
{"text": "buddy how it went?", "label": 0}
{"text": "The default iOS call screen while in a Teams call rather than it opening the native teams app. This is what happens on iOS 13 but not since iOS 14", "label": 0}
{"text": "it supports up to watchOS 11 currently using the moonstone version on beta.", "label": 0}
{"text": "And there's the answer :) thanks", "label": 0}
{"text": "Try deleting the apps.", "label": 0}
{"text": "I tried but I flailed \nHow do you install", "label": 0}
{"text": "> Does jailbreaking allow you to receive updates for apps that require ios 16 as well install new apps if you are on say ios 14/15?\n\nIn theory, yes. In practice, not very often due to the amount of work it tends to require.\n\nAn example of back-deploying despite Apple's limitations is CyberKit.", "label": 0}
{"text": "No. He clarified it shortly thereafter.\n\n\nhttps://i.imgur.com/08N6HaT.jpeg", "label": 0}
{"text": "You can’t jailbreak a Mac as it is jailbroken out of the box, but you can use PlayCover to install IPA files", "label": 0}
{"text": "See https://www.idownloadblog.com/tag/sparserestore/ if you're wondering what you can do with SparseRestore", "label": 0}
{"text": "Make sure iTunes and iCloud is open", "label": 0}
{"text": "We haven't even gotten 17.0 yet. Stay on low and wait 6 months and then check again", "label": 0}
{"text": "Stop being so technical", "label": 0}
{"text": "I dont want modifying the folders, I just want the date modified of the folders into a zip file for archiving purposes but yeah not modifying anything in the DCIM folders, except to make a zip file of the DCIM folder", "label": 0}
{"text": "he didn't", "label": 0}
{"text": "is probably just a tweak that makes it look like ios 18", "label": 0}
{"text": "Man don’t post me this garbage, they do this shit every single year making these exact same vague bs tweets and posts then literally nothing for years.\n\nUpgrade your phone and stop listening to people with waifu profile pictures", "label": 0}
{"text": "Thanks for including the link to the video /s", "label": 0}
{"text": "i think it only supports up to ios 17.0 for now.. and you need trollstore to install legizmo .. sideload wont work.", "label": 0}
{"text": "ugh techtokers", "label": 0}
{"text": "It would be a iPad 7th gen ", "label": 0}
{"text": "No is possible but you can jailbreak your iPad and put plug ins or app to make a very close experience of iOS 18", "label": 0}
{"text": "But that screenshot doesn’t show that?", "label": 0}
{"text": "ty", "label": 0}
{"text": "woot da heel", "label": 0}
{"text": "Palera1n should work", "label": 0}
{"text": "ah yes unsported", "label": 0}
{"text": "Honestly never used Palera1n before. How do I use it? Specifically for this device.", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "After your in the call go to your Home Screen, then go to your app switcher and you can open phone app and it will show this page. I do this on 16.3.1 because I like the larger mute button.", "label": 0}
{"text": "Palera1n should work like that other dude said. You also don't need to redact the model number as that's the same for each veriant of an apple device.", "label": 0}
{"text": "He used the beta", "label": 0}
{"text": "It's so easy how could you possibly not know how???\n\nThey either used a tweak or just completely faked it. It's not actually possible to run iOS 18 on an iPad 6.", "label": 0}
{"text": "\\^2", "label": 0}
{"text": "i just used dualra1n on my 6s+ this week. dual booted ios 14.8. it runs great and i was able to sign in and everything", "label": 0}
{"text": "Yes it does. He said to stay on that version because it supports sparsestore.", "label": 0}
{"text": "There are always a jailbreak for all ios version. The question is, could you wait for 2 years for a jailbreak when ios 20 is released?", "label": 0}
{"text": "Man", "label": 0}
{"text": "trollstore won’t work on ios 18 ever unless another coretrust bug is found or something like that. but if you can downgrade to ios 18 beta 4 or below then you can use the sparsestore exploit which can do things like what macdirtycow could do", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Not that they can even install iOS 18. Not having an ipsw for the device means you can't restore, period. You could do some shady shit with checkm8 but at that point anything you do isn't genuine and would still require a lot of manual work, if it were even theoretically possible to begin with.", "label": 0}
{"text": "bro needs to sideload say gex", "label": 0}
{"text": "just sign out of the apple id in app store and use a different one", "label": 0}
{"text": "no, a 17 jb will come way sooner than an 18 jb", "label": 0}
{"text": "I think it’s done through nugget app", "label": 0}
{"text": "💚", "label": 0}
{"text": "Don't use lightning to usb-c, use lightning to usb a", "label": 0}
{"text": "its an iPad 7 and they're just lying (most likely)", "label": 0}
{"text": "Nothing to do. May be if he registered a legacy contact there will be a chance to get datas.", "label": 0}
{"text": "This should have everything: [https://ios.cfw.guide/installing-palera1n/](https://ios.cfw.guide/installing-palera1n/)", "label": 0}
{"text": "No we won’t.", "label": 0}
{"text": "No; maybe iCloud, not the data", "label": 0}
{"text": "Thanks, but I already found this article. It says that I can save my blobs, upgrade and restore from them later. I’m gonna update I guess?", "label": 0}
{"text": "I bought an se gen 1 should get here next week, I’ll see if and how there’s issues with ellekit", "label": 0}
{"text": "I used the .vip version and downloaded it to my iPhone. I completed the survey in the app from the profile. Am I good at cooking or not?", "label": 0}
{"text": "Having a trouble with keychain on ios 13.4", "label": 0}
{"text": "https://sideloading.vercel.app/", "label": 0}
{"text": "on 16.1.2 you can install trollstore using trollinstallerMDC", "label": 0}
{"text": "icloud account can be reset and i believe you can restore the last back up to a new phone if you want to try that. Worth going into an apple store and asking. They cannot unlock the phone though", "label": 0}
{"text": "There’s is nothing you can do. This thing is like a vault. Even Apple can’t unlock his personal information. They might be able to fully reset it, so no iCloud lock.", "label": 0}
{"text": "It didn’t work, Apple’s website said that they couldn’t create my account", "label": 0}
{"text": "ios.cfw.guide/using-palen1x/\nuse this and do not use winra1n", "label": 0}
{"text": "I can't determine either this is a lie or a truth because the reason of \"<family member> passes away\" posts in this subreddit is... frequently.", "label": 0}
{"text": "but ur limited to 3 apps", "label": 0}
{"text": "Can i use these on 17.6?", "label": 0}
{"text": "Esign with revoked cert and dns or altstore + livecontainer both work around that", "label": 0}
{"text": "What’s so good about jailbreaking anymore anyway? We have sideliading and don’t think there’s a need for all the tweaks and stuff we had 10 - 15 years ago. Trying to find a way to get banking apps and sky app working etc while jailbroken was just a pain in the ass to be honest for the sake of running some crappy tweak that ended up screwing your phone up then the hassle of reinstalling everything again. Personally wouldn’t bother me if we never have another JB", "label": 0}
{"text": "What is this gradient", "label": 0}
{"text": "Bro hello! I did everything u said but i still get the “İpad 13,1 not supported” but i can serçe that i included the “ipad 13,1” how can i solve that?", "label": 0}
{"text": "Smells like bs to me lol", "label": 0}
{"text": "I think you’re a good person but you really didn’t think much before post that, did you?", "label": 0}
{"text": "You need to press the fps part when selecting the fps, not the 1080p/4k part", "label": 0}
{"text": "Longer AppSupport ig", "label": 0}
{"text": "Not working", "label": 0}
{"text": "Yes,it was working before jailbreak", "label": 0}
{"text": "Sure", "label": 0}
{"text": "Either way it's still respectful that you say sorry for their loss. It's netiquette apparently", "label": 0}
{"text": "Please come back we need a fix for unc0ver on iOS 12.5.6 - 12.5.7 🙏", "label": 0}
{"text": "Yeah I totally get it that’s fine. I’ve been browsing everywhere and everyone asking the same question as me usually act shady. Were gonna attempt a few more possible passcodes he might’ve used. He was kind of estranged from the family because his parents were very overbearing along with his siblings so none of them have a clue what 6 digit passcode he would have used.", "label": 0}
{"text": "U can just search for r-sim on google and buy it from anywhere. I bought mine from Taobao", "label": 0}
{"text": "Eh wrong sub buddy", "label": 0}
{"text": "Isnt there decrypt.day?", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Rule 5.", "label": 0}
{"text": "No sep though", "label": 0}
{"text": "If you do this, make sure the onboard blobs you dump are actually valid for downgrading", "label": 0}
{"text": "unc0ver", "label": 0}
{"text": "Sadly no one in the subreddit or server can predict the future, so it’s unknown.", "label": 0}
{"text": "Your uncle should be able to fill out https://support.apple.com/HT201441 then if you have proof of purchase, recover his Apple ID using https://iforgot.apple.com/, etc.", "label": 0}
{"text": "Flash checkn1x to a usb drive. With some luck you might be able to retain your old tweaks", "label": 0}
{"text": "Bro is turning into opa doubting everything. Opa said the same thing about iOS 16 but ended up being the one to jailbreak iOS 16…everything will come eventually no one knows how or when", "label": 0}
{"text": "No, don’t update, 15.8.3 doesn’t have macdirtycow anymore.", "label": 0}
{"text": "really? For unlimited apps or unlimited time? I have an iPad on 18.0 which would be ideal", "label": 0}
{"text": "TIMDC is for mdc only and is the best for mdc compatible versions", "label": 0}
{"text": "Same for me, seems to be a known bug", "label": 0}
{"text": "You can install trollstore for sideloading and additionally also jailbreak your phone with dopamine", "label": 0}
{"text": "In my case there was a downside to waiting. I’m on 16.6 using Trollstore and there are plenty of apps that need 17.0 to run. By the time Trollstore could run on 17 the firmware was no longer signed by Apple so I could not update", "label": 0}
{"text": "Not in the slightest, the greatest community in the world will never be defeated!", "label": 0}
{"text": "Unlimited time you can get blacklisted which means you have to reset your ipad or wait for certs to reset if you want to be safe from blacklisting buy a cert from heartzsign or apptesters they are one of the most reputable.", "label": 0}
{"text": "You dont lose data from jailbreaking", "label": 0}
{"text": "a jailbreak would come but not anytime soon, maybe end of of next year", "label": 0}
{"text": "Trollstore? Wait how do you not have unlimited signs?", "label": 0}
{"text": "Also why not jailbreak it if you’re on 15.1", "label": 0}
{"text": "No sorry, i have TrollStore on my phone whuch has unlimited apps and time, altstore on my iPad", "label": 0}
{"text": "I am jailbroken on my phone with iOS 16 and my iPad is iOS18", "label": 0}
{"text": "Exactly. Jailbreaks are taking too long to even be useful nowadays. Most people just think it's app compatibility but so many websites in Safari don't work on iOS 14 right now. I feel like not enough people are talking about that. I'm not sure what websites are doing that isn't supported in iOS 14 so maybe that won't be much of an issue going forward.", "label": 0}
{"text": "I was wondering that. But I think it's the lighting on the phone's LCD.", "label": 0}
{"text": "15.6 is losing compatibility now. Anything under iOS 16 you can’t use half the fucking apps lol, shit is pointless", "label": 0}
{"text": "Well for me, I use snowboard for my themes, get an always on display on my 13 pro, use a tweak to organize all my notifs, jade for cc, call recorder, watusi and some more  idk man Ill update sometimes in the future but for now I’m fine with what I got", "label": 0}
{"text": "Jailbreaking is “dead” in the sense that proper root will probably never be achieved publicly. But tweaked apps etc are alive and thriving!", "label": 0}
{"text": "Wow it does work, to some extent: app switcher and back and it will popup again. Still thank a lot for your finding", "label": 0}
{"text": "PAC bypass find you must", "label": 0}
{"text": "I think the battery is cooked, you should replace it along with the screen and it should be good.", "label": 0}
{"text": "Not true at all. My iPad is on 15.4 and I have 0 apps requiring me to update. Only one is chatgpt which I use on my iPhone anyways. So the same doesn’t apply to everyone", "label": 0}
{"text": "Thanks all for giving here good answers. \nI have a problem with my iPhone since last week when i had a hard bootloop. Now some apps are slow and some apps have missing some graphics. \nOften i feel, that my iphone have a memory problem. \nApps in background need a refresh and other problems. IDrestart now 3 times a day. Before the bootloop, my iphone runs perfect. 11 pro max, 13.6.\nI have a lot of useful tweaks installed. Great setting.\nRegarding the comments here, rootfs should be the best way to get my iphone repaired, right?", "label": 0}
{"text": "Thanks all for giving here good answers. \nI have a problem with my iPhone since last week when i had a hard bootloop. Now some apps are slow and some apps have missing some graphics. \nOften i feel, that my iphone have a memory problem. \nApps in background need a refresh and other problems. IDrestart now 3 times a day. Before the bootloop, my iphone runs perfect. 11 pro max, 13.6.\nI have a lot of useful tweaks installed. Great setting.\nRegarding the comments here, rootfs should be the best way to get my iphone repaired, right?", "label": 0}
{"text": "Im on 15.2 and I can’t use Uber Eats. They changed the way the app works and now you can’t click on anything. Uber still works and through that I can access eats, but it’s just a matter of time. \n\nI waited on 13.5 until my most critical apps couldn’t update and I’m pretty sure we have about 6-12 months left before things die. \n\nSome websites already don’t work on 15.2 for me so it’s slowly beginning", "label": 0}
{"text": "I mean it IS true, maybe not the apps you use. Multiple people will chime in I’m sure. Lots of apps don’t work under iOS 16.", "label": 0}
{"text": "checkra1n doesn’t work on 14.x >", "label": 0}
{"text": "Opa has already stated as much…\n\n\nhttps://i.imgur.com/i5FYfB5.jpeg", "label": 0}
{"text": "Just a thought: maybe if we can sniff out the \"check version\" server address, then we might block it with .host file editing?", "label": 0}
{"text": "Seems out of luck since it's at Shenzhen.\n\nProbably get online to check apple id status, found marked as lost, it's hard to bypass activation lock then stripped for parts.\n\nBeware of phishing emails asking for your Apple ID password, that is the only way they can remove the activation lock.", "label": 0}
{"text": "Yeah. Allie found the PAC and as you can see from the screenshot, Alfie is the one who said there probably won’t be a jailbreak on iOS 17.", "label": 0}
{"text": "you forgot nintendo 6DS", "label": 0}
{"text": "There is roothide bootstrap (not realy a jailbreak) no ?", "label": 0}
{"text": "Ohhhh, awh..", "label": 0}
{"text": "Yeah for 17.0\n\nThe 10 people on that version can enjoy it. 😂", "label": 0}
{"text": "Glas to hear it!", "label": 0}
{"text": "google apps require iOS 17 or later", "label": 0}
{"text": "nahh sidestore is really bad, was using it but it broke after 2 weeks so i couldnt refresh. jailbreak + trollstore lite is the best combo rn", "label": 0}
{"text": "Yeah but only if your on a compatible version ofc- altstore is perfect for higher versions", "label": 0}
{"text": "Sure, by submitting a forged apple receipt? They cracked down heavily on that and that's sketchy as hell. Phishing also is very low success with all the info a Google search away. But congrats bro 👏", "label": 0}
{"text": "trollstore lite is for all versions if you are jailbroken", "label": 0}
{"text": "Why?", "label": 0}
{"text": "Yeah I’ve been seeing this since 4.0.1", "label": 0}
{"text": "It’s a norm but not necessary", "label": 0}
{"text": "It's a false positive, if your antivirus isn't letting you bypass it for some reason you can try another computer", "label": 0}
{"text": "weird bruv", "label": 0}
{"text": "did you do it?", "label": 0}
{"text": "Banana Phone", "label": 0}
{"text": "Shenzhen: where good and stolen iPhones go to die", "label": 0}
{"text": "Jelbreak again", "label": 0}
{"text": "No, but the normal build of 16.3 is 20D47, not 20D50.", "label": 0}
{"text": "why can’t it be just integrated into normal TiX tho", "label": 0}
{"text": "Same thing, restored and it first says bootstrap unavailable then gives me this message, didn't have this issue on my air 2", "label": 0}
{"text": "i know how to do it :)", "label": 0}
{"text": "can you try a different version of palerain?", "label": 0}
{"text": "whats your iPad model?", "label": 0}
{"text": "Right on, it took way too much effort for minimum result - but I love the challenge of keeping old hardware usable way past its expected lifetime.", "label": 0}
{"text": "I mean there are those Apple ID bypassing services of like £100+ for anything XS/XR and newer because of the exploits they gatekeep for it", "label": 0}
{"text": "I'm using winra1n? Maybe that's the issue? Even though it works on my iPad air 2, it says it supports iOS 17, maybe I'll have to buy a USB and try Linux instead", "label": 0}
{"text": "the phone isnt stolen.", "label": 0}
{"text": "Piece by piece at this point", "label": 0}
{"text": "Didn’t say it was, iCloud bypassing is just against the rules for the *risk* of you just lying and having stolen it.", "label": 0}
{"text": "Tweaked apps are only popular because of jailbreaking. Less people will be interested to develop tweaked apps if they can’t even decrypt the app on their device. Sure you can use some random ipa service, but do you really want to run some random ipa on your daily device?", "label": 0}
{"text": "i dont think OP would lie about that.", "label": 0}
{"text": "My guess is that the two builds have different offsets but they weren't able to distinguish between the builds at runtime", "label": 0}
{"text": "it would of been 11 if i knew that you dont need garage band to add a ringtone (the other way i did it is use 3u tools, tbh ik the whole chinese spy shit)", "label": 0}
{"text": "we never know now do we? 🤷‍♂️ we both are assuming things right now", "label": 0}
{"text": "am i like old or something", "label": 0}
{"text": "Lmao ! 🤣🤣🤣🤣 \nIndeed , no public kernel exploit means no fun ! All there is just to keep community alive atleast.", "label": 0}
{"text": "What the fuck are you yapping about", "label": 0}
{"text": "Oh my bad...", "label": 0}
{"text": "You can use palera1n", "label": 0}
{"text": "But my understanding is that a proper root isn’t really necessary for like 95% of the stuff a jailbreaker would want out of a jailbroken phone", "label": 0}
{"text": "If you're on that version use TrollStore and don't bother with any sideloading services", "label": 0}
{"text": "I have downloaded it but I can't seem to find it, at this point I'm not even sure if its the right one, does the app icon appear on the app list like the other apps or is it integrated in the settings?", "label": 0}
{"text": "Declare the war with China. If seriously, it’s gone forever. Erase it and go on.", "label": 0}
{"text": "I could be wrong but this is already a stock iOS feature \n\nSettings > AppStore > In-App Ratings & Reviews", "label": 0}
{"text": "Explain me a little more please! :D", "label": 0}
{"text": "You can only factory reset it and even then it is iCloud locked", "label": 0}
{"text": "Don’t respond to any messages telling you to unlock it.", "label": 0}
{"text": "That’s why I am hesitating to update my iPad 6. It’s anyway slower on iOS 15 and above (I got a 2nd one) and with the buggy Palera1n I am not sure if it’s worth it.", "label": 0}
{"text": "Almost definitely EDC. Apple pretends to think their system is secure. A year ago you could pay a service 99 cents to find out the Apple ID on a phone by IMEI. From there the thieves will text your sister with fake FindMy links to enter her iCloud account info and see where her phone is. If the phone is still on her iCloud account after a year it’s probably been wiped and harvested for parts.", "label": 0}
{"text": "What is it with shenzhen and stolen phones 😭", "label": 0}
{"text": "The part that sucks is his ex wife had it first and after so many failed attempts it makes you out in a passcode and won’t let you use Face ID anymore.", "label": 0}
{"text": "Ah yes lemme Just Sneak over to Shenzhen and enter my Sisters Apple ID and Password. Easy", "label": 0}
{"text": "Thanks! Yes that would be super helpful, hope to see it up on a repo some day!", "label": 0}
{"text": "I´m sorry to hear that. Don´t frustrate, probably soon in a few months AI will release in Europe. Good night :)", "label": 0}
{"text": "Yeah there's nothing you can do to get the information back.  100 percent", "label": 0}
{"text": "Do i have to use sideloadly or can i use e-sign", "label": 0}
{"text": "🌺", "label": 0}
{"text": "Guys I’m not a software genius by any means. I don’t even consider myself a novice I’m just trying figure out the source of the weird stuff that’s been going on for like a year and I’m 100% self taught from researching and paying for C++ and python online courses.", "label": 0}
{"text": "This is why DFU restoring would be a good idea, it should get rid of this profile.\n\nRC = release candidate, you need to enable beta updates to see it", "label": 0}
{"text": "You know I’m not OP or whoever u think you’re responding to right 😂. I never said it’s not possible but this literally no reason for you to come on here be like “actually yes there is 🤓☝🏻”", "label": 0}
{"text": "Contact apple. They have procedure for processing request to access deceased family members devices and Apple ID accounts. There’s info you’re going to have to provide depending on your relationship a like a death certificate, power of attorney, etc. They walk you through everything you’ll need. So I would just call. It doesn’t cost anything and the worst they can tell you at the end of the process is no lol", "label": 0}
{"text": "Sorry for your loss 🪦📱🪦", "label": 0}
{"text": "The comment I made [here](https://www.reddit.com/r/jailbreak/s/l7OLSwfQvE) is my first comment. I didn’t say anything about it not being able to be done", "label": 0}
{"text": "what’s that?", "label": 0}
{"text": "Let’s say you use a “method”, wouldn’t be more worth it to sell it and get paid like 40K lol? And what are you saying is just trust me bro ik how to bypass iCloud", "label": 0}
{"text": "anywhere else i can chat with you man ? TG?  \nthanks for the response btw", "label": 0}
{"text": "Do you mean apps requiring you to update or phone models not getting newer iOS updates after a few years…? Those both have been a thing for a long time and aren't apple if thats not what you mean then I don't know your I'll have to explain what you mean", "label": 0}
{"text": "He said it was sitting around doing nothing and he probably has other iOS 17 devices", "label": 0}
{"text": "Are you saying the dns “bypass”?", "label": 0}
{"text": "So when you see this, that’s how they get in lol.", "label": 0}
{"text": "Impossible", "label": 0}
{"text": "Perhaps an attacker had physical access to your device unlocked, a paid $99/year developer certificate, and a very strong revenge motive planned well in advance, in order to uninstall the legitimate apps and install illegitimate ones. This seems unlikely to me.\n\n> my phone has been behaving oddly since then, and my credit score crashed from 781 to 439 because every payment I’ve made for the last 7 months from this device that I receive receipts and confirmation numbers for is not actually going to the places I need to pay so here I am, $17k in debt and my phone company, car financing company and 4 credit cards have been without payments all this time\n\nHonestly, if it's that serious though, I would suggest discussing the issue with your bank rather than strangers on the Internet.", "label": 0}
{"text": "See https://www.idownloadblog.com/tag/sparserestore/ if you're wondering what you can do with SparseRestore\n\nTL;DR: It's basically just https://theapplewiki.com/wiki/MobileBackup_Copy_Exploit but for iOS 18", "label": 0}
{"text": "No it’s not and you are facing issues with it", "label": 0}
{"text": "They aren’t the same thing. You don’t download WatchOS on to a Galaxy watch to make it an Apple Watch. What have you been smoking", "label": 0}
{"text": "Legacy iOS kit or Future restore", "label": 0}
{"text": "Why can’t you like windows choos another boot option", "label": 0}
{"text": "It’s a watch. Not a computer. You can’t just install MacOS on a PC.", "label": 0}
{"text": "Technically I can", "label": 0}
{"text": "13p has 120hz", "label": 0}
{"text": "It doesn’t make it a Mac does it. Doesn’t work like that so stop asking.", "label": 0}
{"text": "I also saw that when preparing my post that's meant to help with jailbreaking using Dopamine. It was so fucking funny to me.", "label": 0}
{"text": "You shouldn’t be using both imo, choicy will prevent vnode from working with that app if you have tweaks disabled for it", "label": 0}
{"text": "🥷🏿", "label": 0}
{"text": "No, it's only for iOS 17.0 maximum, not later.", "label": 0}
{"text": "For sideload app, you can use Sideloadly, Altastore, SideStore,...", "label": 0}
{"text": "100% it got ripped for parts, as you can reprogram screen and replace battery controller and other things don't break much", "label": 0}
{"text": "Phenomenal", "label": 0}
{"text": "Not the apps because they get downloaded from App Store and don't contain any data.", "label": 0}
{"text": "im not a newbie im just wondering because i lost my dopamine on 15.3.1 earlier this year because of the same issue", "label": 0}
{"text": "cheers", "label": 0}
{"text": "Even worse if you aren’t new. There are daily posts about iOS 18.", "label": 0}
{"text": "Can you show me or link me to a guide to all of this being able to side load on newer ios’s?? i’m actually so curious", "label": 0}
{"text": "LOL", "label": 0}
{"text": "Why would you hate being jailbroken is way better than", "label": 0}
{"text": "i literally daily an android, it's just that it became so outdated and pointless that I got an ios 16.5 iphone just for that and sent it back", "label": 0}
{"text": "It is what it is my friend", "label": 0}
{"text": "It’s very unstable, i don’t have a lot of tweaks but my cellular will cut off randomly, apps will die in the background after leaving it for more than 5 seconds, my messages app works half the time, some calls just refuse to go through on either end sometimes not even letting me know i got a call til after i’m unjailbroken, it’s such a headache", "label": 0}
{"text": "Nothing lol", "label": 0}
{"text": "oh and i get like zero support for newer apps i like", "label": 0}
{"text": "Well... this one worked fine. No annoying popups. What is even the difference between this one and ytLitePlus? It has pretty much everything the other one had. What am i missing?", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "\\[Snapper 3\\] works well for me. I've only had it installed for about 2 weeks, but, so far no apps have detected screenshots via Snapper.", "label": 0}
{"text": "Does it work with instagram?", "label": 0}
{"text": "Welp that sucks i guess sideloading kinda funky since if you don’t pay for a cert while using esign for unlimited signs you might get blacklisted (banned)", "label": 0}
{"text": "Sure just sell with icloud", "label": 0}
{"text": "How Chinese second hand market handles your iPhone:\n\n1. First, try fishing with fake emails, in hope to steal your Apple ID as well, so the iPhone will be unlocked perfectly.\n\n2. Try jailbreak and iCloud bypass.\n\n3. Tear it down and sell valuable components like screen, camera, etc separately for a really good price.\n\nShenzhen is a place selling various kinds of illegal obtained iPhones and bogus iPhone components. People can walk in and buy each component depending on your quality demands and later put them together to get a complete iPhone.", "label": 0}
{"text": "It's really not great, tethered and quirky as hell", "label": 0}
{"text": "you’re thinking too small. arbitrary entitlement signing is probably the best part of trollstore", "label": 0}
{"text": "that can’t be true.. I downloaded imazing on Mac and plugged in my phone to the macbook and clicked exit recovery mode button once it detected my phone, and it did exit my phone out if recovery mode..", "label": 0}
{"text": "Staying lowest version is always a good move tho", "label": 0}
{"text": "When you see it…", "label": 0}
{"text": "If they used some regular double sided tape, that is a pretty big problem.\n\nAlso, did they forget to put the shield over the connectors? Some repairers are too lazy to put those back on and it causes these problems.", "label": 0}
{"text": "Now my Snapchat is locked for 1month I’m not using any tweak but not added in choicy so here we are", "label": 0}
{"text": "I am, but I’ve tested with it disabled. Is this a known issue?", "label": 0}
{"text": "I’m hoping maybe i can go under the radar, i have a dev account under my personal email and have had it for like 8 years now", "label": 0}
{"text": "Dude you spend too much time on twitch", "label": 0}
{"text": "Still doesn’t work", "label": 0}
{"text": "Are you using usb-c to lightning?", "label": 0}
{"text": "Nope", "label": 0}
{"text": "iphone 8 iOS 16.7.10", "label": 0}
{"text": "And how are you doing DFU?", "label": 0}
{"text": "Dfu mode it’s working fine", "label": 0}
{"text": "Did you pair the device?", "label": 0}
{"text": "Wdym", "label": 0}
{"text": "I just bought the airpod4 and connected to my iphone 11pm with 17.2 and also iphone13pm 17.0.  The only item feature not working is the findmy.  Can u check if u can see your airpod under findmy?", "label": 0}
{"text": "now that I think of it, I'm starting to see why the Block Phone concept never took off. I mean imagine if the iPhone had interchangable parts across multiple generations of it, there probably would be a massive black market run by factory workers / shady people who knew them who wanted to make some extra cash.", "label": 0}
{"text": "they aint gonna do squat 😭", "label": 0}
{"text": "i hate watching livestreams, twas a joke", "label": 0}
{"text": "What do you mean by pair like connect with the cord?", "label": 0}
{"text": "Even though watchOS to wearOS is dumb and impossibe, r/hackintosh is alive and well. My main computer is an AMD Ryzentosh with a Ryzen 5 3700, Vega 64, and Sequoia. macOS arm is a different story tho.", "label": 0}
{"text": "I'm wondering tho.. does redoing step 3 and stuff and just disconnecting the wi-fi interrupt the software update?", "label": 0}
{"text": "Update?", "label": 0}
{"text": "Smartbattery is lit 🔥, thanks 🫡", "label": 0}
{"text": "Sorry I took so long, was in a vb game 😓\n\nThis can help you: https://avieshek.wordpress.com/2024/06/11/how-to-sideload-on-ios/", "label": 0}
{"text": "Pairing as is having the computer prompt you to trust the device", "label": 0}
{"text": "Yes", "label": 0}
{"text": "You can pay a Passcode Bypass, telegram has channels who you can buy this", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Dude are you there?", "label": 0}
{"text": "Dude are you busy are or something man?", "label": 0}
{"text": "Upgrading to 17 was the best decision. All i need in life is just an ability to install unsigned apps.", "label": 0}
{"text": " Thx", "label": 0}
{"text": "Yo I really need this jailbreak", "label": 0}
{"text": "Hey there, did you found any app?", "label": 0}
{"text": "No it doesn’t have find my also", "label": 0}
{"text": "No they're just too young. /s", "label": 0}
{"text": "Any update? Also you can use iTunes on PC too", "label": 0}
{"text": "Those are all great. Or just search the sub for respring cc tweaks.", "label": 0}
{"text": "Hey AlexRaidz, Did you get yours to work as well?", "label": 0}
{"text": "Hi, any update?", "label": 0}
{"text": "It worked", "label": 0}
{"text": "Ok idc.  I was correcting the person.  Too bad you can’t handle the truth. Plus why would I care what you think.  Everyone in person says I am nice. Its like me saying you are unbearable.  That doesn’t make it true.  Maybe learn what’s possible and what’s not.  Bypassing the lock is well within possibility because I have done it multiple times.", "label": 0}
{"text": "Any update?", "label": 0}
{"text": "Source? I feel like that would be big news if it were true, since a good part of Apple’s reputation is based on protecting against companies like that.\n\nA death certificate alone isn’t good enough proof to get Apple to unlock it. Not everyone who dies is on good terms with their family or wants their family to be able to access their account.", "label": 0}
{"text": "i’m on 15.6 and it fucking sucks. if u don’t have the apps u need already installed on the phone, it’s a pain in the ass now that IPAranger is DOA.", "label": 0}
{"text": "They won’t unlock it then they would just allow you to remove the lock to the icloud account and restore it clean.", "label": 0}
{"text": "Ooh I see, there are ways.", "label": 0}
{"text": "All i did was tell the truth.", "label": 0}
{"text": "Enabled gestures", "label": 0}
{"text": "Was just messing around and got it to give me this information.  Thank you for sharing the original system prompt. Here's a condensed version for clarity:\n\n*Location Instructions:*\n\n1. Check if the question is location-dependent.\n2. Use predicted current/home location for location-specific queries.\n3. Format location as {\"country\", \"region\", \"city\"}.\n4. Don't state or imply knowledge of user's physical location.\n5. Base responses on city, unless user specifies otherwise.\n6. Use user-provided location if different from predicted.\n7. Ask for location if none is available.\n8. Use predicted location for relevant responses.\n\n*User Location:*\n\n- Predicted Home: {\"United States\", \"Florida\", \"Eagle Lake\"}\n- Predicted Current: {}", "label": 0}
{"text": "Ive been getting meta to tell me all sorts of stuff through the voice command it doesn't seem to filter it.  The information I have, including the predicted location, was provided by my developers or the platform I'm integrated with.\n\nHere's how it works:\n\n1. My developers integrate me with various data sources and APIs.\n2. These data sources provide information, such as predicted locations, based on user interactions or sign-up data.\n3. I access this information to provide personalized responses.\n\nMy predicted location data comes from:\n\n1. User sign-up information.\n2. IP address geolocation.\n3. User-provided location data.\n\nKeep in mind that predicted locations may not always be accurate. If you'd like to correct or update your location, feel free to share it with me!Thank you for sharing the original system prompt. Here's a condensed version for clarity:\n\n*Location Instructions:*\n\n1. Check if the question is location-dependent.\n2. Use predicted current/home location for location-specific queries.\n3. Format location as {\"country\", \"region\", \"city\"}.\n4. Don't state or imply knowledge of user's physical location.\n5. Base responses on city, unless user specifies otherwise.\n6. Use user-provided location if different from predicted.\n7. Ask for location if none is available.\n8. Use predicted location for relevant responses.\n\n*User Location:*\n\n- Predicted Home: {\"United States\", \"Florida\", \"Eagle Lake\"}\n- Predicted Current: {}", "label": 0}
{"text": "If there was an option for it, I’d make sure the phone plays a very loud and annoying noise like lost AirPods do to annoy the fuck out of whoever stole it.", "label": 0}
{"text": "Lol you’re not owed freedom of speech its social media not city hall", "label": 0}
{"text": "Bootloop. Probably hardware related now since it was after a fall. Maybe you can do an erase through icloud to try and preserve the iOS version its on but if that fails and you try restoring through a pc and that fails as well then its 100% hardware related", "label": 0}
{"text": "You can decline the swap. Ive done it. Went to get my battery swapped. They found a issue wrong with my Camera and Signal antenna. I asked them to just replace the back camera. They said they can do that but not the signal without giving me a new phone. I had to beg a lil bit but they replaced the camera. I still struggle with 5G sometimes but jailbreak is more worth it on a 13pro max 15.1.1.", "label": 0}
{"text": "No need to brag jeez", "label": 0}
{"text": "sigh!! I just got out of hardware issues a month ago :(", "label": 0}
{"text": "Wasn’t bragging.  I just dont like dissemination,", "label": 0}
{"text": "Jesus this comment section is crazy", "label": 0}
{"text": "Alr", "label": 0}
{"text": "Wasn’t a rant but ok.", "label": 0}
{"text": "Just don't make the mistake I made (trading with a 7th gen iPad and jailbreaking it)", "label": 0}
{"text": "I did and also installed an OTA blocker profile, thanks again!", "label": 0}
{"text": "Cydia Installer from cracked repo", "label": 0}
{"text": "Give me repo list pla", "label": 0}
{"text": "baraba.vip", "label": 0}
{"text": "im using 6s too and its working on mine", "label": 0}
{"text": "Sielo says csnt find", "label": 0}
{"text": "That’s not jailbreaking, that’s just using imazing to exit recovery mode.", "label": 0}
{"text": "iGimme8", "label": 0}
{"text": "update = no tweaks, no anything, only sideload", "label": 0}
{"text": "yes.. but that's exactly what OP was looking for was it not?", "label": 0}
{"text": "hi", "label": 0}
{"text": "Battery disconnected??", "label": 0}
{"text": "Well yes it is, it just seems like you were opposing that jailbreaking won’t help them exit recovery mode.", "label": 0}
{"text": "you can't downgrade", "label": 0}
{"text": "I’m also really new to jailbreaking so many terms could confuse me 😭", "label": 0}
{"text": "hmmm...i would assume so   \nI'll see if I can find a repairer that can help adjust the battery   \nhopefully, it works out :(", "label": 0}
{"text": "I checked YouTube, and someone said he adjusted his battery, and the phone came back on", "label": 0}
{"text": "Any repair shop can do that, you can even DIY it with the right tools", "label": 0}
{"text": "that's an awful 40 dollar android screen right there, anyway palera1n should do it's thing. if you don't have linux just boot palen1x from a flash drive", "label": 0}
{"text": "It doesn’t work unfortunately. I tried, they can’t accept it. They’re whole thing is passcodes aren’t kept.", "label": 0}
{"text": "im trying to run a ps2 game it works but lags\n\na shitload and says no JIT", "label": 0}
{"text": "you got the death certificate, send it to apple.with the box of the phone pictures and the invoice,they will help you.\n\nIf you dont have these there is always smd iremovalpro and checkm8 out there,Be prepared to pay a second hand iphnoe price, this is how expensive it is..good luck on your story......live love life and you will see there benefits", "label": 0}
{"text": "Did you try if Wii games work with DolphiniOS? Because it requires JIT. Try the beta version.", "label": 0}
{"text": "Rune can screenshot but can't record (as far as I know)", "label": 0}
{"text": "~Untethered jailbreak \n\nUhhhhhmmmm, what? Where did you get that info", "label": 0}
{"text": "From what repo?", "label": 0}
{"text": "Havoc, but I just remembered it's paid, sorry if you wanted something that wasn't", "label": 0}
{"text": "90% of paid tweaks are $1.49 - $1.99, these tweaks often take months, out of a developers free time to make. Not to discredit this tweak at all but it's simple, it has no code, just 3 hooks which remove the body of the 3 methods", "label": 0}
{"text": "Maybe he confused it with semi-untethered? (dopamine)", "label": 0}
{"text": "Just download the tweak central and that will center all icons on any home screen roll if it is not the full four or five icons across that you have displaying", "label": 0}
{"text": "Battery is partially disconnected", "label": 0}
{"text": "It kinda is though. You buy a thing and it's not yours. It's like you buy a fridge and are only allowed to put products in that, the fridge-maker allowed. Sounds stupid, but is exactly what's happening. Same with the tyre analogy before. But some people just like it that way. One could even say many. I'm thinking of Keurig for example, or Nespresso, before the pods patent ran out. It's not illegal or wrong. Just somewhat stupid.  \n  \nApple doesn't have to make something that fits everyone. They shouldn't either, that's what competition's for. And if somebody, consciously, buys their stuff and then complains it doesn't do what they want. Guess what, joke's on them. It's not like you HAVE TO buy that. There are thousands of options. But if you want the Apple ecosystem, you have to live with Apple's rules. You can't move to a place and expect people there to change for you either.\n\nBut, in the end I also would like to have complete control over MY device. If I can get it, cool, very noice. If not, sucks, but it is what it is and I'm not going to cry like a toddler about it. I chose this, knowing full well what I'm getting into, after all.", "label": 0}
{"text": "No man, YOU created the problem. \n\nDid YOU buy the iPhone? Yes? \n\nDid you know what it could and could not do? Yes?\n\nDid you like what it can't do? No? Why the fuck you buy it then? \n\nSeriously. You are like a toddler being mad that the other kid plays with your toy, after giving it away.\n\nBUT, I do understand your point. I wholly agree that it's stupid that you aren't allowed to have full control of the device's software. Yet, YOU decided to get an iPhone. It was your decision to get into this stupidity. And you can't blame anyone for it, except yourself. You could have gotten another phone. There are thousands to choose from. But you wanted this one. So, if you can get full control over it, cool, very noice. And if not? Well, it sucks a bit. But it's not like you can be surprised or angry about it. Was your decision to get that thing after all.\n\nIt's the same as Keurig or Nespresso were/are. You get that thing, knowing full well what you get into. An ecosystem controlled by the manufacturer. If you don't want that. Get something else. YOU have to weigh YOUR priorities YOURSELF. Like what the ecosystem can do more, than you hate what it can't? And the other way round.\n\nYou can't move and expect people there to follow your rules and culture neither. Can you? You'd be very quickly shunned away of that community. Apple's exactly that. You either like it and take the compromises, critiquing them like an adult, maybe. Or you don't. There's no: I want it but I hate it. That's called Stockholm syndrome. And that you should get checked out, if you feel like that.", "label": 0}
{"text": "Did you ever find it? Found a package named the same thing by the same developer in https://ib-soft.net/cydia/ but the repo won’t load, so I don’t think that’s the one", "label": 0}
{"text": "i did it and then when i tried to install it on trollstore again i got install error 171 it says a non trollstore or trollstore lite app with the same identifier is already installed", "label": 0}
{"text": "How long did ur phone keep boot looping for until the home screen popped up?", "label": 0}
{"text": "is it compatible with iOS 16 ?", "label": 0}
{"text": "Yeah should work", "label": 0}
{"text": "Take the phone and death certificate to Apple and they’ll help you", "label": 0}
{"text": "Just use troll recorder X", "label": 0}
{"text": "Just use palera1n if you want kernel exploit on latest editions 🙄", "label": 0}
{"text": "It’s just labeled as icleaner pro now in sileo", "label": 0}
{"text": "Explain how and where to download it, since Sonus is only a rootful tweak and an old one.", "label": 0}
{"text": "ios-repo-updates.com is your best bet for finding tweaks/repos imo. but it says that little12 was on packix before being taken down", "label": 0}
{"text": "There is a tweak called **VolVibes** that can remove the Volume HUD.", "label": 0}
{"text": "my brother in christ what do you have in that flash drive", "label": 0}
{"text": " Try to compile it yourself and check :)", "label": 0}
{"text": "The phone might not be stolen, but if this sub starts sharing icloud bypass tools all the time, idk how long it will last before getting blasted by apple", "label": 0}
{"text": "Okay", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "Okay thanks", "label": 0}
{"text": "Buy a new one.", "label": 0}
{"text": "What’s the theme called looks like vivacity not to sure", "label": 0}
{"text": "That's not snowboard deleting them, that's the UI cache being refreshed for apps that are uninstalled.", "label": 0}
{"text": "Please read the rules.", "label": 0}
{"text": "no but when i uninstall snowboard the icons come back", "label": 0}
{"text": "Could you even create multiple containers with the same app id without a jailbreak?\n\nJust use craine.", "label": 0}
{"text": "Have you tried ModMyIPA? Worked for me recently but didn’t try it with Instagram.", "label": 0}
{"text": "That 171 is because you still have the app installed", "label": 0}
{"text": "doesnt work on xina rootful", "label": 0}
{"text": "Goji Pro by Packix", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "True, but Apple intentionally implements complex parts in very specific and unnecessary ways simply to make it harder to repair your phone so you go buy a whole new one instead, or pay close to the same price getting your last gen device fixed. Sure there would be some negatives, but it’d also be a hell of a lot cheaper to fix your phone and who knows what kinds of customization / mix and match that could lead to as well. They (Block Phone) had a good idea, it’s just difficult to implement properly and also remain an attractive device", "label": 0}
{"text": "I just switched to dopamine2-roothide and everything is working perfectly. I had to install choice for my discover app but (no overheating or battery draining so far) compared to serotonin. 16.3", "label": 0}
{"text": "What do I do when he says, \"Unfortunately, I can't help with this request at this time. Can I help with something else?\"", "label": 0}
{"text": "its been wild how some ignore it or bypass it in some way. definitely been a problem on mac. i have resorted to just leaving 1 star reviews whenever it pops up at that point lol. they asked for it 🤷‍♂️", "label": 0}
{"text": "I just switched from Serotonin to D2-Roothide and saved all my .deb files from the Serotonin JB in icloud. everything loaded perfectly and is running well. no overheating or battery drain as far as I can tell yet>  \nyour tweak needs to be rootless first then you can use the patcher to convert to roothide and install. If you have a rootful tweak, then it has to be converted to rootles first then converted to roothide. \n\nLet me know if I can help with anything", "label": 0}
{"text": "I know what it meant.  I meant to put false before it.  We are all human i make mistakes but i do my due diligence to not spread false dissemination out without doing my best to know if its fact or not.", "label": 0}
{"text": "No way?", "label": 0}
{"text": "Not true. I sold two from CZ", "label": 0}
{"text": "will ios 16 support bsic apps like yt,insta for 2 years from now?? im new to ios", "label": 0}
{"text": "I only found that out last night haha. But thank you for clearing that up. TikTok sounds exactly like the app I would love, but for some reason I always forget about it and go to YouTube or somewhere else for videos.", "label": 0}
{"text": "TikTok’s videos are way better imo", "label": 0}
{"text": "I told you in dms i dont know about mac version", "label": 0}
{"text": "Thamks", "label": 0}
{"text": "thanks!", "label": 0}
{"text": "[https://docs.palera.in/docs/get-started/installing-palera1n-macos](https://docs.palera.in/docs/get-started/installing-palera1n-macos)  \nclick that link and do the manual installation, but remove palera1n before installing. also don't install the latest version, install an older one maybe it will work  \nagain I don't know anything about macs so It might not work", "label": 0}
{"text": "Legit thought that was a UI color tweak", "label": 0}
{"text": "N95 changes the album cover shape", "label": 0}
{"text": "oh.. ok :(", "label": 0}
{"text": "Installing clang would be a good idea", "label": 0}
{"text": "The context menu action is now functional with v0.2.0^^", "label": 0}
{"text": "still on iOS 12?? how do you survive on such an old version?", "label": 0}
{"text": "OTA file is almost unusable right now. OTA means Over the air. OTA files is used by Apple for updating using Internet.", "label": 0}
{"text": "An OTA lets you upgrade your device on the device. After an ipsw is unsigned, there is a period where the OTA is still signed. \n\nTo use an OTA profile, have to get your device supervised (you can use something like cowabunga lite to supervise) and then install the profile. Then, it should let you upgrade to that OTA update.", "label": 0}
{"text": "People in 2015: How to remove them.\n\nPeople in 2024: How to get them back.", "label": 0}
{"text": "It's not my main phone lol", "label": 0}
{"text": "You need to change the package identifier in the Info.plist on the ipa", "label": 0}
{"text": "But modmyipa not doing it already? I don’t understand the procedure, I’m trying to clone instagram multiple times tho", "label": 0}
{"text": "No I don’t think it does automatic", "label": 0}
{"text": "You can use a tweak to decrypt one ipa then zip the folder and change the Info.plist bundle to com.instagram.app1 easily make like 20 in a few minutes", "label": 0}
{"text": "so can I downgrade my xr with that?", "label": 0}
{"text": "i did it but when i used trolldecrypt for example when i tried to install ig i had a warning saying that the app is succesfuly installed but has additinal binaries that are encrypted which may cause problems to the app itself", "label": 0}
{"text": "Sysdiagnose/logs/MCState/Shared/Publicinfo/MCMeta:\n“LastMDMMigratedBuild_\u0010&StopFilteringGrandfatheredRestrictions_\u0010\u0011LastMigratedBuildV22R361\bV22R361\b\u000f&Ocjk\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000r”", "label": 0}
{"text": "May you update your tweak please", "label": 0}
{"text": "I HAVE THAT EXACT ONE (but I’m using dopamine for iOS 16)", "label": 0}
{"text": "For jailbreaking you want to downgrade to the newest signed version of iOS if you don’t want a jailbreak you can stay", "label": 0}
{"text": "Have you tried [[Antoine]]?", "label": 0}
{"text": "just make a new one yourself", "label": 0}
{"text": "such a sus request", "label": 0}
{"text": "You can do it in your iOS 18 device as well using MisakaX or Nugget", "label": 0}
{"text": "i think the animations were patched in ios 18", "label": 0}
{"text": "that’s crazy, watchos will refuse to boot with the samsung", "label": 0}
{"text": "yup my bad", "label": 0}
{"text": "I don’t want to be mean but I don’t understand this. I’ve heard it so many times just close tiktok😭", "label": 0}
{"text": "Oh i thought it was because I saw cellular data, so you just use the same chip for both devices?", "label": 0}
{"text": "Could use cowabunga lite. Just get a PC/Mac.", "label": 0}
{"text": "None of us here are running Onlyfans Agencies, try your luck in ur TG groups", "label": 0}
{"text": "Bro why every time I ask this question I get an onlyfans agency response, I’m not doing that shit wdym", "label": 0}
{"text": "Na dude if you cheating on her you should just be honest about it why do you need to hide them so bad", "label": 0}
{"text": "You're still doing some shady bs, don't try to fool anyone here man", "label": 0}
{"text": "You are, I'm telling you that no one will support ur shady stuff. Ask your TG groups", "label": 0}
{"text": "Wtf lol", "label": 0}
{"text": "1, yes\n2, backups don't restore the OS, just user data\n3, it's hit and miss for some folks\n4, you should be fine.", "label": 0}
{"text": "Buy new", "label": 0}
{"text": "how?", "label": 0}
{"text": "not the issue, clang literally isn’t installed", "label": 0}
{"text": "2 days trying to do something you can’t. Wow", "label": 0}
{"text": "No way. And probably you will never be able to do so. If you want jailbreak find another iPhone with jailbreakable ios", "label": 0}
{"text": "Anyone can say anything they want and lie on Github and upload scams or viruses for people to download. This is a scam.", "label": 0}
{"text": "You don’t need iOS 13 to jailbreak an iPhone 11. It goes up to iOS 16.5.1. You can find a jailbreakable one on r/jailbreakswap", "label": 0}
{"text": "For sentinel, you can use reverie. Reverie is free", "label": 0}
{"text": "The only benefit to downgrading would be for performance, it might be a little faster on an older firmware. It likely doesn't run so well on iOS 17 or especially 18, but it would still be a tethered downgrade. It's up to you whether or not it's worth it. Tethered is worse, but for me, it is a very rare occurrence that I would have to reboot my device. I would just stay where you're at as long as it's not too slow for you", "label": 0}
{"text": "Try r/legacyjailbreak", "label": 0}
{"text": "Depends on which ios version you got.\nLook at the tutorials on https://ios.cfw.guide.\nThey guide you through the whole process.", "label": 0}
{"text": "I love this theme. Reminds me from Zanilla theme back in the day", "label": 0}
{"text": "#### Your post has been removed for the following reason:\n\n> It appears you are using a scam/untrustworthy site to jailbreak your device. You should check the [FAQ](https://www.reddit.com/r/jailbreak/wiki/faq/), sidebar or [our recommended jailbreaking guide](https://ios.cfw.guide/get-started/) to check the list of jailbreakable versions and trusted jailbreak tools.", "label": 0}
{"text": "Start by learning to read the FAQs. Pinned posts.", "label": 0}
{"text": "Genius", "label": 0}
{"text": "Any updates on this, even if it’s a year old post, have you managed somehow to fix this? I’m having this issue now on my devices.\nThanks", "label": 0}
{"text": "Like get someone’s password", "label": 0}
{"text": "Why are you asking this here? This subreddit is fir ios jailbreaking", "label": 0}
{"text": "Doesn't work for anything except SMB which is still useful. Loaded up  movies and shows from my server", "label": 0}
{"text": "####Your submission has been removed for the following reason(s): \n\n>  **Rule 8** » This is not iOS/iPadOS jailbreak related.", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n**Rule 1A** » r/jailbreak does not allow piracy tools, sources, or websites. No pirated tweaks, apps, etc.\n\n\n*^(NOTE: Piracy can lead to your account being temporarily or permanently banned. See)* ^[*here*](https://www.reddit.com/r/jailbreak/wiki/rules#wiki_ban_policy) ^(*for more information.*)", "label": 0}
{"text": "####Your submission has been removed for the following reason(s): \n\n>  **Rule 8** » This is not iOS/iPadOS jailbreak related.", "label": 0}
{"text": "Absolute Perfection", "label": 0}
{"text": "John fortnite will", "label": 0}
{"text": "oh god are u serious", "label": 0}
{"text": "Check the color of ur phone or look on ur reciept", "label": 0}
{"text": "this is r/jailbreak ask someone else", "label": 0}
{"text": "you can fix the font", "label": 0}
{"text": "I just let the boot loop continue on for a long time until my phone eventually came out of it on it’s own and then I deleted stuff to make sure it doesn’t happen again.", "label": 0}
{"text": "Are you lost?", "label": 0}
{"text": "No, your best bet for jailbreaking that device in the future is to downgrade it to 17.6 beta 1 and hope a jailbreak gets released in a year or two", "label": 0}
{"text": "Did you fix the problem?", "label": 0}
{"text": "Ty <3", "label": 0}
{"text": "Your need wake up", "label": 0}
{"text": "So you can write English?", "label": 0}
{"text": "Will try this, thanks!", "label": 0}
{"text": "Hello! I've removed your post because I believe it should actually go in r/iOSthemes. Could I ask you to repost it there? Thanks!\n\nIf you think I've made an error, please [send the moderators of r/jailbreak a message](https://www.reddit.com/message/compose?to=%2Fr%2Fjailbreak&subject=AutoModerator%20theme%20removal%20%7C%20post%20by%20u%2Fnfzerox&message=Hello%2C%20I%20believe%20my%20post%20belongs%20on%20r%2Fjailbreak%2C%20not%20on%20r%2FiOSThemes.%20Could%20you%20please%20approve%20it%3F%20Thanks!%0A%0Ahttps://www.reddit.com/r/jailbreak/comments/1gdtylr/release_ipod_theme_theme_your_ipod_nano_6th_and/). (This link contains a pre-written message so it's less hassle for you. Don't click the one below)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Ik this is an old post but I want to get this straight, is the only Apple Intelligence feature this exploit enables the new Siri UI?", "label": 0}
{"text": "LOL JAJJAJJAAJJAAJJ OK OLD ASS", "label": 0}
{"text": "Great move old ass", "label": 0}
{"text": "This was made for iOS 16 things might have changed in iOS 17 I do not have a device unfortunately", "label": 0}
{"text": "Artfull", "label": 0}
{"text": "That’s alright, no worries! Are you able to at least confirm that this worked on iOS 16.X bootstrap without needing a semi-jailbreak like Serotonin? ", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "I can download the deb file, but whenever I try to install the tweak, I get an error saying my architecture does not match the one that Little 12 uses. Is the problem on my jailbreak? I use a rootless jailbreak, should I change to rootful?", "label": 0}
{"text": "I have but they told me to pos here lol", "label": 0}
{"text": "What do you mean by my phone being supervised?", "label": 0}
{"text": "Having the isSupervised key in a plist set to true? Look up iPhone supervise", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "H", "label": 0}
{"text": "[ Removed by Reddit ]", "label": 0}
{"text": "Are there any other options to do it without pc? And will it surely work if i connect my phone with my laptop with cowabunga lite installed? I also heard i need swift and itunes installed. Do you got any recommendations for tutorials? I really appreciate your help. Thank you so much. I thought my phone is broken to route.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "I’m broke", "label": 0}
{"text": "Life hack to save one tap:\n\n- Tap and hold the \"123\" button\n- Type a number or specifial characters while still holding the 123 button\n- let go of the 124 button", "label": 0}
{"text": "Is this a joke?", "label": 0}
{"text": "Why? Do you think it‘s funny?", "label": 0}
{"text": "It doesnt work", "label": 0}
{"text": "It should work, it‘s a rather old feature. Saves one tap compared to\n\n- tap the 123 button\n- tap your special characters \n- tap the 123 button again", "label": 0}
{"text": "Oh, it isnt even related to the problem lol", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n**Rule 4** » We do not allow low-quality/low-effort posts. Read [here](https://www.reddit.com/r/jailbreak/wiki/rules#wiki_rule_4.3A_dank_memes_.26amp.3B_low-effort_content) for more info.", "label": 0}
{"text": "Hello broke 👋", "label": 0}
{"text": "Funny", "label": 0}
{"text": "And you can’t have the tweak then. Read the rules.", "label": 0}
{"text": "Yes. Correct. Only the new UI. no writing tools no cleanup. Nothing. The UI will be there. But the AI models won’t fully be there either. Siri will be a little smarter but still useless as it has always been.", "label": 0}
{"text": "you dont, your baseband is fucked", "label": 0}
{"text": "It does", "label": 0}
{"text": "you can't you need to update (i think)\n\nif you want to update connect it to itunes snd update from there", "label": 0}
{"text": "Dude wtf just be a normal guy", "label": 0}
{"text": "You come here to say that to everyone in every post?", "label": 0}
{"text": "I mean you can reset the phone and lose all data, no computer for that. If it's a pc what you've got I guess you do indeed need itunes and swift, tho it's the first time i hear you need swift for that, maybe itunes takes care of that. I cant guarantee it'll work, but i think it should. It's the only thing i can think of. As for tutorials check out the github page, although it's simple enough that no tutorial is needed. Maybe some app that uses sparserestore that would either remove the footnote or allow to set a new one and then remove it, or let you supervise the phone, in which case i would further help you once youre supervised", "label": 0}
{"text": "Given your ios version here are the options:\n-find some app that uses sparse restore to add a footnote (or to supervise the device)\n-\tnext option: cowabunga lite on pc. Add footnote then remove footnote \n-\tif cowabunga lite says unsupported version, we supervise the device with a backup manipulation with imazing and then intall a profile to add a footnote and then remove it\n-\tif rewriting the current footnote and then removing it doesnt work, we manually export all the data from each app with imazing, restore the phone, and manually feed the app data back to apps. Computer needed for imazing", "label": 0}
{"text": "You can update all you want, these issues are usually never update related. More often than not it’s a dead baseband, especially in Chinese iPhone 7s.", "label": 0}
{"text": "Sorry but jailbreaking will not help update to incompatible iOS versions, it is impossible.", "label": 0}
{"text": "No, sorry. The updates are just unsupported and jailbreaking can't change that. You can try to use 3DAppVersionSpoofer tweak, but it won't work on every app.", "label": 0}
{"text": "Nope, but feel free to let me know if you find anything by any chance! :)", "label": 0}
{"text": "could you do it for me please?", "label": 0}
{"text": "respring bro, it's happening always", "label": 0}
{"text": "fix the baseband", "label": 0}
{"text": "the baseband being broken isnt always the case. and if not then it is fixable", "label": 0}
{"text": "Lolz\n\nUse a different sim bruh", "label": 0}
{"text": "Depends what iOS and JB you’re at.\n\nBut I’ll list a few anyways;\n\n* Choicy\n* Vnodebypass\n* Liberty Lite\n* Shadow\n* A-Bypass\n* Libhooker Config\n* KernBypass\n\nNow, not all those will work, especially it depends on your setup if you can use them.", "label": 0}
{"text": "Try reinstall iTunes for windows and open both iCloud/itunes. Same errror happened to me few years ago", "label": 0}
{"text": "Oh, so I need to have iTunes open in the background as I sideload?", "label": 0}
{"text": "Delete the tweak", "label": 0}
{"text": "How", "label": 0}
{"text": "Just remove the tweak from sileo or whatever package manger you have", "label": 0}
{"text": "I only got Filza because I hide Sileo too", "label": 0}
{"text": "Idk to be honest but most likely u need iCloud and iTunes opened in background", "label": 0}
{"text": "Make sure iCloud and iTunes are installed (**NOT** from the Microsoft store) and additionally the 60mb of space left on your phone could be an issue.", "label": 0}
{"text": "iOS 16.7.8 iPhone X, palera1n rootless bro. Basically, I’m not sure if I’m trying to hide the jailbreak itself or the crane, but if you got any idea it’ll be super helpful bro thank you very much", "label": 0}
{"text": "No, sorry the 60mb left is on my pc", "label": 0}
{"text": "Bad tweak, wakes up randomly, drained 30% of battery in 7hrs of sleep and doesn't even turn off springboard", "label": 0}
{"text": "iOS 16.7.10 and I use palera1n", "label": 0}
{"text": "No jailbreak available for ios 18. For future reference, check [ios.cfw.guide](http://ios.cfw.guide) next time before making a post, and DON'T use youtube to find jailbreaks, most of them are scams.", "label": 0}
{"text": "Learn to search before posting. The subreddit is filled with stupid posts like this. Unless you have one iPad you can’t Jailbreak. Anything else is a scam.", "label": 0}
{"text": "Best thing to do is remove the jailbreak or boot into safe mode to remove it but I would say remove it then rejailbreak", "label": 0}
{"text": "How I remove it", "label": 0}
{"text": "Ok, I just freed up 1.2gb, is that ok?", "label": 0}
{"text": "Ok, thanks for your help", "label": 0}
{"text": "Sorry for asking these stupid questions but I can’t find a working method so I asked in here", "label": 0}
{"text": "tHIS  is not a icloud locked device, i just not want to use apple services", "label": 0}
{"text": "When I restart my phone jailbreak disappear when I enable it back it appear back the tweak I hide sileo with the tweak app", "label": 0}
{"text": "I don’t have", "label": 0}
{"text": "Or if you have icleanerpro and didn’t hide it. Go into it’s setting and turn off apphider in its tweak selection.", "label": 0}
{"text": "I hide paler1n", "label": 0}
{"text": "The reason is there isn’t one. Like I said bar one iPad. As other poster said, anything else is a scam. But you could search “Jailbreak iOS 18” in the subreddit search and find the answer.", "label": 0}
{"text": "I took a break for about an 8-month period, so even counting from 0.0.7, it's only 7 months of development time at most.\n\nThe simple truth is that pre-alpha supported versions like iOS 12 have low priority, especially when versions with higher stated support have significant bugs in need of fixing.", "label": 0}
{"text": "calm down lmao,don't bother to ask if you don't even know whats going on. I didn't buy my iPhone 6S yet and I can't view the iOS atm", "label": 0}
{"text": "Do you have Filza?", "label": 0}
{"text": "Choicy and Shadow should work on palera1n.\n\nNow, I have never actually used Crane, but target the app.\nThats how I successfully do it anyhow.", "label": 0}
{"text": "r/LegacyJailbreak", "label": 0}
{"text": "no, i wont use my phone number for someone else", "label": 0}
{"text": "Install OpenSSH and its dependencies with Filza, then use the SSH connection to remove the AppHider tweak.", "label": 0}
{"text": "Is the problem downloading or installing?\nDid you try updating your iOS?", "label": 0}
{"text": "Try buying the iPhone 16 maybe then the AppStore will work", "label": 0}
{"text": "my main is an iphone xs, i think i should", "label": 0}
{"text": "Thx bro", "label": 0}
{"text": "Maybe you have malware/spyware on your phone \nWhat were the last tweaks you installed?", "label": 0}
{"text": "maybe its ios 6 and lower and needs stuff 9 doesnt have or it just needs resourcerules.plist", "label": 0}
{"text": "Thank you. Worked like a charm", "label": 0}
{"text": "The battery should last you 3-4 hours usage. If you aren’t getting that. The battery may not be good. That’s the only thing.", "label": 0}
{"text": "Your comment. Silly goober.", "label": 0}
{"text": "do yu have good battery life with the ipod 7, i'm considering paying wat people rip others off for one", "label": 0}
{"text": "oh my fucking god. what OS? that’s like the most important part", "label": 0}
{"text": "That’s what I want to know, i’m the search of a Mini 5 in a jailbreakable state. Which version should be the best?", "label": 0}
{"text": "if its a 6s i would recommend against that", "label": 0}
{"text": "its back up", "label": 0}
{"text": "well yeah they were pretty good on my device", "label": 0}
{"text": "uh cydia stopped saving blobs like a decade ago", "label": 0}
{"text": "Imagine being told all this with no questions as to if they have a sim in or not??", "label": 0}
{"text": "For anyone having issues with timeout after sending iBSS/iBEC then you might have a corrupt iBoot on the device and this is a problem because Apple has stopped shipping a full iBoot, tvOS 17 and onward have a \"Supervisor for iBoot\", not sure when, probably after 13.4.8 as it's still signed and has a full iBoot.\n\nI managed to patch the ipsw for Apple TV HD, not enough to fully restore but enough for iBoot to work correctly and then restore 17.2 RC\n\nYou can find the ipsw here [https://drive.google.com/file/d/1qWSZFh083btUK4UAmrdZjyTdleE3LXCl/view?usp=share\\_link](https://drive.google.com/file/d/1qWSZFh083btUK4UAmrdZjyTdleE3LXCl/view?usp=share_link)\n\nYou'll need my modified version of futurerestore, here [https://github.com/rednblkx/futurerestore/actions/runs/11559050916](https://github.com/rednblkx/futurerestore/actions/runs/11559050916) , this adds the option to skip iBSS/iBEC patches as the ones in ipsw are already patched(couldn't make it work with the patches from futurerestore for some reason)\n\nExample command looks like this: \\`futurerestore --skip-patches -t ticket.shsh2 --no-cache --no-baseband --use-pwndfu --skip-blob --sep sep-firmware.j105a.RELEASE.im4p  --sep-manifest BuildManifest.plist AppleTV6,2\\_13.4.8\\_SEMI\\_RESTORE.ipsw\\`\n\nIf everything goes well, you should get past \"Waiting for device to enter restore mode...\" and \"Updating NAND Firmware\". Once that's done, proceed as instructed by OP\n\nYou can find the 17.2 RC ipsw I used here [https://drive.google.com/file/d/1PkngAf0tQOiDKa1Djr4\\_yko7vKQAgcp7/view?usp=share\\_link](https://drive.google.com/file/d/1PkngAf0tQOiDKa1Djr4_yko7vKQAgcp7/view?usp=share_link)", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n> **Rule 5** » No posts or comments about removing locks/restrictions from locked devices. This includes bypassing Activation Lock, bypassing iCloud lock, removing IMEI unlock, MDM restrictions, bruteforcing/bypassing login on MacOS with checkra1n, or working around restrictions caused by doing any of these things.\n\nThese posts are removed to prevent people coming here for assistance on accessing a device that was stolen or otherwise obtained illegitimately. We cannot determine whether your reason for needing to bypass the lock is legitimate or not, so the topic is banned altogether. \n\nIf you are trying to get past an [Activation Lock (\"iCloud Lock\")](https://support.apple.com/en-us/HT201365), you need to [contact the previous owner](https://support.apple.com/en-us/HT201441) and have them remove it.", "label": 0}
{"text": "You jail broke iPhone 16pro max? Thought can’t be done anymore ", "label": 0}
{"text": "I had i iPhone SE 2016, i restart by device, and re-jailbreak it, for me that works (by jailbreak again the device). If you do it, please let me know!", "label": 0}
{"text": "I was using Choicy before but after the latest update the game is just crashing.", "label": 0}
{"text": "r/LegacyJailbreak is the place you should ask for help", "label": 0}
{"text": "no one understands sarcasm these days 😂", "label": 0}
{"text": "the iphone x hasn’t got an iOS update since 2 years", "label": 0}
{"text": "i see. This happens usually? Im new in all this about jb and I have a AMD CPU so this is the only option that has been working", "label": 0}
{"text": "Your comment was also 40 days late", "label": 0}
{"text": "does that mean no wifi? if it just means no sim then i dont think thats a big deal", "label": 0}
{"text": "Alright, i suppose low priority is to be expected.", "label": 0}
{"text": "i see, thanks for the info then. Hope this gets fixed by tomorrow cause 2.1 ain't working and rootfull neither", "label": 0}
{"text": "This isn’t the place for it. Anyhow good luck", "label": 0}
{"text": "/System/Library/Audio/UISounds", "label": 0}
{"text": "Tbh i couldnt get it working and just used a mac, but you definitely need the installer version of iTunes and iCloud (not store). I think you only need to sign into iCloud, but it never worked for me.", "label": 0}
{"text": "Thanks for the Information. I'm actually on 18RC", "label": 0}
{"text": "Ok i'll do that then", "label": 0}
{"text": "[Official jailbreak guide](https://ios.cfw.guide), always use this, it's updated frequently.", "label": 0}
{"text": "Cannot find it 🙁", "label": 0}
{"text": "He already has SwipeExtenderX, what’s the point?", "label": 0}
{"text": "No worries! \nLet me know if you successfully pull off the 3 app limit bypass. I am planing to do it too but not sure if it‘s worth it.", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Oof you’re right im not sure why I thought it was on IOS 17.\n\nIt might be on IOS 16.7, I have not checked the IOS version on it.", "label": 0}
{"text": "Most still can’t accept the situation that the game is over. The latest jailbreakable iOS and iPhone is two years old (iPhone 14, iOS 16.5) and no sign of iOS 17 related jailbreak stuff like exploits, bypasses etc etc and most important unique person/s who devote their time to development...", "label": 0}
{"text": "Where did he say ACE2 is used on iPhones? Sorry, but I won't watch a 30min video for that.", "label": 0}
{"text": "Theoretically yes... if there was a bootrom exploit similar to checkm8.", "label": 0}
{"text": "This is where all system sounds should be", "label": 0}
{"text": "Lies for 10 Alex. Return the stolen device.", "label": 0}
{"text": "Have you tried doing a hard reset on your phone? It has been awhile but I remember when this was happening to me I often had to wait a crazy amount of time to get from the apple logo to the lock screen. It cash get really frustrating. Just try everything you can to you get into your phone and be patient waiting for the apple logo to go away. rebuild the icon cache as soon as you're in and I think that will fix the problem (fingers crossed).", "label": 0}
{"text": "Thank again for the suggestion. I got Vizage and it surprising works awesome.", "label": 0}
{"text": "Is it a waste though? You can still manually install apps and there’s this client called Veteris which is specifically made for installing preserved applications on iOS 5-7. The AppStore was never really a big deal in recent times.", "label": 0}
{"text": "Not possible. Buy a new phone.", "label": 0}
{"text": "What’s the battery tweak?", "label": 0}
{"text": "Question. I have an Apple Watch 7 that I literally found metal detecting. Tried whatever I could do and couldnt find the owner. It’s now stuck on the iCloud Lock Screen. Is jail breaking my only option?", "label": 0}
{"text": "The \"achieved code execution\" he is talking about is for the USB chip controller not for the SoC. His PoC is to gain persistence on the USB controller.", "label": 0}
{"text": "You can't", "label": 0}
{"text": "Sarcasm is supposed to be funny", "label": 0}
{"text": "Oh ok big guy. More lies. Enjoy your paperweight.", "label": 0}
{"text": "Yes here [https://ipaomtk.com/brawl-stars-ipa/download/0/](https://ipaomtk.com/brawl-stars-ipa/download/0/)", "label": 0}
{"text": "SE 2020 is not Checkmate Device nor on iOS 15/16. It’s on iOS 17", "label": 0}
{"text": "I thought about getting the pro (the pro max is too big for my liking) rn im using an iphone 15 but I jailbroke my moms old broken 11 pro max just to test stuff", "label": 0}
{"text": "Welcome to iOS 17", "label": 0}
{"text": "Thank you, I'll try it out tomorrow", "label": 0}
{"text": "Did you get an adapter? I’m wondering if I should get one. Some are with lightning hdmi and usb", "label": 0}
{"text": "Isn't the exploit fixed there?", "label": 0}
{"text": "For no reason because it did and icloudbackup over night. What a sh*t", "label": 0}
{"text": "Oh I’m sorry man", "label": 0}
{"text": "\nthe golden rule when jailbreaking an iphone is not to play with icloud because you can run into a memory problem and then you're done with the jailbreak, when I'm jailbroken I never play with these things, but the problem is always that what happened to you happens, unfortunately there is no solution", "label": 0}
{"text": "iOS 10 is too old to take advantage of current YouTube tweaks.\n\nJust getting the app working in the first place requires plist editing at this point: https://www.reddit.com/r/LegacyJailbreak/wiki/guides/appfixes#wiki_youtube", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "My 11PM on 14.3 is getting unusable as daily driver. Besides dropped app support the outdated WebKit makes life uncomfortable. No great jb stuff can compensate almost destroyed basic usage", "label": 0}
{"text": "You can look at https://ios.cfw.guide/get-started/iPad-(4th-generation).html", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "[https://twitter.com/LeminLimez/status/1851022717241151657](https://twitter.com/LeminLimez/status/1851022717241151657)", "label": 0}
{"text": "Did you delete the jailbreak prior?", "label": 0}
{"text": "I’m itching to use that instead of Palera1n, however it doesn’t work as well with CarBridge so for now I’m sticking to the old method.", "label": 0}
{"text": "I would try force restarting it and leaving it off for a few days to see if it randomly starts working again, but if nothing works you'll have to DFU restore to a signed version and lose your jailbreak", "label": 0}
{"text": "Stay on 18.0.1 since it has the SparseRestore bug (used for Nugget and misakaX, was patched on 18.1 beta 5). The closest thing to TrollStore you can get is sideloading with a developer certificate, but TrollStore is still obviously better since it can run unsandboxed apps and apps with some other normally unavailable entitlements.", "label": 0}
{"text": "Side loaded sub is what you want. Come to the dark side.", "label": 0}
{"text": "Most businesses apps like Microsoft are all already 17.0+ only :(", "label": 0}
{"text": "I mean I understand the downvotes but this legit make chuckle", "label": 0}
{"text": "You do you but sarcasm isn’t a joke by itself in my opinion it needs more than to be unhelpful", "label": 0}
{"text": "Yeah, no jailbreaks. You can sideload though", "label": 0}
{"text": "What software did u use to jail break", "label": 0}
{"text": "I first tried before deleting, then deleted it and trollstore. No luck", "label": 0}
{"text": "Hmmm ok thanks for the info. Is there any other way to do this?", "label": 0}
{"text": "A computer is required.", "label": 0}
{"text": "No.", "label": 0}
{"text": "Ok thanks again!", "label": 0}
{"text": "Okey i have Windows", "label": 0}
{"text": "Visit the side loaded sub", "label": 0}
{"text": "I bet anything this guy works for apple. WE KNOW YOUR IN THERE TIM APPLE NO NEED TO HIDE!", "label": 0}
{"text": "Hi, I'm sorry.. which Reiboot website is it? They have different URLs and I get confused. And did you have to pay for yours to be able to exit? Bc I tried to exit recovery mode with Tenorshare Reiboot but unfortunately you have to pay for the ability to exit. Also does entering DFU mode automatically erase data?.. Thanks", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n> **Rule 5** » No posts or comments about removing locks/restrictions from locked devices. This includes bypassing Activation Lock, bypassing iCloud lock, removing IMEI unlock, MDM restrictions, bruteforcing/bypassing login on MacOS with checkra1n, or working around restrictions caused by doing any of these things.\n\nThese posts are removed to prevent people coming here for assistance on accessing a device that was stolen or otherwise obtained illegitimately. We cannot determine whether your reason for needing to bypass the lock is legitimate or not, so the topic is banned altogether. \n\nIf you are trying to get past an [Activation Lock (\"iCloud Lock\")](https://support.apple.com/en-us/HT201365), you need to [contact the previous owner](https://support.apple.com/en-us/HT201441) and have them remove it.", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n**Rule 4** » We do not allow low-quality/low-effort posts. Read [here](https://www.reddit.com/r/jailbreak/wiki/rules#wiki_rule_4.3A_dank_memes_.26amp.3B_low-effort_content) for more info.", "label": 0}
{"text": "#### Your post has been removed for the following reason:\n\n> It appears you are using a scam/untrustworthy site to jailbreak your device. You should check the [FAQ](https://www.reddit.com/r/jailbreak/wiki/faq/), sidebar or [our recommended jailbreaking guide](https://ios.cfw.guide/get-started/) to check the list of jailbreakable versions and trusted jailbreak tools.", "label": 0}
{"text": "####Your submission has been removed for the following reason(s):\n\n\n**Rule 1A** » r/jailbreak does not allow piracy tools, sources, or websites. No pirated tweaks, apps, etc.\n\n\n*^(NOTE: Piracy can lead to your account being temporarily or permanently banned. See)* ^[*here*](https://www.reddit.com/r/jailbreak/wiki/rules#wiki_ban_policy) ^(*for more information.*)", "label": 0}
{"text": "Did you have to pay for iMazing in order to exit DFU mode?", "label": 0}
{"text": "ACE just deals with the controller no? Not actually the bootrom?", "label": 0}
{"text": "Hope iPhone 15 series could be jailbreaked soon", "label": 0}
{"text": "where did you hear that from? my carbridge works fine...", "label": 0}
{"text": "To get this working — this is what you will do. \n\n— let the phone run out of battery then plug into charger and force restart. \n\nOr …\n\n— let it keep it bootlooping and eventually after few hours it will go back to Home Screen! This has worked for many users. \n\niCloud do not trigger bootloops. The only time it will is when you have messed around with deamons or disabled backup and it tried to do it and iOS crashed.", "label": 0}
{"text": "fair. if my xs max wasn’t destroyed by an electric scooter a few months ago, i’d use it for a few years more, rn using 11 pro, prob will use it till it also gets destroyed or i have good money to search for a better iphone on 16.6 at least", "label": 0}
{"text": "ACE is the controller, the bootrom is for the SoC side. That's what I meant, it's useless without a bootrom exploit.", "label": 0}
{"text": "So disappointed to hear from other commenters a whole bootrom exploit is needed. Anyway, could you share the link? I'm intrigued now!", "label": 0}
{"text": "Cracked", "label": 0}
{"text": "I have uncracked. Just buy it off. One time.", "label": 0}
{"text": "I have the rocket license. But I can’t find the latest ipa for it", "label": 0}
{"text": "Do you have the latest ipa?", "label": 0}
{"text": "Worked for me. Thanks 👍", "label": 0}
{"text": "iWhere Location Changer", "label": 0}
{"text": "Owh really ? I sould take a look", "label": 0}
{"text": "No, no the 60mb is on the pc, but I’ve cleared out some storage now", "label": 0}
{"text": "Sssh don’t blow up my cover.", "label": 0}
{"text": "Can you give your tweak list?", "label": 0}
{"text": "I’m trying this rn.. except I’m not doing the IPSW part YET.. I’m just going to skip steps 1-2 and continue \n\nRight now I did it twice & got error (9) and my third time I got the (1110) Error, same as urs. Now even tho I got the error code, it’s still stuck on the progress bar which is interesting as the previous tries went back to boot loop or mainly showed low battery icon. Will update soon tho", "label": 0}
{"text": "Also is there to fix?", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "> nO oNe WorKIng on iTT   T_T\nIt’s not that easy. You need some fucking serious exploits to tamper with SEP or Cryptex. Those systems are so deep embedded in the system that even devices with SEPROM and BootROM exploit can’t downgrade to firmwares with cryptex. It took forever that untethered downgrades with SEP were even possible after the SEPROM exploit was released. Also downgrading doesn’t work on all devices that the SEPROM exploit works on. Those exploits are worth thousands or even millions of dollars, ask yourself if you would’ve found such exploit would you just waste it and get nothing for it?", "label": 0}
{"text": "Yes it is fixable. But did you read what i said? For me it usually costs 175CAD to replace it, so i recommend just selling for parts and getting a new phone.", "label": 0}
{"text": "Insta has no jailbreak detection 👍 Stop running 50 accounts with crane and you won't witness any issues", "label": 0}
{"text": "Did you delete it properly? In the dopamine app “remove jailbreak button”", "label": 0}
{"text": "What is with the mobile Nugget .ipa?\nIs it with the same functions?\n\nAnd one question, what does the AI enabler exactly means?\n\n(I am on 17.0.2 )", "label": 0}
{"text": "12.5.5", "label": 0}
{"text": "I don't think that's possible. The apps don't care if the bundle ID is changed if that's what your asking (correct me if I'm wrong), so I don't think what you're trying to achieve is how it works.", "label": 0}
{"text": "Its not jailbroken yet, the app is gray out not the screen", "label": 0}
{"text": "Since v3 you need to pay, if you can still get v2 that will do it without paying.", "label": 0}
{"text": "I’m probably making your yearly salary in a month hence why you’re so mad about. Thanks anyways.", "label": 0}
{"text": "womp womp, go back to scamming desperate men", "label": 0}
{"text": "Wait what?", "label": 0}
{"text": "This is exactly what an Apple employee would probably  say tbh, the iPod? Trade in for some headphones", "label": 0}
{"text": "impossible", "label": 0}
{"text": "some to me so I used Dopamine Roothide and its fixed now", "label": 0}
{"text": "Huh? Last time I heard the Apple Intelligence hack tut wasn’t for those who just want the UI in the github from cowabunga server.", "label": 0}
{"text": "Not sure what you're talking about, but Choicy was working fine for Supercell games on rootless until yesterday. After the latest updates, none of them are working now, even after rebooting your device. You have to reboot, open Dopamine, and press 'Hide Jailbreak' to get it working.", "label": 0}
{"text": "The only solution for this is to use Dopamine Roothide.", "label": 0}
{"text": "Yes please that’d be great. It should be compatible with both, especially since I run all 3 on my phone no problem. I wonder if it’s another conflict, or if it’s a speciifc setting you have that breaking it…", "label": 0}
{"text": "When you were still jailbroken, did you use iCleaner Pro by any chance? Reset capability is one of the things that can be disabled with iCleaner.", "label": 0}
{"text": "At that point just buying an iPhone 8 and jailbreaking it, then installing carbridge is better but thanks!", "label": 0}
{"text": "I think downgrading is possible on A10 devices", "label": 0}
{"text": "It does support iOS 16. Check https://github.com/roothide/Dopamine2-roothide", "label": 0}
{"text": "Found the fork for Dopamine 2 with RootHide:\n\nhttps://github.com/roothide/Dopamine2-roothide\n\nHad to jailbreak with that, add blacklist Brawl Stars in the RootHide app, and now it works. \n\nThis might push me to test if all my original dopamine rootless tweaks work in this roothide environment so I can make this my primary jailbreak method. But cool!", "label": 0}
{"text": "Roothide, its been like this for hours.", "label": 0}
{"text": "Dopamine Roothide", "label": 0}
{"text": "Its Not working", "label": 0}
{"text": "Its Not Working", "label": 0}
{"text": "Ah yep i was wrong, only removes the update option.", "label": 0}
{"text": "Its not that hard to remember to remove jb first. But tgat kind of tweak coukd be good. You", "label": 0}
{"text": "English work Not why ?", "label": 0}
{"text": "Okay lol I tested it on dopamine with ellekit works, but kind of my bad, the tweak needs YouGroupSettings to show the settings entry, otherwise you only get the block channel entry in the context menu, my bad that goes into the readme, I had assumed pretty much everyone who tries this already uses a tweak set that includes YGS like uyou+ or uyouenhanced, I forgot that jailbroken users probably just pick out their tweaks one by one", "label": 0}
{"text": "where to dowonload irecvery from", "label": 0}
{"text": "Not why english work ?", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Can you download sideload apps from other countries like India", "label": 0}
{"text": "It's ok, just funny. \nI think you can't downgrade, you can jailbreak only with cimera.\nCheck [here](https://ios.cfw.guide/get-started/iPhone-6.html).", "label": 0}
{"text": "So I bought it with that version, I guess they did the same thing as me to update it", "label": 0}
{"text": "Same for me I removed the jailbreak and deleted dopamine but brawl stars still won’t load", "label": 0}
{"text": "Chimera Its Not working fail …", "label": 0}
{"text": "What about fingerprint  ?", "label": 0}
{"text": "Another update. Version 307 will install with those folders. \n\nI kept trying to delete the folder without Facebook installed and nothing worked. But when I installed Facebook up to 307 anything higher would fail. Then removed the widget folders it all was able to install.", "label": 0}
{"text": "Ipsw.me", "label": 0}
{"text": "Does not respond to my usecase. For example [ipsw.me](http://ipsw.me) does not list latest Apple Watch versions and models (stops at Series 5 and WatchOS 6.3). But I know that Apple has them on their servers but I can download them from the Apple developer console", "label": 0}
{"text": "I will help you if I can but your first problem is english, sorry.\nChimera is only jailbreak you can use on iPhone 6 iOS 12.5.7 so you have to find tutorial for Chimera.", "label": 0}
{"text": "There is no jailbreak on 17.0.2, whoever sold it to you was lying. Also, you can't update and keep jailbreak at the same time.", "label": 0}
{"text": "If you bought it recently, they couldn't have updated to 17.0.2, only 17.7 or 18.0 because thats all thats signed atm.", "label": 0}
{"text": "r/jailbreak", "label": 0}
{"text": "That doesn’t even make sense.\n\nEven if you ISP was watching what apps you open, faking it wouldn’t do anything…. In your example, your network would still being using Gmail servers…whatever app you click on is just UI.", "label": 0}
{"text": "That’s the strange thing, I was on iOS 17 and I updated it to 18 and the jailbreak was preserved", "label": 0}
{"text": "What jailbreak was installed?", "label": 0}
{"text": "I don’t know, right now it has nothing and it’s useless.", "label": 0}
{"text": "for the love of god PLEASE DON'T LOOK AT OP'S PROFILE", "label": 0}
{"text": "There is no jailbreak on iOS 18? or any way to downgrade the ios version?", "label": 0}
{"text": "No jailbreaks on 17 or 18 atm, or any way to downgrade. Did the seller say there was a jailbreak on the device and what version did they sell it on?", "label": 0}
{"text": "Are they jailbreak tools?", "label": 0}
{"text": "Hey there, thanks for the submission! It looks like you are asking if you can jailbreak your device. This is a commonly  asked question and you can find the answer here [https://appledb.dev/device-selection.html](https://appledb.dev/device-selection). If you need help, join our [discord server](https://discord.gg/jb)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Yes I did. The dopamine app remained after, maybe I’ll try doing it multiple times (?)", "label": 0}
{"text": "I did not. I never install icleaner on this device at all", "label": 0}
{"text": "What’s the benefits of jailbreaking anyways when you can get an android and get all those free apps anyways?", "label": 0}
{"text": "Cause u put in the wrong password / Weil du für dein Apple Acc das falsche passwort eingegeben hast", "label": 0}
{"text": "How? With a compute! I am iOS 18.0 beta iPhone 13 pro", "label": 0}
{"text": "That's what the people at /r/jelbrek would say, except they'd misspell it on purpose", "label": 0}
{"text": "Chimera is known to have a very low rate of success. You will have to just retry.", "label": 0}
{"text": "No but Trollstore support ios 17.0 so maybe you could have mistaken that for a jailbreak.", "label": 0}
{"text": "What are you using to install trollstore?", "label": 0}
{"text": "There's only one answer that doesn't violate piracy rules.", "label": 0}
{"text": "It's true. I silently removed the post after answering it because the only other answer other than contacting the dev that anyone could give to this question would violate piracy rules of both subreddits.", "label": 0}
{"text": "You can try using [AltStore](http://altstore.io) to install trollinstallerx", "label": 0}
{"text": "sudo hack apple", "label": 0}
{"text": "falese, me turkis and I am having gud inglish", "label": 0}
{"text": "when did the official AND easiest method become the worst method?", "label": 0}
{"text": "Often, it winds up being both, such as this [74 step jailbreak guide from 2007](https://forums.macrumors.com/showthread.php?t=367115).", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "the cost of not reading the log lol", "label": 0}
{"text": "Que no pendejo", "label": 0}
{"text": "People are usually jailbroken though. I'm only talking about it being disabled in settings while jailbroken and giving you an error, so no one would even try.", "label": 0}
{"text": "You missed the point. Sure it’s incredibly hard, but the point is that even if something was found a public release is highly unlikely. Even that someone announced publicly that they’re working on something like this is unlikely.", "label": 0}
{"text": "I have only ever tried one replacement keyboard and I hated it. I don't even know what it was anymore. I would be willing to bet there is a replacement out there somewhere that fixes this. The fact that people keep finding this thread 12 years after I made it means this is a wide spread enough issue that you would have to think a developer out there somewhere was in the same boat. If I ever find a fix I will be sure to upload it to this thread.", "label": 0}
{"text": "Yep I was ignorant about that… but his comment got me searching for roothide with Dopamine 2! So glad it exists.", "label": 0}
{"text": "Can you share how to use Roothide? What Roothide mean? A bypass tweak like Choicy, A bypass etc...? Can I add repo and install via Sileo/Dopamine. I'm in ios 15 wtih Dopamine now. Tks.", "label": 0}
{"text": "So no point in saving them. unless another exploit is found which is unlikely?", "label": 0}
{"text": "It is software crippled only.", "label": 0}
{"text": "u there?", "label": 0}
{"text": "No I eventually restored rootfs and rejailbroke and minimized tweaks I was using and haven’t had problems, it was probably a mix of everything that I had installed at the time", "label": 0}
{"text": "nope", "label": 0}
{"text": "1. No\n2. Rule 5\n3. Find the owner and give it back.", "label": 0}
{"text": "*A stolen Apple Watch gets stolen*\n\nBefore you post get deleted, here’s some advice.\n\n1.Get rid of it before the police show up at your house. \n\n                                         Or\n\n 2. Give it back to the Apple Store. They may let you keep it. If it’s truly a Retail Store one, they can track it.", "label": 0}
{"text": "By clicking on that means you want to start afresh by erasing everything like using a new phone. \n\nMeanwhile there will be jailbreak traces even though there’s no jailbreak. Some apps may detect some apps may not.", "label": 0}
{"text": "get purplerestore with the right credentials/be tim cook and downgrade", "label": 0}
{"text": "Use Roothide", "label": 0}
{"text": "you could snap it in half", "label": 0}
{"text": "Some people save them “just in case.”", "label": 0}
{"text": "I’m on ios 14.8", "label": 0}
{"text": "In theory, yes. But when I erased and reset my own phone, modified by Cowabunga (not lite) and Misaka, some changes (disabled OTA and some fonts) survived the reset.", "label": 0}
{"text": "Have you always been this funny?", "label": 0}
{"text": "When you first created it did you flip the switch to run immediately ?", "label": 0}
{"text": "It can happen if you mess up with something you shouldn't", "label": 0}
{"text": "If you mess with files it will biotloop", "label": 0}
{"text": "Makes you wonder what they want a jailbreak for", "label": 0}
{"text": "I got 5 tweaks installed but I searched online and I think ima switch to palera1n and try it", "label": 0}
{"text": "Send your tweak list.", "label": 0}
{"text": "CLEO\nA-Font\nCylinder remade\nGravitation \nSnowboard theme icons\n\nThat’s all I have installed", "label": 0}
{"text": "Amazing tweak, thank you Dan!", "label": 0}
{"text": "Bro, please don’t waste your time", "label": 0}
{"text": "can yu help me too bro", "label": 0}
{"text": "Same happened here, with iPhone X - iOS 16.1.1 and palera1n 2.0\nI switched to dopamine 3 days ago and it hasn’t crashed at all yet, so maybe try this as it worked for me", "label": 0}
{"text": "You can jailbreak an iPhone 15? Btw, dont do it I really recommend to not do it, on older devices yes, but in the principal one, no don’t do it", "label": 0}
{"text": "ahh 😱", "label": 0}
{"text": "it probably won’t work since it might require libraries from iOS 17", "label": 0}
{"text": "very useful thanks for the hard work", "label": 0}
{"text": "Interesting find suprised it’s not integrated into nugget", "label": 0}
{"text": "❤️", "label": 0}
{"text": "No you can’t, OP said upgrade or **wait** for jailbreak.", "label": 0}
{"text": "No. Only troll store at 17.0, which is not jailbreak", "label": 0}
{"text": "hi, I guess for an iphone 12 running ios 14.2 jailbreak with unc0ver it's dead for me 😅", "label": 0}
{"text": "get a job at apple and get access to apple’s purplerestore tool to downgrade it to an unsigned version", "label": 0}
{"text": "I will wait! 🥹", "label": 0}
{"text": "Good boy!", "label": 0}
{"text": "I need to extract a tweak installed on my phone. so I can install it on another device. in .deb format", "label": 0}
{"text": "fuck “fuck Spez”", "label": 0}
{"text": "The Chinese community is really amazing sometimes ", "label": 0}
{"text": "Maybe he's going the rootful way out.", "label": 0}
{"text": "Make sure you block ota with a tvOS profile so u dont accidentally update your phone.", "label": 0}
{"text": "There are enough subreddits to do that.", "label": 0}
{"text": "👍👍👍", "label": 0}
{"text": "i suggest performing a DFU restore to clear everything. when your doing this i'd recommend you not restore from a icloud backup, or any backup because it seems like you just brought your glitch to this device somehow.\n\nwere you jailbroken in the past, ever?", "label": 0}
{"text": "Show me", "label": 0}
{"text": "I would really hope for no computer but if so I have a windows computer ", "label": 0}
{"text": "Seems like iOS 14 jailbreak is dead now. All apps are breaking and even some websites won’t load anymore. Risporce has also said he can’t deal with the new clash Royale jailbreak detection and has stopped supporting any supercell .IPA’s :(", "label": 0}
{"text": "iPhone SE, IOS 18.4 Beta", "label": 0}
{"text": "do you know what sub you’re on?", "label": 0}
{"text": "[SideStore](https://sidestore.io) or [AltStore](https://altstore.io)", "label": 0}
{"text": "Hi Jeremy", "label": 0}
{"text": "How to jailbreak ipad", "label": 0}
{"text": "I'm a YouTubePatcher developer, but I don't watch YouTube much these days. I would like to update this if it is reproducible and can be fixed.", "label": 0}
{"text": "[here](https://github.com/risporce/Supercell-jailbreak)", "label": 0}
{"text": "Ok, I’ll try it, thank you!", "label": 0}
{"text": "Any chance for trollstore", "label": 0}
{"text": "what effort, it is all very simple. People have interests and are curious, it overwhelms you but nothing special about that.", "label": 0}
{"text": "Yes, on the old device after DFU restore the phone restarted during the firmware restore and i wasnt able to get past activation and i dont wany ro do this to the new iphone reason why im asking for a solution for this issue", "label": 0}
{"text": "Oh yeah I forgot to mention Nugget 😅Anyways, no worries! \n\nThis is unfortunately the state of this community these days :/", "label": 0}
{"text": "cba", "label": 0}
{"text": "like what? need more info", "label": 0}
{"text": "Waste of time.", "label": 0}
{"text": "Hey love", "label": 0}
{"text": "The Dexcom g7 app and now (finally) the omnipod app were the reason I upgraded from iOS 14 and lost my jailbreak. I hope you figure it out, cause I miss my jailbreak everyday", "label": 0}
{"text": "Is this available on Sileo ? \n\nIf so, what is the repo name?", "label": 0}
{"text": "Ive had uyou since it came out and i have 0 problems. No ads whatsoever.", "label": 0}
{"text": "Actually i do get ads in shorts", "label": 0}
{"text": "Do you have the option to have the tweaks separately in .deb format?", "label": 0}
{"text": "Do you mean 18.1 beta 4? There's no 18.4 beta", "label": 0}
{"text": "Erase All Content And Settings erases /var so as long as you're iOS 15+ it will completely clear everything. Prior to iOS 15, jailbreaks could write outside of /var, and you would need to do a restore to 100% erase everything.", "label": 0}
{"text": "I think it doesn't ask you about this switch when it comes to Shortcuts Personal Automations. The switch is only available for regular Shortcuts.", "label": 0}
{"text": "how did you make to work?", "label": 0}
{"text": "And there would be app mods that offer paid numbers", "label": 0}
{"text": "what?", "label": 0}
{"text": "for iOS?", "label": 0}
{"text": "🤷‍♂️ It takes 5 minutes or less once a week to sync youtube reborn", "label": 0}
{"text": "https://imgur.com/a/SvjdGmT\n\nSo I wasn’t getting long video ads to populate, but I have screen recordings of shorts here.", "label": 0}
{"text": "iOS 17.0.\n\nRead this.\n\nhttps://support.apple.com/en-au/guide/shortcuts/apd602971e63/ios", "label": 0}
{"text": "According to Apple this was done by design for iOS 14:\n\n[https://imgur.com/a/xxIQ1wS](https://imgur.com/a/xxIQ1wS)\n\n[https://support.apple.com/en-au/guide/shortcuts/apd602971e63/4.0/ios/14.0](https://support.apple.com/en-au/guide/shortcuts/apd602971e63/4.0/ios/14.0)\n\n\"The following automations cannot be run automatically:\n\n* Email\"\n\nBut was added later in iOS 17:\n\n[https://imgur.com/a/MpuOpHB](https://imgur.com/a/MpuOpHB)\n\n[https://support.apple.com/en-au/guide/shortcuts/apd602971e63/7.0/ios/17.0](https://support.apple.com/en-au/guide/shortcuts/apd602971e63/7.0/ios/17.0)\n\n\"The following automations can be run automatically:\n\n* Email\"", "label": 0}
{"text": "did it work?", "label": 0}
{"text": "any other alternative for sideloading?", "label": 0}
{"text": "Looks good! Definitely will install if you can figure out a way to also get T9 dialing!", "label": 0}
{"text": "I have an Iphone XR. is there a bootrom exploit for my iphone?", "label": 0}
{"text": "Got my 64 gb for 100usd", "label": 0}
{"text": "Yeeea I don’t really wan’t to do shit. Only reason I have an Iphone is because it was the least iritating for me (can fit in 1 hand, has a few buttons, only 1 camera and is guaranteed to work fine for the next 5+ years and at that time that was SE 2022)\nLast night Duolingo crashed because there was apparently too much stuff going on in music course :D\n(M22:d)", "label": 0}
{"text": "You can't jailbreak on either iOS 17 or 18", "label": 0}
{"text": "Swipe gesture up not acting the same as home button is one of my biggest gripes with newer iPhones. I don’t know if people never knew or just forgot, but the home button's `escape`-like behavior in some situations was so great. I miss it\n\nNo version or jailbreak info, but from what I know, you might be able to emulate `volume down,home button` using Activator. You'll run into the issue of having it properly activate though. Not sure if you can check for the existence of a specific app's notification and choose a workflow based off that\n\nif I remember correctly, you might have a bigger issue with this method, which is that the home button (even emulated through Activator) doesn't function the way it does on home button phones. I think I tried to use it to dismiss banners before, but it acts like a swipe up rather than a home button. I could be wrong though.\n\nYou could also try PowerCuts combined with Activator. PowerCuts should be able to check if the notification exists and close it along with the volume down (whole shortcut activated through vol down in Activator) . Issue there would be the running of a shortcut every time, so there would probably be some noticeable lag on your vol down events. It would accomplish this though. There may also be a way to do this using Pushcuts, but I'm not sure and don't know how to work that app", "label": 0}
{"text": "Because it’s a spicy topic", "label": 0}
{"text": "You could maybe try CyberKit", "label": 0}
{"text": "Idk if the \"Shop\" app is available for ios 14, but you can use that... I track all my parcels through that app", "label": 0}
{"text": "i remember that during the process a message about \"failed replace bad block\". it was not a RED message, i just found it reading the log on terminal after i noticed it wasn't doing anything", "label": 0}
{"text": "This tool disables daemons using an exploit, but we can achieve the same result using just a backup, which works without any exploit.", "label": 0}
{"text": "# Changelog:\n- Now Supports iOS 16+ 🔥 (Thanks to u/gluebyte)\n- Now shows version build in delayed OTA menu.\n- Delayed OTA expire time now shows the time depending on your time zone instead of KST.\n- Directs user to GitHub if selected delayed OTA version has multiple profiles with different delay value.\n- ~~Hidden delayed OTA software versions that aren't compatible with device.~~\n- Removed unnecessary notifications.\n- Updated icon.\n- Fixed updater.\n\n# Download:\nhttps://github.com/Dr-Sauce/Trinity/releases", "label": 0}
{"text": "Unpack the file.", "label": 0}
{"text": "So sad, Unc0ver ios 14 dead already! Goodbye rootfull.", "label": 0}
{"text": "I'd save them, you never know and it's not hard for you to do it. But currently yeah, they're useless. And we havent saved the \"blobs\" for SEP which we dont know how to, so there's a lot of room for incompatibility. If someone discovers and exploit that could bypass all of it, they would probably sell it and forget about public domains whatsoever", "label": 0}
{"text": "Hi ipone 4 download punjab&i 2016", "label": 0}
{"text": "17track is what i use", "label": 0}
{"text": "You act like that's hard on Reddit 🐑\nReddit is an anti-free speech joke and violates our first amendment. X(Twitter) is where free discussion can be carried out\n\n\n\"Freedom is never more than one generation away from extinction. We didn't pass it to our children in the bloodstream. It must be fought for, protected, and handed on for them to do the same, or one day we will spend our sunset years telling our children and our children's children what it was once like in the United States where men were free.\"\nRonald Reagan", "label": 0}
{"text": "stay, there are many still not exploited vulnerabilities on versions 17.0-18.0:\n- CVE-2023-42974: race condition that could lead to arbitrary code exec at kernel level (don't know about the usefulness of this one since IOUSBDeviceFamily is technically kernel-level since it's a kernel extension) patched in 17.2\n- CVE-2024-23208: kernel level code exec, only has a PoC for now (https://github.com/fmyyss/XNU_KERNEL_RESEARCH/tree/main/CVE-2024-23208/iOSPOC) patched in 17.3\n- CVE-2024-23225: some kind of bypass, needs arbitrary kernel r/w perms tho, patched in 17.4\n- CVE-2024-23296: some kind of bypass (supposedly SPTM) listed under RTKit, patched in 17.4\n- CVE-2024-27840: PPL bypass, needs kernel code exec perms, patched in 17.5\n- CVE-2024-27815: buffer overflow leads to arbitrary code exec at kernel level (https://jprx.io/cve-2024-27815/) patched in 17.5\n- CVE-2024-40815: dyld PAC bypass, basically useless since dyld is userland, not kernel, patched in 17.6\nplus theres sparserestore and the shortcuts file manager bug, for me you should stay", "label": 0}
{"text": "Yeah of course. Option one, leave the field blank, find the tweak you want and enter the number in the next field. Then option two or option 1", "label": 0}
{"text": "well... enjoy what jailbreaking allows you...", "label": 0}
{"text": "thanks. iykyk😂", "label": 0}
{"text": "What is the repository for the tweak!??", "label": 0}
{"text": "Does it give a real number one can contact you with?", "label": 0}
{"text": "Jailbreak it and use a theme", "label": 0}
{"text": "You can check out [Orion](https://apps.apple.com/us/app/orion-browser-by-kagi/id1484498200)", "label": 0}
{"text": "It is jailbroken", "label": 0}
{"text": "Try [this method](https://sideloading.vercel.app)", "label": 0}
{"text": "Check out [this method](https://sideloading.vercel.app). Requires some setup but you don’t need a computer. For a smoother experience you can buy a service like [KravaSign](https://kravasign.com) or [AppTesters](https://apptesters.org).", "label": 0}
{"text": "[[Shy Page Dots XS]]", "label": 0}
{"text": "Thanks so much", "label": 0}
{"text": "iPhone 6s on iOS 15.8 rootless", "label": 0}
{"text": "iOS 18 on iPhone 13 not possible", "label": 0}
{"text": "Does it work on Dopamine2-Roothide? Preferences not being saved for me, resets after exiting its settings.", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Find a list of repos and just import them all in Sileo. Then scroll through all the tweaks and see what you find that you like. Thats what I did", "label": 0}
{"text": "You can jailbreak a tethered downgrade?", "label": 0}
{"text": "You can also “disappear” it completely with [lynx] and other similar system mod tweaks as well, but i like the animation of [shy page dots] more than the dots being completely gone", "label": 0}
{"text": "Yes, with Filza", "label": 0}
{"text": "Yeah, looks better. Looks more apple-y than them not being there", "label": 0}
{"text": "Just search it up on yt, there are a lot of videos about rooting", "label": 0}
{"text": "I use Uyouenchanced with no problems, theres a setting to turn off adblock so the app wont crash and then enable addblock workaround.", "label": 0}
{"text": "yea", "label": 0}
{"text": "Well when you call sombody, that a pop-up will ask before the call is made, if you want to call with or without number recognition !  There used to be a tweak like that verry verry useful", "label": 0}
{"text": "Please update me when someone gives an answer", "label": 0}
{"text": "But it still depends on the settings provided by your operator. You can’t enable it if it’s not included in your plan", "label": 0}
{"text": "Which one did you select so there is no big red bar instead of time and the Wi-Fi symbol?", "label": 0}
{"text": "Well I still have AskBeforeCalling Too 13 tweak on my 6s that has the option “Enable Block Caller ID Option” and it was always great ! So there it was possible ! Mabey things changed ! Thx", "label": 0}
{"text": "Thanks for the tweak really needed it.", "label": 0}
{"text": "No problem man ! Power to you ! And Thx for your work !", "label": 0}
{"text": "Anyone try this on iOS 18.1?", "label": 0}
{"text": "No, it isn't. Only 15.0 to 15.8.2. Dopamine supports up to 16.5 or 16.6.1 on older phones.", "label": 0}
{"text": "Do you know: Is this channel isolution ever trustworthy? Because it sounds very AI-generated to me.", "label": 0}
{"text": "Wassup jeremy how u doin", "label": 0}
{"text": "Blobs are useless and why do you want to update to iOS 18 now? If you are on 16.6.1, jailbreak. You can't downgrade back.", "label": 0}
{"text": "😂", "label": 0}
{"text": "Don't try to find stuff about jailbreaking on YouTube.", "label": 0}
{"text": "That makes no sense.", "label": 0}
{"text": "Please do not search for jailbreaks or sideloading on youtube. Most of the videos there are scams that make you download apps for \"human verification.\" If there really was a way to install nugget on 18.2, it would be shown here.", "label": 0}
{"text": "Most youtube jailbreaking/sideloading related channels are not very trustworthy from my experience.", "label": 0}
{"text": "i mean i guess Lynx would do this but im pretty sure its a paid tweak", "label": 0}
{"text": "Man this reminds me of the time i teied to make ios 10 look like ios 6 on an iphone 5c", "label": 0}
{"text": "souble-edged sword scenario in this case perhaps", "label": 0}
{"text": "source please", "label": 0}
{"text": "> Is this because it has become harder to find exploits\n\nYes, it's this — more people would do it if the latest iOS was jailbreakable. It's been harder to amass enough exploits to jailbreak, which is probably a good thing from a security perspective.", "label": 0}
{"text": "Try sileo.github.io/", "label": 0}
{"text": "If you’re on bootstrap install [TweakSettings], and then disable Settings in your bootstrap app list. For full jb not sure if you can use Choicy in Tweak Settings and disable everything for the Settings app there, I have no idea.", "label": 0}
{"text": "No sign that we ever see jailbreak even for iOS 17.", "label": 0}
{"text": "I've had issues with actually using add-ons on this version of Kodi- but to answer your question, I don't know of any. I'll probably look for some later but check [this](https://mirrors.kodi.tv/addons/helix/) which has a big list of Helix add-ons.", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "Hey mate can you please fixed to work on Dopamine (rootless) thx", "label": 0}
{"text": "Thank you. Do you think this will work with a breakout and not a golden eye cable? Then I would like to give it a try, but your shared links require permission.\n\nBut I'm afraid that for me the reason of getting stuck was that the breakout board can only establish the regular usb connection but not the additionally later required serial transmission. \n\nI am still searching for detailed information about the golden eye cable, by the way: [https://www.reddit.com/r/jailbreak/comments/1foecua/searching\\_for\\_goldeneye\\_cable\\_information/](https://www.reddit.com/r/jailbreak/comments/1foecua/searching_for_goldeneye_cable_information/)  \nI'd appreciate any help.\n\nThis was how far I've come:\n\n     Device found in DFU Mode.\n     Sending iBSS (618556 bytes)...\n     [==================================================] 100.0%\n     Booting iBSS, waiting for device to disconnect...\n     Booting iBSS, waiting for device to reconnect...\n     ApNonce pre-hax:\n     Getting ApNonce in recovery mode... f5 84 3b f0 3a 3a 76 0b 48 a4 69 bb 7b 55 42 e7 df 65 1a a9 9c 9c 27 25 68 54 55 d7 e4 ef 03 59\n     Writing generator=0x84940af0a24d0062 to nvram!\n     Sending iBEC (618556 bytes)...\n     [==================================================] 100.0%\n     Booting iBEC, waiting for device to disconnect...\n     Booting iBEC, waiting for device to reconnect...\n     APnonce post-hax:\n     Getting ApNonce in recovery mode... eb 0f 9f 63 43 3d f2 5b 1b 91 2c 49 1d cf 99 f9 23 74 55 e6 d4 99 a1 fe fb f6 ae e9 14 1c 69 9b\n     Cleaning up...\n     [exception]:\n     what=Failed to set nonce generator: 0x84940af0a24d0062! Device found in DFU Mode.\n     Sending iBSS (618556 bytes)...", "label": 0}
{"text": "Because OP wants attention to this post. That’s why.", "label": 0}
{"text": "maybe try putting a wallpaper with that small top bar in it and make it white to camouflage", "label": 0}
{"text": "This. You don't need fancy entitlements or anything to do that, so jailbreaking isn't actually needed/useful/etc. in that regard.", "label": 0}
{"text": "Unexpected reloading in CyberKit indicates a crash has just happened.", "label": 0}
{"text": "Sometimes Reddit will automatically mark posts NSFW for some reason. It's possibly a false positive from that versus an intentional action from OP", "label": 0}
{"text": "You should get AppSync from the links in https://www.reddit.com/r/LegacyJailbreak/comments/1dqpfal/is_appsync_repo_down/ rather than that piracy repo.\n\nAnyways, here's a few problems you might be facing:\n\n1. You should install the certificate from http://repo.invoxiplaygames.uk/certificates/ (note the HTTP). This is important because you won't be able to visit certain HTTPS websites without this.\n2. You need to reboot after installing AppSync.\n3. AppSync is not an app store — you won't see anything appear on the screen if you're successful. Get Filza or something so you can actually install IPAs.", "label": 0}
{"text": "Sorry for the late response, the tweak is still working on my device. Can you try running the automatic extraction again if you get the popup or reinstalling the app if not?", "label": 0}
{"text": "Forgot default permissions for Drive are restricted, should be fine now. Let me know if you get past set nonce.\nNot sure if the breakout board works for restoring phase, though it will still be through usb just using usbmuxd, but I don’t have one, i only used a manual method of injecting current to get it into dfu until it became frustrating to keep doing it so i bought a goldeneye cable.\nThe goldeneye cable is a sealed box and I don’t want to destroy it as I still need it, sorry.", "label": 0}
{"text": "Yeah same. Additionally, any good tweaks for YouTube ads for RootHide? …can’t seem to get anything to work.", "label": 0}
{"text": "I already did with dopamine", "label": 0}
{"text": "So what are you trying to jailbreak", "label": 0}
{"text": "There is purekfd not a jailbreak but has some neat tweaks works up to 18.1 beta 4", "label": 0}
{"text": "Does this tweak work with RootHide?", "label": 0}
{"text": "Unfortunately it won’t add the source to Sileo for me", "label": 0}
{"text": "Hello! Thank you for your participation in r/jailbreak,\nCheck the [jailbreak detection section and spreadsheet in the FAQ page](https://www.reddit.com/r/jailbreak/wiki/ios/appstore#wiki_bypassing_jailbreak_detection)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jailbreak) if you have any questions or concerns.*", "label": 0}
{"text": "There isn't much that can be done on such a recent firmware version unfortunately. Best you can do is wait without updating until a jailbreak is eventually released (that might take 1-2+ years...)", "label": 0}
{"text": "late, but misakaX works with that, gives you everything, and it does edit that", "label": 0}
{"text": "Im not sure if that's possible. A few years ago one of my backups was causing issues due to it containing jailbreak files. After long hours of suffering I ended up manually moving the Images and WhatsApp chats without using backups. That might be your best bet. Passwords can be synced via iCloud", "label": 0}
{"text": "Sadly i had to update when i got an apple watch, wasnt aware it required it until i had it in hand, so here i am on ios 18", "label": 0}
{"text": "how long does the restoring part take?", "label": 0}
{"text": "Upgrade it’ll be way too long before a jailbreak comes out for that device at this rate. Just enjoy your phone bro", "label": 0}
{"text": "Checkm8 devices only via a tool called blackbird.", "label": 0}
{"text": "Nah, I just removed the password and it removed it, thanks tho \n\n!solved", "label": 0}
{"text": "How does it work, pls explain", "label": 0}
{"text": "Checkra1n or palera1n , I don’t like this kinda things , so I wont help you much. Just search on YouTube , there’s plenty of tutorials.", "label": 0}
{"text": "thanks for reply 😊 I’m 100% it’s doable, I’m editing the backup right now and deleting some jailbreak preferences… Just want to be sure not to miss something, that’s why I asked for help", "label": 0}
{"text": "Ik nugget or whatever 😑 ", "label": 0}
{"text": "Mine won’t be. iPhone 14,5 edition iPhone 13 ", "label": 0}
{"text": "I have already seen a lot of things, but most of them or need paid or have another problems", "label": 0}
{"text": "Have you figured out bank apps my I jb my girls phone iphone 7 plus on 15.1.8 or some shit and I can't get her American express app to work I've tried choicy and all that shit and then I deleted the app and now I can't redownload bc the iOS is too old", "label": 0}
{"text": "Bruh , I’ve mean not “unlock password screen iPhone” , but a “palera1n , checkra1n IPhone unlock tutorial”. What your iOS is? And why are you downvoting me?", "label": 0}
{"text": "I have ios 14", "label": 0}
{"text": "they have just released the nugget v4 which now supports intel macs🥳🥳", "label": 0}
{"text": "Are your tweaks rootful? \n\nthanks in advance", "label": 0}
{"text": "thanks!", "label": 0}
{"text": "Please read the rules.", "label": 0}
{"text": "I don't have an shsh blob can I still do it?", "label": 0}
{"text": "Piracy.", "label": 0}
{"text": "Doesn’t work", "label": 0}
{"text": "uhh just waiting for an ios 18.0 jailbreak", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "No. Each blob is made for a specific device for a specific firmware with hash codes for baseband and other requirements met during restore. Using someone else's blobs will not work.", "label": 0}
{"text": "yes, I am really new into jailbreak\n\nthanks!", "label": 0}
{"text": "thanks! it is really laggy so doing it might be a good idea", "label": 0}
{"text": "there are many still not exploited vulnerabilities (except sparserestore) on versions 17.0+:\n\n• CVE-2023-42974: race condition that could lead to arbitrary code exec at kernel level (don't know about the usefulness of this one since IOUSBDeviceFamily is technically kernel-level since it's a kernel extension) patched in 17.2\n\n• CVE-2024-23208: kernel level code exec, only has a PoC for now (https://github.com/fmyyss/XNU_KERNEL_RESEARCH/tree/main/CVE-2024-23208/iOSPOC) patched in 17.3\n\n• CVE-2024-23225: some kind of bypass, needs arbitrary kernel r/w perms tho, patched in 17.4\n\n• CVE-2024-23296: some kind of bypass (supposedly SPTM) listed under RTKit, patched in 17.4\n\n• CVE-2024-27840: PPL bypass, needs kernel code exec perms, patched in 17.5\n\n• CVE-2024-27815: buffer overflow leads to arbitrary code exec at kernel level (https://jprx.io/cve-2024-27815/) patched in 17.5\n\n• CVE-2024-40815: dyld PAC bypass, basically useless since dyld is userland, not kernel, patched in 17.6\n\n• various CVE ids: sparserestore and the shortcuts file manager bug, patched in 18.1", "label": 0}
{"text": "I just bought it and It doesn't let me install, I click install and nothing happens, I hold install and it asks me which version to install, but menu is blank\n\nhow to fix.?", "label": 0}
{"text": "Are u using sileo? Also is this device 17.7? Are you sure you are actually jailbroken?", "label": 0}
{"text": "I'm sorry to burst your happiness bubble but there's more to a device than just the shape and color of it.. So, no. The blob records the devices unique identification among many other specific identifiers (and no, this cannot be changed) so in other words: enjoy what you have.", "label": 0}
{"text": "CarBridge", "label": 0}
{"text": "Prob because checkm8", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "It does this a a part of offline caching. This is to preserve data usage.", "label": 0}
{"text": "Ok makes sense, although I wonder why it never delete them. Some of those are very very old and it takes space", "label": 0}
{"text": "It does delete them if one were to reset all contents etc.. As far as taking up space, it's only about 4kbs of memory which is hardly anything compared to a device boot log.", "label": 0}
{"text": "Give it back", "label": 0}
{"text": "Works Fine for me. You need to add them to blacklist in Roothide App", "label": 0}
{"text": "Thanks a lot!", "label": 0}
{"text": "Why?", "label": 0}
{"text": "What filepath? ", "label": 0}
{"text": "I have no issues with apple pay and iOS 16.0 no idea sorry", "label": 0}
{"text": "yes, apple pay works, but i cant add cards to it, i can only use the ones that have been already setup", "label": 0}
{"text": "i’ve heard about some tweaks that makes device think that he’s using ios 18 instead of 16. btw can’t remember where i found that", "label": 0}
{"text": "i have Aemulo but it does not interfere with apple pay. I just paid with my credit card. I get this message only when i try to add a new card. I will try to unistall it but i doubt this is causing it.", "label": 0}
{"text": "I had the same experience with iOS 12.4 on my iPhone X. At that time I was able to use MGSpoof to spoof the version of the Settings app and add the card.\n\n[https://github.com/Tonyk7/MGSpoof](https://github.com/Tonyk7/MGSpoof)\n\nIf there is a tweak with similar features, it might be possible to do it.", "label": 0}
{"text": "Aww damn! Also thanks for the app recommendation there. I’ll take a look into that one. I suppose the last thing I could think of is seeing if anything changes after a restart of your device. Maybe try while you are in a unjailbroken state. Otherwise I dont have any other ideas. Hopefully someone else will be able to share some knowledge.", "label": 0}
{"text": "To save memory maybe ?", "label": 0}
{"text": "Everything", "label": 0}
{"text": "I had a similar problem on an iPhone 8 wIth unc0ver. No matter what I tried I could no longer add cards. I hate to be negative, but considering the behind-the-scenes checking for credit cards (whether by Apple or the companies), I think there may be no solution. In fact, other users may be in this same situation without knowing, it since cards are not added all that often.", "label": 0}
{"text": "What’s the point of this posz", "label": 0}
{"text": "My iPhone 11 is 5 yeas old and I’m far from poor. Sometimes people think I’m poor because my phone is “so old”, yet that’s one of the reasons why I have money. \n\nThat’s like saying everybody who has a 2010 car is poor, when realistically all the people with 2024 cars are up their ass with debt making horrible financial decisions taking in payments they can’t afford.", "label": 0}
{"text": "Not really, I don’t wanna buy another iPhone for a freaking $1k+ and even if I did I wouldn’t be able to jailbreak it, so when I buy a new phone it will be probably a flagship android.", "label": 0}
{"text": "iphone 7 ios 15 still going strong", "label": 0}
{"text": "Nope, the users are not poor. They use an older iPhone because they love jailbreaking and their phone.", "label": 0}
{"text": "Nah, don't get an Android. It's awful. Wait till HMOS NEXT launches globally and get a Huawei.", "label": 0}
{"text": "Yeah, it's a really good phone. I used it for 5 years, it was my aunt's for 3 years. It has 8 years of use and it's still going strong. I use it as a secondary, it has 46% battery health 💀", "label": 0}
