{"text": "Thats not true.  But also it is very hard.  But phishing emails are not the only way. I know ways but it would encourage theft so I cannot really say.   But its a workaround forcing Apple to do it or i should say misleading them to do it.", "label": 1}
{"text": "Again you dont break the encryption.  How would a normal person who owns the phone get past Apple id lock?  Now think there are other ways besides breaking encryption duhh.  Apple has the tools. Now you must think of the way to fool Apple it is well within possibility I have done it before.  Breaking their encryption is probably possible too but would be supremely hard.  But its called a workaround.  Just because you do not know doesn’t make it impossible.", "label": 1}
{"text": "You are on the right track but you still have to fool them.  Just cause you cannot do it doesn’t mean impossible.   Its like faking an ID a cop can see its fake.  Now how would u fake it so DMV makes you one.  Duhhhh now you get it,  not possible", "label": 1}
{"text": "Again you dont break the encryption.  How would a normal person who owns the phone get past Apple id lock?  Now think there are other ways besides breaking encryption duhh.  Apple has the tools. Now you must think of the way to fool Apple it is well within possibility I have done it before.  Breaking their encryption is probably possible too but would be supremely hard.  But its called a workaround.  Just because you do not know doesn’t make it impossible.", "label": 1}
{"text": "Duhh now u get it", "label": 1}
{"text": "Depends on the model, I know up to iPhone 13 it works. iOS 17 and earlier tho, so there are ways!", "label": 1}
{"text": "Never said wasnt sketchy.  U guys said impossible and its not. Forgery has existed since dawn of time. Identity theft is probably the top crime.  People cant use their heads.  Now bypassing encryption is near impossible but still possible but you look at different alternatives that are easier.  So to say its impossible you are a fool.", "label": 1}
{"text": "Why because I speak the truth?  I dont like lies spread because someone is not knowledgable on a subject.  That sounds so unbearable to me. Maybe don’t be an idiot and spread lies if you don’t know.", "label": 1}
{"text": "Let me guess your dad works for Apple lmaoo", "label": 1}
{"text": "With esign + revoke cert or buy a cert", "label": 1}
{"text": "It got removed but u said something to the extent like it cant be done.", "label": 1}
{"text": "I just gave u the way if u use your brain.  I said how would an original owner do it?  Now how can that be exploited.  Im being vague on purpose to prevent future theft.   But its not some zero day new attack out here.  Use your brain.  So again ask yourself what would you need to get into an original phone u purchased if you forgot info.  Now think how that can be used against them.  If u truly need to DM because maybe you can’t think", "label": 1}
{"text": "It’s always fun seeing people talk shit on crap they have no idea about. \n\nThere are legit million ways of by///passing those locks. I have two places near me within walking distance that does it. \n\nNobody’s fucking bribing anybody lol.", "label": 1}
{"text": "This true can bypass icloud for 100 ,for newer model 17+", "label": 1}
{"text": "You can but apparently you'd have to log in with an android device and get into the app's root system. Complex method but works. Happened to me and had to pay this dude some money to get it done. It's possible to still get in.", "label": 1}
{"text": "Might have searched this sub first, or better yet r/LegacyJailbreak.", "label": 1}
{"text": "Don't steal little guy. He owed rent. Then landed in the nut house. Trying to contact his brother to get to him for the info.", "label": 1}
{"text": "𝗣𝗹𝗲𝗮𝘀𝗲 add a flair to your profile so you don’t have to explain what device, iOS and jailbreak you’re on (assuming you’re already jailbroken), and so others won’t have to ask.\n\nHow to make a jailbreak flair: https://flair.rjailbreak.com/home\n\nAlso 𝗧𝗛𝗜𝗦: https://ios.cfw.guide/", "label": 1}
{"text": "why you need a jailbreak?", "label": 1}
{"text": "You could try `plutil -convert xml1` to change the plist format if it’s in binary. Sometimes it takes a couple of tries, and ensure you have permissions. Good luck with the open-source tool!", "label": 1}
{"text": "Finally, a way to take control of my device without all the annoying restrictions—let's go!", "label": 1}
{"text": "same issue I have I'm running ios 16..2 and palera1n jailbreak", "label": 1}
{"text": "No. No news. And there won’t be any news until there is, when it will surely be pinned on the sub for all to read.", "label": 1}
{"text": "yo mom knows better", "label": 1}
{"text": "Just curious, but did you consider first searching Google or this very sub for that question before making a post? I suspect you’ll get more and faster answers.", "label": 1}
{"text": "intereseted in buying is it stilll available?", "label": 1}
{"text": "would love to hear your feedback if you bought", "label": 1}
{"text": "Can anyone help me with the error?\n\nDevice found in DFU Mode.\n\nGetting firmware keys for: j105aap\n\nCleaning up...\n\n\\[exception\\]:\n\nwhat=getting keys failed with error: 30015503 (assure failed). Are keys publicly available?\n\ncode=44761156\n\nline=683\n\nfile=/Users/runner/work/futurerestore/futurerestore/src/futurerestore.cpp\n\ncommit count=340\n\ncommit sha  =3ffc41ff80dbb65f5587ea10dfbc711a9d37c496\n\nDone: restoring failed!", "label": 1}
{"text": "I tried to get  blob for  firmware 17.2 but I get an error. \n\nVersion: c0b554e83f54d39d90cac9791160bf2ccb062aed - 355\n\n\\[TSSC\\] manually specified ECID to use, parsed \"1970410468A83A\" to dec:7160298966919226 hex:1970410468a83a\n\n\\[TSSC\\] opening /Users/sergejdubina/Desktop/ATV 4K Blobs/BuildManifest.plist\n\n\\[WARNING\\] \\[TSSC\\] could not get id0 for installType=Erase. Using fallback installType=Update since user did not specify installType manually\n\n\\[TSSR\\] User specified not to request a baseband ticket.\n\n\\[TSSR\\] Request URL set to [https://gs.apple.com/TSS/controller?action=2](https://gs.apple.com/TSS/controller?action=2)\n\n\\[TSSR\\] Sending TSS request attempt 1... failure\n\n\\[Error\\] ERROR: TSS request failed (status=94, message=This device isn't eligible for the requested build.)\n\n  \n\n\niOS 17.2 for device Appletv6,2 IS NOT being signed!\n\nCan you get blob for my ECID 1970410468A83Ado  for 17.2 firmware?", "label": 1}
{"text": "Manually put it in recovery mode.", "label": 1}
{"text": "Try looking for it on repos like BigBoss or ModMyi; they might have what you need!", "label": 1}
{"text": "That’s what you get for trying to be a scumbag saving peoples pics noob", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "This is the jailbreak sub but you haven’t indicated whether or not you want to jailbreak them. In any case it would be helpful to know which iOS each phone is running. \n\nIf not jailbreaking, you can use them for anything you want that’s built-in, or that you can download compatible wIth the iOS: camera, voice recorder, sending texts, calling over FaceTime on WiFi, as an iPod, etc.. Basically anything that’s on the phone, except as a phone… unless to have an extra phone account and an activated sim.", "label": 1}
{"text": "https://ios.cfw.guide/installing-chimera/", "label": 1}
{"text": "Does it need a repo?", "label": 1}
{"text": "You keep saying these tweaks respect privacy but they literally exist for the opposite effect lmfao, you’re doing nothing to protect yourself from corporations whatsoever, zero, nothing, nil. You’re requesting data from their servers with your account on their servers that you can bet they’re harvesting information with, from location, to views, to usage habits. It’s not a “step in that direction” at all. That’s not a justification. \n\nThe ONLY thing Snapchat tweaks like shadow are good for is to let you sneak around on other people’s stories and save their shit behind their back, and that’s a VIOLATION OF PRIVACY FOR OTHER PEOPLE who rely on the features of Snapchat such as view notifications and screenshot notifications as a form of trust. Again you’re either blissfully ignorant of how things really work, or you’re truly and genuinely coping by putting up such a half wit facade of “muh privacy” and you’re a hypocrite who violates other people’s privacy.", "label": 1}
{"text": "This is more ironic than you can possible imagine. That’s all I can say", "label": 1}
{"text": "okay im new to this, but how did u use blacktop, did u run those commands on mac, linux, or windows? so im a newbie here", "label": 1}
{"text": "No, Taurine app responds, it didn’t appear for a while in home after installing it, but Taurine is fine, I will try rejailbreaking though I kept clicking jailbreak few time before it successfully jailbreaked, I will let you know!", "label": 1}
{"text": "Should I enable  Restore RootFS?", "label": 1}
{"text": "This happened to me when I had to use the Google sign-in patch to login. If you've already signed in, then turn it off and the icons will come back.\n\nhttps://i.imgur.com/ikybLmD.jpeg", "label": 1}
{"text": "!solved", "label": 1}
{"text": "I used to use it only, I am looking for a tweak I can’t find in sileo? Can I still have it? Or it’s not supported on Taurine?", "label": 1}
{"text": "I can’t have cydia if i am on Taurine?", "label": 1}
{"text": "Thank you, but when I found the tweak on sileo it is paid, but it was free on cydia? Any infos about difference between paid tweaks on sileo and cydia?", "label": 1}
{"text": "But it was working for me! That’s why I want cydia so I can install it without having to pay", "label": 1}
{"text": "Thank you 🙏", "label": 1}
{"text": "Oh maybe is was free then but changed recently, thank youu", "label": 1}
{"text": "Misaka nerds the MobileGestalt.plist. Do you get all the sruff after the big mountain when installing TrollStore? ? Don't be a smart mighty, but an escetic freak, if you can do. \n\nI was on 18.1 and reverted  to still signed 17.7. , broke up with UnCover Black Edition, have Cydia, (I know it’s dead, Saurik said a while ago), \n\nand broke again with an app cakled marooned or so. \n\nHardware is a iPhone 15 with arm64e. but Cydia doesn’t take any other repo, tweaks okay, should be an App that makes the Icon change directly to the basic symbols but with 4 icon themes and Win98, mac 10 and 16++ it's great fun. \n\nWith 17.7. thete is no MobileGestalt.plist file for Misaka, does it work as described? \n\nI'm trting to get filza, trollstore, terminal, etc running but it's a progress of tunneling Apple  and it has been like a liberatuon of a hostage. No violence  has been done to the device and UnCOber black comes through  the Tips App, like Misaka, too. It's tethered variant and maybe I get Zebra or Sileo running. \n\nA good link to jailbreak it conpletely?  \n\nI feel there\"s something more the depth of the Debian system,  you get to know your device.\n\nNot a fake site and never give money  for jb or upcoming, jb things are for the goods not for salary. Don't let yourself surround you with things belonging to capitalism .\n\nCorrect me technically  or moralistic or both but this isv what if learned so far.\n\nSo, and now I'm killing an Android  tablet  for custom rom, but this will be a main trigger for me. \n\nI once had a iPhone 4s, with Arduino and Hotspot Shield , flashed, diode blinks thtee times, but nothing happened. It was an alpine model and finally the accu died, pitty, pitty. \n\nAn import/expoet app would be good, trying sifeloadly ro eat a .deb but ni way, but only 7 slots. will wait 5 days than I give the ipa of troll store its way, I bet it cant be signed!", "label": 1}
{"text": "It’s not that I’m lazy mf , everything you type in jailbreak wise on Google or YouTube leads you to a bullshit scam or just bullshit period. Thanks for your smart ass comment though bb", "label": 1}
{"text": "Can this be useful in semi untedherd jailbreak for ios 16.7.10", "label": 1}
{"text": "Bro fd up big time", "label": 1}
{"text": "Doesn’t work", "label": 1}
{"text": "Worked for me some time back, I was able to pull up a YT https://youtu.be/u7j6jpiCkwY?si=zglgycKNAXD5RfAz", "label": 1}
{"text": "Did you fr fr post this on two subs, it showed both back to back", "label": 1}
{"text": "[https://github.com/iOSGuides/installing-trollstore](https://github.com/iOSGuides/installing-trollstore)", "label": 1}
{"text": "dont watch this video winrain is closed source and unofficial \nheres the right for windows: https://youtube.com/watch?v=4LRn2zKKqoA\nand for mac: https://youtube.com/watch?v=FvYbSWspP2E", "label": 1}
{"text": "Yes but wine is available on macOS which has the same kernel as iOS and that is literally the only thing wine needs to change", "label": 1}
