{"text": "And don’t rewrite history here Obama and Biden only support gay marriage because they desperately needed more votes, they did not initially support it. Not to mention Biden was one of the biggest opponents of gay marriage throughout his entire senate career and is now acting like he’s some kind of gay icon.", "label": 0}
{"text": "She has the concept of a minimum wage increase.", "label": 0}
{"text": "Is there a link to the UN report?", "label": 0}
{"text": "Destiny never shuts the fuck up", "label": 0}
{"text": "To be clear. \n\nWhat she is saying is that if it was to be made illegal to be trans she would 100% enforce a genocide of trans people.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "congrats. i am trans, and actual data shows that while anti-queer bigots make up perhaps as much as 1/5 of the adult population in USA, queer people themselves make up about 1/3 of the total population, worldwide.\n\nhowever, being queer does not prevent one from being anti-trans. this anti-trans thing is a very specific cultural phenomenon amongst a small minority in one country. it is not universal. a safe assumption is that everybody who wants anti-trans legislation votes for it. so, about 70 million in the US or one quarter of eligible voters. so, with all those bigots voting together, combined with sub-50% voter turnout in any given election, they have power. but that doesn't mean anybody agrees with them who isn't them.\n\nin fact, nobody even likes those bigoted assholes.\n\nconservative voters make up about 1/4 of the electorate. kamala is only going after them because she agrees with them. she is a conservative.\n\nthe vast majority of people are not. hell, half of eligible voters are so Left they refuse to vote at all, because both candidates are always so fucking right-wing.", "label": 0}
{"text": "yes, good thing we are the chosen ones who understand her ***true*** political platform", "label": 0}
{"text": "I dont hate liberal transgenders who support Harris but god they are so good at imagining a better life under her presidency when she literally do nothing for them, not even promise to improve their life. I dont know if they can name a single thing that Harris would do to improve their life other than, you know, not being Trump. And this is the same party that didn’t care for immigrants and basically wanted to run on Trump’s 2016 position on immigrants too. They didn’t care about millions of immigrants, why do transgender people think they would care for them?", "label": 0}
{"text": "Download Video: https://rapidsave.com/info?url=https%3A%2F%2Fwww.reddit.com%2Fr%2FLateStageCapitalism%2Fs%2FmdzMzxDPl2", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "\"Soup or salad?\"\n\n\"How about some word salad?\"", "label": 0}
{"text": "The law said you were a slave not too long ago", "label": 0}
{"text": "Nah. At the end he makes a shitty both sides argument and Levy is like why are you acting like this is symmetric?", "label": 0}
{"text": "*Person asking Kamala Harris to provide her definitive opinion on something*\n\nKamala: 🏃🏽‍♀️💨", "label": 0}
{"text": "You're right, there aren't many rights per se, and the rights we have are usually not enforced or put tremendous burden on the employee to prove they've been wronged. Many employers see worker's \"rights\" and safety measures as burdensome regulation that aren't necessary (of course they are). \n\nFortunately, there are companies that honor diversity, respect their employees opinions, and generally try to foster positive work environments. Of course this varies even among employees in the same company, and of course, employer attitudes will shift quickly when an employee has crossed some unforgivable company line. This is NOT meant as an apology at all, just recognition that luckily not all workplaces are absolutely degrading and/or unsafe. Of course, many workplaces simply just suck, period.", "label": 0}
{"text": "On an intrapersonal level", "label": 0}
{"text": "the real enemy is you, and always will be.", "label": 0}
{"text": "Yep, that's always the game plan with capitalism.", "label": 0}
{"text": "Posted this as it's a project aiming to document (with lots of data)...well, \"systemic trends\" (economic, climate, etc.), and whilst unsurprising perhaps that it might come to the conclusion that what we're currently doing, and is currently prorposed, is insufficient for various challenges, it aims to do so with a lot of depth.\n\nfrom the intro:\n\n>This second edition of the Index of Systemic Trends is an effort to quantify, track, and visualize this multifaceted political, economic, social, and ecological crisis afflicting the United States. But it is also a warning. A daunting gulf still remains between the magnitude of the systemic challenge and the scope and scale of the responses that are being conceived and proposed, and (partially) enacted – a gulf from which new monsters will continue to emerge.\n\n>Over the last few years we have seen the beginnings of welcome action in the face of the crisis. Some good things are being done, and action is being taken — by the standards of recent decades, fairly significant action. New directions on trade policy, industrial strategy, manufacturing capacity, labor force unionization rates, and climate change all mark a significant departure from the past forty years of U.S. government policy and practice. Yet this is where the danger lies: in the comforting illusion that we are finally making progress, that — after decades of misdirection, obfuscation, and inaction — we are at last awakening to the magnitude of the crisis. The bigger picture, unfortunately, is that we are still losing — and losing badly — in our struggle to tackle long-run negative political-economic trends. We have only just begun walking tentatively up a fast-moving downward escalator, suggesting that further systemic shocks are in store.\n\nDirect link to PDF:\n\n[https://static1.squarespace.com/static/6644f8546111dd1995df44eb/t/67056e835532bd7f8a548185/1728409220752/Index-of-Systemic-Trends-rd1-7.pdf](https://static1.squarespace.com/static/6644f8546111dd1995df44eb/t/67056e835532bd7f8a548185/1728409220752/Index-of-Systemic-Trends-rd1-7.pdf)", "label": 0}
{"text": "Good points. Btw, you're insulting Elmo by referring to Musk with that name.", "label": 0}
{"text": "The talk didn’t put any sense into Destiny. He just cycles brainlessly through his talking points again, all pinning blame on various Palestinian leaders and figureheads. He’s not even thinking, just reciting what he can remember from his Wikipedia notes. \n\nWe can tell from how Levy begins his remarks that he has already heard and is responding to these exact same points. So long as Destiny has an audience for his pseudo intelligent ramblings, he’ll keep saying this stuff, whether he believes it or not.  It makes him lots of money. \n\nI would think that the clarity, intelligence, and hard-earned wisdom of someone like Gideon Levy taking the time to talk to this sophist might change some minds. Some - even in this discussion thread - are too far into debate mode, but some will grow out of it and actually think about what Levy means.", "label": 0}
{"text": "It will probably resemble something like what happened to Twitter. But much much worse.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "It was befuddling to me when several years ago the media tried to rehabilitate and clean up George W. Bush’s image, despite him being war criminal. Now, it’s the same with Dick Cheney, and I think it is more clearer now than ever, that the media or the American establishment doesn’t represent anything, except the sociopathic drive to furthering it’s own interests aboard and domestically. This is coupled with the genocide in Gaza, which really conveys that America is at a existential breaking point, like do we really believe in human rights or will we continue to be a scourge on the world? \n\n500,000 dead civilians. Dick Cheney should be in prison, but will probably go out like Henry Kissinger.", "label": 0}
{"text": "Exactly. What a dumb post.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "I've never seen so many Rule 6 replies before!", "label": 0}
{"text": "I don’t think she is going to win. For one, how in the hell do they expect to get swing-state Michigan after giving the middle finger to them for the past year??", "label": 0}
{"text": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.", "label": 0}
{"text": "Why should taxes fund foreign wars? Israel should defend itself, doesn't represent the Jewish people anymore.", "label": 0}
{"text": "This is a leftist subreddit, right wing comments will be removed and the user banned.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Israel is completely dependent on US support", "label": 0}
{"text": "Is there any way we can get a list going of various left causes or issues and the organizations that work towards solving and educating on those issues? This is a pretty good post, but there is still significant comments about \"what to do?\". There's a lot of traffic here, and lessening the research and time involvement may be even more helpful.", "label": 0}
{"text": "Death Race 2024: America or Amerika", "label": 0}
{"text": "Hillary lost because she was an unsupportable liberal interventionist ghoul not because she didn't campaign hard enough. Harris' commitment to genocide when 62% of independents oppose sending arms to Israel is very Clintonesque and she's polling way worse than Clinton.", "label": 0}
{"text": "You should at least put both candidates in this, since that's the point of this sub, the complicity of the entire US gov including both corrupt parties. \n\nThis is just a post some random stray Maga idiot is gonna download and share thinking it makes their candidate the good guy in this horrible US backed genocide", "label": 0}
{"text": "but why?", "label": 0}
{"text": "Didn't realize they had such a large investment portfolio.\n\n Guess they  don't need my annual contribution anymore.", "label": 0}
{"text": "There is no saving this planet with capitalism\n\nThey will only care about short-term profits.", "label": 0}
{"text": "Your response is a great way to illustrate why our priorities are not the same.\n\nYou argue that there is a \"objectively better\" set of policies in this kayfabe show of politics. In the exact same thread as which the \"objectively better\" candidate refuses to endorse anything objectively better, in a vain attempt to attract Trump supporters.\n\nThere are a thousand and one ways for Harris to not make this a coinflip election. It doesn't have to be anything like increasing the minimum wage to 26$, or invading Israel, or universal health care. It could as performative and simple as bringing a few more Palestinian and Lebanese refugees into the country and helping them in a great show of care, displaying the proposed legislative bill to increase wages to 15$, actually talking about health care for the most needy. She has not, and will not even go that little quarter inch.\n\nShe will sooner lose and throw every last American under the Trump bus before changing her right wing goals of more fracking! More border walls and human rights abuses! More conflict! More chasing after the affection of the Dick Cheneys and Melonis of the world! More trade wars! More climate destruction! More great power buildup for the showdown to World War 3!\n\nAll of these things are guaranteed to accelerate the worsening of life in America. Much much much worse. Here's an exercise, try looking up all the War on Terror veterans who have entered politics and how they have fucked us all!\n\nAll of this leaves more desperate people willing to listen to the revolutionary rhetoric (and lies) of fascists over time. Leading to the exact same place that Trump would. \n\nAnd your only response will be \"but third party voters! They're responsible for this!!! you're an accelerationist!\" because you refuse to understand the domestic consequences of America's foreign and global policies under the duopoly. You refuse to even entertain the thought about how your \"objectively better\" candidate will give the election to Trump before changing her course.\n\nDespite all you have seen and heard, you still obey your ingrained American propaganda and blame and despise the few people with consciences more than the holy and powerful capitalist politicians above us all. You still think that the DNC would ever allow even the slightest bit of socialism despite the court cases of 2016, you still think that they will listen to the people when they are on track to lose to Trump before changing their policies, you still think that their (bipartisan) support of gross inhumanity in Asia and the Middle East and South America will one day translate into benevolence at home despite how that has never worked out. \n\nWe know what has to be done to change this and how it will have to be fought. You only believe that reform can save America and that everyone else except politicians are at fault for the accelerationism. \n\nNo, our priorities are definitely not the same.", "label": 0}
{"text": "Thank you kindly for your thoughtful response, but I must admit, I was not expecting the sufficiency of this mental image as I sat on the toilet, reading your reply this morning, pensively wiping…", "label": 0}
{"text": "IDK where I'd be without mine. haha Ugh.", "label": 0}
{"text": "If Trump lives long enough they'll do the exact same shit with him.", "label": 0}
{"text": "My guy if you’re going to say that voting for her is the same as voting for genocide then voting for anyone else, knowing they have -1000% chance of winning, then you’re doing the exact same thing….", "label": 0}
{"text": "Vote Democrats to save our country from the Republicans! Who I'm putting in my cabinet", "label": 0}
{"text": "If the US stopped all funding to Israel today the bombings would stop within a week, Israel is 100% economically being propped up by our money at this point, their economy is in shambles right now, it's just not really reported on by western media.", "label": 0}
{"text": "Democrats love to hurt people. The cruelty is the point.", "label": 0}
{"text": "From a Jewish POV\n\nhttps://www.jewishvoiceforpeace.org/\n\nhttps://www.btselem.org/\n\n\nFrom a Muslim and/or Palestinian POV\n\nhttps://decolonizepalestine.com/\n\nhttps://palestinianyouthmovement.com/\n\nhttps://www.ampalestine.org/\n\nMost of those have book recommendations and other information on their views. \n\nFor ongoing coverage, there's a lot, but some are:\nhttps://electronicintifada.net/\nhttps://mondoweiss.net/\n\nOn YouTube you can find many channels that are anti-zionist and enlightening. A personal favorite is The Bad Faith podcast by Brianna Joy Gray, who regularly has academics and organizers on to discuss left issues, but especially Palestine. Breakthrough News is another good one on YouTube covering current events and particularly Palestine.", "label": 0}
{"text": "The constant preaching down to people who aren't comfortable with financing a genocide.\n\nIt's become loathsome.", "label": 0}
{"text": "A great day for Canada and therefore, the world.", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "When you lose, you can't be blamed for doing nothing. When you accidentally win, just say that it was very narrow, and it shifted back afterwards.", "label": 0}
{"text": "Well, she’s going to fight for our groceries. And..Trump bad. Thats all liberals will say.", "label": 0}
{"text": "There are Palestinian-Americans.", "label": 0}
{"text": "\"Racism isn't a deal breaker for Trump supporters\"", "label": 0}
{"text": "Nope. One phone call from the US and it stops. It has always been like this.", "label": 0}
{"text": "That’s fine, but you will be getting one of them regardless. I have never understood the opting out unless you think both will be equally bad, which I think is unlikely in any election let alone this one.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": ">good, concise and digestible intro for brainwashed liberals as to why the US is not actually a democracy\n\n  \nOne of the easiest ways is to bring up 2016.\n\nHillary Clinton won the popular vote and lost the election. The electoral college is why, and that is the start of why America is not a democracy. That is where you must begin, step by step of the history of the bourgeois dictatorship. Especially bring up how individual votes are worth much less unless they are in the swing states (talking about how certain people's votes were legally only worth 3/5 during this country's history as a comparison is probably too spicy at this point)\n\nOf course, \"easiest\" is relative. A lot of people identify with the American system of governance and will protect it at all costs, especially if they think it's being insulted.", "label": 0}
{"text": "That's why I said \"and apparently not even all Americans.\"", "label": 0}
{"text": "Oh what advice did she offer, \"ignore the entire Rust Belt, you can safely assume it just belongs to you\"???", "label": 0}
{"text": "Yeah, it’s really disgusting how morally bankrupt our cultural institutions are at the end of the day. Ultimately, it feels like the Democrats really have no qualms with Trump at all anymore; except in the public eye, even to the point of out right supporting his white supremacist immigration policy, so yeah, it seems like Trump might be remembered that way.", "label": 0}
{"text": "Vile.", "label": 0}
{"text": "Harm reduction has been proven wrong again \n\nThe only way out is through [REDACTED]", "label": 0}
{"text": "I'm sorry...I think we need to clarify something first. If not reform, what is your solution? Okay, I'm brainwashed and think reform is the answer. What is your solution?", "label": 0}
{"text": ">They don't have a choice in whether or not they join.\n\n>\n\nThis is bullshit and remains bullshit and has been bullshit forever.\n\n>“I met two black soldiers a while back in an airport. \n\n>They said: ‘Champ, it takes a lot of guts to do what you’re doing.’ I told them: ‘Brothers, you just don’t know. If you knew where you were going now, if you knew your chances of coming out with no arm or no eye, fighting those people in their own land, fighting Asian brothers, you got to shoot them, they never lynched you, never called you \\[disgusting racist insult\\], never put dogs on you, never shot your leaders. You’ve got to shoot your ‘enemies’ (they call them) and as soon as you get home you won’t be able to find a job. **Going to jail for a few years is nothing compared to that.’”**\n\nMuhammed Ali, Black Scholar, 1970\n\nPropaganda will only go so far. Israelis decided to believe and protect their propaganda to the very end, even to the point of suicide. Yes, we understand why they did it, and no they get no mercy from us for it.", "label": 0}
{"text": "The US government could end it any time they want. This only happens until the Us government wants it to stop.", "label": 0}
{"text": "Because it’s Israel, who get a free pass from the west to do whatever the hell they want.", "label": 0}
{"text": "Eh? You're literally voting to choose her or Trump.", "label": 0}
{"text": "I think some people just want to feel morally superior while doing nothing. That’s the way I see this argument.", "label": 0}
{"text": "By all means, definitely make posts about Trump's genocidal and war criminal acts in Yemen and Syria and Palestine and everywhere else! Be the change you want to be, but bring out the big guns.", "label": 0}
{"text": "The second Harris took over their entire campaign should be policy driven and explaining her policies and how they help.\n\nInstead they somehow thought going on talk shows bragging about how right wing Harris is would somehow keep in their base .\n\nBiden literally won by being as far left as he could without being bernie. His entire campaign that squeezed out a win was slouch and promises \n\nHarris is on a talk show saying things like “I locked ALOT of people up”.\n\nLike this is insane.\n\nShe could be running on at least abortion and the messaging is non existent.\n\nIt’s like they thought they would breeze to a win because the polling slightly went up, thinking “our job is to not blow this massive lead” when they were nearly tied z\n\nSo doing nothing obviously decreases her support", "label": 0}
{"text": "No, the blade would bounce against his femur, and it would take quite a few attempts to cut through.\n\nOn second thought, maybe that wouldn't be so bad.", "label": 0}
{"text": "The ACLU went against labor, trying to undo protections under the NLRB [https://jacobin.com/2024/03/aclu-nlrb-labor-rights](https://jacobin.com/2024/03/aclu-nlrb-labor-rights)", "label": 0}
{"text": "Democracy died a long time ago in America", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Elon musk is a white supremacist and believes in the great replacement.", "label": 0}
{"text": "There were no Democratic primaries this year. Biden was *the* candidate - until he wasn't. He dropped out and the party decided she was their best shot at winning so they did all the paperwork to make her the nominee.", "label": 0}
{"text": "I feel like there should be a flair for disclosing whether or not you're in a swing state lmao. I'm also in a solidly red state. It changes the conversation entirely. My vote will be wasted no matter what so this discussion doesn't even apply to us", "label": 0}
{"text": "What does another country’s warmongering have to do with how shitty capitalism is turning out to be (in the US)?", "label": 0}
{"text": "Exactly, it's not such a deal breaker! right?", "label": 0}
{"text": "https://hartmannreport.com/p/property-pirates-how-billionaires-6bf", "label": 0}
{"text": "Nancy Pelosi is a very long-term player in DC, with a unique shewdness to her. She understands the power of players like aipac & others who weird outsized power. She's doing a familiar hustle if you've watched her long enough.  Right now, she's talking out both sides of her mouth. Notably, with rhetoric unimaginable to hear from her just 3 or 4 years ago. She's not going to become some raging Palestinian advocate overnight, but she's shifting as she feels the winds of change. I'm not pretending she's become an ally, I'm saying I'm watching her play politics.", "label": 0}
{"text": "They call these \"Apartheid roads\"", "label": 0}
{"text": "Sorry, I'm not an American, so I'm unfamiliar with pacs and general history of elections in the US: \nWhat has AIPAC done over decades that is on the same level or worse as what the muskrat is doing now?", "label": 0}
{"text": "Yup, there’s no difference between the two parties on this issue, but Dems get beat up because people expect better of them.", "label": 0}
{"text": "As an Arab American, our community was already super alienated by this campaign for their support for genocide and denial that it’s even happening, but touting a Dick Cheney endorsement when that man left 1 million dead Iraqis in his wake was a real insult.", "label": 0}
{"text": "Please wait until your account has at least 500 comment karma before posting on /r/LateStageCapitalism.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Not a lie. You believe what you want, but I suggest you research the 4 quarters of Jerusalem before spouting off like a child.", "label": 0}
{"text": "Wow, using Wikipedia vs. somebody that was actually there. Do some more research on the four quarters of Jerusalem.", "label": 0}
{"text": "If you think he's going to stop the industrial war machine making billions from both wars, you've got some hard reality coming towards you.", "label": 0}
{"text": "I can't even begin to imagine how frustrating it must be for you to be used as a token by these absolute ghouls.", "label": 0}
{"text": "Forgive my ignorance here. But isn't Trump pro-Israel too? So how is the Israel Palestine conflict losing Harris votes? They just voting 3rd party or abstaining? I guess we'll find out when we see the vote turnout.", "label": 0}
{"text": "Already did. If I was allowed to write her name with glitter, sparkles, and fireworks I absolutely would.\n\nThe sad fact is that our political spectrum has been steadily shifting towards the right by both parties. Unfortunately, the Liberals tend to follow the whims of the Democratic party and are becoming more conservative.\n\nKamala Harris has already put trans and Arab people on the chopping block. One group is because she's a fascist and evil and the other one to appease her new Republican allies.\n\nThe sad fact of the matter is that even if Trump loses this election, we're still fucked because Democrats are planting the seeds for a more intelligent and formidable Republican adversary. \n\nTrump is a moron and an imbecile. He's easy to predict, detect, and thus thwart. \n\nI'm not sure how old Dick Chaney is, but what if he runs next cycle? He'll might very likely win because the Democrats will try to use the same tired Pied Piper scheme and voter shaming while still producing 0 advantageous policies aside from crumbs and many people will choose to stay home.\n\nAgain for the liberals here, I'm not choosing their platform or tactics. I'm not making them support genocide. Genocide was wrong when Hitler, Christopher Columbus, and Andrew Jackson were doing it. It's still wrong when Biden and Kamala Harris is doing it.\n\nI'm not compromising my values as a human being just so I can just fall in line. I wouldn't be able to live with myself.\n\nTrump is a piece of shit no doubt, but the reason why we got him in the first place was because Hillary told the media to elevate him as a candidate.\n\nThe sad fact is that so many people only care about the suffering of marginalized people when the Republicans do it. The kids are still in cages. Have we heard anything about it since Biden has been in office? No one cares anymore. \n\nLiberals have compromised their morals so far to the point where overt genocide and criminalizing homeless people aren't even a deal breaker. These things aren't wrong unless Trump does it, but it's otherwise okay and acceptable.", "label": 0}
{"text": "I disagree that a vote is an endorsement. For starters it's completely anonymous and strategic voting is something as old as time. Imo you should vote what you feel gives the better outcome for your country /community.", "label": 0}
{"text": "You’re god damn right it is.", "label": 0}
{"text": "All options in America are pro-genocide. That’s what it was built on.", "label": 0}
{"text": "I live in an area that has some of the highest housing cost increases in the country. Homelessness was very minimal 10 years ago, now there are 2-5 thousand in my immediate area at any one time living on the street and in their cars. Local governments have an annual point in time count that sees this rise year after year. A few dozen people live within a couple blocks of me on the street and somewhat out of view, and I've gotten to slightly know a couple through donating a few bucks regularly and supplies to them occasionally. It's an extremely difficult cycle to get out of, and nowhere near enough help, or the right kind of help.\n\nIt's a solidly blue/democratic area, with close GOP rural support. Neither party has been able to do anything to stop the increase. Attempts so far made are regular encampment sweeps, throwing them in jail, and increasing housing supply that in one of the highest housing cost areas in the nation end up unaffordable for even employed poor people. A 200-300 person tiny home village has been attempted, but faced pushback from of course R politicians, but some D's as well, along with many local homeowners who use environmentalism as an excuse for nimbyism. Those groups are relatively well funded through local businesses and homeowners. Even if built, which luckily after 2 years looks like ground is being broke while other lawsuits await, will only serve a small fraction of those living on the street. It's another bandaid, albeit a better one.\n\nHomelessness IMO, is not a problem capitalism can solve. There are to many systemic issues involved with increasing homelessness, not the least of which is that it's impossible to profitize the homeless. So those who are also now economically hurting (employed, housed taxpayers) foot the bill because taxes are unable to be levied to a large degree on the rich and corporations. Keeping solutions localized will also forever render them unsolvable, as local governments strain to keep up with inflation and funding other big issues like education, roads, housing for even just the middle class, a century of built up environmental issues, commerce, etc.", "label": 0}
{"text": "Yeah, there's a reason why someone like Dick Cheney is on board with them now. It's not that he's had a change of heart or mellowed out with old age, it's that the democrats have enthusiastically adopted his worldview while the republicans are distracted with \"culture war\" nonsense.", "label": 0}
{"text": "Reminds me of this saying:\n\n\"A liberal is someone who opposes every war except the current war and supports all civil rights movements except the one that’s going on right now.\"", "label": 0}
{"text": "Why the everlong boner for Israel? You would think Israel helped us win the Revolutionary War or WW2 or something, or paid for our highway system, or funded social security, or gave us nuclear technology, or gifted us the Internet, or ***something***.", "label": 0}
{"text": "Every time I see a post like this (talking about the politics at all) I think \"Man, you Americans sure love your politics\"\n\nIt's on so many levels of complexity and so entrenched, it's really quite fascinating.", "label": 0}
{"text": "the US has bombed a lot of places but i think they managed to avoid Albania. Saying that a few NATO bombs did kill a bunch of ethnic Albanians fleeing the war around Gjokova which is in Kosovo", "label": 0}
{"text": "Then don’t use my damn taxes to do so. I’m tired of being complicit no matter what I do. And these morons get to walk around like they have a big dick all because they know that daddy USA is right behind them, lockstep. For once I want to see them act all tough without the might of the US military or taxpayer. Once they’re isolated they would learn that shouting antisemitism at every turn isn’t actually diplomacy, but having to concede to your neighbors for the sake of peace is.", "label": 0}
{"text": "I disagree. The genocide is only possible with US funding and political/diplomatic cover. If the US were to boycott, divest, and sanction; Israel would for the first time since Oct 7 engage in peace talks in good faith.", "label": 0}
{"text": "It’s not like Trump would stop the genocide. In fact, there’s an article out today about how Trump would help Bibi kill more Palestinians. So, why should I sacrifice my own freedom and democracy to vote for a guy who would help Israel be more genocidal?", "label": 0}
{"text": "I'm convinced she dropped out in 2020 bc she was a threat to Biden. She was really good at going viral during the democratic debates, resonating with the exact demographic that Obama tapped into, but they weren't sure Biden would. The DNC probably didn't think she could take on Trump yet, but they couldn't afford letting her potentially weaken Biden's chances.\n\nThey offered her VP on the ballot in return for dropping out. The DNC unifies behind Biden, their ballot resonates with a larger demographic and she gets \"safe\" national exposure and the inside lane as the party's future candidate when Biden is done.", "label": 0}
{"text": "Fuck me that's a dumb take, my dude", "label": 0}
{"text": "Thank you, I appreciate your comment. \n\nMy comment is probably a lot longer than most people have time to read.", "label": 0}
{"text": "thats moses bhadwa for you", "label": 0}
{"text": "I'm writing in a candidate, but one of them will be. Im not in the game of convincing anyone to vote for either, but its only beneficial to trump to leave out how bad he will be on the genocide in gaza as well.", "label": 0}
{"text": "I will repeat myself.\n\nBack in 2020, Biden's campaign had this to say about Richard Spencer's support for him:\n\n>\n\nRichard Spencer is a bastard neonazi, to hell with him, may he join his idol ASAP.\n\nAnd now in 2024, Darth Cheney, a genocidal war criminal who has done ten million times worse damage than a army of Spencers ever could, is applauded and received with great joy by the Democratic Party for his support to Harris.\n\nAnd all the uninvited guests to this sub somehow just can't explain as to why he shouldn't have received the same kind of response as Spencer rightfully got. It's always excuse after excuse after excuse for Darth Cheney and never a single answer as to why they believe his support is necessary for Democrats. \n\nAnd thus, fascism wins either way with the open support of neoliberalism. Again.", "label": 0}
{"text": "can you post this video on the politics subreddit where they’re making fun of people not voting for Kamala??", "label": 0}
{"text": "You can try to twist this any way you like, but Cohen is undeniably a zionist piece of shit.", "label": 0}
{"text": ">concern that little she does, says — or tries — seems to move the needle. \n\n\nHave you tried not pandering to your opponents' voting base and instead giving your already existing base a solid reason to show up and vote? I feel like that hasn't been done yet!", "label": 0}
{"text": "> Hebron\n\nso its a road to a jewish settlement?", "label": 0}
{"text": "Republicans don’t compromise, so when Democrats compromise it forces us further to the right. The options have been compromise or stalemate, because Republicans will shut down the whole government rather than see the other party have a win. I’m super left politically, and I’m voting for Kamala, because Trump is a terrible human being, terrible leader, and a wanna be dictator. The difference is so clear. Trump is a far right fascist, Kamala is a rational democratic leader who is trying to bring this country together. Both support Israel and I believe Trump would be far worse for Palestinians. He has complete disdain for brown people of all kinds and loves authoritarianism and brutal power grabs.", "label": 0}
{"text": "Sorry to hear that. I posted this same information to the Santa Cruz reddit and got a lot of responses. Lots of food banks don't check your income so you might want to visit one of those.", "label": 0}
{"text": "This is the most braindead take I have ever seen.  This woman has the same understanding of business as a third grader.", "label": 0}
{"text": "They're already giving their full throated support to genocide.", "label": 0}
{"text": "And worse things are happening as of now", "label": 0}
{"text": "I wish I found their haplessness entertaining.", "label": 0}
{"text": "Republicans get legislation passed without compromise. The options are liberals start picking better candidates in primaries or we keep moving to the right.", "label": 0}
{"text": "context on dubai?", "label": 0}
{"text": "I think that's the crux on the problem. Biden has terrible dogshit opinions and is senile, but he's old and won't last long. Harris is much younger and believes all the same shit, people see her getting in as a lock for eight years of more Bidenism", "label": 0}
{"text": "There's even a multi-part documentary on this that you should probably be able to find on youtube called \"The Lobby\".", "label": 0}
{"text": "> How is it that such statements are almost always the exact opposite of reality?\n\nIn my case, she probably just didn't know any better. It was a business class\n\n> Quite apart from the fact that it raises the question of why growth should always be good?\n\nI think we're just so used to capitalism that it's just hard to imagine life without it", "label": 0}
{"text": "[https://www.btselem.org/video/20150419\\_separation\\_fence\\_in\\_hebron#full](https://www.btselem.org/video/20150419_separation_fence_in_hebron#full)\n\nThe full article from B'Tselem on their video.", "label": 0}
{"text": "The rigging of the primaries.", "label": 0}
{"text": "Right after they replaced Biden support soared for a bit as people thought things would be different. But then she started talking and talking about how much she loves Biden and his policies and will not be doing anything different at all and people were like \"oh so I dont have to vote alright\"", "label": 0}
{"text": "inb4 comment removed by mods", "label": 0}
{"text": "I think you might not fully comprehend what the word \"exact\" means.\n\nOnly to a liberal is \"voting for her\" the exact same as \"voting for anyone else\".", "label": 0}
{"text": "You can only see religion through the lenses that western culture based on colonization has put on you. From inside this nightmare everything looks like a power hungry cult because you live in one so they have teached you to project. So you can only see from the perspective of an opressed person that believes that he is only an animal with no humanity and needs to be subjugated by their master's laws.\n\n\n\n\n Religion is the stone in their shoe so they need to water it down or create false conclusions about it, like you are doing now,  to not perceive it as a solution. Better keeping you invested in believing you are trash with no soul so you are easy to bend.", "label": 0}
{"text": "The Democrats have made their priorities known and apparently winning over the Arab vote isn't one of them, let alone anyone with principles.", "label": 0}
{"text": "Every single progsive policy she has supported has been watered down and moved to the right during her campaign. I do not trust her.", "label": 0}
{"text": "Every USA president since... ever?", "label": 0}
{"text": "wow! no way !!1!1", "label": 0}
{"text": "Yep. What americans fear will happen under Trump are already part of latin-americans everyday life. We live, and (try to) do better next election", "label": 0}
{"text": "It won't be thing for much longer.", "label": 0}
{"text": "Sleep, probably.", "label": 0}
{"text": "Your post was removed because it contained an ableist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](http://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah.. do your protest vote for Stein so that Trump has a better chance of getting elected. He cares a lot more about your cause.", "label": 0}
{"text": "It's going to be Trump or Harris because people have decided they'll only vote for Trump or Harris lol. \n\nMeaning their voters have indeed decided genocide isn't a deal breaker.", "label": 0}
{"text": "“She really needs to embrace more right wing American war criminals. The cheneys are enough.”", "label": 0}
{"text": "There are options that oppose the genocide. I voted for one myself. \n\nThe options you'll allow yourself may all be pro-genocide though, but that's a personal preference tbh.", "label": 0}
{"text": "Amtsspreche", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "\"Guys dead babies aren't what's important right now if I might have to pay more for Starbucks\"", "label": 0}
{"text": "Proceed, Hillary.", "label": 0}
{"text": "Defense companies or whoever is profiting from war?\n\nVery small voter margin", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Still waiting on Russia to send me my check.", "label": 0}
{"text": ">the rights of minorities inside the US, the right to an abortion, the right to trans healthcare, and the continued existence of environmental protections hinge on this election.\n\nYour candidate will prefer to lose to Trump before doing anything at all to appeal to undecided voters, nonvoters, voters whose families are getting slaughtered and so many other groups. She will give up every last trans right before doing anything at all to slightly temper Israel's genocidal rampage.\n\nThat is the state of your rights. They are on a tier list to be sold off for a political price, no matter who wins.\n\nVote however you want, but you are going to have to protect yourself one way or another down the line.", "label": 0}
{"text": "US capitalism is directly funding it, and benefits from it. It's not hard to figure out.", "label": 0}
{"text": "There are already price gouging laws technically on the books in 38 states she’s dabbing on us folks", "label": 0}
{"text": "I mean, you could just vote for a third choice. It's not impossible. Other Western nations have done it and do it regularly. \n\nBut if the options you have are the only options you'll ever want, keep doing the same shit and you're guaranteed to keep them.", "label": 0}
{"text": "What a tragic take. This is not socialism", "label": 0}
{"text": "##selflove 🥰", "label": 0}
{"text": "They're not even waiting till post election to reveal that they're full of shit, this go around. It's impressive.", "label": 0}
{"text": "Lmfao", "label": 0}
{"text": "Trust me, the Dems are saying nothing other than how much worse he will be to anybody that brings up the Gaza issue to them.", "label": 0}
{"text": "So you say Putin owns Trump, but Trump will stop the Ukraine war. So you're saying the war will be over because he'll stop funding Ukraine and Russia will take it over completely. \n\nHonestly go fuck yourself for advocating for Trump", "label": 0}
{"text": "Claudia and Karina", "label": 0}
{"text": "You are free to start you own developers community from scratch, with no reputation, no experts, and no organization FTFY", "label": 0}
{"text": "Fun fact: Trump is a big fan of Israel war crimes.", "label": 0}
{"text": "Yeah and libs still go on saying \"she's not perfect but let the orange win\"\n\nThey're just as evil as the cons", "label": 0}
{"text": "I agree. I get it, but it's gonna happen no matter who wins next month. I personally think trump is a loon who doesn't care about the US and I live here so fuck me for being self interested I guess.", "label": 0}
{"text": "I'm not advocating for Trump. I think he's a horrible piece of sh!t  as well.\n\nAnd he will be much worse for Gaza, but much less likely to start a nuclear war with Russia.  If we are truly talking harm reduction, that needs to be part of the calculation.\n\nBut honestly, neither of these assholes deserve to be in the White House, and I don't support either of them.", "label": 0}
{"text": "But… you’re asking to be the one to MAKE the laws 😅", "label": 0}
{"text": "That’s not a win Nancy.", "label": 0}
{"text": "lol it’s “forbidden”, this is fucking pathetic.", "label": 0}
{"text": "🤣 Damn! You are one tough SoB 🤣", "label": 0}
{"text": "traitor says what....?", "label": 0}
{"text": "It’s almost irresponsible bringing kids to this system capitalism has got off the rails", "label": 0}
{"text": "Spoiler: he has not found comfort, he’s in Hell for slaughtering innocents.", "label": 0}
{"text": "Is this on any platforms outside of reddit where it's easy to share?", "label": 0}
{"text": "you can't reform a system that was formed in evil's image to begin with. you can't fix a country built on stolen land by the hands of slaves. you have to end it, and that really just actually is the only workable solution. USA has to end for the world to heal. so does Israel. there is no possible reform.\n\nit doesn't have to be violent, tho. those in power could just choose to stop harming the world. people can make parallel systems that weaken their governments until they shrivel and die of disuse. but no solution involves working within the fucked up system.", "label": 0}
{"text": "Zillow is part of the problem that now wants to give this data freely…why?", "label": 0}
{"text": "This is the B'Tselem website (they have all sorts of videos of Israeli apartheid):\n\n[https://www.btselem.org/video/20150419\\_separation\\_fence\\_in\\_hebron#full](https://www.btselem.org/video/20150419_separation_fence_in_hebron#full)\n\n  \nThis is the direct link to youtube: \n\n[https://www.youtube.com/watch?v=pdLDv8JNnMA&t=9s](https://www.youtube.com/watch?v=pdLDv8JNnMA&t=9s)", "label": 0}
{"text": "Your analogy is silly because russians will still be using Linux and all GPL despite sanctions. What is happening is that all the long term contributors will be kicked out of all OSS and free software communities (as this applies to all software under copyright in the US.) they will be kicked out but not their work: that will be appropiated by the project.\n\nForcing your organization to comply with these arbitrary regulations is worse than owning you. This is weaponization of open source and free software communities.", "label": 0}
{"text": "Hmm, and so close to an election. 🤔", "label": 0}
{"text": "And Harris voters come out the woods just to say what about Trump, a bunch of cowards.", "label": 0}
{"text": "Mearsheimer is a liberal imperialism apologist, so he gets it backward.\n\nIsrael is the US.", "label": 0}
{"text": "Con is just another shade of liberal. They're like that white stuff on chicken shit, it's just another shade of chicken shit.", "label": 0}
{"text": "Democrats need to earn my vote and the votes of other progressives.  They do that by ensuring that progressive policies are passed and making guarantees that they will fight for a future progressive policy agenda.  \n\nThey have done neither.  They will pay lip service and hint at a progressive agenda, but in terms of doing anything, they fail.\n\nIt is the Democratic Party that has failed progressives, not the other way around.  I do think after the 2024 election, progressives need to find a new home in a different true left party.", "label": 0}
{"text": "I do not", "label": 0}
{"text": "The meme literally spells out that not everyone voting for her explicitly wants genocide, just that they decided it's not a dealbreaker.", "label": 0}
{"text": "There's zero the democrats have done for the LGBTQ community that wasn't forced upon them. Zero.\n\nObama ran as a bible-thumping \"its against my faith\" on marriage equality. The ONLY reason we have marriage equality is because one SCOTUS judged voted for it to break a tie. California, the defacto liberal dem stronghold voted against marriage equality in a referrundum just before. \n\nJoe won 2020 and there's been zero progress on trans rights. no trans bill of rights, no protections for hrt or  puberty blockers, etc. Just some executive orders that change nothing. Then Joe and his cohorts have been using queer rights to justify genocide in Palestine with a \"herp derp those muslims arent as open as we are.\" As if human rights are tied to one's views. Heaven knows how many queer Palestinians have been killed by the Biden-Harris regime.\n\nHarris herself made special efforts to have zero trans people or Palestinians speak at the DNC.\n\nWorse, none of this is working. Harris revealing herself as genocider and anti-trans politician didnt raise her polling at all. Turns out those people aren't swapping to her. So she's just hurting the world for nothing.\n\nAlso white cis ivory tower gays thinking this wont blowback on them are the same as cis women surprised they being accosted for 'being trans' in bathrooms. SCOTUS even hinted marriage equality is next.\n\nThis is the worst case scenario. Harris and the dems are selling out rights and not only is that inexcusable, they're doing it for zero gain. If anything, this sort of this is keeping reluctant third party or non-voters from voting Harris with their noses pinched.\n\nThis is the worst timeline and ever suburban liberal with a \"hey lesser evil, amirite\" attitude is just as guilty as the worst MAGA person they think they're so different from, but actually aren't.", "label": 0}
{"text": "I do feel \"morally superior\" to somebody who votes for a genocide-endorsing candidate, yes. Guilty as charged. 100% unapologetically.", "label": 0}
{"text": "[Democrats lose when they back down from trans rights](https://youtu.be/N4bcDqhLqNI?si=ZAZBuOKywAJ_P_F-&t=938), this is a stupid move by Kamala, since Republican anti-trans attacks are ineffective", "label": 0}
{"text": "Lol what even is this post? You're talking like Trump isn't just going to floor the gas on the whole war to speed up the process. Surprise! Both of your candidates are warmongers. That's sort of what the US is built on.", "label": 0}
{"text": "Quiz Time: Who was #3 largest outside investor in Blobby's Twitter buyout?\n\nThat would be a shadowy investment firm called Vy Capital, based in Dubai. In addition to their $700 million stake in the bird app, Vy Capital also owns a sizable investment in Boring Company.", "label": 0}
{"text": "It's been more than two decades. There's a 70s quote from Hunter s Thompson about being forced to vote for shit candidates to stop the other party.\n\n\"How many more of these stinking, double-downer sideshows will we have to go through before we can get ourselves straight enough to put together some kind of national election that will give me and the at least 20 million people I tend to agree with a chance to vote FOR something, instead of always being faced with that old familiar choice between the lesser of two evils?\"", "label": 0}
{"text": "It's not just about a third party *winning*. If enough people vote third party to threaten the chances of one of the main parties, for instance if enough would-be Dem voters choose to abstain due to their policies, then in theory they should be forced to take those policies seriously to win back those votes.", "label": 0}
{"text": "Oh Jesus. Obvious wisecrack should be obvious. As should the upshot: I'm saying that Israelis are going to hell.\n\n\\* It can't be a dumb take, because it's not a \"take\" at all. It could be a failed wisecrack, but I'm disappointed in any reader who didn't easily recognize it for exactly what it is. So far I'm disappointed in a net 50 people I guess.", "label": 0}
{"text": "The blood of Gazan children", "label": 0}
{"text": "No", "label": 0}
{"text": "Word", "label": 0}
{"text": "That simply isn't true. Only one of the 2 major political parties has had its members claim they want to eradicate transgender people from public life. Only one of the presidential candidates has said he will pass day one legislation to revoke trans healthcare. I'm sorry but your opinion isn't the only valid one. Hell, I'm not even American so I'm obviously not voting, but I think it's a huge stretch to say that republicans (who are running with trans genocide as one of their core policies) and democrats (who at least claim they will protect trans rights) are the same on this issue.", "label": 0}
{"text": "Years of propaganda in the making", "label": 0}
{"text": "I see both \n\n- the infinite loop of wealth creation that pulls everyone and everything into it like a vortex\n\n- UBI, everybody on vacation, no one chooses to work state\n\nas societal dead ends.\n\nWhat we would need would be to have a economic state that is efficient to the point that nothing is wasted.  No labor is wasted, no natural resources are wasted on shitty short lived products, no value is extracted by middleman who are just holding onto stock inventory until it is a good price point.", "label": 0}
{"text": "The way he just smiles after getting called out on it... Shit is fucked.", "label": 0}
{"text": "Don't worry, the numbers aren't really individual people. They're somewhat based on the engagement of people, but they're spoofed.", "label": 0}
{"text": "Harris is HRC 2.0. Neocon/liberal for sale to the highest bidder. No core beliefs. Try to package it to sound nicer (marginally) but same end result. Get in line or fuck off. Shame people for having a conscience. Rinse and repeat.", "label": 0}
{"text": "Pretty sure that ear scratch was faked", "label": 0}
{"text": "No this is perfect! Now Kamala knows exactly what not to do lmao", "label": 0}
{"text": "Conservatives: “If you can’t afford to feed ‘em, don’t breed ‘em!” \n\nEveryone: “Ok. Having kids is too expensive. We can’t even support ourselves. So we will stop having kids.” \n\nConservatives: “NOT LIKE THAT!!”", "label": 0}
{"text": "Play them side by side and you can barely tell the difference.", "label": 0}
{"text": "Give us some of your wealth, and we won't worry about it.", "label": 0}
{"text": "i am also not from USA. my impression of their political history over the last 100 or so years is thus:\n\n1. republicans are vocally against something people want\n\n2. democrats are also against it, but pay lip service to the movement\n\n3. republicans do everything in their power, legally or illegally, to subvert the will of the people\n\n4. the democrats condemn them while doing nothing to stop them\n\n5. the leader of the movement gets shot or arrested or both\n\n6. in the name of bipartisanship, the democrats move to the right\n\n7. repeat\n\n  \nkamala has exactly the intentions trump has. she merely plans to \"let\" republicans do it, while he plans to \"tell\" them to do it. that is the only difference, and it is no difference at all.", "label": 0}
{"text": "coming here struggling to find an answer to all this and this is the big selling point\n\nobv trump is objectively worse than kamala, but a third of the  big crap that's happening so far; ai, palestinan genocide, the hurricanes in florida, roe v wade, all happened under biden and kamala and they're doing basically nothing about it.\n\n  \nand before all that, they were still aiding isreal in the past anyways, flint michigan still never got their water crisis fixed; the govt just kind of moved on from them, school shootings? gun control?\n\n  \nthe little breaking points were just one of 3 executions scheduled for people already proven innocent that EVERYONE in their mom was calling for the release of; i no longer even remember their names due to how quick the succession was.\n\n  \nwe all protested, emailed, called in etc and all 3 of them died all the same.\n\nmy mind drifts back to the american palestininas chiming in and getting flamed for saying they're not voting period and here i am.\n\n  \nif the country can't even save one person? what hope does gaza have? what hope does flint or florida have? you? me?\n\n  \nin that one palestinian person's case. what can you even say to them? what good is voting when half their family is dead? in a very literal sense, insanely huge global powers actively hate and are attempting to erase their existence as they speak. there's no nice way of fixing that.\n\n  \nin a very literal sense, it's not a theory, our govt 100% is totally okay with the idea of you being wiped off the planet. not just you, not just gazans, hundreds of us, thousands, milions from all walks of life.\n\n  \nwhat use is voting then when you already know they won't protect you and want you dead?\n\n  \nlike i genuinely want to know because i don't quite see the point of voting either when we all know for sure most of the big shit isn't changing. we're basically fighting to protect the first class at this point it seems.\n\nhope isn't impossible or anything, i just doubt it is through voting at this point.\n\n  \nthey won't draw the line at genocide, the covid/bird flu surges, police brutality, school shootings, climate collapse etc; and the VOTERS don't either anymore. who's really holding them accountable anymore to ensure things will change.\n\n  \ntrump being able to run at all is obviously a red flag.\n\n  \nobv i want kamala to win, the fact that it's even close shows how rigged this all is. \n\neither way, nothing will get better for us and most people my age are comoddities, i'll be dying and be dead in a couple years before our lives even got kicked off. have to put it on hold to deal with all this.\n\nit's hard to discuss publicly because i don't want to get cooked for it, nor do i want to sway more people to not vote.\n\n  \ni genuinely don't know what to say or do. 0 option actually benefits me or the people i care about even slightly.", "label": 0}
{"text": "You mean the 700,000 settlers living on Palestinian land in the West Bank?", "label": 0}
{"text": "Lol wtf are you talking about. How is voting not an endorsement.", "label": 0}
{"text": "The mods squarely stand here:\n\n[https://www.reddit.com/r/LateStageCapitalism/comments/1g8u461/we\\_are\\_in\\_favor\\_of\\_voting\\_discussing\\_voting\\_in\\_a/](https://www.reddit.com/r/LateStageCapitalism/comments/1g8u461/we_are_in_favor_of_voting_discussing_voting_in_a/)\n\nNo communist would ever support any capitalist candidate.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "American politics are shifting to the right, maga and the republicans are just far right nut jobs at this point and the dems are moving more conservative in the name of “bipartisanship”", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Out if irrelevant curiosity, what would happen if a Christian tried walking up there?", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Dems in a nutshell", "label": 0}
{"text": "Thanks for restoring my faith in mankind a bit, at the expense of my faith in Reddit. :-)", "label": 0}
{"text": "Military base to attack other countries in an effort to defend Israel.\n\nAlso, Saudi is our real military base in the middle east", "label": 0}
{"text": "“We should follow the law.” (That I make.)", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Libs in this comment section:\n\n\"If I downvote all these leftists maybe it'll convince them to vote for Harris! And ethically justify my support of her!\"", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "i raise you the 2000 elections where the democrats ACTUALLY won", "label": 0}
{"text": "\"Harris and Walz... A better future was a foolishly dream\"", "label": 0}
{"text": "If you look at germany right now, they just replaced nazism with zionism. They never denazified, just switched ideologies, and again and still just assume they have total moral high ground without a hint of self-awareness or irony.", "label": 0}
{"text": "Just non stop tears. I can’t fucking stand this, the pain and suffering these children and their parents and families, every Palestinian, I can’t fathom the torment. If just seeing this makes me break down in tears I can’t imagine the level of distress those who are there, in it, living it must feel. Well I can imagine, but I can’t possibly understand or grasp it fully. Fuck.", "label": 0}
{"text": "Hilarious if true. AIPAC is humiliating the dems as a power play lol", "label": 0}
{"text": "Read the news. US deployed 100 US special forces soldiers to Israel to supposedly \"deploy a new missile defense system to Israel\". Just Google it. It is such a undeniable truth that not even the CIA/NSA alt-facts, BS and lies censored news propaganda machine cared to censor this one.", "label": 0}
{"text": "Reminds me of the Wokemon memes. \n\nBefore \"woke\" was the go-to word for \"everything left of facist propaganda\"", "label": 0}
{"text": "Elon is caked up", "label": 0}
{"text": "To reply to your now deleted comment:\n\nThis meme is saying she's said she wouldn't change a thing, publicly, a bunch of times. \n\nAre your small town local business owners US arms dealers?  Because when the US sends Israel military aid money with the stipulation they buy weapons from US arms dealers that's taking your tax dollars to enrich the arms dealers at the expense of Palestinian innocents. It's not a difficult connection to make, there aren't even 3 degrees of separation between the policy and the capitalist pursuit lmao. Why you're trying to obscure something that obvious with talk of your local small town business owners is beyond me.", "label": 0}
{"text": "Honestly the fuck is going on in that sub? It's by default the front page of reddit so it gives such a skewed perspective ", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Are you a Soviet apologist?", "label": 0}
{"text": "May many more follow him 🙏", "label": 0}
{"text": "'Enabling fascist'\n\nAt what point are those who 'enable fascist' actually just...fascist?", "label": 0}
{"text": "Heck conservative is literally short for conservative liberal \n\nEither way their no different then the fash", "label": 0}
{"text": "Its my birthday. Last election night we went to cracker barrel and no one was there. We might do that again. It was during covid however so idk if it'll be the same.", "label": 0}
{"text": "You know how there are those customers who will keep buying from a brand even though the quality of the product gets worse and worse, but because people keep buying it the company takes it as a sign of approval and keeps going ahead with the current course?", "label": 0}
{"text": "From what I remembered the ACLU has historically protected the speech of literal Neo-Nazis and the KKK, so no surprise that they're too scared to condemn a racist, genocidal state!", "label": 0}
{"text": "The best part is, not only have her voters decided genocide isn't a deal breaker, but by refusing to even acknowledge any candidate that's opposed to the genocide, they're actually making genocide a requirement for their consideration. \n\nSo it's not just that they don't mind, they don't even want to imagine a world in which we AREN'T funding the murder of innocents.", "label": 0}
{"text": "In most democracies you don't vote in a party leader, the party does that. The problem the US has is that 3rd parties are basically irrelevant giving you less options.", "label": 0}
{"text": "As opposed to not even seriously considering not supporting a genocide you mean?", "label": 0}
{"text": "The scene from family guy with peter and the skin color chart ensues", "label": 0}
{"text": "Have you stopped beating your wife?", "label": 0}
{"text": "If you’re voting for Harris then genocide isn’t a dealbreaker for you. Simple as.", "label": 0}
{"text": "Thanks captain obvious. This is also why humans can’t necessarily be replaced by automation.", "label": 0}
{"text": "democrat voters are the same as the people in nazi germany who joined the nazi party in the name of harm reduction, instead of joining the resistance.", "label": 0}
{"text": "lol at least republicans will say “fuck you” to our face… Democrats will swear up and down they’re on our side and then throw us under the bus till four years later when they need our votes again", "label": 0}
{"text": "The idea is what the Republican Party had evolved so dramatically that a lot of old school Bush and before republicans are on the edge of jumping ship. Theoretically a Cheney endorsement could let it sink in that it’s time to jump ship. \n\nI don’t really see the strategic negative from a liberal lens, it shows they’re the real status quo and that republicans are the ones changing, that’s usually what centrists want anyway. \n\nI suppose it does show Harris as being close to Bush era republicans, but I think for most people (non leftists anyway) that would be shadowed by the appearance that Trump is so fascist he’s made Cheney a centrist.", "label": 0}
{"text": "wtf ofcourse im sarcastic XD", "label": 0}
{"text": "And then profits from it.", "label": 0}
{"text": "The depressed nazis bring me to tears", "label": 0}
{"text": "Okay, so this place is just full of tankies now", "label": 0}
{"text": "Trump would in fact be better, bookmark this and come back to it two weeks after november 5th", "label": 0}
{"text": "Exactly. Framing it as a deal breaker or not a deal breaker is dumb when there is a list of other crucial points of difference. It's just not the deciding factor.", "label": 0}
{"text": "I agree with you. But I’m not commenting on that. \n\nI’m directly responding in general to the type of rad lib thinking that says “the president is just one persons they don’t control the economy or grocery prices!” Or “we have separation of powers for a reason! The president isn’t a tyrant they can’t do that!” \n\nWell I’m lawyer and I’ve done administrative law work. And I’ve extensively studied what presidential powers afford the person currently holding the office. \n\nAnd it is absolutely within the power of the president to quite literally control prices and dictate Israel policy.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Debt/Credit duh!", "label": 0}
{"text": "Ahh gotcha. I was thinking similar as well, back to Nixon and his price (and wage) controls.", "label": 0}
{"text": "Same area, same boat take advantage of food banks! They generally don’t check income and they’re made for gaps like this\nhttps://www.cafoodbanks.org/our-members/", "label": 0}
{"text": "She just says whatever she thinks will best get her elected. She did it in 2020 against Bernie, coming out in favor of Universal healthcare. This election, of course, she won't go near it. She is a black hole of personal values.", "label": 0}
{"text": "It would be... But I haven't been a Democrat for years.  So I just expect Liberals to liberal.", "label": 0}
{"text": "It didn't work the last time we gave fascist genocide doers a free pass, Hague needs to be thorough this time", "label": 0}
{"text": "DOA", "label": 0}
{"text": "eek barba durkle", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "It's good to know the specifics too, as it doesn't get better the more you learn about the economy. Over half of all taxes that are apportioned by the discretionary budget (that is the tax money congress meets and decides where to aportion out every single year, 1.6 trillion $ this year) is used in the military. Another good point, likely none of very little of that is in relation to the tens of billions given to Israel to further this genocide. That is money created by the Fed outside of the budget, and adds directly to the national debt, furthering inflation.", "label": 0}
{"text": "Lmao this sub is so funny", "label": 0}
{"text": "Ehhh let me google value add for you", "label": 0}
{"text": "Jewish/Arab.... Jewish is not ethinicity unless im mistaken", "label": 0}
{"text": "Yes, two of my favourite Israelis are journalist Gideon Levy and academic Ilan Pappé. I'd recommend people read their work and watch them on youtube.", "label": 0}
{"text": "It’s a significant? The posts complaining about it aren’t any better", "label": 0}
{"text": "Wut?", "label": 0}
{"text": "How does the G7 affect them at all", "label": 0}
{"text": "share this in twitter & see how Zionist bootlickers will defend this", "label": 0}
{"text": "Election season; deal with it. We have to.\n\nAnd it's driving me to the edge of suicide. Seeing everyone agree with the fascists on both \"sides\". 2 wings of the same bird (insert nazieagleemblem.jpeg)", "label": 0}
{"text": "No. And I’m not even American myself\n\n“As of August 2024, Reddit is the 9th most-visited website in the world. According to data provided by Similarweb, 51.75% of the website traffic comes from the United States, followed by the United Kingdom at 7.15% and Canada at 7.09%.”", "label": 0}
{"text": "Don't forget old Jeremy Corbyn in the UK.", "label": 0}
{"text": "I love that clip from the debate where trump pointed out that she hate Israel and they both arguing on who loves Israel more. Like it’s a US election i remind you.", "label": 0}
{"text": "Whoever controls the army controls power. There's no revolution against the US government with revolvers.", "label": 0}
{"text": "Rather than lazily accusing anyone and everyone who holds a different viewpoint of being a bot/troll or being paid by Russia/China/Republicans, actually engage with the point being made. There are plenty of spaces where you can dismiss people for being a bot and not engage with their point. This is not one of them.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This is a leftist subreddit, right wing comments will be removed and the user banned.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.", "label": 0}
{"text": "Mao was right. What’s blackstones board look like?", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Dude. $15k would save my life. This is so stupid.", "label": 0}
{"text": "Rather than lazily accusing anyone and everyone who holds a different viewpoint of being a bot/troll or being paid by Russia/China/Republicans, actually engage with the point being made. There are plenty of spaces where you can dismiss people for being a bot and not engage with their point. This is not one of them.", "label": 0}
{"text": "Well they definitely would’ve lost if they kept genocide Joe so they shouldn’t be crying this is the best they could do.", "label": 0}
{"text": "Quite a few. Heres a real quick YouTube history on how entwined Israel and the US have been since Day 0.\n\nhttps://m.youtube.com/watch?v=elQGTyqx2x8&list=FLg9sf3riCZRESLB9DmrplZw&index=25&pp=gAQB\n\nA poster above recommended \"The Israel Lobby\" again for US-Israel history specifically.", "label": 0}
{"text": "I lost patience with their bullshit when they were all heartbroken and devastated by the assassination attempt. I mean I know they can’t go out there and cheer for it, But they can denounce it without making it sound like they’re crying at home over the sadness of all of it", "label": 0}
{"text": "Saudi Arabia wasn't as stable though and still quite isnt. Because while the royals are practically honorary Americans the population dislike America and loathe Israel.", "label": 0}
{"text": "While shitarel citizens having health care and living good Americans citizens too afraid to call an ambulance because it will bankrupt them. Sad. Fuck israel", "label": 0}
{"text": "They love profit, and they love things that produce profit, so they love war.", "label": 0}
{"text": "He's evil borat", "label": 0}
{"text": "Genuinely asking anyone who wants to dialogue.\n\nWhat are the options then? We are essentially forced to choose between just the two right now. There is no realistic path for any other candidate to win at this point.\n\nHow are you choosing?", "label": 0}
{"text": "Some people in the US need to come to terms with the fact that they live in a warmongering Empire and that this election is not deciding on that. If you guys want to stop your state financing wars and genocide you better start planning to destroy your entire government.", "label": 0}
{"text": "[Paywall-free archived article](https://archive.ph/2024.10.25-212033/https://www.axios.com/2024/10/25/election-democrats-trump-harris-lose)", "label": 0}
{"text": "Please wait until your account has at least 500 comment karma before posting on /r/LateStageCapitalism.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This is gonna age like fine milk when they sacrifice more Americans in the Middle East soon", "label": 0}
{"text": "The election of the next president of the number one sponsor of human misery in the world is pretty notable, especially when both of the front runners are committed to genocide.\n\nBut there’s nothing to stop people making other unrelated posts, right? Why not make one?", "label": 0}
{"text": "Hard to believe when there's a minor caucus revolt happening in Canada.", "label": 0}
{"text": "They love things that produce profit? I don't know if that fits. After all, workers produce profit.", "label": 0}
{"text": "His personal politics don't interfere with his analysis that much because he can be clear-headed about what others want and assess their actions.", "label": 0}
{"text": "If you kill yourself the fascists win. ", "label": 0}
{"text": "Have you tried to drive around neighborhoods in Belfast after 7:30pm?\nGates up and it’s 2024.", "label": 0}
{"text": "There is no war in Ba Sing Se", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "A coin toss against Trump is blowing it.", "label": 0}
{"text": "**Sources:**\n\n* [Top](https://www.piratewires.com/p/how-wikipedia-s-pro-hamas-editors-hijacked-the-israel-palestine-narrative) / [Middle](https://www.theguardian.com/world/2010/aug/18/wikipedia-editing-zionist-groups) / [Bottom](https://www.youtube.com/watch?v=t52LB2fYhoY)\n\n---\n\n**Miscellaneous articles:**\n\n* [EI - EI exclusive: a pro-Israel group’s plan to rewrite history on Wikipedia](-pro-israel-groups-plan-rewrite-history-wikipedia/7472)\n\n* [The Forward - ADL may have violated Wikipedia rules — editing its own entries](https://forward.com/news/467423/adl-may-have-violated-wikipedia-rules-editing-its-own-entries/)\n\n* [Haaretz - Conservative Israeli Think Tank Uses ‘Sock Puppets’ to Skew Wikipedia](https://www.haaretz.com/israel-news/security-aviation/2023-07-18/ty-article/.premium/fake-wikipedia-accounts-conservative-israeli-think-tank-behind-skewed-overhaul-articles/00000189-6945-de70-adcb-f9c77a080000)\n\n* [Times Of Israel - Wikipedia probe exposes an Israeli stealth PR firm that worked for scammers](https://www.timesofisrael.com/wikipedia-probe-exposes-an-israeli-stealth-pr-firm-that-worked-for-scammers/)", "label": 0}
{"text": "While you’re at it please remember Trump is just as bad, if not worse, as she is.", "label": 0}
{"text": "Poetic Justice", "label": 0}
{"text": "Kind of true, if the international community turns their back on israel that would stop them real quick, but yeah the US doesn’t have that kind of pull anymore with israel and we can see it clear as fucking day. The upper echelons cannot live in peace when the dust settles. They enabled a fucking genocide for a year. And if criminal charges aren’t brought I hope politicians get sued into fucking oblivion", "label": 0}
{"text": "*\"Presupposing that one must be a liberal to think that there are more ways than just \"support of Israel\" for one to be bad, \"*\n\n  \nThat is not what I presupposed,\n\n  \n*\"or more ways than \"capitalist shill\"\"*\n\n  \nnor that.\n\nMaybe you should read what I wrote again and give it another think through.", "label": 0}
{"text": "These posts are more annoying than the ones you're complaining about", "label": 0}
{"text": "I did not delete that message on purpose. I don’t know what happened. But it doesn’t matter what you say, a shit meme is a shit meme. \n\nMy small town business owners are capitalists they own a business in a capitalist system. So, your very broad statements apply to them. Tho, I’m sure they’ll feel the heat from your daring opinions and change their tune.", "label": 0}
{"text": "A litany lesser of two evils later and here we fucking are, a lesser evil that’s pretty fucking evil", "label": 0}
{"text": "Also Elon: “Something something personal responsibility” 🙄", "label": 0}
{"text": "IKR? Most of Reddit seems to be Zionist apologists, it’s disappointing.", "label": 0}
{"text": "Proud to do my part", "label": 0}
{"text": "Fellow LGBTQ+ people: take note. Fascism *needs* an enemy to divide and conquer. If we allow them to slaughter Palestinians in the same of \"protecting gay people\" and build concentration camps for migrants then it is only a matter of time before we are next on the menu. \n\nSolidarity must be our north star. Don't let the Democrats and Republicans push survival out of the overton window.", "label": 0}
{"text": "Please mark sarcastic comments with /s because yes, it can be not obvious, as in your case. This is not readers fault.", "label": 0}
{"text": "Everyone wants to feel morally superior. At least leftists know that voting for president is entirely a politically apathetic action in almost every state.  There’s every other day of the year do political action that makes more of a difference. But if your line in the sand is something that is nearly inevitable in this election, then the stakes are much lower for a singular vote in a state that is nowhere close to being a swing state.", "label": 0}
{"text": "Compromise with the right.. they don't compromise with the left. They yell at the left to fall in line or else the republicans win", "label": 0}
{"text": "In other words, their hail mary AI robot slaves is just a distant fantasy. Please come work in our factories.", "label": 0}
{"text": "I’ve decided that this is the year I stay home. I feel like I can’t ethically support this entire system at this stage", "label": 0}
{"text": "I'm just trying to understand this - it says the staff is asking them to condemn Israel, they respond with divesting would hurt us? So they won't condemn Israel, they're also heavily invested in Israel? Why? And lastly why would divesting hurt them? Do they receive a lot of donations from pro-Israeli folks? Honestly I have a hard time understanding why all our leaders so insanely blindly unquestionably pro-Israel. It's like Israel has dirty laundry on all of them.", "label": 0}
{"text": "Trump would end it by being so strong that he would give any aggressor whatever they wanted. Like how he would end the war in Russia by giving Putin a happy ending.", "label": 0}
{"text": "Dems got a memory of a gold fish. They forget how wildly unpopular she was in their previous primaries. Its like they wanted a worse version of 2016 lmao.", "label": 0}
{"text": "Close. They're Americans.", "label": 0}
{"text": "They’re not sweating, one owns fiat currency the other hands them out (read print). \n\nProduction capacity and labour, you can’t magically print that out. Now they’re sweating, no matter how much money they throw at their MIC, they’ve reached max capacity and are now rationing ammunition and missiles while the global south has stockpiles of nearly a century", "label": 0}
{"text": "Yes! Even if they claim it’s not apartheid, it’s unquestionably Jim Crow. There’s multiple laws in the same vein to reinforce this discrimination.", "label": 0}
{"text": "If shit like this was a consistent part of my life I can't say I wouldn't end up being a freedom fighter myself.", "label": 0}
{"text": "I’ve been to those quarters multiple times. You’re lying.", "label": 0}
{"text": "is that feelsy or whatever that app was. its literally just a copy of a FREE app called triple a", "label": 0}
{"text": "So.. I'm confused as to what event or statement or interview has caused Harris to lose her slight lead? \n\nPolls were showing her with a slight lead just a few weeks ago... so what happened.. in the eyes of centrist/undecided voters? Did I miss some major gaffe or some crazy policy statement? \n\nI know folks in this room have plenty of reasons to offer why she's losing... but I'm just curious about centrists. I find it weird to go from \"leading\" to \"oh shit we're gonna lose\" without some major policy shift. It's not like the folks here suddenly changed their view... my question focuses on centrists who believe they have some great decision to make between two different turds.", "label": 0}
{"text": "Let me know how 1 party voting in the US is going for you.", "label": 0}
{"text": "Black people are citizens now. Women can vote and have jobs and own property now. We had a black president. You're ignoring blatant examples of reform and change. It may not be perfect and it is not the full change we want, but to say it cannot change is just factually false.\n\nThe system changes by raising class awareness of exploitation. You enact change by becoming a part of the system. Be the change you want to see. My god, there was a time where you'd lose your job if you were suspected of hanging out with someone that was suspected of maybe having socialist ideals. Not so long ago we had someone running for primary with socialist beside his name., and we have a party of socialist liberation. So dont tell me the system can't change. I'm fully aware the DNC ganged up on him and hosed him, because he was too against the status quo, but thinking both parties are the same and there's no hope is EXACTLY what capitalists want you to think, so you'll waste your vote on a party is not viable enough right now to start the immediate threat", "label": 0}
{"text": "Humanity is lost 😞", "label": 0}
{"text": "Voted for Claudia today ❤️", "label": 0}
{"text": "It's engineered this way, but Trumpists and Russian bots to try and sway people away from voting Democrat.", "label": 0}
{"text": "> How do you feel about cis gender childfree women getting sterilized when they want to? I wasn’t able to get my tubes removed until I was in my late 30s because I didn’t already have kids and I was unmarried.\n> \n> And it’s wild to me to think that I could have said I wanted to transition when I was 20 and I could have become sterilized, but because I’m a woman I had to fight for years.  \n> \n> So can us Childfree people be included in your fight for medical care too or nah?\n\nGo to votesocialist2024.com", "label": 0}
{"text": "Its only a deal breaker when there is actually a non genocide option available. That includes not voting.", "label": 0}
{"text": "Yeah, for demlibnazis we are all Russian, SeeSeePee and North Korea bots, because, you know, to criticize and desmistify the pathetic circus that is the US fake democracy and its joke of totally not-democratic, manipulated and despicable elections can only be done by AI powered evil ghouls like us.\n\nIt does not matter that US imperialism just enabled the terrorist zionazi bibi to push the world to the verge of WWIII and nuclear annihilation just because he does not want the war to end or he and his son will go to jail for corruption as they stole more than 100 billion USD from Israeli (and as result American) coffers and that is the reason why Bibi started the total war in the first place \n\n\"Let's stop talking about politics\" is the typical talking point demlibnazis use when they are losing, and Holocaust Kamala is being trounced by a senile bankrupt \"businessman\" that literally pisses his own pants. US is a very bad taste joke.", "label": 0}
{"text": "Yeah it's this. They haven't funded Israel since 1946 out of the goodness of their hearts (lmao). It's a strategic location and as long as Israel is successful and is profitable with its expansion, the US will allow bulldozing people alive, burning people alive, blowing children into bits, crushing them underneath rubble, starving people to death to name a few. As others have said, it's their colony and military base. \n\nIf the fundamental issue at hand isn't corrected, this will happen again. Journalist Mansour Shouman said that Israelis and Jordanians are allowing civilian cars to leave the West Bank to Jordan. They're planning on annexing the West Bank next.", "label": 0}
{"text": "He doesn't even give af about his own 12 children.", "label": 0}
{"text": "2016 was like Shaq taking a freethrow. It's honestly embarassing how bad it was. If they ran Bernie, i personally know dozens of Trump voters that would've voted for him.", "label": 0}
{"text": "They’re not sweating, the DOJ blows them while they do their shit.", "label": 0}
{"text": "LOL it's a fucking TV show.", "label": 0}
{"text": "Obama won by pretending to be progressive. Hilary lost by.... well just so much shit but most notably here because she tried to appeal to moderate republicans who don't want Trump. So which strategy do they pick? The losing one of course!", "label": 0}
{"text": "You mean the candidate in 2008?", "label": 0}
{"text": "I can see the overlap but I don't think we are quite there yet.\n\nThe resistance movement I'm part of is confident we will be better able to operate under a Harris admin than a Trump admin. That's why we push for her to win.   \nVoting for Claudia is a great symbol if you're in a safe state though.", "label": 0}
{"text": "And in true democrat fashion, they rolled over and let the republicans have it rather than risk \"Decorum\". They tend to forget that we wouldn't have this conservative stacked supreme court if Obama had even an ounce of nut and made the appointment like he was supposed to.", "label": 0}
{"text": "no.\nyou have drunk the liberal flavor-aid to the point you're spouting propagandistic lies on reddit dot com in defense of a woman and party who demonstrably and vocally support the ongoing genocides of indigenous americans, blacks, muslims, and the entirety of latin america.\nyou can either realize you're wrong and stop being wrong, or you can deal with the fact that you're on the wrong side and you're not going to find support here.", "label": 0}
{"text": "I didn't make any broad statements. I replied to you with a fact that is a fact about specific capitalist interests, probably not applicable to your local small business owners. \n\nFun fact about capitalism (and also kind of the entire idea behind it): what benefits one capitalist doesn't usually benefit them all. See Amazon doing capitalism and it's impact on big box stores for instance. \n\nIn broad strokes, your local small business owners aren't usually who anyone is complaining about when they talk about what's wrong with capitalism (unless you include landlords). For the part, your local business owner is just cosplaying real dangerous capitalism and taking the posture of people with actual power and pretending they have the same interests. They think they're same as Jeff Besos so they pretend to want the same things as Jeff Besos, until they get put out of business by - you guessed it - the Jeff Besos of the world, and suddenly remember they're just the little guy lol. I won't cry for them ever, they usually just pivot to becoming landlords after all, but let's not pretend small building owners are ruining the world with their outsized influence, because they usually don't have any beyond that which they exort over their minimum wage workers. \n\nThese aren't the people directly benefiting from this genocide and Kamala's current administration's support of it, but I did you the favor of identifying who actually is benefiting from it and related it to capitalism directly, so you can either take the truth as provided or stick your head in the sand deflecting about unrelated people - I don't care which. \n\nDon't act like you didn't get an answer tho.", "label": 0}
{"text": "Laughs in Mao", "label": 0}
{"text": "Please vote, but don't vote for incompetent fools. Vote Socialist.", "label": 0}
{"text": "Right!   \n\\> Forcing your organization to comply with these arbitrary regulations is worse than owning you. This is weaponization of open source and free software communities.\n\nfair! But it doesn't make Linux be owned by the US government or not be free software.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Rule 6, no lesser evil rhetoric. This includes encouraging people to vote for any capitalist political party and any capitalist politician. There is no harm reduction in supporting either of two parties headed by genocidal fascists. The extent to which any elected official of a Capitalist Party in a Capitalist state can enact evil is the extent to which that official is allowed to do so by Capital. As such, neither candidate is the lesser or greater evil. See more on our position here: [Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?](https://new.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/)", "label": 0}
{"text": "Your post was removed because it contained an ableist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](http://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Let me know how you think it's going for Palestine, Sudan, the world when it starts running out of food in 25 years...", "label": 0}
{"text": "Maybe stop moving to the RIGHT on key issues!!! Wtf? Harris HAD IT and then wasted her lead and momentum by putting out some dogshit statements and policies. Jfc", "label": 0}
{"text": "Yep. And it hasn't worked one single time in the past \\~40 years. The elections they won they did so by doing the opposite of this, actually giving the base what we want, or at least pretending to do so before most of us got smart and figured out their game/con.", "label": 0}
{"text": "MAGA existence is perfect for dems. not only do can they get away with posturing for absolutely nothing, they can move further right and still be seen as the “rational” ones by liberals.", "label": 0}
{"text": "Lesser evil only exists in the mind of shitlibs", "label": 0}
{"text": "Nope.\n\n  \n[https://media.tenor.com/xV8qY0HggGwAAAAM/simpsons-weve-tried-nothing.gif](https://media.tenor.com/xV8qY0HggGwAAAAM/simpsons-weve-tried-nothing.gif)", "label": 0}
{"text": "… sooo, stop blowing it?", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This has been confirmed for months now with video evidence, we've since have had [pro-rape riots in 'Israel' backed by the top 'Israeli' politicians](https://www.aljazeera.com/program/newsfeed/2024/8/13/israeli-protesters-rally-for-the-right-to-rape-prisoners), '[Israeli' parliament (sucessfully) argued on TV in favour of rape](https://x.com/ireallyhateyou/status/1817904053462196523?t=lCW_zx20SsnHrJvCpHE2_A&s=19), with a rapist being brought on one of the most viewed 'Israeli' TV channel to be defended, ([who themselves defended these rapes](https://x.com/ireallyhateyou/status/1821121616094412908?t=wKy5AG8vv7d8PQwVU1HMkg&s=19)), who'd later proudly take his mask off online and then [be brought on TV again to be praised](https://mondoweiss.net/2024/08/the-main-suspect-in-the-sde-teiman-gang-rape-case-is-now-a-media-star-in-israel/), [a top rabbi of 'Israel' affiliated with the ruling party would \"bless\" the rapists on camera](https://www.aljazeera.com/program/newsfeed/2024/9/9/israeli-rabbi-blesses-soldier-accused-of-raping-palestinian-prisoner). This is besides 'Israel''s long, well documented history of systemic rape against the Palestinians since it's very 'inception,' and 'Israel' being an international safe haven for pedophiles fleeing prosecution in their own country.\n\nThey spread the lies about Palestinians committing mass rape so that they can commit mass rape, something they have a long documented history of. This is entirely abetted, very consciously by Western media apparatuses, who went out of their way to spread the worst, most unfounded, emotionally charged libel against Palestinians and then adopted a policy of categorically refusing to report the actual rapes that 'Israel' commits in hopes that these get bogged down and become the new norm. Western media apparatuses are rape supporters.", "label": 0}
{"text": "The only reason why it's been able to do this with such impunity is because it's a vassal and tool of the western powers in the region, primarily America and the UK, who apart from injecting it with money to save their proxy militarily, also defends it from any sort of prosecution or coverage, mainly with its media apparatus which is very wide spanning. It's a tool of the western powers and not the other way around.\n\nWestern media isn't by journalists, it's by dark-age-era gutter-level slanderers dragging us all back with their fascism. They should be entirely boycotted and ostracized, they shouldn’t be engaged with at all. Western journalism is genocide abetment, deliberate disinformation, Goebbels’ fascist mirror politics that they’ve kept alive and popularized and made into a norm through out the world, cultivating fascism in the world’s society. They, especially Gettleman, should be charged with inciting genocide. One thing this genocide has done has shown is their naked scaled faces to the world. They should never be taken seriously again lest they justify another genocide. In a sane world they’d be immediately dismantled and tried for their crimes.", "label": 0}
{"text": "Commie porn can be super hot. I've got some nappy headed commies in my family. Love them all.", "label": 0}
{"text": "Give it a week and a half, it will pass", "label": 0}
{"text": "Zillow's a huge part of the problem, they can fuck right off with their fake concern.", "label": 0}
{"text": "These posts are likely Russian propaganda", "label": 0}
{"text": "no, those are examples of the system working as intended. i am unsure why you thought any of what you said was even relevant, as none of it shows a change of the system, merely a change of which specific people run it.\n\nyou, however, seem to have ignored that the United States is a project of genocidal colonization, that slavery never ended, that your government is itself prosecuting genocides against, as i mentioned, indigenous americans, blacks, muslims, queers, and latin americans, none of that even related to the genocides USA supports abroad. there is no reforming an inherently evil system, as all you'll ever get is a slightly different evil system.\n\ncapitalism is a failed system. genocidal colonization is a failed system. USA is a failed system. you can't even feed and house your own people, and you can't stop spending billions on killing.\n\nJUST. STOP.", "label": 0}
{"text": "Sorry, you are not AIPAC, they pay her bills, lol.", "label": 0}
{"text": "I can't wait to hear the 2028 dem nominee brag about having Trump Jr's endorsement.", "label": 0}
{"text": "I'm a millennial rooting for yall, trying to hang on in this brokedown palace. I watch a lot of dissident content produced by Gen X and millennials, and while I agree with a lot of it, they still don't get (or are incentivized not to get) that money is the root of all the evil they complain of. Today I heard someone state that your generation had been so beat down that you were now ready to submit to the state as slaves. He said yall were ready to have the state \"take care of you.\" That attitude enrages me. There is no freedom in smoking capital's pole, begging for at will employment, demeaning yourself and trading your dignity for inadequate compensation, and constantly worrying about how to afford rents that keep getting higher and higher. They act like they're trying to preserve some agrarian utopia or artisanal labor or something. No, this system is synthetic, and it has nothing to do with natural law or Adam Smith anymore. It is predatory and dehumanizing. Yall aren't talking about surrender. You're talking about victory. I hope I live to see it. Do it!", "label": 0}
{"text": "I’ve never seen a Trump post in this sub", "label": 0}
{"text": "Correct, this is Hebron. It’s a city in West Bank but Jewish settlers have been encroaching into it and now they claimed certain streets as Jews-only. Arabs who live on those blocks are forced to use back doors and can’t be on that street, to the point where the IDF welded their front doors shut.", "label": 0}
{"text": "I have a question for you. If you were the Prime Minister of Israel, what would you do?", "label": 0}
{"text": "They would also “magically fall off the 15 floor” but American style", "label": 0}
{"text": "These types think if we vote for Kamala we can \"push her left.\" With what fucking leverage? You've already sent the message to dems that they can commit genocide and you'll still \"vote blue no matter who.\" Don't fucking tell me that voting for Kamala is pragmatic or \"the lesser of two evils.\"", "label": 0}
{"text": "I suspect it has something to do with the mass idealization and idolization of celebrities, public figures and stars within America, along with the atomization of American society.\n\nMany people would mentally collapse if they stopped believing in their Holy Godlike Politician, left adrift without an anchor, so their vision of the Holy Trump or God Biden have to be absolutely perfect and beyond reproach of mere mortals. The mental gymnastics required are the price of blind devotion.", "label": 0}
{"text": "Yeah, the media conveniently forgets to mention that they are bombing the fuck out of a democracy (Lebanon). When it's convenient for them that's not a question.", "label": 0}
{"text": "$615,520. \n\nThat's how much it costs to get Nancy Pelosi to look the other way when civilians are being brutally murdered.", "label": 0}
{"text": "I could see her losing the popular vote.", "label": 0}
{"text": "Dude my keyboard doesn’t even make those symbols so you’re clearly a Russian spy", "label": 0}
{"text": "I have commuters fighting this on my hometown Reddit", "label": 0}
{"text": "The damn electoral college is forcing us to vote for Kamala, or else trump could win. If 50% of democrats vote for Harris, and 50% vote third party / not at all, and 100% of republicans vote for trump, that would be bad", "label": 0}
{"text": "This guy needs to go away", "label": 0}
{"text": "Unrelated, but this reminded me of when my dad was adamant that there was a KGB spy who told Americans that Russia was trying to disseminate left wing propaganda to the States to make people anti-America or some shit like that. \n\nTurns out he wasn't a spy, and some of the \"left wing propaganda\" this supposed spy talked about was things like acceptance of interracial marriage.", "label": 0}
{"text": "In other news.. water is wet.", "label": 0}
{"text": "Populism is a meme.", "label": 0}
{"text": "Japanese settlers in Korea 1939:\n\nGuess where they went?", "label": 0}
{"text": "Voted for Claudia and Karina yesterday. Was surprised how long the line was to even get in the parking lot (it was out to the nearby interstate) let alone to get into the building.", "label": 0}
{"text": "Obligatory reminder for everyone who sees this to watch BadEmpanada’s video on the Holodomor genocide and how Wikipedia lies to you.", "label": 0}
{"text": "How do you do fellow communist bots!!\n\nwhat do you prefer, vodka, baijiu, mojito or rượu đế?", "label": 0}
{"text": "Such as? What do you drink when botting, rượu đế or baijiu?", "label": 0}
{"text": "I vote for vodka and borscht", "label": 0}
{"text": "The damage that Zionists have done to the Jewish people and \"feminists\" to women is probably going to be quite significant. I am thinking of \"crying wolf\" essentially.\n\nThe harm to Palestinians and the hypocrisy and pure evil among those who know this but stay quiet is as obvious as it is impossible to overstate.", "label": 0}
{"text": ">Bring back the old late stage capitalism my comrades!\n\nOnly have 7 posts on this sub. OP: How do you do fellow communists.", "label": 0}
{"text": ">Bring back the old late stage capitalism my comrades!\n\nOnly have 7 posts on this sub. OP: How do you do fellow communists.", "label": 0}
{"text": "OP is trolling, this is their first post on the sub.", "label": 0}
{"text": "My post complaining about Kevin O'Leary for wearing two watches on a Fox News show last night and giving a spiel about how \"yeah I go for Trump because it's what's best for the country, not just his scumbag capitalist ass will make me richer at your expense, trust me!\" was removed, yet the 800 upvoted #HolocaustHarris post accusing all of her supporters as supporters of genocide is still up lol.\n\nActually, I scrolled for a while just filtering by \"hot\" and pretty much most of those that aren't about Israel are just for shitting on democrats specifically, and most of them are just memes without any type of basis in reality (no guys, not all Kamala supporters love Israel and genocide). A little weird that all of those are okay yet my one image post about a Republican supporter wearing two watches, and the image clearly shows two watches, is removed for \"not having reliable sources.\"", "label": 0}
{"text": "At this point, \"democracy\" is just a dogwhistle for \"civilized white nation\". Colonialism always rebrands itself. First it was to Christianize the cannibals and savages, then to bring them civilization and now it's to promote human rights, democracy and freedom™. But the goal is still imperialism and supremacy.", "label": 0}
{"text": "https://theintercept.com/2024/10/24/aipac-spending-congress-elections-israel/", "label": 0}
{"text": "the American people dont matter, its israel who matters.\n\nim not even an American, and that seems fucked up.", "label": 0}
{"text": "Sorry for your downvotes on this. I whole heartedly agree, though. It's not about \", so tell people can't etc....\" it's just blatantly obvious shitposting that I didn't sub for", "label": 0}
{"text": "Unless they're an American with dual nationality and the other nationality is of an Arab country.\n\nI remember my Palestinian friend's summer family trip was ruined because they were forced to enter from Jordan.", "label": 0}
{"text": "I don't think you get that I'm saying this is a pure strategy. It's not loyalty or disloyalty.  She changes with the wind because that's how you survive\n40 years in DC & stay at the top as long as she has. She sees the base moving. She also sees the donors she's courted for decades moving in the opposite direction of the base. It's a dance.  I have no love for the woman, but I see her making moves in relation to the rhythm.  Imo what I'm trying to say isn't exactly about her. She's just an indicator.", "label": 0}
{"text": "I've thought about this a lot. I really really don't know. A huge portion of this country still reacts like a hissing cat to anything vaguely progressive. I honestly believe if libraries were pitched as an idea today they'd be laughed out of the room. That's how broken we are.", "label": 0}
{"text": "Fun fact: so is Kamala", "label": 0}
{"text": "I use “innocent civilians” to be gender neutral with that! And emphasize children too sometimes depending on context", "label": 0}
{"text": "That's good to hear. Fuck 'em.", "label": 0}
{"text": "Yes. Early last year the Israeli government tried to make nice with Biden, in hopes of getting on the visa waiver list of countries. (Meaning Israeli citizens would be able to fly to America without a visa or background checks) Arab Americans protested very loudly, because in order to qualify for the list of visa waiver countries you need to show reciprocity and let Americans into your country too, and the Israeli government makes Arab visitors wait in a separate line for hours and be searched harshly, even with an American passport. The “unofficial policy” according to Israeli officials was  to treat “every Arab is a terrorist,” but they updated the policy to be “every Arab is a terrorist unless he has a US passport.” Biden approved the visa waiver despite the flood of complaints. \n\nThat was way before October 7, and one of many reasons only 19% of Arab-Americans said last year that they’d vote for Biden again.", "label": 0}
{"text": "Bbbbut... Gutierrez visits Putin for BRICS summit, it's ukrainophobic, therefore UN bad! ", "label": 0}
{"text": "I'm glad we got your approval and you'll continue to grace us with your presence.", "label": 0}
{"text": "I prefer to mainline Mydoom and ILOVEYOU, keeps my circuits nice and trim", "label": 0}
{"text": "Literally, don't care, here for me", "label": 0}
{"text": "Just imagine for a second your politicians say the same but \"our commitment to Russia\" while you getting poorer and poorer...", "label": 0}
{"text": "Because the ruin strewn corpse of America's empire is starting to collapse.\n\nIt's the definition of late stage capitism.", "label": 0}
{"text": "Huh?", "label": 0}
{"text": "“You’re critical of Harris so you must be pro-Trump” is exactly the kind of dualistic horseshit I come to this sub to get away from. General consensus here seems to be that they’re two finger puppets on the same hand, and I happen to agree.", "label": 0}
{"text": "Trucks are dummy expensive now. After the hurricane and how often I had to lean on friends to bring me plywood to board up my windows and transport a ladder to fix my fucked roof... I'm trying to find \n\nI can get a midsized sedan with less than 100k miles for 10k, hell I can get a small EV SUV for not much more.  \n\n30 year old toyota pickup with 180k miles?   \n  \n$25k \"I know what I have\".", "label": 0}
{"text": "Can it be gay interracial love? \n\nJust trying to do my praxis...", "label": 0}
{"text": "What keeps you living out there? Why not move?", "label": 0}
{"text": "You are however completely firm in thinking that Harris can only win with your vote. She could lose despite it given how much of a mess she is making with the swing states. \n\nYour ballot is not bulletproof and is not a holy artifact against evil outcomes. If you are not willing to fight the system by going far beyond voting, there's nothing else to be said.", "label": 0}
{"text": "First they came for the Communists ...", "label": 0}
{"text": "Negotiations,diplomacy not have concentration camps not do genocide there’s tons of things that he could have done but didn’t now his next move could be to surrender himself and face the consequences for his actions hopefully he spends the rest of his days behind bars as he should be", "label": 0}
{"text": "One day this colony, another way to say it, an apartheid state, will turn its back on the us and we will have nothing to show from not. Barely even mentioning the humanitarian crisis", "label": 0}
{"text": "They are so god dam entitled they somehow don’t even lie about this during the election season like their lies they care about the working class", "label": 0}
{"text": "Honestly, who can tell any other side but Harris is evil judging by the majority of posts on this page. \n\nThings are so one sided here you couldn’t blame anyone for thinking Trump was the hero of the left by default.", "label": 0}
{"text": "What? Young people leaving the \"we don't give a fuck about the opinions of young people\" party? The \"we try harder to appeal to Republicans than young people\" party? \n\n\nINCONCEIVABLE!! ", "label": 0}
{"text": "they're leaving but a majority of them are not going right, I am part of this graphic. left the party 5 years ago at 26 years old", "label": 0}
{"text": "Yes, but Trump voters have also decided that genocide isn't a deal breaker. They are in favor of \"finishing the job\". It's a low point for all Americans who aren't voting Jill Stein.", "label": 0}
{"text": "Seems like young men feel disenfranchised and isolated.", "label": 0}
{"text": "To really see what is going on we need similar graphs for other choices.  If no other party is going up (GOP, Green, PSL, etc) then they are just \"dropping out\".  But I suspect that as usual the pollsters ignore the left alternatives.", "label": 0}
{"text": "Most rich people prefer countless deaths of people they don't know over not affording to have a different yacht every day.", "label": 0}
{"text": "Are they leaving....or just not affiliating with a party?", "label": 0}
{"text": "There is a fundamental difference in what elon is doing. Buying votes is illegal. Buying politicians is encouraged. He's giving money to the wrong people.", "label": 0}
{"text": "Where are they going? Socialism?", "label": 0}
{"text": "If anyone thought that, they're likely a shitlib who understands absolutely nothing about the left at all. We don't like capitalists here, and we won't vote for genocide.", "label": 0}
{"text": "I support this.", "label": 0}
{"text": "Or De la Cruz.", "label": 0}
{"text": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.", "label": 0}
{"text": "Yep", "label": 0}
{"text": "Where is anyone ever saying that he’s better than her on it?", "label": 0}
{"text": "We do not permit homophobia, racism, antisemitism, xenophobia, sexism, ableism or any kind of prejudice.", "label": 0}
{"text": "It’s election season we got like a week & a half till Election Day. It’s important we discourage ppl not to vote for genocide.", "label": 0}
{"text": "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.", "label": 0}
{"text": "And it convinces the population that it is the only economic system that works and all others will naturally fail; all the while doing everything possible to make such other systems fail.", "label": 0}
{"text": "What a STUPID ass move by the Harris team.. I can't even begin to understand WTF they were thinking with that absolutely dumbshit move...", "label": 0}
{"text": "There has never once existed fascism w/o patriarchy", "label": 0}
{"text": "Rather than lazily accusing anyone and everyone who holds a different viewpoint of being a bot/troll or being paid by Russia/China/Republicans, actually engage with the point being made. There are plenty of spaces where you can dismiss people for being a bot and not engage with their point. This is not one of them.", "label": 0}
{"text": "super slime simulator is your next best option. also try out triple a while you're at it", "label": 0}
{"text": "There are times and places for everything. This is not one of them", "label": 0}
{"text": "I mean, you hope so, but realistically probably not", "label": 0}
{"text": "Bruh, I was just pointing out that the politicians complaining about the border didn't vote on a bill that would solve (in their minds) the problem they are complaining about. \n\nPersonally, I would like to see more funds to get more folks through legally.", "label": 0}
{"text": "Zero mentorship and absent parents", "label": 0}
{"text": "Endorser of genocide or a misogynistic racist who will also endorse genocide. Continuing the cycle of voting for the least worst option just shows the parties that we the people will continue to play ball. These are not real choices", "label": 0}
{"text": "We are closer to a party change the more boomers that pass. The top two parties have identity crises and are pushing middle aged men away. If Biden stayed in the race, Trump wins easily but the libertarian party finally gets enough votes to get funding… since he dropped out… we are forced to chose between genocide and pedophilia 🤮🤮🤮", "label": 0}
{"text": "Wynaut?", "label": 0}
{"text": "trans people who try to get hysterectomies are denied them for the same reasons as cis women. trans people ARE fighting for medical freedom, you're just being needlessly transphobic instead of being mad at the system for treating people with uteruses badly.", "label": 0}
{"text": "Why does anyone still have faith in this utter dipshit? ", "label": 0}
{"text": "Fuck off mom", "label": 0}
{"text": "Yeah, looks like[according to the pew research polls](https://www.pewresearch.org/politics/2024/04/09/age-generational-cohorts-and-party-identification/) that young people *proportionally* actually still lean more democrat than Republican when looking at the proportion of people who identify with a party at all, but far fewer identify themselves with a party at all:\n\n>In addition to the differences in the overall partisan tilt of younger and older voters, younger voters are considerably more likely than older voters to opt out of identifying directly with a party.\n\n>For instance, among voters 80 and older, 77% identify with a party (49% as Republicans, 28% as Democrats). About two-in-ten instead say they are “something else” or independent, with most of them leaning to one of the parties.\n\n>By comparison, only about half (52%) of voters under 25 identify directly with a party (38% Democrat, 14% Republican). About half instead say they are something else or independent, with 28% leaning Democratic and 20% leaning Republican", "label": 0}
{"text": "What did they say? ", "label": 0}
{"text": "They’re being sucked into the red pill manosphere via Roe Joegan “I’m just asking questions” grievance culture. It’s a funnel to the alt-right and it’s working to radicalize young men into fascism. \n\nNothing anywhere equivalent exists on the left.", "label": 0}
{"text": "Do you know which subreddit YOU are in? It’s not one about cats", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Bullshit alpha male hacks peddling misogyny on podcasts", "label": 0}
{"text": "You forgot the (s)", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This. I can't find the poll this came from (Gallup or American survey), but according to other Gallup polls  the trend has been that all younger people have been moving to \"independant affiliation\" / \"lean neither\", rather than republican or socialist. \n\nHow this question is worded / spun ends up with slightly different percentages, but Republicans have generally lost the most ground overall and more women have stuck with a party (overwhelmingly democrats) than men.", "label": 0}
{"text": "I did the same after Obama bailed out the banks", "label": 0}
{"text": "That may just mean more women are joinging...", "label": 0}
{"text": ">There's noone to count the dead....\n\nThat's the point.  This is a feature not a \"bug\".", "label": 0}
{"text": "USA was built and is still growing because of genocides, not sure if any of the options they are voting will actually change much", "label": 0}
{"text": "Finally some classic LSC rather than \"both parties bad\" distractions.", "label": 0}
{"text": "Iran isn't a concentration camp full of unarmed citizens that the \"Israelis\" can march into and slaughter at will. It's a developed industrial country with a decently strong army and good strategic location and the Zionist criminals realise this and hopefully won't escalate further.\n\n\n But you really can't know these days in all likelihood Biden and Harris will authorise Israel to conduct a bigger strike in a desparate attempt to win the election", "label": 0}
{"text": "This subreddit hasn't been discovered/moderated by reddit itself yet.  The reason there are few, is anytime a subreddit is regularly getting 1-2K upvotes on neutral or pro Palestinian posts, they start locking the posts.  In addition, it's been proven DNC and AIPAC and Israel have bots and staff flooding Pro Israel media/memes/etc. Talking to people face to face is a better way, but still hard to judge.", "label": 0}
{"text": "The same type of people that tell you to vote bc your voice matters are the same fucking people that say shit like that. It’s annoying.", "label": 0}
{"text": "I went independent. I vote for policy not a party.", "label": 0}
{"text": "I agree with both points.  However, not allowing for people who don't realize the evil as evil until AFTER the action, when they process their emotions is flawed.  Israel will never stop on their own, til more people come to this realization.    \n  \nWith forced military, violent police, and jail time for denying service, it's not easy to withhold your service, let alone speak out.  Israeli police are now violently attacking the Orthodox who aren't against the violence, but against joining the military and putting their lives at risk.  Certain people had \"privilege\" to deny service in the argument of dedicating their lives to study the Torah; they were given \"spiritual leader\" exceptions.  NOW, the police are beating them, and they are ending those exceptions.  My point is, the government is making it harder and harder to avoid military service.  Even Women must serve.  At some point it becomes unethical to expect that someone object, when the reality could mean they are immediately killed, or fear physical violence and prison.  Hell, the USA did that during WW2 and Vietnam.", "label": 0}
{"text": "The only reason why 'Israel' has even survived this long is because of America constantly injecting it with endless money, weapons, intelligence support, on ground support, diplomatic support, and doing everything for them. Otherwise their reality was exposed on 7th October 2023, by fighters from a concentration camp. Even now they aren't making any military progress against Hamas or Hezbollah, both have been inflicting heavy damage on them, even 'Israelis' admit that Hamas is very much active.", "label": 0}
{"text": "We need fully open primaries. If everyone voted in both Democratic and Republican primaries, you'd cut out, like, 75% of the problem. I also don't think voting should be voluntary. If you have to pay taxes there's no reason why you shouldn't also HAVE to vote.", "label": 0}
{"text": "All these comments are wrong - most are going Right due to all the right-wing male-focused content creators and comedians pushed on social media", "label": 0}
{"text": "I have definitely seen a trend toward socialism among coworkers.  I'm secretly based af in a role where I'm not allowed to be.  Despite that, I'm constantly dropping dog whistles seeing who picks up on it.  You'd be surprised how many closet socialists there are even in the most ghoulish of positions.", "label": 0}
{"text": "This is nothing like the 6 days war, nor is Iran anything like Nasser's Egypt or the secular Arab countries of that time, whose issue was limited to land borders. And neither is Iran looked up to as leaders of the Muslim world by a majority of Muslims, which is from the minority Shia sect.\n\nIran has paid a heavy price supporting the Palestinian cause since its very inception since the revolution. Immediately after their revolution they faced the most bloody conventional war of the 20th Century, when, at the time, Western backed Saddam attacked them, in a grotesque one sided war. This is not even a year after the western backed Shah had looted Iran and depleted it, and Iran was sanctioned to oblivion by Western powers. It was during this that Iran helped foster the would be Lebanese resistance. They are still sanctioned into oblivion, and they still fund all Palestinian resistance factions. If they were to just drop support for the Palestinian cause, a lot of their problems would be eased and they refused to do it. It's true, they don't want a war with America, but when it came to their sovereignty, they fought America in Iraq and Syria.", "label": 0}
{"text": "Then pick up a book and read, you illiterate dumbass. \n\nUnlike Liberal theory, communist principles aren't studied through memes and shitposts. You actually need to pick up a book and start learning.", "label": 0}
{"text": "Elections and Parties are SCAM", "label": 0}
{"text": "Lol yeah because any criticism of the US and the destruction it has wrought on the third world is a lie lmao\n\nKeep believing it tho, the contradictions of capitalism are becoming more and more apparent in the US. \n\nThings will only get worse as you continue to blame others instead of questioning your own systems and organizing with your working class.\n\nTough luck", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Lol both parties are not the same on this. The Jill Stein propaganda is just working", "label": 0}
{"text": "Hopefully this trend also track with young men leaving the Republican party. We need more independent voters and people who will do more at the ballot box than fill in the entire thing red or blue.", "label": 0}
{"text": "Diplomacy takes time, and the Democrats are willing to do that with Israel/Palestine. Saying how could Trump be worse is purposefully obtuse", "label": 0}
{"text": "Lack of affordable education, I go to law school (a conservative occupation) but the majority of the men in my school are either liberal or leftists. Same in undergrad in a somewhat conservative area in a blue state. Not sure if other people's experiences are the same but most uneducated men I know are conservative or Magats. \n\nIgnorance is the biggest win for Republicans and they know it.", "label": 0}
{"text": "Democrats lack a core identity - they try to appeal to such a wide electorate without any real commitment to any ideal beyond open minded consumer mindsets. It’s great for avoiding offense - but absolute shit for any attempt to rally individuals to a common cause.", "label": 0}
{"text": "Exactly this, RED, BLUE, they both want endless war, it's incredibly profitable.", "label": 0}
{"text": "Sadly they’re not. We just had a provincial election in British Columbia and the young male vote went very strongly to our right-wing party. \n\nIt’s largely a vote against the incumbents due to cost of living and inflation — not realizing that these are problems everywhere in North America — but also the right making an appeal to young men who desire the unfettered privilege of years past. \n\nIt’s been pretty alarming to be honest.", "label": 0}
{"text": "They actually are, but just as many are going radically right, a real big valley is being formed, the American centrism just isn’t working anymore", "label": 0}
{"text": "Lots of young men are being drawn to ethno-nationalism and men right activism or losing faith in the Democratic party and its ability to uphold its supposed values. I'm of the former. I never wanted to support warmongers.", "label": 0}
{"text": "Iran's real Iron Dome (S 300 and S 400) worked as magic against the American-Israeli Nazi attack and no one got hurt. But, hey, the Israeli \"paper dome\" did cost around 1 trillion dollars TO US TAXPAYERS, and Iran had no naked soldiers pinkwashing genocide by carrying rainbow flags, so probably Muricans will stay more entertained by the Israeli genocidal state than \"boring\" Iran.", "label": 0}
{"text": "No, the graph isn't the proportion of democrats that are young men, but the proportion of young men that are democrats", "label": 0}
{"text": "Yeah it's a good cat.", "label": 0}
{"text": "I mean, there were some people at gaza with AKs and some traficked unguided missiles. Admittedly, there were so few that it's difficult to catch them on camera as opposed to civilians being massacred. I'm surprised it took them that long, to be honest.\n\nIran can probably follow the soldier's social media and try to bombard the places where they post themselves wearing their victim's clothes.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Them trying to assasinate an ex-president might seem a bit too much.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Funny thing is the guy is an Indian man Masquerading as a Jewish person lol.", "label": 0}
{"text": "It seems to me that we're in the late stages of global/imperial capitalism, just before the collapse of the environment, our systems and societies. As such, parties bo longer care to pander to the interests of the of their constituents, but rather keep up a farce long enough to allow maximum extraction of resources for the hegemons.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "The Dems hate men maybe?", "label": 0}
{"text": "A quick reminder that we do not support Dr. Jill Stein or Cornel West.", "label": 0}
{"text": "Always amazed at how much “environmental groups” are defenders of the status quo and capitalism. While we are living through a mass extinction.", "label": 0}
{"text": "There is substantial evidence that a major split is happening between young men and young women though, so ignoring that probably isn’t wise. [Here’s just one example I found by googling for 2 seconds.](https://www.reuters.com/world/us/despair-makes-young-us-men-more-conservative-ahead-us-election-poll-shows-2024-04-12/)\n\nTons of polls indicate a slight rightward shift in young men while their female age cohorts have shifted sharply left. Young women have moved so far left that they are negating the impact of rightward shifts in young men in aggregate polling.\n\nThe rightward trend in men seems to be a combination of both reactionary social views piloted by male influencers like Andrew Tate alongside an economic sense of despair amongst that cohort. Young men appear to be responding to a sense of economic despair by turning to a right wing agenda that promises a return to the good old days when they were in charge.\n\nI personally feel this is largely due to failures of liberal policy makers to address any of the issues facing young people today. They offer no real option for young men trying to make their way in the world, and it leaves the door wide open for right wing grifters to offer fascist solutions to their problems.", "label": 0}
{"text": "The valley is largely forming along gender lines though which is even scarier imo than if there was a radicalizing split that was happening more evenly across genders. \n\nTalking with young women I know, dating today is very hard for them and they basically have to vet men constantly who try to pass themselves off as less radically right wing as they are. There’s a growing sense of unease that’s really scary imo.", "label": 0}
{"text": "Exactly. And it’s because Donald Trump et al is actually offering a solution to them. It’s a fascist solution that’s a fucking farce, but the lie is convincing to many of them desperate for someone to tell them that they’re not to blame for their lot in life. \n\nDemocrats and liberals left the door open to fascism by failing to offer an alternative and many young men are falling into it almost by accident because anytime they try to look for answers to the problems by searching for anything from dating advice to workout advice, they’re finding fascists telling them their problems all stem from women, gay people, trans people, immigrants, or minorities as a whole.", "label": 0}
{"text": "I mean, I never joined the party and I’m very left/progressive.", "label": 0}
{"text": "They both say they will support Israel, but with Harris, i get the feeling she will change that if elected. Israel controls America and it's politicians.", "label": 0}
{"text": "Nas Daily's Wet Dream", "label": 0}
{"text": "😭😭😭😭😭", "label": 0}
{"text": "Maybe, but that’s not quite what your source actually says. \n\n>have become more conservative since 2014 - or, in the poll’s terms, to favour more control rather than freedom\n\nYou can see here that what the poll actually asks versus how the article interprets it aren’t quite the same. \n\nAs the same source says further down (and you kind of touch on with the Tate example) most of the new radical right are coming from the moderate right. Thats a rise in extremism but not really a rise in conservatism. \n\nI’ve seen lots of other polls that either imply or directly state that they interpret disillusionment with democrats as a sign of conservatism. So not sure if the quantity of those polls is evidence of their veracity.", "label": 0}
{"text": "Gen X Humour: *\"ironic\" racism and/or homophobia*", "label": 0}
{"text": "You can choose to interpret the polling to allow yourself to live in a fairytale land where young men aren’t fairly rapidly moving right if you want. It’s not how I’d interpret the same polling, but it’s your life live it as you will.", "label": 0}
{"text": "Okay, but my interpretation is based on actual statistics so I feel more confident with it.", "label": 0}
{"text": "People like you should call me daddy. Your mom already does", "label": 0}
{"text": "\"You know who else probably loved cats? Bombed Palestinian children\" something like that", "label": 0}
{"text": "Place is right. Time is wrong", "label": 0}
{"text": "Who's moving into these places people can't afford to live in? Every area can't be gentrifying at the same time. Small landlords have mortgages to pay and even Blackrock wants to have people living in their properties so they can make money.", "label": 0}
{"text": "believe me, if the democrats were true socialist they would probably seemrising voter numbers", "label": 0}
{"text": "Well the poll you linked didn’t actually support it, and I explained why many other polls don’t. \n\nYou’re allowed to agree or disagree with whatever you want. I ain’t the thought police. But your reasons as stated here aren’t based on data or polls or paying attention. It’s your vibe.", "label": 0}
{"text": "So much bullshit. Housing should be a public utility, not a for-profit enterprise for paper-pushing money humpers to fuck around with.", "label": 0}
{"text": "“We” meaning fascists. I’ve often seen Indians imagine a sort of global unity between fascists that doesn’t exist.", "label": 0}
{"text": "He has outright stated he’s more pro genocide. This is stupid", "label": 0}
{"text": "I've seen this being said before, is there a proof that he's Indian ?", "label": 0}
{"text": "Can you expand on that", "label": 0}
{"text": "People should just ignore Elon, because he's dumb but also because it makes him angry to be ignored, which is funny, fuck you Elon.", "label": 0}
{"text": "I absolutely agree that Isnotreal is a complete joke, but I don't think they were exposed by Oct 7th. I think they intentionally let it happen and implemented the \"Hannibal directive\" to inflate the number of dead Israeli reservists to give them the excuse to ethnically cleanse Gaza and the west bank. \n\nThey were told by the US and other intelligence sources at least 3 days before Oct 7th about the operation and they even encouraged the relocation of the music festival closer to Gaza with that intelligence in mind. There are also some suspicious occurrences of reduced military/occupation presence along the Gaza border and tech failures for the early warning systems.", "label": 0}
{"text": "Right wing red pill content and the manosphere mostly", "label": 0}
{"text": "How is everyone here defending Iran? A violent and corrupt state imprisoning and censoring its population, especially women since it's new inception?", "label": 0}
{"text": "He’s getting downvoted because this is Reddit. You think these people can logically read satire without /s?", "label": 0}
{"text": "2006. Voters gave Dems both House and Senate and the first thing out of Pelosi's mouth is: \"Impeachment is off the table. We look forward, not backwards.\" And when Obama said the same thing in 08, I knew the ratchet was working as intended. People want accountability and the Big Club keeps letting each other get away with it. You would think the scam should be pretty f'in obvious by now! ", "label": 0}
{"text": "Actually it seems to me that both parties are in the right spectrum. Republicans are far, extreme right and democrats are far right too, but not so far.", "label": 0}
{"text": "> What is this \"even though\" bullshit? \n\nQuite simply, the Democrats don't really care whether they win or lose. US politics is all about serving the interests of capital. Which in turn is always guaranteed no matter who wins.", "label": 0}
{"text": "That’s the problem with all two-party systems across the world. I live in the UK, essentially a two-party system at election time (although we have a lot more smaller parties than just Jill’s Greens) and the two big parties are just trying to appeal to too many people so their identity— as with dems and republicans— just becomes “we’re not the other guy”", "label": 0}
{"text": "I'd wager is a bit of each, I don't know much about Indian but at least in Spain fascists are usually muslim haters and vice versa, they are often proud of their bigotry too and flaunt like their hatred is something to be proud of...", "label": 0}
{"text": "Why don't you just mass organize to vote in another, for instance, green?", "label": 0}
{"text": "https://www.reuters.com/world/us-warns-iran-stop-plotting-against-trump-says-us-official-2024-10-15/", "label": 0}
{"text": "I understand, but you're just not going to find a lot of leftists caring much about political slapfights between the two capitalist, imperialist, increasingly fascist parties. Especially in the case of two of them arguing over which is more serious about fascist border policy. One of the joys of leftism is being able to look beyond the spectacle.", "label": 0}
{"text": "Incels", "label": 0}
{"text": "Oh they know all this, at least the top leadership does.\n\nUS politics is not about winning or losing elections but about serving the interests of capital.", "label": 0}
{"text": "Don’t be fooled by benign sounding names, while there may be some modicum of truth to it this is from an extremely biased far right source. That source is the Koch Bros and its network of wealthy conservative donors and they are vehemently anti-communist and pro hyper capitalists. This is all intertwined with PragerU, Daily Wire type propaganda with its push to appeal to a younger audience. Now, there’s definitely an alt-right pipeline that exists and it appeals to young men whether it’s Joe Rogan’s podcast or some video game Streamer or YouTuber. I don’t think that exists on what is called the left at least not in the same numbers. Hassan Piker is the closest I can think of. The reality is that the Democratic Party is actually a center right party which masks and obfuscates its intentions and policies with left, liberal sounding rhetoric with an over focus on pandering to women and the LGBTQ+ community. This is part of the turn off for young men as they can’t relate and see the cheap liberal pandering creep into the things all for a quick buck (see how neoliberalism swallows, co-opts and ruins anything it touches). At the end of the day the left needs to do better with young men less they all become Andrew Tate.", "label": 0}
{"text": "I mean in the casino the house always wins, so if you play, in your own...", "label": 0}
{"text": "I don't know about how many are going to the left, but the ones that are going right are definitely concerning. People like Andrew Tate have been able to use the issues facing young boys and men to spew their bullshit. Unfortunately. algorithms such as Youtube's will re-enforce the issue because it makes them money.", "label": 0}
{"text": "Any attack on liberal ghouls comes with an implicit fuck you to everyone to their right.", "label": 0}
{"text": "gen z men are more conservative. that’s why", "label": 0}
{"text": "Are you serious? You think Republicans are far extreme right?! Lol", "label": 0}
{"text": "Young men are particularly more susceptible to Trump/Tate/Musk's grifting it seems. I don't know if this is young men leaving the Democrats, maybe just fewer men affiliating with the Democrats when they are of a legal age to.", "label": 0}
{"text": "Those are two different things, they did get exposed and they also implemented the Hannibal directive. The two aren't contradictory in the least, they just didn't want there to be hostages, just how they don't care about the hostages now since it has cost them a lot in the past. Another important thing is how utterly unprepared they were after October 7th. They began running out of ammunition, resources, even basic uniforms very early on. They don't really need to do something like this, Gaza was already in a concentration camp, and they went on with their daily life. They destroyed pretty much all of their credibility, be it military, humanitarian, become a pariah state and hated around the world, and expose itself to social and political turmoil, something they were completely unprepared for.", "label": 0}
{"text": "Young man statically are the worse voting block. That demographic routinely has awful turnout numbers when it comes to voting.  Young men made up the core of the Bernie voters that would rather Meme then vote.", "label": 0}
{"text": "In my opinion: Yes! Do you know who is posting? Maga‘s maybe? Someone who wants Trump up and Harris down?\nBe suspicious, if the yelling goes up AND mostly in one direction.", "label": 0}
{"text": "Yeah it does look like Iran is the next planned flashpoint in our era of conflicts.", "label": 0}
{"text": "Can we just put this at the top as the TL;DR and close the post out. A+", "label": 0}
{"text": "WTF is up with the random capitalization holy shit", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "It’s all for Israel’s benefit. Always has been. \n\nhttps://youtu.be/jWxKn-1S8ts?si=gQgQBCe50oa3ESwC", "label": 0}
{"text": "People who can't explain why the democrats can't change anything (liberals) and don't know the actual leftist perspective, socialist and marxist theory as to why things don't change can easily fall for right wing reactionary propaganda and empty rhetoric.\n\nIt's easy to fall for the simplicity and ignorance of it, that's why lost political people tend to easily slip to the right instead of the left, because reality is complex and the right offers simple non solutions.", "label": 0}
{"text": "Realize that commentary is done by a guy in India, lol", "label": 0}
{"text": "Most people haven't realized that Democrats don't give a shit about abortion rights, and it's become the one thing liberals hold as a red line. \n\nYoung men don't care about that issue, so when faced with the choice between a republican and a republican, they choose the republican", "label": 0}
{"text": "They kinda forgot their History arent they ?", "label": 0}
{"text": "Clearly yes. They are about as right as is possible.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "That's something I think about a lot (and I'm not even from the U.S.). Which part of these post are genuine activism? Maybe a sustantial part of these post are campaigs from Trump teams, microtargeted at communities to disenchant voters. Its demonstrated, from known cases of Mark Zuckerberg and Elon Musk, that they're able to show specific ads and fake news to specific voters based on their interests and internet activity woth the intent to make them change their vote or even to stop voting. Rich men have always had the power to sway elections, but never with this reach, never have been able to talk directly to every single voter, whispering in their ears while masquerading behind the supposed randomness of the algorithm.", "label": 0}
{"text": "They are being radicalized by MAGA via social media.  Ben Shapiro and Joe Rogan purposely target them.", "label": 0}
{"text": "My brother in Christ what does right mean to you if the Republicans aren't it.", "label": 0}
{"text": "Passing off any criticism of the party and it's practices as foreign meddling my have some influence on those numbers.", "label": 0}
{"text": "Gay acceptance is plummeting amongst Dutch children since about the Trump presidency, far more are going to the right. Men also vote far more for far right parties in all of Europe than women.", "label": 0}
{"text": "Probably will smoke some weed, drink a few beers, and either watch Hasan's stream or hangout with my friends in discord or both.\n\nIt's unlikely we'll even have a winner on the first night unless the polls are way off. With the current margins being so close, it'll probably take at least a couple days to call some of these swing states.", "label": 0}
{"text": "Don't get me wrong here, of course he's scum.\n\nHe is aware of the class struggle and the interests of his class and fights on the side of his class of capitalists. Meanwhile, most US Americans are not even aware that there is a class struggle. Let alone that they are fighting for their own class, the working class.\n\nUS Americans don't just lack [class consciousness](https://en.wikipedia.org/wiki/Class_consciousness). The majority firmly believe that capitalism is great and most will consider it a patriotic act to fight and die in defense of capitalism and the billionaires.", "label": 0}
{"text": "could also just put \"lmao\" after it like that", "label": 0}
{"text": "when it starts advocating for fascism, so basically, some number of months ago now?", "label": 0}
{"text": "Based on the timeline, my guess would be identify politics that pretty much drop men as a talking point during the Trump years to try and counteract his rhetoric.\n\nBut there's probably other factors.", "label": 0}
{"text": "lt “goes in one direction” because the dems are \n\n1) The party that is asking left wing voters to ignore the genocide and vote for them. \n2) The party that is in power now and has been funding the genocide for the last year.\n\nThere is no grand conspiracy of maga dickheads pretending to be communists on left wing reddits, the dems themselves have done more than enough to ensure lots of leftists won’t lend their votes. \n\nWhat you should be asking is why, if Trump is such an existential threat to democracy, the dems have decided that facilitating the genocide in Palestine is more important than winning the election.", "label": 0}
{"text": "Yeah, that's kind of how I would describe my friends. Broadly sympathetic to socialism, they don't yell at me when I'm shitting on Dems, or posting commie memes, etc. I did have one friend who moved to Germany a couple years ago and was pushing back on my pro-palestine stance. I eventually got him to come around though. Really I just need to get these fuckers to read more.", "label": 0}
{"text": "US commitment to Israel is predicated upon Israel remaining a destabilizing force in the Middle East.\n\nIf Israel had sweeping government change and elected a leader serious about peace negotiations with Iran the US government would take that leader out.\n\nA country that can’t truly acknowledge that it was founded on genocide and slavery will always punish liberation.", "label": 0}
{"text": "Economics. Losing men's ability to afford their lives. They turn against everyone else but the economic system", "label": 0}
{"text": "Same in France, they are flabbergasted that about 25% don't believe in democracy anymore. How is that possible ?", "label": 0}
{"text": "The \"catering\" of the liberals is mostly lip service, and passing some laws to overcome situational prejudices.\n\nIf your life is a misery pit, what does it matter that you are represented more in the media?\n\nThis is not actually a \"fairer society\". That would entail focusing on class issues. \n\nThe Democrats are basically just going \"We see you down there in the slave pits, queer people! Women, we support your right to not toil in the mines with an unwanted child!\"", "label": 0}
{"text": "\"Poll analyst Nate Silver found that Gallup's results were the least accurate of the 23 major polling firms Silver analyzed, having the highest incorrect average of being 7.2 points away from the final result.\"\n\nWikipedia on Gallup, Inc who ran this poll.", "label": 0}
{"text": "gonna have to ask my husband if he thinks hanging a print of that protest sign in our living room would be too on the nose", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "I respect the power of Poe’s law, but come on. That was a quote from Jesus. The Israelis do things to act out Christian metaphors now? Sometimes one goes way past “I hope this is a joke” into “this is so obviously a joke that I should assume so unless proven otherwise.”", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "The gayer the more communist it is.", "label": 0}
{"text": "Damn... here I almost got happy reading the first three words.", "label": 0}
{"text": "what's the actual alternatives *right now* though? I keep seeing she's here that she's the devil, but I don't see alternative solutions here? \n\nthe system is built in a way that makes change nearly impossible no matter what you choose, and the amount of organisation needed to rise up for something like a revolution? anti-kamala memes ain't gonna lead to that. \n\nas an American when both candidates *do* support the genocide, is it not at least preferable **for now** to vote one that doesn't seek to outright ban muslims from the country, destroy US healthcare further, and even tear down the few illusions of shreds they have of democracy already? I'm genuinely asking, if I've missed them elsewhere: what are the options *right now*?", "label": 0}
{"text": "The Democratic party does not represent the interests of its younger constituents, nor does it promote progressive policies. As a matter of fact, it actively shuns its progressive base and takes them for granted, openly accepts Islamophobic and pro-war, all of this while veering to the right in domestic issues, in particular those who fled from the republican party after Trump's victory in 2016. \n\nCurrently the Democrats are working as hard as they can to win over the \"respectable republicans\", the Never Trumpers who would not associate themselves with the \"white trash\" rubes, the latter of whom are not afraid of expressing their xenophobia in the open. \n\nBecause of this, we are at an impasse, people do not want to vote for the republican party, but if the democratic party is actively working towards republican policies then what is the point of supporting the likes of Biden or Kamala? If the party tries to compromise with an opponent in a vague interest for the spirit of \"Bipartisanship\", even though said opponent is openly defamatory and demands nothing but capitulation, then what really is the point of supporting said party?", "label": 0}
{"text": "I’m 30, registered to vote for the first time this year. I registered unaffiliated because the furthest left party was the democrat party. I’m left of that.", "label": 0}
{"text": "It's almost as life and politics is more nuanced and complex and one single common cause....\n\n  \nI get what you are saying and I see it. But I guess I look at that as a sign of a healthier political party. Having a broad spectrum of ideas and attempting solutions for said ideas. \n\n  \nI still hate the 2 party system and wish we had more legitimate choices. But over the last 10 years it seems like Dems are the only ones actually trying to get anything(worthwhile and helpful to average people) done", "label": 0}
{"text": "I was independent but my state has closed primaries so I have to be party affiliated to participate. So while I never have wholly identified with either party, I have to pick one to vote in primaries. It's so stupid.", "label": 0}
{"text": "It makes no strategic sense for the American people, that's for sure. Neither does war with China or any country for that matter.\n\nThe constant saber rattling and resultant geopolitical power struggles are tiring. The fear porn, the \"boogeymen\" that we exaggerate, the dehumanization of those on the receiving end, the opposition that we prop up and assuredly radicalize (though we tend to radicalize all sides).\n\nThe bodies of US imperialism/genocide are tucked away very carefully, but our pile is much bigger than anyone would like to admit and it very likely has no comparison to the regimes we smear and propagandize, while parading as the polar opposite.\n\nBottom line, if we can't extract resources from the Middle East or South America, etc. life would move on, and we may actually address key issues like renewable energy and diverting funds from the military to collectively make our lives better.", "label": 0}
{"text": "Me are out for revolutionary blood - whether through fascism or communism.", "label": 0}
{"text": "I feel like it’s also important for people to understand that 1950s, pre-Great Society, living standards were horrifying. The lifestyle depicted here was in no way typical.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "It doesn’t make sense. It’s a dissonance trap around here.", "label": 0}
{"text": "He is hedging against Trump winning.  Doesn't want his rag to endorse Kamala only to piss off Trump. Class solidarity in action.", "label": 0}
{"text": "Are you saying that learning from the mistakes another made when they were in the same position isn't valid?", "label": 0}
{"text": "My take is that the only thing keeping young women from doing the same thing is the abortion issue which affects them more. The democrats can keep them in line by making their bodily autonomy dependent on them winning elections. Which is also why they probably will always fail to pass a national bill guaranteeing the right to abortions (and conveniently will always have the republicans to blame for it, instead of their own self-interest).", "label": 0}
{"text": "The definition of apartheid", "label": 0}
{"text": "The problem is in « services society needs », who define that ?", "label": 0}
{"text": "The Powell Memorandum -> Deregulation -> Ronald Reagan -> Citizens United", "label": 0}
{"text": "Are you saying the trump maga cult are not extreme right? Lolololol", "label": 0}
{"text": "The same reason others are leaving. Democrats refuse to listen to their base. They won't give them what they want. They're more concerned with being blue Republicans.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "You're literally putting words in her mouth. She never said anything about states deciding, if anything she references federal law. \n\nShe says it's up to doctors to make the decision, which is a reasonable stance. Of course I would like her to go further, but that's enough for trans people to get healthcare and it isn't the stance that Trump makes which is literally \\*we should prevent trans people from existing, take them away from their parents, ban them from adopting, lock them up if they go to the wrong bathroom, etc\\*", "label": 0}
{"text": "The reality is that Israel is losing. It’s spent the last year murderously bombing a concentration camp and thus becoming a villain on the world stage. It’s unable to “destroy Hamas” and it will never be able to wash itself of the crime of genocide. It has zero credibility and the only reason it has any power left is the support it has from the racist American state.", "label": 0}
{"text": "She is not referencing federal law. She is referencing state law, as that is what determines access/etc. unless it is codified federally.\n\nIs she promising to do that?", "label": 0}
{"text": "@VividProwess is a notorious Indian account lol", "label": 0}
{"text": "Queen!!!!", "label": 0}
{"text": "you probably don't want that on an official US government document anyway, given how freely the US government is allowed to target communists.", "label": 0}
{"text": "I bet that would directly correlate with a graph of young men who are fed up with bipartisanship and don’t identify with either party.", "label": 0}
{"text": "Desperately clinging to its most problematic colony will be the death of the Empire", "label": 0}
{"text": "Hey, writing propaganda on western social media is a good job in Iran & Russia, nice pension and benefits.", "label": 0}
{"text": "Reagan and his Democratic counterparts the DLC, living on in Joseph Robinette Biden.", "label": 0}
{"text": "Down vote and move on", "label": 0}
{"text": "Does anyone know the intercept ratio?", "label": 0}
{"text": "I see no world in which a trump presidency is better for Palestine than a Harris presidency. It is bizarre to see posts like this in here. ", "label": 0}
{"text": "I would pay my life savings just to see this dirtypants baby annoyed", "label": 0}
{"text": "Removed as per rule 2: post must have reliable/credible source(s).", "label": 0}
{"text": "Agreed on all points, with one extra item: Placing a high importance on human wellbeing.", "label": 0}
{"text": "You have any alternative to fptp voting in your state? Or is it OK the ballot?\n\n\n\n\nAdvocate for that shit! ", "label": 0}
{"text": "Bingo", "label": 0}
{"text": "No further context, location or information about what's there.\n\nWhat sort of installations have guards and fences around?", "label": 0}
{"text": "Nazis", "label": 0}
{"text": "I love all the Harris fans who think this is a startling deviation from democracy when 1) the media has been doing a wretched job for many years now of not being truth tellers and has been excusing our leaders of a lot and 2) Harris is not upholding democracy anyway.", "label": 0}
{"text": "It’s amazing that democrats will blame leftist for their failures but will never try to court them. Democrats “we have platitudes about environmentalism that we won’t actually do, but at least we’re not trump”", "label": 0}
{"text": "In Canada, the Libs said they would fight climate change and then spent 20 billion on expanding pipelines. Neolins won't fix the environment. I'm not sure socialists would either frankly.", "label": 0}
{"text": "The president gets a magic \"The Economy\" wand and gets to cast \"more jobs\" \"grocery down\" \"raise or lower taxes\"\n\n\nDidn't you know? It's like the main perk of the job", "label": 0}
{"text": "yes. invite people wanting to murder you inti your house. and then act surprised…", "label": 0}
{"text": "Same with the US to some extent. They think they can roll into eastern Europe like the did Baghdad but the Russian army is a much different prospect to be up against.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Unsubbing. You’re all being willfully idiotic.", "label": 0}
{"text": "Is that woman putting a cigarette into the mouth of the man in the pic on the upper left?…inside the house with kids running around…maybe it’s good that times have changed.", "label": 0}
{"text": "Evil does not have to be rabid. It is like the United States always does. Come to a country, say you will be their friend, and just destroy it, enslave, violate and murder all their women and children with the sadistic evil genocider American grim on its face.", "label": 0}
{"text": "I dig the user name OP! I was a marin ragamuffin back when", "label": 0}
{"text": "The dumbest fucking false equivalency I have ever seen.", "label": 0}
{"text": "Zionism is a vile ideology that thrives on genocide and hate. It is entirely against the values of Judaism, which are: truth, justice and peace. Israel is an imperialist settler colonial invasion seeking to murder the people there to take their land, labor and resources for capitalist exploitation and tyranny. It has no standing in history, morality or fact to be called a \"state\" of any type.\n\nHere are 20,000 Jews gathered to denounce Zionism:\n\n[https://www.youtube.com/watch?v=s5o0QJ3xYVg](https://www.youtube.com/watch?v=s5o0QJ3xYVg)\n\nRabbi Weiss:\n\n[https://www.youtube.com/watch?v=7S17Fr8z\\_Oo](https://www.youtube.com/watch?v=7S17Fr8z_Oo)\n\nProf Avi Schleim:\n\n[https://www.youtube.com/watch?v=WTQOudBMf7Q](https://www.youtube.com/watch?v=WTQOudBMf7Q)\n\nRabbi Yakov Shapiro:\n\n[https://www.youtube.com/watch?v=E4\\_1dfp3tAM](https://www.youtube.com/watch?v=E4_1dfp3tAM)\n\n[https://www.youtube.com/watch?v=eye3eOaBGrw](https://www.youtube.com/watch?v=eye3eOaBGrw)\n\nGDF debunks Israel:\n\n[https://www.youtube.com/watch?v=sQk41nLuhGA](https://www.youtube.com/watch?v=sQk41nLuhGA)\n\nGDF: How ethnic cleansing created Isthehell:\n\n[https://www.youtube.com/watch?v=e9To\\_P8gX9c](https://www.youtube.com/watch?v=e9To_P8gX9c)\n\nuncivilized: Why Israel Was Created:\n\n[https://www.youtube.com/watch?v=8klRQ-zCVm4](https://www.youtube.com/watch?v=8klRQ-zCVm4)\n\nIsrael is nothing more than this: You have a house. Someone you don't know comes along as says someone else has the right to occupy your house. Obviously you object and fight them when they move it. But they call your actions terrorism and themselves victims when you resist, and your powerful neighbors actually help them do it. You can accept them taking your house or them killing you.", "label": 0}
{"text": "Imagine génocide being better than Trump. Now that says alot", "label": 0}
{"text": "Trump is for the same war, backing Israel:  \n[https://www.washingtonpost.com/politics/2024/10/25/trump-netanyahu-support-gaza-lebanon/](https://www.washingtonpost.com/politics/2024/10/25/trump-netanyahu-support-gaza-lebanon/)\n\nExplicitly against Muslims too:  \n[https://en.wikipedia.org/wiki/Executive\\_Order\\_13769](https://en.wikipedia.org/wiki/Executive_Order_13769)", "label": 0}
{"text": "Sounds about white", "label": 0}
{"text": "Serious question. Which war belonged to Trump?", "label": 0}
{"text": "This.. this is what we elect as a country. How to change this?", "label": 0}
{"text": "I live in Minneapolis and we have it for local elections only, but I'm hoping that allows it to gain traction to go statewide soonish.", "label": 0}
{"text": "I don't follow sorry, what do you mean?", "label": 0}
{"text": "She is the \"accepted third party\", the psl is not.", "label": 0}
{"text": "If this was 1934 Americans would vote for Hitler. And just like 1934, a genocidal war hawk will win the election, whether that is Trump or Harris", "label": 0}
{"text": "The part about the festival panel was really distressing, there's no criticism mild enough to escape zionist aggression", "label": 0}
{"text": "Washington Post is corrupt garbage with or without this news (an endorsement of Harris would be grotesque anyway).\n\nCan you imagine, that's where the Pentagon Papers and Watergates stories broke a few decades ago.  Now it's just neocon warhawk garbage.", "label": 0}
{"text": "The rich parasites decided in the 60-70's that working people were getting too powerful and devised schemes to smash and exploit them as much as possible.", "label": 0}
{"text": "Not every white family though, My dad's father was basically a 911 dispatcher before 911 was a thing, his mother was a secretary for the high school. Together they barely scraped by for many years.", "label": 0}
{"text": "Brat summer", "label": 0}
{"text": "They're extremely paranoid people will realize they usurped nearly an entire country and like the mafia cannot tolerate any dissent.", "label": 0}
{"text": "Yes they are very similar to the white moderates MLK talks about:\n\n[Letter from a Birmingham Jail [King, Jr.]](https://www.africa.upenn.edu/Articles_Gen/Letter_Birmingham.html)\n\n> I must make two honest confessions to you, my Christian and Jewish brothers. First, I must confess that over the past few years I have been gravely disappointed with the white moderate.\n\nIn terms of environmental activism, I think they exist regardless of skin color. At the same time, environmental activism is probably one of the biggest radicalization pipelines.", "label": 0}
{"text": "Based coconut pilled", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Voting in primaries will never fix the two party system, sorry but that's delusional. It will only ever be fixed from the bottom up.", "label": 0}
{"text": "People don't realise that while capitalism benefitted working people to a greater degree than it does now, Reagan and the neoliberals flipped a switch that basically cut off the bottom 99%. And they're still living in that dream world, thinking based on 100+ years of anti-socialist propaganda.\n\nThey also don't realise that even if you reset capitalism, it follows a natural path. The rich will influence politics with their money and in no time we'd be right back where we are. Capitalism cannot go any other route than to the rich hoarding wealth and exploiting the working class. We're not seeing a flawed version of capitalism that just needs correcting, we're seeing capitalism as it will always be.", "label": 0}
{"text": "They love working their employees to the bone, which produces more profit.", "label": 0}
{"text": "> I'm not talking about the skin color of individual activists\n\nI never expected anything else from you, sorry if that came across wrong.", "label": 0}
{"text": "That image should be amended to add the words \"If they were a middle class white man.\"", "label": 0}
{"text": "Jason Hickel: Why is Palestine at the center of the climate and colonial struggle? How are capitalism and the ecological crisis linked? Who really benefits from the exploitation of resources in the Global South? At the Transnational Institute's Ignite Festival in 2024, Jason Hickel argues that the Global North—the “Imperial Core”—is responsible for the excess emissions and resource extraction driving the climate breakdown. He believes that achieving economic democracy and sovereignty in the South is essential to dismantling the colonial power structures at the root of both climate change and imperial exploitation.\n\nSource: [https://www.youtube.com/watch?v=6dBy4-6pn1M](https://www.youtube.com/watch?v=6dBy4-6pn1M)", "label": 0}
{"text": "Good post but unfortunately it has been removed because it has already been posted recently:\n\n* [Submission link (posted a week ago)](https://www.reddit.com/r/LateStageCapitalism/comments/1g55snw/this_is_completely_true/)\n* [Direct image link](https://i.redd.it/nweaima1r5vd1.png)\n\n\n\n\n-----------------------\n\n*I'm a bot so if I was wrong, reply to me and a moderator will check it.*", "label": 0}
{"text": "If only we looked at how average Americans were living in the 1930s...\n\n\nIt's all coming back. I feel like life in America in the 30's is how the American economy is in its natural state.", "label": 0}
{"text": "Weird, it's almost as if deliberately neglecting your core constituencies depresses turnout and loses you easily winnable elections", "label": 0}
{"text": "You are being hated on but the truth is that humanity has always been motivated by fear and hunger and capitalism fed directly into that, and that is why we are doomed.\n\n\nHeck, I hate capitalism as much as the next poster here but it's not like I obsess over fairytale fantasies of what could be that will never become true irl.", "label": 0}
{"text": "Omg, I've never seen these", "label": 0}
{"text": "This is definitionally apartheid", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Ranked choice is the worst choice to change voting to. It's why so much money is spent on it. It's the least likely to help 3rd party candidates.\n\nSTAR voting is much better.", "label": 0}
{"text": "Khive only care about social issues that make them out to be the good person. They don't care about actually being a good person especially if it takes effort.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "While people are bringing up plenty of good points about how much of it is propaganda vs reality and how politicians killed whatever chance there was, an important thing to also point out is that this lifestyle was only ever a possibility for a certain *type* of family.\n\nThis picture was from the era of sundown towns, redlining, racial segregation, discriminatory housing covenants, legal gender and sexuality discrimination, and a whole host of other issues. If you were black, brown, Jewish, a single or divorced woman, gay -- basically anything other than a white cishet Christian nuclear family unit -- the chances of you getting a life like this was slim to none.", "label": 0}
{"text": "Plenty of videos here in Europe all over the news showing Iranian air defenses shooting down all Murican-Israeli Nazi missiles.\n\nYou probably won't see those on Murican news, or news on Murican colonies with a Nazi lying press, made of enemies and traitors of their own countries like in South America, the last place in the world where you still find people so devoid of honor and dignity they still like the US and want to migrate to that third-world hell the US has become, and live in some cardboard homeless slum in Miami \n\nAll news and even Internet searches in the West are censored, manipulated and are full of lies and alt-facts, invented by the US Fourth Reich propaganda machine.", "label": 0}
{"text": "I love how reddit took this down in the middle of watching it, when I keep seeing how much Israeli soldiers are suffering from committing genocide every day", "label": 0}
{"text": "[The article.](https://fox17.com/news/local/taking-a-bite-out-of-crime-sullivan-county-k-9-gets-titanium-teeth-caps-to-extend-service-life-cherry-point-animal-hospital-andy-cherry-k9-deke-sullivan-county-sheriffs-office-sgt-hunter-ford)", "label": 0}
{"text": "Not even counting the other trillion Bibi, his son, the far right politicians in Israel, AIPAC owned politicians in the US, evangelical pastors and the MIC lobbyists stole from American people.", "label": 0}
{"text": "National Religious Party and Otzma Yehudit, for example. Likud is more of a \"I don't care if Palestinian kids get in the way of our bullets and bombs\" kind of party. Those two are more \"we should be using our bullets and bombs on their kids\" kind of party.", "label": 0}
{"text": "“Service life” 🤮", "label": 0}
{"text": "very American of them", "label": 0}
{"text": "Hypocritical as fuck", "label": 0}
{"text": "I'm saying if I want to become a home run hitter I would rather study under Barry Bonds than under Bob Uecker. It's rather obvious to most people.", "label": 0}
{"text": "In order to \"improve\" the conditions of the people in this country, the lives of hundreds of millions of people around the world have been made miserable.   This is an economic reality.  Inputs into one system have to be outputs from another.  Those other  systems are resources stolen by imperial force and murder in nations around the world.  \n\nMoreover, this nation itself exists on land by means of the slaughter of some 50 million natives and built off the backs of likely that many African salves.  Indeed the lives of americans today are \"improved\" because hundreds of millions of other lives have been killed to do it.  So I do not find any argument that capitalism improves lives.  While some lives may be better, other lives have to be made worse to do it.  This relationship is the fundamental and fatal contradiction of capitalism.", "label": 0}
{"text": "It’s still possible… I’m 37 and a local truck driver, work M-F 9am-6pm, . Totally middle class and on 1 income. My wife stays home and our 2 kiddos 9 & 4 already have 2 semesters of college tuition each in an account. Oh and we have 2 cars (2019&2025). Life is nice in OKC. Move out of California or NY! And stop wasting money on door dash and Starbucks. Remember $40 a month for 18 years in an easy investment account will pay for college. Sure we aren’t rich but comfortable and happy. If you make $70+K a year in a decent city and can’t raise a family comfortably then you are stupid and waste a bunch of money. Stop blaming capitalism for your shitty decision making skills.", "label": 0}
{"text": "Accurate", "label": 0}
{"text": "I thought I was clear, but yeah.\n\nWhite people twist and skew their history to justify settler colonialism while playing the victim, hence these fairy tale images about a simpler past when everything was better and whiter.", "label": 0}
{"text": "If only regular Iranians and other peoples in middle wouldnt be caught in the middle and wouldn’t have to be made to suffer id actually be 100% ok with the US picking a fight it can’t win and then basically destroying itself.", "label": 0}
{"text": "It's a private company they can censor whatever they want.\n\n /s for those that need it", "label": 0}
{"text": "It actually really started with Nixon but ya", "label": 0}
{"text": "\"...parity that exists between countries militaries at this point.\"   \n\"...tactical dominance is based on air power and long range weapons that are becoming either obsolete or comparable to other states.\"\n\nWhen Starbucks baristas do defense analysis. 🤡", "label": 0}
{"text": "Americans should know what this means. Their tax money will go funding US war Irans through its proxy Israel", "label": 0}
{"text": "Just another trash propaganda rag owned by an oligarch.", "label": 0}
{"text": "as one once said, all dogs go to heaven and all cops go to hell", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Well I hope so. \n\nNot to malign this travel blogger as a journalistic source or anything, but I can't quite count it as fact yet.\n\nBut regardless. I hope Israel fails in its every military endeavor, and the nations and peoples it victimizes protect themselves as fully as possible.", "label": 0}
{"text": "I want the US imperialism to benefit me!😠", "label": 0}
{"text": "I think you’re understating and underestimating US military dominance. There is parity between most other countries, but the US military is in a league of its own.", "label": 0}
{"text": "Disgusting.", "label": 0}
{"text": "Afghanistan, Korea, and Vietnam proves otherwise.  We are also currently incredibly low on ammunition, and we don't have the capacity to create more on a scale would be needed for a war. Ya know, since we shipped most of our manufacturing overseas, for capitalism.", "label": 0}
{"text": "\"Its\"...  \"Service Life\"..... 😡😢", "label": 0}
{"text": "The intercept rate on Oct 1 was basically nothing. Something like 180 out of 200 hit.\n\nThis attack was really more like Iran's April attack, with a lot of slow moving drones/cruise missiles, which shows how behind Western missile tech is.", "label": 0}
{"text": "That's why Biden stopped using the cages, and didn't in fact put \\*more\\* kids in cages than Trump, right?! RIGHT?! /s", "label": 0}
{"text": "Canada trying to out-fascist the US, it seems.", "label": 0}
{"text": "What is apmh", "label": 0}
{"text": "Also see Industrial Democracy.", "label": 0}
{"text": "\"Best I can do is send you to the hospital with severe k-9 titanium-toothed officer injuries\"", "label": 0}
{"text": "This is happening in Tennessee??!! Wtf", "label": 0}
{"text": "\"point\"?", "label": 0}
{"text": "Why does the a liberated Middle East mean the end of Capitalism? If you end Capitalism in one spot so what? You need to end it around the globe to actually stop it. Look at Cuba. They ended it. Then they were sanctioned. Than the people get screwed, go hungry and are vulnerable. To me the US having an interest in the middle East is more about securing oil at a price they want than protecting capitalism.", "label": 0}
{"text": "I guess it depends on your definition winning.  For me a nation winning a war is defined by said nation controlling the geographic territory, commanding its economy, control of its political institutions.  So the US by that definition won he war with Japan\n\nIf winning is just reducing the opponent to ashes and then sure, US can win any fight with a few hundred nukes.", "label": 0}
{"text": "Dont we lose to farmers?", "label": 0}
{"text": "Didnt we lose to farmers?", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Yes, but zero ground would need to be held for the US to achieve dramatic goals militarily. They’d bomb every piece of infrastructure they wanted, every visible tank and aircraft and boat and missile silo. Every airstrip and refinery and munitions associated anything. And then they could say ‘mission accomplished’ NOT occupy the country, and go back to their home across the ocean. \n\nMaybe I’m the dummy that’s way underestimating Irans military. Israel and Iran maybe have the kind of parity in a protracted war WITHOUT US  involvement. But the USA and Iran are not in the same weight class in my head.", "label": 0}
{"text": "It's okay! Titanium is highly biocompatible so there's very little risk of an adverse reaction!", "label": 0}
{"text": "You are describing some kind of Unconditional Surrender as your victory terms, which is the most dramatic kind of victory achieved historically and really only applies to like the World Wars. Most wars have had much less dramatic victory conditions - like we won a few battles so now you pay us tribute for some agreed upon time. Or we won a battle so have a high ranking general hand a sword over in a ceremony and agree to these unfair trade conditions and we will built a fort on your coastline and call it a day. \n\nThe USA doesn’t need Unconditional Surrender to ‘win’ against Iran. \n\nAnd I despise American militarism, I just think you’re way off in your thinking on what a US-Iran war would/could look like.", "label": 0}
{"text": "Me too!", "label": 0}
{"text": "Which time?", "label": 0}
{"text": "Sorry, pretty sure Kamala made it clear that she's pro-fracking, and will continue to expand oil production, just like Biden did. Can anyone explain exactly why Trump would be \"even worse\"?", "label": 0}
{"text": "She sees you and she hears you.", "label": 0}
{"text": "Political labels are meaningless. \n\nJill Stein is the head of the f'ing GREEN PARTY and self-described climate activists are disavowing third-party voting.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "What’s wild is the extremists want exactly that! They want destruction of the world so their messiah can apparently come", "label": 0}
{"text": "It's called neoliberalism, and it's still happening today.", "label": 0}
{"text": "The US isn’t wrong to invest in planes though. It doesn’t need to launch medium range missiles, and Iran would be hard pressed to stop an F-22 squadron.", "label": 0}
{"text": "Refusing to do what you are told is often seen as an escalation. You'd have to let people violate your rights while they break the law and you still wouldn't be safe. Maybe in the future they will use police humans to do the work now assigned to police dogs and less people will get bit.", "label": 0}
{"text": "Depends on defining winning. If the US went on a war footing, it could  overwhelm Iran given the time to set up the several divisions and entire marine corps required to make a successful invasion. Which Iran would be throwing everything it had to hamper American staging areas in the area. Because there be no hiding mobilizing everything they have. And closing off the strait of hormuz. \n\n But it would take the entire standing US military to occupy Iran and conscription to be able to rotate out. And it would come at a very high cost. Iran being 4 times larger than Iraq with 4x the population and a huge amount of mountainous terrain. That's not happening without major consequences that I doubt the US public would be willing to absorb. \n\nTldr, madness indeed.", "label": 0}
{"text": "What the fuck? This is animal cruelty", "label": 0}
{"text": "Planes are incredibly expensive and largely good for bombing defenseless civilians. Stealth doesn't actually work esp against developed nations because it's not broadband, and the tankers necessary if they actually need range are even easier to shoot down.", "label": 0}
{"text": "While the US military has combat experience, it's experience as colonial police, always with an overwhelming disparity in firepower. They are fighting insurgencies and can call in airstrikes as needed. I don't know how many American soldiers would hold up to conventional warfare against a country like China.\n\nI remember reading an article not too long after Russia invaded Ukraine where they talked to an American soldier who went to Ukraine to volunteer. They had done multiple tours in Iraq and Afghanistan but were leaving Ukraine after a few weeks. They couldn't handle the constant artillery bombardment and not having air superiority.\n\nWhen it comes to China, I also don't think the American people could handle the economic impact of a war. So many Americans are pampered, spoiled babies. They lost their shit with the supply chain disruptions caused by the pandemic. That disruption would be a picnic in comparison.\n\nWhen it comes to Iran you're probably right, but if you look at the Millennium Challenge 2002 for example, it seems like it would really depend on how each side played it.", "label": 0}
{"text": "I don't know why you initially got downvoted for that. A lot of evangelicals support the genocide for that exact reason.", "label": 0}
{"text": "Coming from someone who may have had the most embarrassing political defeat in modern history.", "label": 0}
{"text": "Yeah my parents grew up in the 50s and 60s and they were poor as hell. 5 kids all using the same bath water. I was raised low income but at least we always had water on tap.", "label": 0}
{"text": "See how you point to a plane and say look how good the planes are?   Here's the issue with that.  Planes don't get in dogfights like the red baron anymore.  Its not about whether or not your plane is better than that plane.  Because something exists called air-to-air missiles.  Like the R-37 or the Kinzhal.  A fact of modern warfare is that a missile is much more direct and to the point instrument than a plane.  It doesn't have wings, and its powered by a rocket, not a jet engine.  So these missiles are as good at hitting planes as a plane is at hitting a boat.  Its just a better tool for the job.  These missiles can go mach 6+, and our fastest planes human kind knows how to make only go a little over mach 1.  That's why its a sight to see a plane break the sound barrier and cause a sonic boom, cuz it can just barely do that.  You're watching a plane at full speed when that happens.  So its mach 6 vs mach 1, missile vs plane.  Your plane being 20% better than their planes doesn't make it dodge missiles.  So it really isn't going to turn the tide.  You can't achieve air superiority unless you can get your planes in and out and control the skies.", "label": 0}
{"text": "If I recall correctly, that $320 million \"aid\" pier that sank was funded from the aid that the Biden Administration gave to Gaza. So, the US \"gave\" Gaza money and then used that money to build the pier instead of actual aid.", "label": 0}
{"text": "But that Cheney Republican vote is just too sweet to pass up. Hooo-weeee! Can you blame them?", "label": 0}
{"text": "Neither are anti-capitalist let alone socialist.\n\nThis is a socialist sub moderated by communists.", "label": 0}
{"text": "And that aid pier was used for a covert op, if memory serves correct.", "label": 0}
{"text": "Can someone please tell me this isn't real please?", "label": 0}
{"text": "Pure animal abuse. Get animals about of police \"service\".", "label": 0}
{"text": "Can somebody please share the link to this UN report?", "label": 0}
{"text": "The basis for all of it is violence.", "label": 0}
{"text": "Good job Iran! Either their air defences did an incredibly good job or the US really pulled Israel back from the supposed hell-storm that was warned.", "label": 0}
{"text": "Yup.  I think the overarching narrative of \"social progress\" is pretty half-assed.  We've moved forward on some fronts in the U.S. and horribly backslid on totalitarianism, in the last 75 years or so.", "label": 0}
{"text": "k", "label": 0}
{"text": "Evidence? Compared to the images we had coming from Iran's Oct 1 attack (despite military censor) there appears to be very little visual evidence that anything of significance (or anything at all) was struck.", "label": 0}
{"text": "Modification of a police dog should be illegal. I would also be interested to see the cost of these teeth vs. the cost of getting a new trained k9 unit, I'm sure the cost difference is there but it has a certain...evilness? to this whole situation.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, Liberals are like that.", "label": 0}
{"text": "Used to work at M$, it's a fucking shillhole garbage company. Completely unsurprised by this. Fuck that place and the ghouls running it.", "label": 0}
{"text": "How are people this ignorant still able to function in society? Serious question: How many car accidents have you caused?", "label": 0}
{"text": "No.\n\n1. You don't provide a source just the same talking point.\n2. Russia is not a paper tiger.\n3. Iran and their \"allies\" are not apartheid states comfortable with genocide.\n4. US military is huge but they can contend with it in certain contexts.\n5. They are not committed to corroding western countries from within with fascism, that's the West's own evolution from their own contradictions. They are building their own international institutions because the current ones give special privileges to the West.", "label": 0}
{"text": "You bring up some good points, especially about Americans being very uncomfortable fighting without an overwhelming disparity in firepower. But that’s kind of the entire US doctrine, fight with overwhelming firepower. It’s been that way since WW2. So yes Ukraine is unable to provide air and fire support at the same level as the US, that shouldn’t be a surprise. The US doesn’t go into a fight they think would be fair, militarily that’s just dumb, you want the odds and firepower stacked in your favor. You don’t spend almost a trillion dollars on the military and not get overwhelming firepower capability in return. \nAs for Millennium Challenge, that exercise was interesting. The simulated Iranians were able to cause incredible damage. But there were some notable inconstancies. The 2 that stand out the most to me was that “Iran” used missile boats that literally couldn’t not carry the anti ship missiles used in the simulation. The missiles were too heavy for the boats used. The 2nd was that they used motorcycle couriers to avoid communications being intercepted. Except in the simulation the couriers delivered the messages instantly like a text or email, not like someone driving a motorcycle from place to place.", "label": 0}
{"text": "What about people in a mental health crisis?", "label": 0}
{"text": "Yeah I’ve dealt with people ready for the end of the world my entire life. It’s incredible how they’ve spiraled in the past 5-10 years", "label": 0}
{"text": "Here's the full event:\n\n[https://www.youtube.com/watch?v=SacbcQsHnpo&t=0s](https://www.youtube.com/watch?v=SacbcQsHnpo&t=0s)", "label": 0}
{"text": "In before libs brigade and influences LSC sub opinion.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "My pleasure.", "label": 0}
{"text": "Well then a few people have most of the votes", "label": 0}
{"text": "The aid will be delivered in form of brand new pagers.", "label": 0}
{"text": "Thank you for the repost. This needs to be seen!", "label": 0}
{"text": "Serious question, do you think police never use excessive force? Many cops have also been evil criminals. I think good cops are fantastic people who do a job that we aren't all cut out for, one that I'm personally not equipped for myself, but we don't need boot lickers defending the bad ones and acting like they do no wrong.  Criminals shielded by a badge are bigger scum than regular criminals and they should be treated as such. \nTo the good cops reading this, thanks for keeping the streets safer for our kids!", "label": 0}
{"text": "My friend you are right that anti air missiles exist and are cheaper than pilots and aircraft. But you don’t account for a few things. To shoot a plane down with a missile, you first have to “see” said plane which can be difficult with stealth tech that the US and its allies use. Radars have trouble seeing the Western aircraft. This can be a problem because the first mission the US would fly against an Iran, Russia, etc would be SEAD. These missions whole purpose is to destroy anti air radars and missile launch sites and is a proven strategy historically. \nThen we come to the part about which planes are better. We can also point to the Wests advantage is sensor packages, stealth technology, engine capability, pilot experience and training. You said that it’s about getting your planes in and out, something the West has designed their airframes for. First you send in the advanced stealth jets and attack the enemies AA capability, then you send in the older non stealth jets to bomb with relative impunity. Obviously though this is describing a war scenario, things can be unpredictable. But at the moment the west has more airframes that are more than capable of dealing with Irans anti air network and air forces.", "label": 0}
{"text": "trading Money for Commodity for Money is bad;\n\ntrading Commodity for Money for Commodity is good.", "label": 0}
{"text": "I work at a small rural hospital and am on the board of directors. While at a high school football game I was having a discussion with one of the residents of this small town about completely shutting down the EMS service that provides coverage to the area due to budget issues. This is the last month the city will be able to afford to pay the EMS contract. \n\nWe were sitting in a brand new football stadium amongst the multimillion dollar sports facility. Baseball fields, softball fields, state of the art indoor football practice facility, gym and weight facility. This is for a school that graduates less than 40 students a year. \n\nThis person I was talking with was unironically asking, “how can we pay for the ambulance?!”", "label": 0}
{"text": "I mean this kinda shit happens everywhere", "label": 0}
{"text": "I always been curious. What exactly is the specific name of this extremist that want the \"Third Temple\" to be build?", "label": 0}
{"text": "It's real, and done from pigs to imperialist pigs.\n\nhttps://www.msn.com/en-us/news/us/taking-a-bite-out-of-crime-sullivan-county-k-9-gets-titanium-teeth-caps-to-extend-service-life/ar-AA1kRImu\n\nhttps://turnto10.com/news/local/rhode-island-state-police-k-9-officers-literally-leap-into-action-to-protect-and-serve\n\nhttps://www.treehugger.com/titanium-fangs-the-technology-behind-navy-seal-dogs-4868709", "label": 0}
{"text": "The gas alone wouldn't make it worth it let alone the four hour time sink they will have every time they would go to shift that day.", "label": 0}
{"text": "For it seems like he doesn’t get the meaning he just wanted to be nice and hand out the rose the other man dropped :/\n\nBut if not <3", "label": 0}
{"text": "Colon Colon Sabre? Or just Sabre? Sorry, I'm dumb and I don't know if I'm missing something", "label": 0}
{"text": "Implantats like these should only be used if a tooth is already damaged like a crown. Breaking down the teeth before injury will actually weaken a dog's bite and cause bite issues!!! \n\nMost police are not adequately trained or educated on dog handling and husbandry. The state with the longest required training is only 4 weeks before they are street-ready! That means any dufus who gets a k9 job can have a high drive dog to send to maul people even if their only experience with dogs and dog training is walking their girlfriend's matted mini golden doodle. \n\nMost teens at your local 4h dog training club have a better chance at handling a k9 safely than a \"trained\" k9 officer. I'd bet my house my dog is better trained than a police dog and we only do bite work and training casually.", "label": 0}
{"text": "Mullvad and Proton are good alternatives afaik", "label": 0}
{"text": "Thanks for demonstrating the cognitive capacity of your sort.", "label": 0}
{"text": "They ran bombing missions in Syria. When Wagner approached that oil field and were immediately deleted that was an F-22 squadron. They also don’t need to suppress air defense for themselves. Most air defense systems will have trouble getting to them. Both Iran and Russia were kept away from Kurds in Syria by F-22s.", "label": 0}
{"text": "Oh! So obvious now", "label": 0}
{"text": "This part! Democracy Dies in Darkness has been their motto since they ignored everything about Bernie’s popularity in 2015/2016. But now that it’s THEIR candidate, suddenly it’s a problem to Dems. Gimme a break.", "label": 0}
{"text": "Hey. I thought fascism would only get to Burgerland AFTER the election and Trump wins... What's happening there, libsisters?", "label": 0}
{"text": "i’ve had cops threaten to get their dogs out of the car when my exhaust blew lmao i had to talk them down", "label": 0}
{"text": "Check out his book, The Divide: A Brief Guide to Global Inequality and its Solutions", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This is a leftist subreddit, right wing comments will be removed and the user banned.", "label": 0}
{"text": "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.", "label": 0}
{"text": "So, now there not even letting the police dogs retire earlier, huh", "label": 0}
{"text": "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.", "label": 0}
{"text": "What if I told you those videos are from Iran's own channel, and your photo is sourceless?", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "They even don't want comeback to one day ago.", "label": 0}
{"text": "> What do the white states mean? Im in nevada so does that mean I cant vote for her?\n\nYes. \n\nYou can still support them financially or you can contribute and join the party.", "label": 0}
{"text": "It is crazy how easy it would be for Kamala to win, but her incompetence makes it impossible for any rational person to support her.", "label": 0}
{"text": "To the liberals: The \"Holodomor\" is a famine and did happen. No one is denying that. It just isn't a genocide like many people claim.", "label": 0}
{"text": "Their stealth is not an invisibility cloak, it reduces the effective range of radar systems. If they tried to fly over Iran it would likely result in the first f22 shoot down, especially given that Iran has had nearly 20 years to figure out a solution. \n\nThat bombing run completely outside its wheelhouse against an adversary with no means of intervention is not a proof of concept. They would need to get so close to drop the only kind of ordinance it can carry that it would easily get clapped by Iranian air defense. Yes it can run air superiority, but if the only threat you bring to Iran is the f22 you literally just don't need to send out aircraft.", "label": 0}
{"text": "Well that dog has more rights than you. System working as intended.", "label": 0}
{"text": "As a regretful veteran, I wish them all a very merry 🔻", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Those poor soldiers, especially the one who cried about driving over living civilians with a bulldozer. I feel so bad for them, having to live with the weight of being genocidal animals.\n\n/s if not apparent", "label": 0}
{"text": "Hack to get both rabies and tetanus.", "label": 0}
{"text": "Cops are kind of their own “class”. They are heavily protected, despite both being wealthy. Disproportionately powerful, considering their training is a mockery and they are frequently corrupt.", "label": 0}
{"text": "no, they are not.  this is a class matter.  they are the petit bourgeoisie.  Marx talked about class not too long ago.  So did Engels.", "label": 0}
{"text": "On one hand it feels like I should be more worried about the impending Wolfenstein future. On the other hand if Elon Musk is building the mecha-fascists I don’t think we have much to worry about.", "label": 0}
{"text": "“IT’S” service life tells you everything", "label": 0}
{"text": "Do you ever ask yourself why it's always the responsibility of the voter to do right by the Democrats and never the responsibility of the Democrats to do right by their voters?\n\nThink about it. This should be an easily winnable election if Harris simply caved to the anti-genocide vote. Do you really think that AIPAC money is more important to her than winning the election? I mean, it obviously is, but wouldn't that say more about her than third party voters?", "label": 0}
{"text": "Axios? Funded by Koch Bros? Suuuuure.", "label": 0}
{"text": "An Independent Palestine doesn't threaten capitalism. The constitution of the State of Palestine states that Palestine must become a free market economy that protects private property. It's downright neoliberal.", "label": 0}
{"text": "But this was true. The pictures aren't entirely accurate, but they're just illustrations. It wasn't all happy, but this was true for what's considered \"the middle class\" here", "label": 0}
{"text": "Yes, it's not about genocide, it's about sacrifice. Her gods require it, and her actions speak for themselves.", "label": 0}
{"text": "I appreciate you putting “Israeli” attack in parenthesis, considering the attack was launched from a U.S. military base in Iraq.", "label": 0}
{"text": "I support a free palestine, but I don't see how it would threaten capitalism in the Middle-East. I don't see the through-line there.", "label": 0}
{"text": "Good luck", "label": 0}
{"text": "I can understand training dogs to find drugs. But not to attack humans ffs. You will mentally damage this dog forever. But \"service life\" lets you know damn well they don't care about mental damage to the dog.", "label": 0}
{"text": "Canada: basically a grocery company, an oil company, a cell phone company, and a local chapter of the KKK in a long coat.", "label": 0}
{"text": "The genocide concerns and affects all of us. To say otherwise is to admit privilege.", "label": 0}
{"text": "Liberals who are ironically still quite desperate to fold themselves into all sorts of rhetorical contortions so that they can keep buying all the Harry Potter merch without having to admit that their little squee nostalgia dopamine bursts are simply worth more to them than anything resembling taking an actual ethical position. They watched their parents ignore the Chic-fil-a boycott so what choice did they have? Break the cycle of complacency like some sort of cringe weirdo creep?", "label": 0}
{"text": "Why wouldn't someone from Nevada — or other white states — vote for her? \n\n(From someone that doesn't live in US)", "label": 0}
{"text": "Modern day robber barons", "label": 0}
{"text": "Damn people from Alabama out here catching strays for no reason", "label": 0}
{"text": "Based AI", "label": 0}
{"text": "i'm old - i'd never bring a child into the world now.", "label": 0}
{"text": "\"Every worker member of the board!\"", "label": 0}
{"text": "Not sure how this video has anything to do with Kamala? Also this video is old. Not that Israel is different now, but what you're seeing here is a video from I I think before the Biden presidency. ", "label": 0}
{"text": "Mr. Evrart is helping me find my gun.", "label": 0}
{"text": "Different missiles, different defense systems.\n\nIn one of the videos circulating around the internet we see one a missile intercepted by these systems over Iran. So it definitely intercepted at least one.", "label": 0}
{"text": "Liberals moving the goal posts from \"Well if you think Biden/Harris is bad for Gaza, Trump would be worse!\" to Lebanon because Israel has destroyed Gaza and there's nothing left to destroy, and Biden and Harris helped destroy it.\n\nBoth Trump or Harris are going to allow Israel to do whatever they want. We are at maximal support for Israel on this genocide and these cries of \"Trump would be worse\" are just the most cynical pieces of shit in the world.\n\nYou don't care, you never did care, and you never will care about the monstrous things the US has helped do.", "label": 0}
{"text": "In every case don't, cut these people off from meaningful social interaction and love/sex.", "label": 0}
{"text": "It's Claude. \n\nI don't think other AI like copilot or chatgpt would give the same answer. Their answers really depend on what kind of data they were trained..", "label": 0}
{"text": "The Rachel of 2018 was angry there was a Cheeto in the White House while the Rachel of today is busy at brunch and trying to compromise her way through another election so she can stay at brunch", "label": 0}
{"text": "You don't know that what they said is untrue. You have no evidence to the contrary.", "label": 0}
{"text": "Sampson protocol. If I’m not mistaken, they have nukes aimed at every major industrial nation with the intent of destroying the entire world of they are attacked.", "label": 0}
{"text": "That is part of diplomacy you stop blocking cease fire agreements and the hostages go home but not only the Israelis also the thousands of Palestinian hostages that the state of Israel has and is torturing and rap*ng everyday", "label": 0}
{"text": "Elections are near both major parties are doing rallies pick one", "label": 0}
{"text": "Dems are yapping about democracy while suing our democratic choices of the ballot. They’re just as much a threat to democracy as republicans.", "label": 0}
{"text": "The true terrorists. \n\nThat is so fucked up. This is one thing that exemplifies the vicious wickedness evilness of the state of Israel", "label": 0}
{"text": "My man realized he said to much", "label": 0}
{"text": "Pls may the dog turn back on these fuckers", "label": 0}
{"text": "You were correct up until our weapons capability. We’re two leagues above any adversary for stealth strikes and hypersonic capabilities. We’re so far ahead, we allow Ukraine to see a few photos and they successfully sunk russian ships, bridges, airports, and even Moscow herself.", "label": 0}
{"text": "Hey you forgot to mention our blood sucking landlords and condo flippers.", "label": 0}
{"text": "Is this capitalism though?", "label": 0}
{"text": "Sure sure, but you know which ones are marching under the literal nazi flags. I'm asking legitimately if there is a source for counterprotesting and such.", "label": 0}
{"text": "Smile for me, babe.", "label": 0}
{"text": "That poor fucking dog", "label": 0}
{"text": "In most cases, anything they haven't spent by the end of the fiscal year gets removed from the next year's budget, so they have to spend it all in order to keep their budgets from decreasing yearly. It's a terribly broken and backwards system", "label": 0}
{"text": "Thank you.", "label": 0}
{"text": "oh god XD", "label": 0}
{"text": "Why the downvotes?", "label": 0}
{"text": "https://imgflip.com/i/97zof6", "label": 0}
{"text": ">it really sucks that it could split the dem vote.\n\nThats the point", "label": 0}
{"text": "Im just gonna say it we had about 7k deaths in the war on terror but they had like 6k", "label": 0}
{"text": "You can't \"counter march\" with just you and a few friends, they'd eat you up. Best suggestion is to just join a local anti-fascist group, when there's a fash rally coming up they will notify you to show up. You need organisation and group, turn out number matters. The IWW's GDC is easiest outlet for you to participate without going through other vettings.\n\nIf you wanted to just monitor their activities, use Twitter and search for keywords like \"rally\", \"protest\", \"march\" and search for tweet location.\n\nUse tools like this:\n\nhttps://www.heavy.ai/demos/tweetmap\n\nhttps://birdhunt.huntintel.io/", "label": 0}
{"text": "Not for no reason lol", "label": 0}
{"text": "Zionists when they claim “no apartheid”", "label": 0}
{"text": "Rhode Island, Ohio, and New Jersey are the only three states in the United States where incest is legal, with Ohio's exception of only criminalizing sexual relations with a parent.\n\nSoooo…", "label": 0}
{"text": "You know we gotta do this - all those truant kids will turn to crime. Plus all those poor kids being born because \\*abortion laws\\* are obviously all gonna grow up criminal. Might as well get them while they are young.", "label": 0}
{"text": "[Israel strike crippled Iran’s missile production](https://www.axios.com/2024/10/26/israel-strike-iran-missile-production)", "label": 0}
{"text": "So many things to say, let me start with - why put the poor boi through that, let him retire and chillax.", "label": 0}
{"text": "Sup", "label": 0}
{"text": "Proof cops enjoy torturing and killing", "label": 0}
{"text": "I always love lib Canadians looking down their noses while they pay $7k/month to live in a Vancouver condo built on a Residential School burial ground and pay $25 for a twelve pack of PBR.", "label": 0}
{"text": "Wait how do I get these for myself?", "label": 0}
{"text": ">You vote with your wallet\n\nMe when i'm a billionaire and can vote 3847x times more than the average joe :", "label": 0}
{"text": "F22s do mission planning and plot their flights to be most effective. They then shoot these systems from afar and take them out. \n\nAt the end of the day we’re entirely guessing, because nobody actually knows what the f-22 can do. But Israel did waltz right through Syria using the F-35I against the S400 and S300. \n\nI personally don’t think Iran would be a huge problem for the United States, given the report that came out that should China and the United States go all out it would result in a phyrric victory for the United States.", "label": 0}
{"text": "> Why wouldn’t someone from Nevada — or other white states — vote for her?\n> \n> (From someone that doesn’t live in US)\n\nBecause they didn’t make it in the ballot in time and they need more signatures than they have volunteers.", "label": 0}
{"text": "Dropped CGPT almost a year ago now for Claude", "label": 0}
{"text": "Or they'll just airlift and drop some old  expired MRE's from 2003 and call it a day.", "label": 0}
{"text": "Not everybody can afford or has the capability to just uproot their entire life and move to a different country. Nor do different countries just allow anybody in super easily. But thanks for letting us know how “easy” it is to avoid this", "label": 0}
{"text": "Western source quoting unnamed Israeli sources is not what I would call trustworthy", "label": 0}
{"text": "Unless the K9 handler abuses the dog or left it in a hot car. Then it's just an unfortunate accident", "label": 0}
{"text": "Average liberal reading the AI's response: \"Well, it's complicated\"", "label": 0}
{"text": "Zionism is not the answer to antisemitism but its mirror image: Jewish supremacy and the oppression and killing of non Jews.", "label": 0}
{"text": "Cops and arrests of the populace funnel bodies into the for-profit prison systems in the US, which maintain their profitability by in part lobbying for laws that will continue or grow their supply of detainees.\n\nThe police force in the US is the boot and tuncheon to protect the capitalist power hierarchy, and they murder with near-impunity.", "label": 0}
{"text": "Yeah I think that’s overstating it. They aren’t nuking France if they’re losing to Iran.", "label": 0}
{"text": "It's a country ran by madmen.. All we've heard regarding Russia, China, etc, it's really about them", "label": 0}
{"text": "\\> the us clearly had no wish to tag along this time.\n\nWe don't really know that. They say they don't, but that doesn't mean much, they just say what we want to hear.", "label": 0}
{"text": "Better sources than Twitter", "label": 0}
{"text": "no...? US and israel intercepted about a hundred between the two of them...", "label": 0}
{"text": "All that with those few hits? In a country as vast as Iran? Sounds extremely far-fetched. I would not believe everything the genocidal entity says.", "label": 0}
{"text": "Genuinely wouldn’t surprise me, but also someone In The crowd in range of the shooter ended up getting hit and dying. I absolutely believe that the GQP would sacrifice one of their own brain dead drones, I think it was more of the outcome of republicans draining the resources to line their pockets and the general “who gives a fuck” sentiment left the secret service lazy enough to let something like that happen.\n\nIt absolutely could’ve been an inside job, but the sloppiness of the shooter makes doubt it.", "label": 0}
{"text": "Presumably it is cheaper per year of service to do this as opposed to training a new dog, so we're coming out ahead here (assuming we want these dogs at all).", "label": 0}
{"text": "Since there are no federal laws regarding gender affirming care for trans She must be referring to following the 500 antitrans laws that Republicans have passed over the last few years. That sounds transphobic.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Your post was removed because it contained a racist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](https://weeklysift.com/2015/06/29/slurs-who-can-say-them-when-and-why/). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "mind you Israels attack utilized air launched ballistics...\n\n\"best are quite good\" ...they are credible but they dont have maneuverable reentry vehicles, their only maneuvering capability is to correct reentry angle. If iran believed your nonsense about \"missiles are better than planes\" they wouldnt be spending millions and mountains of political capital to get su-35s\n\nNo ballistic missiles are not \"more effective than planes\" they cant control airspace, not to mention the payload discrepancy. take the f-35, in a permissive environment can throw 18000 pounds of warheads at you. Irans largest ballistic missile can only deliver \\~2600. You can only launch as many missiles as you have launchers available, for iran thats somewhere south of 300, across all types.  Meanwhile all a plane needs is a fucking highway and it can put a warhead on you.\n\nyes western doctrine is based on air superiority...", "label": 0}
{"text": "You act like the plan would be to just fly planes over air defenses and hope for the best...no.\n\nAir war is built off of shaping operations, its not won in a day. Air operations use Jamming, and Anti radiation missiles to gain a foothold against air defenses, from there tankers, naval support assets, and AWACS platforms can move in to support air  operations", "label": 0}
{"text": "From a fellow white guy, this made me LOL", "label": 0}
{"text": "That's rude.\n\n  \nPigs have more use than cops. Most people like bacon, and pigs can be great pets. Not sure you can say that about cops.", "label": 0}
{"text": "she is specifying that she will not help the trans people being subjected to genocide in USA if she is elected, that like Biden, she will continue to allow states and schools and such to do as they please.\n\ngenital inspections for kindergartners? it's the law! pull out your junk, kiddos!\n\ngovernor wants to take away your kids because you respect their gender? it's the law! your daughter's new name is \"Frank\" and her new parents will only call her \"He/Him\" pronouns!\n\noh snap, you're not even trans but you wanted an abortion? it's the law! die of sepsis when the dead fetus festers inside you!!\n\nkamala is going to allow Project 2025, all republicans have to do is pass it state by state.\n\nIt's The Law!!!", "label": 0}
{"text": "and now shes telling you to shut up", "label": 0}
{"text": "This sub has become 100% anti-Dem posts all day every day. This is just annoying AF.", "label": 0}
{"text": "Someone call the ADL!", "label": 0}
{"text": "Ah I see. So they said their “rocket fuel refineries, drone factories, early warning and air defenses were destroyed“, like you claimed? really? lol Come on dude.", "label": 0}
{"text": "And guess what the election in four years will be... Take a fucking guess... ", "label": 0}
{"text": "It’s called manufacturing consent for these ideas. But if your white, they’ll come for you last, so don’t worry about it", "label": 0}
{"text": "Harris stated clearly that \"she would follow the law\" and made no effort to indicate any support for LBGTQ people.", "label": 0}
{"text": "It doesnt. too big. likely in the situation the raptors and/or some lightnings would be flying full Air to air loadout CAP while the F-35s handle the ground strike.\n\nYes a single harm will not totally destroy a air defense battery, but it can disable or destroy modules of the battery be it radar, powerplant, or launcher.  precisely what it did to patriot in Iraq", "label": 0}
{"text": "I wonder how the libs feel about this.", "label": 0}
{"text": "Idk, I haven't seen the tweet. I clicked on this page because I was hoping to find something reliable like a video (there seems to be one, but I haven't seen it).", "label": 0}
{"text": "[‘cause man’s best friend won’t put a bullet in your head but a cop fuckin will!](https://open.spotify.com/track/4guEJ92ENLEVQfefWJC0CZ?si=QyFlt3SoSbOZharIT-eWSQ)", "label": 0}
{"text": "And the few instances where dogs were often used by police it was tracking dogs like bloodhounds, meant for finding people, not trained to attack and maul criminals.", "label": 0}
{"text": "Proudly early-voted for Claudia yesterday, though I had to write them into my ballot. ✊🏼", "label": 0}
{"text": "It’s not in US interests as far as war casualties and morale back home after forever wars. I also don’t see how Israel goes to peace. Majority of Americans don’t want civilians killed or a larger war. I’m also pretty biased because of USS Liberty. \nUS state department definitely doesn’t have an iron grip on what the Israeli government does though.", "label": 0}
{"text": "German shepherds were originally bred to herd animals for shepherds, but still, its telling we use the same breed that they deemed most fitting.", "label": 0}
{"text": "“bloo no matter hoooo”", "label": 0}
{"text": "Im sure it will be cancelled in about 10 years, when the next world war drops.", "label": 0}
{"text": "And a hot one too............anyways", "label": 0}
{"text": "Wild how you're being downvoted when this is a good question to be asking. Seeking knowledge is the only path to good progress in this world.", "label": 0}
{"text": "I actually thought she was gonna say Yes lol.\n\n..but then I watched the video and realized she's just a regular, garbage Democrat candidate. And you may as well just let Trump win and run everything to the ground at this stage, because it makes no difference.", "label": 0}
{"text": "I support that. Make them outsiders and ostracized in society as they damn well should be for their actions", "label": 0}
{"text": "\"I'm a cold, unfeeling computer program, and even I think what they're doing is pretty fucked up\"", "label": 0}
{"text": "Hey, I mean it’s *technically* possible that each election just keeps getting more important, therefore making each of these statements true. And as we all know, the technical lack of pure logical impossibility is the most treasured modal situation of all.", "label": 0}
{"text": "Already saw it on this very sub. Saying that \"We all know that Kamala is a big trans ally who's going to do so much for the trans community (evidence: she chose Tampon Tim as her running mate). She just has to lie and pretend to be transphobic in order to win the election. We need to be understanding of that and trust that she'll do good things for trans people once she's in office.\"", "label": 0}
{"text": ">liberals to feel good about themselves without actually accomplishing anything\n\nAnd the worst part is they accuse us of this instead. It's projection, I've even seen it in this very sub. For example us refusing to endorse Kamala is apparently an example of this.\n\nLiberals are morons", "label": 0}
{"text": "Any state or government, by its very nature, is a monopoly on force. The dogs wont make a difference if it comes to that lmao", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "Hamas does not negotiate", "label": 0}
{"text": "A superb analogy.", "label": 0}
{"text": "Bro is spitting facts...", "label": 0}
{"text": "\"unfortunately, the country is still very transphobic, Kamala might lose if she advocated for your right to exist,\". ", "label": 0}
{"text": "A lot of self gratification going on IYKWIMAITYD.\nVote for who might make things marginally better, if that's your take, and organize and keep fighting. Opting out is intellectually and, practically speaking really lazy", "label": 0}
{"text": "That depends what anime your trying to convey. If it’s Dragonball (Rest in power Toriyama) then it’s plot armor. If it’s Watamote then not really", "label": 0}
{"text": "This lifestyle only existed because Europe was obliterated at the end of the Second World War, and due to their isolation in the industrial revolution America pretty much had every industry able to resume production. Flooding Europe with American goods and thus fuelling the mass American Corporation stranglehold we have today", "label": 0}
{"text": "If they want our vote, they should fucking earn it by having positions worth voting for", "label": 0}
{"text": "I'm not helping anyone win, I'm not even American. Just sincerely, from the bottom of my heart, fuck you to every American who's willing to show electoral support for either candidate backing a genocide of brown people, because you decided that two million Palestinian lives is a price worth paying for getting a slightly slightly less far-right leader for your country. And then goes to bat for their genocidal leader and shaming anyone for whom genocide is a deal breaker. It's attitudes like this that have kept you comfortable being complicit as your country ravaged through the world, and continues to threaten it with war and genocide, and I cannot look forward more to the day when the rest of the world can live their lives without having to worry about America.", "label": 0}
{"text": "Who knows, maybe they made a veiled threat to sick the dog on them if they didn't comply. Cops just loooovvvee tossing out little violent innuendos when they want you to do something unethical. \"Yeah, you should really just do the procedure. I can have him show you why it's necessary, if that will help make up your mind.\"", "label": 0}
{"text": "I use Mullvad myself. One of the only VPNs that actually takes privacy and security serious and isn't owned by some large conglomerate.", "label": 0}
{"text": "yes thats the problem, you are taking platforms in a vacuum which will never happen.", "label": 0}
{"text": "and thats why we shoplift", "label": 0}
{"text": "Meanwhile, the vast majority of voters are in deep color winner take all electoral states", "label": 0}
{"text": "How do we grassroot a third party?\n\nNow, Today, with extreme prejudice to the establishment.  \n\nI'd we wait until December,  then wait another 4 years.", "label": 0}
{"text": "They save the adverse reaction for when you get the bill. \n\nAnd then another bill from some testing site they sent samples to. \n\nAnd then another one from …", "label": 0}
{"text": "This is a Socialist sub.. lol", "label": 0}
{"text": "These people are ghouls. Every single one of them. Only we can free us. The only language they understand is violence.", "label": 0}
{"text": "Reminds me 6 the film \"The Candidate\". Providing the least amount of commitment as possible to somehow try and sound progressive.", "label": 0}
{"text": "Boi, thats a ton of assumptions in that first sentence, culminating in a projection from hell. Thanks for the sources though.", "label": 0}
{"text": "Democrats are clueless how much greenhouse gasses their proxy wars around the world are giving off. They could talk all day long about climate change while supporting the world's largest contributor of greenhouse gasses.", "label": 0}
{"text": "It's called critical thinking, one thing leads to another.\n\nIt's obvious that you aren't organised, else you wouldn't ask how to get back, because if you were your groups would have given you idea.", "label": 0}
{"text": "Fucking LOL.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "Every day is the most important day of our day", "label": 0}
{"text": "Wooferine", "label": 0}
{"text": "If 95% of what you do is talk about Dems, you’re not the radical leftist you think you are.", "label": 0}
{"text": "No shit, that's more or less the original point. An f22 squadron isn't a threat because there isn't any situation where they're going to be used in Iran in any role other than air superiority. Them going in alone makes no sense doctrinally. You should say that to the other guy", "label": 0}
{"text": "dems and conservatives = same shit, different toilet", "label": 0}
{"text": "First half was good. Second half was republican bs.", "label": 0}
{"text": "I'm guessing che had some hot bowls.", "label": 0}
{"text": "It's pronounced Korn, one of the greatest nu metal bands", "label": 0}
{"text": "Far more people will vote libertarian. A dramatically greater sum will not vote at all - likely exceeding the numbers who vote for either Trump or Harris. People who are voting third party don’t accept mass murder and those who lie about and cover for it and that’s 100% undeniably a good thing. You’ll never get their votes when you provide material aid for a genocide. What are you even thinking.", "label": 0}
{"text": "Somebody has to hold your politicians accountable. liberals sure as fuck won't do it. Democrats have officially become normal Republicans.", "label": 0}
{"text": "You are unfortunately", "label": 0}
{"text": "It's a shame that there's not a mass movement to organize in the ways we need. I'm getting tired of being dog-piled for pointing out clear flaws that I know the very same people will be bitching about in 2 months.", "label": 0}
{"text": "Even if she wins this time, she will be a one term president. She will not be able to keep any of her promises. \n\nYou are going to get some Republicans ghoul like Tom Cotton as the next president in 2028 because people will completely give up on the Democrats.", "label": 0}
{"text": "Both choices are disastrous and savagely murderous.", "label": 0}
{"text": "Network admin here.\nI would recommend NordVPN because Switzerland doesn't have treaties with anybody and is neutral other than that the only way to really be safe is create a VPN server in a country of your choice and then connect to it.", "label": 0}
{"text": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*", "label": 0}
{"text": "This is the DNC line about gays in the 2000s. She is such a milquetoast, say whatever she thinks will get her elected wayse of space.", "label": 0}
{"text": "One second they're a weapon, but if you strike them in self defense they're \"officers\".", "label": 0}
{"text": "\"Case is important\" wtf\n\nWhat half baked voter suppression system uses case to determine your intended voting preference and presumably says it is invalid if you use all uppercase? That is crazy.", "label": 0}
{"text": "I didn’t. Already voted for Claudia", "label": 0}
{"text": "Damn...  I guess since she can't stop the genocide since the Majority of Americans are zionist, and that's a obviously lost her every leftie vote, she's going hard for middle conservatives because the rightwing that aren't in the cult kinda hate trump.  Kinda sucks that she's building a platform to market to the worst we have to offer", "label": 0}
{"text": "Pretty hilarious given the many videos of literally every missile hitting, not that anyone is accusing your sort of grasping basic reality.", "label": 0}
{"text": "There's literally video of slow moving drones getting shot with AA, even if your lot will just deny those too.", "label": 0}
{"text": "I can’t tell if they know they are lying or they’ve just been taught all that throughout their lives. To be deluded and believe that it is their land with no evidence to support that and to look at Palestinians as inferior savage beasts. Idk if they know that it’s THEM who are doing the slaughtering and bombing.", "label": 0}
{"text": "I'm not an american but wondering isn't there in the US people are free to go to a doctor and change their gender as they want -- except some republican states I guess? Why trans people are upset about what she said and what change they want from Kamala?", "label": 0}
{"text": "Nothing false statement were made. All were true, it is clear that the consequences keep increasing. Have we ever had a candidate threaten to fundamentally change government power structure and openly threaten retribution?", "label": 0}
{"text": "I love how this is the first thing this sub thinks of... it's not wrong.", "label": 0}
{"text": "You literally just parrot morons who think stage separations all around the same point are interceptions (Israel can't even launch 60+ arrows all at once given it's about all they have).\n\nMaybe take some time to ponder if understanding anything is meant for you.", "label": 0}
{"text": "She just said it's up to a Dr. 👀 She didn't say it was up to the person, to decide for him or herself.  Jfc this is BS. No wonder I'm sitting here going, wth do I vote for, Trump, or someone backed by the Cheneys. 👀", "label": 0}
{"text": "separations dont happen in the terminal phase of a ballistic flight path. which is where in atmosphere interceptions occur.", "label": 0}
{"text": "RemindMe! 10 days", "label": 0}
{"text": "no, that is not how the USA system works. it is quite onerous and extremely costly for adult trans people at the best of times, care is outright inaccessible for trans kids unless they have supportive and wealthy parents, and in literally half the states transition has been outlawed to some degree.\n\nwhat kamala is refusing to help with are the laws outlawing transition. she said that the law is the law. people want her to fight those bigoted and genocidal laws through her political power, but she has steadfastly refused.\n\nhope this helps.", "label": 0}
{"text": "Switzerland's \"neutrality\" usually just means they'll do business with everyone equally", "label": 0}
{"text": "Arrows (which are the only ones that might work) are literally for exoatmos intercept. Again, just ponder why you strongly qualify for dunning kruger posterchild.", "label": 0}
