{"text": "riven just gets countered by a decent gragas, not much you can do if he doesn't fuck up", "label": 0}
{"text": "*ANGY MUTE NOISES*", "label": 0}
{"text": "Thanks, sir. I wasn't expecting to see this champion here.", "label": 0}
{"text": "We're competing with china and korea for extra seeds not EU, as China and Korea are the ones with 4 seeds right now. Until we outright outperform china or korea we wont be getting an extra seed cause Riot would have to take a seed away from them and give it to us, the seed doesn't magically appear out ouf good will.", "label": 0}
{"text": "Looking forward to see how the team is but ppl are really living in the nisqy-blaber period huh. Look at LEC this year, guy regressed a lot. Sure shittier situation but he can’t dodge blame forever. And worlds, well the record speaks for itself but I get ppl will think too optimistically for the better days. Sometime it works out and reddit likes to memory hole the lot more times it doesn’t.", "label": 0}
{"text": "Played with a 7.5 million mastery riven a few days ago. Just the fact that they have 7.5 million points was intimidation enough and I sure as hell let the enemy team know it. The Riven ended up with something ridiculous like 15/2/6.", "label": 0}
{"text": "I'd say that just colouring the new values instead of while damage number would work better - so an ability would have only its ap scaling green if that was buffed, with the rest being white. Or if they change something that, let's say, early mana costs are higher but later they are lower as you put points into the ability - first numbers would be red, latter green, and middle one probably white.", "label": 0}
{"text": "Please review [our rules](https://www.reddit.com/r/leagueoflegends/w/subredditrules) before commenting or posting again. Further offences will lead to a ban.", "label": 0}
{"text": "i feel like new yun tal is very solid for yas/yone's first item when combined with the bork nerf?", "label": 0}
{"text": "Let’s look at Faker’s achievements in the same timeframe (starting Summer 2018, when Chovy debuted in LCK):\n\nLCK splits participated in: 13  \nLCK finals reached: 9  \nLCK titles won: 4  \n\n\nSo Chovy made a whopping 1 more LCK finals than Faker while winning the same number of titles. Damn he’s so much better!!\n\nShould I remind you that until this MSI, Faker has outperformed Chovy in every single international that they both qualified for? But surely Chovy is MUCH MORE CONSISTENT than faker right?", "label": 0}
{"text": "I mean don't really disagree but that borders on hyperbole and is counterproductive. It's trivially true because every drink consumed increases some risks by a strictly positive amount, but the excess risk from small amount of recreational drinking (1-2 drinks / week) are close to zero. The top 20% of drinkers, however, have a very unsafe level of consumption.", "label": 0}
{"text": "he is a cheese pick hoping for the opponent to not know how to play against him in most cases.\n\nin some matchups he can be ok though, even in high elo.", "label": 0}
{"text": "wr51% isnt the same", "label": 0}
{"text": "You have to look at his teams for the 8 years though, not all experience is equal\n\nThis situation is very new for him for instance", "label": 0}
{"text": "Shouldve been cut months ago", "label": 0}
{"text": "Oh yes, comparing a country of 300 **million** with vast opportunities to a relatively niche eSport where there are only **50** spots at most to compete is so valid :v\n\nNA was legit. Franchising and import rule killed it. There are no more c9s, there is no chance for them, and when half the fucking spots are filled with mediocre imports looking for a quick Band-Aid fix instead of attempting to utilize home grown talent what do you think is going to happen?? There's literally no upward mobility via merit and Riot artificially killed it.\n\nYou literally argued with a guy who gave you direct proof of how unsuccessful and ubiquitous imports are.\n\nYou're living in a fantasy land.\n\nAnd no, it's not MAGA to want someone from your region to represent your region, who walks and talks your culture, instead of B-rate imports where I could just watch LCK instead.", "label": 0}
{"text": "Always flabbergasted by the singed ban\n\nBruh, im mentally locked in, i got a plan, it aint gonna work on another champ", "label": 0}
{"text": "It’s not really a problem if you’re a tank player because you’re fine with handshaking the lane ", "label": 0}
{"text": "Always depends on what you are against, against something like Draven you probably just have to surrender the lane and pray.", "label": 0}
{"text": "Can you guys nerf hearsteel on aram? Every match has 4 people buiding it no matter what class they are, its just too broken and unfun.", "label": 0}
{"text": "Why should they not care about ewc? Its an international tournament with serious prize money. TES and T1 took it seriously.", "label": 0}
{"text": "Why is it Riot’s fault? Maybe blame the players instead for not being able to beat T1 and Faker. Narratives can’t be forced, it has to grow naturally", "label": 0}
{"text": "Right now skarner has a 50.5% wr and a 5.5% playrate...", "label": 0}
{"text": "I mean, flowers, Kobe, jatt still stands. What’s the chick that talks weirdly? The black dude always trying to make everything about himself. Idk man.\n\nI miss the old days of month and doa tbh", "label": 0}
{"text": "It's so punishing that its being abused in almost every single game and completely ruining the viewing experience for anyone trying to watch real top or bot lane gameplay. Take of the century right here.", "label": 0}
{"text": "Yeah that's fair why adcs get the most, I totally agree they probably should get the most... I just think it should just be a bit more even... And also I feel you chose the most niche other class you could've.  \"Mages\"(as in AP users whether actual mage like say Syndra, or assassin like Fizz, or other mage like Brand, etc) and Bruisers each also average around 2 per game once you account for their presence in multiple roles. And such.", "label": 0}
{"text": "I think it might just be he will need to focus on family for a bit. Coming in first and leaving last every day has an impact on things outside of work. \n\nThe good news is he has several months now now before the grind starts again. This is what happens when you're becoming the best in the country and looking to be the best in the world.", "label": 0}
{"text": "Those singed bans are just Caps spamming soloQ", "label": 0}
{"text": "He is Much easier to play against if you spend time playing as him. Though that goes for all Champs. \n\nI think of him as a bursty assassin. He wants to find the perfect intersection of your health with his max burst. Then he will burst all over you, preferably starting with E, flash+E, or R. Not uncommon to start the fight with W either especially if you're fighting on top of minions. If he runs off a bit he will heal fast and be back in the fight quick, but he's usually too dangerous to run down thanks to his E and R. If he's under his turret and you're near his turret, do not be near his turret. He can and will make you take a ton of tower shots with R+E+slow.\n\nFighting him with the same strategies he uses, if you have the cc and sustain for it, is a good option. Anivia, for example, can stun, hit hard, and zone him pretty well. He will also struggle early to kill your eggnivia, assuming he full bursts to kill you.", "label": 0}
{"text": "Its a must buy on Jungle Teemo and its still just a good item for Teemo in general. At the end of the day, he's still basically an AP Marksmen. Since Nashor's is still an AS + AP + AP Scaling On Hit item, then its still good on him.\n\n[https://u.gg/lol/champions/teemo/items](https://u.gg/lol/champions/teemo/items)\n\nI don't think there has been a time where nashor's hasn't been good on him. Its THE AP Marksmen item. Its basically always going to be good on him. Maybe there will be items that are 'better' (Like Pre-nerfed Malignance), but Nashor's Tooth will rarely (if ever) be a 'bad' item on him.", "label": 0}
{"text": "A ***reddit*** user asking about what's wrong with twitter user. Truly a reddit moment here. haha", "label": 0}
{"text": "K’sante fucks on him if you can play him", "label": 0}
{"text": "The main frustration against Gragas as a melee top laner is he has really reliable poke & disengage so he essentially controls when he wants to engage with any melee champ.", "label": 0}
{"text": "Holy shit I forgot abt that 💀", "label": 0}
{"text": "you do know chovy’s biggest criticism is that for his accolades in lck, he does nothing at worlds? Everything I said is in regard to worlds, you know the biggest stage with the most eyes? How do you get more fans? Make big plays at worlds. If chovy put the team on his back down 0-2 do you know how much more known and popular he would be?", "label": 0}
{"text": "Then just call it an all-stars title? Why do you have to call it something else", "label": 0}
{"text": "Yes they failed to predict that a benching at the start of the year would prevent them from going to Worlds 9 months later.\n\n>So until they fix the scoring system in LEC, Coaches will always have less power than they should, out of fear of benching a player and then not making Worlds 9 months later.\n\nWhich is what I said... If the scoring system is different they don't need to predict 9 months in the future about, and can discipline their players early on so they listen to calls, learn something, instead of playing babysitter.", "label": 0}
{"text": "Tahm Kench mains are built different 😅 hopes he recover well!", "label": 0}
{"text": "one of the best actually, have you been in one?", "label": 0}
{"text": "He's been busted for a while", "label": 0}
{"text": "No. He couldn't. Every single one of his builds was played exactly the same way. Yes his itemization was wildly creative but he's always been reduced to a poke champion that melts waves and plays super safe until his hit and run tactics finally net him kills. \n\nQuit bullshitting.", "label": 0}
{"text": "Doran and peanut deserve a lot of criticism for sure, but Chovy coasting on people blaming his team mates while pulling a disappearing act in the most important series of his career down 0-2 to blg is insane. Yes Doran contributed to the 0-2 but if not for him, geng loses 0-3 pathetically.", "label": 0}
{"text": "I'm certainly not one of those, but I aspire to be one.\n\nAlso, bard.", "label": 0}
{"text": "lpl chat is perma emote only no?", "label": 0}
{"text": "12.23, set 8 release or very close to it", "label": 0}
{"text": "Because like Xiaohu, Dade, GodV, and Chovy, they do fuck all at worlds relative to how well they do throughout the season.", "label": 0}
{"text": "Sound like coaching problem. He don't know how to coach them and how to motivate them. \"Be better and stop being bad\" is not very usefull.", "label": 0}
{"text": "Dont worry about the autos, it gives increased range it will always be procced, if they actually removed the passive range shed be a bit more skillfull, but theyll never do that", "label": 0}
{"text": "Every sport has their T1/Faker. League isn't the only competition that faces this.\n\nRegardless, more narratives have to be covered. Every narrative is a gamble.\n\nAnd all of you guys misunderstood what I'm saying. Riot needs to make sure their viewers stay after T1/Faker are finished. This is for their own sake.", "label": 0}
{"text": "Wah wah wah", "label": 0}
{"text": "This made me chuckle because it’s true", "label": 0}
{"text": "Absolutely, simple kit doesn't suddenly mean the champ isn't skill expressive; thats just not how this game works. The macro knowledge, map awareness, well timed map rotations that TF highlights as well as the ability to make good decisions is really where his skill lies and a good TF is able to finesse their opponents by literally outthinking them. That is definitely somethin i can appreciate o7", "label": 0}
{"text": "See you on stage, bro", "label": 0}
{"text": "What i really wanna know is if the interviewer asked if the coach feels like he is to blame for anything, because the way OP translated he just blames the team lol.", "label": 0}
{"text": "Because the format is the same as MSI\n\nEveryone counts Faker's OGN titles as part of his LCK titles so why should it be different here?", "label": 0}
{"text": "on the plus side the yun tal rework probably brings ad kaisa back into the mix", "label": 0}
{"text": "Cosmic Ashe and Coven Nami are absurdly beautiful.", "label": 0}
{"text": "Riven. Can’t catch her. Tons of damage. Stun. Shield. Unlimited mobility. Can 1v9. I hate playing against a good one trick riven.", "label": 0}
{"text": "yeah this whole post reeks of someone who wants to justify their own bad performance", "label": 0}
{"text": "Is Summer super-close to the Worlds patch this year?", "label": 0}
{"text": "I would say it's fair, I saw her every game performing very well, it was hella annoying", "label": 0}
{"text": "I don't really think Faker's arc can be replicated given how long the game has been out now, the age of the player base, etc. \n\n  \nWatching the GOAT when majority playerbase is teens/twenties is magical - watching some new 20 year old playing a game that has been out for almost 15 years when most league players are 10 years older than him doesn't hit the same IMO. Happy to be wrong tho cuz I am not mega into the scene", "label": 0}
{"text": "Other great players need some performances like Faker 2017, dragging his team kicking and screaming with a win trading adc in the ardent meta. That’s how you become legendary and revered by the fans. If Chovy did something like that down 0-2 to BLG or Knight didn’t pull a disappearing act on jdg(literally what Chinese analysts agreed on) maybe there would be things to build on. It’s hard for riot to stage these players as the next big thing when they don’t help themselves.", "label": 0}
{"text": "Do the players listen to Maokai?  I don't know the interal dynamics of his teams specifically, but in LPL coaches aren't always listened to as much as in LCK, but more than in the West.", "label": 0}
{"text": "Because the whole appeal of pro play that riot has said themselves is to be able to do what you see the pros doing. Things like lane swaps are not doable in solo queue because no comms so the game is essentially completely different. You also seem to forget that someone has to be the \"victim\" in all of these strats. In the case of lane swaps top laners are completely irrelevant for the first 5-10 minutes. Do you really think even if comms are added to solo queue anyone would willingly ruin their entire early game and fun to trust their random teammates to carry? And I'm sure bot laners would very quickly get bored of having uncontested lanes and essentially identical early games every single game. By that point it just turns into which bot lane can carry harder after 14 mins so what would even be the point of having the early game, might as well just spawn in at 14 mins and get it over with. \n\nSo basically, most people don't like watching this every single game, they can't replicate things their favorite teams are doing and if this does creep into solo queue you are essentially removing top lane, bot lane matchups and the early game in general from the game. It's ironic asking for a shake up when nearly every single pro game follows the same exact lane swap formula now and is essentially \"solved\".", "label": 0}
{"text": "is he not just making fun or armut and calling him fat? like the way he says pizza *AND* a burger is kind of comedic", "label": 0}
{"text": "Well that's an opinion", "label": 0}
{"text": "That's the guy who only plays well to climb briefly and then ints it down with stuff like Thresh/Irelia/Sion with a sub-40% winrate (sometimes even sub-10% iirc) until he gets banned isn't it?\n\nDude is a total troll that can't commit to taking the game seriously.", "label": 0}
{"text": "It's already in TFT patch notes", "label": 0}
{"text": "it might finally get people to stop trollbuilding kraken on non ashe ranged champs", "label": 0}
{"text": "This is the type of comment that gets you 1k upvotes or just banned off the subreddit 💀", "label": 0}
{"text": "I definitely understand Singed because it’s Singed and although he’s rare when he does show up it’s a headache for both teams. Maokai Ult. Twisted fate gold card. Azir is annoying to play against as melee cause you can’t do anything vs his soldiers.", "label": 0}
{"text": "You're absolutely right. Reminds me of when in football a team will miss like 3 easy chances and then the opponent scores while a defender has a blatant mistake and you will see people blaming the coach lmao. What do you want him to do? Enter the field and score?\n\nSometimes the plan is there and it should work but the players can't execute. Doesn't make him a bad coach. Not saying Gax is great, I don't know much honestly and we don't see enough to judge IMO but it's insane how heavily coaches get blamed.\n\nWin game - Coach good, lose game - coach bad", "label": 0}
{"text": "Maybe you should not post this and just tell no one. Instead, you could post it on LinkedIn and look for a new job.", "label": 0}
{"text": "> Next day, first game, Oscar gets a solo kill on top, stays to push the next wave, Hans Sama shows up with Kalista and kills him. I was in shock. And the worst part was that no one said anything about the lane swap in comms. As a coach, you just have to resign yourself to it.\n\nI find it peculiar he mentions this, because this is a hardcore Razork fault, the dude was there, did not help Oscar push, left him alone, then goes bot to die, then repeats the same 2 games in a row after this, once with humanoid in game 2 and then again with Oscar afterwards.\n\nThe thing is, as a top laner if you do not push, the enemy will get there and freeze the lane so hard that you will not see xp or gold for the next 5 minutes OR stack so many minions they could easily dive you afterwards and/or take half the plates for free but denying you of all of that gold, xp, plates + kill if they dive you.\n\nSo Oscar staying is actually him trying to avoid this cause of Razork not staying...\n\nAnd this is something Razork did once again at worlds, it seems that he prioritizes so much getting gold for himself that he just ignores his own teamates and map needs...", "label": 0}
{"text": "That's the coach job to fix it.\n\nImagine he would be addiction therapist who said \"I told my patients 1000 times that they should stop drinking because it's bad for them. But next day they drink and when I ask why they can't tell the reason. I don't know why they do this\".", "label": 0}
{"text": "Gods sounds beautiful but I thought they’d give him a Starwalkin one because of that being the worlds song at the time.", "label": 0}
{"text": "No perma was for game in clip. He was 1/12 that game", "label": 0}
{"text": "can't tell if you're trolling or not, calling baus low skill streamer", "label": 0}
{"text": "ITT people not understanding how baus strategy works but talk like they do", "label": 0}
{"text": "Stay mad.", "label": 0}
{"text": "I mean if you already know you don't have smite (or a burst champ like nunu/kalista/ww/etc. or a counter-smite champ like poppy/morde/etc.) you should not be flipping objectives, just take the fights earlier and you have the benefit of an extra exhaust/heal/ignite/whatever that slot was. At 40 mins this is just team coordination issue, not jg didn't take smite issue.\n\nNot saying it didn't affect the game, it surely did, but if a game goes on that long it's because there were other factors at play.", "label": 0}
{"text": "Here are other few bugs that I have been messaging support about for months and all I get as a reply is \"we are aware and working on it\" :D\n\nThe client slides off over time, like goes off frame, so after a while some icons aren't clickable like chat or the exit button.\n\nFor TFT: Can't change any of the cosmetics, I am stuck with the same tactician arena and boom, I can't access the tab for the new event, it just says connection error, so I haven't been able to participate in it, the same thing happened with Swarm where I couldn't change the difficulty or the map I was playing.\n\nNow here is the funny thing, this only happens on my account, when I try a smurf account, everything works completely well!!! for months I was getting gaslighted by the support saying it's a connection or installation issue on my end.", "label": 0}
{"text": "its legit KDA from wish, its bad & ugly", "label": 0}
{"text": "You get Astro fisted in lane so hard it's unreal", "label": 0}
{"text": "This! 2016 SKT vs SSG and 2021 DK vs EDG are both so underrated. SSG is such a resilient team and EDG stole the Zilean pick from Keria. ", "label": 0}
{"text": "They still stand by not wanting to give AD, AS and crit chance, that's precisely the intention behind the stacking mechanic so as to backload the power of the item instead of getting full stats once you go to the shop. So Yun tal is an outlier and also just not as powerful as older AD+AS+crit items.", "label": 0}
{"text": "Who remembers SKT Vs Fnc MSI 2015?", "label": 0}
{"text": "I do blame the developer. Bounties are stupid and a flawed system, and the inting Sion strategy completely abuses it.", "label": 0}
{"text": "That's your biggest issue aside from mental then, if you're in a truly unwinnable draft (my team picked only assassins the other day vs a Mundo top enemy) you can (and some climbers say you should) always dodge in champ select like one in 20 games or so. You'll lose a bit LP but save a lot of time.", "label": 0}
{"text": "If that's the case, then what's everybody's problem? The bounty system is better for all of us and this super big brain strategy is still effective, then?", "label": 0}
{"text": "Which halo 3 comeback mechanic was this? Played a ton growing up, but somehow don't remember this", "label": 0}
{"text": "You cannot change the meaning of a term to defend a toxic play pattern. \n\nInting if short for intentional feeding. Full stop. \n\nI'm not saying what he did was bad or good. But to say he was not intentionally dying (regardless of his reasons) is wrong and stupid.", "label": 0}
{"text": "I do", "label": 0}
{"text": "Hahaha sweet justice.", "label": 0}
{"text": "Assuming it's just the auto-detect picking up a string of super negative KDA games in a row.", "label": 0}
{"text": "Feels kinda lazy", "label": 0}
{"text": "And then there is me who loses all hype for the competition Past Swiss stage", "label": 0}
{"text": "I would much rather a new champion see play and get nerfed than see 0 play and then buffed 12 patches in a row until people remember they exist.", "label": 0}
{"text": "LOL I can absolutely blame the player for being a douchebag.", "label": 0}
{"text": "So, what you are saying is that Sona in fact doesn’t grief her team everytime it is picked, solely because she is Sona, and she isn’t an insta-loss as soon as she is picked. I’m glad we got that figured out.", "label": 0}
{"text": "\\*begging for someone else to dodge", "label": 0}
{"text": "Camille destroys Sion once she gets Tri every, single, 1v1. Fiora gets Hydra and Tabis and Sion can't deal with her until late game. Abusing their early game weaknesses of weak wave clear is LITERALLY part of the game", "label": 0}
{"text": "Hey guys, Ashley here\n\n I'm sorry my audio is a bit too loud during Jankos' answers. This was a tech issue; my audio got recorded a few times louder than Jankos and we couldnt fix it completely 😢 sadge\n\nWe hope you can still enjoy the interview! Thanks Jankos for making time for the chat", "label": 0}
{"text": "If we’re using Berserker’s form from this year he’s gonna be a huge downgrade if Hype doesn’t have a Envyy/Taeyoon lvl fall off from LCKCL to LCK.", "label": 0}
{"text": "What do you mean?", "label": 0}
{"text": "Dont worry, Janko´s answers being too loud is not your audios problem. :D", "label": 0}
{"text": "No the game is dying", "label": 0}
{"text": "Splash arts counting skins easily goes to sun eat Kayle. Now default splash arts is definitely Katarina", "label": 0}
{"text": "Exactly, Janna top is another off meta strategy, you think that's cheating? \n\n> Abusing game systems in a way they aren't meant to be?\n\nSo you also think it's cheating if I pick an ap botlaner? Or if i play 3 top, 1 mid, 1 jungle? How do you know what's meant to be and what isn't? It's a game where you a free to play however you like.", "label": 0}
{"text": "tf is BO6", "label": 0}
{"text": "? can you make that make sense? Kennen is indeed a weird one but leans on the mage side being a zone controller category . Or kinda a Ap  marksmen when build on hit.", "label": 0}
{"text": "Still makes me frustrated thinking about what if they just banned Yuumi games one and two... ", "label": 0}
{"text": "Good. Fucking. Riddance.", "label": 0}
{"text": "Definitely taric", "label": 0}
{"text": "How many times has he seen the permanently banned screen now? 4? 5?", "label": 0}
{"text": "Aww thank you sm!! It was tough😭", "label": 0}
{"text": "Vel'koz. Because he is 2 different Champions when you play agains someone who mains him. Not many Champions can be 100% useless  like a Vel who dont know How to play", "label": 0}
{"text": "I am looking at it holistically. The dude couldn't carry? What's hard to understand? I'd probably put Bang in contention frankly. I'm not just stacking wins. Nowhere did I say well he has no worlds titles, he's down with doubelift. \n\n\nYou're telling me to look at things holistically, but then you take my argument literally. His inability to win should very much make people look into the argument again. There's a reason people would still put Rookie ahead of Chovy. And it's the same reason just in reverse. \n\n\nAll I'm saying is Uzi while good, is overrated. He's not the second best player of all time and he should not be automatically be the best ADC. \n\n\nI'm also convinced people didn't watch LPL. He was so resource heavy that he made his teammates useless. People say his teammates cost him, but their macro was shit because he wanted so much. Frankly, he was a liability and once teams got better, it became clear he wasn't going to win. There's a reason his 2nd place world's results were in 2013 and 2014. That's 10 years ago, and he got progressively worse.", "label": 0}
{"text": "Aww thank you!! Appreciate it", "label": 0}
{"text": "i think he’s saying that a lot of baus copycats will drop in elo, not baus himself. Baus has already hit challenger without inting sion strat many times, no one is questioning his skill", "label": 0}
{"text": "Yet no one plays it even when it's op", "label": 0}
{"text": "Hahaha no way", "label": 0}
{"text": "If they just rework his passive all the problems associated with him are gone", "label": 0}
{"text": "I could be wrong but it may have been things like oddball timer going faster", "label": 0}
{"text": "I do [😌](https://www.bing.com/ck/a?!&&p=b19e9b3685b8aefeJmltdHM9MTcyOTgxNDQwMCZpZ3VpZD0wMWMzNjk5Yy01MjM0LTZjMzgtM2E4NS03ZDc5NTM0ODZkZDMmaW5zaWQ9NTkzMg&ptn=3&ver=2&hsh=3&fclid=01c3699c-5234-6c38-3a85-7d7953486dd3&psq=relievied+emoji&u=a1aHR0cHM6Ly9lbW9qaXMud2lraS9yZWxpZXZlZC1mYWNlLw&ntb=1)", "label": 0}
{"text": "SKT vs Rox wasn't even the best series of that Worlds. SKT vs Samsung was much better.", "label": 0}
{"text": "Neither Samira nor Nilah are failures. They are quite distinct champions with their own pros and cons. However I would suggest that Nilah is a bit ham fisted and not the short range ADC they want but rather a burst ADC assassin, which I doubt is what the designers intended.", "label": 0}
{"text": "> You would get punished for playing well\n\nNo, you would get punished for playing poorly. You only gave out the gold when you died, which would be harder on average given you are ahead.", "label": 0}
{"text": "So true. Such a degen strat. Hope it stays in the dirt", "label": 0}
{"text": "Except those people that didn't understand why it worked in the first place will definitely not be up to date on the fact that it doesn't work at all anymore, and int Sion will permanently be engrained in Sion-playing culture.", "label": 0}
{"text": "Lmao, you have 6 comments in this thread hating or hoping to see baus permabanned. Go outside bro", "label": 0}
{"text": "I mean, just because he's drunk doesn't mean he's not playing at his appropriate rank. If he got that rank while drunk in every game, then he'll continue to perform at that level being drunk in your game.", "label": 0}
{"text": "If the enemy team can't end before 40 minutes despite having free access to every single jungle objective, then it's very possible for their team to have two people die facechecking a random bush or just getting assassinated for not respecting the other team. And 3 v 5s are very good odds no matter how many buffs they have.", "label": 0}
{"text": "I mean, are you telling me right now that bad players are still bad when they copy good players' strats? What's the difference between this and abusing meta chanps and meta items until they're nerfed??", "label": 0}
{"text": "My heart says WBG, even without our beloved Theshy ❤️‍🩹. Either way, as long as it comes down to some chinese teamfight bangers, I’ll be happy~", "label": 0}
{"text": "A normal toplaner does not get full build at 28 minutes, what are you even saying?", "label": 0}
{"text": "How does a Camille, a fiora, a normal champ with no wave clear ever hope to match a Sion’s proxy?\n\nLike how bad are you players no way this isn’t common sense to you.\n\nDo you think the master and above players Baus goes against just have never thought to themselves, “Maybe I should also proxy??”  If Baus on sion gets his proxy going early game, there is no feasibly response from a champion with no wave clear.  Your points are actually wrong, the real strategy is you literally can’t let him get in a position to proxy if you are playing one of these champions.  \n\nI’m surprised a good player like you needs simple things like wave clear explained!", "label": 0}
{"text": "[https://www.twitch.tv/videos/2284956971](https://www.twitch.tv/videos/2284956971)\n\nLike 2:16:00", "label": 0}
{"text": "Just because its not Atreus himself in actuality doesn't mean they can't slap the skin on Pantheon.", "label": 0}
{"text": "i don't think people realize how insane taliyah is against dash-heavy champs. one of the most frustrating games of league i have ever played had me on zac vs a taliyah. not only does her E do insane dmg but the stun also allows her to easily land her W and push you through even more rocks", "label": 0}
{"text": "> While in a negative state, base gold value is reduced by 1 for every 4 gold given to killers and assisters on death.\n\n> The first 50 negative bounty gold is not applied.\n\nCan't be assed to account for minion gold, so at most:\n\nKill gold given to Fiora (assuming only the 1 assist that we can see in clip): 300, 275, 206.25\n\nAssist gold given to Viego: 103.125\n\nTotal gold given away: 884.375\n\n> Champions now accrue 1 bounty gold for every 4 gold earned from kills and assists.\n\n> The first 100 bounty gold is not applied.\n\nSo Fiora should have a bounty gold of 120-ish. I'm pretty sure scoreboard only shows bounties that are above 150.\n\nAccording to op.gg, Fiora is \"only\" up 738 gold at 5 minutes, so I'm probably calculating things wrong (don't think CS gold would make that much of a difference).\n\nStill, the 1:4 ratio seems too low.", "label": 0}
{"text": "When I started playing league I played 2 top, 1 mid, 2 bot, I never realised I was such a scoundrel back then. Thank you for openeing my eyes, hopefully riot won't retroactively ban me for cheating!", "label": 0}
{"text": "What makes you say this?", "label": 0}
{"text": "I’ve never not played inebriated", "label": 0}
{"text": "thank god, now I will hopefully have less dip shits in d4 thinking that this garbage works", "label": 0}
{"text": "But the bigger chance is that he probably got to the rank playing sober, not drunk. Don't understand why you're trying to excuse someone deliberately going to play ranked drunk that would probably just troll.", "label": 0}
{"text": "Wait, so Camille gets to win every 1v1 against Sion when she gets Triforce because her champ's strength is dueling and weakness is waveclear, but Sion can't abuse his strength in waveclear and weakness in low 1v1 potential?? Wait, so Fiora can't get Tiamat to fix her weakness AND still beat Sion in every 1v1 because her strength is dueling and weakness is waveclear that's easily fixable with an item that's part of her core anyway?? Really?", "label": 0}
{"text": "I don't care about nuance, that playstyle was fucking awful", "label": 0}
{"text": "we are already on second gen players. like the t1 younger players. NA like Busio.", "label": 0}
{"text": "Just watched the last game. 0 6 0 to 12 7 . 320 cs at 17 mins. Still works sometimes. You win some, you lose some. Bots do the bans.", "label": 0}
{"text": "Option 1: It's a 15 year old kid's idea of being cool and edgy, nothing out of ordinary as far as the game goes\n\nOption 2: He's off-role and doesn't want to dodge, so gotta try to play a game of chicken with the lobby\n\nOption 3: Dude is wasted enough where the last of his concerns is which gamemode he queued up for", "label": 0}
{"text": "With trundle? You probably statcheck her since min 1 just by pressing Q off cd", "label": 0}
{"text": "\"You don't have to int to play around these concepts\" \n\n  \nSion is quite possibly one of the weakest early game characters in the game, to the point that its not uncommon for sion to be down a large amount of cs, get frozen on, and ganked anyway. Baus avoids all of this by dying on purpose. He gets wave under turret so its not frozen, forces enemy to chase him around so they lose cs (while he gets the whole wave), damages turret for plate that a frozen sion would never get, and chunks the enemy top laner in passive.\n\nThis usually results in the enemy top laner being 1/2hp when sion returns, so Baus can shove the wave and get the plate causing the enemy to lose an entire wave when they recall. Baus secures 1 1/2 plates and gets the full wave, effectively going even in gold while scaling with his W passive and inherent late game character. \n\n  \n\"Pressure and tempo are basic concepts that literally anyone can play around\"\n\nYes, except sion can't unless you are Baus. Renekton can create pressure and tempo because he has kill threat on you at all times, same for half a dozen other top lane characters. Baus HAS to int to play around these concepts because his champion is fucking terrible early game, and it works. He often has the same amount of gold as the enemy top laner if not more, and the reason his team does so well ALL THE TIME is because the enemy jg focuses purely topside while Baus' jungler gets free reign on enemy bot lane. It doesn't matter to Baus if the jg camps him because he is going to shove the wave and chunk someone (or even kill them) regardless of if he gets ganked or not. Yeah he has bad games, and it looks worse because his strategy already involves dying so of course his kda will be worse.\n\nSo tell me again how does he not have to int to play around these concepts? He got challenger korea with ad sion, and has repeatedly been high elo despite being target nerfed for over a year or more. His strategy works, he's just the only one who can do it.", "label": 0}
{"text": "TLDR: Dude thinks the over abundance of mobility on every new champ released, only beaten by the next champion released, isn't mobility creep. Next up - This guy will argue there wasn't a CDR-creep on every single damn item last season.", "label": 0}
{"text": "Thunderlord teemo", "label": 0}
{"text": "If i q up and see that my 11 death average sion has 55% wr i wont report him since its just bad game even if he goes 0/15 but i will report if theyre just fucking not trying to win.", "label": 0}
{"text": "Would love for stack based effects tied to game time instead of 2x, just thinking how big the difference between a Nasus who got to free farm is vs not; this is true for Garen W or Veigar AP or Asol E and so on\n\n\n\nMy other thing is certain elements of certain kits should be adjusted, i.e. Ivern could totally use a different passive, Ornn passive upgrades should not require his passive (purchase item) be off cd, Kindred mark should ramp up with towers killed since no jungle markings happen\n\n\n\nAnd aram nerfs/buffs should be clarified in champ select \n\n\nLuden's splash should not break spellshields/warmog", "label": 0}
{"text": "I don't think I missed it, if I did ignore this. \n\nBut I would like to add another one to this list. For the last like 2 months the game has the yellow dot informing me I have a new banner. I dont have a new banner. I have equipped every banner I have and done a game with each in the hope it goes away. \n\nIt still appears every time I turn on the game.", "label": 0}
{"text": "Good. I hate playing vs players/champs that abused it. You play greedy and like ass all game but I still have to babysit you all game?", "label": 0}
{"text": "T1 and Geng aren't a rivalry. For the past 2 years it's been a one sided stomp lol.", "label": 0}
{"text": "... and good riddance.", "label": 0}
{"text": "lol Prestige skins", "label": 0}
{"text": "Lol😂", "label": 0}
{"text": "> You can’t really say it’s a brainrot strategy\n\nIt is a brainrot strategy. That doesn't mean baus is stupid, far from it. But the fact that it even was ever viable is completely stupid.", "label": 0}
{"text": "Not really a sign, but they've definitely started doing what a lot of other companies are doing, aka short term profit above all (high cost skins, layoffs, reducing spendings on esports, future updates to the game), which does give riot more earnings on the long run but a big chunk of the player base are from third world countries who can't afford to spend money on skins anyway, so on the long run it effects the game.", "label": 0}
{"text": "Kinda expected this for Callme after Fisher popped off and got his contract extended. He was great in LCKCL and was pretty good in his first few games in LCK when he was just a sub, but after he got main priority to the NS mid slot he just looked awful. He was back in an upwards trend in LCKCL when Fisher became the prio mid but NS having Calix just means he’d get way less playing time in CL for the coming seasons.", "label": 0}
{"text": "* **Server:** EUW\n* **Type of Bug:** Visual/Gameplay Bug with Genesis Nightbringer Yasuo\n* **Description:** There is a visual bug with the EQR (Airblade) Animation on the Genesis Nightbringer Yasuo skin, The EQR(airblade) animation ends earlier than on the regular Nightbringer Yasuo, very visible in the Video comparison. Genesis Nightbringer Yasuo lands on the ground before his target, regular Nightbringer doesnt behave like this.\n* **Video / Screenshot:**\n   *  Genesis Nightbringer Airblade (EQR): [https://www.youtube.com/watch?v=GoPxsnxkT7A](https://www.youtube.com/watch?v=GoPxsnxkT7A) \n   * Nightbringer Airblade (EQR): [https://www.youtube.com/watch?v=vcMVLubTuJg](https://www.youtube.com/watch?v=vcMVLubTuJg)\n* **Steps to reproduce:** Perform Airblade on both skins to compare. Throw Q3 -> EQ -> R on a target to transer the Spin Q\n* **Expected result:** Animation should be the same as Nightbringer Yasuo since all the animations are or should be the same\n* **Observed result:** Animation differs from regular Nightbringer Yasuo and ends to early/swings the sword to fast down making Yasuo land on the ground about 0.5 seconds before his target. regular Nightbringer doesnt behave like this.\n* **Reproduction rate:** 100%\n* **System specs:** dont matter for this\n\nThe bug doesnt greatly impact gameplay. But does feel very unsmooth since Yasuo is stuck for about 0.5 Seconds. Airblade is one of the Combos making the champ who he is and is a big part of his gameplay. Yasuo players/mains would greatly appreciate if this would be fixed since the skin is pricey and shouldnt have bugged animations.\n\nThis Visual/Animation Bug has been reported multiple times in the PBE Feedback thread for the Genesis Nightbringer Yasuo skin, but was ignored and never fixed. Posting this here now hoping riot sees this and can maybe pass it on and fix this.", "label": 0}
{"text": "Dr. Mundo. Speaking as a Mundo main", "label": 0}
{"text": "Banger recap. Jankos is often a yapper but you got him to yap with purpose for 50 minutes.", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Super minions have -30 magic resist, at least in Ultimate Spellbook", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Hopefully they run it down only in your games then, since you're ok with it.", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "I know, and the fact it still hasn’t changed is my issue.", "label": 0}
{"text": "320 cs at 17 minutes doesn't sound mathematically possible. You sure about that?", "label": 0}
{"text": "You don't typically have a lot of common sense when drunk. A lot of bad ideas suddenly sound like good ideas...", "label": 0}
{"text": "Damn, Rito keeps killing the alternate fun strats :c", "label": 0}
{"text": "Literally nothing of value was lost.", "label": 0}
{"text": "Auf what a mistake. 27. My bad im sorry.", "label": 0}
{"text": "I’m 40 years old. I’d say no when it comes to America but will be in Korea. All the young kids in the USA didn’t grow up with competitive top down real time strategy games like I did that required extreme skill levels. They prefer shooters now like Fortnite. They didn’t grow up with real life heroes like slayer S boxer. Does gen z even use computers ? I think they prefer cell phones and consoles.", "label": 0}
{"text": "Never forget the classic KT vs IG. That shit was banging.", "label": 0}
{"text": "So I played league way back in the day for all of a season. But I would like to know the story behind this and anything else you can share about him", "label": 0}
{"text": "that was not his point. he is not that strong, especially in higher elos. just this pick makes your lane dead from the start if you are not versing an enchanter with no heals. His stats prove it, 50% wr is not high especially with a incredibly low pickrate", "label": 0}
{"text": "Intentionally feeding to try to lose the game versus intentionally feeding to try to win it are not the same thing. You're just taking the buzz word and removing context from it to paint a bad picture.", "label": 0}
{"text": "175 cs at 18 minutes or 32?", "label": 0}
{"text": "That's what I said too - Hope all the Sion players you get go 0/15/1, 1/12/0, 0/12/2 like Baus, as long as they're \"trying to win\".", "label": 0}
{"text": "I wish I were drunk more often when I see the quality of my teammates gameplay.", "label": 0}
{"text": "It got hype because it's trap. Trap by definition kills the momentum in its drop which is like a reverse of how most edm songs are orchestrated. It being played as a song that is supposed to energize and hype makes no sense.", "label": 0}
{"text": "I mean you do have a lisp lol, nothing to do with the audio processing. But don't let that take away from the work you put into the voiceover+editing, really quality stuff!!", "label": 0}
{"text": "Good.", "label": 0}
{"text": "because when talking about the whole context of league, gumayusi is basically a baby, he started playing like yesterday", "label": 0}
{"text": "This made me think why is Lumberjack Draven not a skin?", "label": 0}
{"text": "That's just normal support behaviour", "label": 0}
{"text": "Eh they bragged about the largest budget ever in 2025 so that's definitely not the case tbh, or those were just were lies told for the ears of the investors", "label": 0}
{"text": "Just give us winter map or more different map styles please", "label": 0}
{"text": "They do bruh, thats also literally what i said", "label": 0}
{"text": "Gragas vs Nidalee midlane ahhh those were the days. Not good days mind you ", "label": 0}
{"text": "Yea like I don't regret playing league, it's just more of a well that sucks. I do miss playing sona/nautilus but it is what it is", "label": 0}
{"text": "Then rework his passive. Give him a passive that is useful when he's not dead.", "label": 0}
{"text": "Casual Shaco player experience (From low elo perspecitve, and you’re fed):\n- Gank, use all abilities and kill\n- Run in jungle with 10 hp left\n- Put boxes in bushes around jungle\n- Spam CTRL+4 untill someone takes the bait\n- Use all abilities and kill\n- Repeat", "label": 0}
{"text": "It's too good of an idea so Riot will never do it", "label": 0}
{"text": "Chance it's probably just a teenager or young adult who is still impressed by something as trivial as getting drunk and will say that to get attention.", "label": 0}
{"text": "How is zoning \"not degenerate\" some matchups are so vile you are mostly helpless without outside interference. I really do not get your point", "label": 0}
{"text": "Why should the game not be able to last that long? There likely already are children who got introduced by their parents. I also don’t see why it should be impossible for league to be around another 15 years at least. The game changes. The league of today is already very different from league in 2009", "label": 0}
{"text": "175 cs at?????? 175 cs at 10 minutes would be record breaking absolutely game shattering and 175 cs at 50 minutes would mean you suck ass context matters", "label": 0}
{"text": "The correct answer is likely Singed since he has 2 buttons that are press and forget, doesn't really attack, and low execution to pull off what's needed to be impactful. Like any champion he has optimizations but probably less than most, biggest ones I can remember is attacking while you flip someone, flip into glue, and using your passive to reach targets.", "label": 0}
{"text": "He gets gold by FARMING and collecting plates, there is not magic formula, he does not get gold by inting, also you see a lot of games where he does nothing, literally nothing, the strat is good against clueless players, thats all.", "label": 0}
{"text": "If they’re averaging 55% wr, especially over a large sum of games, their score line doesn’t matter.", "label": 0}
{"text": "Damn bookmarked that page. Those are actually really fucking nice and the 18/30 note is affordable. Might buy my mom one of them.", "label": 0}
{"text": "It nerfed his gold advantage, but he's still getting exp and tempo advantage. You put a lot of gold on yourself with this strategy. You still have to convert that advantage into a win and Baus is pretty good at the game.", "label": 0}
{"text": "O nooooooo.... Anyways", "label": 0}
{"text": "Good contender as well if it weren't for his requirement for map awareness to press R and his Q which is a bother.", "label": 0}
{"text": "The funniest thing about Kalista is that her abilities were explicitly designed to encourage 2v2 play, and she was still showing up in pro play as a top and midlaner.", "label": 0}
{"text": "Ambessa's kit is very simple though?\n\nHow is her kit an essay?", "label": 0}
{"text": "Yes you would think the most successful esports game will indeed be around long enough", "label": 0}
{"text": "that didn't change", "label": 0}
{"text": "SK vs FNC used to be the OG El Classico of EU.", "label": 0}
{"text": "very bad chester would hate her", "label": 0}
{"text": "Phreak uses Zilean as an example often, heres an example https://www.youtube.com/watch?v=b2cpyGkMgLM&t=1482s \n\nCurrently this pick has has 53% normalized wr emerald+ https://lolalytics.com/lol/zilean/build/?lane=middle&patch=30 which puts it at the 4th highest wr mid pick \n\nSure he's probably weak in supp role right now, as I said before I was not talking about right now", "label": 0}
{"text": "This was disgusting to watch. Fuck. Will still smash WW on it.", "label": 0}
{"text": "Also prowler removed", "label": 0}
{"text": "It’s totally better than it was, but I don’t feel the system is fair - CS in my opinion is the ‘healthiest’ method to gain gold, because it rewards you for staying in lane, contesting the wave early so you are vulnerable to your energy and actually engaging with them, ganking facilitated by supports/junglers rewarded, rather than those who should be in lanes outside of contesting major objectives, rewards you for wanting to push your enemy off of the lane to deny that gold etc. \n\nCS should be the fundamental gold generation method in game for everyone but supports, punishing people for CSing well and rewarding perma-roaming & picking up the odd wave shoved into turret and shutdown farming imo is lame.", "label": 0}
{"text": "Vladimir", "label": 0}
{"text": "Like I said - Tell yourself that when you get them in your games and they go 0/17/3.\n\n People rage in games if their jungler is 10 cs behind - No one's going to be playing a ranked game and go *\"Well, he's 0/17/3 here, but in other games he wins so this one's ok, nice try buddy :)\"*\n\nAnyone pretending that they wouldn't be raging in all chat calling that person an inter is so full of it.", "label": 0}
{"text": "As a software engineer who works on a live service game I can pretty much guarantee that if it takes more than a sanity check every champ release then they would have never made Sylas. The easiest way to scare people off of going ahead with a feature on a live service game is telling them that it's going to need upkeep.", "label": 0}
{"text": "I'm literally always drinking a beer if I'm playing league.", "label": 0}
{"text": "Length of match matters; \n\nVision score matters; \n\nObjective control matters. \n\nSamira is a high kill champion by default with her reset mechanics. You are competing with a lot of other Samiras who also get high KDA. Because of that, other factors become more important.", "label": 0}
{"text": "Alex Ichs kid should be around 10? Now they are russian so it is unlikely they can go pro in lol but could happen", "label": 0}
{"text": "Gods was his story tho", "label": 0}
{"text": "\"Top is about counters, so counter it, right?\"\n\n\"None of these champions actually counter Ambessa in lane though.\"\n\n\"I think you missed the point.\"\n\n\"? i'm struggling to see how any of those champions do anything to ambessa in a sidelane\"\n\n\"REEEEE\" \\*baby crying noises\\*\n\nGenuinely feel like I missed like 5 comments in between that could explain why you just shit your pants like that. This is an all-time Reddit moment haha", "label": 0}
{"text": "Just pick Nasus and outscale him", "label": 0}
{"text": "Watch the [Worlds 22 final preview](https://youtu.be/BpO5bZEzVzI?si=7zU3kaQ9gGkJs-zX) and then watch all 5 games and cry your eyes out like the rest of us did", "label": 0}
{"text": "you do, actually.", "label": 0}
{"text": "It is probably not that easy to find that kind info on old pros. But at the very least I would assume dozens of", "label": 0}
{"text": "You couldn’t pay me to play this game sober.", "label": 0}
{"text": "![gif](emote|free_emotes_pack|downvote)", "label": 0}
{"text": "All that and yet she's still not a tank killer", "label": 0}
{"text": "Like why does a champion Riot wants to build tank have a passive that only activates when he dies.", "label": 0}
{"text": "Tell us your summoner name and play a game as heimerdinger, Mr. Grandmaster. ", "label": 0}
{"text": "That is always funny;\n\nFuck me the game hasnt even started, someone is trolling, game is probably lost but cant take the penalty. Saved by a dodge.\n\nQueue pops again. Yay! Guy is still there. Fuck.\n\nHappened once where the guy was still there, but on the other team. And proceeds to wreck me and my team.\n\nNow when I get a rando dodge out of a shit game i also get out of queue and back in.", "label": 0}
{"text": "It's normal. His playstyle gets autodetected every other month and gets him banned, but Riot is rather quick to unban him since they know he isn't actually inting and his strategy works more often than not.", "label": 0}
{"text": "Halo 3 was one of the first games in the series to introduce more explicit comeback mechanics, particularly through its scoring system and the ability to gain power weapons on map respawns, which could help a losing team regain momentum.", "label": 0}
{"text": "I’m talking literal brain dead. Mundo is a contender, but you can’t be more brain dead than a wraith", "label": 0}
{"text": "They've been trying for years and support still has a sub-50 winrate in high elo because her spells literally aren't built for it", "label": 0}
{"text": "0 utility jungler who doesn't seem to have great gank setups has no future in pro unless she's just incredibly op", "label": 0}
{"text": "The largest budget ever and feeling the rate hikes are not mutually exclusive tho. Riots interest payments likely went up and there also is less imvestors.", "label": 0}
{"text": "They changed it back to 1.0 on patch 13.11.", "label": 0}
{"text": "LMAO", "label": 0}
{"text": "Can find the post where it waas used by a soccer fan at the World Cup(?) but it blew my mind to see [Deft's legendary quote](https://www.reddit.com/r/leagueoflegends/comments/yr99lx/the_phrase_that_is_making_the_rounds_in_league/) being used in other mainstream sports. How sick would it have been if his Caitlyn Worlds skin quoted this in her recall?", "label": 0}
{"text": "IDK if it got better but NA challenger used to be 30-40 minute queues.\n\nThat was a raised issue when Riot came out with a list of games their parter streamers could not play on stream (Like HearthStone) because that was the kind of games streamers played while waiting for the queue pop.", "label": 0}
{"text": "Yeah which is why I'd rather they just add this as a mechanic of her passive tbh", "label": 0}
{"text": "\\> 2 of those are control mages with some defense\n\nSo, like Seraphine? This is a stupid point to make, you're already assuming the conclusion. \n\nFact is, one is a mage, one isn't. As a pure shield/buff oriented support with a panic button, Sona support has much higher success rates. But that's not what Seraphine is used for", "label": 0}
{"text": "yep like theres insane counters in league to dashing champs that are slept on.\n\ntaliyah is so insane vs dashs but i bet ya most players don't even know about her e interacts with dashs.", "label": 0}
{"text": "Ambussy", "label": 0}
{"text": "He got permabanned because he gets spam reported every game.  He will just message his riot contacts and get unbanned.", "label": 0}
{"text": "And he's still pretty good too.", "label": 0}
{"text": "That’s racist, how do u reckon he fancies veggie m8? \n\n\n&nbsp;\n\nOh… i see… carry on", "label": 0}
{"text": "He also actually does int for content though lol.  Have you ever seen one of his irelia games?", "label": 0}
{"text": "Every single time lol", "label": 0}
{"text": "Comet is unreliable. If you just hit with a base Q then the enemy will dodge it. The reason you take Electrocute on Vex is because you can proc it so easily with Auto + E/W + Auto and it just makes your trades insanely strong.", "label": 0}
{"text": "as we all know, top lane is the only place where getting counterpicked actually matters. it's your fault for picking a melee ad bruiser instead of a tank.\n\nimo the champ has always been busted. since the days of him 1 shotting you with q and r until now he's been running shit", "label": 0}
{"text": "MAD vs Eu at worlds", "label": 0}
{"text": "Can’t ever imagine a world where the game itself isn’t around. Esport remains to be seen", "label": 0}
{"text": "Bard #1, Taric #2.", "label": 0}
{"text": "Same. Its an extra hour of worrying and preparing 😭", "label": 0}
{"text": "I'm so glad I quit league 😆", "label": 0}
{"text": "I also hate that the have all changes cleanly separated in buffs and nerfs at the top and then you scroll down and its alphabetical for some damn reason.", "label": 0}
{"text": "Baus is literally the one guy who made your shitty main work lmao", "label": 0}
{"text": "Yes, it will put y'all somewhere in the middle of yall", "label": 0}
{"text": "T1 vs JDG  series is the pinnacle for me. That game 3 baron throw into epic teamfight moments pretty much highlights the series. Overall, I feel a little bad about the disposition on Ruler. The life of the ADC is harsh, one mistake and it's pretty much over.", "label": 0}
{"text": "Electro works better with Vex's game plan. She wants to go in and kill her target with one burst, and Electro helps with that. \n\nYou could play something like poke Vex with Liandyr's and Comet, but at this point you aren't playing to your champs strength, and long range mages like Xerath would do that better anyway", "label": 0}
{"text": "Fucking finally this strat is gone. I don't care how much nuance or strategy it needed to be executed, it was boring to do and boring to play against (especially the latter). Considering the strat is now dead, we can buff sion to actually be a viable laner and champion and baus can't just make another weird build with Sion and perma win lane without even playing the damn lane.", "label": 0}
{"text": "Baus could probably play 2 roles to challenger regardless of meta. The fact he choses to have fun is another thing. People forget just how good he is because of his particular style", "label": 0}
{"text": "Not even remotely true in any universe which has ever or will ever exist", "label": 0}
{"text": "This is like saying \"don't like the match up? Alt+F4 the loading screen and never connect, insta remake\".\nJust punish the player assigned jungler like a leaver/afk is punished.", "label": 0}
{"text": "According to the wiki the casting time is 0.55s and if no one is inside at the end she stands still.\n\nFor reference on some other huge skillshots I can think of: Skarner R is 0.65, Jinx W is 0.6-0.4 based on attack speed, Jhin W is 0.75, Yone R is 0.75, Aurora E is 0.35, Hwei QE is 0.6\n\nIt should be barely reactable, especially if the backline is expecting it, and if she whiffs it she loses a massive cooldown", "label": 0}
{"text": "Okay, thank you for letting me know!", "label": 0}
{"text": "WE LIKE THOSE ODDS 🗣️🗣️🗣️", "label": 0}
{"text": "I felt the same thing honestly, but I’ve always been more of a player fan than an org fan, so almost every year i’m jumping ships because i just follow the players i like.", "label": 0}
{"text": "oh no! anyway", "label": 0}
{"text": "There’s no minor region, it’s just Ams/EMEA/Sea/KR/CN", "label": 0}
{"text": "Not really an opinion - it’s factual. \nUpset carry’s high elo games like he’s smurfing. Playing vs him, when he has one of those weeks where he’s trying, is pure agony. \nCaliste is good mechanically, so he can be annoying, but Upset is on a level with the Asian ADCs. \n\nHe basically Solo carried a dysfunction Fnatic to worlds and even out of playins.\nWould’ve loved to see him on G2 with a good team around him.", "label": 0}
{"text": "Entire chat forgot about Yuumi lol. ", "label": 0}
{"text": "Comet also has Manaflow Bond, Transcendence, Gathering Storm, Scorch. The keystone is more of a nice bonus on top of all this", "label": 0}
{"text": "It’s hard to think they’d do give one region two events in a normal year", "label": 0}
{"text": "Origen vs G2, clasic ocelote vs xpeke", "label": 0}
{"text": "So does Ruler? Even this year he slumped hard in spring. If you want to talk about specific moments, his [flash into Sion ult at 2018 Worlds comes to mind](https://youtu.be/Xvo3TtLxayc?si=i_wDXtjwbZRDJQX7&t=146). Or ]his overextension in 2016 World Finals](https://youtu.be/MohnyOOxv2I?si=ySoNNd4UFHH74x3u&t=2521). Him getting caught by Faker's flash Azir ult last worlds will probably go down as one of the most iconic plays of all-time, and people forget [he inted before that as well](https://youtu.be/SIlh0a46Ago?si=Accgr5UAo2asxxKK&t=177) and gave T1 baron. \n\nI could maybe accept that Ruler at his peak (2022/23) was a bit cleaner than Deft, though I think peak Deft was a more dominant laner and more aggressive teamfighter. Depends on preference.", "label": 0}
{"text": "They are ONLY accounting for gold now from the sounds of it, when they should be accounting for a difference in EXP as well. Champion kills and forcing opponent out of lane tend to generate large EXP advantages, especially in top lane.\n\nI personally think being punished for CS'ing better than your opponent is a good thing in a roundabout way - it usually means you have a very strong advantage over them that forces them to be unable to CS and accruing a small, incremental bounty for that is fine.\n\nWhat's not fine is that 300g from a single kill is worth less than 14 CS, but creates a much LARGER gap due to the opponent not only missing the gold, but ALSO the EXP of a minion wave.\n\nI get where they were going - they want killing your opponent to be less of a detriment to you as the winner, but they kinda forgot about all of the EXP and only focused on gold which is just not nuanced enough.", "label": 0}
{"text": " so yes got it", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "VERY GOOD", "label": 0}
{"text": "I would agree with that, the new system is definitely better, but I still feel CSing should not contribute to your bounty. It should be based off of kill gold and kill/objective Exp", "label": 0}
{"text": "Showmaker Swain and Canyon Kayn was honestly such an insane highlight.", "label": 0}
{"text": "You say he doesn’t need to die to create pressure and tempo, I explain how, and then you start arguing about other nonsense. Lmao", "label": 0}
{"text": "GOT is over 20 years old my guy.", "label": 0}
{"text": "But Sion's passive is still good at what it's supposed to do, letting you cheat death for a bit and get the wave/some low hp enemies, inting sion was never it's supposed purpose, it's just a strat people found that abused the bounty system", "label": 0}
{"text": "He was intentionally dying but he wasnt \"feeding\" because he was keeping up in gold, so the opponent wasnt stronger, or fed.", "label": 0}
{"text": "Red is my favorite color so at the very beginning i liked them because of that lol,\nbut i stayed because i ended up really liking the team.", "label": 0}
{"text": "Your comment right here actually highlights one of the many reasons why posts like this is so depressing to read. It's almost as if you can formulate an argument without exaggeration and/or straight up bullshit claims. There is a legitimate complaint in the quality of certain Prestige skins, and although quality and \"worth\" is always subjective, one can definitely argue that this Diana skin is not up to par with some other ones out there. \n\n  \nBut, OP proceeds to call Riot lazy while making the laziest argument possible. That it seems like it took no effort.", "label": 0}
{"text": "nah then  you should  have dodged cuz you let a troll though", "label": 0}
{"text": "reddit gm", "label": 0}
{"text": "End of an Era. People hate on him but he \"invented\" a playstyle and mastered it so well that he reached challenger. It was aids for sure, but it was creative and it was unique, not like every clickbait LoL video/stream nowdays.", "label": 0}
{"text": "You literally \"corrected\" the 17 to 12 bruh", "label": 0}
{"text": "Ivern", "label": 0}
{"text": "It did make sense that the bounty system was based off kills, not resources. \n\nIn the Wild West, if you got rich by doing your job (killing minions and towers), the sherrif wouldn't put a bounty on your head. If you killed a bunch of people however, you would have a bounty on your head.", "label": 0}
{"text": "Good, and his fucking voice is the most annoying shit i've ever heard", "label": 0}
{"text": "It's part of his lore and identity, they will not ever get rid of it.", "label": 0}
{"text": "Jesus.", "label": 0}
{"text": "Its a very old design philosophy that riot used for older champs, so they would alot of the time when giving champs a stat boosting passive lower said champs base in that stat so they can make the numbers on the passive even higher.\n\nsome examples of these:\n\nDiana: back when she had her old passive of straight up constant attack speed they lowered her base attack speed to give more from the passive. This lead to having a much lower base AS but highest overall AS for a champ without attack speed items. This ended up having a side effect at the time where any attack speed item was worse because of the lower base attack speed.\n\nOri and Miss fortune: Both these champs have passive where on attack they deal bonus damage, ori with her ramping passive and mf with her first hit being stronger but because of this they both have some of the lowest ad in the game for there respective roles.\n\nold fiora: she had slightly less base ad to make up for the fact her w gave a long sword+ for free\n\n  \nTheres a bunch of champs like this just a couple of examples from within the game, They want the passives to look and feel stronger but because of that lowest the bases to makeup for it leading to them only being slightly better in those regards but to the player it looks and feels a ton better overall because of the bigger numbers from said passives.", "label": 0}
{"text": "My thoughts exactly. It's giving 16-year-old who is super tilted and trying to seem devil-may-care.", "label": 0}
{"text": "I’m not talking about irelia. Inting is dying with the purpose to lose the game, baus is “inting” because he actively benefits from it on sion.", "label": 0}
{"text": "Typical baus enjoyer represent.", "label": 0}
{"text": "ye like in those cases the inter will just take smite and refuse to use it.", "label": 0}
{"text": "For those that didn't watch his stream, though he lost this game, he went 4-2 overall on the day - 3 of those wins came from hard ints. Including a 2/11 Swain game. \n\nHe also reviewed this particular game at the end with a replay to look at gold amount Fiora was getting for kills and concluded that while indeed Fiora did not have a bounty for some time like she normally would pre-patch, he himself was probably worth even less gold than he probably would be pre-patch. A large part of his strategy is making himself worth less than wave's worth of gold, meaning killing him is worth less than the time it would take to kill him while he proxies the wave and gets a tempo advantage. \n\nDespite what people in the comments are celebrating, the title is actually wrong because The Baus reviewed this game and concluded inting Sion still works. Not just that but under certain circumstances it's now even better because him getting a kill will no longer resets how much gold he is worth. I have no doubt that a few weeks from now he'll have refined his strategy to int in a different way which games this system.", "label": 0}
{"text": "I wonder if people are overbuilding Malignance. It seems to be a bad rush for anyone except APC bot Swain, but the least bad top. Maybe it's only good into melees, so rushing vs range is troll? Blackfire seems underbought for its winrate.", "label": 0}
{"text": "ok go get challenger then? you clearly have it all figured out", "label": 0}
{"text": "In this game he isn't even ahead in gold. He's up like 15 cs which equals 1 kill plus a little experience.  He has not plates and is probably down 600 gold. Fiora probably has a 100 gold bounty in the clip but it doesn't show. She would have a higher bounty but I think there's a new mechanic which slows down the first applied bounty(was confusing in the patch and complicated but that's the gist).", "label": 0}
{"text": "The year is 2015: Sion is abusing his passive to steal red buff, raptors, and sometimes cheese kill the enemy jungler\n\nThe year is 2018: Sion is abusing his passive to infinitely push lanes and proxy. \n\nThe year is 2021: Sion is abusing his passive, phase rush, and prowlers claw to delete squishies \n\nThe year is 2022: Sion is abusing his passive to infinitely push lanes and proxy. Now with Hullbreaker.\n\nThe year is 2024: Sion is abusing his passive to infinitely push lanes and proxy. Now with New Hullbreaker.", "label": 0}
{"text": "I think it's different in League because they have zero expectations of their team doing well. It's like the cups in Soccer/Football where a 5th division team plays a first division team. The 5th division fans just show up because it's fun to watch your team play against the best, with a little bit of hopium that maybe they score/get a win.", "label": 0}
{"text": "It can be hard to believe, but some of us are emotionally mature adults that don't have to bitch and moan for validation over someone not performing well enough in a video game.", "label": 0}
{"text": "Let's act like you won't say \"I'm sure that's your account\" unless I have to waste my time on a game just to win an online argument bro. I'm not the one that brought up my rank so I'm not gonna entertain you.", "label": 0}
{"text": "The main reason to die was tempo and using the passive. Bounty is just a massive bonus.", "label": 0}
{"text": "What about Blitzcrank that never had a \"real\" brain to begin with?", "label": 0}
{"text": "> What's the point in being the hard carry to a team of you ain't hard carrying them to a win?\n\nHe did, plenty of times. He took his teams further than they had any business being, for example making 2 world finals in a row in 2013-2014 with mediocre teammates. \n\n> But I missed the part where being the best laner means you're the best. Of course results should matter.\n\nBoth of them should matter, but individual play should matter more in a discussion about the greatest **PLAYERS** of all-time. In situations where you have a solid adc who won a lot vs an insane adc who didn't win that much, I'm taking the latter every time. I'm not going to pretend people like Bang who got boosted by peak Faker or Ghost who just had to afk while Nuguri/Canyon/Showmaker stomped the game are somehow greater **players** than Uzi because they won more trophies.", "label": 0}
{"text": "I agree partially - exp from kills & objectives should definitely be considered as a comeback mechanic - but again, most of your exp in my opinion, should come from CS - I would be happy reducing kill experience gained massively, or even removing it.", "label": 0}
{"text": "Imagine wanting to actually be perceived as good at your job and being able to implement everything, even hard and complicated ideas. Smh, I would never. League champs are way more important to me than having a living.", "label": 0}
{"text": "Ahh, then most of the community should be able to make challenger, huh? After all, you just have to have a strat that “sometimes works”.", "label": 0}
{"text": "nidalee elise kindred graves is a very common champ pool in Korean and Chinese high elo", "label": 0}
{"text": "Ill never forget that singed who tried to be smart by proxying inside our base at level 1 and got executed without even getting the full wave (yes this was in bronze)", "label": 0}
{"text": "175 != 300 anymore", "label": 0}
{"text": "Idk, in d4 I still find this the case.", "label": 0}
{"text": "that sounds like a great solution to the problem since it prevents idiots who switch roles and fuck up and stops app from switching you off smite while also makes trolls not able to take off smite and say it was an accident.", "label": 0}
{"text": "You're correct, that is really hard to believe in a game like League where people literally shout slurs in ARAM for missing a skill shot. League isn't known for mental stability.\n\nStill maintain that everyone posting that they'd be super ok with it would report that person in an instant though.", "label": 0}
{"text": "I find it funny how you said significantly worse but they were also the only team that made all Bo3/Bo5 go all the way to 3/5 games against GEN haha. I guess that's how they started their history as being known as the only ones who were always so close but so far against GEN", "label": 0}
{"text": "I am familiar. Why are you explaining this to me?", "label": 0}
{"text": "What happens if you die to someone who isn’t your lane opponent who is potentially stronger than you? \n\nThat logic sucks.", "label": 0}
{"text": "Why, did you reach challenger with bauss strat?", "label": 0}
{"text": ">you deserve to be punished/the other team deserves to be rewarded\n\nYeah....\n\n> lose a fight \n\nI think that's the punishment... enemy team gets + gold and map control by killing out slaying you.\n\nBounties are an unnecessary comeback mechanic.", "label": 0}
{"text": "Yeah Nidalee is *the* turbostomp smurf champ in my experience.", "label": 0}
{"text": "This reminds me of Comcast. I was getting ping fluctuations issues. I usually had a steady 80. But then one day it started jumping between 80-120, just bouncing around. We got a new router, new cable, etc. We realized it was Comcast itself. So we talked to them and at first they were like \"no, it can't be us. Just get nee equipment as that's causing it \" and finally after telling them everything IS new, they said they would send a tech for $100 to take a look but \"it's not us we pinky swear.\"\n\n\nWe switched ISP's and not only did my ping go down to 20, but it stays a solid 20 and never a single issue.\n\n\nSure it wasn't you Comcast.\n\n\nLol. I feel like that is happening here.", "label": 0}
{"text": "Yup you can now copy what other 100% of all players doing, dont need to think of any alternating strats when there is none :)", "label": 0}
{"text": "MSF vs SKT was by far the #1 series at worlds. \n\n  \nMSF threw the most boring worlds meta ever on its head and was 1 ability landing away from knocking out SKT.", "label": 0}
{"text": "I don't think fans outside reddit think anything special about that series. A prime example of reddit echo chamber narrative.", "label": 0}
{"text": "calling out roles was a thing in season 2, had it nearly every lobby where everyone rushed to type there roll out and last was support unless there was a support player.\n\nsaying it was only s4 onwards is silly to say the least.", "label": 0}
{"text": "Sure, but bounties snowball from kills - you are likely to out cs your opponent that you kill, and deny them gold/exp.\n\nIf you put more value in CSing, your opponent isn’t going to look to repeatedly dunk on you unless it’s to further deny you cs in a structured way - stacking waves and diving with a jungler become more valuable plays by making cs more important.", "label": 0}
{"text": "Not weird at all, just a mental shortcut for \"a champion whose implementation I was a crucial part of\".", "label": 0}
{"text": "Where do you even find these people? I havent seen sion player in years now.", "label": 0}
{"text": "I think Bang is close. Honestly. I also think the hardest thing in competition isn't winning. It's winning twice. And to do it back to back is insane. \n\n\nDoesn't matter how much you think Uzi carried, if he didn't win, he didn't carry enough. I'd have to take a look at some ADC's careers. But I think I genuinely like Deft and Bang over Uzi. \n\n\nYou also gotta think, that while China is competitive, Korea is still the better region and Bang and Deft also had domestic success against better teams and talent. \n\n\nWould you put Bjergsen or Doublelift ahead of Caps? They both dominated NA. But sucked internationally. What would make Caps stand out comparatively? Oh a better international performance. So it's not just about trophies, but results matter. \n\n\nI'll take a little peak at some ADCs later over the weekend and I'll let you know my thoughts. Uzi is undoubtedly in the mix though, and very well could be first. But it isn't a landslide. People are just going off hearsay or something.", "label": 0}
{"text": "Drx were both though", "label": 0}
{"text": "Its still based on gold lead, so you will still have a bounty if you hard win your lane. But baus could hard win his lane and still not have a bounty, which they changed now.", "label": 0}
{"text": "You're right, no other strats in the entire game other than proxying in this very specific way. Gottem.", "label": 0}
{"text": "And you don't know how to read, where am i arguing about any strat at all here ? We are talking about a passive and why he has it?", "label": 0}
{"text": "I always wondered why you could get like 3 kills worth of gold from Tower 1 and 2 kills worth of gold from Tower 2 and not influence your bounty... Lol. Same thing with Tryndameres, but not because they int, but because their opponent has to afk/roam. Lmfao\n\nIf you run it down in lane, you get reduced gold given to your opponent, then if your team picks up the shutdown and you get two towers, your team is rewarded with 6-7 kills worth of gold delta despite you never actually being beyond. Lol", "label": 0}
{"text": "I feel like people are always underestimating the power budget cost when discussing \"free\" stats in a kit. Especially when it comes to stats which are base. \n\nA lot of abilities give \"free\" AD for example. But you wana know what else does that? Having base AD. Getting AD from an ability is strictly worse than having it on base. Plus abilities with passives tend to be weaker than other abilities. \n\nConsider akshan. He passively does a million things, but his active abilities are kinda ass. His ult is one of the worst in the game, his W active while cheap has such a large reveal range and no MS without his passive means that it's kinda impractical most of the time. \n\nHis Q is decent but just tickles most champs and is mostly to proc his passive and give MS leaving his E as his only genuinely good active. \n\nSo, in exchange for amazingly strong passives his about 2 approximately average abilities. That's not what I'd call free. \n\nNow, to be clear, I am not calling Akshan a weak champ because of this. My point is that there's no such thing as free stats and effects. Every ability pays a massive opportunity cost, and its power needs to make up for that.", "label": 0}
{"text": "Tank death passive makes a lot more sense than adc death passive", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Personally, I'd stick with bot games until he has the basics down. I remember playing a normal game with friends when I was very new to the game, and I had no idea at all what was going on. I just kept dying repeatedly without knowing how or what happened; it was super disorientating and I pretty much spent the game in grey screen.", "label": 0}
{"text": "As someone with 5x more hours in CS but still plays league\n\nCS’s barrier to entry is way lower than league, nowadays probably lower than even COD with their movement shit\n\nIf you have money buy M4/Ak/awp, force guy MP9 and Mac10, pistols Tec9 ,five seven or deagle, 5 grenades not locked behind characters, you plant or defuse a bomb \n\nMeanwhile league you even have to learn which ability to max first", "label": 0}
{"text": "Callme was in LCK before tho and HLE academy played better", "label": 0}
{"text": "The question is why are you responding seriously to a user who posts on /r/eatingowncum\n\nIt's obviously a troll", "label": 0}
{"text": "Only 70? sounds like more research needs to be conducted, its a good start though", "label": 0}
{"text": "JFC how long did this take to write up? This is legit down to the formatting", "label": 0}
{"text": "Yes! And no matter how many times you uncheck show me unowned banners it always rechecks when you open the client again.", "label": 0}
{"text": "That would be an interesting layer of complexity to both of their characters.", "label": 0}
{"text": "i mean some people also just dont have their balls in a twist as much as you seem to have", "label": 0}
{"text": "My favorite is to tilt one specific enemy as much as possible. I did it for a while on ap twitch support too. Enemy caitlyn shows anywhere on the map? I'm there.", "label": 0}
{"text": "Also it just feels horrible to be forced to take phase rush because your champ doesn't even function the same way if you pick anything else", "label": 0}
{"text": "> who was better in 2016?\n\nDeft and PraY.", "label": 0}
{"text": "Because CSing requires you to be inside a contested zone, likely against a player also trying to dight for resources.\n\nKilling players should come from trades, often which are skewed by your ability to generate income from the main  source - CS.", "label": 0}
{"text": "People don't realize that the reason Baus has to do this strat is because of how abhorrent Sion's laning phase is. If Baus plays laning phase normally and goes 0/10 into a Darius he's inting, if he does his normal proxy strat he's inting. What do people want him to do on his main champion?\n\nIf they gave Sion some meat and made him a playable champion this wouldn't need to be an issue with another Reddit post. He ints into Aatrox, he ints into Darius, he ints into Camille, he (mostly) ints into Fiora, K'sante, and Mordekaiser. Don't worry, we have Ambessa coming out! I wonder how that's going to go for Sion.\n\nLike I have no idea why Riot can't give him something. It's not going to make the game ANY worse. The game will survive a patch with Sion being strong, just to test the waters. They can have a hotfix ready to go if things are getting out of control.", "label": 0}
{"text": "Link?", "label": 0}
{"text": "Casuals won't miss their work just to watch semis/finals. Just deal better with your impulses and wait until prime time.", "label": 0}
{"text": "no hes full of shit , rotations will still exist", "label": 0}
{"text": "It’s a good passive", "label": 0}
{"text": "The first couple of weeks I bet her winrate will be that low, and then people will learn how to play her and she'll be bonkers. I'll be banning too lol", "label": 0}
{"text": "This sub got clowned hard by that series. All the talk about boring 3-0 final and real final being DK vs T1, and then EDG wins.", "label": 0}
{"text": "I've been diamond since like season 3 and it used to be proxy singed, than it became this ... Those bs cheese strategy are unfun to play against and didn't require any skills. Good riddance.", "label": 0}
{"text": "I don't see your point. Never having faced a strategy doesn't mean it's not toxic or non hateable.", "label": 0}
{"text": "hi while yes there isnt really a coding issue with that, there is ways it can be broke by other players or trolls like there isnt anything stopping a player from buying it to lock someone out of getting smite in the jungle bam the asshole mid grabs smite from jungler and then soft-ints the game away after that.\n\nit would just cause more trolls then it would fix since now it can turn any 4-5 on a team into a troll instead of just 1 person having the chance to troll.", "label": 0}
{"text": "Riot stated they had to drastically nerf Samira in order to get people to stop banning her. Nilah is bottom 5 in pick rate for bot (https://www.leagueofgraphs.com/champions/builds/adc). The only bot laners less popular are Twitch, Seraphene, and Ziggs who all can be played in other roles.", "label": 0}
{"text": "Thats not the point, the free stat means you have it by just playing, like pantheon armor pen, he does not need that much pen like lets say riven, akshan has a revive, a unique mechanic at the cost of bad skill set, if you give everthing to a champ, the only thing stoping it from stomping is the skill celling.\n\nA good example is ksante, we could argue all day but it was trash bellow diamond, any elo bellow that performed poorly on the overloaded guy, the only thing stoping ksante going 20/0 every single lobby is the skill ceilling also a mana bar that prevents an endless fight.", "label": 0}
{"text": "It's never them ofc.", "label": 0}
{"text": "Just change your DNS in the windows settings or your router. This is a normal setting and will not get you banned.", "label": 0}
{"text": "You would be somewhere around your elo before he does the BO5", "label": 0}
{"text": "you said \n\n>I don't understand how getting armor from his passive, at the cost of some armor per level, is somehow overloaded or unbalanced.\n\nso my brain took it as o lets explain", "label": 0}
{"text": "should just make a new account to play but goodluck", "label": 0}
{"text": "I would say not anymore since usually that series is judged by the quality of play.  All 3 of EDG worlds 2021 series were really high quality.  T1 vs JDG last year was amazing too.  Reasonably close, and T1 had to play some peak League of Legends to bear JDG.", "label": 0}
{"text": "Lilia", "label": 0}
{"text": "While the game definitely needs incentives for kills to keep it in a healthy state competitively, focusing on the macro side of the game should not be considered a 'problem'.", "label": 0}
{"text": "All of edgs series were that would were great", "label": 0}
{"text": "> * both are same skin color\n> * both have very similar hair\n> * both are from noxious \n\n\nLeague players when two minorities exist in the same region 😮", "label": 0}
{"text": "When does no damage ", "label": 0}
{"text": "I thought guy was a pretty decent human except for that streamsniping controversy he was in", "label": 0}
{"text": "He doesn't have a point. It's a troll account intended to get reactions. He doesn't know what's been played at what rank, he's just here to troll - Check the profile, even says it over and over.", "label": 0}
{"text": "Ambessa's son is Ambassing", "label": 0}
{"text": "To add to this:\n\nUnlike other champs that have had death passives like Zyra and Kog, Sion's kit actually incentivizies the positioning to use his passive, and his passive fulfills the role he wants to do. As an engage tank, he wants to get in and disrupt the enemy team. By coming back, he continues to disrupt them and do his job. I've definitely seen times where I've ulted into the enemy team and gotten melted, but my team still won the team fight in no small part because my passive allowed me to force the enemy backline to retreat while their Frontline was diving my team.", "label": 0}
{"text": "Play aram until he gets familiar with most/all champs imo", "label": 0}
{"text": "Well, now it’s based on gold difference. Before it was simply based on cs difference, ie your whole team could be losing, but you have a bounty just because you farm well. Now you only have a bounty if you are ahead in gold, so it actually makes sense", "label": 0}
{"text": "G2-SKT wasn't a high quality series. SKT was really sloppy and kept throwing leads for no reason. No wonder G2 then got clapped in the final.", "label": 0}
{"text": "Yes. Had a game a couple weeks ago where buddy was teaching someone how to play he was 'Diamond on his other account' But Gold on the one he was using and...... all th other players were Iron/Bronze it was a horrible game for everyone but that Vex because his friend was getting creamed in bot lane and he was creaming everyone else. lol", "label": 0}
{"text": "I remember Faker's first worlds and how hyped I was cause we're almost the same age... Well really I was the same age as a lot of pros at the time I suppose.\n\nBut now that the scene is filling with Zoomers I am feeling a little weird cheering for which 18y/o is gonna lift the trophy. Didn't expect to feel old in my mid 20s but here we are.", "label": 0}
{"text": "I've been playing since s2 and all my kids know league through me. I watch everything on the TV in the living room so they watch it with me, listen to the music etc. My eldest has some interest in playing too but only against bots. Last year when BDS played against Golden Guardians of started early hours of the morning in England and she got me to wake her up too to watch it.", "label": 0}
{"text": "I remember when I used to play Tahm toplane and uber-fuck people with my lvl 2 all-in when I leveled up (fundamentals). It was devastating.", "label": 0}
{"text": "This.\n\nYou can say \"this design is impossible to implement because XYZ, I propose to do a small change ABC so that problems XY are removed and Z is mitigated\".\n\nBut if your opinion purely *on design* is actually important enough to change the decisions of people who are working full-time *on design* - it means you're not working in a tech company, you're working in a startup.\n\nI don't let UI designers decide how to implement even a line of my code, they can honestly fuck off with their level of knowledge and understanding. The same goes for me trying to criticize their design, and really, *really*, it's only fair. I don't have to have a say in literally everything that happens around me, I have enough of my own problems to solve in my own role, thank you.", "label": 0}
{"text": "Redditors when anyone points out something race related 😮", "label": 0}
{"text": "ur tears came through the screen when u typed that lmao", "label": 0}
{"text": "T1 and GENG are not rivalries? HLE literally broke an almost 3 year tradition of GENG vs T1 finals lol. And then we can also look back to the SSG SKT days.", "label": 0}
{"text": "I am pointing out that what you're describing as strong is normal behavior for game design and the design of that particular mechanic. I am not genuinely curious it's a rhetorical question.", "label": 0}
{"text": "Mm only one playstyle very fun just go ksante every game very fun", "label": 0}
{"text": "Yep, this is what I've always said too. Baus *knows how to play the game*, and knows how to do this strategy with minimal deaths, but sometimes he's doing what he does in this clip, just running under the enemy's tower at low health and going *\"Oopsie poopsie, unlucky\"* for the stream, where he's not gaining a single advantage for doing so.\n\nI watch him sometimes. When he is actually playing the game he is a very good player - But I hate watching him literally troll for no advantage and then watch people try to defend it as part of the strategy.\n\nProxying under a second tower, drawing the opponent's jungler back and allowing your team to get a dragon or pressure - Great! Cool strategy!\n\nWalking under a tower at 100 health over and over while your opponent gets 10 kills and stomps the game? Not great! Also not a strategy!", "label": 0}
{"text": "Deft went to high school with Faker and they got into League around the same time, but while the latter had a meteoric rise to the top, Deft had to grind for a long time for his win. He was always regarded as one of the best ADs in the world and had very strong domestic results on great teams like SSB, EDG and KT, winning multiple titles including multiple wins against Uzi's RNG and even an MSI win against SKT in 2015. \n\nUnfortunately, he never seemed to be able to replicate his form or success at Worlds. In his first year at Worlds, he made semis with Samsung Blue but got swept in the semis by his sister team, Samsung White. That would be the only time in the next eight years that he'd make it past the quarterfinals. As his career progressed, Deft was still a great player, but got stuck on worse and worse teams. After years of failure due to a mix of chokes, disappointing performances, unlucky draws, and mediocre teammates, it seemed like he was never really going to get another real chance to lift the Worlds trophy.\n\nOn DRX, probably the worst team he had ever played with on paper, Deft barely scraped his way into Worlds 2022 as LCK's fourth seed. Not a single sane person on the planet would've predicted DRX to even have a chance at making a competitive run, much less winning the entire competition, so expectations were obviously low. DRX made quick work of the play-ins teams and got drawn into the easiest group of the tournament, which they capitalized on, topping their group and making it into the top 8. After the knockout stage bracket was determined, DRX's run looked nigh impossible, starting with EDG, the defending world champions, and likely GENG in semis followed by JDG/T1 in the finals. Not only that, but Deft had history with every single team he was facing, having previously played with Scout/Meiko on EDG and Chovy/Doran/Keria on DRX, as well as competing against Faker for his entire competitive career.\n\nDRX tragically dropped to 0-2 in the series against EDG after an unbelievably unlucky ending to game 2 that honestly made it seem like Deft was meant to never win. With the odds stacked against them, after a defeat that would crush the morale of most teams, and staring down the barrel of yet another quarterfinals exit, Deft and the rest of DRX rallied and reverse swept EDG on the back of an incredible performance from Zeka. They rode their momentum into semis, beating GENG 3-1, and finally faced off against T1, who many people predicted would comfortably sweep DRX. DRX ended up pushing T1 to silver scrapes and miraculously emerged victorious in what is probably both the greatest Bo5 series and greatest Worlds upset of all time, becoming the first fourth seed to win Worlds and finally giving Deft his long-awaited Worlds trophy.\n\nHope that helped! There's probably already a better and/or more detailed summary of his career elsewhere if you search for it. The [Worlds 2022 finals teaser](https://youtu.be/BpO5bZEzVzI?t=115) also covers some of his story as well.", "label": 0}
{"text": "Literally both of the champs on your flair and (garen and renekton and darius and kayle and olaf and trundle to name a few more) have been shitting on ksante since his release, urgot was shitting on ksante so much he started getting picked in pro", "label": 0}
{"text": "I also see Karthus running it down in Aram, and it works, but I don’t understand. ", "label": 0}
{"text": "My feedback to the product design was also often considered valuable.\n\nBut in the cases it weren't, I could oppose a feature all day and all night if I wanted, and I still would be told \"okay you said your piece, but we will ignore you anyway, now shut up and do it\".\n\nDevs don't exist to make the design decisions. It's not their role. You're free to talk to product designers and maybe they'll listen, sure. But in any non-startup company, you won't have power over what you will ultimately be told to do at the end of the day.", "label": 0}
{"text": "\nMake a new account, don’t ruin his MMR.", "label": 0}
{"text": "Should probably be fine, since it does not interfere with league or give you any advantage. But no one here can say for certain.", "label": 0}
{"text": ">You're right. Doublelift and Bjergsen hard carried in NA and never won. They're 2 and 3 on the list baby. Impact as well.\n\nI literally brought up international performance multiple times. Blocked for dishonesty.", "label": 0}
{"text": "Yeah you are right, I'm spreading misinformation here. Still think Rell could be her offspring though..", "label": 0}
{"text": "Where cooldown buff for swain hot damn", "label": 0}
{"text": "Games don't do that anymore. There's a reason why CS2 was basically an engine update rather than a fully fledged new game.", "label": 0}
{"text": "Well you can still do this, you just have to make it work without the game arbitrarily putting bounties on the heads of players who don't have a gold advantage.", "label": 0}
{"text": "Zeus was 9 when Faker first won worlds.", "label": 0}
{"text": "Good", "label": 0}
{"text": "If someone wants to grief they’re going to grief. Forcing them to take smite isn’t going to change anything.", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "\\*screen pans to black\\*\n\nfin", "label": 0}
{"text": "Y'all haven't felt the fear of an Elise OTP and it shows. She's so versatile that a well played Elise will make you feel utterly helpless", "label": 0}
{"text": "Honestly props for somehow managing to slot in hate about Ambessa in a thread about pro player's children.", "label": 0}
{"text": "https://youtu.be/ROXdOzlIeIE?si=3-CYGWhmEI88F0V8\n\nA bit of story in here, its about drx in worlds 2022 and a bit of backstory of especially deft", "label": 0}
{"text": "The baus haters come out in full force every time he gets banned lol. Then he gets unbanned in 1-2 days.", "label": 0}
{"text": "Can't wait for their ingame models to be absolute dogshit, especially Panth with those cool burn marks on him, gonna be big ahh brightly coloured splotches", "label": 0}
{"text": "Nah I got his point before he deleted his comment but you're not benching a like for like player.\n\nIt they benched Dardoch for a better or equal.player and the team shits the bed then it's true. But if you're substituting for worse, when the team is already on the edge, I think it's a no brainer.", "label": 0}
{"text": "Pantheon is gonna be in Arcane??", "label": 0}
{"text": "Be me.\n\nQueue up league game.\n\nSee enemy hovering champ.\n\nHoly shit pls don’t pick that one.\n\nEnemy hovers different champ. \n\nHoly fuck that’s even worse.\n\nEnemy chooses a completely different champ from the previous two instead.\n\ngg bullshit pick this round isn’t going to be a fun one.\n\nRepeat for the next 8 hours.", "label": 0}
{"text": "Did you read Rell's lore?\n\nRell already confronted her mother and likely killed her. It's not specifically spelled out, but she obliterates the academy in the same room, then proceeds to murder most of the staff. Rell's mother was also heir to a fallen noble house.", "label": 0}
{"text": "It was very innovative because it counterintuitively took advantage of mechanics to gain an advantage and it wasn’t as simple as running it down", "label": 0}
{"text": "Like I said, it is more of 2 strong teams frequently met because they are strong. That's also why there is no rivalry talk in VCS, PCS and LJL because in Wildcards there is 1 team cut above the rest. Personally I'd like some history of beefs between them rather than \"we fought a lot, this is fun\". If you think about it, there is not much different if you swap out GENG for DRX in term of competing against T1, isn't it? Even T1 vs KT rivalry makes more sense since they are 2 biggest telecom companies.", "label": 0}
{"text": "guess that cost the layoffs", "label": 0}
{"text": "its just a single game but BLG vs HLE game 4 was insane", "label": 0}
{"text": "I mean there do exist good young players. There's a 13 year old who's a sub for Pulse Star. Not as much as Korea though, yeah.", "label": 0}
{"text": "I play with a teemmo otp and even with like 3M mastery on the champ, he still have a 32% seasonal WR 😭", "label": 0}
{"text": "Honestly after faker going for the fifth it's my favorite ending", "label": 0}
{"text": "Yeah but league lore is not canon anymore. Only stuff that happens in Arcane is. You could say the same thing for Viktor yet his fate is entirely different in the show.", "label": 0}
{"text": "I like the theory still", "label": 0}
{"text": "you kinda need to do the tutorial because of all the essence it gives you + unlocking modes", "label": 0}
{"text": "I mean that's super obvious.  \n\n\nShe doesn't have anything in her kit except damage and mobility.  And bruiser damage always falls off after 25 minutes.  \n\n\nThe people saying she'll be in pro play are monstrously stupid.  This champ isn't doing anything to your backline unless she's 6/0 lmao. \n\n\nA 0.5 second suppress with 0 follow up cc on a super thin skillshot. \n\n\nYeah champ is not great.", "label": 0}
{"text": "All those things involve dying at the right time and place. At that point isn’t it intentional dying?", "label": 0}
{"text": "Deft logs in and easily claps all 17 grandkids at once\n\nRESPECT YOUR ELDERS", "label": 0}
{"text": "i love Ambessa concept but i think with her kit they took over all the op coins left for this year, too over loaded for no reason, i had the chanse to try her on pbe and she is just disgusting, the only limit is the energy bar which just limit you in early games if you don't combo as you should to get the energy back, but otherwise there is no weak spots, you will always need to put 2 or 3 person on her also when she is back in items and economy, she is quite squish compared to other fighter but she has very high base skill damage and no sense scaling, with few items she became close to be an assassin but with an aatrox sustain", "label": 0}
{"text": "I don't think that compares to this since the AWP is a main weapon that a lot of people use, while Sion is 1 character out of hundreds and not a very popular one at that.", "label": 0}
{"text": "Honest opinion: even Baus himself would have been always more successful with a normal strategy and it’s unfair to other players that get banned for feeding games in high elo that he keeps to get playing.", "label": 0}
{"text": "lmfao what? ironically Pyosik missing smite PRODUCED the magic of that series, or it easily could’ve been DRX stomping T1 in game 5 or perhaps even DRX going 3-1 after winning game 3.", "label": 0}
{"text": "I feel like mastering this makes ambessa the biggest lane bully of all time. What champion could successfully lane into this if executed correctly?", "label": 0}
{"text": "Carryover system, 2 is the default, if you have leftover honors from last game they carry over (that's why you have 3 and 4 sometimes)\n\nbut if you use them all up, you start back at 2 for next game", "label": 0}
{"text": "Well, Irelia is gonna be a nasty split pusher now", "label": 0}
{"text": "Recency bias. I bet a lot of ppl commenting weren't around to see SKT vs ROX. The storyline of that matchup was way more deep and interesting as both teams had been playing for years and SKT always lost on domestic but won in internationals. Similar to Geng & T1 now.", "label": 0}
{"text": "option select goes hard as a name I fear the rioter was cooking", "label": 0}
{"text": "For the entire 2015-2017 Bang was worse than Pray. If it wasn't for how mediocre his bot lane was Faker would have a MSI and a Worlds title more right now", "label": 0}
{"text": "Oh no a guy that terrorises every lobby he's in and that people hate having on his team AND on the enemy team because his strategy sucks to play with and against can't play the unfun strategy? Oh the horror. Now he can't inspire hundreds of players to int and say \"it's a strategy\" anymore.\n\nGood ridance", "label": 0}
{"text": "I agree man! Pretty much every skirmisher in toplane has an equivalent mechanic/trade pattern, and even some divers and juggernauts as well, that's Gwen's whole gimmick with her W, and, to a lesser extent, jax's E. It doesn't make sense to remove it since the mechanical requirement to do it is lower than a basic qiyana combo or something, and the reward is, well, just being a normal toplaner.", "label": 0}
{"text": "SKT vs Samsung worlds 2017 finals, obviously\n\nstill have that picture of shaker crying above my bed", "label": 0}
{"text": "Yeah it can be a previous Aspect of War and not Atreus. But they can still give the skin to Pantheon.", "label": 0}
{"text": "I remember watching it live and it literally felt like Faker was 1v9'ing that whole thing. So brutal to witness", "label": 0}
{"text": "What do you mean? Get an honor level 5 orb, you'll be generously rewarded with some rare and exotic..blue essence!", "label": 0}
{"text": "\\>A champion that is near ungankable, and can farm from range, will not be allowed to be strong in All-ins. Ever. \n\nI can find several champions who can. Maybe even a dozen of them.", "label": 0}
{"text": "They somehow took games of GenG but got slapped around by all other top lck teams \n\nThey had x-factor players and Canyon was still best player in the world in 2022 imo", "label": 0}
{"text": "They killed Swain\n\n\nEven on aram he feel so weak now, that's how you know champ is dogshit if even in aram where there is perma fight he cannot shine", "label": 0}
{"text": "grasp gragas has been the meta for the last year or so anyway idk how much of it is phase rush", "label": 0}
{"text": "Wait for Ambessa and watch Gragas (and every single other champ in league) cry", "label": 0}
{"text": "lol ? the game is fucking trash now", "label": 0}
{"text": "He's really not. One really, really good guy abuses it in a weird way. Sion's passive is fun and thematic.", "label": 0}
{"text": "Sure 2022 was the best story we've seen, but T1 beating literally all of China to win worlds was pretty cool too. The doom and gloom of welp looks China wins, there's no way T1 beats them all before the T1 quarters match. Then what felt like the inevitablity of T1 winning going into the finals. It was a good story. Not the biggest underdog story league has ever seen like in 2022, but still very very good.\n\nDude if a western team won it all I'd be checking the results everyday for at least a month to make sure it wasn't all a super epic dream. Hell if FLY simply beat GenG I would have likely been doing that until the next round happened", "label": 0}
{"text": "U really do not wanna play with him u less it’s Aram or you could level a new account along side him. Just make sure u purposefully play kinda shitty so u don’t get into Smurf queue.", "label": 0}
{"text": "But you are reducing to the absurd said \"similarities\" to make them similar. Sona does not float using a large device. She floats with the instrument she plays. Seraphine can be a mid-lane and only her W supports her allies. Her passive also doesn't empower her abilities with unique effects. Their ultimates aren't identical even to the dimensions (1200*320 extensible at 1600 speed vs 1000*240 at 2400 speed) to the point that Sona ult is used to initiate fights unlike Seraphine, that is a follow-up CC.", "label": 0}
{"text": "Good luck. Nearly every in-house discord I’ve been in has been giga ego rage babies as a e2-d4 ranged player.", "label": 0}
{"text": "Either that or they're a troll.", "label": 0}
{"text": "ornn a bit yes but mostly because of his w, but gragas can take out tanks pretty easily if they build cdr", "label": 0}
{"text": "We need a Gordie Howe", "label": 0}
{"text": "Apparently it's a fighting game term", "label": 0}
{"text": "Those Swain changes are nothing, unless a 48% winrate is the goal instead of 46%", "label": 0}
{"text": "This is a way to help his enter LEC teams' radar.", "label": 0}
{"text": "League best game baby!", "label": 0}
{"text": "Ngl, the way this video is presented you'd think he died or something", "label": 0}
{"text": "I'm pretty sad to see such a small bit of skill expression get removed. I love these niche tricks good players can use to gain small advantages. Considering ambessa hasn't even been released yet, it's way too early to say she will be as problematic as k'sante was. ", "label": 0}
{"text": "CSing is the primary gold farming method. If you don't apply this difference in the bounty system it would be useless for the most part. It's not always about the +300g, but how much farm you can take away from your opponent; and that could mean several waves with each death. What if you're denied access to your T1? Are you simply not allowed to have a comeback? \n\nSomeone getting 'stomped' in lane could have as little as 2 deaths, but only because they stopped going for farm. With your logic, they would not be granted a bounty beyond 150g, despite losing so much more.", "label": 0}
{"text": "Well it's how it works at my job and I actually like being able to have so much input personally. It also lets me be very autonomous and propose projects and get the backing organically. Top down versus bottom up styles.", "label": 0}
{"text": "I'd love to hear some examples. ", "label": 0}
{"text": "defts last dance is probably a moment that will be enshrined in not just league but esports forever.", "label": 0}
{"text": "No, never thought it did. ", "label": 0}
{"text": "By this same logic Jankos has been carried by Caps, since Jankos, the best jungler in the history in eu with the most trophy on his role and also MVP of 2019 LEC, has never won an EULCS/LEC without caps in his team.\n\nYour opinion lacks a lot of sense and understanding of the players, competition/ eSports as a whole and league as a game.", "label": 0}
{"text": "Then you could just be playing suboptimally. Dying doesn’t always have to be a bad thing", "label": 0}
{"text": "thanks rito very cool", "label": 0}
{"text": "Just ask to switch picks?\n\nThere are plenty of melee bruisers than just run over the picks you mentioned (and picks like gragas\n\nIf you get counterpicked, you get counterpicked. It happens.\n\n\nNot all melees get neutralized by gragas either.\nFiora is just fine into gragas, and any time you predict the E, especially pre 6, you basically push him out of lane in one trade or post 6 force a defensive ult, which leaves him zoned until it’s back up. \n\nZoning your opponent from 10 CS and exp is worth way way more than a kill because of how easy it is to do. If you zone them off two waves, the lane is donezo as you now have a kills worth of gold and a level lead.\n\n\n\nChampions like Illaoi feel way way worse, because a single mistake and not even your jungler can save you. (I can’t think of a single post 6 matchup an even Illaoi loses. For melees)\n\nPeople bring up oh but what is your bot is 0/5 at 7 min?\n\nThat games already lost regardless of who they picked because dying that many times before 10 minutes is hard and you have two minions on your team instead of the opponent, who has one. \n\nAlso none of those picks can win a game on their own and can’t sidelane against most bruisers.\n\n\nNone of those champions can fight an even Gwen at giants belt +boots level of gold.\n\nThey can’t fight a fiora, Illaoi, Darius or urgot.\n\nBruisers dumpster tanks until like.. 3 items. ", "label": 0}
{"text": "i'm getting tired of riot removing interesting mechanics out of every champ. I understand doing it when an interaction offers no counterplay and is overall unfair but this is not the case, every bruiser in top lane has a tool to short trade without getting too vulnerable. Ambessa losing this while having almost no cc in her kit is gonna make her so hard to pick in top.", "label": 0}
{"text": "Honestly I though BLG VS HLE this year was nuts.", "label": 0}
{"text": "But I'm not saying intentionally dying is bad, just using it to abuse the old bounty system", "label": 0}
{"text": "Ok? Does him currently being Diamond 1 somehow negate the fact that he consistently ends ranked seasons no lower than masters? And usually GM/Challenger.", "label": 0}
{"text": "Comet is probably fine on Vex, but is unreliable. Realistically, you're only going to land it on feared targets, people will dodge it most of the time otherwise. Elec is guaranteed to land as long as you can proc it, which is relatively easy to do on Vex, since she wants to weave autos in trades already.", "label": 0}
{"text": "I still love the good old g2 va skt and g2 vs rng. Skt vs Rox and skt vs longzhou were also amazing. I personally haven’t felt the same about bo5 from like 2020 onwards. I’m yet to see one and go that was one of them I can happily go back and watch again. \n\nI might just need to find the right ones", "label": 0}
{"text": "We just need to reach 2027 with an active and prolific pro scene. By 2027, those born in 2009 would be 18, and there are immense chances that we get a pro younger than the game playing at Worlds. So yeah, 3 more years (or 2 if we have a prodigy with 17)", "label": 0}
{"text": "And yet reddit will tell you he doesn't deserve top 5 and that Caps deserves it more. Xiaohu could be argued for top 5 right with how successful he was throughout his career", "label": 0}
{"text": "RNG didnt even wanted to participate, Riot requested them to be there. You think a tournament without the LPL is any better? might as well just give the trophy to LCK.", "label": 0}
{"text": "How often are you seeing Kayn in proplay? And he's been extremely average in solo for a long time except this patch since the removal of goredrinker.", "label": 0}
{"text": "> Meanwhile riot seems very contempt milking league, 500$ skins, layoffs in riot, production cuts in leagues…\n\nLet's not talk about cases, gambling (aimed towards children) and the cut that steam gets with the sales.\n\nValve cannot lay off the cs go team because there are 2 people and a dream working there.\n\n> production cuts in leagues…\n\nI guess handing the entire league and ranked system to the saudis is a much better alternative.", "label": 0}
{"text": "He has a bad time into fiora, and phase rush Darius. ", "label": 0}
{"text": "Bruh as if valve isn’t milking their playerbase", "label": 0}
{"text": "Irelia is going to be better at taking towers. No longer hitting minions once every few seconds to make your passive last as long as possible.", "label": 0}
{"text": "it took that long because enemies decided to push in 1-2 at the time and we had smolder, enemies had soul, two barons and two elders at that point, we still only took 2 turrets from them the whole game\n\nwith the way they played, if we had actual jungler we would stomp them", "label": 0}
{"text": "Picking anything is dumb because it's a stupid question.", "label": 0}
{"text": "More than those strategies that try to avoid any player interaction. I don't play league to play pve.", "label": 0}
{"text": "The entirely of Rell's lore contrasts with Ambessa's personality. Ambessa loves her children and want them to grow strong for their own sake, while Rell's entire lore is about her being strengthened as a tool for her mother's political gain, and now Rell stands astranged while Ambessa says things like \"Medardas are loyal to our own\".\n\nTechnically Riot can retcon this, but it is far too glaring of a gap, and retconning it would be honestly quite disrespectful to Rell. You could also have Ambessa lose grace later, and use Rell as a tool then, but that would be more disrespectful to Ambessa.", "label": 0}
{"text": "Isn’t toyz in jail rn", "label": 0}
{"text": "You literally don't have to choose in your hypothetical. A character will need a mechanical kit and an aesthetic theme. Making a character representative is as easy as making a generic anime waifu. It costs almost nothing to make a character representative", "label": 0}
{"text": "Ok, that's your experience.\n\nI work 12+ years in a company that's 20 or 30y old and hires 50-120 people. I have never done anything that I personally haven't agreed with in any app that I've been developing. And believe me, I disagreed withy managers of all levels way more often that they wished.\n\nI cannot imagine I was forced to, say, develop a character that I think doesn't match the game. I have really hard time understaning people who let say, develop and set up annoying advertisements or other pop-ups.\n\nI work in a company and I'm part of it. I feel responsible and I really am for the stuff I create. And I'm super fine about it.", "label": 0}
{"text": "Gragas", "label": 0}
{"text": "I dont care about pro play at all.   \nI've seen a few soloq metas where Kayn was the fotm  jungler and it's not fun at all.", "label": 0}
{"text": "As a silver shitter I'd like to apply to be the new coach of The West: my training regimen starts with microdosing all players on shrooms to acclimatize, then a guided DMT experience, and if you keep fucking inting these basic concepts we're going straight to the K-Hole.", "label": 0}
{"text": "My problem was a single good playing person having a 1k gold lead despite every single person on their team is inting their asses off and the fed enemy adc ends up getting your shutdown. Does it still work like that?", "label": 0}
{"text": "Nah you don't understand.\n\nWhen he says it's a death angle, he's not saying, \"now I will intentionally feed the enemy a kill.\" He's saying, the enemy will probably try to kill him, and will probably succeed, but the advantages he or his team gain in tempo, gold, objectives, or xp by his pushing is worth the high risk of dying.\n\nJust like other Challenger toplaners that will stack a huge wave, crash it, and dive the enemy under tower. Even if they die and \"feed\" the enemy laner gold, the advantages they gain in denying 1.5 waves of xp is worth it in their eyes. It's not inting. \n\nBabus just does this all the time, and sometimes it's a mistake. In those moments he'll call it out as inting, because he's caught up in low elo aram mentality of risking his life without an adequate reward. \n\nBut most of the time, he's trying to be strategic with his pushes, and its a hell of a lot smarter than your no name bronze, gold or platinum player flipping random fights for 0 reason. You don't see Riot banning them for going 9/12, when they are actively trying to win the game less than Baus is.", "label": 0}
{"text": "this cannot be pantheon, his armor is so blocky and weird looking. kinda hate it tbh", "label": 0}
{"text": "I feel like people are extremely exaggerating the \"issues\" this client has.\n\nI went through half of this list and there is no big problem yet :D \nIt's just very subjective points you think should be improved.\n\nAnd if the chat loads a bit longer when you play two games in the same client at the same time, is that really a big deal?", "label": 0}
{"text": "From a thematical perspective it's cool. But from a kit balance perspective it's not. It eats up a lot of power budget without adding anything to his kit unless you die.\n\nI think they should remove it's lifesteal and then give Sion more power back into his normal kit. \n\nSion's Q really shouldn't be cancelable by CC in 2024. K'sante W is the almost the same ability now except he can't be CC'd during it.\n\nThey should add a CC shield effect like Dr. Mundo has onto Sion's W. Make it unlock at like 500 passive stacks.", "label": 0}
{"text": "People being stupid doesn't show that they're a failure, and champions not being picked a lot also doesn't show that they're a failure. \n\nWell, they are a failure if it's a popularity contest. \n\nChamps like Vel'koz or Nilah aren't popular, and that's fine. Not everybody can be popular in a game with 200 champions.", "label": 0}
{"text": "Damage will be balanced around. If the scaling is too high, it will be cut back. ", "label": 0}
{"text": "If that was true, the Arcane people are fcked", "label": 0}
{"text": "Jesus Christ, I know FFS. I work as a software architect.\n\nStop getting stuck in pedantics.", "label": 0}
{"text": " Why would i hate someone over a soloq game?", "label": 0}
{"text": "i think it gets overlooked cause the majority wanted Damwon to win. This was when Damwon was arguably the most popular team from Korea and reigning world champs. So despite EDG deserving the win and playing an amazing 5 game series, some fans have completely forgotten because they see it as the one Damwon lost.", "label": 0}
{"text": "Riot wants the game to be as snowbally as possible I guess lmao", "label": 0}
{"text": "Bro, she’s not going to sleep with you.", "label": 0}
{"text": "That graves played that so bad lmao", "label": 0}
{"text": "Hey, I was trying my best ok", "label": 0}
{"text": "No, that's silly. Babus never tried to give enemy gold.", "label": 0}
{"text": "Sona and Sera do not play the same fundamentally. People who say this have yet to play either of them.\n\nSera is a mage/enchanter. She plays more similar to Karma. Sera is better at chaining/following up other's cc with her E, or R. In team fights, she'll be able to do 1, MAYBE 2 big shields, since her w is a giant 22-18s cooldown. Sera is not a late game enchanter.\n\nSona scales extremely well into the late game because she applies item effects to everyone around her, on top of being a permanent problem if you dont take her out early in a teamfight (aoe speed boost, heal+shield on a 3s cooldown, ult also resets cdr whenever you heal or hit someone with q). Sona should be a pick when the enemy team drafts an enchanter so she can have an easy laning phase and outscale the entire enemy team by 2nd item.\n\nYou dont pick sera if you want healing, you pick her for the big shield and long-ranged cc followup. You dont pick sona for the CC, you pick her for the late game teamfights.\n\nTldr: seraphine is more similar to karma, sona is a late game enchanter.", "label": 0}
{"text": "vayne", "label": 0}
{"text": "Lately the riot launcher won't open sometimes. It is high power usage in task manager but nothing happens. \n\nAlso launching league puts an empty installer.exe on my desktop. If you delete it it will come back the next time league is launched.", "label": 0}
{"text": "you kidding right? WBG and LNG were not even top4 in spring, its a miracle that they even made it to the event. Top teams in LPL has been constantly changing from EDG/RNG to FPX/JDG/TES and now we add BLG to the mix\n\nLCK on the other hands has been top heavy since 2019? its always T1/GenG since OGN era then DK from 2020 onwards.", "label": 0}
{"text": "I couldn't agree more, I feel like sion has needed changes for awhile. He just can't compete with the champ pool anymore.", "label": 0}
{"text": "oh no!...anyway", "label": 0}
{"text": ">And bruiser damage always falls off after 25 minutes.\n\nAh yes camille, fiora, jax classic examples of bruisers that fall off after 25 min", "label": 0}
{"text": "is her father the honored Ambatu Khan?", "label": 0}
{"text": "Yeah if you actually watched lck, which given you have a t1 flare almost gurantees you dont, he was fucking awful all year.", "label": 0}
{"text": "Very good decision to remove it, a rare Riot W\n\nIt added nothing interesting to the champion, only made her harder to balance", "label": 0}
{"text": "Name 5 supports better than Beryl, debatably I would only say Wolf", "label": 0}
{"text": "There’s also the fact that junglers often are the catalyst to kills. Cs is is generally a 1v1 or 2v2 game. Jungle ganks winning a lane for your opponent should come with a greater risk", "label": 0}
{"text": "thats because the competition is getting more fierce, you literally to fill the roster with superteam caliber just to get far in international tournaments. newer players dont just get to join a prestigious team from the getgo.", "label": 0}
{"text": "Riven is doomed to never be good or made good because her kit is defined by an outdated and unnecessary mechanic that needs to be removed for the health of the game but remains because of the characters identity. If Ambessa really is just a soft replacement for her, a VGU that keeps the original character in the game, I can make peace with it. \n\nStill think the mobility is bonkers though", "label": 0}
{"text": "I'd school your ass in LCK knowledge even if we were to go back to 2013 stuff", "label": 0}
{"text": "League is half pve in general sooo", "label": 0}
{"text": "Riot should just come out and say they hate thebaus at this point", "label": 0}
{"text": "Good. It was a degenerate playstyle that shouldnt exist.", "label": 0}
{"text": ">The simple thing would have been to completely remove the animation canceling, but it was part of her core feature. And by then, it was already so baked in her existing playerbase that it would need be a major rework, alienating them.\n\nOk so why did Riot remove Caitlyn headshot cancels even though they were in the game for roughly the same amount of time as Riven fast Q, doublecast etc.? \"Champion favoritism is not real\"", "label": 0}
{"text": "I mean that meme existed way before any sion nerfs so it really isn't about that to begin with", "label": 0}
{"text": "Why so? And I genuinely am curious.\n\nI get that T1 is a popular team, and that extends to the LCK as a whole - but it seems that people associate popularity with quality of play here.", "label": 0}
{"text": "Actually your opinion is the one lacking the sense and understanding of the players as you seem to have 0 clue of what Jankos did without Caps.\n\nNo one thinks Jankos is the best EU jungler because he won LEC while being with Caps. What makes Jankos the best jungler is really 4 main things.\n\n1. 2016 H2k Worlds run. Yes H2k got lucky in QF with Albus nox luna draw but the week 2 H2k performance of group stage was the greatest form I have ever seen a EU team put up. \n\n2. 2018 G2 win against RNG, people talk about Perkz and he did carry that series but Jankos also put up a great performance, taking 2 separate EU teams, years apart to semis. I don't think any other EU player have done that.\n\n3. 2019 MSI win. If Caps won MSI with different players that would diminish this accomplishment but he hasn't, clearly indicating this team brought something more than other players.\n\n4. 2019 Worlds run. Jankos was vital to their semi finals win against SKT. Amazing olaf jungler performance.\n\n\nNot only was Jankos already more accomplished that any other EU jungler before he joined Caps, even with Caps he showed exceptional gameplay that clearly elevated G2. His LEC wins with Caps are all empty trophies, no one gives a shit about his LEC trophies with G2, those are expected.", "label": 0}
{"text": "Lb, Gragas, Corki, Gnar, Akali, Tristana, Akshan, Kennen.", "label": 0}
{"text": "Man, Reddits “Latest” feed has some real unfiltered cringe…", "label": 0}
{"text": "The whole point of the bounty system was always about assisting teams significantly behind in catching up.\n\nIf you are even on gold, for any reason whatever that is you don't deserve to get a 500g injection which just puts you ahead for no reason.", "label": 0}
{"text": "That's a good example, but she's ranged. She technically will always have better all in than melee champions just due to the fact that she can keep them at bay. She technically violates that rule, but any ranged champion can deal with her pretty effectively. That's why aery scorch is becoming popular on her, to focus on short trades since her all in against other ranged champs isn't very good. ", "label": 0}
{"text": "Surprised more people haven't seen this, emblem made a video on it already", "label": 0}
{"text": "Lmao, if you were in game for 40 mins it was definitely winnable.", "label": 0}
{"text": "Deft is an interesting case study about how Riots narratives and winning Worlds change people opinion on a player. If you asked some before 2022 if Deft was the goat AD they would say no, mention how guys like Ruler Bang and Viper are ahead of him. But after he won Worlds there were suddenly people arguing that Deft was the 2nd greatest player of all time. Despite Zeka being the clear and obvious main carry and looking absolutely insane against Scout Chovy and Faker. \n\nDoesn't help that the entire music video focused only on Deft and ignored Zeka( the best player at the tournament), Kingen ( FMPV), and the 2 time Worlds winning support Berly. I will never forgive T1 for losing that final because of the annoying narratives that spawned since.", "label": 0}
{"text": "Of course, there are already multiple, different generations of pros.\n\n\nIn gaming, the average career is much shorter. I wouldn't even count Faker as first generation pro in LoL. People like Imaqtpie, TheOddOne and so on are like 5 years older and have been popular and \"pro\" players since season 1.\n\n\nMany of todays pros and especially rookies are joining the scene at 17 - 19 years old. These guys were like 9 years old when Faker appeared and probably have watched him play their whole life and got inspiration to become like him. \n\n\nThe barrier of entry is high but there are also as many resources to get better than ever before. Kids are smart and if they start playing at a young age they will eventually beat the older pro's as they are basically giving them training until they evolve into their prime. \n\n\nThe only thing which could possibly destroy lol esports is Riot. If they dont keep the core values of the game, which is the reason everyone started playing and loving this game it will slowly but eventually die. In my opinion this is what happened to Fortnite. It was a good game, until they added too many gimmicks which steered the game in a completely new direction. It went from the biggest game to a mediocre in just one or two years. Sadly, I see the same trend in League the last few years... It started slowly but its accelerating. ", "label": 0}
{"text": "Kamila! DaddyCock228 misses you!", "label": 0}
{"text": "Totally agree with all of this, and going to add on Drakos casting with my favourite line in league history, the now iconic \"T1 vs the LPL\" ending.\n\nI still get chills every time I watch that. Alongside oner flashing the ashe arrow, guma 1v2 aatrox zeri and faker azir, this was absolutely my favourite bo5 of all time, regardless that it was 4 games.", "label": 0}
{"text": "Not to mention before the game even got close to time it was already being lauded as “the real finals” and then we 3-0d weibo.\n\nSo it was all the expected hype and more and so it never had a moment of being underhyped.\n\nI woulda loved the 5 games also but when canyon rolled over them with graves I had a feeling the China v Korea gap was different than believed.", "label": 0}
{"text": "Chow-ex (chaox) vs Imaqtpie", "label": 0}
{"text": "It only took them 6 years to make Irelia's passive half-work on towers\n\nLet's go!", "label": 0}
{"text": "SHR - OMG 2014 semis, InSec playing Fiddle, then Pantheon", "label": 0}
{"text": "40% or 60% is going to be permabanned and ruined games no matter what just depends whose team is getting screwed.", "label": 0}
{"text": "> move to a completely different country (france to uk) for no reason and just ONE bo5.\n\nI might be crazy but i feel the people from the UK that couldn't go to france are very happy they got to watch the game there\n\nLeague reaching more people is good even if it makes riot/teams burn money", "label": 0}
{"text": "hard disagree. high mastery teemo on our team = its over. high mastery teemo on enemy team = free win", "label": 0}
{"text": "If they're hotfix changes, generally Riot doesn't want to make it right, just less terrible. Better to hotfix from garbage to bad than OP by accident.", "label": 0}
{"text": "Almost all of those champs rely on their poke in lane to allow them to all in. They prefer to play slow, trade health evenly, then go for the all in when both champs are low. \n\n\nTrist definitely has strong dps, but she's also a ranged champion. She technically always has better all in than any melee champion because she can keep them at range. She violates that rule, but can become a liability in the late game if her team is just a bunch of squishies. She has no cc and very little utility, so her weakness comes from draft rather than champion strength.", "label": 0}
{"text": "Most of them have a very depressing ending, but i remember this nida vs hecarim gigagap", "label": 0}
{"text": "# Don't ever say it's over if I'm breathin'", "label": 0}
{"text": "What if she's more like a grand child or relative ?", "label": 0}
{"text": "She's basically another riven. You get ahead, you'll take over, don't do that and you're weak. She's hard to play so she'll average out to losing lane more often than not and losing games by proxy. Her numbers might be overtuned but the kit itself works fine", "label": 0}
{"text": "It really depends.\n\nHas he more cs , same amount of xp? Does he currently have tempo because of the recent death and the opposite toplaner can’t recall?", "label": 0}
{"text": "His passive is cool, just not when it lets inting Sion work. If the bounty change actually removed that strat, his passive can probably stay.\n\nIf it does change, I hope it's something like he gets a free cast of his R on death and dies on collision. It can have reduced cc or damage or whatever, it would just be so cool.", "label": 0}
{"text": "Bruv made entire novel about unreleased champion when nobody asked xd", "label": 0}
{"text": "Yeah but by 2nd generation of pros, I meant like, the child of a former pro player. Take for example if Diamonprox or AlexIch's kids either become pros. They'd be \"2nd generation\" pros since their old man was a pro back in the day. Kinda like how in basketball, you got Lebron's kid now playing in the league with him in the Lakers.", "label": 0}
{"text": "TLDR every single accusation EU supporters said was why LCS sucked also happened in EU.\n\nEvery accusation was a confession.", "label": 0}
{"text": "can they revert the sion nerf then?", "label": 0}
{"text": "Meanwhile Jax took 15", "label": 0}
{"text": "Bro we play the same champs the same way wtf.", "label": 0}
{"text": "Looks more like 'Solari Soldier' from LOR than it looks like Pantheon\n\nhttps://runeterra.ar/lor/cards/03MT088", "label": 0}
{"text": "Because bruisers are just fine into gragas.\n\nGaren gets a free lane, Darius gets to zone, Illaoi does Illaoi things.\n\nEven fiora who is quite fragile, still is at worst 50/50 while outscaling.\n\nSure you can’t repeatedly solo dive a gragas, but you can easily zone him. ", "label": 0}
{"text": "Yup it’s an FGC term and about all fighting games will have some.\n\nhttps://glossary.infil.net/?t=Option%20Select", "label": 0}
{"text": "Very obviously Garen", "label": 0}
{"text": "Married to the grind", "label": 0}
{"text": "Man, I am sure Deft loves it. But I do not like this song when it compares to other World's songs.", "label": 0}
{"text": "then we agree, cool :)", "label": 0}
{"text": "I mean I would say the majority of challengers do indeed make it there without playing his high risk style of gameplay\n\nI have no dreams of hitting challenger. I guess we should just delete reddit if we're not challenger? Are you to challenger to think your opinion is more valid?", "label": 0}
{"text": "Faker Qiyana incident Aware", "label": 0}
{"text": "It will be around for sure. Just not as big. There's a reason why riot is pulling back on all things league like the big 2025 update and the pro scene.", "label": 0}
{"text": "I'mma send Faker a Legends Never Die music box.", "label": 0}
{"text": "I think hearing \"Shutdown\" might get a bit tiring if its at 100 gold.", "label": 0}
{"text": "Legends Never Die.\n\n...", "label": 0}
{"text": "eh lot of adc's will still prefer ER, collector or bork over this item. Honestly i expect only very AA heavy crit adc's to use yuntal like zeri and jinx", "label": 0}
{"text": "\\+ it costs money to stay there, so for teams who are out of the running makes sense to save some $", "label": 0}
{"text": "kids usually don't like the same things as their parents so they would probably play other games like fortnite", "label": 0}
{"text": "I'd still be extremely unhappy to play with them. I can logically understand that they win more often than not and still absolutely despise that they take the game 100% into their hands. That 45% of the time where they lose is abject misery for the Sion's team as a fed Jax or whatever eats them with a 6 level lead at 15 minutes.", "label": 0}
{"text": "Well I guess they didn't.", "label": 0}
{"text": "Allies surrendering because to them winning is the only goal so when they think it cant be done they just want to leave.\n\nSurrendering has its place but in ranked it happens too much, even if the vote ends up 3/2 or 2/3 the feeling that a couple teammates are done with the game is there which isnt great.", "label": 0}
{"text": "It takes skill to know when it's worth to die, like getting a tower and dying in the process. But dieing, losing nothing because of sion passive + ult back to lane, gaining gold from whatever play you did and then your opponent gets punished with a bounty was dumb. Bounties are meant to exist to make the person who's behind able to catch up, the 0/11 sion with 3 items is not behind the 10 kill Fiora with 2", "label": 0}
{"text": "Fuck", "label": 0}
{"text": "Kayn is 4th in wr for junglers in games past 35 minutes according to a league of graphs.", "label": 0}
{"text": "Ah yeah I agree. I'd actually like them to just make it a mechanic and list it with her passive. Adds fun skill expression and more decision making to how you want to move", "label": 0}
{"text": "God damn PLEASE fix the ww bugs instead of whatever this is", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Take a shot everytime someone mentions teammates and take two everytime someone mentions balance or champ design.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Which is kinda awkward because if a regular player copied his playstyle (correctly, so winning included) without the big name, I don't think they'd get unbanned.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Nah, it’s the 78 notes one. The song in the video had way more than 50 notes plus the 78 one looks similar (watch the lock).", "label": 0}
{"text": "Trundle is funny enough, one of the easier bruiser matchups for gragas.\n\nDarius or Illaoi or garen or Keld? Gragas has a really really bad time.\n\nInfact for Darius and keld, they have an advantage over gragas from 1 until 18 and there isn’t much he can do other than farm from range.\n\n(He literally cannot trade into mounted Kled)", "label": 0}
{"text": "When he tried his hardest to actually win, and when the meta suited him, he was easily a Challenger player.\n\nRiot hasn't been kind to his playstyle and I don't think he could make Challenger now even if he tried. Also he has been randomly griefing games (the AP Irelia saga) rather than trying to win all the time.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "quarterfinals and semi finals is in the same arena you fucking goblin", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "horrible advice for ranked. if you want to be a perma casual in normals sure, but your goal in ranked should always be to win, and if you're not winning, stop playing that champ", "label": 0}
{"text": "Lot of companies try to ride the wave of whatever is current, and making a moba didn't really work out for almost anyone but Riot and Valve.", "label": 0}
{"text": "only needs to be around another 5-10 years, I'd assume so", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "My teammates", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "all of them. most people don't one trick a champion by looking for a champion to one trick. you just start one tricking by playing a champion you enjoy. and some people get bored of the same champ over and over and never one trick, which is also fine.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "I was just saying this lmao", "label": 0}
{"text": "And back in the old day when the client was still shit it was ultimate skins", "label": 0}
{"text": "The amount of people that will troll over literally the smallest things. I figured I'd try my hand at juggling this split, I was placed I4 cause 4 of placements 1-3 people trolled for minor infractions, but im now B2 almost B1 and still climbing pretty well using mostly the Dyr, but if I don't gank while say... bot is shoved under enemy tower, my bot will start inting/trolling in some way cause I don't dive full hp Ezreal and Leona, the absolute insanity of the toxicity in LoL is just... insane. But Riot does like hurtful words, who cares about people intentionally ruining games because you don't int for them or something", "label": 0}
{"text": "Name me the bruisers that die in 3 autos from ADCs and the ADCs that can do that", "label": 0}
{"text": "Hot take but i think tanks should not be able to go even against fighters in lane, because if they are allowed to do that then fighters are down in lane because their items are much cheaper. For example in this matchup fioras first core item is 3300g(ravenous) typical sion item is 3000(heartsteel). And their second items are even cheaper, sunfire for example is 2750 compared to fioras second trinity. \nThis would also compound the issue that tanks scale extremely well into 5v5, while many fighters do not. Even in this matchup fiora sure will be fed, but she is beyond shit in a teamfight compared to sion. ", "label": 0}
{"text": "If Ambessa would be penalised for missing a dash it would imply some reward for hitting it. Are you asking for Ambessa dashes to do damage/cc? Because that's a terrible idea", "label": 0}
{"text": "Where was this posted", "label": 0}
{"text": "What are you talking about? CS is waaaaaay harder than league", "label": 0}
{"text": "So in basketball if you score a basket, the next basket will still require the same amount of skill & effort to score. Imagine if it's like League of Legends, you score a basket and the basket gets bigger, now you don't need to be as accurate to score again. Doesn't matter if your first basket was a lucky shot or if you just happens to make the correct read. Now you can score more easily and you dont have to be more skilled than your opponent. \n\nThat's League's snowball mechanic and the reason why we need bounties.", "label": 0}
{"text": "i specifically said \"all but identical\" because yes they are of course not exactly the same. i am not saying there is no room for seraphine to exist in league - certainly not if she ended up primarily as a solo laner the way riot originally intended. my point is that the similarities between them run *far* deeper than the absurdist abstractions this community likes to make when a new champion comes out, and to suggest equivocacy exists between those comparisons and that of sona vs sera is just wild to me. \n\nyou can dig into the minutiae all you want to find ways they differ (which obviously exist and no claim has been made to the contrary) but they feel overwhelmingly similar to me when clearly they don't to you. you can't argue someone into feeling something, so i'm gonna leave this here and move on", "label": 0}
{"text": "problem seems self inflicted", "label": 0}
{"text": "it is the worst...i am jgl main and in those games i am like 1.0.1 while team lead 15:2 and i don´t know what happened...before you do all drakes, 100ganks, lose lose lose...i can relate...i can relate", "label": 0}
{"text": "Lee sin, vi, nocturne. \n\nAdd my discord weonlygonorth and we can prove it in a match.  I'm sure you won't be interested in putting your money where your mouth is though.  \n\nHappens.", "label": 0}
{"text": "\\>Almost all of those champs rely on their poke in lane to allow them to all in. They prefer to play slow, trade health evenly, then go for the all in when both champs are low. \n\nThis is a great argument, but this is the way all champions work, at least until lvl 6. Perform a braindead all-in pre 6 can a few champs like WW, Darius or Tryndamere.\n\nHow weak Ahri is in 1v1 right now is more of an exception for this game.", "label": 0}
{"text": "It ATreus, but possessed, Why are people saying too young? Atreus is like sixtey or seventy,", "label": 0}
{"text": "Average for a decent nasus is 300 at 20, lower means your bad at CSing/ got hard zoned, higher means your really on point", "label": 0}
{"text": "That's what I am saying. For every 4 games you lose to trolls, you win 5 due to trolls.", "label": 0}
{"text": "My FPS dipping.\n\n  \nFor whatever reason, my fps dips like nothing else in a rank game but can hold up for 1-2 normal game fine.", "label": 0}
{"text": "instead of this\n\nmake every tank stat increase champ size\n\nthe reward for being large is being large", "label": 0}
{"text": "Last time i checked anything after since the Diana rework has been a disappointment", "label": 0}
{"text": "get outta here!", "label": 0}
{"text": "Swiss stage at the CS major took only 4 days to complete compared to 11 days at Worlds. I would say 7 days, so an entire week, would be a nice middleground to prevent overlapping games. \n\nThe knockout stage is a joke though. Spending 3 entire weeks for 7 games is crazy. CS would be done in a week and keep the hype. Also allowed spectators to enjoy the entire knockout stage in the stadium. Nobody’s traveling two cities and take three weeks off to catch all the Worlds knockout stage games.", "label": 0}
{"text": "Idk. The drx run 2022 is something I don’t think will be erased anytime soon", "label": 0}
{"text": "I would argue most standard top laners that ambessa will be facing have strong all ins. ", "label": 0}
{"text": "my biggest spot of hatred for ranked is how so many people play it for \"fun\"...... like just go play TFT or quick match if you want some fun and stop fucking people actually trying to play the mechanics and dynamics to the fullest extent as a solid team. \n\nfor some reason, it's also almost always a lux mid or the supp that does this. lux throws and never helps objs even with lane prio or we've got the sera supp roaming at 7/8mins in with the bot tower somehow already half HP 😐", "label": 0}
{"text": "Does it work on Jungle monsters? Cause this could be a really interesting 1st or 2nd Item for Kindred", "label": 0}
{"text": "CS is just click someone's head before they click yours, and that muscle memory is shared with dozens of other popular games you probably played\n\nLeague is harder because clicking better doesn't make you able to 1vs1 anyone at any point of the game like CS, league it's an RPG and if you win or not a fight is mostly a numbers issue", "label": 0}
{"text": "i get that you can call one year a fluke but calling 2018-2020 a fluke is a bit too much lol", "label": 0}
{"text": "That's if we take that Ambessa \"lost child\" Kino is dead. Her lines imply that he turned his back on the family if Kino joined the rose or sided with Swain there's a possibility that rell could be his child or the child or a relative who's loyalty isnt House Medarda first.", "label": 0}
{"text": "Agreed, I don't even think it should be a choice, considering the years of balancing around the role. Junglers should start the game with smite, and the only thing they should be able to choose during champ select is their 2nd summ, and whether their smite is on D or F.", "label": 0}
{"text": "Lata mid players, theyre literally just gamblers. Perma give up cs for one roam that might give a double kill. If they got the double the win you the game. If they dont? Well now you have a new ai bot in your team whining on jungle diff", "label": 0}
{"text": "I would say it is the 3rd worst strat to exist in recent memory, funneling is number 1, top smite janna number 2, inting sion  number 3. ", "label": 0}
{"text": "X to doubt.", "label": 0}
{"text": "I thought 400 at 20 was the benchmark, although I haven't paid much attention to nasus since like season 5 lol", "label": 0}
{"text": "Zeus was 9 when Faker won his first worlds title", "label": 0}
{"text": "IG vs LGD Oscar night: both teams were actively trying to lose so they dont get seeded against EDG (best LPL team in 2015)", "label": 0}
{"text": "I can’t imagine why it wouldn’t. Seems like any auto attacks would trigger it", "label": 0}
{"text": "If you say wolf you're automatically disqualified. Let me guess your best jungler of all time is bengi.", "label": 0}
{"text": "https://www.sheepesports.com/transfers no rumors for Rogue except Comp and Zoelys out and joining different LFL teams", "label": 0}
{"text": "Not to mention how poetic it was for T1, *the* korean  LoL team, to win it all in their home country.", "label": 0}
{"text": "Lame ass smurfs", "label": 0}
{"text": "He has been literally challenger this year… and spent most of the year in Masters/GM", "label": 0}
{"text": "Tricked by the moo in his name huh xd", "label": 0}
{"text": "Almost 1/3 of the time\n\nIf we look at the bright side, we can call it improvement!", "label": 0}
{"text": "G2: BB - Skewmond - Caps - Hans Sama - Labrov\n\nBDS: Irrelevant - 113 - Nuc - Ice - Parus\n\nKC: Canna - Yike - Vladi - Caliste - Targamas\n\nHeretics: Carlsen - Sheo - Kamiloo - Flakked - Stend\n\nVitality: Naak Nako - Lyncas - Czajek - Carzzy - Hylissang\n\nKOI (Mad Lions): Myrwn - Elyoya - Jojopyun - Supa - Alvaro\n\nFnatic: Oscar - Razork - Humanoid - ??? - ??? (rumoured Upset Miky)\n\nSK: Jenax - Isma - Reeker - ??? - ??? (adc probably Rahel)\n\nGX: ??? - ??? - Jackies - Noah - ???\n\nRogue tries to sell their spot to Nigma Galaxy, Larssen will be their mid, otherwise unknown", "label": 0}
{"text": "Then don't complain when your sion is \"feeding\" because that's the optimal play.", "label": 0}
{"text": "Lol I was just watching ipav teemo VS ilaoi", "label": 0}
{"text": "fair, i was only willing to go back to s4 because i personally started in s4 so didn't want to comment. but people in s4 were still rolling double top sometimes too", "label": 0}
{"text": "Also shoutout to the Singed players who manage to proxy in the enemy base, immidiately farm multiple waves, and then wonder why their midlaner is angry about them", "label": 0}
{"text": "I totally agree with your arguments, but I just wanted to argue that since you didn't prove anything or give a solid argument for how the 3 players you mentioned were dragging down G2 performance at internationals it felt a shallow arguement just for the sake of hating\nAlso doesn't your previous argument get negated because of what you just pointed out? \n\n(BTW kinda off topic but G2 2022, the flakked targamas roster, internationals were good because they had a not yet developed BB and a botlane without sinergy and both also being rookies, also according to people at that time the team mental boomed completely after losing summer split so their worlds result were totally expected if you knew what was happening with the team environment)\n\nSo I don't really find correct criticizing players, especially rookie players, who just joined G2 and expect them to win worlds in just one year of development on how they play.\n\nEven if I don't really like Hans he's had some of the best matches a EU Adc has ever had even in internationals and regionals, now he's worse than what he used to be, be it a consequence of meta shifts game changes or his year in TL in NA he has 100% gotten worse, but those good matches in internationals have same year range between Hans' age and Jankos' age at that time for example.\n\nSo I don't really know what's the difference between Hans and Jankos since they both had good international and national runs, they both hadn't won a title without Caps in their team and they both unlocked their full potential in G2 even if it was short lived for Hans, I find it a good comparison.\n\nWanted to cram as much info as I could but I'm tired, sorry if some of it may be poorly worded", "label": 0}
{"text": "True, you need 10K health to get maximum size bonus from heartsteel.", "label": 0}
{"text": "This is why you look for lowkey good int plays where only the support can kill you xd", "label": 0}
{"text": "The worst people in league are probably the ones that go “ff” or “let me out” after a single death meanwhile their other lanes are winning. Some people just hate when they’re not the main character and then they end up ruining an easily winnable game", "label": 0}
{"text": "Vi is bruiser diver\n\nLee sin is a fighter skirmisher\n\nNocturne is a diver duelist\n\nBut fuck it im down to do this in a week when i will have access to my PC", "label": 0}
{"text": "Lowkey the fact you aren't at least 7 day vacationed yet actually annoys me", "label": 0}
{"text": "Yun Tal's crit stacking passive seems trivially short.  It seems like the only real point of it is to balance the item for the immense amount of stats it gives.", "label": 0}
{"text": "So because he took advantage of the broken system, they fixed it and now he's complaining about his micro cheats not working lol cope harder", "label": 0}
{"text": "Depending on your definition of farming from range and hard to gank and only looking at melee champs as you admit below ranged champions are a different thing: Illaoi (gankabke but risky), Zed, Akali, K'sante, Katarina, Wukong", "label": 0}
{"text": "I always thought an average of 100 each 5min.  Ofcourse you start lower early because of no cdr, but you will catch up", "label": 0}
{"text": "They all build bruiser! They're Bruisers!", "label": 0}
{"text": "Btw most likely there already is a bounty on this Fiora, it hasn't reached 150g so it doesn't show", "label": 0}
{"text": "At this rate renekton will get his by 2026", "label": 0}
{"text": "People still think this lol", "label": 0}
{"text": "yess", "label": 0}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because rant posts and sob stories are not allowed.\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 0}
{"text": "And congrats i dont need to know any other opinion you have, I know they are worthless.", "label": 0}
{"text": "Also the \"play again\" button on custom games legit does nothing, i hate that", "label": 0}
{"text": "Whatever they are still not dying in 3 autos", "label": 0}
{"text": "It doesn't matter if zilean is strong or not at this moment. He has been strong for extended periods of time for years and his pickrate has always been low.\n\nOr another example. Annie has had higher winrate than yasuo at almost all elos(including pretty high ones) for years as well. But how many people spam annie in ranked and how many people spam yasuo?\n\nThe message is clear and correct. People don't want to win at all costs. They still value fun a ton.", "label": 0}
{"text": "No he wouldn't. He was getting way more value from his playstyle then he would from conventional. I don't understand how any functional human that grasps how gold works would say what you just said.", "label": 0}
{"text": "The ranked mentallity seeping into draft games and in general people taking draft games too seriously because of ranked.", "label": 0}
{"text": "don't think it's disputable. probably the 1st and only worlds with a once in a lifetime series in every round, bar maybe RNG v T1 in quarters", "label": 0}
{"text": "a passive that requires you to die on a tank will never be cool or interesting in any way. just give him something cool like ulting people turns him into the now passive form and he can fight or something", "label": 0}
{"text": "If you think about it Season 1 pro players who played the championship in Phreaks basement should be old enough to have a 17 year old kid. But who would want their kids to have to go into the toxicity of League culture after they know the real deal?", "label": 0}
{"text": "I remember when the chronoshift project was alive and people were playing league on season 3 patch, one of the balance rule was no lee sin, has he was just too good compared to the old roster with players current mechanics (and sightstone..)", "label": 0}
{"text": "I don’t think the system is working properly right now, and a lot of players have caught on to this. I’m in emerald and like 8 of my last 20 matches had an afk within the first 10 minutes. \n\nI left like 4 this week and never received any penalty. It’s kinda cool", "label": 0}
{"text": "Refer to my response to your \"reddit gm\" comment", "label": 0}
{"text": "I still think it's SKT vs Rox. T1 vs DRX is a close second, but I felt like g5 Zeus just didn't quite show up on that Gwen pick so it's a little tainted. \n\nThe MF incident was just pure magic. I wish more teams did stuff like this. I've been saying it all tournament long, but with all the Skarner priority, just draft Milio and a tank top and you can't lose", "label": 0}
{"text": "Yes they are! You've never played above gold if you think these çhampions survive late game!", "label": 0}
{"text": "Could only really be Fnatic, unless he's lane swaping.", "label": 0}
{"text": "It's not really inting if he's doing it to win tho. At worst he just knows how to trade a death for objectives properly. No different than split pushing or roaming in essence.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": ">MR:  30 +1.3  -->  31 +1.55\n\nI can't take anymore of this \"magic resist = mid lane XD\". If people want to play Swain bot lane then let people play Swain bot lane. Because as we have seen earlier this year, AD champions can also be played mid lane and completely take over. \n\nSwain is a terrible champion against mages, he has no mobility and low range. It doesn't matter how much his basic magic resist gets because he can never even hit Orianna/Syndra/Hwei in lane yet alone kill them or push the wave faster.", "label": 0}
{"text": "I guess im wrong then", "label": 0}
{"text": "Some people are able to think with less rigidity than you seem to be able to. Nuance exists", "label": 0}
{"text": "Not really, they existex for over a decade. And unless it is extrmely lategame death does not mean much in terms of objective control, or thefe could be no objective on the map. \nLets say you die and have a 30 second deathtimer at midpoint of toplane, and drake is up, it would take enemies 30 seconds to reach(give or take) it if there is no contest meaning that by the time they reach it, you are already on the map your team can stall for the shorter walk you have to make, and what have enemy team gotten off your kill? 300+150g assist? \nYour logic would make sense if death timers were doubled and death meant more. \nBounties are good reward for taking down a stronger oponent, however i think they should work like assists do kill gold goes to the last hit but bountry get split between every champion involved in the kill, making it a lot less spiky and a lot more rewarding to teamplay, and if you get solokilled entire bounty goes to the killer. ", "label": 0}
{"text": "I think it's cool and interesting, kinda adds another tradeoff to focusing the tank.", "label": 0}
{"text": "bounties should never had come to this game imho.. they reward players for losing lane. same with fucking plates man.. you make a great roam and enemy stayed in lane? dw he got plates and babysat by riots gold system.. Enemy made 5 mistakes and died 5 times? dw if i make a single mistake bounties will reward him with the gold of 5 kills so he can fight back now.. fuck no if you lose you fucking lose..", "label": 0}
{"text": "Riot's policy against solo-carrying games. A single player can cost you the game but a single player cannot win you the game.", "label": 0}
{"text": "Alex Ich has son almost old enough to be pro, just saying", "label": 0}
{"text": "His world 2022 run themed \"Last dance\" will always be legendary, overcoming every opponent and achieving the impossible.", "label": 0}
{"text": "Collect all minions while in passive, instantly respawn after passive timer runs out, get back to lane quickly while playing for push/proxy. Every death rinse and repeat. Eventually, land a kill and collect bounty while opponent has to wait out longer death timer making them miss waves/xp.\n\nIt was just a wave focused play style that played for push/tempo advantage while abusing the mechanics of Sions passive.", "label": 0}
{"text": "My only caveat is that it's probably the second greatest Bo5, behind ROX vs SKT 2016. But yes to everything else!", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, and webm videos must be submitted as a link in a text posts - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "the team coordination element is much more difficult in LoL than CS.", "label": 0}
{"text": "Without bounties there would be no point playing the game if one team gets an early lead. They get the same amount of gold as you for everything but it's 100x easier to kill 0-7 lux than it is to kill 7-0 irelia. Bounties are meant to make games more interesting to play for both sides.", "label": 0}
{"text": "LCK in general also always had the better players in history of professional league so I think that is also a big benefit.", "label": 0}
{"text": "You run msi afterburner?", "label": 0}
{"text": "It's not gold disparity between 2 opposing players, it's based on the gold you earn and the gold you give when being killed.\n\nThe more you gain gold without being killed, the more gold you'll be worth, and the more gold you give out to enemies (trough being killed), the less gold you'll be worth,", "label": 0}
{"text": "A lot of songs are like that, get hated first but after a while grow in people's hearts and age finely.", "label": 0}
{"text": "Wouldn't say that's a fair comment... I regularly say \"it's just a game\". Not because I don't care, but because it's a game...\n\nI go into every game with the mindset to win and will always do my best. But if some loser wants to type offensive messages like he's not had any success in life outside of this, he is getting reminded that it is \"just a game\"... those people need to grow the fuck up.\n\nRanked play isn't an excuse for abuse, it is a place where people should try their best to win every game.", "label": 0}
{"text": "Then watch that 1% crit chance after 5 attacks to randomly win trades in lane.\n\nWelcome back 1% crit chance rune.", "label": 0}
{"text": "You can find comments in this thread saying Sion is fine in lane. People not only have a very hard time separating the strategy from actual inting but also simply understanding Sion as a champion. I don't do Baus's strategy but if it's dead I hope they buff Sion elsewhere, I main him but he's too weak in lane right now unless you can get the proxy off.", "label": 0}
{"text": "Team games are like this, humans are selfish irl imagine online", "label": 0}
{"text": "So, normally on other champs you need to spend 6 seconds to recall and you spend 10 to >50 seconds on grey screen when you die depending on level. Well Sion passive lasts longer than death timers pre-  lvl 7 (used to be higher), so he can CS, get a plate, and return kill during what is supposed to be his grey screen after you kill him. When his passive runs out, he instantly respawns in base. So now you've CS'd and backed with your gold, but you didnt need to spend either 6 or 10+ seconds doing so.\n\n\nMinions spawn every 30 seconds, and if playing normally, sometimes you have to give up one of those waves to back or because you died. Sion wouldn't miss that wave. Sion with TP missed them even less. Literally by 10 minutes into a match, a well played inting sion is up 20 CS worth of exp, and likely up in gold due to towers. \n\n\nPlus your 8th kill in a row against an inting sion would give you like 120 gold, not 300. So you have a 1k bounty, he has all the tower plates and 11 CS per minute because despite you killing him 8 times he never missed a wave.", "label": 0}
{"text": "Even Baus who has essentially invented the strat interacts with lane opponents a lot. I'd argue you are saying to play it perfectly, not correctly. Saying 'if pigs fly' doesn't really make the debate any better, we should be talking about actually feasible scenarios when judging a strategy. Sure, Baus can have prio after first 2-3 waves then go proxy, but often his opponents still chase him down and kill him. With the old bounty system this could actually be the less ideal play for the enemy, but it's what happened more often than not even in challenger. If your ideal strategy involves the enemy playing ideally to your strategy then it isn't your strategy, it's just a gameplan that almost never works out. Basically it feels pointless to argue about this point since it never happens the way you call 'correct.'", "label": 0}
{"text": "Fnatic with the legendary -garbage +garbage move to lock in next years Worlds implosion in record time!", "label": 0}
{"text": "His comments here and on the tft sub seem completely normal, even if i disagree with a lot of what he says.\n\nLets chill out on the kinkshaming, yeah?", "label": 0}
{"text": "Alex Ich has 11 or 12 year old son by now", "label": 0}
{"text": "$350 on 4 occasions to unlock the full skin tho", "label": 0}
{"text": "This submission has been removed because [text posts need to have at least 100 relevant characters besides the title](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context).  Please resubmit with a post body describing your submission. Padding your submission with irrelevant content or spam will cause it to be removed again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "What does the community want?", "label": 0}
{"text": "Excellent write-up! Honestly, this deserves to be its own post with the details capturing the emotional weight of 2022 worlds. \n\nJust as a very small add-on to your comment, Deft wasn’t on any bad teams until 2021, but had an infamous Worlds quarter-finals curse partially due to some unlucky draws against the eventual Worlds winners: against iG in 2018, after placing 1st in LCK summer; and Damwon in 2020, after placing 2nd in LCK summer (had Chovy, Keria, Doran on his team).", "label": 0}
{"text": "Not only that but he laos promotes such playstyle to his fanbase, you cant imagine how many baus sions i met in top lane at his peak popularity and every single one of them got stomped into the ground because they were doing it wrong. \nHe did hold a high rank, but he did not explain the strat properly and memed it so peopel though that inting was actucla strat, not that it was the consiquence of said strat.", "label": 0}
{"text": "Because he would never miss a wave. By dying between towers and clearing the wave in passive he can be back in lane without losing a minion, have a massive tempo lead and force the opponent to take a bad recall.", "label": 0}
{"text": "Deft used to share the story that he would brag to his high school friends that he's challenger but they weren't that impressed because another classmate was rank #1 (Faker).", "label": 0}
{"text": "Yea it's getting so fierce that a shitter like Doran keeps winning titles", "label": 0}
{"text": "Yeah it annoys me as well I think I should be perma banned. So disrespectful to everyone else’s time", "label": 0}
{"text": "No, K'Sante was losing to Urgot only after he got nerfed to death. New K'Sante is very much strong against most of the champions you listed. Not sure about trundle and Garen.", "label": 0}
{"text": "Because all the \"prestige\" went itnto either pass skins or mythic scams.", "label": 0}
{"text": "I think in the patch it didn't specify if turret playing and tower gold counts towards bounties or not, or the rate they do. For example minion gold gives a smaller bounty than champ kill gold does, and champ passive gold like TF or Draven doesn't count at all.", "label": 0}
{"text": "Noooo, you can't make hold them responsible for their incompetence and laziness. \n\nbuy the 32k rp skin instead. \n\n\"There are no issues in league of legends.\"", "label": 0}
{"text": "RNG vs SKT the next year was pretty damn good too", "label": 0}
{"text": "You’re not going to get critical thinking from this comment section lol", "label": 0}
{"text": "Nothing makes me more seeing my supp lux e or what ever wave clear took they have to kill the casters on every wave they can l.", "label": 0}
{"text": "Tbh if you haven't been playing long enough to figure out the answer to this question on your own you'll be fine", "label": 0}
{"text": "BDS and KOI had half the talent of FNC and has similar performance, so they probably work better.", "label": 0}
{"text": "If it becomes problematic or annoying they could always have it give 25% crit all at once when it hits 125 attacks. Kinda like how manamune doesn’t give you any on hit damage till muramana is stacked.", "label": 0}
{"text": "That wasn't their tactic with aurora ", "label": 0}
{"text": "You need to get a much bigger lead to achieve that now. Before, you could kill a 0/10 champ and get like 120 gold as a reward but got 150 added to your bounty. Literally punished for winning.\n\nNow the bounty is 1/4 of kill gold- so if you only get 120 kill gold, you only get an extra 30 gold bounty", "label": 0}
{"text": "I WAS IN ALPHAAAA!!!!", "label": 0}
{"text": "A super dedicated Deft fan can order one for themselves with a link to the NewJeans GODS Youtube MV and the same inscription written.", "label": 0}
{"text": "Womp womp.", "label": 0}
{"text": "It was high skill, but also super toxic and unfun. I don't want to be punished for killing the enemy even if his suicide took skill", "label": 0}
{"text": "Unfortunately this is just an edge case. Not having smite sucks but there isn't a way to force smite without other problems", "label": 0}
{"text": "I would be shocked if league is still going strong in 10 years.", "label": 0}
{"text": "? Most people on here and twitter literally agreed it was an okay to good song. Just not a good worlds song. Which it wasn't.", "label": 0}
{"text": "Good, bounties should look at gold diff, not only kills.", "label": 0}
{"text": "I hate this guy.", "label": 0}
{"text": "What if Sion did not abuse his passive during all that time? Play under tower, most probably losing XP and gold due to how abusive quite a lot of the popular top laners are in the first couple levels.", "label": 0}
{"text": "I would turn the 1st tier mid turrets into a permanent statue of Faker.", "label": 0}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because tech and account support related posts are not allowed. Please [contact Riot support](https://support-leagueoflegends.riotgames.com) instead. For tech specific questions, you can check out /r/leagueoftechsupport as well. Long wait times or them delivering final judgement on an issue still means that these topics are disallowed on the subreddit\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 0}
{"text": "I appreciate that fly was willing to play nonconventional. Playing standard vs gen. g. would have just had them getting squeezed", "label": 0}
{"text": "On release, they were very similar in game role due to Seraphine's passive being broken with item effects, which turned her into a button mashing (to get passive running) aura bot applying teamwide Ardent/Staff with a catching ult.", "label": 0}
{"text": "That is underselling Peanut quite a bit. He picked a dog jungler that has to avoid Kayn as long as he can and he did just that.", "label": 0}
{"text": "so if I see a bad matchup but don't wanna play it I just don't take smike and go remake ?", "label": 0}
{"text": ">  but sometimes he's doing what he does in this clip, just running under the enemy's tower at low health and going \"Oopsie poopsie, unlucky\" for the stream, where he's not gaining a single advantage for doing so.\n\nLooks like he was getting ganked in this clip, knew he was dead, so tried to get whatever he possibly could out of it.\n\nOften when he goes under enemy tower and dies, it's to leave the enemy laner at low HP without TP which forces them to either stay on low health or leave the wave in a terrible position.\n\nObviously some of his deaths are bad. But literally everyone makes mistakes. He is still allowed to make mistakes even though his playstyle is unusual.", "label": 0}
{"text": "5 after next week hopefully.", "label": 0}
{"text": "This series is it for me, but I'm also biased because it's the only series I've ever seen in person", "label": 0}
{"text": "the only time i wasnt sad about faker losing in worlds. how can anyone not like deft? he is so kind", "label": 0}
{"text": "Bro I don't know why that Oner play isn't more legendary. He almost point fuckin blank flashed over an ability that is notoriously hard even for pros to correctly flash (because of how dumb the hitbox is) at an absolutely critical moment, THEN immediately hit an engage that wins them the fight AND gets the dragon to take them to soul point. Like I dunno how much harder you can carry a play than that, especially with his health being taken low and being pinned in by the wall. Absolute ice cold gigachad play for the ages.", "label": 0}
{"text": "Thing is it is a very tight like to walk, they tried to innovate with saveral champs like yummi(for all her faults it was a new design shift) and got shit on by the community, nafiri has some interesting interactions with her dogs but is severely unpopular. Aphelios was deemed too complacated(not taking his numbers into account) by the playerbase.\nPlayerbase  has said loud and clear through the community and interaction with siad champions that they dislike innovation if it is imperfect, thus riot being a company listened. \nAs saying goes \" customer is always rigth, in matters of taste\", so they stick to what they know player engage with and enjoy.", "label": 0}
{"text": "Nidalee Ivern Rengar are the first to come to mind.", "label": 0}
{"text": "Sion passive hasn't been \"abusable\" for pushing lanes effectively ever since they changed his damage to structures under passive", "label": 0}
{"text": "Deft playing out of his mind to carry the team to a game 5 win was literally movie script in real life.", "label": 0}
{"text": "Nilah objectively failed her intended purpose, which was to bring Fiora/Yasuo etc players into bot lane at a time when Bot playrate was struggling. She ended up not really appealing to anyone but people who duo with a Taric/Senna main.", "label": 0}
{"text": "I'm amazed by the fact that Riot Games after all these years and billions earned never provided high quality educational content for new players, it has always relied on the community for that.", "label": 0}
{"text": "the fac that nowadays players approach the game from their perspective, rather than the teams perspective. most games my team feels much more like 5 individual players than 1 team. \n\ni dont know what caused this, whether its the increasing individualism and fear of social rejection, or that more and more players have grown up with first or third person perspective games rather than RTSs. do any of you have an idea?", "label": 0}
{"text": "has nothing to do with how hard it is to implement. If they really wanted it they would already have added it. However it seems like it will cause way more problems than create. You got filled jungle and dont want to dodge again? just dont smite and remake. And they cant just punish the jungler because of role swaps in champ select", "label": 0}
{"text": "That wasn't hard to do anyways", "label": 0}
{"text": "Gold.", "label": 0}
{"text": "Seems like she could be with the ult but without the dash working on walls i don't see it as much.\n\nI could see her top/mid.  Her ult isn't point and click but it isn't exactly short range either. Being able to join or set up a gank from that range is huge.", "label": 0}
{"text": "I’m actually convinced that MDK and KC are some of the most important orgs to the future of the league. They have brands and aspirations.", "label": 0}
{"text": "It's food for my soul. His playstyle is finally nerfed, I'm so happy. 😘😘", "label": 0}
{"text": "The SSG T1 Final will always be the most memorable one. The Rule Varus Flash to seal the end of SKT dominance", "label": 0}
{"text": "Let me remind you shen held nearly 56% winrate top for 8 months and not a peep from reddit, irelia touched 49%? Was deemed incredibly broken. Hell before this patch half this reddit complained about how op yone was, a 47% winrate champ.  This sub has some extrme biases and blindspots.", "label": 0}
{"text": "leaked on YouTube a few hours ago https://youtu.be/EVSJZkA_0k8?si=w23tNAn7xEMmyd4Y", "label": 0}
{"text": "ap without pulling all the stops in term of clone usage and map awareness from traps falls flat. Yes, he's better if the team can engage off a trap, but a good ap shaco requires many hours on the champ because it's a lot setup for the team and very small kill threat unless you manage to pick isolated targets with clone bomb or multiple traps", "label": 0}
{"text": "Anything DRX in 2022 tbh", "label": 0}
{"text": "Did you blokes watch FLY vs GenG? \n\nThis is going to go down as an all time banger", "label": 0}
{"text": "> While FLY are taking Gen.G to game-5 with Nukeduck and mithy as coaches, LEC just let their best players to leave the scene\n\nThis is a big one, and something not talked about nearly as much as it should be.\n\nCoaching is a huge deal, and the LPL understood that years ago, doing everything they could to get the best (Korean) coaches in the world when they were available.  Over time, game knowledge and map play improved significantly in the LPL, and a lot of good Chinese coaches developed as a result.\n\nThe LEC doesn't have anywhere near the coaching talent the LCK did/does, and certainly can't afford to lose what little they do to other regions like this.", "label": 0}
{"text": "Its been 300 average for awhile now, cause low elo people either ruin they're farm with E or don't try to space minions to get more stacks, as compared to high elo more generally doing that, which had kept it 3-350 for a couple years now as the 20 average", "label": 0}
{"text": "Beatrice :(", "label": 0}
{"text": "Dylan only good coach?\n\nI mean the two you listed are from Europe, seems like a weird wording.\n\nThe leak of talents is the number 1 issue lec has. Countless of veterans, coaches, rookies left the region weakening us so much.\n\nOther reasons as lacks of ambition are there obviously.", "label": 0}
{"text": "Hold on he might be right", "label": 0}
{"text": "It's crazy to think how many good players lck and lpl has...\n\nLike players move teams all the time and it doesn't hurt teams to much because of their structure having coaches and talented teens ready at any moment because of the structure given to players none are overpaid and the teams will drop them if they aren't good enough, this definitely pushes player quality to be good enough to compete \n\nHonestly going through positions it's insane comparing lck to Lec..\n\nTop lec BB lck kiin kingen doran zeus rascal... The talent difference is insane they'd all body BB over a BO5", "label": 0}
{"text": "Yeah, not sure why people in this thread are acting like forcing a troll to take smite is going to fix anything.", "label": 0}
{"text": "is really Pantheon, Big Bad Bear confirmed a few hours ago the leak that it is him", "label": 0}
{"text": "I definitely think he's an amazing player, but yeah, as you said, it's a super aids playstyle that I can't really stand behind. I'm glad it got nerfed.", "label": 0}
{"text": "Personally as a pro league geek. There's too many fucking teams in the lpl it's hard to get invested in big match ups when they seem.to rarely happen. The new format alleviated this a bit but still.", "label": 0}
{"text": "*LP\n\nWhat's important isn't your winrate, it's your hidden Match Making Rating (MMR). The system uses your MMR to make balanced matches. Your rank is more just visual flair on top of it. If your MMR is lower than your visible rank, then the system decreases your LP gains to \"fix\" your rank.\n\nAll you can really do is play the best you can, and your MMR and rank will eventually sync up again. Best to focus on your gameplay and don't sweat the ranked stuff too much.", "label": 0}
{"text": "The narrative for 2023 was great with Faker claiming another ring and this T1 roster finally winning an international, but aside from the JDG T1 series, the rest of the knockout stage felt like a stomp. WBG beating BLG was a huge surprise, but led to the fairly anticlimatic 3-0 final.\n\nGameplay-wise, 2022 was much closer with tons of game 5s and nail-biter game finishers.", "label": 0}
{"text": "Listing things randomly makes everything look broken. Let me show you:\n\n* Built-in attack speed\n* Built-in on-hit magic damage that scales with AP\n* Very long-range engage\n* Long-range sight spell so she can't get ganked.\n* Great weave clear\n* infinite dashes (E can be recast)\n* a shield that does damage and recasts.\n* AoE Pull that also slows.\n\nAre you going to tell me that Diana is very loaded?", "label": 0}
{"text": "Honestly perkz is past his prime, I have no faith in him to perform at a top level anymore", "label": 0}
{"text": "T1 DRX was my favorite of all time and it’s not close", "label": 0}
{"text": "Wtf I thought the clocks went back on Oct 31 always ", "label": 0}
{"text": "Unfortunately singed has some bad enough matchups where it’s actually better for them to get gold and eventually die to their jg rather than get 0 cs all game not being able to step up to the wave.", "label": 0}
{"text": "It's the 50 one, you can just count the notes.", "label": 0}
{"text": "It's kinda crazy in hindsight isn't it? DoubleLift was loyal to CLG and was on the team even though they were even in relegations at one point (probably even multiple points, but my memory is faded). Then he gets kicked and somehow that ended up working out best for everyone? CLG then proceeded to have a bit of a glow up in the following seasons, and Doublelift proceeded to earn quite a few LCS trophies.", "label": 0}
{"text": "Worlds proves that veterans are the key to unlocking a strong roster, there's definitely still a world where Perkz with the right players and staff pops off. Maybe not likely but we've seen stranger redemption arcs.", "label": 0}
{"text": "I don't think that's a lack of critical thinking, just a lack of information. We didn't go watch his VOD.", "label": 0}
{"text": "He got married in 2012, had a kid in 2013 so yes, little Ich is 11 now and probably playing League already ;)", "label": 0}
{"text": "I feel like there's been three generations just smaller ones. OG T1/SSW era, the Griffin/Damwon/LPL era, and currently GenG/New T1 era.", "label": 0}
{"text": "Having a bad game when playing offmeta builds or strats isn't griefing.", "label": 0}
{"text": "Ngl that's really impressive, especially considering how popular the AWP is", "label": 0}
{"text": "Good. Idc if one streamer people like does it to high elo, it's obnoxious af and so many dipshits copy it poorly in regular games. Repeatedly intentionally dying should never be a viable strategy, let alone optimal one.", "label": 0}
{"text": "Yeah, I wish riot would have added the client and onboarding that valve gave dota 2", "label": 0}
{"text": "Wow the audiacity to blame it on the \"stupid game\" when he's trying to play it in a dumb and unintended way.", "label": 0}
{"text": "Interesting, the armor definitely looks a lot more like this guy's armor than Pantheon's in game armor", "label": 0}
{"text": "Bro wtf I thought Yone was a new champ….", "label": 0}
{"text": "then you have no idea what youre watching", "label": 0}
{"text": "I think Olaf would be a better fit for this.", "label": 0}
{"text": "I think the changing themes went to the 100 purple essence skins, we got ashen knight and then crystallis, they just left these as it is because its easier to turn a skin into \"high fashion\" and leave it at that than coming with new themes.", "label": 0}
{"text": "Gbay99 has an on-going multi-part documentary about both Deft and Faker's journies in parallel. Definitely give it a watch if you're interested", "label": 0}
{"text": "G2, KC and Koi (MDK) are Org. that have real hunger. I hope they can save this region.", "label": 0}
{"text": "Yeah, the app is verified so it's not detected as malicious or game-changing software. Just don't use existing skins as mods and you'll be fine", "label": 0}
{"text": "No your thinking of 100T and the veteran is River. FLY has 3 vets and 1 rookie and a sophomore.", "label": 0}
{"text": "Best thing and cheapest to implement would be to simply make Sion passive only deal damage to champions", "label": 0}
{"text": "I mean, probably consistent for him. Not so much for people below that skill level copycating and failing miserably, then proceeding to make 9 other people's time miserable per game. \n\nIt doesn't matter if he's good with it if it overall effects the game negatively. Obviously, he's not the only Sion whose good with the strat, but the balance of the champ and this strat shouldn't centered around one person exploiting the system and popularizing it.  \n\nSion is an engage scaling tank with potential lane bully capabilities and strong wave clear, which opens up opportunities to split push for objectives. \n\nI don't think the champ should be balanced around a playstyle deliberately made to play around the flaws of the bounty system and cheese-out strats that ultimately place the champ in the opposite of his purpose. Well, I guess I can't fully say that, he's still split pushing. But you can't look at Sion's kit at face-value and say \"Ah, obviously this champ is meant to full waveclear in a side lane and purposefully die in certain intervals to avoid being worth any kill Gold while forcefully destroying objectives\". That's unrealistic, you'd obviously look at Sion and go \"Oh, it's an engage tank with knockups and waveclear\" Not saying the game should denounce unique playstyles, but if the playstyle is rooted in abusing oversights by the developers it probably shouldn't be valid.\n\n  \nTLDR; Hop off his meat lil bro", "label": 0}
{"text": "Nostalgia must really suck. I remember people shitting in all the players you mentioned at every international event so much that is eventually became a joke.", "label": 0}
{"text": "Aurora hotfixes were the other direction. First was to make absolutely sure she wasn't OP, 2nd was to bring her from garbage to alright.", "label": 0}
{"text": "Disagree, the designs do not look like fanservice outfits at all. In my personal experience i only hear female player even liking them.", "label": 0}
{"text": "What rate hikes? Fed just cut rates half a point if it's due to previous hikes, the last of which was July 2023, that's just poor financial planning.", "label": 0}
{"text": ">others (especially, surprise-surprise, LEC veterans like Jankos, Nemesis, Nisqy, etc.) see it as a lack of ambition and downgrade.\n\nBecause orgs should certainly pay for overpriced and washed players. /s\n\n>There is a constant narrative that G2-2019 was a fluke because it was a team when 5 absolute best EU players stick together, \n\nI don't think anyone in the beginning of 2019 thought that G2 gonna turn into BEST TEAM EU HAS EVER PRODUCED^(TM). Caps was obviously best mid, but Perkz was swapping to adc, and the trio of Wunder, Mikyx, and Jankos was hardly considered indisputable Top1 player in their respective role.", "label": 0}
{"text": "Pretty much your mmr fell below your lp.  Mmr is your hidden lp. You are playing with people who on average have lower mmr than you so you less for each win. When your mmr starts getting higher you'll get more lp", "label": 0}
{"text": "I never get the hate for champs not even released. Also, just because she has dashes on passive doesn't mean much, I'm sure it won't be more mobile than say, Irelia, Yasuo, Zed or LeBlanc.", "label": 0}
{"text": "It’s the only series I rewatch every few years. Just so good", "label": 0}
{"text": "You can get a penalty for queuing up solo for an aram and missing the pop. Like ???? I'm alone. Why is there a decline option at all", "label": 0}
{"text": "It is true though? Every single League player who doesnt't have some kind of disability/condition could get past gold 1 if they took time to learn the game and tried to improve. Some could do it in 100 games, for some it would take 10 000 games, but literally anyone can do it.", "label": 0}
{"text": "Sion isn't that good in teamfights, he's no Maokai or Ornn. There's a reason why you always see them splitpushing. I don't think he's that great late game in general. His win rate appears to go down with game length. Patch 14.20 Diamond+ stats on op.gg have him at 50.40% at 25-30 minutes down to 46.91% at 35-40 minutes ", "label": 0}
{"text": "Id say 400 is for emerald plus but I can be lower if you had to go ap early", "label": 0}
{"text": "I think he moves to top lane, he mentioned time ago he wants to be top, and now he start to play top in soloq", "label": 0}
{"text": "My bet he moves to top", "label": 0}
{"text": "At least when EU makes it out of groups/Swiss , they make it out based on merit and not luck.", "label": 0}
{"text": "Poppy would run ambessa into the ground lmao dashes /=/ power", "label": 0}
{"text": "How exactly do you decide if a champion is overloaded or not? Since you feel that me looking at each feature they have is wrong, can you provide me the correct methodology for determining if a champion is overloaded or not?", "label": 0}
{"text": "I had to scroll way to far for this.", "label": 0}
{"text": "I disagree. You have significantly more time to think in League, and reaction time matters a lot less. If you're not quick with your hands, you're never going to be a good CSGO player. \n\n\"Just click at their head\" is 100x harder when they're 100x faster than you genetically and at processing things.", "label": 0}
{"text": "It's funny how the sub seemed to have shifted in opinions. Even someone like Dom is starting to get liked here when he was the punching bag before. \n\nPeople have really taken the \"opinions\" of other content creators that have dissed baus and made it their own personality in the sub. They keep repeating the same garbage like what he's doing is unhealthy for the game yet the vast majority of this sub will never reach his rank or even go against a player that mimics his playstyle consistently but complain they will non-the-less. It's like they're projecting their low-rank and blaming baus for polluting the playerbase with an inting playstyle.\n\nPure delusion.", "label": 0}
{"text": "Europe had multiple teams contending for playoffs each of those years, definitely not a fluke. It’s what makes the downfall since then more poignant.", "label": 0}
{"text": "As everyone else said, yes. Please make him play with all chat off if he’s new to the game and you are playing with him. Don’t break his mental just yet…", "label": 0}
{"text": "Surprised nobody has said this but it has to be Talon…. Specifically in the jungle. \n\nThere’s like maybe a handful of these talon otps and they’re all high elo (d1+) so if someone locks in talon jg in low elo you already know it’s a Smurf with a 90%+ win rate.", "label": 0}
{"text": "Which one", "label": 0}
{"text": "You hope the mechanic sticks around? Brother I don't even want the champion to stick around. She'll be in either busted or broken jail for the rest of her time. No in-between.", "label": 0}
{"text": "can i get a quick rundown of deft story?", "label": 0}
{"text": "He can't be on Fnatic, Oscarinin and Humanoid are 100% staying according to rumors. It might GX Perkz top and Jankos JG since Perkz is spamming Top in soloq", "label": 0}
{"text": "Another problem is the 25 rune page problem.\n\nIf you have more than 25 rune pages, the client sometimes deletes all above 25.\n\nIt can show 35+ in the dropdown and in the runes menu, but now and then if you start a game or relog, the client will delete all above the 25th rune page.\n\nIt doesn't affect a lot of people but it is still annoying as hell.", "label": 0}
{"text": "Funny you say this because as an adc player I basically lose any game with a Shen player, they always have like 4cs a minute and fall off after minute 20 because they were too busy trying to save people while completely screwing themselves over.", "label": 0}
{"text": "Somewhere in a basement Phreak is getting off to this clip..", "label": 0}
{"text": "Isnt that second passive the older lethal tempo too?", "label": 0}
{"text": "High cost skins and future updates don't indicate prioritizing short term profit. \n\nLayoffs are, sadly, very necessary for any company, even with record profits. There's such a thing as too many hands on the same pie in the world of corporate. Not that I agree with every layoff ever, but you absolutely don't want to keep everyone around and end up having 500 people fine tuning 1 champions ability for example.", "label": 0}
{"text": "He’s had some moments he shouldn’t be proud of, and I don’t believe he is, but he’s also been very vocal about his personal struggles and how he’s been working with mental health professionals. He was quick to reflect and call his therapist after the solo queue debacle a few weeks back, and that is the epitome of maturity to me — knowing how to listen. \n\nMental health struggles are an ABSOLUTE bitch. I firmly believe there’s an aspect of grace and compassion for people struggling, as they’re so frequently judged by the mistakes they _do_ rather than the people they _are_. \n\nI hate the battles he has to endure, but those battles don’t define him as a fellow human.", "label": 0}
{"text": "Perkz is infinitely better than 90% of the players in the LEC at the moment", "label": 0}
{"text": "Yeah, not a fluke but only 3 seeds and one lpl team crashing every year meant more quarterfinals slots, west would look better even if they were monkey teams.", "label": 0}
{"text": "Has there ever been a player that became as washed as perkz but actually reached his prime form again? No stranger redemption arcs come to mind for me.", "label": 0}
{"text": "Oh boy gragas doesn’t have mana problem at all if you have tp lol", "label": 0}
{"text": "True he’s just gonna auto her to death and live with half hp", "label": 0}
{"text": "That's why he was getting infinitely gapped by all of them last year", "label": 0}
{"text": "I also highly recommend reading [the article Deft wrote](https://www.theplayerstribune.com/posts/deft-esports-drx-league-of-legends) after his win in 2022. It's a great read.", "label": 0}
{"text": "I think it’s fine. It’s attached to the entire purchase, so typically around 10-14 min mark. At that stage in the game, there’s less opportunities where a singular crit would make a massive impact.", "label": 0}
{"text": "Impeccable rage-bait", "label": 0}
{"text": "2 rookies. Bwipo & Inspired are vets. Quad been playing since 2020", "label": 0}
{"text": "riven is good right now, but this is reddit so we are all just deny reality to keep our narrative going", "label": 0}
{"text": "If the duo were jg and top but decided between themselves to swap roles and the now top laner changes from smite to a top lane summoner, but the now jungler forgets to change their summoner spell, this can happen. I've seen it quite a few times in flex rank especially. I've done it once or twice and spent the whole game feeling like an idiot.", "label": 0}
{"text": "Guy said in the comments that it's getting removed.", "label": 0}
{"text": "You used to have bounties affected by plate gold but it was a debacle.  People would just take a Janna Top and let the opposing Renekton free farm.  The Janna would auto win Mid, Bot, and Jungle and the Rene would be a free bounty for her fed team.\n\nPlates have to not contribute to bounties or there isn’t a reason to have anyone in Top Lane.", "label": 0}
{"text": "In Game 4, I agree that Peanut was able to keep Kayn down for the early game, but are you sure that you remember Game 1 correctly? Canyon got some free counterjungling + souls when Peanut was going for the first blue clear and then lured Peanut into another fistfight on the next blue buff, which got him a ton of souls for early transform. Pretty much the opposite of successfully avoiding Kayn", "label": 0}
{"text": "does it though? if sion's passive was on kogmaw instead, kog'maw would be a much, MUCH better champion.  \nthe only reason kog's passive doesn't make sense is because of the way it functions.", "label": 0}
{"text": "I appreciate you taking the time to compile this list together. There's been a lot of threads that touch on the same topic, like you said, but seeing them all together like this makes it easier to see the general opinions by multiple people in the scene.", "label": 0}
{"text": "Bruh gragas lategame can 1 shot any bruiser", "label": 0}
{"text": "WW can fuck him up", "label": 0}
{"text": "I think they should just make him not gain EXP while in passive, they already gutted his damage to structures and being able to kill the wave makes sense when building damage... just getting full benefit while having a shortened death timer turns the strat toxic.", "label": 0}
{"text": "IMO the best bo5 was SKT vs SSG\n\n\\- The first worlds final to go to game 5\n\n\\- The longest Bo5 of all time\n\nGame 1: 54:41  \nGame 2: 31:26  \nGame 3: 71:20  \nGame 4: 46:01  \nGame 5: 49:07\n\nWhich sums to a whopping 252 minutes and 35 seconds, 50:31 on average per game.\n\n\\- The level of play was insanely high, most games were extremely close nail biters. While some consider the meta of that time \"boring\", I enjoyed the long (I remember a teamfight started and ended with an Orianna shockwave) and intense teamfights.", "label": 0}
{"text": "Iron. Hardstuck iron. And bots and inters. Its a nightmare.", "label": 0}
{"text": "To him to be a proper battle mage, perhaps even a drain tank.\nTo him to become a proper solo laner.\n\nIn a few words, that. Of course we can go further into the details, but in essence, is that", "label": 0}
{"text": "I was invested in pro play from S2 - S6 or so. I have absolutely no idea of who most of the current pros arez the second (maybe even 3rd) generation already arrived.", "label": 0}
{"text": "And they lowered her range to 525 yet she was still op in pro play to the point of being perman ban in 2017 world.", "label": 0}
{"text": "I don't think anyone else was allowed to hit Perkz low before. You'd be comparing him with LCK and LPL players but they don't get to run it down for a whole year without being benched.", "label": 0}
{"text": "There's also a bug in custom games that I encountered recently, sometimes it allows you and your teammate to select and lock in the same champ.\n\nAnd even in the loading screen it shows that you both picked the same champ, but the game never goes through and never loads in.", "label": 0}
{"text": "I have a bug where post-game menu wont load at all, the only way to get out of it is to click on my icon to return to home screen. It happens in like 1 in 5 matches. I cant honor and cant see post-game lobby at all. It just disconnects me from it. And its been happening for MONTHS.", "label": 0}
{"text": "Irelia has a 50.5% WR, which is considered high on her (slightly high skill champ, normally around 49-50%) and she gets buffed? That is very strange.\n\n  \nCan they get the -gold on the score board, too?\n\n  \nSwain buff make sense, he is shit right now. His laning sucks ass due to the low HP reg, but these buffs I think are not going to fix this. His laning is so terrible and unfun because all you can do is try to survive, farm and stack. Even Kayle has a better laning phase than he does.\n\nAlso top lane Swain is likely even more dead. Riot wants him mid/support.", "label": 0}
{"text": "Humanoid is only staying because of his buyout, he's effectively just screwing FNC since no team can afford his buyout.", "label": 0}
{"text": "So they create the problem and thus are being rightfully being criticized for it, gotcha.", "label": 0}
{"text": "That mmr is separate from rank.", "label": 0}
{"text": "No matter how well or how poorly I do, it all comes down to whether my teammates int or not. I don’t gain more/lose less LP when I do well, the only thing that matters is what’s out of my control", "label": 0}
{"text": "> are you sure that you remember Game 1 correctly?\n\nI was deadass talking about the game 5 specifically", "label": 0}
{"text": "He's only 46 on malignance. If people stop giga trolling and just go rylais first he's sitting at 49% already.", "label": 0}
{"text": "I really dont understand what you are getting at by even trying to chat with me, except obviously try to blow off steam about your own frustrations as I am not moaning about my rank or saying its undeserved at all. Simply that I have game knowledge that is much more comprehensive than almost all of the people I end up playing against.\n\nI really couldn't give a flying fuck if you think otherwise.", "label": 0}
{"text": "The lack of voice comms. \n\nWhoever keeps cockblocking Riot from adding voice comms is the single biggest cause of stress in my life.\n\nEveryone get's to have a massive ego because they're never wrong! Everything is their teams fault!\n\nThat guy who is stopping voice comms from being added is carrying the ego of every single ranked player on his shoulders.", "label": 0}
{"text": "It's more than that, they are rivals for years in erls.", "label": 0}
{"text": "Druttut!!!", "label": 0}
{"text": "Oh come on, you know this isn’t true.\n\nThere’s been 4 groups in Worlds history that featured 2 wildcards. Group A in 2015, Group C in 2016, Group A in 2018, and Group C in 2019.\n\nGuess which Western region got to play in 3 of them?\n\nThat’s not including the 2021 incident where MAD got to face against the weakest tiebreaker team to qualify, or Rogue in 2022 lucking out because of the bug that cost TES a tiebreaker game (EU didn’t win a single game against major regions week 2)…\n\n—-\n\nYeah, Fly got lucky this year, but there’s a long history of lucky breaks at Worlds. EU hasn’t earned every spot they’ve gotten on merit alone.", "label": 0}
{"text": "No you just spend to much time on reddit.", "label": 0}
{"text": "Well, my comment says \"the 1st Kayn game of the series\"? You're replying about something completely different, I'm not underselling Peanut at all", "label": 0}
{"text": "Too young how?", "label": 0}
{"text": "Did you make the bow yourself? The whole cosplay is great but like everyone is saying that bow is amazing in detail and design", "label": 0}
{"text": "Still would be interested to see how he does, I would think this would be his last chance.", "label": 0}
{"text": "FNC vs C9 2018 bO5", "label": 0}
{"text": "Inspired hasn't been playing as long as Bwipo but there's really no way you could call him a rookie. He's played 2 years in the LEC and almost 3 in NA.", "label": 0}
{"text": "+ 2015", "label": 0}
{"text": "Because you can use the eye test. Uzi was the best adc in the world at multiple points over his career spanning multiple years and had imo the highest peak of an adc in terms of pure mechanical talent. Bang was a top 5ish adc in the world for most of his career (during the T1 era), very respectable but we're comparing between the best of the best here. Spring 2017 was probably the only period in his career where people considered him the best adc in the world.", "label": 0}
{"text": "The mini rework pretty much allowed the enemy to avoid all his shit.\n\nW still only lands as a follow up to the E. E is as easy to dodge and does no dmg on the way out and has a higher CD. R is pretty much worse (lower dmg, less healing, higher CD). His HP reg got destroyed (he does have some sustain on the P but that is nearly 100% tied to the E).\n\nThe only thing that was buffed was the Q at max range.\n\nAnd Riot actively tries to push him into support even more, away from top/mid. Mid will likely be his 2nd role, but the changes made him even in mid/support while before he was actually way better in mid than support.", "label": 0}
{"text": "EU import's influence in NA is overall positive, and something I don't see them accomplishing in EU.\n\nThink it's for reasons from both regions, but I wonder which has more influence. If those imports stayed, would EU look better, or just have a larger McDonald's? Would NA still have certain standouts, or be as plain as unbuttered toast?", "label": 0}
{"text": "Yeah, people really like to talk about how prior to MSI 2015 Faker was undefeated on Leblanc, but at that point Deft was also undefeated on Jinx", "label": 0}
{"text": "I think BDS too, they scaling this year.", "label": 0}
{"text": "Only real options are Dignitas and SR, unless Perkz roleswapped", "label": 0}
{"text": "If this current level continues 3 more years 2018-2020 will only be 3 years out of 16...", "label": 0}
{"text": "Then I missread your initial comment, mb.", "label": 0}
{"text": "Arena was such a goated mode, i miss it every day", "label": 0}
{"text": "I don't feel bad at all for a player like Caps to be stuck in this region. He's the reason his team has consistently downgraded the roster. He's a nice guy, but a terrible GM. G2 using no imports when they have ERL at best players in some roles is criminal.", "label": 0}
{"text": "Yes, that brings excitement to the fans who cheer for them, for the one who have a connection (French vs Spanish) and even for the orgs : you don't want to lose to the rival.\n\nRogue vs Mad was supposed to be the next G2 vs FNC  but it didn't live to the expectation.\n\nAnd to go beyond : KC brings a rivalry with Vitality as the best French organisation and MDK has the same with Heretics (not sure Giants is in the competition but I can be wrong)", "label": 0}
{"text": ">Solo carrying is real because I abused gold flex players not having any macro.", "label": 0}
{"text": "That visible division and MMR are two different things.\n\nI haven't played SoloQ since S12, but back then due to me having higher MMR than my division I'd find myself in games with players in low plat while I was trying to get to Gold IV.\n\n\nAnd don't get me wrong, I won those games and I got my gold, but the frustrating bit is I shouldn't have had to. For the record, that was happening to me since something like S5 after I first stomped my way into gold in S4.\n\n\nEither match me up against other players ranked silver or low gold, so that I'm proving I deserve gold playing against them OR boost my visual division so it actually matches more closely to the opponents I'm facing, so that I can quit the grind earlier.", "label": 0}
{"text": "I guess you could say his form is... indeterminate.", "label": 0}
{"text": "Oooh ok cool, that makes sense about riot made skins too of course! Thank you for the quick info! I can download my favorite joke skins again ❤️", "label": 0}
{"text": "I literally never brought up any champions myself, just a general point about counter-picking, and he deflected to a completely different persons comment with poor picks, which were *also* about non-traditional picks. The fact that nobody actually seems to agree with the point about counter-picking, and instead is being sarcastic or condescending, is why I called them dense. \n\nKeep picking the same 5 champions top and never opening the other tabs, great idea.", "label": 0}
{"text": "I play leauge just for relaxing and fun, i was tryharding years ago, but when you grow up you realise it's just a game that is supposed to be fun. Yes i still give my best, but i am not angry when i lose", "label": 0}
{"text": "Did poppy have hail of blades? I've found that if she has that and can stick to somebody she can do a ton of damage. Currently I find her really strong for exactly how you explained it.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, must be submitted as a link in a text post - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "You guys clearly can’t comprehend my sarcasm :D", "label": 0}
{"text": "Okay i think lore wise the Pantheon skin is not \"Pantheon\" but riot use Pantheon to represent a another character, kinda like Spirit blossom Thresh.", "label": 0}
{"text": "As someone that often jungle... I call it 'im faker syndrome'\n\nSomeone that will always want a gank and you to basically baby sit them... While they give you absolutely 0 in at all times.\n\nThey have their lane pushed to their tower and their opposite  is 95% health/mana.\n\nBunch of missing pings and/or rages that i never help him.\n\nFuck off while im not hovering you i took 6 grubs and 2 drakes.\n\nStarts running it down and ff votes until we lose.", "label": 0}
{"text": "im glad we have lived experience playing with this during the original chemtech soul. its completely unacceptable for game enjoyment", "label": 0}
{"text": "I get where you're coming from, you're thinking where you're more likely to be a \"top player\" between the two\n\nI'm thinking where is average Timmy more likely to have some fun at the first time, the genre  that has been extremely popular all his life or the RPG that is kind of niche\n\nSo he's more likely to be familiar with FPS and have a sense of \"point and click\" and be able to do *something* when playing CS that will let him have some fun, while in league he's just gonna get knowledge checked for hundreds of games", "label": 0}
{"text": "It’s harder in esports than normal sports because physicality already reduces the pool so much for normal sports that if you have an athletes genes you’ve got a big advantage. Esports on the other hand you don’t get that. Sure you can get the mindset and drive and coaching from parents but still", "label": 0}
{"text": "Not wrong at all, except for support role = sharing your exp and being 3-4 levels down", "label": 0}
{"text": "Elo boosting smurf duos\n\nAnd they show up like 1 in every 3 games in Emerald elo where I play to make matters worse", "label": 0}
{"text": "Aren’t they broken up", "label": 0}
{"text": "Are you asking why a character using their full combo on a fragile mage with no resistances does more initial damage than a mage damaging someone with a specific anti mage item?\n\nIt's the same reason why Ornn can heavily damage your ADC if he ever gets on them - Tanks have to be able to deal a certain amount of base damage or they're worthless and people ignore them.", "label": 0}
{"text": "That's so backwards. What do you think makes them good, if not constant strive to improve and get to the top?", "label": 0}
{"text": "Dude, that is such a non-factor, it is hilarious. It's not like this 1% crit is absolutely for free, you completed an entire legendary item for it. Which usually will not only give 25% crit on purchase, but this one doesn't even have crit components for you to get lucky in early trades.", "label": 0}
{"text": "I highly doubt a Poppy that's *4 levels down* on the mid laner was doing what you're describing.", "label": 0}
{"text": "Not his W", "label": 0}
{"text": "In inbiased eyes T1 DRX probably was better\n\nAs a biased T1 fan SKT ROX was better because my team also won", "label": 0}
{"text": "It looks like they're trying to fix WW's bugs, but they're also worried about him being buffed, but they also don't know HOW to fix WW.\n\nHis Q is strangely clunky to watch and hard to understand from the opponent's POV.\n\nHis W trail gets blocked by terrain and champions, and since it uses the auto walk function, sometimes the trail goes a completely different way than the closest, most obvious path. \n\nHis E (and his W active) locks WW out of autoattacking.\n\nHis R can change range rapidly, and the indicator simply doesn't uodate fast enough. There's times when you'll see a much larger OR smaller range than the actual current range.\n\nThe way WW's kit is designed is like they wanted him to have bugs, Q is a really unique problem to code and one of the few abilities that changes on how you press the button, W relies on a global pathfinding trail, his E well it just has no business stopping WW from fighting, and his R relies on turning yourself into a skillshot that relies on champion hitbox AND your own hitbox AND the range can change on a dime.\n\nThis is all on top of WW having a problematic design: Drain Tank that wants On Hit Itemization but does Hybrid Damage, but his ability scale scale best with AD. Riot doesn't like sustain. Doesn't like standard onhit itemization for bruisers (they prefer ability on hit like Sheen), and Bruiser/Hybrid Damage itemization is also very niche in general. WW doesn't even have an AoE ability, but it is designed for Jungling. It's like they wanted to give him every design problem possible.\n\nI really like the concept Wild Rift used for WW's ult. WW dashes to wherever the mouse is (according to the current allowed range), and his next auto is empowered to supress. It fixes WW having to rely on a buggy skillshot and makes his ultimate something he can rely on working in his favor.", "label": 0}
{"text": "Yep totally from scratch😭 lots of EVA foam pieces constructed together!", "label": 0}
{"text": "Jankos did make 3-4th in the h2k roster ", "label": 0}
{"text": "You serious?\n\nAre you actually asking why inting is a valid strategy solely because of a stupidly implemented bounty system?", "label": 0}
{"text": "Mod that into phasmo now.", "label": 0}
{"text": "Good fucking riddance ", "label": 0}
{"text": "You literally said yourself that he abuses it. Which means he's effectively boosted above his actual rank.\n\nDo better, dipshit.", "label": 0}
{"text": "Since it's very easy to make a new account and Smurf, new accounts gain a lot of LP per win, and don't lose much per loss in order to push them to higher elos faster, so you don't have master+ players shitting on silver players for so many matches. \n\nRiot doesn't know if you're a truly new player or a Smurf so they give all new accounts the same treatment. Since you lost 10 games in a row in bronze, that confirms that you're not a Smurf and so riot is giving you \"normal\" LP gains and losses. Since you had a 36% winrate, you lose more than you gain in order to help you reach your \"true\" elo faster. Once you get there and your winrate evens out you'll gain and lose around 25 LP.", "label": 0}
{"text": "I went through this, it's very difficult because league is a game of a million tiny nuances it was tough to know how to start my journey was having them play supp with me ad so they didn't have to worry about farming until later but to this day she's only comfy playing support and tends to get upset at her low impact but she can't get the hang of other roles very easily.\n\nI'd also try to curate the content you show him because people can all too easily fall into the getting flamey calling people inters, dogs, etc. since that content prevades youtube/twitch but it's also important to explain why certain things are important like my friend refused to ever help with drakes because \"it doesnt do anything for me I dont get xp or gold from it.\"", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, and webm videos must be submitted as a link in a text posts - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "Oh yeah, true as well, that was changed years ago for matchmade games and it's another feature custom games have still not received - despite often having 2 to 3 times as many people to reinvite in.", "label": 0}
{"text": "Please don't, I was that \"friend\" and here I am, 10 years later still here 😢", "label": 0}
{"text": "aram honors are from last game, fix the game", "label": 0}
{"text": "I played into some otp who would just pop up out of stealth in perfect gank position and just dance instead", "label": 0}
{"text": "G2 was really unlucky last year to draw NRG when they were both 2-1.", "label": 0}
{"text": "Your post has been removed automatically because all images, except for infographics, and webm videos must be submitted as a link in a text posts - which require at least 100+ relevant characters besides the title.\n\nIf you submitted an infographic, please message the mods by [clicking here](http://www.reddit.com/message/compose?to=%2Fr%2Fleagueoflegends), otherwise [click here](http://reddit.com/r/leagueoflegends/submit?selftext=true) to resubmit your image the proper format.\n\nIf you're not familiar with the subreddit rules, you can read them [here](http://reddit.com/r/leagueoflegends/w/subredditrules).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 0}
{"text": "My main is hardstuck in Bronze and my alt made it to Masters last act.  I have about 1500 games now in Bronze and I have 800 games in Masters.  Don't think I will get higher as I don't think I can make Challenger my smite is off a bit.   I went 2-0 today in Masters and 0-5 in Bronze.  I know trolls when I see them and will tell you almost 90% of my games have 2 trolling teammates.", "label": 0}
{"text": "All these paragraphs about 1) good riddance since this strategy gets taken to silver where people don't get it and 2) we all just don't understand the genius of running it down to make yourself worth less gold. But this sentence right here sums it up. When your playing any other champ and your 0/3 before level 6, don't expect to be rewarded", "label": 0}
{"text": "I can't tell whether you're saying that genuinely or not because either option would make sense, but it's actually true, hence my disclaimers - I decided to limit the time I'd spend on this one, so there's a lot more out there I've not listed. This should have almost all of the issues that are easy to find, though.", "label": 0}
{"text": "Swarm was having client issues as well.  Queueing up as a full group had a small chance of causing a game to launch that you couldn't enter.  The worst client bug I've personally ran into.  You have to wait a full 20mins for it to end queue up for anything again, which is usually the death of the group i struggled to pull together.", "label": 0}
{"text": "I think we have some good talents to develop and new orgs with sharp teeth. BDS became a top 4 team in 2 years, Mad won titles and even in a rebuilding year they reached finals, KC seem to have a good roster and I still believe in the Vitality project with Mad. I have hope.", "label": 0}
{"text": "I think its pretty clear that the thing that needs fixing asap is coaching. NRG and FLY both had good coaching staff, and the eastern teams are full of retired pros and long time coaches.\n\nIts wild that eu teams play for 8 months and dont improve at all", "label": 0}
{"text": "A lot of these points are just money diff.", "label": 0}
{"text": "my mans out here doing gods work", "label": 0}
{"text": ">Alternative timeline", "label": 0}
{"text": "Flyquest showed more signs of life than G2 did the entire tournament. G2 looked like an NA team from recent years that gets a lead and then has no clue what to do.", "label": 0}
{"text": "Just duo a lane and make it no pressure, winning can come later", "label": 0}
{"text": "I like the way your idea is going but the solution is a bit \"messy\". It should be more streamlined", "label": 0}
{"text": "The money issue will never be solved unless orgs start selling themselves, like HLE is literally just hanwha group,T1 is comcast, KT is Korea Telecom, Nongshim is a ramen brand, KDF is kwandong pharmaceutical, DK is now KIA. All of these are massive brands, it would be like g2 being partly owned by Rheinmettal, or Nestlé, which will never happen because LOL is not supported by local governments because the EU does not see it as a way to expand soft power unlike Korea ", "label": 0}
{"text": "You misunderstand, have you seen the standard of the LEC this year", "label": 0}
{"text": "She is still super powerful. As good, if not slightly better than on 14.18 and we see her power at worlds in the right hands.\n\nAurora needs to be put into pro jail and Riot has avoided that. Not just that, they even broke their own rule for making her available at worlds (she was unplayable in the LEC during the finals due to the bug, so she should have been banned at worlds by default).", "label": 0}
{"text": "Absolutely- you can be landing E+W combos all game and STILL feel like you're being killed too fast. And that's been an issue forever.", "label": 0}
{"text": "I’ll try to play adc with him and see how it does but it will be fiora adc 😭. And for the streamers idk what to give him cus I personally watch sanchovies and caedrel and drutt and he’s French so I think he would prefer French streamers but the only one ik is potent", "label": 0}
{"text": "His E cooldown is so insanely long because Ult no longer reduces E. Nothing will change if he doesn't get this because unlike AD bruisers, these AP champs are nothing without abilities. He doesn't have a Sylas like passive.\n\nAlso it'll never make sense to me how unwilling they are to let AP battlemages and items have good healing or self-sustain when AD bruisers and items heal several times more and for much longer.\n\nConsidering Ambessa is literally going to be a Kalista with built in spell vamp that scales with life steal, they can afford to buff his Ult healing so much more because it's so pitifully low and they failed once again to make his Ult feel satisfying.", "label": 0}
{"text": "He is shit till you reach lvl 12-14 and 2 items. Before that he is nearly unplayable and can only sit in lane and farm and survive.", "label": 0}
{"text": "Surely it has to be CLG.EU vs WE. How many other Best Of series can say they spanned multiple days? Hell, one game alone lasted longer than that MAD vs T1 series IIRC. Not to mention it was the birth of Silver Scrapes as a Game 5 song.", "label": 0}
{"text": "Bro...how high were you when you wrote this?", "label": 0}
{"text": "Don’t, let him/her be happy in life 🥹", "label": 0}
{"text": "Baus (the ultimate cheese player) says that the guy he is playing against does the same thing. Ironic", "label": 0}
{"text": "lmao the Dorsia axe ground effect", "label": 0}
{"text": "Good write-up. I think that if GMs would invest money/resources into coaches and giving them more authority the league would improve fairly quickly. Players definitely need to change their attitude.", "label": 0}
{"text": "No he deserves it cus he keeps on singing shitty songs while he’s dead when we play", "label": 0}
{"text": "also a bug is that if u have friends that rename, it automatically delete the \"note\" you have on their profile + moves them back to the default general folder, which means u cannot tell who it is anymore", "label": 0}
{"text": "Yuntal not nerfed, we are so close to greatness.", "label": 0}
{"text": "typed this whole thing only to be rejected n sent here,not gonna bother with this just copy past \"\n\n# vanguard crashing my games\n\nhad 4 games crash cuz of vanguard,did restart my pc over n over trying to fix it but it always crash,only when game start or in the middle of it,tried couple of options found here on reddit or youtube but nothing solved the problem,also having hard time logging into the game itself,like I'm out of options at this point,I got 10 min low prio queue,what am I supposed to do?\" fix the game like holy sh", "label": 0}
