{"text": "This is a game of push tower", "label": 1}
{"text": "My man, you have no room to talk about IQ. When the Germans start acting up again and decide to clean up the gene pool, you aren't making it.", "label": 1}
{"text": "Thanks for letting me know what'd do. You're still wrong though!", "label": 1}
{"text": "Wait this guy who's raging in this thread, read my comment wrong, blocked me, and then pretended I changed the comment after the fact is a **mod** and *deleted my comment*? That is hilarious. Sounds like he fits right in with the league community as he envisions it.", "label": 1}
{"text": "Name and shame. Which mod was it?", "label": 1}
{"text": "The guy who responded to the comment I replied to, LargeSnorlax.", "label": 1}
{"text": "Thanks Sherlock", "label": 1}
{"text": "You need to improve winrate to gain more pl", "label": 1}
{"text": "Try rope maxing", "label": 1}
{"text": "Get off a throwaway pussy", "label": 1}
{"text": "ai garbagio", "label": 1}
{"text": "Lies lmao. Look at that hand, it has too many fingers, thats the tell tale giveaway among many other tells. Looked at his facebook and that chinese temple drawing is obviously ai also. Hes lying to you if you believe him", "label": 1}
{"text": "mods deleted the post, you can still comment on it?", "label": 1}
{"text": "You mean you deleted the post? If mods deleted the post, there would be a moderator message in the comments highlighting why.", "label": 1}
{"text": "sighs. i see the line, deleted by mods. it's there. why would i delete it. idc i am iron 4 , what could be worse", "label": 1}
{"text": "You may not get the chance to do this in the battle", "label": 1}
{"text": "It's like hitting a machine", "label": 1}
{"text": "What is with these thirst trap ass videos? Riot is trying to get me pregnant.", "label": 1}
{"text": "Are you stupid? While before and after is the usual order, some people do after before and because those people exist if you go for color coding for changes only there is confusion possible for people with color blindness. It is not so hard to just keep the arrow at the end of line 1. some critical thinking would help you I am sure.", "label": 1}
{"text": "2 bitches, 1 idiot gymbro and 1 dog. Perfect disaster combination.", "label": 1}
{"text": "Did the butcher get stuck in a pawn position?", "label": 1}
{"text": "It's a cheap script, that's why. Cheap scripts have blatant flaws that prove their concept but are risky to use. Expensive ones will have these issues rectified.", "label": 1}
{"text": "Intentionally ignoring the fact that COVID-19 started in 2019 to make your joke work in the same sentence as bitching about a spelling mistake on the internet before acting like the other person is the pedant. If you want irony your comment is riddled with it", "label": 1}
{"text": "Bro's 4th thread in like 2 hours", "label": 1}
{"text": "It will be Kalista and Yone vs. Jax and Smolder.\n\nThe other people in this game are NPC's.", "label": 1}
{"text": "Yeah these casters are regarded wtf are they talking about there", "label": 1}
{"text": "French 🤢🤢🤢", "label": 1}
{"text": "Fren*h 🤮", "label": 1}
{"text": "Wah wah go eat your baguette and cheese", "label": 1}
{"text": "> starts with a W\n\nWhinging terminally online racists?", "label": 1}
{"text": "EraOfRacistLosers is more like it.", "label": 1}
{"text": "Oh no, a fictional universe has black women. Grow tf up", "label": 1}
{"text": "Get a personality.", "label": 1}
{"text": "shes a d.e.i. hire", "label": 1}
{"text": "Your W word speak more about yourself than about what you are trying to say.", "label": 1}
{"text": "what the fuck", "label": 1}
{"text": "You watch nothing but anime and are complaining about wokeness?", "label": 1}
{"text": "If this isn't a pasta, then you sound like the most pretentious douche in the world.", "label": 1}
{"text": "It is. Reference to faker", "label": 1}
{"text": "It's a repurposed pasta about Faker.", "label": 1}
{"text": "straight off stage and straight into reddit comments lmao.\n\nI wish I had an easy job like you", "label": 1}
{"text": "No korean, lpl is trash", "label": 1}
{"text": "Have the original post link?", "label": 1}
{"text": "It's since been deleted cause OP got roasted for their wording, but it was [this post](https://old.reddit.com/r/leagueoflegends/comments/1esqhdr/people_really_need_to_lay_off_faker_its_not_okay/).", "label": 1}
{"text": "I have seen posts being removed for the sentence you have at the end of your post, I hope you can edit it out before mods see lol", "label": 1}
{"text": "q", "label": 1}
{"text": "Because your level is really backward, I can‘t imagine you have the courage to post it on social media", "label": 1}
{"text": "It would be alright if idiots like OP existed only in game but this crap is all over the world. Age of victimhood. \n\n[https://www.youtube.com/watch?v=FQRyrYGjihQ&t=897s](https://www.youtube.com/watch?v=FQRyrYGjihQ&t=897s)\n\n\"I PROBABLY(!!!) make mistakes\" - you definitely make mistakes. Grandiose thinking. A player who has been bronze for 6+ years makes countless mistakes. Lol, the audacity to use the world \"probably\".\n\n\" i lost all my LP due to trolls, inters, feeders\", \"i could go on. and no matter what lane i pick\" - \"I am a victim, other people hold me back!\". Alloplastic defenses.\n\n\"you arent actually in my games\" - \"you don't understand me, I am special!\".\n\nYou can't put 2 and 2 together.", "label": 1}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because edits that are unrelated to the post’s original content or include advertising are disallowed. This includes edits like “Thanks for the gold!” or “Wow, frontpage!”\n\nPlease remove the edits and reply to this comment for your submission to be re-approved.\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "Mk", "label": 1}
{"text": "Maka", "label": 1}
{"text": "Eisis", "label": 1}
{"text": "Koww", "label": 1}
{"text": "Dat ear..... I wanna lick her earwax...", "label": 1}
{"text": "Wtf is wrong with you, you creep", "label": 1}
{"text": "Last split, I went straight to diamond with 0 afk games both on enemy team and mine. \n\nThis split I have played against 0 afks, and I have had more than 15 games with afks on my team. I wish I was kidding.\n\nWhatever they did this split, demolished all of my teammates mentals", "label": 1}
{"text": "How do people even reach honor 5 at this point, I get honored at least every second game and am stuck on lvl 3 for months now.\n\nThe honor system fkn sucks.", "label": 1}
{"text": "I am not racist but she isn't white too!", "label": 1}
{"text": "Shes part indian", "label": 1}
{"text": "She is from a fantasy world where India does not exist", "label": 1}
{"text": "Im sorry but if you can't understand his point you're really fucking stupid.", "label": 1}
{"text": "everything in your life will change going from 60hz to 144hz", "label": 1}
{"text": "Well, let's just say that seeing the picture of a woman, he somehow thought that the best course of action across all options - including doing nothing - was to include her in his fetishes and to express them. \n\n(It's also a mod who did the deleting, I don't suppose he would have the self-awareness to realize how out of place he was)", "label": 1}
{"text": "Semantic comments like this are fun (me when i lie)", "label": 1}
{"text": "Stop being dogshit?", "label": 1}
{"text": "Such a white thing to do. Ordering others around.", "label": 1}
{"text": "Hate playing support with smolder adc. Smolder solo lane is fine, but just my playstyle is fast and loose, and smolders just wanna afk stack for first 10 minutes. My last smolder literally only dealt his first point of damage almost 6 minutes into the match, I think it was 5:46.\nI hate playing against senna. The champ is just an egregiously terrible design bred to be a lane bully and a scaler like absolutely no other champion. I've even tried asking r/sennamains how to counter their broken champ but mods just delete my post asap. Because nothing says 'fair and reasonable' like when you gotta keep any critical discourse concerning your entire purpose out of your space like totalitarian moderation", "label": 1}
{"text": "I believe it was said by the chinese caster when T1 beat JDG last year: \n\n英雄联盟最高的山，最长的河，有可能都是李相赫他一个人\nTrans: The highest mountain and the longest river in League of Legends, may solely refer only to Lee Sang Hyuk (Faker)", "label": 1}
{"text": "What does this even mean?", "label": 1}
{"text": "Oh boy, I can't wait to make a modded skin of white Ambessa", "label": 1}
{"text": "at your mom's house", "label": 1}
{"text": "Nilah is Indian-inspired, yes, but Ambessa? She's so obviously African-inspired like K'sante that you'd have to be intentional to say she's any part Indian", "label": 1}
{"text": "Such a black thing to do. Disobeying orders.", "label": 1}
{"text": "Garbage", "label": 1}
{"text": "I don’t care about the original comment at all. I agree, I don’t think Ambessa is Indian. But it’s semantics to say India or other “real countries” don’t exist in League. Ionia is a cultural blend of various Asian countries. No one would be confused if you called Karma or Lee Sin Asian, even if you didn’t specify what country.", "label": 1}
{"text": "All AI made. No thanks", "label": 1}
{"text": "The game's called League of Tanks for a reason bahaha", "label": 1}
{"text": "League of Tanks", "label": 1}
{"text": "Even if it targets a low percentage of innocent players it's worth it. They can appeal for a reevaluation. Stop making excuses for soft inters ", "label": 1}
{"text": "Found the bronze low elo in denial", "label": 1}
{"text": "Impossible my ass. Throw 1 million to the problem and capable people will fix it. Riot doesn't care enough and riot lawyers are trolls themselves who will do anything to defend their current shit systsm", "label": 1}
{"text": "Ok? I don't see the point of your comment, I am still right.", "label": 1}
{"text": "NA", "label": 1}
{"text": "I dont care about reddit fat morbid obesse people downvoting me", "label": 1}
{"text": "????????????????????????????????????????????? go aram", "label": 1}
{"text": "Nah he doesn't need any nerfs, he's at 49% winrate rn. If you can't counterpink or blind pick easily into Nasus you're very low elo anyway ", "label": 1}
{"text": "RIP", "label": 1}
{"text": "The moment I saw Trundle at the tier 2 tower, I knew exactly what would happen in that video haha.", "label": 1}
{"text": "Emily stfu", "label": 1}
{"text": "holyfuck when did this place become so racist?", "label": 1}
{"text": "faker smashing his head into a wall", "label": 1}
{"text": "Ye it was poohmando, i think even bengi at 1 point. Piglet impact went to na.", "label": 1}
{"text": "All stars used to be msi ", "label": 1}
{"text": "Bro thinks he's on the team", "label": 1}
{"text": "I'm sorry your team isn't making it to finals, gettem next year.", "label": 1}
{"text": "say goodbye to your comment, his mod buddies are coming for ya", "label": 1}
{"text": "I don't even think he's a T1 fan, you just said \"we\" like brother, you aren't on the team and this isn't some football shit", "label": 1}
{"text": "He is a mod lol. The amount of mods here  that behave like shit astounding (including a 3 month old account that pretty much only flames lpl lmao)", "label": 1}
{"text": "Sorry your team lost, cya next year", "label": 1}
{"text": "Not really, appreciate the feedback though.\n\nUnemployed, silver, your team lost. Gettem next time.", "label": 1}
{"text": "uhuh. shush boy", "label": 1}
{"text": "No", "label": 1}
{"text": "cry more what a loser, yap yap monkey", "label": 1}
{"text": "You have mental problems", "label": 1}
{"text": "Yes, it is all AI. Woukd you like me to list out the exact programs and when you used them? I can down the line for all your videos and do them one by one if you want. \n\nIt's all AI. You didn't make shit.", "label": 1}
{"text": ">Also keep in mind being wrong **about a champ being strong** has basically no consequences but being wrong **about a champ being strong** can literally ruin the entire game for periods of time\n\nthere has to be a mistake in this sentence, right?", "label": 1}
{"text": "Filthy gold elo question: What’s the point of having wards literally next to each other?", "label": 1}
{"text": "GUNZ MENTIONED LETS GOOOOOOOOOOO", "label": 1}
{"text": "Chovy. \n\nIf I see your name on another top 10 list I'ma kill somebody. \n\nI better not hear your name compared to Faker again or I'ma kill somebody.\n\n I don't want nobody saying Chovy and Faker in the same sentence, not in the same paragraph, not in the same essay; unless \"Trash\" comes after Chovy's name.", "label": 1}
{"text": "peyz should choke on a cock", "label": 1}
{"text": "kiint\n  \nCan’tnyon.  \n  \nChoky  \n  \nPiss  \n    \nSlow hands", "label": 1}
{"text": "when is the last time that t1 beat geng in a bo5?", "label": 1}
{"text": "tfw it's a banger series but you're a reddit mod so you care more about karma than the games", "label": 1}
{"text": "GEN G ARE FRAUDS! They are LCK merchants at best. I dont wanna hear another Chovy dickrider talking about how great he is. The weakest T1 beat the strongest version of Gen G.", "label": 1}
{"text": "Fucking pigs man, I don't want another t1 win", "label": 1}
{"text": "this is hilarious now", "label": 1}
{"text": "They feel empowered cause that one r/leagueoflegends mod does it in every single thread and then deletes replies making fun of him for it lmao.", "label": 1}
{"text": "Choky is a pig man", "label": 1}
{"text": "Get fucked idiot", "label": 1}
{"text": "Remember when delulu NA d0gsh1t fans shat on G2 for not winning vs LCK 4th seed and strugling BLG.\n\n  \nLMAO can't even win vs ChokeG, lmao. FLY faced 3 eastern teams and flied home just as planned, nothing special. Atleast they are better than 95T, MDK and TL lmao.\n\nZero win vs eastern teams in 2 years LMAAAAOOOOOOOO", "label": 1}
{"text": "Your Choky is never reaching finals, nor winning worlds.", "label": 1}
{"text": "HEY BRO, HOW YA DOING?", "label": 1}
{"text": "Huh. So about that...", "label": 1}
{"text": "LMFAOOO", "label": 1}
{"text": "Guess they did.", "label": 1}
{"text": "Room temp iq if that's what you're getting out of what I said\n\nIt's not analysis to have an essay typed up on a player posted within 20s of the thread being open, it's pure toxicity and the community def doesn't need more of that", "label": 1}
{"text": "Superstition blocked me from watching as I knew when I watched t1 would lose.\n\nGood to see it worked... sad I didn't see it.", "label": 1}
{"text": "Learn the proper terminology before telling someone else to learn proper English. Matches =/= games you twat.", "label": 1}
{"text": "Are you fucking stupid or something.\nI'm not even agreeing with you. \n\n\nYou said that you are surprised that 'Freefire doesn't dwarf the other esports titles in viewership'. \n\n\nHowever I already told you that I'm not surprised. Freefire is lower budget Pubg for people, presumably kids, who have weaker phones. \n\n\nSo their playerbase is made mostly by young kids. \n\n\nYoung kids don't watch/care about esports. \n\n\nThe end. \n\n\nHave a good day. ", "label": 1}
{"text": "[pffff]([reddit!](https://reddit.com))", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Was this solved? I get the same problem", "label": 1}
{"text": "What a completely idiotic question lol", "label": 1}
{"text": "I'M SO HAPPY FOR KERIA WTFFFFF", "label": 1}
{"text": "ZOGK GOT HIS BACK", "label": 1}
{"text": "its .65 second cast time get a grip xD", "label": 1}
{"text": "Faker : can we kill ashe on spawn ?\n\nKeria : SHUT THE FK UP!!! 💢💢💢\n\nFaker : k, finals it is then", "label": 1}
{"text": "Faker : can we kill ashe on spawn ?\n\nKeria : SHUT THE FK UP!!! 💢💢💢\n\nFaker : k, finals it is then", "label": 1}
{"text": "Faker : can we kill ashe on spawn ?\n\nKeria : SHUT THE FK UP!!! 💢💢💢\n\nFaker : k, finals it is then", "label": 1}
{"text": "Faker : can we kill ashe on spawn ?\n\nKeria : SHUT THE FK UP!!! 💢💢💢\n\nFaker : k, finals it is then", "label": 1}
{"text": "Faker : can we kill ashe on spawn ?\n\nKeria : SHUT THE FK UP!!! 💢💢💢\n\nFaker : k, finals it is then", "label": 1}
{"text": "Don't get killd", "label": 1}
{"text": "am I the only one that cant stop laughing?", "label": 1}
{"text": "Rustam Motayu has a free university on Discord where he teaches how to make money using ", "label": 1}
{"text": "Il arrive à être chauvin même en anglais ce crétin.", "label": 1}
{"text": "Damn I'm also a T1 fan and Dodgers fan but I admit I am more of an Ohtani fan so...", "label": 1}
{"text": "The Diddy combo.", "label": 1}
{"text": "My guy is cosplaying Diddy. 😂😂", "label": 1}
{"text": "Smurfing isn't against any rules.  Naming and shaming someone on the subreddit however, is.", "label": 1}
{"text": "do you have a link to introduce me ?", "label": 1}
{"text": "Classic awful T1 fan take. 2023 JDG is without a doubt the best single year team of fundamental league of legends. Smashed both domestic splits and playoffs, rolled everyone at a double elim MSI. But faker got that x factor at the semis. 2015 T1 would be close to JDG but they lost MSI even with the scuffed format it had. You can't win 0 domestic splits in 3 years and be the best team in the world even when riot gave this years worlds the T1 patch special", "label": 1}
{"text": "is this a chatgpt reddit account or what", "label": 1}
{"text": "[https://www.reddit.com/user/Acrobatic-Business29/comments/1gdy7p0/hello\\_guys/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/user/Acrobatic-Business29/comments/1gdy7p0/hello_guys/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "label": 1}
{"text": "as expected from T1 fan,s tupid as always.", "label": 1}
{"text": "> Other lanes I cant speak so much on. \n\nAnd yet you‘re claiming they don‘t need counterpick as much as support\n\n> I have the game sense of someone much higher ranked\n\nLeague players try not to be delulu challenge level impossible", "label": 1}
{"text": "yes, in the griffin days they had really dominant regular splits but faker and skt consistently beat griffin in playoffs. but for a huge stretch between 2022 to literally this series chovy \"figured out\" faker and had a really good record against him, haven't fact checked this myself but apparently between 2023 msi and now geng have not lost a series to t1, and before then whilst they had regular season losses to t1 they also won 2022 summer and 2023 spring playoffs against t1\n\nhttps://www.reddit.com/r/leagueoflegends/comments/179rz41/chovy_on_maybe_facing_faker_at_worlds_early_in_my/\n\ni dont think faker was sandbagging regular season either, bcus after a regular season loss to geng faker had a visible breakdown. and it's clear from interviews from t1 members that they were nervous going up against geng at worlds. personally i think the sentiment surrounding gen g and chovy is a bit revisionist and is a lot more boring than the reality of t1 improving a LOT since LCK and finally being able to overcome gen g for the first time in a long time.", "label": 1}
{"text": "What's the reason? Can you tell me?\n\nnvm, I looked at your comment history, do you have anything called \"Life\"? Or it's just reddit all day? I feel sorry for you...", "label": 1}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because all claims made about or against distinct entities must have sources or proof supporting them and present them in an unbiased manner.\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "IDK, he seems kinda gay to me.", "label": 1}
{"text": "Only if you're illiterate", "label": 1}
{"text": "The content of this post is no longer available, post has been removed.", "label": 1}
{"text": "> Do they stumble over their worlds in an embarassing fashion the way or as often as they did when they started out? Getting acclimated to the pressure doesn't mean you don't feel it, but that you perform inspite of the pressure.\n\nYeah and as has already been explained to you multiple times, they are still human beings.  They are not robots, they can't just do the maths on their emotions as you seem to think they can.  It's not some certain guarantee that just because they have exposure previously that they will 100% be able to remain emotionally stoic for the rest of their career.  Go outside and meet some real people instead of interacting with the rest of humanity exclusively through a computer screen and you might just come to understand how people behave.\n\n> If the players let bullshit fan narratives weigh more than their own performances throughout that entire year, then they truly deserve this loss and everything coming their way.\n\nIt's not a fan narrative, clown face.  It's reality.  What, you think GenG needs their fans to tell them that they've been flattening T1 all year and now T1 has levelled up?  You think they need a fan narrative to tell them that they have historically choked at worlds and still don't have that title despite all their domestic success?  Again, they're human beings.  Not robots.  Even for their own personal pride as players and competitors they are aware of the situation they are in.\n\n> Yeah, being good at sports means to not let yourself be weighed down by the stuff that would be too much for most non elite athletes. Seems obvious to me, but you apparently can't compute that. It's a projection to accuse me of an extremely simplistic thought process because I assume the people reading this are adults who don't need every detail spelled out for them, while you strawman what I say and apparently can't infer anything at all.\n\n🤓🤓🤓 you reek of being both terminally online and insecure.  Sorry that the world doesn't work the way you think it does, human beings are slightly more complicated than some arbitrary maths equation that you think should be reality.  Your thought processes *are* simplistic.  You lack basic human empathy and awareness of emotion, as well as a demonstrable and critical lack of familiarity with human interaction in the real world.", "label": 1}
{"text": "> Yeah and as has already been explained to you multiple times, they are still human beings. \n\nYou apparently think that if someone performs well despite pressure on a consistent basis, then that person is a robot. That reveals an extremely one dimensional view of how human beings can behave. Probably no exposure to sports or high pressure environments. If it wasn't possible to perform consistently in spite of high pressure at all, why do many top athletes, soldiers, etc. keep doing it? \n\n> It's not some certain guarantee that just because they have exposure previously that they will 100% be able to remain emotionally stoic for the rest of their career.\n\nNobody said that, you're building a fun strawman for yourself there. Do you deny the basic principle that generally, the more experience someone has with stressful situations, the more they are expected to be able to deal with pressure? \n\n> It's not a fan narrative, clown face. It's reality.\n\nI can tell that the whole \"you must go outside more\" schtick is a projection from you as a basemen dweller because it's obvious you don't go around insulting people like that in the real world. Nice tough guy facade though!\n\n> What, you think GenG needs their fans to tell them that they've been flattening T1 all year and now T1 has levelled up? You think they need a fan narrative to tell them that they have historically choked at worlds and still don't have that title despite all their domestic success? \n\nIt's not T1 leveling up if Canyon missjudges the baron call, that was a GENG mistake. One would expect from a seasoned competitor to realize the game was entirely in their hands and if it wasn't for that one mistake, they'd have won. If they got stomped throughout the entire game in a hopeless fashion like TES was, it would be more understandable, but they had complete control over their fate in Game 1 and then won game 2 resoundingly. If Game 1 still affects you at that point going into Game 3, that's a terrible performance.\n\nAnd Canyon and Kiin have never played for GENG at worlds before.\n\n> 🤓🤓🤓 you reek of being both terminally online and insecure\n\nThis is basic stuff you hear from anyone who does competitive sports or anything where money is on the line in high pressure situations. Again, clear projection from a keyboard warrior.\n\n> Sorry that the world doesn't work the way you think it does, human beings are slightly more complicated than some arbitrary maths equation that you think should be reality. \n\nArbitrary maths equation? What are you even talking about? Are you hallucinating?\n\n> You lack basic human empathy and awareness of emotion, as well as a demonstrable and critical lack of familiarity with human interaction in the real world.\n\nCondescending smack downs don't really work when you just repeat the same statement with different words that you think sound fancy or educated. It makes you come across as small-minded and insecure.", "label": 1}
{"text": "Scammer.  \nWatch out this guy Dms you to try to send you the ticket info.", "label": 1}
{"text": "Scammer.  \nWatch out this guy Dms you to try to send you the ticket info.", "label": 1}
{"text": "How did mods allow this post? It's literally a guy begging for an account with a shitty backstory.", "label": 1}
{"text": "no fk geng", "label": 1}
{"text": "I am an introvert so I rather not go", "label": 1}
{"text": "yea i can tell you dont socialize, i just doubt its completely by your own decision though :)", "label": 1}
{"text": "Idk if socializing means I get attacked for having an opinion...", "label": 1}
{"text": "literally most of us don't believe in god, we just dont feel the need to bring it up every moment, you're just as annoying as a religious individual pushing their beliefs onto you, just let people say whatever they want and let them believe in whatever they want, there's always a chance you're wrong anyways", "label": 1}
{"text": "Let people say what they want btw imma shit on you for saying what you want.", "label": 1}
{"text": "alright, i understand you dont have the mental capacity to understand my point, you'll just keep being average reddit atheist on a high horse, i feel no need to continue this argument, have a lovely day in your shit covered adult diapers.", "label": 1}
{"text": "I lost all of my pick'em so it hard for me to watch final.. anyway this might sound controversial but T1 will won anyway since Korean always win since they change format to double elimination", "label": 1}
{"text": "it kinda the same", "label": 1}
{"text": "maybe semi double elimination, the semi version already buff Korean so much, can't imagine how the full one will look like", "label": 1}
{"text": "DEI", "label": 1}
{"text": "DEI", "label": 1}
{"text": "Really lame blog post.\nOh no! The casters came and did their exhausting jobs then left?! Delete this nephew lmao.", "label": 1}
{"text": "How can you dumb like this lmaooo, you bring brain to today's reddit cuh? Nerfed Chinese viewership already own all Korea and English buddy, then how the fuck you think 'viewership' would be a certain individual loll😂😂enjoy you cringe hate with you brain will make you like a normal IQ human hahaha🤣Mf thinks his blood is chosen and Chinese are born to be savages, check you mirror monkey, leftover enjoyer piece of shit", "label": 1}
{"text": "And a bigger cock than her boyfriend.", "label": 1}
{"text": "You guys are fucking stupid.", "label": 1}
{"text": "Wow, if BLG pulls this off, Korean fans might finally know what it feels like to *not* have to clear shelf space for yet another trophy. Imagine the existential crisis! 😂", "label": 1}
{"text": "No it won't? what lol what a shitty clickbait title. Chronobreak, and if it's intentional, abusing known bugs is punishable.", "label": 1}
{"text": "The casuals need to be cleansed", "label": 1}
{"text": "https://old.reddit.com/r/leagueoflegends/comments/1gdccbf/t1_vs_geng_2024_world_championship_semifinal_game/lu0k6oq/\n\nisn't this you", "label": 1}
{"text": "i just wanted to rewrite the post but i posted the original now. i'm new here lol", "label": 1}
{"text": "you were never emerald to begin with, riot was too generous with braindead players boosting them almost 800LP above their rank, now that riot is starting to realize what it did the monkies are slowly falling back down, expect to hit gold 1", "label": 1}
{"text": "I'm a mid player, and these are the stats of my last 3 bot laners\n\nadc/supp combined\n\n0/9/3 15 minute ff I ended 1-1\n\n3/15/7 (enemy adc was a smolder) I ended 2-6 because due to just team fight deaths after the other team grouped\n\n  \n6/19/12 I ended 3/2/7 \n\n  \nNow in these games was it just a bot dif? absolutely not\n\nmy top laners ended 1/5 2/8 10/10\n\n  \nLiterally 3 100% unwinnable games in a row.", "label": 1}
{"text": "I don't see how that team gets any better realistically. Ruler for Peyz could work. But Ruler at his best needs resources. Somehow getting the HLE bot lane maybe? But Viper is essentially the franchise player of HLE.", "label": 1}
{"text": "so you agree that yone should get nemesis' bounty? yone had 9k gold while nemesis had 7.3k gold. what does this do? if makes yone stronger and more impossible to kill.", "label": 1}
{"text": "im not a mirror bro.", "label": 1}
{"text": "I average 4 deaths and below on basically every single champ except for random champs where i have like 1 or 2 games", "label": 1}
{"text": "yeah ur right, Its my fault that I am playing games where I am up on gold on my laner and the entire enemy team has 5k+ up on every single role because my entire team is running it down", "label": 1}
{"text": "I've never had it as bad as this split. Something about it it just different", "label": 1}
{"text": "It might have been better if I had gone to the dance of death, but I was fascinated by Sundered Sky.", "label": 1}
{"text": "Oh yeah so we can see vi/jax/kaisa/rell getting picked 500 times. Fearless in worlds and msi would eliminate one tricks like bin real quick", "label": 1}
{"text": "Good example right here of a user that has 0 clue about this game", "label": 1}
{"text": "Touch grass", "label": 1}
{"text": "Womp womp, glaze your twink harder", "label": 1}
{"text": ">I can't post the video directly\n\nWhy not?\n\nI mean here it is https://www.youtube.com/watch?v=TPy02fuRvb4", "label": 1}
{"text": "People aren't being gleeful about him losing because they hate him as a player and like seeing him lose.  The glee is coming because of how utterly obnoxious his stan base has been, to an unhinged degree.  Calling him the next goat, hyping him up as the best in the world bar none for several years, and always blaming his team when he fails to win worlds.  *You people asked for this*.\n\nYou should be more than familiar with this sentiment.  You have enough history of talking down to T1 fans and claiming not to hate T1, but that you hate their rabid fanbase specifically.  Are you perhaps beginning to understand a little bit of how irritating that platitude is now?  Does it feel a bit irksome when suddenly you're the one who is part of the rabid fanbase whose player is receiving criticism?\n\n> So few people say that compared to the massive amount of people who shit on Chovy. The proportions are not even close to comparable.\n\nThis is such an egregious lie that I would think you were trolling if I didn't already know that you're a hardcore Chovy stan and T1 anti.  This has been Faker's worst year in recent memory and there has been no end of people calling him washed and saying he should retire.  Meanwhile you and the rest of the GenG stanbase has spent the entire year jerking each other off about how amazing your team (well, player in this case) is and aggressively squashing anyone who disagrees with your vaunted analysis.  Just a totally dishonest remark from you.\n\n> I think some introspection is in order for you.\n\nThis irony is *palpable*.  You've spent so long sitting pretty on your pretend throne of maturity lauding over how Chovy is amazing and T1 isn't, while deflecting criticism away as you disliking T1's fans specifically.  Now the shoe is on the other foot and you're trying to pretend like you're the victim here?  My comments aren't even defending T1.  I've spent a large portion of yesterday trying to defend Lehends from the likes of you, who would constantly trash him to protect Chovy from receiving any criticism at all.\n\nYou people seriously have no accountability, and no self-awareness.  You legitimately cannot recognise your own hypocrisy and when you are treated the way you treat others, you start kicking off.  This isn't just a clash of fandoms, and it is the height of arrogance to think that the only people who disagree with your opinion are doing so because of ideology and not reason.\n\nI don't care if you don't respect me, you long ago showed your true colours about pretending to a level of objectivity that you don't actually believe in.  It's very clear that your pretend objective analysis and faux intellectual theorising about this situation as an ideological clash makes you incapable of actually weighing in without bias.  This will always be a \"everyone hates Chovy because he challenged Faker\" situation for you.  Nothing anyone says or does will ever convince you that maybe, just maybe, there is some legitimacy to the criticisms levied at him.", "label": 1}
{"text": "I think you have a problem with your brain , respectably", "label": 1}
{"text": "I think you are close to breaking one of this subreddit rules.", "label": 1}
{"text": "based", "label": 1}
{"text": "FINALLY TOP LANE IS SAVED WITH THE NERFS TO THOSE ATROCITIES THAT HAVE BEEN DOMINATING FOR THE BETTER  PART OF THE WHOLE SEASON", "label": 1}
{"text": "post opgg and I'll prove there's no problems with game quality, your iq is way too low that I don't trust your perception of the ladder", "label": 1}
{"text": "God I hope there is special place in the afterlife for illaoi players", "label": 1}
{"text": "Just for Winter I think.", "label": 1}
{"text": "I think it's more that Red Side has to permaban Yone and Aurora. BLG could play the Smolder chicken game but knight isn't Chovy level on that champion. I remember Xiaohu was still able to lane, unlike Quad who was fighting for his life min 1.", "label": 1}
{"text": "Rigged", "label": 1}
{"text": "Wow, the changes for the 2025 LEC season sound intriguing! A three-split format could add a lot of variety and keep things fresh throughout the year. The idea of having a unique format for each split is pretty innovative too. I'm curious about how the Fearless Draft will work in the Winter split—sounds like it could shake up the meta quite a bit. Anyone else think this could lead to some unexpected strategies or maybe even give some underdog teams a chance to shine?", "label": 1}
{"text": "Please please please shut the fuck forever about anything league related", "label": 1}
{"text": "BLG BLG BLG So good they win easy t1 trash 100% no cap", "label": 1}
{"text": "Remove yourself from the sub and league please.", "label": 1}
{"text": "Get a life", "label": 1}
{"text": "anything is better than that irish caster. he sucks so bad and talks so much bs it is pointless to have him there.", "label": 1}
{"text": "Black\n\nWoman\n\nMuscle,  fucks femboys = fuck patriarchy\n\nIs it really that hard to understand what's going on here?", "label": 1}
{"text": "hope you get cobid and cant go", "label": 1}
{"text": "> Hopefully the others will follow suit eventually.\n\nNo.", "label": 1}
{"text": "Your post has been removed because feature suggestions must be at least 250 relevant characters in length per the [Feature Suggestion rule](https://reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_feature_suggestions).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 1}
{"text": "I would say emerald is probably worse than bronze in terms of trolling", "label": 1}
{"text": "The broadcast will be worse for your having been there.", "label": 1}
{"text": "glad drakos isn't there , i can't stand him", "label": 1}
{"text": "Wow, looks like the LCK is in for some big changes next year. I'm curious about what these changes entail—are we talking about format adjustments, team roster updates, or maybe something to do with viewership experience? The link seems broken, but if anyone has more details, especially from kenzi's report, that'd be awesome. It's always exciting to see how these changes impact the gameplay and overall competitiveness of the league.", "label": 1}
{"text": "I rep my goat idgaf", "label": 1}
{"text": "yes", "label": 1}
{"text": "Small Indian company", "label": 1}
{"text": "reported it. If you fake such thinkgs ur mistake but i will call the cops on you", "label": 1}
{"text": "Indie\\* :D Indian means something else mate", "label": 1}
{"text": "They have a Fanfest every World finals. [https://lolesports.com/en-GB/news/worlds-2024-fan-fest-comes-to-peninsula-square](https://lolesports.com/en-GB/news/worlds-2024-fan-fest-comes-to-peninsula-square)", "label": 1}
{"text": "Yes, there were already three posts here suddenly removed, I wonder why", "label": 1}
{"text": "Yes, I heard some people are killing themselves over it as well", "label": 1}
{"text": "ye pissmods remove every post about it always", "label": 1}
{"text": "How dare you talk to others to see if its a shared problem!!", "label": 1}
{"text": "what?", "label": 1}
{"text": "https://www.reddit.com/r/leagueoflegends/comments/1gf4w4q/suicide_note/", "label": 1}
{"text": "There are people that are ending their own lifes due to the server issues", "label": 1}
{"text": "i am gay", "label": 1}
{"text": "Same thing happened to me when I signed on just a bit ago, wasn't there a few hours ago when I was on. It has me scared to play any matches now in fear of the wonderful Vanguard system flagging me for \"hacking\".", "label": 1}
{"text": "Because Gay and Lesbian people On Main Launcher Screen, Thats Why All Dropped Down", "label": 1}
{"text": "This happend to me on my alt account (grandmaster, my main is chal). Its becasuese u dont update vanguard (smh). Easy fix! Just watch this quick toutorial: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "Its ok! Easy fix watch video: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "No problem bro! Just update vangaurd look at video: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "No problem! Watch now: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "Yes! They linked this on X (formally known as Twitter (The Bird)): [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "Aram is no more, look video: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "They explained why they took away aram: [https://youtu.be/x81mdCH\\_FnQ?si=NHj8FJ0vh1h1V7o4](https://youtu.be/x81mdCH_FnQ?si=NHj8FJ0vh1h1V7o4)", "label": 1}
{"text": "Medic is insufferable. “AND _____ ARE THE KINGS OF LEAGUE OF LEGENDS, THE KINGS OF EUROPE, AND THE KINGS OF WORLDS” after every game is gonna be exhausting.", "label": 1}
{"text": "ach te7chi fih", "label": 1}
{"text": "Why Vedius , bad news :(", "label": 1}
{"text": "nope", "label": 1}
{"text": "kobe has been dead for 4 years wtf", "label": 1}
{"text": "I hate vedius, where is captainflowers? >:c", "label": 1}
{"text": "C'monnnnnnnnnn", "label": 1}
{"text": "That is very true.", "label": 1}
{"text": "Made in China For China", "label": 1}
{"text": "I am not focusing on my teammates mistakes during the game. Stop projecting. I try to tp gank bot etc but feels like at least half the player base in plat/emerald are boosted apes", "label": 1}
{"text": "Nah game is trash, one lane can make you lose the match. I'll just go play a better game", "label": 1}
{"text": "anyone can respond me ?", "label": 1}
{"text": "“Stop projecting” 😂😂😂 don’t get so defensive man just a better role and carry champs. You’re just trash", "label": 1}
{"text": "You don't want to \"participate\". You want to be the main event. You fancy yourself the main character & it hurts your ego to realize you ain't all that & even with a support ur still not cutting it.\n\nTBH I hate everything about players like you. You're the type I run it down your lane once, just so I know for sure you're fuming all game because I know you're going to be toxic at the end anyway. You're the rare type I'm willing to take a loss for once a month.", "label": 1}
{"text": "Lickable pits\n\nomg dude you're so pathetic", "label": 1}
{"text": "Lol.. projecting. Your response shows why you're low elo, you're just dumb. It doesn't matter if its before, during, or after the game - your teammates in soloq are complete RNG which goes for everyone in every elo. The ONLY thing you can do is to focus on every single one of your mistakes and how to improve them.\n\nYou also said you tend to win lane but I'm wondering if you just pick common lane bullies and don't even get the advantages you should be getting and then putting your team in a bad spot with a useless champ in mid/late game. Link your OP.GG if you want some actual advice because all your post and replies so far are nothing more than venting.", "label": 1}
{"text": "Eww a weeb", "label": 1}
{"text": "lol no. The GOAT will always & forever be Fatal1ty. It's truly not even close. The problem is most of you whipper snappers are way too young to understand just how good this guy was. He could pick up any 1v1 FPS & hang w/ Top 8 in the world in less than a month of practice. It was nuts. The problem is the skill gap is so massive compared to today's standards you kids will see it & think, \"Hah. He sucks!\" not realizing what the standard was back then. It'd be like calling MJ washed. Just a different time.\n\nHe'd legit go 25-0 vs Top 10 in the world, every time. YALL JUST DON'T KNOW THIS MAN WAS A TERROR LIKE NO OTHER", "label": 1}
{"text": "Same!! Hate shaco since it keeps fooling me...", "label": 1}
{"text": "Is there anyone would like to share :(", "label": 1}
{"text": "best option, is play with a friend who knows the game and can give you tips on the fly. if you don't have friends like me you can join a discord lfg server and maybe people who wanna help.\n\noptions 2, spam aram and READ champion abilities in death recap to get familiar with as many champions as you can, and learn what they can do, learn more about itemization as it's much faster and easier in aram. try different champions yourself in aram also helps.\n\nthen you can move on to summoners rift and start learning lanning and macro map awareness and all that stuff.", "label": 1}
{"text": "glad to see im not the only one who do that lmao.", "label": 1}
{"text": "This bro can't even read. LMAO. Have you ever played league? Jesus. lmao.", "label": 1}
{"text": "oh maan you don't know how pissed i get when i finally get to the game where someone bans the 0.0001% pick/ban rate champ i wanted to play without hovering.", "label": 1}
{"text": "Where's the light.Novice task", "label": 1}
{"text": "He wasn’t starting an argument?? He asked a genuine question in a polite and curious way. You guys are so mad and for what lol?", "label": 1}
{"text": "I'm interested in that Ivern's ted talk if you have it 👀", "label": 1}
{"text": "Lulu, point to click cc, making her adc unkillable, infinite slows, huge shields, making her a champ designed to be perma banned", "label": 1}
{"text": "Get these white people off the desk. League js Dominated by asians. Casters should also be mostly asian.", "label": 1}
{"text": "At this point, it sounds that the day Faker will retire will be a national holiday in China xD", "label": 1}
{"text": "Loser", "label": 1}
{"text": "Please post all client bugs in the [current bug megathread](https://www.reddit.com/r/leagueoflegends/search?q=Bug+megathread&restrict_sr=on) instead of their own individual threads. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 1}
{"text": "Bro It doesn't matter what you say.\n\nIf tris lives and didn't stay T1 would call a Dragon soul rush. Such a stupid Geng Femboy, watch their comms before replying to me please. Even a Platinum player knows to back off in that 2v4 fight. You're choky thinks he's a god trying to 2v4 and hitting a Jax, what can hitting a \"JAX\" possibly do?", "label": 1}
{"text": "Sure, but China is still the most butthurt having to play catch-up for the last 40 years.", "label": 1}
{"text": "I'm not proving your point. While they may be nationalistic, that does not make them the same. That's a logical fallacy you're using to deflect from the fact that Chinese is by far the most petty.", "label": 1}
{"text": "I feel like \"All the mages are going support\" is almost an outdated opinion. You covered DoT champs but back during the first durability patch and through mythic items a lot of the artillery mages felt awful in mid, and Riot didn't really act on it until Lux and Xerath's midlane pickrates fell out completely. They made changes to get a number of these mages back to mid and it's largely been fine since? Vel has stayed support skewed because of his high base damages but he's still showing up in mid again.\n\nI feel like what's been happening with Seraphine is she's been picked primarily support since she came out, no matter if it was good or bad. Unlike with say, Lux (wanting to compare egirl with shield champs), who was traditionally a midlaner and had a reputation as one of the last pick \"\"support\"\" champs (along with leblanc and nid) to boot. I'm honestly not really sure how they could adjust that and get people to actually -want- to pick Sera mid/bot more often than support outside of completely removing her W... but having a hybrid carry enchanter like her is way more interesting for the game.", "label": 1}
{"text": "he's not asian, ofc no one wants him lmao, the asian scene is what tends to kill competitive gaming as a whole, they put way too much into improving at these games to such a degree that very few even stand a chance, and as such start finding new games, it's why worlds is boring now a days, you already know what teams are gonna be in the finales", "label": 1}
{"text": "Proof of Chinese nationalism being toxic towards Koreans? You can see even see  it in the league forums. Why does this thread even exist? \n\nBeing defensive won't change what is clearly evident. The proof is all around us that any objective observer can see for themselves.", "label": 1}
{"text": "Stop turning everything around on me. I feel like I'm arguing with my sister. \n\nNothing you're saying disproves any of my statements.", "label": 1}
{"text": "hi", "label": 1}
{"text": "Popular opinion noone gives a shit about streamers.", "label": 1}
{"text": "I don't get it streamers are a very fucking small minority. Let them suffer most of them are toxic idiots anyway.", "label": 1}
{"text": "It's going to get much worse when players actually quit (or are forced to wait) because of missing the fucking button.", "label": 1}
{"text": "upvoted", "label": 1}
{"text": "if I had kept playing I might have gotten angry at what you wrote", "label": 1}
{"text": "XD", "label": 1}
{"text": "Keep on sucking up to riot employees , maybe they give you a skin.   \nBtw just glanced at your comment history. Please go outside more. This is not an insult, geunine worry ;/", "label": 1}
{"text": "I'll be down for some Hysterics. Just dont get me Dagda.", "label": 1}
{"text": "Agreed 🤝", "label": 1}
{"text": "Soft ", "label": 1}
{"text": "LMFAO. You're so high on your own farts you have no idea what reality is anymore. You're either 12 or exceptionally stupid.\n\nAhhhh, a UFC fan and MAGAt. Definitely exceptionally stupid.", "label": 1}
{"text": "what a snowflake", "label": 1}
{"text": "Wow, China is such a lovable country. Absolutely no unhinged chauvanism here at all.", "label": 1}
{"text": "Can you link a selfie of you looking/feeling dumb?", "label": 1}
{"text": "You are the bonobo.", "label": 1}
{"text": "As long they're not toxic or trolling in-game it's fine. Stop being a cry baby, not everyone wants a cringe \"wholesome\" OTV personality to stream league ", "label": 1}
{"text": "I have seen a boosting acc last split which had like 200 shaco games with 0 percent wr. But then it had games on graves, kha , lee etc on 90 to 80 percent wr. If that acc never got banned this one surely won't. and this acc was in NA.   \n\n\nHe would basically soft grief games to always sit in plat 4 to make boosting easier. Riot just doesn't care because guess what when I had the unfortunate  luck of having him play as shaco he never typed so the system would never catch him.  \n\n\nAlso mods will remove this post either way so none of the rioters will ever see stuff like this.", "label": 1}
{"text": "Get better. Champ isn’t made for bronze players like you", "label": 1}
{"text": "😂", "label": 1}
{"text": "Are you stupid?", "label": 1}
{"text": "lols", "label": 1}
{"text": "i'm just asking, no need to be rude", "label": 1}
{"text": "Fucking lmao you made me remember that garbage. Gameplay stat challenges you need to PURCHASE. Any other game has those tracking in the background for free, but no League. There they only did two releases you had to pay for, and called it a day.\n\nClownshow.", "label": 1}
{"text": "mods will prob delete it dw", "label": 1}
{"text": "Visibility on Twitter is really bad for most people. You can't start a thread there and expect replies if you don't have a lot of followers, unlike a forum or Reddit.\n\nWhy don't you stop deleting hundreds of threads that have their place here?", "label": 1}
{"text": "Would be great, just go to the rules page, read them, and follow them.\n\nMakes life so much easier for everyone", "label": 1}
{"text": "The person who made the thread only pointed out that Riot is not fixing an important bug that is very well known and has been there for a long time now. What rules did he break? It wasn't a bug report and you flagged it as such.", "label": 1}
{"text": "Hi", "label": 1}
{"text": ">I mean you have eyes, you can read.\n\nCan you? I just told you that his post wasn't a bug report, and you're quoting a rule about bug reports.", "label": 1}
{"text": ">The person who made the thread only pointed out that Riot is not fixing an important bug that is very well known and has been there for a long time now.\n\nOh sure, it’s not a bug report, it’s just OP reporting a bug… your words by the way\n\nThe hoops people jump through to pretend that it’s not obvious what this is.\n\nIf it’s not a bug report then what is it? A bug pointy outy thread? A “hey look at this bug but don’t say anything!!” Thread?\n\nLike come on, that’s just super weak my dude", "label": 1}
{"text": ">Oh sure, it’s not a bug report, it’s just OP reporting a bug… your words by the way\n\nNo? I said that OP is discussing about Riot not fixing a bug, and he's clearly asking whether or not they've talked about a potential fix anywhere. He's asking for information, not reporting a bug. There's a big difference.", "label": 1}
{"text": "So it’s reporting a bug that’s not fixed yet.\n\nYou can twist the words how ever you want, but this is really cut and dry my dude. OP just needs to add a patch number. Doesn’t even need to be researched as the official patch that it was found, just that it was first noted by them. \n\nLike the point of the rule is to not only corral new bugs to the megathread, but also HELP PEOPLE that may be able to start to diagnose what changed when that bug was first noted.\n\nIt’s like you want everyone to make vague and esoteric posts with less than useful information. That’s fine, but I’m sure there’s other places you can go where people just don’t care to give good info.", "label": 1}
{"text": ">I know you've imagined some weird esoteric post type for this\n\nIt's just called a question. Nothing esoteric about that. Asking for an update is vastly different from reporting a bug, and it shouldn't be placed under the same category. I really think you should change your view on this topic.\n\n>Usually people don't sit and wait on the bug that long\n\nOP is asking for an update BECAUSE it has been very long. That's the thing. The bug report has been made by other players long before him, so he's not doing that. That's not the goal of his thread.\n\n>The idea would be to give a general area then. Likely you'll put a later patch anyways.\n\nDidn't OP say that this bug has been there for quite some time now? I don't remember the post, but if he did, that's just the same as putting a random patch number from some time ago.", "label": 1}
{"text": ">It's just called a question. Nothing esoteric about that. Asking for an update is vastly different from reporting a bug, and it shouldn't be placed under the same category. I really think you should change your view on this topic.\n\nIt's still reporting a bug. Come on, honestly if you just keep repeating this, Im just going to end the conversation because I'm not dealing with some weird esoteric characterization.\n\n>OP is asking for an update BECAUSE it has been very long. That's the thing. The bug report has been made by other players long before him, so he's not doing that. That's not the goal of his thread.\n\nCool, then he should be able to reference those for the patch number. If Riot isn't paying attention then clearly a new report was thought of by OP. That simple.\n\n>Didn't OP say that this bug has been there for quite some time now? I don't remember the post, but if he did, that's just the same as putting a random patch number from some time ago.\n\nWeird, notice how the post say patch number and not \"some vague time period\".", "label": 1}
{"text": "Mastery point could give a sense of how much you played a champ.\n\nNow i can't exactly say how much lvl5/10/25/100 is.\n\nIt's just worse overall at estimating someone's time on a champ.", "label": 1}
{"text": ">Cool, then he should be able to reference those for the patch number. If Riot isn't paying attention then clearly a new report was thought of by OP. That simple.\n\nAs I said before, it's sometimes very hard to find the original bug reports with the search function. You'd want somebody to waste a lot of time looking for a patch number instead of just asking their question?\n\n>Weird, notice how the post say patch number and not \"some vague time period\".\n\n\"Some vague time period\" and \"inaccurate patch number from a while ago\" is quite the same, really. The former is actually better since it's not a lie.", "label": 1}
{"text": "Everyone here looks like they were in my computer science and health science classes in university. \n\nI'm not racist but I think I went to school with 2 or 3 of these guys.....", "label": 1}
{"text": "It is completely wild to me that streamers built the LOL brand. \n\nYet riot will not, and actively fight against making the league about the thing that drove the sport to where it is.", "label": 1}
{"text": "Your statement was hyperbole. If you don’t want it to be hyperbole then use your big boy words to say what you actually mean or spend your 5 minutes of research before posting a comment.", "label": 1}
{"text": "Is it worth actually showing up at doors opening", "label": 1}
{"text": "oh fuck off", "label": 1}
{"text": "Gg wrap it up 10 more years of faker", "label": 1}
{"text": "what the fuck are you talking about, the two sports they mentioned are not team sports, the most toxicity comes from football, and basketball which i outlined here: the two most contact heavy sports.\n\nleague is inherently toxic because you have to pursue a goal with an ANONYMOUS team on the internet you have 0 real contact with\n\nany approach that \"league doesnt require toxicity for you to win\" is legit an american way of twisting the argument by devoiding the environment of any human interaction. there will be human interactions and there will be toxicity, thats what being inherently toxic means\n\nidk seems pointless to discuss any sport psychology with americans and redditors, half of you never played in any amateur sports league so why spew bullshit about TENNIS AND GOLF not being toxic when league is more close to football or bball if both were played with masks on", "label": 1}
{"text": "i was so happy to get my mastery LVL 7 on Katarina !!!", "label": 1}
{"text": "If u fail u learn? Thats how you progress. Trial and error.", "label": 1}
{"text": "Beifeng \n\nIn terms of strictly mechanics, I don’t know another person whose fingers can do what he does. Some of his combos are so fast you need to rewind a couple times just to see wtf even happened.", "label": 1}
{"text": "azzap probably even though I think he's incredibly cringe and annoying, but when he played challenger on kr server, vel koz had like a 70 or 80% win rate in challenger because he was the only person playing it", "label": 1}
{"text": "Never turn chat on. you can leave pings on, but mute the person instantly when they mia ping you.", "label": 1}
{"text": "You can also consider different physical gifts. Here we can help you find more inspiration.\n\n[https://ig1688.cc/collections/wooden-gift-ideas](https://ig1688.cc/collections/wooden-gift-ideas)", "label": 1}
{"text": "The cringe-o-meter will reach OVER 9000!!!", "label": 1}
{"text": "Here's a nice [beginner book](https://amzn.to/3An6ZhE) on posture and healthy biomechanical habits for anyone interested", "label": 1}
{"text": "nobody cares about your BS EGO CEO and their wish to become relevant.  You're NOTHING in grande scheme of gaming - GET OVER YOURSELVES... que dodging ARAM players is a TRAGEDY of your BS FEEDBACK system - this has to stop.  it is quicker to create a new account than play by your rules. WHY ARE YOU PENALIZING ARAM PLAYERS FOR QUE DODGING - because you use AI now to match and cost you $$ per game EXPONENTIAL WASTE OF RSS STOOOOOOOPID GAMING DECISION BY MODS THAT HAVE NO CLUE", "label": 1}
{"text": "what are you on about", "label": 1}
{"text": "take down the post- THIS IS YOUR PAYCHECK - fucking idiots ---- DONG----DONG.... do you hear black maga coming for your out-dated asses?", "label": 1}
{"text": "also, how do you not know wtf im talking about unless you are paid to watch these forums that you cant control -- what is it brit time now instead of EST and you're up now!? LOL the rule is dumb you're even dumber for not knowing wtf im talking about and you're about to be replaced with an AI BOT... where legal.", "label": 1}
{"text": "Ppgang crazy loll. Sounds like a gay harem or something 🤣", "label": 1}
{"text": "nah, you can get too much info from pings to just keep them off", "label": 1}
{"text": "You would probably like a lot of the content that I make that can't get shared here because it's not directly league related.\n\nI like to mix the quiz shows up with broader stuff like this one to try and reach more casual league fans and pull them into esports a bit.", "label": 1}
{"text": "i made atk move click algorithm and ruined games for combined 10 hours so far... for missing a 2 second game que on ARAM.  how about F \\_ U RIOT", "label": 1}
{"text": "Maintaining high metrics across the board is a fun challenge. I don't know what's hard to grasp.\n\n>I dont know why you are insulting me\n\nInsult? If you don't want to be observed as a petulant baby, then don't be a fucking baby.", "label": 1}
{"text": "Lupealmaguer", "label": 1}
{"text": "[https://www.youtube.com/watch?v=Aykr7aS7OU8](https://www.youtube.com/watch?v=Aykr7aS7OU8)", "label": 1}
{"text": "Well once you get decent at the game you almost always know where a jungler is anyway. There are only so many places a jungler should be and only so many moves a jungler should make. Back in the day, junglers would sneak around when making certain moves but nowadays like, I'm going to your raptor camp because I know you can't contest. You know you can't contest this raptor or scuttle, and you know I'm going for it anyway, so why should I waste time walking behind the turret when I could walk through mid, take my laner's exp (hopefully smite the cannon) and then get where I need to be 10 seconds faster?", "label": 1}
{"text": "Lmao what a dog you are.\n\nCalling those sports group efforts and not team sports at the same time gotta be the single most degenerate statement of the day.\n\n\"Ooga booga, me bigg stronk, me so affleet, u soo lazey uh uh ah ah\"\nYea stupid, that's the vibe you give off. Shame tge amount of copious projecting you do is too obvious for anyone to feel attacked by your verbal diarrhea.", "label": 1}
{"text": "Have you tried quitting, the best way to be the best is to never try in the first place, you can't be bad at something your not doing, only \"doing\" it makes you bad or not", "label": 1}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because all claims made about or against distinct entities must have sources or proof supporting them and present them in an unbiased manner.\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "Chovy is such an interesting character because I spend 99% of the year watching the community swing their neck on his dick and 1% of the year watching him lose.", "label": 1}
{"text": "Wow, he’s so athletic! Overcoming discomfort from sitting in a padded gaming chair 😩", "label": 1}
{"text": "Gaming houses were a content goldmine! But poor marketing sunk them. Using tools like Pulse for Reddit, CrowdTangle, and TweetDeck could boost engagement and profit. Execution matters!", "label": 1}
{"text": "I've used stubhub twice and it's been fine, I've also had to sell one of my tickets due to flights being cancelled got my money just fine.", "label": 1}
{"text": "The number of lpl stans in this single post is just miserable", "label": 1}
{"text": "why give this nazi astrononce any attention lol just block him on twitter like normal people do", "label": 1}
{"text": "so worlds can be called Last Stand? /s\n\nthis is pretty cool.  but will it be like EWC where no one cares or will it be  prestigious like MSI/ worlds?", "label": 1}
{"text": "Be honest this has nothing to do with the disaster it's just about you not liking Thorin. \n\nUsing this excuse to post your hate thread is just as gross as the joke he made, or worse.", "label": 1}
{"text": "Hello, sorry that I wasn't fully aware of the rule. I have edited the post so it contains more than 250 characters in the body.", "label": 1}
{"text": "Yes, and also faker slamming his head against the wall in frustration", "label": 1}
{"text": "SKT FLAIR. WAGONER DETECTED.  NO ACTUAL KNOWLEDGE OF ESPORTS.\n\nauto blocked activated.  User purged.", "label": 1}
{"text": "Both plays are valid. When you noticed your bot lane going mid, you should have either 1) shoved mid and went bot or 2) told them through pings that you would like to continue playing mid. In situations like that, I would usually choose the option that does not rely on communication (Option 1). In SoloQ, especially in low elo, it is much more effective to adapt to the plays of your teammates rather than forcing your own playstyle (unless you are a smurf).", "label": 1}
{"text": "eventvods . com", "label": 1}
{"text": "If you now also start putting the word **allocating** in bold letters, you might be getting somewhere", "label": 1}
{"text": "what respect lmao", "label": 1}
{"text": "Caps would block himself if he had to play for FNATIC again, isnt he very vocal about disliking the org and being happy to beat them everytime?", "label": 1}
{"text": "considering people here are biased, are toxic, and are assholes, this wont achieve anything but i do agree with you. Here its just toxic men", "label": 1}
{"text": "AD Bruiser Malphite with items like Botrk/Titanic/Termius/TriForce.", "label": 1}
{"text": "Bruisecake NA", "label": 1}
{"text": "im technically an adult", "label": 1}
{"text": "Azura#Aedra, NA server", "label": 1}
{"text": "Almost everyone that plays league are adults these days.\n\nNew player experience is fully of so much toxicity for them to join, and most players that joined back then were either already adults back then or turned adults by now.", "label": 1}
{"text": "lol  welcome", "label": 1}
{"text": "Truth", "label": 1}
{"text": "average player is a 24 year old male who started playing when they were 16, i wish you luck", "label": 1}
{"text": "Request sent", "label": 1}
{"text": "I mean, I don't care as long as you recognize :D", "label": 1}
{"text": "I'll add you back when I get home from work!", "label": 1}
{"text": "Well I'm technically an adult but still a teenager. But if you don't find anyone, you can ask me.", "label": 1}
{"text": "Also, is this true? Is the average player 24? This makes me kinda sad lol.", "label": 1}
{"text": "I mean my oldest is 14 and I adore him to death. Let's just game and enjoy!", "label": 1}
{"text": "Sweet! Lets gooooooo!", "label": 1}
{"text": "I’m adult but Gen Z… does that count?", "label": 1}
{"text": "I’m 40. My group of friends play Aram a lot. Feel free to join if we’re on. IGN: Orholam #NA1", "label": 1}
{"text": "So, add me? I'm here for the long haul!", "label": 1}
{"text": "Gg fluxy username\n\nI'm a  dad of 2. Play around 2/3 times a week once they go to bed. \n\nNorth American server. Currently play 3 with low emerald mmr. \n\nHappy to play with anyone who doesn't tilt. I get a few games a week and like to enjoy them. \n\nNorth America server.", "label": 1}
{"text": "I don't play Roblox or Fortnight so he can't help lol :)", "label": 1}
{"text": "Absolutely! My brothers are millennials and Gen Z. Honestly, all are welcome!", "label": 1}
{"text": "I'm game. I'm situational, but main goal is FUN!", "label": 1}
{"text": "Idk, im almost 29, and my friend list is pretty empty cause I don't add people myself, I just do whatever when I play usually", "label": 1}
{"text": "Invite!", "label": 1}
{"text": "I just tried to add Gg Fluxy......", "label": 1}
{"text": "Someone alerted the Suicidewatch mods from this comment\n\n  \nT1 FANS ARE NOT REAL BRO 💀💀💀\n\n[](https://emojipedia.org/skull)", "label": 1}
{"text": "I just wanna see a close game! So, basically guaranteed to be a 3-0", "label": 1}
{"text": "Depending who you ask tanks are dead", "label": 1}
{"text": "Stick to 1-2 champs", "label": 1}
{"text": "For Yasuo, I would suggest encouraging your teammates to pick champions with skills that trigger your ultimate (hovering Yasuo at the start of champion select should be enough) and ganking for their lanes during suitable windows after getting 6. That way you would help them in the laning phase so that they would be stronger mid game. At that point you should prioritise pressuring side lanes - you could easily join your team either by teleporting or hovering jungle while not pushing, walking towards the fight and ulting. That should be a good starting point.", "label": 1}
{"text": "The YouTube broadcast is scheduled to start at 08:30, so I would assume the opening ceremony would begin at 09:30. There is usually a 1 hour timer between the start of the stream and start of the action.", "label": 1}
{"text": "I have been playing since season 5 and I know what the abilities (including passives) of all champion do and what key they are assigned to.", "label": 1}
{"text": "i know the base damage of most non-new champs in game", "label": 1}
{"text": "It will be next :)", "label": 1}
{"text": "> you’ve deluded yourself into thinking Linkin Park won worlds last year, since they appear in the video more than anyone else\n\nFans have deluded themselves into thinking whoever wins worlds should appear in next year's video\n\nSeriously go look at any year before deft's and see how many times the champions appear", "label": 1}
{"text": "their mmr systems needs to stop matching people based on giving them easy and hard games, and just say \"you're in emerald 2, we're going to place with you 9 other emerald 2 players\"", "label": 1}
{"text": "yeah on top of it, hidden mmr needs to be deleted, if I am on a 10 game winstreak, just give me +100 lp to match my mmr and the mmr of the players I am playing against, would help fix smurfs as well", "label": 1}
{"text": "If I knew what episode of broken by concept it was, I would link it but no its not just placement games.\n\nAnytime you're about to rank up, they give you especially dog teams in order to see if you deserve to rank up, which is inherently completely god awful system. \n\nAn actual working system is if everyone is in the same rank with the same skill level and I stick out and cause my team to win over everyone else being completely equal, then I deserve to rank up, but their current system basically makes you need to be like e4 in a low-mid plat lobby in order to just hard carry every game, otherwise you just have to slowly win 10 games every 19 games to rank up which is a god awful system", "label": 1}
{"text": "League is harder to play because a simple troll can snowball the game into the opponents favor. Val is skill based so hitting shots is all it takes to win a round.", "label": 1}
{"text": "Is there any other concrete way to report him to Riot admins?", "label": 1}
{"text": "Yeah it’d be outdated now. It’d have to be like League of Legends: Pecs, Abs, Titties, and Anime.", "label": 1}
{"text": "Anyone else fantasize about Midbeast and Caedrel embracing each other romantically. Midbeast is obviously the dominant one and Caedrel is shy yet willing. I have thousands of pages in case anyone is interested.", "label": 1}
{"text": "Regarded", "label": 1}
{"text": "Hey, cant DM you but me and my gf can meet u at the arena anytime u say. We have serious interest in those tickets. Thanks. If you can dm me back.", "label": 1}
{"text": "Are there sub?", "label": 1}
{"text": "Hi, I’m interested. Do you have 2 tickets?", "label": 1}
{"text": "Same here, please comment here!", "label": 1}
{"text": "I thought a moderator deleted my post so I had chatGPT create a more friendly version - LOL![gif](emote|free_emotes_pack|facepalm)\n\n\"I don’t really play the game anymore—it just doesn’t feel the same as it used to. But I still love watching T1 play! Their matches are so exciting and keep me tuning in every time. I find that other games don’t quite have the same appeal. Anyone else feel like T1 matches are the only reason they keep watching?\"", "label": 1}
{"text": "If you enjoy them then yes. You will be able to climb high with them, but it will just take time.", "label": 1}
{"text": "I think there are a lot who don’t keep up with lol esports but still watch because it’s faker and t1. Wonder what will happen when we does eventually retire", "label": 1}
{"text": "What goes through your small brain when you comment shit like this? If you don't know someone just ignore the post.", "label": 1}
{"text": "Tickets are not transferable", "label": 1}
{"text": "3-0 from Bin GIGACHAD", "label": 1}
{"text": "This ceremony is fucking fire. idk what yall talking about it.", "label": 1}
{"text": "Go fuck yourself", "label": 1}
{"text": "happy?", "label": 1}
{"text": "This is as hype as Warriors in 2014", "label": 1}
{"text": "holy fuck this new chick FUCKS", "label": 1}
{"text": "ashnikko was so fucking sick and idec about the lipsyncing in the 2nd song. The choreography was insane", "label": 1}
{"text": "GIGACHAD ZEUS", "label": 1}
{"text": "I sent a modmail asking for clarification on the removal of the post and they just linked their comment removing the post lol.\n\nWhatevs", "label": 1}
{"text": "GUMAYUSHIT WHAT ????", "label": 1}
{"text": "FF THIS GAME PLS", "label": 1}
{"text": "maybe mods are woke against masculine mentality? lol", "label": 1}
{"text": "Maybe, but their response to my asking for clarification kind of rid me of any willingness I had to give them the benefit of the doubt", "label": 1}
{"text": "Because t1 flair mods will never allow that shit lol", "label": 1}
{"text": "removed by the mods bruhh. Bunch of soys. Basically the deleted comment said that the thread would’ve been posted instantly if t1 won", "label": 1}
{"text": "Sylas for Faker makes this draft automatically 2x better than last game", "label": 1}
{"text": "youre so dumb", "label": 1}
{"text": "This is embarrassing already...", "label": 1}
{"text": "please can faker haters just shut the fuck up?", "label": 1}
{"text": "I really enjoyed the live. Why were they deleted? They're not even spoilers. In previous live, there was something wrong with the audio, but in this one, it was pretty short, but the singers sang well. I mean The song Rise was great, but the live from Mako singing drunk was something else. xD", "label": 1}
{"text": "Lmfao did they lock this also?", "label": 1}
{"text": "Just one game away from T1 \"fans\" being quiet for a year :pray:", "label": 1}
{"text": "CHINA IS BEST KOREA", "label": 1}
{"text": "Fakers last match inbound", "label": 1}
{"text": "the best lineup of all time who only managed to win 1 trophy out of 6 in LCK and 1 international out of 6 as well\n\nLMFAO", "label": 1}
{"text": "not gonna lie,but gilgamesh sounds like t1 fan", "label": 1}
{"text": "exciting", "label": 1}
{"text": "What champ did you eventually decide to play top lane?", "label": 1}
{"text": "FAKER CHOKED GG", "label": 1}
{"text": "CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL CRUCIAL", "label": 1}
{"text": "what advantage ? ahri screwed her flash e lol", "label": 1}
{"text": "you are dumb, nothing else to say", "label": 1}
{"text": "revisiting old threads to shit on people cheering for their team is sad lmao", "label": 1}
{"text": "5 chinese can't win. They needed Scout, Rookie, Viper, Doinb, and TheShy", "label": 1}
{"text": "What are you 12?", "label": 1}
{"text": "5 chinese can’t win", "label": 1}
{"text": "This isn't Joker 2. He's just allowed to play crazy.", "label": 1}
{"text": "Viper - League of Legends Worlds 2024 Song Unreleased [Full Version]\n\n\nnext time ,you can simply write few lyrics from the song and youtube/google will find it", "label": 1}
{"text": "The only disgusting choke was that ur mom didnt swallow", "label": 1}
{"text": "🧢", "label": 1}
{"text": "knight is a fraud", "label": 1}
{"text": "someone gonna shoot him, cuz he is on too much ones way.", "label": 1}
{"text": "oh really, u played starcraft back then and watched?\n\n  \nor just parroting narratives?", "label": 1}
{"text": "Okay bro sorry I won’t critisize shit anymore until my team wins worlds 🤣🤣🤣🤣 fucking regard bum", "label": 1}
{"text": "Shame koreans are so toxic thats why he’s so PR trained lol, if he says something bad or controversial they make a big fuzz", "label": 1}
{"text": "Random guy runs on stage while T1 lifts the trophy, incident is visible on the arena screens. Mod teams delete all posts regarding it.", "label": 1}
{"text": "Hi /u/Blaikiri7. Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because \n*we do not allow submitting threads with spoilers in titles.*\n\n\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "I don't know what you're talking about... Nobody saw anything", "label": 1}
{"text": "Where’s the spoiler in the title?", "label": 1}
{"text": "Winning worlds or not is besides the point you asinine bozo, all I'm saying is that it's really stupid for you to criticize them for playing safe in literally one of the most important series of their lives??", "label": 1}
{"text": "5 CHINESE CAN’T WIN!\n\nBUT 1 KOREAN CAN WIN 5! \n\nRIGHT?", "label": 1}
{"text": "Who was that guy in the black shirt?", "label": 1}
{"text": "I suppose a random guy inside the arena, you can see him running up the stage trying to get to faker, then is pushed away by 1 of T1 players, Oner or Zeus, and then he is taken away by security.", "label": 1}
{"text": "5 chinese cant win", "label": 1}
{"text": "Okay? Maybe they dont wanna give the guy any attention because its pathetic?", "label": 1}
{"text": "Or maybe they don’t wanna discuss about an insane security breach :)", "label": 1}
{"text": "Mods please delete this post. Massive spoiler lmao.", "label": 1}
{"text": "Any video of bin when they lost? I wanna see his fat downsyndrome tears for calling out the goats", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "I’ve watched a lil bit of your comment history. I see you’re a professional reddit mod and I am at a disadvantage here. I also had a good laugh.", "label": 1}
{"text": "Again, there’s no such rule. You could indicate it, but your moderator ego is too high. I’ll have a good one, looking how you argue all day on reddit. Good luck bud", "label": 1}
{"text": "Waste your best years of your life as a teen and 20 year old in League for thousands of hours...\n\nThen waste your 30's and 40's in a boomer MMO by Riot\n\nCorporate Lifestyle Gamer", "label": 1}
{"text": "Amazing", "label": 1}
{"text": "Seeing this having +200 new comments today lol. No doubt all 200+ are trashtalkers with the power of hindsight lol", "label": 1}
{"text": "w 54 ouqwwertytrq", "label": 1}
{"text": "So many nerds", "label": 1}
{"text": "just out of curiosity - are you chinese? if not supporting a chinese team sponsored by a chinese tech company is kinda cringe", "label": 1}
{"text": "why is Faker the MVP though? sure he played really well but Keria was literally carrying and preparing the plays for T1. Even prevented Knight from Teleporting to the last Fight toplane with his ult offscreen etc.", "label": 1}
{"text": "Racist pos", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "Faker is the GOAT", "label": 1}
{"text": "I assume they're discussing their takeout order for after the game.", "label": 1}
{"text": "Better team and the better region won. 3 times in a row for lck. 9 titles against 3. No reason to praise the loser", "label": 1}
{"text": "this series was crazy", "label": 1}
{"text": "Shut the fuck up", "label": 1}
{"text": "T1 and BLG both really showed up in this final, and it was a roller coaster till the end.... Watching Faker take MVP was just INSANE", "label": 1}
{"text": "question , why dont they dope up !?", "label": 1}
{"text": "I was scared seeing faker playing Gallio. I still remember the sad loss that he had with it. But clearly it was a great decision the match was epic", "label": 1}
{"text": "The level of cope you are channeling to justify \"this is how i like playing\" turning into \"the best way to win\" is crazy\n\nBy that logic, shouldnt I as your jungler do absolutely everything to get myself ahead even if it comes at the cost of you? You could probably optimize your lane to win anyway\n\nAlso calling someone a silver because they disagree with your opinion makes you come off as giga insecure, especialyl when youre not even bothering to do any research on them", "label": 1}
{"text": "Shut up", "label": 1}
{"text": "I love faker", "label": 1}
{"text": "dmed you :P", "label": 1}
{"text": "i heckin love worlds :3", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "This reminds me a pro game from [last year](https://amzn.to/3UyncHO)", "label": 1}
{"text": "I assume this must be your first time ever going out in public", "label": 1}
{"text": "> i myself will still watch worlds next year. but lpl? lck? who cares. since lol esports are just about monkeys fighting uselessly for a year and faker win it all at the end. also wonder big names like JDG/GENG/HLE will still put that much money in it\n\nsuper emotional and childish reaction and projection. this attitude is exactly why faker wins and lpl doesnt, fuck off", "label": 1}
{"text": "zac is already turbo broken and will out damage any carry with just a liandries right now, pass", "label": 1}
{"text": "faker is a legendary player.", "label": 1}
{"text": "Yeah, I will buy a raw comment coming straight out of him on camera without time to cook up some PR horseshit instead of this heavy handed dismissal that reads like PR damage control, specially when this is T1 we're talking about, the team with an insane korean fanbase that will eat their livers raw for the smallest non-issues ever.\n\nI bet you also think that the police and investigators going straight for answers from the victims of a crime no matter how stressful right after it happens is wrong too, when that is known to be precisely the best time to get an honest and straightforward answer out of them.", "label": 1}
{"text": "FuckingCCCCCCCCCCCCCCCC", "label": 1}
{"text": "Awww", "label": 1}
{"text": "this whole LPL narrative is so insufferable and LPL fans come off as entitled. \n\nIf BLG don't win I will stop watching 😝 eheh XD\n\nLiterally the pessimism hurts the viewership more than actually losing. LPL never won before 2018 and they still did fine, they don't win for 3 years and for some reason they should just disband the region", "label": 1}
{"text": "Respectfully please never share another opinion 🙏", "label": 1}
{"text": "Don’t forget he also made zero panties drop", "label": 1}
{"text": "Keep coping", "label": 1}
{"text": "Please GP q yourself. This is not a joke.", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "I wouldn't say that, their secret diets are creating some next-level athletes.", "label": 1}
{"text": "I think the worst things that were said were to recall the Korean imports to CN. That's it. We didnt really threaten to stop watching LCK.", "label": 1}
{"text": "Do these restrictions have the same impact on the Valorant scene?", "label": 1}
{"text": "Do these restrictions have the same impact on the Valorant scene?", "label": 1}
{"text": "yah looks stunning", "label": 1}
{"text": "it's just anti chinese propaganda from western that makes the dumb west fans rooting for t1 by hating china without even knowing them", "label": 1}
{"text": "Westerners are not only bombarded with full anit chinese propaganda, but also propaganda for everything BUT the west.\n\nIt‘s actually hilarious how they keep referring to themselves as „free“ and „open-minded“ lmfao\n\nThey highkey think that their understanding of morality is like the objective truth around which the world must revolve", "label": 1}
{"text": "Bro, this shit mostly on reddit, while i agree that we get bombarded with copious ammounts of propaganda, generally people with IQ lower than a rock will fall for it, tough its still dangerous since a huge push of shitheads is getting created in europe, this is mostly notable here on reddit tough lol", "label": 1}
{"text": "Kinda summs it up, lots of people unfortunately got brainwashed with copious ammounts of propaganda and lost the ability to think for themselfes, its sad, but at the same time its NOT that much irl, these kids of of people are in huge numbers on social media ( expecially on reddit wich is full of nazis ong )", "label": 1}
{"text": "I préfère scour", "label": 1}
{"text": "Biggest anti Chinese sentiment comes from their neighbour countries in Asia.", "label": 1}
{"text": "genuinely had several people admit this to me when I questioned them about their T1 support.", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "Damn....", "label": 1}
{"text": "i am begging utterly clueless westoids to stfu about the game ban lol it hasn't stopped chinese kids from playing videogames as evidenced by the ridiculous amounts of domestic money mobile games and even traditional rooted console games like black myth wukong have pulled in", "label": 1}
{"text": "Anyone knows abt it?", "label": 1}
{"text": "Welcome in RIOT I DONT CARE ABOUT YOUR MATCHMAKING game xd", "label": 1}
{"text": "I was saving mythic essence to buy a Faker prestige skin since Summer of this year. That’s how much of a delusional simp I am, and Faker vindicated me.", "label": 1}
{"text": "It's unreal. It still motivates me so much. I believe T1 player grows from it as well. They all become stronger from it. Respect to all the players.", "label": 1}
{"text": "This is the first time for most BLG players to play in the finals. BLG made some bad choices in games 4 and 5, but they will learn from it. They are strong. Bin is the only top player who can compete with Zeus. The World Championship is in China next year, and they are likely to win it if they can keep the squad together", "label": 1}
{"text": "this is the game people want, and they deliver it.", "label": 1}
{"text": "You’re right. Faker had an incredible performance in game 4 when T1 was down 1-2. I don't think any other player could have done that in such an intense situation.", "label": 1}
{"text": "Well, sperm doesn't turn into the kid, it's basically a delivery truck carrying half of DNA to the egg. Sperm contribute half of the baby's DNA and then the body of the sperm dissolves the egg is what grows into a baby when fertilized. So half of you chose the other half of you.", "label": 1}
{"text": "It was only half of him", "label": 1}
{"text": "YOU'RE NOT KOREAN YOU LIVE IN HASTINGS, NEBRASKA", "label": 1}
{"text": "West is bad", "label": 1}
{"text": "Two people who can't read now?\n\nCome on two sentences is within your grasp.", "label": 1}
{"text": "Too tough for you?\n\nWhen good team beat bad team with gnar, that mean little. When fix win rate like this, number go way down!", "label": 1}
{"text": "Every single one of you is wrong. Redditors 🤓", "label": 1}
{"text": "Spoilers are not allowed in 24h after the game. Honestly, this time no one give a f\\*\\*k and there is a bunch of very much spoilerish posts in hot, therefore I was sure mods don't care. But they still removed it lol. Now I posted it after 24h", "label": 1}
{"text": "How did they get these numbers? and are they sure they are reliable?", "label": 1}
{"text": "Ok make sense ", "label": 1}
{"text": ">Ofc if you \"fix\" the WR because they were \"expected\" to win, you can make any Champ into a much less strong one.\n\nDude, if you're afraid of math just say so. Quit being weird. Yone does also get adjusted down, but not nearly as far. Skarner actually does not, who was strongest, not counting Aurora who was just banned too much.", "label": 1}
{"text": "i cant stand you people still sucking faker off. \nhes a very good player no doubt, but there are 4 other teammates with him. \n\nEven on the stream, they talk about Knight as a good player, but show faker on screen lol. \n\nits cringe, hes not carrying the team alone, its a team game and its not just him.", "label": 1}
{"text": "Legit just search Chinese lol player base or Chinese worlds viewership you lazy ass dude :)", "label": 1}
{"text": "Most of the LPL audience no longer play League of Legends, and their victory in the tournament would only cause them to harm more people on the internet. They lack respect for other gamers, engaging in long-term internet bullying against players of games such as Genshin Impact and Honor of Kings. Of these, Honor of Kings has been subjected to the most internet bullying because most of its players do not interact on the internet and there are many more League of Legends players in China. Additionally, some Genshin Impact players have replaced Honor of Kings players as the target of internet bullying. Genshin Impact players, on the other hand, have been subjected to long-term abuse because the internet is too active and they have too many enemies, but their player base is relatively small compared to other games. Interestingly, Chinese Genshin Impact players still look down upon Honor of Kings players on the internet.", "label": 1}
{"text": "Bro has the reading comprehension of a candy bracelet.", "label": 1}
{"text": "He meant Streak's", "label": 1}
{"text": "Have you tried seeking advice from r/gay. They have good tips on being verse.", "label": 1}
{"text": "Please post all client bugs in the [current bug megathread](https://www.reddit.com/r/leagueoflegends/search?q=Bug+megathread&restrict_sr=on) instead of their own individual threads. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/leagueoflegends) if you have any questions or concerns.*", "label": 1}
{"text": "It's a sad day in hell when you can't come to a group that's focuses in the game and ask a game related question. What's the fucking point of the group then? Gatdamn. Just can't let people live in peace.", "label": 1}
{"text": "i think you actually relish in being that guy", "label": 1}
{"text": "u don't because you don't see any meaning in anything because you're a loserfuck clown with nothing to live for.", "label": 1}
{"text": "This is the one that I saw but no translations but if u just want reactions then check it out <3\n\n[https://youtu.be/T23IfhBnaeg?si=KtRSwUlSVDTCfSbJ](https://youtu.be/T23IfhBnaeg?si=KtRSwUlSVDTCfSbJ)", "label": 1}
{"text": "I remember when Riot did this last year where you couldn't disenchant emotes/icons from capsules and there was backlash. They fixed it soon later claiming it was a \"bug\". But the fact they did it AGAIN this year and CHOSE not to do anything about it, means they intended this to begin with and for some reason, not much backlash, but I assume it's because reddit mods kept deleting posts about it. I did notice many deleted posts about drops.", "label": 1}
{"text": "Are you thick headed? , let me give you a clearer example to get it through your brain.\n\nIf bin was a soccer player and he said that they’re going to win 6-0 against their toughest opponent in the upcoming match , now do you think that bin was BM’ing or was that just showmanship? , obviously it’s arrogance and cockiness filled by your confidence, but it’s still BM . \n\nYou linked that post as if it supported your statement when it obviously doesn’t, I just told you that bin is prepared for his antics ,so saying respect to T1 is the expected message after he underestimated them , any other message will certainly be considered salty and disrespectful to the opponents.", "label": 1}
{"text": "can a mod remove the fucking spoiler from the title? like wtf", "label": 1}
{"text": "*CCP ftfy", "label": 1}
{"text": "Ppl forget that in their first year together in 2022, they made every finals. No other team in this modern era did that except maybe DWG 2021.", "label": 1}
{"text": "Thats just chinese people for you lol", "label": 1}
{"text": "i mean its not just livestream but maybe counting VOD watchers aswell", "label": 1}
{"text": "Toxicity is a part of every sport. Football the biggest sport has the most toxic fanbases. At the end of the day, it's up to the viewers to discern the difference between being jokingly toxic for banter and genuine malice.", "label": 1}
{"text": "imagine rigging worlds to always make sure a Chinese team gets to finals just to constantly get clapped by Koreans", "label": 1}
{"text": "Isn't this a violation of constitutional rights?", "label": 1}
{"text": "Gone skilled champ LOL good one, retard", "label": 1}
{"text": "GEN vs. FLY was epic! GEN came through big time. This hype reminds me of Crypto All Stars—it’s blowing up just like these Worlds matches. Anyone else keeping an eye on it.", "label": 1}
{"text": "Someone has to tell them that LoL is not controlled by the CCP like their \"elections\"", "label": 1}
{"text": "This isn’t racism. It is hate towards the ccp and everything that surrounds it :)", "label": 1}
{"text": "You are the one who is the racist. You cant stand it when someone bashes your favourite corrupt regime dont you ? ", "label": 1}
{"text": "Keep growing", "label": 1}
{"text": "One bad game shouldn't erase all their hard work and dedication.", "label": 1}
{"text": "He saw an opportunity, took a calculated risk, and executed it flawlessly", "label": 1}
{"text": "TSM 2016 Doublelift, Bjergsen, Svenskeren, Hauntzer, and Biofrost, was considered a powerhouse during the Spring Split and dominated the NA LCS", "label": 1}
{"text": "Aurora's early game power spikes are incredibly strong. Her ability to clear camps quickly and gank effectively makes her a nightmare for opposing jungler", "label": 1}
{"text": "That TP from Knight would have been HUGE. It would have given BLG a significant advantage in the fight, potentially turning the tide completely", "label": 1}
{"text": "One more reason for young people to hate CCP , actually good news.", "label": 1}
{"text": "Creating new animations, especially for walking and attacking, is a time-consuming and resource-intensive process. Riot might be prioritizing other aspects of skin development, such as visual effects and sound design, which are considered more impactful for the overall experience.", "label": 1}
{"text": "2024 Worlds seems to have more frequent drops, offering rewards for various key moments throughout the tournament, including opening day, Swiss weeks, quarterfinals, semifinals, and the finals.\n\nBased on the 2024 information, it's likely that 2023 Worlds had fewer drops, potentially only for specific milestones or events.", "label": 1}
{"text": "Sorcery with Arcane Comet and Gathering Storm likely reflects an aggressive playstyle aiming to dominate early and snowball with poke and burst damage. This might have been a response to BLG's team composition or a strategy to counter their early game.", "label": 1}
{"text": "Yep, was about to say. Still way more interesting than the constant esport posts. Wish esport could get their own subreddit so this one would stop getting spammed with those.", "label": 1}
{"text": "You can use a paid service to bypass captchas automatically, see [https://captchas.io](https://captchas.io) for more information.", "label": 1}
{"text": "First comment is gay", "label": 1}
{"text": "well def you must be unemployed", "label": 1}
{"text": "stop being a shithead", "label": 1}
{"text": "Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because screenshot posts that cannot stand on their own without the screenshot are not allowed.\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "I think I got some extra tokens from PickEms and am currently sitting at 500 as a free to play.", "label": 1}
{"text": "& mods refuse to separate them.", "label": 1}
{"text": "If I had to choose between the two icons, I would go for the Zeri one as it is quite unique - it stands out.", "label": 1}
{"text": "Bruh, iG shut him down by banning the Xayah. He only really could play the Xayah at a world class level.", "label": 1}
{"text": "Is the video deleted for anyone? 😢", "label": 1}
{"text": "Mods, send an ICBM to OP’s house.", "label": 1}
{"text": "The fact that you are getting downvoted for this take tells me how many Chinese diaspora or literal astroturfed wumaos are on this subreddit", "label": 1}
{"text": "In a complaint post last week, a Rioter commented and said they will likely require at least a few patches of data, iteration, and analysis to get a comfortable bounty system. And the specific video that should some unfairness was an edge case they did not account for.\n\nThey’re literally testing right now on the millions of games and getting data to find something that they hope will be good.\n\nAnd yes it turns out that when you discover a rare edge case, you have encountered a scenario that may not be accounted for. That’s not “one player single handedly learning more about a system than the engineers and analysts who designed it with a metric ton of data.” Things cannot be perfect on first run.\n\nLet Riot do their thing for fucks sake.\n\nAs for the other tiny bugs, it’s clearly on their radar but probably not prioritized. A bigger question is how that shit even passed through initial PRs but I digress. In any case that’s not related to game and balance design.", "label": 1}
{"text": "I would like to see some of the less popular assassins being played mid - Zed, Talon, Naafiri, Fizz, Katarina.", "label": 1}
{"text": "Sorry I have violated rule 14 of this sub where video post under 15s are prohibited, but I really want to share this play with you all so I am doing a repost♡", "label": 1}
{"text": "Yo guys don't just down vote me lol", "label": 1}
{"text": "thanks for clarifying that it is a satire i wouldn't have known otherwise!", "label": 1}
{"text": "Mods have a stick up their ass about not using post flairs for no good reason (imo), and it would get removed if it weren't marked satire. This has been discussed many times in their feedback threads but to no avail unfortunately. They'll literally tell you to make a block-list of esports related words if you don't want the front page flooded with post match threads lol.", "label": 1}
{"text": "Insane that you can get away with being a pedo as long as you make good content", "label": 1}
{"text": "We’re getting a perfect rematch of this World’s final next year, aren’t we?", "label": 1}
{"text": "I would recommend Seraphine - good poke in the early game with Q and passive, decent pick potential with E and R, and strong sustain later on with W.", "label": 1}
{"text": "Dude inted a couple of games and decided it must be the dev’s fault. You’re bordering on accusing Riot of mind controlling you to int.", "label": 1}
{"text": "The official LPL propagated those insults? Shame on them, that's extraordinarily unprofessional and disrespectful.", "label": 1}
{"text": "faker my idol", "label": 1}
{"text": "It's a pdfile champ. The second they removed the E passive of being able to fight for your soul (SHE'S LITERALLY ABOUT TESTING YOU) is the second the champ has been doomed to giga cringe status. \n\n\nAnyone locking her in should immediately be put on FBI list and their hard drives seized. \n\n\nI get that fighting for your soul as a ranged champ was disgustingly easy, so target them and have their threshold for fighting for their soul even higher. Or just have it impossible to reward her for catching a ranged champion EXTREMELY out of position as opposed to a melee champ who has no choice but to make landing her E piss easy. ", "label": 1}
{"text": "If you are mod. Post the Discord message then", "label": 1}
{"text": "Can they also lift the NA 0 trophies curse?", "label": 1}
{"text": "Like that matters when buffs are shared now and most items have mana.", "label": 1}
{"text": "Yes, in his career, but not in the sport's career. I'm saying esports can't really be compared to traditional sports, because for someone to have the same outsized presence in the sport, they would need to have played at the top level for like 60 years in any other sport. League is relatively young, so faker's presence will be outsized for a decade or more to come. If football has started the year before Brady or LeBron or any other superstar started, it would look similarly lopsided I think.", "label": 1}
{"text": "哈哈哈哈笑死我了，wc", "label": 1}
{"text": "I guess it’s common practice…Chinese culture is kind of fucking insane", "label": 1}
{"text": "Dude cares about football, and Tom Brady and wants to come shit talk? Bahaha, get a life. Also, the reason faker is going to be better than Brady forever is faker got his wins clean.", "label": 1}
{"text": "Someone that regularly posts on r/leagueoflegends telling someone to get a life because they watch sports. LMAO I dont give a shit about faker or tom brady, i only saw this post because it showed up on the front page. I don't even play this game, you're playing it in your 30s", "label": 1}
{"text": "I think it’s hilarious that you want performance based lp gains when your performances are shit. Your winrate is shit, you stats are shit, your profile is shit. There is literally no metric in the world that wouldn’t have you getting negative lp. I’m glad the system works, because it keeps people like you in the bottom where you belong. And the fact that you STILL, STILL think you can defend these stats is just mind boggling. Just listening to you explain things about the game is painful. You have no idea what you’re doing. The only good thing about your profile is your name. You should.", "label": 1}
{"text": "Not to be rude, but no one cares. Just follow the appeal process instead of rage posting/karma baiting. Tbh I'd keep you banned just for making this post bitching about it.", "label": 1}
{"text": "the appeal process isnt clear either, i was told to appeal without knowing the reason. when asking another mod i was told to appeal and ask why i was even banned", "label": 1}
{"text": "Complaining about it on reddit certainly isn't going to help. Idk what there is even to complain about, you're better off anyway.", "label": 1}
{"text": "There's an obvious issue with the banning process on the discord, OP point it out, and you come in swinging with full on \"not to be rude...\" but proceeds to be a totally rude guy! + Who cares? If you did care, you shouldn't, and you're better off!\n\nYou're a great help, asshole. Jesus.", "label": 1}
{"text": "With all due respect, it's not \"an obvious issue\". We have very little information and almost no context. Asking a bunch of random strangers on the internet about something that happened on a completely different app/site is just not going to help op at all. No one here is going to be able to help them, or care very much. \n\nNo, the irony of \"not to be rude\" is not lost on me. It essentially meant for op not to take anything personally; I made no personal attacks. \n\nWas it alittle gruff? Sure. I could've just ignored the post and moved on. But you could've also ignored my response and provided any help to op but you decided to be rude to me just because I was rude instead. Very high horse of you.", "label": 1}
{"text": ">the most hilarious thing in this thread is that people think league is harder than major sports\n\nis kind of a strange thing to say when you're talking about something you have no knowledge of, no? I think football is an incredibly difficult sport, but I don't get the point of making blanket statements about things you're ignorant about lmao. just scroll past the post if you don't give a shit about it", "label": 1}
{"text": "\\> Asking a bunch of random strangers on the internet about something that happened on a completely different app/site is just not going to help op at all. No one here is going to be able to help them, or care very much.\n\nsilly billy", "label": 1}
{"text": "Must've taken a lot of time. Congrats!", "label": 1}
{"text": "Yikes. Haven't seen shit like this since grade 3", "label": 1}
{"text": "nice", "label": 1}
{"text": "难说，今年的LPL让很多粉丝彻底失望了，很多LOL粉丝甚至卸载游戏了。虽然明年是成都举办决赛。  \nfaker是一个伟大的选手，但LPL的官方很糟糕，在22年营销时以伤害faker的方式获取流量。吸引了很多民粹粉丝。现在那些民粹粉丝破防了。而中国T1的粉丝也对LPL很失望。  \nLPL的队伍太多了，有17只队伍。现在经济下行的情况下，LPL确实会有很多队伍会降低薪水。", "label": 1}
{"text": "that's false, lmao\n\nthe thing is if u focus on drakes u also snowballing botlane which is much more valuable win condition\n\nthen at like 22 minute mark u are in position where u have free nash or free soul\n\nsplitpusher can take like t2 on opposite side but that's all he can usually do\n\nand if ur toplaner inted and feeded he will take these turrets even without grubs so it change shit", "label": 1}
{"text": "It depends on what your goal is in playing the game. Don't play ranked religiously if you only want to enjoy the game.", "label": 1}
{"text": "Bisexualism is a LIE!", "label": 1}
{"text": "Uhh, the former wife has come out as trans and the happy couple stayed together. How wholesome", "label": 1}
{"text": "The game is balanced to be as snowball as possible, to make shitty players worth significantly more than good players, so it is substantially harder to solo carry games and climb. That's it, nothing interesting about it. Riot has dialed in long term user engagement.", "label": 1}
{"text": "Sit", "label": 1}
{"text": "There is zero ups for mandated military service against your will", "label": 1}
{"text": "Nope, comparing a normal job you apply for to mandated miniseries is an asinine comparison", "label": 1}
{"text": "Literally anything corki says", "label": 1}
{"text": "if there is a voice chat im gonna say the n word.", "label": 1}
{"text": "You aren't approaching this the right way.\n\nThe mere chance that even one incident of a mean word being uttered on a voice chat is simply too dangerous.\n\nNow you understand how the woke mind virus works.", "label": 1}
{"text": "And?\n\nIt's now a useful descriptor.\n\nBut you know what's also been atound  much much MUCH longer? Nerds being mean on internet in anonymous circumstance.\n\nWe're all still standing. We didn't melt like snowflakes.", "label": 1}
{"text": "No it's not my argument you idiot.\n\nYou're ignoring literally all analysis of the teams I made because you can't argue against it.\n\nAlso no argument for T1 loosing to Nongshim which is FAR WORSE than MDK.\n\nNor argument for T1 loosing to a team with no macro whilst G2 beat them.\n\nYour argument is G2 loosing to MDK and then winning everything. T1 didn't do that. Just loosing and loosing and winning by 1 game vs KT lmao.\n\nG2 won vs teams playing bad or OK. T1 lost to teams playing bad.\n\nYour objective statements are of no substance. You haven't provided a single point or strength in favor of T1 vs G2 which I have. Several even.\n\nYou're making statements about results and then doing 0 analysis over them to say T1 > G2. And worse of all you're so fucking stupid you're saying I'm making results based analysis.\n\nThe delusion is actually insane", "label": 1}
{"text": "Sorry but I cannot agree with you. A foreign invader attacking your home, literally sexually assaulting your women. Bombing your children and you're against conscription?\n\nAlso maybe research how Ukraine's conscription works before you state lies. \"Send young people to their deaths against their will\" how old do you think these people are? 16 yr olds like ww2? No. The priority for mobilization was people who'd completed military training prior to 2016. Meaning at youngest 25. A lot of the people fighting in Ukraine at the start of the invasion were the older population. Outside of volunteers ofc. \n\nWithout conscription the allies would have lost both the first and second world war. Your take here is perfect for peacetime. Doesn't quite make a lick of sense during an invasion of your homeland.", "label": 1}
{"text": "You literally described prison", "label": 1}
{"text": "From your replies it seems to fail to address the racism/insults hurled at korean players. You've got some serious victim syndrome. Yes people are saying \"5 chinese can't win\" - ok but worse have been said. That's pretty tame compared to lpl CASTER (not randoms online but people literally employed by RIOT) mocking faker for having no mother? What about all the patriotism meme on Scout and Tarzan last worlds? Patriotism and nationalism is a good thing but when it comes to a point where you just start ignoring all other facts that becomes a problem.", "label": 1}
{"text": "I want to see fun champs like akali yasuo riven and not the same bullshit every single game", "label": 1}
{"text": "This is not really a criminal offence it is a matter of civil liability. Does that breach a rule?", "label": 1}
{"text": "That's bow \"based\".  Keep up.", "label": 1}
{"text": "It was posted about, but mods removed it because it's not considered a gamebreaking bug (that you crash your own game on command for playing normally).", "label": 1}
{"text": "wow those are some nice changes to WW actually.", "label": 1}
{"text": "Not gonna lie, this is a weird post. Tons of games are decided by adc diff. The role has the most impact late game and if you don't die early you're denying the ennemy a great source of income (because MANY adcs just give so many deaths on repeat). As for role choice, only you can know. Yes ADC is worth playing, its the 2nd most popular role. By what you're typing maybe you're just better at jungle and don't know how to snowball/keep your lead as adc. So if your sole goal is to win, then yeah, play whatever you win the most on.", "label": 1}
{"text": "no one cares about pronouns", "label": 1}
{"text": "My account was botted to level 30 like 3 years ago... I'm scared to open a ticket", "label": 1}
{"text": "confirmation bias is real. mithy was trash at c9, one almost good result and na fans lose their mind like he's the second coming of kkoma", "label": 1}
{"text": "its so reasonable to have a sexist male only draft in the age of \"\"\"equality\"\"\". what a fucking joke", "label": 1}
{"text": "cashapp me 5 euros for the super secret strat", "label": 1}
{"text": "or stop being an addict and go outside. Talk to your family", "label": 1}
{"text": "why did mods delet this?", "label": 1}
{"text": "I don't understand a single point of what you are trying to make with that sentence", "label": 1}
{"text": "After getting fisted in uni by geology I agree, fuck rocks", "label": 1}
{"text": "Deft discussed likelihood of military service during League of Legends stream; fans express concern.", "label": 1}
{"text": "Hi /u/MurphyRonnie. Thank you for participating in /r/leagueoflegends! However (please read this in entirety),\n\nYour post has been removed because \n*posts about the status of servers, issues related to the servers, and network issues require: the server, the country or region, and a description of the issue. Please check [Riot's status page](https://status.riotgames.com) for more information.*\n\n\nIf you are not familiar with the subreddit rules, you can read them [here](/r/leagueoflegends/w/subredditrules).\n\n\n\n\n---\n^Note: ^(Front page removals are never done by a single mod.) ^(Have a question or think your post doesn't break the rules?) **[^(Message our modmail and please don't comment reply or direct message)](https://reddit.com/message/compose?to=%2Fr%2Fleagueoflegends)**^.", "label": 1}
{"text": "Why remove the post, the server status page isn't even updated.", "label": 1}
{"text": "Thanks mod-team. This would be useful if this page, or even their support twitter, was actually updated when an issue arose. But, glad we have a community here that can support and discuss League of Legends with a voting system that allows for the users to choose whether or not a post is relevant or not!", "label": 1}
{"text": "This post being removed is the dumbest thing i have seen.", "label": 1}
{"text": "Something something mods being dumb pricks about something that is actually important information for the community.", "label": 1}
{"text": "sexism BAD", "label": 1}
{"text": "Mods also deleting post about this for no reason thne polictics its fucked in EUW right now", "label": 1}
{"text": "mods deleting post cemeting their reddit mod fedora status, actual losers", "label": 1}
{"text": "Saying that south korea is sexist against men is fucking hilarious LMAO", "label": 1}
{"text": "I tried to reply but Mods took it out. ...", "label": 1}
{"text": "It's because something people who live on the internet don't like to acknowledge is men and women are not equal in every way imaginable, ON AVERAGE a young man is going to be far more physically suited to being a soldier and facing combat than a woman is.  It's an objective fact and the reason countries don't have female conscripts.", "label": 1}
{"text": "physical strength stopped being an absolute requirement the moment guns were invented. if what you said was true there wouldn't be ANY female soldiers but there clearly are so don't give me the bullshit that it's not possible", "label": 1}
{"text": "How is it removed? Or are you saying it's going to be?", "label": 1}
{"text": "no", "label": 1}
{"text": "I give this post 2-3 more mins, they should get this dedicated reddit staff to work on the servers two i guess..", "label": 1}
{"text": "\"working\" as in you can log in and nothing else", "label": 1}
{"text": "It was removed with a mod message about the removal on top of the comments.\n\nLooks like they backtracked", "label": 1}
{"text": "Mabye it was removed and put back.", "label": 1}
{"text": "Found the arse licker ledditor who likes mega conglomerate poo in his mouth 24/7", "label": 1}
{"text": "Ah okay makes sense", "label": 1}
{"text": "T1 players celebrate with joy after an intense game, showcasing their teamwork and camaraderie.", "label": 1}
{"text": "War is not just guns, it isn't a video game.", "label": 1}
{"text": "you'd think if they were supposedly so desperate for conscripts that they wouldn't throw away 50% of possible conscripts.\n\nand as you said war is indeed not just guns but they don't even conscript women for non frontline or combat roles so it's just bullshit.\n\nthe real reason is men are disposable and women are not. i love \"equality\"", "label": 1}
{"text": "Just to clarify, i have had this on my chest for about 48 hrs now, can't stop thinking about it since it happened. so maybe that last little part was my subconscious wanting to get back at him and so i put that little dig there at the end, im sorry mods, i hope that doesnt come under personal attack", "label": 1}
{"text": "I mean, he isn't *wrong* about his comment. That is kinda true, and the military really needs a lot more people in the combat department than not. But yeah, the popation issue is also a huge contributing reason. Truthfully, both your reasons are right.", "label": 1}
{"text": "He's only right in a technical sense and in his own separate argument. The argument here is that equality means both men and women should serve their country.\n\nEven if required combat personnels are higher than non, not all combat roles are the same. There is the infantry and commandos, and then there are the combat supports, which you need a lot of, that dont require intensive physical training.\n\nWomen can serve, and have served for ages, but only when volunteered. But like most history, we protect women and children because they are our future. Women being weaker physically have nothing to do with it.", "label": 1}
{"text": "Okay, I think that makes sense. But here are two things I don't understand.\n\n1. Why are guys who are weaker/ill than girls in good shape being conscripted just because of their sex? Why are we even discriminating against gender in the first place? Wouldn't it make more sense to make everyone be subject to a physical exam and conscript the well-bodied? Disregarding half the entire population as a whole because of average cases and then proceeding to conscript extreme edge cases seems very contradictive to me.\n\n2. Regardless of ability, this is exploitive. I'm not gonna compare whether guys or girls get it harder, but we clearly have one side sacrificing something and one side benefiting. What compensation can we offer to make it more fair? I strongly doubt an agreeable resolution can exist.", "label": 1}
{"text": "There are sexist culture/tradition against men and there are sexist culture/tradition against women. You know both can be true at the same time, right?", "label": 1}
{"text": "its because of the patch", "label": 1}
{"text": "what war? They just sit at the border and look at each other lmao. No war is going on", "label": 1}
{"text": "You can play league on anything that is a step above a potato.", "label": 1}
{"text": "can confirm im spamming soloQ on a 300 euro laptop", "label": 1}
{"text": "I think you'd have a harder time building a PC that COULDN'T run league.", "label": 1}
{"text": "That would be a fun challenge ", "label": 1}
{"text": "Men teach me your ways. I have i5 but i run it on 20 fps low settings", "label": 1}
{"text": "Sure but during teamfights you better have a beefy computer. I upgraded pc several times during my time as a league player and I always noticed immediate improvement of my performance after I upgraded. The game is jsut so much easier when you fps doesn't collapse 100-150 fps but stays somewhat stable.", "label": 1}
{"text": "Which i5? There have been various i5 models for like 15 years.", "label": 1}
{"text": "You don't need a beefy computer. To run over 100fps consistent a ryzen 5600 is going to be just fine along with pretty much any gpu released in the last 10 years.", "label": 1}
{"text": "friend of mine is playing on a  ryzen 5 1600 with Radeon RX 480", "label": 1}
{"text": "Absolutely disgusting server with mentally ill players. Atrocious gameplay in all elo brackets, people yap too much, int games whenever you call out them for bad plays, queues taking forever etc. As a russian I forgot about this server long time ago and am enjoying myself playing on EUW like all normal people who actually want to play competitive league of legends.", "label": 1}
{"text": "Intel(R) Core(TM) i3-N305   1.80 GHz and 8GB of RAM lol", "label": 1}
{"text": "Maybe ram or vram problem, league is not intense  enough to run this bad unless you're playing 4k full graphics.", "label": 1}
{"text": "Here's to the return of the LCK turning the stadiums into libraries again.", "label": 1}
{"text": "psh, why don't you go forward and touch some grass", "label": 1}
{"text": "Yes.", "label": 1}
{"text": "You shut your whore mouth.", "label": 1}
{"text": "will this map exist for 2 months??? this is disgusting", "label": 1}
{"text": "It's impossible to know for sure because the game doesn't provide any statistics about it. I've been playing consistently since 2014 personally, strongly doubt I have less than 10k hours.", "label": 1}
{"text": "Oops sorry I edited post. Didn’t know that", "label": 1}
{"text": "I started playing when maokai was released", "label": 1}
{"text": "I’ve been playing since 2011, so a long time. Back then, o was using a compaq computer on 80 ping and could barely finish a game before my brother got home and took the laptop from me. I loved it though and still do.", "label": 1}
{"text": "I’ve been playing this game for 11 years. Very curious what kind of code it is. Because it might not be useful for long time players", "label": 1}
{"text": "Started around 2015 when i was still young and had a lot of time and energy.. good old times", "label": 1}
{"text": "Started original Aatrox patch back in S3.", "label": 1}
{"text": "Oooh interesting. I thiiiink i have around 350 hours? I dont want to check haha. What kind of code is it?", "label": 1}
{"text": "been playing for around 7 years if im not mistaken its been a good journey", "label": 1}
{"text": "Almost exactly 10 years ago today!", "label": 1}
{"text": "Too many hours. Been playing since release so 2009...same account.", "label": 1}
{"text": "Started during the galio rework so that's like 2017-2018?", "label": 1}
{"text": "2020 started playing", "label": 1}
{"text": "Been playing consistently since 2020", "label": 1}
{"text": "Season 8", "label": 1}
{"text": "Since 2013, somehow, I'm still playing this game.", "label": 1}
{"text": "maybe 200", "label": 1}
{"text": "Late 2018", "label": 1}
{"text": "Started playing back in 2010, with a laptop at starbucks because my boarding school did not allow online gaming.", "label": 1}
{"text": "Been playing right before zed came out... my knee hurts every time someone mentions how long have i been playing this game", "label": 1}
{"text": "Die irl", "label": 1}
{"text": "7000hours would appreciated it", "label": 1}
{"text": "You got me", "label": 1}
{"text": "I started playing in season 5!!", "label": 1}
{"text": "started in 2020 with friends during online school", "label": 1}
{"text": "far too long... I started playing a few days after they gave out the king rammus skin", "label": 1}
{"text": "I started playing when kda dropped", "label": 1}
{"text": "Camera filters are deeply rooted in their DNA as a country", "label": 1}
{"text": "Facts", "label": 1}
{"text": "I love this sub actually. Any post that isn't deepthroating Riot gets downvoted.", "label": 1}
{"text": "are mods sleeping? dont think this is allowed.", "label": 1}
{"text": "Is it not magic damage anymore?", "label": 1}
{"text": "So he doesn’t just do true damage vs the person with the most recent kill, now? Didn’t know that", "label": 1}
{"text": "I suddenly feel really old", "label": 1}
{"text": "the new aram is complete trash, please bring back the old one", "label": 1}
{"text": "damn, I thought we were done with this chode when I hadn't seen a post about him in over a year.", "label": 1}
{"text": "God i hate whem esports doesnt exist all this sub becomes is witch hunting and bitching.", "label": 1}
{"text": "Too much information. Felt like I lost IQ on the first 5 games. After that the map is fine and there are obviously some pros and cons. Overall I felt fine but I hope is not permanent thats all", "label": 1}
{"text": "Cool story, but just because reddit mods do/dont do something doesnt actually mean anything. There are plenty of people who cant watch live games and dont want it spoiled and just because neckbeard mods dont respect that doesnt change the fact. Are you even old enough to know what a DVR is? HIMYM also literally has an entire episode about it + theres a million other examples in media. My dad was like that too with wrestling.", "label": 1}
{"text": "Its zesty af and gay", "label": 1}
{"text": "You equate having an extensive vocabulary to recently discovering a thesaurus? I think that says a lot more about you then it does anyone else.", "label": 1}
{"text": "\"Extensive vocabulary\" lmao", "label": 1}
{"text": "Is that truly all your two little brain cells could conjure up to come back with? Figures.", "label": 1}
{"text": "the scream ghost emote", "label": 1}
{"text": "Yeah good luck in life tf blade mod. I'm sure that \"extensive vocabulary\" will come in handy one day", "label": 1}
{"text": "Luck is for the mentally challenged like you.", "label": 1}
{"text": "it's funny because the Lucian is Crucile, who literally is an au*ist who has been trying to go pro forever.\n\nso the description actually fits although unintended lol. au*istic was meant as an insult, and trying to go pro was meant for Strompest.", "label": 1}
{"text": "Don't forget to dust your fedora", "label": 1}
{"text": "… there’s just no way, LMAO! I can’t even figure out how you managed to outdo his utterly brainless comment. You truly have an extraordinary talent for sheer foolishness!", "label": 1}
{"text": "Ya good luck to u bud", "label": 1}
{"text": "It’s alright, mate; that bruised ego will mend in time. But your IQ, well… I can’t say I’m feeling quite as hopeful about that.", "label": 1}
{"text": "Seethe", "label": 1}
{"text": "My brother in christ, you pack boxes for a living.", "label": 1}
{"text": "Dan the Omnitarded", "label": 1}
{"text": "I wanna cum", "label": 1}
{"text": "No, that's not it. You're just an idiot :)", "label": 1}
