{"text": "I was going to ask about use for laundry, but I googled, and AI said:  \n\n\n\nCitric acid and vinegar are both acids that can be used for cleaning, but they have different uses and properties: \n\nCitric acid\n\nA common ingredient in laundry detergents, citric acid is a mild reducing agent that can help with the following: \n\nSoftening: Citric acid neutralizes the alkalinity of laundry detergent, making clothes softer and bringing the pH closer to skin. \n\nCleaning: Citric acid can help water clean away grease and grime. It can also be used to keep washing machines clean. \n\nBleaching: Citric acid has a bleaching effect, so it's best for white laundry. \n\nVinegar\n\nVinegar can be used to: \n\nBrighten clothes: Vinegar can brighten clothes and remove stains. \n\nEliminate odors: Vinegar can eliminate odors. \n\nAct as a natural fabric softener: Vinegar can act as a natural fabric softener. \n\nLoosen zinc salts and aluminum chloride: Vinegar can loosen zinc salts or aluminum chloride, which prevents dirt from sticking to clothing. \n\nCorrosion\n\nVinegar is more corrosive than citric acid when it comes into contact with metal.", "label": 1}
{"text": "I totally get that! Sometimes it feels like every day is just rush, rush, rush until you're finally home and too wiped to do anything more than grab the nearest food and collapse on the couch. So, for me, quesadillas are a go-to. You just slap some cheese between tortillas, maybe throw in a protein like rotisserie chicken, fold it, and grill it up real quick. It’s simple but has that perfect warm and melty vibe. When I'm feeling a bit more adventurous, I take canned tuna and mix it up with some plain Greek yogurt, a squeeze of lemon, salt and pepper, toss it on some bread or salad greens. It's like a 5-minute thing but feels somewhat gourmet! Oh, and I always keep frozen veggies on hand. They're a superhero in disguise, ready to just jump into the microwave or stir-fry with some soy sauce. \n\nAnd for those super lazy days, cereal isn't just for breakfast. It's my guilty pleasure dinner, especially with some fresh banana slices on top. But yeah, curious to hear what others have got going too 'cause there’s always room for new ideas...", "label": 1}
{"text": "Hi mate, JourneyofaKid this side. My account got blocked for replying to too many comments. Kindly send me a chat to continue to buy Coursera. I will share the screenshots of our previous chat", "label": 1}
{"text": "Some more suggestions:  \n• Talk with them.  \n• Set boundaries.  \n• Help them visualize time.", "label": 1}
{"text": "Amazon. This is the one I bought, but I see it's currently unavailable. I think just about any strobe light will work. \n\n[https://www.amazon.com/gp/product/B00KUC2INU](https://www.amazon.com/gp/product/B00KUC2INU)", "label": 1}
{"text": "I looked it up after reading it but two apps came up: one is by Anastasia, the other by Monkey Taps which one is the one you use by?\n\nI mean for all I know they are BOTH good 🤷🏻‍♀️", "label": 1}
{"text": "As I asked above:\n\nI looked it up after reading it but two apps came up: one is by Anastasia, the other by Monkey Taps which one is the one you use by?\n\nI mean for all I know they are BOTH good 🤷🏻‍♀️", "label": 1}
{"text": "you dont need an \"excuse\" to shave your head. if you want to do it then just do it. nobody can stop you", "label": 1}
{"text": "There is an external context to this messaging. \n\nIt's very similar to the Harris campaign's outreach to Republican women, saying they can vote for abortion rights and not tell their husbands.", "label": 1}
{"text": "You can try explaining this to the pea-brained bigots banning books in U.S. schools (your kid, your hula hoop!), but it’d just roll right off their smooth, smooth brain. Plus, the *ethnic* origins of the word “hula” would send them into a paroxysm of pearl-clutching.", "label": 1}
{"text": "So you must be one of the abusers, huh?", "label": 1}
{"text": "This is mostly about people you choose intentionally to have in your life, or people that have to be in your life. Not random people in a cafe. You can set boundaries on what you’ll tolerate, like if my racist uncle says something edgy I might let it slide and just roll my eyes, but if he says something outright or starts the sentence “you know, your generation…” I‘ll make an excuse and leave.", "label": 1}
{"text": "psa: if you've read this post and thought either a) \"well NO, because that means I literally can't tell a partner not to cheat on me!\" or b) \"umm actually by this definition I could punch someone in the face whenever they breathe because it's my ✨boundary✨\" consider that you might be yet another victim of the literacy crisis", "label": 1}
{"text": "Actual LPT: Don't be afraid to buy brand brushes! Cheaper, off-brands brushes will actually stop rotating when a slight bit of pressure is applied, ruining the actual benefit of an electric toothbrush.\n\nTo test if your's is of a quality brand, turn on your tootbrush and put it on your hand. If the brush stops moving with the slightest bit of pressure, it's best to go out and buy new ones of a different brand.", "label": 1}
{"text": "Real LPT:\n\nAbandon any site involved in election interference, especially on behalf of Donald.\n\nhttps://en.m.wikipedia.org/wiki/Criticism_of_Facebook", "label": 1}
{"text": "These tips are like a guide to surviving a storm where every wave is a memory trying to knock you over but you just gotta keep your surfboard steady!", "label": 1}
{"text": "I wish I could shave my head...but I'm a domesticated bigfoot living in the Appalachians.  I've got enough people coming up to me spouting revoltingly racist garbage *without* having a cue ball for a head.", "label": 1}
{"text": "Do you have a link to the post? I'm intrigued haha", "label": 1}
{"text": "The Middle", "label": 1}
{"text": "\"...your candidate...\"? There is only one candidate whose voters need therapy after an election.", "label": 1}
{"text": "When people realize the worlds not gonna end when the wrong person wins the presidential election, hopefully the internet can return back to normal.", "label": 1}
{"text": "I'm a Canadian who gives zero support to Trump.  It just gets old hearing the endless screaming at clouds from both the Trump and Harris cults.", "label": 1}
{"text": "Decrying posting politics crap here doesn't make them maga.\n\nIt doesn't belong here, no matter what side of the divide it advocates.", "label": 1}
{"text": "I don't think you know what it means to force an opinion. Legally requiring bibles in classrooms is forcing an opinion. Putting women in prison for miscarrying is forcing an opinion. Arresting women for leaving their backwards, shithole states to obtain sufficient medical care is forcing an opinion. You'll notice that all of these actually utilize force. Telling your friend that their chosen party is bigoted is not forcing an opinion.", "label": 1}
{"text": "You’re delusional. No American flags are burned at Harris rallies. The democrats see their side as the more patriotic one now given that:\n1. Donald Trump has no respect for democracy, and tried to overturn the election with his false slates and riot \n2. Republicans have no respect for American institutions, and want to tear it all down", "label": 1}
{"text": "Eh, you just spell it out the first time you use it and put the acronym in parentheses after it.  The rest of the report or whatever it is just use the acronym.  That's pretty standard across industries.\n\nWriting out a long several word name instead of using an acronym is really dumb, distracting, and extremely annoying to the reader.", "label": 1}
{"text": "Hey there,\n\nThis sounds like a tough situation, and it’s good that you’re reflecting on your experiences and seeking insight. It seems like you’re dealing with some deep stress around interpersonal dynamics at work, so let’s break things down.\n\n1. It’s Unlikely They Envy You\n\n\t•\tIt’s pretty rare that managers or colleagues envy someone new within a week. If you feel that’s the case, it could reflect how you’re perceiving others’ behavior—maybe you’re interpreting their actions as hostile or jealous when they might just be busy, critical, or distant.\n\t•\tIf envy does occur, it’s more likely to build over time, not right away.\n\n2. Talking About Sensitive Topics\n\n\t•\tThis could be a real factor. Some work environments are less tolerant of personal conversations (e.g., politics, religion, or personal opinions) than others.\n\t•\tIf you’re unintentionally bringing up sensitive topics, it might make colleagues uncomfortable and lead to awkwardness or friction, even if you don’t mean any harm.\n\nSolution: Try keeping conversations light and professional in the early days until you get a sense of the workplace culture.\n\n3. Fear of Authority (They’re the Boss)\n\n\t•\tIt’s natural to feel pressure around authority figures. Fear of being judged or fired can exacerbate stress if you’re already anxious about performing well.\n\t•\tIf this fear overwhelms you, it might push you to quit to avoid the perceived threat of conflict or failure.\n\nSolution: Try to reframe your view of managers as people who want you to succeed (most of the time). They’re not always looking for reasons to fire you—they’re just trying to manage a team.\n\n4. Arguments and Disagreements\n\n\t•\tDisagreements early on are likely contributing to your stress. If you’re feeling friction right away, it might be helpful to ask: Are you accidentally coming across as confrontational? Or do you feel the need to defend yourself too much when you receive feedback?\n\t•\tStarting a new job is all about learning the team dynamics, even if you don’t agree with everything right away.\n\nSolution: Instead of engaging in arguments, try active listening—acknowledge the other person’s perspective and give yourself time to process before responding.\n\n5. They Think You’re Bad at Your Job\n\n\t•\tIt’s normal to feel insecure about being new, and this could lead to impostor syndrome—you might assume others think you’re bad at the job even if that’s not the case.\n\t•\tIn the first week, no one expects perfection. If you’re feeling judged or criticized early on, that could just be your own self-doubt projecting onto others.\n\nSolution: Focus on learning and ask for feedback early. Most managers appreciate people who are willing to grow, even if they make mistakes.\n\nFinal Thoughts and Advice\n\nIt sounds like the core issue might not be any one of these five reasons, but rather how stress triggers you in social or professional settings. You might be reacting to these situations out of fear (of rejection, conflict, or failure), which makes you feel overwhelmed and want to quit.\n\nConsider trying the following:\n\n\t1.\tShift your expectations: No job will be perfect in the first week. Expect some awkwardness, and don’t put pressure on yourself to immediately succeed or fit in.\n\t2.\tSeek support for anxiety or stress management: If quitting so quickly is becoming a pattern, it might help to talk to a therapist or explore stress-reducing strategies.\n\t3.\tPractice self-compassion: Starting a new job is tough, and it’s okay to struggle. You’re not failing—you’re learning.\n\nUltimately, you can grow through this, and each new job is a chance to try again. Take it easy on yourself, and remember: Nobody gets it perfect in the first week.", "label": 1}
{"text": "Literally doing the thing she's complaining about in the replies, lmao.", "label": 1}
{"text": "As a Canadian, the US election is something I have no control over, including via voting. I have opinions on it (strong ones, even), however considering how much the US election can affect Canada, it's been a big cause of stress.\n\nIt really is one of those things I have no control over, so maybe I should just block out the news until whatever happens... happens.", "label": 1}
{"text": "This used to be common practice among business executives, *de rigeur* for those climbing (or avoiding falling off) the corporate ladder. Viz. The character Don Draper in the series *Mad Men* storing a stack of dress shirts and an electric razor in his desk. (*Image link disallowed*) In his era, the secretary would be bringing him any necessary breath mints, antacids, aspirin, etc. Comb would live in a hip pocket; Zippo lighter in the jacket pocket.\n\nThe motives may have shifted for many workers, but whether man or woman, the way you present yourself in public still makes a difference as to how others think of you and treat you -- and how you think of and treat yourself.\n\nThese days many men, especially men of a certain age, take cleaning up and dressing sharp to be tantamount to oppression: they feel it's something that they're *expected* to do, the demand of a systemic exploitation rather than an open opportunity to express positive (and in some cases neglected) aspects of their character. Once you get past the lame trope of 'necktie as ball and chain', experiencing *a greater range of dressing up and down* can be a joyful and edifying thing -- not to mention the potential social and professional benefits. You can begin to own and integrate the image you project at any given moment.\n\nThis is by no means a claim that one's value depends on looks. It's a claim that one has a billion ways to influence what the world reflects back to oneself; and hygiene and attire are just two categories among many.\n\nNote: one might add a 'stain eraser' pen to the kit for those common mishaps at lunch.", "label": 1}
{"text": "If you ever want to move past associate, you have to learn that appearances matter. Some people don't, and that's fine too.", "label": 1}
{"text": "OP is a fucking tool", "label": 1}
{"text": "Honestly, with all the scams going around, better safe than sorry! Good tip!", "label": 1}
{"text": "As a small business owner (tutoring company), I can post advertising for the company for free once a week, & you would be surprised how many interested clients we get that way. I’m on both private mom groups & a few private city groups.", "label": 1}
{"text": "A vagina smelling like garlic? As an hetero male, I'd say that's a plus - moreso is it tastes like it too!", "label": 1}
{"text": "Or better yet, just decide to not vote for Donald Trump", "label": 1}
{"text": "Yeah if you’re undecided, the least you can do for society is not vote for Trump.", "label": 1}
{"text": "I saved 10$ lol, nice extension", "label": 1}
{"text": "nooo, now my comment won't make sense. i was trying to be reddit witty... hahaha\n\n  \nits all good. good post! i like where it is coming from.", "label": 1}
{"text": "[https://www.snopes.com/fact-check/can-you-hear-me-scam/](https://www.snopes.com/fact-check/can-you-hear-me-scam/)", "label": 1}
{"text": "Like unzipping your pants?", "label": 1}
{"text": "Wonder how relevant this is for instant water heaters. I have an instant hot water heater so there's no tank sitting with sediment.", "label": 1}
{"text": "Its on the play store, can confirm its not a scam", "label": 1}
{"text": "They dont buy giftcards from the public. They are likley burning through VC capital selling these at discount to grow their customer base.", "label": 1}
{"text": "What discount do they give? Here I get 4-5% on average not including my 2% on my card. The big single day sales like the 13% off on Amazon I always load up on.", "label": 1}
{"text": "Wtf are you on about? A battery arcing to a phone screen through a pocket? What kinda batteries are you using with enough voltage to arc? Much less act as a road flare?", "label": 1}
{"text": "Not sure how I got here...I thought we were talking about a battery powered tea light \"candle\" must have missed something or replied to the wrong person.", "label": 1}
{"text": "Yeah wow I actually did fuck that up. If you Google battery powered tea candle lighter you will see what I mean...", "label": 1}
{"text": "People keep posting this \"LPT\" but I've never found this to be true. What are your pipes made of? If it's modern copper or pex then your pipes aren't falling apart and shedding \"sediment\". What are you scared of? Some minerals in your water? My hot water always comes out clear and I'll continue to use it as I please. This is fear mongering.", "label": 1}
{"text": "Here's a tip: voting is like driving. Choose D to go forward and R to go backward.", "label": 1}
{"text": "Just remember, Democrats are supposed to vote on the 5th while Republicans vote on the 6th.  Don't make an amateur move and show up too early.", "label": 1}
{"text": "I remember as a kid, our county in Ohio (maybe it was a state thing), had kid voting. You would fill out a ballot alongside your parents. It was a great experience, made the kids who went to the polling place feel included, and got them some real experience for when they got older.\n\nCan’t believe i have to add this clarification, but the ballots were not the same as the parents and they were not counted in the general election", "label": 1}
{"text": "If it doesn't have a price history, it's a 'special' in that they made the listing (and possibly the product) just for Black Friday. These products are often cheaply made to look like others.  They may not be counterfeit, just a discount line.\n\nReviews can help, but they're lumped together over multiple similar products and can be faked.\n\nFakespot uses AI to analyze them, it's probably better than nothing. [https://www.fakespot.com/](https://www.fakespot.com/)", "label": 1}
{"text": ">  Honestly get a life and stop needlessly downvoting my comments just because you disagree with my post\n\n\n\n\nHonestly get a life and accept the downvotes and the message they are sending. ", "label": 1}
{"text": "If basic Civics and basic finance were mandatory in High School, really feel like we'd be living in a different world.", "label": 1}
{"text": "You shouldn’t be a home owner if you have to watch YouTube to know how to take care of the house ", "label": 1}
{"text": "LPT: much of what is now on Amazon.com is made by Chinese companies. Companies who sell the very same products on AliExpress.com for less.  \n\nThe AE app even has photo search now. Load in the Amazon photo of what you want and see how much cheaper it can be.", "label": 1}
{"text": "So, likely in most cases this is not an issue. Certainly [get your water tested](https://www.epa.gov/sites/default/files/2015-11/documents/2005_09_14_faq_fs_homewatertesting.pdf) if you are worried", "label": 1}
{"text": "Dude is requiring everyone to go to to multiple trade schools and get certified as an electrician, plumber, landscaper, HVAC, cable and internet, carpenter, etc. before owning a house…. Oh wait most things can be learned off a quick YouTube search. Was able to learn how to pour concrete, build a wall, a movie room, fix a faucet, install a ceiling fan. Actually the only things I hired out to contractors I’ve had to fix but was able to due to YouTube.", "label": 1}
{"text": "My elementary school did this for the 1992 election. Only Bush/Clinton was on our \"ballot.\" I remember my mom talking about Ross Perot, but I couldn't vote for him, so I chose Bush cause my grandparents talked about them (we lived with them at the time). \n\nThankfully, I learned I didn't choose wisely then 😂😂", "label": 1}
{"text": "The price notifications are the real secret. Sometimes the best deals on Amazon pop up at random times of the year.", "label": 1}
{"text": "We did it for Clinton, Bush, Perot way back when. Perot won.", "label": 1}
{"text": "Presidential elections don't influence those things as much as you think compared to other outside influences like shortages, war, ect. Just looking at those numbers won't tell you much about why they are what they are.", "label": 1}
{"text": "Consider that it could infringe on your right to a private ballet.  Mommy can't vote Harris if her 16 year old MAGA child is in the booth and will report her treason.", "label": 1}
{"text": "There were 33 races on my ballot and the Republican candidate didn’t bother to respond for about 20 of them. The Democratic candidate only failed to respond twice.\n\nI was probably going to vote 90% Democrat anyway, but it made it really easy to eliminate the candidates who have nothing going for them except the letter R next to their name.", "label": 1}
{"text": "I think it's pretty easy to see when an administration drastically increases the national debt, for example. Also, if you go back before Trump, you'll see the economy was doing quite well under Obama.", "label": 1}
{"text": "Dating advice?", "label": 1}
{"text": "Google \"<name of an institution that sells something> student discount\"\n\nYou can get anything from cheaper tickets to waived fees and deposits for apartments.", "label": 1}
{"text": "Next post from this guy:\n\n\nMy boss is always on my ass about stuff I need to do.  How do I make him stop?\n\n\nIn all seriousness if you expect all communications to go through your boss, YOU need to work on your communication skills. ", "label": 1}
{"text": "Wait, I'll need a plumber to install these?", "label": 1}
{"text": "Yes and no. \n\nLike, I can't do this easily.. my tank is 4.5 feet tall and the ceiling is 6. It's incredibly difficult to pull 4 foot anode rod from the top of it without a complete drain and move and reinstall\n\nAny suggestions?", "label": 1}
{"text": "People have become so degraded. I think of you want some company as do you want someone to accompany you to wherever you are going. Company used to be just another term for hospitality too. ", "label": 1}
{"text": "Thanks gonna vote for Trump", "label": 1}
{"text": "Nice that it's not necessary in Oregon. Vote-by-mail for everyone since 2000, return envelopes are postage paid, and there are tons of ballot dropboxes (watch out for MAGA arsonists, though).", "label": 1}
{"text": "The ones that turn existing valves aren't recommended?", "label": 1}
{"text": "[https://www.youtube.com/watch?v=t6OBk9YBLQU](https://www.youtube.com/watch?v=t6OBk9YBLQU)", "label": 1}
{"text": "__The only way to win is not to play.__ That is:\n\n- Do not fill in the \"expected salary\" in the online application. \n   - If it's mandatory, answer \"to be discussed later in the process.\"\n   - If you can only put a number, put 0, -1, or 1.\n- Do not provide your salary range until you get an actual, written offer with a number. Refrain from answering: \n   - \"This depends on the position, the expectations, and the culture, so I don't have enough information yet. I'll need to have first a few more interviews to get a better understanding.\"\n   - This is the equivalent of: \"salary depends on experience.\" If employers can do it, you can do it, too.\n- When asked during the interviews, turn the question around: \n   - \"Since you've raised the question, what's your estimated budget range?\"\n- Always defer answering the question \"during the next interview.\"\n- If you're actually asked about your range in the final interview, first ask if this really is the final interview. Then, refuse to answer again: \n   - \"Since this is the final interview, there is no need to provide a range, as there is no time to be saved; we've reached the end of the process. If you believe I could be a good fit, I would be happy to negotiate on an actual offer.\"\n\nThe rationale is simple: as a candidate, you have higher leverage at the end of the process. You have already been vetted, the employer has invested time in you, and many other candidates (not all) have been rejected. On the contrary, if you give your range at the beginning, you're just \"another CV,\" so you have no leverage.\n\nThere is zero benefit in giving a number first. The number you give will be your ceiling; you won't get a higher offer. In negotiations, the first party to give a number loses, as it creates an anchor.\n\nYes, it can be time consuming, as you can potentially reach the end and see that the pay is crap. It is not your fault; the employer could had posted the salary range.", "label": 1}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 1}
{"text": ">LPT: If your son / daughter doesn't like studying, make him / her work in a retail job, the pay is miserable and they are difficult jobs that will make your son / daughter study and strive for higher education to work in better jobs.\n\nWhat is this title? Children. They're children. Just call them children?", "label": 1}
{"text": "Why not just say you make \"a million dollars and a lifetime supply of pizza\"? 🍕", "label": 1}
{"text": "I've had five canvassers come to the door in the last two weeks. Four of them were looking for my 21yo daughter, who just moved out of state. The last was looking for me, for America PAC, and he was a little taken back when I told him that despite being registered R, I'd rather set myself on fire than vote for Trump. \n\nToo late to bother putting up a sign now, but I'll have to keep that in mind.", "label": 1}
{"text": "Damn I wish I read this two days ago for the bottom of my tahini jar.", "label": 1}
{"text": "I cannot imagine thinking yourself so important as thinking anyone wants to meet you when you're soliciting at a house that has asked you not to.\n\nAre the people who \"thank you for being a door to door salesman\" in the room with us now? I'm sorry that your job is shitty and insignificant, and you are crossing time and space to cope, but its not very convincing. You're literally seething and coming up with the dumbest shit lmao. Cope again, brother, you definitely haven't wasted your life.", "label": 1}
{"text": "For once you are. You can murder people if you desire it. You shouldn’t do that of course. But if you accept prison or deathrow…. What is holding you back except your morals?", "label": 1}
{"text": "n.b. A negative tradeoff is often referred to as a \"punishment.\"\n\nSo, there are no anythings if you just don't call it that...", "label": 1}
{"text": "It's a good idea to dispute *any* negative marks on your record.  The burden of proof is on them, make them present the evidence.  Many, many years ago I had a couple legitimate negative marks that got removed because the shady collection agency was so incompetent that they had proof of the original debt.", "label": 1}
{"text": "Federal Trade Commission\n\n[https://www.insideprivacy.com/advertising-marketing/ftc-issues-final-click-to-cancel-rule/](https://www.insideprivacy.com/advertising-marketing/ftc-issues-final-click-to-cancel-rule/)", "label": 1}
{"text": "[https://www.cxnetwork.com/cx-experience/news/click-to-cancel-final-rule-cx](https://www.cxnetwork.com/cx-experience/news/click-to-cancel-final-rule-cx)\n\n>**Click to cancel around the world**\n\n>While the new FTC rules apply to subscriptions offered to US consumers, other countries are introducing similar rules.\n\n>In the UK, the Digital Markets, Competition and Consumers Act 2024 requires businesses to provide clear information to consumers before entering into a subscription agreement.\n\n>It forces sellers to remind customers that a free or low-cost trial is coming to an end and requires companies to ensure customers can easily end a contract.\n\n>In Australia, a 2024 report published by the Consumer Policy Research Centre (CPRC) found 75 percent of Australians have had a negative experience when trying to cancel a subscription, and 32 percent felt pressured into keeping a subscription they wanted to cancel.\n\n>The Australian government has since said it will “take action” against a range of unfair trading practices, including subscription services that are difficult to cancel, but its rules are not expected to be finalized until the 2025.", "label": 1}
{"text": "How is the history and development of credit scores unethical? It's just an unbiased way of measuring how likely you are to repay your debt based on your lending history. It's a lot better than what the alternatve was before, when someone from the bank would come to assess your \"character\" (whether you were black, jewish, or lived in the wrong part of town).", "label": 1}
{"text": "Just make sure that whoever you list is someone who can actually help", "label": 1}
{"text": "If one of them pulls a gun, you shoot them\n\nIt's fucking moronic to be passive about assholes that want an excuse to kill you.", "label": 1}
{"text": "No. \n\nBut also factually incorrect; this is not the first time you can bet on presidential or electoral outcomes.", "label": 1}
{"text": "I’ve tried that a few times when I miss the start of something like live events or those marathon streams. The thing is, I don’t like watching stuff super-speedy. You miss out on the details, dude! Besides, the sound gets all chipmunky and weird. It’s like trying to understand someone who talks a mile a minute while juggling chainsaws—fun but risky. Also, most of the fun, for me anyway, is in experiencing the moment as it happens, like sharing the excitement along with everyone else. Even if I’m a little behind, I like just going at the normal pace and catching the atmosphere. And if it’s something I missed and really wanna see, I’m fine just waiting to replay later.", "label": 1}
{"text": "You would never DIE of dehydration if you were to drink only coffee, but it's not even close to optimal hydration. Due to the principles of osmosis and how the Loop of Henlé works coffee, a higher solute content means less efficient absorption of water. Furthermore, due to its higher solute content, especially if it's not just black (let's be honest, most people drink sugary crap) this means that sometimes you will lose water if you've had nothing to drink but coffee in 12+ hours, which is the case if it's the first thing you've drunk in the morning.", "label": 1}
{"text": "Oh no you should not give up. This is a GROUP discussion. Its fun to participate.\n\nYou dont HAVE to of course but it would be really nice *insert more nicely formulated social pressure here* Believe me... just try it it will be FUN once you do it the way I think you should do it.\n\n\n\nMan up and block me or stay quiet.", "label": 1}
{"text": "Where do all of you live that your plates are too cold to eat on?\n\nBecause room temp plates are perfectly fine and do not affect the food or \"presentation\".", "label": 1}
{"text": "real LPT: notify them if you move across ZIP CODES, or if your move changes your COUNTY (but not zip code).\n\nInsurance coverage is based on your primary residence location.  My primary address in Jan 2021 was Denver CO.  In Feb 2021, we bought a place in Colorado Springs CO.  Less than 60 miles.  The plans offered (and who was offering them) in the Springs were entirely different than the plans offered in Denver.  We had to get new insurance coverage.\n\nMoving is a [\"qualifying life event\"](https://www.healthcare.gov/glossary/qualifying-life-event/), any qualifying life event requires looking at your health insurance coverage in the US of A.", "label": 1}
{"text": "I guess I kinda agree, but tbh I usually pack my portable speaker almost last instead of a big sound system or something. Like, moving is already such a hassle without fidgeting with wires and finding outlets, right? Plus,  I'm usually on a mission to get everything boxed up quickly, so I don't want to mess with much.  Then, on the first day at the new place, I just throw on my headphones until I get everything sorted out.  It’s a lot easier for me to set the mood with a good playlist on my phone and just keep going without messing with any tech.  Unpacking goes so much faster this way!", "label": 1}
{"text": "A person needs to step away from social media if an election can put them in a mental health crisis. ", "label": 1}
{"text": "For real . These are some weak minded people with no real issues in their lives.", "label": 1}
{"text": "This. What's going to change overnight once there's a new president? Do mortgage rates drop back down to 3% instantly once the right person is chosen? Is Marijuana federally legalized? Is immigration and abortion issued all fixed? Yeah right.", "label": 1}
{"text": "Ignoring major political changes isn't possible for everyone. Politics determine workers rights, women's rights, minority rights, LGBTQ rights, disability rights, civil rights for everyone, health care, education, infrastructure, small businesses, government assistance, veterans benefits, the list is literally endless. \n\nPeople's lives depend on politics. People are not over reacting. If you are ignoring politics that makes you either very lucky or very stupid. Probably both", "label": 1}
{"text": "Cool. State matters are also on the ballot. Did you just think the presidential election is happening?", "label": 1}
{"text": "My phone isn't the only thing telling me that I have less rights than I did before he got elected. That's reality. You're not paying attention or you don't care. Frankly I couldn't care less which one it is, you're an idiot either way", "label": 1}
{"text": "you're triggered.", "label": 1}
{"text": "Imagine being so ignorant that you think there isn't anything of Trump's ideas you should be afraid of.  He's taken a shit upon the county and the people before, and he will absolutely do it again.  If your rights won't be affected to the point where your mere existence and well-being aren't in danger, consider yourself lucky, because it's a very real possibility that mine, and many like me, WILL be.", "label": 1}
{"text": "I used the suicide hotline about 4 years ago, had my gun loaded and with me at the time… I got someone who sounded, to me, a little disinterested? They kept asking me questions that didn’t mix with the reason I was calling… I wanted them to give me some sort of permission to kill myself, I wanted them to acknowledge the turmoil in me and falter so I could get it done. But they didn’t.. they just kept asking these questions and acknowledging what I was saying and then asking again… eventually I ran out of fuel and just cried and thanked them and hung up. \n\nSold that gun and moved on with my life, instead of my loved ones moving on without me in theirs. I’m so thankful I got that lady that night, she was so grounded, and she didn’t let me guide the conversation. She saved my life.", "label": 1}
{"text": "Lets he honest here - to most voters state matters less.\n\nLook at elections during non presidential years…. Abysmal turnout.", "label": 1}
{"text": "The great thing about a democracy is that if more people's lives got made worse by a Trump presidency, then he won't get voted in.\n\nOn the other hand if more people's lives were made worse by a Biden presidency, then they can freely vote for Trump. No need for anyone to have a mental health crisis, just exercise your democratic free right to vote", "label": 1}
{"text": "Mental health crisis because you don’t like an election result. How soft you all are 🤣", "label": 1}
{"text": "And if you need someone to laugh at you, DM me", "label": 1}
{"text": "We're talking about the most common internal combustion engine cars you attention whoring dipshit. But also, you do know your EV has a regular 12V battery, right?  If you had a mercedes you could do it. [source](https://www.mbofnewton.com/hybrid-ev-research/jump-starting-a-car-using-an-ev/)", "label": 1}
{"text": "Nice guys?", "label": 1}
{"text": "I feel you right now. I've been on and off again, but tonight I'm ready to end it. Mental pain, physical pain. Can't get a good sleep, etc etc. I'm glad you're in a better place! I'm going to hang on just because of your comments. Thank you!", "label": 1}
{"text": "I'm not to that level for sure but definitely experiencing an existential crisis at this time. Like really, wow, I am shell shocked and just can't believe my views are so far off the norm and so many people still love Trump.", "label": 1}
{"text": ">  You are dismissing the absolute fear and worry that so many people are facing.\n\nYes, that is the point. When people are afraid for bad reasons you should not encourage them to be more afraid.", "label": 1}
{"text": "If the election causes you to have suicidal thoughts then perhaps you are too weak for this world. Like what the fuck dude calm the fuck down", "label": 1}
{"text": "The US election is very …polarized. It’ll effect a lot of people’s rights and safety", "label": 1}
{"text": "Did you vote for the party that created drag queen story hour? 🤡\n\nhttps://preview.redd.it/bsdncw03c8zd1.jpeg?width=800&format=pjpg&auto=webp&s=a0d550696e2a565d36b8faa5d7b507862e8e8383", "label": 1}
{"text": "The right way to do this is to use your own domain name (so the address stays the same even if you switch to a different webmail service) and to download and back up your e-mails (so you can't lose the data if your webmail service goes down). CCing lots of different addresses is silly.", "label": 1}
{"text": "If you have a mental health breakdown because of an election you have very serious  issues.", "label": 1}
{"text": "REEEEEEE", "label": 1}
{"text": "Minimal effect in Red States.\n\nI've called before in Florida and the result was being told \"God loves you.\" until I hung up and was helped by a friend.\n\nTemper your expectations in republican shitholes and take active actions to be safe.", "label": 1}
{"text": "Oh yeah, because everyone needs a personal data backup plan worthy of a CIA operative. You know, just in case Google decides to hold your emails hostage or some rogue nation-state hacks into Yahoo for the 18th time. Who are these people that have multiple email accounts just to make sure they can always get to that really important email from Aunt Susan about her new cat?  Imagine having this much time on your hands to manage emails from three different providers like it's some secret code.  Here’s a pro tip: if you’re that worried, just print out the really important stuff and tape it to your fridge. No one’s hacking that, unless your cat learns how to. Why complicate things more than they need to be? People are out here trying to solve non-existent problems. Or maybe everyone’s just a spy in disguise and I missed the memo.", "label": 1}
{"text": "Line will be busy tho cuz of the libs crying about kmala", "label": 1}
{"text": "least unhinged republican voter.", "label": 1}
{"text": "That's the sum up of the Republican party right there lol Voting solely to make other people mad with no thought to what might happen after as long as they get to piss people off.", "label": 1}
{"text": "I don't think Republicans are, but Trump supporters certainly are. If you were behind Romney? That's cool I could see it. McCain? I could see it. Bush? Ehh I don't really see it but whatever. Trump? No. The dude is vile. He is irredeemable and anyone who truly thinks he should be running the country is a dunce.", "label": 1}
{"text": "Seems at least one votes Republican.", "label": 1}
{"text": "Soon you will cry about how Trump's policies have harmed you. And they will. Because Trump is garbage and has no idea what he's doing but his handlers are and they have planned their fascist takeover for decades. You will not be spared.", "label": 1}
{"text": "lol what, are people really that sensitive these days", "label": 1}
{"text": "Others promised to just leave. That’ll help too.", "label": 1}
{"text": "No. If everyone thinks like this we are basically subjecting ourselves to whatever atrocities may arise from Trump's presidency. \nYou need to think about it. You need to feel burdened by it and devise plans to preserve the fragile torch of democracy in these trying times, not bury your head in the sand and say 'I can't do anything about it'.", "label": 1}
{"text": "**HAHAHAHHAHAAH BYEE BYEEE DEMSSS**", "label": 1}
{"text": "Tell this to the women who are already dying because of state abortion bans, and realize that we now have a republican president, senate, supreme court, and probably house, that want to make that ban national.", "label": 1}
{"text": "Each person has unique talents that, if cultivated properly, can lead to personal happiness and worldly success, and help people leave their mark on future generations. \n\nIf you really want to find personal fulfillment and make an impact on others, you must detach from societal influences and mind-numbing habits like staying glued to your phone and worrying about what others think of you. \n\nOnce you are able to quiet the external voices that dictate how you should live, you can listen to your own instincts, which are always your best guide", "label": 1}
{"text": "**TL:DR;** *Each person has unique talents that, if cultivated properly, can lead to personal happiness and worldly success, and help people leave their mark on future generations. If you really want to find personal fulfillment and make an impact on others, you must detach from societal influences and mind-numbing habits like staying glued to your phone and worrying about what others think of you. Once you are able to quiet the external voices that dictate how you should live, you can listen to your own instincts, which are always your best guide*", "label": 1}
{"text": "You can place a lot of blame on major sub mods who create echo chambers by banning wrongthink.\n\nWhen reality overrides Reddit, some people can't handle the shock.", "label": 1}
{"text": "Yes, many people will. Go live in any expat communities internationally and you'll notice a high commonality among us of our exit years lining up with big elections. Americans and Brits especially. I left after the 2016 USA election.", "label": 1}
{"text": "Aha the downvotes when speaking the truth...\n\n Tired of everyone having an opinion but not talking or listening to those affected by the situation. \nProject 2025 is an attack on LGBTQ+ rights and is genuinely terrifying.", "label": 1}
{"text": "I do this with the weather channel too if I need background noise", "label": 1}
{"text": "Honestly, I don’t see the point. As a queer person, my nation just told me they don’t value my life. I figure it’s just a matter of time before they end me.", "label": 1}
{"text": "Thinning the herd.  Eliminates the weak-minded.", "label": 1}
{"text": "Will Trump supports abortion too, but we can all see how that's going...\n\nMore important to see will be how much the Supreme Court supports gay marriage and interracial marriage.", "label": 1}
{"text": "Honestly, what happened when the cheeto got elected the first time around? Nothin really.\n\nI mean, if we exclude the Jan 6th thing anyway. Point being, on a normal day to day basis, nothing really changes.\n\nWhen Bush, Obama, Trump, Biden got elected, it was all kinda the same in the end.\n\nYou're in too deep.\n\nGet off the 24/7 news cycle, whether that be whatever flavor of news network or internet shit and relax.", "label": 1}
{"text": "🧩", "label": 1}
{"text": "He won, get over it.", "label": 1}
{"text": "you mean how RBG said she didn't like the ruling because the right would be able to overturn it, which is exactly what they did. roe v wade would have never been overturned, except trump nominated the judges that pushed the overturning. the right wanted the abortion ban.\n\nI know you'll try to somehow try to deny this based on your other comments. You aren't here to listen to reason or facts, only to argue for Trump. So I'll just ignore you going forward.", "label": 1}
{"text": "nah, youre just another weeb", "label": 1}
{"text": "🤣🤣🤣🤣\nGet the fuck outta here", "label": 1}
{"text": "Op voted for trump. And very recently left a long ass ramble regurgitating nonsense talking points about Harris. Take from that what you will. I will not be responding ✌️", "label": 1}
{"text": "Also very important:\n\nIf you ever suspect that a child has been abused, DO NOT ASK LEADING OR SPECIFIC QUESTIONS. You will spoil them as a witness.\n\nNever ask specifics, \"Did X touch you on your Y?\" Just keep them comfortable, and keep asking open questions. They have to volunteer all the information.\n\n\"Tell me more...? Then what happened...?\" is your mantra.", "label": 1}
{"text": "> Op voted for trump.\n\nJust like most Americans, it is how it is. The message is still no wrong.", "label": 1}
{"text": "After the election, I disagree. It's not okay.", "label": 1}
{"text": "Allowing ignorance to reign unchecked is why a racist misogynistic convicted felon bent on fascism was just elected to the presidency of the United States… This was achieved largely by people who were deliberately misinformed by bad actors hiding behind “we can agree to disagree”. Affirming the universal right to be willfully ignorant without consequences turn a mild sickness into stage IV democracy cancer. Had we forcefully (not politely) pushed back against propaganda, disinformation campaigns & outright lies…then perhaps we might have been spared even the *first* trump presidency.\n\nAllowing ignorance to grow unabated because of a lack of correction had always turned out bad in every society.", "label": 1}
{"text": "There's a difference between being an actual racist and believing racial injustice.  Just because someone believes that racial inequalities are overstated doesn't make them racist.  And if you believe I'm racist for not agreeing then I don't believe you understand the Democrats downfall this election.  Putting Asains, Latinos and Blacks under the \"People of Colour\" term is exactly why the Democrats lost.  Specifically with the Asian and Latino cultures.  But a White male disagreeing you that opinion is all of a sudden racist.  Despite that deep view in the Democratic party and the constant \"Fuck White Men\" rhetoric all last night from the liberal groups Harris actually did better with white males than Biden did(polling sources at the bottom).  And the where does this all come from?  Your exact post and failure to understand the dynamics of the democratic base.\n\nhttps://www.nbcwashington.com/decision-2024/2024-voter-turnout-election-demographics-trump-harris/3762138/", "label": 1}
