{"text": "I have to give apple credit, that's actually a good idea. Now we just have to wait for Android to implement this", "label": 0}
{"text": "#Westcoast problems.\n\nMan, I love the Midwest. Y'all are never getting a drop of the Mississippi.", "label": 0}
{"text": "And therein lies my problem.", "label": 0}
{"text": "And the best part, you don't hand more money to Jeff Bezos", "label": 0}
{"text": "Seriously, folks, we're at the point where we're talking about saving a single dime? This sounds like one of those tips someone made up just to feel clever. I get that saving money is important, but come on, we're out here stressing about a fee that costs less than a candy bar. It's 10 cents—just pay it and keep it moving. By the time you log into the app, navigate the settings, and figure out how to turn off SMS notifications—assuming you even remember to do it—you could already have saved money doing something that actually has an impact, like making your own lunch instead of hitting up a fast food joint. Plus, if you miss a notification and get a parking ticket because you forgot to pay, that’s going to make your whole \"savings plan\" blow up in your face real fast. Priorities, people!", "label": 0}
{"text": "I like this thought. Life is so complicated now, I understand the desire to want to try to optimize. But seriously, I do that all day for work. I have to do it for my finances. At this point, I'd happily give up the internet to let life get back to just focusing on being happy sometimes. Computers are an incredible tool for efficiency, but life isn't supposed to be perfectly efficient. We're humans, not computers.", "label": 0}
{"text": "Ok let me call china see if I can get it cheaper", "label": 0}
{"text": "Tried upgrading food. Budget didn’t allow me to", "label": 0}
{"text": "This was some replacement headphone earcups, and they shipped it using \"AMZL Logistics\" (which I only found out *after* it had shipped). They even charged me $5 shipping when I have Prime.\n\nBrainwavz listed the earcups for $27.65 (during a sale) on their website and ~$50 on Amazon, so I went with their store, which did not list the courier during the shopping or checkout process. They ended up not fitting and I had to pay return shipping, and was only refunded the product price.", "label": 0}
{"text": "See also: rodents that eat wire casings because it has a soy base.", "label": 0}
{"text": "This was in the US, and in California. Not sure if legal or not, but it was the black wired Kitty headphones. I bought them for my wife, but one of our dogs wrecked one side when it was accidentally left out. I looked online for warranty information and it seemed like we would be covered, but just as we got in contact with their customer service reps, they asked us if we bought it from Amazon. As soon as we said yes, they said they can't help us because it was bought through Amazon and hung up. 🤷‍♂️", "label": 0}
{"text": "Never a bad idea!", "label": 0}
{"text": "Breakfast sandwich: toast an English Muffin while you cook a scrambled egg in the microwave, add a piece of lunchmeat (Canadian bacon works Great for this) & a slice of cheese= Bam! A Sandwich!", "label": 0}
{"text": "I’d sooner hire a lawyer than pay anyone else’s debts I don’t care if there family", "label": 0}
{"text": "Freezer is prevention.", "label": 0}
{"text": "I force myself to do something standing in the bathroom, anything-- shave, brush, wash, whatever keeps me busy at that sink for a couple minutes. Then it's just a matter of how long I can keep that momentum going. Some days I'm great at it, get alot of good things done-- other days I crash right back into the bed.", "label": 0}
{"text": "Tacos. Cook up a seasoned filling, chopped onion and cilantro, put on tortilla. Delicious every time.", "label": 0}
{"text": "I think these things are more about how to handle a personal argument than how to actually deal with a real problem, though\n\nEspecially if it's people you actually *know,* and not just total strangers", "label": 0}
{"text": "Hello /u/bonyjabroni and thank you for your submission! Unfortunately it has been removed for the following reason:\n\n>Posts about  medical, hygiene, and  toiletry related tips are no longer allowed, as they have been placed on our Restricted Topic list, which can be found in the [sidebar](/r/LifeProTips/about/sidebar). \n\nPlease make sure to read through the sidebar before submitting in the future. Thanks for thinking of us, though! Have an excellent day.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "But the torturous part is getting up in the first place!", "label": 0}
{"text": "Cucumbers, rice, sesame seeds, salt, garlic powder, soy sauce. Add protein if you have it made.", "label": 0}
{"text": "I started using citric acid after looking up the ingredients to Glisten dishwasher cleaner. Work great for hard water deposits.", "label": 0}
{"text": "What's worked for me the best is sometimes shutting up and even just pretending to listen will do the both of you better. I get it, maybe your partner is frustrated about something that you have a very clear and concise solution to and they're just not having it. I hate lingering with problems, it's an obstacle in my routine that I want rid of immediately. I hate it when someone has a clearly impactful, impeding issue that they clearly don't have any plans to resolve but continue to complain about the circumstances or given solutions. It only creates more problems for both parties trying to spoon feed them solutions. Sometimes just minding your own business is just the best bet. You get more time to do your own thing. They get their time to do theirs. It's just how it is sometimes. Acceptance is a concept, an action, an open door and a response. Embrace it.", "label": 0}
{"text": "IBS or IBD related most likely. It's difficult for me to eat for the first ~6 hours of the day", "label": 0}
{"text": "I put hot ingredients into the crockpot to kickstart the heating process and cracked it :(", "label": 0}
{"text": "Citric acid is actually great against rust on tools, and you can buffer it with baking soda to prevent it causing more pitting on steel.", "label": 0}
{"text": "OP says the people have been happy to pay the small local businesses. And these megacorporations fuck over people all the time but do we really care that they aren't being paid for a service that isn't even being used since the person is dead?", "label": 0}
{"text": "Doesn't the salt just dissolve?", "label": 0}
{"text": "My boyfriend was drunk and got in an accident where he had to go in an ambulance, they didn’t even have his name (he wouldn’t give it) but they had my number as an emergency contact. They have been sending me the bill ever since. We aren’t married or anything.", "label": 0}
{"text": "\"expresso\"", "label": 0}
{"text": "Hello /u/WikdGtr and thank you for your submission! Unfortunately it has been removed for the following reason:\n\n>Posts about  medical, hygiene, and  toiletry related tips are no longer allowed, as they have been placed on our Restricted Topic list, which can be found in the [sidebar](/r/LifeProTips/about/sidebar). \n\nPlease make sure to read through the sidebar before submitting in the future. Thanks for thinking of us, though! Have an excellent day.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "That sounds like one of those crazy of person things. My grandma used to keep batteries in the fridge. But with a little extra knowledge it makes perfect sense.", "label": 0}
{"text": "Pasta aglio e olio e parmigiano!", "label": 0}
{"text": "That's good to know. Like using coke instead of evaporust.", "label": 0}
{"text": "That's what I'm saying", "label": 0}
{"text": "That's because tax agencies know it's a waste of their time to go after every little penny when people are trying to screw them out of billions.", "label": 0}
{"text": "Have you tried citric acid? Smells better than vinegar", "label": 0}
{"text": "Nope, I moved. Same apartment complex, different building. Ended up needing to upgrade to a bigger apartment for other reasons, and otherwise like the location of my apartment (i've been living close to work so I don't have to drive my car), just unhappy with their inability to process complaints. The new complaint is that owners in the general area never pick up their dog poop, and the only patch of grass around is right in front of my patio. They did tell us if we set up cameras and submitted video evidence, they would gladly take it, but other than that, there's little hope. The plan is to be in a house in less than five years anyways so I've just gotta be patient I guess.", "label": 0}
{"text": "Look up backyard ballistics on YouTube. He does restorations of firearms and has a really good dyi formula for a exponentially cheaper evapo-rust.", "label": 0}
{"text": "lol it was like 20 years ago, even if I somehow fall that far down, I think I'd go do literally anything else before subjecting myself to that again.  Pretty sure comcast has since moved all of their phone support overseas.  We used to service our local area, and canadian call centers would take over from 2am-6am, but any time I've called in the last 10 years or so I've gotten a call center in the phillippines.", "label": 0}
{"text": "I like to make plates with random stuff…so I keep pickles, hard boiled eggs, cheese cubes/sticks, salami, nuts and dried fruit. I often get a Rotisserie Chicken and make chicken salad with it.", "label": 0}
{"text": "We're talking lazy here, right?\n\nHam & Provolone (or Swiss) on seeded Jewish Rye\\* with pepper or dill; maybe w/ Blue Cheese dressing or Tzatziki\n\nPB & Cinnamon on seeded Jewish Rye\\*\n\nSeeded Jewish Rye\\* with smoked fish, maybe a little whipped cream cheese.\n\nGuac\n\nShrimp with sushi ginger.\n\nBlueberries\n\nBread dipped in marinara sauce (even better if the bread is stale and crunchy)\n\n\\* About the seeded Jewish Rye thing: white bread tastes like, well, nothing. Whole grain bread tastes like dirt. Seeded Jewish Rye tastes like something.", "label": 0}
{"text": "Lots of people are okay putting every bit of their information out there.  Insert mom's \"jumping off a bridge\" comment here.  Google is a data company just like meta.  They make billions off of their user's personal info.  I do everything I can to limit that footprint.  Wish the US was more like the Uk with regards to personal privacy.", "label": 0}
{"text": "It seems like the wireless companies have mostly gotten the public to accept a monthly phone payment as being normal, and everybody dies, so there will be a large percentage of people who die with a not fully paid for phone. I'd imagine the companies would still try to collect what they can in many cases.", "label": 0}
{"text": "has anyone ever done any studies on what kind of chemicals are in paper towels? I thought I read something once about the dyes they use to get them white.", "label": 0}
{"text": "Just descaled my kettle using a bunch of citric acid powder! I forgot I had it! Thanks for the reminder, it literally looks good as new now - I live in a very hard water area!", "label": 0}
{"text": "Glad I'm not the only one! Still looking for tips to freshen up my beard!", "label": 0}
{"text": "I always went to a store when I needed to cancel my service (I switched back and forth between them and Hargray a few times). They always took my equipment and canceled my account with zero issues. Not one iota of an attempt at retention. On the phone they'll try *everything* to get you to stay.", "label": 0}
{"text": "This is super helpful! I never thought about using citric acid for cleaning; I’m definitely gonna try it instead of vinegar from now on!", "label": 0}
{"text": "I absolutely read “beard” first and was very confused for a moment.", "label": 0}
{"text": "My eyez! Ze goggles! Zay do nutzing!", "label": 0}
{"text": "Yes. That is exactly what I thought.", "label": 0}
{"text": "Yeah I realized it after looking it up. Been a long-ass time since I took bio in university.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Me too, we get white streaks on literally everything, even clothes.", "label": 0}
{"text": "I'm actually descaling my coffee maker with citric acid while reading this. It takes 100 grams in 2 liters, I was thinking of running the result through the dishwasher for a convenient reuse.\n\nWould that work?", "label": 0}
{"text": "Ah. I see. Good. \n\nAfter my awareness grew enough, I was able to track the outside influences that triggered the autonomic thinking process. It's the autonomic thinking process that I turned off. When I'm writing or taking action, I'm still thinking along the mental route associated with the related set of actions. \n\nIn subjugating the disobedience of the autonomic thinking process, it freed up space in my attention and awareness that wasn't at my digression. Decoupling the autonomic thinking process doesn't disrupt other autonomic brain processes. \n\nBoth can be practiced in tandem.", "label": 0}
{"text": "If the crystals are big enough you get a fair bit of scrubbing done before they dissolve and you only use a tiny bit of water, comparatively speaking. Sugar is similarly used as a scrub in beauty products. ", "label": 0}
{"text": "Thanks! I can't stand the smell of vinegar and the powder is much more convenient.", "label": 0}
{"text": "I really is, I have a gallon bottle of 5% white vinegar that's been sitting under the sink, unopened for years.", "label": 0}
{"text": "Laying in bed right now with incredibly dry hands after cleaning my oven with baking soda and all sorts of detergents. I feel my skin tightening and no matter how much I washed my hands earlier, they would still get soapy, so I gave up after a while and hoped I could wipe the remaining away with the towel (turns out, I couldn't).\n\nGoing to try olive oil as soon as I get out of bed in a few minutes, hopefully, this still works in October 2024", "label": 0}
{"text": "I always have a box of uncrustables in the freezer. I leave 2-3 to thaw in the fridge so that there’s always one ready to eat and extras if I’m REALLY hungry. Steam-in-the-bag veggies make a good side, my fav is broccoli with cheese sauce!", "label": 0}
{"text": "I've gotten fake Anker cables. Same packaging from Ali Express cables. Confirmed with Anker. I've also seen some very convincing fake items that are just made a lot cheaper than the real thing. The packaging is usually very very close.", "label": 0}
{"text": "The trouble with adding stuff just into the dishwasher is that a dishwasher has two cycles: an initial clean and rinse, and a more intensive clean and dry. Ideally you want the acid in the second part of the process so that it prevents scale. It might help though, it certainly can't hurt and it might dissolve some scale inside the dishwasher itself.", "label": 0}
{"text": "Only if you have 5 products that month, and you have no control over the prices going up when your order goes through. I got screwed by a product going up 50% one month that erased three months of savings in one go.", "label": 0}
{"text": "When my brother passed he had CC debt as well. It wasn't a ton of money, but I knew I wasn't responsible to pay it. The douche calling to collect kept trying to get me to say that I was the executor of the estate. Nope. There was no estate. He was a bachelor living alone in an apartment with his cat.  He didn't have assets or a will. This guy was relentless trying many different ways to get me to trip up and saddle me with the bill. I finally just hung up on him. I got a notice 3 years later saying it was finally written off. CC companies suck ass.\n\nEvery other place I had to deal with was very kind and it was a breeze to take care of. Most just asked for a copy of the death certificate. His gym didn't even ask. They just told me how sorry they were and cancelled his membership right then and there. I got his apartment cleaned out before the end of the month so we didn't have to deal with another month's rent.", "label": 0}
{"text": "Target also has a lot of things within a couple cents of Amazon and Walmart, and the Red card gets you 5% off.", "label": 0}
{"text": "Thanks, I'll give it a try and run it through a rince cycle. As long as it doesn't break anything there's no harm in trying", "label": 0}
{"text": "piranha solution is probably more apropos for around the house cleaning", "label": 0}
{"text": "How many times are you cleaning per day?!", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Thank you for getting back to me, I was hoping things were much better for you. I on the other hand cannot afford to move. It's just a shame that there can't be anything done about this. I live in California and there is a law about excessive noise but nobody seems to want to enforce it. If I call the sheriff they say it's up to the property manager, and if I go to the property management and they say oh it's a he said she said you need some sort of documentation. I've been trying to record with my cell phone, but so far not working out too well. I am trying to find something on the market that I can't attach to my ceiling so that it will pick up the noise clearly. The only problem is I have very high ceilings so I would have to have something with a remote control. As of right this minute I have not found such an item to purchase. I have lived here 10 years my upstairs neighbor has lived here one and a half years and has made it absolutely miserable for me all this time. Thank you again for responding to me and thumbs up to you for being able to get a house in 5 years. I'm a senior citizen so there won't be any hope of that but maybe one day a miracle will happen and I can afford to move.", "label": 0}
{"text": "Cite your sources ", "label": 0}
{"text": "Can you use it before drinking?", "label": 0}
{"text": "And where the hell should I find this?", "label": 0}
{"text": "Cool to know but what is Psyllium, how do you get it ? I'm in need of hangover prevention right now", "label": 0}
{"text": "Just pop a vitamin b pill before you drink/sleep", "label": 0}
{"text": "Does it work with fiber (psyllium husk) capsules?", "label": 0}
{"text": "It’s Metamucil", "label": 0}
{"text": "Ohhhhh I see, well, that's great because I still need this whatever I'm hangover or not 😆", "label": 0}
{"text": "Amazon or any local Indian store", "label": 0}
{"text": "Any grocery or pharmacy should have it. Its just Metamucil", "label": 0}
{"text": "It’s a study on mice. That’s not automatically applicable to humans. ", "label": 0}
{"text": "Drinking 24 ounces of water probably has nothing to do with it lol", "label": 0}
{"text": "In my experience psyllium works better after eating/ drinking and from what I've read on IBS forums other found that too. But worth trying.", "label": 0}
{"text": "good luck, it makes people that are not used to fiber gassy...", "label": 0}
{"text": "Metamucil ", "label": 0}
{"text": "Will try but it's surely a different mechanism, so there's room for doing both.", "label": 0}
{"text": "I think this is the source they’re talking about https://www.frontiersin.org/journals/pharmacology/articles/10.3389/fphar.2024.1378653/full", "label": 0}
{"text": "Agree, that's why I clarified. Anecdotally works in humans. Waiting for a follow up in humans. Also if you read the paper it's not just mice, there are experiments on the absorption properties of alcohol in the gel itself.", "label": 0}
{"text": "You'll do everything that helps of course. But try water alone!", "label": 0}
{"text": "If in the US, supermarkets around me all have it in the dietary supplements section.", "label": 0}
{"text": "If you're not used to fiber, maybe Metamucil is exactly the right thing you need.", "label": 0}
{"text": "You'll get constipation if you don't drink enough water with it. It's a fiber supplement.", "label": 0}
{"text": "The point I'm making is that now someone tested this in animals and checks out", "label": 0}
{"text": "Yes, “forms a gel quickly” is a big hint here that it’s something that retains water like chia seeds", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Fosho, that’s step one of avoiding a hangover", "label": 0}
{"text": "Likely placebo from fiber. The real MVP here is the water you’re mixing it with. If you stay properly hydrated while drinking your million of getting a hangover is relatively small. ", "label": 0}
{"text": "and probably why they think it's better lol", "label": 0}
{"text": "lol, really? what next? check the toilet paper for shit before putting your pants back on?", "label": 0}
{"text": "Someone got mice drunk and then asked them about their hangovers?", "label": 0}
{"text": "Why would it be a placebo from fiber? I'm pointing to a study on how it works.", "label": 0}
{"text": "i hope people dont do the latter as much as my wife does the first……", "label": 0}
{"text": "Comes in pills too. Yerba Mate for life!", "label": 0}
{"text": "LPT: don’t drink so much you get hungover.", "label": 0}
{"text": "In community property states, you may be liable for your spouse's debts.", "label": 0}
{"text": "Add cheap items like a can of tomatoes, etc. to get the five+ item discount. Create a new subscription to an item to lock in the price for that month, and either cancel or move the old subscription to another month.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Worse LPT ever. My sister and my cousin do that shit all the time. They caught maybe 3 errors in 10 years. I am not bothering pulling over and verify everything for everyone for such a low error rate.\nMaybe if you are alone and it takes 10 seconds yes, but otherwise hell no", "label": 0}
{"text": "It works inside the intestines, where there is additional absorption of alcohol generally.", "label": 0}
{"text": "how long do they sit there? 10 seconds is enough lol", "label": 0}
{"text": "It varies by state. Sometimes you don't have to ID yourself but you would be taking a gamble by deciding not to comply and leave the scene. Always ask if you are being detained or if you are free to leave.", "label": 0}
{"text": "Still slowing the Chic fil a line down", "label": 0}
{"text": "\"asked me what I was doing. I told him \" ... \"i am respectfully remaining silent.\" (fixed it for you)", "label": 0}
{"text": "LPT don’t ever chat up a cop.", "label": 0}
{"text": "Yes, they used measures of inflammation and behavior the day after.", "label": 0}
{"text": "Yeah but absorbing in gel doesn’t equal absorbing in the body. I am pretty sure that it has way more to do with all the water you drink. ", "label": 0}
{"text": "I was thinking maybe the facility billers know about the death, but I know the provider billers don’t usually know. My nursing home doctor definitely doesn’t tell me and probably doesn’t even notice when he stops seeing a patient but I assume the nursing home he visits knows the patient died.", "label": 0}
{"text": "They F you at the drive through", "label": 0}
{"text": "The degree to which physics applies everywhere could surprise you", "label": 0}
{"text": "Ok, ok, ok.", "label": 0}
{"text": "For real, but not just that. OP literally got off their bike, at night, 100 feet away from the cop, and just... stood there and stared at the cop for 5 whole minutes? Like yeah no shit he came up to you, that's suspicious as hell. OP was fishing for confrontation and is now acting surprised when he got it.", "label": 0}
{"text": "Y’all have money for bills?", "label": 0}
{"text": "Always check my order. It’s been messed up many times", "label": 0}
{"text": "And I want to add, don’t pay a late fee either. Call them up and they will waive it.", "label": 0}
{"text": "I never carry ID unless I'm driving.", "label": 0}
{"text": "My mom passed and had a new car she bought a month prior. I drove it to the dealership walked in and handed the manager the key. His jaw dropped as I told him she died and turned around and walked out. Know I should’ve taken it to the bank that financed but I had a little fun with it cuz who cares. She had no estate to even take it from.", "label": 0}
{"text": "I take Dr pHour salts to stay hydrated. I take small amounts about 30 minutes before drinking, during and after drinking. During and after drinking, I have a lot more water with it. Never had a hangover since I started using it.", "label": 0}
{"text": "Is citric acid a disinfectant though? Vinegar is.", "label": 0}
{"text": "It's a double whammy and why I said under 100k.\n\nSalt is certainly a big factor too though. You find tons of \"newer\" cars in the north that are rusted through, but go to somewhere like Colorado where salt isn't used and you'll find 40 year old cars with minimal rust.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Found the fascist", "label": 0}
{"text": "DON'T ALWAYS ask if you're detained or free to go. If a police officer pulled you over, *you are detained.* If a police officer said you broke the law and wants your ID, *you are detained.* If you are under arrest, *you are detained.*\n\n\n\n\n\n\nIn this case, OP should look up their city + state laws to see if they were, in fact, breaking the law. If OP was **not** breaking the law, they should ask for paperwork on why they were stopped and if they refuse, they can initiate a FOIA request. ", "label": 0}
{"text": "Many people don't know you have to tell them you are intentionally remaining silent. If you are asked a question and do not answer, that *could be* considered an admission of guilt. ", "label": 0}
{"text": "Great! This is a different mechanism so they might complement each other.", "label": 0}
{"text": "You should have told him you were voting.", "label": 0}
{"text": "I just take my pants off and put the boots under the pants. So ppl see they go together.", "label": 0}
{"text": "Oh heck no. That's half the fun of going to BK. You never know what you will get.", "label": 0}
{"text": "Personally I find the staff get upset when I walk around pants-less.  But you're right, it would work!", "label": 0}
{"text": "Used muriatic acid and were terrified of burning yourself pretty bad eh?", "label": 0}
{"text": "But then you have to walk around with a pair of socks in your pocket (or leave them in the boots and then get annoyed stepping on them)", "label": 0}
{"text": "\"I picked the wrong day to go commando.\"", "label": 0}
{"text": "Jesus that's awful... We were at least able to get the line cancelled. But they want money for the phone (and won't take it back - how does that make sense?) and the months they charged us for after she passed. \n\nI'm sorry you're dealing with this.", "label": 0}
{"text": "No. I wouldn't use that outside of a fume hood. I was making a joke that people assume all acids clean well.", "label": 0}
{"text": "Piranha solution is for plebs, aqua regia is literally the water of kings.", "label": 0}
{"text": "This tip dumb because now you're barefoot in an environment where everyone is wearing socks", "label": 0}
{"text": "I wash my ass with cold water", "label": 0}
{"text": "How do you fight with medical bills that are under your name but are surprisingly expensive and ridiculous, e.g all those facilities fees, service fees, whatever nonsense fees", "label": 0}
{"text": "They probably wanted the devices back or their price paid. The debt she owed for them was part of the estate, what else could Verizon have done?", "label": 0}
{"text": "Duh. I used that to clean my gear way back in the day before I switched to oxi-clean", "label": 0}
{"text": "Just change the laces or add some bow biters.", "label": 0}
{"text": "not true at all, studies showed that vitamin c and zink can decrease sick days slightly", "label": 0}
{"text": "how many noble metals do you keep in your house\n\ndoxx yourself...", "label": 0}
{"text": "Problem (dis)solved!", "label": 0}
{"text": "You can buy it at the Citric Acid Store in Malta, alternatively you could also take a boat or a plane over to Tunisia and make a quick stop at the Citric Acid Store over there.", "label": 0}
{"text": "I love trying to pay my own bills for them to force me to make it past a captcha. 2FA. A password. And verify my information.  Like ohhh noooo what if someone accidentally paid my electric bill.", "label": 0}
{"text": "A great meal that's not hard to make is a sort of bento bowl. Essentially, it's a bowl of rice (use instant rice for a fast version) with whatever veggies, sides, and/or protein you want on top, then add some sauce. For example, rice, frozen peas (microwave in bag), frozen precooked chicken (also microwave in bag), and teriyaki sauce. Not going to win any awards, but it's quick to make, is super flexible based on what you've got and what you like (especially if you're cooking for others who might have different tastes), and it's a whole lot cheaper than eating out.", "label": 0}
{"text": "It helps a lot, it will get the histamine released for a while and give you a safe way to scratch it, especially if you have something with pretty decent water pressure you can use.", "label": 0}
{"text": "Returning them would have been fine, saying \"OK, there is still $1234 to pay on the devices\" would also have been fine - but \"no, you can't close the account or cancel those lines\" - wtf?! Everywhere else just closed stuff out and sent a refund or final bill as appropriate, but not Verizon: \"dying is against corporate policy, you aren't allowed to do that\".", "label": 0}
{"text": "\"Just run a adblocker\", smug and full of shit at the same time.", "label": 0}
{"text": "It's not just dehydration and drinking water helps but does not cure a hangover.", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 6**: Posts must not concern any of the following:\n\n- Religion\n- Politics\n- Relationships\n- Law & legislation\n- Parenting\n- Driving\n- Medicine or hygiene\n- Mental health\n\nThis list is not exhaustive. Moderators may remove posts considered to deviate from the spirit of the subreddit.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "That's awesome. The best bet in a situation like that (which hopefully you'll never need again) is the file a police report, dispute the charges with the three credit bureaus, and then don't pay shit until it falls off. It's unfortunate that he has passed though, and I'm not sure if that makes a difference tbh", "label": 0}
{"text": "The studies show that the vitamin c and zinc on have an effect if you're deficient. And if you're not deficient then it's no better than placebo", "label": 0}
{"text": "My dad's landlords sent my info to debt collectors after he died. The reason there was outstanding rent payments was his ex refused to cooperate with anyone and wouldn't move out or let anyone else in to move his stuff out. Landlords knew she wasn't on the lease but they somehow didn't know it's illegal to just change the locks on the house to try to kick her out. So it went from just my family vs this bitch to this bitch vs the landlords vs us. The enemy of your enemy is your friend took it's course, and I let her channel her bitchiest bitchiness against these landlords milking as much time in the house as she could without paying for it. Changing the locks on her made it look like the estate was trying to kick her to the curb which we weren't, she still swears we were trying to make her homeless. But it's worth the rumors of that when you get to see landlords get absolutely legally shafted because there's nothing they can do about it. They pissed off a Karen, and lost half a year's rent legally because they couldn't be bothered to do things legally themselves.", "label": 0}
{"text": "Yea that sucks 😭. I definitely wasn't judging y'all! I just hate that", "label": 0}
{"text": "That's fair. However, for most of your life, medical care isn't close to day you die 😭. So in general they should def have to get shit to you promptly", "label": 0}
{"text": "This kills me. You have to fight for yourself but it's so hard sometimes because they don't give you a chance 😭", "label": 0}
{"text": "I literally hate companies lmao", "label": 0}
{"text": "Wishing y'all the best! 😭", "label": 0}
{"text": "Touché.", "label": 0}
{"text": "For sure! I'm glad it worked out for y'all!", "label": 0}
{"text": "People who think they owe their dead loved ones bills, or think they need to pay off card debt in their name that they didn't spend", "label": 0}
{"text": "Or what?", "label": 0}
{"text": "lol, I don’t make the rules, I just drive up the cost of everybody else’s healthcare.  Thanks bro", "label": 0}
{"text": "I understand. Didn't mean to be insensitive, I'm sorry", "label": 0}
{"text": "Charcuterie board ish.\n\nAnd by that I mean: a load of French bread that I tear chunks off of, a couple of cheeses (hunk of gouda or cheddar), crackers straight out of the package, any deli meat/pepperoni straight out of the package. Olives out of a jar, and any fruit I have.\nNo prep, easy variety, less clean up. And yes, I like to live like a heathen. \n\n\nFor something nice: premade tortilla wrap, mozzarella, sun dried tomatoes and pesto. Put the last three on a tortilla, fold in half and toast in a frying pan or panini press until cheese melts. Add chicken for more protein.", "label": 0}
{"text": "Interesting.. it's never happened to me but I guess it depends what you buy and who from etc..", "label": 0}
{"text": "I leave a hacksaw in my car just incase of a roadrage or car jacker", "label": 0}
{"text": "Earlier this year I went to the store to see what could be done because my bill kept edging higher and I didn’t want to pay that much. They canceled my service then signed me up for a new account with the same level of service at less than half the price. I was very satisfied with that outcome.", "label": 0}
{"text": "I live by my rice cooker pre measure my rice so i can rinse it and drop it in the rice cooker. Steam veggies on top. I chop a bunch of onions in the beginning of the week. The next day after i make the rice I make fried rice. Lessen the water in the cooker a bit for fried rice. Sauteed onions in the pan with butter add rice and teriyaki sauce. Frozen veggies in the microwave then added into the rice. I put in chicken, pork, or sausage when I want meat. Usually whatever cooked leftover meat in the fridge goes in.", "label": 0}
{"text": "thank you for your reply. that little bit of hope helps a lot. did you lose your sense of smell and taste. if so did it come back.  is there anything you took meds or supplement wise that helped", "label": 0}
{"text": "Seems like you understand just fine.", "label": 0}
{"text": "Walmart pharmacy can order citric acid for you. It is cheap and descales well.", "label": 0}
{"text": "Fair. Some people just don't know unfortunately", "label": 0}
{"text": "Dude lmao. Do not pay that shit 😂. But also def contact a lawyer and let him know he needs to pay it (unless he passed? Sorry a bit confused here).", "label": 0}
{"text": "Huh? A gallon of 5% vinegar around here is about $3.50. It takes about 1.5 oz of citric acid to make a gallon of similar strength. I can get a pound of citric acid for almost the same cost as a gallon of vinegar, so that pound of citric acid would make 10 gallons of acid equivalent. That seems to be significantly less expensive. I've been using citric acid for years in the kitchen and around the house and it works much better than vinegar for the tasks I use it for. ", "label": 0}
{"text": "You don't have to cut off the pith if you boil the peels 3-5 times from cold. Cut off a little bit of the peel and taste it after the third boil to see if the bitterness is mellowed enough.", "label": 0}
{"text": "Salad. Chopped lettuce, cucumber and red peppers, a can of tuna, mayo, a yoghurt or cottage cheese, salt, a bit of sugar, pepper, oil, vinegar and maybe some chopped shallot. Takes less than 10 minutes, healthy and delicious.", "label": 0}
{"text": "I agree 100% this is the way to do it.\n\nWhat's hilarious is that some creditors just don't \"get it.\"\n\nMy wife was buying a van. In her name _only_. They wanted to run _my_ SSN. I told them no - she's buying the van. They kept pulling shit and I said right in front of them to her - \"I'm ready to leave, are you? Or do you want this vehicle that bad?\" She did, so I gave in and gave them the SSN. \n\nTwenty minutes later, they're all \"we can't access your records.\" \"I know. I told you that. _She's_ buying the car, not me. You can see her credit rating.\" \n\nThe funny part is that when she was making the down payment, they insisted that the check _only_ have her name, because \"we don't trust you.\" 🤣\n\n**Good.**", "label": 0}
{"text": "The best spray your shower walls with it! ", "label": 0}
{"text": "I've had facility billers know, but it seems they only know when either the deceased persons family sends them a death certificate. Or it has been a fair amount of time after death.\n\nI've had hospital billers not knowing the date of birth of a baby born at their own hospital.", "label": 0}
{"text": "Does it have the same odour removing effect as vinegar when it comes to pet odours? I’ve been told that if a cat uses the bathroom outside of the litter box to clean the area with vinegar to remove the cat’s odour, discouraging it from returning to the familiar smell to do the deed again", "label": 0}
{"text": "Yeah that's exactly why I kept switching back and forth between them and Hargray, to get the introductory rates", "label": 0}
{"text": "I do not know, I've never tried that.", "label": 0}
{"text": "Are you accounting for the fact that 6% acetic acid is 94% water? In other words is the price of acetic acid divided by .06 still less than the price of dry citric acid?", "label": 0}
{"text": "I picked that because it's most common. I get 30% from TSC.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 4**: Do not post tips that could be considered common sense, common courtesy, unethical, or illegal.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 6**: Posts must not concern any of the following:\n\n- Religion\n- Politics\n- Relationships\n- Law & legislation\n- Parenting\n- Driving\n- Medicine or hygiene\n- Mental health\n\nThis list is not exhaustive. Moderators may remove posts considered to deviate from the spirit of the subreddit.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "Piggybacking onto your comment, tell the company you wish to communicate by mail and send them a tracked letter (so you get a receipt when it's delivered, someone has to sign for it on their end) to seize phone communication and provide proof of debt (just Google a sample letter and sign it). Once you have the receipt with proof of delivery you can threaten to report them to FCC, it's a $1000 fine per call. \n\nDude on the phone went \"well we must not have that processed yet\" and I just replied \"sounds like a problem on your end, call me again and I'll report you for every single call\". Felt great. Never heard from them again.", "label": 0}
{"text": "uhm....Dentistry 101:  if a painful tooth needs root canal therapy, the dentist doing the treatment should adjust the occlusion on that tooth so that it does not contact an opposing tooth during any functional movement.", "label": 0}
{"text": "They most certainly are, and if you look up the reason why Facebook gave these countries the option to lock their profiles it’s due to harassment and data breaches on women, by men.", "label": 0}
{"text": "I'm not a dentist OP, but I seriously urge you to go see a different one. \n\nA root canal should kill the nerve in the tooth, it shouldn't be painful after the procedure unless it's severely infected. \n\nI've only had one root canal but it didn't hurt and my teeth weren't sensitive after, in fact there was no sensation because the nerve in the tooth was gone.", "label": 0}
{"text": "Uh, I’m confused. It seems you forgot to open with a life story before giving us the recipe..", "label": 0}
{"text": "Use the first folded-half paper as a thirds template. Fold that paper into fourths, and mark fold spots on subsequent papers using the edge plus two of the fold lines.", "label": 0}
{"text": "Can it be used in laundry? I use vinegar in my dogs blankets for smell but not a big fan of the lingering vinegar smell.", "label": 0}
{"text": "As a bio teacher that is covering this right now this made me very happy :) be sure not to oxidize your pyruvic acid (or ferment to ethanol) to avoid the same issue though!", "label": 0}
{"text": "Yeah. This isn’t just bad advice, it’s dangerous advice.", "label": 0}
{"text": "I use in my laundry to help with the hard water strains and to help the hard water properly rinse the soap out. Give it a try!", "label": 0}
{"text": "Boneless skinless chicken thighs hold up much better than breasts to longer cooking times, plus they taste better.", "label": 0}
{"text": "Ramen with 3 eggs,  crack them in the water and noodles,  microwave for 3:20.  Eat it after.", "label": 0}
{"text": "I'm not as crazy about dark meat. Call me crazy.", "label": 0}
{"text": "Oh my god! Just think of those poor executives at Comcast!!! Am I right?!", "label": 0}
{"text": "Acetic acid is a weak acid.", "label": 0}
{"text": "You're absolutely correct!! Why pay for anything?", "label": 0}
{"text": "Rip 😭", "label": 0}
{"text": "This is crazy 😭", "label": 0}
{"text": "Cool. Hopefully it'll work out in your favor!", "label": 0}
{"text": "Amazon. My very first result is a 5lb bag for $17. https://a.co/d/84wE2uZ", "label": 0}
{"text": "Aww that sucks :(", "label": 0}
{"text": "I've gotten something from the deli exactly once in my life.\n\nAll other times I stay far away from it, cuz you know . . . People . . . And they'll start talking to me if I get too close to it.", "label": 0}
{"text": "Right, my mouth was sore when they put the camera in to image everything for the crown, that might have been the worst part", "label": 0}
{"text": "Or at the very least come to the deli counter first tell him what you want. Let them write it down and then go shop. God I fucking hate people who fucking order deli meat and then walk straight to the register before you’ve even weighed that shit out I wanna strangle them.", "label": 0}
{"text": "I had a PB&J and a handful of freeze dried strawberries for dinner.   \nI am usually too tired after work to stop to grab anything. So grilled cheese, yesterday I had a bagel I just nuked, rarely scrambled eggs with onion and cheese, half a cantaloupe and couple slices of deli lunch meat out of the baggie. I have a watermelon in the fridge I still have not cut up. I can make french toast or hashbrowns scattered, smothered and covered if I feel ambitious because I have those ingredients.  \nToo tired to even make myself a cup of tea tonight though, so just a peanut butter and grape jelly sandwich, and I made one to take to work tomorrow for lunch.  \nI am a widow and I live alone, nobody to complain about my lack of cooking anymore.", "label": 0}
{"text": "I spent over a month hospitalized, and ATT refused to waive $400 in fees to turn my phone back on.  \n\nI immediately paid off my phone and switched to Verizon. I wish I could say I did it while in the ATT store but I did not.", "label": 0}
{"text": "![gif](giphy|bC9czlgCMtw4cj8RgH)", "label": 0}
{"text": "I just got my first root canal at the hands of a very skilled endodontist and only needed  a little pain medication immediately afterwards, otherwise there is no pain at all.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "We just got a bill in the mail the other day for my grandmas ambulance ride to the hospital in 2002…. \n\nShe’s been dead since 2002….. we were baffled", "label": 0}
{"text": "Hey look, it's ai generated crap!", "label": 0}
{"text": "Two - tray bake is so easy. Protein, usually skinless, boneless chicken thighs or salmon, with whatever veg you have on hand. The trick is to HAVE veg on hand! Peppers, onions, spinach, maybe an apple, squash. Toss with herbs and some olive oil and bunk it in the oven.   \nThe other one is fried rice - any protein, loads of veg, and rice that you've already made and kept in the freezer. Grate in some ginger if you have it, and it's done. Make a lot so you have leftovers for lunch during the day.", "label": 0}
{"text": "Spray bottle with citric acid solution is great for keeping guacamole green and fruits from browning ", "label": 0}
{"text": "Ramen if I’m lazy and hungry and want food fast. \nThe big pizzas at the grocery store in the produce area! \nMacaroni served along sausage and whatever can of veggies I want. \nHotdogs chili and cheese. \nPorkchops with macaroni. When feeling like cooking I may do rice and gravy instead. \nFrozen hamburger patty on sandwich bread. \nPasta and Alfredo sauce.", "label": 0}
{"text": "I don’t know, people that work in the deli are all about business. They’re going to take your order and shuffle you right along. They’re the least talkative people in the grocery store besides the people in the seafood section. At least in my experience.", "label": 0}
{"text": "They called me two days after mine died. Asking if i would pay the putstanding bill. No one called them and informed them. Fuck comcast.", "label": 0}
{"text": "This made me laugh way harder than I’m willing to admit.", "label": 0}
{"text": "this is exactly why i use amazon. knowing i can easily return a purchase for whatever reason gives me peace of mind that buying direct from manufacturer wouldn't.", "label": 0}
{"text": "Oh trust me, as soon as we figured out the mistake we cancelled the account!  We actually switched companies.  In a twist of fate, the owner of my old house *used* to be my friend.  Not anymore.", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 4**: Do not post tips that could be considered common sense, common courtesy, unethical, or illegal.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "do the prep work now and eat it later; except for the cooking step in some preps  \neven with the cooking part, you could still do couple servings at a time  \nI remember doing up 96 hamburger patties and freezing them; making a few at a time  \n  \novernight oats, making up several jars at a time  \nbag of pull-n-peel cheese sticks; I quick-toss a couple into lunch sack everyday   \napples and bananas (also go into the overnight oats)  \nboiled eggs, easy 5 day's worth in minutes  \nhamburger and salmon, make up patties or meatloaf/salmon loaf and freeze to cook later", "label": 0}
{"text": "Still works a year later. Thank you brother you are a true savior to this world. FUCK PF", "label": 0}
{"text": "Alot of states have laws that spouses must both be on the paperwork regardless for homes and cars.", "label": 0}
{"text": "Yeah.  It was...a lot.  I bought her house, she bought mine.  Weird, I know, but the housing situation here is tight.  We stopped being friends shortly after we \"switched\" houses.", "label": 0}
{"text": "Thanks for sharing. How diluted should it be?", "label": 0}
{"text": "Less than a match head in 16/20 oz. Any more and it tastes lemony, which I don’t want. \n\nOur water bureau could’ve repiped the estimated 1800 affected houses/buildings for less than the cost of the treatment system. Super frustrating.", "label": 0}
{"text": "Not a meal but more like girl dinner - toasted bread with butter", "label": 0}
{"text": "You want bread!? $3!", "label": 0}
{"text": "Aw damn you're missing some good meats", "label": 0}
{"text": "I splash my face with freezing cold water and barely feel it. It does nothing when it's that early in the morning and I'm still half asleep :( ", "label": 0}
{"text": "Data breaches are real. I ignored a letter about one recently just to wake up one morning to a brand new credit card showing up in my online banking, ready to go, with a 22k limit! Managed to shut it down immediately, but still have no idea how that was even possible.", "label": 0}
{"text": "Use a coffee filter", "label": 0}
{"text": "Honesty? Cacio e Pepe has been a game changer. Easiest and best pasta I’ve ever had, only requires a little finesse to properly bloom the pepper", "label": 0}
{"text": "It was just a decade or so ago that the law changed in Taiwan so that minor children no longer inherit  parental debt.\n\nPreviously if parents died, their children inherited their debt, even if they were underage. \n\nIt was horrendous. There were a number of family murder suicides because parents in debt saw no way out and were trying to spare their children a life of financial ruin.", "label": 0}
{"text": "Listen. Instant pot. I got one as a gift, I didn't believe I would ever use it. I looked up a couple of recipes and now anytime I need a meal in a pinch, instant pot! Maple garlic pork tenderloin, honey garlic chicken, chicken and dumplings, whole GREAT entrees in 10-20 minutes. Bake some biscuits or cook some minute rice, you have a whole meal.", "label": 0}
{"text": "I read this as beard and was shocked.", "label": 0}
{"text": "In my house, Citric Acid is called “sour powder” put a tiny pinch of it on some raisins craisins or other dried fruit, tastes like sour patch kids.", "label": 0}
{"text": "Spam and rice. Both shelf stable for years.\n\nFeeling zesty you make a couple hard boiled eggs in the rice pot with the rice.", "label": 0}
{"text": "No I'd rather talk to Indian then other languages you guys seem polite n if can't understand I don't mind, repeating until I can! Be proud of your heritage 😃", "label": 0}
{"text": "Medical debt? Tell me you’re American without telling me you’re American.", "label": 0}
{"text": "I just can’t get how you guys have the most powerful, richest country in the world and have hospital bills. Why do you put up with this shit?", "label": 0}
{"text": "Fried rice or similar stir fried dish. As long as the ingredients don't clash too much, you can throw it together and make a decent meal.", "label": 0}
{"text": "I was the manager of a segment of a grocery store including the deli for 5 years. \n\nThe real LPT is: if you have a large deli order, call it in ahead of time.", "label": 0}
{"text": "What about property taxes? We moved into our house in August. They presented us with property taxes for January to July of that year, even though we weren't living there at the time. I called the city, figuring they had made a mistake, and that the previous occupants should be paying but they said, no, *we* had to pay. Assholes!", "label": 0}
{"text": "Something about I was tired, I thought I had advance green, maybe I didn’t…. But didn’t at all question that maybe it was green for him.", "label": 0}
{"text": "No, just tell them it and half the time they’ll write it down if it’s too much lol", "label": 0}
{"text": "But how much of that discount directly cuts into the cost of buying the thing to stock the deli? They probably sell it with little chance for profit at that point, meaning en masse it would be a problem", "label": 0}
{"text": "Apparently that's fairly common. Same thing happened when my step dad died - a few companies never bothered going after the estate for bills they totally could have collected on. Our lawyer said it's pretty typical scenario.", "label": 0}
{"text": "If the deli guy will touch anything you hand then you do not want them handling your food. As a former deli guy, do not do this.", "label": 0}
{"text": "well, i think it might soothe the throat in general, the cold temperature might lessen the irritation/inflammation in your throat, especially if you’ve been coughing for a while. i think the effects would wear off as your throat warms up again though.", "label": 0}
{"text": "Yes I have this too and it sounded kind of silly at first but when I tell you it’s now my favorite gadget and I’ve used it for years!", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Pretty sure things get bleached white, not dyed white. \n\n…aaaand now I’m off on a wikibout to see how exactly bleach works.", "label": 0}
{"text": "My Midwest-white brother was dating a California girl whose grandparents all came over from Mexico. Everything was going well until she found out he ate cold tortillas straight from the bag. Reader, it was almost a deal-breaker. \n\nLuckily, he did learn about proper tortilla temperature, and subsequently got to marry her.", "label": 0}
{"text": ">I dream of winning the lottery so I can retire\n\nTerrible way of thinking! You're relying on LUCK to improve your life, which is a defeatist attitude. Playing the lottery is not a winning strategy whatsoever. It's a total waste of money. Look at the odds of winning. Investing money is the way to go. That is generally a guaranteed winning strategy. Learn about finances and how to manage money and how to invest and you'll do so much better in life than throwing money away on lottery tickets on a futile attempt at a jackpot. It's foolish. There's a reason they call it the \"poor man's tax\". Poor people gamble. Rich, successful people didn't get rich by gambling.", "label": 0}
{"text": "Even when I stand there nowadays, they never slice it as thin as I want even when saying \"really really thin, like as thin as you can go without it being shredded.\" They set it thin, but then push so hard on the meat it ends up being thick as shit. Might just be me, but man... Even when I ask to check it, one good slice and the rest thick.", "label": 0}
{"text": "I love you for this comment", "label": 0}
{"text": "Healthy?", "label": 0}
{"text": "Deep indian frozen meals. Tasty warm and decently nutritous", "label": 0}
{"text": "title says (at a deli that does not have a preorder system)", "label": 0}
{"text": "If the US dollar becomes useless selling gold in China will be the last thing you have to worry about.", "label": 0}
{"text": "Also as many bottles of water and cans of Vienna sausages as possible", "label": 0}
{"text": "You having a stroke, tovarich?", "label": 0}
{"text": "HOW COULD THE US DOLLAR BECOME LESS THAN A PENNY?!", "label": 0}
{"text": "Hahaha!\n\nFunnily enough I use an amazing trick which is to use  cooked.wiki/  In front of the URL of a recipe blog and it gathers just the recipe!", "label": 0}
{"text": "Absolutely!", "label": 0}
{"text": "It’s your fault you’re in that position. You have the power to change that.", "label": 0}
{"text": "No, don't pay the IRS just because you get a bill for someone deceased. My grandmother was dead 4 years when the IRS sent a bill for something like $247,000. She owed nothing, owned nothing, lived with a partner, had inherited a house a year or so before she died that we immediately sold for $105,000 and that's what she lived on the last two years. I have no idea where the IRS got their info. She hadn't even filed taxes for the last two years; I kept offering. I wrote the IRS stating these facts and never heard from them again on her behalf.\n\n\nYears later I got a letter from the IRS regarding not reporting some taxable retirement payout from my supposedly dead spouse, but I was still married to my live spouse. It was from a short 2-year marriage 30 years earlier and they mixed up my SSN with the next spouse's name on the 1099-R. I told the IRS if they could get me the money, I'd gladly pay taxes on it. They finally released a contact number so I called the issuer and got it straightened out. ", "label": 0}
{"text": "Fried rice and egg", "label": 0}
{"text": "I usually try on tons of stuff at the mirror and never hang anything back up.  I usually pick out 20+ things to try on but only buy 2 or 3.  The rest just ends up getting thrown over the nearest rack for the employees to put away.  It would take me forever to hang everything up and put it back where it belongs. ", "label": 0}
{"text": "Completely agree. \n\nOr to put it differently, if you're buying when you're worried your currency will collapse, you'll buy at the same time as the other buyers, so when gold is the most valuable (which to be fair isn't the case now in the US, because people are not expecting a collapse of the dollar, even in the medium term, unless you go on r/preppers).\n\nThen when you sell it after the collapse, you're selling it at the same time as everyone else, when it's the last valuable.\n\nIf your country is some small developing country somewhere it might not make much of a difference (unless your buyers are the local mafia like in the comment above), but if the US dollar has collapsed and everyone in the US is selling their gold, the price will completely collapse.\n\nBuying gold can't be considered as a safe bet in something with a stable value (look at the historical value of gold); rather, it's speculating about future inflation vs returns on other markets in the context of an economy that is still working. It can work, it can lose you money. It can't save you if your currency collapses: you're still screwed.", "label": 0}
{"text": "Maybe sk0rpeo came in right after you, so the employees had learned their lesson.", "label": 0}
{"text": "If that's the case then the deli guy shouldn't be in that line of work.  Washing hands is a thing.", "label": 0}
{"text": "ITT: people finding out not all delis are the same", "label": 0}
{"text": "When I worked at Pizza Hut, they required a deposit for orders of >20 pies to dissuade prank orders that waste food.", "label": 0}
{"text": "Call him on it as soon as he does it...and invest your time with people who make you feel good about yourself", "label": 0}
{"text": "I've had this problem. Mostly because I'm more observant than the general population. I can be in a large group of noisy people all talking at once, but I hear every conversation. Especially anything people say about me, no matter how subtle. I usually will try to ignore it, but if I'm drinking I lose my filter and will call people out in a very public way. This has resulted in me losing friends. Although I use the term \"friends\" pretty loosely since some of them acted like they'd rather be somewhere else while hanging out with me. ", "label": 0}
{"text": "Anyone have the appropriate ratios for the volcano/bath bomb thing? I think I know how to do the chemistry math myself, but if anyone already knows from experience or their own calculations, I'd be interested to hear it.", "label": 0}
{"text": "As others said confront him.\n\n\nAlso want to ask: Has this shift started after your life started improving? Or after not the rought spot ended. Change is hard for people, even if good. My first instinct at my age and previous experiences is to drop him. BUT I have had friendships that have weathered the storm of the dynamic changing.\n\n\nIt can be a few things.\n\n\nOne, he could be envious that your life is better and you no longer need them. Their petty comments may be them trying to show their value in your lives. That could potentially be fixed. This isn't quite envy of your life, but more operating out of fear that you will move past them. That's fixable! The friendship can be saved.\n\n\nTwo, you are progressing beyond them and they are struggling with resentment and jealously. It hurts, it *really* hurts when friends change up on you when your life improves. The only reason I am trying to be gracious is because I have had two people at different points in my life come and apologize and that's the reason they gave. It didn't make me feel better tbh. I was fresh and green and struggling. They were my cheerleaders. And I well...kinda went above what they expected is all I will say. That changed things. The apologies were nice, but it hurt because the way it was delivered was that I made them feel bad about themselves. So I questioned and spiraled on why they were my friend in the first place? To take a charity project? Pity? To have someone beneath them. I don't think that was the case, but just honest thoughts that made it harder to trust people. \n\n\nI almost wish I never knew and just moved on and made different friends. So asking is to risk facing honest truths. About them...and about what you secretly think about yourself and how you relate to others. Sometimes your life changes for the better and you feel the same *inside*, but others will treat you different for the changes they see on the *outside*.\n\n\nYou will only know if being brave to ask. And if brushed off, you can see if they make attempts to stop being rude. If they don't change, you do NOT owe them a lifetime of being a punching bag friend just because they helped you in a rough spot. Friends who did that for me, I give them one or two chances. I'm human. I love them. I hope I'm wrong. Yet look after yourself too, and let them go if they are no longer being a friend.\n\n\nI hope they correct themselves and that this is just a snag. If not, *please*, be kind to yourself and don't be friends with someone intentionally being rude to you.", "label": 0}
{"text": "Ever thought about looking it up to see if you're wrong before commenting?\n\n\nFrom Google:\n\n\n\n\"Refrigeration\nBread can last 7–14 days in the fridge, but it may go stale faster than at room temperature or in the freezer. Refrigeration can prevent mold and spoilage, but the starch in bread changes faster, causing it to go stale more quickly. \"", "label": 0}
{"text": "My mom used to make us \"breakfast in a cup\" in the '80s. Poached egg and a half slice of toast, with cheese. It was my favorite, and I still love that shit!", "label": 0}
{"text": "Drop him.  When he was being supportive, he was probably still belittling you but you didn’t notice cause you needed the support", "label": 0}
{"text": "He will only respect you if you start responding in a similar fashion, but in a funny way. Bonus points if you get the other guys in your call to laugh. There is no other way. Getting angry will make him say \"oh its not that serious why are you taking it that way\", which your friends will agree with, and getting annoyed will just make them laugh. Both wont fix anything. I learnt this the hard way while I played competitive sports with 15 other dudes. If you arent good at doing that, get better, watch funny videos and tutorials. Whatever you do, dont be malicious when you joke about him. That will make you look like a bad guy.", "label": 0}
{"text": "Even better next day!", "label": 0}
{"text": "The real life pro tip is setting up your life to be in rhythm with yourself, not to constantly battle against your natural predispositions.\n\nI figured out long time ago that I'm not a morning person. Waking up early morning and going to school was a torture. But I was a kid, there wasn't much I could do about it. However, now I'm an adult and nobody cares if I wake up at 5, at 7 or at 10.", "label": 0}
{"text": "Well, eff me in the goat ass! That's why I couldn't figure out fried rice! The texture was all wrong. Thanks for that.", "label": 0}
{"text": "I got a toll bill even though I specifically remembered paying cash at the time of crossing because I was traveling out of town for a concert. Ended up jumping hoops to sign up and prepay for an account and got a toll tracker device for my car sent to me even though I don’t live in the area and rarely use the toll bridge. I ended up calling the billing department to dispute the charge. They ended up waiving the charge after reviewing their cameras. I got stuck with the toll device for a couple years which I did not use but finally sent it back once they closed my account. Learn my lesson. Dispute the charge first before paying for anything. Smh", "label": 0}
{"text": "Been in same situation, stayed for too long. Drop him asap", "label": 0}
{"text": "Call them out & leave them alone. People don’t expect you to call them out they expect you to be passive be okay with being talk badly about", "label": 0}
{"text": "I'm sorry", "label": 0}
{"text": "News Flash- they are not your friend", "label": 0}
{"text": "Not an expert, I would say \"why are you being a bellend?\" the next time they do it and go from there.", "label": 0}
{"text": "confront him and ask what's up. if he says anything beyond that it's his fault, fuck him.", "label": 0}
{"text": "Well, yes and no. I only truly got to test it once because I haven’t had more occasions that required me to be out the door super early. \n\nIn that one case, the advice that ended up being most helpful (somewhat unfortunately) was to just make peace with the fact that I probably won’t get much sleep. I got about 3-4 hours of sleep that night, which, while not nearly enough, is still better then what I would have expected to get otherwise. \n\nBut more generally, I’ve found that the focused, deliberate relaxation of individual muscles/body parts has greatly helped me get to sleep faster in normal conditions (i.e., when I go to bed and wake up at my regular times).", "label": 0}
{"text": "This is so true- works for breadsticks too :)", "label": 0}
{"text": "Well, shit, [alkaline water with lemon](https://www.youtube.com/watch?v=rBQhdO2UxaQ) might actually have a purpose!", "label": 0}
{"text": "What a niave statement.", "label": 0}
{"text": "If being up early is that unpleasant to you I would suggest there's something wrong with your sleep.", "label": 0}
{"text": "It's always the same with these \"How to get up early 100% proven\" hacks:\n\nStep 1: Get up\n\n???", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Omelettes. Easily customisable with what you stuff them with, if at all, and simple to make.\n\n\n\nhttps://www.recipetineats.com/omelette/\n\n\nUsed this recipe as a base for learning how to make it.", "label": 0}
{"text": "if they did the Deli-Man would come and take them away for being naughty", "label": 0}
{"text": "Hello /u/tidarjoey and thank you for your submission! Unfortunately it has been removed for the following reason:\n\n>Posts about  medical, hygiene, and  toiletry related tips are no longer allowed, as they have been placed on our Restricted Topic list, which can be found in the [sidebar](/r/LifeProTips/about/sidebar). \n\nPlease make sure to read through the sidebar before submitting in the future. Thanks for thinking of us, though! Have an excellent day.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Say a ghost shopper hands over a list and ghosts out to look at donuts. You walk up and wait to order only to be ignored because the staff is working ghost orders.\n\nMost people do NOT understand that the staff is busy. They get angry and abusive with the staff. I've had people toss their hand basket onto the floor ranting as they walk out of the store because they were 'ignored' and it's ridiculous that they have to wait when nobody is around. The other side is when your employees stop the ghost order and then the ghost comes back to flip out that they don't have their list done yet because you have to wait on the folks at the counter.\n\nIt's a no win situation, not to mention the number of times a ghost has forgotten their order and you are stuck with product you can't utilize in any way and have to waste.", "label": 0}
{"text": "This is the true answer, and calling in to order is NOT a preorder system. Those are the apps and kiosks where you order and get confirmation number etc.\n\nThis is soooo much better than a ghost that rolls up and drops an 30lb order during the rush.", "label": 0}
{"text": "This was really insightful and heartwarming to take in. Thank you.", "label": 0}
{"text": "Where did I hide my spare keys", "label": 0}
{"text": "You are not that important or interesting to be the talk of so many people", "label": 0}
{"text": "Block them and stop being so sensitive.", "label": 0}
{"text": "As a deli worker; firstly, they don't know what they're doing. I see it all the time from my new coworkers. It just comes down to experience. But most importantly, sometimes it's not even possible due to the meat/the slicer. If you want perfect, get pre packaged", "label": 0}
{"text": "You know nothing about me or my social circles. The context varied, but to give a specific example, my group wanted to leave one party and go to another, but they felt stuck because they couldn't take me to the second party. Instead of saying this outright so I could tell them I don't care if they leave, they'd mope around like I was an anchor while subtly discussing what they're missing out on. ", "label": 0}
{"text": "i did this with someone who was insulting me online.  it didn't change his behavior.\n\ni simply stopped interacting with him... the dude is not worth my time and energy", "label": 0}
{"text": "Oh the drama", "label": 0}
{"text": "lPt. If your deli doesn't cater to large orders. Go to a different deli that you can call it in.", "label": 0}
{"text": "Hi where did you buy your strobe lights ?", "label": 0}
{"text": "Lately for me; salad\nMaybe it's not low effort for some,it is for me.\nCut: peperoni, onions, cucumber\nCans; chickpeas, maybe lentils or beans.\nMaybe also; can of tuna\n\nBasic sauce\n\nCrunchy, healthy, protein, good.", "label": 0}
{"text": "Perfect. Continue carrying out this interaction with those in your physical world and your life will become immeasurably more pleasant.", "label": 0}
{"text": "Keep in mind that some people will be supportive when you're in a rough spot, but resent you when you get better because they liked how the relationship worked when you were not doing well. They liked the power dynamic or something else unhealthy about the relationship.\n\nThis may not be the case here, but it's worse examining.", "label": 0}
{"text": "I bet the frustrated customers weren't even greeted or kept in the loop about the ghost orders. People are much more happy to wait if they feel seen and understand why they are waiting.", "label": 0}
{"text": "Tell him what you just told us. Magic!", "label": 0}
{"text": "Just run it under the tap and pop it in the oven for 4 minutes. No microwave can top actually baked bread.", "label": 0}
{"text": "Is it possible this is one of those relationships where you are mean to one another in a playful way but are actually friends?\n\nI know my group is this way. We poke fun at all the things we can. Dumb things we did, body features and such. But we all know that it is all just jokes. We constantly do for one another without question though. Borrowing money, trading up work, buying games for one another, etc. \n\nI could make a call to bury a body right now and the only question anyone would have would be about where we eat after. And really that is just a formality. You always eat Waffle House after burying a body. I will accept iHop as an alternative though.", "label": 0}
{"text": "I can buy it locally from the grocery store. It's usually in the baking section ornwith the preservation section near the jars and lids.", "label": 0}
{"text": "What brand of slow cooker do you use?", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "🎶keep a little ham under my pillow for the deli man🎶", "label": 0}
{"text": "I would tell them it bothers you. I know you said you don't want to abandon the friendship, but things like these don't last forever. I know they helped you during a tough time, and you can be appreciative of that while also understanding that the relationship may have served its purpose.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Ok so keep your pranks to 19 pizzas or under!", "label": 0}
{"text": "I might end up having to use this when I sell my couch in a few months.", "label": 0}
{"text": "Your post is confusing. Where is the pro tip? You’ve said we don’t have to do something but you also call it a win-win.", "label": 0}
{"text": "That’s quite direct and could lead to an uncomfortable escalation which can lead to anger and the ego dominating. \n\nIt’s often helpful with people to try to meet them on their own level and deal with things without blunt confrontation.", "label": 0}
{"text": "Our store forces us to greet people. Also stay away, highly processed food is hardly good for you. We had a brand that famously had a case of listeria. Lost a lot of customers. But my job is to put a bunch of random stuff on the sales floor", "label": 0}
{"text": "Good for lysing cells when extracting DMT too.", "label": 0}
{"text": "I personally love lists. Gives me peace and i just swap gloves after touching it", "label": 0}
{"text": "Added. Sorry, for the confusion.", "label": 0}
{"text": "Did you mean to say \"ungrateful\"?", "label": 0}
{"text": "If he doesn’t explain himself & stop, DROP HIM quick, fast & in a hurry. It’s great that he was supportive during your rough spot, but I’m a firm believer in the fact that some people are in your life for a season & some for a reason. I’ve had some very good friendships that simply ran their course & it was time to move on without them. \nGood luck.", "label": 0}
{"text": "TL;DR: People like it when you’re nice to them", "label": 0}
{"text": "Ding ding ding", "label": 0}
{"text": "Bulgaria, come check it out.", "label": 0}
{"text": "If it's in powder form it's mixed with something else (also acetic acid is more corrosive than citric given a similar concentration, so worse for surfaces). It's also a bit worse environmentally. ", "label": 0}
{"text": "Yeah that's always fun until 3 people all show up at once for the item.", "label": 0}
{"text": "This is how I handle selling things online:\n\n- New item costs: $100\n- Most people selling it: $80\n- My price: $70\n\n**FAQ**\n- “Will you do $50?\n  - No sorry my price is fair\n- “But I saw it for X at Y!\n  - Sounds like you should buy it there.\n- Can you hold it until Z?\n  - You can check back with me on Z-1 but unless you pay in advance I don’t do holds\n\n\nSimple and easy", "label": 0}
{"text": "I'm so confused. The OP says sleepers left makers right and then all of a sudden you correct it to makers left? Isn't this post supposed to clarify the correct corner not leave is just as confused as we STARTED?\n\n\nIt took me 4 tries to finally get my fitted sheet on with the tag in the correct corner. Only to go out my comforter on and forget which side the fitted sheet tag is on!!\n\n\nThis wouldn't be that big of a deal if wasn't recently disabled from a car accident and can't walk which is super difficult to shimmy around a big bed in a small room with out the use of your legs. ", "label": 0}
{"text": "That’s good to hear about your regular routine. I might give that a go - a switch up from my reciting poetry trick. Thanks for the update.", "label": 0}
{"text": "OMG thank you. My fiance puts the finished side facing up. When I explained it goes face down so when you fold the top down you have the nice side showing he was so confused. He just stared at me like I was speaking a foreign language. I was like think of a sandwich with mayo on each side and meat in the middle. Do you put mayo on the top of each slice of bread and then meat in the middle?? Or do you put the mayo on the inside of each slice so it's on either side of the meat. Lol ", "label": 0}
{"text": "Omelette. Add mushrooms, tomatoes, spinach and cheese. ", "label": 0}
{"text": "Saving this post for later", "label": 0}
{"text": "You know what's awesome. One time I bought sheets and the tag actually told me what corner of the bed it goes on. Either they were really expensive sheets or that was a dream. \n\n\nMcDonald's coffee cups say HOT HOT HOT why can't sheets label the corner?!", "label": 0}
{"text": "The employees and the store GM should teld those adult toddlers to grow the f up.", "label": 0}
{"text": "Stop it we don’t do that here /s", "label": 0}
{"text": "Eww old technology. Given me the apps. /s", "label": 0}
{"text": "It was, me and two other people showed up at the same time. I was fucking pissed after driving down there for nothing.", "label": 0}
{"text": "Better yet, just ask the tech to shave where he or she plans on putting the electrodes. Some techs won't do it unless you ask. As a retired critical care nurse, I always explained why I was removing some hair. Never got a no for an answer. Sadly, tips like this are no longer taught in training. ", "label": 0}
{"text": "Fwiw, no one gets in well all the time, and there are many reasons that this person could be lashing out. Depression, jealousy, personal emotional pain. \n\nIt’s worth finding out before cutting off your friends, because you can at least make an informed decision. \n\nIf you just cut people off anytime there is conflict you will die very lonely", "label": 0}
{"text": "First good LPT I’ve seen in a long time. Thanks OP!", "label": 0}
{"text": "Damn - can confirm that my water is crispy!", "label": 0}
{"text": "Does reporting as spam with Apple's iMessage do the same", "label": 0}
{"text": "Costco’s pesto is soooo good", "label": 0}
{"text": "Yes and no.  \n\nYes because the carriers (T-Mobile, etc) run SPAM and aggregate the reports to send to the FCC and for their own block purposes (but they err on the side of caution and only block stuff that isn’t legitimate.)  \n\nNo, because it doesn’t individually identify you and have the SMS provider know that the company was abusing things.  And since the SMS provider knows it’s you, they can get the campaign manager for the spam SMS blast to remove you.  It’s a more direct approach.", "label": 0}
{"text": "As a shopper, I find this to be an interesting read. Thanks!", "label": 0}
{"text": "Those toddlers pay the bills unfortunately. It's almost always a boomer, the majority managed to make it this far in life without emotional regulation, social skills or general ability to function because they are the most privileged generation in all of human history, had strong and capable parents, and outnumbered every other age demographic to vote for policy that's benefitted them for the last 50 years, and where their basic cost of living turned into multi millions in home equity to blast and fuel their smug insecure egos- They hate themselves and feel guilty deep down and find outlets like being angry at paper bags and people trying to make it in the economic shit stain they left behind. \n\nA lunatics rant- I work retail in a 90% boomer population town and am completely traumatized. The rich ones, the poor ones, regardless of race or nationality, it's that fucking age demographic like they have this \"you think you're so good??\" Attitude to McDonald's workers because deep down they know they're on easy street but can't process cognitive dissonance.", "label": 0}
{"text": "Black mold.  It is much cheaper to reprogram some mold to make you citric acid than extracting it from perfectly good fruit.", "label": 0}
{"text": "Cat pee has ammonia, so be careful! You can end up with chlorine gas if you add bleach compounds. Not that vinegar is bleach, but combining things sometimes goes awry ~", "label": 0}
{"text": "People are too young to remember that's how it was always done up until the 1960s, and not just at the deli.", "label": 0}
{"text": "It doesn’t have to be large in weight, but several different items that need to be sliced, which takes time. Like maybe you’re getting 4 different kinds of meat and two or three cheeses.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "🎶To his freezer, dddeeepp under the \nparking lot🎶", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "ever thought someone was joking but ignored it just to try to sound like a smarter person?\n\nFrom Kindergarten:\n\n\"I'm rubber and you're glue, whatever you say bounces off me and sticks to you.\"", "label": 0}
{"text": "This is good to know.", "label": 0}
{"text": "Audiences before color TV still tuned into broadcasts…", "label": 0}
{"text": "You're crazy.", "label": 0}
{"text": "Yes, but... \n\nThe *reason* you can smell vinegar is that acetic acid evaporates at about the same rate as water (similar boiling points), so you can use vinegar solutions without rinsing it off in most cases. \n\nYou definitely need to rinse citric acid off when cleaning with it. The white residue it leaves behind if you don't will be... well... pure citric acid. No bueno on a lot of surfaces.", "label": 0}
{"text": "Do tell", "label": 0}
{"text": "Disagree. Try parenting instead.", "label": 0}
{"text": "I tried setting grayscale while my phone is plugged in. I just get used to grayscale.", "label": 0}
{"text": "Heh, shit, I might do this for myself to curb my iPhone addiction.", "label": 0}
{"text": "Setting to Greyscale is part of parenting", "label": 0}
{"text": "Instead, try teaching them the difference between delayed rewards and immediate rewards. Educate them on how dopamine works and explain that we often feel the need to reach for our phones in uncomfortable situations (waiting in line, on the bus, etc.) because of this. Explain that using your phone to communicate with friends and stay up to date is good, but a healthy balance is needed :)", "label": 0}
{"text": "I just did this to myself to help curb my addiction ! I felt  instantly less interested in my phone!", "label": 0}
{"text": "Or they just forgot. I could see myself doing that.", "label": 0}
{"text": "Have them bid for it", "label": 0}
{"text": "The hospital is now suing me for my estranged father’s medical debt 🥲", "label": 0}
{"text": "I’m weird Arizona lemons tea cold helps yellow Gatorade and coke a cola usually coke but any temperature is fine", "label": 0}
{"text": "Good luck with that, kids will figure out how to disable it immediately.", "label": 0}
{"text": "Oh that's interesting. I always rinse until it doesn't feel slippery any more.", "label": 0}
{"text": "I'll need to use that from now on. ", "label": 0}
{"text": "You can also block pornhub", "label": 0}
{"text": "This is a good rant", "label": 0}
{"text": ">“But I saw it for X at Y! - Sounds like you should buy it there.\n\nSome scammer was like, \"I'll pay you an extra $x to ship it to me! And I was like, \"you can buy it new with free overnight shipping for less all together directly from the manufacturer. Why would you want to pay more to get it from some rando on the interwebs?\" I didn't get any response, lol.", "label": 0}
{"text": "But then how will I know I've rinsed enough? And how will I keep my fingertips looking youthful?", "label": 0}
{"text": "That's between you and your dermatologist.", "label": 0}
{"text": "That is a fantastic idea! Thank you", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Agreed! I have driven an hour to buy something, only to see a dud walking away with it as I pulled up. The commitment goes both ways unless you make it clear it is going to the first person who gets there.", "label": 0}
{"text": "How large is large?", "label": 0}
{"text": "Exactly what I've needed for months now. Thanks", "label": 0}
{"text": "As a seller, I’m transparent about other interest. Yeah a lot of buyers probably just think it’s a selling tactic, but I’ll always keep folks up to date. Just send them a “hey I have another buyer planning to come tomorrow, whoever gets here first with the money gets the item”", "label": 0}
{"text": "Did they not tell you there was other interest and the first person there gets the item? That’s what I would do as a seller. If you haven’t sold much before it’s hard to overstate just how many people flake out and never show. I’m not going to turn away cash in hand now because someone might show up later", "label": 0}
{"text": "Feels like a lot of people on here think Craigslist reselling is a seller's market. When almost everything is priced nearly New and free delivery exists everywhere most people selling their stuff just look delusional.", "label": 0}
{"text": "There’s an app called I Am that does this throughout the day", "label": 0}
{"text": "Because you are wearing gloves and handling food. People would try this all the time when I was a teenager working at Subway.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "No…hence my anger. \n\nIf they had, I’d have told them I’m not driving an hour to get it only to find out you’ve sold it out from under me.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "344d gang", "label": 0}
{"text": "There is an entirely different problem happening or you're using a mobile ISP.", "label": 0}
{"text": "Same. Son \"borrowed\" for college and we never saw it again. The salesperson talked us out of buying a new one because \"they don't last like the old ones\".", "label": 0}
{"text": "Damn! That means every time we fly home into Hartsfield Jackson, we’re going to be able to make that claim. That airport is huge! You can’t even get to baggage claim in 20 minutes. It was about 45 minutes in July from door open to bags dropping.", "label": 0}
{"text": "Then buy it at a retail store. I'm just a dude, I don't have time to wait around for you all day. Come get it or don't.", "label": 0}
{"text": "FIGHT TO THE DEATH", "label": 0}
{"text": "![gif](giphy|Mous21IAhJQiI)", "label": 0}
{"text": "This is not a tip, this is uninformed speculation based on ignorance of how IP networks function.", "label": 0}
{"text": "\"I'll pay you $x to ship it to me! You just have to use some random 'shipping company' you've never heard of before and make sure to cashapp them in advance\"", "label": 0}
{"text": "Either musicians are just better people or one of us is an outlier. Before I started clamping down, and still sometimes after it was 2/5 or so with this bs.", "label": 0}
{"text": "They don't really care what you are using.  But you might just be connecting to less congested servers.  I run into issues with discord being poor quality.  Switch to a different service like zoom or google meet and no issues.  Most businesses aren't using their video conferencing at 7 PM so their servers are downsized but still more available than discord since everyone is on socially gaming at that time.", "label": 0}
{"text": "Hello /u/ham-and-egger and thank you for your submission! Unfortunately it has been removed for the following reason:\n\n>Posts about  medical, hygiene, and  toiletry related tips are no longer allowed, as they have been placed on our Restricted Topic list, which can be found in the [sidebar](/r/LifeProTips/about/sidebar). \n\nPlease make sure to read through the sidebar before submitting in the future. Thanks for thinking of us, though! Have an excellent day.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Yeah I agree with that. eBay as well. Unless it's a limited item no longer available, why are you selling this at or above retail? What makes you think I'm going to buy yours instead of straight from the shop online?", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Sure.. but then you're left with a sodden, heavy piece of disintegrating cardboard that will make a mess, or will mold if you throw it in a garbage bag.", "label": 0}
{"text": "Wetting cardboard means it can’t be recycled.", "label": 0}
{"text": "I do since it is cut free. It is a world more safe than fussing with razor blade knife.", "label": 0}
{"text": "Please don't, the mold will make sure the cardboard can't be recycled and likely the rest of the paper collected with it. Just take a knife and cut it into largish pieces.", "label": 0}
{"text": "Maybe if you're scumbag Steve", "label": 0}
{"text": "My solution is to only meet in places that are in my routine anyway. I'm not spending a minute out of my day to meet a buyer, so if they don't show up, I don't waste my time.", "label": 0}
{"text": "You might want to watch some videos on how to safely use box cutters in that event.   They aren’t like handling radioactive waste", "label": 0}
{"text": "Or use a knife to break it down to small manageable pieces.", "label": 0}
{"text": "Cut the tapes and fold it. If you’re worries about being cut, don’t worry. Your parents can fold the cardboard, just let grown-ups handle the dangerous business.", "label": 0}
{"text": "When procrastinating cooking, cook? 🤔 SLPT.", "label": 0}
{"text": "Whatever standard exists with you and your friend group that your rando, unplanned chili won ANYTHING is so low to ground that ants trip over it.", "label": 0}
{"text": "NEW LPT: Don't take LPT from OP.", "label": 0}
{"text": "why am i just learning this?!", "label": 0}
{"text": "God dammit for a beautiful moment I thought someone was just happy to have realized the word “deli” fits perfectly into that tune", "label": 0}
{"text": "And never post something for free on Facebook. Make it $5 or something and then just let the person who shows up have it for free. I post a lot of old appliances as we upgrade our rentals, and a free item gets sooooo many useless messages. Will I hold it, can I deliver it, is it still available, can I help load it, can Bobby Sue's brothers uncle come pick it up after 9 tonight, etc etc etc. I went through about an hour of this last time and then just changed the price to $10. After that I got one serious response, they showed up right away, brought a trailer and help to load it, and then I let them have it for free.\n\n\nAlso \"no holds, first come first serve, posted on other sites, and don't just ask if it's still available\" ", "label": 0}
{"text": "I've sold *a lot* online and find i get waaaay less flaking if I can wrangle a scheduled pick up time out of a buyer. Also better for me so I don't have to sit around all day just in case someone shows up randomly. Tho I won't lock in a sale farther out than 24hrs and no address until you message me your ready to head out. I very rarely have issues with someone flaking once I've sent the address and I'd have to check my records but I'd guess I get a no contact flake 1 out of 10 ish sales doing it this way. Less stressful IMHO and means I maintain my excellent seller rating and reviews \n\nSuppose it also helps that I don't sell individual items for less than $20 as well. The higher the price the less chance of a flake. Anything that would be less than $20 gets sold in lots or at a garage sale/flea market. Individual one off private sales are not at all worth it for low cost items. Just having to answer the million \"is this still available?\"s you get with low $ items makes it not worth it lol", "label": 0}
{"text": "Fuck that bot, and have a beautiful moment trying to get the tune out your head now 👀", "label": 0}
{"text": "Please, for the love of God, just call ahead.", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 8**: Do not submit tips that are advertisements or recommendations of products or services.  \nNo tips about using a commercial product for its intended purpose.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 9**: Posts/comments that troll and/or do not substantially contribute to the discussion may be removed.  \nModerators may remove posts or comments at their discretion for being low-quality or low-effort.  \nOff-topic submissions (posts that are not Life Pro Tips) will be removed. \n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 9**: Posts/comments that troll and/or do not substantially contribute to the discussion may be removed.  \nModerators may remove posts or comments at their discretion for being low-quality or low-effort.  \nOff-topic submissions (posts that are not Life Pro Tips) will be removed. \n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "I 2nd this. I've done this many times successfully. Esp around Christmas time!", "label": 0}
{"text": "😆", "label": 0}
{"text": "Restaurants take back dirty as fuck cups and plates just fine.\n\nThere would be 0 rules broken if a guy at the deli counter took a piece of paper from the customer. You would simply place it on a non food contact surface or area (or memorize it if it's not too bad), remove gloves, wash, don new gloves, return to work.\n\nI would be more concerned with lazy employees not cleaning and sanitizing their slicers every 4 hours and washing their hands regularly. Some places are run like a well oiled machine but others are horrible and stink to high heaven in the raw meat department.\n\nI don't inspect stores but I've been to some on food borne illnesses cases and I've seen a range of competency from \"how have you survived this long\" to \"the most knowledgeable person with a tight crew\".", "label": 0}
{"text": "If your car is undrievable because it’s old, rusted and falling apart, then an honest mechanic will typically tell you they won’t work on it.  That’s typically frowned on in the medical industry.  You don’t have to “make your car comfortable” or ease its pain as it is sent to the crusher.", "label": 0}
{"text": "It's almost like if you set a precedence for how you handle orders and communicate with your customers they'll learn the system and work with it. Also depends on location.", "label": 0}
{"text": "I just did this and it made it worse lol", "label": 0}
{"text": "While we can only guess about their mental state, the change in their behavior could be brought on by their own life events that have nothing to do with you. If you want to be a good friend I think you should at least investigate to see why this sudden change in behavior has taken place. I can't really guess at your relationship dynamics, but I can say that \"sly rude digs\" are pretty standard in my friend groups. This could be that they are comfortable enough in your relationship to do this, or it could be that the relationship has deteriorated and they do not respect you (you should bail if this is the case). Either way it is going to take some communication from you. A lot of people have suggested just moving on, that mentality is very bad. Relationships are worth saving, damaged people are worth helping, and having uncomfortable conversations is a part of any relationship worth having. This doesn't mean you should endure endless abuse, but you need to talk to them to find out why so that you can make the best decision possible.", "label": 0}
{"text": "Yet they'll still ask...", "label": 0}
{"text": "\\> add \"$xxx discount off if you pick it up by 5pm Sunday, this week.\"\n\nI'm not sure that anyone reads the description of the post before they message", "label": 0}
{"text": "What about if they dont offer a price but ask “are you negotiable?”", "label": 0}
{"text": "I have learnt this today", "label": 0}
{"text": "May I see a pic? Struggling to imagine it, sorry.", "label": 0}
{"text": "For sure! That's different. I thought they meant like they just don't wanna pay taxes in general lmao", "label": 0}
{"text": "Sorry buddy, but it sounds like you might wanna talk about this to your therapist.", "label": 0}
{"text": "I love this LPT- thanks! Gonna try it.", "label": 0}
{"text": "As a Canadian that's so crazy. It's been the norm for what feels like ever", "label": 0}
{"text": "I did say I was American and yea, shit sucks lmao", "label": 0}
{"text": "Yeah that sucks", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "“Sorry my prices are fair”", "label": 0}
{"text": "Basic food theory?  What a concept!", "label": 0}
{"text": "How to wet out glass", "label": 0}
{"text": "Lots of things oil, pepper, parmemsen cheese, Italian herbs.", "label": 0}
{"text": "Yeah.. I did get a lawyer.", "label": 0}
{"text": "wdym contested? so they were arguing it should be counted?", "label": 0}
{"text": "I've never found a sample ballot that actually includes everything.  There always a few things that I have no clue about.", "label": 0}
{"text": "Putting your address on would mean the person both has your keys and knows which house to use them to get into...", "label": 0}
{"text": "I’d rather a way to contact me through email. The last thing I want is someone to have the keys to my house and car and know exactly where both are located.", "label": 0}
{"text": "I have a label maker, got a name/phone label on everything important!", "label": 0}
{"text": "Bruh 🤦‍♂️", "label": 0}
{"text": "Deceased cat’s tag and an air tag for the car keys.", "label": 0}
{"text": "I mean it's satire or that's the way i took it", "label": 0}
{"text": "I was client of a bank that provided tags like that to their clients.", "label": 0}
{"text": "That's if you register your address! I remember you still just get the card with the form attached to it. The card works if you don't fill out the form.   \nNowadays, most people just type in a phone number. If you're lucky, someone has the app connected to their phone number or membership card number, and the app has a way to notify someone. I thought they thought that far ahead, it seems like more work than Corporation is willing to pay for.D", "label": 0}
{"text": "Not always! I forgot a set of keys at a church & when I called the next day, the church secretary said she had dropped them in a mailbox because the Kroger tag said to do that if found. I made many calls to USPS & eventually found where lost keys end up. They refused to let me come & look through the bin & told me that they just throw them away when the bin gets full. I refuse to ever get another key tag like that.", "label": 0}
{"text": "So  the finder can come & rob you?", "label": 0}
{"text": "If you still manage at or near 100% success rate in selling quickly, that's great. I would imagine simply listing a used item for MSRP would cause a lot of potential buyers to not even ask.", "label": 0}
{"text": "Fucking hell", "label": 0}
{"text": "It was literally just an example to show that I look at prices of things locally and sell a little bit below that. \n\nThe reality is however that **some** items are worth roughly that price, and some items are more collectible in nature and worth **MORE** than what it was worth new when originally bought [in which case the item wouldn’t really have a relevant new price as it’s no longer being sold].", "label": 0}
{"text": "I've had my supermarket cards longer than I've had a smartphone- or even a flip phone- so I filled out a form and handed it to the cashier.  I suppose now you'd just get it with a phone number and an app, so they may not necessarily have your address, but they could text you easily.", "label": 0}
{"text": "What a roller coaster micro story", "label": 0}
{"text": "I had a dog tag made at disney world that had my name, phone number, and email on it. Got a call from a random bowling alley saying they found my Keychain. I have never been to that bowling alley! My friend who i had handed my keys to earlier that week had the Keychain fall into his pocket, and subsequently fall OUT of his pocket! I didnt even know my dog tag was missing, but I was happy to get it back . 😂 reminds me that I should put it back on my keys.", "label": 0}
{"text": "Yes War amps are still active and such an awesome service.\nIn Canada, you don't even have to reach out to anyone. Just drop it to any canadapost outlet or post box and it will be mailed to the correct person without disclosing any info.", "label": 0}
{"text": "Are you sure your email can't be traced to your real name and there aren't any public records associating your name and your address (i.e. deeds)?", "label": 0}
{"text": "Whoooosh", "label": 0}
{"text": "also you can  check out Ballotpedia", "label": 0}
{"text": "I lost my wallet once. For some reason I had my DL in my pocket, so there was nothing in it with an address. The kind person who found it looked through the various cards and hand-delivered it to my car insurance agent. That was about 15 miles from where I know I lost it, so this person really went out of their way.", "label": 0}
{"text": "LPT: Got to ballotpedia.org to see sample ballots based on your address", "label": 0}
{"text": "Poes law in action here. In North Korea it's illegal to be sarcastic. In America, it's sometimes *impossible* to be sarcastic", "label": 0}
{"text": "But then how do you know that this account works if you actually don't receive any emails on it?", "label": 0}
{"text": "or maybe keep the box if you want something legally provable", "label": 0}
{"text": "Whatever vegetables are in my fridge?\n\nGuess no one's eating 😄", "label": 0}
{"text": "Why would an email account not work?", "label": 0}
{"text": "Always makes it easier to find me and murder me", "label": 0}
{"text": "Is this seriously supposed to be a life pro tip ", "label": 0}
{"text": "Forward the email to the main email.", "label": 0}
{"text": "You have high hopes that people will read that 😖", "label": 0}
{"text": "I just stuck a small engraved pet tag on my keyring.\n\nThey sell them cheap on ebay engraved with your own words..\n\nMine has  \"if found please call xxxxxxxxxx\"\n\nIts already worked once when a park security guy called me once saying my keys have been handed in.\n\nI didn't even know id lost them at this point.\n\nBloody lucky because my car key was on the bunch and we were farrrrrrr away from home.", "label": 0}
{"text": "Or use an airtag", "label": 0}
{"text": "I’ve never had a Gmail account not work. It’s also not difficult to send yourself an occasional email to test it.", "label": 0}
{"text": "This one here. I’m on iOS if that helps. https://apps.apple.com/us/app/i-am-daily-affirmations/id874656917", "label": 0}
{"text": "I was thinking the same thing!", "label": 0}
{"text": "Do not put your home address on your house key. That's how you get burgled.", "label": 0}
{"text": "Here’s the iOS link. https://apps.apple.com/us/app/i-am-daily-affirmations/id874656917", "label": 0}
{"text": "*eggg*", "label": 0}
{"text": "https://preview.redd.it/686c5ml1e6xd1.jpeg?width=1024&format=pjpg&auto=webp&s=ffbe12538c0d0c6470820eab8314d06fab70b53d", "label": 0}
{"text": "Turns into gelatinous blobs if not drunk immediately.", "label": 0}
{"text": "Deactivated due to inactivity, for example", "label": 0}
{"text": "you should usually get an email before that happens", "label": 0}
{"text": "War Amps are great.\n\nPutting contact info on keys is dodgy because somebody else now has your address and keys. On the other hand, putting the address of a close friend or relative is safe. (They need to be aware, of course.)", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "What items were cheaper to buy from manufacturer?", "label": 0}
{"text": "Does it matter?", "label": 0}
{"text": "My mom also has 20 different emails. Mostly because she'll forget the login info eventually.", "label": 0}
{"text": "Do you want to know how thin the difference between love and hate is? Set your alarm clock melody to your favorite song.", "label": 0}
{"text": "Depends on how balding and bold you are. If you have the halo, 100% full bald. If just thinning or receding you could go for a buzz, but in that case it'll grow back and you'll be fine. \n\n\nAs for the ugly head problem... it's ugly balding too", "label": 0}
{"text": "That makes it even worse lol", "label": 0}
{"text": "Depends on the costume but I just went with a full shave. If your head is weird you’re going to find out anyway so may as well rip off the band-aid!", "label": 0}
{"text": "Can confirm, I dropped my keys getting groceries once (I was with my roommate so I didn’t notice until that night), got a call from a library branch the next day saying that someone had handed in my keys and I could come pick them up. Public libraries are the best", "label": 0}
{"text": "Great. They can bid against each other. Otherwise, first money in my hand is the rule.", "label": 0}
{"text": "Go ahead and shave it. It grows back if you don't like it.", "label": 0}
{"text": "And the reality is, they will almost always never care.", "label": 0}
{"text": "I would like to add “monk tonsure at ren faire” as an additional way to go bald via costume-based event. ", "label": 0}
{"text": "Agreed! You don't need an excuse to change your appearance. Your friends probably won't care, the one's that do are more than likely not close friends anyway.", "label": 0}
{"text": "If you’re sporting a comb over your friends will be happy for you no matter what day it is if you shave it.", "label": 0}
{"text": "Tally hi mate", "label": 0}
{"text": "My last two cars the first thing I did was get copies of the keys made. I have ADHD so this has saved my ass a BUNCH of times.", "label": 0}
{"text": "i did this... i wore a bane mask at work a few years ago", "label": 0}
{"text": "Smart!", "label": 0}
{"text": "In a rush? They’ll also send a fake gorilla to rip your hair off in one clean go!", "label": 0}
{"text": "Cut all of my hair during the initial COVID outbreak, and I actually enjoyed it", "label": 0}
{"text": "It's easy to say, \"you shouldn't care what others think.\" But reality is quite different for a lot of people. If a tip like this gives you the confidence to shave your head, go for it. It's all about what makes you comfortable in your own skin. ", "label": 0}
{"text": "What if I need to be bald right now? Does Wilson’s offer any expedited or gorilla-based systems?", "label": 0}
{"text": "And once you're bald, Halloween is a great day to pretend you have hair again.", "label": 0}
{"text": "Nah, it's normal to be self-conscious", "label": 0}
{"text": "Whilst I am lucky and at 60 still maintain a healthy head of hair if I want to grow it, have been shaving my head for over 25 years. I believe that never worry about what other people think, that's their problem not yours. One thing I do believe is with a comb over it does tend to project a desperate attempt to stay the inevitable. Better to just accept it, shave it, people can be cruel.", "label": 0}
{"text": "Those who matter don't mind. Those who mind don't matter.", "label": 0}
{"text": "Why not put your phone number? Most folks don't have access to data that would map personal phone numbers to a person.", "label": 0}
{"text": "I'm Gen X and female. Guys I've known who shaved their heads would suddenly look younger to me, not older. If you are on the fence, go for it!", "label": 0}
{"text": "Just do it without the excuses.\n\nDont worry about what people think.", "label": 0}
{"text": "I've got friends of multiple genders who shave their heads, for various reasons, but if I see a guy suddenly shave his head I'm going to think that most likely he chose to do it to hide that he's graying or going bald. \n\n\nAnd ya know what?  I don't really care.  You do you.", "label": 0}
{"text": "This also works with growing facial hair at the same time.\n\nIf it turns out patchy you can just shave it off", "label": 0}
{"text": "Just make sure you do something where the person that found your keys can’t use it to find your address and let themselves in to your house. \n\nFor this, I encourage the use of electronic door locks instead of keys.", "label": 0}
{"text": "Thank you, woman in the audience, for asking the real question.", "label": 0}
{"text": "People that only read the headlines…", "label": 0}
{"text": "I searched my cell phone number on Google. Zero results. I tried some of my family members. Zero results. So I am gonna go ahead and agree to disagree here.", "label": 0}
{"text": "It’s a good idea but i also loved the feeling of shocking friends and family after shaving my head personally. The reactions can be really interesting.", "label": 0}
{"text": "Yes sir! If we extrapolate though on the issue at hand, it's a real good problem to have. Something that naturally occurs and isn't killing you, only the stress you cause in your bald head thinking that it matters.\n\n<3", "label": 0}
{"text": "What if I'm a woman", "label": 0}
{"text": "It's probably also a good chance to see if you look good with a shaved head.", "label": 0}
{"text": "Life Pro Tip?!?!\nWTF", "label": 0}
{"text": "That wasnt the message of this lpt", "label": 0}
{"text": "> And never post something for free on Facebook. Make it $5 or something and then just let the person who shows up have it for free.\n\nI did this once, but it wasn't a $5 item, it was a $50 item. Was a new baby stroller, still boxed. The mom and family drove an hour to get to me. Their vehicle looked beat up. Something came over me and I told them to just take it. I didn't need the money, I was just clearing out some clutter for beer money. It looked like they NEEDED the stroller though.\n\nThat was my good deed for the year.", "label": 0}
{"text": "Nope, no Crapple. Droid.", "label": 0}
{"text": "I searched mine, and got nothing, but after putting quote around the phone number it had lots of hits with names and addresses.", "label": 0}
{"text": "Dude the best thing I ever did was start shaving my head. Leave that thinning mess behind boiz. You can always grow a beard.", "label": 0}
{"text": "My friends were all hinting I should shave my head when my baldness got really noticeable. I was oblivious to this fact as I thought my comb forward was working.\n\nThey were solid friends.", "label": 0}
{"text": "My mom puts her address and phone number on luggage. I just use my email. Don't get robbed on vacation.", "label": 0}
{"text": "After the new(ish) MadMax movies some guys shaved their heads to be war boys!! Everyone was so impressed by the commitment. Wonder if they were trying this too!", "label": 0}
{"text": "-Theodore Seuss Geisel", "label": 0}
{"text": "Tobias Bluth. Have some fun just shaving the top for Halloween. Grow out a grotesque (awesome) moustache. Then shave everything Nov 1. And I do mean *everything*.", "label": 0}
{"text": "The real LPT is simply not going bald", "label": 0}
{"text": "I couldn't say it better myself", "label": 0}
{"text": "Maybe varies by what state (or country) you live in. Mine has my current address as the top hit. Further down is my last address, another has my parents address and one even has my college address. \n\nI’m in Florida and need to track people down at work occasionally and I’ve never had to hire an investigator for it or pay for a service. Google has always been enough because so much of our info is public.", "label": 0}
{"text": "I did it during the pandemic when everyone was doing self haircuts. I just said mine went wrong. Haven’t looked back.", "label": 0}
{"text": "I worked for a couple different grocery store chains. Whenever this happened, we would not release the info to the person who found the keys. Usually we would call the key owner and give them the phone number to the key finder and let them decide what info to give out.", "label": 0}
{"text": "Thanks, this is the LPT I just needed. Thanks, truly.", "label": 0}
{"text": "Having thinning/receding hair can actually be an indicator of having high testosterone, as well as the fact that being comfortable with how you look is a very attractive quality", "label": 0}
{"text": "I did this to shave my beard after 7 years and never went back, lol", "label": 0}
{"text": "I actually shaved my head this week. I'm 42F and had started Rogain, but it was difficult to get the foam to my scalp with the hair I did have (yes I know there is a pill but there's a concern with side effects with my health issues). So I just shaved it. Fuck it. It's just hair. It will grow back....or it won't, but at least I'm giving it a fighting chance.\n\nMy husband said we should go as the Blue Man Group for Halloween lol (he is bald).", "label": 0}
{"text": "I started recently growing out my beard, which is a really nice brassy copper colour, and much more impressive than my receding hair. I shaved my head down with a #1 guide and really enjoy the striking contrast", "label": 0}
{"text": "just drunkenly shaved my head last night 🙌", "label": 0}
{"text": "-Michael Scott", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "I know this is super old but I ended up here somehow and I’m curious. Does this lead to B9 / B12 deficiencies? Because I keep finding out I have those but my doctors never look into it further they just give me supplements till my levels recover then take me off tjem once they’ve normalised, and repeat", "label": 0}
{"text": "👏", "label": 0}
{"text": "They will definitely tease you (especially if you’re younger like 18-35, but once you get past that, but it’s all in good fun. Best decision I ever made!", "label": 0}
{"text": "My friends that embraced the baldness look so much better than when they tried to hold on to what they had left.", "label": 0}
{"text": "![gif](giphy|k5lj4s1qxaSyI)", "label": 0}
{"text": "The real pro tip is using this as an excuse to push through insecurities so you can realize it's not a big deal and maybe you even like the outcome. Change is scary, and an excuse to try something new is a welcome one for many people", "label": 0}
{"text": "so who is out there competing with unicef? mmm quick how do i make it so more people are malnurish? /s", "label": 0}
{"text": "One of the dumber reasons to buy something", "label": 0}
{"text": "So instead of paying with PayPal I should use CashApp or Venmo?\n\n\nSeriously, that commercial is why I started using an adblocker on my TV.", "label": 0}
{"text": "What do I do when this LPT annoys me? Just no, it's bad.", "label": 0}
{"text": "Conversely, I grew my hair long and went through the awkward phase during Covid. Just said I couldn’t find a barber that was open", "label": 0}
{"text": "Well shit, didn't like that Bentley add. Just gonna go buy a maserati out of spite", "label": 0}
{"text": "I'm the opposite. I had buzzed hair and then haven't cut it since the pandemic.", "label": 0}
{"text": "Google around for a competitor's bad LPT", "label": 0}
{"text": "I probably need to soon. Not saying I would have already for sure but a bad scar on the back left corner of my head (from 2018 ) is y making it easy", "label": 0}
{"text": "psst, you guys talking about Gelutol?", "label": 0}
{"text": "Nein", "label": 0}
{"text": "This sub is so full of stupid ass posts. ", "label": 0}
{"text": "Yeah if being weird is wrong, then I don’t want to eat dog treats for breakfast anymore.", "label": 0}
{"text": "While I hope this is a joke, to those who are taking it seriously...no one gives a FUCK about the state of your head. Embrace your insignificance and be free.", "label": 0}
{"text": "I guess this works if you care and want to avoid it, I just up and shaved my head one day when it was thinning enough and told people that's why.\n\nOwn the bald head!", "label": 0}
{"text": "You set a rule to forward emails to your main email account.", "label": 0}
{"text": "Lactose and sugar", "label": 0}
{"text": "I know you were being funny- but for those who aren’t aware…. Fun fact, lice don’t care if you’re clean or dirty. Your personal hygiene no matter how fastidious won’t stop you from catching a case if there’s a little louse family searching for a new home :)\n\nI haven’t personally had them in over 30 years. But I remember my mother being DISTRAUGHT because she thought everyone would think she was a terrible mother when the nurse called her to pick me up from school one day. \n\nWhat she didn’t realize is basically the whole damn grade had them. I vividly remember the nurse calling us all in to her office, and TWO kids went back to class. The rest of us sat in the music room, waiting for our parents to come get us. Everyone’s mother got the same call, they were all just to embarrassed to share the distressing and shameful news 😂\n\nNow, my kids’ school doesn’t even check, let alone send kids home. They send out a “reminder” maybe every other year saying there’s been an outbreak and to please take a look at your kids noggin and treat if necessary.", "label": 0}
{"text": "Or you can do a samurai cut", "label": 0}
{"text": "Yes, a cheap 3D printed keychain with your cellphone # on it.", "label": 0}
{"text": "Oh yeah! Now that I’m used to the shaved head I love it! The facial hair has been essential to balancing it out. But I keep seeing older pictures of me (even just a year ago) and thinking man I look way better with the bald cut than I did with the receding hair. \n\nIt did help to have a wife who helped me know it was time after years of prepping her to speak up gently when she knew it. ", "label": 0}
{"text": "Lifeprotip, if you’re balding just shave it off you’ll look better that way", "label": 0}
{"text": "Kroger sent me a set of keys plus my membership card attached to them. No call, just a small package addressed to me. They were not my keys but it was a card linked to me. No idea whos they were but I still have the cool frog keychain ", "label": 0}
{"text": "If you’re gonna add something to your keychain for the purpose of them being easier to get back if lost, isn’t either adding a tag with something like phone number or adress more on point than a library card? :D and theres also tags that are trackable so you can find it yourself", "label": 0}
{"text": "Lifeprotip, if you’re balding just shave it off you’ll look better that way", "label": 0}
{"text": "To add to this, make sure to set it to forward to your primary email so you get the notification", "label": 0}
{"text": "It's a perfectly common hairstyle, why would it bear expressing concern about", "label": 0}
{"text": "Those whispering ads are awful i think. Not relaxing to listen too. I can’t even recall what they are selling.", "label": 0}
{"text": "that buys you a 24 hour excuse at best", "label": 0}
{"text": "I searched \"\\[my number\\]\" and got 2 people I have never heard of. Probably those who have had my number before me.", "label": 0}
{"text": "I'm feeling self-conscious of being self-conscious", "label": 0}
{"text": "Doubt anybody was fooled. Likely wondered what took you so long.", "label": 0}
{"text": "I'd rather have no friends than shitty ones.", "label": 0}
{"text": "That’s what she said.", "label": 0}
{"text": "Maybe an underlying psychological break concern? Britney 2008 (?) vibes. But, I was mostly joking, it’d depend on the specific situation yada yada. Like if my buddy was already balding and did it I wouldn’t care/say nothing etc etc", "label": 0}
{"text": "Tough feedback loop.", "label": 0}
{"text": "NO.  No need to be shamed of your body or hair. Own it. Bald or thinning, you do you. No need to lie. Be happy in your own body. Fuck anyone who tells you otherwise.", "label": 0}
{"text": "Once you shave it, it is a choice and not a circumstance. Take control and join the millions (billions?!) of beautiful baldies!", "label": 0}
{"text": "Scrambled eggs and toast before don’t give a dang chili toss. Can always keep chili seasoning packs on hand and canned tomatoes and tomato sauce. Ground beef say a pound in freezer. Pinto beans or kidney beans in pantry. Follow directions a bit on package. I use more tomato base than called for with some water. And only use Luck’s Pinto Beans because I like the softer bean, plus Luck’s beans is gravied starchy so no draining. Can always have already browned ground beef to grab out of freezer. If your friends enjoy chili crap toss then they don’t eat home cooking much or really good food. That is a toss together meal better suited to feed yourself. Those canned of chili might pass on hot dogs. Not for me, but many might like it.", "label": 0}
{"text": "For a small extra fee they’ll send the Harlem Globetrotters and no one will even notice the gorilla!", "label": 0}
{"text": "Some people struggle having this type of attitude. Not everyone can flip a switch and suddenly just not care what others think. Social anxiety is a real thing.", "label": 0}
{"text": "Lol. I hold to they don’t get good home cooking so don’t know better. Years ago my late sister thought a steak at a well known restaurant was the best, i thought it was the worst and Hannibal L might have been better suited for…and my sister hardly cooked so to me that explained that. Even my daughter agreed with me about that place steaks.", "label": 0}
{"text": "Or just shave your head and call it a day.\n\nI had locs at the beginning of the year going just past my shoulder blades. I've noticed my hair had been thinning for the last 2yrs. Decided to shave my shit and aside from it being way more maintenance I've loved it.", "label": 0}
{"text": "everybody knows that you are paranoid", "label": 0}
{"text": "That could apply to literally any hairstyle they haven't had before", "label": 0}
{"text": "Fair enough, tone doesn't carry on the Internet etc \n\nThough you have another guy acting like not asking about a shaved head means you don't give a shit about your friend so clearly there's a few people who seriously think it's a major deal lmao", "label": 0}
{"text": "Don’t flash the lights at people it’s petty", "label": 0}
{"text": "I came here to say this. I haven't waited until Election Day to vote in decades. Being able to research each race at your leisure in the comfort of your own home is golden.", "label": 0}
{"text": "The additional bonus is your costume will seem all the more impressive because people think you went all-out.", "label": 0}
{"text": "See, takes focus away from the baldness", "label": 0}
{"text": "My parents had a little tag that said \"If lost drop in any US post box\" and there was some program where the postal service would get them back to the right people. I have no idea if you had to sign up or how they found the right people since there wasn't a bar code or anything, but it was a thing.", "label": 0}
{"text": "Let me make sure I get this, the race was between Person A and Person B. It was a tight race which required several recounts. \n\nYou wrote in Person C. \n\nThe teams of person A and person B contested your write in vote and got it thrown out. \n\nTwo questions if the above understanding is correct. \n\n1. How is it legal for them to contest your vote and toss it?\n\n2. How did that help them since it was not a vote for them before, or after?", "label": 0}
{"text": "I just watched a video of a semi smashing 3 cars like they were bread. No. Get out of your car and run off the road", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Yep. Grinandbearit is apparently pretty triggered by “you can anonymously research candidate policy and vote accordingly”", "label": 0}
{"text": "Just get cancer instead. That's what I did.", "label": 0}
{"text": "Yep! We got ours in the mail a couple weeks ago, but can be found online as well.", "label": 0}
{"text": "for Pizza hut in the mobile app if you type in deal or DEAL or Deal in the coupon part at the end it will take 30 percent off so awesome I do that 7 dollar menu thing and get 2 pizzas buy one with the original crust so it's a dollar more and it comes out to like 11 bucks", "label": 0}
{"text": "For women too..?\n  I’d love to shave my head. Not sure the reaction would be the same…", "label": 0}
{"text": "You're probably not getting enough fiber in your diet.", "label": 0}
{"text": "Absolutely. Always exercise your right to vote.", "label": 0}
{"text": "Another clarification: This info just tells someone who you are *registered* under. The only time it matters what you’re registered under is for Closed Primaries, where each party votes for the nominee. If you’re registered as D, you can’t vote in a R primary, for example. \n\nBut on November 6, you can vote for whoever you want and no one will know unless you tell them. \n\n(Sorry to hijack your comment, but I didn’t want people to get confused. I consider myself pretty informed, but voting still confuses me at times.)", "label": 0}
{"text": "Real LPT: If you want to shave your head just do it, because you're an adult, because you shouldn't need a costume holiday so it's easier on your family and friends, so just do it.", "label": 0}
{"text": "Thank you.", "label": 0}
{"text": "Man, if you hadn't pointed that out, I wouldn't have known.", "label": 0}
{"text": "Subtext exists.  \n\nhttps://www.businessinsider.com/harris-beyonce-abortion-reproductive-rights-trump-allred-2024-10", "label": 0}
{"text": "I've been doing bald+ beard since the late nineties.  I decided to let it grow back around 2006 but I had become balding without realizing it.", "label": 0}
{"text": "And if people think you're weird for leaving the comb over and it's embarrassing it's time to stop caring what other people think. Like I'm balding. Very clearly balding. I've got an island on top, and the deepest widows peak ya ever saw. I got over it a long time ago, and you know some people don't look all that much better bald in contrast. Larry David and celebrities like him with similar hairstyles look fine.", "label": 0}
{"text": "*cuntrie", "label": 0}
{"text": "Someone who supports that scrappy little party founded by saskatchewinian legend Tommy Douglass. Someone who supports the New Democratic party... NDP forever", "label": 0}
{"text": "Thick curly hair is a nightmare to maintain, especially at longer lengths.", "label": 0}
{"text": "There literally is a social media campaign to do exactly what OP is doing. That's what my first link is about. \n\nThere are already too many arguments on the internet where one person understands subtext and the other says subtext could not possibly exist.", "label": 0}
{"text": "I don’t remember writing this post but it’s exactly what I did. Mr clean", "label": 0}
{"text": "I had 2 weeks off from work and used that time to shave my head to see if I could commit.\n\nNot going to lie, it did feel incredibly uncomfortable but it was the most freeing \"weight off my chest\" moment I've ever had. \n\nNever gone back.", "label": 0}
{"text": "write your address on the keys ", "label": 0}
{"text": "get over it", "label": 0}
{"text": "Yeah, did this with a bunch of our baby stuff. Especially all the stuff we were gifted. Random acts of kindness made me feel so good, and the recipients certainly seemed to appreciate it.", "label": 0}
{"text": "You can use subtext to completely skew a message to your views all you want, but words have meaning.", "label": 0}
{"text": "I measure out the water by filling the bottle first then pour it into a pot. Bring it to a soft boil with about 2-3 tablespoons of the citric acid in it and then take it off the heat and let it cool down enough to funnel it back into the spray bottle.", "label": 0}
{"text": "The real life pro tip is to not care what others think. I decided to shave my head because my hairline was receeding, and when anyone asked I would say \"I shaved my head because my hairline was receeding and I didn't like how it looked.\"", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "R/bald will appreciate this post", "label": 0}
{"text": "I'm right there with you. Started balding at 16, can't grow a beard, mustache or any facial hair really. Unfortunately, it's not that absolutely nothing comes in, it's that it's incredibly splotchy and thin.\n\nI currently shave my head down to a #2, but I've always wanted to try just going full razor, I'm just afraid it won't look good, and I don't know how much of what I do have on the top is just waiting to fall out, and what will grow back.", "label": 0}
{"text": "Your post or comment was removed as it was determined to be in violation of our [rules and regulations](https://www.reddit.com/r/LifeProTips/about/rules/). Please familiarise yourself with them to avoid future punitive actions applied to your contributions to the subreddit.\n\n***\n\n- **Rule 5**: Do not post tips that are based on spurious, unsubstantiated, or anecdotal claims.\n\n***\n\n_If you are in disagreement with this decision, you may wish to [contact the moderators](https://www.reddit.com/message/compose?to=/r/lifeprotips)._", "label": 0}
{"text": "Just shave your head. No one ever gives a shit and usually are like oh you finally did that? You don't need an excuse.", "label": 0}
{"text": "Someone's never been invited to a Ren Fest party...", "label": 0}
{"text": ">Someone tell me the downside; besides summer when there’s nothing to stop the sweat from pouring.\n\nNot the sweat, the sunburn.", "label": 0}
{"text": "for real.  Its all just a cover to intensive communal meth usage", "label": 0}
{"text": "Just shave it for cancer awareness. The surprise and getting people to ask about it means news spreads decently fast, and people will think better of you for supporting cancer awareness.", "label": 0}
{"text": "Shaving is a hell of a hassle (unless you're using an electric I guess) and in a day or two you're back at buzzed-with-no-guard anyway. Plus, a *shaved* head is weird, it feels like your forehead everywhere. With a buzz it's stubbly which is a lot more familiar.", "label": 0}
{"text": "Any tips for actually going about shaving your head? I’m thinning on my crown (I’m only 27), and debating on just going with the bald head and beard combo.", "label": 0}
{"text": "it'll come with time. my beard was thin and ratty even at 21 but i just kept letting it grow and kept it trimmed and it's filled out on its own throughout my 20s.\n\nof course depending on genes and whatnot, it might not, but it doesn't hurt to try every few years. I always used no-shave November as an excuse to look really scuzzy for a month to allow it to come in.", "label": 0}
{"text": "Or live in a vote-by-mail state that will also send you an informational pamphlet that tells you what’s going on with any ballot measures.", "label": 0}
{"text": "LPT: If you're balding, just shave period", "label": 0}
{"text": "If you want to do it outside of Halloween, you can say you support a friend or family member battling cancer.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Since when did social acceptance NOT hinge on appearance?", "label": 0}
{"text": "Did you guys not have a conversation about what each other were into to first? You can't just start with tub-girl, you gotta ease into that shit.", "label": 0}
{"text": "Good idea", "label": 0}
{"text": "I felt the same way man. hairline started moving back at 19 and I still couldn't grow a good beard yet. Just sat on my shitty hair looking like someone took a weed whacker to it. Even if I didn't have the beard, I'd be happy being clean-shaved instead of trying to hold onto my hair.\n\nEvery now and then, I'll look at someone's hair who's many years older than me and be jealous, but I can't do anything about it so I've made peace with it.", "label": 0}
{"text": "He would have walked 500 more", "label": 0}
{"text": "December?! When/if I do it I'm waiting for like June lol.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Did a similar thing with no beard one year. I'm already bald and round so I shaved off the beard and went as Charlie Brown. I looked ridiculous and haven't shaved it off again.\n\nAnd trust me, bald is awesome. Been bald since I was 19 and have never regretted it.", "label": 0}
{"text": "Really? This is an old comment but there are tons of studies on turmeric’s anti inflammatory properties as well as its benefits for the liver. Here’s just one of many: https://pubmed.ncbi.nlm.nih.gov/37918958/#:~:text=Findings%20of%2011%20meta%2Danalyses,0.119)%2C%20p%20%3D%200.128)", "label": 0}
{"text": "Man, and like also, just shave it if you want to because you don't need anyone's permission, they should absolutely be supportive, and if they're not stop talking to them because they're not your friends. Your friends have zero say about the hair on your head.", "label": 0}
{"text": "Ok, so I LARP regularly and holy shit-pickles, I've seen two elves doing lines of coke in a national park restroom, I've seen an entire platoon of dwarven archers flash their tits at a dragon, I've seen a wizard selling MDMA out of the trunk of a Toyota\n\nAt one event there was a dedicated group of paramedics dressed as clerics making sure nobody got too drunk, passed out in the woods, and died of heat stroke\n\nAnyone who dunks on LARP has no idea that LARPers are mostly freaky eccentrics with too much money, too much free time, and *very* few inhibitions", "label": 0}
{"text": "In my country, you can have this service through the War Amps.  You simply register with them and they send you a key tag.  You put the key tag on your keychain/keyring.  If you ever lose your keys and someone finds it, they mail the keys to the War Amps, who then mail the keys to you.", "label": 0}
{"text": "Fuck that noise. Be confident in who you are and your decisions.", "label": 0}
{"text": "I went as an Airbender one year, haven't gone more than 4 days without shaving my head since. Got a lot of compliments on it.", "label": 0}
{"text": "yeah. and fyi just so you know, stress is extremely bad for your health.", "label": 0}
{"text": "😂 the only drawback was it took a while before my scalp was the same color as my face. ", "label": 0}
{"text": "Especially if you have a themed label for it! Tailor the name to the age group\n\n* Caramel corn: creepy corn\n* Takis: witch fingernails\n* Popcorn chicken: zombie nuggets", "label": 0}
{"text": "I used the trimmers I had on hand and just cut it as short as I could to start. I did get some help making sure I didn’t miss anything the first couple times. Then I invested in an electric shaver for the scalp after some research. \n\nThe thing that surprised me most was how often you have to shave it to keep it easy to cut. I’m probably shaving every other day or two max. If it gets past that it becomes a slower process for sure. ", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Was there a knuckle in there?", "label": 0}
{"text": "Yes, the words in my citations have meaning.\nRead them.", "label": 0}
{"text": "You've never seen examples of men being made fun of for being bald? In any media? Really?", "label": 0}
{"text": "Brilliant names. I feel like I missed out by not adding a label.", "label": 0}
{"text": "They harvest 2 from each zombie, along with one zombie tendie.", "label": 0}
{"text": "Xroomer take here...how does one lose their keys?  I can feel those 8 evil pokers when I move two steps. \n\nWallet or check book I get but keys...damn I'm old I guess.  \n\nP.S.  Thought B2F2's thump prints were going to be all the rage...lol", "label": 0}
{"text": "Who still has seldom used blazers these days?", "label": 0}
{"text": "This is a good LPT.  It's also worth mentioning that if you notice your hair thinning to the point you're thinking of shaving it, literally everyone else has also noticed.  Nothing wrong with it, shave it on Halloween, tomorrow, or later, and if people ask just tell then you're trying something new.", "label": 0}
{"text": "There's a tipping point.", "label": 0}
{"text": "Man I don’t wanna look like Joe Rogan or whatever alpha male influencer \n\nThey’ve kinda taken over the bald look for me", "label": 0}
{"text": "And as a friend I would give attention to all drastic hairstyle changes my friend makes. This is very typical behavior between friends.", "label": 0}
{"text": "It makes sense it takes the liability of something happening to or with the keys away from the store while still maintaining the owners privacy and security by keeping the keys out of the person who knows the address and giving them to the initial finder who only has the responsibility of holding them till they get called", "label": 0}
{"text": "It’s usually not your friends’ opinions that are the issue. Most people are self-conscious about something that no one else cares about.", "label": 0}
{"text": "You just switch the wigs more often", "label": 0}
{"text": "Man it really sucks that wigs only come in “$10 plastic garbage” and “$1000+ nice wigs”.  \n\nI kinda want to experiment with wigs, but the cheap ones are so disappointing and the nice ones are out of my budget for something I might not end up liking.  I wish there was more in the “$100 and looks pretty good” range.", "label": 0}
{"text": "You don't need a stupid excuse.  Comb overs fool no one.  Do yourself a favour and cut that shit off.  They are a beacon for insecurity, and make you look even older than a bald head.", "label": 0}
{"text": "Had two uncles growing up with baldness…. Uncle bob the combover and uncle arfa the shaver.  As a kid I always looked at arfa and went if that happens to me I’m going with arfas look. \n\nIt did/ I did. \n\n\nNever looked back", "label": 0}
{"text": "Yeah, I'm the same as the guy above. Thick curls that look great when it's long and has been pampered straight out of the shower and never touched anything including hands, driving wind, or the rest of my hair if I shake my head too hard. Otherwise it's a mess.", "label": 0}
{"text": "what about candy canes", "label": 0}
{"text": "\"... but while we have you, are you interested in signing up for service on your new pre-owned iphone?\"", "label": 0}
{"text": "I had a friend who wanted to transition from wearing a hijab to not anymore and this is exactly what she did. On Halloween she showed up to school without her hijab and wearing a costume and then never wore it again.", "label": 0}
{"text": "Keep looking! I found a deal on one a few years ago under $150 on sale and it was fantastic. There are also (if you have the time/interest) great tutorials on how to make cheaper wigs look pretty good.", "label": 0}
{"text": "Hats. Or lots of sunscreen. If you don’t shave you have to thread sunblock in there because your scalp will burn. But a good hat while outside works wonders. Plus no hat hair. I like a flat cap/newsboy type hat myself.", "label": 0}
{"text": "Find him a hat he likes. Problem solved.\n\nIf you’re thinning, sunburn is already a problem because there’s not enough hair to protect a scalp, and you have to thread in sunscreen and get greasy hair, or wear a hat and get hat hair. Shaved, there is no hat hair.", "label": 0}
{"text": "No one wants to be bald", "label": 0}
{"text": "Been male pattern balding starting at 19, really ramped up after college. Paying for haircuts was the main reason. I didn't really care about my hair in general. Although I did progressively go with shorter guides until I finally did straight razor buzz with no guides keeping length.\n\n\nIt's just so much easier shaving it back down before I have to worry how much of the balding the grown out hair is emphasizing.", "label": 0}
{"text": "Ehh, two months after Inauguration day. Probably not a meaningful distance of time.", "label": 0}
{"text": "You’re a good dude. This warmed my heart", "label": 0}
{"text": "I did that once for Halloween, but I was going through chemo and losing my hair anyways and did not feel like going out while I was puking up saltine crackers.", "label": 0}
{"text": "I know if I shaved my head randomly despite expressing a desire to for years, it'll throw a lot of people off. if I'm shaving my head I'm not doing it near Christmas for example. I would much rather shave it during spring months where family gatherings are far and few.", "label": 0}
{"text": "Ngl, this video pushed me to take the leap:\nhttps://youtu.be/I9GFwkb-bTI?si=9BTa3ytXrmF_97bZ\nIt’s a short from The NBA Storyteller about Clyde Drexler vs. Michael Jordan. Very funny, worth a few minutes", "label": 0}
{"text": "I did Mr Clean way back when for a retail store costume party and contest. I was looking for ideas and my brother suggested I try a new hair style.\n\nThe judges were all make store department managers, so I came in 2nd place to the sexy police ladies checking door receipts.", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Don't let it be awkward. \"Yep, I was going bald so decided to try this out.  It saves me money on worthless haircuts.\".", "label": 0}
{"text": "So I’m the only one to make a new email every time I want to use the 30 day trial?", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "I have had multiple times in the past where keys have been lost, and then they were received in the mail about a month later when they were turned in to the local store", "label": 0}
{"text": "But don’t order too much because Deli meat will kill you.", "label": 0}
{"text": "My brother got his head shaved on stage at an Aesop Rock concert. Then he kept it up to be Walter White for Halloween. He stuck with it and stopped fussing over his thinning hair and just rocks the shaved head. It honestly did push the transition.", "label": 0}
{"text": "yep, so i dated someone who was pretending to be the ear of my ex and me. just to get in the middle of me and my ex. \n\n  \nwhen i caught wind, and i realized the mistake i made. i broke the relationship off. \n\n  \nadmited fault. accept my life's consequence of not being with my ex. because simply a guy wanted what the other guy had (me). \n\nyou live and you learn. i accept that people are not perfect and that people make mistakes, sooo, i think. you just accept that you made the mistake. move on. if no one forgives you OH well. its life. \n\nwe all live with ourselves and morales and what we fuck up on.", "label": 0}
{"text": "Zombie anything can be Halloween themed . Zombie fries, zombie pizza, zombie nachos ", "label": 0}
{"text": "I went into puberty late and cant grow a beard at 34.  Virtually zero body hair outside my scalp. \n\nI look more like *Powder* with each passing day.", "label": 0}
{"text": "Shaved my beard for the first time in like 13 years...  nobody gave a... shit except my wife.  Lol.", "label": 0}
{"text": "Did you try “(xxx) xxx-xxxx” format? I tried “xxxxxxxxxx” first with no results but the formatting gave several accurate results.", "label": 0}
{"text": "Germaphobes: Grabs flamethrower. Then dissolves flamethrower in acid after use.", "label": 0}
{"text": "Just put a period in between characters in your email. You'll still get the email but a lot of systems will see it as a new sign up for trials.", "label": 0}
{"text": "OMG I did exactly the same! I went as uncle Fester. I was around 25 years old and balding since 19. It was so great to get rid of the cap that way.", "label": 0}
{"text": "Inexpensive vodka is less expensive than isopropyl alcohol and is used as a cleaner in winemaking to prevent the use of chlorinated cleaners that can foster cork rot.  It's very cheap at the low end, good for cleaning, so so for drinking", "label": 0}
{"text": "For a lot of people this is a \"thanks I'm cured\" response. Social anxiety is a bitch, I'm pretty sure I have it in a minor form and can't imagine what people who genuinely suffer from it go through with decisions like that", "label": 0}
{"text": "Yep. I am a cloud security engineer.", "label": 0}
{"text": "Sunburning the top of your head, that's what made me realize I was thinning up top lol. Not a reason not to shave it though, that's where I'll end up when it gets thin enough, but definitely a downside.", "label": 0}
{"text": "Ha! I Agree with the frustration but how would another political system handle the process? :)", "label": 0}
{"text": "I can now cosplay Aang, tattoos and all!", "label": 0}
{"text": "It's all in your head, it only feels awkward to you but the others are thinking, finally! He looks much better this way and he didn't even know it.", "label": 0}
{"text": "If one of your mid-30s friends who started balding in their early 20s suddenly shaved their head one day you'd actually be more like \"huh, surprised it took this long.\"", "label": 0}
{"text": "Saw this many months back. While this hasn't helped me sleep, this has helped me greatly as a grounding technique for anxiety and invasive thoughts. Thanks for sharing!", "label": 0}
{"text": "If your friends tease you for going bald you need new friends ", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Fuck your bucket of “Spooky baby carrots and creepy boxes of raisins”", "label": 0}
{"text": "Shave it on a friday night. It will have grown slightly by monday and will grow back at number 2 after a week or so", "label": 0}
{"text": "ITT: Bald heads and flat caps match made in skincontact heaven.", "label": 0}
{"text": "As an alternative, join a local St. Baldrick’s shave-a-thon for cancer research. Worst case scenario you shaved your head to raise money for charity.", "label": 0}
{"text": "very tangentially related, I’ve had colorful streaks in my hair on and off for years, but one year people kept asking me nonstop if I did them for Halloween. Drove me nuts haha ￼", "label": 0}
{"text": "The best advice.  I wrote this on the paper.", "label": 0}
{"text": "Why can't you just shave your head if you want to shave your head?\n\nI don't understand the social problem that needs to be gamed here.", "label": 0}
{"text": "Damn, and here I went and got castrated so I'd never lose my hair :3", "label": 0}
{"text": "BECAUSE THAT'S HOW YOU GET CITRIC ACID FOR ANTS", "label": 0}
{"text": "Oh it's great! For folks who haven't tried it, you know how good it feels for a couple days when you get a haircut and they use the trimmer on your neckline? We get that all the time!\n\n\nThe couple of problems I have with it are that I'm more likely to get a sunburned scalp now and it do get cold in the winter. Both of which are easy to address with a hat.\n\n\nAlso, you know that feeling you got when you have to get within six feet of another human being for any reason during the covid years? I shaved my head in 2012, so I kinda... don't.", "label": 0}
{"text": "And/or “I thought I was hungry enough to eat that but clearly I was wrong. Also I don’t wanna waste a whole fucking sandwich.”", "label": 0}
{"text": "Do it as a charity thing instead. \"Brave the shave\". That way you get the shaved look you want, a charity gets a bunch of money, and you get far less negative comments since you did it \"for a good cause\".\n\nAlso, if you have long hair and you cut it off, donate it to something like Princesses Trust, who make wigs for little girls with cancer.", "label": 0}
{"text": "Kinda funny, I did exactly the opposite for “no shave November”. Now I have a beard.", "label": 0}
{"text": "Ok, shit all over. Now what?", "label": 0}
{"text": "Germanphobes: Hans! Bring mir den Flammenwerfer!", "label": 0}
{"text": "- “Would you be willing to do a trade?”\n- “Yes, with money”", "label": 0}
{"text": "It werfs flammen. IMPORTANT.", "label": 0}
{"text": "This will not produce desirable effects for anyone living in a place that has seasons lol", "label": 0}
{"text": "This is a Life Amateur Tip. The pro tip is just shaving it off because everyone’s already noticed you’re balding and trying to play it off like it was decision based purely on your Halloween costume isn’t going to work.", "label": 0}
{"text": "Goodbye, Christmas stocking.", "label": 0}
{"text": "Funny enough I’ve been doing this the past two years. People still clocked on lol. The Mace Windu fit ain’t fooling anyone.", "label": 0}
{"text": "Or, do whatever makes you feel comfortable and fuck whatever other people think.", "label": 0}
{"text": "Not sure if serious or sarcastic", "label": 0}
{"text": "Haha. Wtf? Why do you need a reason to change your hair style? What kind of weird social group are you part of where this is necessary?", "label": 0}
{"text": "Except there's no amount of trickery that's going to stop you from being socially anxious.\n\n\nThis is one of those things you just need to do. Put yourself in the situations so they feel more natural to you.\n\nSomebody asked you why you shave your head the answer is because I wanted to that's like a three second conversation", "label": 0}
{"text": "Only for Canada tho :(", "label": 0}
{"text": "> If your friends think you're weird for shaving your head then maybe you need better friends\n\nIf you're friends don't already think you're weird, then they weren't good friends.  Good friends know your quirks.", "label": 0}
{"text": "Get the donation bin out.", "label": 0}
{"text": "So your boundary of your understanding and use of the term boundary affects my use and understanding? Get back inside your boundary!", "label": 0}
{"text": ">controlling people and abusers can try to trap you in their hula hoop by using this healthy notion of “boundaries”. No one wants to be a “boundary breaker!” So it puts you in the position of complying with the request (not talking to other men) because what would your partner’s therapist think if you were breaking their “boundaries”!\n\nSo how do you make those people realize that theyre doing boundaries wrong? Likely intentionally", "label": 0}
{"text": "Literally.", "label": 0}
{"text": "Also be jacked and good looking.", "label": 0}
{"text": "Yeah, tried that with the custory sergeant, I really did", "label": 0}
{"text": "I shaved my head for charity once, full head of hair.\n\nDo something similar?", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Step one: cut a hole in the bucket", "label": 0}
{"text": "How is this shit a pro tip?", "label": 0}
{"text": "This is such a good way of explaining it, thank you!", "label": 0}
{"text": "People can move without the government telling them to", "label": 0}
{"text": "I liked the shaved feeling, but it was way too much work. Normal haircuts are ~2-3 weeks apart but shaving was every three days.", "label": 0}
{"text": "Boundaries are about communication your actions, not about controlling the other person. \n\nAn easy way to remember it: it’s not “don’t do A”, it’s “if you do A, I will have to do B”. \n\nFor example: instead of “you raising you voice when we argue at me is not okay” say “if you raise your voice at me I will have to leave the room and pauze this conversation”.", "label": 0}
{"text": "How about call them standards when it relates to other people's behavior?", "label": 0}
{"text": "Use coupon code CHEMO at checkout", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Don’t invite people over!", "label": 0}
{"text": "If you really live like this, then maybe having guests at home is not for you.", "label": 0}
{"text": "Tell them there’s a 2-3 weeks training process just to be their assistant.", "label": 0}
{"text": "I have a system and routine while doing things in my home. Somebody helping me in the kitchen usually ends up having to think for them as well 😅", "label": 0}
{"text": "Headbands looks a lot weirder on my bald head for some reason.  Like an elastic band around a thumb.", "label": 0}
{"text": "You can ask in a way that doesnt need to imply there is anything wrong. You can also choose a better way to ask it as well. If I saw a friend have the same haircut just shorter I'd ask if they got a haircut. Let alone a drastic change of hairstyle.", "label": 0}
{"text": "I use Halloween as an excuse to bleach my hair every few years. My wife absolutely hates it. ", "label": 0}
{"text": "i started going bald when i was 19 and always wore the hat to conceal it. my biggest problem was showing up somewhere and being bald. i finally shaved my head at 23 and its way better. this sounds like a great method though!", "label": 0}
{"text": "The keys  themselves were about £70, which I  have copies of,  but the remote fob about £350 and it's that which didn't survive the wash.", "label": 0}
{"text": "I put my old dogs name tag on my keychain. It has my phone number on it.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Honestly this annoys me so much. Guests just start clearing the table despite me telling them to sit tf down 5 times already.\n\nAs much as they think they’re being grateful and helpful I find it kind of rude", "label": 0}
{"text": "Me when I show up to the function with a trick or treat bucket full of cucumber salad", "label": 0}
{"text": "I’m going as Anthony Fantano. I’ve been shaving my head for years, I wear glasses, own a flannel shirt, and I like music.", "label": 0}
{"text": "If this happens often, part of the issue may be that your guests aren’t really sure what to do after the meal and don’t want to stand around awkwardly while you clean. \n\nIf you are inviting people who may want to help clean, set the area up in a way that will make sense to them. Have a spot in the counter you can ask them to leave dirty dishes and put a clean brush or sponge next to the sink.  You could also give them instructions if they ask to help instead of just saying no. “Could you leave your dishes here for me then would you like to make a pot of coffee/ pour drinks/ chose some music / set up for a board game”.", "label": 0}
{"text": "If you MUST help, dry the dishes. If you don't know where shit goes, put it on the counter and I'll get to it", "label": 0}
{"text": "The limit is $5000 per household.", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "i do this everywhere. keep one i my phone, hat, butt crack.", "label": 0}
{"text": "put your foot down. it’s your place right? \nbe bossy! at least a little.", "label": 0}
{"text": "my translucent case is gonna ruin this", "label": 0}
{"text": "My Dad gave me the same advice, except to hide it in my wallet. It’s saved me several times. This is a good tip.\n\nAlso, when did this sub become a competition to figure out why a tip is wrong? I mean, yes let’s be critical, but these days it feels like it’s the only goal.", "label": 0}
{"text": "i stash a $20 in a few spots.  been a life saver more than once.", "label": 0}
{"text": "Why's that? Are you talking about fast wireless charging?", "label": 0}
{"text": "Hope you doin alright playa", "label": 0}
{"text": "I keep a bankrolled stick of Aussie $2 coins up my ass for such emergencies, thanks OP", "label": 0}
{"text": "I did it when a friend was going thru chemo fighting cancer (that he beat, yay!).", "label": 0}
{"text": "One of the best lpts I've seen. Normal, practical, useful.", "label": 0}
{"text": "Aren’t the Aussie coins poisonous mate?", "label": 0}
{"text": "I'm not sure if this helps or not, but it did for me...\n\nMy mil was the same as this. No matter how many times I begged. She said \"this is just how I was brought up. You help when people invite you into their home.\"\n\nI told her, truthfully, that I was raised the opposite. That any chores can wait until guests leave because we should spend time together since we don't know when the next time will be and aren't promised tomorrow.\n\nShe still tries, but it's different now because we see it from one anothers point of view.", "label": 0}
{"text": "I admire your innovative spirit. Very resourceful, very demure.", "label": 0}
{"text": "Bout as poisonous as all the spoiders & snakes struth mate", "label": 0}
{"text": "Great advice here", "label": 0}
{"text": "This isn't a LPT, this is venting about a guest you had that didn't know how particular you are about kitchen cleanup.", "label": 0}
{"text": "This guy hosts", "label": 0}
{"text": "Agree 100%.\nThis is how I did it. In 2017, I'd had enough with my thinning hair but was afraid to let go. Took the opportunity and went as Walter White for Halloween. Only a single friend said, \"Ohh you're that guy now\"... and I just smiled. Since I had already accepted that that was who I was going to be going forward. Not just Walter White for Halloween, but bald for the rest of the time as well. Most people didn't care, I thought they did but I was wrong. \nOn the upside, I did find a girl who loved the look. That was seven years ago. We're getting married next year.", "label": 0}
{"text": "Sounds like you’ve met my mother-in-law, only she’d vocally criticise all the others who’ve actually followed the request of the host by not getting involved whilst she’s ruining the fine china.", "label": 0}
{"text": "I see you’ve met my mother-in-law", "label": 0}
{"text": "I have a scubby thing that I use to scrub the sink. I never, ever use it for dishes. At a recent book club meeting, a friend proceeded to \"wash\" all the dishes and glasses (over my protests) using this scrubber. I pointed out that i have a dishwasher, and she said \"I am channelling my aunt Susan\". I finally gave up, and put all the \"clean\" dishes in the dishwasher after she left.\n\nLast night, I had a few friends over for drinks and snacks. One of them offered to clean up and when I said \"no thank you\", she let it go. This is as it should be.", "label": 0}
{"text": "How is “I won’t let you call me bad names” not trying to control others? Im not saying you should lol\n\nIn a similar vein, isn’t it fair to say “if you go out with your friends that late, I won’t stay in this relationship”?", "label": 0}
{"text": "Can your address be googled from your phone number?", "label": 0}
{"text": "If you're thinning and not sure what to do, there are only one or two things that actually work. \n\n1) Finasteride\n\n2) Minoxidil\n\nIf you're not going to start on Finasteride, you might as well give up already. There's no point fighting for your hair if you're not using Finasteride. \n\nIf you're using Finasteride, you can supplement it with Minoxidil. \n\nIdeally, it would be best if you started Finasteride as soon as you start losing hair. It will stop the hair loss and might even regrow a little bit of what you lost. \n\nIt's just frustrating seeing posts from /r/bald sometimes, where people finally take the leap and shave their head after battling hair loss for a decade, but never actually starting on meds. It's so odd to me. \n\nIt's like having back pain for a decade but never seeing a doctor, I can not relate.", "label": 0}
{"text": "ok you save $200 in your phone case", "label": 0}
{"text": "But you said not to put the hula hoop around - aka limit/control - other people.", "label": 0}
{"text": "You can't make them comply with your hoop, but it is your choice to gk hula-hooping somewhere else :)", "label": 0}
{"text": "Idiot", "label": 0}
{"text": "Thank you for providing", "label": 0}
{"text": "This hula hoop analogy is making less and less sense :(", "label": 0}
{"text": "No I didn’t say that. I’m suggesting people stop labeling that as a “boundary” because that implies it’s impacting the emotional, physical, mental safety of the person versus impacting how they want to relate and feel connection to someone within a relationship. Does that make sense?", "label": 0}
{"text": "😃😂", "label": 0}
{"text": "Yup - I try the one year rule. I often fail still, but there are things I see that I KNOW I haven’t touched in more than one winter, for example, it has to go.", "label": 0}
{"text": "I am not trying to be disingenuous or trying to argue for no reason, I am genuinely having trouble understanding.\n\nSo your issue is specifically with calling “you stay out late, and I won’t stay in this relationship anymore” a boundary? It’s ok to say, as long as you don’t call it a boundary?", "label": 0}
{"text": "There’s several things that do not “spark joy” for me and several things that if they had poop on them I would clean because I do not have enough money to be spending on replacing items I have in my home.", "label": 0}
{"text": "Abusers ahahahahhaha", "label": 0}
{"text": "Imagine being a grown man and needing an excuse to shave your head", "label": 0}
{"text": "Sometimes there’s a flow or rhythm to the process too. Interrupting me might burn or dry out your food.", "label": 0}
{"text": "Honestly even if you can grow a beard. Bald men are the one group I hear made fun of the most in public and online. It is treated like a joke.\n\nNo wonder so many men are emotionally affected by balding. Imagine if they made similar comments about balding women with their rarer version of the condition?", "label": 0}
{"text": "This sort of misses the secondary relationship hula hoop. Which if it had at boundaries this is a first step, but the second hoop is what are the boundaries of our relationship?", "label": 0}
{"text": "For once I’m way ahead of a life pro tip lol", "label": 0}
{"text": "I have a question. A couple years ago a friend of mine stated that they needed space from me. I asked them if they wanted to talk about anything and they said no. I continued using our group chat to communicate with everyone in the group but that clearly pissed them off. They had no problem responding to other people in the group chat but got snotty with me if I did it. So I asked them again (privately, and this was months later) if they wanted to talk. They said no. So I asked the group chat to remove me from the chat. I felt uncomfortable. Like I wasn’t allowed to participate anymore. \n\nA few months after that our mutual friend invited us out to go dancing. I didn’t know they were going to be there but they were incredibly rude and stand off ish the whole time to me. It hurt. A lot. The next I texted them again ti ask if they wanted to talk. They said, “I am trying to create this boundary with you” and ever since then I’ve been confused. I mean, I told them that I’m not going to be able to consider them a friend anymore if they can’t talk to me, and that was it. \n\nThis person was actively getting a phd in social work. Do they know what they’re talking about? Are they doing it wrong? What the fuck happened? Are they going to hurt people in their capacity as a social worker? \n\nWe were friends for over 7 years.", "label": 0}
{"text": "So, by nature a boundary is about consequences. I can have the boundary of \"I don't like it when people call me names\" This is my hulahoop.\n\nA new friend believes calling names is an endearment, but I don't like it.\n\nI can't stop this person from calling me or other people names, that's true. But what I CAN do is say, \"Hey, Ive asked you not to call me names, it makes me very uncomfortable. If you can't find a different way to show me you like me we'll have to stop hanging out.\"\n\n\"Well, I think calling people names is just fine as long as I'm not doing it to be mean, and I'm not being mean to you am I?\"\nBut they are, because you've asked them to stop and they didn't. They believe they have a boundary in a relationship but really they're trying to bully their way past yours.\n\nNow I have a choice to make. I can choose to not hang out anymore or I can let that person continue to cross the boundary. I cannot control another person; my friend will continue to call me names no matter how much I protest and I know because I tried asking them to stop.\n\n(Once you start yelling, bullying, threatening, or intimidating that's when all bets are off and it's another situation entirely.)\n\nYour \"hula hoop\" is a space that takes practice to make for yourself. It's hard to put down boundaries just like it's hard to hoop, but once you practice enough it'll be much easier.\n\nHope this helps! 🤠", "label": 0}
{"text": "Here's a downside... sunburn. \n\nmy husband is not balding. But has been shaving his head for more than 10 yrs. He doesn't shave all the way to the scalp. Any way, on one beach vacation, he forgot to put sunblock . A few days later. Our then toddlers had so much fun peeling sheet of holey skin off his head", "label": 0}
{"text": "I hope that I'm up to the standard.", "label": 0}
{"text": "My mistake… i’m just dutch", "label": 0}
{"text": "Yeah, but it would also be easy to just buy a new one\n\nDepends on how much shit… like can i wipe it off with a cloth and then wash it clean or do i have to pull out gloves to even touch it?", "label": 0}
{"text": "Lol, I was raised in a culture where you had to offer to help. So I go over to someone's house and do the obligatory offer of help, but deep down inside hoping you decline my offer. \nThe reverse is true - if people come over, I'm deep down hoping everyone asks to help, so that it's less work for me. Bonus points if they're the type to take over and do everything for me. Love it!", "label": 0}
{"text": "You're welcome! I'm glad my groggy voice to text explanation made some kind of sense.", "label": 0}
{"text": "Eh.... I'm not sure I agree with this. \n\nYou can have the \"boundaries\" of an acceptable relationship. For example, there are some boundaries like \"don't spend hundreds of dollars without asking\" and \"don't have sex with other men\". These are reasonable and healthy boundaries. \n\nIt seems that what you're actually attempting to do is  find a clever way of describing how healthy boundaries should work, as opposed to abusive, controlling ones. I really think the issue is just a matter of degree.", "label": 0}
{"text": "this post is a bad way to argue about semantics.", "label": 0}
{"text": "I did this a couple years ago. Went as Dr Evil", "label": 0}
{"text": "I’ve shaved my beard off several times for this reason. Something I don’t like doing but the occasion makes it easier.", "label": 0}
{"text": "This dude is telling people to shave their head right before it gets cold outside for winter. Very very rude.", "label": 0}
{"text": "Yeah I don't really understand why so many men make it a big deal. \n\nI've had some guys tell me \"well yeah but you're HANDSOME.\" Or \"I would but I'm not in shape like you.\" If they're not just in outright denial. \n\nThey love to make all these nonsense excuses. Like, bro, everyone sees your thinning shitty hair, noone, and I mean NO ONE will think you look worse without the whispy garbage on your head. \n\nI started thinning in my mid twenties and gave it one chance to grow back normally, when it didn't, it all came off. Done and dusted.", "label": 0}
{"text": "Lmao\n\n\nYou are a professional at leaping to conclusions I guess\n\n\nThe examples you give also include 'putting a hoop around others'. Others are not allowed to hit you. So if I usually hit people, you put your hoop around me\n\n\nThere is an issue with people using 'therapy speak' to manipulate, but your definition is contradictory with your examples", "label": 0}
{"text": "Note to self: if you find a lost phone, check inside the case before selling it ✅", "label": 0}
{"text": "A keychain with your phone number if you’re that worried about it. Someone’s not going to go through the trouble of bringing your keys to another location to try finding you, but they’ll probably text you", "label": 0}
{"text": "And then the abuser can hit them with “if you leave this relationship I’ll kill you and then I’ll kill myself”.", "label": 0}
{"text": "A psychology degree, in this case?", "label": 0}
{"text": "Please let us know", "label": 0}
{"text": "Lol perhaps", "label": 0}
{"text": "Then you deal with it all year.  If you do it before the holidays, you get it out of the way early.", "label": 0}
{"text": "Since the dawn of humanity, I would suspect.", "label": 0}
{"text": "I have been thinning and receding for a few years now.  I'm not quite at the \"shave my head\" phase, but I will definitely remember this post for when that day comes.  \n\nThank you sir.", "label": 0}
{"text": "Happy cake day", "label": 0}
{"text": "Same goes for beards , who knew I had a jaw!?", "label": 0}
{"text": "Pretty much sounds like semantics.", "label": 0}
{"text": "Well, if you kill me and yourself - then we will be dead. \n\nI say this in jest, but as someone who has not been in this type of relationship, What is the end game for the abuser? Complete control? To \"win\"?", "label": 0}
{"text": "So by your logic saying your girlfriend isn’t allowed to cheat on you is controlling & abusive", "label": 0}
{"text": "Yes obviously. Basic standards in a relationship to not cheat for example. Do you cheat anyway?", "label": 0}
{"text": "Exactly. Can we apply this logic to all perpetual victims who cry phobia when anyone has an opinion different from their own?", "label": 0}
{"text": "This thread is exposing the people that clean the bathrooms in their homes and the people who have never even considered cleaning the toilet bowl lol.", "label": 0}
{"text": "No it’s not wrong & this post is stupid. By this logic I can’t tell someone to stop smoking cigarettes near me in my own house even though I am breathing in their second hand smoke", "label": 0}
{"text": "Why would I feel awkward around my social group as an adult?", "label": 0}
{"text": "Yeah that’s the point, you decide your boundaries. If you chew your food loudly, I’m going to leave the room any you’ll be eating alone. You’re welcome to keep doing it but I won’t be in the room.” It’s not “don’t chew loudly around me ever” it’s a subtle distinction because the end result is technically the same, but you are no longer policing someone else, you are policing yourself", "label": 0}
{"text": "I haven’t been in that type of relationship either, but yes, it’s about control.", "label": 0}
{"text": "Why don't more people have transplants?", "label": 0}
{"text": "That’s why it’s a boundary for you; you decide what you’re willing to put up with.", "label": 0}
{"text": "I think the line here can be confusing. The difference to me is how I respond to someone that is breaking a boundary. \n\nDecide how you want to be treated and then instead of trying to force the people in your life to treat you that way, find people that do it because they want to. \n\nIf your partner staying out late is breaking a boundary and they do it even though they know how it makes you feel, then it's on you to leave the relationship. If you try to just control the other person instead then that doesn't really solve the underlying problem of them caring more about going out then they care about your feelings. \n\nLet people be exactly who they are and then decide if that's a person you want to be around.", "label": 0}
{"text": "Yeah.....this person got caught \"talking\" to other men. Their partner wasn't cool with that so now they're talking about hula hoops....", "label": 0}
{"text": "You can't make them realize anything. Maybe you need to walk away from those people.", "label": 0}
{"text": "You stop following the feedback loop, by applying the boundaries to yourself. \n\nIf they say \"if you do x, I will do y\", that actually is a boundary. But if they're trying to make you feel bad, you have every right to say \"I do feel bad about that, but you're an adult and you get to choose that. You don't get to control me\"\n\nUsually things like your examples above with hitting or sex are not very good boundaries, because people take them as something to immediately challenge and push on. Instead, in an unhealthy relationship you will either reply with \"I'm doing thing\" (or even just do it, such as leave, without communicating), or in a healthy relationship you can reply with the positive version of what you will do when (\"I want to have sex with you, but I need <x,y,z thing> first)\n\nOne really accurate way to remember / think of boundaries is that they are basically just \"I do what I say\". Similarly, Most people who lash out to do so because they didn't stand up for what they said they would, so then they are effectively living a lie (which then comes out at a later point in time).", "label": 0}
{"text": "Does “You will all have to use my pronouns” count?", "label": 0}
{"text": "yes, it turns out that murderously violent abusers can't be stopped by setting boundaries.  what a revelation", "label": 0}
{"text": "Admittedly not enough, it sounds like. I should do a deep dive.", "label": 0}
{"text": "those around boundaries.  a boundary is \"if you cheat on me I will leave you\"", "label": 0}
{"text": "damn, some of ya'll have been hurt", "label": 0}
{"text": "Oh shoot! 172k is too much, but I've heard Turkey is pretty famous for affordable hair transplants. \n\nThe vain thing I think is odd though", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "Who'd have thought preparing drinks and/or food at home would be cheaper than paying someone else to do it?!?!\n\nI did wonder what all the stuff in my kitchen was actually for.", "label": 0}
{"text": "I learned that using the syrups is better than powdered sugar or cocoa because they sink and collect at the bottom.", "label": 0}
{"text": "😂", "label": 0}
{"text": "I did exactly this 2 years ago. Was already pretty close shaved, but doing Walter White for Halloween made me realize this look works better and is much easier to appear “freshly cut” everyday with a simple electric head shaver that works in the shower.", "label": 0}
{"text": "That first sip of the straw sure gets you going for the day.", "label": 0}
{"text": "It’s your body and if feel so strongly about hair and you can afford it do it. \n\nI guess I associate hair transplants with celebrities who value appearance over substance which to me equals vanity.", "label": 0}
{"text": "I bought myself some cute mason jars and straws for this too! When it's warm, my iced coffee brings me soo much joy in the morning. \n\nthese little self-care splurges are so worth it! it really brightens my day!", "label": 0}
{"text": "🤣 I've been doing it with for decades 😅🤤", "label": 0}
{"text": "You can buy cans of cold foam at stores too now.", "label": 0}
{"text": "Nothing sparks joy like finally needing that exact thing you've had in a box in your closet for years.", "label": 0}
{"text": "Halloween is also a great time for transvestites to get out and about. If you do it right, you can dress up for Halloween itself and for costume parties leading up to it, stretch it out over multiple days.", "label": 0}
{"text": "Also, pour some of the brewed coffee into ice cube trays and use those instead of regular ice so your iced coffee retains its flavor and doesn’t taste watered down as the ice melts.", "label": 0}
{"text": "If you put ice in it, try freezing some iced coffee in an ice cube tray. No more watered down coffee. Also you can make the syrup yourself pretty easily, just combine one part water with one part sugar and heat it until the sugar dissolves. You can add extracts or even better, add a vanilla bean to infuse.", "label": 0}
{"text": "Same, no one cares just me. My daughter still thinks it's funny though. She makes sure to tell everyone she meets that her dad is bald but he used to have hair.", "label": 0}
{"text": "Fair point!", "label": 0}
{"text": "i just put some whole beans in a french press and add some water, 24 hours later its ready", "label": 0}
{"text": "That's commitment", "label": 0}
{"text": "a half inch of syrup? you're really living like you have free healthcare.", "label": 0}
{"text": "last Halloween I was a baldy due to chemo (actually, a stem cell transplant) and I wanted to walter white but my wife got me an Uncle Fester costume instead. To fair, I look more like Fester than Walt. Adams Family yo, come on.", "label": 0}
{"text": "I mix the sugar or cocoa in while the coffee is hot before I put it in the fridge for the night. One more stir in the morning and it’s perfect!", "label": 0}
{"text": "You lost me at milk.\n\nWhy do so many people at milk / thickener to iced coffee?\n\nIts ice, coffee and some flavor... even coffee chains only add like a shot of cream", "label": 0}
{"text": "Those boundaries are still on you. You don't set the boundary \"you can't have sex with other men\". You inform your partner your boundary is \"I won't be with someone who has sex with other men\". They can choose how they act. If they have sex with other men, that's their choice and it's then on you to end the relationship because it violates your boundary.", "label": 0}
{"text": "I think they do it because they like it and it has no effect one way or the other on anyone else.", "label": 0}
{"text": "Syrups are also incredibly easy to make at home as well. 2:1 syrups (sugar in grams:water in milliliters) are the way to go and only require you warm sugar in water and add any flavors (toasted nuts, extracts, herbs, fruit, etc) toward the end when the sugar is basically fully incorporated, let cool, strain very well, and bottle. The resulting syrup is shelf stable for 4-6 weeks in my experience, but can last months in the fridge.", "label": 0}
{"text": "I never got it either because if you’re balding that much where you’re looking for an excuse to shave it all off, everyone is already thinking in passing that you’ll look better if you do it. Like it’s not exactly a secret unless you’re a hat guy", "label": 0}
{"text": "That still doesn't do anything meaningful because \"if you talk to another person I will leave you\" is a valid \"if you do A, I will have to do B\" boundary, OP seems to want to describe healthy boundaries vs unhealthy ones. \n\nOPs also don't work. There isn't a great cheat cheat for a good vs bad boundary.", "label": 0}
{"text": "For some reason I keep seeing comments saying there's zero downsides when ik realistically there *are* downsides, and it's mostly social. There's a thousand cueball, sniper glare, egg jokes out there. \n\nThumbs.", "label": 0}
{"text": "I make iced coffee a couple of times at home daily with a Hyper Chiller. It was around $20 on Amazon and so much easier than the other ways.", "label": 0}
{"text": "Ok, then why did you say powdered sugar?", "label": 0}
{"text": "I would love to live with that comfort level. I have dealt with fraud multiple times and it is such a pain!", "label": 0}
{"text": "Cheese cloth bag with the grounds inside it inside a jug or whatever in the fridge for 24 hours.   Super easy cleanup and better tasting cold brew.\nTake the bag out and fill up your jug with more water.  Resuse the cloth over and over.\nIt's my way of copying the disposable bag ones they sell at the stores.", "label": 0}
{"text": "If you seal it when you fridge it, it preserves some flavor! \nYou’ll Lovett just like Lyle.", "label": 0}
{"text": "Lpt on how to drink half an inch of sugar a day? Gross.", "label": 0}
{"text": "That first boundary fits very well into the previous descriptions. Another way to write that boundary is \"if you cannot be in a monogamous relationship, I won't continue dating you\".", "label": 0}
{"text": "This is the funniest interaction I've witnessed today.", "label": 0}
{"text": "I do this, but instead of drip coffee I use an Aeropress to make something closer in strength/flavor to a double shot of espresso (I seriously love my Aeropress, have used the same one for almost 10 years with almost zero effort toward upkeep other than a thorough rinse when I’m done brewing).", "label": 0}
{"text": "It's not \"you can't call me bad names\" it's \"if you disrespect me by calling me a bad name I will not willingly be around you\". It's sort of policing their behavior but they still have freedom to choose knowing what the consequences will be. The redflags of an abuser using \"boundaries\" is how they are trying to control the other person. \"If you don't have kids with me I'll leave you/cheat on you\" versus \"I want kids, if you don't that's fine but this relationship will not have a future.\"  That's why it's so hard for people in the relationship to see the red flags because it may come across as healthy.", "label": 0}
{"text": "I have one. One of the giant mason jar style ones with a center filter thing. I hate the filter, it leaves SO much sediment. I actually lost my review privileges on Amazon because my review of it said something about it being a sorry-ass excuse for a filter. One mildly \"bad\" word and they threw out 10+ years of reviews and refuse to let me ever post another one.", "label": 0}
{"text": "Cheating isn't a boundary. It's a rule. That it's a very common and widely agreed to rule doesn't make it a boundary.\n\nOP is simply right.", "label": 0}
{"text": "I'd be throwing away a lot of shit.", "label": 0}
{"text": "What's your logic behind whole beans? \n\n\nIt would strain clearer I suppose but at a great disadvantage to flavor and strength.", "label": 0}
{"text": "This is less a Life Tip and more a personal problem.\n\nNot everyone is as insecure about hairloss as you OP.\n\nIt's an ok tip, but kinda sad too.", "label": 0}
{"text": "With all that milk and syrup why don't you just drink something else? You obviously don't like coffee.", "label": 0}
{"text": "That's just silly about the review! I noticed that using a coarser grind helped that issue with mine.  Also it turned out that an extra course grind is what was recommended for cold brew in general.", "label": 0}
{"text": "Ok, but then you can rephrase abusive behavior as a boundary too. \n\n\"I won't feed someone who talks to other people\"\n\nThen they can choose how to act. \n\nI think OP tried to create an over-simplified way to describe abusive behavior and missed the mark.", "label": 0}
{"text": "Yes. Often abuse stems from the need to control those around them. It might be because they had no control in their childhood, or they did and now they don't and they aren't able to come to terms with their new reality. In my case (I was the abuser, mostly verbal started to get physical) it was the fear of what would happen if I couldn't control the actions of another. I couldn't come to terms with the reality of \"this person will do whatever they want regardless\" and instead of removing myself from the relationship I added to the toxicity by attempting to control the other.", "label": 0}
{"text": "Agreed, \"no alcohol in my home\" is a boundary not controlling.", "label": 0}
{"text": "Apparently Because it’s early and I haven’t had my homemade ice coffee yet", "label": 0}
{"text": "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*", "label": 0}
{"text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.", "label": 0}
{"text": "I went as Eleven from Stranger Things one year and did this", "label": 0}
{"text": "This isn’t going to be an excuse to get out of work - your boss ", "label": 0}
{"text": "I'm going through similar. A tree wiped out my kid's room and closet (where we stored a lot). Now we're sorting the junk by what we want to salvage/replace versus what we will mourne but toss (all his plushies but kne are being tossed, the one will be replaced)", "label": 0}
