{"text": "Is trimming the branches some kind of eufemism for sexy times?", "label": 1}
{"text": "for real this is what occurs when humor and pragmatism coexist.", "label": 1}
{"text": "my mom and dad haha", "label": 1}
{"text": "Just what I needed-my morning dose of negativity😂", "label": 1}
{"text": "Such a hassle LOL", "label": 1}
{"text": "Bro is introvert😂", "label": 1}
{"text": "This is really cool cuz you can fill in all the places you’ve been. Maybe even gives someone a reason to travel more.", "label": 1}
{"text": "When your itch requires GPS coordinates to locate", "label": 1}
{"text": "When you want to be gentle but you were born to be heavy-handed", "label": 1}
{"text": "I just want milk that tastes like real milk", "label": 1}
{"text": "I like having my own narrator", "label": 1}
{"text": "The only milk I want is elf boy milk", "label": 1}
{"text": "this feels like an AI-generated conversation", "label": 1}
{"text": "No, they just do it because they think it's funny.", "label": 1}
{"text": "That crumb has seen more of the air fryer than I have seen of the outside world", "label": 1}
{"text": "When the listing said \"rooftop amenities\", this isn't what I had in mind", "label": 1}
{"text": "I was 6 l should've already have 4 investment properties and 2 houses in Calabasas 🤦‍♀️", "label": 1}
{"text": "If you are american an easy solution is a 3 letter word that starts with a g", "label": 1}
{"text": "Bullies aren't concerned with your appearance; their actions stem from their own insecurities. They project these insecurities onto you, using you as a punching bag when it suits their needs.", "label": 1}
{"text": "speed-skimming… to nowhere 😭", "label": 1}
{"text": "40 : what?", "label": 1}
{"text": "Gosh, introverts.... Just because extroverts talk to you doesn't mean they are bullying you.", "label": 1}
{"text": "Growth is just caring less with style", "label": 1}
{"text": "Being in an artirsts rendition on tumblr is one of the highest honors one can achieve just above reciving a medal of honor", "label": 1}
{"text": "Should've been investing in the stock market", "label": 1}
{"text": "The drawing is great! I think we’ve all had to improvise like that at some point.", "label": 1}
{"text": "I read and think of something at the same time. I don't know how it works.", "label": 1}
{"text": "I love charging all my devices. I am keeping them healthy and strong. This is a form of parenthood to me", "label": 1}
{"text": "idk", "label": 1}
{"text": "Lazy.  should've been walkign by then working 54 hrs a week", "label": 1}
{"text": "Good right", "label": 1}
{"text": "Father, I pray I’ll be like this.", "label": 1}
{"text": "That’s very problem orientated. 👍", "label": 1}
{"text": "But the question is what is stronger?", "label": 1}
{"text": "I think it could also be a great opportunity to renew it with a shorter version so both are happy.", "label": 1}
{"text": "Problem solved ✅", "label": 1}
{"text": "I know what happened there", "label": 1}
{"text": "That was my first thought as well.", "label": 1}
{"text": "Loving Mr. Crow’s new wardrobe", "label": 1}
{"text": "pikachu's face reaction tho 💀", "label": 1}
{"text": "the stare says a thousand words haha", "label": 1}
{"text": "thats when i just turn the game off, its too much for me lol", "label": 1}
{"text": "Plot twist: He really was Proud but just can't put it on the best words", "label": 1}
{"text": "dad is proud i can tell, just not that phone savvy", "label": 1}
{"text": "teachers all think we have the best memory or something lol", "label": 1}
{"text": "this dog is a philosopher that we can all learn from haha", "label": 1}
{"text": "You know, my partner’s father is an absolute asshole. Somehow, they still managed to be the wonderful person they are. But my point is that their father refuses to change or even acknowledge his mistakes, despite them trying everything they could to get through to him. And his denials and gaslighting make everything so much worse. So, I’m not trying to downplay whatever happened in your life and the lives of your children. I just want to also acknowledge that your acceptance of your mistakes and efforts to change actually do matter a great deal. At the very least, even though they don’t change the past, they offer you an opportunity to understand it and, I hope, make your own peace with it.", "label": 1}
{"text": "Same, my mom always reply  \"👍\"", "label": 1}
{"text": "My parents would always say \"Well I'm *sorry* I can't be a better parent. If I could go back and change it I would...\" in an exasparated and condescending tone. People will always find excuses not to be honest with themselves.\n\nThe weird thing is my dad taught me some valuable lessons—one being \"actions speak louder than words\". It was very confusing hearing one thing and seeing another until I internalized that.", "label": 1}
{"text": "i just wanna say, if ur aim is strong. then sleep wont be bothering u.", "label": 1}
{"text": "It’s more deeper than death", "label": 1}
{"text": "Still better than me meeting my dad for the first time \n\nI applied for an entry level  job at a shit factory and my deadbeat dad ended up being my boss. \n  \nFirst day I asked him for a ride since I was carpooling anyway and my house was on the way for him and when he dropped me he flipped out that I didnt give him gas money and proceeded to terrorize me at work from then on.", "label": 1}
{"text": "How about you save yourself those years of sadness and just wrap it up now.", "label": 1}
{"text": "A lot of bad/disconnected dads in these comments. \n\nI'd say something like, \"Nicely done son. Always been proud of ya. Did my best to help you develop that spirit early on, but you did most of the work to make it really happen. Use this the next time you're going through a rough spot, and remember what you're made of!\"\n\nUnfortunately a lot of men are just too disconnected from their own feelings to be able to relate or empathize with their kid (or wife), and if they can, they don't know how to express it. Therapy is a deep need for so many.", "label": 1}
{"text": "My nr 1 motivation", "label": 1}
{"text": "\"argh why does I need to go everyday\"", "label": 1}
{"text": "it's a long process but it will be worth it", "label": 1}
{"text": "i dont want to hurt them but pls respond to my threats", "label": 1}
{"text": "you just wanna be a someone regular from a movie", "label": 1}
{"text": "r/Antiwork ahh screenshot", "label": 1}
{"text": "I have a stellium in my 12th house, stellium in my 8th, and pluto in my 6th. Please send help. I am NOT okay.", "label": 1}
{"text": "how about finding the close button in an ad. it's so small that your thumb can't even press it ..XD", "label": 1}
{"text": "Omg my boss is obsessed with me", "label": 1}
{"text": "Going to work two days in a row? That sounds like a *you* problem, bossman", "label": 1}
{"text": "Experience is just code for “I messed up enough times to know better”", "label": 1}
{"text": "No one talks about the real American Dream: Not getting fired while paying off credit card debt", "label": 1}
{"text": "2 am cheese is the forbidden fruit of adulthood", "label": 1}
{"text": "Good right 👍", "label": 1}
{"text": "The only thing I’m good at letting go is my sense of inner peace", "label": 1}
{"text": "this is me begging for some candies on trick or treat", "label": 1}
{"text": "If you take this as a sure sign that your parents doesn't respect you then you're probably spending your whole life looking for insults", "label": 1}
{"text": "candies for all!!!!", "label": 1}
{"text": "thats literally me and i always end up downloading the wrong thing", "label": 1}
{"text": "Clearly, you do not spend enough time around goats. If you did it even a fifth of the Greeks, you'd understand", "label": 1}
{"text": "what if goats actually look like that back then", "label": 1}
{"text": "Ahh yes a stick bug.", "label": 1}
{"text": "Try drinking a but liters of alcohol and then you will see the goat", "label": 1}
{"text": "At least it's not loss.", "label": 1}
{"text": "I mean, it could mean exactly what we think it means...", "label": 1}
{"text": "I think she was hesitant to do it for a long time", "label": 1}
{"text": "Nah, that note was definitely written by a chaotic 8 year old who just learned about disinfectant spray 😂", "label": 1}
{"text": "What an insane statement. We can see all the stars we could always see. Also there is no such thing as \"light pollution\", unless you're a nocturnal insect or some small animal", "label": 1}
{"text": "Ew gross dumbass, don't talk to me you pathetic loser. You have no idea how little I think of people like you.", "label": 1}
{"text": "I've lived in a village almost my entire life. \"Bro\" has never gotten off his computer.", "label": 1}
{"text": "Test", "label": 1}
{"text": "Test (will edit in a reply later to avoid filters)", "label": 1}
{"text": "I grew up in a village that no electricity half the time, looking up used to literally be the only thing we did for entertainment. I've started at those stupid stars you romantize more than you ever will in your life, that's why I'm not a delusional dumbass about it, unlike you.", "label": 1}
{"text": "The Duck Song", "label": 1}
{"text": "Test", "label": 1}
{"text": "Read the edit you absolute dumbass", "label": 1}
{"text": "my password is so good that even me don't know and can't guess it.", "label": 1}
{"text": "I'm concerned people are actually become this stupid. Light \"pollution\" (aka being able to actually see most things at night), is only a thing in big cities. I grew up in a little village that often had blackouts, had to go back from school in pitch black darkness during winter. Fuck all your complains about \"light pollution\", people would kill to have more of it all around the world.\n\nAnd no, the stars look the same without it, just dots in the sky, and yes the constellations look like these stupid lines. I remember trying to find \"the bear\", which is just 3 stars in a triangle, and constantly finding the wrong ones because it's all just fucking dots in the sky.", "label": 1}
{"text": "Everytime 😂 it’s like I need a chip from Elon musk for my 🧠", "label": 1}
{"text": "I think even if I spend decades with goats, I still won't understand how that star constellation become a goat. Astrologers are just really gifted and know what they are doing in related to space and universe.", "label": 1}
{"text": "Lmao what are you talking about? Are you okay?", "label": 1}
{"text": "Drummer when his bandmates are tuning", "label": 1}
{"text": "stop it please! HAHAHHA", "label": 1}
{"text": "It's not that you only saw three stars, it's that that's how you would find them. Clearly you've never done it", "label": 1}
{"text": "It's not a thing, you dumbass, unless, again, you are a nocturnal insect. I am beginning to suspect you actually have the IQ of a moth", "label": 1}
{"text": "I don't hate stars, I hate hippies. With a tremendous passion.", "label": 1}
{"text": "Yes, and that's like me calling roads \"ground pollution\" because they prevent me from seeing the fucking dirt. It's stupid and so are you.", "label": 1}
{"text": "Lmao freak out? A freak out from me would result in dozens of you hippies dead in a ditch, this is just me being educational.", "label": 1}
{"text": "Yes, and roads prevent you from seeing the dirt beneath them. That doesn't make it pollution. The point is that the term \"pollution\" signifies something is somehow unhealthy to humans, which light is the opposite of, the darkness would be unhealthy to humans, which is why we light things up instead.", "label": 1}
{"text": "Stars are not wonder, they are dots in the sky. What you are finding is severely unhealthy delusion, from being a loser in a great society, thus leading you to romantize things you've never experienced because you think the grass is greener on the other side. Behavior like that is inexcusably stupid.", "label": 1}
{"text": "Your thinking is way lower than normal stupid human. Maga level shit.", "label": 1}
{"text": "I find joy in the beautiful cities humanity has built. The gorgeous skyscrapers and lights, that are unlike anything else in the universe. You don't even know what beauty is, you romantize things you've NEVER SEEN, that's how little joy you are. All you hippies are always miserable losers, that part of the reason I hate you.", "label": 1}
{"text": "And I assume you respond only to comments agreeing with you? Lmao dumbass.", "label": 1}
{"text": "Yes, I have a similar relationship with your m0ther. She seems to like it.", "label": 1}
{"text": "I moved away from the village many years ago, and now live in a beautiful city. Excellent how you betray your own romantization and still fail the insult, can't except more from hippie losers like you.", "label": 1}
{"text": "Says the dumbass who can't even capitalize his \"I\"s. Lmao you hippie losers are so stupid it's hilarious.", "label": 1}
{"text": "The moment you stop being stupid.", "label": 1}
{"text": "I read this one out of morbid curiosity and by god, are you having a stroke? Literal dementia ramblings. \n\n>sucks for all us hippie losers that mr big shit city-villager comes across but the world isnt male female but instead hippie loser or city big boy\n\nIt looks like I broke you, you poor creature. This is not what a normal functioning human types. Genuinely, get a brain MRI or seek euthanization at this point.", "label": 1}
{"text": "The same thing you call the sun blocking out the stars during daytime. An utterly irrelevant side effect of being able to see things.", "label": 1}
{"text": "Only regards can relate", "label": 1}
{"text": "Some are named for their behaviour.  Not every set of randomly picked two stars move together.", "label": 1}
{"text": "Nothing like Alice’s ‘tiny clarification’ to double the word count", "label": 1}
{"text": "When mommy stinks without relatives to say a poem", "label": 1}
{"text": "I’ll make sure my store is closed, voice is so convincing\n he’ll think we’re out of business!", "label": 1}
{"text": "\"Looks like I picked the wrong week to quit sniffing glue.\"", "label": 1}
{"text": "yes, nature's bounty, straight from the candy corn farm", "label": 1}
{"text": "Farm-to-table… or, well, bag-to-mouth 🤷‍♀️", "label": 1}
{"text": "These are my favorite candy, but dental surgery prevents me from eating anything that isn’t blended or soaked in broth for a month…", "label": 1}
{"text": "moments flashback especially when you feel hungry and you don't have anything", "label": 1}
{"text": "then the regrets after is just so sad.", "label": 1}
{"text": "Snack is snack no matter what", "label": 1}
{"text": "and it works actually...", "label": 1}
{"text": "Assert dominance by shitting yourself.", "label": 1}
{"text": "Get this man a restraining  order", "label": 1}
{"text": "i would feel so weirded out once he arrives", "label": 1}
{"text": "Setting the mood... one overshare at a time.", "label": 1}
{"text": "me irl.", "label": 1}
{"text": "If that fish pulled up in an Uber, I’d tip extra", "label": 1}
{"text": "Next step: rent them out for 50 cents each, pure profit", "label": 1}
{"text": "it is worth the risk", "label": 1}
{"text": "wait partner, I think I'm flying", "label": 1}
{"text": "Imagine texting your Uber driver three months later with fish memes", "label": 1}
{"text": "\"If I saw it, you all need to see it too\"", "label": 1}
{"text": "Congratulations, you're the proud owner of 8 shopping carts", "label": 1}
{"text": "Woah there horsey, I'm having a realistic depiction of a panic attack", "label": 1}
{"text": "literally me today finding my old violin 😭", "label": 1}
{"text": "This is one of the most fucking relatable thing I've ever seen in a meme lol. Gotta clean my room...", "label": 1}
{"text": "I love how cleaning my room is just me getting distracted my finds", "label": 1}
{"text": "Me at family gatherings after answering the same question 10 times", "label": 1}
{"text": "This fish just secured its place in witness protection", "label": 1}
{"text": "Cant say that wasn't memorable", "label": 1}
{"text": "Imagine $20,000....", "label": 1}
{"text": "makes my brain tingle", "label": 1}
{"text": "the clown in the picture looks like Pennywise.", "label": 1}
{"text": "more like trapped in the highlight reel of my own overthinking...", "label": 1}
{"text": "That’s me, I need to change it", "label": 1}
{"text": "'Just be yourself, son! NO, NOT THAT YOURSELF!'", "label": 1}
{"text": "Oh, no. He's the winner.", "label": 1}
{"text": "career goals: do less here, make more there", "label": 1}
{"text": "Hey mister, why don't you give a shoutout to the lovely [](https://www.reddit.com/user/mrlovens/) while youre at it?", "label": 1}
{"text": "Me in all levels truly!", "label": 1}
{"text": "That's my purse!", "label": 1}
{"text": "No, it's a bigass moon getting in-front of the sun. Come on buddy, these arguments are more worse than a toddlers", "label": 1}
{"text": "\"That about sums up every weekend! It looks like the bottle always wins over the brain.", "label": 1}
{"text": "men have to work for what they want while women deserve what they want", "label": 1}
{"text": "this is when 'calm down' isn't in your vocabulary", "label": 1}
{"text": "Just checked, it’s 0 times.", "label": 1}
{"text": "How much do you get per month from the government? It's a joke", "label": 1}
{"text": "This post describes the difference between the male and female perspectives on self help in a humorous manner. It does not disparage either side, but rather attempts to point out how men and women have different responses to mental health issues and how that reflects in self help literature. Is there anything else you need me to explain?", "label": 1}
{"text": "I think it is more descriptive than prescriptive. If a man felt fat and told his friends they would tell him to go to the gym. In the opposite scenario the woman's friends would comfort her. Both of these are good and needed for different individuals and situations. Many men would benefit from a female perspective and vice versa", "label": 1}
{"text": "I pray none of you get what you really deserve", "label": 1}
{"text": "Said what? Are you confused a little in the head?", "label": 1}
{"text": "Just one cookie, they said. It’ll be fine, they said… now I'm in the desert of crumbs", "label": 1}
{"text": "Ziggers were not hated", "label": 1}
{"text": "Autistic much?", "label": 1}
{"text": "it's a test lol", "label": 1}
{"text": "And some of the incels might even be white  😡", "label": 1}
{"text": "The point is that self help for men is doing things to change while women's is molding the world to you.", "label": 1}
{"text": "Oogh, nugalolo \"zegro\" disglorkle! Binta deeb oogo nugalolo!", "label": 1}
{"text": "youre such a fucking child. hered a joke for you - mens mental health. suck off", "label": 1}
{"text": "Or it might be \"men don’t get the needed help because of society standards that haven’t really been addressed\".", "label": 1}
{"text": "And this is why the joke exists in the forst place", "label": 1}
{"text": "cry to someone who gives a fuck incel. scamper on 😘", "label": 1}
{"text": "you disgusting males make me laugh 🤣🤣🤣", "label": 1}
{"text": "Zigga please", "label": 1}
{"text": "Just tell your parents you're training for the social Olympics. Gold medal in introversion! 🥇", "label": 1}
{"text": "how's your parent's basement?", "label": 1}
{"text": "Me after 49 be like:", "label": 1}
{"text": "Story of my life", "label": 1}
{"text": "But what she doesn't know is that you've been wearing the same underwear every date", "label": 1}
{"text": "I think our generation will be the most understanding parents ever", "label": 1}
{"text": "if you think im weird, just wait till you see my browser history...", "label": 1}
{"text": "5. Oh he's got a new shirt? Oh no he just turned it inside out", "label": 1}
{"text": "The money that was supposed to go to candy for the kids went to another more important cause", "label": 1}
{"text": "Yes I called a mod overstepping their authority a dickless power monger, yes it broke the rules of the sub, yes I got a temp ban for it, but way to prove my point.", "label": 1}
{"text": "this \"nothing\", sometimes is better than just stay home", "label": 1}
{"text": "Once, we were at the airport, and my friend was loudly complaining about the bathroom smell, like, \"Whoa, someone's fighting for their life in there!\" And out of nowhere, this dude from inside a stall yells, \"Oh,sorry, did u need a private air freshener? Hate to break it to you, but we all had Taco Bell, so buckle up.\" The whole bathroom erupted in laughter. She never complained about a bathroom anymore hahahaha", "label": 1}
{"text": "the classic 'UNO Reverse Card' deployed expertly...", "label": 1}
{"text": "Plot twist: all 99 are actually just me rethinking that one awkward thing I did 5 years ago", "label": 1}
{"text": "There are counter movements nowadays of people decorating their house with Halloween stuff on the first of September, to regain dominance from the early Christmas stuff", "label": 1}
{"text": "When I realized this, my life suddenly became easier.", "label": 1}
{"text": "Stay in your lane Christmas!", "label": 1}
{"text": "Boundaries are everything. Stay grounded in your own worth, letting others’ actions define you only dims your own light.", "label": 1}
{"text": "Control your emotions", "label": 1}
{"text": "Hey, invite me to chat, please? The other account is having problems, I don't know what happened", "label": 1}
{"text": "That's unfair! You gotta stick to the topic", "label": 1}
{"text": "not me thinking the setting was turned off the whole time", "label": 1}
{"text": "Nothing wrong with mouth breathers but how do they give head ?", "label": 1}
{"text": "\\*me in my laptop translating Skibidi hawk tua, fellow gigachads on google right now", "label": 1}
{"text": "Yeah at least in prison you have a chance fighting back against the  [ 𝖕𝖊𝖗 𝖉𝖊𝖈𝖗𝖊𝖙𝖚𝖒 𝖕𝖔𝖓𝖙𝖎𝖋𝖎𝖈𝖎𝖚𝖒 𝖍𝖔𝖈 𝖈𝖔𝖒𝖒𝖊𝖓𝖙 𝖊𝖘𝖙 𝖉𝖎𝖑𝖚𝖈𝖚𝖑𝖔 𝖙𝖊𝖗𝖒𝖎𝖓𝖆𝖙𝖚𝖒 ]", "label": 1}
{"text": "this is when i just move on to a new subject", "label": 1}
{"text": "the worst is when your trying to sleep but can only breathe out of your mouth lol", "label": 1}
{"text": "and baby voice talking to dogs lmao", "label": 1}
{"text": "Activate mouth breathing", "label": 1}
{"text": "\"pee-you\"", "label": 1}
{"text": "aaaahhh-- uhmmm--", "label": 1}
{"text": "That's why I always use passwords easy to remember like my birthday or my name", "label": 1}
{"text": "I am playing this game for 12 years now", "label": 1}
{"text": "my password so good, I can't even guess it", "label": 1}
{"text": "Yeah", "label": 1}
{"text": "Protip: Set off fireworks near said outing, then sneak out as cops arrive.", "label": 1}
{"text": "Mentally preparing for the time I'll fake an excuse to leave early.", "label": 1}
{"text": "he's got that hard exterior but secretly loves cats. so cute", "label": 1}
{"text": "Finally, a Christmas movie for people with trust issues", "label": 1}
{"text": "That face says 'Do I say thanks or run away?", "label": 1}
{"text": "Guess we’re skipping the mistletoe scene", "label": 1}
{"text": "Act tough but still got that feline finesse", "label": 1}
{"text": "Me as a normal person!", "label": 1}
{"text": "Just make friends with a mobster who will forge the grades for you, like happened for Shah Rukh Khan in Kabhi Haan Kabhi Naa.", "label": 1}
{"text": "“I’m fine...It’s fine... It’s only 5am. I can still get an hour and a half of sleep.”", "label": 1}
{"text": "Me that don't even have Internet on my phone", "label": 1}
{"text": "yes it happens to most peaople!", "label": 1}
{"text": "I had a look and appearently it is from \"Lost in Space\" last episode of season 2.  \n[http://www.uncleodiescollectibles.com/html\\_lib/lis/00029.html](http://www.uncleodiescollectibles.com/html_lib/lis/00029.html)", "label": 1}
{"text": "I feel you, sometimes it's hard to find some peace and quiet. Maybe you could try wearing headphones or find a more secluded spot when you need some alone time? Stay strong!", "label": 1}
{"text": "Lucky you! Avoided all that awkwardness. 😅", "label": 1}
{"text": "Quack!", "label": 1}
{"text": "Time flies very fast, I was just listening to Green Day's song and it's suddenly November", "label": 1}
{"text": "The husband do not want the dog at first when the wife brought it home LOL", "label": 1}
{"text": "The husband do not want the dog at first when the wife brought it home LOL", "label": 1}
{"text": "Just halloween in a nutshell", "label": 1}
{"text": "system failure", "label": 1}
{"text": "Your husband is into bestiality?", "label": 1}
{"text": "Halloween in a nutshell", "label": 1}
{"text": "It's like feeling your brain untense in a way you didn't even know it was tensing.", "label": 1}
{"text": "Not anymore, the paper ones are shit and turn to smudge before you can finish the drink. It's better for nature, but i hope they can think of a plastic straw that dissolves in water, but it takes like a day or so.", "label": 1}
{"text": "the sweet symphony of sugary hydration", "label": 1}
{"text": "literally me when my teacher asking me to answer something", "label": 1}
{"text": "I have non. Can't wait to kms.", "label": 1}
{"text": "The real dream job is getting paid to do that.", "label": 1}
{"text": "it's been so hard for me I feel that if I don't have the answers I'm not in control and I'll be in danger : (", "label": 1}
{"text": "Cute little kitten.", "label": 1}
{"text": "Hopefully it's a good buy", "label": 1}
{"text": "Brol got minus - rating", "label": 1}
{"text": "How Many of u actually know this girl and this show ..if u know u guys are a legend ...ND u definitely got nostalgia", "label": 1}
{"text": "Perfectly captures my vibe every time I step outside. Major mood.", "label": 1}
{"text": "But then the anxiety hits like a freight train.", "label": 1}
{"text": "The best advice. And be calm. Nothing in this world is worth a frayed nerve", "label": 1}
{"text": "Better late than never", "label": 1}
{"text": "let's wish this little cutie a happy birthday", "label": 1}
{"text": "Top of the Santa list every year.", "label": 1}
{"text": "How do you prove that AC and AB are equal?  Are we just supposed to assume that ADC is also a right angle? Seems like a trap.", "label": 1}
{"text": "It actually scares me that I want to do everything in the world but it ends up not doing anything at all", "label": 1}
{"text": "This was my hobby before", "label": 1}
{"text": "living my life one procrastination session at a time", "label": 1}
{"text": "The infinite cycle of \"It will be fine if I do it tomorrow, right?\"", "label": 1}
{"text": "The buyers remorse instantly hitting when a better version in a similar price range was already available.", "label": 1}
{"text": "Hell yeah. Money surely doesn't buy happiness, but lack of money doesn't buy anything.", "label": 1}
{"text": "same 😂 pockets full, heart full", "label": 1}
{"text": "Who says money can't buy happiness? Because I could definitely use a little more happiness in my life", "label": 1}
{"text": "I swear I'll watch it later   \n  \n7 months later: I still haven't watched it", "label": 1}
{"text": "That's basically the reason why I still own a onesie", "label": 1}
{"text": "I already snuggle with a teddy on the weekends.", "label": 1}
{"text": "me sometimes.", "label": 1}
{"text": "Gotta admit. We all just want to hibernate like bears due to stress at work", "label": 1}
{"text": "I immediately close any negative review. I'm not seeing/hearing that, lol", "label": 1}
{"text": "\"are u ok?\" no i need money", "label": 1}
{"text": "i like when i feel them in my pocket", "label": 1}
{"text": "The only thing that makes anyone happy", "label": 1}
{"text": "\"And so it begins\"", "label": 1}
{"text": "Retail therapy works better if you back it up with YouTube reviews 😂", "label": 1}
{"text": "I mean I deserve them though hehe", "label": 1}
{"text": "She's in urgent need of another blunt", "label": 1}
{"text": "Fear of abandonment and burning bridges is ***TEXTBOOK*** BPD behavior.", "label": 1}
{"text": "Nice job on the stealth heist! Just wait until they start looking into who’s been mysteriously absent on pizza nights—your delivery guy is going to blow your cover", "label": 1}
{"text": "least based battle cats fan lol", "label": 1}
{"text": "when McD's is like ‘uhhhhh’ and someone responds with  felony", "label": 1}
{"text": "The police is going to arrest a random dude for a theft with no evidence that nobody filed a complaint about. Touch grass lil bro.", "label": 1}
{"text": "Facts are facts, whether or not you like them. Fear of abandonment and destroying relationships as a form of defense are hallmark traits of people with BPD.\n\nTake it as you will.", "label": 1}
{"text": "You have an overestimated opinion of yourself. This is textbook narcissistic personality disorder. You can disagree with this, but facts are facts", "label": 1}
{"text": "As a recent victim of someone with nBPD, and the reason I'm so keenly attuned to this:\n\nEat shit", "label": 1}
{"text": "just lowkey surviving here", "label": 1}
{"text": "I'm not diagnosing anyone, sweetie.\n\nGo off, though. You're the champion of the mentally ill. My heroine!", "label": 1}
{"text": "I'm still confused by McDonald's tweet... who's in charge of their social media lol", "label": 1}
{"text": "How not to get away with it 😅", "label": 1}
{"text": "Tell that to the Indians and Chinese", "label": 1}
{"text": "and the rest is only history now..", "label": 1}
{"text": "Probably just enough to finally achieve inner peace speedrun any% completion.", "label": 1}
{"text": "this is me in the mall with 2$ in my pocket", "label": 1}
{"text": "Me: does it immediately and regrets nothing.", "label": 1}
{"text": "Slow and steady wins the candy race. Halloween doesn’t have an expiration date!", "label": 1}
{"text": "this is literally when we are so invested on their argument", "label": 1}
{"text": "\"Please don't hit the skip button\" skip", "label": 1}
{"text": "Nothing activates my ‘skip’ reflex faster than ‘Wait, don’t skip!’", "label": 1}
{"text": "We need a few more people in turtle costumes and I'll be in a rat costume, who's with us?", "label": 1}
{"text": "and it's a priest, an organizer and a photographer", "label": 1}
{"text": "Royalty runs in the family 😸", "label": 1}
{"text": "When you’re the ruler of the living room and you know it 😽", "label": 1}
{"text": "Fit for a king or at least a really pampered kitty 🐾", "label": 1}
{"text": "that good picture will be my icon for all of my social media accounts", "label": 1}
{"text": "Same. Even no time for hobbies", "label": 1}
{"text": "Why does this feel way too relatable... 3 AM snacks hit different", "label": 1}
{"text": "I always thought it was magic back then", "label": 1}
{"text": "And in the morning, I don't remember anything", "label": 1}
{"text": "Damn, she is just a girl who likes having fun lol", "label": 1}
{"text": "'no special treatment here! if you can’t handle the washing machine, you better not even think about being in my closet.'", "label": 1}
{"text": "Woman knew it better", "label": 1}
{"text": "Get up and them snacks. That is more important", "label": 1}
{"text": "Nothing says mom's in trouble like 'can I have a granola bar?' right?", "label": 1}
{"text": "My playlist: Expansive  \nMy vibe: Narrow AF", "label": 1}
{"text": "If you survive, you deserve a spot in my closet", "label": 1}
{"text": "I think that exactly it", "label": 1}
{"text": "hahaha The story of many clothing", "label": 1}
{"text": "This post's humor resonates with many, capturing everyday quirks through relatable memes and jokes.", "label": 1}
{"text": "no time for hand washing haha", "label": 1}
{"text": "her new skill is unlocked. ghosting with a side of mystery i guess", "label": 1}
{"text": "nothing like the ghosted nostalgia to kick off happy hour", "label": 1}
{"text": "sip your way through her silence 😔", "label": 1}
{"text": "She got lost.\n\nJust keep waiting.", "label": 1}
{"text": "Life as we know it like this", "label": 1}
{"text": "My spiritual animal.", "label": 1}
{"text": "For us girls it feels like 20 mins", "label": 1}
{"text": "In Shrek's voice: \"Like that's ever gonna happen\"", "label": 1}
{"text": "me", "label": 1}
{"text": "Does this work?", "label": 1}
{"text": "Plot twist: the meme was self-aware all along.", "label": 1}
{"text": "modern problems require caffeine solutions", "label": 1}
{"text": "Therapist: that's not how life works. Me: let me dream", "label": 1}
{"text": "When he takes ‘giving a piece of himself’ way too far", "label": 1}
{"text": "Dude i know this what was it from its driving me crazy", "label": 1}
{"text": "Id send you a nasty text too. Ya dirty snitch.", "label": 1}
{"text": "It was revealed to me in a dream", "label": 1}
{"text": "Is it just me, or do NDAs make job interviews feel like a game of poker? 🎭", "label": 1}
{"text": "Reminds me of https://youtu.be/k-o8zYEEsik?si=Uui1kJgyflTHMG9l", "label": 1}
{"text": "Why do I feel like this is my Monday morning meeting face?", "label": 1}
{"text": "Or where I was going with the conversation", "label": 1}
{"text": "when my brain decided that it was time to have a software update mid-sentence", "label": 1}
{"text": "brain.exe stopped working. please wait while we try to reconnect...", "label": 1}
{"text": "error 404: thoughts not found 😂", "label": 1}
{"text": "The defense industry.", "label": 1}
{"text": "So me lol", "label": 1}
{"text": "Dm me please", "label": 1}
{"text": "I’ll be a good boy dm me please", "label": 1}
{"text": "Life’s just one big game of 'smack me down, and I’ll get back up… again, and again, and again", "label": 1}
{"text": "getting knocked around but still smiling like it's all part of the fun 😭👍", "label": 1}
{"text": "Every knock is just life's way of saying, 'Congrats! You've leveled up in resilience! 👍👍👍", "label": 1}
{"text": "Positive normal to the local plane of the manifold of the nearest gravity well.", "label": 1}
{"text": "Exactly, happiness is optional. Always choose happiness over everything", "label": 1}
{"text": "That always happens to me in the store, little will i notice that time has already elapsed Lmao", "label": 1}
{"text": "Shopping with mom is like a time warp—3 hours later, you've only tried on 2 shirts and lost all sense of reality! ⏳", "label": 1}
{"text": "To each his own. The job/company that asked me for redacted tax docs changed my entire career trajectory and my life, for the better. They were considering investing a ton of money into me, I don’t blame them for doing their due diligence on their potential investment.", "label": 1}
{"text": "I chuckled reading this because it is just sooo true", "label": 1}
{"text": "exactly what I did now", "label": 1}
{"text": "we laugh in mindset", "label": 1}
{"text": "Well, on the one hand, not many people are being held up as examples, so I'm special", "label": 1}
{"text": "the same error every day.... God, someday I'll wise up", "label": 1}
{"text": "Mystery job: superhero or secret agent? You decide", "label": 1}
{"text": "The crystal ball pulled a reverse uno card", "label": 1}
{"text": "The teacher: i'm not mad, i'm just disappointed", "label": 1}
{"text": "Guess i'm one with nature now", "label": 1}
{"text": "Even my sleep paralysis demon thinks i have a problem", "label": 1}
{"text": "facebook reactions need a 'stone face' option", "label": 1}
{"text": "Doesn't wanna share it with fat Thor", "label": 1}
{"text": "I wish.", "label": 1}
{"text": "But it’s true my arm feels so heavy after falling asleep on it", "label": 1}
{"text": "If someone asks you what twice. Change the way you are saying it. Example: what do we have for dinner? To: what are we eating today? \n\nThe change up will help people break out of their mishearing loop. And the conversation can continue.", "label": 1}
{"text": "Is it just me to find it amazing when you actually feel your hand comes back to life as the blood flow in your arms..", "label": 1}
{"text": "Labeled as \"mature for my age\" in reality it gave me the most immature tendencies now.", "label": 1}
{"text": "And those 20 mins aren't even spent sleeping they're spent TRYING to sleep", "label": 1}
{"text": "Me convincing myself that “tired chic” is a real aesthetic.", "label": 1}
{"text": "out of service until further notice 😆", "label": 1}
{"text": "weekend warrior, weekday napper 🤷‍♀️", "label": 1}
{"text": "then good luck on 30 more years of pretending to enjoy Monday 😂", "label": 1}
{"text": "you should start practicing your 'cheerful face' as early as you can 😂", "label": 1}
{"text": "Hello are you here today how are you", "label": 1}
{"text": "Ain't got no time for such delicate care! LOL", "label": 1}
{"text": "Shining in prison", "label": 1}
{"text": "That's a year worth of interaction", "label": 1}
{"text": "Only 45 more years of work! Just think of retirement! 😂", "label": 1}
{"text": "not enough, 12 months is better LOL", "label": 1}
{"text": "yeah happened to me today lol", "label": 1}
{"text": "Coraline is so real. If a demon created a different reality where my mom loved me i'd get trapped there too", "label": 1}
{"text": "Thinking about inviting all the introverts I know to a party so they feel like they got invited somewhere & then canceling it last minute so no one actually has to go", "label": 1}
{"text": "\"you betrayed me mom\"", "label": 1}
{"text": "Who knew I’d miss the chaos of cafeteria politics?", "label": 1}
{"text": "High school drama: messy but entertaining  \nAdult life: just messy", "label": 1}
{"text": "At this point, Only mr. beast can help us out", "label": 1}
{"text": "20 more minutes? more like 2 hours of chaos", "label": 1}
{"text": "shopping with mom feels like a lifetime sentence))", "label": 1}
{"text": "Brady Hartsfield hat entered the chat", "label": 1}
{"text": "so everyone thinks like this, I thought it's just me 😭", "label": 1}
{"text": "\"sorry, that's not what I really meant\"", "label": 1}
{"text": "Where is this?", "label": 1}
{"text": "One genuine friend is enough", "label": 1}
{"text": "hugs for those people that have no one to go to, keep it strong y'all! ❤️", "label": 1}
{"text": "that certainly verify us as a human", "label": 1}
{"text": "That is what I am thinking too!", "label": 1}
{"text": "Hey! Did you know you can watch best movies online for free 1080p no virus no spyware no ADs on www.[REDACTED].xen? Download free movies for free and have a fun time watching free movies online for free 1080p no virus! Come and join me on this fun adventure!", "label": 1}
{"text": "Me in all lavels", "label": 1}
{"text": "Here is picture of my car…. He is still in the store because I don’t have money", "label": 1}
{"text": "it looks cleanly decorated ... XD", "label": 1}
{"text": "😭😭", "label": 1}
{"text": "I have a friend who puts up a Christmas tree in September!", "label": 1}
{"text": "Stop being a victim. Find ways you can control your choices and make good choices for yourself and your future, even when it is hard. Not blaming others, stop blaming childhood- instead realize that while those things can absolutely suck, you as an adult can work to mitigate the negative effects they have on you.", "label": 1}
{"text": "You said it, so many mental midgets these days", "label": 1}
{"text": " . . .  .                      n bn   ,b　m？mんm？v？ｍn  ０nn，nv，b９（v，、、ｖ 　m b ,0( \\9ｂｎ？ｂ，ｍｂ，ｂb0", "label": 1}
{"text": "I also want to slip past the problems in life like he does", "label": 1}
{"text": "At this point every minute equals an hour lol", "label": 1}
{"text": "And you end up feeling like a villain, but you realize it's worth it.", "label": 1}
{"text": "It would be cool to have the opposite of intrusive thoughts just a sudden calming thought.", "label": 1}
{"text": "Glass prison and the only crack of fresh air is between those bars, but you’re too fat to get out. Is your therapist calling you fat?", "label": 1}
{"text": "My thoughts move too quick to organize.", "label": 1}
{"text": "Exactly how I feel. It’s like my brain never freakin shuts off. I just think about every single aspect of life constantly. Family, relationship, tasks, work... it’s never ending", "label": 1}
{"text": "Social battery instant drain", "label": 1}
{"text": "Is there any space for one more? We may both be that way lol", "label": 1}
{"text": "Holy. look at the amount of icons in this screen. Is it bad that the desktop stresses me out more?", "label": 1}
{"text": "this is me in department store hoping no saleslady sees me", "label": 1}
{"text": "Fat and stupid?", "label": 1}
{"text": "an effective book for sure", "label": 1}
{"text": "This was the smoothest \"nope\" I've ever seen lol", "label": 1}
{"text": "He's UNDERstanding", "label": 1}
{"text": "He immediately began to put into practice what he had read in this book", "label": 1}
{"text": "Se body pls gimme that book", "label": 1}
{"text": "wanna see it but not encourage it lol", "label": 1}
{"text": "I know!! more years to celebrate\\~", "label": 1}
{"text": "I agree. The person who's reading it is not giving an F to the book anymore", "label": 1}
{"text": "Look how he immediately applied what he had read!", "label": 1}
{"text": "\"That's been a rough week\"  \n\"it's only Tuesday\"  \nOh no", "label": 1}
{"text": "the days feel like it's moving so much slow", "label": 1}
{"text": "except Saturday and Sunday", "label": 1}
{"text": "I think the therapist wants to say that, just like the bird struggles to escape, you might be facing challenges that hinder your growth or progress.", "label": 1}
{"text": "mental little people", "label": 1}
{"text": "My thoughts exactly", "label": 1}
{"text": "He sure had one heck of a meal", "label": 1}
{"text": "Thursday is supposed to be a step towards weekend. Cheer up my man", "label": 1}
{"text": "\"We have the same at home\" situation", "label": 1}
{"text": "\"Yes girl swear it comes off\"", "label": 1}
{"text": "true! At this point, the only thing we can count on is the “unexpectedly” part of life expectancy!", "label": 1}
{"text": "I don’t wanna work, I just want the paycheck that comes with hard working positions\n\nEdit: I’ve been reminded that, typically, hard work doesn’t pay, so I’d like a CEO salary please. You get laid off! And you get laid off! And I get a yacht!", "label": 1}
{"text": "Can't live with it, can't live without it", "label": 1}
{"text": "I was jobless for two years and then got a great job at an IT firm. Work from home, great wage, benefits. Yet I still reminisce about the days I was unemployed.", "label": 1}
{"text": "I know I should be grateful but... You can be grateful and still loathe your job! I’m good at multitasking.", "label": 1}
{"text": "Someone should sit in that chair and fart", "label": 1}
{"text": "top 5 scariest things in life:\n\n1. phone calls\n\n2. driving\n\n3. having a job\n\n4. being unemployed", "label": 1}
{"text": "I think that's called Black mirror", "label": 1}
{"text": "time to pay for the groceries and the trauma 😭🥴", "label": 1}
{"text": "caught in 4k looking like i just fought a freakin' tornado 🤦‍♀️", "label": 1}
{"text": "Me after getting the job I prayed for", "label": 1}
{"text": "why you gotta hit me with that uno reverse card 😫", "label": 1}
{"text": "I look exactly like this", "label": 1}
{"text": "I have a new dream now, to be a plushie", "label": 1}
{"text": "Mood swing, extreme edition lol", "label": 1}
{"text": "I am a horse", "label": 1}
{"text": "I also bro music nd watching movies", "label": 1}
{"text": "That means you have a huge dicc", "label": 1}
{"text": "This book has been a game changer in my life, just look at bro lol", "label": 1}
{"text": "HOTDOG in a great nutshell", "label": 1}
{"text": "times that the loudest statement is the silence that could've been a roast...", "label": 1}
{"text": "holding back because my therapist said i'm trying to grow...", "label": 1}
{"text": "oh, i didn't realize that we were in MY car...", "label": 1}
{"text": "once i started the stop watch instead of making an alarm an i was late for work lmao", "label": 1}
{"text": "my mom always said not to say anything if you dont have anything nice to say :)", "label": 1}
{"text": "haha driver always chooses the music", "label": 1}
{"text": "He almost made it", "label": 1}
{"text": "It affected him to the core 😆", "label": 1}
{"text": "we've all been there, understandable", "label": 1}
{"text": "\"you're free to get out\"", "label": 1}
{"text": "That robot’s giving a ‘I’m about to eject you from this ride’ energy", "label": 1}
{"text": "Lmao stfu mate", "label": 1}
{"text": "Me, treating every snooze like a 5-star luxury nap 😂✨", "label": 1}
{"text": "we all know how this will end, waking up late", "label": 1}
{"text": "And you are now entering the Dreamlands", "label": 1}
{"text": "So much for free speech. You fucking dolt.", "label": 1}
{"text": "Every election feels like a live reality show at this point.", "label": 1}
{"text": "when subtle was just a suggestion 😂", "label": 1}
{"text": "no to sneak peak. yes to laser focus", "label": 1}
{"text": "subtle < stare", "label": 1}
{"text": "i swear the robot just sighed at you", "label": 1}
{"text": "Weekend plans always look better on paper.", "label": 1}
{"text": "The plane is still on land but you're already flying", "label": 1}
{"text": "You are your number 1 fan", "label": 1}
{"text": "Even ghosts have multiple personalities", "label": 1}
{"text": "That's why every time I wear my thrift clothes, I feel a bit heavy and strange in the room. Maybe the original owner is no longer on this earth, and their spirit is still lingering around, shadowing me! Haha", "label": 1}
{"text": "hey, at least he got company now... tho they do stare kinda intense.", "label": 1}
{"text": "Same thought. Buying em' so I'll feel haunted at night", "label": 1}
{"text": "I can never be like him", "label": 1}
{"text": "some of them are your ancestors. you'll never know", "label": 1}
{"text": "the true power move \"failing, smiling, & tryin' again\"", "label": 1}
{"text": "I feel attacked", "label": 1}
{"text": "can we skip the college part and go straight to where i am financiаlly stable with a good looking spouse and 5 dogs", "label": 1}
{"text": "Living the snooze button dream life, sparkles included", "label": 1}
{"text": "You are impersonating a trump voter, nobody is going to be able to tell that you’re just playing stupid. The /s is mandatory", "label": 1}
{"text": "hope you get out of that one reinvigorated", "label": 1}
{"text": "Me promising I will study a little bit at night and sleep early so I can wake up early and study at dawn\n\n  \n\"Biggest lie I ever said to myself\"", "label": 1}
{"text": "Everyday I’m shuffling!", "label": 1}
{"text": "When you lie on your résumé but still get the job", "label": 1}
{"text": "Nothing relaxes me like the threat of imminent danger", "label": 1}
{"text": "No one is gonna believe him anyway...", "label": 1}
{"text": "Romantic idea: throw soup on your gf and tell her it's bc she's a work of art", "label": 1}
{"text": "when i was like 10 i learned that splitting an atom will make a nuclear explosion and for a long time i got really stressed out whenever i had to cut anything bc like. what ifi hit an atom atjust the right angle", "label": 1}
{"text": "straight up, we all do it)", "label": 1}
{"text": "Oh fck off... its not a distopic hollywood movie. Chill.", "label": 1}
{"text": "I think that's the basis for any student", "label": 1}
{"text": "looks like me hahaha", "label": 1}
{"text": "Yeah, people are to dramatic.", "label": 1}
{"text": "Something bout to cook here", "label": 1}
{"text": "How I wish the same.", "label": 1}
{"text": "Just opening the notes and seeing everything that needs to be studied is tiring.", "label": 1}
{"text": "My rent doubled from what it was 6 years ago. Mage wage went up by only %10 in that time. People making 50k a year can't afford a 2bdrm apartment yet more than half the country makes less than 50k a year. You are out of touch with just how bad things have gotten.", "label": 1}
{"text": "Once again. You will survive.", "label": 1}
{"text": "Democrats when the democratically elected candidate wins the election instead of the candidate the candidate their party installed without a vote: “democracy is DOOOOOOMED!!!!1!1!!1!1!1!” 😭😭", "label": 1}
{"text": "Same, but I call it “creative reflection time”", "label": 1}
{"text": "Me too!!", "label": 1}
{"text": "Womp womp.", "label": 1}
{"text": "This is why he won lol, Reddit little echo chamber is so deluded, I am not America or even like trump but your salty tears over trump are funny af", "label": 1}
{"text": "Have better aim than the other guy.", "label": 1}
{"text": "Its not semantics. We are a Constitutional Republic. There is no Democracy. There are no functions of Democracy. Its a R E P U B L I C and there's a massive difference. Jesus we need civics back.", "label": 1}
{"text": "Yeah bro, youre cooked. Go outside and touch grass and realize you are the minority.  Democracy wins again!! God I love America!!! 🇺🇸", "label": 1}
{"text": "Widely regarded as the worst president in US history before TDS took over everybody's minds. \n\nSeems like a super good human being though", "label": 1}
{"text": "Exactly. Bush was so much worse than Trump in every regard and we recovered fine from his presidency", "label": 1}
{"text": "Get off reddit and do your fucking mission", "label": 1}
{"text": "Actually, you’re intentionally misinterpreting what he’s said, but it’s ok! You’re not smart enough to know the difference anyway, so I don’t blame you hon ❤️", "label": 1}
{"text": "What’s it even based on?", "label": 1}
{"text": "You know what? Screw it. I'm not doing the \"reminded in 4 years\" thing. I don't plan on so much as seeing the inauguration. Fuck it.", "label": 1}
{"text": "Lol all the clowns downvoting you to oblivion😂", "label": 1}
{"text": "And willfully obtuse.  Good luck out there.", "label": 1}
{"text": "Lol fair enough. I guess whinging is all you have now.", "label": 1}
{"text": "You said that 8 years ago, man", "label": 1}
{"text": "Rigged elections will be the first step. Lol can you imagine the US becoming Venezuela or NK?", "label": 1}
{"text": "That is kinda how notifications work, my love.", "label": 1}
{"text": "Judging by your replies and general attitude, you don't really know what a job is.\n\nIt's all good, buddy, your tears are salty sweet to me.", "label": 1}
{"text": "Then don’t bring it up at all if you don’t want to speak on it?", "label": 1}
{"text": "Ok lol great points you’re making here. Carry on.", "label": 1}
{"text": "You said that. We get it. Have a good one.", "label": 1}
{"text": "And this time, the other half lost, and is coping and seething just as much. Turns out everyone sucks, but hey, if MY side does it, it's okay.", "label": 1}
{"text": "Wahhhh", "label": 1}
{"text": "Dying laughing at americans who dont even understand they dont live in a democracy.\n\nYoure republic is being perverted and yall hate it but cant even grasp it because you think youre supposed to be a democracy. \n\nThe founding fathers were right, yall a bunch of dummies.", "label": 1}
{"text": "Check the downvotes. Echo chamber.", "label": 1}
{"text": "I’m not subscribed, ya dunce.", "label": 1}
{"text": "where's the skip ad button on this convo???", "label": 1}
{"text": "i guess i'm the only one vibing to the sound of chewing now...", "label": 1}
{"text": "Who’s crying? Just trying to prevent all of you with the blinders on from reliving this in 4 years.", "label": 1}
{"text": "Preach tolerance! Except against anyone with even a remotely conservative view. That’s not allowed to be expressed. \n\nThis is why you lost. \n\nPS. Not American nor do I care what happens there,  just find it ironic.", "label": 1}
{"text": "This is too real. Lmao", "label": 1}
{"text": "/then starts to get angry and be mad at him", "label": 1}
{"text": "And then brain starts to troll again", "label": 1}
{"text": "I am not subscribed to this sub, but it shows up in my feed and I do enjoy most of the content and typically upvote stuff I see on it. I didn’t realize it was strictly a political sub for liberals.", "label": 1}
{"text": "Oh the rivers of tears are delicious", "label": 1}
{"text": "They all live in their little nerd echo chamber. Over sensitive rainbow kids", "label": 1}
{"text": "real life shenanigans are so real sis", "label": 1}
{"text": "See a therapist.", "label": 1}
{"text": "Ah yes the 'why did i say that in 7th grade' flashbacks", "label": 1}
{"text": "YouTube dinner dates don't ask how my day was and i appreciate that", "label": 1}
{"text": "Cant sleep? Let's relive every mistake you've ever made", "label": 1}
{"text": "The prophecy was true. All roads do lead to Ohio", "label": 1}
