{"text": "An allusion to what?", "label": 0}
{"text": "Just take the picture of your reflection then", "label": 0}
{"text": "God forbid you have to put your phone away because something came up", "label": 0}
{"text": "\\*illusion", "label": 0}
{"text": "no you're not, now die!!!!!", "label": 0}
{"text": "Anybody who has an opinion on the texting habits of others in this way needs to sit the fuck down and stop making everyone's life even more stressful.", "label": 0}
{"text": "Can these kids get any dumber?", "label": 0}
{"text": "Huh?", "label": 0}
{"text": "Pooping and scrolling reddit VS put my phone down and am working/gaming", "label": 0}
{"text": "Oh man playing terraria with the boys into the morning was awesome, especially when the sun came up and we realized it was the next day lol", "label": 0}
{"text": "I'll go to bed when I finally get enough titanium and frost cores \n\n*5hrs later* alright I'll go to bed once I bed the mech bosses \n\n*repeat 5 times*", "label": 0}
{"text": "Respect the tree, don't hit it with your head.", "label": 0}
{"text": "I haven't seen a reply to a comment on an old school meme in a decade. You've done something incredible", "label": 0}
{"text": "So many people are projecting all their own bullshit in this thread 😂", "label": 0}
{"text": "*\"My name is Indigo Catoya. You spilled my milk. Prepare to die.\"*", "label": 0}
{"text": "Must be hard on you having to *checks notes* bend your knees and/or lean occasionally", "label": 0}
{"text": "At the end of the day it always ends is a form of “yes dear”", "label": 0}
{"text": "Having a wife....", "label": 0}
{"text": "lol", "label": 0}
{"text": "Didn't SHE saw it? \nIt's her duty to react instantly and...call for a man to do the job, huh?>:D", "label": 0}
{"text": "I believe I would respond with \"if you have time to sit and watch people get hit in the face, you have time to trim the branches yourself!\"", "label": 0}
{"text": "I get the point you're try to make, but you're missing nuance.\n\nI mean, first of all, in the OP pic nothing is \"urgent\". She's not saying he has to do it today, or when he comes home from work. She's just saying there is a task to be done.\n\nSecond of ly, yes there should be a division of labor (or some other agreement, whatever works). But that doesn't mean that you should ignore the things you *can* do just because they aren't assigned to you. I can clean up spills, so I do it where needed. My wife cannot safely operate the chainsaw, so I don't expect her to trim the trees.\n\nIn the end it should be a partnership with the ultimate goal of succeeding together, not Overwatch where you rag on your teammates for not pulling their weight.", "label": 0}
{"text": "Makes it look bigger too!", "label": 0}
{"text": "About 40 years ago I collected baseball cards like a meganerd. \n\n\nHere and now, decades later, I only value my Oscar Gambles", "label": 0}
{"text": "Cat Milk got alot of good stuff for them.  \nWhy do you eat for pleasure and only want your Pets to live on the most basic stuff ?", "label": 0}
{"text": "I find it a challenge to dodge all the branches as as fast as I can", "label": 0}
{"text": "The woman is lazy and made the husband do it. What a refreshing change of pace! 🤡", "label": 0}
{"text": "Jesus Christ how inept do you think the average person is? Landscapers are some special breed with special training. They're usually 20 year old just thrown into it and learn as they go. Anybody should be able to use a ladder safely.", "label": 0}
{"text": "Lol that was good", "label": 0}
{"text": "Y’all respond to each other super fast lol", "label": 0}
{"text": "Well no", "label": 0}
{"text": "This is the same as me and my wife, except it's with our kids.", "label": 0}
{"text": "...just avoid the trees?", "label": 0}
{"text": "After doing large projects where I have to make predictions as to when I will be finished, I totally understand the status bar now. I mean, if I was able to get 90% of the work done in 9 days it stands to reason I only need one more day to finish right? Right? Yeah right. The last 10% is always the hardest", "label": 0}
{"text": "Really? I'm tall and experience this a lot, and I think it's well worth having to duck occasionally to have green living spaces filled with trees and plants.\n\nMaybe the growth is extreme where you live to the point of causing some genuine danger or harm- but if not, why not just duck and let the trees grow?", "label": 0}
{"text": "Im 193cm and I've done this before. Half my neighborhood called me a \"tree Karen\" and the other half made me out to be a local hero.\n\nStill wasn't worth it though. I have just resigned myself to pulling tree debris out of my curls after a walk.", "label": 0}
{"text": "It’ll work at first and then I stop using it overtime and forget I’ve tried boards before and a lot of strategies so instead I just set alarms now", "label": 0}
{"text": "Unless that humour is Phil from modern family, god do I hate Phil from modern family..", "label": 0}
{"text": "This was a long time ago, when we still had crappy internet.", "label": 0}
{"text": "Damn someone saw me...", "label": 0}
{"text": "Can confirm, its the best way to turn 7am into 11:30am.", "label": 0}
{"text": "i once got poked in the eye with a branch while walking my dog at night and my eye had the worst itch/pain for at least a week. I definitely squint while walking near neighbors trees in the dark now", "label": 0}
{"text": "That's fucking hilarious", "label": 0}
{"text": "maybe joggers are like t-rex and have vision based on movement alone", "label": 0}
{"text": "I hit my head on a tree back when I was 4yo. I was running and didn't duck, which ended up with me getting stitches. My father used to tease me by telling the story of how I was sitting peacefully on the grass when an angry tree came running to me and hit me lmao", "label": 0}
{"text": "I remember when installing a 60gb game on an xbox took an hour, now I can download a full 100gb in like 20 minutes tops", "label": 0}
{"text": "As a very tall person, I don't mind the trees. It's a small price for a nice bit of plant life.", "label": 0}
{"text": "I think that’s the joke.", "label": 0}
{"text": "So why use your two fingers and not your hand? This picture honestly looks painful on your bones", "label": 0}
{"text": "DDTer spotted", "label": 0}
{"text": "Dream house", "label": 0}
{"text": "That is really rude?", "label": 0}
{"text": "Man i love reddit comments", "label": 0}
{"text": "She is correct", "label": 0}
{"text": "\"*Get hit* in the face\"? Do these people have the Whomping Willow in their backyard?", "label": 0}
{"text": "Omg that’s my dumbass boyfriend and me. On paper he’s a very smart and responsible man, and I’m a hot mess; in reality, he’s a himbo and I run everything", "label": 0}
{"text": "Yea I feel you.\n\nFor me if one roadblock happens (pen runs out of ink) that's it GG routine is over.", "label": 0}
{"text": "Probably lol. Sometimes its hard to tell if someones joking tho.", "label": 0}
{"text": "You sound like a constantly pissy boss, you should look into that as a career path.", "label": 0}
{"text": "I give myself that pep talk, and then my brain counters with \"if we die there will be no more bills or stress\", and then I have to give myself a pep talk to not listen to that.", "label": 0}
{"text": "nothing is free. a free app will extract value from you some way.", "label": 0}
{"text": "Sounds more likely that he is going to deliver male.", "label": 0}
{"text": "I feel the same way for cars parked blocking sidewalks.", "label": 0}
{"text": "While funny, it's obvious this comment is coming from someone who doesn't run.", "label": 0}
{"text": "While I agree the commenter is reading wayyyy too into the texts and dynamic here, it takes just a second to swing over to a sub like relationship advice to see that division of labor is a huge point of contention in relationships", "label": 0}
{"text": "https://orhanergun.net/optimizing-tcp-window-size-bandwidth-delay-product#:~:text=TCP%20Windowing%20Mechanisms,sending%20and%20receiving%20window%20sizes.", "label": 0}
{"text": "I still don't understand how it works, it just flashes random numbers.", "label": 0}
{"text": "Where do you draw the line on this logic? If I put barbed wire on the sidewalk outside your house and said \"just avoid the stationary object bro\" I don't think you'd be happy.", "label": 0}
{"text": "I’m 150 cm and hate walking so I can’t understand your plight but good luck with your fight for your people (also uh idk why you’re being downvoted lol sorry?)", "label": 0}
{"text": "I think this is a natural selection tree. It should stay as it is", "label": 0}
{"text": "Redditors are not a random sample of the entire population. It doesn't surprise me at all that a sub like that is full of cynical, anal retentives as well.", "label": 0}
{"text": "Unlike a lot of things. You can succeed in this game if you are jobless and got nothing to do.", "label": 0}
{"text": "> so he can get away with it\n\nI think it's legal anyway. I know it's legal to cut a neighbor's branch that hangs over your property.", "label": 0}
{"text": "in many places its the property owners responsibility to maintain the sidewalk.", "label": 0}
{"text": "So they can poke an eye out next time?", "label": 0}
{"text": "But doesn't ladder.", "label": 0}
{"text": "To me it’s always a rebuttal before years of experience in a marriage make me delete it and finally retyping it as ‘ok’", "label": 0}
{"text": "tbf, I really don't mind, she's living her best life", "label": 0}
{"text": "He had an excuse at least", "label": 0}
{"text": "As other 6'3\" dude, agreed, but the number of tree branches, overhangs, and other things that are taller than the brim of my hat but not as tall as the top of my head is TOO DAMN HIGH.", "label": 0}
{"text": ">My wife cannot safely operate the chainsaw, so I don't expect her to trim the trees.\n\nI feel like this could be easily fixed by teaching her how to safely operate the chainsaw.", "label": 0}
{"text": "So many people think it's OK to let their plants grow wild in to common spaces.\n\nThe reasoning sounds similar to those that let their kids and dogs run amok without regard to anyone else.", "label": 0}
{"text": "There is plenty of space in your yard for a tree to grow, I shouldn't have to walk into traffic to get past your house.", "label": 0}
{"text": "Yeah, up shit’s creek without a paddle", "label": 0}
{"text": "Why doesn't SHE trim the branches ?", "label": 0}
{"text": "There's one download site I know of that won't start the download countdown unless you're in that tab of the browser.", "label": 0}
{"text": "Bruh some of y’all are taking this way too seriously lol. It’s a funny post, just laugh and move on.", "label": 0}
{"text": "Well, next game, bring some trimmers", "label": 0}
{"text": "As soon as someone confirms a cancellation, I'm off to bed.", "label": 0}
{"text": "He asked calmly", "label": 0}
{"text": "Meeeeeowwwwwwwww", "label": 0}
{"text": "No mercy for all of the drooling idiots who run into Trees and whine that it isn't their fault. There is no limit on the amount of coddling they demand from the world.", "label": 0}
{"text": "You should post this on unpopular opinions lol", "label": 0}
{"text": "puke on the carpet", "label": 0}
{"text": "You’re never going to go to sleep because the cover up is too grandiose and has been scrubbed off the Internet since 2007", "label": 0}
{"text": "The difference, of course, being I haven't taken the position that trimming branchers is difficult so or worth complaining about..\n\n> I can be snarky too.\n\nNot very well you can't.", "label": 0}
{"text": "You just described half my job", "label": 0}
{"text": "We can let the trees grow while also trimming them so people can use the sidewalk for its intended purpose. Pushing my kid in the stroller it's annoying having to move to the grass instead. And again, I'm only slightly inconvenienced so I'm not like up in arms or anything like that. You could make the point that someone with mobility issues should be able to use the sidewalk unimpeded as well but again, that's not my main complaint right now. \n\nI just think we can keep it trim for everyone while still enjoying having nice greenery", "label": 0}
{"text": "Me to myself every morning", "label": 0}
{"text": "Yes. You can also do it like the rest of the world. Don't want it? Fine, I can also keep the 21 cents", "label": 0}
{"text": "I don't think they're mutually exclusive, trimming isn't going to remove the tree. But yeah I'm not bothered by it enough that I'll do anything, I just walk around. But I'll make a comment about it.", "label": 0}
{"text": "Folding in a nutshell 101", "label": 0}
{"text": "No shit, but that's not what we're talking about. I presume you don't marry someone based on their yardwork capabilities. I don't care that she can't operate the chainsaw, I'm not complaining about it. But I am capable of understanding that there are things that I can do that she cannot, and things she can do that I cannot.\n\nAgain, it's not about finding a perfect 50/50 division and lambasting the person who isn't keeping up. It's about being a team and getting shit done *together*.", "label": 0}
{"text": "Shouldn't that be /r/marijuanaenthusiastlaw ?", "label": 0}
{"text": "As a former USPS postal carrier, I can confirm that people write the dumbest notes I've ever seen.", "label": 0}
{"text": "My city has an app where you can report it and they'll cite the owners. I've only done it once with an empty lot nearby where they let the trees grow into the sidewalk...if you're wasting space like that and also not maintaining your property, I have no qualms with reporting it. Got trimmed!", "label": 0}
{"text": "If it feels like 2 minutes it's been at least 8", "label": 0}
{"text": "Don't forget sidewalk umbrellas in front of stores and E-Z Ups everywhere.", "label": 0}
{"text": "I'd be more inclined to just talk to my neighbors first without getting the man involved but it's nice to have that option", "label": 0}
{"text": "why tf do we fold… there is NO better way to store clothes so they don’t get wrinkled?", "label": 0}
{"text": "Eh, you tend to cast your gaze down to avoid things like taking a tree branch to the eye or stepping on guys under 6'2\".", "label": 0}
{"text": "We are bacteria living on a marble under an aliens microscope observing us ヘ⁠（⁠。⁠□⁠°⁠）⁠ヘ", "label": 0}
{"text": "yeah that's what we say. Why not have the other grown adult do it instead of assigning tasks to others? ;)", "label": 0}
{"text": "Same goes for humans.", "label": 0}
{"text": "That’s how I got to four. Do not recommend.", "label": 0}
{"text": "It's so hard to find capable staff these days! Why do I even keep around this imbecile? \n\n- the cat probably", "label": 0}
{"text": "I think the city owns the actual tree but you maintain it, kinda like the sidewalk. So it should be trimmed and I bet I could call and get it taken care of but I would rather just ask the owner or even ask if I could do it for them. No need to get the man involved", "label": 0}
{"text": "Sounds like the same person is doing both unless they want to sleep on the couch.", "label": 0}
{"text": "Those dogwoods are an aggressive breed and should be put down not if their owners are allowing to roam the neighborhood attacking strangers.", "label": 0}
{"text": "Yes indeed", "label": 0}
{"text": "Yeah, especially depending on the arena. Our local sports radio talk show host had a whole rant about it for a while which made me conscious of it.", "label": 0}
{"text": "depends on wether you got told to trim the branches or had to tell your spouse to do so", "label": 0}
{"text": "God i wish", "label": 0}
{"text": "You will be right once every decade of marriage. The \"event\" will come suddenly and without warning. Make sure to savor it and remember it so that you can look back on it with fondness.", "label": 0}
{"text": "Wow, you made it to the mirror.", "label": 0}
{"text": "It's a bald eagle", "label": 0}
{"text": "You don't lose if you don't have a job :)\n\nAs you see my IQ is higher than my salary", "label": 0}
{"text": "Why is that gentle? Seems normal to me?... What could have been better? Writing in caps? More direct?", "label": 0}
{"text": "Why...can't she do it?  Like, she's obviously there and he's obviously not so....why's he gotta do it?", "label": 0}
{"text": "They paid her for doing her job. They asked for coffee, she gave them coffee. What part of that requires extra payment? \n\nIf it was a restaurant where she consistently checked in on me to make sure I had what I needed to enjoy my time there, then I'd give extra. \n\n\"Keep the change\" is a simple way to save a few seconds for her and give her a small amount as a thank you for, hopefully, not messing up the order. If every customer does the same she'd end up making a modest amount by the end of her shift.", "label": 0}
{"text": "cocaine do be like that", "label": 0}
{"text": "P.S. I will be autistic purple vampire this year.", "label": 0}
{"text": "Great job.😂", "label": 0}
{"text": "I discovered that I could sleep on a bed while sitting up, cross-legged, thanks to this.", "label": 0}
{"text": "I've always wondered why so many people have multiple alarms with different minute marks. It's actually helpful if you accidentally hit the stop on the first alarm.", "label": 0}
{"text": "Putting future at stake in exchange for few more winks. As I got older, I regret it less", "label": 0}
{"text": "Unfortunately, we are the first generation that has ever had to communicate through text. Previous generations never had the same problems.", "label": 0}
{"text": "Foldit like a pro they say...", "label": 0}
{"text": "Well this time feels like the best time of the whole night..until you wake up suddenly realizing you felt asleep again and my god what time is it.\n\nIn fact doing something similar.. as with a young child which wakes multiple times a night (and so also me) i also dont put the first alarm anymore as he will probably wake me anyway early morning", "label": 0}
{"text": "\"extra fabulous comic\"", "label": 0}
{"text": "True enough lol", "label": 0}
{"text": "\"We have to stop saying 'we'.\"", "label": 0}
{"text": "As a 6'2 I don't have severe separation anxiety over large squares of concrete and also respect the right of way of wood. Sounds like a skill issue.", "label": 0}
{"text": "Marriage should be a balance of personalities.", "label": 0}
{"text": "It's not. The best majority of officers are good people trying to help you.", "label": 0}
{"text": "It’s not always just one branch and at times it’s low enough for someone who is 5 ft. would have to duck.  It’s not that hard to trim the trees so that people can enjoy taking walks. It’s not that hard to not park the car to where it blocks the sidewalks. It’s not that hard to be decent.", "label": 0}
{"text": "Call the county or city and they might get to it eventually. My county gets to it quickly. Hell, I’m in the 5 person crew that does it. ", "label": 0}
{"text": "And most of those are the 'professionals' you're talking about. Being a landscaper doesn't give you magic ladder powers", "label": 0}
{"text": "If you *have to walk into traffic*, then yeah, I agree that that's excessive. I've literally never seen anything close to that, though, and we were talking about having to duck, which is quite different.", "label": 0}
{"text": "how about a werewolf barista this year? 🤔", "label": 0}
{"text": "30s, I’ll never stop. Cremate me with my plushies! ALL OF THEM", "label": 0}
{"text": "A classic game of How late can I be and still make it to work? 😅", "label": 0}
{"text": "side effects may include panic and a frantic search for matching socks 😂😂😂", "label": 0}
{"text": "The ultimate test of willpower: can you resist just one more five minutes? 🤧", "label": 0}
{"text": "> And again, I'm only slightly inconvenienced so I'm not like up in arms or anything like that.\n\nYeah, I think having natural growth of trees and plants is worth this sort of mild inconvenience.", "label": 0}
{"text": "October 25,2024 - I don't want to be a killjoy here, but I'm pretty sure this is just a joke. Someone used a pretty accurately made statue of a child and covered it in what looks like mud, but could be anything. The \"eyes\" give it away I think.", "label": 0}
{"text": "Nah, it’s just being with someone for a long time. I used to think something like this meant the guy was hen-pecked, but I’ve since come to realize it’s more just acknowledging that if your partner cares enough about something and you don’t care about that thing very much, just go with what they want. As long as they’re doing the same for you in turn, then it’s all good. ", "label": 0}
{"text": "October 25,2024 - I don't want to be a killjoy here, but I'm pretty sure this is just a joke. Someone used a pretty accurately made statue of a child and covered it in what looks like mud, but could be anything. The \"eyes\" give it away I think.", "label": 0}
{"text": "October 25,2024 - I don't want to be a killjoy here, but I'm pretty sure this is just a joke. Someone used a pretty accurately made statue of a child and covered it in what looks like mud, but could be anything. The \"eyes\" give it away I think.", "label": 0}
{"text": "October 25,2024 - I don't want to be a killjoy here, but I'm pretty sure this is just a joke. Someone used a pretty accurately made statue of a child and covered it in what looks like mud, but could be anything. The \"eyes\" give it away I think. Sorry your grandma isn't with us anymore though. Stay well.", "label": 0}
{"text": "Why can't she trim the branches?", "label": 0}
{"text": "Garbage troll🤣", "label": 0}
{"text": "Did this this morning and was late☹️", "label": 0}
{"text": "It's hard to deal with that", "label": 0}
{"text": "After hearing that phrase, it's like reinventing", "label": 0}
{"text": "This is a great example, as well. I can’t tell based on the text alone if this if a good-faith ribbing or a bad-faith mischaracterization of my acknowledging text lacks indicators that oral communication provides. Well player, Mr. Rabbit.", "label": 0}
{"text": "I would divorce her", "label": 0}
{"text": "It’s not my tree, it’s the city’s tree.", "label": 0}
{"text": "Not helping the insufferable accusation", "label": 0}
{"text": "Bro is crying about tree branches. Just duck.", "label": 0}
{"text": "Even granting that, it’s still not a good idea to let cops have free rein in a search. If they find your hidden drug stash, i doubt they’ll say “you really should get off that stuff man, here’s some rehab resources”. More likely is they’ll just arrest you for possession.", "label": 0}
{"text": "...Liam Monster Prom?", "label": 0}
{"text": "Those are an odd collection of otherwise unrelated things. \n\nIf it makes you feel any better, there’s virtually no use in recycling plastic. Virtually all of it will end up in a landfill or incinerated. The amount of plastic that actually gets recycled is in the low single digits, and most of what does actually get recycled is manufacturing waste. Pretty much no post-consumer plastic gets recycled.", "label": 0}
{"text": "If there's any chainsawing to do, damn right I'm doing it", "label": 0}
{"text": "the tree should try for a championship 🏆", "label": 0}
{"text": "sorry to break it to you bro, but you're hen-pecked now\n\n/s", "label": 0}
{"text": "It’s not different approaches so much as it’s the wife understands their property liability and the husband doesn’t.", "label": 0}
{"text": "My only problem is with fitted sheets...\n\nIt's either, there surprisingly easy or the same as Helen Keller driving around backwards.", "label": 0}
{"text": "https://m.youtube.com/shorts/FHKhj_T4c_E\n\nLol", "label": 0}
{"text": "hey bro ask my name at least before attackin me like dat", "label": 0}
{"text": "This is not correct. About 2/3rds of cats are, and about a third are not.", "label": 0}
{"text": "Something’s wrong, shut the light", "label": 0}
{"text": "About a third of cats are not lactose intolerant. Ask your vet.", "label": 0}
{"text": "Do people really get asked how much blood they want to donate? I thought it was a fixed amount every time.", "label": 0}
{"text": "# Call JG WENTWORTH 887-CASH-NOW!", "label": 0}
{"text": "sometimes I dream that I've gotten out of bed", "label": 0}
{"text": "The best thing I usually do is set alarm for 6am and a pre alarm 15 mins before. Both play a fire 🔥 beat worth grooving to, so you're generally in a good mood as you wake up. Doesn't work all the time, because I realized I woke up before the alarms ring to disarm them and go back to sleep. It seems my brain has determined that the solution it created became a problem and circumvented a way to stop that from happening, so now I have to set an alarm again.", "label": 0}
{"text": "So, I am not going to get into the “police are good/bad people” thing, but as police. Their job is to enforce the law, which means that if they are interested in talking to you. They probably think that you, in one way or another, have some connection to someone that has broken the law (even if it’s as simple as living near where a crime occurred). Any time you talk to a police officer, you truly are risking saying something stupid that makes them more interested in you than they should be. People can and have done time for either saying something to a police officer that has been taken the wrong way, spiraled out of control, and caused that police officer to believe this person has committed a crime. Maybe it’s because that officer has some bias, maybe it’s because that officer is overly ambitious to advance their career, or maybe something else. But it has happened. There is a reason why the right to remain silent has been part of the constitution since its original drafting. Because police gonna police. \n\nThis video explains it way better than I can. It’s long, but it’s a fun and interesting listen\n\nhttps://youtu.be/d-7o9xYp7eE?si=itpO81cl_f5SeHFL", "label": 0}
{"text": "Then it would only be reasonable to deduce that either we are both idiots or neither of us are.", "label": 0}
{"text": "Haha maybe and I just deluded myself into thinking it’s all good. ", "label": 0}
{"text": "How he looked saying “Ok”: ☹️", "label": 0}
{"text": "You can literally have it both ways if people just trim their overhanging branches", "label": 0}
{"text": "nice to met u", "label": 0}
{"text": "Got one", "label": 0}
{"text": "Sharp Hand Joe probably appears in their no-name nightmares", "label": 0}
{"text": "Mmmm chimken", "label": 0}
{"text": "Grab my terry fold flaps.", "label": 0}
{"text": "What's your bloodtype ?\n\nVery negative.", "label": 0}
{"text": "Did this just this morning. Alarm set to 6am, turned it off, rolled over, woke up at 9:30. Quite a bit late to work 😂", "label": 0}
{"text": "A comfy bed and a warming blanket is just peak life satisfaction ngl", "label": 0}
{"text": "Yo what if the nurse was a vampire and they just wanna get sucked off", "label": 0}
{"text": "Brother did it.", "label": 0}
{"text": "and when you have a job... every time you win, it’s a miracle. Every time you lose, it’s a mad dash to the coffee maker", "label": 0}
{"text": "Not sure they were but regardless, they're in the way. But fun fact actually just went on a walk and two of the trees that have been issues this summer have been trimmed. So looks like case closed.", "label": 0}
{"text": "Not if I have anything to say about it", "label": 0}
{"text": "I love relatable memes", "label": 0}
{"text": "so it’s ‘download and chill’... for the next millennium 😂", "label": 0}
{"text": "Sure can do.", "label": 0}
{"text": "Mind? I'm already in dreamland!", "label": 0}
{"text": "yea lol he's like one of the most beloved sitcom characters of all time", "label": 0}
{"text": "Strangely, I feel nothing from a hug.", "label": 0}
{"text": "Bro if it's a right turn just take it to the shoulder what you doin", "label": 0}
{"text": "I trim our trees. I smoke weed and zone out while I’m out there for like an hour or two. It’s not too bad.", "label": 0}
{"text": "$0.99 for a useful, ad free app that just works and docent request access to every peripheral of your phone? Ill take that any day of the week.", "label": 0}
{"text": "I get what you're saying. If you're not paying for an app, you're usually being sold as a captive, targeted audience to advertisers.", "label": 0}
{"text": "This is just called “Going back to sleep”", "label": 0}
{"text": "longhoused", "label": 0}
{"text": "100% agree. My wife and I answer each other with thumbs up or just react to the last message. I'll make a dad joke or something like OPs and follow up the same, but we both know what was being asked and that it's being taken care of. For instance from earlier today!\n\n'Ah crap, I cut myself'  \n'Well why did ya go and do that?!'  \n'Bandaid please'  \n'Yep!'", "label": 0}
{"text": "“Well no” 🤣", "label": 0}
{"text": "I really feel like it should have been “well yes, but you gotta trim the branches. “", "label": 0}
{"text": "Ohhh man that is terrifying.", "label": 0}
{"text": "Maybe they're Canadian?", "label": 0}
{"text": "I try my best to be, and I feel sad knowing that some people just can’t accept that this is the case. I still try though. It’s the best thing to do.", "label": 0}
{"text": "Is she incapable?", "label": 0}
{"text": "And then you shake it all about", "label": 0}
{"text": "This happened to me once  a few years ago now when I first went to a tech college for information technology. I was 17 then I was supposed to leave for school at 6AM I had an alarm set that did go off but I didn't and don't remember it going off or waking up. I remember waking up at 10:51 the sun was bright out thinking wow this is a nice weekend. My parents were gone so I walked out pet the dog and sat down for some breakfast. Then I hear someone open my door and it's my grandmother and she's like your parents told me they didn't see you leave for school on the doorbell cam and to come see if you left or not and I was like it's Saturday I don't have school and she was no it's Friday and that's when the realization kicked in and I was like oh crap then came the panic and getting dressed and running to the door to try and be at class for the rest of the day lol.", "label": 0}
{"text": "I just do it so much that my internal alarm clock wakes up when I have no more time left to sleep in", "label": 0}
{"text": "The first minute after the \"just five more minutes\" feels like hours, and the last 4 minutes are actually hours", "label": 0}
{"text": "My cat spams D everyday", "label": 0}
{"text": "That's the answer of a great listener partner", "label": 0}
{"text": "Sweet sucking execution", "label": 0}
{"text": "Somebody Suck Me!", "label": 0}
{"text": "Never won that game smh", "label": 0}
{"text": "with a little toe gripping too", "label": 0}
{"text": "Asmr chiro", "label": 0}
{"text": "Yes. Instead of donating the normal amount of 1 pint, there's now an option to donate 2 pints of blood using the machine setting that returns the non-blood stuff back to you. But choosing this option means that you have to wait twice as long between donations to replenish your blood.", "label": 0}
{"text": "Me trying to master detachment but low-key hoping they realize what they're missing and come crawling back 😂", "label": 0}
{"text": "Well risking everything for 5 min of extra sleep ... I would call it the greatest game ever played", "label": 0}
{"text": "When you realize being a 'natural talent' actually requires...effort? Nah, I'm good", "label": 0}
{"text": "When you wanna be a famous character for Halloween, but the budget and copyright lawyers say 'Nah' 😂", "label": 0}
{"text": "Killer clown with lazy eye that loves red balloons", "label": 0}
{"text": "you forgot the break something option", "label": 0}
{"text": "Peace of mind is all that matters!", "label": 0}
{"text": "this may not be for me after 5 seconds", "label": 0}
{"text": "passed down to generations", "label": 0}
{"text": "I make assumptions of my death so i need to work to buy everything before i perish", "label": 0}
{"text": "sometimes i'd wonder why i accepted to go out in the first place", "label": 0}
{"text": "Fitted sheets fold themselves!\n\nAt least that’s what I say when I shove the bundled pile into the closet lol", "label": 0}
{"text": "Of the good ones a fair number are unfortunately incompetent which is still an issue. My roommate had a breakdown not long ago and needed to be escorted by police to the hospital psych unit. Not 30 minutes after they left I got a phone call from said roommate telling me they left him at a McDonald's across town. No calls made to me, who was there when they came to get him or to the person who called in that he was having a mental health crises. They just left a person having severe schizophrenic delusions alone in a parking lot with no guaranteed way to get home.", "label": 0}
{"text": "Best decision ever!", "label": 0}
{"text": "Looks photoshopped. Shadows are going in different directions.", "label": 0}
{"text": "ok", "label": 0}
{"text": "Sounds good, doesn't work (literally)", "label": 0}
{"text": "Is there a presumption of innocence on your country?", "label": 0}
{"text": "never done this, i DO NOT trust myself", "label": 0}
{"text": "You keep telling yourself that you didnt make any judgement but you DID", "label": 0}
{"text": "F)Bite fingers", "label": 0}
{"text": "Space balls.", "label": 0}
{"text": "Why can’t she do it?", "label": 0}
{"text": "easy prediction 😭", "label": 0}
{"text": "He was an olympian in the past life", "label": 0}
{"text": "Lol not my dogs. Theyre going to race out the door to chase whatever that fucking thing is.", "label": 0}
{"text": "well, i didn't need that kind of honesty today 🤧", "label": 0}
{"text": "5 seconds of trying? That’s enough for today", "label": 0}
{"text": "'All or Nothing’ brain approach", "label": 0}
{"text": "Your joke confused me too until I went back and recontextualized OP as saying \"I walk into trees a lot because I am 6'3\" instead of \"I get voluntold chores by my wife a life because I am 6'3\"", "label": 0}
{"text": "You go ahead an risk the health and well-being of your cat. And for what? What do they need milk for?", "label": 0}
{"text": "All posts must be titled me_irl (with any single character between \"me\" and \"irl\"). But feel free to post this again with that title", "label": 0}
{"text": "All posts must be titled \"me_irl\". But feel free to post this again with that title", "label": 0}
{"text": "I do be like that. So now i practice practicing so i can practice being able to do other things", "label": 0}
{"text": "I would call it \"satisfaction\" because I already know they ain't coming back", "label": 0}
{"text": "Whoa, easyyyyy! I’m not done with my masterpiece...", "label": 0}
{"text": "Better than stuck in 99%", "label": 0}
{"text": "In my entire history of being an internet connoisseur, this is the most real post I’ve seen in my life. Shit affects me every mfing day", "label": 0}
{"text": "Why can't she do it lol", "label": 0}
{"text": "Hedge trimmer: ❌\nTrail cam: ✅", "label": 0}
{"text": "Most people can't support their bodyweight by one hand so it probably isn't", "label": 0}
{"text": "Fuck yeah I did, Nick", "label": 0}
{"text": "Lol, choices", "label": 0}
{"text": "Jake and Amy", "label": 0}
{"text": "That does sound nice.", "label": 0}
{"text": "I didn't say it was bad, I said it wasn't healthy. As humans we have a choice. Cats are just going to eat the best tasting thing in front of them regardless of health effects. Imo feed milk to adult cats is unnecessary, but people can do what they want", "label": 0}
{"text": "It happens like magic how time flies at this point, \n\nThe funny part is you never get satisfied with the nap LOL", "label": 0}
{"text": "Do you know how milk is produced?\n\nMilk is only made by mammals when they are pregnant and shortly after. Cow milk is industrialized by keeping cows pregnant until they physically can't - what is natural about that?\n\nAlso, you're kinda arguing my point. Milk is made by mammals to grow their babies (that's what they stop naturally producing it after the baby is big enough). This is common to all mammals. \n\nIdk wtf you're getting at regarding humans specifically switching on the genes after a period without milk, but that is straight up dairy industry brainwashing from my perspective.", "label": 0}
{"text": "Spongeknob", "label": 0}
{"text": "It's so hard to keep going fr", "label": 0}
{"text": "They got teabagging bots now?", "label": 0}
{"text": "Someone is not doing their back workouts", "label": 0}
{"text": "You say \"your brain\" as if that isn't just you my dude lol", "label": 0}
{"text": "Next step, stop trying me things... except for food.  All hail food.", "label": 0}
{"text": "If the rando street guy ran into it at face level. \n\nShe could have had it done in the time it took her to attempt to delegate to her husband.", "label": 0}
{"text": "I always hope, but they either forgot I existed or are glad I'm gone", "label": 0}
{"text": "If you're outside,  you shouldn't be afraid to touch the grass.....", "label": 0}
{"text": "The new CoD is out and I can relate to this", "label": 0}
{"text": "do not abbreviate Cheese Pervert, worst mistake in my life.", "label": 0}
{"text": "an evil laugh needs at least 3 \"ha\"s, separated by spaces.", "label": 0}
{"text": "We had someone knock on our door to complain their granddaughter walked into a branch that was sticking out from one of the trees around our house. They had a pair of Secateurs already in hand, demanding me cut it immediately. People will go to all sorts out lengths to avoid taking responsibility. How about, look after your granddaughter and be aware of your surroundings?", "label": 0}
{"text": "Same. Last CoD game I played was Black Ops 2. Installed the new one and was like, \"I used to play through these campaigns on veteran difficulty, so I'll just go one below that since it's been a while...\" Let's just say I got humbled.", "label": 0}
{"text": "And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?And for what? What do they need milk for?", "label": 0}
{"text": "Never learned to properly fail", "label": 0}
{"text": "Must be nice\n\nI'm not even a perfectionist in the slightest yet my brain always wants me to be good at everything😭", "label": 0}
{"text": "Trust fallen faster than a toddler on ice skates", "label": 0}
{"text": "Nah I'd win", "label": 0}
{"text": "Anything too hard in life is not worth doing. Remember that. Like snowbaording, martial arts, pottery or a math. If you're not immediately good at something, why do it?", "label": 0}
{"text": "Sometimes something else comes up that takes some time. People can also forget things. Not everything is a sign of trouble.", "label": 0}
{"text": "Ode to My Musical Disaster", "label": 0}
{"text": "Feels like 20 seconds is 10 minutes.", "label": 0}
{"text": "I wanted to try making 8-bit music. Downloaded the program, gave it about an hour, couldn’t do anything right. Gave up :(", "label": 0}
{"text": "It was playing  soft kitty.. warm kitty", "label": 0}
{"text": "he's a big guy", "label": 0}
{"text": "Thizz is what it is", "label": 0}
{"text": "Same here.\n\nThat's when you offer a solution, they won't take it then spend the next three weeks trying stupid things to finally use your solution and it works first time. Then they're like \"Wow, who would have knew we had to do that!\"", "label": 0}
{"text": "Facebook Boomer tier meme", "label": 0}
{"text": "I am both the cat and the dog in this situation ", "label": 0}
{"text": "\"No honey, WE got to trim it down. This is a equal relationship.\" \n\nI'm a femenist. I cook, clean, do laundry and childcare. If gender roles needs to be torn down it needs to be torn down on both sides. I want me an equal partner and a capable woman.\n\nAnd now I brace myself for the Conservative down votes 😆", "label": 0}
{"text": "That’s an interesting way to say a guy just walked into a treebranch", "label": 0}
{"text": "\"Stare motherfuckerly\" 💀", "label": 0}
{"text": "Man that’s domestic abuse. That poor dog is on eggshells the whole time", "label": 0}
{"text": "I mean it does. My point wasn't the percentage but the info that cats can have problems besides digestion. Milk and Lactose Products are not essentials for a cats live so why would you risk it? Don't cling to the fucking percent chance", "label": 0}
{"text": "lol", "label": 0}
{"text": "I remember reading most of an online article where the author was talking about how the Karate Kid screwed up a lot of kids' minds with the 5-minute montage of him getting good at karate, not to mention other movies with 5-minute montages of people getting good at something like Rocky.  Many folks think they can get good at something in no time and at all and that is often not the case in the slightest.", "label": 0}
{"text": "Dont put a dog in a cat house! Thats clearly a cat house bro cant chill", "label": 0}
{"text": "sometimes it just goes into one ear and out the other", "label": 0}
{"text": "Haha, me too thanks!", "label": 0}
{"text": "For the record I do have professionally diagnosed ADHD and I’m taking meds for it and all I don’t just say I have on the internet cause I get distracted sometimes or smth", "label": 0}
{"text": "gold bond", "label": 0}
{"text": "Yeah I have tried to normalise learning as a journey that begins with zero competence and ends in excellence that you can teach to others. I think that has helped them to see the early failures as a normal part of the process.", "label": 0}
{"text": "body on set to vibrate 😂", "label": 0}
{"text": "because once is never enough 🤩🤩🤩", "label": 0}
{"text": "I love it when people only gain confidence to comment negatively to already downvoted comments.\n\nIt’s pretty damn obvious that it’s a play on words: a man saying that he has **literally** never experienced a period.", "label": 0}
{"text": "aiming for a melody, ended up with a demolition 😂", "label": 0}
{"text": "You got the best flex ever doubled up on wins!", "label": 0}
{"text": "I need this", "label": 0}
{"text": "Update: three", "label": 0}
{"text": "Same person? Or just chasing booty all over?", "label": 0}
{"text": "“Hay can you itch a spot for me?”\n\n“See, where?”\n\n“Rump.”", "label": 0}
{"text": "Word! 🙌🏼", "label": 0}
{"text": "Then even if you do put thousands of hours into something you're still shit and never improve so it just reinforces the idea in your head that you're incompetent enough that it's not worth trying in the first place so you just give up after 5 seconds or don't even try new things at all tee hee.", "label": 0}
{"text": "If I had this tattoo, I’d need a geography teacher as my wife so she’d know where to scratch", "label": 0}
{"text": "I was raised that way. Parents let me try anything. 10 minutes if I hadn't shown some meritable natural,skill and talent. Then I was quickly redirected to another thing.  ( If you aren't able to do it somewhat the first try, ya dumb and ought to quit. That and what parent wants  their kid to keep struggling at a fruitless endeavor)", "label": 0}
{"text": "I really need a firm hand around my North Pole", "label": 0}
{"text": "So for me this normally isn’t like, I can’t do math or i can’t talk to people, it’s more like, I tried wrapping Christmas gifts and anyway I did it, it looked like shit and I would start getting mad like, it’s wrapping fucking presents why can my head not get around this.", "label": 0}
{"text": "The satisfaction of then making progress is way greater, though. Feeling proud of yourself rather than feeling proud of others' admiration.", "label": 0}
{"text": "Hell nah, my brain ain't black", "label": 0}
{"text": "Get a Strebe 95' instead of a Mercator okay? For me?", "label": 0}
{"text": "I hate this one. 😒 \n\nShame on the owner.", "label": 0}
{"text": "Oh, it turns out that makes sense", "label": 0}
{"text": "What did they do to my boy Germany", "label": 0}
{"text": "'No, not the _Democratic_ Republic of Congo'", "label": 0}
{"text": "Yeah, this is a super repulsive character trait to me. Not even trying out of fear of failure is worse though.", "label": 0}
{"text": "“Sucking at something is the first step towards being sorta good at something.” -Jake the Dog\n\nI remind myself of this all the time", "label": 0}
{"text": "But wait neither is fiction, right?", "label": 0}
{"text": "Drawing, or any form of art ever:", "label": 0}
{"text": "Yeah that's just nonsense right there.\n\nIt amazes me that some people refuse to believe what's literally right in front of them. 😒 🙄", "label": 0}
{"text": "Tf you mean \"ruins it\" blud makes it look better I mean the mf is blonde so checks out.", "label": 0}
{"text": "Helllll nawh,even as a joke, what a defeatist mentality! Acts become habits,I won't ever make quitting a habit.", "label": 0}
{"text": "I wonder if the colors represent where he has been.", "label": 0}
{"text": "To be fair it's super stressful trying to learn a sport from scratch as an adult. There's so much anxiety and embarrassment around it. It takes a long time to get something good out of it, if at all.", "label": 0}
{"text": "when I got bored, but I found a way to diversify my life.", "label": 0}
{"text": "I don’t think I’d be able to feel the distance between Andorra and Liechtenstein on my back.", "label": 0}
{"text": "He’s not mad he just wants some fun", "label": 0}
{"text": "It's more about reminding someone every time you see them how worthless they are so they know their place beneath you.", "label": 0}
{"text": "Who says you’re not depressed when detached?", "label": 0}
{"text": "Bullies don't care if you're ugly. They pick someone who's unlikely to fight back and hurt them.", "label": 0}
{"text": "It's sad how much it's true.", "label": 0}
{"text": "Me trying to get into fighting games.", "label": 0}
{"text": "Yeah and if they think you might have a chance they bring their 3 friends to make sure you can't fight back😐", "label": 0}
{"text": "The person who wants to trim the branches is the right approach, the other is the wrong approach. You can call them different if you want, but they aren't equal.", "label": 0}
{"text": "They want to date you", "label": 0}
{"text": "It's called ADHD friend", "label": 0}
{"text": "I mean I call my bros some very mean things, they also bully me as well so idk..\n\nMaybe I should be more mature when I fool around too much or... nah\n\nY U UGLY?", "label": 0}
{"text": "Trust me. You don’t want it. Especially since the hurricane. Needs a new roof now among many, many expensive repairs (most of which were needed before the hurricane). Riding lawnmower on the fritz so it’s push mowing until I win the lottery.", "label": 0}
{"text": "Said Dumbledore", "label": 0}
{"text": "Fuck that. Just shove the whole box in there", "label": 0}
{"text": "Not to condone it at all, but to be fair, they’re the ones having to see it all the time", "label": 0}
{"text": "because they actually think you’re cool but hate the fact that you can’t be seen with them", "label": 0}
{"text": "The short answer is that you're wrong. Cats and dogs also have many different personalities. You're just being weird.", "label": 0}
{"text": "Me too thanks", "label": 0}
{"text": "Pristine_Nature4973 is a bot", "label": 0}
{"text": "Electrical-Cry4780 is a bot", "label": 0}
{"text": "RunwayReign2 \n\nElectrical-Cry4780\n\nand Pristine_Nature4973\n\nare bots in the same network", "label": 0}
{"text": "RunwayReign2 \n\nElectrical-Cry4780\n\nand Pristine_Nature4973\n\nare bots in the same network", "label": 0}
{"text": "I think it’s just a meme", "label": 0}
{"text": "Its about power, not ugliness", "label": 0}
{"text": "Bullies don't give a damn about your appearance. They choose someone who is unlikely to harm them in retaliation.", "label": 0}
{"text": "It's like they need a target to feel better about themselves. It's all about their insecurities, really.", "label": 0}
{"text": "Hey now hey now", "label": 0}
{"text": "They weren't that nice with the native people in residential schools", "label": 0}
{"text": "you guys have these many options just for milk", "label": 0}
{"text": "My looks ruined your day? Please let me know how I can inconvenience you further", "label": 0}
{"text": "They have to look at it i guess", "label": 0}
{"text": "If they have a problem with looking at ugly people, why do they still have mirrors in their houses?", "label": 0}
{"text": "It’s because bullies gotta feed their egos, which just shows how underdeveloped their brains really are!", "label": 0}
{"text": "They could ask me to my face at least???", "label": 0}
{"text": "What is real milk for you", "label": 0}
{"text": "Brilliant 👍 👏 🤣", "label": 0}
{"text": "I got a room of musical instruments ima get back to someday. Which ones the Rosetta Stone to unlocking the rest I wonder. Many Ts still holding", "label": 0}
{"text": "Me with BG3 rn bruh. It took me an hour and a half realizing I could sneak past those fucking intellect devourers in the ship. Now I went down some hatch after rolling a 20 and in some kind of ruins. What the hell is this game bruh", "label": 0}
{"text": "tbf, the point of bots is to make it seem liek you are better than real players. So what is more realistic than training ain AI off player data?", "label": 0}
{"text": "milk", "label": 0}
{"text": "Almond? Skim? 1%? 2%? Whole?", "label": 0}
{"text": "They didn't like me talking back so they decided to pick a fight with me, they were 3-4 years older so yeah I got my a** kicked only because I had good comebacks", "label": 0}
{"text": "for real, they feel stronger when someone doesn't fight them back that's why they're picking someone who's unlikely to retaliate", "label": 0}
{"text": "Me when my company told me it's perfectly fine to get things done at my own tempo, as long as it's consistent", "label": 0}
{"text": "Elohw¿  , %2¿ , %1¿  , miks¿ , dnomla¿", "label": 0}
{"text": "That's me, I hate it.", "label": 0}
{"text": "it's more on reminding someone how powerless and little they are, so the bullies can easily control and humiliate them more", "label": 0}
{"text": "No, I can't wheelie a bicycle because I don't own or ride a bicycle.", "label": 0}
{"text": "Reddit moment", "label": 0}
{"text": "I’m bully resistant, being quiet a lot of people first assume that I’m shy and timid, but in reality I just don’t fuck with people I don’t know and hate small talk.\n\nLeads to interesting moments where someone shows their true colors and I either clap back or act cold/ like they don’t exist. After a few interactions I guess they see that nothing’s working, I’m just staring them down, and they start trying to act cool towards me. Despite being a pacifist and walking on a cane, I somehow managed to give off the aura that if you make me snap I’d absolutely fuck someone up. I don’t know why me staring people down makes them scared, I think despite my soft face, I inherited my dad’s intimidating expressions and that mixed with my silence makes me way more unpredictable and intimidating than I prefer, but it’s good bully repellent.\n\nJust wished it worked on my toxic dad, apparently it worked one time when he threatened to throw the iPad I bought in the pool. Overheard him saying I gave him a death glare and he never threatened to mess with my stuff after that. The fuck is my death glare?! I need to see how intimidating it is, I don’t wanna look like I could kill someone", "label": 0}
{"text": "Wow", "label": 0}
{"text": "When my phone lets me look at three browser windows at once we can talk about big purchases", "label": 0}
{"text": "Mobile web pages are horrible, compared to desktop. This isn't an opinion.", "label": 0}
{"text": "damn so many choices, they are really milking everything these days...", "label": 0}
{"text": "Had a friend tell me if he doesn’t do something on the first time he feels like a failure and stops, and that’s some of the dumbest shit I ever did hear.", "label": 0}
{"text": "Yes, and the best one will always be 2%.", "label": 0}
{"text": "Funny black woman", "label": 0}
{"text": "Zaire.  If you please.", "label": 0}
{"text": "Fr, all the big subs are full to the brim with bots", "label": 0}
{"text": "That dog’s got a real touchy startle reflex. Could just be a goofy dog scared for no good reason, I suppose. Either way, I hope they’re in a good home <3", "label": 0}
{"text": "Savings? What's that like?", "label": 0}
{"text": "From the udder", "label": 0}
{"text": "Me when I couldn't even tune a guitar", "label": 0}
{"text": "I try to adopt a gambler mentality around these things, after a sudden threshold, your old skills might incorporate into it after you get some of the basics down., so just brute force until then.", "label": 0}
{"text": "Not even getting into the ultrapasturized stuff", "label": 0}
{"text": "I'll have some sour milk, thanks for asking.", "label": 0}
{"text": "Okay but what the fuck do i do about it\nSo many hobbies im interested in but naaaah brain says no", "label": 0}
{"text": "Big bassball \n\nLittle bassball\n\nInflation\n\nSeems pretty straightforward to me.", "label": 0}
{"text": "That's me. If it's urgent just call and talk. If not, don't expect me to reply ASAP, I'll do it in my own time when I'm free unless we are already having a text conversation.", "label": 0}
{"text": "Pretty sure they are projecting. I got bullied for being quiet in school and it was always the kids that couldn’t shut up who bullied me.", "label": 0}
{"text": "Haha lucky you! Wish I knew how to act when some bully were picking on me. I actually tried just staring at them, but my eyes would get irritated and wet for whatever reason, and I would get more nervous and embarrassed. Ughhh I hated that so much.", "label": 0}
{"text": "Is this Zoomer?", "label": 0}
{"text": "Fr I never gotten bullied but it seems like they just want to pick on anyone that won’t fight back", "label": 0}
{"text": "i found the \"what a time to be alive\" part funny so", "label": 0}
{"text": "\"I can beat you up\". \n\"Yeah, I know, you're way bigger than me. What's your point?\"", "label": 0}
{"text": "its more about not being able to fight back rather than pure ugliness, makes them feel better", "label": 0}
{"text": "(Struggles to remember high school geography)", "label": 0}
{"text": "This is what dreams are made lf", "label": 0}
{"text": "Overly critical parents. This is currently something I'm dealing with and working through with a therapist. When I was growing up, my mom would call me stupid or incompetent for anything if I didn't do it perfectly.", "label": 0}
{"text": "did somebody say metroidvania", "label": 0}
{"text": "Take money from your savings > Declare that it's just this time and you deserve it > Feel guilty > Repeat.", "label": 0}
{"text": "My wife put the house on a diet and now we are back down at 2%. I miss the whole stuff", "label": 0}
{"text": "Best way to feel strong is to prove somebody is weaker than you. Bonus points if you can do it in front of a crowd. \n\nExplains a huge amount of shitty human behavior.", "label": 0}
{"text": "Placing a big bet on geopolitical stability!", "label": 0}
{"text": "\"because you must exist in this space we are both forced to occupy\"", "label": 0}
{"text": "Fuckin hell 😂", "label": 0}
{"text": "God this really made me chuckle. \nYea, NINA, SHAG and NOURA. \nShag, literally, your name is SHAG.", "label": 0}
{"text": "Yea. Usually Bullies are so pathetic that the best you can hope is they off themselves in adulthood.", "label": 0}
{"text": "Because my eyes have to endure it. /s", "label": 0}
{"text": "And if you‘re ugly AND fat then they can‘t even turn away to not see you.", "label": 0}
{"text": "I am going to change the picture and post it somewhere else as well...", "label": 0}
{"text": "People’s self-worth is frequently influenced by social comparisons. Individuals assess their own value based on how they see themselves **in relation to others**, especially within their peer groups. Bullies, who often struggle with low self-esteem, tend to find it easier to elevate their own **relative** social standing by lowering someone else, rather than working on their own self-improvement.", "label": 0}
{"text": "\"No, not Angola you stupid fuck. THE REPUBLIC OF CONGO\"", "label": 0}
{"text": "Because they are ugly and want to feel better than someone", "label": 0}
{"text": "Thanks, but I think I'll go fuck my wife and not think about it at all!", "label": 0}
{"text": "Because statistically, they usually are. Also- very much did not assume. Just... asked.", "label": 0}
{"text": "Addiction to power and superiority.", "label": 0}
{"text": "Dog: Why's this little demon so angry with me 😭       \n                  \nCat: Bored. Play.", "label": 0}
{"text": "Should have bought Apple stock too", "label": 0}
{"text": "Bullies have a pain inside and they cant do anything about it so they pick on other people to forget that they have their own pains..", "label": 0}
{"text": "Projection. They're mad that they're ugly etc.", "label": 0}
{"text": "I'd go to the doctor if I was him.", "label": 0}
{"text": "I get banana milk.", "label": 0}
{"text": "Sounds like a managers job description", "label": 0}
{"text": "Then you add that many teachers advice for the victim is to “ignore” the bully which makes it even worse.", "label": 0}
{"text": "I mean, they aren't mad. They enjoy making the lives of others harder. Not only of ugly people, but those make for easy targets.", "label": 0}
{"text": "i'm glad this is not me irl", "label": 0}
{"text": "bro never shopped for themselves before by the looks", "label": 0}
{"text": "JUDGEMENT!", "label": 0}
{"text": "Exactly like how would u ingore the bully", "label": 0}
{"text": "I shoulda started saving in kindergarten.", "label": 0}
{"text": "Bro i even read this again", "label": 0}
{"text": "I mean yes but that evades the point of the post", "label": 0}
{"text": "should have bought crypto in 2013...", "label": 0}
{"text": "And as you get older your skin will bunch and create Pangea with a bunch of weird mountains.", "label": 0}
{"text": "That works like a charm if it's verbal abuse. Physical not so much.", "label": 0}
{"text": "WTF always whole milk. That is like 3.5 or 3.7% here in Germany.", "label": 0}
{"text": "Cos other people are the ones that have to look at you lol", "label": 0}
{"text": "I'll pay me back... eventually", "label": 0}
{"text": "Hello fellow Apprehensive", "label": 0}
{"text": "Bullying is wrong and some people do get bullied for no reason except seeming like an easy target. But sometimes people get bullied for being attention seekers or doing things that break social norms too. It's not an excuse for bullying but it's worth recognizing if you really want to understand it.", "label": 0}
{"text": "Your toast. The earth will keep on spinning.", "label": 0}
{"text": "“Brazzaville, dammit!”", "label": 0}
{"text": "bullies are insecure, i had a senior in school who always bullied", "label": 0}
{"text": "Don’t forget chocolate and strawberry", "label": 0}
{"text": "I prefer “make people cry, make people cry”", "label": 0}
{"text": ">some bullies are well off and confident as hell\n\nIf someone bullies someone else that is a clear sign of their insecurities, even if they create an outward mask of confidence. Very few people have truly found inner peace, so we all have some insecurities, but I think most on the right journey can see the folly in punching down.", "label": 0}
{"text": "My cat, when I won't feed him 5 minutes after he just ate", "label": 0}
{"text": "**it's a realisation that comes with time**", "label": 0}
{"text": "5 minutes turned into hours", "label": 0}
{"text": "55: ¿", "label": 0}
{"text": "literally me", "label": 0}
{"text": "The world is not so simple. Almost everyone want to be loved and cared. When they dont get this, they lash out on life in different manners. One of them is to bully the weaker to fell better", "label": 0}
{"text": "From what i heard, it's 50/50. Either they get married and successful and completely forget about it, but when you confront them on their past bullying they act like \n\n\n\"it was so long ago, i'm not apologizing, sorry your life is shit because of me, but you're the one still hung up about it, grow up :)\"\n\n\nOr they end up in jail, drug addicted and with an abusive spouse. There's no in-between.", "label": 0}
{"text": "How many more times did you want me to write stuff like \"bullying is wrong\" and \"it's not an excuse for bullying\" across three sentences lol. I don't know what else to say, it's a complex topic and some people get bullied for reasons besides being an easy target. That doesn't excuse bullying but it's part of the issue", "label": 0}
{"text": "It's not that you're ugly so much as that you're weird. Many of the world's social evils can be traced back to deep-seated antipathy towards the unfamiliar and the incomprehensible (at least, towards what *seems* incomprehensible to us at the moment.)", "label": 0}
{"text": "Funnily enough, its vice versa from age 50, as is literally everything else", "label": 0}
{"text": "I’ll be using those last couple comments frequently from now on…\n“That’s modern milk for ya. What a time to be alive!”", "label": 0}
{"text": "I’m convinced that bullying comes from allistic gene kids demanding conformity to their tendencies. Autistic kids become bullies too, but because of abuse from parents and allistics who train them that personal safety requires conformity.", "label": 0}
{"text": "Malbun if you're so kind", "label": 0}
{"text": "That too.\n\nBut silent treatment is one of the best ways to really take someone down a notch. Nothing stings like being completely ignored, especially if getting a reaction was your primary goal.\n\nLot of people like to rile others up for fun and attention, and denying them that makes them quickly bored and they move on.", "label": 0}
{"text": "You weren't ignoring enough.", "label": 0}
{"text": "Not always, I was bullied for my all school time until I quit, I was 6.5, 330lbs and I fought back, but those pos always get together to lie so I was the one being the bully... I even was forced to do anger managment group therapy... But at least those understood and bad a good time with them.", "label": 0}
{"text": "IDK, that sounds a little victim-blame-y.", "label": 0}
{"text": "I always asked \"if I'm so ugly why do you go out of your way to spend time near me?\" And they would usually leave me alone. The Twilight Zone part was nearly 2 decades out of school, 4 of my 5 bullies came back and apologized. I just tell them it's a bit late and I hope they never have to deal with it themselves. They had, and that was why they apologized. And usually was followed up with a \"I always thought you were cute and was too scared of you to ask you out directly.\"\n\nI just smile and ask if they feel better. \n\nIndifference can absolutely cause anguish. \n\n(P.s. bully #5 was killed by another classmate after that classmate had enough of being bullied 🤷🏿‍♀️)", "label": 0}
{"text": ">they do it because it makes them feel better\n\n  \nAnd now think about that...", "label": 0}
{"text": "Never looked at it this way 😂", "label": 0}
{"text": "You probably not ugly bro, they just in your head running your confidence. Try not to give a damn what they think.", "label": 0}
{"text": "That doesn’t even make sense. I’m ugly, you’re not, what the fuck is projected into me right now?", "label": 0}
{"text": "This. There’s a 99% chance they’re getting abused and/or neglected themselves elsewhere.", "label": 0}
{"text": "This tastes like real milk\n\nand only %2 fat", "label": 0}
{"text": "I know what you’re trying to say here, but the irony is that it’s literally me saying the same thing you’re doing here in reverse. “I bully because its funny” is like saying “I was angry because I was mad”. Something unfunny/horrible being “funny” to them is that way because of the reasons I described. Thinking they just do it to laugh, and then they are otherwise normal, functional people is a pretty immature takeaway.", "label": 0}
{"text": "Anyone thinking about the \"My Dad as a Baby\" meme?", "label": 0}
{"text": "That sounds like sadism.", "label": 0}
{"text": "I'm 30...what excuse am I going to make", "label": 0}
{"text": "You just got a gap and I have a mine", "label": 0}
{"text": "Because you’re cluttering my streets for attractive people", "label": 0}
{"text": "What,?", "label": 0}
{"text": "In beginning of month get 50 bucks in cash and put them somewhere. Those are your savings. After you run out of money you grab those 50 again. Thats how it works i think.", "label": 0}
{"text": "The brainrot kids are the ones that bully the \"normal\" kids.", "label": 0}
{"text": "because if YOU'RE ugly, what does that make ME??\n\nAlso I'll see you after class for your lunch money, papa's got to buy the new prime flavour", "label": 0}
{"text": "From ‘what do they think?’ to ‘who even are they?’", "label": 0}
{"text": "It's not about you being ugly or fat or a nerd or w.e. it's about you being weak and unwilling or unable to fight back. Bullies are sadist and sociopaths who gain pleasure and a sense of power over someone weaker than them.", "label": 0}
{"text": "Cashew, pistachio, buckwheat, walnut...hurry up I don't have all day", "label": 0}
{"text": "Do i even want to know", "label": 0}
{"text": "Some call it aging, I call it upgrading my peace", "label": 0}
{"text": "It really doesn't, tho. A lot of times, ignoring verbal abuse is what escalates the bully into using physical force. If they can't get what they want with words, they'll use their fists.", "label": 0}
{"text": "About what???", "label": 0}
{"text": "I’ve always found bullying odd. I know it happens but I just find it odd cause I never saw it at my school. I also never got picked on myself despite not being very sociable, popular, and being more interested in videogames that sports or most things, so I only had a couple friend for the majority of my time in grade school. Only time I ever got picked on was in like 2nd grade for wearing pink socks (after that I only ever wore white socks) but not after that", "label": 0}
{"text": "And let’s be honest if there’s someone dishing out back Mercator scritches I’m ordering at *least* everything below the equator.", "label": 0}
{"text": "Poor dog... ☹️☹️", "label": 0}
{"text": "Sometimes you have to hit \"no receipt\" at the ATM because you don't need that kind of negativity in your life...", "label": 0}
{"text": "The power of the milf", "label": 0}
{"text": "I brought my god to the playground prepare to be smited", "label": 0}
{"text": "When you are an introvert with zombie level communication skills and a crippling social anxiety but people think you are just naturally calm and well-behaved", "label": 0}
{"text": "Got the weight of the world on their shoulders", "label": 0}
{"text": "Probably similar to heating elements in ovens if you don’t ever go to higher temps.\n\nOr behind a rack or appliance you never move.\n\nStuff builds up and gets dirty if you never clean it, lol.\n\nFunctionally it’s fairly harmless bacteria wise given it’s a super heated thing, but not ideal.", "label": 0}
{"text": "I’m", "label": 0}
{"text": "Why use a small faced, human-like cat figure on this meme thats what i dont understand", "label": 0}
{"text": "Becuase you’re uglying up my space 👊🏾💥", "label": 0}
{"text": "El pendejo", "label": 0}
{"text": "I DONT LIKE ITS BEADY EYES!!!!", "label": 0}
{"text": "What's the song in the background of this video?", "label": 0}
{"text": "Eyes Without a Face - Billy Idol", "label": 0}
{"text": "I’m purple", "label": 0}
{"text": "It looked like the baby was on a finger", "label": 0}
{"text": "I remember very well some people trying to push me against the wall. Hand on my face. Than I made this weird turn and I ended up having my hand against his face against the wall. They never bothered me again. Just adrenaline and luck.", "label": 0}
{"text": "Not only am I not a prodigy, I'm significantly worse than other beginners. :\\", "label": 0}
{"text": "Why waste energy on my fabulous uniqueness? Chill, dude.", "label": 0}
{"text": "Bullies have issues that makes them insecure, and the only way to feel good about themselves is to belittle others , if you are in school and you have better grades than them they bully, showing off strength against the weak is an age old behaviour of humans, but nowadays it is to hide weaknesses and insecurities", "label": 0}
{"text": "And you didn't spend your whole pocket money on Bitcoin.", "label": 0}
{"text": "not really, some people enjoy seeing other's suffer", "label": 0}
{"text": "They can gain status and also be insecure \n\nSecure people tend to already have status and don’t have to do all that to get it", "label": 0}
{"text": "I think they were being facetious", "label": 0}
{"text": "I suddenly feel kind of sorry for them.", "label": 0}
{"text": "Possibly, but tone is hard to decipher in text. Plus, their response below would make me think otherwise.", "label": 0}
{"text": "He has to look at you. He’s rather be looking at his own face.", "label": 0}
{"text": "Has completado la transacción", "label": 0}
{"text": "yeah no, fk this nonsense. its been floated since i was a youngun and i'm old as fk. someone who likes you doesnt bully you or poke you or pull your hair. stop conditioning people to accept abuse", "label": 0}
{"text": "So true.", "label": 0}
{"text": "Yeah - was speaking from bully POV.", "label": 0}
{"text": "Oh ok thanks", "label": 0}
{"text": "All I know is those lines on the pink background look like fingerprints and I’m like… “WTF! How small is that baby!?!?”", "label": 0}
{"text": "Clearly. I was 4 and I was a home owner in my schools backyard in the bushes. We had worms ford dinner every day", "label": 0}
{"text": "What happened to nordic europe", "label": 0}
{"text": "Username checks out (I always wanted to type this)", "label": 0}
{"text": "Because you gave away an irreplaceable chunk of your life to get that money in the first place?", "label": 0}
{"text": "People have been mad at me my entire life. bEcAuSe ThEy WoRrY aBoUt My HeAlTh. Yet they get tired after walking 4 holes on a golf course", "label": 0}
{"text": "True", "label": 0}
{"text": "You guys have half and half for milk? I thought that was only bread", "label": 0}
{"text": "Reminds me of a certain potted plant i saw falling from a very high place.", "label": 0}
{"text": "you should try league of legends", "label": 0}
{"text": "Here's something I realized when I turned 30. One of my classmates was a clinical narcist. We were friends. One day after sour autumn we picked a fight with each other. I wouldn't say it was one sided, I would go far enough to say I lost. But based on the fist sized bump on his face it kinda looked like I won. Year goes by and he's friends with these two bigger goons. And when those three were together there was random bullying. So what I realized was that this guy was actually scared of me and made friends with bigger guys to make up for it.  \nI was staying out of trouble because of situation at home, but I never just took anything. I always fought back with all I had and that is because I have issues of my own. Guy turned a whole new leaf and seems like a good person these days. Goon one did too, but havent seen in 10 years. Goon two disappeared 20 years ago.  \nI don't know, I feel like things are the same and at the same time different.", "label": 0}
{"text": "Git? like getting an IT job? Sure that would show them in the long run.", "label": 0}
{"text": "40\n\nAre there any people around here who actually think?", "label": 0}
{"text": "shitposting", "label": 0}
{"text": "find theyre better off just leaving me alone because the ugliness doesnt stop at looks", "label": 0}
{"text": "100%! It’s like they see us as their personal training dummies to boost their ego.", "label": 0}
{"text": "Since ant man and the wasp were a couple - I think it'd be weirder if he dressed up as his daughters boyfriend. 10/10 awesome and appropriate Halloween costume for Mr Rudd and family.:)", "label": 0}
{"text": "Then you bring 4 friends. Or a gun", "label": 0}
{"text": "Who let you out of your cell? Get back to area 51", "label": 0}
{"text": "BRING BACK BULLYING 2025#", "label": 0}
{"text": "#mootoo", "label": 0}
{"text": "ITS NIT TOO LATE LAND IS ONLY GETTING MORE EEPXNESIGE BUY LAND TOSYA BUT LAND ITDYAIBNUUYBBOABDNSOTYSIAY IT", "label": 0}
{"text": "Este muchacho de llena de orgullo", "label": 0}
{"text": "Who the fuck has a latte delivered via Door Dash??", "label": 0}
{"text": "Because I have to look at you.", "label": 0}
{"text": "They're not. If anything they're angry that THEY'RE ugly and taking it out on you, though that's not really the norm.\n\nIt's because you're an easy target. You stand out. Doesn't matter how, doesn't matter why, you attract their attention, and that's all it takes. For some it's a form of social ladder climbing, using you to get a laugh out of their in-group or a group or person they're trying to get in with. For others, they're taking out other frustrations on you. For others, they don't even fucking know. Some are joining in on the \"joke\" by the first one. Some people are insecure about something and project aggression as a mask. Some people are legit psychopaths that enjoy inflicting pain and suffering on others. Could be a lot of things.\n\nUsually, it doesn't have anything to do with you. You just happened to attract attention, or be in the wrong line of sight at the wrong time.", "label": 0}
{"text": "Me, spanish from Spain, seeing everyone show mexican pictures when they refer to spanish things.", "label": 0}
{"text": "Sprich Deutsch", "label": 0}
{"text": "Reddit: How dare you translate", "label": 0}
{"text": "Oof, you're hard", "label": 0}
{"text": "I'm fairly certain 2% actually has more sugar than Whole milk.... And the fat from whole milk really isn't bad for you unless you're drinking a gallon a day. You should talk her into going back hehe", "label": 0}
{"text": "r/tumblrdraws is an absolute goldmine", "label": 0}
{"text": "Just ugly", "label": 0}
{"text": "detach deez nutz", "label": 0}
{"text": "...a single headphone", "label": 0}
{"text": "They're really strange comments", "label": 0}
{"text": "That's cool.  Wish my school did that.", "label": 0}
{"text": "Dated a guy in college whose family actually invested in Apple early. He only mentioned it once and I didn’t press but holy shit, that family had money.", "label": 0}
{"text": "Ah bait. My bad, carry on", "label": 0}
{"text": "Yk the 2% isn't healthier right? Its essentially milk without the stuff that makes milk, well... Good for you...", "label": 0}
{"text": "Extra flavour", "label": 0}
{"text": "Why don’t you have two jobs already?!?!", "label": 0}
{"text": "I have no idea why, but I just fucking love that drawing. Just enjoying her life without caring about anything stressful.", "label": 0}
{"text": "You insult them with your existence.", "label": 0}
{"text": "How long did it take him to pick?", "label": 0}
{"text": "How else bully going to think they are better than you ? Being a good person ??? Nawwwww", "label": 0}
{"text": "Reality is just your own perception of external stimuli. The only thing you know for real is yourself. Everything else is a construct of your own mind.", "label": 0}
{"text": "Can't believe I didn't buy a house in 08 when I was in middle school", "label": 0}
{"text": "Thie guy is being difficult but the dasher is being very patient and cordial. This behavior is offbeat and unexpected from a doordasher, who; rightfully, wants to just get you your food/drink as fast as possible and move on.", "label": 0}
{"text": "Man, what a stupid baby.", "label": 0}
{"text": "Good time for a [deleted] [removed]", "label": 0}
{"text": "and then missing out first hour of whatever i planned to do early", "label": 0}
{"text": "soy milk tastes like bean :(", "label": 0}
{"text": "At least you were born the year the undertaker threw mankind off hell in a cell, and plummeted sixteen feet through an announcer’s table.", "label": 0}
{"text": "Have you ever listened to 1990 by Daniel Johnston?", "label": 0}
{"text": "That which doesn't kill us makes us crunchier.", "label": 0}
{"text": "My air fryer allows me to just put hot water and soap in it and wash it like any other dish and rinse it out. \n\nYou guys don’t clean your air fryer after every use?!", "label": 0}
{"text": "Yeah I love to draw too! Especially when travelling on trains !", "label": 0}
{"text": "Pretty sure NASA was making the space shuttle's re-entry tiles out of hyper-cooked tater tots for most of the early nineties.", "label": 0}
{"text": "Smart people would have sold only some and held the rest until the end of time, like you do with any investment, you never sell it all because you dont know what will happen, especially something special and risky like BTC was back then.\n\nNow its part of the market and will never go away so its not \"too late\" yet either.", "label": 0}
{"text": "Last time I checked its still available there right now and not too late.", "label": 0}
{"text": "As long as the cash doesn't come out in pesos 😅", "label": 0}
{"text": "I always put a sheet or container so that it doesn’t get as dirty, and it’s relatively easy to clean after multiple uses because of that", "label": 0}
{"text": "I like how photos from 1998 look like photos from 1968 now", "label": 0}
{"text": "Oh I absolutely do.\n\nBut most have the heating element on the top side of the actual base, not what you pull out and put food in. \n\nIf you’re reaching up there every single time to deep clean around the heating element with brushes while keeping the electrical junk out of the water, props to ya. Lol", "label": 0}
{"text": "Gotta pull yourself up and get a 2nd and 3rd job to work that hustle.", "label": 0}
{"text": "Well, yeah, you came out smaller than a fingertip. That's so tiny!", "label": 0}
{"text": "Get a job ya hippie.", "label": 0}
{"text": "Bullies are bullies because of something else. Whether it's insecurities, trouble at home or jealousy, they find a target that won't fight back to lash out on. It's their way of venting, lashing out. It's horrible and a coward's choice, but it's the most natural animal thing to do...", "label": 0}
{"text": "Not in *here*, you don’t; this is a Mercedes!", "label": 0}
{"text": "Bullying is power projection, show of dominance to one individual to another. \n\nThat's why bully don't go for someone they know that can fight back, they aim for people who show weakness.", "label": 0}
{"text": "Trains be training", "label": 0}
{"text": "Did she forget she could stand up?", "label": 0}
{"text": "smash", "label": 0}
{"text": "text messages can have line breaks", "label": 0}
{"text": "Yeah, for example India is way bigger than Greenland in real life.", "label": 0}
{"text": "3.9% is the highest I could find. It's the best.", "label": 0}
{"text": "I think they also suck and fuck. Wine dine & 69.", "label": 0}
{"text": "> Maybe ~~your~~ **we're** toast", "label": 0}
{"text": "they're mad about something first then they call you ugly to try and hurt you", "label": 0}
{"text": "Then you could afford a bed so you don’t have to sleep on fiberglass insulation.", "label": 0}
{"text": "Shoulda bought a house in '08 instead of watching Naruto and wondering about my math test", "label": 0}
{"text": "And now you are a beautiful butterfly?", "label": 0}
{"text": "its ok. you woulda cashed out at £500 anyway.", "label": 0}
{"text": "No time like the present \n\nGo out there and build some equity", "label": 0}
{"text": "Me, Spanish from Argentina, seeing everyone use mexican pictures when they refer to Spanish things", "label": 0}
{"text": "So real, you're just like me!\n\nExcept I'm spanish", "label": 0}
{"text": "That money is for my funeral, but if my family is smart they will give my body away to some shady pharmaceutical company and keep the money.", "label": 0}
{"text": "Have a stove from 1963.You just turn a knob back one hour", "label": 0}
{"text": "Because he is?", "label": 0}
{"text": "It was [deleted]", "label": 0}
{"text": "Found the yank", "label": 0}
{"text": "Did you consider she might not wanna", "label": 0}
{"text": "And I try so hard to be international! I feel like such the fool!", "label": 0}
{"text": "Lazy and incredibly immature.", "label": 0}
{"text": "Pathetic.", "label": 0}
{"text": "still be kicking himself for not holding like so many other early adopters. so its a wash either way. not many held past $500 or $1500 a coin.", "label": 0}
{"text": "Agreed 👍 😆 🤣", "label": 0}
{"text": "Shit look like 1972 bruh.", "label": 0}
{"text": "Of course they forgot Tasmania.", "label": 0}
{"text": "It was so easy to buy property back then (sarcasm intended).", "label": 0}
{"text": "Nintendo DS : do not change it, in-game time-based events will stop working :(", "label": 0}
{"text": "How do you he think bought that sweet wig", "label": 0}
{"text": "Lethal company in a nutshell", "label": 0}
{"text": "I hate it when my house gains weight. Can barely shut the garage door now. 😩", "label": 0}
{"text": "When my friends changed my phone's language to chinese as a prank but I still managed to find the language option and change it back", "label": 0}
{"text": "Phasmophobia be like", "label": 0}
{"text": "I have never heard of one that does that, What air fryer do you have", "label": 0}
{"text": "Dominance hierarchy.", "label": 0}
{"text": "Sometimes you have to treat yourself! It is not always bout kids", "label": 0}
{"text": "Damn paparazzi are obnoxious", "label": 0}
{"text": "This way of thinking combats any form of verbal insult. They will get bored and move on, or annoyed that you're not bothered and punch you. Glhf.", "label": 0}
{"text": "Here's the [real trick](https://youtu.be/lSSfbbBtJe0?si=UGrVbB8M8_cssdGU) to buying property.", "label": 0}
{"text": "Dressing up as Antman would just be asking for people to ambush him for autographs.", "label": 0}
{"text": "The only dynamic I know is FORTISSIMO", "label": 0}
{"text": "For like a day", "label": 0}
{"text": "It's ok. my mom's friend, M, said that M had 100s of coins that a friend gave. However M didn't know what that was ans has since lost all of them. M was very unhappy about that. This was when each coin was 20k", "label": 0}
{"text": "I love how my oven and car radio are forever stuck in some alternate time zone.", "label": 0}
{"text": "Allot of bully’s are the way they are because they have a bad home life", "label": 0}
{"text": "I love how we all imagined the same song without hearing it.", "label": 0}
{"text": "🤣🤣", "label": 0}
{"text": "Maybe he wanted to remain anonymous, or at least more so", "label": 0}
{"text": "Not going to lie. I truly wish I started not giving a fuck what people think about me about 3 decades ago.", "label": 0}
{"text": "rip M", "label": 0}
{"text": "He really got into weird Al Yankovic character", "label": 0}
{"text": "“I always crumb back”", "label": 0}
{"text": "My car radio has an Hour button and a Minute button. \nPressing the hour button makes the hour increase. \nPressing the minute button makes the minutes increase. \n\nCould not be easier lol", "label": 0}
{"text": "🤣🤣🤣", "label": 0}
{"text": "They are not Mad about it, They want you to be Mad about it  \n  \nThey want you to know that you are not better than them  \n  \nthey want you to hate yourself", "label": 0}
{"text": "If only I had been multitasking with a land deed in one hand and a bottle in the other.", "label": 0}
{"text": "When the brain buffer is full from 5 years of math but can’t recall a single thing about breakfast. Loading... Please wait 😅", "label": 0}
{"text": "ah ye.. ah SÌ", "label": 0}
{"text": "Sometimes I have to reread the same sentence 10 times before I actually* read it🤣", "label": 0}
{"text": "Content Warning summarised", "label": 0}
{"text": "Slacker\n\nI was already married by then and had our first kid shortly after. You're pretty the same age as my kids. \n\nSo I can tell you it's a generational thing - they were doing the same exact thing at the time. \n\nThe whole group of them, just a bunch of babies.", "label": 0}
{"text": "Really???", "label": 0}
{"text": "Could his dad bring back or borrow the actual costume from marvel?", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "People are too busy being concerned about what other people think about them to think about you.", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "Honestly tho, once had a guy non-stop throwing ball at me as hard as he could. The second I went over there and grabbed his arms I was in trouble.", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "r/NPD", "label": 0}
{"text": "Does he wear wigs?", "label": 0}
{"text": "I see why people think that, but id chose to view those people as characters and not real to life, that's the whole point of shows. We all had those moments with our shows characters.\n\nAnybody who isn't overthinking it wouldn't come to these conclusions if they saw it with their own eyes. Most things are innocent until other people make them worse than they really are.", "label": 0}
{"text": "\"I'll just transfer $100 to hold me over until payday\" *$500 later*", "label": 0}
{"text": "Is this from Bebe’s Kids?!?! Way down in the jungle deep?!?!", "label": 0}
{"text": "Everyone knows that if you ignore the problems, they'll just go away on their own. It's just science. /s", "label": 0}
{"text": "Stfu bot", "label": 0}
{"text": "Nah, people hate being paid for their work.", "label": 0}
{"text": "i hate my skibidi wife that makes me depressed and i want to jump off a cliff in a based style.", "label": 0}
{"text": "Until it affects other people in a not so good way.", "label": 0}
{"text": "How could you have slacked so much!  Didn’t you know how much real estate prices would take off??!\n\nNext you’re gonna tell us you didn’t buy 12,000 bitcoin when it was less than a cent each.", "label": 0}
{"text": "That's Gen Alpha", "label": 0}
{"text": "This is such a Paul Rudd move.", "label": 0}
{"text": "Cats can have a little milk. As a treat.", "label": 0}
{"text": "I was joking with the date thing. Sorry I thought that was obvious.", "label": 0}
{"text": "I'm no expert but I think instigating suicide is illegal.", "label": 0}
{"text": "Three words: Insecurity, Projection, Displacement", "label": 0}
{"text": "Daylight savings", "label": 0}
{"text": "Wait, people actually do daylight savings? Why!?", "label": 0}
{"text": "Ok grandpa", "label": 0}
{"text": "It actually never occurred to me that other countries had it 🤔", "label": 0}
{"text": "Gen Z would be post irony, not incoherent babbling", "label": 0}
{"text": "Back in the day - If you ever wore the same shirt twice in a week, bullies would be ALL OVER your shit for whatever reason... Dudes paid more attention to my wardrobe than I did for the sole purpose of making fun of me for the dumbest shit ever.", "label": 0}
{"text": "Is it a human talking about the dog? Is it a dog talking about blinds? Who knows.", "label": 0}
{"text": "I bet you enjoyed sucking your mama's tit.\n\nTypical Freeloader!", "label": 0}
{"text": "There was a time when you could mine bitcoin with just a PC running windows.  Download click. \n\nIt was that easy.", "label": 0}
{"text": "Next time gen z should be this meme because of the number of times gen z like to compare generations", "label": 0}
{"text": "As a representative member of Gen Z I kindly request you to remove skibidi from my generation and move it to Gen Alpha, thanks", "label": 0}
{"text": "Always midnight or --:--", "label": 0}
{"text": "Dog want sunshine  \nDog destroy owner home  \nDog gets sunshine  \nDog Happy, Homeowner, not so happy", "label": 0}
{"text": "I've seen timers. Clocks usually go in Microwave Ovens.", "label": 0}
{"text": "And timers. They were all mechanical but electrically driven. and horribly complicated.", "label": 0}
{"text": "Then you mess it and have to go round and round.\n\n\nI've seen a Microwave that I kid you not has no numpad. So if you want to use it you have to either choose minutes and then 10 seconds intervals.\n\n\nThen you set the time and now it's a new minute", "label": 0}
{"text": "As a member Gen Z, I support this request. I also urge the OP to respond ASAP", "label": 0}
{"text": "Daylight beats standard time, bite yourself.\n\n\nIf you don't like it, do like Paraguay, set it to **DST all year long!**", "label": 0}
{"text": "Fuck buddy gets ghosted the most", "label": 0}
{"text": "You can’t just decide your not doing it, it’s the whole timezone, just gotta adjust", "label": 0}
{"text": "Imagining the person living one hour behind.", "label": 0}
{"text": "You asked why people do daylight savings, it's because they have to\n\nI meant \"you\" like the people that live in DST places, not *you* particularly", "label": 0}
{"text": "When the Justice League becomes Law Group.", "label": 0}
{"text": "Source?", "label": 0}
{"text": "Because you are not ugly, they are and they cannot handle it", "label": 0}
{"text": "Robin: I thought the Devil was through when they made Rosemary's Baby. But oh no! OH NO! Now we got Bebe's Kids.", "label": 0}
{"text": "Apes together strong", "label": 0}
{"text": "I've never seen an oven in Europe without a clock \n\nIt's also not hard to change, usually you hold the button that otherwise is responsible for a timer. You hold it instead of tapping it and it lets you set the time", "label": 0}
{"text": "Yeah but if a couple dresses up as Luke and Leia, nobody's like \"uhhh you guys aren't siblings, you're fucking\"", "label": 0}
{"text": "Thanks, I totally [forgot.](https://youtube.com/watch?v=aKLW0kQ83qg)", "label": 0}
{"text": "Cause Weird Al is a chad among chads.", "label": 0}
{"text": "This is why Lethal Company is so much fun", "label": 0}
{"text": "3rd", "label": 0}
{"text": "En 1998 mi madre tenía 14 años XD", "label": 0}
{"text": "As another representative of gen ZI support this request", "label": 0}
{"text": "I saw that your post was cross-postes on lost redditors right above this one. Mind explaining how this is me irl?", "label": 0}
{"text": "Lethal Company is basically just \"what if you were the main character of a horror movie\"", "label": 0}
{"text": "You know that most Gen Z people are in their 20s?", "label": 0}
{"text": "trolllolololo", "label": 0}
{"text": "Meow", "label": 0}
{"text": "Painfully obvious he was joking, bud", "label": 0}
{"text": "So he's unfathomably based?", "label": 0}
{"text": "One thought always comes to mind \"they want something \"", "label": 0}
{"text": "those are very often the same thing lol", "label": 0}
{"text": "They just like to feel powerful. That's all it is.", "label": 0}
{"text": "Here in Germany, even more of the boomer jokes are about the mother in law.", "label": 0}
{"text": "He probably didn't want people recognizing him, so his daughter could have a proper trick or treat experience", "label": 0}
{"text": "Casio watch: Click your way to time setting screen, then press these in the following order:\n\nlight button, 24hr button 23 times (or just hold until the hour number is one less than before), mode button", "label": 0}
{"text": "Why bother? My car clock’s always wrong.", "label": 0}
{"text": "Women doesnt exist", "label": 0}
{"text": "Come on man. No reason to call their mum a cow.", "label": 0}
{"text": "What shall we replace it with? Genuinely interested.", "label": 0}
{"text": "millennials is not “i have depression”, it’s actually “oh god i’m so old 😭😭😭🤪🤪😂😂😂😂🤣🤣”", "label": 0}
{"text": "especially when u were online last year and learned absolutely nothing", "label": 0}
{"text": "Shhhh...", "label": 0}
{"text": "If this isn't relatable i dont know what is.", "label": 0}
{"text": "What did they say?", "label": 0}
{"text": "This was written by a millennial", "label": 0}
{"text": "You butchered the [original meme.](https://www.reddit.com/r/memes/comments/ihfbg4/you_cant_tell_me_you_dont_want_one_of_those/)", "label": 0}
{"text": "Gen alpha ❌\nGem alpha✅", "label": 0}
{"text": "Shut up nerd", "label": 0}
{"text": "Happy cake day!", "label": 0}
{"text": "I genuinly don't get skibidi toilet.\n\nI'm in my early 30's and can understand gen z, their lingo and humor. But the skibidi toilet is where I consider myself to old to talk with kids these days.", "label": 0}
{"text": "Yup", "label": 0}
{"text": "Dude I was already 2-3 in 1998 and didn't do shit.", "label": 0}
{"text": "Clearly it's millennials posting this. Gen Z posters would never put Skibidi in the Gen Z column.\n\nMillennials seem to like generational comparisons even more than Gen Z. And I don't blame them tbh. They have \"generations\" drilled into their heads since Boomers tried to alienate them so hard.", "label": 0}
{"text": "Ugandan Knuckles", "label": 0}
{"text": "Every subgenre of internet humor has a bit of incoherent babbling.", "label": 0}
{"text": "It's a gen alpha thing. My guess is probably some random picture and now it is supposed to be \"funny\" for some reason—literally no one of gen z understands it as well. The OP confuses both generations and thinks gen z are still kids, I'm 25 lol.", "label": 0}
{"text": "The only right answer. My bullies had no problems in their lives, they were just scum. Enough with this idea that bad people have reasons to do bad things. They fucking like it, that's why they are bad.", "label": 0}
{"text": "Omg he’s going kill the fucking dog no!!!!", "label": 0}
{"text": "That's Gen Alpha", "label": 0}
{"text": "I dunno man I don’t think the millennials want to talk about what their humor actually was maybe we’ll bring up vine, and gen z is definitely more of the I have depression humor.", "label": 0}
{"text": "Curious, what gen would be MLG 420 blaze it?", "label": 0}
{"text": "Clean the air fryer yes, every time… not so much. I mean come on some fries aren’t gonna make the thing filthy after one go. Now something with sauce that’s a cleaning after one go.", "label": 0}
{"text": "Fair", "label": 0}
{"text": "Narvini.\n\nI only know this because of Henry stickmin.", "label": 0}
{"text": "Man, that's Weird", "label": 0}
{"text": "Ahh, the cycle of misrepresented generations. Something millennials gladly pass to gen z", "label": 0}
{"text": "little bean", "label": 0}
{"text": "Sure... Then it applies the other way to.\nOwner get mad at dog.\nOwner removes dog.\nOwner happy.", "label": 0}
{"text": "I hate these people. They never respond to my threats which infuriates me even more •\\`\\_´•", "label": 0}
{"text": "Intriguing,  I know it’s Halloween weekend but that’s spooky", "label": 0}
{"text": "Milennials aren't joking - we're just depressed", "label": 0}
{"text": "Gen x is truly the forgotten generation", "label": 0}
{"text": "I read glocks", "label": 0}
{"text": "somebody toucha my spaghet!", "label": 0}
{"text": "The next frame is him blowing the dudes head off with his fully charged beam cannon.", "label": 0}
{"text": "Exactly ", "label": 0}
{"text": "That is because our apathy doesn't get us not", "label": 0}
{"text": "After some time it would probably be the happiness that’s stronger", "label": 0}
{"text": "Woah what kind of spiritual meme is this?", "label": 0}
{"text": "Japp", "label": 0}
{"text": "His absolutely destructive Unconditional Love beam cannon", "label": 0}
{"text": "Gen Z would be the meme itself", "label": 0}
{"text": "u/SaveVideo", "label": 0}
{"text": "just me i guess", "label": 0}
{"text": "So, you're saying that's a HUGE rump then? 😂", "label": 0}
{"text": "i do because i know they dont mae sense", "label": 0}
{"text": "Yeah i exagerated but iirc it lasts for a day *minimum* and then it's until you pass midnight with the game open, which is pretty annoying (since you can only fix one game at a time)", "label": 0}
{"text": "Do people not realize that a lot of gen z is in the workforce and starting families now lol", "label": 0}
{"text": "What's Gen X up to these days?", "label": 0}
{"text": "It's even funnier because usually i actually do remember the information...\n\nAnd still can't remember what i ate for breakfast today", "label": 0}
{"text": "What’s up with all the people in r/millennials dividing everything by generation?", "label": 0}
{"text": "I refuse to believe people exist who have unconditional love for others", "label": 0}
{"text": "Infinite fuel generator", "label": 0}
{"text": "Emergency Frog Situation", "label": 0}
{"text": "Yeah... I'm close to the oldest a GenZ can be. \n\n27yo, done with university and work a full time job.", "label": 0}
{"text": "There's an Al Yankovic joke hidden here.", "label": 0}
{"text": "I request millennials to keep their position as the generational scapegoat.", "label": 0}
{"text": "It's not wrong for millennials tho", "label": 0}
{"text": "Usually they are ugly and they target the preety ones.", "label": 0}
{"text": "When I start something and am surprisingly decent at it, I start to learn the \"techniques\". \n\nAnd that's how all my problems start. The more I learn, the more the theory behind it makes me worse at actually doing it.", "label": 0}
{"text": "As a member of gen z I can safely say that I seem to have achieved millennial humor and depression 👍", "label": 0}
{"text": "ATF agent detected.", "label": 0}
{"text": "Can we stop the generational complaining with us, please? Its very easy to do", "label": 0}
{"text": "I think because we're all so tapped in online anyway now, the humour kind of merges between Z and Alpha, but it definitely did come from Alpha you're right.", "label": 0}
{"text": "Alpha dawggg", "label": 0}
{"text": "u/[jf0ssGremlin](https://www.reddit.com/user/jf0ssGremlin/)", "label": 0}
{"text": "\"naught?\"", "label": 0}
{"text": "Which is worse: the person who didn't do anything saying \"I can do that\" or\"I've already done that\"", "label": 0}
{"text": "I couldn't be bothered and stopped mid sen", "label": 0}
{"text": "I suppose it goes for both gen z and millenials, cuz all my life my generation has made depression related jokes and such", "label": 0}
{"text": "People will see an older gen alpha doing something stupid, and say how bad ***millennials*** are. \n\nIt's y'all's turn to be the \"Wait. No. That's not my generation. We're annoyed by that too!\" generation that gets blamed by the olds. \n\n(Shut up I'm not old. I'm youth challenged)", "label": 0}
{"text": "Sperm is produced constantly and dies after few days while a woman is born with all her eggs. You are still an egg", "label": 0}
{"text": "Bruh who tf cleans those after every use, that's an absurd waste of time plus they cook much worse when clean and aren't intended to be used that way much like an actual deep fat fryer. You're supposed to have grease lol...", "label": 0}
{"text": "They’re either really rich, or really poor. Literally any oven from $50-$5000 is gonna have a clock.", "label": 0}
{"text": "Gen Z has humour? Guess is the \"i have to work\".", "label": 0}
{"text": "Average gen alpha", "label": 0}
{"text": "Yours doesn't?", "label": 0}
{"text": "They both went as their heroes", "label": 0}
{"text": "idk", "label": 0}
{"text": "My skibidi wife makes me depressed", "label": 0}
{"text": "Not me irl", "label": 0}
{"text": "that’s gen alpha humor…", "label": 0}
{"text": "Fine I'll take you up on that offer", "label": 0}
{"text": "Nah, just a Love Train.", "label": 0}
{"text": "Minorities doesn't make me happy so.....", "label": 0}
{"text": "is it really love if it haves conditions tho", "label": 0}
{"text": "When you press the button of an old camera while cleaning it", "label": 0}
{"text": "\"No, no, that is the Democratic Republic of Congo. Get your countries right!\"", "label": 0}
{"text": "Stop doing to gen z what boomers did to millenials until we all had to scream at them WE'RE FUCKING 40, STOP INFANTILIZING US. ", "label": 0}
{"text": "Alone is better", "label": 0}
{"text": "「D4C」!!!", "label": 0}
{"text": "I thought gen z was the dating on the haters", "label": 0}
{"text": "yup, Filthy Acts Conducted At Abysmal Prices: Affection Locomotive", "label": 0}
{"text": "Sigma rizz there!", "label": 0}
{"text": "“Father forgive them, for they know not what they do” vibes", "label": 0}
{"text": "Throw the entire concept in the trash.", "label": 0}
{"text": "Looks like a piece of rice on a fingertip.", "label": 0}
{"text": "Don’t you have a house to go not buy?", "label": 0}
{"text": "AL, not ai", "label": 0}
{"text": "Gen Z? That's Gen Alpha humor.", "label": 0}
{"text": "Bro made aerogel", "label": 0}
{"text": "Not being there IS the Gen X humor.", "label": 0}
{"text": "Not our decision", "label": 0}
{"text": "Yeah lmao, why the fuck does everyone keep posting about woodworking on the carpentry subreddit, kinda feel", "label": 0}
{"text": "I read that as \"Eggo\" at first, like the waffle", "label": 0}
{"text": "Yes lol. Everybody except your children should have conditional love.\n\nReasonable conditions include things like violence and abuse. If your love for somebody and survive them beating the shit out of you, abusing you, and treating you like shit, then you have no self-respect.", "label": 0}
{"text": "Haha yea the millennial one is definitely just humor", "label": 0}
{"text": "Yea millennials are moving on to hate their wives.", "label": 0}
{"text": "Ok", "label": 0}
{"text": "Maybe, but also love doesn't necessarily equal a relationship, you can love your abuser and still leave him because it's the best for you, and with that I mean that love is not always a choice, is something that you just feel, and a lot of times it goes far beyond conditions \n\nBut of course a relationship should always be conditional, even if there's love that you can't just stop", "label": 0}
{"text": "That better than the usual   👍🏻 I suppose.", "label": 0}
{"text": "At least he responded with Ok. Could have been a thumbs up emoji...", "label": 0}
{"text": "Yeah, we're invisible.", "label": 0}
{"text": "👍", "label": 0}
{"text": "If you say it in that order it makes sense", "label": 0}
{"text": "Yeah Gen Z is just Millennials on steroids.\n\n\"I have depression\"\n\n\"yeah? Well I'm suicidal\"\n\nAtleast we share a common enemy. The 👻mer", "label": 0}
{"text": "more like an ethos of working hard for your dads approval.... too relatable", "label": 0}
{"text": "* sad Gen X noises ...", "label": 0}
{"text": "This is exactly how my boomer dad would reply but that’s just because he’s not phone smart. He’d hug me and tell me he was proud to my face.", "label": 0}
{"text": "I feel like the thumbs up would have been better. At least it indicates approval. Ok is just… ok.", "label": 0}
{"text": "I should have done the same instead of residing in oblivion", "label": 0}
{"text": "Learn the not give a shit.", "label": 0}
{"text": "👍🏾", "label": 0}
{"text": "Ok.", "label": 0}
{"text": "Ok.\n\nYou should have become a doctor.", "label": 0}
{"text": "As a Gen Z, both are kinda responsible.  One Gen Z discovered SFM and made a crime against humanity on it, that plus the yt shorts format fueled by yt's shitty algorithm causing ipad kids to see it.\n\nWe're also responsible for \\*ahem\\*.\n\nGyat, Rizz, Boomer, and other brainrot shit like that.", "label": 0}
{"text": "Good commitment to the bit. I approve.", "label": 0}
{"text": "We didn't start the fire. Its been burning since the world started turning.", "label": 0}
{"text": "1. No one said Gen Z was the one accusing us, it was the older generations...just like is happening to Gen Z now.\n\n2. At least nutmeg and cinnamon and milk are *edible*.", "label": 0}
{"text": "*laughs in locked in 2.75% interest rate*", "label": 0}
{"text": "If I had a son that sent me insufferable texts that I knew were for social media clout….I’d just say ok too.", "label": 0}
{"text": "I thought they learned how to remember their breakfast last year", "label": 0}
{"text": "Only Gen X can be funny, the rest of you just clap", "label": 0}
{"text": "Just what I was about to say. My dad's also a boomer, and for some reason he isn't chatty when texting but he'll talk your ear off in person or on a call", "label": 0}
{"text": "My dad: 👍", "label": 0}
{"text": "Hotdog = not dog", "label": 0}
{"text": "PR?", "label": 0}
{"text": "And the youngest are ~12.\n\nSo yeah, the memes of 12 year olds still have to be claimed by the 25 year olds. Sucks, but I don't make the rules 🤷‍♂️", "label": 0}
{"text": "Who messages their dad with bs like that \"thank you for instilling me with being an annoying turd\"", "label": 0}
{"text": "do some real exercise ffs before its too late", "label": 0}
{"text": "Gen z is the best clearly. It might be stupid but its just stupid fun and not \"dangerous\". Beating wife aint good. And normalising depression is just dumb af. People who actually suffer from it are not noticed", "label": 0}
{"text": "👍", "label": 0}
{"text": "r/2meirl4meirl", "label": 0}
{"text": "Races have photographers", "label": 0}
{"text": "Puerto Rico", "label": 0}
{"text": "Ok", "label": 0}
{"text": "As a Gen Z, we need to add SpongeBob and Vine references. That might be the weird sub-generation of the older Gen Z that people are calling \"Zillenial\" I guess because that's where I am, but I can say for sure that those are staples of humor for people my age (25).\n\nI fully don't know what the skibidi thing means. Also I spelled it wrong and have *never* typed that word but my phone suggested it, which I do not like.", "label": 0}
{"text": "Good old Nat Geo is probably better for a back and tattoo artist", "label": 0}
{"text": "Lmao my dad is loving but he's so short too, if he responds at all. It's nothing like him in person", "label": 0}
{"text": "My dad only recently learned that texting in call caps meant yelling! I’ve been trying to teach him this for like, 10 years haha", "label": 0}
{"text": "My dad does the 🔥 instead lol", "label": 0}
{"text": "Boomers are great aren’t they?", "label": 0}
{"text": "No I'm pretty happy, you just haven't noticed that different generations express themselves differently and have different levels of self sufficiency, and your default reaction is that everyone who thinks differently to you is wrong.\n\nI didn't even bother telling my Dad I passed my degree. But if you want everyone to clap and have a party every time you do something, that's OK too", "label": 0}
{"text": "It means I'm the one that posted this\n\nIt stands for original poster", "label": 0}
{"text": "probably greater than the race distance", "label": 0}
{"text": "Oh ok thanks", "label": 0}
{"text": "I wish I could relate but I have no friends or money.", "label": 0}
{"text": "It’s not that hard to change an oven clock, tf?", "label": 0}
{"text": "Huh I guess all boomer parents are the same.", "label": 0}
{"text": "> I have many years of depression and sadness ahead of me\n\nDon't *strive* for that, though. Doesn't help anyone. \n\nGoodluck", "label": 0}
{"text": "I've never felt more old, I have my 12yr old cousin explaining internet slang to me, and him using an iPad genuinely feels like wizardry to me.", "label": 0}
{"text": "Dad's wise to his son's humblebrag, doesn't take the bait.", "label": 0}
{"text": "They’re just not good with texting so I never get hurt with stuff like this", "label": 0}
{"text": "I fucking hate the \"no handbook\" response, no shit theres no fucking handbook, how about you just treat them like a person? engage in their interests, show them your interests, try to fucking relate to them in literally any fucking way possible. \n\nMy dad used that excuse, we barely talk to each other now and I don't care to fix the problem, not my fault right? theres no handbook on being a good son.", "label": 0}
{"text": "I just hired a guy, who has already gotten his bachelor's degree, who is gen z.", "label": 0}
{"text": "Right here: Oh no, I'm not in the meme. Whatever.", "label": 0}
{"text": "What is this negative attitude lol. You're not wrong about many parents not being ready for parenthood, but damn have some self-compassion too. No one wants a sad sack dad.", "label": 0}
{"text": "Judging by the message he already left a voicemail previously. That is, if any of this is real", "label": 0}
{"text": "Please go touch some grass average Redditor, you don't know anything about anyone on the internet. You don't even realise I'm a cat with a keyboard", "label": 0}
{"text": "Dads like fuck how did I raise such a goofy fuck of a son", "label": 0}
{"text": "Youngest are in high-school", "label": 0}
{"text": "BMI is silly and has little to do with fitness.", "label": 0}
{"text": "And that is why I didn't bother calling my dad on his birthday.", "label": 0}
{"text": "Lmao too accurate", "label": 0}
{"text": "So it for the vine.", "label": 0}
{"text": "Are there any games like this for Play Station?", "label": 0}
{"text": "I need to see the door interaction of these two 😂😂😂 must be hilarious", "label": 0}
{"text": "Pull Request", "label": 0}
{"text": "People who want to please their parents are a bit odd.", "label": 0}
{"text": "\\*hangs head shamefully for having a son that uses the metric system", "label": 0}
{"text": "That father is slav", "label": 0}
{"text": "What if \num\nHappiness and Love", "label": 0}
{"text": "Literally my dad's response when I told him I had been awarded my PhD", "label": 0}
{"text": "There are thousands of handbooks written on good parenting", "label": 0}
{"text": "“OK” = (what a waste of time and effort. Kid should have done something productive that pays the bills.) Dad thoughts Irl", "label": 0}
{"text": "Honestly I’d be okay with that", "label": 0}
{"text": "My dads classic is “nice”", "label": 0}
{"text": "Major trend in the media as we were growing up. I think it's toxic as hell. People don't need more ways to divide themselves, and refusing to learn from other generations is willful ignorance.", "label": 0}
{"text": "Does he know how to operate a desktop computer?", "label": 0}
{"text": "Thus far he's shown himself to be competent on the computer lol", "label": 0}
{"text": "My dad is usually a “👍” and sometimes he would do a “wow” but I don’t know what are the condon for that one", "label": 0}
{"text": "Uganda Knuckles is millennial", "label": 0}
{"text": "You know how, when you’re young, you think you’re gonna do things better than your parents did? And maybe you even make up scenarios on how you’re gonna improve.\n\nThat, but without considering the character traits your kid is gonna have.", "label": 0}
{"text": "Haha this would be a classic Dad response", "label": 0}
{"text": "Didn’t Spock write one in the 70s?", "label": 0}
{"text": "https://www.youtube.com/watch?v=Hb17uaaldwM", "label": 0}
{"text": "Not quite my tempo", "label": 0}
{"text": "> how about you just treat them like a person? engage in their interests, show them your interests, try to fucking relate to them in literally any fucking way possible.\n\nYeah well if/when you have kids you'll realize it isn't that straightforward.", "label": 0}
{"text": "I've heard multiple times periods for Gen Z, and so for my own sanity I'm going to pretend that's not the case.", "label": 0}
{"text": "The message you're sending is probably to the generation that gets cold sweats when they have to call their dentist to confirm an appointment. Or has to mentally prepare when they call mom to ask when Sunday dinner is.", "label": 0}
{"text": "Empathy and love doesn’t require a handbook. People should not look at this and feel like being shitty is inevitable or ok.", "label": 0}
{"text": "Ok", "label": 0}
{"text": "Wait your fucking dad grew up with pagers? \n\n  \noh god", "label": 0}
{"text": "“Treat them like a person”\n\n\n“It’s not that straightforward”\n\nFucking what?!", "label": 0}
{"text": "Father can’t be bothered to respond to a son’s accomplishment with more than one word: “hey, don’t blame us fathers they didn’t teach us how to do this we just trying our best out here”", "label": 0}
{"text": "What about gen X...", "label": 0}
{"text": "right? Like who the hell talks like that in real life? to a family member, no less", "label": 0}
{"text": "Most of what kids interpret as their parents making malicious choices are the parents just trying to live their life amidst the chaos of kids/work/life.", "label": 0}
{"text": "My dad isn't like this. But I know how to deal with dads like this. The correct text is:\n\nYou in your chair?\n\nDad: yeah\n\nThis is me.", "label": 0}
{"text": "Not saying it is, just sharing my experience. Empathy & love will not cover all that comes.", "label": 0}
{"text": "Hahaha at first, I thought it was a larva", "label": 0}
{"text": "All posts must be titled me_irl (with any single character between \"me\" and \"irl\"). But feel free to post this again with that title", "label": 0}
{"text": "All posts must be titled \"me_irl\". But feel free to post this again with that title", "label": 0}
{"text": "Not really a huge need in our office for any files being word, excel, or access, and he's got word capability.", "label": 0}
{"text": "Is he related to JD?", "label": 0}
{"text": "I might have to block my own son if he sent me a text like that. Jesus", "label": 0}
{"text": "I'd just get \"K\"", "label": 0}
{"text": "I’m a parent of 2. I’m not perfect. I have my own struggles. But I have always treated them with basic human respect. Treating kids like people is not hard and represents the absolute bare minimum (and is a pre-requisite for even being around my kids).", "label": 0}
{"text": "Don't compare skibidi shit to gen z", "label": 0}
{"text": "Glad I’m not the only one whose dad texts like this.", "label": 0}
{"text": "It kind of looks like you learned grit and determination because that was what it took to pry any form of affection out of your father.", "label": 0}
