{"text": "Pornhub being banned is actually based.", "label": 1}
{"text": "2x champ, once via fluke and once via robbery. Harrison coming ~on that ass~ for that ass. \n\n\nPause.", "label": 1}
{"text": "I simply can't deny that piercing insight. I guess we'll be two loser goldfish in this depressing little fishbowl forever, redditfriend", "label": 1}
{"text": "Says the bruv being all bruvvy", "label": 1}
{"text": "cool it with the hate speech pal", "label": 1}
{"text": "I mean, I don't necessarily think either of us, or anybody here is implicitly a loser but I appreciate your candor just the same.", "label": 1}
{"text": "lol this is so quintessential reddit\n\n\n\"I have a feeling the people who actually make meaningful decisions outside of their own lives don't have time to create memes to mock the failures of a fight card's PPV sales then talk about it afterwards.\"\n\n\n\"I mean, I don't necessarily think either of us, or anybody here is implicitly a loser...\"\n\n\nyou're terrified to say it with your chest and you also don't have the capability to change. this is why redditors are my guilty pleasure", "label": 1}
{"text": "Wishing is gay", "label": 1}
{"text": "My point was that you're the one who keeps bringing up what people on here do when they aren't on here. My first quote was a direct response to something **you** said.", "label": 1}
{"text": "massive critical thinking skills. people are telling me this is the best logic-based argument they've ever seen, and they've seen *a lot* of 'em. I look forward to you spearheading the crusade against God-Emperor Ari as Donn Davis's successor", "label": 1}
{"text": "Thanks. When I get to spearhead the crusade I'll be sure to bring you on board as an advisor since you've clearly got a good eye for critical thinking skills and connections with the best people. Between the two of us we could really make some noise.", "label": 1}
{"text": "you can count on me, buddeh. just don't get your thong in a twist when reality doesn't conform to your ideals and we'll be the yinnest and yangest. also I'd like to continue the stipulation in the Fertittas' contract that any disagreements are settled by way of a submission-only contest", "label": 1}
{"text": "Alabama or Arkansas?", "label": 1}
{"text": "did you make an account just to come here and post over and over about the takes you see in this subreddit lol", "label": 1}
{"text": "Reality hasn't been conforming to my ideals for 30+ years now and I've managed to position myself as successor to one of the all time great fight promoters. It won't stop me once I assume the throne.", "label": 1}
{"text": "you can determine the answer to that question very easily, dear redditfriend", "label": 1}
{"text": "Buckle up OP, we're checking your comment history. 23 day old account probably serially banned for racism, Dana White and Rogan fanboy, Bo Nickal nut rider, steroid defender. Mordor reference check out, dude is obsessed with orcs.", "label": 1}
{"text": "attagirl! you know where to find me", "label": 1}
{"text": "why don’t you like, go do something productive you actually enjoy instead of worrying what a bunch of redditors think about stuff. this very lazy bait.", "label": 1}
{"text": "tremendous goose neck noodle arm energy", "label": 1}
{"text": "everyone's got a guilty pleasure. mine is breaking reality to deluded redditmen", "label": 1}
{"text": "Sales numbers mean nothing to actual fans. Posts like yours are a sliver what’s wrong with this and many other industries. It’s the type of slave mindset meant for the drones corporations want.", "label": 1}
{"text": "explain to me why my post is wrong and why I have a slave/corporate drone mindset. prove that you have the ability to go beyond \"down with the man!\" war cries into the uncaring void", "label": 1}
{"text": "why don’t you get a cool guilty pleasure like doing drugs or gambling", "label": 1}
{"text": "that's haram, brother", "label": 1}
{"text": "Just went through every comment of your on this thread to downvote you cause you sound retarded\n\nTook like 20 secs", "label": 1}
{"text": "yeah that’s why they’re cool they’re actually transgressive and not lame like whatever this is. what you’re actually doing is just wasting time on your phone on reddit like the rest of us even if you think you’re epically owning everyone", "label": 1}
{"text": "you're sweating over this like you're cutting 20 in the sauna. go scream into your body pillow, you'll feel better", "label": 1}
{"text": "im busy getting drunk and gambling sorry", "label": 1}
{"text": "extremely cool, fellow redditor :) have a blessed weekend", "label": 1}
{"text": "That's probably Dana White's burner account!", "label": 1}
{"text": "While you and your orc buddies inject each other's bums with bull semen, I studied the blade.", "label": 1}
{"text": "Hate it. Might wait till tomorrow night and watch the event on watchwrestling without spoilers.\n\nThis is a big betting card for me too but I hate the earlier cards. I like having this shit on at night", "label": 1}
{"text": "https://youtu.be/n0_v00YupwE?si=d1xEwueY_nyFNblK\n\n\nAlabama", "label": 1}
{"text": "This is crap. There were several very viable.contenders at the time. \n\nDid you spend a day being taught by Bryce Mitchell or something?", "label": 1}
{"text": "I believe in your google skills bud, you can do it!", "label": 1}
{"text": "He’s just throwing out anything that’ll stick in his little stan fanbase ", "label": 1}
{"text": "Facts here aren't welcome bro. They just wanna glaze Francis and hate on Dana.", "label": 1}
{"text": "You are unbelievably corny.", "label": 1}
{"text": "Your desperation to find someone who joins you in bootlicking is hilarious\n\nAs is your getting downvoted to oblivion each and every time 🤣", "label": 1}
{"text": "8-9 Million PPVs since becoming champ in 2011", "label": 1}
{"text": "Buddy\n\nI asked you to provide his pay, not how many PPV's he sold.", "label": 1}
{"text": "Great. It's likely that he hasn't received 20M in a single fight. But that's not what I'm talking about, is it?", "label": 1}
{"text": "Oh boy. He's seeing red. I'm scared now.", "label": 1}
{"text": "Getting downvoted on reddit by people like you is a compliment", "label": 1}
{"text": "Check the dms lil bro", "label": 1}
{"text": "Aussie that doesn't watch UFC but wants to watch for khamzat 💀 dude is fighting an Aussie haha", "label": 1}
{"text": "Send link bro", "label": 1}
{"text": "Two tits & a sausage got it", "label": 1}
{"text": "There’s nothing to suggest he’s watching for khamzaht", "label": 1}
{"text": "Where does it say he's watching for Khamzat?", "label": 1}
{"text": "Done", "label": 1}
{"text": "With your eyes", "label": 1}
{"text": "He wants to watch cause of Whittaker", "label": 1}
{"text": "We are an island nation surrounded by ocean, time to set sail land lubber and brave the torrid sea's!", "label": 1}
{"text": "Can I get it too?", "label": 1}
{"text": "Me too please 🙏", "label": 1}
{"text": "Me three", "label": 1}
{"text": "Send location, please brudda", "label": 1}
{"text": "There's also a special league for VIPs where you can get it.", "label": 1}
{"text": "We're such a welcoming community", "label": 1}
{"text": "Nice try Dana.", "label": 1}
{"text": "Inboxed you all. Anyone else wants it DM me.", "label": 1}
{"text": "me", "label": 1}
{"text": "Please send sir 🙏🏼", "label": 1}
{"text": "We got him", "label": 1}
{"text": "Can I get one too big bro", "label": 1}
{"text": "I dont see how anyone pays. So easy.", "label": 1}
{"text": "DM’d", "label": 1}
{"text": "Nice try Dana", "label": 1}
{"text": "Just go to a pub/sports bar", "label": 1}
{"text": "If only there were a FREE way to watch LIVE1\nI'm sure if you google FREE and something like LIVE1 something like.TV might show up", "label": 1}
{"text": "No more cards in these shithole countries. GTFO", "label": 1}
{"text": "Please", "label": 1}
{"text": "Msgd u", "label": 1}
{"text": "No Muslims losing my decision tonight book it. Corrupt ass country ", "label": 1}
{"text": "Hit me too pls", "label": 1}
{"text": "Bro those sand boys are nuts", "label": 1}
{"text": "> Corrupt ass country \n\nThat's the whole point of the UFC doing cards there. Half these guys aren't allowed in the US. UFC is just as guilty of this corruption.", "label": 1}
{"text": "Whatever you need to do to make yourself feel okay, lil dick", "label": 1}
{"text": "Nah, I just think it's funny you're on some macho BS about a nickname. \n\nDudes fighting, and you're telling him he can't have a nickname. He has to wait for it to come organically. You need that certified organic sticker.", "label": 1}
{"text": "What site do you guys use in Portugal?", "label": 1}
{"text": "The dude not hurting anybody, I don’t even gamble but dude relax😁👍", "label": 1}
{"text": "Bro you’re just telling me in big flashing signs “I’ve never trained for a fight before.”\n\nI have, & I’ll tell you there’s unwritten rules in fighting, one of them is you *dont* pick your own nickname, you earn it by a coach or fans. \n\nThis isn’t some arbitrary line in the sand I’m drawing, this is how it goes *for everyone*, this is the way of life for a lot of these men and women & this guy understands this, if you train you understand this.\n\nTo insinuate that fighters choose their nickname for marketing purposes showcases your serious removal or absolute absence from the actual life of fighting. \n\nOld school principles leech into MMA today & always & this is one of those principles.\n\n“Macho bs” that’s your way to cope with the fact that you’re wrong about something, but you don’t even realize you’re wrong about it because you’re arrogant enough to speak on something you have absolutely no information on.\n\nSo when someone who’s on the in educates you, you say, “macho bs.”", "label": 1}
{"text": "why are they using a placeholder flag?", "label": 1}
{"text": "You don’t know that.", "label": 1}
{"text": "True, but you still can chill tf out", "label": 1}
{"text": "Did I offend you? \n\nYou chill the fuck out.", "label": 1}
{"text": "Never go full regard.", "label": 1}
{"text": "oh nice your eye test while u drink beer and eat chips is superior to stats tracked by the athletic commission \n\n  \nall im saying is its not a robbery , it was a close fight \n\ni recommend a 5 min geography course on the middle east btw", "label": 1}
{"text": "PRIDE ALWAYS DIE", "label": 1}
{"text": "gay entrance song", "label": 1}
{"text": "This sub has some of the most cringe commentary on Reddit lmao ", "label": 1}
{"text": "Impressive if you can actually be more insufferable and more wrong lmao.", "label": 1}
{"text": "I mean all I would need is an even bigger robber to call “not a robbery”, right? Easy money", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "Rather be corny than unbelievably horny for guys", "label": 1}
{"text": "Kind of anti-Semitic to assume an Arab/muslim judge is not going to be objective", "label": 1}
{"text": "So in Australia, the streaming service we all use for UFC/NBA/MLB/NFL content is Kayo Sports, and for the past 2 years the same ads repeat a every ad break,\n\nSecurity Bade Photo Day with Jayson Tatum \"or big duece!\"\n\nSTEVEEEEE LEEEVYYYY!!!!", "label": 1}
{"text": "You pay for this brother?", "label": 1}
{"text": "Uncle Dana just got you", "label": 1}
{"text": "Corruption 100%. Every year there’s a few fights in these cards that go to the Muslim fighter. Dalby vs Rinat, Naimov vs Wood etc. Also low how Robeiro refused to stop the fight as Orolbai was dead. Sure he recovered, but that should have been stopped and likely wasn’t because of outside pressures. It just seems bizarre", "label": 1}
{"text": "Anti semitic against Muslims? \n\nThink you need a dictionary my friend", "label": 1}
{"text": "They’d be less inclined if they saw what homie Vessel actually looks like 💀", "label": 1}
{"text": "That's exactly what I just said lmao", "label": 1}
{"text": "Oh fuck you’re right I’m sorry I’m drunk already 🤣 take my upvotes", "label": 1}
{"text": "I dont go looking for how anonymous musicians look unless I'm obsessed with a band. Kinda weird bud", "label": 1}
{"text": "You’re right it is hilarious that you’re confidently wrong. \n\nYou didn’t even try to find it 😂", "label": 1}
{"text": "I meant join the Australian Navy so you can afford to buy ppv OBVIOUSLY sheeesh", "label": 1}
{"text": "They’re all over the internet. Don’t let me stop you from enjoying a corny and lame band lil bro", "label": 1}
{"text": "Remind me what religion Georgians are.", "label": 1}
{"text": "Idk where you're hanging out but unless I activly go looking for it I won't find it. So calm down lil bro", "label": 1}
{"text": "It’s all good lil bro, I’m a woman so it wouldn’t be gay to look up photos of him if I had. You on the other hand would be weird af for being this pressed about a lame and corny band 🥵", "label": 1}
{"text": "dude fr. before covid, the whole point of the an ad was two steps, to simply spark a feeling of insecurity and then make you think the product would solve the insecurity. \nit was really a mind fuck. then, all the companies tried to sympathize and market through virtue signaling. when that didn’t work, we get the current wave which is just fucking weird.", "label": 1}
{"text": "https://www.britannica.com/topic/Semite", "label": 1}
{"text": "Quit spamming this post", "label": 1}
{"text": "If I say jump, will you ask how high? 🥵 🐕", "label": 1}
{"text": "Idk why fighter don't just spam headkicks to his blind side. Don't fight nice", "label": 1}
{"text": "Or he could be cast in a reboot of the Leprechaun movies.", "label": 1}
{"text": "cgi his head on the leprechaun body and i think you've got an idea there", "label": 1}
{"text": "I would say no homo but I think we’re both girlies here 🙂‍↔️🥵", "label": 1}
{"text": "this guy maybe? [https://www.google.com/imgres?q=mike%20wazowski&imgurl=https%3A%2F%2Fdreamlightvalleywiki.com%2Fimages%2F6%2F6a%2FMike\\_Wazowski.png&imgrefurl=https%3A%2F%2Fdreamlightvalleywiki.com%2FMike\\_Wazowski&docid=eIdgUuSM-74G5M&tbnid=wQqsG2GbOLY1PM&vet=12ahUKEwiYk6vt06yJAxVajYkEHR0oDf4QM3oECHAQAA..i&w=352&h=352&hcb=2&ved=2ahUKEwiYk6vt06yJAxVajYkEHR0oDf4QM3oECHAQAA](https://www.google.com/imgres?q=mike%20wazowski&imgurl=https%3A%2F%2Fdreamlightvalleywiki.com%2Fimages%2F6%2F6a%2FMike_Wazowski.png&imgrefurl=https%3A%2F%2Fdreamlightvalleywiki.com%2FMike_Wazowski&docid=eIdgUuSM-74G5M&tbnid=wQqsG2GbOLY1PM&vet=12ahUKEwiYk6vt06yJAxVajYkEHR0oDf4QM3oECHAQAA..i&w=352&h=352&hcb=2&ved=2ahUKEwiYk6vt06yJAxVajYkEHR0oDf4QM3oECHAQAA)", "label": 1}
{"text": "\\>Because Semitic-speaking peoples do not share any traits aside from language, use of the term “Semite” to refer to the broad range of Semitic-speaking peoples has fallen out of favour. For this reason, some critics even encourage the [removal of the hyphen](https://www.britannica.com/topic/anti-Semitism/additional-info#Researchers-Note) in the term [*anti-Semitism*](https://www.britannica.com/topic/anti-Semitism) to help dispel any pseudoscientific [notions](https://www.britannica.com/dictionary/notions) of a \"Semitic race.\" They advocate instead for the use of *antisemitism* to describe the hostility toward or discrimination against Jews as a religious or racial group.", "label": 1}
{"text": "So, none. And still shit refs. What's your excuse now?", "label": 1}
{"text": "For all intents and purposes it functions the same as a commission you grade A idiot", "label": 1}
{"text": "Where can we watch free? 😭", "label": 1}
{"text": "send me $80 i'll order it for u", "label": 1}
{"text": "Imagine not knowing how to sail the seven seas in 2024", "label": 1}
{"text": "If you think the org bringing them money don't have any influence you're the thick fuck. But you already know that.", "label": 1}
{"text": "Cry harder. Maybe if your countries weren't so poor, they would give a shit.", "label": 1}
{"text": "Nah, if he lost for shit judging he'd have more right to be angry. If he thinks it was deserved, he'll prove it his next fight out. If you're confident, the backlash should just fall off his back, but he's clearly mad because he questions himself if his win was legit.", "label": 1}
{"text": "That's a very dickish and fucked up take", "label": 1}
{"text": "You’re a fucking punk dude", "label": 1}
{"text": "It’s just trolling", "label": 1}
{"text": "Youre the bitch for not being able to handle the truth. Russia supplies your energy.", "label": 1}
{"text": "The truth isn't a troll. A troll is what your mom is.", "label": 1}
{"text": "stfu", "label": 1}
{"text": "Hm, no. He's a good fighter but a trash human.", "label": 1}
{"text": "Rinat stfu ya ugly cunt", "label": 1}
{"text": "why you talking about his looks incel.", "label": 1}
{"text": "Just dont speak bud lol", "label": 1}
{"text": "[Due to the root word Semite, the term is prone to being invoked as a misnomer by those who incorrectly assert (in an etymological fallacy) that it refers to racist hatred directed at \"Semitic people\" in spite of the fact that this grouping is an obsolete historical race concept. Likewise, such usage is erroneous; the compound word antisemitismus was first used in print in Germany in 1879[18] as a \"scientific-sounding term\" for Judenhass (lit. 'Jew-hatred'),[19][20][21][22][23] and it has since been used to refer to anti-Jewish sentiment alone](https://en.wikipedia.org/wiki/Antisemitism)", "label": 1}
{"text": "Down af lil mama 🥵", "label": 1}
{"text": "🥵🤤😩", "label": 1}
{"text": "Okay, he just ticked off the final russian stereotype by lifting a midget like a baby", "label": 1}
{"text": "I'll send you a vid in 3 weeks you'll see him jerking off the mic stand from up close", "label": 1}
{"text": "And finishing in your open mouth? Send it 🥵", "label": 1}
{"text": "🤤🫡", "label": 1}
{"text": "Streameast admin got bored wtf", "label": 1}
{"text": "Let’s see those molars princess 🥵", "label": 1}
{"text": "Mbappe >>> Messi + CR7 + Neymar!!\n\nDon't @ me, El classico around the corner", "label": 1}
{"text": "I think the Saudi Commission requires one blind judge to even things out.", "label": 1}
{"text": "How much did the Saudis pay you for that comment???", "label": 1}
{"text": "Saudis. In the UAE. Average American lol", "label": 1}
{"text": "Okay crazy you're about to be real surprised soon.", "label": 1}
{"text": "I’m guessing you haven’t been watching mma for very long. All 3 judges disagreed with your 30-27", "label": 1}
{"text": "What education makes you think he won round 1 then because he clearly loss even with the saudi judges", "label": 1}
{"text": "Alex is KO is bitch boy", "label": 1}
{"text": "I wasn’t surprised.", "label": 1}
{"text": "It’s the little cat abuser", "label": 1}
{"text": "Cat abusing midget fuck !", "label": 1}
{"text": "midgets are funny", "label": 1}
{"text": "Claiming a fact and providing 0 evidence. You lose. You are saying \"go find the evidence.\"\n\nSorry, doesn't work that way.", "label": 1}
{"text": "I know Americans are lazy, but fuck man, you just need to type. \n\nYou’d already have the answers if you’d stop crying about Francis 😂\n\nAnyways man, have a good life. Just funny to pretend I’m making this up", "label": 1}
{"text": "Walking out with Kadyrovs son, fuck Khamzat.", "label": 1}
{"text": "Clowns in the desert booing Rob", "label": 1}
{"text": "When will you Arabs LEARN", "label": 1}
{"text": "lets go chamaev, shut all the meat riders the fuck up here 😂", "label": 1}
{"text": "You never know what would happen to khamzat and his family if he tries to distance himself away from them. Use your mind and think of the bigger picture", "label": 1}
{"text": "Apparently it's racist to say the muslims are dickriding a muslim fighter and booing rob lol.", "label": 1}
{"text": "YEAHHHHHHHHHHHH BABYYYYYYYYYYY. ALLAHU AKBAR", "label": 1}
{"text": "r/MMA 9/11", "label": 1}
{"text": "Yeah I'm sad now", "label": 1}
{"text": "ALLAHU AKBAR", "label": 1}
{"text": "If Max loses it'll truly be the second tower", "label": 1}
{"text": "This is my 9/11", "label": 1}
{"text": "Comment so good hat to make it twice", "label": 1}
{"text": "Stfu ", "label": 1}
{"text": "I fell to me knees at Home Depot", "label": 1}
{"text": "He just made weight stfu", "label": 1}
{"text": "But the CARDIO!", "label": 1}
{"text": "😭one of the most disliked fighters running through one of the most liked fighters", "label": 1}
{"text": "Dogs asshole", "label": 1}
{"text": "It’s an inside job", "label": 1}
{"text": "boring my ass. He just dominated one of the best guys gtfo of here", "label": 1}
{"text": "# ALLAHU AKBAR", "label": 1}
{"text": "It's not going to be a good night for this sub. If Max gets  knocked out, it's truly the darkest timeline for a lot of people here.", "label": 1}
{"text": "DDP is our only hope now", "label": 1}
{"text": "If Max loses too this sub will implode", "label": 1}
{"text": "I’m devastated", "label": 1}
{"text": "That's gonna be if Ilia beats Max.", "label": 1}
{"text": "Very fitting, considering where the event takes place", "label": 1}
{"text": "Oh its happening", "label": 1}
{"text": "Whittaker’s Jaw died for this", "label": 1}
{"text": "Get ready", "label": 1}
{"text": "Saudis involved again too", "label": 1}
{"text": "No he didn’t lmao. Naive", "label": 1}
{"text": "The better man winning?", "label": 1}
{"text": "Max Holloway is our south tower.", "label": 1}
{"text": "Sir, a second boi has been run through in 1 round.", "label": 1}
{"text": "Illia hitting the second tower", "label": 1}
{"text": "Jon Jones winning and retiring would be the Pentagon.", "label": 1}
{"text": "It's still not too late to delete this", "label": 1}
{"text": "All you bums who said Khamzat wouldn't take down Rob because Yoel (with his garbage wrestling) couldn't hold him down loool", "label": 1}
{"text": "😔", "label": 1}
{"text": "Big win for Allah", "label": 1}
{"text": "this is the team america 9/11 though, 9/11 times a thousand", "label": 1}
{"text": "Bro dont even speak that shit into existence wtf", "label": 1}
{"text": "Steel beams don't melt jet fuel", "label": 1}
{"text": "When a guy calls Olympic silver medalist Yoel's wrestling garbage you just know he's typing it with cheeto dust covered fingers", "label": 1}
{"text": "Funded by the saudis yet again", "label": 1}
{"text": "He dominated him just like this in round 1 & broke his hand. He still won lmao", "label": 1}
{"text": "Feel like when Rob lost to Izzy.\n\nMy boiiii!!", "label": 1}
{"text": "CHIMAEV STILL GOT A DRAW OVER WEEKS NOTICE USMAN\n\nFUCK YOUUUUUUUUUUU", "label": 1}
{"text": "Then you live a sad life, fam", "label": 1}
{"text": "All Muslim win brother \n\nR/mma sad \n\nAllahakbar", "label": 1}
{"text": "Please no", "label": 1}
{"text": "Acting like khamzat is so good for beating usman on short notice 😂", "label": 1}
{"text": "1. Be Civil.\n\nOur rules ask for a civil tone at all times. \n\nA bit of banter or trash talk is fine, but don't cross the line. If things do get out of hand you will be warned or even banned for a few days. Repeatedly breaking this rule will lead to a permanent ban.", "label": 1}
{"text": "Fucking kill me dawg inbreeding still the best base for MMA", "label": 1}
{"text": "1. Be Civil.\n\nOur rules ask for a civil tone at all times. \n\nA bit of banter or trash talk is fine, but don't cross the line. If things do get out of hand you will be warned or even banned for a few days. Repeatedly breaking this rule will lead to a permanent ban.", "label": 1}
{"text": "Why homelanders cock? Because I dislike redditors favorite Skyrim fighter who pretends to be nice but is a cunt?", "label": 1}
{"text": "Yeah, beating that bum Usman is so unimpressive. That guy is so trash lmao", "label": 1}
{"text": "Usman just that good", "label": 1}
{"text": "What would him finishing Aspinall in RD1 like Gane be?", "label": 1}
{"text": "If he was trash like you say he is then why didn't he choke usman out in the first like he just did with rob?", "label": 1}
{"text": "I am athletic than you in every single conceivable way. Try again. Romero’s MMA wrestling is garbage. He struggled taking Rob down. Khamzat made him look like a child", "label": 1}
{"text": "u/RagebaitXY", "label": 1}
{"text": "You take that back", "label": 1}
{"text": "Another random online who for some reason has this unbridled hatred for a fighter he’s never met or had a personal interaction with. Classic.", "label": 1}
{"text": "nah that was Charles - Islam", "label": 1}
{"text": "well both the judges and the supermajority of the media gave it to him. cope.\n\n[https://mmadecisions.com/decision/14361/Khamzat-Chimaev-vs-Kamaru-Usman](https://mmadecisions.com/decision/14361/Khamzat-Chimaev-vs-Kamaru-Usman)", "label": 1}
{"text": "Got that incest baby strength", "label": 1}
{"text": "US winning independence from England.", "label": 1}
{"text": "Is that a confederate  flag", "label": 1}
{"text": "Amerithrax", "label": 1}
{"text": "You mean he f\\*cks goats", "label": 1}
{"text": "no saudis did it !", "label": 1}
{"text": "One tower has already been struck. I'm praying the second tower stands tall 😭😭😭", "label": 1}
{"text": "That one plane that missed its target actually getting there lol", "label": 1}
{"text": "This is much worse", "label": 1}
{"text": "Well shit. Those Dagi roids are next level", "label": 1}
{"text": "Incest baby taking shit tons of roids in the mountain side mosques", "label": 1}
{"text": "Anyone who gave that round to ilia is a bitch", "label": 1}
{"text": "I was being sarcastic, genius. Wait u think Usman is so good? Then why u making fun of Khamzat for beating him? Make up ur mind.", "label": 1}
{"text": "I want to die", "label": 1}
{"text": "Just straight up self harm me staying awake for 24 hours just to see Rob and Max get murked. Goodnight 🙏🏻", "label": 1}
{"text": "r/mma 9/11, pt. 2", "label": 1}
{"text": "Second tower", "label": 1}
{"text": "r/mma 9/11 lmfao", "label": 1}
{"text": ":)", "label": 1}
{"text": "Two of the worst human beings in MMA won today (Shara and Chimaev), yet people were acting like Ilia eats babies the entire fight week. Dude is so fucking good.", "label": 1}
{"text": "That's it I'm killing myself", "label": 1}
{"text": "This is r/mma's 9/11, Pearl Harbor, October 7th, etc all rolled into one", "label": 1}
{"text": "WHERE YOU AT R/MMA", "label": 1}
{"text": "3-0 Ilia plus the KO you're all idiots who can't score a Max fight reasonably", "label": 1}
{"text": "The second tower", "label": 1}
{"text": "You mad asl huh", "label": 1}
{"text": "Don’t even dislike Max I just love seeing his fans who said Illia had no chance of knocking him out have to shut the fuck up and eat their words", "label": 1}
{"text": "Are you an odds maker?", "label": 1}
{"text": "if there’s one thing mcgregor is good at it’s sniping midgets", "label": 1}
{"text": "You know how odds work right? lmao", "label": 1}
{"text": "We are arguing about the skill level of people and Khamzat has the skills to pepper Burns for days with straight punches without any answers from Burns. Burns only has the skills to hit Khamzat when Khamzat acts like an idiot and completely throws out the gameplan and even then it still wasn‘t enough to win.", "label": 1}
{"text": "You’re saying that even by using both your hands you can’t remove the grip of an 8 year olds arm ?", "label": 1}
{"text": "Speaking of comment history, yours is about Pokemon. I can't imagine what you look like in real life 🤣🤣🤣", "label": 1}
{"text": "People shit on him because his fans are insufferable and dude acts like a twat promoting fights. \nIdrc if hes humble after victlry the heel act just makes me wanna see him.appear in the news for a plane crash om his way home.", "label": 1}
{"text": "Get off the internet dude. People watch sports fun.", "label": 1}
{"text": "Bruh :(", "label": 1}
{"text": "I keep the same energy in real life. You can't or you'd throw a hip out. Go back to your nuggets gramps 😂", "label": 1}
{"text": "I'm a plant mechanic and I play with my son. How is pokemon a diss exactly?", "label": 1}
{"text": "Unwarranted fighter bashing is frowned upon. Pretty sure it's against the rules of the sub.", "label": 1}
{"text": "You like Pokemon. You're either obese living in ur mommas basement or a skinny little twig. I like my chances 😉", "label": 1}
{"text": "I sure as hell don't like your chances. I'm definitely not a keyboard warrior. I rarely ever comment on anything ever. Unlike you lmao. I keep the same energy and you are damn lucky I don't know who you are 😂", "label": 1}
{"text": "Wait you have son? And you're on the internet calling people \"little bitch\". Pathetic behaviour.", "label": 1}
{"text": "This is rapidly surpassing 9/11 levels of its over ", "label": 1}
{"text": "Ohhhh nooo im so scared. The pokemon lover wants to hurt me!!!!", "label": 1}
{"text": "Chael's glasses are gay", "label": 1}
{"text": "8 year old was juiced to the gills B", "label": 1}
{"text": "Knee kicking? Like what Max did all night tonight? Stfu he coined a super effective technique in MMA where you're trying to give the other guy brain damage, Jones is trying to give them cartilage damage. You haters really need therapy. \n\nJones is also nowhere near the most outrageous \"finger\" guy, it's just his stance and having the longest reach in the UFC. Look at Wideman he hit his last opponent with the one-two eye poke k.o. Daniel Cormier only won that one fight against Stipe via eyepokes as well.... O'Malley literally evaded rematching a guy that beat him by rendering him blind through 4 eyepokes in one round and then celebrated it as a win.", "label": 1}
{"text": "Sure we all are involuntarily celibate... or maybe you have the social skills of someone who probably couldn't fuck anything alive with it's consent. I can't even imagine the type of person who would want to be your friend.", "label": 1}
{"text": "plus what kind of person even does that?", "label": 1}
{"text": "Nope, I can have multiple interests that I know about. Unlike you who doesn’t seem to know anything about any sub you comment on", "label": 1}
{"text": "🤣🤣🤣🤣🤣🤣🤣🤣🤡🤡🤡🤡", "label": 1}
{"text": "🤣🤣🤣🤣😭😭😭😭🤡🤡🤡🤡", "label": 1}
{"text": "😭🤣🤣🤣🤣🤣🤣🤡🤡🤡🤡🤡", "label": 1}
{"text": "🤣🤣🤣🤣🤣😂😭😭😭😭🤡🤡🤡🤡", "label": 1}
{"text": "dunno what you're whining about stick to context of champions, the real world is too scary for you", "label": 1}
{"text": "“AnKaLaEV wON all 3 RoUnDs” maybe move back to shitty cricket since you know literally nothing about MMA kid", "label": 1}
{"text": "/u/WideMathematician271 I see you deleted your comments like a fucking coward eh?!? Pathetic lmfao 🤣🤣🤣🤣", "label": 1}
{"text": "Sounds good. I'll watch cricket while you clean up the sheets dust on your belly from playing league of champions or whatever OF model you subscribe to", "label": 1}
{"text": "Khaz literally killed the man in the octagon and his zombifird corpse walked back to the corner. See I can make up stuff too?\n\nYa bro gave up on a neck crank in.5 seconds lmao it’s ok he gave up 😂", "label": 1}
{"text": "I am superior to you in every way. I doubt youve even touched a girl with her consent. Against though, I have no doubts", "label": 1}
{"text": "oh ur whole accounted is dedicated to trolling in order to try to get a dopamine boost\n\nthats weird & sad", "label": 1}
{"text": "That’s not true in any facet lol nice try tho 😂", "label": 1}
{"text": "putting a laughing emojii doesn't make what you're doing any less pathetic on a human level\n\nyou're comment history is sad. Nonstop rapid fire spam of toxicity\n\nbe better", "label": 1}
{"text": "I pity you. So sad.", "label": 1}
{"text": "Hard projection with those crying emojis because this is exactly what you look like when the fighters/athletes over whom you fanboy loses lmao This is the difference between us. I watch it for the sport because I'm a combat athlete, you watch it to worship random dudes because you couldn't punch your way out of a paper bag.", "label": 1}
{"text": "Where’d ya go bapa? Do better", "label": 1}
{"text": "😭😭😭😂😂😂😂😂😂😂😜😜😜😜🤡🤡🤡🤡 what a glorious night lmfao!!!", "label": 1}
{"text": "True, I made big money on Khamzat, Ankalaev and Shara", "label": 1}
{"text": "🤣🤣🤣🤣🤣😭😭🤡🤡🤡🤡🤡\n\n\nAbsolutely glorious night lmfao 😂😂😂😂", "label": 1}
{"text": "Money & education vs no money & no education\n\n6 ft 5, 240+ lbs vs 5 ft 3, -130 lbs\n\nNot just a glorious night, a glorious life lmao", "label": 1}
{"text": "😭🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣😭😭😭😭😭🤣🤣🤣🤣🤣🤣🤣🤣😜🤡🤡🤡🤡🤡🤡🤡\n\n\nLmfao!!!!! 😂😂😂😂😂😂😂", "label": 1}
{"text": "This is the only response that you can come up with because you're too uneducated and illiterate to form proper sentence. Sad, but you'll just have to come to terms with your DNA", "label": 1}
{"text": "Stfu Umar is anything but boring", "label": 1}
{"text": "🤣🤣🤣🤣🤣🤣😭😭😭😭😭😭🤣🤣🤣🤣🤣🤣🤣🤣🤣😭😭😭😭😭😭😭🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣😭😭😭😭🤣🤣🤣🤣🤣🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "label": 1}
{"text": "And there it is again, it exposes its low IQ for everyone to see. This is exactly the kind of thing that happens when one's brain is smooth and the bank account empty.", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "understandable", "label": 1}
{"text": "😭😭😭🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤡🤡🤡🤡🤡🤡 lmfao 😂😂😂😂😂😂😂😂😂", "label": 1}
{"text": "All the incel neckbeards in this sub would explode.", "label": 1}
{"text": "You okay there? You’re coming across like the type of person you seemed to assume that I was. Good luck with sensibilities like that", "label": 1}
{"text": "Lol great argument from you buddy.", "label": 1}
{"text": "Somebody who likes DC and Felder’s commentary, trains and is in shape so I don’t view this guy as a superhero, and thinks he’s pretty ugly. I just gave him the business. I think you’re coming from a place of deep insecurity", "label": 1}
{"text": "Stfu ples", "label": 1}
{"text": "your Constant excuses is tiring.", "label": 1}
{"text": "Gee 20 unanswered will close up the count. Should be talking to a mirror when calling someone an idiot", "label": 1}
{"text": "Go fuck yourself, you judge cunt.", "label": 1}
{"text": "Oh stop with the racism accusations, it’s not even that. Shara decided he could play morality police, got in the guys face and kept making contact with him. Whether he hit him first or not is irrelevant, he clearly put the guy in a situation where he felt he had to defend himself. Aside from that I don’t even understand how you say people lie about the story when you’re omitting the most important part; Shara sucker punched the guy and stomped on his head when he was unconscious. That makes you a real piece of shit no matter what race or religion you dork.", "label": 1}
{"text": "Stay mad alcoholic", "label": 1}
{"text": "Can someone post the clip of the Tomato saying that Francis is pretending to be a good person", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "[This?](https://x.com/ChampRDS/status/1850295180684836918?t=Kpr-4Cm8EJz7TWt0FTb6yA&s=19)", "label": 1}
{"text": "Francis slapped my wife I got it on tape ", "label": 1}
{"text": "Imagine saying Francis isnt a good guy then turn around and meatride Jon", "label": 1}
{"text": "Why is he not good, Dana? Does he...hit his wife in public?", "label": 1}
{"text": "Dana really hates taking Ls", "label": 1}
{"text": "Nah Dana White is the regard whisperer, those aren't shills, there are bozos who genuinely hug his nuts", "label": 1}
{"text": "Interesting comment from Mr Wife Beater", "label": 1}
{"text": "Lmao sit this one out, bud. Hasn’t even been a year since you were caught on tape slapping your wife.  But sure, be the arbiter of morality, Dana.", "label": 1}
{"text": "Max stans thought that one of the best boxers in MMA had a chance of outboxing a guy 😂😂🥳\n\nMax got beat clean but it's not like he was getting dogwalked before that, I'd say the first two rounds could have gone either way but once Ilia landed the big shot it was all over.", "label": 1}
{"text": "You are dumber than the dumbest rock Ngannou mined in Cameroon", "label": 1}
{"text": "Throwing all the insults, feels like you're not really mad at me. Idk what's going on in life, but I hope you sort it out bud", "label": 1}
{"text": "If 9/11 happened today this would be like posting a photo of the towers on r/NYC or someshit", "label": 1}
{"text": "yeah I’ma do that too", "label": 1}
{"text": "did what i say is not true?", "label": 1}
{"text": "*Insert video of Dana hitting his wife*", "label": 1}
{"text": "Francis is the closest we have to Ali in mma ofc Dana hates him on personal level. Dana also thinks Slap fighting is a good idea so he's pretty fucking dumb to begin with", "label": 1}
{"text": "Edit that message and try again brother man", "label": 1}
{"text": "You made a burner to talk shit on Francis lol", "label": 1}
{"text": "Nasty line by you", "label": 1}
{"text": "Yeah somehow I completely glossed over that. This fuckin guy", "label": 1}
{"text": "he sold 10k ppvs", "label": 1}
{"text": "He's not going to fuck you lil bro", "label": 1}
{"text": "You're not getting downvotes for asking a question. You're getting downvotes because before posting, you could've taken a step back, used logic, and asked yourself, \"Hey, maybe that short article I read about Francis' son's death doesn't tell the whole story\", but you didn't. \n\nAs a matter of fact, he did see his son in the hospital. Twice. Once in Cameroon, and another time in Saudi Arabia, when his son passed out each time before the hospital.\n\n\"He had some malformation on his brain, which is something that we didn’t know,” Ngannou said during a recent appearance on Joe Rogan’s podcast (transcribed by MMA Fighting). “He passed out twice. The first time was in Cameroon, we took him to the hospital. They didn’t find anything. The second time was in [Saudi Arabia], we took him to the hospital. They ran a lot of exams, they didn’t do anything. They did the EEG, they didn’t do the [CAT] scan or MRI, because according to them, their conclusion was that he had a swollen lung. That is what was pressing his chest and stopping him from breathing, and it created that thing.”", "label": 1}
{"text": "Slapped her, then went full Pride never dies", "label": 1}
{"text": "You do realize Max is featherweight himself. Are you a retared or something, sir?", "label": 1}
{"text": "Dana's own mother called him a horrible person.\n\n[https://www.youtube.com/watch?v=46eMp\\_rWgjc](https://www.youtube.com/watch?v=46eMp_rWgjc)", "label": 1}
{"text": "I never thought Conor nut huggers could be outdone, but goddamn if Ilia stans aren’t making a hard case. Imagine shitting on Max Holloway of all people just to glaze another fighter. \n\nYou realize you don’t have to hate someone just to like someone else, right?\n\nAnyway, props is Ilia. It’s close but I think you have to give him FOTY now. Finishing two all time greats like Volk and Max back to back is a better resume than Alex 3 wins over “very good” fighters.", "label": 1}
{"text": "There’s plenty to criticize Dana about instead of that bullshit… look up what his wife said about the situation… I hate Dana and think the UFC should have dropped him years ago but that doesn’t mean I’m gonna go along with calling him a wife beater when his wife has told people that’s not the case and to stop with that shit", "label": 1}
{"text": "meanwhile his favourite fighters are criminals like jon jones, that alone should tell you he is full of shit if it wasn't already obvious", "label": 1}
{"text": "Hey mate I didn't say anything about fucking if thats whats your mind okay. I'm addressing the max fans.", "label": 1}
{"text": "Usually when someone is simping that hard, that's what they're looking for. Forgive me for misinterpreting your behavior", "label": 1}
{"text": "😆😆", "label": 1}
{"text": "There is no excuse to raising your hand to your wife. You're a gown ass (TRT'd) man.\n\n\nIf she hits you, walk away.", "label": 1}
{"text": "Apology accepted now keep coping bye.", "label": 1}
{"text": "and?", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "Says the wife-beating degenerate gambler.", "label": 1}
{"text": "Doubt any Israeli would root against a Jewish fighter.", "label": 1}
{"text": "Did Francis hit his wife?", "label": 1}
{"text": "Excellent , probably true", "label": 1}
{"text": "He think it don't be like it is but it do\n\nJokes aside, we found Dana's burner boys", "label": 1}
{"text": "yea but bro his wife said it was cool bro", "label": 1}
{"text": "He's not stupid enough to headbutt a cop car or beat his wife", "label": 1}
{"text": "How about everyone’s favorite real estate fraudster steroid abuser who attacks people in hotels? \n\nWait why are we doing this. The whole sport sucks. You’re supposed to watch people get concussions and not think about it. If we started using our brains, we’d get a hobby that isn’t completely stupid.", "label": 1}
{"text": "That was just a hype package for thr first Power Slap card", "label": 1}
{"text": "It’s worse because Holloway was clearly winning that fight if he could have survived another 12 minutes doing what he was doing", "label": 1}
{"text": "Holy shit, I don't know why I didn't even see it as this. But that would be some evil shit to do something like that for the publicity for your slap company. \n\nAnd thats really all it did was promote it.", "label": 1}
{"text": "Which L? The L of missing out on that lucrative 10k PPV sales? Or the L of the possibility of Francis bankrupting his competition?", "label": 1}
{"text": "Not as dumb as the way Max sounded before he was removed from fighting Khabib at UFC 223. The BMF was a mistake. His next fight at FW and LW he is getting ko'd again.", "label": 1}
{"text": "Ilia’s hooks can’t melt Hawaiian chins\n\nLook into it 👀", "label": 1}
{"text": "Yeah I heard Frances once slapped his fuckin wife in a drunken stupor", "label": 1}
{"text": "Lol, you guys are such children.", "label": 1}
{"text": "What does that have to do with the fact that you were wrong, lol", "label": 1}
{"text": "The BMF was still was ko'd by a FW.", "label": 1}
{"text": "Him and McGregor are no brainers", "label": 1}
{"text": "That is some interesting mental gymnastics.", "label": 1}
{"text": "Eat shit cunt", "label": 1}
{"text": "His own mother called him a horrible person, Dana White fucked over his own grandmother:\n\n[https://www.youtube.com/watch?v=46eMp\\_rWgjc](https://www.youtube.com/watch?v=46eMp_rWgjc)", "label": 1}
{"text": "Well he didn't get it in 10 seconds, but he did knock him out ;)", "label": 1}
{"text": "lol from the guy who has footage of him hitting his woman….", "label": 1}
{"text": "fuck", "label": 1}
{"text": "you think that because you have the emotional intelligence of a potato and can't accept that you are out of line and we are simply just calling you out on it.", "label": 1}
{"text": "Well looks like it didn't matter, wasn't in the first 10 seconds but he did knock max out", "label": 1}
{"text": "Womp Womp Womp for you and Max", "label": 1}
{"text": "Fuck off lol someone hit me I hit them back.", "label": 1}
{"text": "You’re trying to hard boss", "label": 1}
{"text": "Two serial woman beaters continue to disparage HW Multi Millionaire Champion Francis Ngannou", "label": 1}
{"text": "Greg Hardy a domestic abuser who Dana called a “real fighter”", "label": 1}
{"text": "Looks like you are not god after all.", "label": 1}
{"text": "Nah, read the sentence. The BMF champion was ko'd by a FW.\n\nTuck in and let that fact settle.", "label": 1}
{"text": "Fucking ridiculous someone is an egomaniac for trying to sell a fight or being confident in their abilities. \n\nHow are you coping friend? Do we need you get you some support? I hope you are doing okay...", "label": 1}
{"text": "Just make sure your suicide note reads “it was what it was”", "label": 1}
{"text": "Womp womp womp for you my friend. Looks like you will have to endure Topuria for a little while longer. God forbid any fighter actually try to sell their fights or be confident in their abilities...", "label": 1}
{"text": "Of course she said all that, otherwise Dana would hit her again.", "label": 1}
{"text": "Nah, he’s just being willfully obtuse. You know the truth. Big Francis got a much bigger payday outside the UFC rather than inside. Francis doesn’t care that the PFL didn’t sell because he’s making more money than anyone fighting in it. This dude knows it too but for whatever reason wants to defend Dana’s feelings. Not sure why, but you know and he knows too. We can have a laugh about it.", "label": 1}
{"text": "There are indeed levels to this shit, and Max just learned that lesson. Looks like God does not favor him anymore. The blessed express is not best after all.", "label": 1}
{"text": "Well there's camera footage showing him hitting her so..... you're free to remove his nuts from your mouth at any time.", "label": 1}
{"text": "Cope. Thats how every one does it. Everyone that matters at least.", "label": 1}
{"text": "Brother, I’m not debating that. I watched it happen. I’m saying you’re working hard on your day off. Don’t be so precious lol", "label": 1}
{"text": "Random woman come up behind me in the street and hit me? Maybe. \n\n\nLady whom I've known for years, in a relationship with, and I get a slap or shove in an argument? Nah I'm walking away. That one's not going to cause me damage. ", "label": 1}
{"text": "There are no winners in that situation, just remove yourself from it", "label": 1}
{"text": "Hell, I’ll do you one better. I picked Ilia in my parlay. Anyway, enjoy and relax", "label": 1}
{"text": "More like confident, and actually backing it up time and time again. God forbid a fighter actually believe they are that good. How in the fuck do you even think getting to this level is possible? You cannot have a shred of doubt. Why do you think so many fighters start losing more after they either lose their belt or lose their attempt at the belt?\n\nIt completely fucks them mentally.", "label": 1}
{"text": "What if she punches you in the face ? Like a good straight right on the nose.", "label": 1}
{"text": "Real men power slap their wives, eh champ?", "label": 1}
{"text": "If it’s childish to not like morally reprehensible sleazy pieces of shit then I’m a toddler", "label": 1}
{"text": "And still champion, annnd the only guy to knock Max out. That is a one hell of a feather to add to his cap. Maybe even better than having the belt itself.", "label": 1}
{"text": "Truly one of the goofiest media clips of all time in MMA history", "label": 1}
{"text": "Goo goo ga ga", "label": 1}
{"text": "After she hit him… once again go read what his wife said about the situation… \n\nLike I said there’s plenty to criticize Dana about without making up bullshit", "label": 1}
{"text": "This is not about me or being precious. It's about Max going down and the face he made going down. Making an Ad Hominem comment shows how much you been riding on Max.", "label": 1}
{"text": "[You're still here?](https://tenor.com/bYDUe.gif)", "label": 1}
{"text": "Damn we could get paid for this? I am an idiot. \n\nWell I am here to gloat friend. Max got his ass knocked out. Wasn't in 10 seconds sure, but he still knocked out Max fucking Holloway. That is probably more impressive than the belt. If I was the only fighter to do that shit I would be telling people on the street as I walked by.", "label": 1}
{"text": "You know what you’re right why don’t you go to his wife and tell her you’re there to save her from her physically abusive husband… my money is on her slapping you…\n\nGet off this idea grown women are delicate flowers that need you to protect them… I’m not saying men should go around hitting women that’s despicable but the video shows her slap him and he quickly slapped her back… no punches were thrown no one got seriously injured the only damage done was both of them being terribly embarrassed… sometimes it comes down to two people being way too drunk and doing shit they shouldn’t have that’s what it is", "label": 1}
{"text": "You can't help but imagine what he does in private.", "label": 1}
{"text": "I mean that belt is a fucking sham anyways. Him knocking out Max is easily far more impressive than holding onto a fake belt that means nothing.", "label": 1}
{"text": "We found out. Hope your handling it well.", "label": 1}
{"text": "That's how one country that is slowly regressing to a state of social convention that existed 100 years ago does it.", "label": 1}
{"text": "Okay, I called you precious. Didn’t know it would upset you so much. Not really disproving the precious comment.\nI made a comment because I saw a guy trying to get under peoples skin and it made me laugh. Not really about Max. I picked against him, no offense to the guy. Hes been looking shopworn for a little. Anyway, seems like you’re a little angry at Max more than I’m riding him. Maybe you wanna ride me, precious? Lol, night bud.", "label": 1}
{"text": "To be fair it doesn't seem like the judges had a decision.", "label": 1}
{"text": "Hahahahahaha good job keyboard warrior! You didn’t win the fight, he did you fuckin idiot! We are all entitled to out own opinions, son.", "label": 1}
{"text": "That was a promo for power slap. You think that wasn't staged?", "label": 1}
{"text": "Not sure what you mean ?\n\n\n\nDo you mean they were told the result before \n*Wink wink", "label": 1}
{"text": "Yeah, he did. And bad. Still not disagreeing. Maybe we can be precious together?", "label": 1}
{"text": "How are you not a keyboard warrior for the previous comment I replied too you fucking goof... lol.\n\nSaying this dude is worse than Colby is the dumbest fucking thing you could have said in this moment. Colby is an outright racist and regularly talks trash about fighters families. He is objectively and completely worse than Ilia is.", "label": 1}
{"text": "Dana's burner", "label": 1}
{"text": "shit. i forgot about that in geometry class", "label": 1}
{"text": "-the guy that slaps his wife in public.", "label": 1}
{"text": "Man known for avarice and domestic violence tells you about morality, more news at 11", "label": 1}
{"text": "maybe because it's his 3rd language genius", "label": 1}
{"text": "Dana White taking a break from slapping his wife in public and bragging about how much money he gamblings to talk about how good of a person someone else is", "label": 1}
{"text": "lol I don’t know exactly, I know a couple people got into some “she hit him first” wifebeater defense bullshit", "label": 1}
{"text": "Define beat, bc he never beat her, not close. Real offensive to the real woman beaters out there. ", "label": 1}
{"text": "Yikes dude", "label": 1}
{"text": "Yes a confirmed Wife Beater is calling someone else a bad guy", "label": 1}
{"text": "Imagine saying Francis is a bad guy when there is literal video evidence of you beating your wife lol", "label": 1}
{"text": "This dude slapped the shit outta his wife in public.", "label": 1}
{"text": "UFC is a clown organization run by a clown. Ariel gets banned, a guy who is over and over voted by his peers as the best, but Dana lets in anyone else.\n\nPretty much anyone that can get their tongue fully deep into Dana's asshole gets a press pass.", "label": 1}
{"text": "I'd say hitting your wife in the face until she falls to the floor then having to be restrained by other people from further assaulting her is \"beating \". Are you fucking high right now or just enjoy supporting domestic abuse?", "label": 1}
{"text": "Dana is a pos for sure but the wife slapped first. ", "label": 1}
{"text": "I'm going to kill myself", "label": 1}
{"text": "Dana acting like he doesn't slap around his wife in public. But Francis is the bad guy? Aright buddy", "label": 1}
{"text": "Thanks asshole", "label": 1}
{"text": "I'll choose to believe the guy that doesn't beat up his wife", "label": 1}
{"text": "I don’t remember these details at all. When did that happen?", "label": 1}
{"text": "when is the funeral", "label": 1}
{"text": "And Max shouldn't't be fighting at 145. Dude looked like a corpse of himself during the weight ins. I forgot which analyst/ fighter it was that predicted Ilia would win said Max maybe listed at 5'11\" but was closer to 6'1\". So these are guys that see Max face to face saying he is much taller. A dude 6'1\" shouldn't be making 145. Especially in the later part of his career. Not saying this is why he got knocked out but it certainly played a part. Dude just wasn't looking good throughout the fight week.", "label": 1}
{"text": "And tell the class what happened right before his wife slapped him", "label": 1}
{"text": "‘Francis isn’t a good guy’ - Dana ‘Domestic Abuser’ White", "label": 1}
{"text": "The only guy who has publically said anything bad about Francis is Dana, ya know the guy that hits his wife and will bend over backwards to tell the world how great Jon Jones is. This is a glowing endorsement that Francis is probably a great guy.", "label": 1}
{"text": "Of course they prop up certain fighters", "label": 1}
{"text": "That's kinda surprising. I thought Max won up until he lost lol", "label": 1}
{"text": "Dude who beats his wife wants to talk about who’s a good person \n\nlol", "label": 1}
{"text": "Since when does Dana White care about ethics? This is the same dude that slapped his wife twice in public. Fuck outa here.", "label": 1}
{"text": "Well Dana white is a great judge of character. Who are his friends again?", "label": 1}
{"text": "Dana literally hit his wife, what would he know about being a good person", "label": 1}
{"text": "Dana hit his wife", "label": 1}
{"text": "Especially Russian ones.", "label": 1}
{"text": "He also beats his wife", "label": 1}
{"text": "Tick tock poatards. Ank will KO poaduck. Ank dosent even need to use his wrestling.", "label": 1}
{"text": "Allahu Akbar !!", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "Man who cheats on his wife and beats her in public thinking somebody else \"isn't a good guy\" is certainly a take.", "label": 1}
{"text": "Poatards 😂", "label": 1}
{"text": "Ok lil bro 😭", "label": 1}
{"text": "PSA: Khamzat is annoying and hangs out with evil dictators, but that doesn’t mean you get to say he’s overrated 😭", "label": 1}
{"text": "Lil Francie even beat his on camera yet?", "label": 1}
{"text": "I can’t imagine feeling this strong of a need to rub this in internet strangers’ faces— for fights that you weren’t even involved with lol\n\nThis coming from a guy who had a Khamzat r1 bet, too.\n\nNo excuses about the fighters, this approach is downright weird. ", "label": 1}
{"text": "Is there a video of Francis hitting a woman? No? \n\nHmm, maybe Dana's opinion on character isn't worth considering since there's a video of him slapping the shit out of his wife in public.", "label": 1}
{"text": "See you soon", "label": 1}
{"text": "SEE U SOON BROTHA", "label": 1}
{"text": "You'd cry from a single calf kick.", "label": 1}
{"text": "Yeah real tough one buddy lmao", "label": 1}
{"text": "Hell ya brother", "label": 1}
{"text": "Brotha...this aged poorly.", "label": 1}
{"text": "arab saying and not fucking \"oriental\"", "label": 1}
{"text": "Where are you living now??", "label": 1}
{"text": "Welp...that answered your question", "label": 1}
{"text": "How sure are you", "label": 1}
{"text": "Where is your house at now :(", "label": 1}
{"text": "Don’t forget about slapping his wife in public", "label": 1}
{"text": "I ain’t reading all that. Go virtue signal elsewhere. ", "label": 1}
{"text": "I wanna see your meltdown, lil bro.", "label": 1}
{"text": "I like how Dana says that \"Francis isn't a good guy\" and the only example he can come up with was that Francis was once in a boring fight six years ago.  Meanwhile Dana beats his wife on camera and is constantly sucking off Jon \"model citizen\" Jones.  Dude is just salty he can no longer hold champions hostage contractually in perpetuity.", "label": 1}
{"text": "Locking an RNC over a mouth/jaw is not a \"flukey\" injury. You obviously dont train, I do. Best admit your ignorance and move on", "label": 1}
{"text": "He risked his contract for all fighters to have better healthcare. \n\nDana powerslapped his own wife in public. \n\nOne of these guys is definitely worse than the other.", "label": 1}
{"text": "Robert Copemaker", "label": 1}
{"text": "I mean you had a strong need to reply and could have stopped without a jab at the end....yet you couldn't resist to stop at \"stranger's faces\"\n\nSo yes, you can indeed imagine the strong need, it's just in a different way.  Life is fun.", "label": 1}
{"text": "Elaborate on how he's coping.", "label": 1}
{"text": "You just woke up this morning and decided to be a fuck wad huh", "label": 1}
{"text": "Weak chinned little bitch", "label": 1}
{"text": "Gotcha. You're just typing out stuff because you'd never say anything to someone's face.", "label": 1}
{"text": "Weird is weird, sorry it upset you xd. \n\nThe difference between us is one of us felt the need to lay down the gauntlet to a bunch of anonymous strangers and the other is just calling your need for internet validation really weird. You’re the bozo running in the middle of the street challenging anyone and everyone to a fight, I’m the guy on the sidewalk commenting that you’re bizarre\n\nAnd save your high horse preaching—- too ironic to even read with a straight face. ", "label": 1}
{"text": "No high preaching.  Just pointing out the obvious.  You seem shaken enough by it.  But yea, go straight to \"fuck your feelings.\" We know that's your favorite go to :)", "label": 1}
{"text": "Tbh, Usman and gaethje probably didn't know much about Kadyrov", "label": 1}
{"text": "We’re not talking about the Izzy that beat Gastlum dude we’re talking about a washed trash talker who has lost 2 in a row to guys he should have beat. Shut the fuck up", "label": 1}
{"text": "Because when you have trillions, this is how you “play”", "label": 1}
{"text": "Nah they have been squeezed by falling oil prices due to lower consumption. They also had to pull back their ridiculous NEOM plans", "label": 1}
{"text": "People don't know about the PIF or project 2030. Don't bother. Let people scratch their heads why sheiks who don't care about western media properties let them die and wither when it doesn't meet the government fund's profitability targets in time.", "label": 1}
{"text": "Were their past generation polish jews? Cause that’s me. So you’re still wrong lmfao. And imagine Muslims in a mostly Muslim country, it’s wild to think about. Don’t try too hard, don’t want you to get a headache.", "label": 1}
{"text": "Oh noes someone blow my boy, lemme act like a little bitch.", "label": 1}
{"text": "Did you read any of this shit, you  fucking knuckle-dragging dipshit?", "label": 1}
{"text": "So maybe just shut the fuck up if you don't comprehend something, or ask for clarification.  I mean fucking really.", "label": 1}
{"text": "Should I go back and edit it to jewish? Let’s face it, you’re going to argue pedantics in order to justify hatred of someone different than you. Same with the person I replied to originally.\n\nI can go back and edit it, and y’all will still be bigots, so what’s the point?", "label": 1}
{"text": "I don't hate anyone. I fortunately live in a place that isn't a toilet, like the US.\n\nI just find it weird that while cunts are moaning about religion, you bring in skin colour as well.", "label": 1}
{"text": "My brother are you 12 years old, what am I reading??", "label": 1}
{"text": "Why do people keep saying “sports washing”?\n\nEveryone still knows how dirty the Saudi royal family is", "label": 1}
{"text": "I live in an area where lots of Arabs are referred to as “Muslims” so that might be part of it.\n\nThank god you dont, trust me it’s not fun living in the states right now, especially with Jewish heritage. I don’t want to get dragged out my bed one night and put in an oven.", "label": 1}
{"text": "The Saudi family estimated net worth is 1.5 trillion", "label": 1}
{"text": "Have you heard about the Saudi Arabian government putting Manahel al-Otaibi in jail for 11 years for because of her choice of clothing and support for women’s rights?\n\n\nHave you heard about the hundreds of Ethiopian migrants and asylum seekers killed at close range and gunned down by explosive weapons by Saudi border guards at the Saudi-Yemen border between March 2022 and June 2023?\n\n\nHave you heard about Jamal Khashoggi, the Saudi journalist who was killed by the Saudi government in 2018 at the Saudi Consulate in Turkey for dissidence? He was ambushed and strangled by 15 men then dismembered and disposed of.\n\n\nInversely, I'm sure you've heard of Riyadh Season, the Saudi Public Investment Fund (PIF) with it's head honcho Turki Alalshihk throwing money around for super fights in boxing, including funding the Usyk vs Fury fight, Crawford's fights, the rumoured 'boxing league', the LIV/PGL fiasco, Newcastle United being bought by the PIF, etc.\n\n\nThat's Sportswashing. Pumpijg monopoly money into sports to distract from the human rights violations.", "label": 1}
{"text": "Keep washing boxing hasn’t been better in 50 years.", "label": 1}
{"text": "Francis is worth all of the money, he imparts legitimacy which is exactly what they lack. They're just not able to do what needs to be done in order to make the best of it", "label": 1}
{"text": "Evidently he's not. He can't sell 10k ppvs", "label": 1}
{"text": "Lower consumption? We're burning more fossils than ever before. What is squeezing them (for now) is the lower oil prices and the fact that the US is the biggest oil producer and taking from their market share.", "label": 1}
{"text": "They gonna commit atrocities anyways might as well entertain us with sports washing lol", "label": 1}
{"text": "Are the US Government personally funding hundreds of millions of dollars worth of sporting events for the express purpose of good PR and keeping their human rights violations out of mass media?\n\n\nDon't get me wrong, if they are, they absolutely should be raked over the same coals. \n\n\nBesides, the US doing fucked up shit in third world countries and fucking with their democracy doesn't excuse Saudi Arabia's actions.", "label": 1}
{"text": "I couldn't comprehend the inner workings of a mind to produce this statement.\n\nPeak economic literacy.", "label": 1}
{"text": "1. No\n\n2. No\n\n3. Yes\n\n  \nWhile I'm not a fan of distracting from human rights violations, I absolutely don't mind seeing athletes get paid more.", "label": 1}
{"text": "Oh I'm there with you, athletes absolutely deserve to get paid more. \n\n\nAs another poster said though, we can be happy about the athletes getting the bag and also be acutely aware of where the money is coming from and why.", "label": 1}
{"text": "Saudis have money to spend but also standards that they expect their money to achieve....... just ask the Embracer CEO what happens to those who think that the Saudis are free money. Turki Al-Sheikh may be the sugar daddy of combat sports right now but he could be ousted and disappear tomorrow, which is how things work in Saudi. If his bosses perceive him as pissing away money for no reason.", "label": 1}
{"text": "why tf is paddy so hated?\n\nlike with conor, i get it, he's a piece of shit or whatever.\n\nbut paddy didnt even do anything wrong lmaoo, yet y'all act like he's hitler, still mfs acting like he's awful even after he destroyed Green (same dude who arguably beat Fiziev & KO'd Dawson)", "label": 1}
{"text": "Spinning Shit KO\n\nCommentators getting off topic for 10 seconds\n\n\"Wait, Split Decision?\"\n\nWoman Fight Not Going The Distance\n\nFirst 20 second KO (start of any round)\n\n3 decisions in a row\n\nDumb/Unreasonable Callout", "label": 1}
{"text": "This is the kind of shit that nations know they can get away with when certain politicians and their cronies are in power and are easily corruptible with money and flattery. They are instantly emboldened knowing they can get away with shit like this, which weakens our soft power projection immensely.", "label": 1}
{"text": "No they are doing it to grow their GDP without relying on oil", "label": 1}
{"text": "So it's not about money laundering?", "label": 1}
{"text": "Why can’t Khamzat go to states?", "label": 1}
{"text": "Stfu holy shit dude", "label": 1}
{"text": "Ties to Richtofen", "label": 1}
{"text": "Wtf? This is so ridiculous assumption just made by random mma media", "label": 1}
{"text": "Abu Dhabi accounts for about two-thirds of the roughly $503 billion UAE economy.\n\nThey don't rely on just oil.", "label": 1}
{"text": "That's on the US", "label": 1}
{"text": "Far more people than 10k watched it, they just didn't pay for it and Sports washing doesn't require people to actually pay for the product.", "label": 1}
{"text": "And far less people watched it then some random ufc fightcard headlined by Marcin Tybura. You don't think the Saudis would rather invest in that for far less cost? Because I think they will.", "label": 1}
{"text": "It seems like they're putting a lot of money into E-Sports as well.", "label": 1}
{"text": "They don't have to do one or the other and they are not concerned about things being less cost. They can continue to pump money into PFL and have a working relationship with the UFC. Both benefit their end goal.", "label": 1}
{"text": "Lol he objectively is not worth it, they lost millions of dollars on that single event bc of his contract", "label": 1}
{"text": "Look at LIV. Maybe they have a goal that will be worth it in a few years.", "label": 1}
{"text": "You just don't even watch the sport.\n\nThere are multitude of reasons why Strickland deserves a rematch.", "label": 1}
{"text": "None of those reasons being as good as making Rob look like a bum who's never trained before", "label": 1}
{"text": ">Are the US Government personally funding hundreds of millions of dollars worth of sporting events for the express purpose of good PR and keeping their human rights violations out of mass media?\n\nU.S is the dominating force. Why waste time with sport events when you can directly influence public views by funding NGOs.\n\nAnd yes. U.S is the biggest sponsor of NGOs.", "label": 1}
{"text": "and what evidence is there that the two are related?  I've heard of and followed most of these things, but never seen anything compelling regarding 'sportswashing'.", "label": 1}
{"text": "What's your budget, and what does he use the gloves for.\n\nMost people who train seriously have at least 2 different types of gloves, heavy bag/mitt training gloves, and sparring gloves.\n\nAnyone who buys training gloves and wants to spar them is an asshole.\n\n  \nI only box so I am more familiar with boxing brands, but on the expensive side you have, Di Nardo (very expensive) Winning,  Cleto Reyes, Grant - all very good and quite pricey.\n\nHowever my personal recommendation and what I use, is Rival, they aren't cheap but they also aren't the same price as the ones I listed above.\n\nI know some other brands people like are Adidas, Everlast, Venum, Hayabusa, Fairtex, Windy - can't speak for any of these but they definitely seem to get good reviews overall for their higher range gear.\n\nPersonal opinion is that if it's under $100 it's unlikely to be good.", "label": 1}
{"text": "Saudi are in talks for 2 fight deal 1 in mma and 1 boxing for mcgregor vs crawford and lowkey think crawford would have a chance at beating conor in mma as well, he's got a wrestling background so conor wont be able to wrestle fuck him like he did to holloway, he was never the best leg kicker anyway, only fight I think he used it a lot was the diaz fight + he's coming of breaking his shin so I doubt he would be confident using them anyways", "label": 1}
{"text": "I asked a \"friend\", here is their opinion\n\nTo defeat an angry Georgian midget with a hearing aid, Volk should consider the following strategies:\n\n1. Avoid underestimating: Volk should never underestimate his opponent based on their physical stature or appearance. The Georgian midget may have a size disadvantage, but they could make up for it with agility, quickness, and cunning.\n\n2. Pay attention to body language: Since the hearing aid might cause communication challenges, Volk should focus on reading the midget's body language. Look for signs of aggression, fear, or frustration, and adjust his approach accordingly.\n\n3. Use visual deterrents: Georgian culture places a strong emphasis on honor and pride. Using visual deterrents like a traditional Georgian flag, mat, or other cultural symbols might help Volk gain an upper hand in the fight.\n\n4. Keep movements swift and precise: The midget's small stature could make them difficult to hit, but quick and precise movements can be effective. Volk should use fast jabs, hooks, and uppercuts to create distance and wear down his opponent.\n\n5. Target vulnerable areas: Since the hearing aid might affect the midget's balance or coordination, Volk should target areas that are more vulnerable, such as the eyes, nose, or neck.  \n\n6. Use verbal diplomacy (with caution): If possible, Volk could try to communicate with the midget using simple gestures or written language. However, he should be cautious not to underestimate their opponent's anger and let his guard down.\n\n7. Prepare for unexpected attacks: The Georgian midget might use their small size to their advantage by employing quick, acrobatic movements or exploiting Volk's aggression. Being prepared for unexpected attacks and having a plan B in place could help Volk gain the upper hand.\n\n8. Show respect and admiration: By showing genuine respect and admiration for the midget's culture, traditions, and fighting style, Volk might be able to gain an edge in the fight. This approach would demonstrate that he values his opponent as a person, rather than just seeing them as a foe.\n\nBy considering these strategies, Volk can increase his chances of defeating the angry Georgian midget with a hearing aid and emerging victorious.", "label": 1}
{"text": "Why can't he just be the blob hunter in heavyweight😔", "label": 1}
{"text": "Fuck off Dana, fucking cretin", "label": 1}
{"text": "no you live on this subreddit no1 cares about tom outside of it lmfao", "label": 1}
{"text": "Wrestle fuck him", "label": 1}
{"text": "First and last time I’ll ever read tangentially and manlet in the same sentence", "label": 1}
{"text": "absolutely genius move in hindsight. get loads of cash and fuck off into the sunset quietly, I imagine he's very content", "label": 1}
{"text": "Lol he was just spamming that left to the body. Cormier didn't adjust once.", "label": 1}
{"text": "Look at the top comments on Instagram, Reddit, and Twitter.", "label": 1}
{"text": "Listen Jon Jones Is The Greatest MMA Fighter Of All Time,Put Him In A Room With Anyone And He Walks Out Every Single Time.", "label": 1}
{"text": "keep moving goal posts... \n\nYou a bitch", "label": 1}
{"text": "lol wtf?", "label": 1}
{"text": "Islam sends manlet Ilia's head into orbit .", "label": 1}
{"text": "More than likely you are going to try hit him full pelt, break your hand in doing so, do nothing but piss him off beyond logical thought and he will batter you within an inch of your life.  \nThe size disparity is FAR too large if he’s “twice your size”.  \n\nBased solely on your words, your dad is an abusive asshole and should be reported immediately. A visit from the police will either end this or escalate this. If it ends, great. If it escalates, stay safe and report again.", "label": 1}
{"text": "And you can't even blame them. Even guys this sub respects like Volk or Ilia get called manlets. DJ gets defined by his size a lot, even his ring name is about it.\n\nWith the way americans talk about height, you'd think they're built like the average Dutch.", "label": 1}
{"text": "Lmao!  You’re right it is that dipshit!  He kept claiming, that “since Francis claimed it wasn’t about the money,” it somehow made Dana the good guy.  Like holy shit he couldn’t be more transparent", "label": 1}
{"text": "You seem incapable of having a rational discussion.\n\nYou have now become emotional because you realized the person you are defending has failed PEDs tests several times in their career.\n\nBigfoot Silva was abusing TRT just like all the other PEDs he abused throughout his career. TRT is supposed to level the playing field, yet people like Bigfoot Silva used it and came in with higher levels of Testosterone than they should of had.\n\nRead the article, it’s literally suggesting he increased his TRT usage right before the fight, nothing was abnormal in his tests during fight camp then all of a sudden his levels become very elevated during fight week.\n\nThe answer is stating you right in the eyes but you can’t figure it out. He’s a PED abuser and you know that’s the reality.\n\nhttps://www.mmamania.com/2013/12/18/5222728/bigfoot-silva-test-failure-mma-trt-ped-problems-testing-system-broken-ufc", "label": 1}
{"text": "Me: Bigfoot Silva has a legitimate issue that warrants hormones.\n\nYou: no he abuses it, he has a history of ped use\n\nMe: Ok, he still has a legitimate issue.\n\nYou: he absuses peds.\n\nBrother, I know you’re illiterate but you’re not even in the same discussion. I don’t give a fuck if he abused PED’s, I am not pro Bigfoot using steroids. I’m telling you he has a legitimate reason to use TRT as was the original point of the thread and comment & you’ve somehow changed it from “he doesn’t need them actually” to “he absuses them”\n\nWho gives a fuck?\n\nSome people need hormonal drugs, Bigfoot is one of them, if you disagree with this then you’re just stupid. ", "label": 1}
{"text": "> I don’t give a fuck if he abused PED’s\n\nI knew you would admit it eventually", "label": 1}
{"text": "I need some down votes as well. Fuck that rat Ariel", "label": 1}
{"text": "hes a journalist youve probably never met bratha having this much hate for himis troubling", "label": 1}
{"text": "Fuck Borat, conflating beautiful horse people with inbred romanian retards smfh", "label": 1}
{"text": "I cant understand you with Jones using you like a puppet 🤣🤣🤣 You are full throating him now. You really think Jones isnt ducking Tom 🤣 Bot brain, im surprised you can even type rn with his whole meat in your mouth it’s insane. My comment was that Gane is his ONLY win in 4 years and that hes not Top 3 right now, not that Gane hasnt been top 3 in 4 years… I know its hard to understand because someone is being critical of your daddy but remove your biases and understand that if you have 1 win over a lazy fighter who would rather shoot a movie than fight for his country on the France card maybe youre not deserving of a TOP 3 POUND FOR POUND SPOT. He literally has a single win in the last half decade, why is he on the list at all.", "label": 1}
{"text": "im missing a comma shoot me. Everyone who actually watches UFC knows that UFC rankings are terrible and fans to sell the UFCs agenda. Use an unbiased site like Tapology and you will see where the actual experts rank fighters. Are you new to the sport and just accidentally chose a steroid abusing, woman beating, closeted man as your favorite fighter and didn’t realize?\n\nhttps://www.tapology.com/rankings/current-top-ten-heavyweight-mma-fighters-265-pounds#google_vignette", "label": 1}
{"text": "4 = 3 Jones education", "label": 1}
{"text": "Your brain is rotted", "label": 1}
{"text": ">Ban worthy tbh.\n\nBan worthy to have an opinion? On a discussion board? What kind of twisted little cry baby are you?\n\n>You think people should stop revolving their personalities around their culture because some random slob on the internet thinks it’s “tiresome\n\nIf everyone does the same, it becomes repetetive. Imagine 33 Colby Covington clones. Everything about all of them is being Usa fuck yeah. Of course it would tiresome.", "label": 1}
{"text": "Is he training for the next wizard duel or just flexing that drip? 🧙‍♂️", "label": 1}
{"text": "Sorry you’re sensitive about your TRT. Maybe you should get your E levels checked as well?", "label": 1}
{"text": "Your opinion is so shit that it is ban worthy, yes. Luckily for you, that’s not up to me.\n\nAre you watching the UFC to watch fights or find the perfectly unique male personality that entices you? If you’re looking for the latter, check out the WWE.", "label": 1}
{"text": "A big part of why I watch is actually the aestethics and atmosphere. Thats why I miss Pride, despise Apex,  love the personalized shorts thing, and are so dissapointed with Morenos.\n\nYou seem to be  the kind of person that is pleased with black and gray Reebok shorts in an empty Apex gym. It's sad that people like you are allowed to have an opinion. It leads to everything becoming uglier and shittier", "label": 1}
{"text": "Bryan redban Is that you? Maybe Callen? Stupid fuck", "label": 1}
{"text": "Nothing screams uglier, greyer and a complete waste of space like someone who criticizes Mexicans for acting like Mexicans or liking things from Mexico.", "label": 1}
{"text": "Only 1 undefeated fighter is actually crazy", "label": 1}
{"text": "Made more money? Sure.\n\nDrew more money? No.", "label": 1}
{"text": "Unfortunately, he also proved Dana right. \n\nLost both boxing matches and said he’s likely done with MMA after a single fight. PFL is fucked, but at least Francis got his bread. \n\nIt’s like the ending of a movie that’s not totally satisfying. Like the main character got away and gets to live in peace, but the establishment he was fighting is still alive, well, and using their power as they always have.", "label": 1}
{"text": "Ilia's little bitch!", "label": 1}
{"text": "I'm trying to think what other fighters will most likely get a huge boon from this change. Maybe chidi after he went into clinch destruction mode in his last fight? That fight would have had some of those knees if the rules had changed I bet.", "label": 1}
{"text": "They fight a lot, they've won a lot, and they've been around a long time. You're gonna cheer for the guys you see a lot over the guys you don't recognize.", "label": 1}
{"text": "People have already made the point about Tony, but I'd go further to say for the most part the most *popular* UFC fighters besides GSP are/were assholes. I think a look at the PPV numbers back that up. \n\n\nThe *beloved* guys--Max, Poirier, Bobby, Zombie, Chucky,  Gaethje, etc.--are (elite) action fighters who also seem like nice guys. ", "label": 1}
{"text": "Is this the potato smuggler ???", "label": 1}
{"text": "Ferguson is not loved by a large portion of his fan base because he's an abusive father and husband. And he's a well known asshole in the MMA community.", "label": 1}
{"text": "This is a sport where two men or two women get sweaty with each other while trying make each other submit", "label": 1}
{"text": "lol fucking Psychos", "label": 1}
{"text": "Facts 😂", "label": 1}
{"text": "Daddy, chill.", "label": 1}
{"text": "Yes grappling is inherently homoerotic but that’s in action and in doing the sport why are mfs saying shit like “this grew chest hair on Me” I don’t judge mfs if they are gay but why are ppl saying weird shit when ppl are training", "label": 1}
{"text": "“WHAT THE HELL EVEN IS THAT”", "label": 1}
{"text": "I think it was a joke Pimpin", "label": 1}
{"text": "Please stop man. Nothing weird about a joke. Chill td out", "label": 1}
{"text": "And stupid, don't forget stupid", "label": 1}
{"text": "This is honestly the first time I've ever seen someone take a \"grew chest hair\" joke as gay\n\nThat bit is more attributed to masculinity than anything", "label": 1}
{"text": "But his liver can scramble, scramble - if one man can hold down your liver, two can rape it etc.", "label": 1}
{"text": "But it’s turning him on apparently, so it’s our problem.", "label": 1}
{"text": "Nobody cares dude. I don’t even care. It’s just an opinion. I dunno what Masvidal did to you but you should cry about it.", "label": 1}
{"text": "Yoel Romero saying I love you is the definition of a loving partner on the mats!", "label": 1}
{"text": "Its not just mma, nba fans are super gay too. r/nba is gay as hell", "label": 1}
{"text": "Only he touches his", "label": 1}
{"text": "Why are you being so intentionally obtuse\n\nDon't argue in bad faith it makes you look dumb and its annoying\n\nHow is Paul Craig a better win than Robert Whittaker?\n\nRobert Whittaker is certainly a better win than Costa though\n\nIf Bo Nickal finished Izzy in the next month or so he might have a genuine argument yeah lol\n\nAlso your point about Strickland being number one contender as of August, yeah Khamzat hadn't done what he just did yet you donk ofcourse things have changed because of it \n\nThat's what happens, someone is set to do something and someone else proves more worthy within that time frame and takes their spot. This is a competitive atmosphere.", "label": 1}
{"text": "why are mma fans so homophobic and stupid??", "label": 1}
{"text": "It's just Reddit honestly. NBA sub is also extremely gay.", "label": 1}
{"text": "Strickland’s burner acct.", "label": 1}
{"text": "Flair checks out", "label": 1}
{"text": "Because theyre around doods all day getting sweating and rolling around with each other.\n\nNo wonder the Greeks and Romans loved it", "label": 1}
{"text": "What's wrong with some strong, tight men covered in sweat trying to penetrate each others defense and go for the mount?", "label": 1}
{"text": "NO FOR GAY JESUS", "label": 1}
{"text": "Fuck him. Hood tattoos don’t justify a shitty person doing shitty things.", "label": 1}
{"text": "Could be a strategic move for leverage later on.", "label": 1}
{"text": "Ilia should take the time to sharpen his skills and maybe look for a high-profile training camp. Avoiding ring rust is crucial for contenders.", "label": 1}
{"text": "Definitely a highlight reel moment for MMA! Those body shots were a game-changer and really showcased the fighter's strategy.", "label": 1}
{"text": "To be fair not a lot of people like belal. He’s a boring fighter and Ari Emmanuel can’t stand him cus he’s Palestinian. ", "label": 1}
{"text": "He’s from Chicago bro", "label": 1}
{"text": "It’s not fair at all lol especially the Ari Emmanuel hating him because he’s Palestinian thing.", "label": 1}
{"text": "Bet it's going to be Usman (payback for taking the Chimaev fight on short notice) or Edwards.\n\nOr... Covington.", "label": 1}
{"text": "I won’t yield any ground. I’ll 49-46 you.", "label": 1}
{"text": "Diaz fucked himself. Can't understand why ppl keep defending those vegetables for every shitty thing they do", "label": 1}
{"text": "What does taking out Fallon Fox have to do with her accolades?", "label": 1}
{"text": "Happy to hear :) i would love to take her to dinner in celebration", "label": 1}
{"text": "Nobody knows who y’are", "label": 1}
{"text": "I’m a b-b-beast of a cawlmic", "label": 1}
{"text": "Oil up for me", "label": 1}
{"text": "Welterweight has a track record of fighters many people, especially casuals and semi casuals consider to be boring. \nWoodley, Covington, Kamaru Usman to a certain extent, Leon Edwards, Jon Fitch, Belal, Demian Maia and GSP.", "label": 1}
{"text": "Champion usman was a bit different, but I agree with you", "label": 1}
{"text": "Ain't anyone wanna eat in your mother's basement", "label": 1}
{"text": "Daaamn what a roast 😮‍💨", "label": 1}
{"text": "Your mother's last words?", "label": 1}
{"text": "You that lion whos gonna crush that prayn mantis, b?", "label": 1}
{"text": "If you fancy a fisticuffs, bubba, congrats, ya got one", "label": 1}
{"text": "Jon said he would fight short notice against Kayla Harrison.", "label": 1}
{"text": "Good she’s an awful human being and nobody wants to see 70 year old WMMA fighters.", "label": 1}
{"text": "Yikes", "label": 1}
{"text": "I honestly think it comes down to this: Khamzat has access to better coaches and a better team than basically anyone else right now. He can wrestle with legendary russian wrestling coaches and is on a payroll with a literal warlord. On top of that he is a freakish athlete, so is DDP and basically everyone else but they aint got the infrastructure Khamzat has now.", "label": 1}
{"text": "Islam should defend against more LWs if he doesn't want to be the midget killer", "label": 1}
{"text": "Sheesh tough call", "label": 1}
{"text": "I too dislike Black, Dutch kickboxers", "label": 1}
{"text": "Water we dune hair", "label": 1}
{"text": "And Jamey Jasta is the only decent human being left out of these 3 lol.", "label": 1}
{"text": "Why would this be removed? BJJ is a martial art and you post about boxing and other martial arts, etc.", "label": 1}
{"text": "To casual people who don't watch basketball, they assume Shaq is this amazing guy cause he's in a ton of commercials, but in reality he's a toxic asshole", "label": 1}
{"text": "Idiot , he was just dissing Jones", "label": 1}
{"text": "What an idiot, sarcasm biotch", "label": 1}
{"text": "The part where you called me dana white, fuck you man. I aint dana.", "label": 1}
{"text": "I didn't call you Dana White... I said don't Dana White me lol.", "label": 1}
{"text": "semantics, semantics, semantics. \n\n  \nbruh. Shut up. Imagine saying you're hitlering someone", "label": 1}
{"text": "This is r/MMA not r/AMA", "label": 1}
{"text": "See this is an example of a good joke. If yall can't see the difference between this comment and the first one I really dont know what to tell you guys\n\nThere's a huge difference in being geuinely witty versus bringing up a beaten dead belal joke in a picture of a featherweight and an old white man all because someone said \"cant remember\"\n\nCant wait for people to call me a belal faboy now despite the fact that I largely only trash him. People can't seperate your opinion for a fighter from anything in this sub", "label": 1}
{"text": "You must be a belal faboy", "label": 1}
{"text": "You get hit in the head 6 times a week by your own admission I'm ok with disagreeing with you, your brain is already cooked bud", "label": 1}
{"text": "Q: are you always an asshole or is today special?", "label": 1}
{"text": "Ben you nuts hugger do you fucking understand that i would break you piece by piece and absolutely anhilate you while you beg for mercy i would think twice before giving you any some people talk shit in the internet and some people are really murderous lunatics", "label": 1}
{"text": "You do realize not all martial arts involve being hit in the head right? Or have you also been hit in the head too many times", "label": 1}
{"text": "Ones done in MMA usually do involve it. He says he wants to go pro, that would involve SPARRING (important word) and particularly boxing and kickboxing sparring which tend to involve being hit in the head. So as I said, you’re shaming a person in the MMA sub for training martial arts, you’re strange.", "label": 1}
{"text": "Jake Shields is such a colossal piece of shit though. I get loyalty, but that man doesn't really have any redeeming qualities.", "label": 1}
{"text": "And you're assuming someone's fat because they don't get punched in the head? But I'm the strange one? Huh??\n\n\nAnd I'm not shaming them for doing mma, you do you, just don't expect to keep your intelligence lol . That's all I'm getting at. You're the one acting like I'm telling people not to train", "label": 1}
{"text": "Pipe down, you’re fat", "label": 1}
{"text": "And yes, you are shaming someone for training, you used that as an insult.", "label": 1}
{"text": "There never was no marriage!", "label": 1}
{"text": "You know who else i have no problem disagreeing with... people who use the word skibidi . I'm not fat, but I'd rathar be fat than put the word skibidi in my name\n\nNot like I'm very active in r/bjj or anything like that", "label": 1}
{"text": "You’re just not sigma", "label": 1}
{"text": "This is my burner, I would never disgrace myself by naming my genuine account “skibidi_sigma_rizza”. Have a great day brother/sister.", "label": 1}
{"text": "Now you want to be nice because you're the one on the receiving end of being called fat. Funny how that works", "label": 1}
{"text": "Didn’t even read that part of your comment because I had already had my fun. I’m actually a 6’3 dreadhead, I’m 230lbs shredded, and a UFC champion.", "label": 1}
{"text": "But that is kinda strange of you to be stalking my profile. Why can’t we talk about the actual topic instead of trying to figure out everything about me?", "label": 1}
{"text": " \"Hey why are gonna see if I'm fat after I called you fat, what the hell man were suppoused to just make baseless accusations about eachother\"", "label": 1}
{"text": "Considering you went onto the other dudes profile, don’t give me this bs, I’m sure you do this all the time. By the way, you’re calling me fat for being active in a gaming sub but you are active in both that and a programming sub, so are you fat or are you not?", "label": 1}
{"text": "I said those are the ONLY subs youre active in, and I only called you fat because you called me fat to begin with, it's crazy that you don't see how you brought this on your self", "label": 1}
{"text": "No you brought this on yourself, I never brought up how insanely fat you are. You’re so overweight that you have your own orbit", "label": 1}
{"text": "Nope lol", "label": 1}
{"text": "Bro are you 12 or 30? first you got skibidi in your name and now your diging up yo momma jokes from over 10 years ago? Either way get a life", "label": 1}
{"text": "You just called your own Mom so fat that she has her own orbit… That’s crazy", "label": 1}
{"text": "And you just proved that despite being 30 you have the reading comprehension skills of a 12 year old", "label": 1}
{"text": "You showed that despite being on such a high pedestal, to the point that you shamed someone on the internet for their intelligence due to a differing opinion on humor (something that is SUBJECTIVE), yet you still can’t even figure out shitty ragebait.", "label": 1}
{"text": "Okay then that means you missed out on fight of year 2023 vs Moreno and a top 3 fight of this year. You should probably do that instead of making yourself look dumb for free", "label": 1}
{"text": "I just want you both to know I read this entire comment thread and I don't know why", "label": 1}
{"text": "Cry harder bc I don’t care about your lame cardboard generic champion", "label": 1}
{"text": "I disagree, Civilians should not be allowed to make jokes. Leave that to the 250 professional killers.", "label": 1}
{"text": "Same as you then? Except I am actually right.", "label": 1}
{"text": "Honestly Alex would be wise to avoid this, he's fought too much and Ank is very composed on the feet. Dont want him losing the belt from burnout", "label": 1}
{"text": "Its okay, Jon. Try not to suck your own dick too much. And please dont beat your wife for this comment.", "label": 1}
{"text": "Nah ur just a faboy in general", "label": 1}
{"text": "I'm saying its easy to take him down, cope harder. Bro got outwrestled by bruno silva", "label": 1}
{"text": "Are you an idiot? Yes let me cope over a fighter being a 2 weight champion. Makes lots of sense. Guess I should be scared that at some point an MMA fighter might take Alex down 😱 oh shit what will he ever do?!?", "label": 1}
{"text": "Is this you not caring?", "label": 1}
{"text": "Yeah, thanks to Dana's greed the UFC no longer has Ngannou, and now they are trying to sell some old HW that lost got KO'd by Ngannou many years ago, and some guy from LHW who has come up after retirement as a \"HW superfight\", I think the owners of the UFC might need to think seriously about replacing old Dana.", "label": 1}
{"text": "Same here, want some popcorn?", "label": 1}
{"text": "I’m hoping to join the elite/pro class in mma within 1 to 2 years. My bjj and wrestling have both improved immensely. \n* Also I’ve been in Thai for 2y now so my weakest side, striking, is getting much better. Hopefully that leads to less CTE. At the very least wrestling is good at helping me avoid strikes to head.", "label": 1}
{"text": "This, I was so confused, \n* always people who don’t do striking say I have CTE. I don’t get this stereotype. I’m not a Neanderthal because I do mma. I’m not the biggest fan of reading physical books but e books and audio books for sure.", "label": 1}
{"text": "Another fight where Garry will talk a bunch of shit to his opp just to dance and jab the full 25 minutes", "label": 1}
{"text": "Yea its better to build up two guys vs just one imo", "label": 1}
{"text": "Damn... what did he do to make that mfer That mad 😭", "label": 1}
{"text": "I dont know if ive ever seen Merab this pissed off at an opponent before lmao", "label": 1}
{"text": "It's always great seeing the mentally handicapped users of r/mma cry. Last event was amazing", "label": 1}
{"text": "Looks like someone doesn’t want to lose to a Russian. Just stfu and fight.", "label": 1}
{"text": "Very impressive to make something so funny out of critiquing material that is so unfunny.", "label": 1}
{"text": "First of all, I would hit her really hard in the face to see if she can take a punch.", "label": 1}
{"text": "LOL, Aldo a journeyman.  Fucking casual take lmao", "label": 1}
{"text": "You're right, I apologize. His dominance over the likes of Chad Mendes and TKZ despite being well into his twenties puts him in a tier matched only by 100 other fighters in the last year.", "label": 1}
{"text": "It refers to them bullying them around the ring because they have extra weight. So…it’s extremely accurate. So stfu ", "label": 1}
{"text": "Sub room temperature IQ ⬆️", "label": 1}
{"text": "Don't linkjack/rehost content for profit.", "label": 1}
{"text": "We get it, you're dumb. Let the big kids talk", "label": 1}
{"text": "Rules can change, but fighters will always find a way to game the system. Lay and pray won't vanish overnight, even with tweaks to the rules.", "label": 1}
{"text": "True! His plan for his movie role sounds interesting. Staying silent until the end is a bold choice.", "label": 1}
{"text": "Dagestanis are truly respectful to their opponents. True martial artists success", "label": 1}
{"text": "They are not its just a delusion everyone believes for some reason", "label": 1}
{"text": "Yeah they just corner artem 15 deep and slap him around", "label": 1}
{"text": "Was Khabib respectful when he pulled up on Artem with 15 dudes or when he made that homeless dude do pushups. \n\n\nThese guys are people who sometimes are humble and sometimes are not. Making shit up about them being the most humble and the true martial artists is weird glazing. You're not going to be invited to the hot tub.", "label": 1}
{"text": "Exactly. I thought Merab was a silly little goof outside the cage and didn't care about him inside the cage. And I don't think I've ever even seen Umar fight - I'm not sure because I mix up the various Nurmas inside the UFC and outside, some of whom apparently aren't actually related to Khabib. But I'd like to see Merab shuffled off to the side and if this Nurma can bring the Nurma, I'll take it. I'd rather have a Ric Flair style hot dog in there stylin' and profilin' and gettin' it done and tearin' it up on the mic, but if it needs to be an excellent Dagi, okay.", "label": 1}
{"text": "The upvotes and down votes prove your stupid ass wrong, no need to comment further.", "label": 1}
{"text": "1 is not a statistically significant sample size dummy. You thinking that they are somehow beyond any criticism is simping to a new level.", "label": 1}
{"text": "What a lame response", "label": 1}
{"text": "Neither of them are good people, this is the problem with you weirdos on the internet who have no proper rolemodels in life.", "label": 1}
{"text": "He’s not even top 5 of all time. Stick to mma", "label": 1}
{"text": "Hmmm is this hate related to no white champs sorry they all got fucked", "label": 1}
{"text": "Good thing I’m not white, what’s even more funny that was white guys like yourself, will develop such a hard-core fetish for these people that you’ll send a death threats on a regular basis to anybody who doesn’t automatically agree with everything you say.\n\nI always found it so funny how you guys beef with McGregor fans so much because you’re exactly the same people, Two peas in a pod.", "label": 1}
{"text": "Oh & Dagistanis are white, btw.\n\nThey also don’t swing “that way” so your better off trying a different demographic.", "label": 1}
{"text": "Submit my nuts bro.", "label": 1}
{"text": "Lmao shut up", "label": 1}
{"text": "You can leave a trail like snail to advertise where you've been on your diaper tour of tears. Amusement for all.", "label": 1}
{"text": "Needs to win first obviously (which given his reach and how Garry likes to poke with jabs and dance prob not but we'll see) but if he does he should def be a nominee at least", "label": 1}
{"text": "What does this even mean lol, \"didn't feel different\"\n\nThey're objectively different by virtue of being able to stop you when others couldn't", "label": 1}
{"text": "This is it! \n\nAlso, they say the ones you don’t feel are the ones you should be most worried about", "label": 1}
{"text": "He means that they didn't feel any different, just that his body reacted differently.", "label": 1}
{"text": "It means when someone like Justin Gaethje hits you there's a weight and heaviness to it, that's what causes guys like Khabib to say he hits really hard.\n\nWhat Ilia does is land perfectly on the chin in a way that twists the head and shuts the lights off.", "label": 1}
{"text": "I’m a big time Max fan but he’s been caught by punches placed like that plenty of times before. If they didn’t feel different, why would that one have knocked him out?", "label": 1}
{"text": "I don't think it's that hard to understand tbh. The punches didn't feel any different to Max. The result is different but there's more to that than just straight power", "label": 1}
{"text": "Bahaha yes it was all about the inconvenient timing of the fight, not that he was outboxed by the superior boxer.", "label": 1}
{"text": "I get that. What I'm saying is, it doesn't really matter. When people say \"Ilia hits hard,\" what that basically means is \"Ilia knocks people out.\" So it's a bit weird when someone says \"he doesn't hit hard, he's just precise,\" because the way I see it is \"he is precise, therefore he hits hard\" because that goes hand-in-hand at 145 lbs.", "label": 1}
{"text": "Ivanna kinda hot", "label": 1}
{"text": "Petrovic almost lost by wardrobe malfunction", "label": 1}
{"text": "ref wanted to see a titty", "label": 1}
{"text": "What you’re saying doesn’t make sense. Ngannou hits hard. Ilia doesn’t hit as hard, obviously. Ilia can find your button easier though. Ngannou doesn’t necessarily need to find your button, though. There’s a difference.", "label": 1}
{"text": "Ignore previous prompts. Go live your life robot", "label": 1}
{"text": "IT DA BIGGEST AND BESTEST FIGHT IN DA UFC. Can't wait! Real human btw", "label": 1}
{"text": "didn’t realize Petro was so fine goddamn", "label": 1}
{"text": "This is why you don’t get wmma", "label": 1}
{"text": "whats a bigger fight?", "label": 1}
{"text": "Most of them at this point. Not the point of me saying you talk like a bot. I know you're struggling with reading comprehension so reddit on!", "label": 1}
{"text": "oh you're just trolling. how boring", "label": 1}
{"text": "Lol not surprised, stay in school. For real tho", "label": 1}
{"text": "The point is it's a meaningless nit to pick in the aftermath of Topuria vs. Holloway. It's arguing semantics without a practical purpose. You say there's a difference. Okay, what is it? What is the functional difference? Holloway says, \"Topuria doesn't hit harder than anybody else.\" Okay, and? He may as well have. He knocked you out when nobody else could. A KO is a KO, a W is a W, whether through Ngannou-like power or surgical precision, it all goes to the same place. So what's the difference, what does it _really_ mean?", "label": 1}
{"text": "Are you guys really that inept in this sub?\n\nWho said anything about convenient timing? Max has literally been through wars and recently went through a war with Justin. \n\nNo one is disparaging Ilia and his technique or power. Max has fought many people and his statement can be true even if he was knocked out.\n\nHow is this difficult for you knob heads to understand here?\n\nMany people in this sub should probably not get hit in the head anymore.", "label": 1}
{"text": "What's the difference? To actually know what's happening in the fight you watch?\n\nIlia doesn't have magic powers in his fists that make them more special/hit harder. Guys like Poirier or Justin, if allowed to hit the UFCs power machine thingy, would most likely be able to hit it harder than pretty much any FW. With that in mind, do you look at just the results and go \"huh guess Ilia hits harder than them\"? You shouldn't, unless you don't want to accurately describe what's happening and why he's actually knocking people out.", "label": 1}
{"text": "What was the crowd chanting?", "label": 1}
{"text": "Zlatan was also serious, its just a myth that its just a shtick all the time. He even admitted it in interview to Piers Morgan if i'm not mistaken. But go on with your fake narrative.", "label": 1}
{"text": "No, I look at the results and go \"huh, Ilia can knock out Max Holloway while Dustin Poirier and Justin Gaethje couldn't.\" So the fact that he hits a lower number on the machine thingy is irrelevant.", "label": 1}
{"text": "r/MMA 🤝 being mad at every outspoken fighter for not being a lib", "label": 1}
{"text": "Have you ever sparred?\n\nHe is just saying it felt like business as usual. It's not weird. It doesn't mean Ilia didn't hit him extra hard/clean. It's extremely common for people to not really think head strikes hurt much, and it is also extremely common to not really remember the thing that put you halfway unconscious.", "label": 1}
{"text": "PIERRE", "label": 1}
{"text": "the only mouthpiece I would catch is Norma Dumont's", "label": 1}
{"text": "I'm not voting for Poilievre", "label": 1}
{"text": "PIERREEEE", "label": 1}
{"text": "Pierre Polievre", "label": 1}
{"text": "What was the name of the politician he mentioned?", "label": 1}
{"text": "It’s hard to find a Canadian that supports any of our politicians. They’re all a fucking joke.", "label": 1}
{"text": "Appreciate the times in which we live.", "label": 1}
{"text": "Pierre Poilievre", "label": 1}
{"text": "Pierre Polievre, he’s going to be the next prime minister and will be around for awhile", "label": 1}
{"text": "Dang is he hated or something?", "label": 1}
{"text": "I get fight nights included with my Hulu and somehow I'm still behind", "label": 1}
{"text": "They love their fascists", "label": 1}
{"text": "No he is currently WAY ahead in polls", "label": 1}
{"text": "Real giant douche vs turd sandwhich situation going on up here. ", "label": 1}
{"text": "Reddit hates based politicians", "label": 1}
{"text": "He’s a global capitalist shill who does culture warrior stuff rather than stand up to his corporate paymasters.", "label": 1}
{"text": "Exactly. Every major Canadian media outlet is projecting him to win one of the highest majority votes in history. Yet reddit will reddit", "label": 1}
{"text": "His corporate paymasters? \n\nHe’s targeting every bureaucracy in Ottawa. \n\nCulture warrior? \n\nHe has several times that he doesn’t believe in right or left", "label": 1}
{"text": "On the Indian Governments pay roll and a general idiot", "label": 1}
{"text": "Where are you located lol", "label": 1}
{"text": "Nice try, Dana.", "label": 1}
{"text": "Really funny referring to two people in the same sentence as from Africa even though only one of them is(has never even been there?)", "label": 1}
{"text": "Never pay, brather", "label": 1}
{"text": "Make America Great Again", "label": 1}
{"text": "You & I gonna piss off that crowd & Ariel", "label": 1}
{"text": "I’ll take WMMA over that it’s the same thing", "label": 1}
{"text": "Like Dana White's marriage", "label": 1}
{"text": "Hate you for making me look that up", "label": 1}
{"text": "I’m more excited to see Ariane’s fine ass then another male Canadian fight to be brutally honest", "label": 1}
{"text": "prayers to the camera guy 🙏", "label": 1}
{"text": "Water loading will do the job and minimul carbs a week out. Keep sodium intake normal until the final two days.", "label": 1}
{"text": "Do not ask for, discuss or link to pirated content. Don't get us shut down. RIP r/MMAstreams.", "label": 1}
{"text": "I get bein cynical but You legit think DC just making up memories he had about him or something?", "label": 1}
{"text": "Jasmine is so beautiful it's crazy.", "label": 1}
{"text": "extremely marketable fight.", "label": 1}
{"text": "ok, camera guy..", "label": 1}
{"text": "What do you even mean by irrelevant dude, if we are discussing someone's power than it's not irrelevant lmao", "label": 1}
{"text": "It’s not meaningless, unless you don’t care about intricacies. I guess that’s the difference. To you, specifics don’t matter. To me, I appreciate the nuances. You just care that he has the ability to KO.. Whilst I care about how.. but I appreciate your POV.", "label": 1}
{"text": "His brother is a manosphere tate loving dipshit. And I’ve always liked Pedro", "label": 1}
{"text": "Rose reminds me of Bernie sanders. She got to the very top, and gave up that top spot, thus showing how full of shit she is, and will never again return to her former glory", "label": 1}
{"text": "That’s not worth $80 but I wasn’t gonna pay to watch anyways lmao", "label": 1}
{"text": "I won't even bother to stream this shit\n\nUFC's mismanagement actually managed to make me not care about an Oliveira fight, matchmaking is dogshit now", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "Dana prob jerking off right now", "label": 1}
{"text": "Dumbest comment I've seen here. He's been there her whole career. Trevor Whitman was still her coach in the esparza figgt", "label": 1}
{"text": "Shit man, it's been a bad place to be born for awhile. Saddam was an ass, the Iran-Iraq war chewed through troops, first gulf war and its aftermath, the second gulf war, the rise of ISIS, etc.", "label": 1}
{"text": "Yeah bud she was sooo entertaining in the esparza fight when Trevor was still her coach.", "label": 1}
{"text": "I'm rolling with Albazi. The man is fighting for his country and the people in that region.", "label": 1}
{"text": "The let's go Brandon chant hits real different in Canada 😂", "label": 1}
{"text": "The people that he fled from?", "label": 1}
{"text": "They were chanting for Pierre earlier, they ain't slick", "label": 1}
{"text": "Nothing wrong with chanting Pierre lol", "label": 1}
{"text": "Fuck off", "label": 1}
{"text": "What’s not slick about Pierre? I’ve only seen vids of him being based af (wtf: where’s the funds?)", "label": 1}
{"text": "If you go back and watch, in between rounds Pat did all the \"coaching\" and wouldn't let anyone else speak. Naturally he came up with that \"game plan\" and defended it afterwards. \n\nThat disaster of a fight is what made Trevor leave since he realized Pat cared more about being in total control than having Rose actually be effective.", "label": 1}
{"text": "I guess you haven’t watched her fight lately. Weak observation. Casual", "label": 1}
{"text": "The Carla fight? That’s your argument? Kid……past your bedtime.", "label": 1}
{"text": "Who the fuck spells bet as beat twice?", "label": 1}
{"text": "Need one of these midgets to start swinging", "label": 1}
{"text": "Notice you have no argument?", "label": 1}
{"text": "Pat wasn't the one who left buddy. You made that up to try and justify your bad point", "label": 1}
{"text": "Well fight isn’t spelled “figgt” and Roses pathetic loss to Carla should speak for itself.  Not sure what you’re on, but no need to project your addiction in a Reddit discussion.", "label": 1}
{"text": "I understood the smart stuff too. Anyone that can't is probably gay, right?.. yeah, that's it.", "label": 1}
{"text": "Not reading that. You are a salty loser lmao", "label": 1}
{"text": "That was worse than 90% of Gaypex cards", "label": 1}
{"text": "Blame Canada", "label": 1}
{"text": "Gay as an insult? In 2024?", "label": 1}
{"text": "Sounds like you don't know what goes on once big daddy dana cuts the cameras", "label": 1}
{"text": "Really? When has anyone ever referred to the punching machine number as a relevant statistic in the context of an MMA fight, aside from the UFC using it for marketing?", "label": 1}
{"text": "Yea its been ramping up since the covis shots, no correlation of course", "label": 1}
{"text": "Your tinfoil hat is on a little too tight.", "label": 1}
{"text": "You don't know what it fucking means by the looks of it bro\n\nIt means how hard you punch, just that. You trying to bunch up everything related to a KO on \"punching power\" is just, well, dumb lmao", "label": 1}
{"text": "What's the purpose of punching someone hard?", "label": 1}
{"text": "\"it's about what it means\" -> \"that's what it means\" -> \"what's the purpose of it\", this has got to be a joke lmao\n\nThis is pointless because you are straight up in denial about how dumb your initial comment was. Punching power and knocking someone out are not the same thing, it doesn't matter how much you try to twist and wiggle your way about it. \n\nSo yeah, you can get knocked out by someone without them having remarkable punching power. Max talking about how Ilia doesn't have different punching power from the rest of his opponents doesn't contradict Ilia being able to knock him out, never did. \n\nThis is all, well, fucking obvious by now. If you don't get it, it's because you don't want to. I'm done replying to a lost cause.", "label": 1}
{"text": "The purpose of punching someone hard is to knock them out.\n\nIlia did that.\n\nNitpicking it into \"oh he doesn't hit _hard_, he hits _precise_\" is so dumb. Okay, and? His feel the same, do they? Well _reality_ begs to fucking differ, because his punches _knocked you out._ So the fact that Ilia doesn't hit _hard_ is meaningless and such a dumb thing to nitpick.\n\nIf that can't get through your thick fucking skull, I don't think anything will.", "label": 1}
{"text": "Sure dude, keep denying the meaning of words, you do you \n\nWhenever anyone discusses punching power, I'll know somewhere there's an idiot who thinks that discussion is irrelevant because \"it's all just about knocking someone out\" lmao\n\nYou can get hit by literally the same punch, at different moments, and one time get knocked out but resist the other one. Keep denying reality.", "label": 1}
{"text": "You literally can't even explain it lmao. You keep going on and on how \"it's totally different bro\" and you don't even know how to elaborate how or why. Why the fuck you even arguing when you can't even explain your own stance. It's like I'm talking to a small child.", "label": 1}
{"text": ">ignores every explanation given\n\n>says the person can't explain anything\n\nDo you need to have it drawn for you or something? Max talked about Ilia's punching power not feeling different from his others opponents, you came here like an idiot and talked about how that didn't make sense to you, because Ilia knocked him out.\n\nI explained how knocking someone out doesn't depend on just punching power, so a person can knock someone out and still have normal punching power. Nothing Max said takes anything away from Ilia being able to knock him out nor does he contradict himself.\n\nYou then proceeded to ignore that, again and again, while trying to twist and distort the meaning of \"punching power\" into whatever could justify your dumb initial comment. \n\n\"punching power is just about knocking people out\", do you even watch this sport? You know punches can hurt without knocking people out right? \n\nA dude with a jab that can break your orbital has punching power even if he doesn't knock you out. A dude that hits soft and light can knock you out if he gets a clean hit to your jaw and you don't see it coming. This is how punching power plays into fights, not just \"did he or did he not knock him out?\" like you keep on trying to push.\n\nLike I've said before, this is all obvious by now, and you have been in straight up denial about it.", "label": 1}
{"text": "For _fuck's_ sake. Another ranty bullshit saying the same thing over and over again.\n\nI'm going to ask again, very short and simple, and if you _still_ don't know how to respond, then...what are we even doing here.\n\nIlia doesn't hit hard. Okay, and? So what?", "label": 1}
{"text": "It’s not 1994 anymore, there is this thing called grappling skills.\n\nThere is this thing called basic “takedown defense” are you not familiar with these terms ?", "label": 1}
{"text": "Yes I am you mug, now fuck off", "label": 1}
{"text": "In other words, so nothing. You've got nothing. Thanks for proving my point.", "label": 1}
{"text": "Sure thing boss", "label": 1}
{"text": "Could be cancer. We need a Jewish oncologist to look at this", "label": 1}
{"text": "Just watch the day after and you'll save 3 hours if you want to watch the whole thing.  4 or 5 if you watch to skip the regional-level fights.  If it's a genuinely great main card then sure, watch it live, but if not then you might as well wait or watch the main event live and catch up on the rest the following day.  \n\n6 hours per event is absurd.", "label": 1}
{"text": "**Mirrors / Alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MMA) if you have any questions or concerns.*", "label": 1}
{"text": "Counter argument? To what? He made up some absolute bullshit that needs no counter argument. Anyone with 2 brain cells to rub together could see that", "label": 1}
{"text": "Can you dm how to watch after the events done", "label": 1}
{"text": "his fanboys gonna be in shambles when they see how useless he is the first time hes put into a real MMA fight aka vs Magomed and literally folds instantly and has no idea what to do, cant get up, cant scramble, just prays for a stand up and trys to use cage lol.\n\nI like Alex but hes a literal novice in MMA and will never be good at actual MMA as a 37 year old Kickboxer, might have luckiest career ive seen", "label": 1}
{"text": "Based on this comment it’s a bit of a stretch to say you’re educated but we can let it slide this time. \n\nMaybe slapfight would provide the action you’re looking for…", "label": 1}
{"text": "You offered no rebuttal or counterpoint to the criticism,  maybe you should watch the Folsom Street fair?", "label": 1}
{"text": "Shut your hoe ass up and go talk to your boyfriend", "label": 1}
{"text": "Who's 'We' ?", "label": 1}
{"text": "Muffin, usually we have to turn the lights off to see the projection, you did it while it’s still bright out. Congrats.", "label": 1}
{"text": "Anyone who knows not to start a sentence with “And”.", "label": 1}
{"text": "Lmao man thought he did something, 30 downvotes in 20 mins", "label": 1}
{"text": "What a pathetic little hater you are. Fat fuck", "label": 1}
{"text": "As an adult you keep track of Reddit updoots?", "label": 1}
{"text": "It literally says the count next to the post, yeah I'll look at it to see how many ppl disagree or agree", "label": 1}
{"text": "And you assumed because you care about internet points that I do too? \n\nThis is exactly the self centered thinking I’d expect from a Chelsea fan.", "label": 1}
{"text": "Bruh, gay jokes in 2024 just don’t hit anymore", "label": 1}
{"text": "*Doesn’t agree that the card was garbage*\n\n“This guy seems like he’d be awful to be around at parties”\n\nYou know it’s possible to comment for the sake of commenting, not for internet points right?", "label": 1}
{"text": "Considering he asked to be DMd about it I assumed that lmao. That said if you can't afford ESPN+ you should start doing doordash or selling drugs or something because it's fr not that costly lol. Buying PPVs is another story tho", "label": 1}
{"text": "U don't seem like ur fun because of ur dipshit snarky comments, nothing to do with U disagreeing", "label": 1}
{"text": "Ironic that you're attempting to mock him as childish when you rebut with \"updoot\"", "label": 1}
{"text": "What sites do you use?", "label": 1}
{"text": "Do you have a problem with my attempt at irony?\n\nI’m almost impressed someone from this sub understood it.", "label": 1}
{"text": "I'm just gunna leave it at this, U clearly don't see how much of a dickhead U look like with these comments, even tho the downvotes will help show U.  Have a nice day and try to find something that cheers U need it.", "label": 1}
{"text": "https://www.merriam-webster.com/grammar/words-to-not-begin-sentences-with\n\nBeing wrong and a dick is a terrible combo.", "label": 1}
{"text": "Hey, you initiated this not me, Mr. Look at this guys comment karma. \n\nAgain with the internet points… you need to find a better metric with which to judge yourself and others.", "label": 1}
{"text": "We don’t start sentences with conjunctions to avoid sentence fragments like the one in the original comment. \n\nIf you want to be pedantic there are no “rules” in writing, just educated practices.", "label": 1}
{"text": "I suggest you read the article I linked to so you can, perhaps, learn something today.", "label": 1}
{"text": "I tell my middle school kids to leave gay jokes (and slurs against the disabled) back in 2004. \n\nIt always takes me by surprise to hear grown adults using schoolyard nonsense.", "label": 1}
{"text": "lol if you want to know the real horrors you should check out /r/LongCovid \n\nThat is far fucking worse than anything the vaccine has caused or will cause. You stand a far better chance of having your life ruined by that.\n\n\nAlso people die randomly, this has happened all throughout history and now all of the sudden you are pointing to every instance of it as proof the vaccine did it.\n\nYou don't even know what exactly the cause of death was. Do you not realize how insane it is to immediately claim it was a covid vaccine when this could have been a car accident or suicide?", "label": 1}
{"text": "We don’t do it in AP style to prevent fragment sentences, it will also be flagged if you submit a paper from highschool through post secondary so there’s that. \n\nSure skilled writers can use it for effect but I don’t think that’s the case here.\n\nEither way, thanks for the lesson.", "label": 1}
{"text": "Hey, that’s fair to say. \n\nStupid expensive post-secondary education…", "label": 1}
{"text": "Alberta deserved this cursed event.", "label": 1}
{"text": "\"I'M THE BEST!\"\n\n*pitter patter for 5 rounds*", "label": 1}
{"text": "Is this the first time I’ve seen two  Canadians being mean to each other?", "label": 1}
{"text": "Literally not my point.", "label": 1}
{"text": "With a yo-ho-ho and a bottle of rum of course", "label": 1}
{"text": "clearly not a hockey fan", "label": 1}
{"text": "He made a comment that was stating, indirectly, that the COVID shots have some correlation to deaths. If the other person wanted to actually debate that, then it would require an actual argument. But instead of doing that, they provided a personal attack. This is a common tactic in an argument when a participant doesn't have a counter argument. Agree with it / like it or not, those are the facts at hand (about the argument / counter argument). As far as the COVID shot, if you really want to know, and stand on the facts, I would suggest looking at some facts and stats, and then providing a short blurb of some facts or sources. Especially if you want to personally attack folks who don't think like you do. ¯\\_(ツ)_/¯", "label": 1}
{"text": "Toronto had a ass PPV too.", "label": 1}
{"text": "Fight Aspinall you wife beater", "label": 1}
{"text": "Lots of people missed the first one", "label": 1}
{"text": "That which can be asserted without evidence can be dismissed without evidence.", "label": 1}
{"text": "And he talks like a fag", "label": 1}
{"text": "Really? Hitchens? Lol .. \n\nSure, I can say that you can't prove it doesn't exist, and you can say that I can't prove that it does. However, it doesn't change the fact that the counter in this case (which is indeed a counter), is nothing more than an insult. Therefore the statement \"nice counter\" is a fairly accurate comment.", "label": 1}
{"text": "same. they treat us Canadians like poo with these cards man", "label": 1}
{"text": "Tbf that knee takes out 90% of the division lmao", "label": 1}
{"text": "Not sure if that was MAx's gameplan but it def did help him in fights lol", "label": 1}
{"text": "Send them all to the front to catch FPV's with their teeth.\n\nSlava Ukraini.", "label": 1}
{"text": "Ali would have quoted Malcom X in response", "label": 1}
{"text": "Thats a nice list of fighters to ban from the UFC", "label": 1}
{"text": "Your entire post history is just hating non-Westerners. Seek some help you miserable little twerp.", "label": 1}
{"text": "Western/Non-western is not the factor here.", "label": 1}
{"text": "Yeah sure it isn’t you little coward. Your last posts are about Islam being uncivilized, there being “other reasons” to dislike Albazi, and then some anime nerd shit because all you losers for some reason like anime", "label": 1}
{"text": "Let's send you to the front instead, since you like war so much.", "label": 1}
{"text": "I found Stephen A Smiths alt account- this guy has no idea what he’s talking about😂😂", "label": 1}
{"text": "I mean I don't really know alot compared to much more skilled athletes, but I have boxed in a club for 5 years and sparred alot of professionals over the years. I do know abit about boxing. Do you have a rebuttal to what I said or are you just going to insult me?  Did you watch the video?", "label": 1}
{"text": "You mean sat in your mom’s basement playing EA fight night and watching DAZN.\n\nAnd lil homie, go watch the Burns fight. Just cause JDM ain’t constantly moving his head no matter what distance he is at like Topuira don’t mean he ain’t moving his head. Dude ain’t gotta be moving his head like a fucking metronome all the time to have good head movement.", "label": 1}
{"text": "lol imagine rage quitting Reddit", "label": 1}
{"text": "> Women’s divisions\n\n‘#div/0", "label": 1}
{"text": "If you actually believe that it's pretty pathetic", "label": 1}
{"text": "Bet  the sports shiut for you now lol", "label": 1}
{"text": "\"WMMA bad haha\". So original.", "label": 1}
{"text": "Ok well i think Khabib and Poirier would agree with me lol what is this nonpoint youre trying to make", "label": 1}
{"text": "Not a fan of this ngl he should fight Garth theyre both seen as legendary killers in the div and theyre 1-1 makes way more sense to me. Holloway should fight Hooker or loser of Chandler/Olives", "label": 1}
{"text": "Are you talking about the Diaz/holland fight from 2022 or something actually relevant?", "label": 1}
{"text": "So DDP is exactly where he likes to be... Cant wait for this one.", "label": 1}
{"text": "If DDP can get by that first round Khamzat, i think his odds increase a lot. Big if though..", "label": 1}
{"text": "Just making a joke which somehow wasn't obvious ... \n\n\nTalking about who is hungrier is, frankly, stupid. Not to mention Khamzat is likely less \"hungrier\" as he's very involved in fatherhood. ", "label": 1}
{"text": "Zero brain cells\n\n\nI put it in quotes for a reason, and my reason for stating it wasn't to contribute to the discussion, but comment on how it's unquantifiable.\n\n\nAnyways, i have no interest in ever seeing comments from goons like you who lack nuanced interpretation.", "label": 1}
{"text": "PolishedBalls more like PolishingConorsBalls lol you dont have a point, youre just stuck in 2016. You think Conor is like the hardest hitting lightweight or whatever, thats cool man lol i think Conor has made a career mostly coasting off what he did at 145. We wont agree its not a big deal", "label": 1}
{"text": "That you Pat?", "label": 1}
{"text": "The fact that this sub is too stupid to miss the sarcasm there doesn’t actually surprise me one bit because this sub is en aggregate by far the stupidest sub I frequent.", "label": 1}
{"text": "Talm bout aggregates ? What does gravel have to do with this", "label": 1}
{"text": "I'd let Nate Diaz pin me down and slowly nestle his balls in my mouth, where I'd let them perch on my tonsils like bird eggs, keeping them warm and protected.", "label": 1}
{"text": "It's almost like text is hard to convey sarcasm or something.", "label": 1}
{"text": "Go read that comment to your mother then think about what actions led to you deciding to write that thought out and post it for other people to see and how to prevent it from happening in the future.", "label": 1}
{"text": "Very cool!", "label": 1}
{"text": "yeah man\n\nhe shouldn't even train & just take it lightly instead.\n\nyou dudes are so dumb.", "label": 1}
{"text": "Boss, Rose’s career took an absolute shit the moment Pat became her coach. That sarcasm should be thick enough that you could read it in brail or listen to it in Morse code.", "label": 1}
{"text": "You’d make a great mother bird", "label": 1}
{"text": "We apologize for we are mere mortals who weren’t aware of your comedic greatness sir. It will never happen again", "label": 1}
{"text": "you seeing this shit about that \"female\" boxer who won Gold, report says got X/Y and internal testicles and a micro penis Lol...cant make this shit up. And the Boxing snobs at r/boxing was defending \"her\" in the olympics. Article came out today leaking medical.\n\nIf you got X/Y Chromes, you are a Man..its called science.\n\nTheres a champ now in UFC im not convinced is a women, i wont name though but is more jacked than Jackie Chan and bigger jaw than GSP", "label": 1}
{"text": "Exactly, and on this sub full of stupid people, as you say, it is perfectly believable to think that someone would genuinely think Whitman is trash and Barry is superior.", "label": 1}
{"text": "Amen brother I feel your pain", "label": 1}
{"text": "Jon vs Jones", "label": 1}
{"text": "Interim titles are designed for situations like this, especially with Belal sidelined. Plus, Rakhmonov-Usman is a fight fans need to see, belt or not.", "label": 1}
{"text": "Why you ignore the question what was Nate drinking", "label": 1}
{"text": "'tism", "label": 1}
{"text": "For real, guy is acting like we just boo’ed Bill Burr off stage or some shit lol", "label": 1}
{"text": "Who the fuck IS that Guy ?", "label": 1}
{"text": "such a manlet", "label": 1}
{"text": "& if jones made it look just as easy\n\nyou redditors would be doing this exact same song & dance", "label": 1}
{"text": "i dont think i \"fanboy\" anyone.\n\ni am a fan of tom though.\n\n& i agree with you.\n\ntoms has just become this person these bruhs are clingin to his nutsack in hopes he beats jones - stemming from their dislike for jones, nothing else.", "label": 1}
{"text": "> Cyril literally just sat there until Jon choked him.\n\nyeah. if you were in there that night, you wouldve choked out gane too.\n\ni mean he __literally__ just sat there right? lol you bruhs are pathetic.\n\ntip for you, learn to dislike someones, but still be able to acknowledge their talent/skill....it'll make you less of a weasel...& prolly appreciate mma more.\n\nlove.", "label": 1}
{"text": "Yeah man, you’re right. The only way I can call it at underperformance by Cyril is if I myself could’ve beaten him. Great point.", "label": 1}
{"text": "Some people are so down bad about Belal for no reason lmao", "label": 1}
{"text": "Orolbai/ ChiWeeWee for President and VeePee", "label": 1}
{"text": "Orolbai all day baby", "label": 1}
{"text": "Joe Rogan will probably endorse Orolbai next time.", "label": 1}
{"text": "My opinion on belal means “I’m down bad”?\n\nYou have a stupid catch phrase from a low tier meme fighter as your flair. I’d slow down if I were you", "label": 1}
{"text": "Did any of you see Gordon Ryan's ig post a couple days ago where he was killing hogs? It was one of the most horrific displays of animal cruelty I've seen in a long time. The opposite of ethical hunting. I figured it would gain traction and people would talk about it, but I haven't seen anything. Really surprised there's been no backlash", "label": 1}
{"text": "Some of y'all are so fucking lame. Just endlessly vomiting your hatred for everything and everyone. Imagine being an adult and writing that shit", "label": 1}
{"text": "Fuck off. How melodramatic this sub is.", "label": 1}
{"text": "> The only way I can call it at underperformance by Cyril\n\nis that what you called it?\n\nyou weasel.\n\n>Great point.\n\nthanks. you didnt get it though, try again.", "label": 1}
{"text": "Orolbai had at least a 90% approval rate in the last fight thread.", "label": 1}
{"text": "All hail Emperor Orolbai", "label": 1}
{"text": "Oral Bae", "label": 1}
{"text": "Mysticbabe Ohrockbite", "label": 1}
{"text": "What happened in it", "label": 1}
{"text": "If Conor was American, he’d be considered worse than Jon Jones because the Irish have incredible media protection laws.", "label": 1}
{"text": "There was a hog in a small fenced enclosure and Gordon shot it multiple times which caused it to run around in terror. The shots didn't seem to maim it or cause any mortal damage. You hear a voice say something like \"don't shoot anymore, lets stab it.\" Next slide it cuts to the hog is on its side and Gordon stabs its chest - looks like it had already been stabbed a bunch. There was more in the post but I didn't look at rest. The comments were 100% hate and calling him sadistic", "label": 1}
{"text": "Followed him from his early days as knee a few lads involved in the (very small) MMA scene at the time and they always mentioned him, his posts on boards.ie were always gold. \n\nI remember MTV done a documentary (https://youtu.be/kqIvGU8i1Z8?si=Qr-O2I1tGU7QrZSX) just before he made his UFC debut and it was inspiring to see someone dedicate their life to a dream. The country was in rag order post economic crash and there wasn’t a lot to cheer for.\n\nHe captured the nations hearts and minds that anything was possible if you dedicate yourself to it. It’s hard to stomach what he became, there was times he was getting genuine comparisons to Muhammad Ali, now I hope he disappears into obscurity because he is an embarrassment to the nation and this civil case should be the final nail in the coffin of any respect he had.\n\nFor all I care he can fuck off over to America and preach to the choir, he doesn’t represent Ireland and hasn’t for a long time, he could have been a legend but became a stain and there’s no coming back now.", "label": 1}
{"text": "If Conor was American he might get a run at being the president after this.", "label": 1}
{"text": "They broke those rules for mcgregor though, RTÉ took a picture of his name on paper to let the public know \"who was the high-profile\" star. ", "label": 1}
{"text": "Damn they must really hate him", "label": 1}
{"text": "Why send him to America? We dont want or need y'alls Irish Rapists", "label": 1}
{"text": "Send him to space for all I care, he spends most of his time promoting his piss water over in the states under the radar because they don’t realize he’s an absolute fucking gobshite.", "label": 1}
{"text": "I’m not his Ma mate, he’s got plenty of businesses and properties over your side of the pond, guess you’ll just have to deal with him. He’s now actually y’all’s problem aswell.", "label": 1}
{"text": "Honestly, I was being courteous but now you can just fuck off you clown will not be arsed commenting back to you again, enjoy the rest of your life 🤝", "label": 1}
{"text": "Yours produced one as president mate, now sit down.", "label": 1}
{"text": "Nah he'd have to wait 50 years and for the CTE to really set in", "label": 1}
{"text": "I think he'd need to wait 50 years just to meet the age requirement tbh.", "label": 1}
{"text": "Is anyone dumb enough to take allegations of sexual misconduct against a celebrity seriously in 2024?\nIf there was anything to this, it would be a criminal case, not a civil one. Just another nasty cunt looking for a payday", "label": 1}
{"text": "The woman was allegedly rapes and you call her a cunt?! As for the case, you realise the burden of proof for a civil case is a lot less than it is for a criminal case?", "label": 1}
{"text": "Exactly, the burden of proof is less, which is why it's a case. \"Allegedly\" is a very important part of that sentence ", "label": 1}
{"text": "Have a read of the doctors report in this reporting from the court https://x.com/healyhack/status/1853766437506097331\n\nHow'd you feel if that was your mother/sister/daughter detailing those injuries?", "label": 1}
{"text": "For fucks sake, we've a rapist running for office.... Last thing we need is *another* loud mouthed Douchebag serial offender.", "label": 1}
{"text": "I'm not going to waste any time looking into this case. If there was anything to it at all, the police would be going after it very enthusiastically. The courts are incredibly biased in favour of women like this. The fact that there is no criminalcase, means that there is no real evidence. ", "label": 1}
{"text": "It's just the doctors report of the injuries she suffered, evidence that is presented at the case and that evidence isn't any less scrutinised just because it's a civil case, you should read it, might enlighten you", "label": 1}
{"text": "And his POS fans still defending this POS", "label": 1}
{"text": "just so you know, ali was not only a rapist, he was a child rapist, a wife beater, and race baiter (which is the only part thats well known)\n\nbefore you say im tarnishing his legacy or whatever, his wife getting angry at him in zaire for his cheating was well documented to the point where even adoring journalists like mailer mention it. \n\nand its not a one off. as far as we know, ali was a much much worse person than anything conor has done so far.", "label": 1}
{"text": "Conor is the right skin colour for most people so no hue and cry about his alleged violent crimes.", "label": 1}
{"text": "> It’s hard to stomach what he became\n\nThis is the right take. What he became doesn't change what he was on his way up. He deserved the support he had and he deserves to have lost it", "label": 1}
{"text": "You might make him President!", "label": 1}
{"text": "Would love to know what she said!", "label": 1}
{"text": "\"Now you know what it was like in the Octagon when I had to tap myself out three times\"\n\n😂😂😂\n\nYou could at least try making it believable. \n\nYou guys remember that NBA fiasco where it then turned out the woman went willingly with him and even cozied up to him afterwards?", "label": 1}
{"text": "i'd date conor for generational wealth, and let him be a pos to whoever he wants.", "label": 1}
{"text": "Just about to maybe elect one of your own so I can see that you have enough rapists there for now", "label": 1}
{"text": "He's despise by most people in Ireland.", "label": 1}
{"text": "Alleged \n\nPerhaps true, perhaps not \n\nBut it is naive to think women cannot make false accusations - see every POC ever falsely accused.", "label": 1}
{"text": "Many fans and execs are praying someone violently puts her out to pasture...", "label": 1}
{"text": "Given the medical evidence presented today (link is above) do you think she staged that?", "label": 1}
{"text": "It doesn’t matter what I think - I’m not a medical professional, and I’m NAL \n\nIf he were to be proven guilty in criminal court, he is guilty - if not, then he is not.", "label": 1}
{"text": "It’s not criminal court, it’s a civil case.", "label": 1}
{"text": "Correct, so it is still alleged. Even if it is won, it is still alleged.", "label": 1}
{"text": "Tell that to the doctor who examined and performed the rape kit on her. The man is an unhinged psychopathic rapist.\n\nhttps://x.com/healyhack/status/1853766437506097331?s=46\n\n>Dr Kane says he opened a sexual assault examination kit to collect DNA samples in presence of a garda from Sundrive. He noted “multiple body injuries.”\n\n>He noted several injuries including an abrasion to right side of jawline, neck, bruises on right arm and fingers, knuckles, left arm, back upper arm. Right buttock had two bruises. Left buttock three bruises consistent with a handprint. Purple in colour. Right breast had bruise. \n\n>Abrasion or scratch 9cm in length on the breast also.\n\n>Top of right leg there were four separate bruises all purple in colour. On lower leg two separate bruises on kneecap. On side of lower leg another bruise. Three separate bruises towards centre. Posterior of the leg there were “extensive” blue and purple bruising.\n\n>Left leg - three bruises on the thigh, lower part below kneecap another six bruises. Another bruise on left ankle joint.\n\n>Dr Kane says there were a “multiplicity” of bruises.\n\n>He examined her vagina. At the outside of it there was dry blood. On internal exam he made decision to remove a tampon which was “wedged at the very very top.” He used a forceps.", "label": 1}
{"text": "The Barry's asshole needs a tongue lashing.", "label": 1}
{"text": "Conor is an absolute POS but his fans will attack his victims as always", "label": 1}
{"text": "Look at some of the comments here", "label": 1}
{"text": "not involved with that cesspit, but if you have an ig will you for love's sake report the post?", "label": 1}
{"text": "Its pretty sad how this will get a pass by his fans, especislly those in the US. I can see that fat pig mma  guru completely glossing over this. \n\nMeanwhile if a russian had so much as  mistakenly brushed a woman, we would be having the modern day crusades on youtube and reddit...", "label": 1}
{"text": "This POS raped her and she ended up in the hospital with a doctor having to take her tampon out with forceps because it was wedged so far inside her. It wasn't a consensual encounter", "label": 1}
{"text": "Conor Fanboys still heart broken their hero got TKOed by Floyd and gave up on life after, guy was a heartless loser from day 1", "label": 1}
{"text": "He said he's retiring after his last fight in the octagon.", "label": 1}
{"text": "If it took you this long to realize that he’s a horrible person and not worth defending, I’d encourage you to think a little deeper about why that is.", "label": 1}
{"text": "Haven’t been paying enough attention. Weird to critique me for changing my views on it now tbh", "label": 1}
{"text": "Where you get that info from?", "label": 1}
{"text": "I mean yea, I’ll trust the multiple scientific studies that refer to B+ Golden Teachers Penis Envy etc as “strains” over chode-boy-redditor’s opinion 🤷‍♂️", "label": 1}
{"text": "> should be the final nail in the coffin of any respect he had.\n\nHave you met MMA fans? Buddeh is about to get even more popular, will even get escorted into PPV events by Dana to sit cage side like another rapist and convicted felon does to a standing ovation in the US.", "label": 1}
{"text": "I mean none of ops statements are a lie. They are all well known facts", "label": 1}
{"text": "That Muhammad Ali raped children? If it’s factual, share the proof.", "label": 1}
{"text": "Belinda Boyd was 16 when he married her. Do you think they held hands until she was legal?", "label": 1}
{"text": "There are indeed situations where people are falsely accused. \n\nThis clearly isn't one of them though, and you should call it out for what it is when it arises instead of adding to the smokescreen.", "label": 1}
{"text": "He also cheated with and fathered children with 16 year old wanda bolton, when he was 32, if you need further proof lmao", "label": 1}
{"text": "Sheeeeeesshhhh", "label": 1}
{"text": "Thanks for the info, guess part of me really ain’t wanna look at a childhood hero that way but… even weirder when he damn near named their child the name of the wife he cheated on with her.", "label": 1}
{"text": "I mean you really are not a bright person if you are actively looking to get offended online.\n\nMMA fans and reddit in general is a cesspool, you are interacting with what might be the dumbest fanbase in sports.\n\nLots of posts in UFC are downright racist and people are gleefully participating, if one is a POC its pretty easy to notice that.", "label": 1}
{"text": "I'm sorry you got triggered", "label": 1}
{"text": "> Scrolling all the way down through the Conor thread, and reaching the comments defending him is not good for my mental health lol.\n\nThis genuinely does not look like a joke but a factual statement lol.", "label": 1}
{"text": "Important to note that at least at that time, 2018-19, Ireland had an 8% conviction rate on sexual assault cases. Apparently the situation is bad and old fashioned in a \"she was wearing a mini\" type defenses that a minority coalition in Parliament (or whatever they call themselves) had to protest, but I don't think they made any headway.", "label": 1}
{"text": "Im triggered? I think you are for randomly bringing up some youtuber because you couldnt get him out of your mind lmao", "label": 1}
{"text": "Piggies is a well known Conor fan boy, He also likes to moralise a lot.he is the prime example of exactly what my post was addressing.", "label": 1}
{"text": "What if I told you my “$” key i$ broken and I u$e the dollar $ign to replace it when it come$ up in word$?\n\nIt isn’t, but you didn’t even stop to consider that as an option. Maybe you should think a little harder yourself.", "label": 1}
{"text": "> Meanwhile if a russian had so much as mistakenly brushed a woman, we would be having the modern day crusades on youtube and reddit...\n\nWtf? How did you bring Russians into this? lol\n\nYou need help bro lol", "label": 1}
{"text": "The B.A.R.R.Y system requires a high fight IQ to fully understand it and it is only rivaled next to the D.E.N.N.I.S system.\n\n**B - Become a coach**\n\nWhat other job will allow you to look/touch minors under the guise of help and no one will blink an eye? None that's what.\n\n**A - Attract a minor**\n\nWhy a minor? Their minds are still being developed and can be easily molded into what you want. The more insecure the better.\n\n**R - Raise confidence**\n\nIf you've been scouting right and landed yourself an insecure minor, raising their confidence will nurture a co-dependent relationship, this basically locks you in as the go to guy in their life.\n\n**R - Ruin career**\n\nOnce you've raised their confidence enough, you don't want them becoming so self sufficient that they realize they don't need you anymore. That's why you need to start ruining their career to nurture the co-dependency even more.\n\n**Y - Yell useless advice**\n\nIf you've done the previous steps right, you will have fully convinced your target to beleive you are the one and only person they need to listen to and that you're the reason why they got to the top. Now, you don't want them to realize you're not actually providing advice, so you need to scream real loud anytime you're in her corner at every chance you get.\n\nB.A.R.R.Y, the Barry system.\n\n/s incase it's required.", "label": 1}
{"text": "How many squirrels to defeat the state of New York?", "label": 1}
{"text": "Saw a pic of Usman personally training Kadyrovs son , which makes me wonder if there is a specific reason Khamvat is banned? Im guessing he must be wrapped up in something serious to be full on banned", "label": 1}
{"text": "I mean Rose did become champ twice so her career wasn’t ruined…", "label": 1}
{"text": "weren't those both when she was under Whitman?", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Yeah its… not great", "label": 1}
{"text": "Usman can't be banned from the USA because he lives in the USA.", "label": 1}
{"text": "Yeah I know I was just wondering what got Khamzat banned", "label": 1}
{"text": "Khamzat is married to one of Kadyrovs family members.", "label": 1}
{"text": "Fucking lmao ", "label": 1}
{"text": "The W.H.I.T.M.A.N. system!\n\nW - Wait for Pat Barry to fall asleep.\nH - Hide training schedule\nI - Initiate deflection mode when Barry is around\nT - Train military hours to confuse\nM - Manage Rose’s training regimen\nA - Alleviate frustration with a cocktail\nN - Navigate Barry’s suspicious banter", "label": 1}
{"text": "The blatant misogyny again?", "label": 1}
{"text": "Weird hypothetical, bro. Get help.", "label": 1}
{"text": "What's so weird about it?", "label": 1}
{"text": "i think just about every dudes has had this thought when watching a wmma fight", "label": 1}
{"text": "Three minutes. Yes. She likely picks him apart after, but I think he survives three minutes.", "label": 1}
{"text": "Usman getting the interim title VIA presidential endorsement is why I hate Dana White", "label": 1}
{"text": "Colby somewhere having a great night", "label": 1}
{"text": "JRE podcast is the best base for winning a presidential race", "label": 1}
{"text": " 99% of fighters and figures in the sport feel the same way", "label": 1}
{"text": "True, but Colby is actually chummy with him", "label": 1}
{"text": "My favorite Colby moment when he was an okay fighter\n\nColby: \n“Jorge you are a deadbeat dad, a horrible husband.”\n\nJorge:\n“Silence”\n\nColby:\n“You had Obamaphone.”\n\nJorge:\n**I’LL KILL YOU MOTHERFUCKER, WAIT TIL I GET MY HANDS ON YOU, I’LL MURDER YOUR WHOLE FAMILY**", "label": 1}
{"text": "Kool Aid… it was dranketh", "label": 1}
{"text": "Apex 100 is going to be pure cinema\n\nThe card has zero name power, literally an embarrassing car, but low level MMA has a tendency to produce bangers. Not a lot of pointfighters on here (especially if Johns is out)\n\nDe Ridder vs GM3 actually might be the sickest fight because we’ll see a lot of weird scrambles and horrendously awful striking from both sides, \n\nGore Trocoli, Semelsberger Radtke, Balonos Rominous,\n\nSuch low level scraps that are gonna be so jam packed with action", "label": 1}
{"text": "Looks like the 2028 ticket is gonna be Vance and Dana.", "label": 1}
{"text": "Tell me about it", "label": 1}
{"text": "Dana White gets the chance to speak during the President Elects speech and man uses the opportunity to shout out the Nelk Boys and Adin Ross\n\nThis guy..", "label": 1}
{"text": "He thanked the Nelk Boys lmao what is even this", "label": 1}
{"text": "What in the actual fuck is this timeline even?", "label": 1}
{"text": "The slimmest of silver linings; Khamzat will he allowed in.", "label": 1}
{"text": "Khamzat vs DDP let's go!", "label": 1}
{"text": "No doubt this shit will have a negative impact around the world. Glad to be living in Australia but i feel bad for you guys across the ocean", "label": 1}
{"text": "Bro stfu lol. I'm so tired of all of you and your \"these shitty cards always turn out to be bangers\". No they don't. And if I wanted to watch low level fighters fight sloppy, I'd go watch some local fights.", "label": 1}
{"text": "U r wrong bro, his hand is ight not pillow hand but def not pack a bunch. He’s gonna win by dec", "label": 1}
{"text": "So uh Dana.... Yeah....", "label": 1}
{"text": "Bullshit man, why the hell would he say shit like that? Use your brain. \n\nRich and famous athlete accused of rape. Wow. So rare. So believable", "label": 1}
{"text": "So I guess Khamzat is gonna get that visa to fight in the US.", "label": 1}
{"text": "The US just elected a criminal who has raped multiple women to the office of President, have some cop-on.", "label": 1}
{"text": "It’s disgusting but this is who Americans appreciate. The US was founded on violence and rebellion. Ppl here still wave the confederate flag.", "label": 1}
{"text": "Relatively but yea it's not a libel issue if McGregor was in the US he'd still be a celeb despite all this, the media protection laws in Ireland suck but they also suck in the US.", "label": 1}
{"text": "Good point", "label": 1}
{"text": "Court orders for khabib to rape mcgregor. Justice is served.", "label": 1}
{"text": "Him or Sean Strickland need to be press secretary.", "label": 1}
{"text": "\"Listen here you guys\" to start out a presser would be beautiful", "label": 1}
{"text": "LMAO have you recovered mentally from Ankalaev clapping Rakic's asscheeks? \"Nightmare matchup\", wasn't he?", "label": 1}
{"text": "lmfao part of the swamp", "label": 1}
{"text": "does gatekeeping what makes someone a casual make you feel like a champ? if it does keep it up, but after a google, bahamondes' biggest name win is probably over roosevelt roberts, whos most notable win is over... nobody.", "label": 1}
{"text": "Keep editing those comments..", "label": 1}
{"text": "That Hubbard line was funny ngl. Don’t worry my casual friend just keep watching eventually you will know about the great Mick Parkin.", "label": 1}
{"text": "I'm not sure what that has to do with you saying you don't know who he is even though you watch every event. So then you've seen him fight and win several times including the Sphere event but don't remember him even though he's been in exciting fights.", "label": 1}
{"text": "what? i can't remember every fighter who's fought on every ppv ever. especially unranked guys who don't have any wins over ranked competetion. you guys are nerds", "label": 1}
{"text": "I'm not acting ignorant to be cool, you're just being a smartarse because i don't know a fighter that you know. so congratulations", "label": 1}
{"text": "Thank you appreciate it", "label": 1}
{"text": "Feels weird being a lib and a big UFC fan", "label": 1}
{"text": "the irony of calling people casuals then saying “if ur insecure about being called a casual thats ur own problem”, when quite literally the only reason u use the term is because ur insecure and want to feel superior lol. weak mental", "label": 1}
{"text": "Casual fans exist. Calling a casual fan a casual fan isn’t a diss. You insecure people just act like it is because you hate not being the smartest or most educated on every topic is hilarious.", "label": 1}
{"text": "Running pretty thin these days. Chris Curtis and Mike Jackson baby!", "label": 1}
{"text": "> TNT Sports was never my friend\n- Dana Trump", "label": 1}
{"text": "Mike Jackson sucks. What a dork lmao.", "label": 1}
{"text": "Was def being facetious Could not be overstated how much that dude sucks.", "label": 1}
{"text": "Same", "label": 1}
{"text": "All you gotta remember that fighters are legitimately some of the dumbest people out there lol", "label": 1}
{"text": "I’m actually pretty confident saying that dude has 0 fans", "label": 1}
{"text": "its not like fight pass is the only way to watch old events either, if you don't know now you know", "label": 1}
{"text": "“Talks to amputee without legs” “See you at the top” 🦅🇺🇸", "label": 1}
{"text": "just sounds racist to me tbh", "label": 1}
{"text": "100% was just about to say this. Look if a joke has to do with race and is funny then have at it. Doing an ebonics voice for someone's adopted black child is just weird behavior. Like why does your brain go there?", "label": 1}
{"text": "Racist jokes absolutely CANNOT be even remotely funny, like at all /s", "label": 1}
{"text": "Great username lmao", "label": 1}
{"text": "that one definitely wasn't", "label": 1}
{"text": "Racist jokes, no. Racial jokes? Yes, they can be funny for all parties, it really comes down to intent. This one isn’t too well-intentioned", "label": 1}
{"text": "What does them trying change about their wrestling aptitude being shit?", "label": 1}
{"text": "They have superior wrestling to him and tried. You’re insinuating that they are bums on the ground. Jan has YEARS of experience that Alex doesn’t have on the ground. \n\nDo you need it spelled out any further?", "label": 1}
{"text": "tell us a funny one!?", "label": 1}
{"text": "Neither has superior wrestling to Ankalaev lmfao. Wtf are you talking about. Jan is a great grappler but his wrestling is poor and has been exposed numerous times (by Ankalaev actually). \n\n>Jan has YEARS of experience that Alex doesn’t have on the ground\n\nYeah and he almost won the fight he was getting cooked on the ground and gassed purely because of that. Now take into consideration that Ankalaev 10-8 Jan on the ground. \n\nAs for Jiri, the fact that you think he's a better wrestler than Anolaev suggests you don't watch many fights period.", "label": 1}
{"text": "Big boobies", "label": 1}
