{"text": "If you went back through my posting history to March/April, you’d see all the paragraphs I wrote saying Max had a good chance at beating Gaethje.\n\nNo doubt in my mind that the people who called me crazy and said Max was a dead man walking are the same people who are now too hyped on Max and that performance to recognize that Ilia isn’t Gaethje and this is not a good fight for Max.\n\nNot even relatively similar. Part of why Max seems irritable this fight week is because he knows - it’s gonna be tough to find a path to victory. Same demeanor he had with Volk.", "label": 0}
{"text": "I can be of service here. The group was Brunson, Russian Leo, Jon Hamm from Atlanta, Arlovski, Overreem, Frank Lester and my ass (normal person, amateur). Believe it or not Brunson would fuck us all up too. But no, Jones was never afraid of or losing too overreem.", "label": 0}
{"text": "Aussies really got the best sense of humor", "label": 0}
{"text": "He's taller\n\nWhittaker is thicker", "label": 0}
{"text": "I know the circumstances are a bit different but Dana did say that he was not a fan of guys not taking fights because they were friends. Maybe you're right and it was just because he dislikes Aljo and Merab was guilty by association. I still don't think he would love the idea of Islam turning down a fight against Belal.", "label": 0}
{"text": "Nunes", "label": 0}
{"text": "A24 films have been pretty shit the past few years so I don’t really have any hope for this", "label": 0}
{"text": "It would be but I wonder\n\nWould Islam be smart enough to know that’s a bad idea?\n\nOr am I wrong and Islam looks at Shavkat and sees a reckless guy that he can KTFO", "label": 0}
{"text": "He wasn’t ubereem when he injured Jon", "label": 0}
{"text": "Yall said Leon would humiliate Belal (who’s not much bigger than Islam) just for Belal to rag doll him.", "label": 0}
{"text": "> Francis Ngannou.\n\nLmao", "label": 0}
{"text": "Unless someone is in the wrong division, cutting too much weight, I don't like this shit at all. \n\nIf it didn't make money, I feel like Dana would come out and say I don't want to hear shit until you have 5 title defenses.", "label": 0}
{"text": "He saved the card on 10 days notice as a champion. Of course he got a fat ass bag", "label": 0}
{"text": "Shavkat is less experienced and not as good as Islam p4p, only thing he got is size which islam will put on.", "label": 0}
{"text": "> Poirier is arguably a top 5 lightweight of all time\n\nKhabib, Islam, Charles, and BJ all have to go above him, right? That means you’re weighing Poirier above the likes of RDA, Alvarez, and Tony. Which, if you want to make the argument, I could maybe see it, but it seems like a stretch.", "label": 0}
{"text": "Yeh, especially if it’s some modified rule set….ive seen it before with strange things like, no knees & only standing elbows & 30sec on the ground no matter the position….its kinda like MMA but not really so it don’t get put on records, but some fighters can take just as much damage so some people count it", "label": 0}
{"text": "Brother, this is no time for talk like that. This woman has dandruff.", "label": 0}
{"text": "only 4? The record at Lightweight is 3, also there aren't any great contenders in in the LW Division other than Arman", "label": 0}
{"text": "Francis weight 265lbs and Stipe was 220lbs in their rematch?\n\nIs that win any less impressive?", "label": 0}
{"text": "He sees red bro", "label": 0}
{"text": "Manifesting Jiri and Alex Mortal Kombat collab", "label": 0}
{"text": "Even that tho, I think legitimately people do not care about the tournament they just want to see good fights. \n\nThe problem with tournaments in modern mma is that you need to spread it over an entire year to give everyone time to recover between rounds, that's far too long of a span with inactivity for people to have any investment in it", "label": 0}
{"text": "Heal lightcha up b", "label": 0}
{"text": "Rico would hospitalise him in a KICK-BOXING MATCH. In mma, considering ngannou shoots takedowns on any opponent he is scared of, he would take rico down and maul him", "label": 0}
{"text": "I think Islam doesn’t get all the credit for it he should because he’s been so dominating, but the man lowkey has that dog in him. He wants the smoke", "label": 0}
{"text": "I was going to go but francis never got healthcare for all fighters so I didnt", "label": 0}
{"text": "Other than being very boring, he got matched up with his best friend in PFL and they basically agreed to have a point sparring match.", "label": 0}
{"text": "\"I'm the best in the world, I'm the best in the world\" - Ilia Namajunas", "label": 0}
{"text": "Khamzat’s cardio and pacing are questionable, especially over 5, and he’s hittable on the feet.  I can see Rob piecing up an exhausted Khamzat.  But I can also see him getting finished early.  Just a great fight, I’m super excited.", "label": 0}
{"text": "If domestic PPV didn't mean anything they would have put this on ESPN+ for free to get more eyes on it.", "label": 0}
{"text": "RMC Sport will allow you to buy a monthlong pass for 25 Euros without commitment.", "label": 0}
{"text": "Murphy needs a big statement tonight if he wants to push for title contention. He's 33 now and injuries have stalled his career.", "label": 0}
{"text": "Get your hands off my penis", "label": 0}
{"text": "\"You will be down man\"", "label": 0}
{"text": "How can you not like this guy. Man I hope he can get the title back one more time", "label": 0}
{"text": "Dont get the joke. Volk has never been to Abu Dhabi and he also only fought Islam once. Weird post.", "label": 0}
{"text": "Kinda funny how Mike Tyson isn’t as big as a dog as Max Holloway lmao", "label": 0}
{"text": "what was the pecking order ?", "label": 0}
{"text": "All it takes is one getting down and dirty performance like Khali roundtree and everyone will flip a switch soon. Happens pretty often.", "label": 0}
{"text": "Low Key the Middleweight Goat. He's the only left that's not about the drama.", "label": 0}
{"text": "Sauciest the UFC has possibly ever been. Leal showing up with connect the dots acne and Ibo showing up with flat out tits", "label": 0}
{"text": "He does.  He's fucked.", "label": 0}
{"text": "Roobert Whitaker", "label": 0}
{"text": "Bants.", "label": 0}
{"text": "Amazing how these two tiny tiny dudes could kick like 99% of the world's ass", "label": 0}
{"text": "Francis gonna bankrupt pfl right out of business", "label": 0}
{"text": "Good luck getting those numbers", "label": 0}
{"text": "Not allowed to call Rountree anything but a warrior in this sub, bro", "label": 0}
{"text": "This is so great. All hail bantamweight champ Caesar", "label": 0}
{"text": "It was also great to see him vacate the title, so Holloway could get another crack.", "label": 0}
{"text": "Were you lectured or did someone just comment back to you 🤔", "label": 0}
{"text": "Cracking up on the toilet rn. Whole firm gonna think someone's dying in Herr", "label": 0}
{"text": "Dana White’s P4P top 5 if he had complete autonomy over the rankings:\n\n1. Jon Jones\n2. Jon Jones\n3. Conor McGregor\n4. Michael Chandler\n5. Jon Jones", "label": 0}
{"text": "Introducing him as ppv for the pfl was the dumb idea. That super stacked affliction ppv with fedora and many others did 100k or so buys, but him vs Brett Rogers did something like 5 million viewers on CBS. They need to get eyes on them first before they can start charging for ppvs.", "label": 0}
{"text": "lol Francis swindled PFL so bad.", "label": 0}
{"text": "War Bobby knuckles 😤😤🤟🤟", "label": 0}
{"text": "Public and private are different things, though.  Cory might overall have a good rapport with Dana & co, and they might even respect him for his accomplishments and exciting performances in the past, while also not being thrilled with his more grappling mixed, decision winning style.", "label": 0}
{"text": "Yeah it was pretty funny lol people were acting like he was gonna start a revolution when he was  just chasing a bag", "label": 0}
{"text": "Still want a Volk Stathem buddy action comedy.", "label": 0}
{"text": "So you're saying... he doesn't want to fight umar because he's scared to lose?", "label": 0}
{"text": "It was in Saudi Arabia.  What do you expect?", "label": 0}
{"text": "The real ones already do bro", "label": 0}
{"text": "At this point arguing with the sheer force that is Alex is stupid. ", "label": 0}
{"text": "they got the saudi money i doubt it matters", "label": 0}
{"text": "Exactly, that's what I said, they should of marketed the hell out of it and get it as many places as possible for free so people can learn what the PFL is in the first place.\n\nMost people don't even know what the PFL is and aren't going to risk 50 bucks on a brand you never heard of.", "label": 0}
{"text": "What I like the most about his rise to UFC stardom is that Alex seems like a nice and genuine dude and doesn't have to go into stupid and/or disrespectful trash talk to sell his fights. His history with Izzy helped him a lot, sure, but he retained everyone's attention afterwards without resorting to silly gimmicks.", "label": 0}
{"text": "😂😂😂 been having a shit day but this cracked me up", "label": 0}
{"text": "Their biggest event ever with the lineal HW champ and they marketed it like a Fight Night card in New Jersey.", "label": 0}
{"text": "Volk should really start his action comedy acting career now, he'd be crazy good in those kinds of movies", "label": 0}
{"text": "I would have preferred to see him fight Cory since it’s a fresh match up and Cory deserved it but it’s cool. I’ll appreciate it for what it was and it was satisfying to see O’Malley outclass chito\n\nIf they were to fight a third time, I wouldn’t be surprised if chito managed to tko O’Malley again though. O’Malley is better technically but chito is more durable and dangerous\n\nEven when Cory beating chito, I felt that chito was more dangerous. He has power, durability, and cardio on his side", "label": 0}
{"text": "Still don't get your point.\n\nYan is a striker with decent TDD. Merab had personal beef with him due to his nationality and the story with Aljo. So he had a point to prove. \n\nUmar is one of the most well rounded fighters in the division who can, in theory, not only defend takedowns but also submit Merab. Not to mention outstrike him.\n\nI don't think any fighter is really \"scared\" of any fighter apart from maybe Ngannou. But champs obviously want to keep their newly gained belt and all that comes with that for as long as possible. Umar is a dangerous opponent for his first title defense and Merab knows that. Otherwise he wouldn't do his best impression of a duck while simultaneously asking for a rematch with Suga.", "label": 0}
{"text": "No he didn't. He said he got him a fight on KZ's card and Dana is personally flying there to watch it, and he'll sign the dude if he's impressed.  Sounds like a fantastic deal for a completely random dude who just shot a random shot at a press conference or Q&A or whatever.", "label": 0}
{"text": "Dana clearly wasn't happy with sandhagen's performance against Font last year.\n\n[‘Dana White walked out’: Twitter reacts to Sandhagen at UFC Nashville](https://mmajunkie.usatoday.com/lists/dana-white-walked-out-twitter-reacts-to-cory-sandhagens-win-over-rob-font-at-ufc-on-espn-50)", "label": 0}
{"text": "I think something about how he’s the best in the world", "label": 0}
{"text": "[The big thing they missed is that it’s a 5 round co-main.](https://www.tapology.com/fightcenter/bouts/902750-ufc-308-robert-the-reaper-whittaker-vs-khamzat-borz-chimaev)", "label": 0}
{"text": "LOL", "label": 0}
{"text": "Main reason i avoid much oversized clothing, although i enjoy the aesthetics of it.\n\nIf i was 2m tall and big, i'd rock these af.", "label": 0}
{"text": "Probably a good thing ultimately. You gotta led bad products die in the market so they're replaced with better ones.", "label": 0}
{"text": "Walking out is different from punishing him with matchmaking or publicly calling him out for fighting bad.", "label": 0}
{"text": "I don’t disagree with any of this — my point is that there’s a sizable contingent of people who think Merab is “afraid” of fighting Umar, and I’m pointing out how crazy of a notion that is", "label": 0}
{"text": "old. this was out this morning.", "label": 0}
{"text": "My prediction is that Rob is gonna try to win the fight", "label": 0}
{"text": "🥵", "label": 0}
{"text": "The tongue one is the best.", "label": 0}
{"text": "“Down like a clown Charlie Brbroooowww…”", "label": 0}
{"text": "Right? Guy was supposed to save MMA, then didn’t fight in MMA for what 3 years? \n\nAll to come back and beat a can like every other former UFC fighter", "label": 0}
{"text": "It's the nerves talking.", "label": 0}
{"text": "Umar in less than 3 months after 5 rounds is a lot. At least with Sean he already had a camp to prepare for him.", "label": 0}
{"text": "He stiffed his first gym in France for a considerable amount of money. Not only gym fees, but the small % of his purse fighters give to the gym.", "label": 0}
{"text": "Unmutes\nHi guys\nMutes\n\nUnmutes\nBye guys\nLeave call\nOpen netflix", "label": 0}
{"text": "I'm not quite sure how advertiser money works but I bet the more people watching the more money you get or can potentially get in the future. You would think more eyes on it would be more important and just try to get as much advertiser money as possible while they make a name", "label": 0}
{"text": "I have no hope on that with UFC basically being a proven monopoly and the only other prospect being ☝️ where fighters are constantly complaining how bad they are to work with/they seem to be transitioning away from mma.  Hard to just show up and make waves in mma for businesses unless ya [got that connect](https://youtu.be/bcuAw77J8_Y?si=oqA-h2X-RhFhsDoa)", "label": 0}
{"text": "He lost a literal championship fight which ya know, is the ceiling for the sport. He got caught and slept, just like Stipe did against Stefan Struve, and DC, and Francis. That happens at heavyweight. \n\nThen the Lewis fight, it takes two people to fight, neither of them did anything, it was an odd night for both of them, neither would engage, historically bad sure, but it was bad for both of them.", "label": 0}
{"text": "My prediction is we'll find out Oct 26", "label": 0}
{"text": "The dick riding is crazy, I just avoid Francis posts for the most part lol the amount of posts acting like he is the greatest heavy wright ever for destroying a nobody", "label": 0}
{"text": "My man cooked frfr. This is definitely how I speak in real life.", "label": 0}
{"text": "This the promotion that claims to be neck to neck with the UFC? L-o-l", "label": 0}
{"text": "ACL kick", "label": 0}
{"text": "> There’s no meritocratic argument for anyone other than umar to get the next title shot.\n\nIf Figgy beats Yan next month that goes out the window", "label": 0}
{"text": "Dude has Jesus on the Cross level obliques", "label": 0}
{"text": "Source?", "label": 0}
{"text": "You know the next PPV is gonna be headlined by Stage Kid vs Q&A Guy. Only $79.99, order now, ya fuckin goofs.", "label": 0}
{"text": "Volk's been having a lot of fun with the buildup to this fight. Seems to like both guys fighting and he's more than willing to laugh at himself, which is not super common among UFC guys. His videos have been great", "label": 0}
{"text": "Hi Dana", "label": 0}
{"text": "he's a big goauy mate, not bad good soize", "label": 0}
{"text": "I hope Bobby Knuckles gets *all* the juice", "label": 0}
{"text": "The ikram walkout is still the most intense I've ever seen Rob, can't wait for this one.", "label": 0}
{"text": "I mean the work in case it's O'Malley is already done, yes? He basically only need to get in shape. Umar is a totally different animal, it makes sense to me.", "label": 0}
{"text": "Making up stuff is fun. Fernand Lopez is really known to be a great guy that doesn’t beef with anyone, so it’s good you seem to be taking his word for it \n\n/s", "label": 0}
{"text": "Google.com \n\nSearch Francis not paying his gym bill in France \n\nYou can do it, I believe in you bud!", "label": 0}
{"text": "Yup, it’s wild lol. \n\nYou gotta give him credit, his PR team is amazing.", "label": 0}
{"text": "That assumes he has the cardio to go 5 rounds even if he paces himself\n\nIf he plays it safe it's not like he can walk around for 5 rounds, if he wants to win the fight he'll still need a good few wrestling exchanges and will take quite a bit of damage\n\nEven if he doesn't go \"all in\" like a maniac I don't see how he has the cardio for 5 (best case scenario would be he wins the first 3 and then manages to survive the final 2, in case it ever reaches 5 rounds).\n\nI do think that if Khamzat has the chance he will go all in. For example if the same thing as the Usman fight happens, he's still going to chase those finishes.", "label": 0}
{"text": "Volk has great comedic timing. He’s a very funny guy.", "label": 0}
{"text": "He also didn't solve world hunger and create world Peace. What a shitty dude", "label": 0}
{"text": "he really is the nicest guy", "label": 0}
{"text": "I started watching in and out after the main card start.  By the time the Eblen fight started, I remembered why I don't watch Bellator/PFL.  And then that fight stunk\n\nFrancis's return was cool.  But idc, I'd rather watch shitty Fight Night's than almost all Bellator/PFL cards", "label": 0}
{"text": "That's everyone's prediction mate", "label": 0}
{"text": "It's a bold strategy. Let's see if it pays off.", "label": 0}
{"text": "quick post the alexa grasso flex gif", "label": 0}
{"text": "What would that have to do with anything? They have combat sports events *ALL* the time. MMA *and* boxing. \n\nNgannou vs Fury was in Saudi Arabia and so was Ngannou Joshua lmao.\n\nShows and events is *literally* what they market Riyadh around.", "label": 0}
{"text": "Can’t wait to hear that idiot Donn Davis Spinzone this shit.", "label": 0}
{"text": "UFC really hate Ank, hes almost entirely skipped every ep.", "label": 0}
{"text": "He does occasional camps there, but I think he mainly trains in Russia though", "label": 0}
{"text": "Topuria is putting a lot of pressure on himself with his shtick imo: he better deliver because mma fans are merciless", "label": 0}
{"text": "Ilia burning off a lot of nervous energy with that speech, lol. Max, chill af - seen it all before. Have to say, I was confidently picking Ilia before the event, but as it gets closer I feel like Max might take it out.", "label": 0}
{"text": "Well he does, his KO's and undefeated record\n\nWhen you have that type of loud and obnoxious trash talk it works and makes you popular IF you back it up in the octagon. Doesn't really work if you do poorly though.\n\nFor example if Colby was undefeated and putting up performances like Ilia I guarantee he'd be a massive star, because he has a big mouth. But since he doesn't do anything original, and he's losing/had boring fights, he's pretty much hated.", "label": 0}
{"text": "and Beche Correira", "label": 0}
{"text": "[Max and Ilia facing off](https://i.kym-cdn.com/photos/images/newsfeed/002/308/396/fd4)", "label": 0}
{"text": "Well yeah, nobody cares about Ngannou no matter how much people online pretend they do. If he's not in the UFC he's irrelevant. That's just the landscape of MMA these days.", "label": 0}
{"text": "Is this card A-tier or B-tier?", "label": 0}
{"text": "Depends on the metrics tbh, Vince is a billionaire because of his company, but Conor as a personality probably reached a higher peak (though I'd agree it's very debatable, because Vince himself was massive as a personality during WWE's growth, but I'd still give it to Conor)\n\nIf you only judge it based on money then yeah there's no real competition", "label": 0}
{"text": "This man will forever be goated for fighting the boogeyman twice. God I miss Yoel.", "label": 0}
{"text": "no one was lecturing you bro", "label": 0}
{"text": "Bruh have you ever watched the man fight.", "label": 0}
{"text": "I have to look it up, I done have it bookmarked or anything.", "label": 0}
{"text": "So, so, so, um yeah... plans changed", "label": 0}
{"text": "Oh I’m sure they had it free in as many places, don’t you worry. 🏴‍☠️", "label": 0}
{"text": "I wish I could be this confident, but Volkov was doing pretty good in their first fight. Especially the first rounds, with all those tree trunk leg & body kicks.  \n\nLogic suggests that since he was 33-8 to Gane's 8-0 at the time, Ciryl should've grown the most since. But then again, Volkov has looked good since and is a tough matchup for him.", "label": 0}
{"text": "True agreed. That seems most likely.", "label": 0}
{"text": "Crashed out really lost all meaning huh", "label": 0}
{"text": "Try the sports bar in the airport", "label": 0}
{"text": "Lol I can't stand when smug Redditors demand you do the research for them", "label": 0}
{"text": "Yeah she’s very pretty. His girlfriend reminds me of Angelina Lima and Taylor. Respect Ilia for big accomplishments as a short king.", "label": 0}
{"text": "S tier, only reason I won't say it's as stacked as 299 and 300 is because Gane and Volkov fight isn't happening. But still co main and main is superior to any UFC card this year", "label": 0}
{"text": "UFC used to do that with their Fox cards years ago", "label": 0}
{"text": "Francis wasn’t a PPV draw in the UFC either. None of his PPVs were great in terms of buys", "label": 0}
{"text": "Stuff like this is why Dana can shit on pfl.", "label": 0}
{"text": "Let's go, Bobby Knuckles!", "label": 0}
{"text": "I love Robert Whittaker", "label": 0}
{"text": "Show some respect to the Pleasure Man Slayer", "label": 0}
{"text": "Normally I’d agree but they’re the only clear number 2 MMA promotion in the states. Nobody is around to replace them. It’s literally just going to be the UFC having a foothold in the states. \n\nUFL and Invicta are nowhere near Bellator, Strikeforce, WEC, IFL, Affliction, etc in terms of popularity.", "label": 0}
{"text": "francis fumbled the bag fans really came out of hiding for this story", "label": 0}
{"text": "lol mma is not a profitable business", "label": 0}
{"text": "99% chilling in this sub don't buy ANY card, and 99.99999% would never travel to another country for an event.", "label": 0}
{"text": "Watch Whittaker head kick Khamzat and slice his eye with his toe in the first 10 seconds and the doctor stops it", "label": 0}
{"text": "The top two fights are S-tier, Ank vs Rakic is pretty good on paper too. The rest all ranges from decent to meh. \n\nOverall, idk what that makes it but I’d say maybe A- or B+", "label": 0}
{"text": "I'm already wearing my below the knee shorts.", "label": 0}
{"text": "https://www.mmanews.com/news/pfl/pfl-ngannou-vs-ferreira-outperformed-ufc/ \n\nHe already tried 😂", "label": 0}
{"text": "I don’t like volk. I was happy when makhachev kicked his head off", "label": 0}
{"text": "10 day old account and all your comments are about francis. very interesting", "label": 0}
{"text": "A tier for me", "label": 0}
{"text": "He also says \"Sean deserves to fight me\" which is ducking every single real contender off the bat.", "label": 0}
{"text": "I think a loss to Aspinal wouldhave the effect you talk about but I think Jones' motivation is leaving the game on top. He doesn't want to go out with a loss. ", "label": 0}
{"text": "It’s so stupid lol. All for them to not believe or read it anyways 😂", "label": 0}
{"text": "🤣 made me really lol because that’s Max FR.", "label": 0}
{"text": "> The guy can literally fight any way.\n\nHe can't though. This is why I put Volk over Max. That 2nd fight was Volk actually fighting in different ways where Max couldn't. The 3rd fight was also just Max getting beat up on the feet and he couldn't take the fight anywhere else. Volk > Max. Volk is a way more well rounded fighter", "label": 0}
{"text": "Yeah, he really insists on himself", "label": 0}
{"text": "Tuivasa has lost 5 in a row lmao", "label": 0}
{"text": "Or use a specific mountain name. \n\nKrakatoa, Kilimanjaro, Vesuvius.", "label": 0}
{"text": "He shot for 28 takedowns between the two Whittaker fights, just most weren’t successful and he wasn’t able to keep him down", "label": 0}
{"text": "Gonna cry?", "label": 0}
{"text": "Cro Cop.", "label": 0}
{"text": "He's not but waiting for the rematch and Sean winning somehow is.", "label": 0}
{"text": "Umar absolutely did not deserve a shot more than chito before the Cory win.", "label": 0}
{"text": "Yea same. Winning the title back is always a tall order but I do think he can comeback to beat either Ilia or Max. But yea there's a lot of factors with age being the big one", "label": 0}
{"text": "He’s also fighting a guy who leaves his opponents injured most of the time.", "label": 0}
{"text": "They've got the most muted, uninterested crowds. You'd have a more vibrant crowd in any mid-sized city in America. I just can't believe how many great fights are wasted on a dead audience that looks like they're watching C-SPAN.", "label": 0}
{"text": "Probably the best personality in the UFC.", "label": 0}
{"text": "Go tell your bookie", "label": 0}
{"text": "I dont disagree lol", "label": 0}
{"text": ">How can you not like this guy\n\nIf Max wins tomorrow, and they make the 4th fight, the majority of MMA fans will turn on Volk. Real ones remember.", "label": 0}
{"text": "Do you really think there is a version of Volk that would have eaten that hook to the chin?", "label": 0}
{"text": "Thats awesome\n\nHate Merab’s style but hard to dislike the individual", "label": 0}
{"text": "Sounds about right", "label": 0}
{"text": "Funny how? Funny like a clown? He amuses you?", "label": 0}
{"text": "They can do it with their eyes closed, but they can't stop the friction", "label": 0}
{"text": "Volk fucking rules", "label": 0}
{"text": "If it’s a battle of wits then he’s coming unarmed. \n\nGreat fighter that realistically hasn’t even touched his potential which is scary. But he has the charisma of a pet rock.", "label": 0}
{"text": "Honestly imagine being a famous athlete and being able to give this special moment to someone, it must be so good", "label": 0}
{"text": "MVP vs Daley", "label": 0}
{"text": "The thought of Jones hearing about this kids career dreams and then *immediatedly* shattering them with a raw full force oblique kick has me fucking dying", "label": 0}
{"text": "Calling out a guy who you dominated is extremely corny imo ", "label": 0}
{"text": "Dana would be a used car dealership water boy without the Ferttitas", "label": 0}
{"text": "Worked real well against emmet who was in the fight the entire 5 rounds", "label": 0}
{"text": "Meltzer was saying that these guys wanted short term cash now than wait even though they'll be in the same spot when the money is all spent.", "label": 0}
{"text": "PFL is gonna crash and burn after Francis’s next fight, there’s literally no way they’re getting any profit for these events.", "label": 0}
{"text": "FWIW, as a generic platitude \"Everyone's chin cracks eventually\" is true for pretty much every combat sports athlete.\n\nHell, even Condit got cracked in his fight against Damian Maia of all people. Man said he took a punch when Maia was in his guard and it fucked him up proper. You don't have to be stiff as a board for your chin to crack. Sometimes a Colby Covington fisted mofo can come in and hit that bulletproof glass just right and that's it.", "label": 0}
{"text": "You can genuinely be curious and be lazy as shit for not using Google at the same time.", "label": 0}
{"text": "> slightly fake\n\nI find him extremely fake. He literally tries to rip off everyone’s shit. Look at his tattoos for Christ sake. He’s a knock off Conor. \n\nIf he had any sort of personality that anyone thought was genuine he’d be 10x as popular as he is. I hear the MMA podcasts talk about how much of a star Ilia is but I can’t think of anyone that really loves him outside of his fighting style. At least in the US I feel like he’s the b-side of any fight between Max, Volk, or even Lopes.", "label": 0}
{"text": "What pick'em? Ilia is a strong favorite", "label": 0}
{"text": "There's a reason why so many boxers who weren't ready to fight Canelo jumped at the chance to do so. It's life changing money and just getting $10-15 Million losing in a decision to Canelo is worth it.", "label": 0}
{"text": "I'm strictly speaking about the fanbase", "label": 0}
{"text": "Yeah and I think that fight would have been a lot different if Geoff Neal didn't miss weight. Neal weighted in fucking 175 lbs that's a massive gamechanger", "label": 0}
{"text": "Why does he do about 4 show per week? The viewing numbers are pretty bad.", "label": 0}
{"text": "Aren't everyone's pay getting taxed tho? I assume the fighters who were getting $100K will likely get around $90K after taxes if not lower.", "label": 0}
{"text": "100%\n\nLess than 4 months since he had been brutally knocked out by Islam. \n\nHe should have taken a page out of Islam's book and taken a year off to recover.", "label": 0}
{"text": "He has zero say in who or when he fights, Dana hates him so he has no leverage in the situation.", "label": 0}
{"text": "I always got the sense that he has lots of revenue baskets and he's not hurting for money. His podcast has been going on for a decade and I'm sure he's making great money from it. He has the UFC relationship with ESPN and he does work for other groups.", "label": 0}
{"text": "Yep and people can tell me to Google it without being a piece of shit about it too", "label": 0}
{"text": "Francis is all about the money\n\n\nFrancis would have made more money here if he stayed\n\n\n?", "label": 0}
{"text": "Blogbusser", "label": 0}
{"text": "He would have ripped the kids eye out and then put an unhinged video on twitter mocking people for calling him a bad person afterwards. That's our GOAT.", "label": 0}
{"text": "That's what I think too. Initially, I thought Khamzat was gonna ragdoll him but I am not sure anymore", "label": 0}
{"text": "I wonder who is a bigger draw nowadays. Alex pereira or Juliana penne. Without these ppv numbers, I guess we’ll never know - you apparently", "label": 0}
{"text": "Yeah, I wouldn't trust Fernand Lopez's word on Ngannou's character. The man is accused of domestic assault and had an obsession with taking Francis down when Francis left the gym.", "label": 0}
{"text": "This is better than his previous fight promotion. Reverse psychology is working on me, I really want to see them fight the more merab sound like he doesn't want it", "label": 0}
{"text": "Pause", "label": 0}
{"text": "Bobby's gonna kill you.\n\nBobby's gonna kill you.", "label": 0}
{"text": "I put some money on him at +500.", "label": 0}
{"text": "Merab and Volk are awesome dudes.  Good stuff.", "label": 0}
{"text": "Nah mate, October 27th", "label": 0}
{"text": "Just… like… you know… Just… the way you tell the story.", "label": 0}
{"text": "Bad competition in the long term isn't good.", "label": 0}
{"text": "And it’s not Jon", "label": 0}
{"text": "Khamzat with his giant hands, wiry but strong build, explosive power, decent chin... Why tf is this man in MMA and not Powerslap?", "label": 0}
{"text": "You're*\n\nIf you're going to call someone a \"fucking idiot\" at least spell the words correctly at the same time.", "label": 0}
{"text": "I also doubt Ilia is underestimating Max. He has always shown respect to Max he is always dedicated to training and he was definitely prepared for Volk. I feel as if the trash talk is too sell the fight and throw Max off from what to expect", "label": 0}
{"text": "Kayla currently holding the belt in Obvious Statements. ", "label": 0}
{"text": "I prefer luchadores mainly because it brings MMA closer to its pro wrestling roots", "label": 0}
{"text": "HES doing just fine. we know hes doing fine because he wouldnt have taken this fight if the pfl didnt pay him well. the pfl is suffering heavily though because theyre paying someone big bucks but not getting any ppvs in return", "label": 0}
{"text": "I’ve even got comments in my recent post history defending ilia so stop being such a drama queen", "label": 0}
{"text": ":3 vs | :<", "label": 0}
{"text": "And if Topuria wins, according to r/MMA, Ilia has surpassed Jose Aldo", "label": 0}
{"text": "Why are Australian accents so sexy", "label": 0}
{"text": "Terrible business move by the PFL. I want UFC to have competition but all their competitors make more mistakes than they do.", "label": 0}
{"text": "Rogan will call him the GOAT 💯", "label": 0}
{"text": "99.5% of fanbase agrees with you Kayla", "label": 0}
{"text": "can’t wait for his reign as champ to be over with, send him back to prelims where he can hug people for 3 rounds", "label": 0}
{"text": "CLOSE THE IRIS!!!\n\n\nOh...sorry, wrong sub, wrong Don Davis.", "label": 0}
{"text": "Man, the tension and the homoerotism is palpable.", "label": 0}
{"text": "Good guys", "label": 0}
{"text": "ilia literally posted off volk's head with his other hand before throwing the hardest punch he possibly could laser guided to the precise shutdown button on the human head. it's the most perfect giftwrapped knockout shot you could possibly throw. the headkick had absolutely fuck all to do with it. \n\nit doesn't matter when ilia is playing teeball with your chin. \"but dc says\" who gives a shit what dc and joe rogan says lol use your fucking eyes man", "label": 0}
{"text": "Pause.", "label": 0}
{"text": "People watch UFC\n\n\nFrancis was not a draw in UFC\n\n\nPeople do not watch pfl\n\n\nSomehow people thought Francis would sell ppvs for pfl\n\n\nLol!!!!!!!!!!!!!!!", "label": 0}
{"text": "Oliveira’s are nearly identical imo. Shake the hand and straight intensity right afterwards.", "label": 0}
{"text": "Dude same lmao", "label": 0}
{"text": "Thought I’d miss this card due to a concert but dat Abu Dhabi time difference saving me big time.", "label": 0}
{"text": "I agree, his talents are being wasted in the UFC", "label": 0}
{"text": "Glad to be part of the .5% 🫡 y’all are embarrassing.", "label": 0}
{"text": "They grew him in a lab!", "label": 0}
{"text": "I remember when everyone on this sub a year or so ago kept saying they would buy a Ngannou PFL PPV.", "label": 0}
{"text": "Did dana sign him?", "label": 0}
{"text": "I'm probably deaf since I couldn't understand or hear what he was saying and I can't read lips either. But I'm curious as well!", "label": 0}
{"text": "What is there to like about her? Genuinely curious why you're glad to be a fan of hers", "label": 0}
{"text": "I remember dreaming as a kid, hoping to see what the ultimate fighting techniques were. Instead we just have WWE pretending to be MMA. I can deal with the bias in the ruleset itself, but man. If we can't even find out who the best is under that ruleset, then... idk man.", "label": 0}
{"text": "Who's Joe?", "label": 0}
{"text": "He actually talked about this in the past when Gaethje almost dropped the towel. He doesnt want to show us in his words \"The Hawaiian Snake\"", "label": 0}
{"text": "I have to disagree with calling this fight irrelevant, beating Jon Jones would be huge for Stipe's career, handing Jon his first official loss.\n\nHe can say he beat DC, Francis and Jon mother fuckin Jones? Wild!\n\nGuys let's wake up here, I get we all want Jon/Tom but a Stipe win would be nuts.", "label": 0}
{"text": "Rakic already around 230 pounds ", "label": 0}
{"text": "IIII SSSSOOO", "label": 0}
{"text": "Damn I didn't know she went through that that's awful :(", "label": 0}
{"text": "GOONCON", "label": 0}
{"text": "Cecil Peoples scored that 10-9 for Merab.", "label": 0}
{"text": "Merab's argument, agree or disagree, is that when Sandhagen is his only top 15 win, it's not enough to get someone the shot. I think his issue is more with the matchmakers than Umar though. If they think it's enough, that's why it would happen.", "label": 0}
{"text": "Octagon seem to be doing OK internationally. \n\nI don’t really know anything about them but I remember seeing posts on here a few weeks ago about them having a card that filled a massive stadium. \n\nMaybe they’ll be able to grow into UFC competition eventually.", "label": 0}
{"text": "yall are weird in here saying hes ducking umar lol look at who Merab fought on the way to the title and compare it to umar, of course he would feel this way. Book Umar v Yan/Figgy.", "label": 0}
{"text": "We gonna find out October 26 brotha", "label": 0}
{"text": "I think him standing next to Anik is making him look way bigger than usual", "label": 0}
{"text": "Brother this is r/MMA\n\nwe ain’t married here.", "label": 0}
{"text": "people in here are being weird, or there are way more Sean fans than I think.", "label": 0}
{"text": "He never used those skills to win fights. He would shoot or clench but never used those skills in any other significant way.", "label": 0}
{"text": "Giving Chito the title shot and matching sandhagen with Umar is a pretty clear matchmaking punishment", "label": 0}
{"text": "10k", "label": 0}
{"text": "Jon has done similar in the past, I think the guy had Downs maybe?", "label": 0}
{"text": "Cory was out with a triceps injury and merab had earned the shot at O’Malley. Making the Chito fight was bullshit, but Cory wasn’t healthy for that date.", "label": 0}
{"text": "I thought he was asking if he preferred Merab’s suit or Volk’s tshirt outfit haha", "label": 0}
{"text": "Merab isn’t ever going to be anything close to a PPV star, so the best way for him to maximize earnings is getting consecutive title defenses. ", "label": 0}
{"text": "How can you watch that beat down and unironically try to use it do dunk on Topuria. Christ this sub is full of haters", "label": 0}
{"text": "MAX FUCK EM UP", "label": 0}
{"text": "Ilia's last few fight camp vlogs on YT have almost 500k views each and they are all in Spanish. Crazy", "label": 0}
{"text": "Her son from Reddit rubbed me the wrong way", "label": 0}
{"text": "Waiting on the guy to pop up with a mom that looks like Kayla Harrison", "label": 0}
{"text": "I've watched several interviews with Caio Borralho on podcasts, and he's very confident in his jabs. He firmly believes he has the best jabs in his weight class, though he hasn't had the chance to fully showcase them yet. He really believes on his striking and really wants a fight against Adesanya. He's serious about it.", "label": 0}
{"text": "Yeah, only reason I know about it is impractical jokers, and Murr grabbing Kayla behind her back, which I learned from some comments that she specifically asked not to have that happen because of the incident", "label": 0}
{"text": "Wouldn't bet on Ank. Difficult fight for him", "label": 0}
{"text": "Ideal situation is a double knock out and the belt becomes vacant", "label": 0}
{"text": "https://www.nytimes.com/2012/08/03/sports/olympics/kayla-harrison-overcame-horror-to-win-judo-gold.html#", "label": 0}
{"text": "Your drinking hollandaise sauce?", "label": 0}
{"text": "Genuinely asking, what does the comment \"Pause\" have to do with SA?  Or did they change their comment?", "label": 0}
{"text": "That fist clench at 1:18 tells me that he's injured", "label": 0}
{"text": "Grow up \n\nAlso….\n\nhttps://www.nytimes.com/2012/08/03/sports/olympics/kayla-harrison-overcame-horror-to-win-judo-gold.html#", "label": 0}
{"text": "Caio is also one of the only dudes that picked Strickland in the Izzy fight and his mini breakdown is essentially how the fight played out, so thats interesting.", "label": 0}
{"text": "It’s a pause joke on Reddit on a post with 20 likes, why are you like this", "label": 0}
{"text": "Ofc that's true aswell, but neal is just a bad matchup for him in general", "label": 0}
{"text": "Isn’t his brother the French guy in The Boys?", "label": 0}
{"text": "She just talks like everyone else and they all hate her for it 🧍‍♂️they all hated on her for her “first mother UFC Champion” talk as if it’s not insane to give birth to a child then become a UFC Champion 💀 she’s accomplished a great deal.", "label": 0}
{"text": ".5% gang checking in", "label": 0}
{"text": "Thing is the men that promote themselves in a certain way also run me the wrong way like topuria trying to position himself with a fight to be double champ and hasn’t even defended his title yet, maybe people don’t like Juliana because of the way she is like topuria bothers me with the shit he says too. It rubs me the wrong way when people think it’s a male female thing when it’s not", "label": 0}
{"text": "I love your username", "label": 0}
{"text": "They think it’s a pick’em, but they’re wrong dawg", "label": 0}
{"text": "Cory was announced injured august 10 2023, out for 6 months.  O'Malley v Chito happened a full 7 months after that announcement.  They easily could've made O'Malley v sandhagen, but chose not to, and sandhagen incorporating wrestling into his game was very likely a part of why he was leapfrogged by Chito.", "label": 0}
{"text": "As believable as a Bob Sapp fight", "label": 0}
{"text": "Is explicitly refusing to do MMA the new MMA meta?", "label": 0}
{"text": "Illia decision mark my words", "label": 0}
{"text": "lmao you think im trying to say that she never got assaulted? jesus christ man", "label": 0}
{"text": "Pause suggests sexual innuendo, and in that context it looks bad.", "label": 0}
{"text": "\"you struggle against me\" x2\n\n\"I'm the best in the world\" x4+\n\n\"You're gonna have a hard time\" x3", "label": 0}
{"text": "You made this up, stop lying.", "label": 0}
{"text": "Peña is an absolute dog too. Not the best technique, gets by heart and some pretty nasty grappling", "label": 0}
{"text": "Merab just seems like such a nice guy and so does Volk", "label": 0}
{"text": "Every FW champ is now the GOAT", "label": 0}
{"text": "Just to correct you, there never was no marriage", "label": 0}
{"text": "People jumping to the steroids accusation whenever they see acne\n\nBro I needed to take accutane to get this shit off me it’s not always steroids 😭", "label": 0}
{"text": "This is one of the best names I've ever read", "label": 0}
{"text": "Crazy how Volk finished that fight, reigning down punches on Islam. What a fucking beast, going up in weight like that and giving Islam the biggest challenge he's had in years. Can't wait to see a rematch.", "label": 0}
{"text": "He’s clearly an actual fighting nerd. Sucks he doesn’t speak English too much. He seems to have a great mind for the sport.", "label": 0}
{"text": "That was awesome. Makes like merab even more", "label": 0}
{"text": "They are friends but as fighters they are too far apart in weight. The biggest guy in Islam/Khabib's team is Aliskerov.", "label": 0}
{"text": "It is but lowkey I would have folded his ass. Fuck outta here", "label": 0}
{"text": "Yoel is a olympic silver medalist on wrestling, but he did not use much wrestling on his mma carreer. Chimaev is a better MMA wrestler.", "label": 0}
{"text": "Imma have ta agree wit Kayla here", "label": 0}
{"text": "Statistically yes, it does.", "label": 0}
{"text": "Don't get the joke, this is Volk's 1st time there. 🤷", "label": 0}
{"text": "Did you not read the bit about horrible men trying to stop people coping? You just made the list.", "label": 0}
{"text": "I just spit my beer out on the way home from work.", "label": 0}
{"text": "Really great points. PFL's success is pretty important to the MMA ecosystem. \n\nIf there's no other real options for regional fighters it gives the UFC way too much power.", "label": 0}
{"text": "He's also just fighting someone he has a lot of respect for. I think he'll have the same energy once he's in the ring", "label": 0}
{"text": "Most friendly Topuria fan", "label": 0}
{"text": "Kid just doesn't want it.", "label": 0}
{"text": "He got 2 gift against max, I hope max can get his revenge.", "label": 0}
{"text": "Oh hey, so 5 days earlier than I said.  Thank you for reinforcing my point", "label": 0}
{"text": "If I remember correctly, he trains in Chechnya instead of Dagestan.", "label": 0}
{"text": "If i had a dollar for every time someone used the emmett fight to discredit topuria i'd probably have ten dollars which isnt a lot but its weird that it keeps happening", "label": 0}
{"text": "Rinat is fighting on the 1st fight of the early prelims? What are we doing man...", "label": 0}
{"text": "Yes he says dumb shit but literally 90% of fighters say nothing burgers in the build up of fights. Either saying to get eyes on the fight or saying what he needs to tell himself for confidence it's not something new or exclusive to Ilia he's saying almost identically the same things he's said to Alex that he's saying now to Max", "label": 0}
{"text": "Please Bobby! Get it done", "label": 0}
{"text": "Me too Kayla", "label": 0}
{"text": "No brother that's not how UFC work. These ''public'' weight in are fake. They already know if they made/missed weight, the weight ins are made in private back stage.", "label": 0}
{"text": "When I met her at UFC Fight Night in Duluth, GA, she was personable with the fans and this was after her knee surgery with TUF, I have a picture with her and she was really nice to everyone, I get how some people rub her the wrong way but my interaction with her she was really cool", "label": 0}
{"text": "Yeah he was injured for 9 months", "label": 0}
{"text": "We tried to tell Pena to stfu but she keeps saying stupid shit.", "label": 0}
{"text": "“Promoting” would mean her fights sell more than the average WMMA fight which isn’t true.\n\nTate Nunes 1M\nRousey Nunes 1.1M\nShevchenko Nunes 2 100k\nNunes Pennington 85k\nNunes Andrade 110k\nNunes Spencer 85k\nNunes Pena 95k\nNunes Pena 2 100k\n\nThey both aren’t draws and Pena def ain’t putting butts in seats. Her talking out of her ass with her delusional takes isn’t “promoting” anything.", "label": 0}
{"text": "It is kind of weird thinking about Izzy not fighting for a title.\n\n\nLike, that is how it should be right now but it's been so long ", "label": 0}
{"text": "She can rub me any way she wants as long as she shuts the fuck up", "label": 0}
{"text": "That happens in a sport where alex pereira is worshipped.", "label": 0}
{"text": "Annnnnnnnd I’m a fan.", "label": 0}
{"text": "Still in the denial stage, I see.", "label": 0}
{"text": "Pretty class", "label": 0}
{"text": "Even the people who would disagree with you on Ngannou not being a draw, wouldn't order his PPV lol.", "label": 0}
{"text": "\"I didn't want him but he shouldn't have left.\"\n\nOkay dingdong. This guy is so transparent.", "label": 0}
{"text": "everything. everything is to hate", "label": 0}
{"text": "Peña knows what’s she’s doing. She’s a boring fighter yet is one of the most talked about in WMMA.", "label": 0}
{"text": "Oh so this was too toxic for the MMA forum lol. For a bunch of manly men who want to protect the sanctity of the sport you come off as really catty about the stupidest shit. Chill nerd.", "label": 0}
{"text": "And merab throwing himself on the floor was a classy move, letting the kid shine.", "label": 0}
{"text": "Starting to ponder Max's cutting back to FW as a factor ?! He's looked rough @ times this week.\n\nMax looked great during his Gaethje LW camp & performed accordingly.", "label": 0}
{"text": "Toroputo is gonna be the punching bag on October 26 brotha", "label": 0}
{"text": "That absurd one hit knock out power really showed itself in that emmet fight, he got knocked out a total of 0 times, ilia’s power is so dangerous", "label": 0}
{"text": "I get disinterested in these fighters that don’t the know how to shut up when having a back and forth.", "label": 0}
{"text": "thank god. I moved to LA so it’s even earlier for me. Now I don’t have to miss it for plans I made saturday night", "label": 0}
{"text": "I like the person Merab so much more than his fights lol. He is probably one of the more entertaining fighters until he starts actually fighting. I want to be his biggest fan but his fighting style is not the most exciting IMO.", "label": 0}
{"text": "All I’m saying is that one hit knock out power ilia is known for really helped him knock out emmet right? Dude was knocked out like 20 times in that fight the ref just never called it", "label": 0}
{"text": "Fair enough I guess, but no way would Islam take that fight. He'd be stupid to take it when he himself has a legit case for a shot at 170 belt.", "label": 0}
{"text": "Topturo is gonna getta hurt real real bad ", "label": 0}
{"text": "Nobody wants to see imavov’s boring ass at the top, Caio Izzy is the fight to make", "label": 0}
{"text": "The sequel to “kid gets baseball to the stomach” in Happy Gilmore. I’m actually laughing out loud. Fuck that’s funny.", "label": 0}
{"text": "I can personally vouch", "label": 0}
{"text": "Dunking on a deaf man is easy that’s not even what I’m doing, I’m just pointing out how many times ilia hit emmet with that absurd one punch knockout power and yet never knocked him out. Emmet was so sloppy in those last 3 rounds throwing basically the same looping overhand or straight yet still he made it to a decision.\n\nWoof but that knockout power!", "label": 0}
{"text": "That’s the general gist I get from reading YouTube and Reddit comments about the UFC and MMA recently. People just start breaking their jaws sucking off upcoming fighters that are just alright. O Malley, khazmat, topuria.", "label": 0}
{"text": "Isnt he good friends with topuria? I highly doubt he would do that unless holloway takes the belt and even then I’m not sure if he would", "label": 0}
{"text": "Being a goofball is better than being an afterthought", "label": 0}
{"text": "Kind of insane that there is this but Kayla Harrison is making 135 and I have zero clue how.", "label": 0}
{"text": "It’s definitely gotten a lot better recently, but he still doesn’t have much of a presence online or in public consciousness in America.", "label": 0}
{"text": "No it isn't 10 pounds is nothing", "label": 0}
{"text": "I’m pretty sure he was never knocked out, despite the absurd one punch knockout power. He was in the fight for 5 rounds. Like he was in the cage, not knocked out. \n\nNo one brought up emmet winning rounds", "label": 0}
{"text": "He’s looked rough since the Ortega fight at FW", "label": 0}
{"text": "People do that? How", "label": 0}
{"text": "It’s been fun watching Caio over the years, awesome to see him moving up the ranks. Him and that other nutty fighting nerd Silva are must see TV", "label": 0}
{"text": "So. Y’all ain’t supposed to be friends", "label": 0}
{"text": "I don’t think O’Malley knows ilia at all to my knowledge. Also ilia is tight with merab so I doubt he would like Sean.", "label": 0}
{"text": "Thank you so much\n\nWanna play touch butt in the park later?", "label": 0}
{"text": "She won ultimate fighter. And they were assholes to her in that house for no reason. I’m a loyal fan so if I start off a fan, I’ll be a fan. I also seem to like people that everyone hates. People hate her and they don’t know why, just following the crowd. However, she do some cringeworthy shit. But no one’s perfect so I let it slide", "label": 0}
{"text": "He is fine. The PFL is not", "label": 0}
{"text": "absolute hero, I was gearing up for 8pm", "label": 0}
{"text": "Doesn't matter what's better. Imavov has 3 top 10 wins on his streak. Caio has 1 and it was Cannonier AFTER he lost to Imavov.", "label": 0}
{"text": "That's tradies acting", "label": 0}
{"text": "Don't be scared, homie", "label": 0}
{"text": "Haha same thing happened to me, nearly died", "label": 0}
{"text": "It’s not an unpopular opinion that max won the second fight, I thought he won the second fight 1,2,3 and so did most people at the time but people switch up. \n\nIt Doesn’t matter anyway since their third fight happened.", "label": 0}
{"text": "Why are you upset?\n\nHundreds of thousands of people buy PPVs. PPV bonus is the highest demonstration of value that the UFC gives fighters.", "label": 0}
{"text": "this is exactly it, like this shit is a job and dude wants money\n\nhow is that so hard for everyone to grasp?? Your risking your brain getting turned into pudding everytime u get in there, dude wants the easiest fights for the most $$ and he's smart by wanting so.", "label": 0}
{"text": "You guys will defend Merab in any situation.. That kid just humbled him on stage and you are saying he “Let” him smh", "label": 0}
{"text": "People who hold this opinion clearly don't follow the sport.", "label": 0}
{"text": "Exactly why this fight needs to happen.", "label": 0}
{"text": "Ksw and oktagon are both putting on big events and even ares is doing well, considering how new it is. \n\n\nCan't think of a better time for European promotions. ", "label": 0}
{"text": "they're right", "label": 0}
{"text": "Ez money right here. ", "label": 0}
{"text": "He skipped the line in boxing and didn't deserve it, now he wants to skip the line in kickboxing too?", "label": 0}
{"text": "Reminds me of when i forgot Usyk-Fury was in saudi and i missed it 😭😭", "label": 0}
{"text": "O shit I thought thought you were talking about merab moving to 145.", "label": 0}
{"text": "No I don’t know. You said. You said I’m funny. How am I funny? What the fuck is so funny about me, tell me!", "label": 0}
{"text": "Caio is a good fighter, and he's really good at studying his opponents and making gameplans. But coming from and Izzy hater, i feel like Izzy would propably KO or TKO him on the later rounds of win a UD", "label": 0}
{"text": "Have you not seen this sub fuming at Ilia's extremely minor trash talk?", "label": 0}
{"text": "what in the brain rot meme-ing for Dana’s nuts kind of post is this", "label": 0}
{"text": "The international stage doesn’t pay for pay per view, “we have Russian link brotha” is pretty much the standard across the world other than North America. (Huge generalization, I know)", "label": 0}
{"text": "Those are some very kind Hobbits.", "label": 0}
{"text": "Didn't you see he won tho? 👀", "label": 0}
{"text": "This is such a dumb take. It's like saying poatan dosent have one punch up power because khalil went 4 rounds with him and only got a tko stoppage. Khalil was never unconscious so alex is clearly not a knockout artist", "label": 0}
{"text": "Couldn't agree more, I sometimes wonder if it's just my personal bias, but he certainly seems a different man than the \"Pooh bear\" we both watched.", "label": 0}
{"text": "I want it real bad", "label": 0}
{"text": "I am sorry pal, but topurias technique is superior", "label": 0}
{"text": "I legit don’t care about this fight.", "label": 0}
{"text": "UFC stans laughing at PFL is like dropping $10 on a Big Mac meal and laughing cuz the Burger King down the street is empty.", "label": 0}
{"text": "Pena is the only female fighter worth talking about in that division.", "label": 0}
{"text": "Alex knows 5 words of English and is a mega star. Knocking people out matters more than anything else", "label": 0}
{"text": "EU bois, this is our time", "label": 0}
{"text": "Paige Van Zant has like six times the social media followers Alex Periera did when she was fighting on prelims.\n\nPVZ on prelims is six times the draw as double champ fighter of the year Alex Periera - you apparently.", "label": 0}
{"text": "Her determination and confidence has always been admirable. People also calling the Nunes win a fluke seem to be misunderstanding what a fluke win means and should know that you can’t call a largely one sided beat down a fluke. I also admire her for being the first mother (one that gave birth) to win a championship belt.\n\nCan she be annoyingly loud about how confident she is? Yes, but I think she proved why and did way better than anybody ever expected her to do.", "label": 0}
{"text": "Wouldn’t mind seeing Volk on the big screen", "label": 0}
{"text": "anytime you online weirdos like or dislike anything, the description of that bias is described through penis. don't talk about brain rot", "label": 0}
{"text": "I’m excited but I also know Max struggled to deal with Volks speed, and Ilia is maybe faster so I’m a bit worried for him", "label": 0}
{"text": "Keep comparing apples to oranges my dude have fun with the cope", "label": 0}
{"text": "Strange because when their promotion trailer was posted here it had an overwhelmingly positive reaction. UFC does do promotional videos like that. \n\n\nhttps://www.reddit.com/r/MMA/comments/1ftqklp/the_trailer_for_francis_ngannou_vs_renan_ferreira/\n\n\nPeople seem to think these smaller promotions can just beam the information into people's brains. If you don't follow their socials then you aren't going to see the promotion. ", "label": 0}
{"text": "Nah Volk won rounds 3,4,5 in the 2nd fight. Rewatch that 3rd round with the sound off, ignore the on-screen stats and bias commentary.", "label": 0}
{"text": "getting tribal and describing reality as \"stanning\" is a miserable perspective. in your genuinely awful comparison, where are MMA fans eating A5 Wagyu if the UFC is McDonald's?", "label": 0}
{"text": "He beat that man ragged lmao. Which could be worse tbh. Either way he’s powerful violent and game af to exchange", "label": 0}
{"text": "Merab is not gonna be happy lol", "label": 0}
{"text": "Bro how old are you?\n\nI csnt imagine dedicating the effort to pull up receipts over something some idiots said on the internet. \n\nLike seriously who actually gives a fuck?", "label": 0}
{"text": "\\> Amanda Nunes a loss when she was on top of her game\n\nI mean she literally wasn't on top of her game. It's been well reported on/written about, Amanda was in terrible shape for that fight, both her knees were fucked up to the extent that she could barely walk the day after training during camp. That was by miles the worst version of Amanda because of those issues\n\nAmanda actually on top of her game was in the rematch, where she decimated Peña 50-43.", "label": 0}
{"text": "That was probably the first and last PFL PPV I'll buy. Luckily, I split the cost with a buddy.", "label": 0}
{"text": "Merab is really looking bad with his recent Umar take.", "label": 0}
{"text": "Rumor has it he hurt his yadong in training", "label": 0}
{"text": "Try getting of your couch and get your fat ass to a gym. After some training you might have more respect or even understanding of what these guys do", "label": 0}
{"text": "This fight barely made sense, anything else is probably even worse. I doubt Yan will just pick up the phone for this one.", "label": 0}
{"text": "that is do to ufc can gwet away with mistakes compared to compiterors they can afford it, other pay more than get that is massive negative, issue if they don;t overpay they can't get big stars but if they don;t try to get them the is little chance of growth, this is the issue of MMA and Ufc monopoly", "label": 0}
{"text": "You aren’t wrong about him being powerful, violent  and game af to exchange with. I don’t think many people would argue that and I’m certainly not", "label": 0}
{"text": "Dvalishvili said he could fight in Nov, so he should be ready to take a fight right? I don't see why the UFC couldn't book them for Jan.", "label": 0}
{"text": "Hopefully they find a main event for that event.", "label": 0}
{"text": "yeah i think at his core he seems very anxious and tense during tough moments. i can’t blame him though, i’ve been there before games and matches that i knew would be tough. i feel like he talks like he does to stay in the game and stay confident.", "label": 0}
{"text": "I mean yes it does to an extent lol. The UFC makes matchups and gives dudes opportunities based on excitement level all the time.\n\nThey might still do Imavov vs Izzy next anyways, but if they opted for Caio instead it would hardly be the first time they prioritized an exciting matchup over merit.", "label": 0}
{"text": "False. R/mma freedom fighters stand with francis and are ready to take up arms against the evil emperor dana white.", "label": 0}
{"text": "considering 3 minutes in paint regarding a silly post on a slow-moving subreddit from only a week ago as an unimaginable effort is big snitching on yourself", "label": 0}
{"text": "I don’t even want to see that. I want to see Caio Borralho and Israel Adesanya using all of their skills. If I wanted to watch a boxing match, I’m not watching the UFC.", "label": 0}
{"text": "She made it to the top of her weight class won gold and lost to the literal GOAT.\nPeople hate her because she's cocky but how can you be mad at that when she was champion.", "label": 0}
{"text": "The rare UFC fighter confident enough to let a kid win on public.", "label": 0}
{"text": "Merab said he doesn't want to fight in January because of NYE and Georgian Christmas", "label": 0}
{"text": "Yeah cause it’s incredibly difficult to understand what one punch knockout power means. Right.", "label": 0}
{"text": "Source is dave meltzer? \nSo it's likely  about 70-100k buys\nIf he's saying 10k", "label": 0}
{"text": "Lol Max glazer? I favor Ilia in this fight. I didn’t mean it in the sense he landed a lucky punch. He was 4 months from getting brutally KO’d by Islam and didn’t look to be the same mentally even with his great poker face. Ilia probably still beats him but I think it would be drastically different fight.", "label": 0}
{"text": "He might be Islam fans. They are a bit delusional.", "label": 0}
{"text": "I see that. too bad the army lacks resources in a large variety of ways", "label": 0}
{"text": "UFC 312 would be roughly 5 months since Merab won the title. Totally reasonable turnaround time for him, and it is before Ramadan for Umar. \n\nThey should book that fight for that card, but Merab seems hellbent on ducking Umar.", "label": 0}
{"text": "I would say no excuses for Merab now if he wasn’t making plenty of excuses to not fight Umar.", "label": 0}
{"text": "So do it in February then for UFC 312", "label": 0}
{"text": "Oh I re read what you’re saying, one punch ko power doesn’t mean you’ll find the shot every single time, and that power may not even be enough to ko max either tbh. Immovable object vs unstoppable force type of thing", "label": 0}
{"text": "I heard Merab was looking for an opponent lol", "label": 0}
{"text": "Way more than I expected", "label": 0}
{"text": "Feel like I've been cockblocked from Umar/Merab and Umar/Song now. Dammit.", "label": 0}
{"text": "Nah just got more important things than remembering what some idiot said on reddit. Wouldn't have time to do anything else if I worried about that.", "label": 0}
{"text": "You think TikTok kids are paying for pay per views?", "label": 0}
{"text": "Bobby Knucks!!", "label": 0}
{"text": "Merab is ducking lol, idk how cope levels can get this high. Umar is the #1 contender (you know, after winning a #1 contender match) and Merab has done nothing but call other people out since he's won the title. He JUST said the other day to a fan that O'Malley deserves a title shot over Umar (he doesn't deserve one at all) and literally walked out of an interview months ago when they said \"you don't think Umar deserves a title shot?\" After Merab said \"what about Figgy?\" When they asked about Umar.", "label": 0}
{"text": "Do it", "label": 0}
{"text": "You spend an awful lot of time criticizing how other people spend their time on reddit for a guy who's above it all to begin with. I have a feeling the people who actually make meaningful decisions outside of their own lives don't have time to create memes to mock the failures of a fight card's PPV sales then talk about it afterwards.", "label": 0}
{"text": "Bantamweight is full of worthy opponents.", "label": 0}
{"text": "You’re the most rational commenter so far which I appreciate", "label": 0}
{"text": "You are correct about that", "label": 0}
{"text": "This is comical because his most recent excuse was \"he already has a fight booked, why are we talking about him!\"\n\nGonna get hit with the life union reverse card", "label": 0}
{"text": "He’s not that exciting or good tbh.", "label": 0}
{"text": "Ok", "label": 0}
{"text": "I kind of understand that he thinks Umar deserved it as he had to beat Aldo, Yan and Cejudo to get his shot, what has Umar done? He only beat Sandhagen, in Merab's eyes it would be unfair that he gets a shot after just that", "label": 0}
{"text": "you're not wrong, my friend. the hate-watching and clueless circlejerk this subreddit has become is hilarious though so it's less about one post and more about the overall sentiment in this place lately. the funniest part is they all continue to increase brand awareness for the company they claim to hate, and most of them are stealing from everyone anyway while grandstanding about what's morally best for the scene. it's an amazing case study on do-nothings finding meaning through performative do-nothing", "label": 0}
{"text": "Connor runs in…….Here kid…… get a sniff!", "label": 0}
{"text": "Same. She was an absolute beast in tuf and I've always followed her after that performance.", "label": 0}
{"text": "Nah, it is gonna be his 1st time!", "label": 0}
{"text": "Stand up guys man, you love to see that", "label": 0}
{"text": "Congrats you are officially a bogan", "label": 0}
{"text": "Fuck yeah, living on the west coast, this is awesome. I got so much shit to do Halloween weekend without wasting an entire night on this.", "label": 0}
{"text": "Source on that?  Sandhagen himself seemed pretty sure that it was his performance against Font that got him passed over:\n\n>During an interview on the [*JAXXON PODCAST*](https://www.youtube.com/@jaxxonpodcast), Sandhagen had this to say when asked why he thinks the UFC gave ‘Chito’ the title shot instead of him:\n\n>", "label": 0}
{"text": "He does kinda have a big head", "label": 0}
{"text": "But he’s calling out for an O’Malley rematch who is even more undeserving than Umar. At least Umar is coming off a win over Sandhagen and is undefeated. Merab has already dominated O’Malley.\n\nI think there are very few fighters deserving of a title shot at this point, Umar is probably the most worthy (and Sandhagen was before losing)", "label": 0}
{"text": "He didn't need to beat all those people, he didn't want to fight Aljo (understandably). He sat on his top contender rank.", "label": 0}
{"text": "love this guy\n\ncan't wait for this sub to be in shambles tomorrow", "label": 0}
{"text": "Understandable , I know for me I wanted to be excited for 3 fights. If they had Umar v A.J I would have got it. , the fight they built the whole LW GP around. The lack of advertising aside, with ONE pivoting away from MMA they have/had a great opportunity to grab some great fighters to fill out some divisions and  officially get ride of Bellator branding.\n\n\nSide note , I prefer  Bellator GP over PFL seasons, it's easier to follow and doesn't break up the whole flow of the promotion. If they got some ONE and RIZIN fighters and held a bantamweight tournament winner fights Mix, I would watch that or Anatoly v Francis , I'm in. ", "label": 0}
{"text": "I didn't realize they had a longer fasting period than ramadan. So he has to fast from mid Nov to the end of Dec. It's looking like the UFC will make a bullshit fight for him at the end of spring and then he fights early fall. Champions only get the opportunity to fight three times a year if the schedule needs it, if they have to reserve a title fight to make a PPV it can take awhile for them to get contenders their shot. Maybe they can make it by summer but if they're in need of title fights later in the year they start pushing fights back. There's a chance it gets put on a slow track for a fight in abu dahbi or saudi arabia.\n\nThrowing ramadan into this makes it pretty hard for Nurmagomedov to get this fight next unless he sits out for a year essentially. Sure glad we have Omalley orbiting the title picture fucking things up while we have two amazing fighters we could match up. This is what happens when names skip the line. If top fighters are going to have periods of religious ceremony maybe just maybe you try to plan around it and make the fights that need to be made. Even a minor injury could push that fight into 2025 if it can't be made anytime in the next 6 months.", "label": 0}
{"text": "Wagers thus far,,,\n\nWas going to go heavy-moderate on Max outright & inside the distance/TKO/KO but him cutting back to FW & looking rough resonates w/ my spidey senses. Going light-moderate.\n\nTaking Whitaker outright & inside the distance @ moderate.", "label": 0}
{"text": "Something ain't right if Yadong gets injured and the person most bummed out by it is Merab", "label": 0}
{"text": "People be ducking. We can look to O'Malleys title shot or so many others as precedent.", "label": 0}
{"text": "Goofball? She's delusional", "label": 0}
{"text": "WON posts fake numbers nowadays. Funny how they never have the UFC numbers for ESPN+ but magically have the PPV numbers for any other event on ESPN+ Looks like someone is to scared to be called out by Dana or UFC for making up numbers.", "label": 0}
{"text": "If merab isn’t interested I hope they find a good opponent for him.", "label": 0}
{"text": "Izzy has one finish after the second round in the UFC, and thats from weightdrained Peirera. I think he has a good chance at a UD tough, if the 100+ combat matches havent caught up with him", "label": 0}
{"text": "Oh shit that was epic stare down", "label": 0}
{"text": "They come from different sides of the same mountain", "label": 0}
{"text": "This is such a gay thing to post haha", "label": 0}
{"text": "If this is true the entire division should just turn down a fight with Umar if offered and force the UFC to let him fight Merab.", "label": 0}
{"text": "You wish ;)", "label": 0}
{"text": "This is high and the low we've had.  We'll be watching this clip and be sad about it 10 years from now.", "label": 0}
{"text": "I would have double that if i was paid for “first ten seconds”, or quadruple for “we gonna find out”", "label": 0}
{"text": "Not right now. \n#1 O’malley- out for a while cause of hip surgery \n#3 Yan - is already booked to fight #5 figgy \n#4 Sandhagen - already beat him \n#6 chito - coming off a loss to figgy, would make 0 sense \n#7 Cejudo - is planning on moving down or getting a big money fight. they’re friends and won’t fight each other \n#8 Song Yadong - is injured \n#9 Rob Font - I guess this could happen ? but rob font being in a title eliminator in 2024/5 is interesting \n#10 Bautista - this one could also happen but I don’t think fans want him in a title eliminator after his fight with Aldo", "label": 0}
{"text": "Could you imagine the reverse? \n\n\n\"I promise to pull guard and not throw a single punch\"", "label": 0}
{"text": "Heads up read the fucking times. This card is on tomorrow morning don't miss it", "label": 0}
{"text": "I have no idea why the font size tripled", "label": 0}
{"text": "Again in his opinion but he understands the ufc makes the fight not him at the end of the day", "label": 0}
{"text": "Yeah, izzy is not a finisher. But I think he'd drag Caio to a very boring decision, and maybe take out his mobility with leg kicks and that might open for a KO, even tho I don't really trust izzy to get the KO I think it's possible", "label": 0}
{"text": "His MMA fighting interview is straight horse shit. It’s a business guy trying to sell mma not make it. We use ai to look at free agents, our metrics are xyz. But meanwhile can’t name a favorite mma fight because it’s work. He shut down One championship style - different combat sports fights. But that’s the smartest thing they can do. You’re a professional fighters league. Not a professional mma league. You should put on anything you can for attention, stop having bullshit Ammy fights on your card and build a roster", "label": 0}
{"text": "Merab’s quote from today’s MMA hour show: “I personally will help UFC find replacement for Song since dis Umar needs to prove himself. Maybe he fight O’Malley next? Then I fight O’Malley since he deserves rematch. I finish him this time. After, we’ll see if Umar is next if he prove himself. I’ll fight whoever the UFC wants”", "label": 0}
{"text": "He could fight against Sean in Nov, since he already had a camp dedicated to Sean's style and both of them would have same notice time. It does not mean that he will be ready for everyone. Obviously he needs a dedicated, proper camp for Umar.", "label": 0}
{"text": "Ah yeah, not looking good for Umar", "label": 0}
{"text": "Really? Over DDP, Strickland, Rob or Khamzat?", "label": 0}
{"text": "idk if he has the clear standing advantage but imo he'll outwrestle orolbai pretty easily", "label": 0}
{"text": "Umar vs Chito? Not like that matchup makes sense but it might be a little better than Song since he’s higher ranked? To be clear, Umar should be fighting for the title.", "label": 0}
{"text": "Idk I think he’s a contender, but it’s heavily dependent on the matchup, Strickland already beat him pretty convincingly so if he beats Dricus Imavov may have a delayed road to the title", "label": 0}
{"text": "Decisionbot Volk vs Holloway 2", "label": 0}
{"text": "That date also works. The UFC have a reputation that has people expecting that they can make the fight in these situations. I don't really understand why though, it hasn't been since the late 2000s or early 10s that they kept a schedule like that. Things are very different with ESPN and they do not make the best fights as frequently as they did in that time. I don't think there will even be an attempt by the UFC for that date.", "label": 0}
{"text": "[**ALEXANDER VOLKANOVSKI defeats MAX HOLLOWAY** (*unanimous decision*)](http://mmadecisions.com/decision/10781/fight)\n\n^(UFC 245: Usman vs. Covington — December 14, 2019)\n\nROUND|Volkanovski|Holloway||Volkanovski|Holloway||Volkanovski|Holloway\n:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:\n1|10|9||10|9||10|9\n2|9|10||10|9||10|9\n3|10|9||10|9||10|9\n4|10|9||10|9||9|10\n5|9|10||10|9||9|10\n**TOTAL**|**48**|**47**||**50**|**45**||**48**|**47**\n\n*^(Judges, in order: Michael Bell, Junichiro Kamijo, Chris Lee.)*\n*^(Summoned by coulduseafriend99.)*\n\n**MEDIA MEMBER SCORES**\n\n- **1/19** people scored it **50-45 Volkanovski**.\n- **1/19** people scored it **49-45 Volkanovski**.\n- **10/19** people scored it **49-46 Volkanovski**.\n- **7/19** people scored it **48-47 Volkanovski**.\n\nAvg. media score: **48.7-46.3 Volkanovski** (*high certainty^[[1]](https://redd.it/9p4xc7)*).", "label": 0}
{"text": "[**ALEXANDER VOLKANOVSKI defeats MAX HOLLOWAY** (*split decision*)](http://mmadecisions.com/decision/11126/fight)\n\n^(UFC 251: Usman vs. Masvidal — July 12, 2020)\n\nROUND|Volkanovski|Holloway||Volkanovski|Holloway||Volkanovski|Holloway\n:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:\n1|9|10||9|10||9|10\n2|9|10||9|10||9|10\n3|10|9||10|9||10|9\n4|10|9||10|9||10|9\n5|10|9||9|10||10|9\n**TOTAL**|**48**|**47**||**47**|**48**||**48**|**47**\n\n*^(Judges, in order: Mark Collett, David Lethaby, Clemens Werner.)*\n*^(Summoned by coulduseafriend99.)*\n\n**MEDIA MEMBER SCORES**\n\n- **9/27** people scored it **48-47 Volkanovski**.\n- **18/27** people scored it **47-48 Holloway**.\n\nAvg. media score: **47.3-47.7 Holloway** (*moderate certainty^[[1]](https://redd.it/9p4xc7)*).", "label": 0}
{"text": "Which is what the division will be after Kayla takes the belt from her. That’s why the ufc wanted Pena to get the title shot in the first place. People hate Pena but more people would be interested in seeing Kayla  Pena than seeing Kayla beat Raquel.", "label": 0}
{"text": "He’s been fluent in English since before he even joined the UFC brother, what are you talking about lmao. Just check his earliest UFC octagon interview", "label": 0}
{"text": "I forgot about that, seems like Merab is fired up over Umar not deserving it and the fan reactions... Kinda building the hype for this fight.", "label": 0}
{"text": "Just wait khamzat is going to pull out and it's going to be a snoozer card of decisions and cage humping", "label": 0}
{"text": "All acne is steroids, that 14 year old is clearly on Tren.", "label": 0}
{"text": "I like merab but what he's doing now is embarrassing \n\nI hope ufc force merab to fight Umar, wrestling and cardio wise it's a fantastic fight.", "label": 0}
{"text": "😭😭😭", "label": 0}
{"text": "> yet is one of the most talked about in WMMA.\n\nNot really", "label": 0}
{"text": "Donn Davis lol. That’s why.", "label": 0}
{"text": "He is all in this fight, should be a good fight!", "label": 0}
{"text": "Ok BUT Jon Jones is the greatest fighter of all time", "label": 0}
{"text": "I think they kind of know Omalley might never be able to earn a title shot in the field of BWs, Sandhagen, Yan, Dvalishvili or Nurmagomedov could all put a stop to that. They might want to get what they can from him on PPV instead. They very well could also throw him a trilogy with Vera or something else for an easy title shot though. Hopefully they just make the right fights and if they're going to force Omalley into it they'll do it after contenders are clear.", "label": 0}
{"text": "I thought She forced her shitty personality, then I saw that video were she got arrested and was “oh she’s that kinda person.”", "label": 0}
{"text": "Happy that it's at a reasonable time... but it's now a PPV :(", "label": 0}
{"text": "Lookin like the kid version of Darrill Schoonover", "label": 0}
{"text": "OP is riffing off Kayla saying \"rubs me the wrong way\". By saying pause he's saying that Kayla's phrasing can be misconstrued to be sexual", "label": 0}
{"text": "Sad, im 177cm 73kg athletic\n\nSucks that all of the baggy clothes make me look like a toddler, a skinny 190m dude could rock these easily, and it would look flattering.", "label": 0}
{"text": "I'm actually tired of this Umar nonstop spam on this sub, twitter and every place. \n\nMerab just became a champ, if he wants to fight immediately, he can, if he doesnt then Umar PLEASE STOP FUICKING CRYING.. this is literally becoming Jamahall Hill / Ankalaev level of cop out", "label": 0}
{"text": "I lost it when I saw this comment lol", "label": 0}
{"text": "As someone that lives in the same state she’s from and has multiple friends that train out of Spokane, I can confirm she absolutely is just an awful person to be around.", "label": 0}
{"text": "Ok, pleae explain this meme to me", "label": 0}
{"text": "RDA-Luque was a huge red flag for RDA", "label": 0}
{"text": "I absolutely mentally read this in *that* romcom trailer voice lol", "label": 0}
{"text": "Lol Francis always knew his worth, why do you think Dana and ufc suits were always butting heads with him? And btw Randy never mentored him, he said the opposite (https://www.si.com/fannation/wrestling/mma/randy-couture-on-francis-ngannou-hes-standing-up-for-fighters) so don't know who came up with that. Behind the scenes it was Francis and his manager Marquel doing work. Both of them pretty much risked their whole careers by refusing to cave to UFC machine's financial intimidation and smear campaigns", "label": 0}
{"text": "Sean got one duck. He decided to fight Cheeto instead of Merab first\n\nLooks like Merab is about to be given a duck. Hell be given the rematch with Sean before the fight with Umar\n\n  \nLooks like Danas got a new rule for UFC champs. You get one duck.\n\nAlex got one too lol. Ducked Ankalaev for Khalil", "label": 0}
{"text": "> he can’t grapple at all\n\nLOL.\n\nCan you give me an example where an opponent of Holloway’s has ever had more than, say 90 seconds of total control time over him? Just because he doesn’t show his wrestling much doesn’t mean he’s bad at it. He took Yair down with ease, and literally no one has managed to take and hold him down with any significance. \n\n> i don’t think he has a front snap kick or wheel kick, frankly, either \n\nSo do you want me to amend this by saying “he has every strike in the book besides a front snap kick or wheel kick”, or do I have to literally count every technique anyone has ever thrown?", "label": 0}
{"text": "El classico being on at the same time as the first Spanish UFC champ defends his title is very annoying. \n\nAlthough I read somewhere the main event won’t start until 23:00 to ensure Spanish fans can watch both.", "label": 0}
{"text": "Khamzat gets into an altercation with Topuria. Somehow catches the Spanish flu. Hospitalised.", "label": 0}
{"text": "The guy loses a child and this 55 year old man doesn’t take a break from shitting on him, for no reason other than pure spite. Dana’s treatment of Francis(who’s been nothing but a gentleman) is a new low for even Dana white.", "label": 0}
{"text": "I'm saying, I think Imavov vs Izzy is a good fight to make. I think a win over Izzy definitely puts him up there with Rob and Khamzat.", "label": 0}
{"text": "When was the last time anyone in the division held any relevance before Pena beat Nunes ?", "label": 0}
{"text": "This explains why Merab is going back to saying Umar doesnt deserve the shot.", "label": 0}
{"text": "Dana is that guy at work who talks about all these plans way after the fact like it's a flex and everyone around him is like sure buddy, sure.\n\nYou were going to cut this guy after losing 2 in a row yet you kept Sam Alvey around and are still keeping Tony Ferguson around as they threaten double digit loss streaks. Sure you were bud, sure you were.", "label": 0}
{"text": "Merab is not the matchmaker", "label": 0}
{"text": "Putting the number/pound symbol at the beginning of a new line increases the font.", "label": 0}
{"text": "Unfortunately probably not. Even though it's only 5 fights on the main card, that'll probably last closer to 3 hours than 2. From my experience, UFC broadcasts measure out 30-minute segments for 3 round fights and 45-minute segments for 5 rounds, and they basically never deviate from this schedule even during PPV\n\nI'd expect you to be able to watch the start of the co-main, but you probably won't be able to see the entire fight unless it ends with an early finish. There's basically no chance you'll be able to see the main event live, sorry man", "label": 0}
{"text": "Fans might appreciate watching Bautista receive a spanking for that very reason.", "label": 0}
{"text": "Haha this was awesome, very much a funny dude. Some of his other shorts are hilarious as well. Like the one where he is finishing concrete.", "label": 0}
{"text": "Bullshit.  Totally staged!", "label": 0}
{"text": "This card is also much bigger than most of the other cards he's been on. Been a while since we've had a card as stacked as this one, and Max is coming straight off of a viral knockout, fighting an international star who's bringing a bunch of new journalists to the UFC. \n\n\nLots of shit lined up here to put much more of a spotlight on Max, I don't think he really had much of a choice as to whether or not to be more talkative than usual", "label": 0}
{"text": "Merab isn't going to fast lol. He said he wanted to spend time with his family during that month. Whether that's as valid as a reason as Ramadan, I'll let other people decide.\n\nBest course of action would be to book Umar vs Merab for February. Probably Sydney. There's also an event in Riyadh but unlikely because Merab will probably refuse and it's a Fight Night anyway. \n\nUmar said he doesn't really want to wait but I think he'll agree if it's a title shot against Merab. I think he publicly said so too.", "label": 0}
{"text": "Well he's not. Volknwas piecing him up before he got trapped against the cage", "label": 0}
{"text": "r/wholesomeasfuck", "label": 0}
{"text": "Fucking boring. Should have stood and banged it out.", "label": 0}
{"text": "He looked just like this against Costa and Aliskerov, it's not just for Khamzat", "label": 0}
{"text": "Umar v. Sandhagen 2 it is.", "label": 0}
{"text": "you can also draw the blinds and change your clocks from 2pm ET to 10pm ET for normalcy if you're strange", "label": 0}
{"text": "It’s early in the day if you live in the states. I’ll be watching this at a Halloween party haha", "label": 0}
{"text": "Not great optics that's for sure.\n\nImagine if Merab pulls an Aljo and has to get surgery immediately.", "label": 0}
{"text": "Brother, you're thinking of the ceremonial weigh in, that is the fake one. They do verify their weight on the digital scale in the back before the real weigh in, but the real weigh in is on the mechanical scale. \n\nDo you remember when Chucky got stripped of his title? He made weight on the digital scale in the back, then missed on the mechanical scale, because the digital one was not properly calibrated.", "label": 0}
{"text": "I think Volk knows that he’s more or less on his way out. Why stress if you know you’re not necessarily at your peak anymore?", "label": 0}
{"text": "Vacate the title? I thought he got stripped when Dana realized that Volk was walking around at 140 kilos and wasn't going to be able to make weight anytime soon", "label": 0}
{"text": "Something bout him just puts a smile on my face", "label": 0}
{"text": "He knocked out Alex in the second round?", "label": 0}
{"text": "This motherfucker, we almost had him!", "label": 0}
{"text": "Like the beers my girlfriend pours", "label": 0}
{"text": "No worries, I appreciate the insight brother! I’ll watch what I can!", "label": 0}
{"text": "Some do a nativity fast which I assumed would have been the reason for setting aside two months you won't fight because you'd need to be ready for a fight camp. Not going into fight camp right after a 40 day fast. I guess I assumed too much looking for a reason he couldn't fight rather than assuming he just didn't want to.", "label": 0}
{"text": "Not my champ", "label": 0}
{"text": "Yea I’ve got downvoted for saying it before but Dana letting Francis walk was a good business move. His boxing ppvs didn’t make shit, and ultimately that’s what Francis wanted to do. Francis got his money tho", "label": 0}
{"text": "Yeah aren't most PPVs sold in bars and places like that? I can't imagine a lot of people buying a PPV at home...", "label": 0}
{"text": "Umar hasn't been tested", "label": 0}
{"text": "They admitted they have less than 5% of market share in Gerard lawsuit. I'm sure Rizin have a bigger market share than that.", "label": 0}
{"text": "Francis was a draw but hard to sell a fight from someone who just got slept and the only highlights you can show are from 10 years ago", "label": 0}
{"text": "If anyone hast already, go watch izzys boxing bouts.", "label": 0}
{"text": "i keep flip flopping on my whittaker chimaev pick every hour, might be the most indecisive ive ever been on a pick", "label": 0}
{"text": "joe pesci in goodfellas", "label": 0}
{"text": "The only rule the UFC has is make the fight that they think will generate the most interest. It lines up with all 3 of the examples you gave.", "label": 0}
{"text": "Francis didn’t do it for himself, he said he wanted better money for everyone. Instead he’s going to bankrupt an entire organisation and a lot of people will be out of work. What a guy!", "label": 0}
{"text": "Merab’s first ever fight as a pro was in January so I’m not so sure he cares all that much lol. But regardless there’s literally any other day from November thru February where they both are open.", "label": 0}
{"text": "It does, but as fans it’s more fun rooting for the fighters who we like as a fighter AND as a person. People like Alex as a person even though he doesn’t speak English. Fans love ilia as a fighter, but he doesn’t do much to make himself likable as a person.", "label": 0}
{"text": "I don’t think Merab will ever be in a huge fight. ", "label": 0}
{"text": "think so too... only 2 real options here with merab or him imo.", "label": 0}
{"text": "Where are you getting 95k for Nunes Pena? Charles-Poirier headlined that one, no way that PPV only did 95k?", "label": 0}
{"text": "Cause that's who the UFC offered him? What about that is so hard to understand? \n\nThe UFC is pissed at Ankalaev, and is making him jump through an extra hoop to get his shot. The UFC has made it very publicly clear that they were not happy with him after the Jan and Walker fights.", "label": 0}
{"text": "This might be the most wholesome moment in MMA?", "label": 0}
{"text": "And he isn’t always ready because if he was always ready he’d fight in March. Loser.", "label": 0}
{"text": "Super intriguing guy. I remember his first like three fights were all super different looks in terms of the style he employed. \n\nI’d like to see him do analyst work if he keeps up the hype.", "label": 0}
{"text": "That's kinda what I'm thinking too. Odds for KO in first second and third are all pretty damn good", "label": 0}
{"text": "Line up. She’s insufferable.", "label": 0}
{"text": "Caios has Imavovs best win way more convincingly than Imavov.\n\nImavov won on a bad stoppage and on cards he was down. Caio almost finished him and was in no danger on cards.", "label": 0}
{"text": "I agree", "label": 0}
{"text": "When asked about the young boy's impressive performance...\n\nDana: \"Don't worry, we're going to take care of the kid\" ...maybe.", "label": 0}
{"text": "Sounds like AEW numbers lol", "label": 0}
{"text": "Nothing against Chito but that would be brutal for his career. He'd be 0-3 and 1-4.", "label": 0}
{"text": "That's why no one will remember his name", "label": 0}
{"text": "Thanks for admitting you don’t understand mma at all lmao", "label": 0}
{"text": "At the end of the day, it is what it is, and we gonna find out October 26th.", "label": 0}
{"text": "Love when Volk does these kinds of skits. Seems like it comes natural to him as well. The old man volk skit was top tier.", "label": 0}
{"text": "Yeah Gastelum's was bullshit.", "label": 0}
{"text": "Really? I find she gives 100% on the head 😃", "label": 0}
{"text": "Any idea for drinking games for fights?\n\nA couple random ones i have: \n\nif theres a finish, finish your drink\n\nEvery dick kick or eye poke, drink\n\nKnockdown, large sip\n\nFirst round finish, take a shot", "label": 0}
{"text": "Romero vs Costa delivered ", "label": 0}
{"text": ">posted here it had an overwhelmingly positive reaction\n\nYou mean the sub that actively clowns anyone who buys PPVs and acts like pirating is taking the moral high ground over Dana White?\n\nJokes aside I watched the trailer, was intrigued, and was mostly excited to watch a spoiler the morning after. I'm willing to buy good cards, PFL just doesn't produce them.", "label": 0}
{"text": "Telemundo novella trash talk", "label": 0}
{"text": "Caralho and porra", "label": 0}
{"text": "the kid would have won via 12-6 elbows", "label": 0}
{"text": "Might have to use these", "label": 0}
{"text": "It's his ability to chain wrestle! Once he gets ahold of you, it's hard to get him off of you. Look at the Kevin Holland fight, for example", "label": 0}
{"text": "On Instagram, Song Yadong said let's fight Jan 18th, and Umar said \"sounds good\"", "label": 0}
{"text": "You can start your weight cut earlier to make it longer if you want to. You can't fight later to rehydrate longer.", "label": 0}
{"text": "One just fought so I would hope she was talked about more recently.", "label": 0}
{"text": "Silva is much watch.\n\nHe's such a terror", "label": 0}
{"text": "No way I gotta hold myself back from putting my all into leg kicking my 4 year old sometimes lmao. You're right I feel very reassured lolll", "label": 0}
{"text": "Even after Weili fought in April, talk of her died out really quick compared to how much Peña gets brought up.", "label": 0}
{"text": "The difference is nobody's asking Merab to save the November card, before DC/Lewis was booked that card was going to have a Valentina title defense whereas 309 has Jon vs Stipe, it's not a great card but it doesn't need a new main event. The Suga rematch is not anything the UFC has offered, Merab and O'Malley are the only ones calling for it, even though nobody is interested in the fight", "label": 0}
{"text": "Are you a bot", "label": 0}
{"text": "Jones didn’t lose to Reyes.", "label": 0}
{"text": "Toegan's hyperbole is unmatched.", "label": 0}
{"text": "5 months is still a relatively fast turnaround\n\nI think it's fair for Merab to want more time than that, as long as he doesn't insist on fighting only in March", "label": 0}
{"text": "Maybe but on that note, that was the start of the end for my love for the UFC. That's when it became clear that the UFC wasn't really a sport per say but an entertainment programme first and a sport second. \n\nAt that point going forward it was about matching fighters for entertainment rather than putting the best against the best. \n\nI always admired the UFC for having the balls to put fighters against each other who deserved the fight or was deserving of the fight.\n\nUnlike boxing where all it ever seems to be is ducking the better opponents to make your record look better or if the money wasn't right they would never fight. Due to so many factors other than just the fighters. \n\nThen it seem to change. I mean yes there are occasions where this doesn't happen, but Dana has become the guy who would rather put entertainment first than the actual sport.\n\nMaybe I'm wrong but that's how I feel about the UFC these days. \n\nEsp when you had mighty mouse who's probably one of the greatest fighters ever to fight in a cage and Dana had 0 respect for him by the end.", "label": 0}
{"text": "So someone else can get the title fight?", "label": 0}
{"text": "Bro thinks I’m a makhachev fan 🤣 Nah I just hate volk", "label": 0}
{"text": "Where are the 10,000 people that told me last year that Ngannou leaving the UFC was GOOD for MMA?", "label": 0}
{"text": "That's wild. When I asked her for an autograph at a bar she just kicked me in the nuts. ", "label": 0}
{"text": "Ngannou just aint a drawl b", "label": 0}
{"text": "nah, they held that in Saudi Arabia, the Saudis alone probably covered all their purses and made them a nice little pay day outside of ppv", "label": 0}
{"text": "The best thing about Bobby is he says this and actually means it from his end.", "label": 0}
{"text": "the reaper is coming to collect!", "label": 0}
{"text": "It’s a competitive division. Even Yan was 0-3 till his last fight. Chito’s slow style just isn’t a great idea in this division.", "label": 0}
{"text": "I’m not saying your point isn’t valid. I just think with science there’s multiple approaches that may work for multiple people. A slower paced weight cut might just be better for Khamzat right now", "label": 0}
{"text": "It sounded like he dropped a \"hard work\" in there and it's like bro why are you telling Max about hard work during your face off?", "label": 0}
{"text": "Lol obligatory merabs burner", "label": 0}
{"text": "Same", "label": 0}
{"text": "Sandhagen's losses in the last few years before losing tp Nurmagomedov: \n\n- Dillashaw, who got a title shot off his win over Sandhagen.\n\n- Yan, in a match for the championship (interim).\n\n- Sterling, who got a titleshot with his win over Sandhagen.\n\n...I say to Dvalishvili, indeed beating Sandhagen has historically been a path to the title.", "label": 0}
{"text": "This fight falling through definitely puts more pressure on Merab too. Fine you dont want to fight before December (after saying Nov is fine for Omalley) well you have Jan and Feb now, lets see if he keeps trying to duck", "label": 0}
{"text": "Dana is so bitter about Francis that it’s hilarious", "label": 0}
{"text": "Man if he’d just yeeted merab with a massive duplex I’d have died", "label": 0}
{"text": "Merab played himself, in the fan Q&A in Abu Dhabi he claimed the reason he's not fighting Umar is he accepted this fight with Song. Now that's off, he has the chance to do what's right, instead of begging for the undeserved O'Malley rematch.", "label": 0}
{"text": "I am sure there are some conversations going on behind the scenes with the higher ups.", "label": 0}
{"text": "I mean Ilia is dead as well. ", "label": 0}
{"text": "\"I'll fight anybody\"\n\n\"Okay\"\n\n\"No, not you\"", "label": 0}
{"text": "This will never not be funny to me. We need to get Herb Dean in a strip club.", "label": 0}
{"text": "As another astute redditor put it \"quack quack quack quack\"", "label": 0}
{"text": "Ngannou said on a podcast interview that he was making $100k. \n\nSurely, $100k is more than $10 million, right?", "label": 0}
{"text": "Imamov is a fucking striker, Caio is fucking not.\n\nStop defending Izzy. Have him fight Caio.", "label": 0}
{"text": "And the UFC still owes him $$$ for unpaid.", "label": 0}
{"text": "hahahahah this shit is even funnier I swear", "label": 0}
{"text": "As we say in my language when you think of something too late: I just received a fax.\n\nWhen I'm rolling with dudes that are significantly bigger or I just know are much better than me, I'm definitely holding back with my power when going for submissions because I'm afraid that I'll do it way too quickly and I'll hit them by accident. I just know that I'll be too anxious to do it and that if I'm not quick they'll power out of it", "label": 0}
{"text": "Thats crazy. She asked me for a autograph once so I kicked her in the nuts.", "label": 0}
{"text": "Umar literally doesn't deserve a title fight, I know you guys are used to your guys getting undeserved shots and extra weigh in windows and scale shenanigans, but it's bullshit.", "label": 0}
{"text": "They all know this but are playing dumb the dagastani fanbase is by far the worst in the sport.", "label": 0}
{"text": "Even if nowadays that’s what they are doing, the last almost 2 decades they haven’t been. So most of these guys who’ve been around 5+ years have basically zero natural T and would be on Trt their entire lives after their career.", "label": 0}
{"text": "Maybe they meant more than 4! In the springtime! Under a crescent moon! Bet you can't do that.", "label": 0}
{"text": "bro wanted his points known 😳", "label": 0}
{"text": "Khamzat has opened every ufc fight by immediately rushing in and shooting or immediately rushing in and throwing a right hand. Eventually someone is going to knock him out very badly.", "label": 0}
{"text": "Topuria‘s wife looks like her job is tables", "label": 0}
{"text": "He deserved a rematch and I will never forgive UFC for how quickly they threw Aldo in the trash", "label": 0}
{"text": "Oh shit, that's from Fear dude. Marky mark", "label": 0}
{"text": "What is a Georgian Christmas?", "label": 0}
{"text": "We're going in circles here. You can go as slow as you want by starting earlier. You cannot rehydrate slow by fighting later. Hence, you adjust your timetable on the front because you can't crunch it at the back.\n\nCutting time (0-inf) / weigh in / rehydrating time (34-36h)", "label": 0}
{"text": "Nah it'll be 50/50, Volk has gained a lot of new fans since then", "label": 0}
{"text": "[Here you go](https://imgur.com/gallery/cOFz367/comment/491819514)", "label": 0}
{"text": "Ilia Topturo", "label": 0}
{"text": "And they'll crawl into those bloody knuckles, man, I've seen it before. They can make a man insane. This is biological warfare the likes of which we have never seen before in the UFC. Now we're gonna give a shout out to our sponsors P3 Protein Packs.", "label": 0}
{"text": "It's pregame fight trash talk, to me this is like discussing wrestling promos. I don't think either of them mean half of what they're saying, and it doesn't matter. But I still think what Max said is a good dig at Josh in a WWE storyline kinda way.", "label": 0}
{"text": "Chito also has shit defensive wrestling which you don't want against Umar", "label": 0}
{"text": "That’s you admitting you are a casual", "label": 0}
{"text": "The flair bet should be acknowledged to count.", "label": 0}
{"text": "I love the: 5 sentences explaining why im not going to fight him and then 1 sentence saying it's not my decision \n\nLike you're ducking bro stop quacking we get it", "label": 0}
{"text": "If figuereido beats yan he’s stealing that “sure number 1 contender” label that umar is lightly grasping onto. Wouldn’t be surprised", "label": 0}
{"text": "the 🥚👋", "label": 0}
{"text": "Five years of title fights, insane record. Then you have someone like Bones who such a huge percentage of the fan base has never seen fighting for a non title fight.", "label": 0}
{"text": "Pena said one thing that I've ever found funny:\n\n\"These 145ers are fat bitches who can't make 135!\"\n\nSomething like that.", "label": 0}
{"text": "who you talkin to?", "label": 0}
{"text": "Is there any reason he has not to fight him December/January... Hell even February isn't too far", "label": 0}
{"text": "How much more English do you want him to speak? The guy even does commentary in English for LFA transmissions", "label": 0}
{"text": "10-Deuce off suit.  😎", "label": 0}
{"text": "TIL thanks", "label": 0}
{"text": "King of Beach", "label": 0}
{"text": "They’re probably ducking this post and going back to delete their comment history", "label": 0}
{"text": "It seems the way they're planning on making some money is to eventually fleece some even stupider investors", "label": 0}
{"text": "Which Silva?", "label": 0}
{"text": "Merab realised what he just said then backtracked so fast! Quack quack", "label": 0}
{"text": "Jean", "label": 0}
{"text": "Cut to Dana trashing the kid then saying Jon Jones is the best fighter ever.", "label": 0}
{"text": "You'd need to confirm the bet with a comment for it to actually count.", "label": 0}
{"text": "yup, that's what I thought too, post-USADA Bobby Knuckles", "label": 0}
{"text": "I caught it on tik tok live! ", "label": 0}
{"text": "His shit talk is pretty minor yet for some reason this sub is absolutely fuming when he talks shit. It's so weird. He's very respectful to these guys in person, he's just talking shit to sell a fight.", "label": 0}
{"text": "Why? Dazn is terrible at streaming. ESPN has always been perfect for me ", "label": 0}
{"text": "Only other product being what?", "label": 0}
{"text": "There are 2", "label": 0}
{"text": "I guess if it worked once, why not? Step right up, ladies and gentleman, and own a piece of the future...", "label": 0}
{"text": "These scales are intensely accurate. ", "label": 0}
{"text": "Because he didn’t cut weight lol. Cheaters gonna cheat ", "label": 0}
{"text": "literal killer, this is the type of dude they used to send in to fight lions", "label": 0}
{"text": "At this point I'm excited when I see ANY fight nerd on a card. All of them are good. Favorite patch of up and comers.", "label": 0}
{"text": "He was telling DC he went heavy on the wrestling this camp & feels really strong for what that's worth.", "label": 0}
{"text": "Ilia gonna starch him 🤷‍♂️ Be ready to see the Hawaiian sensation KO’d for the 1st time. Dont @me!🥊💯🚨🔥", "label": 0}
{"text": "She didn’t fight for like 3 years. Coming of the Amanda win she was pretty popular.", "label": 0}
{"text": "Sure you can’t perform at the top level a month after a 4 round loss where you got rocked badly \n\nNo training camp either. \n\nCannonier looked quite a bit better against Imavov", "label": 0}
{"text": "I think European MMA organizations will also blossom once the Ukrainian War is over in that they will probably bring in Russian fighters.", "label": 0}
{"text": ">a month after\n\nEarly June to end August is literally closer to three months than one month.", "label": 0}
{"text": "There’s a huge part of the fan base that hasn’t seen Jones fight at all besides the gane fight", "label": 0}
{"text": "I really hope he smashes khamzat", "label": 0}
{"text": "Why is it 5 rounds?", "label": 0}
{"text": "Idk I felt like his reasoning was he'd need more time to prepare for umar but he acts weird every time umar gets brought up", "label": 0}
{"text": "Yep. That’s pretty much how he does it every time lol. But totally agreed it’s gonna depend on how Rob counters or weathers that initial storm. Rob can be explosive too, I have faith. I don’t dislike Chimaev, but I can’t not back my boy Bobby Knucks.", "label": 0}
{"text": "Dare I say he's better than Sudalaev? If you look at his weight class, Sidakov division is m the most stacked division. He'd win even more if Russia wasn't sanctioned. And He's been consistently better than Burroughs and Dake", "label": 0}
{"text": "Whittaker recently said he's not sure why, they just offered him that.", "label": 0}
{"text": "Love the fighting nerds, love caio, don't think he can progress much further in middleweight being honest. I think Bobby, Sean, Izzy, DDP and even Khamzat clean him up man. \n\nSome of those fighting nerds are 100% champ material but IDK caio to me is a bit too chinny and doesn't have the best finishing instinct.", "label": 0}
{"text": "absolute top 10 mma moment for me", "label": 0}
{"text": "They often look more ripped during weigh ins due to dehydrating themselves.\n\nMuscle looks more refined.", "label": 0}
{"text": "So Paul Craig? ", "label": 0}
{"text": "So the brand is bigger than the fighters...this is exactly what Dana White wanted.", "label": 0}
{"text": "It’s crazy how hard the guy is ducking. I don’t think I’ve ever seen anyone campaign this hard for why he shouldn’t fight the next guy up lol.", "label": 0}
{"text": "She is EXACTLY like a female Colby: Mid fighter, horrendous on the mic, didn't deserve either of the title shots she's gotten, cringy beyond belief, and thinks she's waaaaay better than she is.", "label": 0}
{"text": "He does . I love it", "label": 0}
{"text": "If he does then the PFL deserves it. If Francis was a real draw, the UFC would’ve never let him ago. No matter how much Dana hated him.", "label": 0}
{"text": "[I got you](https://www.youtube.com/watch?v=8PT_Jqb63WA)\n\n[Bonus old man skit](https://www.youtube.com/watch?v=C2nsn2uzWog)", "label": 0}
{"text": "lmao why is this the top comment. Merab let the kid fucking put him down in the dirty floor with his nice suit on.", "label": 0}
{"text": "Yeah, she just doesn’t stutter as much and wins title fights. Definitely not a super skilled fighter, but unfortunately, one of the best we got at the moment", "label": 0}
{"text": "Ryan Hall and Paul Craig want to know your location ", "label": 0}
{"text": "If that fits sure thing", "label": 0}
{"text": "did better than omalley", "label": 0}
{"text": "You can tell Whitaker knows this is his last chance and is ready to go full throthle, you can tell he's giving his all before he finally retires.", "label": 0}
{"text": "Does no one else see this guy blow up to epic proportions if he manages to KNOCK OUT both Volk and Max, At this stage of their careers? \n\nI love Max as much as the next guy, but damn, if Ilia manages to talk the talk and walk it.. you have be excited about the hype he’ll start to bring. And I’m ready for someone like him over O’Malley and Alex (weak division).", "label": 0}
{"text": "His something else is that he's the best MMA fighter in his weight class rn", "label": 0}
{"text": "It’s okay bro, I’m shorter and lighter and I have a hard time finding clothes that fit lol", "label": 0}
{"text": "This guy is the epitome of petty.  Such a loser mentality", "label": 0}
{"text": "With the morning card this feels like Christmas Eve", "label": 0}
{"text": "Sorry I thought I clicked the \nr/mademesmile sub when I saw this. I'm not crying you're crying!", "label": 0}
{"text": "I’m never interested in these gimmicks. We’re here to watch MMA. Caio should obviously try to wrestle if he fights Izzy", "label": 0}
{"text": "I didn't mind her until her defeat of the shell of Nunes (had bad covid just before, two leg injuries, and was a new mom) in the first fight where she got so boastful. What pushed it over the edge for me was her literally booing and yelling \"SHE'S SCARED\" as Nunes had her retirement moment, which was one of the most obnoxious, shitty things I've seen a fighter do in the last few years.", "label": 0}
{"text": "I'M NOT gonna be happy I wanted it so bad 😔", "label": 0}
{"text": "She's still not speaking to him?!?", "label": 0}
{"text": "Set yourself reminders on your phone, bro. We gotta get militant with our dumb brains.", "label": 0}
{"text": "Yeah the weight cut was one of my concerns for him but he looks good", "label": 0}
{"text": "I bet Tim Lambesis is a big Ilia and Khamzat fan", "label": 0}
{"text": "I would love to see Umar vs Aldo.", "label": 0}
{"text": "No middleweight has defended their rankings number more times lol.", "label": 0}
{"text": "It’s not about Murab fighting immediately or not. It’s about him not fighting umar. He’s clearly ducking and going for the Sean rematch", "label": 0}
{"text": "He’s gonna get murked. He knows it too.", "label": 0}
{"text": "Yan vs Umar is the fight to make.", "label": 0}
{"text": "What makes dazn terrible and ESPN perfect?", "label": 0}
{"text": "Oh shit me too, noice", "label": 0}
{"text": "sick cuuuuunnntt*", "label": 0}
{"text": "Bro he always looks like shit when he's cutting weight. He's literally NEVER missed weight in his entire career though. He knows what he's doing.", "label": 0}
{"text": "Sal Damato had it 10-8 for merab tho", "label": 0}
{"text": "He said Sean asked for a rematch and he said OK how bout November. I'm not sure why that didn't form up or if UFC ever took it seriously but that's where he left that. Then he said UFC pitched him Umar and he said OK, February March April (obviously only February works there due to Ramadan in March), and next he heard, Umar was fighting Song. He said January was Georgian Christmas and he didn't want to do it then and wouldn't be ready, but from February on was OK. I don't know why he'd be ready for Sean in November but not for Umar in December, but I don't know if they were pitching December or if November was ever legit for any opponent on UFC side, but that's what he said a few days back on Ariel's show.", "label": 0}
{"text": "I think he’s funny. And I’ve watched since ‘07 and hate YouTubers and people who don’t train but think they’re experts. Can’t stand ‘em. But the little piggy knows what he is and I think he says some funny shit there and there\n\nIt’s the people who watch MMA YouTubers for knowledge and insight that have a fuckin’ problem. You should only pay attention to these guys if you just want MMA content to listen to, not for good takes", "label": 0}
{"text": "It's honestly just because he loves Whittaker. He's on record saying he likes him and wants to fight bad guy. He doesn't want to fight him.", "label": 0}
{"text": "\"Hey, no excuses. I did have a messed up back and I was sick, but no excuses.\"", "label": 0}
{"text": "He's good. Like some sort of fight nerd or something.", "label": 0}
{"text": "Max is dominating all five rounds, Illia points to the ground in the last 10 seconds, Max steps to him and uppercuts Illia in the nuts with everything he's got.", "label": 0}
{"text": "Any time you get a serious athlete that’s a big student of the game, pay attention. This man will fight for the title at bare minimum but I think he could be a great champion", "label": 0}
{"text": "Calm down Guru", "label": 0}
{"text": "“Do you have the slightest idea how little that narrows it down?”", "label": 0}
{"text": "Do yall remember the hype before a Romero Fight. Seems like a lifetime ago.", "label": 0}
{"text": "Wait really?\n\nDamn I guess his English is better than I thought. I’m hard of hearing so I guess my standards are different.", "label": 0}
{"text": "*Bi-racial angel", "label": 0}
{"text": "Better have a 10 month wait then go back to tajikistan and have nothing", "label": 0}
{"text": "it is wishful but also plausible... Robert has some quick finishes", "label": 0}
{"text": "Weird fight in the first place but gave it a shot. No more nonsense, Merab and Umar is the fight, lets stop dancing around it.", "label": 0}
{"text": "I guess we gona find out Saturday night", "label": 0}
{"text": "5am beers here in Australia", "label": 0}
{"text": "Are we surprised?", "label": 0}
{"text": "I can’t get Juliana Peña throwing full force air punches 3 feet out of range out of my head", "label": 0}
{"text": "Merab the fucking man, everybody is gonna be routing for this man to pummel Umar", "label": 0}
{"text": "Sometimes his hatred for people who don’t let him mine their talent for his benefit blinds him and he says dumb shit like this. “I wAS ActUlly GOing To fIRe thE biggest STAr in MmA bEcaUse He LosT TwO In a row” shut the fuck up!", "label": 0}
{"text": "Ilia's knocking out max in round 3 tops. Holloway can't handle the heat", "label": 0}
{"text": "Same here bro, I think it all comes down to the first round and if Rob survives", "label": 0}
{"text": "meh it was a bjj match who cares", "label": 0}
{"text": "I mean u can say Dana can afford to let anyone walk since UFC is so big w so many fighters. UFC would've loved to sell Ngannou vs Jon to ppl if Ngannou accepted a low paycheck\n\nWho can Jon fight outside of UFC that would sell PPVs? He'd prob do even worse numbers vs Fury and AJ\n\nOnly Conor can realistically sell PPVs outside of UFC w/o a good B-side", "label": 0}
{"text": "I could take this kid on a 6 hour notice. \n\nDana, book it!", "label": 0}
{"text": "Bro was pimpin his mom for upvotes lol", "label": 0}
{"text": "Holy shit Dana has the most fragile ego ever.  He started beating the Jon Jones GOAT drum as soon as Francis shot down his offer because he knew he could make more elsewhere.\n\nCrazy how Dana pretends to be a business savant but somehow can't fathom fighters wanting to maximize their own profits.", "label": 0}
{"text": "Isn‘t grappling supposed to be his strength tho", "label": 0}
{"text": "Saudi was paying the fighters for those boxing fights. UFC wouldn't have lost a dime. They would've gotten millions upfront from Saudi for letting Francis box. The event also would've done a little better w UFC co-promoting it", "label": 0}
{"text": "I bought it.", "label": 0}
{"text": "Yeah but that type of grappling is pretty much BJJ. The other guy had more experience in that", "label": 0}
{"text": "He has an art piece which is an AK-47 made out of dollar bills. I think that says all there is to say about his tastes.", "label": 0}
{"text": "Common Song W", "label": 0}
{"text": "Nah we’re in a world where Jon jones exists", "label": 0}
{"text": "[I got you](https://www.youtube.com/shorts/0DReXE50peA)", "label": 0}
{"text": "They would've def made $ from Saudi. Do u think Rob vs Ikram in Saudi made a bunch of $ from ticket sales? UFC got $20M+ upfront from Saudi for the event\n\nEven if UFC and Queenbury were to put on Ngannou vs Fury w/o Saudi, there's a high chance they would've at least broken even. Dial back the purses to realistic levels, higher ticket sales in the US, and selling the PPV in US primetime", "label": 0}
{"text": "Rakic winning would be the funniest outcome and therefore I support it", "label": 0}
{"text": "Dana is such a fucking loser lol", "label": 0}
{"text": "Diego Lopes vs Ilia (or Max) is gonna feel like a big fight.\n\nHell, if Volk gets the belt back him and Lopes feels big too.", "label": 0}
{"text": "Yea but they also don’t pay dick for the fighters. The saudis would’ve had to pay Joshua, Francis, and the UFC?", "label": 0}
{"text": "Already?", "label": 0}
{"text": "Josh Emmett is tough as nails and I give him all due respect, but he's a bit past his prime so to speak. People want to see Topuria beat some top tier guys before they jump on the hype train. If he embarrasses Max like he says he will, people will be acting like he was always their favorite fighter, but until he beats someone in the top 5 people are always gonna say he hasn't been truly tested.", "label": 0}
{"text": "I'm sure there's a long list of HW title challengers that were cut after losing a title fight and 1 more ... right Dana?", "label": 0}
{"text": "14 years old and brimming with hormones is of course best base for MMA", "label": 0}
{"text": "That'd be fucking dope", "label": 0}
{"text": "*set up", "label": 0}
{"text": "Don't mind it.  Could Umar have gotten the shot?  Sure.  But another ranked win before isn't some injustice", "label": 0}
{"text": "Man fucking Merab is being scary. No one wants this shit we want to see Umar sub Merab’s bitch ass on zoe pound.", "label": 0}
{"text": "He only lost because he couldn't get trapped in his opponents full guard and slam them to a TKO win", "label": 0}
{"text": "Where are you getting these numbers? Source?", "label": 0}
{"text": "Most important bit right here", "label": 0}
{"text": "Only the crotch sniffer cult", "label": 0}
{"text": "You in Fiji or what?!", "label": 0}
{"text": ">It’s literally just going to be the UFC having a foothold in the states. \n\nUmm.. UFC been a de facto monopoly for a while now mate.", "label": 0}
{"text": "Aww.. giving me real GSP vibes. I miss shit like this.", "label": 0}
{"text": "🤝", "label": 0}
{"text": "The real answer is that WMMA is so weak that the \"champ\" was dumbfounded by a simple ducking jab. In the next fight, they taught Amanda a counter for that, and Pena expected the exact same thing to work.", "label": 0}
{"text": "South East Asia homie! Borneo island", "label": 0}
{"text": "Just thought I would mention it because this is early as hell for the typical card. I would've never known if I didn't check.", "label": 0}
{"text": "They skipped the painful part of Jones absolutely smashing all of our heroes, lucky bastards.", "label": 0}
{"text": "Eh. Even if Mokaev's grappling was absolutely top-tier, he would still struggle in grappling competitions against legitimate athletes of that sport.\n\nMackenzie Dern was a world champion in grappling before she was a mma fighter. She recently took up a grappling match at the CJI and didn't just lose, but got absolutely smashed.", "label": 0}
{"text": "Just watched Dustin’s breakdown of his fight against Max for the interim belt. I dunno man, Max loves a good fight it’s gonna be a long night for Ilia if he can’t crack Max’s chin. He’s just gonna keep coming I don’t know if Ilia will be able to hang in that kind of a fight with him", "label": 0}
{"text": "I wonder if they really blocked that? I don't usually see them interfere with their fighters' grappling careers. Of course Dana of all people *would* though...", "label": 0}
{"text": "Lol forreal guess I gotta smoke weed and eat wings at 3pm smfh", "label": 0}
{"text": "Perfect time for Max to win by TKO in the 4th.", "label": 0}
{"text": "Is this better or worse for Europe because as an American I don't mind this time at all", "label": 0}
{"text": "3am in the morning where I am. With a newborn to help with, I’ll be up regardless of whether I want to be or not.", "label": 0}
{"text": "I’m talking from a hardcore’s standpoint. My point was that we’ve always had alternatives when we wanted something different from the UFC. This isn’t the same case as it used to be. \n\nCompanies like Strikeforce, Bellator, WEC, WSOF, EliteXC etc were always there for that purpose. We’ve always known there’s great talent outside the UFC. If a casual only follows the UFC, that really doesn’t concern me.", "label": 0}
{"text": "aussie 1am start with the boooiiiiiizzzzz", "label": 0}
{"text": "It's perfect for Europe which makes the Manchester card even fucking dumber", "label": 0}
{"text": "European fans finally get to eat after they screwed us over with the Manchester card", "label": 0}
{"text": "yea, pain in the ass. i was going to make fresh fancy chex mix for a halloween party tomorrow. making it right now instead. smh. going to be drunk by the time i even go to that. 😤", "label": 0}
{"text": "I'll take it at anytime that isn't a 3am main card......", "label": 0}
{"text": "Main card starts at 8PM (and 7PM in the UK), so the timing is perfect for a saturday evening", "label": 0}
{"text": "do you have data for this claim?", "label": 0}
{"text": "Nope.  I work 1-10pm, lame!", "label": 0}
{"text": "Good.", "label": 0}
{"text": "Oh wow, they could definitely pump their numbers up if they did this time, that's like early after noon/late morning for america so not bad at all", "label": 0}
{"text": "They’re top pressure wrestlers, they do better under rulesets where they can ground and pound", "label": 0}
{"text": "5", "label": 0}
{"text": "It's not within the rules, he got DQ'd for it. He's just a loose cannon, which is why he was released, why take unnecessary risks?", "label": 0}
{"text": "I feel like being short is part of the reason I wear oversized clothing. I can't explain it, maybe I just want to feel like I'm in a Lancer frame.", "label": 0}
{"text": "I think it's a tough match up for him, and after getting knocked down, it's possible his chin is on the way. I wouldn't favour him necessarily, but I'll never doubt Holloway. Illia smoking Volk is wild though.", "label": 0}
{"text": "😭😭", "label": 0}
{"text": "I don’t really think so. Imavov vs Izzy is a high level kick boxing fight that would be more entertaining. Caio could definitely just lay on Izzy all fight and he even implys it in this message saying he would if izzy was to kick all fight. It’s Izzy, ofc he will. 60% of his offense is kicking lmao.", "label": 0}
{"text": "Certainly reasonable in that case. I was curious if there was some issue with how Mokaev left the UFC or something.", "label": 0}
{"text": "On my day off when I could be sleeping in? Yeah", "label": 0}
{"text": "I bet he cares", "label": 0}
{"text": "Volk 2.  Lopes.  Evloev.  Three pretty no brainer guys he's gonna have to face if he beats Max.  \n\nPlus, he doesn't necessarily have the clinch work to hang with the big boys like Volk moving up in weight class.", "label": 0}
{"text": "LFG sir! But Khamzat is taking this one", "label": 0}
{"text": "They got Francis because his contract had a sunset clause but nobody has that anymore. ", "label": 0}
{"text": "He's chasing a guy in Islam who ain't interested in staying at 155 if he beats Arman cause they want to make room for Usman in the UFC.", "label": 0}
{"text": "Dana White didn't want to open a 145 division at this time and he wanted to force Cyborg down to 135 to fight cash cow Rousey. As per steroids, she was probably on something, lol.", "label": 0}
{"text": "So nice of the UFC to think about you like that", "label": 0}
{"text": "Man volk is 😂", "label": 0}
{"text": "Jiu jitsu players will defeat wrestlers in a submission grappling rule set almost every time. Consequence of the goal of each sport.", "label": 0}
{"text": "Lovable psycho", "label": 0}
{"text": "'proper cunt' is negative in Australian\n\nsick, mad, loose are some more positive ones", "label": 0}
{"text": "With special secret sauce, make you jacket and strong", "label": 0}
{"text": "7am prelims gonna hit like crack", "label": 0}
{"text": "There's always the one wet blanket...", "label": 0}
{"text": "Made more sense with Islam cause all those top 5 guys had legit cases that it didn't make financial sense to fight a non top 5 guy at 155.\n\nPretty much only O'Malley has that excuse at 135.", "label": 0}
{"text": "They can still fight out their deals. If they have 5 fights left on their contract, they can fight 5 times and be done w their contract. And considering they just made that change and everyone has had the sunset option since 2017 until recently, I find it hard to believe that’s the reason for the PFL struggling to find paying viewers.", "label": 0}
{"text": "realistically his perfect plan is volk->max->volk 2->lopes->whoever emerges next. I could def see him move up after that considering the strength of competition in that", "label": 0}
{"text": "Thank you for the cunt facts you mad cunt", "label": 0}
{"text": "He still has a crazy stamina advantage and has made other 5 round fighters look like they have terrible cardio .  Merab threw more sig and total  strikes against Yan than Cory/Unar combined while shooting 49 takedowns and still not looking tired .", "label": 0}
{"text": "It's a shame that you are getting sick and won't be able to make it", "label": 0}
{"text": "Haha nah I’m gonna go. I’ll try to take my lunch break when the main event is starting though", "label": 0}
{"text": "Robert and Max are both true warriors. Good luck to both of them!", "label": 0}
{"text": "It's injustice if suga gets the rematch", "label": 0}
{"text": "maybe idk", "label": 0}
{"text": "Anal optical disease. Happens to the best of us. (Can't see my ass going to work today)", "label": 0}
{"text": "Well, yeah.  Ilia is a great fighter, but he could probably fight at 135.", "label": 0}
{"text": "I care about any opportunity to see this guy lose at anything.", "label": 0}
{"text": "Then hit him with a car in the parking lot", "label": 0}
{"text": "Kids gonna have to fight Lopes in Vegas for Noche UFC first", "label": 0}
{"text": "It took aljo less than 5 minutes to choke him out & even sober TJ with a torn ACL & shoulder was able to out wrestle him.", "label": 0}
{"text": "At the very least, she's at the top of the women's divisions right now.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Living legend, hall of famer,\nKiwi wizard, Chechen tamer,\nRoundhouse kicking, super gamer,\nBobby Knuckles, relentless danger.", "label": 0}
{"text": "Yeah cuz max gets knocked out all the time lmfao", "label": 0}
{"text": "Dana: Francis is all about the money.      \nAlso Dana: Francis would have made more money if he stayed with the UFC.      \n     \nThat kinda indicates he wasn't about the money?      \nOr that you're lying (which is true either way) and he went where the money was, which was outside of the UFC.", "label": 0}
{"text": "Even the high level sambo guys get beat when they try to compete at adcc", "label": 0}
{"text": "I'm glad he's acknowledging this, the double champ status is too chased after now and we as fans need to see established champions defending belts", "label": 0}
{"text": "Yea, in the military. \n\nIn combat sports, you pick something memorable. So the fans have something to associate with you.", "label": 0}
{"text": "i agree with this take normally for literally anyone else. but i wouldn’t find him fighting islam just so someone can finally shut him up", "label": 0}
{"text": "he has fought at 135 when he was still on the regionals", "label": 0}
{"text": "Ya", "label": 0}
{"text": "Fuckin tell me about it 🤬", "label": 0}
{"text": "I also think 3 defenses is the absolute least you should be able to have to fight the champ up a weight class", "label": 0}
{"text": "Bet you were sniffing your own fart as you typed that", "label": 0}
{"text": "“Upset” lmao", "label": 0}
{"text": "Figgy deserves the title shot how?  He beat Vera.  Vera only got his shot cause of his history with O'Malley and cause the UFC wanted put off O'Malley losing to Merab.", "label": 0}
{"text": "But Conor not even thinking about defending the FW belt was totally fine", "label": 0}
{"text": "I also don't want to see Volk get starched again, he's been knocked out brutally twice so far he doesnt need a third", "label": 0}
{"text": "To be fair, he was 21 years old when he tried out Bantamweight twice and it’s been 6 years since then.", "label": 0}
{"text": "So we can get a true number one contender", "label": 0}
{"text": "well yeah he couldn't make BW again. he's pulled out before at FW for weight cut issues, he'd be like LW gilbert at BW", "label": 0}
{"text": "Dude same lol. The prelims start in less than 12 hours but I’m gonna be up for at least another 6 lol. Gonna be a short nights sleep, but excited to wake up and watch fights. ", "label": 0}
{"text": "I don't get it.  Merab is obviously gonna be a boner killer for the momentum in that division, and Sean isn't magically going to develop the game to beat him.", "label": 0}
{"text": "Topuria is a better wrestler than Volk is.", "label": 0}
{"text": "Yeah odds are cooked", "label": 0}
{"text": "Been a rough year lol", "label": 0}
{"text": "LFG love this announcement", "label": 0}
{"text": "It’d be like Homelander with the deaf kid", "label": 0}
{"text": "He's got that roo in him", "label": 0}
{"text": "Really don't think he will. He's getting hip surgery soon and the first fight was so 1 sided and bad nobody is asking for a rematch but him.", "label": 0}
{"text": "Not surprising that that fat slob Guru can make a video with 100k+ views with objectively false takes like \"the weigh in window was extended an extra hour for Khamzat\" (no it was opened an hour early, the deadline was the same and multiple other fighters weighed in the last hour) and \"they didn't let the scale settle\" (they stopped the scale sooner for Whittaker than Khamzat)", "label": 0}
{"text": "At 2:26 Max said he doesn't see red when he goes in there. Confirmed he has no chance against the average r/MMA commentator then", "label": 0}
{"text": "NP king", "label": 0}
{"text": "What about the original women's flyweight champion, who kept ducking Shev?", "label": 0}
{"text": "I don’t think they hate him that much either, it’s just like how people used to hate Volk because he beat their boy. Plus this sub will shit on people they love just as easy too.", "label": 0}
{"text": "Yeah, when he fought unranked opponents. Against top ranked good guys he goes to decision, and looked like he would lose to Usman if it was a 5 round fight.", "label": 0}
{"text": "LFG!!!!!!", "label": 0}
{"text": "Not going to sleep in tomorrow so I can get my Saturday workout in, then I’ll veg and watch the fights. Not a bad day", "label": 0}
{"text": "Yup, what Dana was really pissed about was GSP announcing his sorta retirement after the fight. Dana was ranting that GSP owed it to the UFC, Hendricks and the fans to have a rematch with Hendricks.       \nIt was crystal clear Dana wanted to do a rematch, which he hoped GSP would lose, and then he could promote the new Champion Hendricks. Now he had to make somebody else champ and people would question if they were better than GSP or not, hurting their legitimacy as the best lightweight.      \nDana/UFC really hate it when Champs leave while they're still the Champ. He gave GSP a 2nd chance in fighting Bisping under the belief/promise that he wouldn't retire again if he won the belt, but GSP did exactly that. That's why we never got GSP vs. Khabib, he didn't want to give GSP another payday and was probably terrified he'd win and retire a 3rd time.      \nIt's also a reason why the UFC had in their contracts an automatic extension if you were the champ. It wasn't until Francis that somebody got a sunset clause and we all see how Dana feels about Francis leaving.", "label": 0}
{"text": "One", "label": 0}
{"text": "Agreed, he needs like 3 defenses at least. I feel like there are at least 3 fights he should clear before moving up.", "label": 0}
{"text": "They’ve been in business for 13 years now under 3 separate ownership groups and have failed each time", "label": 0}
{"text": "He hadn’t fought in years", "label": 0}
{"text": "No he wasn’t", "label": 0}
{"text": "Max won the second fight. 1, 2, and 4 were pretty clear round wins for him. That's what caused Volk to start shaving his head after his Thailand visits.", "label": 0}
{"text": "Also we have a proper MW Rob now. Dude looked a weight class below Jacare in their fight.", "label": 0}
{"text": "No I wanted to watch Umar fight live :(", "label": 0}
{"text": "BJJ isn’t MMA, different letters", "label": 0}
{"text": "Dudes openly racist, homophobic, sexist, and xenophobic as are most of his little copy cat channels lol.\n\n\nThere's tasteful jokes like border patrol Tatsura or racially motivated Drew Dober and then there's him basically saying racist shit about any caucus fighter.", "label": 0}
{"text": "He has 16 wins by KO lol", "label": 0}
{"text": "Wat.", "label": 0}
{"text": "You don't like MMA. Cool story.", "label": 0}
{"text": "Francis just sold 10k PPV buys and he’s talking about someone losing. The only people losing is PFL who have to pay this dude like $8 million to fight and they’rnever going to recoup the money.", "label": 0}
{"text": "I don’t know how people can hate Merab", "label": 0}
{"text": "PFL will fail under Don Davis, but there are a few things I hope survive if it's sold instead of just outright folding. I'd love for PFL to take like 5 steps back on the main PFL promotion and turns it into a collection of regional promotions. PFL (continent) branded promotions and in a few years once they've built up a solid talent base you can start cross promoting with your own promotions.", "label": 0}
{"text": "i still dont get why people think a guy who fought in september should fight in december just because his opponent doesnt want to fight in a reasonable time like feburary.\n\nBut merab trying to push for sean was just dumb. Just makes the fans turn on him, and even the ufc isnt that stupid. Merab should just keep repeating \"why should i accomodate umar, a guy whos only beaten one good guy whereas ive fought several champs just to get the title shot\" stop talking about sean.", "label": 0}
{"text": "Core memory created", "label": 0}
{"text": "Yeah no fake beef \n\n\"Hey wanna fight?\"\n\n\"Sure\"", "label": 0}
{"text": "I've watched every single one of both of their fights. He got beat pretty handedly in the 1st round by Allen until Allen oddly gassed with a weird ass gameplan. Roman Dolidze is not very good FYI. Lost to Vettori. Was getting beat by Hermansson until he got that crazy finish. He's not that good. You'll see. He's not terrible. Caio is just better. Don't try and tell me I don't watch MMA. I watch about every single card. Izzy would decimate Imavov. I hope they fight so you can see.", "label": 0}
{"text": "Francis has said money wasn’t the issue so that’s a non issue.", "label": 0}
{"text": "...and Francis is right.", "label": 0}
{"text": "That’s all fair\n\nWe’ll see where he stands after fighting Whitaker \n\nIf he manages to ragdoll him the way he did usman and win, then him vs DDP will be a lot of fun", "label": 0}
{"text": "That's super nice by Dana. I wonder if the commission gets the usual tariff or if it's a special deal.\n\n\nI am not insinuating anything about a specific fighter or the current location but you know keeping friends close ... etc.", "label": 0}
{"text": "Francis did not lose. He made a shitload of money fighting two super boxing fights, way more than he would have made in the UFC. Not sure if he is a PPV star though so you could argue that PFL lost here, but Francis didn’t", "label": 0}
{"text": "They’re gonna put Font in, calling it now", "label": 0}
{"text": "Bro, Dana won't let you hit", "label": 0}
{"text": "The point is that Francis got what he wanted, which was freedom and money. Dana can't handle that someone actually left the UFC and is thriving one their own. Nobody gives a shit that PFL is losing money and the Saudis have a bottomless bank account.", "label": 0}
{"text": "Blew his chance at superstardom? Dude boxed Tyson Furey, he doesn’t need PFL any more than he needs the UFC. His name and reputation is commanding an $8 mil paycheck.", "label": 0}
{"text": ">Diego Lopes would lose to Holloway and Topuria.\n\nUnfair to ask Diego to fight two guys anyway.", "label": 0}
{"text": "Russia", "label": 0}
{"text": "Boxing still makes you a bigger star globally than MMA in 2024.", "label": 0}
{"text": "4", "label": 0}
{"text": "Unless their willing to vacate title, but there's no guarantee they get a shot in their debut in new weight class.", "label": 0}
{"text": "This is the correct joke.", "label": 0}
{"text": "Francis just won another belt. Fought 2 of the biggest names in boxing and made a shit ton of money all while making jones and dana look like absolute idiots. Dude killed it and I'm so happy for him he shut everyone doubting him up.", "label": 0}
{"text": "Just like Izzy was meant to decimate Strickland and DDP because he’s a much better striker than both. \n\nWho do you think Caio’s beat? 40 year old cannonier who looked like his age was starting to show and Paul Craig 😂😂😂😂😂 \n\nWe’re talking about which fight would be better against Izzy and to this point it’s imavov. Like I’ve said caio will just lay on him, he’s the much better grappler compared to Izzy so of course he’d be more favored than imavov would be. \n\nAlso is this Caio’s burner account? He", "label": 0}
{"text": "I wish Francis would push more publicly for fighter pay and post career protection. He could very easily become MMAs Muhammad Ali.", "label": 0}
{"text": "It’ll take another 3 years for PFL to cobble the funds together to put on another Francis/Can fight. In that time he could have made $48 million on 2 UFC fights a year at the $8 million he was offered.\n\nHe made great money in boxing, but that slide died the moment AJ flatlined him. Everyone wants to sit here and act like Dana missed out, but at the end of the day Francis sold 10k buys for exploitative oil money in a stadium build by slave labor. Kinda ironic considering his upbringings.", "label": 0}
{"text": "That Fury fight didn’t sell shit.", "label": 0}
{"text": "I have no idea what this means.", "label": 0}
{"text": "Rob Whittaker coming? I’m in", "label": 0}
{"text": "Looked like the kid could give two fucks about Volk 😂", "label": 0}
{"text": "Song already pulled out. Taken from Umars twitter:\n\n\"I am always ready, and right now I am waiting for an opponent, as Yadong declined to fight in December — I was told he is injured. \n\nMerab, before my fight with Sandhagen, you said that if I beat him, I would deserve recognition. Now you have changed your position — decide who you are. \nAll the fans and analysts are noticing how you are avoiding the fight. \nChampionship is recognition, but you haven’t received it, and you know that perfectly well.\"\n\nhttps://x.com/UNmgdv/status/1849918404389462287?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet", "label": 0}
{"text": "Dana breaking his cardinal rule of pretending any other promotion and any fighter who left for another promotion is essentially non existent.  Very funny because he's telling on himself by bringing up Ngannou so frequently lately.", "label": 0}
{"text": "I will never understand how people can still glaze the bald bastard. Obviously Dana was monumental in the UFC's rise, but holy fuck he has built the exact situation he bitched about boxing having for YEARS. We will never see Ngannou, Aspinall or Jones fight each other, EVER.", "label": 0}
{"text": "i think merab is trying to duck but merab fought yan, jose, cejudo before beating o malley. Three guys with distinct styles.\n\nUmar fought cory.\n\nHe hasnt had to prove himself nearly as much as merab has.", "label": 0}
{"text": "You don’t know that.", "label": 0}
{"text": "Nah it's 5am, man. Sleep in!", "label": 0}
{"text": "Man, it was so cool to have Randy Couture doing commentary for Francis’ return to MMA. Randy walked so Francis could run. You could see on Randy’s face a little something extra knowing that Dana fucked this thing up. ", "label": 0}
{"text": "Call me crazy but Merab isn’t even ducking. This community is just extremely hard for Umar. Here are both of their paths to a title shot. \n\nMerab- Moraes, Aldo, Petr Yan, Henry Cejudo. 3 Former champs. \n\nUmar- Cory Sandhagen. 1 ranked fighter. \n\nIt makes perfect sense for Merab to say Umar doesn’t deserve it. And if you ask me it’s perfectly reasonable to make him fight another time before getting a title shot.", "label": 0}
{"text": "Francis barely sold in the UFC but he sold way more there than he did in boxing and PFL and a Jones fight might’ve broken 1.5 million and a viral ko would’ve made him huge.", "label": 0}
{"text": "So Caio would be more likely to beat Izzy but you would rather him fight Imavov? Dude you're high. Go to bed lol. I'm done", "label": 0}
{"text": "The Dagestani's usually run their own instagrams and let Ali run their twitters.", "label": 0}
{"text": "Yes and as a boxing fan Dana knows the significance of the lineal HW champ leaving the org, that shit kills him you know it.", "label": 0}
{"text": "not wanting to fight umar in december is perfectly reasonable, no reason to accomodate ramadan for umar, but calling out sean is just plain stupid. zero chance it happens but you tank approval with fans", "label": 0}
{"text": "But francis fumbled remember and wasn't going to fufil his part of the deal with pfl and only box /s", "label": 0}
{"text": "fully support him.", "label": 0}
{"text": "Ilia just doesn’t want to keep cutting to 145", "label": 0}
{"text": "Well, and Conor frankly came along when LW wasn't nearly as strong as it is now.", "label": 0}
{"text": "Francis won no matter how the ufc heavyweight division pans out.", "label": 0}
{"text": "Like I said Ngannou and his coach has said that money wasn’t the issue. Ngannou negotiated in bad faith tryna make up random promises he wasn’t serious about to make the UFC look bad to have the UFC release him (which they could’ve just kept him but they let him go).", "label": 0}
{"text": "Robert Wide-aker", "label": 0}
{"text": "If you only read the takes on social media you’d think Max was a -300 favourite lol\n\nCan’t wait to witness the seething tomorrow", "label": 0}
{"text": "How much did Fury and Joshua fights sell? I’d tell you it was worse than Francis in the UFC.", "label": 0}
{"text": "Ppv buys aren’t his problem he got pretty much everything he wanted from the ufc elsewhere. He won ", "label": 0}
{"text": "Sales don’t matter until they affect the next fight purse and Ngannou made millions again fighting Anthony Joshua, then again last week. He could retire today and live a very comfortable life. There’s plenty of retired UFC champions who fought way more, took way more damage and don’t have that kind of money to show for it. Ngannou made a great decision leaving the UFC.", "label": 0}
{"text": "Yes, Izzy isn’t the champ. Why do we need to make matchups to take out Izzy? This is prizefighting and even if it was completely just a sport based on rankings vs rankings, caio hasn’t done more than imavov. \n\nImavov vs Izzy would be the more entertaining fight, and also are you fucking blind? Or just so daft that you can’t look up at the comment thread you’ve replied to?", "label": 0}
{"text": "How about we go back in time and do a number one contender fight with Sandhagaen and Umar and whoever wins fights the winner of Merab and O'Malley.", "label": 0}
{"text": "she rubs me wrong the right way.\n\nsaying \"no actually IM the first mom in the ufc\" after beating amanda and yelling \"DONT COMPARE YOURSELF TO ANDERSON SILVA\" is just plain funny. real post fight joaquin buckley conor mchoe vibes", "label": 0}
{"text": "I mean, it's no surprise that Dern lost, for sure. But there's a reason Dern got absolutely smashed, which is that she's simply not the grappler she once was (not that she would necessarily beat Davies in her prime as a grappler either, though it would certainly be closer).\n\nMma fighters simply don't have the time to be the level of grapplers that submission grapplers do. Mma fighters have to devote their time to roughly four martial arts (boxing, muay thai/kickboxing, wrestling, and bjj) while submission grapplers put all of that same amount of time into just one martial art. Combine this with the fact that Dern hasn't been a world level grappler for many years (and is simply behind on the grappling meta in current bjj) and it's obviously no surprise Dern had 0 chance, and any former grappler world champ turned mma fighter would have similar chances in the same scenario as Dern.\n\nIt's the same reason even the best boxer in mma would be a MASSIVE underdog against any boxing world champ (in a boxing match, obviously).", "label": 0}
{"text": "Francis, unsurprinsingly, won again. Again.", "label": 0}
{"text": "And calling me high? You literally made a post crying about how you wish you were high 😂😂😂😂😂😂", "label": 0}
{"text": "Francis had a big enough name to where he got boxing organizers to match him up against Tyson fury. You are delusional.", "label": 0}
{"text": "No...I watched a division where RDA, Pettis and Benson traded short reigns while never looking particularly on the level of guys like Khabib, Oliveira or Islam.\n\nWhat sport were you watching?", "label": 0}
{"text": "Bootlickers will always find a way to make Francis look bad but it’s clear he won. Hope this stays as a permanent sore spot in Dana’s inflated ego.", "label": 0}
{"text": "They probably assumed that would make it easier for him to accept the fight.", "label": 0}
{"text": "\"He just doesn't want to fight\"", "label": 0}
{"text": "Francis has said money wasn’t the issue plus he would’ve gotten a lot of PPV points than the 10k PPV he sold with the PFL. Plus his Fury and Joshua fights didn’t sell shit either.", "label": 0}
{"text": "becuase its less than a three month turnaround?\n\nyou want him to finish a camp, go back right into another one?\n\nwhy?", "label": 0}
{"text": "Abus vs Ferreira is the gem of the undercard", "label": 0}
{"text": "I know what you mean. I struggle with that because everybody has their own norms, so one person will do the walk away KO for instance and another will happily land 300 shots if the ref’ doesn’t stop it.\n\nOne person will avoid attacking an injury, another will be on it like a shark on a bleeding fish. \n\nOne person will crank an armbar on full noise knowing if they get caught that’s probably what the opponent will do, another will apply it local BJJ comp style.\n\nYou’re always at a disadvantage if you have a Jon Jones type who will do anything legal to win and some illegal things.", "label": 0}
{"text": "Literally saw a clip of him the other day doing relatively light touch sparring and once the guy started doing a little better Jon times him and hops into a flying knee. It's insane to throw knees to the the head in sparring in general but even wilder to time one right as someone ducks then act like it was an accident.", "label": 0}
{"text": "not even that, he said hed fight umar in march. umar is the one who doesnt want to because ramadan. why should the champ fight in december for him", "label": 0}
{"text": "Khabib and Tony were contenders when conor fought eddie. Khabib literally signed a contract to fight Eddie and conor was given the fight instead. \n\nEddie's first defense was supposed to be against khabib.", "label": 0}
{"text": "They couldn't have kept him his contract was up\n\nYou really have no idea how this works or what Francis was looking for in this situation", "label": 0}
{"text": "what made it so good was when it rodtangs advantage he knew he had to go for the kill from minute one and dj was fully on survival mode countering and showing elite head movement and defense and when it was mma dj was on the front foot and going for the kill", "label": 0}
