{"text": "You guys are probably the two dumbest mf’s I have ever interacted with.", "label": 1}
{"text": "I'll tell you what, fruitcake...go ahead and take your chances breaking into someone's house who doesn't give a shit about courts and laws and judges. Yea, go ahead and...while he's got you tied up spread-eagle on a table getting ready to fillet your flesh and feed it to his dogs for trespassing on his property and trying to steal his life savings...explain to him how it's not right for him to be doing that to you, since all you were doing was TAKING HIM FOR EVERY RED CENT THAT HE'S GOT. See how that works out for you, shit-face. 🤣🤣🤣🤣🤣\n\nI don't give a damn what you call me, dumbass...my point still stands. You play stupid games, you win stupid prizes...and breaking into a PTSD-ridden, daughter-grieving, blind combat veteran's home to steal all of his money is the ULTIMATE stupid game to play. Your dumbass wasn't thinking about \"laws\" and \"judges\" when breaking into someone's home...why would it come into play now that you're about to be artificially inseminated by the very dude you sought to rip off??? Yea, call me a misogynistic asshole... I'll take it as a compliment 🤣🤣🤣🤣\n\nAlso, I would feel the same way about a thieving man who's about to be inseminated up his asshole after trying to rob a blind guy...so stop making this about WOMEN, lol. The POS in the movie just happened to be a woman. I'm an equal opportunity just desserts kind of guy 👍🏾.\n\nAnd you haven't answered my question regarding my scenario above either, I noticed...and I already know why. You view Rocky's attempted sexual assault in response for burglarizing an elderly man's house as worse than me knocking down and old lady while stealing her purse and in my attempt to get away I get hit and killed by a car. You're EXACTLY THE TYPE OF PRICK who'd say that I deserved it...yet defend the piece of shit who robbed an old man almost paid the price for it 🤣🤣🤣🤣🤣🤣🤣\n\nGTFOH!", "label": 1}
{"text": "Sigh, didnt process a single word. When you end up in prison for lashing out in a way you thought you deserved to, don’t be crying to your cellmate about it. Toodles, rapist apologist. Youll reap what you sow. 🙏", "label": 1}
{"text": "Of course you didn't. I wouldn't expect anything less 🤣🤣🤣🤣", "label": 1}
{"text": "Lol, you weirdos immediately try and push it on this.", "label": 1}
{"text": "I was saying *you* didnt. Apologies for not being super specific, I should have figured someone with a brain deficiency like you would get it mixed up. Thats on me.", "label": 1}
{"text": "DEFINITELY on you! 😄", "label": 1}
{"text": "Sidenote whats your favorite color crayon you like to eat? You seem like you would favor reds and blues.", "label": 1}
{"text": "Took a peak at your comment history. If youre not defending rapist, youre thirsting over black grannies. 😂😂 Makes sense a porn addict with no respect for women would be the same kind of person to openly think rape is okay within context.  Anybody who thinks rape is a valid response to literally anything is probably a rapist themselves. You the type of fella to see a 16 year old wearing shorts and think it would be okay to catcall them. Whenever someone finally physically teaches you a lesson (which it will definitely happen with your attitude and thought process), reflect on these conversations and the early warning signs people called you out for. Enjoy those red and blue crayons until then, Rapist. 🖍️", "label": 1}
{"text": "I mean, they were very very clear in both internal and external messaging that \"past Luke\" needs to die because male", "label": 1}
{"text": "Hey sorry to say it but there is no other way around it, if you liked this movie you might be retarded or severely mentaly impaired", "label": 1}
{"text": "Hey op just wanted to say you are retarded and have absolutely no taste if you liked this embarasement of a \"film\" and please dont recommend any movies online again. Thank you in advance", "label": 1}
{"text": "Thank you!\n\nAnd while you're at it, why don't YOU be the one to come \"physically teach me a lesson\"? Don't be cowardly and put it off on anyone else...come on, toughie. You need the meeting address? 🤣🤣🤣🤣", "label": 1}
{"text": "Whats your addy then, I know youre near houston. So am I. Lets make it legal and meet at a boxing gym.", "label": 1}
{"text": "Now THAT was stupid, seeing as how I'm an advocate for \"all things illegal, including sexual assault\". Being that's the case, why would I do anything the \"right\" way?? No, Captain \"Save A Burglarizing POS\"... I'll meet you on MY terms.", "label": 1}
{"text": "🤣🤣🤣🤣🤣🤣\n\nYou sound like the high school nerd who grew up, got jacked, and now wants to do the very thing to others that he loathed in school...bully people 😂😂😂\n\nWhat grown man tells another to \"meet outside and fight\"??\n\nI told you to come physically \"teach me a lesson\" since you said someone's gonna \"do it someday\". I'm not by ANY MEANS going to risk my freedom and good life trying to seek out and teach some keyboard gangster a lesson, though I very well COULD. But telling what I'm an expert in and my workout routine wouldn't do me any good... you'd just accuse me of lying and say how anyone can say anything behind the safety of a computer. So I'm not going to bother with it, ESPECIALLY behind the opinions of a damn movie.\n\nBe gone, snowflake...this isn't what you want. Consider yourself lucky that I'm NOT who I used to be 👍🏾\n\nI DO find it hilarious how you actually took time out of your day to look up a total stranger's comment history...meanwhile, the thought hadn't even crossed my mind to do the same to you 😂🤣🤣. But I guess that's what being grown is all about...you should try it 🤣 \n\nI also find it hilarious how TWO comments on a couple of porn pics somehow makes me an \"addict\"...yet you conveniently neglected to mention the many OTHER comments I've made on other subjects 😂😂😂😂😂", "label": 1}
{"text": "i aint reading all that fanfic about me. btw you were the one that suggest we fight, so just drop your address. If you keep replying to me with anything besides an address, ive made my point. youre a puss. 🤷🏻 a typical redditor.", "label": 1}
{"text": "“And while you’re at it, why don’t YOU be the one to come “physically teach me a lesson”? Don’t be cowardly and put it off on anyone else...come on, toughie. You need the meeting address?” “What grown man tells another to ‘meet outside and fight’?” You must be real scared to switch up so quick. 😭😭 I cant take you seriously at this point", "label": 1}
{"text": "You must have me confused with someone else you're \"arguing\" with... because I never said we'd fight. I told you to come teach me a \"lesson\" since you said that someone would do it one day. There certainly WOULD NOT be a fight behind a reddit opinion, fuckface...if you were crazy enough to show up and try to physically assault me behind an internet beef, that would have been ALL the just cause needed to blow your damn head off.\n\nSo again...this ain't what you want, lol. Go home, fruitcake.", "label": 1}
{"text": "Still No address. 🥱", "label": 1}
{"text": "Yep...it says MEETING address. ..not MY address, shit-face 🤣🤣🤣🤣🤣\n\nYea, okay... I'll be \"scared\". Count yourself lucky that I AM 👍🏾😂", "label": 1}
{"text": "Still noo address. 🥱 really proving my point here.", "label": 1}
{"text": "Can’t wait", "label": 1}
{"text": "Trying to get people's addresses gives off major creepy vibes dude.\n\nI asked you to send me your address though. No? Because it's your mom's basement?? Figured so.\n\nDude, I normally don't block people because...WHY?? But I'll do it now just to end this tough guy shit. You're not going to do ANYTHING, so shut your mouth, fruitcake.\n\nPeace out 😁", "label": 1}
{"text": "Yes ma'am 👍🏾", "label": 1}
{"text": "more misogyny lol", "label": 1}
{"text": "Lol. came from tiktok just to say you are a degenerate lol", "label": 1}
{"text": "Are you gay?", "label": 1}
{"text": "None of that gets you to being able to defeat a trained Sith Lord. I am supposed believe that a wounded, distracted Palpatine would lose to a simple staff wielder? Again, you only need to look toward the established lore, seen in the movies, that tells us about how practioners of the dark side deal with pain/suffering. It doesn't hold them back, it makes them more powerful. Ignoring lore just invalidates your argument. \n\nAnd don't play that anti woman Jedi shit with me. I am a lifetime fan of the Star Wars EU, which has several notable female jedi, all of whom are nowhere near Mary Sues -- Bastilla Shan, Nomi Sunrider, Ahsoka Tano, and so much more. Naomi Sunrider and the Dark Woman in particular are two of my favorite characters in fiction. Don't make me go full star wars nerd on your ass. \n\nWhat is it with you folks? Every single argument defending Rey comes down to \"she had struggles too! Luke is a Mary sue! You just hate women!\". Like dude, it has nothing to do with hating women, seriously.  Rey is an insult to actual compellingly written female characters. \n\nMaybe you need a refresher course. Rey's first use of the force was a jedi mind trick-- something she had no concept of until the plot decided she needed it. Meanwhile Luke had no concept of the force til he met Obi Wan. And when he was training with Obi Wan, it took him a few tries before he could block blaster bolts, blindfolded. Rey utilized the force perfectly on the first try by mind tricking stormtroopers, even though she had no concept of the force and force abilities at that point.\n\nRey can pilot the millennium falcon despite having absolutely no flying experience whatsoever.  Luke can pilot an xwing because he actually has flying experience and due to the fact of the similar flight controls of the xwing and his T16 airship. \n\nWhat exact struggles did Rey have? What complications did she experience that taught her important lessons and elevated her as a character? Rey off the bat is a skilled fighter, able to easily subdue her enemies, mind trick stormtroopers, and defeat a trained Sith in battle. The best thing Luke did in his 1st film was destroy the death star. He struggled with using the force, nearly killed himself in the xwing, almost got his ass kicked in the cantina.  When you take a wider view of the film, for the most part Luke fails more than he succeeds. \n\nRey in her second film goes against Luke's orders to save her friends, and guess what? She saves them, the resistance, fights Kylo Ren again, to a standstill (despite him being the superior duelist)  all with little to no injury or complication. Luke disobeys Yoda and obi wan and loses his right hand. Luke was forced to learn a powerful lesson about preparedness, caution, and being mindful of his fears. \n\n\nI won't go any further. No need. Rey succeeds far more than she fails; her arc can be summarized as someone trying to figure out their place in life -- and pretty much being handed over the answers with no real struggle or hardship. That's not a compelling character at all.", "label": 1}
{"text": "I think I'm just autistic lol. I've gotten treated well, people offering favours, being extra nice, for looking young and pretty. That has reduced with age. I don't think that's very controversial to say.", "label": 1}
{"text": "Lol. You keep ignoring the part where Rey had absolutely no concept of the before she used it perfectly.  Who hell told her that mind tricking people was possible? Luke was introduced to the force and had a guide to help him. Had obi wan not say anything,  Luke would of more likely fired that shot and missed. Remember,  he kept using the targeting computer and only made the shot when he realized trusting the force was more effective.  I really don't see how you can't understand this.", "label": 1}
{"text": "Just like every sequel defender. Ignore nuance, Ignore lore, ignore virtually everything and default to the same unconvincing tired argument.  You have no ground to stand on, so you just parrot the same one dimensional point over and over.", "label": 1}
{"text": "The fat one in ghostbusters 2. Les I think his name was", "label": 1}
{"text": "michael cera should be raped", "label": 1}
{"text": "But to answer the actual question...it was more of a \"hunch\" (pun intended 😁) than anything, but it was also in how you posed the question.\n\n\"Are...are you a real person\"? The way it was asked just seems...GAY. Doesn't give \"straight male\" vibes. I could almost picture you sitting in a retro chair somewhere, legs crossed with some much too short shorts and a hot pink too tight shirt on, sipping on the latest recipe of some health-based smoothie that a friend gave you when you typed that question.\n\nThat's it, that's all.", "label": 1}
{"text": "You disliking a film does not make it objectively bad.", "label": 1}
{"text": "Yeh this.. people think they’re edgy or different for not liking critically acclaimed and objectively amazing films. But it turns out they just have bad taste lol", "label": 1}
{"text": "Gen Z contrarian", "label": 1}
{"text": "Ok", "label": 1}
{"text": "You’re probably not the only person to feel this way. There are a decent amount of people who don’t understand great movies.", "label": 1}
{"text": "The Dark Knight is pretty bad tbh.\n\nToday most people find the film mediocre and that’s all the better. But people have to stop talking like this Nolan was a genius or that these movies were events.", "label": 1}
{"text": "I agree with everything you said. Unfortunately, when it comes to this movie,  the snobs will say you just don’t like movies or you’re too dumb to understand it, or worse homophobic. They never actually try to rebut your points, or give reasons why it’s a great movie.", "label": 1}
{"text": "The Dark Knight is mediocre and people who think it’s great are wrong. Nobody on Reddit deny that The Dark Knight is terrible.", "label": 1}
{"text": "wow, that's a strawman if I ever saw one, lol", "label": 1}
{"text": "Multiple users did just that lol ok", "label": 1}
{"text": "The Dark Knight is terrible, everybody on Reddit hate it and that’s all the better. The Batman is a perfect masterpiece and it’s impossible to find a flaw in this movie. \n\nTDK -> 2/10\nThe Batman -> 10/10", "label": 1}
{"text": "Most people agree with you. I don’t know anyone who thinks that TDK is better than Begins.", "label": 1}
{"text": "wut?", "label": 1}
{"text": "Agree! It captured some beautiful, melancholic vibes, but it couldn’t quite stick in the same iconic way as the original. Sometimes the nostalgia of the first just can’t be matched.", "label": 1}
{"text": "If you make statements about the movie, and inherent qualities of the movie (this is incoherent, this is bad, this is poorly-written) you’re attempting objective evaluations. \n\nIf you make statements about yourself (I couldn’t follow the story, I didn’t like the characters, I didn’t relate to the intimacy) you’re asserting subjective opinions/reactions and sharing some of yourself along with your critique. \n\nYou’ve almost exclusively attempted objective evaluation, asserting your opinion as the “correct” one. It is simply not.", "label": 1}
{"text": "It would be fine to express an opinion disliking the movie and why. The OP is getting mildly flamed because they’re attempting to frame their opinion as objective analysis.", "label": 1}
{"text": "What are you stupid? That was an honest question. The person just pointed out the correlation between a beast, a monster, and an abusive partner. Now the correct way to end this is I assume you are a shitty person in fact", "label": 1}
{"text": "Dude are you like mentally 5 years old lmao?\n\nWho tf is still making that Shyamalan joke about his name other than literal one digit IQ idiots", "label": 1}
{"text": "Im actually convinced you didn't watch the movies,just read the wiki articles about them.", "label": 1}
{"text": "Everything you're saying is so wrong you come off like a troll than a honest user trying to have a sensible conversation.", "label": 1}
{"text": "Another lame Sony woke propaganda of replacing all legendary heroes with female counterparts in the name of feminism. ", "label": 1}
{"text": "Whatever makes you happy brother.", "label": 1}
{"text": "Who cares? Nobody cares about that in real life and she is loved by millions of people. Simping is fun unlike u guys being jealous 24/7 over successful women. If u have so much free time, go blame Donald Trump and facists.", "label": 1}
{"text": "The Avatar movies are a childs idea of a fun time.", "label": 1}
{"text": "Don't worry, I won't tell Mommy that you used a bad word.", "label": 1}
{"text": "Let me guess: something something \"pushing an agenda\" something something Christians are the most persecuted group of people in the history of humanity, something something go woke go broke etc.", "label": 1}
{"text": "The Summer of Tom sounds like a blast! Can’t wait to see what kind of chaos he brings to the Spider-Verse again. ", "label": 1}
{"text": "Well - we don’t know exactly what happened in the story of the runaway in the movie because the filmmakers completely changed the facts for the movie - go research the real story so you can read the facts of what really happened.  You cannot ever assume the first person someone runs to would NOT help them especially if they are beaten up and covered with blood.  More often than not, someone would help a young girl who was seriously injured.  In the case of Mary Vincent, no one can speculate why the first car did not stop.  ", "label": 1}
{"text": "Ahoy matey!", "label": 1}
{"text": "😂😂 goddamn yall 😂😂🪝🏴‍☠️", "label": 1}
{"text": "you seem stupid", "label": 1}
{"text": "Wait are you saying if we remove half the movie and replace it with really badly choreographed and edited sequences it would suck? That’s like saying if you took good will hunting and removed Robin Williams would the movie still be as memorable. This is such a stupid question", "label": 1}
{"text": "Harry Potter would suck without the magic.", "label": 1}
{"text": "Harry Potter would suck without the magic.", "label": 1}
{"text": "It has its own Disney theme park", "label": 1}
{"text": "Did you guys ever come up with a consensus? Because I seem to remember watching this for the first time years ago and being surprised to see Woodruff having sex with a woman WHILE seemingly getting penetrated by a guy under the rodeo bleachers. It was a shocking sequence 5 minutes in. I’ve thought that was the case for years. I just rewatched the other day, and now it does look like 2 women. \nBut could have SWORN there was a guy involved? And that was one of the things that made him so hypocritical, when he’d talk about faggots and all that.\n\nAm I trippin, and it’s been 2 women all along?", "label": 1}
{"text": "The Dark Knight is pretty bad tbh. Nobody deny that in 2024.", "label": 1}
{"text": "TDK is considered bad by the modern audience and that’s all the better.", "label": 1}
{"text": "The Dark Knight is not good, it’s not even close. It’s disliked today and that’s all the better.", "label": 1}
{"text": "Its basically tiktok in book format.\n\nThe way the main character learns an alien language in 3 days is ridiculous at best.", "label": 1}
{"text": "Always like Pitch Meeting video where that fight is described as Saruman making Gandalf break-dance against his will.", "label": 1}
{"text": "I mean she does have big... Tracks of land.", "label": 1}
{"text": "Did you get triggered? It was a bad movie and a stupid unrealistic scene.", "label": 1}
{"text": "Could say the same for men regarding modern societal expectations.\n\nDating for example. Have to be over 6ft. Have to earn x amount per year. Have to have this. Have to have that.\n\nAs for body mutilation have you seen the lengths (pun intended) some men will go to be taller. \n\nIt's not just women that feel they have to be a certain way anymore. \n\nYou should be feeling sad for men as well", "label": 1}
{"text": "Hi All,\nI was hoping someone could read my post and help me out?\n\nThanks all,\nMary", "label": 1}
{"text": "Respect from a manchild with shitty taste in movies means nothing to me. ", "label": 1}
{"text": "Hopefully we get to see more of the milkers.", "label": 1}
{"text": "milky booba", "label": 1}
{"text": "I was so excited when I saw the opening scene with the fishing boat in the ocean with the exact same Jurassic Park 1993 font for the setting. \n\n\nBut they spent absolutely no time building tension.\n\n\nI counted. It was under one minute of runtime from the studio logo to the first on-screen dinosaur. And they used the biggest dinosaur. Just right out of the gate.\n\n\nI know it was filmed during COVID but the movie was a damn mess.", "label": 1}
{"text": "Serious question. Are you mentally handicapped?", "label": 1}
{"text": "Awwww a little white knight found in the wild.\n\nWhose a good boy? You are! A very good boy! You deserve a treat, something special. Like being called a pathetic cunt. Chow bitch.", "label": 1}
{"text": "I've been listening to this Royale Without Cheese Podcast which is pretty cool. Might be interesting for you because they do all sorts of film reviews from modern to old films, both mainstream an on the arthouse side, so you always get to discover new interesting films to watch. \n\n\nTheir talks seem to be full of genuine enthusiasm and are pretty in-depth. Plus, they also have interviews with cool indie filmmakers if you're into that. \n\n\nI found them on youtube here: https://youtube.com/@rwc_podcast?si=JgrwEWEu4o3H2qPj\n\n\nBut they are also on spotify, apple podcasts, you name it. Have a look.", "label": 1}
{"text": "chris pratt and bryce dallas on jurassic park", "label": 1}
{"text": "gladiator", "label": 1}
{"text": "Hopefully we get to see more of the milkers.", "label": 1}
{"text": "milky booba", "label": 1}
{"text": "I mean you can feel sorry for yourself all you want but I have a feeling it’s not doing you any favors in your dating game", "label": 1}
{"text": "it's a discussion. what are some of your favourite movies?", "label": 1}
{"text": "Incest habbies in the mud. Hopp Schwiiz!", "label": 1}
{"text": "Meanwhile, all the Africans chilling in Africa!", "label": 1}
{"text": "Hi All,\n\nIt’s not a show but Rick is watching the Simpsons movie. We like it and have watched many different movies in the past. If you want to know some good ones don’t hesitate to ask. We also like The Patriot. \n\nBest,\nMary", "label": 1}
{"text": "I give it a 2.\nIt's not even remotely believable.", "label": 1}
{"text": "What are you even talking about? 🤣 \n\nAlso yes my dating game is dead since I'm actually with someone now so you win there.....well done I guess 🤣\n\nNow go on little white knight fly fly away. Hope you don't over compensate for being ugly for being one of those 'nice guys'......ta ta", "label": 1}
{"text": "No, this isn't a discussion because nobody asked for your input. Nobody gives a shit what manchild Jackson fans think. \n\nWhy does every Peter Jackson fan start demanding a list of your favorite movies when you point out how shitty the LotR movies are?\n\nIt's not going to magically make your shitty movie good. Normal people like all kinds of movies that are good not bad. I'm not going to list all of them off for you. It's your job to grow up and grow out of watching pandering IP cash grab slop. Go download Netflix or something. \n\nNormal people don't do an ironic annual rewatch of movies that are so-bad-they're-good. Why the fuck would you think anyone gives a shit about your opinion on anything after doing that? It's not my job to list off good movies to help you quit your weird habit. ", "label": 1}
{"text": "It happens.  We get it.  What is it you are trying to say?  Are you trying to say that you personally believe that no single men will stop and help a victim of sexual assault?  Everyone has their individual belief based on their own information.  The data and information worldwide about sexual assault does not show the majority of single men don’t help assault victims.  ", "label": 1}
{"text": "since we were having a discussion about movies on reddit, i was just curious what some of your favourites were, so we could discuss further on some common ground. but it seems you havent seen many movies and dont have the capacity for a discussion (which is strange considering you're discussing things on reddit) .. but that's fine. enjoy your movies", "label": 1}
{"text": "yifu torrents", "label": 1}
{"text": "Great team. Surprised to see Sandra make the jump to more popcorn fare", "label": 1}
{"text": "Did you find Melinda Dillon attractive?", "label": 1}
{"text": "Remember Melinda Dillon?", "label": 1}
{"text": "Remember the mom?", "label": 1}
{"text": "Did you find Melinda Dillon attractive?", "label": 1}
{"text": "Right? It's such a painfully stupid scene, even if you haven't read the books.\n\nLike, this was 2001 - Crouching Tiger and The Matrix were household names. Then Jackson comes along with the cheapest wire work he could find? It's mind-boggling that anyone takes those movies seriously, they are just *so stupid.*\n\nI had a chuckle when John Wick came out and everyone was losing their minds over how revolutionary the fight choreo was - it's just like, if you're a child who only knows Jackson's cheap looking fight scenes, sure. For adults with a memory longer than a goldfish's, John Wick was a refreshing revival of late 90's/early-2000's action movies.\n\nBut that's the impact Jackson had. After him, Hollywood realized they didn't need to hire expensive foreign wire teams - just tie an old man to some string and flail around a bit and cash in your Oscars. \n\nSuch a stupid fucking movie. ", "label": 1}
{"text": "hey, i didn't mean to upset you, I'm not a jackson fan really, i did think the original lotr films were a great film adaptation at the time.. rare to see a good film adaptation from a book in general, but i just havent heard anyone rag on the fight scenes in those films before, and as i say i respect controversial opinions, so was curious to know what type of films you rate highly. but then you got very angry for some reason. for what it's worth i would rate the hobbit movies as absolute trash - couldnt even make it through the first one", "label": 1}
{"text": "Message me", "label": 1}
{"text": "Eh, I figure most underage kids just wait for the movies to hit the torrents and download them with impunity and no parental supervision.", "label": 1}
{"text": "123 movies. Lots of pop-ups. Need patience.", "label": 1}
{"text": "Stremio fantastic service.. Pro-level, incorporate real debrid", "label": 1}
{"text": "If you're into twisty thrillers and stylish vibes, *Gone Girl* is a solid pick—it’s got mystery, suspense, and a dark edge that might resonate given your love for *A Simple Favor*.", "label": 1}
{"text": "Perfect choice! Mad Men is a classic for a night like this.", "label": 1}
{"text": "Yes! Natural accents kept it grounded and avoided cringey fake Russian vibes!", "label": 1}
{"text": "Cunt", "label": 1}
{"text": "The walking dead, but I'm just a talking head.", "label": 1}
{"text": "The prodigy", "label": 1}
{"text": "That’s awesome you discovered “In the City” and then dove into *The Warriors*! The film definitely has a unique vibe that resonates with the SFF crowd, even if it doesn’t fit the traditional sci-fi/fantasy mold.", "label": 1}
{"text": "That’s such a heartfelt way to remember him. Cochise was a memorable character, and it’s always tough to lose someone who brought so much to their role.", "label": 1}
{"text": "Great choice! Mad Men is perfect for a cozy night in.", "label": 1}
{"text": "The Godfather", "label": 1}
{"text": "Thank god for piracy", "label": 1}
{"text": "Ya-Har matey!", "label": 1}
{"text": "55 burger 55 fries 55 milkshakes", "label": 1}
{"text": "I did not expect that movie to be that good", "label": 1}
{"text": "Just torrent that shit and keep them forever.", "label": 1}
{"text": "Movie should be more longer. It is too short.", "label": 1}
{"text": "Venom", "label": 1}
{"text": "Is venom alive till now?", "label": 1}
{"text": "RIP to him", "label": 1}
{"text": "Nice!", "label": 1}
{"text": "try Fleabag!", "label": 1}
{"text": "Who asked for this", "label": 1}
{"text": "\"More slop for my slop-hole!\" \n\n-- you", "label": 1}
{"text": "* This * has your attention? Really? This perks your ears up huh? Jesus christ", "label": 1}
{"text": "Yeah it'd be awful to never know what happens to who gives a fuck after whatever", "label": 1}
{"text": "You might actually be stupid", "label": 1}
{"text": "Moron redditors in this thread, apparently.", "label": 1}
{"text": "Trolls used to have pizazz ngl. You’re just kinda sad.", "label": 1}
{"text": "Absolutely and I don't think there's anything wrong with that.\n\nNot every movie has to be a thought provoking story rich experience. There's also plenty of room for the just fun movies that don't require much and just make you smile.\n\nThese Jumanji movies gave me a good time, made me smile and even the occasional laugh. I don't see why anyone would have an issue with that.", "label": 1}
{"text": "Shit, you people are the ones in here getting excited about *Jumanji 3* talk about sad. Have you no self respect to speak of?", "label": 1}
{"text": "Not every movie having to be that doesn't mean no movie has to be like that. Please stop subjecting us to these brain dead cash-grabs that you love so much because you can't be burdened with thinking.", "label": 1}
{"text": "Let people enjoy things Jesus. I don’t have interest in this but I’m not gonna shut on someone for being excited for a movie.", "label": 1}
{"text": "Let people hate things Jesus.", "label": 1}
{"text": "You can hate what you like if you just made a comment saying this is dumb or a cash grab I wouldn’t say anything because I don’t care. But why go to someone’s comment who liked something just to insult them.", "label": 1}
{"text": "Here's the thing, dude.\n\nThese movies were actually pretty good. They had just as much heart as the original Jumanji film, which a lot of Millenials consider a classic from their childhood.\n\nThe thing about film, and most entertainment in general, is enough stuff comes out everyone can find something they enjoy. Jumanji 3 coming out isn't going to affect the streamline of movies you want to see, because different groups fund different things. Studio A24 has 9 films in their pipelines, for example, which might cater a lot more to your indie film tastes.", "label": 1}
{"text": "It's a discussion forum? Jesus fucking christ", "label": 1}
{"text": "How many people are you gonna reply to showing you're just a huge pain in the ass? We get it. You're a snob and have the most excruciatingly exacting demands from movies and the rest of us should feel bad about enjoying things. Congrats.\n\nNow kindly fuck off.", "label": 1}
{"text": "You’re not discussing anything you are just shitting on someone.", "label": 1}
{"text": "There are plenty of thought provoking story rich movies if you want to watch them. Like I said there's plenty of room in the market for every time of movie and it's perfectly find that not everyone is going to like everything.\n\nSome days I want Schindler's List. Some days I want Starship Troopers. neither choice is wrong.", "label": 1}
{"text": "Ah, finally a discussion! Whether it's a 'classic' or not is a stupid debate for a bunch of reasons so let's nix that. \n\nThat second part is interesting though, I'd be genuinely curious to know which of those films are getting a wide release, though that's an aside as well. I would counter that the money (and time, and effort, and the simple willingness) being dumped into garbage is taking away from other things, and that movies for children (and adult children) are becoming the dominant mode *at the expense* of other things, and that \"you can find what you like somewhere\" isn't a satisfactory reply because the general silo-ing of stuff isn't a good thing in and off itself, as we've been seeing with lots of other media. That's highly debateable tho, and an interesting discussion to have. Thanks for actually engaging!", "label": 1}
{"text": "If you think three Jumanji movies in 9 years is killing cinema… man, I don’t know what’s wrong with you.  There’s still plenty of good, interesting movies coming out, and the existence of four quadrant blockbusters (which have been a thing for 50 years now) doesn’t keep you from watching them.  Theaters have multiple screens for a reason.  One of the smaller theaters near me still has space for Conclave, The Substance, Saturday Night, and We Live in Time in addition to the “big” movies. And even if there’s nothing you want to see in theaters, guess what?  We live in an era when you have easy access to thousands upon thousands of films from across time and around the globe.  It’s literally impossible to say there’s nothing good to watch.  Insulting people for liking a thing you don’t like in no way makes you intellectually superior.", "label": 1}
{"text": "Someone with taste", "label": 1}
{"text": "Yep! I definitely said, verbatim, \"family friendly films should just never be made ever again.\" I actually have that tattooed in Olde English across my chest. Thank you for speaking in good faith with me!", "label": 1}
{"text": "Are you okay?", "label": 1}
{"text": "Go shower", "label": 1}
{"text": "Calm down lmaoooo you’re so mad and for what 💀 no movie is this serious. You really, truly need to relax.", "label": 1}
{"text": "Well, you gave me a fair few chuckles!", "label": 1}
{"text": "Wow.  And from the profile,  this guy wants to be listed as a certified RT critic....", "label": 1}
{"text": "Again, you mistake contempt for anger. \n\n>i did think the original lotr films were a great film adaptation at the time..\n\nThey weren't good for the time, no.\n\n>rare to see a good film adaptation from a book in general\n\nJackson's slop wasn't a good adaptation. I'm not sure what kind of \"discussion\" you want if you're going to open with such stupid crap. \"The earth is flat why won't you debate me bro?\" Go away.\n\n>just havent heard anyone rag on the fight scenes in those films before\n\nDid you *watch* them? They're fucking terrible. I have no idea why you need me to list off my favorite movies to understand that. You're a big boy, work it out.\n\nLike, what, you want me to list off every decent action/comedy movie ever made? LotR is an action/comedy and it's bad. I don't know, try Googling \"action/comedy movies that aren't crap\"? \n\n>controversial opinions\n\nNot sure what that has to do with anything I said. Like, how am I supposed to respond to that?\n\n>i would rate the hobbit movies as absolute trash\n\nYet you think the LotR movies were \"good adaptations\"??? All you're telling me is that you've never had an independent thought in your life and simply parrot what other people say. Think for yourself and you might catch on to the fact that they're all terrible for the same reasons.", "label": 1}
{"text": "Take 18 credits in college with multiple jobs to pay for your accommodations in today's economy and then you can come and be pissed at me again. I'm literally doing research, I didn't just ask Chat GPT, I've been doing research. I literally don't have the money to buy the book right now but I've been assigned to write an article by my job...", "label": 1}
{"text": "If it's for a job, they should provide the materials you need. If it's a freelance gig, then maybe don't accept it if you can't watch the movie and read the book. \n\nThe audiobook is on Spotify.  I'm sure it's available elsewhere as is the ebook.", "label": 1}
{"text": "Ridiculous and Sad.", "label": 1}
{"text": "Seems like a light sentence for treason, but ok!", "label": 1}
{"text": "Seems harsher than most, somehow", "label": 1}
{"text": "No it doesn't? 1 year for attempted TREASON? When that should be punishable by death? \n\n365 measly days and he'll be back on the streets. That's nothing.", "label": 1}
{"text": "The offense is \"obstructing officers during a civil disorder\" and not nearly as dramatic as you claim.", "label": 1}
{"text": "A film about the current Kristallnacht going on would be good.", "label": 1}
{"text": "You mean \"have your career destroyed by authoritarian totalitarian leftists,\" who are the very \"fascists\" they accuse everyone else of being 24hrs a day? \n\nI agree.", "label": 1}
{"text": "Are you actually suggesting this guy should be put to death for shoving some police?", "label": 1}
{"text": "Was this treason and insurrection, too? Or is it (D)ifferent when *you* do it. https://legalinsurrection.com/2022/01/flashback-may-2020-assault-on-the-white-house-60-secret-service-agents-wounded-president-trump-taken-to-secure-bunker/", "label": 1}
{"text": ">He also used a stolen U.S. Capitol Police riot shield to make a “shield wall” against the police and participated in a push that pinned and crushed a police officer against a door frame.\n\nFuck with cops at the ballot box, not by trying to crush them to death.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Troll. Trying too hard.\n\n\"The leftists are the real fascists for arresting criminals.\"", "label": 1}
{"text": "Using violence to try to overthrow the entire federal government usually ends in one thing, yeah.", "label": 1}
{"text": "Even calling democrats \"leftists\" is hilarious.\n\nRead a book you dumb motherfucker.", "label": 1}
{"text": "My favorite response! \"Read a book.\"", "label": 1}
{"text": "This may be the poorest source I've ever seen anyone use, Ive never seen such biased bullshit trying to pretend to be journalism.", "label": 1}
{"text": "I think if more of them had ended up like Ashli Babbitt very few people would be upset", "label": 1}
{"text": "I think what happened on January 6 was horrible but this is a disgusting and shameful opinion.", "label": 1}
{"text": "Yikes dude. ", "label": 1}
{"text": "Its literally treason. You get more jail time for going awol", "label": 1}
{"text": "I’m not saying I think he should be executed but I am saying he’s getting off easy and, historically, failed coups end in much worse consequences. \n\n\nI do think whoever *incites* a mob and leads them to try to overthrow our democratically elected government, they 100% deserve the fullest extent of legal punishment after standing trial. Up to and including execution.", "label": 1}
{"text": "Getting downvotes for speaking against putting people to death is a new low for you Reddit. Honestly worried for us all if this is popular opinion. ", "label": 1}
{"text": "Erm, I’m a blood thirsty Redditor and want a heckin Civil Warino!! - Shadybrooks93", "label": 1}
{"text": "You have somehow misunderstood my five word comment.", "label": 1}
{"text": "They said it seemed harsher than most. As in the other people getting sentenced. Not that 1 year was harsh for his crime. ", "label": 1}
{"text": "more just consequences for actions. Which is their big fucking thing, that the \"believe\" in", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Oh my, no honey, just stop.", "label": 1}
{"text": "Good response. It's tough when someone is as correct about something, isn't it?", "label": 1}
{"text": "Man's acting like this is the republican totalitarian AAC instead just of a criminal being punished for criminal activity who happened to be commiting crimes because a spray tanned dementia affected career criminal told them to. A spray tanned dementia patient that spent years chanting to his stooges \"lock her up.\" because he wanted to and still wants to use state sponsored violence to round up and punish his detractors and other \"undesirables\".", "label": 1}
{"text": "It was a protest.   Just saying the narrative isn't the left wings views", "label": 1}
{"text": "Shit was more comical than serious idk how people get so worked up over it", "label": 1}
{"text": "How many of these criminals were punished? Can you let me know? I agree. \n\nTell me, can you let me know how many of *these* insurrectionists got jail sentences? 🤔 https://legalinsurrection.com/2022/01/flashback-may-2020-assault-on-the-white-house-60-secret-service-agents-wounded-president-trump-taken-to-secure-bunker/", "label": 1}
{"text": "Wild take.\n\n\"Fuck cops forever but don't like, hurt them uwu\"\n\nTake a fucking stand", "label": 1}
{"text": "I’m just saying you’re flat wrong. Your protesters attacks, people, and your protesters destroyed property all in an attempt to overthrow a democratic election.", "label": 1}
{"text": "God damn your brain is rotted to the fucking core", "label": 1}
{"text": "u/Hyooz is voting for Trump and the party of law and order, everyone.\n\nWill you vote?", "label": 1}
{"text": "I understand. It's an emotional time seeing your friends and family go to jail.", "label": 1}
{"text": "Not even close\n\nFuck cops. Press them against walls with riot shields all day\n\nDon't be fucking wishy washy about your positions just because someone you don't like was accidentally right", "label": 1}
{"text": "Yeah, clearly you dont know long time Antifa provocateur and scumbag (probably a hero to *you*) John Patrick Sullivan, who was dressed like a Trump supporter and one of the first to break in. Long violent criminal extremist history. https://www.newsweek.com/john-sullivan-capitol-attack-leftwing-antifa-1561898\n\nI guess we'll pretend Ray Epps wasnt a thing, either.\n\nYou didnt have to bail out any of THESE rioters, because as usual, it's fine when you do it. https://legalinsurrection.com/2022/01/flashback-may-2020-assault-on-the-white-house-60-secret-service-agents-wounded-president-trump-taken-to-secure-bunker/", "label": 1}
{"text": "Not nearly enough of them unfortunately? What kinda weirdo half assed attempt at a gotcha is \"well they haven't all gone to prison so you can't change the famous ones yet or it's fascism.\"?", "label": 1}
{"text": "It is. I hate living in a 3rd world country, when a Marxist cabal commits a coup, jails their political opponents, and there's a two-tier system of justice. \n\nA country where people like you endlessly wail about \"January 6,\" but dont have a word to say when your side did the exact same thing 6 months earlier. https://legalinsurrection.com/2022/01/flashback-may-2020-assault-on-the-white-house-60-secret-service-agents-wounded-president-trump-taken-to-secure-bunker/", "label": 1}
{"text": "You mean the Jan 6th guided Capitol tour?", "label": 1}
{"text": "I'll wait for you to inform me of which insurrectionists went to jail or where you can even find me the out the outrage for this violent incident from 6 months earlier.\n\nMaybe you need more time.", "label": 1}
{"text": "Seems like you're the one wailing about Jan 6. And I'm not clicking your link to \"legalinsurrection.com\". Lol.", "label": 1}
{"text": "I see.\n\nTry the New York Times.\n\nLol.\n\nhttps://www.nytimes.com/2020/05/31/us/politics/washington-dc-george-floyd-protests.html", "label": 1}
{"text": "Here's The Guardian, another far right publication https://amp.theguardian.com/us-news/2020/may/30/protest-washington-dc-george-floyd-white-house-trump", "label": 1}
{"text": "That's not a gotcha either that's just a time consumptive snipe hunt. What do you even want? A list of people arrested for their crimes on January 6th? Why do I need to google shit for you and what does \n\n>or where you can even find me the out the outrage for this violent incident from 6 months earlier.\n\n>Maybe you need more time.\n\neven mean?", "label": 1}
{"text": "Sinister or The autopsy of Jane Doe also, It Follows", "label": 1}
{"text": "He's shocked that vampires are queer coded and also the villains.", "label": 1}
{"text": "Nigger", "label": 1}
{"text": "That movie took on all the relatable things we dread about jobs—pointless meetings, corporate lingo, and clueless managers—and made them hilarious and painfully real.", "label": 1}
{"text": "I can only imagine how electric the atmosphere was in the theater during that scene! I mean, who doesn’t eventually want to channel their inner Navy lawyer, right? What was the crowd’s reaction like when the infamous line dropped? Did people gasp or cheer?", "label": 1}
{"text": "That’s exciting! Jeremy Allen White has been impressing everyone with his performances, so I’m curious to see how he embodies Bruce Springsteen.", "label": 1}
{"text": "i remember him as Lip Gallagher from Shameless.", "label": 1}
{"text": "Cock", "label": 1}
{"text": "chef(2024), green mile , terminal , little miss sunshine , my sassy girl ,", "label": 1}
{"text": "The level of rage this guy is exhibiting about a 20 year old trilogy is puzzling, but more creepy than anything.\n\nIf you want to chat about the subject, i'd be happy to.  \nI think people need to stop thinking of movies based on books as \"just the book, but visualized.\" That's disregarding the nature of the medium. I used to be more of a purist; for example I remember being pretty irritated over Jackson's changes and additions to the films. But over time I have come to realize a book and a film can simply be kept and seen as completely separate entities. If the film captures the spirit of the book-- keeping the critical messages and themes intact—it's doing a decent job. But what real worth is a film that so replicates a book that every detail is presented in exactly the same way? If I want the book, I read the book. It will do a far better job of \"being the book\" than any movie can. The written word is a completely different art form that uses different techniques to connect the audience to emotion, story, and experience.  \nBut a film that is made to be a distinct experience from its parent property is worthwhile.\n\nThe most literal film adaptations I have ever seen have taken amazing narration from the book and turned them into narration from the main character in the movie. You can't film the narrator's train of thought so let's just have the main character actually narrate off screen! *Stand by Me* did this a little, not that it's a bad film, but it's a cheap and easy way to get the magic of the book on screen. All they're doing is *reading text from the book within the movie*.  One of my film teachers proclaimed this was the height of lazy film making.\n\nThe absolute best film you can make about Middle Earth will *not* be the line by line visualization of the books.  A film will be an interpretation of the book, not simply the book visualized. Otherwise, you only get a mediocre film that doesn't have much reason to exist, except to appease the people who don't bother to read. Film is a medium with its own strengths and weaknesses, and those strengths and weaknesses are completely different to those of a painting, or a novel, or a poem. A good director knows how to play to film's strengths.\n\nThat said, I don't like what Peter Jackson did, though I don't hate the films as a whole. But I also don't think Tolkien's talent was in crafting a literary work, so much as world-building, language, and lore. *The Hobbit* is far more enchanting, to me than *Lord of the Rings,* which at times made me feel like I was reading the Judeo-Christian Bible. I didn't even bother watching his Hobbit trilogy, because I didn't feel it likely he captured the soul of the book. I much prefer the animated version from Rankin Bass!", "label": 1}
{"text": "Did it ever leave?", "label": 1}
{"text": "just to add, on the topic of the hobbit, there is a fan edit (communal effort) that cuts the trilogy down to a couple of hours. i still couldnt get through it (it's rare i dont finish a movie, for context,) but if you were to ever have the urge to watch the hobbit films- that would probably be a more palletable option. I'll have to check out the rankin bass one when my kids are old enough ", "label": 1}
{"text": "Looks like \\*Spellbound\\* is bringing some magical vibes! Can't wait to see how the animation and storyline come together. Netflix always knows how to reel us in with their trailers! ✨📽️", "label": 1}
{"text": "I am drawing such a complete blank on good film adaptations, though I know there have been some which I truly loved.  \nI really should try LOTR again, but I read a lot less these days due to mental health, and have so much waiting for me. I know I may not have given Tolkien the credit he is due; for one, his style is very different to what I like. I tend towards stories that have a close-up focus on the inner workings of individuals and relationships, whereas Tolkien wrote in the epic style. His focus is more on events, but he was setting out to create a mythic British history. The epic is not something that resonates with me in general. However, the lore, the world, the inventiveness are all things I appreciate.\n\nI thought of one movie made from a beloved book that changed quite a lot, yet works as a standalone movie, and that's *Hitchhiker's Guide to the Galaxy.*\n\nThe book is a masterpiece, and probably the one book I'd take with me if I had to leave Earth in a hurry. So it's hard for me to acknowledge a film which kind of guts and remodels it for a lesser product. So I wouldn't call the movie a masterpiece, but it works, and does a decent job of capturing the soul of the books (partially, anyway; the happy ending was a misstep imo). I think a former version of myself might have loathed it for the extreme changes it makes , but a more relaxed TLK says, \"Hey, it was fun, and it doesn't take away from the book.\" Ultimately it can't harm the book. The book is immutable. Definitely superior, but I still enjoyed the movie for what it was.\n\n*Jaws* is definitely one where the film excels as its own entity.\n\nI am also on the side of Kubrick when it comes to *The Shining,* but I don't like Stephen King in the first place, and really enjoy watching Kubrick's version over and over.\n\nI am sure later a few better examples will pop into my head.", "label": 1}
{"text": "Thanks, I may check it out but I am not sure I am interested enough even for that. \n\nI watched the Rankin Bass version when I was 4 or 5, never too young! Unless your kids are 2. That may be too young.", "label": 1}
{"text": "you mean boomerang haha", "label": 1}
{"text": "100% with you on hitchhiker's guide. time to watch that again. this is a book i intend to read to my kids when they're older too.. made a huge impression on me at a young age with its sense of humour and appreciation of bizarre, wacky concepts. adams was brilliant... the dirk gently show was a bit off the rails for my tastes, which is a shame because i loved the books. also agree on kubrick > king on the shining! i just had the thought - there could maybe be a very creative adaptation of Slaughterhouse 5.. that would be an accomplishment.   ...if you do want to bite into lotr again, and are into audiobooks, there are two excellent versions, one by Phil Dragash (fan done, unofficial) and", "label": 1}
{"text": "Well, you DO need someone else on the other side of the torrent... :P", "label": 1}
{"text": "ooh i see hehe good point!", "label": 1}
{"text": "It will sweep the Oscar’s because it’s gay", "label": 1}
{"text": "MEAN GIRLS!!", "label": 1}
{"text": "you desperately need to touch grass", "label": 1}
{"text": "Hey there,\n\nCaroline Lindy, the director of **Your Monster** is doing a live AMA/Q&A in /r/movies today (Tuesday 10/29). It's live now, and she'll be back for answers at 5 PM ET today. Please feel free to join in if you have a question/comment/upvote for her. Any participation is appreciated :)\n\nhttps://www.reddit.com/r/movies/comments/1gexv2y/hi_rmovies_im_caroline_lindy_director_of_your/", "label": 1}
{"text": "Brownfinger?", "label": 1}
{"text": "Why didn't you just scrap the sign and make a new one when you realised you were going to write 5:30?", "label": 1}
{"text": "Should have streamed for pay on Halloween as this would be a kid friendly movie to watch at home while handing out candy. Big missed revenue opportunity. ", "label": 1}
{"text": "Who hurt you?", "label": 1}
{"text": "Your mom.\n\nCan a nigga just hate creepy old men who make movies?", "label": 1}
{"text": "Jesus christ dude, ive given you the information and the link to go read up on him. Im done. Accept the facts or dont, just stop being a bitch about it.", "label": 1}
{"text": "Eh, there’s a lot to like in the latter half of the series. It’s gets pretty masturbatory and long-winded at times but there’s more good than bad, Id say. I also really like _The Wind Through the Keyhole_.", "label": 1}
{"text": "I was irked by Idris because Roland’s race and appearance are very central to the plot, but in the context of the limited scope of that movie it doesn’t really matter.", "label": 1}
{"text": "There's so much new shit they can spoof now", "label": 1}
{"text": "That’s wild! Last-minute casting decisions can really shake things up. One that comes to mind is when Jack Nicholson was cast as the Joker in \\*Batman\\*—totally iconic! It’s crazy to think they almost went with someone else. Or how about when Viggo Mortensen stepped in for Aragon in \\*Lord of the Rings\\*? That was a major save! It’s like the universe is telling us sometimes the best ideas are the ones that happen when you’re running out of time. Keep those happy accidents coming!", "label": 1}
{"text": "Just commenting to inform, the user that posted this has been revealed to be a paid Harris campaign staffer directed to astroturf Reddit, participating in wide-scale brigading.\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\nMany of the commenters here are also paid staffers.", "label": 1}
{"text": "You can't possibly believe that Longlegs was a good movie, right? It was complete trash and there's simply no way you don't know that. What deal with the devil did you make to get positive reviews from critics?", "label": 1}
{"text": "Coherence sucks.. The hype this movie gets is unbelievable.\n\nRetardation is contagious it seems", "label": 1}
{"text": "Hello there children.", "label": 1}
{"text": "It was made on a 50k budget with a plot 100x better than the garbage in the theaters. It was realistic, fun, unsettling and creative. It punches way way above its weight. But pray tell, why does it suck?", "label": 1}
{"text": "Coherence is like that mind-bending ride at the amusement park that you didn’t know you needed! It’s amazing how a low-budget film can mess with your head so much. I swear, I felt like I needed a flowchart just to keep track of who was who and what was going on. \n\n\n\nThe realness of the characters made everything even creepier—like you could totally see them at your next dinner party, just casually discussing parallel universes while the cake is getting cold. If anyone asks me for a recommendation for a movie that’ll leave them questioning reality, I’ll just hand them a copy of Coherence and say, “Good luck!”", "label": 1}
{"text": "Cause of the plot hole everyone missed.\n\nGo find it.\n\nRetardation is contagious..\n\nIt sucks.", "label": 1}
{"text": "I'm PM you.", "label": 1}
{"text": "They're just pissed off because they didn't understand it.", "label": 1}
{"text": "Sounds like you had an awesome experience with Frailty! It really is one of those hidden gems—so creepy and atmospheric, with that perfect mix of simplicity and depth.", "label": 1}
{"text": "Great recommendation! Triangle is a wild ride and definitely one of those movies best experienced with as little info as possible.", "label": 1}
{"text": "Watch on WeShort. High quality short movies", "label": 1}
{"text": "Frailty is such an underrated gem!", "label": 1}
{"text": "Nice lineup! Sounds like you’re diving into some awesome psychological thrillers. If you're into mind-benders and unreliable narrators, you might also enjoy The Machinist or Shutter Island", "label": 1}
{"text": "That one is definitely a trip! It's What's Inside has such a unique approach—keeps you questioning everything from start to finish.", "label": 1}
{"text": "Try WeShort platform for streaming short movies", "label": 1}
{"text": "Good fucking god you're a pretentious wanker. \n\nBore off.", "label": 1}
{"text": "I just don't care enough and have much better things to do than trade opinions with cunts on the internet.", "label": 1}
{"text": "I wouldn’t call anything in the movie a plot hole, it’s about things dealing with time and space that we ink have theories about so any “ plot holes” you think you’re talking about would be pretty easy to explain away", "label": 1}
{"text": "predators (2010)  \nnow you see me (2013)  \nThe Dark Knight (2008)", "label": 1}
{"text": "\"American audiences who can't handle true horror\"\n\n  \nWhat a dumb fucking thing to say. Like, really really idiotic.", "label": 1}
{"text": "But not entirely incorrect", "label": 1}
{"text": "What a dumb fucking thing to reply. Like, really really idiotic.", "label": 1}
{"text": "You're surprised that professional public speakers are trained to speak well?", "label": 1}
{"text": "🙈🙊🙉", "label": 1}
{"text": "If there’s a scene where he flings his own shit at members of Take That, I *might* torrent this.\n\nOr if there’s a Kylie cameo :)", "label": 1}
{"text": "I'm fantasizing about eating u/toomanyfilms1983", "label": 1}
{"text": "With typically autistic bluntness.", "label": 1}
{"text": "This looks retarded", "label": 1}
{"text": "Who is us nigga?", "label": 1}
{"text": "I recommend watching Outside 2024", "label": 1}
{"text": "There is water in the air... This movie was so close to being good.", "label": 1}
{"text": "I dont think they even sneak anymore kids just straight up go lol", "label": 1}
{"text": "Nothing to explain really, I don’t think their is any plot holes but if you think there is one you can pretty easily wash it away with the fact the movie is dealing with alternative realities, chaos theory and parallel universes that we don’t really fully known exactly what the rules are and how it all works for 100%", "label": 1}
{"text": "aw... my condolences to her family.  🙇‍♂️🙏", "label": 1}
{"text": "Shut up. The movie sucks and its the usual dumbass crowd overhyping these kind of movies", "label": 1}
{"text": "I thought this shot was the original one", "label": 1}
{"text": "I didn't watch it cuz it im a plot kinda guy,  but Crawl (2019) might be the movie for you...", "label": 1}
{"text": "one of the most unsettling piece of media ever made", "label": 1}
{"text": "You know that all characters work that way, right? That's why they're characters in a plot.", "label": 1}
{"text": "And I think that’s the key. Dude got cancelled for weird kinks that sounded pretty consensual to me. Feel bad for him.", "label": 1}
{"text": "Rest in Peace, Queen", "label": 1}
{"text": "Massive", "label": 1}
{"text": "That’s a think piece with zero validity and all accusations.", "label": 1}
{"text": "Until proven in a court of law. Everyone is able to and should have due process. Guilty until proven innocent is what you’re advocating for here.", "label": 1}
{"text": "Maybe seek therapy dude 😂 movie was awesome, especially for its low budget", "label": 1}
{"text": "I could and it might help me.\n\nBut there's no therapy for retardation, which is your case.\n\nEnjoy being a fucking abled retard..", "label": 1}
{"text": "Yeah it was just way too woke. They even changed factual parts of the story to make her seem like a bad ass independent women. In reality, according to facts, she was a very shy hoe, who was poor, and willing to hoe out for a check. Do your research. Even the questions she asked during the show were all preplanned she didn’t ask her own", "label": 1}
{"text": "All my favorite channels and no issues – Tigus4k .com is perfect!", "label": 1}
{"text": "Can’t recommend Nexus4kTV .com enough. Best IPTV provider!", "label": 1}
{"text": "Well, you certainly live up to that description of yourself. God, you’re weird.", "label": 1}
{"text": "no you haven't", "label": 1}
{"text": "That guy who had that one song thirty years ago?", "label": 1}
{"text": "..... was this written by Rodney Alcala?", "label": 1}
{"text": "Oh! I didn't know about Annecy Fest! I'll check it out!\nGonna be watching The Wild Robot tomorrow and can't wait for Memoir of a Snail! :>\nGhost Cat Anzu seems up my alley. Thank you!", "label": 1}
{"text": "Oh! I didn't know about Annecy Fest! I'll check it out!\nGonna be watching The Wild Robot tomorrow and can't wait for Memoir of a Snail! :>\nGhost Cat Anzu seems up my alley. Thank you!", "label": 1}
{"text": "Oh! I didn't know about Annecy Fest! I'll check it out!\nGonna be watching The Wild Robot tomorrow and can't wait for Memoir of a Snail! :>\nGhost Cat Anzu seems up my alley. Thank you!", "label": 1}
{"text": "George. Tim Allen  Jane. Geena Davis  Rose. Rose O'Donnell  Judie. Alicia Silverstone  Elroy. Do not know Mr. Spacely. Danny Davito", "label": 1}
{"text": "Yeah right", "label": 1}
{"text": "Yeah it is", "label": 1}
{"text": "Yeah", "label": 1}
{"text": "Hey Lynda", "label": 1}
{"text": "The Cabin in the Woods is an interesting pick for this! It technically has a “happy ending” depending on how you look at it, and most of the cast survives right up until the end. It’s pretty unique in that it subverts the usual horror expectations while leaving you satisfied—if a little mind-boggled.\n\nArachnophobia is another fun one where most of the cast makes it, and they wrap up with a sense of humor that keeps things light. Perfect for a Halloween movie night when you want that balance between scares and a safe-ish ending.", "label": 1}
{"text": "That's awesome! Kelly's Heroes really has that timeless charm—equal parts humor, action, and camaraderie that hits just right. And your daughter has great taste already if she's appreciating movies like that! I think Escape From New York and Big Trouble in Little China are going to be a blast for her too. Those films have that gritty ‘80s vibe with so much personality. Solid lineup you’ve got going.", "label": 1}
{"text": "I agree, the apocalyptic look + the radiation looking heat is what makes it for me", "label": 1}
{"text": "Maybe Forgiving Bill is better", "label": 1}
{"text": "not a finale but when Michael Corleones wife blows up in the car", "label": 1}
{"text": "Click on the fucking link, dummy.", "label": 1}
{"text": "Didn't say you could. Dummy. My post is asking for something available. I politely told you that something unavailable doesn't help me in the current situation, and thanked you anyway. How does any of this warrant name calling and being rude? Take a break man.", "label": 1}
{"text": "Try not editing your comments 3 times. Just put a new comment u fucking weirdo man. Touch grass, make friends, get a girlfriend and stop getting angry you fucked up one time and wasn't useful. Like I said. Take a break. Enjoy life.", "label": 1}
{"text": "This is hilarious. If you follow his link, scroll down to \"download options\" and click on the mpeg4 link, you can ABSOLUTELY watch this movie, right now. Literally what I'm doing at the moment, because I  loved this movie as a kid, too. You could definitely suck less, though.", "label": 1}
{"text": "Hey soldier, $ hoping to rim you again $", "label": 1}
{"text": "Been such a long time since I've seen you on line.\n\nYou still have the STACHE?", "label": 1}
{"text": "Billy Zane definitely has the intensity to take on a complex figure like Brando, especially during such a pivotal time in Brando's career.", "label": 1}
{"text": "Right? It’s almost uncanny! Billy Zane really channels that Brando vibe—he’s got the same piercing eyes and the whole brooding intensity down.", "label": 1}
{"text": "looks so cool!", "label": 1}
{"text": "Chris Sullivan was amazing as Toby! He brought such warmth, humor, and sincerity to the role, especially with those unforgettable grand gestures.", "label": 1}
{"text": "I'd have to say Artax from *The NeverEnding Story*. That scene is a gut-punch, especially for anyone who watched it as a kid.", "label": 1}
{"text": "I’d go with Mufasa in *The Lion King.* His death is one of the most heartbreaking moments in animated history and shapes Simba’s whole journey", "label": 1}
{"text": "Was going to suggest Carnage too. Absolutely fantastic!", "label": 1}
{"text": "i love it!", "label": 1}
{"text": "Creepy fuck. Dirty ass dem 🤣 you are sick in the head. No wonder you’re voting for Kamala", "label": 1}
{"text": "I've seen most of these I'd say but bookmarking your comment for the rest! I appreciate such a long response! Thank you so much! :>", "label": 1}
{"text": "Ooooh, the style looks very different, thanks!", "label": 1}
{"text": "I graduated from HS in 04 and college in 08 and everyone still said fag. They weren't actually calling you gay though. It was more of an insult the same way \"mother fucker\" is. Nobody is actually accusing you of fucking your mom. Lol.", "label": 1}
{"text": "Oh man, same. Littlefoot’s mom’s death in The Land Before Time was such a gut-wrenching moment, especially as a kid.", "label": 1}
{"text": "Joseph Gordon-Levitt teaming up with Darren Aronofsky and the writer of Black Swan? This is bound to be a wild ride! JGL has such a good range and seeing him tackle something horror-focused with Aronofsky's twisted style is going to be intense!", "label": 1}
{"text": "You're the best man, thank you.\nI've seen alot of these as well but some I haven't, adding them to my letterboxd watchlist, thanks for the response!", "label": 1}
{"text": "They used the footage? What made them think its fine to do that, thats kinda insane", "label": 1}
{"text": "Critics are wrong. The Dark Knight is terrible and everyone on Reddit agrees with me.", "label": 1}
{"text": "Caesar? Is that you? 💀😭🙏", "label": 1}
{"text": "10", "label": 1}
{"text": "Yes, and it wrecked me too man. I was so so happy it had a happy ending.", "label": 1}
{"text": "I'm really excited to see this!", "label": 1}
{"text": "I think it's gonna be a nice movie. Can't wait to see this!", "label": 1}
{"text": "Hey there,\n\nMary Dauterman and Grace Glowicki, the director and lead actress of **Booger** are doing a live AMA/Q&A in /r/movies today (Thursday 10/31). It's live now with answers at 5 PM ET. If you'd like to join in with a question/comment/upvote, it would be much appreciated here:\n\nhttps://www.reddit.com/r/movies/comments/1ggflss/hi_rmovies_we_are_mary_dauterman_and_grace/", "label": 1}
{"text": "Spamming this to basically every reply over 2 months later is just bad form.", "label": 1}
{"text": "You might disagree.\n\nBut the fact that this sub AND Reddit both have independent “no spam” rules would tend to suggest people disagree.", "label": 1}
{"text": "Wow. Yet another “mod power goes to their head and think the rules don’t apply to them”.\n\nDon’t worry, I’ll use the spam report that goes to the admins.", "label": 1}
{"text": "Omg wait you had it worse, give the baby some love from me too <3", "label": 1}
{"text": "Honestly, I get him.", "label": 1}
{"text": "Since I am linking videos, something a litttle different.\n\n5 Overlooked Films Ep 23 - Mainstream Horror Flops\n\nhttps://youtu.be/Oc26FaAVpzg", "label": 1}
{"text": "It enrages me how dumb everyone is. You're exactly right and that dude just thinks more = better, which is probably rarely true and probably NEVER true with A.I. writing movies. Wtf does everyone think a movie even is anymore. Also The Russo Bros suck and this is a really shitty thing.", "label": 1}
{"text": "I hated how most of it was just hallucinations", "label": 1}
{"text": "For me it's Requiem for a Dream. This intense drama is tough to digest, and if friends are joking around, it can really undermine its powerful impact.", "label": 1}
{"text": "That greasy ponytail deserves an Oscar in its own right. Such a haunting look.", "label": 1}
{"text": "Cant wait for this one, excited", "label": 1}
{"text": "And this one will be crazy good i can feel it", "label": 1}
{"text": "I never even saw it will be released, looks great maan", "label": 1}
{"text": "Your taste in movies is so bad lol. You should go high five my neighbour who also didn't like it. You're both fucking dumbasses.", "label": 1}
{"text": "Sounds intriguing, but I’m just hoping Idris has enough time to take a break from being a suave hero to fit this into his schedule. Are there any plot details out yet, or is it all still under wraps?", "label": 1}
{"text": "Lol who are you? Hack hater", "label": 1}
{"text": "Probably because you’re a faggot", "label": 1}
{"text": "Maybe explain what OTT even is before going on a rant", "label": 1}
{"text": "Maybe you can't control your weiner so that's why you look offended. I'm a regular OTT viewer and my post is just one observation. It doesn't mean I'm against the whole idea of OTT.", "label": 1}
{"text": "try watching tv without your dick in your hand and it’ll blow your mind", "label": 1}
{"text": "Just watched the Joker sequel and its kinda insane how letdown it is especially The Joker is so recent to everyone's mind", "label": 1}
{"text": "Just watched the Joker sequel and its kinda insane how letdown it is especially The Joker is so recent to everyone's mind", "label": 1}
{"text": "Letters to Juliet with 43%. It's one of my fave chick flicks of all time.", "label": 1}
{"text": "You're missing out on some wild rides—start with a classic like 'The Shining'!", "label": 1}
{"text": "rekindling this ! \n\nI've watched it again last night and wanted to get hold of the soundtrack and just realized how nerds stay nerds... The cheapest copy you can get of the CD is £75 !!!! and no way to listen offline otherwise. no torrent, no iTunes, no Qobuz nothing... anyone with a download link ?\n\n[https://www.discogs.com/release/8502988-Basil-Poledouris-Starship-Troopers-Original-Motion-Picture-Soundtrack](https://www.discogs.com/release/8502988-Basil-Poledouris-Starship-Troopers-Original-Motion-Picture-Soundtrack)", "label": 1}
{"text": "it will always be white chicks for me", "label": 1}
{"text": "oh \n\nI thought he was just playing and doing a Halloween thing", "label": 1}
{"text": "is this a film on how infra cameras work?", "label": 1}
{"text": "Willem Dafoe as Nosferatu is a chef’s kiss choice. Dude already looks like he was born to play a vampire. I remember him in Shadow of the Vampire where he kinda played Nosferatu, and it was nightmare fuel. Can’t wait to see what he does in a full on role", "label": 1}
{"text": "Deep throat", "label": 1}
{"text": "Literally Joker 1 and Joker 2", "label": 1}
{"text": "Are you retarded?", "label": 1}
{"text": "He will be better than Heath Ledger.\n\nThe Dark Knight is now widely regarded as one of the most mediocre films in cinema history. Initially, its success was attributed to a collective delusion that blinded audiences to its many flaws. Over time, this illusion shattered, and the film is now largely rejected by critics and viewers alike. Once praised as a masterpiece, its reputation has diminished, and mentioning it positively online invites mockery. The remaining fanbase is small and often ridiculed. Critics now highlight the film’s wooden performances, clunky dialogue, and bloated runtime. Even Heath Ledger’s Joker, once revered, is now seen by many as exaggerated. In the end, The Dark Knight is remembered as a film whose hype outpaced its quality, a once-celebrated work that has since been relegated to irrelevance and derision.", "label": 1}
{"text": "Makes sense why I'm already seeing it on torrent sites today.\nFree is the most I was willing to pay out of curiosity, so I got that going for me.", "label": 1}
{"text": "Hollywood is democrat because most sane public figures are. \n\nNobody wants to publicly support a rapist like trump ", "label": 1}
{"text": "You think it worth it ?", "label": 1}
{"text": "Matey, he's not suggesting streaming subscriptions as an alternative.", "label": 1}
{"text": "Trollbait dumbfuck", "label": 1}
{"text": "“Yeah you’d like that faggot” step brothers - Derek", "label": 1}
{"text": "I'm your internet service provider. And I'm very disappointed in you.", "label": 1}
{"text": "But that's not \"a franchise\" that's only two movies in a franchise that has over 10 movies. You can't say one franchise unless you're counting the entire franchise", "label": 1}
{"text": "This is wrong. Both Bruce Campbell AND Sam Raimi and the multiple episodes of Ash vs Evil Dead confirm this and you would know if you actually bothered to do any actual research instead of making blind assumptions about things you don't know anything about", "label": 1}
{"text": "\"are there any good christian churches for muslims around here?\"", "label": 1}
{"text": "Your criteria doesn't make any sense", "label": 1}
{"text": "The Dark Knight is now widely considered mediocre, often discussed in the same breath as disappointments like Suicide Squad or Black Adam. Online, it mostly attracts criticism: dated plot, overly dark tone… The few fans who still defend it are often mocked, with their attachment seen as nostalgic or even naive. For many, The Dark Knight has become an outdated relic that failed to keep up with the evolution of the superhero genre.\n\nIt’s not good -> 2/10", "label": 1}
{"text": "I really enjoyed this movie back in the day when I was younger and I first saw it, but I did a rewatch a few years ago and I didn't think it held up well at all. It was really bad lol", "label": 1}
{"text": "he would definitely fit the role!", "label": 1}
{"text": "i should definitely watch this show!", "label": 1}
{"text": "Yeah, he’s definitely had a tough time sticking the landing lately. It’s like he’s so focused on the big twist that the rest of the story gets a bit neglected", "label": 1}
{"text": "That’s a fair point! For all the ups and downs, at least Shyamalan is taking risks and trying to bring fresh ideas to the table instead of churning out formulaic sequels.", "label": 1}
{"text": "Literally won’t watch anything he does after spewing nonsensical biological impossibilities to pander towards the mentally ill.", "label": 1}
{"text": "true! *The Sixth Sense* and *Split* were brilliant, but his more recent films seem to lose that original spark.", "label": 1}
{"text": "He looks so different every single time I see him.", "label": 1}
{"text": "Another big one is *Braveheart*. They have these sweeping scenes of rugged, mountainous terrain in the Battle of Stirling, but the actual location in Scotland is more flat than dramatic.", "label": 1}
{"text": "Really???", "label": 1}
{"text": "Wow 😘", "label": 1}
{"text": "I don't think so, you aren't saying the truth!!", "label": 1}
{"text": "Hmmmm....🤔", "label": 1}
{"text": "I remember reading about all of that and laughing my ass off. Then once that wore off, I genuinely started feeling worried about the mental health of the people in our Country. It's a crisis that hasn't really been addressed by anybody in politics. \n\nI saw JD Vance discussing this on Joe Rogan yesterday, so hopefully we'll see more attention brought to it over the next few years after he and Trump get in to the White House.", "label": 1}
{"text": "I'm not a troll. I just wholeheartedly support the Trump and Vance ticket, and think they're what's best for this Country. I'm also positive that they're going to win. \n\nSo, with that being the case, hopefully we can get this Country back on and track and also make some positive changes. JD Vance seems to care about a lot of these things.", "label": 1}
{"text": "JD Vance seems to care quite a lot. I'm optimistic about him.", "label": 1}
{"text": "Reinstating his stay in mexico policy alone (which he can do via executive order) will do wonders for this Country and make a helpful dent in to the Housing crisis and job market. Not to mention his other Executive Orders and policies which lead us to an absolutely wonderful economy until covid crashed it.\n\nIt'll be really nice to get all of that back again, instead of another four years of this failure we call Bidenomics. Harris would be an absolute disaster for this Country. She has no clue what she's doing. I'm glad she's going to lose.", "label": 1}
{"text": "I genuinely wish that were an option. I've been looking for a torrent of this for weeks (ever since it finally released in the US, and annoying ONLY in the US).", "label": 1}
{"text": "I'm not wrong. More Illegal Immigrants = Less Available Houses for Americans. This is true in Canada - ask any Canadian about it because it's happening there. And it's true here. \n\nAnd Trumps economy was fantastic. Linking a bunch of biased articles in an attempt to gaslight Americans isn't going to work this time. We've all felt it in our pockets. What has Biden done to contribute to high gas prices? His absolute failure to drill in the US. His Government spending on impractical green energy replacements for oil that can't possibly replace oil, at the expense of the actual oil industry which we need for our energy and gasoline. The Democrat parties general response to covid where Democrat Governors and the Party insisted on longer lockdowns which lead to an even more drawn out economic downturn. That was absolutely crippling. \n\nI know how much my groceries and gas and rent and utilities cost during the Trump administration, and I know what happened to it all during the Biden administration. Again, you're not going to be able to gaslight us this time with walls of text and link dumping. \n\nNone of this really matters at this point, as I've already cast my vote for the Trump / Vance ticket, and they're going to win. Harris already lost, we're just waiting for the 5th to come and go so we can make it official. \n\nThank god. Now things can finally actually start to improve.", "label": 1}
{"text": "I didn't read any of that. You should stop flooding, it's a waste of time and space. \n\nKamala has already lost and you know it deep down. You're in the denial stage. It will pass.", "label": 1}
{"text": "I think Trump and Vance are going to do a wonderful job.", "label": 1}
{"text": "Lefties are so ignorant these days. It’s such a shame.", "label": 1}
{"text": "> I can’t back up my claim because I am lying\n\nFixed that for you.", "label": 1}
{"text": "Then it’s wasting time on someone he things he’s a magat despite saying the opposite.\n\nLefties are so pathetic they can’t even live by their own rules.", "label": 1}
{"text": "*pats you on the head*", "label": 1}
{"text": "Typical lefty.\n\n- Resorts to name calling\n\n- Can’t backup own claims\n\n- Gets told what to think as he cannot think for himself\n\n- Says one thing and does the opposite\n\n- Can’t live by his own rules\n\n- Runs away", "label": 1}
{"text": "If you supported Biden than by your own rules you can no longer touch yourself ever again. Congratulations.", "label": 1}
{"text": "Wow, so he made it over two hours into an unscripted interview before he stumbled?\n\nPretty good going.", "label": 1}
{"text": "How dare people need mental health support when an admitted rapist becomes president? You dense idiot.", "label": 1}
{"text": "This movie has a bad reputation on Reddit but it’s still a good choice.", "label": 1}
{"text": "The fact that we’ve successfully convinced them all to forego vaccines for at least two generations.", "label": 1}
{"text": "are u still there", "label": 1}
{"text": "👍👍🤗🤗", "label": 1}
{"text": "The Good, the Bad, and the Ugly and it's not even close!\n\nThat movie kicks so much ass.", "label": 1}
{"text": "I didnt say he did i just thought of it as a possibility watching the movie", "label": 1}
{"text": "The Dark Knight is now widely regarded as one of the most mediocre films in cinema history. Initially, its success was attributed to a collective delusion that blinded audiences to its many flaws. Over time, this illusion shattered, and the film is now largely rejected by critics and viewers alike. Once praised as a masterpiece, its reputation has diminished, and mentioning it positively online invites mockery. The remaining fanbase is small and often ridiculed. Critics now highlight the film’s wooden performances, clunky dialogue, and bloated runtime. Even Heath Ledger’s Joker, once revered, is now seen by many as exaggerated. In the end, The Dark Knight is remembered as a film whose hype outpaced its quality, a once-celebrated work that has since been relegated to irrelevance and derision.\n\nIt is often discussed in the same breath as disappointments like Suicide Squad or Black Adam. For many, The Dark Knight has become an outdated relic that failed to keep up with the evolution of the superhero genre.", "label": 1}
{"text": "Respond to my chat message.", "label": 1}
{"text": "You got your wish!", "label": 1}
{"text": "The Substance", "label": 1}
{"text": "*Hold Your Breath* (2024) with Sarah Paulson: just watched it and there is a scene where shes talking to her children, one shot her hair is in a braid, the next it's down! Just annoys me how it was so poorly missed.", "label": 1}
{"text": "I always wondered if Bruce Willis was genuinely talking them out of it because he knew it was a bad idea or if he was just playing it up to pretend like he's against it. They never quite establish one way or the other which one it was, but I think they do sort of hint that he wanted it to happen because he was the one who grabbed the Sheikh in the first place. \n\nI've always felt that film should have served as more of a cautionary tale than it did. You can see in that film just how bad it is for the Army to be deployed on U.S. soil, in fucking New York of all places, even without dropping bombs or firing a shot, so you'd think people would think \"hmm, maybe we shouldn't invade a foreign country because this is what will happen, but worse, much fucking worse\".", "label": 1}
{"text": "It's funny you mention Jackie Chan because I remember those films. I think he did three or four of those films in the 90's where the bad guy was a white dude. I think it was Mr Nice Guy, First Strike, Who Am I? and Rumble in the Bronx. They weren't American, they were usually European or Australian. I remember them because they're really the only Jackie Chan films I've ever seen.", "label": 1}
{"text": "Sounds like a hidden gem! Who knew a movie about a robot could tug at the ol' heartstrings while keeping it all family-friendly? It's nice to hear that it didn’t dive headfirst into the cheesy pool, which is a refreshing change in animated films. Sometimes, you just need a good story and some pretty visuals to remind you that not all heroes wear capes—some of them just have metal arms! Definitely adding this one to my watchlist for when I need a break from reality. Thanks for the recommendation!", "label": 1}
{"text": "Absolutely! The Nazgûl are haunting with their relentless pursuit and eerie presence. Their piercing shrieks, dark cloaks, and the sheer sense of dread they bring make them truly unforgettable villains. Tolkien crafted them perfectly to instill fear and tension throughout the series.", "label": 1}
{"text": "https://youtu.be/TkYXJit9LcM", "label": 1}
{"text": "Cool", "label": 1}
{"text": "One thing I absolutely love in movies is a well-timed, unexpected twist. It's that moment when the plot takes a turn you didn't see coming, and suddenly everything you thought you knew about the story changes. Keeps you on the edge of your seat!", "label": 1}
{"text": "for clichés, I have a soft spot for the classic “found footage” trope. It’s become a bit overdone, but the way it can add a layer of suspense and intimacy still gets me.", "label": 1}
{"text": "Those wrap-up moments where we get a glimpse into what happens to the characters after all the chaos can be so satisfying. It feels like a nice way to tie up loose ends and gives a sense of closure", "label": 1}
{"text": "Totally agree! The Nazgûl are some of the scariest characters ever. Their design and the way they show up create such a creepy vibe. That chilling scream of theirs is unforgettable!", "label": 1}
{"text": "Absolutely! The design of the Nazgûl really captures their eerie presence, and the audio adds to the fear.", "label": 1}
{"text": "The appeal of those classic 70s rock songs in trailers, even if these clichés are overdone, they still have a charm that keeps us coming back for more.", "label": 1}
{"text": "*The Witch* really does have an unforgettable take on Satan—so eerie and unsettling without needing flashy effects", "label": 1}
{"text": "The way it’s done off-screen just makes it even creepier, letting your imagination fill in the blanks.", "label": 1}
{"text": "That's take a long time to implement, and by the time they do, Mila Kunis will be old and ugly", "label": 1}
{"text": "Not enough people turn off their phones when watching a movie.", "label": 1}
{"text": "those horror movie cliches. Give me ominous forest shots and jump scares any day; I'll be glued to the screen!", "label": 1}
{"text": "when a character’s all confident saying, \"Don’t worry, I’ve got this,\" and then smash cut to them *definitely* not having it under control.", "label": 1}
{"text": "Good chemistry between characters. Whether it's a romance, friendship, or rivalry, believable chemistry between actors makes everything more engaging.", "label": 1}
{"text": "Dogs", "label": 1}
{"text": "same!", "label": 1}
{"text": "Yeah, sure. Just keep looking out across the water.", "label": 1}
{"text": "sorry my comment offends you and is living in your head rent free lol", "label": 1}
{"text": "Thanks GPT 🙂", "label": 1}
{"text": "Fuck off, I looked up millenial actors.", "label": 1}
{"text": "A lot !", "label": 1}
{"text": "For sure !", "label": 1}
{"text": "Nevertheless.", "label": 1}
{"text": "It was amazing and a lovely depiction of motherhood.", "label": 1}
{"text": "It's a *great* poster.", "label": 1}
{"text": "This is a great film.", "label": 1}
{"text": "Such a nice movie.", "label": 1}
{"text": "Final Destination 3 is actually my favorite.", "label": 1}
{"text": "Cool idea.", "label": 1}
{"text": "That was insane 😳", "label": 1}
{"text": "Hello friends nice to see you here", "label": 1}
{"text": "The films are really very poor, Peter Jackson did not know how to adapt the universe of Tolkien. There is no real cinematic quality in this trilogy, it’s just CGI bad taste and Hollywood fast-food style show. I’m just making this comment to say that I’m tired of seeing these films cited in the discussions, they’re not good, they’re passable at best.", "label": 1}
{"text": "Aww man lol 😭 What about a phone number?", "label": 1}
{"text": "Kingsman, Drunken Master 1 and 2, Polite Society, Tropic Thunder, Tag, Scott Pilgrim and loads more! :)", "label": 1}
{"text": "I might be in the minority, but the Before Trilogy. I love Midnight <3", "label": 1}
{"text": "I agree that DVDs had a lot of charm with all the extra features. The commentaries and making-ofs added so much depth to the viewing experience.", "label": 1}
{"text": "I feel you! Salieri really does get under your skin, doesn't he? It’s like watching a car crash in slow motion—so much talent and passion on one side, and that sneaky jealousy on the other. Poor Mozart just wanted a friend, and instead, he got a frenemy with a side of passive aggression.\n\n\n\nAnd can we talk about the music? Every time you think it's going to lighten up, it pulls at your heartstrings even more! It’s a beautiful mess that leaves you both appreciating Mozart's genius and wanting to throw Salieri out a window. But hey, at least now you know what it feels like to have a classic pain in your chest!", "label": 1}
{"text": "The problem with The Substance is that some members of the technical team liked The Dark Knight. \n\nThe Dark Knight is pretty bad to be honest, it aged poorly and it has a bad reputation today. \n\nMost of the comments on Reddit about the film are negative. It is by far the most despised film on the internet and for good reason.", "label": 1}
{"text": "What in the AI nonsense is this?", "label": 1}
{"text": "> It is by far the most despised film on the internet\n\nPress X to doubt", "label": 1}
{"text": "In conclusion, ChatGPT is a fine product with many useful features.", "label": 1}
{"text": "Absolutely! Moon really flips the script on that AI trope, doesn’t it? It’s refreshing to see a film where the machine isn’t out for blood and instead acts as a genuine friend when humans are being total jerks. And the whole twist about the nature of humanity in that film is pretty mind-blowing. Who knew that a robot could have more heart than a room full of corporate drones? It’s like the movie was saying, “Congratulations, you’re now outsmarted by your own tech.” Just goes to show that sometimes the cold, unfeeling machines are the ones with the best intentions—while the humans are busy playing checkers, the AI is out there playing chess!", "label": 1}
{"text": "The Invisible Man！", "label": 1}
{"text": "Deadpool and wolverine.", "label": 1}
{"text": "That’s hilarious!", "label": 1}
{"text": "Exactly! lol", "label": 1}
{"text": "why do i get this bullshit post on my homefeed everytime i make a new account? i don't care for you", "label": 1}
{"text": "Lmao.", "label": 1}
{"text": "Oh?", "label": 1}
{"text": "Platforms like YouTube, social media bots from Russia, lmao, you ever try to comment a pro Harris comment on a Fox News YT channel? It gets pushed down or deleted. It’s cracked. I’m sure Reddit mods/ceos would delete this soon too lmao. Censorship is out the window, especially when it comes to automated systems that control them - Russian bot farms on YT promoting Trump etc lmao.", "label": 1}
{"text": "Lmao, I see you have no sense of humor, ok.", "label": 1}
{"text": "You’re the type that will show up at the diddy party lol", "label": 1}
{"text": "It’s hilarious. Lmao. Who the fuck told you that lol. Diddy is gay and has been eyeing LeBron. That is hilarious.\n\nOf course there is going to be public push back, especially if these systems that created them, are the same systems that made people like you and me. Lmao. Especially when the writers can’t write the scripts right lmao. There are memes about diddy all over that hilarious asf lmao.", "label": 1}
{"text": "I am lol", "label": 1}
{"text": "My therapist thought they were good ideas 😂 and that I should share them 😭", "label": 1}
{"text": "No? What? This is freedom of expression lmao, something we need dude lol.", "label": 1}
{"text": "Crazy to me people downvote this… classic trumpers down voting this lmfao. That is so cracked.", "label": 1}
{"text": "I’m pro Kamala lmfao", "label": 1}
{"text": "Trump is a fricking idiot and pedophile himself, he should be the king zombie pedofile in the movie.", "label": 1}
{"text": "Oh, I certainly do and should! The rulings are all wrong!!!! We have no where to discuss politics anymore…. We use to goto bars and have conversations or political meetings, now we only have Reddit/fb/etc. constitutionally, these platforms serve the same purpose as a government building does. Why the fuck we have not built our own uncensored, Unbotted and united .gov site with true freedom of speech is beyond me… with true KYC verification to participate.", "label": 1}
{"text": "I’m laughing because it’s funny and how dumb people are for not wanting to spread awareness of the issue and having Trump as the king of pedofile zombies lmfao. Certainly democrat ads  are not doing a good job of it. Trumpfile.org has 1000+ criminal cases and many of which are pedofile cases lol…\n\nThe only people who get mad are pedofiles and/or Trump supporters themselves. It’s crazy to me how stupid people are!", "label": 1}
{"text": "If you read my comments, my therapist thought it was a great idea and I should share it on /movies to spread awareness of the bad people in Hollywood and politics lol.", "label": 1}
{"text": "Lmao 😂, yep and it would be hysterical, what’s not funny is how many people are against it… clearly the systems don’t want to spread awareness to the issues of our politicians and Hollywood lmao. Idiots I tell you.", "label": 1}
{"text": "I got really great ideas to frame our politicians and celebrities who are fucked up lol. SNLx10.", "label": 1}
{"text": "I’ve been getting it since 3, fed depakote n resperidone in syringes lmao. My therapist thought it was a great idea lmao. What are you smoking, not finding this a funny ideas, means you’re probably a pedofile lmao.", "label": 1}
{"text": "Just ask Eminem, it’s only the people who get offended that are the real corrupt ones and will call you crazy lmao.", "label": 1}
{"text": "it has not spread, its why lebron diddy memes n shit pop off all the time, or kamala eating babies etc. lmfao. Grow up you dick heads. Your name suits yourself and your other redditors commenting on my posts lmao.", "label": 1}
{"text": "She was amazing in this movie.", "label": 1}
{"text": "모든 링크를 한곳에서 보는 링크모음집 ,각종 무료 다운로드, 검색 링크 최신주소를 찾고 새로운 링크 공유하고 포인트받아 사용할수있는 새로운 온라인 부업 커뮤니티 링크집 www.Linkzzip.com\n#무료고화질 #실시간스포츠중계사이트 #라이브티비 #링크모음 #링크주소", "label": 1}
{"text": "해외 정식 법인 , 끊김없이 보는 전세계 스포츠 중계 티비 와우중계 , 국내 메이저 온라인 카지노 와 토토사이트에서 바로 이용 가능한 각종 꽁머니 포인트 지급 www.와우중계.com\n#먹튀사이트 #토토사이트 #토토커뮤니티 #토토꽁머니 #꽁머니", "label": 1}
{"text": "he used to be one of my faves until he revealed he's a zionist so now i hate him", "label": 1}
{"text": "So the themes of JoJo Rabbit went right over your head, huh.\n\nWhat a horrible comment.", "label": 1}
{"text": "How beautiful she is, like wine, only better with time", "label": 1}
{"text": "Will it be about Bob hanging out in front of a home depot?", "label": 1}
{"text": "Lol you must be jewish. He definitely knew", "label": 1}
{"text": "*Handy Manny", "label": 1}
{"text": "“My name ees, a-Bob the Builder. I like tacos and burritos.”", "label": 1}
{"text": "J-Lo is definitely flooding herself into the industry to cover up the fact she's Diddy's ex, and helped ruin a man's life by hiding a gun.", "label": 1}
{"text": "Even Bob the Builder can’t be white anymore?", "label": 1}
{"text": "Ok, since you seem wholly incapable of inference, I'll spell it out in small words: Maybe the people making the new movie want a more faithful adaptation of the book. That would be the possible 'why' you seem unable to grasp.", "label": 1}
{"text": "Okay kiddo... nevermind. Perhaps the 90s didn't have critical thinking skills taught.\n\nEnjoy your direct to streaming release in a few years.\n\nNext time, crayons for you!", "label": 1}
{"text": "You're such a miserable fuck. Why not just accept that you don't have to watch everything made instead of being a cunt? This obviously isn't for you, so fuck off and leave people to it.", "label": 1}
{"text": "Ok, so, to recap: you whined about studios remaking 80's and 90's movies. Someone else explained to that this project is an adaptation of the book. You doubled down claiming there was already an adaptation in the Schwarzenegger movie. I jumped in to try to help you understand that this current project isn't a remake of the Schwarzenegger movie, because that was an extremely unfaithful adaptation of the source material. You still didn't understand, so I tried to clarify further. After that entire exchange, you imply I'm the one with poor critical thinking skills. Well, I gotta say, I bow down to your unassailable genius. Bravo, king. You're a champion of intellect of which I could never hope to hold a candle to.", "label": 1}
{"text": "...how'd you miss everything important? It's OBVIOUSLY NOT a movie based off another movie... the fuck you talking about kiddo? \n\nYou eat those crayons?", "label": 1}
{"text": "Lmaooooo. Then what motivated you to bitch about movie remakes to begin with? Are you admitting the first comment you made is completely useless and out of place on this post? You know, the comment specifically whining about movie remakes? Holy shit, I can't belive what an unfathomable genius you are. Clearly my inferior mind can't possibly hope to comprehend the 6D chess game you're  engaged in here. I surrender.", "label": 1}
{"text": "\"Not to mention that audience at Rotten Tomatoes and IMDB agree that Cloverfield and REC are better movies\" man you sound like a tool. TBWP is incredible and directly lead to the creation of all the movies you noted as special. Just take a seat nephew, keep reading reviews to form your opinions rather than watching films and developing your own.", "label": 1}
{"text": "This x100, u/-Lykan- sounds like an idiot", "label": 1}
{"text": "I'm a hetero homophobic male, but I'd like to watch some good fag movies, just for entertainment.  Can anyone recommend some?", "label": 1}
{"text": "I always thought Melanie Griffith sounds retarded, I don't know if it's her voice but she sounds odd", "label": 1}
{"text": "I saw it at VIFF this year and had I not been there with four other people I would have 100% walked out about an hour through. Most agonizing film I’ve ever sat through.", "label": 1}
{"text": "Your childhood sucked", "label": 1}
{"text": "That movie was awful", "label": 1}
{"text": "House (1985) Top 20 BEST Haunted House Movies!", "label": 1}
{"text": "Tarantino definitely has a unique take on remakes! It's like he’s the grumpy old man of cinema saying, \"Get off my lawn!\" I get that he wants original stories, but at the same time, isn’t there something fun about seeing how different directors put their spin on a classic? It’s like when your favorite band covers a song; it might not top the original, but it can still bring something new to the table. Plus, if we only watch the same stories over and over, we’d miss out on all the creative reinterpretations that keep cinema fresh!", "label": 1}
{"text": "Reynolds is a faggot.", "label": 1}
{"text": "Statham's a fag.", "label": 1}
{"text": "If you were correct, your retarded idea would have been used in the movie.  It wasn't, so you aren't.", "label": 1}
{"text": "Are you sure about that", "label": 1}
{"text": "Wow, your point was so effective you had to round it out with some weirdo twee name calling. What an adult thing to do. \n\nThe same “basic story” doesn’t make the stories the same. You might as well say “I’ve read the book, I don’t need to see the movie”, which is an equally dumb thing to say.", "label": 1}
{"text": "I'm calling you names because you're clearly a fucking clown so it's more entertaining to make fun of you rather than waste time illustrating a point that you're too stupid to grasp anyhow. \n\nGo give your head a wobble you spanner", "label": 1}
{"text": "I bought a kymco 2019 in 2019 from chaparral Motorsports in San Bernardino California my kimco had been sitting in my garage for a while I went there to get service done because that's where I bought it you're telling me they don't work on kymco scooters anymore so where do I get my work done don't ever go there and waste your money because this might happen to you like it has to me where do I go to have my kymco serviced these are some very chickenshit people!!!", "label": 1}
{"text": "Only 5", "label": 1}
{"text": "Absolutely worth watching!", "label": 1}
{"text": "The trailer looks amazing.", "label": 1}
{"text": " They’re an adorable couple.", "label": 1}
{"text": "Also why don't you go fuck your lonely stinky self and realize your a disgusting worthless person that supports cheating and tries to minimize it. And no I wasn't just talking about the movie like you so stupidly think. Jesus Christ I'm sorry your mother didn't scoop you out and throw you right in the trash where you belong.", "label": 1}
{"text": " It’s so good movie.", "label": 1}
{"text": "Great couple!", "label": 1}
{"text": "She’s a good actress.", "label": 1}
{"text": "Over the hedge is the best ever and clear if all the rest", "label": 1}
{"text": "Agree\nSpoiler: \n\n\n\n\n\n\n\nShe just get mind fucked for the whole movie and then burn herself in the end is just hard to watch oof", "label": 1}
{"text": "Who \"attempts\" suicide? If you wanted to die, you would. The human body is unlikely to survive a fall greater than several stories,  particularly if you make no attempt to limit the impact and decide upon a good landing. A bullet through the mouth, directed at the base of the skull, is almost certain to kill you or render you damaged enough for it not to matter. A knife drawn up the length of an arm and driven into one's throat would be a miracle to catch and save.\n\n\nYou didn't attempt suicide, you courted it. If you wanted to be dead, you would be. ", "label": 1}
{"text": "watch Venom: The Last Dance forever oline free [https://filestrue.com/1758208](https://filestrue.com/1758208)", "label": 1}
{"text": "I’m not defending Zaslav, he absolutely has made bad judgement calls. But the entire industry outside of Netflix has no idea where to go.", "label": 1}
{"text": "A beautiful mind", "label": 1}
{"text": "mr deeds", "label": 1}
{"text": "Secret Life of Walter Mitty", "label": 1}
{"text": "I don't have a favorite plot but I do enjoy a couple films.", "label": 1}
{"text": "These are just corporate buzzwords lol. What would you suggest? Theater business is still high risk, linear tv is hemorrhaging money, and entertainment is more decentralized than ever. People just keep saying be innovative to a consumer base that is shrinking. There is the reality people just generally don’t care as much because it isn’t a cultural pillar anymore.", "label": 1}
{"text": "They literally do not have a linear tv problem. Lol", "label": 1}
{"text": "Boiler Room", "label": 1}
{"text": "Fuck Joe Rogan, Boycott Spotify", "label": 1}
{"text": "Fuck Joe Rogan, Boycott Spotify", "label": 1}
{"text": "A decades old stereotype of it to boot.", "label": 1}
{"text": "Frances Ha", "label": 1}
{"text": "Right, they just didn’t buy it when it was shipped around.", "label": 1}
{"text": "TlDr.: Women celebrate WHMS-movie for examplifying what it was supposed to criticise which is ironic.\n\n\n\nI can see how you can hate it. Here is why I like the movie.\n\n# \"Traditional Marriage versus Hollywood\" RomCom\n\n**Monkey see, monkey do.** Romantic Hollywood movies only frame the honeymoon phase of a relationship. This makes women seek new relationships for the sake of living closer to the reality of those movies. Why fix what you have, when you could have more, when you could have another first date (epitome of this is \"50 First Dates\")? \n\nThis is a criticism men have with romantic movies and I think it is at least a bit valid because there is at least one crazy woman out there. So when these movies only make women want another partner or break up with you, why would you as a men sit through these movies? In the movie Harry's marriage literally ends because his wife thinks it is not romantic enough, while what she actually wants is variation. Sally breaks up with her partner because she realises that she wants a traditional family rather than a life as a modern, childless couple.\n\n\n\n**Monkey thinks, but monkey also feels.** \"When Harry Met Sally\" has these scenes with the old people and it is a direct comparison of how things should be: 'People meet and stay together' versus how things are in the movie: 'Chaos'. Classical gender tropes are actually reversed since Sally is rational while Harry is emotional. \n\nWhat happens then is that Harry and Sally actually manage to become friends and do what they said is impossible. *Woman and Man are friends.* The old people are cheering because \"purity and tradition\" are upkept. However then feelings get in the way and we get this romantic ending, that originally was not in the script. Women are cheering because they think this is the proof these old people who say: \"Yeah we met and then we just got together forever.\" are wrong.\n\n\n\nSo why do I like the movie? Movies I like have to be unique in some way. What I love about this movie, is how it was supposed to be something completely different from what it is and most women who watch it misunderstand it. The movie was supposed to show the consequence of being indecisive. The director changed the ending because he got laid and he wanted to make his by now 35 year wife happy. *Ironic*", "label": 1}
{"text": "Warrior (2011)", "label": 1}
{"text": "I'd recommend Interstellar. It's free on Youtube now and I was surprised how encouraging it was.", "label": 1}
{"text": "The only time I talked about cheating was in reference to the film. ", "label": 1}
{"text": "👌🏽", "label": 1}
{"text": "Do any of you cattle talking about how \"he served his time\" ever actually think about what you're saying? For one thing, what benefit did his wife and daughter derive from him being sent to prison? Furthermore, not even the death of a murderer of an innocent person would compensate for the life of that innocent person, much less any amount of time the murderer could ever spend in prison, NOT TO MENTION THE MURDER OF TWO INNOCENT PEOPLE!!!!!!", "label": 1}
{"text": "Usually bad results when the writer, director, and lead are all the same person", "label": 1}
{"text": "Hell of a week to argue about Ohio’s virtues", "label": 1}
{"text": "Always looks weird when you have 30 year olds trying to pass as teens...", "label": 1}
{"text": "Or not", "label": 1}
{"text": "Cope", "label": 1}
{"text": "You are going to make it, I promise.", "label": 1}
{"text": "Hollywood made The Dark Knight, this movie is terrible. It has a bad reputation today -> 2/10", "label": 1}
{"text": "Way too much of my mental well being is hinging on this movie not being terrible", "label": 1}
{"text": "Ive just realized it now", "label": 1}
{"text": "You should never miss out on Interstellar", "label": 1}
{"text": "Thanks for posting", "label": 1}
{"text": "So does this mean we'll finally get new updated poster designs? \n\nI'm kinda over seeing these generic poster style being copied over and over.", "label": 1}
{"text": "Best movies https://oii.la/joMmjNKQK", "label": 1}
{"text": "AI doing AMA now?", "label": 1}
{"text": "Hello Paddington, can you please shout out my sigma ski buddy Kai Cenat? \n\nHe is currently on the toilet in Ohio and has L rizz and aura, and he will have W rizz and aura if you shout him out.", "label": 1}
{"text": "Ai would respond to things :/", "label": 1}
{"text": "I believe you should do a movie with Pedro Pascal and Nic Cage.", "label": 1}
{"text": " G r vwhh 🌚", "label": 1}
{"text": "He really isn't.  He's one of the nicest people I've ever met.  Sorry you guys don't have the same feelings about the music you like, but having met him you sound like a fucking idiot", "label": 1}
{"text": "Big tits but im not paddington", "label": 1}
{"text": "I have a feeling paddington is going to regret their decision when they come back tm", "label": 1}
{"text": "The story of a soldier.each sentence at the end when the pitch of their voice is high.it sounds so remorseful and in pain.made me tear up in such a long time.", "label": 1}
{"text": "Hello Paddington! Are you aware that there’s a twitter account (jaythechou) that posts a picture of you in various movies/tv shows everyday? I love seeing those pictures, but my question is, if you could play in any movie other than yours, what would it be? Thank you!", "label": 1}
{"text": "I think you need to do yourself a favor and boost up stay safe sailor.", "label": 1}
{"text": "Baloo is gonna ruin tear that puss up. He will do anything to scratch that itch. Shag.\n\n\nPooh Bear is loyal and looks after his friends. How Eeyore has t killed himself yet is likely down to how good a friend Winnie is. He has a cute little forest dwelling. Marry. \n\n\nYogi I have nothing in common with so I don't think it would work out.", "label": 1}
{"text": "never seen that but i see canadians keep popping up or australians", "label": 1}
{"text": "you probably didn’t mean this in a sexual or creepy way but the last part of your comment is unnecessary hahaha", "label": 1}
{"text": "imdb has cool lists", "label": 1}
{"text": "Loved that film", "label": 1}
{"text": "It's a relatively new rule.", "label": 1}
{"text": "I *l*oved his Shadows of the Empire artwork as a kid.", "label": 1}
{"text": "\"Your jeans look uncomfortable.\" Is a weird thing to say is it? I sure hope she recovers from this vile thing I've said. I'm so sorry to all of you as well, please accept my apologies for my inappropriate critique of ill fitting jeans. I am truly scum. Punish me, Reddit daddy, punish me with your downvotes. I have been so very bad...", "label": 1}
{"text": "I mean you could play dumb and lean into it or…oh wait.", "label": 1}
{"text": "Yeah, who know \"your jeans look uncomfortable\" would be so triggering for you all. I hope I dont keep you up all night thinking about how horrible I am.", "label": 1}
{"text": "nah it was just a weird thing to say", "label": 1}
{"text": "Has he even responded to one question here?", "label": 1}
{"text": "Why?", "label": 1}
{"text": "Lean into what? Uoure clearly seeing something I'm not, so why don't you enlighten me. After all, we have to learn from our mistakes. So please, tell me. Why is \"your jeans look uncomfortable\" giving you all such a hate bonner?", "label": 1}
{"text": "Truly this is a learning experience for you pal. The general consensus is that you said something weird and unwarranted and figuring it out could be some major growth for ya. Having an internet stranger have to hold your hand through basic decency and tact is…not great for an adult.", "label": 1}
{"text": "Lol So no answer, because the truth is that all of your heads are in the gutter and pinning that on me. \n\nAnd fuck your consensus. Trump just won, does that make that right because the majoring agreed? lol fucking idiot.", "label": 1}
{"text": "You poor human. I truly wish you some enlightenment. Trolling is a really unhealthy hobby and maybe evaluate why being combative and mean to strangers is satisfying to you. It’s really tragic that an entire swath of humans doesn’t know being kind is free and often easier. Have a good evening and maybe drink some water.", "label": 1}
{"text": "NIGHERS", "label": 1}
{"text": ">\"Your jeans look uncomfortable.\" Is a weird thing to say is it? \n\nBut that's not what you said. You said, \"Damn, they look too snug around the crotch area.\"\n\nTalking about how snug they look around her crotch is the weird part. Had you simply said \"Those jeans look uncomfortable\" no one would have noticed.", "label": 1}
{"text": "Year of the Dragon\n\nBadlands \n\nGangs of Wasseypur", "label": 1}
{"text": "It's tough to imagine mob movies without those legends, but there’s hope with actors like Vincent Piazza or even Michael Mando stepping in.", "label": 1}
{"text": "shut up, cunt.", "label": 1}
{"text": "It's basically a cheap way to add conflict without needing another supervillain. Just have the mayor yell about property damage and boom - instant drama", "label": 1}
