{"text": "agree completely.", "label": 0}
{"text": "Not a movie, but a tv show: black mirror - beyond the sea was a real mind fuck", "label": 0}
{"text": "The movie is titled RRR?", "label": 0}
{"text": "He literally delivered every moment in the film with perfect, believable, naturalistic believability.  It was so cool watching him shift between two characters.  And he's in a new movie! Love Hurts, exciting to watch next year.", "label": 0}
{"text": "Ballet", "label": 0}
{"text": "Transformers One. The \"rebirth\" scene for anyone who knows.\n\nI felt like the guy at the end of Babylon watching it.", "label": 0}
{"text": "Shaun of the Dead", "label": 0}
{"text": "If they have no problem with it, why shouldn't it be their job? An actor is there to carry out a vision for a character, story etc.\n\nLet's put it this way. When AI is accessible enough that people can make their own full length feature films without using a single actor, should they not have characters that appear fully nude? \n\nIf not, then I don't think your problem is just about the actor's job requirements being problematic, but rather with the nudity itself. If you think they should if they want to have a character appear that way, then willing actors should be taking those roles. Yeah it's problematic that some might feel unduly influenced to compete with other actors for roles that have those requirements, but this is true in basically every aspect of our society and all other jobs, just generally it's not around sex or nudity but based around something else. \n\nThere's a lot of things that I've done or that I know others have done that I would NEVER willingly do on my own, but I have done it on the behalf of employers because if I don't then someone else will and I'll be out of a job. I'm not even saying anything terribly heinous, certainly not even illegal, but something that is below my standards. I have high standards for myself, and I hate compromising for businesses to do bullshit that I'd never do if I didn't feel like I had to compete with less scrupulous people that would do it if I didn't.\n\nI'm for taking a stand against that dynamic in general, though I don't think it's realistic to actually do anything about it, but it makes no sense to specifically pick out people in acting jobs and call out that one unfair dynamic when many other jobs have something just like it.", "label": 0}
{"text": "I’ll take 1917 and raise you Dunkirk!", "label": 0}
{"text": "Hello my ragtime gal", "label": 0}
{"text": "I’d probably agree", "label": 0}
{"text": "Glengary Glen Ross. An absolute masterpiece of dialogue and direction with an incredible pace and set design\n\nIt’s honestly timeless. So so good!", "label": 0}
{"text": "I was looking to see if anyone else would comment this. I went in blind, and it might be one of the best movies I’ve ever seen in general.", "label": 0}
{"text": "Any such Top Five that doesn't include Casablanca is an exercise in ignorance.", "label": 0}
{"text": "Bladerunner 2049 or anything Denis Villeneuve. Prisoners, Sicario, Arrival are all incredible.", "label": 0}
{"text": "I was going to say this. Before that was another war movie, Dunkirk.\n\nI was also blown away by past lives for different reasons. I just connected to the story really well.\n\nA few others in between these that I can't think of but these are the ones off the top of my head.", "label": 0}
{"text": "Look, of course feel free to go to a therapist, as you would likely benefit from the help, but please don't make your temperamental issues and/or insecurities my problem. \n\nTo recap: You got cranky and defensive (I wonder why...) because I -- with unnecessary cattiness, perhaps -- noticed someone's incorrect grammar. When I pointed out that your first reply to me made no sense, given the obvious distinction between typos and habitual misuse, you became more petulant and desperately searched for rejoinders, while taking the pathetic and weird gesture of \"screenshotting\" the conversation. Now, with zero self-awareness, you figured you'd simply say the word \"bro\" again, in the manner of some abusive bully who knows he's wrong but wants to talk back anyway.\n\nAs soon as Reddit allows, \"epichuntarz,\" I'll block your account, even if you try to keep sending me trolling remarks via edits. In the meantime, please stop talking to me. Thanks.", "label": 0}
{"text": "Loved it. The moment the training canyon run scene happened it felt like the entire theater shut up and really focused. The actual run too, it was a phenomenal movie that gets unfairly trashed by a lot of people here because it's a military action movie that did exactly what it wanted to do.  \n\n\nThe mission itself was contrived from a real world perspective but it lead to one of the best action sequences in a very long time", "label": 0}
{"text": "Opening scene in UP\n\nBig Fish\n\nMatt Axelson in Lone Survivor.  This one, I can watch the movie over and over, but that scene, where he's struggling to breathe, pistol in hand.  This is that moment in a completely fictional movie where he would rally, make one last act, but it's all he can do to remain, doomed, unable to move another inch.  It doesn't make me cry, it makes me feel like I can't breathe either, like the darkness is closing in, only toughness keeping the heart pumping and the lungs filling.", "label": 0}
{"text": "Not a movie", "label": 0}
{"text": "The substance blew my mind !! What a ride !", "label": 0}
{"text": "Erasure is a lot more raw, and bitter, and it's great. I appreciated the heck out of American Fiction for trying to adapt an un-adaptable book to film (and largely succeeding!), but man... Erasure has sixty whole pages of a fake novel in the middle, which is just a way of the actual author to insult Native Son.", "label": 0}
{"text": "I'M IN A GLASS CAGE OF EMOTION!\n\nI'm not even mad, that's amazing\n\nI'm very important. I have many leather-bound books and my apartment smells of rich mahogany\n\n60% of the time, it works every time\n\netc, etc....", "label": 0}
{"text": "They aren’t making purely stupid decisions. They signed Tom Cruise to a multi film deal and he has been killing it for Paramount over the last 5 years.", "label": 0}
{"text": "I didn’t realize this was made into a movie!", "label": 0}
{"text": "There’s this Thai movie where the lead actor who is a real martial artist fights his way all this way this enormous circular building on the inside. Supposedly it was all done in a single take. It lasts many minutes and he’s just kicking everyone’s ass that gets in his way. It’s a phenomenal scene. Can’t recall the movie name. Maybe mid-2000s?", "label": 0}
{"text": "This one was exceptional. Glad I got to see it in the theater.", "label": 0}
{"text": "I find sex scenes so useless tbh.", "label": 0}
{"text": "Stalker is pretty bleak.", "label": 0}
{"text": "Hells yeah! The acting was spot on and the environment created equally so! 👊🏻👍🏻", "label": 0}
{"text": "Aliens", "label": 0}
{"text": "Gentlemen, you can't fight in here. This is the war room!", "label": 0}
{"text": "Sign me up", "label": 0}
{"text": "Godzilla minus one. Especially as a long time Godzilla fan. We were all just starving for another taste of what toho was cooking and seeing them hit a home run like that (in theaters for the first time in a while) was crazy.", "label": 0}
{"text": "Hot Rod\n\nSuperbad\n\nPineapple Express\n\nStep Brothers\n\nAirplane!", "label": 0}
{"text": "I loved that one. Think I'll rewatch it this Christmas season.", "label": 0}
{"text": "Eh I liked the first one for the believability and how real it felt compared to other bad guy shooter movies. But the sequels felt too much like videogame movies to me, they're obviously supposed to be \"just like muh videogames\" with powerups and stuff and they become like every movie where bad guys are waiting in a line to attack one by one. They're fine movies I don't hate them but they go against why I loved john wick 1.", "label": 0}
{"text": "Interesting premise, but ever since I found out that Kelsey Asbille falsely claimed to be Native American in order to play multiple Native roles and changed her stage name from Kelsey Chow specifically for those roles, I can’t look at her the same.", "label": 0}
{"text": "Forgotten how influential superhero films have gotten this century", "label": 0}
{"text": "Did I urinate on your rug?", "label": 0}
{"text": "This is what I came here for!!!\n\n\nThank you!", "label": 0}
{"text": "More aces coming out of the closet too, but I'm not sure that fully explains things.  I can't say I'm opposed to the trend, but apparently there's a lot of weirdly worried \"think pieces\" in magazines, which apparently still exist, bemoaning the lack of moaning in modern movies.  Frankly, I think it's overblown.  I still see sex stuff in movies from time to time.  I'm just glad it's not in every single one, like in the 80's.", "label": 0}
{"text": "I agree! There’s a reason why Charlie Kaufman got the Oscar for best original screenplay for this film. It’s utterly original and thought provoking.", "label": 0}
{"text": "The latest would have to be the wild robot. I didn't want to leave while the credits played. It was gorgeous.", "label": 0}
{"text": "As a car guy, Brian O’Connor (Paul Walker) in Furious 7.", "label": 0}
{"text": "Was going to post this, but did a search and was surprised by only one mention. Bleak is the right word for this one", "label": 0}
{"text": "Adam & eve advertises discreet shipping, except for the catalog that they send you every few months which is extremely not discreet. I could not get it to stop so I had to resort to changing my address to my old college dorm and letting them deal with it.", "label": 0}
{"text": "I Saw The TV Glow was an over-directed slog that had the pointless audacity to leave you with the bleakest ending possible.", "label": 0}
{"text": "I saw civil war in theatres in d-box seats and it unsettled me deeply, which felt like the point.", "label": 0}
{"text": "Promising Young Woman. Absolutely loved it. The ending was masterful.", "label": 0}
{"text": "Do you think my kids will make one about how i have a better K/D then them on COD?", "label": 0}
{"text": "It’s harrowing but phenomenal!\nI’d also suggest “ambulance” wi Nicholas Cage!? Scarily and accurately on point!", "label": 0}
{"text": "This movie is in my top 3. Absolutely flawless ", "label": 0}
{"text": "I second this, i don’t think i blinked during the entire film 🤣 it was bleak and deeply unsettling as someone who lives in the UK.", "label": 0}
{"text": "Yeah it’s overblown", "label": 0}
{"text": "All quiet on the western front and The wild robot.", "label": 0}
{"text": "And an onion for a belt, as was the style at the time.", "label": 0}
{"text": "But why do we need non-porn-actors to get really close together almost fully nude and show their actual body to the whole world? Having a lot of explicit sex and nude scenes sets a certain standard for actors and could lead to actors, who don't want to do this, not getting good roles. And many actors have said that they had bad experiences with some of those scenes. Emilia Clarke for example isn't against nude and sex scenes, but has stated that she had to fight to not be shown nude in the scenes where she felt it didn't fit. She also said that her nude scenes felt really terrifying. I feel people don't think about the fact that actors are real people living in a society where we don't just casually have sex out in the open or walk around naked.", "label": 0}
{"text": "Fight scene in They Live", "label": 0}
{"text": "In no order and without thinking it much  Casablanca, Princess Bride, Pulp Fiction, Airplane, Young Frankenstein.", "label": 0}
{"text": "Id like to invest in your movie, sir or madam.", "label": 0}
{"text": "The Wild Robot is amazing", "label": 0}
{"text": "I’m gonna have to throw in Thelma as my choice. Just and absolute wonderful movie\n\nAnd Robot Dreams also was a pleasant surprise. \n\nNeither of these films are movies that I would normally see but my son who is 11 and has autism was interested in them. I believe these both deserve to win lots of awards this award season.", "label": 0}
{"text": "Clerks\n\nMallrats\n\nSuperbad\n\nIdiocracy\n\nSlap Shot", "label": 0}
{"text": "My top 3:\n\nTalladega Nights\n\nO Brother Where Art Thou\n\nPrincess Bride", "label": 0}
{"text": "Cloud Atlas. I since have read the book and have seen the movie so many times.", "label": 0}
{"text": "I have two boys. I saw it with them. I was a fucking mess.", "label": 0}
{"text": "Did you only survey Teens?\n\nBecause, like, at least everyone I know (including me and my spouse) just fucking skips over any semblance of sex scenes or even just the threat of one.\n\nAnecdotal at best, but still. Not just teens.\n\nWe want story in our entertainment. Not porn.", "label": 0}
{"text": "Silent Running", "label": 0}
{"text": "We were a bunch of kids recently out of film school when we shot this film.  We could write, we could shoot, we could edit.  So production was pretty easy for us.  But after that, getting into post is when we ran into problems.\n\n\\- Cutting what we shot into the coherent narrative of the film was time-consuming but doable.  But we probably spent 2 years editing, dealing with the holes in the script, and all the mistakes we made during production.  That wasn't bad though, just 2 years, Primer took 2 years to edit.\n\n\\- Visual Effects was a huge issue.  Our 2D VFX actually went really well, we got two amazing artists through our DP who delivered great work relatively quickly.  But the 3D VFX was a nightmare.  We didn't have funds to pay people professional rates, but we wanted it to look good.  We kept getting VFX artists on board who were pros, who could deliver the results, but they were working for so little they were basically volunteering, doing bits in their spare time, so it went sloooow.  And then eventually Peter Jackson would call and they'd be off to work on some blockbuster and we'd be back to square one.  Eventually we got Joel LeLievre onboard, for a lot more money than we'd paid anyone beforehand, but still for way less than pro rates, and he delivered.  All the 3D work in the film is his and I'm so proud of it.  That was probably 6-7 years on VFX though...\n\n\\- Funding. I knew we needed funding to finish the film.  Eventually that was my goal.  I probably spent a year and a half writing grant applications, applying for funding.  We always got rejected.  Frequently they'd reject us before they even read our proposals, without watching what we had, cause we weren't professional artists or filmmakers or whatever.  In order to get money to make movies, you have to have made movies, so how do you start?  I thought they'd look at our stuff and read our proposals and realize there was something there, but they never did.\n\n\\- Sound.  The last piece was sound.  We had a sound team working with us at the beginning, after production.  They did amazing work, recorded our voice overs, did ADR, but they couldn't finish cause the rest of the film wasn't done, everything else was still in the air.  So they waited around, but not forever, eventually we lost them.  Same thing with our composer, we had an amazing composer, but he couldn't wait for years while the rest of the pieces came together.  When we eventually did finish the movie, I hired a professional sound team and paid them professional rates, and that's how we finished it.  Our sound team is amazing, I'm so proud of the work of our composer and our audio post team.  But they did it from scratch, when the rest of the movie was done, and we paid them.", "label": 0}
{"text": "enhanced...", "label": 0}
{"text": "the sexuality of a good sex scene -- not to mention the characterisation -- has fucking nothing to do with porn", "label": 0}
{"text": "Clue - forever number one\n\nMy Cousin Vinny\n\nTremors\n\nThe Goonies\n\nMean Girls\n\nThere are a whole bunch more, these are just the first ones I thought of tbh", "label": 0}
{"text": "They're all just dates... The conspiracy mindset doesn't do anything to help the Palestinian cause", "label": 0}
{"text": "“Will you be my boyfriend?”", "label": 0}
{"text": "Everything is so sexualized these days. We want to see realistic relationships and connections.", "label": 0}
{"text": "Old Yeller", "label": 0}
{"text": "Also, I don’t know if it blew me away, but it left me asking ‘what in the heck did I just see?!?!  - Barbarian.", "label": 0}
{"text": "Children of Men\nCan’t believe I hadn’t seen it and I can’t stop thinking about it. I watched it, I was blown away. I watched it again the next day and absolutely bawled my eyes out.", "label": 0}
{"text": "Adults do too.  I mean go watch porn if you want to see that.", "label": 0}
{"text": "Solid list. I would add MCU as a whole, Barbie, Oppenheimer, Social Network, La La Land, American Psycho\n\nAlso I don’t think the Brutalist should even be considered at all atp 🤨", "label": 0}
{"text": "Yeah. Nobody wants something half-assed. Either make porn or don't.", "label": 0}
{"text": "Don't be gone long, Ellen.", "label": 0}
{"text": "It's like they think not vehemently wanting more sex in film means you hate sex 😂", "label": 0}
{"text": "What about the forest getaway scene with the car??", "label": 0}
{"text": "The Deer Hunter captures dread as good as any movie.", "label": 0}
{"text": "It’s a tie for me between Blade Runner 2049 and Hereditary. I think they’re both perfect films in terms of accomplishing what they each set out to do. ", "label": 0}
{"text": "1. Airplane!  \n2. The Blues Brothers  \n3. The Princess Bride  \n4. Office Space  \n5. Airplane!", "label": 0}
{"text": "Predator 65?  Aliens, dinos, and Adam Driver of course.", "label": 0}
{"text": "In American pie they call them illegal channels lol", "label": 0}
{"text": "Recently watched \"SISU\"...was just one of the better action movies I have seen in the past decade.", "label": 0}
{"text": "Why do you care? Why is having less sex automatically worse, when you don't even know the reasons for it?", "label": 0}
{"text": "Clue, I got nothing\n\n2: You were serious a lot that?!\n\n3: here they come!!\n\n4: this one right here?! It’s mine! My wish!", "label": 0}
{"text": "When the person nude is a woman. Nearly all on-screen male nudity I've seen is not erotic, it's either played for comedy or meant to show vulnerability in some way (prisoner being forced to strip, Viggo's famous nude fight) or is simply mundane (skinny dipping for example)", "label": 0}
{"text": "In A Violent Manner\n\nIt’s on Shudder now\n\nThe concept is something I’ve never seen before and it was fascinating. Imagine if you’re watching Jason or Michael doing their thing, killing campers/baby sitters, but the camera follows directly behind them entire movie. You watch how they silently, slowly, stalk their victims. \n\nIt’s over the top gory at times so be forewarned but I loved the concept.", "label": 0}
{"text": "Graphic! But I don’t like gore either and many parts are predictable (or, I mean, you can see them coming in time to close your eyes). I waited until the squelching noises stopped and then opened my eyes. A couple times too early!", "label": 0}
{"text": "Not a fan of watching movies because I've always preferred reading books and play games for entertainment but for me, it's Interstellar\n\nI initially thought it was \"just another sci-fi movie\" because I asked people and they said it's too nerdy and boring and long\n\nBeing a fan of science, I watched it and I've never seen such a good film. I wish I watched it sooner when it was still in theatres and I would pay a fortune to see it on IMAX", "label": 0}
{"text": "Wedding Crashers or Step Brothers clears Fifth Element. And I love The Fifth Element.", "label": 0}
{"text": "You think Barbie and Oppenheimer are century defining movies ?", "label": 0}
{"text": "This is not the most impressive film I’ve ever seen or anything, but the film that most recently “blew me away” was Transformers One. It helped that I had low expectations, but it was also just a genuinely great animated kids’ movie that was thoroughly enjoyable for me and my brother as adults in our mid to late 20s", "label": 0}
{"text": "Godzilla Minus One \n\nGenuine story focused on human choices and emotions as opposed to massive CGI creature going around causing ruckus. Not afraid to admit becoming attached to a couple of the characters  by the end.", "label": 0}
{"text": "Ace Ventura\n\nReal Genius \n\nFantastic Mr Fox \n\nA Goofy Movie \n\nThe Emperors New Groove", "label": 0}
{"text": "Choice. Milk was a bad choice.", "label": 0}
{"text": "Invested meaning you have an interest in it. And even if other people in this thread are saying that’s the reason, they’re just making that up the article doesn’t say that.", "label": 0}
{"text": "Mufasa is first one I thought of. Cry every time.", "label": 0}
{"text": "The loss of the entire Granite Mountain Hotshots save for Donut in Only the Brave", "label": 0}
{"text": "I just saw this a couple months back, and it was grea!. Never would have heard about it stateside if I weren't in so many occult groups on social media. This movie deserves way more love.", "label": 0}
{"text": "Same! I’m so glad I saw it in a full theater!", "label": 0}
{"text": "I haven't seen sex in any movies for years", "label": 0}
{"text": "Moonlight, Arrival and Hereditary", "label": 0}
{"text": "Was a 12 year old boy in the 80's. Had to share playboy pictures with one another in restrooms. THAT's how desperate things were before the internet.", "label": 0}
{"text": "Gen z here. there's a saturation of hypersexuality in  all forms of media nowadays, and it's simply a reaction to that. Like why is there Netflix show that features a woman who likes guns up her hoo ha? No subtleness at all. Just in your face edgelord vulgarity.", "label": 0}
{"text": "In the 90s, movies were your one shot at seeing a titty. It was a very important part of the culture at the time. Now I can see titty anytime I want so I don’t need it in movies.", "label": 0}
{"text": "It’s Prey 2, just finished filming in New Zealand.", "label": 0}
{"text": "for now at least looking at it from a 2020s perspective I don’t have foresight in 2100", "label": 0}
{"text": "I assume it's awkward to watch with their parents hovering over them.", "label": 0}
{"text": "Doubling down? Bold strategy, let's see if it pays off", "label": 0}
{"text": "I hated that movie. The main character wouldn't stop pissing me off", "label": 0}
{"text": "THE GRINCH AND ENG!!!\n\n“Are you two still living” \n\n“MY SPINACH PUFFS", "label": 0}
{"text": "Puriteens.", "label": 0}
{"text": "Also, why would they want to be reminded of what they aren't getting?", "label": 0}
{"text": "Saw it in Spanish in theaters and was absolutely mind blown. I couldn’t shut up about it for months", "label": 0}
{"text": "Ben Stiller in Tropic Thunder!", "label": 0}
{"text": "I think more of Christopher Nolans movies such as Inception or Interstellar.", "label": 0}
{"text": "NO self respecting southern uses instant grits", "label": 0}
{"text": "1: I’m gonna come at you like a spider monkey!’\n\n2: Some of your foldin money’s come unstole\n\n3: Aaassss you Wiiiiiiish!!", "label": 0}
{"text": "Journey's End had me fucking glued to the screen.", "label": 0}
{"text": "Probably Mad Max Fury Road", "label": 0}
{"text": "They have nearly destroyed the USA. The Iraq war, wholly unjustified as it turns out, was financed through borrowing. Every American now owes more than $100000 on the national debt, much of which has been bought up by China. The pandy showed the lack of infrastructure, manufacturing, and social cohesion. No, they have not restored the caliphate yet but as a ROI, those hijackings will be seen in the future like Hannibal's elephant", "label": 0}
{"text": "no way not when the spiderverse films exist\n\nthey literally revolutionized the super hero genre and animation medium", "label": 0}
{"text": "In no particular order:\n\n1. O Brother Where Art Thou - growing up in the South? It’s practically a given. This was quoted almost weekly around my house in various forms.\n\n2. Hot Rod - “I’m gonna get you better Frank, then I’m going to BEAT you to DEATH!”\n\n3. Dodgeball - “It’s a bold strategy Cotton, let’s see if it works out for them.”\n\n4. Heavyweights - “Lunch today has been canceled, due to lack of hustle. Deal with it.”\n\n5. The Big Lebowski - “This aggression will not stand man!”\n\nHonorary mentions - Glenngary Glen Ross, Pulp Fiction, pretty much every Tarantino movie, Heat, Anchorman, Some Like It Hot, Tombstone, Godfather 1 and 2.\n\nI feel like comedies tend to be the most quotable in every day life", "label": 0}
{"text": "I see yalls Dobby and Cedric and raise you FRED WEASLEY", "label": 0}
{"text": "Leave No Trace. So simple, yet so effective.", "label": 0}
{"text": "Happy Gilmore\n\nJay and silent bob strike back\n\nThe Rock\n\nWedding crashers\n\nGladiator", "label": 0}
{"text": "Ned Kingsley zissou.....rip", "label": 0}
{"text": "Spaceman.  \nDid not expect it to be what it was.", "label": 0}
{"text": "I agree. I was just reading an article today for example about how the actor who played The Penguin from The Batman movie declined coming back for the new TV show because he didn't like the way it portrays violence against women, which has led to some discussion on social media about whether or not the movie was also too exploitative in that way", "label": 0}
{"text": "Civil War. I went into it thinking it would be obvious and derivative, still fun - but most likely a fairly predictable plot that played on the current political turmoil in the USA.\n\nThe movie had a little bit of that, surely the relevance of the film at this moment in time is largely due to the level of vitriol and violence in American politics. But it was more than that.\n\nI didn’t expect the point of view to be witnessed through the eyes of Conflict Journalism. I liked how the film never explains the politics of either factions because to a Conflict Journalist that isn’t really the point. The point is to document. \n\nThe film gives hints, but also shows scary and deplorable actions carried out by both sides - leaving you wondering. No one side is seen in black and white, good versus evil.\n\nThe fact that they chose to have California and Texas united keeps you guessing - because that seems almost impossible in the current state of American Politics.\n\nThe performances are great, Jesse Plemmons is amazing in his short time on screen and is TERRIFYING, and the sound track is incredible.\n\nWhatever I thought it was going to be I was mistaken and really enjoyed it.", "label": 0}
{"text": "I was late to the Hereditary party and saw it last month for the first time. I was blown away and had to dive deeper into the lore on YouTube.", "label": 0}
{"text": "I've sent boys younger than you to the gas chamber, I didn't want to do it. I felt I owed it to them.", "label": 0}
{"text": "The prediddler", "label": 0}
{"text": "Top Gun Maverick. I don’t like those types of movies and I’ve never seen the first one but my Apple Watch alerted me many times that my heart rate was elevated.", "label": 0}
{"text": "Lmao", "label": 0}
{"text": "Bone Tomahawk for me. Was hoping that it'd be an interesting Western, but damn. It captivated me from the get go. Depicting the brutality of the Western frontier unlike another movie that I've seen. The acting was top notch across the board and it was neat to Matthew Fox in something again. It's definitely not for the squeamish, but give it a chance if you're even remotely interested in that time period.", "label": 0}
{"text": "Freddy vs Jason. The themes of that movie were really beautiful and deep.", "label": 0}
{"text": "Wtf is wrong with this generation.", "label": 0}
{"text": "Blue is the best colour in Magic the Gathering.  Change my mind.", "label": 0}
{"text": "Kinda weird that you waited until the end to turn on your monitor...", "label": 0}
{"text": "America October 2024.\n\n0stars, do not recommend", "label": 0}
{"text": "The Grey", "label": 0}
{"text": "John's death doesn't affect me much for some reason. I know it should, but it might just be because I can see how much he wants it to end.\n\nMel's death though was so hard to watch the first time. I've had some experience with electricity and the second I saw Percy pretend to wet the sponge I nearly yelled at the screen.", "label": 0}
{"text": "My friend earnestly misunderstood the title as referring to bowel movements, and spoke at some length about the \"possibilities\" of a horror film based on enforced constipation before being corrected.", "label": 0}
{"text": "The dinosaur stampede with the Jack Black King Kong movie was sooo long and sooo annoying.", "label": 0}
{"text": "Humans build cinematic worlds consisting of intricacies of motivation, the interpretations of how they view the world and all the nuances that go with feeling, thought and experiences.\n\nTaxi driver was lived by man and put on paper. No AI will be able to coney that rawness and realism.\n\nThere’s unlimited poetic and spiritual elements in the way artists view the world that AI can never project in a script.\n\nPlatoon had the rays of the scorching sun penetrating through the triple canopy jungle as the unit progressed on their patrol. It showed just how dense the jungle was. That was obviously experienced by Oliver stone in his tour of Vietnam. It was his observation of his surroundings. He was genius to include that observation in his movie. AI will not have that experience.\n\nErnest Hemingway put to paper many genius observations he had of the world.\n\nAI is sterile and without any discretion that makes human creativity amazing.", "label": 0}
{"text": "Good movies.  But ain't no way for Barbie and Oppenheimer", "label": 0}
{"text": "Tenet.", "label": 0}
{"text": "My biological clock is a ticking!!! Clomp clomp clamp!", "label": 0}
{"text": "It's a nice!", "label": 0}
{"text": "Sensational film", "label": 0}
{"text": "I went to see Pearl on accident, was meant to watch See How They Run but went to the wrong theater like an idiot. Pearl ended up being my favorite movie that year, Mia Goth deserved an Oscar for her performance. Her monologue near the end is fucking mesmerizing, not a peep from my theater when she started going off despite them being a vocal crowd prior. Absolute travesty she didn't win more awards that year.", "label": 0}
{"text": "Dune 2, my first Imax experience ever (there isn't an IMAX cinema near me, I went to visit my friend in another city)", "label": 0}
{"text": "We also live in a society where we don't just have sex out in the open or walk around naked. I don't want sex scenes to be so common that it's some kind of standard for actors and that actors who don't want to do that get pressured into doing it or don't get good roles. They're not pornstars, it's not their job to show their real naked body to the world. Shirtless scenes are also bad, because actors shouldn't be required to take steroids or water fast. They should only be required to act.", "label": 0}
{"text": "Absolutely", "label": 0}
{"text": "I’m 41 and have been wanting this forever. It has nothing to do with not loving sex/naked people and everything to do with almost every single sex scene I’ve ever seen is outrageously awkward and poorly done. It’s just not necessary or needed and often goes on way too long. My wife watches “Bridgerton” and Jesus fucking Christ. Is just skinimax from the 90’s. Fucking boring.", "label": 0}
{"text": "The dog in I'm a Legend", "label": 0}
{"text": "I would go the askhistorian way and ignore everything younger than 20 years", "label": 0}
{"text": "Airplane\n\nMonty Python's Life Of Brian\n\nYoung Frankenstein\n\nBlazing Saddles\n\nGodfather", "label": 0}
{"text": "This is Spinal Tap\n\nMonty Python’s Holy Grail\n\nCaddyshack\n\nFletch\n\nStep Brothers", "label": 0}
{"text": "Piece by Piece made me cheer and cry. \n\nNyad and Air both also made me cheer. All excellent, excellent movies.", "label": 0}
{"text": "This is what I meant by a tell, guys. Exhibit A.", "label": 0}
{"text": "mad max fury road - what a theatrical experience", "label": 0}
{"text": "There are sooo many good films that warrant a mention imo [the skin i live in, interstellar, the secret behind their eyes [spanish version],etc)  but the one id say blew me away is the original korean OldBoy", "label": 0}
{"text": "I saw this opening night and needed a nap afterward.  I don't think I ever blinked.", "label": 0}
{"text": "It was much better than what I heard", "label": 0}
{"text": "Oh god please let them release that AVP anime!", "label": 0}
{"text": "I was randomly in a comic store in Massachusetts a few weeks ago and saw this in their vintage toy collection.  New in box and priced at 30 bucks.  Needless to say, it is now in my possession and was my carry-on item on the flight home. \n\nhttps://www.ebay.com/itm/204966771803?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=D4B0EsUDRxK&sssrc=4429486&ssuid=toX2lGr4RVm&var=&widget_ver=artemis&media=COPY", "label": 0}
{"text": "Twenty something I agree", "label": 0}
{"text": "“Giuseppe is dead!” Followed by the little paper lanterns in In The Name Of The Father", "label": 0}
{"text": "I'm amazed how many people feel like rogue one wasn't good it's an amazing film where you can genuinely feel concerned for the main characters.  Also enjoyed the fact that they did shoe horn in a kiss at the end.", "label": 0}
{"text": "Arrival, watched for the first time last week. Everything makes sense now", "label": 0}
{"text": "The United States is not in any sense “nearly destroyed.” The national debt is an issue but not a fatal one, and the war on terror isn’t even close to the biggest problem causing that anyhow.\n\nThe United States is not going to collapse because of 9/11. You give Al Qaeda too much credit.", "label": 0}
{"text": "I just watched it for the first time the other day it was amazing", "label": 0}
{"text": "Imagine having constant news stories of sexual assault, rape, and more blasted at you all day. Then also imagine a big push towards less exploitation in Hollywood, especially of women (with a heavily documented storied history of sex scenes being treated nastily behind the scenes). It's obviously not the only reason, but if you'd grown up with that being your context for \"sex in movies\" would you not think twice about having it in there?", "label": 0}
{"text": "I saw a true crime doc where someone did that, all I could think about after that scene was that poor woman from that doc.", "label": 0}
{"text": "I think lotr and tdk check all boxes", "label": 0}
{"text": "Century defining doesn’t means elite movies tho its just culturally significant. I don’t even like Barbie that much", "label": 0}
{"text": "well I am a simple guy.\n\nLatest film I really liked was Deadpool and Wolverine\n\nBut, if I am thinking of films that really felt like long time classics, Dune 2.", "label": 0}
{"text": "Tell me you love crepes or I'm going to break your arm.\n\nI'm the pater familas, I'm bonafide! \n\nTruly you have a dizzying intellect", "label": 0}
{"text": "Maybe it sucks.", "label": 0}
{"text": "Everything all at once? Mmm no", "label": 0}
{"text": "homeless heidi?", "label": 0}
{"text": "Del not Mel.  Eduard “Del” DelaCroix", "label": 0}
{"text": "Everything everywhere all at once.  That movie was a wild and delightful ride. My wife hated it though.", "label": 0}
{"text": "When pops bought a descrambler off some magazine ad, and he wasn't home from work yet, and the homies come over. Those were the days.", "label": 0}
{"text": "-And my Axe!\n-Big gulps, huh? Alright, see ya later!\n-It really tied the room together.\n-Life, uhh, finds a way.\n-Looks like I picked the wrong week to quit amphetamines. ", "label": 0}
{"text": "Stuff I enjoyed the shit out of because, it's rare: Alien: Romulus. No nothing groundbreaking or innovative but the sets were nice. \n\nI'll +1 RRR, that's a fun movie people should see at least once.", "label": 0}
{"text": "Everything Everywhere All At Once. \n\nI've seen some really good movies since then, but that was the last one that completely knocked my socks off. Instantly went to the top of my \"all time favorites\" list.", "label": 0}
{"text": "At least one of the avengers", "label": 0}
{"text": "This guy can act.", "label": 0}
{"text": "Do they use an intimacy coordinator for triple penetration scenes?", "label": 0}
{"text": "I don't mean this in a literal sense but I get the vibes of the side of Anton Chighur that we don't see in No Country for Old Men, I did a paper on how he is a good example of psychopathy in media but we don't get to see his relationships/ how he treats sexual relationships and i feel like if we did this would be like the prequel that adds this missing info. \n\nChilling.", "label": 0}
{"text": "Dunkirk for me was nothin short of amazing!!!! I seen at cinema!\nNolan really pulled out all the stops and wi his signature style made it the most atmospheric and engaging film I’ve ever seen!\nEven moreso than Santa Clause the movie?….🤷🏼‍♂️🤣", "label": 0}
{"text": "Alas, we had plenty of wooded areas but never came across a porn cache. There were however, on occasion, the random mattresses that I can only assume were uses by hobos and the locals to perform acts of questionable sexuality.", "label": 0}
{"text": "Who talks about either movies anymore ? It was significant for about 6 months.", "label": 0}
{"text": "So glad I went into this movie blind, didn't even see the originals.", "label": 0}
{"text": "People always get mad about the Skyler hate, but they forget she was literally portrayed somewhat heelish, in the begging of the show. \n\nThey purposely wanted to show us how Walt is emasculated by her, his brother in law and everyone else, so we could get behind his cause and root for him as a protagonist.", "label": 0}
{"text": "I have this on my queue, time to bump it to the top", "label": 0}
{"text": "Uh,  no they aren’t. Their brains were already rotted by cartoon porn by the time they hit high school. ", "label": 0}
{"text": "I quote Gladiator all the time. You mean you don’t shout “Are you not entertained?!” After each department meeting?!?", "label": 0}
{"text": "Lots of people are, hence the high ratings.", "label": 0}
{"text": "How do these kids think they were born?", "label": 0}
{"text": "Interstellar. Saw it last year for the first time and I didn’t know anything about it going in", "label": 0}
{"text": "I highly recommend *Suttree* if you want something a bit less bleak than his usual fare. It and *Blood Meridian* are two of the best books I've ever read.", "label": 0}
{"text": "top gun maverick (2022) on ScreenX", "label": 0}
{"text": "The bums will always lose!", "label": 0}
{"text": "for raunchy comedies they were great", "label": 0}
{"text": "Godzilla Minus One\n\nBefore that, The Northman", "label": 0}
{"text": "Challengers. God damn that movie was amazing", "label": 0}
{"text": "Yeeeees.", "label": 0}
{"text": "I thought it was funny", "label": 0}
{"text": "Lol I will always remember the lady with the record breaking nips....", "label": 0}
{"text": "I liked it", "label": 0}
{"text": "The Unbearable Weight of Massive Talent.  I'm in my 30s and Pineapple Express was without question the number one stoner comedy of my generation.  It was what you could call a modern day Cheech and Chong: Up in Smoke at the time of It's release and the years that would follow.  Unbearable Weight is everything I hoped it would be as a fan of Nic Cage and Pedro Pascal and more.  It was preposterously hilarious.  It was clever.  It was sharp.  It was tactical with It's delivery.  It is one of the best comedies of the past decade.  It could be one of the greatest comedies of all time.", "label": 0}
{"text": "It feels stupid to say, but the first James Cameron “Avatar” film. I was kind of underwhelmed initially by the film’s opening/lead up, then the helicopter reached those floating mountains. I was in an IMAX 3D theater and I swear to god, it felt like I could climb right inside that movie from the edges of the screen. After that I couldn’t care less about the story - the visuals were so incredible. That experience still holds a huge place in my heart, one that Avatar 2 didn’t quite manage to duplicate (beautiful movie too but too bloated IMO).", "label": 0}
{"text": "i saw anora and the substance in the same month. \n2024 has been a good movie year.", "label": 0}
{"text": "A Better Tomorrow 1 & 2 and Demigod: The Legend Begins", "label": 0}
{"text": "Incendies.   I can’t believe it isn’t discussed more", "label": 0}
{"text": "Requiem for a Dream. A friend showed it to me and it’s one of those movies that feel like a train wreck you can’t look away from. It was raw, visceral, I really had no words by the time the credits rolled.", "label": 0}
{"text": "Not a teen. Xennial actually. Went to Asia on my honeymoon. Parents happened to have a trip at the same time. They were on a church tour (no priests). One stop was Thailand (Pattaya), so we met up. Said church tour wanted to go see sex shows, because that's what you do. Wife said, hey parents want to go to this thing, let's go. I said absolutely not. I've been to Thailand before so I know what those are about.\n\nDad used to watch Porky's and told us to cover our eyes. This was much, much worse. These were huge arenas though, and I sat as far away as I could. Good times.", "label": 0}
{"text": "I don't know if \"blown away\" describes it, but I was very impressed with **Deadpool and Wolverine** after not clicking with #2 at all. as far as I remember, watching the ORIGINAL Blade Runner in a second run theater was the only time I've been \"blown away\" by a movie. \n\nI DID feel like a little kid watching Buck Rogers in the 40s watching **Sky Captain and the World of Tomorrow**.\n\n  \n**Under the Silver Lake**'s mysteries got in my head for a week\n\nO.K. **King Kong** 2005 totally wowed me now that I think about it", "label": 0}
{"text": "Eh, I haven't cared about sex in movies since I was 14, find it mostly annoying but only if it's tossed in and the story could've gotten across without it. It just doesn't reach me as necessary most of the time, but if you prefer it, hey, that's ok. I really don't care.", "label": 0}
{"text": "This movie is hilarious sorry you couldn't get into it.", "label": 0}
{"text": "My parents put this movie on when I was 11 and it’s stuck with me since", "label": 0}
{"text": "Is your name Jeff, by any chance?", "label": 0}
{"text": "Is it [Man Facing Southeast](https://m.imdb.com/title/tt0091214/)?", "label": 0}
{"text": "We had the VHS time cop.  There are naked boobs in time cop.\n\nOne day a couple years after we got it out family decides we're going to watch it again for movie night.\n\nWell when it got to the boobs scene the tracking was so off from the tape being paused and rewound it was pretty obvious that scene had been played on repeat a thousand times lol.\n\nMy dad laughed, my mom took the movie away.... :-(", "label": 0}
{"text": "Tommy’s monologue on the “guarantee fairy” lives rent free in my head to this day!", "label": 0}
{"text": "Borat. Hot fuzz. Shaun of the dead. In Bruges. The dark knight.", "label": 0}
{"text": "Inception for me. I remember looking down the row of the full IMAX theater during the fistfight when the hallways started turning and everyone had their mouth open and on the edge of their seat. It stuck with me and not just the part about the spinning top.", "label": 0}
{"text": "Outstanding. I always hold out until the end when Chick is stood by himself and the kid hares round the car", "label": 0}
{"text": "If peeing your pants is cool consider me Miles Davis. Pretty much all the 90’s Sandler movies.", "label": 0}
{"text": "But the cost of that >! forgiveness… !<  I agree that the ending isn’t soul crushing, but it’s bleak. >! It’s like saying a tiny glimmer of hope is there, but you’ll have to dig through a lifetime of grief to find it.!<", "label": 0}
{"text": "My personal breaking point where I started noticing it was in 28 Days Later. Of course there happens to be a beautiful woman his age, who's single, and they're both attracted to each other, so they can fall in love in between trying not to be torn to shreds by zombies. After that I noticed unnecessary, usually shallow romantic subplots shoehorned into every movie, it was actually pretty absurd. I like the idea of romance or sex only being included if it works with the story and there's some effort to do it right.", "label": 0}
{"text": "It’s not just the character that dies, but to me it’s symbolic of the death of *childhood* in general and the *innocence* that goes along with it. It’s forever abandoning one’s ability to find wonder and joy in childish things and imagination, leaving it in the cold, dark void, only to be replaced by adult things, like taxes.", "label": 0}
{"text": "Big Lebowski, for like every line\n\n\nAce Ventura just because of a few, that are used all the time, you probably don't even realize it. \n\nGhostbusters\n\n\nPrincess Bride\n\n\n\nFor me personally, Orgazmo. For 25 years, any time someone says Jesus, I say Where? Sheer numbers alone has to put this one up there.", "label": 0}
{"text": "Less horny\nMore wholesome", "label": 0}
{"text": "Come and See", "label": 0}
{"text": "Dude there's always comments going \"I bet this is an ad for their OF\" whenever an attractive woman posts", "label": 0}
{"text": "It's a great movie! You are appallingly bad.", "label": 0}
{"text": "It is NOT great cinema, by any means. That said, Twisters had me feeling like a 90s kid watching the T-Rex roar again. Pure spectacle and it was so strong.", "label": 0}
{"text": "Adults too please. Stop already, it's uncomfortable and just not that important to the story.", "label": 0}
{"text": "Hmmm, I wonder if that Wellness Center is the same one she ended up in after her accident.", "label": 0}
{"text": "One of the funniest moments in Knives Out: Glass Onion is a visual gag where Edward Norton’s character is dressed as TJ Mackey. \n\nhttps://www.businessinsider.com/glass-onion-edward-norton-dressed-tom-cruise-magnolia-2022-12", "label": 0}
{"text": "It's been 5 years", "label": 0}
{"text": "Forgotten how to make good movies.  They are still experts at pushing out crappy to mediocre movies using the desecrated corpses of beloved franchises.  Or just trying out new hot garbage that only appeals to a vocal minority.", "label": 0}
{"text": "Oh, silly guy.  You can’t be in a serious relationship with a movie.  They only want you to watch them and never do anything for you in return.  I tried it with Deep Impact, but sadly I never made a deep impact on it.", "label": 0}
{"text": "It’s a pretty disturbing series to me for all the wrong reasons. I can appreciate well designed and excessive gore and such— hell, the saw movies are a riot for partially that reason (the other being the downright absurd storylines). But terrifier is particularly cruel and graphic, with its more gratuitous scenes being saved almost exclusively for the film’s women characters. With how gratuitous and mean some of those kills are, I just can’t understand how people aren’t at least somewhat questioning of the creator’s tendencies. The movies just don’t feel like they have anything interesting to say, which is the worst thing a film can do imo", "label": 0}
{"text": "Dune 2", "label": 0}
{"text": "i wish i pirated the movie", "label": 0}
{"text": "She's not a Mary Sue.", "label": 0}
{"text": "Great poster", "label": 0}
{"text": "For a great example check out Tig Notaro “I have cancer”", "label": 0}
{"text": "They can't. They had to move mountains to get one of their guys in JJ back for one, and I'm sure he regrets it. It invites a filmmaker into receiving all the criticism in the world, and for most of the best directors, a nice paycheck doesn't make that worth it.", "label": 0}
{"text": "We're gonna need Guns. Lots of Guns.", "label": 0}
{"text": "The Sommelier scene from John Wick. Amazing.", "label": 0}
{"text": "Baby Driver.\n\nAll the musical inspiration considered,\n\nI remember my seat rumbling every time the gears shifted in the vehicles. An awesome introduction to the Dolby format.", "label": 0}
{"text": "Always banging on about the alcoves", "label": 0}
{"text": "Maybe this isn’t exactly what you’re looking for but the armory scenes in the LotR trilogy always got me hype!", "label": 0}
{"text": "I don't think you understand words.\n\nWhat I mean is there is no justification, other than money, to warrant more of that. In terms of story or structure, there just isn't much there. There is nothing further to say. it's just empty violence. We'll make it a franchise anyway because it made money.", "label": 0}
{"text": "Stepford wives too", "label": 0}
{"text": "The movie is about a lot of things.\n\nIt's about drug addiction.\n\nIt's about the pressure of being a female star.\n\nIt's about shitty men, and good men.\n\nIt's about revenge.", "label": 0}
{"text": "That day rocked", "label": 0}
{"text": "Hmm. Welp! I guess. Haha! You did a good job at pissing me off. I guess I feel the way I feel because I was taught to pretty much abstain from sex. \"Just don't have sex\" \"it is very dangerous\" and all that. It would be nice if I did not feel uncomfortable about it. I do not know how to.", "label": 0}
{"text": "nice", "label": 0}
{"text": "I didn't know Kid Cudi was in those movies.", "label": 0}
{"text": "Its way too late for that now. They have a decade of stories they've told, how do you start over? Tossing the EU was easy because your general audience probably wasn't aware of it. Make a new movie now with a new canon and general audiences will go \"Wait, how does this tie into Last Jedi? Where is Rey?\".", "label": 0}
{"text": "Didn’t end up in a pound-you-in-the-ass prison tho", "label": 0}
{"text": "I had huge expectations for that movie, given that 'In Bruges' is one of my all time favorites and the amazing cast, but I hated it immediately. \nTherefore, I was pretty reluctant to see 'The Banshees', only to see one of the best films of the decade.", "label": 0}
{"text": "“Zoomer talk” that’s a new one. Riveting.", "label": 0}
{"text": "It was a streaming show\n\nIt's actually pretty good", "label": 0}
{"text": "[Pew Research has been leading generational studies for decades and settled on those years.](https://www.pewresearch.org/short-reads/2019/01/17/where-millennials-end-and-generation-z-begins/) I think I'll stick with them over a Reddit user saying \"that's not correct\".", "label": 0}
{"text": "Just for clarity, the Story Group is a bit of a misnomer.  Their job was never to develop story ideas or vet them.  They are there as a resource IF story tellers want to use them.  A more recent example of this is in The Acolyte, Leslye Headland went to the Story Group and essentially said \"I want to bleed a kyber crystal, how can we do it in the context of the scene I want?\"  Technically she didn't even have to do that (though, seemingly the story group is more involved in TV than movies, particularly non-Filoni related TV shows).\n\nThey don't produce story ideas, they don't approve stories, sometimes they don't even know what's going on in certain stories until they are near completion.  The end.", "label": 0}
{"text": "I found it very weak to begin with.  It felt like a badly made LOTR in an alternate universe.  A lot of it was too familiar but done in the most boring way possible.", "label": 0}
{"text": "I hope it's about him at MIT trying and failing to avoid restarting his lost friendships.", "label": 0}
{"text": "Hollywood has always considered Animation a genre vs what it is, a medium. Would love to see more stories being explored with animation.", "label": 0}
{"text": "I can’t tell if you’re trolling or serious.", "label": 0}
{"text": "I have my doubts Avengers won’t get moved again honestly", "label": 0}
{"text": "Only if Jay-Z and Swizz also make a remix to Girl's Best Friend.", "label": 0}
{"text": "The Rogue Squadron movie is such a softball that I have no idea why they can't make it happen.", "label": 0}
{"text": "Six times! Civil War, Avengers 3 and 4, and his own trilogy.", "label": 0}
{"text": "But....THERE WAS A FIRE FIIIIGHT!!!", "label": 0}
{"text": "that's pretty shitty but I'm not surprised that virtue signallers will go to great lengths to virtue signal without actually being virtuous", "label": 0}
{"text": "Those guys showing up with a RPG towards the end was great.", "label": 0}
{"text": "Agreed. I’m not saying anyone needs to like where the franchise is at. Even my own love for it is at an all time low. But the people following it for 10+ years saying it’s ruined really do just need to move on if they hate it so much.", "label": 0}
{"text": "Loved this, as well as \"Commander USA's Groovy Movies\"! The concept of a pudgy, cigar-smoking ex-superhero showing bad movies always seemed so fun and unique.", "label": 0}
{"text": "I’d watch an “Old Man Peter” movie", "label": 0}
{"text": "Evil Does Not Exist - still has me thinking.", "label": 0}
{"text": "Ikr! Lightening bolts shoot from my fingertips DAMN, him and Michael Mando stole my heart with that show", "label": 0}
{"text": "Planes, Trains and Automobiles has some great scenes which show that Candy could do the serious/emotional stuff. Had he not passed away and was given the chance, he could have done some great drama work.", "label": 0}
{"text": "Throughout this whole scene, I'm chuckling at Rutger Hauer's character standing back and watching him, and you can see the look on his face, like, \"Yeah, this kid finally GETS it.\"", "label": 0}
{"text": "Came here to post this. I was blown away in theaters back in 2008. Tried watching it this year and it was a chore to get through. \n\nThe heist at the beginning, where each team member kills another during the heist, at a predetermined time in the heist, requiring a bus to come through the wall at the exact right second? Stupid. In fact, Joker’s plans are all like this throughout the movie: requiring everything to go 100% right down to the second, and then claiming he didn’t plan anything and everything is improvised, relying on movie editing to make it all work. Even the silly little pencil trick relies on the guy charging him at the right time and angle while not hesitating at all when the Joker sets up his pencil prop and drops a quip. He’s basically the villain version of a Mary Sue in the film. \n\nBut that’s not what makes the movie a chore. That would be characters making trite speeches every other scene. Bruce, Gordon, and Alfred all take turns making speech after speech hammering in the themes of the movie which, let’s face it, aren’t that deep. All capped off with the stupid “more than a hero” speech that could have been pulled off /r/imfourteenandthisisdeep.", "label": 0}
{"text": "It's because they don't have anything interesting to say. I'm all for insane violence, but if that's all you have to offer...people are gonna get tired of it eventually.", "label": 0}
{"text": "Fingers crossed for the tv show! Books that span the whole school year like that deserve multi episode seasons", "label": 0}
{"text": "it's rare his characters will ever even lose a fight", "label": 0}
{"text": "Came here for this. \"we're actually gonna be doing a lot of runnin.  So we'll just take a few of these small ones!'", "label": 0}
{"text": "Whiplash", "label": 0}
{"text": "Definitely, thank you for the reminder!", "label": 0}
{"text": "We're more mature now and we appreciate mature takes on the material.  That said, I watched the LEGO Rebuild the Galaxy and it was fun as hell.", "label": 0}
{"text": "I think it depends on the movie. Everybody knew they weren't gonna kill off Spiderman in Far From Home but there's more possibility in the Avengers movies. If the deaths in Infinity War had been spoiled that would have bummed a lot of people out.", "label": 0}
{"text": "Assaulted on live television? Pep-ep-ep-farms remembers.", "label": 0}
{"text": "They’re making another Avengers? Iron Man, Captain America and Thor gonna look old as hell.", "label": 0}
{"text": "These things have writers?", "label": 0}
{"text": "Well if you want less artsy you can go for Margin Call since you teach business English. That would be real fun.", "label": 0}
{"text": "Uh-oh, suddenly you're not using the emojis! Guess I was right haha", "label": 0}
{"text": "[It's the Anti-Trilogy](https://youtu.be/XtArKawnWNI?si=E7TA2HokosSgmHK_)", "label": 0}
{"text": "I enjoyed the force awakens. It was safe but that would have been fine if the next two movies weren't directionless noise.", "label": 0}
{"text": "double the movie double the meaningless stats for the investors!", "label": 0}
{"text": "*UP* all night", "label": 0}
{"text": "Because Sony has done such a bang up job with their Spider-man properties over the last 20 or so years.  I don't think they made a single good marvel movie in that time frame, even if Andrew Garfield was well casted.", "label": 0}
{"text": "This is the absolute number one first one I thought of and one I've watched on repeat over and over", "label": 0}
{"text": "You're both hired.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Hot fuzz", "label": 0}
{"text": "I’d just like for them to vary the aesthetic from the Jackson movies. Do something new and make it weird!", "label": 0}
{"text": "Everything Everywhere All At Once. This should make a good one to review", "label": 0}
{"text": "Happiness.", "label": 0}
{"text": "NGL, the credits of Venomized animals was far more interesting and visually unique than most of the movie.", "label": 0}
{"text": "I just watched and loved it! Love the skeazy vibe, actor commitment and the humour...a fun watch", "label": 0}
{"text": "Lucas wasn't doing a great job either. This franchise was essentially dead in thr water after the 2nd trilogy. I'm curious what other production companies could do a better job ", "label": 0}
{"text": "A *federal* pound me in the ass prison", "label": 0}
{"text": "He was good in his supporting role in How to Make it in America on HBO.", "label": 0}
{"text": "Not for everybody. Especially the aro/ace's of the world lol", "label": 0}
{"text": "i'm going to go with Kill Bill. When Beatrix visits Hattori Hanzo. 10/10. \n\n\"i have vermin to kill\"", "label": 0}
{"text": "Lord of War.....", "label": 0}
{"text": "What did Chalamet do with Nolan", "label": 0}
{"text": "Terminators are only capable of one method of incapacitation.", "label": 0}
{"text": "Predator", "label": 0}
{"text": "Thank you, I could remember the movie but forgot the name of the movie", "label": 0}
{"text": "Yes all seasons are great, but ive watched them all", "label": 0}
{"text": "End of days has a cool one", "label": 0}
{"text": "Actually it's coral blue #5", "label": 0}
{"text": "Lol no.  Say what you will about the holland movies but Sony is so so so much worse", "label": 0}
{"text": "The Matrix!", "label": 0}
{"text": "It's commando. It's always Commando", "label": 0}
{"text": "I know I'd have been really good with Sebastian Stan as a recast Luke. He's got the general look, and seems to have good acting chops. Plus Disney already has contracts with him.", "label": 0}
{"text": "> The way Disney has done things since the MCU took off is by having the story groups create a lot of the [action] scenes in \"\"pre-production\"\" and having a main writer come on later to fill in lame stuff like dialogue towards the back end of production. IIRC they had entire Endgame scenes done in CGI before the actors stepped on \"set\" for Infinity War.\n> \n> Writing is a production afterthought for them now.\n\nThis is ironically exactly how comics used to be written. Artist would draw everything with some very basic ideas from the editor and writer, then the writer would come in and fill in the text boxes.", "label": 0}
{"text": "Zodiac.", "label": 0}
{"text": "They never said they didn't like a Star Wars thing since '83, & they never told others that they're enjoying it wrong.", "label": 0}
{"text": "Its crazy that there is this revisionist history around the OT and PT.\n\nThe RotJ was easily seen as the weakest of the 3... and faced far more criticism... but it wasn't panned.  It's easily far 'lazier' than the first 2 films... but they are also behemoths of cinema.\n\nThe Prequels, on the other hand, were absolutely torn apart... from acting, to dialogue, to inconsistency, tonal difference, over reliance on CGI etc... and its only the subsequent generation who grew up on them (and especially the broadly available tertiary material) that dismiss those issues since that's just how their 'era of Star Wars' was.", "label": 0}
{"text": "Highly recommend Copycat.", "label": 0}
{"text": "It made money because enough audiences demanded it.  And more.  What other justification is needed for a movie?\n\nI also didn't know horror franchises needed to have godfather like stories and structures.  Successful franchises that ran long like TCM and Friday the 13th were works of art in that respect?  Ok\n\nI don't even care for these.  Pretty indifferent.  Just weird as shit how much of a hate boner some of you have for it.  You don't like it.  Cool.  Other people do.  Keep it moving maybe?", "label": 0}
{"text": "I’ll come with a hot take and say the acting isn’t even that good. Phoenix is just doing the same thing he was doing in The Master but in the joker it just feels hollow and like someone should have reined it in.", "label": 0}
{"text": "An alternate take from someone older who also grew up with comics, a hour and a half movie is not really the place to show sex between comic characters versus a monthly episodic comic where you get to dig into daily lives far more.", "label": 0}
{"text": "Imagine owning one of the biggest IPs ever, and then hand it to a person who clearly has no clue of how to handle it, and simply watch as they kill such an adored cash cow.\n\nThey own Darth Vader, people would love more Darth Vader scenes, film or series, how are they so dumb?", "label": 0}
{"text": "Okay zoomer haha", "label": 0}
{"text": "He's fun in Bill & Ted 3 too. Seems like he really wants to do comedy which I can get behind.", "label": 0}
{"text": "Lol, this was the first thing that came to my mind too!", "label": 0}
{"text": "I used to be a huge fan of The Sixth Sense, but now I find the twist less impactful since I know what's coming.", "label": 0}
{"text": "This year: \n\nDune p2. All of us strangers, Godzilla Minus One (streaming), \n\nRegretting watching Poor Things …", "label": 0}
{"text": "Honestly, just the Commando bit where Arnie is strapping, painting, and loading up always gets me. 😅", "label": 0}
{"text": "It’s a fake dong, but yes lol", "label": 0}
{"text": "For me it was the first 5 mins of The Last Jedi when Poe started making yo mama jokes. It was just this clear moment of realization that this franchise was no longer for me.", "label": 0}
{"text": "🌽😂", "label": 0}
{"text": "I’m gonna git you sucka (1988)", "label": 0}
{"text": "I jammed this for months before seeing it, so the first viewing was almost a re-watch. \n\nBlack Hawk Down OST (Hans Zimmer) is another cinematic experience to listen to.", "label": 0}
{"text": "Home Alone, in a way... ;)", "label": 0}
{"text": "Interesting note about AI.  There have been quite a few films that have delved into the concept of an \"out of control\" AI.  This is obviously *not* an exhaustive list:\n\nI think the earliest film to show an out of control Artificial Intelligence might well be the Fritz Lang/Thea Von Harbou film *Metropolis* (1927)... though perhaps there were other films showing robots and the like, no?\n\nAnother film about \"bad\" AI is *2001: A Space Odyssey* (1968).  The Hal 9000 is quite the Frankenstein's monster!\n\nAlso worth checking out *Collosus: The Forbin Project* (1970).  It takes the concept of an out of control AI to its logical conclusion.  May have been something of an inspiration to James Cameron when he thought up *The Terminator*!", "label": 0}
{"text": "AI and hand drawn animation is a no no, it would look like utter shit (As has happened the few times it gets used, those 60fps Disney clips come to mind) and can completely distort the artist's intent. There's a reason some shots might linger on a drawing for an extra frame or two.\n\nHowever, you're not wrong in that the trailer might be a partial WIP. It has happened before. In-between frames can be drawn and added between then and the final product. Just there's having variable framerate ala Puss in Boots 2 or Spiderverse (Or even high quality anime like Cowboy Beepbop), then there's looking like a choppy mess.\n\nI'll see how it is for myself I suppose.", "label": 0}
{"text": "Go and do your homework lad lmao", "label": 0}
{"text": "Dark Knight.", "label": 0}
{"text": "[](https://www.imfdb.org/wiki/The_Quick_and_the_Dead_(1995))", "label": 0}
{"text": "Ratio is probably 1 to 1000.", "label": 0}
{"text": "I think that scene speaks to one of the biggest thing that ages poorly. That scene they are being truly awful, and instead of calling the cops on them, the women are just like “yup, we’re objects let’s go” and even though they are fucking with them it’s still so unrealistic and basically condones their behavior even though they “don’t”.", "label": 0}
{"text": "Richard Pryors \"set\" where he played 'God' and absolutely shredded the audience \n\n\nPryor was a very complicated man , his humour came from rage a lot of the time. Not the Chad punching a hole in the wall cos mom said no to buggies rage. The cold and crystalline, brittle like shattered glass kind of rage that the psyche is desperately trying to hold back.", "label": 0}
{"text": ">  and was surprised that the Wesley character hasn’t aged well. He’s kind of a dick to Buttercup \n\nYup.  He'd been gone for years, she had credible reports that his ship had sunk, he hadn't sent so much as a postcard to her to let her know he was alive and still thinking of her, and he's outraged she moved on.  It's not as if she was a gold digger throwing herself at the Prince the day after Wesley left.", "label": 0}
{"text": "I loved Eye of the Needle (1981).", "label": 0}
{"text": "The best comedy is often pulled directly from real life drama/trauma", "label": 0}
{"text": "It got canceled once Marlon Brando passed away.", "label": 0}
{"text": "I’m shocked no one has mentioned the armory in the Airstream trailer in The Accountant.", "label": 0}
{"text": "Anyone else who noticed that the hospital scene at the end right before the \n\nSad memory montage\n\nWas just on a black background set?\nThought it would lead to something like he was in space or something, with what a mess the rest of the movie was, but when it cut right to him being in NY it just felt like the hastiest shot scene ever.", "label": 0}
{"text": "I had the exact same question. Interstellar briefly.", "label": 0}
{"text": "Not having Cullen as Optimus was fine for me (we've had several renditions of Prime without Cullen) but I think it would have been cool to have a moment where Cullen voiced Primus and have him say \"Arise, Optimus Prime\" like he did for Rodimus.", "label": 0}
{"text": "If they say there hasn't been anything good since 83, that's the same thing. Stop being toxic and let people enjoy what they enjoy you obscene manchild.", "label": 0}
{"text": "The best incapacitation is a decapitation - Terminator Buddha", "label": 0}
{"text": "And 4!", "label": 0}
{"text": "Unless you specifically program them to exclusively shoot kneecaps or throw dudes onto hot stoves.", "label": 0}
{"text": "[Kill Bill Vol. 2 - Elle Driver vs Beatrix Kiddo](https://www.youtube.com/watch?v=M7lfgyrloGY)\n\nThis is one of my all time favorite fights because of this. If Elle can draw her sword, Beatrix is dead. So she uses the tight quarters to prevent her from doing so.", "label": 0}
{"text": "Wouldn't it be wild if it's all a fakeout, and Marvel announces there is no Spiderman movie after Avengers' release? A stunt like that might just be the most shocking reveal from Marvel since Infinity War.", "label": 0}
{"text": "Pawn shop scene in pulp fiction.", "label": 0}
{"text": "I didn’t laugh either, but was in love with the movie. Some people have different reactions", "label": 0}
{"text": "Disregard the trash remake that missed the point of the book and acquire the beautifully made and faithfully adapted original.", "label": 0}
{"text": "Anyone fighting on a cliff’s edge or the top of a building or something similar where they understand that simply toppling the person over the edge gets rid of them permanently.", "label": 0}
{"text": "Seven", "label": 0}
{"text": "Not the best armory scene, but i think of chucky in the military armory switching the paintballs to real bullets lol", "label": 0}
{"text": "Cool. Yet Happy Gilmore still slaps.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "So someone talented with a staff should have no problem taking on a Sith adept trained in the force? Really?", "label": 0}
{"text": "We went deep on this in the latest podcast - mostly not sober but it all makes sense. \n\n  \n[https://www.themovieclubpodcast.com/2410863/episodes/15956925-10-things-we-hate-about-10-things-i-hate-about-you-90s-nostalgia](https://www.themovieclubpodcast.com/2410863/episodes/15956925-10-things-we-hate-about-10-things-i-hate-about-you-90s-nostalgia)", "label": 0}
{"text": "10 Things! [https://www.themovieclubpodcast.com/2410863/episodes/15956925-10-things-we-hate-about-10-things-i-hate-about-you-90s-nostalgia](https://www.themovieclubpodcast.com/2410863/episodes/15956925-10-things-we-hate-about-10-things-i-hate-about-you-90s-nostalgia)", "label": 0}
{"text": "I watched SLC Punk for the first time in my 40s and absolutely loved it.  I mean, it's tragic, but so good.", "label": 0}
{"text": "Then you have Airplane, stuffed to the gills with renowned serious actors like Leslie Nielson, Lloyd Bridges, Robert Hayes or Peter Graves .\n\n\nThat film launched Nielson into comedic roles rather than the shakespearesan roles like The Forbidden Planet, which was based on The Tempest.", "label": 0}
{"text": "The Tobey Maguire trilogy & the first Amazing Spider-Man are better than any MCU Tom Holland film and they were made by Sony.\n\nAlso the Into The Spider-Verse films, all Sony.\n\nEven The Amazing Spider-Man 2, with all of its problems, at least feels like a Spider-Man film instead of some manufactured CGI-fest like the Tom Holland films.", "label": 0}
{"text": "I know I'm coming late to this, but I am right there with you. For me, what got me was The Acolyte. I thought it was going to do something interesting, and then it just...didn't. It was very amateur, and and it sort of took all the wind out of my sails for Stars Wars, to the point that I'm having a weird time dealing with it.", "label": 0}
{"text": "Is that the one with Michelle Yeoh?", "label": 0}
{"text": "It's probably gonna be another multiverse story 😪", "label": 0}
{"text": "From day 1 it was obvious Rey was the most classic Mary Sue character than anyone could ever devise in a lab.\n\nPeople hate to hear that fact too.\n\nI mean ... they could have made the character interesting ... they chose not to. That's right! She's a jedi GIRL! That's great Lisa. .. we already have 3 girls on the team ....", "label": 0}
{"text": "The Matrix - surely?", "label": 0}
{"text": "Dune: Part 2\n\nSynecdoche, New York\n\nThere will be Blood\n\nNo Country for Old Men\n\nFull Metal Jacket", "label": 0}
{"text": "I liked it better when it was set on Asgard and called Thor: Ragnorak.  Seriously, it's the exact same plot.", "label": 0}
{"text": "lolol at all of this dismissing my entire life dealing with this shit. I am going to go back to my analogy of a white person telling a black person, \"no no no, you didn't experience any microaggressions because I never noticed it happening\"\n\nMost people don't notice microaggressions that doesn't effect them. I am directly telling you that these are things I am constantly dealing with on social media and in real life. But nah, I am apparently too emotional about something that has drastically harmed my mental health in my life so that just means everything I say is now irrational. Thanks for the dismissal and the continuation of acting like nothing is wrong because you don't experience it on your end. Happy that the body you were born with isn't subjected to negative stereotypes on the daily and is often only connected to positive things in media. Other people experience society and the messages shared often differently because those things effect us directly.", "label": 0}
{"text": "Sure because that would spoil something compelling that happens in the movie but I think my point is that what gives these movies steaks to me isn't the possibility of death even when they're constantly putting characters to the brink. The steaks are whatever they've set up for the character in that movie which doesn't have to involve anyone's death", "label": 0}
{"text": "Andor was good. Mandalorian was mostly good.", "label": 0}
{"text": "Raiders of the Lost Ark", "label": 0}
{"text": "Right? Hey here’s Indiana jones but instead of being a swashbuckling adventurer he’s an old washed up loser living a sad life. No thanks lol", "label": 0}
{"text": "I'm surprised that no one mentioned 'Kick-Ass'. Hit-Girl and Big Daddy had an epic arsenal.", "label": 0}
{"text": "The Graduate.\n\nDon't get me wrong, the filmmaking is top notch, the soundtrack straight up classic, the acting is all fantastic.\n\nBut there is literally no one in the movie who is likeable –and I have enjoyed films about really terrible people before (Shallow Grave, Naked, etc.). The Graduate doesn't work for me because nobody involved in its making seems to have understood that the people are all terrible.\n\nMrs. Robinson: cheats on her husband with an adult son of her friend (as a parent who has friends with college age kids, the idea that any of us would have sex with one of them is vile); also falsely accuses said man of rape when the adultery is found out.\n\nBenjamin: has sex repeatedly with a married woman, in and of itself reprehensible; decides he is in love with her daughter whom he stalks despite being repeatedly told to leave her alone and tehn disrupts her wedding to another man.\n\nElaine: finds out a guy she was dating has had sex with her mother, potentially destroying her parents' marriage, but decides out of the blue that this person is worth leaving her fiance, whom one would assume she had had communicated some kind of romantic feelings for previously, *at the literal altar*.", "label": 0}
{"text": "What?", "label": 0}
{"text": "Honestly I feel that man in my soul", "label": 0}
{"text": "Its the one bit of fun that comes from the awful finale of GOT. Sure these 2 guys get to keep makin netflix movies or whatever but if they had just taken their time theyd be Spielberg levels by now. Theyd have the golden ticket for whatever they want because do you really want to be the studio that tried to meddle with the geniuses that pulled off GOT?! \n\nIts seems to be such a major issue with directors and showrunners nowadays. No one wants to put the work in and make a proper adaptation or finish an unfinished work with respect to the source material, its either bumrushed garbage or hamfisted fanfic.", "label": 0}
{"text": "This looks intense! Sam Raimi producing means we are in for some serious thrills and chills. The whole \"20 minutes until your body shuts down\" concept sounds terrifying. Definitely adding this to my watchlist—perfect for a late-night binge", "label": 0}
{"text": "He writes to his local paper, so I assumed he was a journalist. Could could just be a writer that contributes to his local paper. Either way, that's still very different from a Scientist or Dock Worker", "label": 0}
{"text": "No, that's [Spaceballs](https://www.youtube.com/watch?v=etY7kbRRQ_c&pp=ygUQc3BhY2UgYmFsbHMgYmVhbQ%3D%3D)", "label": 0}
{"text": "> I think he would enter the tier of Robert Pattinson, Timothy Chalamet, etc, who have also collaborated with Nolan already.\n\nIt'll be extremely hard to top Chalamet's collaboration with Nolan, but we'll see.\n\nEDIT: This joke did not register, I guess, so whatever, down vote away. But it was joke about the very idea that Chalamet's role in Interstellar was interesting, much less memorable. I believe even Chalamet himself has talked about having a bad emotional reaction after he saw the film and realized how small his part had become in the final edit. For what it's worth, I think Chalamet is easily the best actor out of the three actors being discussed here.", "label": 0}
{"text": "“Hey the terminator killed that gun store guy!”\n\n*of course, I’m a terminator* 😎", "label": 0}
{"text": "I still think starting with a 10 years old Han would make more sense. Then you switch to a 18 years old Han in the trenches.  And we don't need to know everything.  \n\nIt's not a bad star wars movie though.", "label": 0}
{"text": "Eh, they were big dumb fun when they were new, and they're still big dumb fun.  I've enjoyed rewatching the Infinity Sage with my kids quite a bit.", "label": 0}
{"text": "Working with Disney on Star Wars must be miserable. So many writers and directors probably started because of how much they loved the movies, I'm sure it's a dream job for many of the people they sign on. It's crazy that Disney keeps driving them away.", "label": 0}
{"text": "I just heard the horns from the Two Towers soundtrack in my head, along with Aragorn kitting up.\n\nThen Gimli's chainmail dress hitting the floor (but not like that).", "label": 0}
{"text": "The steel drums of the 80s movies is permanently seared intoy brain, and I love it", "label": 0}
{"text": "Wow! I have the complete opposite reception to that. The reality of the subject (injustice and incompetence) is PERFECTLY demonstrated by there being no real repercussions or justice. That’s what these stories are like for the majority. I don’t understand why someone would go into that movie hoping for a nice bowtie justice porn ending to wrap it all lol it feels at odds with what they were trying to show.", "label": 0}
{"text": "I can’t even judge, because I was raised the same way. It took a very long time to get over, and in some ways I’m still not over it. \n\nI think that’s why I get so heated over the issue… a little overcompensation lol", "label": 0}
{"text": "I agree!  \n\nI watched it by myself and I LOVED it.  Then I was kind of sad I didnt have anyone to talk about it with. \nWasn't the ending was shocking??", "label": 0}
{"text": "I’ll never forget my entire theater groaning when Rey doesn’t join Kylo near the end of that movie. Was such an interesting concept and my entire theater knew it.", "label": 0}
{"text": "Idk I think this brand of time travel involves multiple realities which means multiple versions of Paris.", "label": 0}
{"text": "Made me realize how Chris felt in that moment", "label": 0}
{"text": "There’s a first time for everything", "label": 0}
{"text": "The Game - David Fincher\nPrimal Fear - who the fu** knows the director\nUs - Jordan Peele", "label": 0}
{"text": "Politics and ego got in the way.", "label": 0}
{"text": "None of the movies you listed were really trying to go for the same audience as a Marvel movie and aside from IF and Horizon, they all had pretty low budgets. Opening against a superhero movie wouldn't really impact the box office prospects of those movies in a meaningful way", "label": 0}
{"text": "Hahahaha", "label": 0}
{"text": "> Who said anything about topping it? \n\nSometimes when conversations develop people introduce new ideas of their own and these ideas do not necessarily retroactively apply to the beliefs of all previous participants in the same conversation. Also, I was making a joke about Chalamet's very small role in the film, so the idea of \"topping it\" just sounded ridiculous and funny (to me).", "label": 0}
{"text": "Well, Obi-Wan had the high ground, so...", "label": 0}
{"text": "And Rhonda shear was a guest during the recent 6 movie \"nightmarathon\"\n\nThe beelzebub bash is tonight at 9:00 eastern if you're interested", "label": 0}
{"text": "Just like the second one, I forgot about this one almost immediately", "label": 0}
{"text": "Amazing Design Poster.", "label": 0}
{"text": "I think part of what I enjoyed about the Thrawn audiobooks was the narrator's performance. If you're reading text on pages and not liking it, the audio book might be worth trying.", "label": 0}
{"text": "There is a BBC television version from about 5(?) years ago that is set in the correct period. I don't actually remember how close to the book it is in terms of plot and character, but it might be worth checking out. It has Eleanor Tomlinson in it.", "label": 0}
{"text": "I mean you can stop at any time", "label": 0}
{"text": "If this isn’t the top answer, I’ll cover myself in mud", "label": 0}
{"text": "Nope.", "label": 0}
{"text": "Juno is the ultimate example of this. Loved it the first time I saw it, was ambivalent the second time and now I actively despise that movie.", "label": 0}
{"text": "Lone Wolf McQuade , 8 year old me thought this movie was the greatest piece of cinema ever produced. Now me, can’t watch 15 minutes of it.", "label": 0}
{"text": "I agree. \n\nThe cinematography, wardrobe and music were all so thoughtfully put together. \nThe story provoked so many emotions and it really kept me guessing.", "label": 0}
{"text": "err.. it does with Disney's anti-competitive practices of strong-arming theatres into giving them the most screens and the longest theatrical windows\n\nwhy else do you think directors like Tarantino have spoken up about this issue", "label": 0}
{"text": "I don’t really see how having multiple realities explains it.", "label": 0}
{"text": "He does things like give them weird directions (he's allegedly more exacting than might appear to be the case given the weirdness of the performances in his stuff), and mix actors with non-actors, and add erratic dialog to give the worlds in his movies a particularly... unrealistic vibe.\n\nIt's hard to explain without coming off like I'm just being reverent to Lynch, when a lot of directors do similar things. Tim Heidecker, for example, has done very similar things in his shows and projects. \n\nIt doesn't work for every director and every project, though.. I just didn't personally think it worked for Inception, though I can see why Nolan went for it given the plot.", "label": 0}
{"text": "Lmao, she is, but not debating.", "label": 0}
{"text": "Laser in space do not make sense.\n\n Because SW is WW2 in space so the bomber in the movie are like this.", "label": 0}
{"text": "The movie ends with Milton being served drinks on the beach. He was the one who set the fire that burned all the evidence who what Peter did", "label": 0}
{"text": "Tom Holland is my least favorite Spiderman in universe and out. I hate how he just gets all this tech, how he makes the worst mistakes every single time, and everyone keeps just fawning over him. Like how many people have you killed oopsie? “Here’s this and this super computer weapon” “here you go Mystery guy I just met” (spider senses can’t see BS apparently) Strange - “ think of one thing don’t move or you’ll ruin the universe” Parker - “I think I’ll do the opposite over and over and act like a 2 year old who doesn’t understand cause and effect”. Using a British guy to play a kid from NYC is pretty funny though.", "label": 0}
{"text": "Dang it! I was going to say that. Reba with the double pistol blasting.", "label": 0}
{"text": "Sandler tends to care with movies he likes and his studio is called Happy Madison because of Happy Gilmore and Billy Madison", "label": 0}
{"text": "Its a great scene, but The Bride doesnt win by knowing her environment better. They both know it about the same, she just plays the close quaters better.", "label": 0}
{"text": "Sequels only ruin something if you let them.", "label": 0}
{"text": "I woukd add that it also had the incredibly important time of \"aren't we being a little self important\" at the same time. \n\nAdd a teensy bit of self awareness and you can hook the entire millenial generation forever.", "label": 0}
{"text": "> I'm like \"why aren't you using the tv?!\" And he just shrugs.\n\nHe probably doesn't feel like letting you see and overhear what he's watching (it's nothing crazy, he's just in that phase.)", "label": 0}
{"text": "Luke had prior experience with flying air vehicles and even his friend Biggs acknowledged that Luke was incredibly talented in a ship, calling him \"the best fighter pilot in the outer rim territories\" when Rogue Leader questioned his ability to fly an x wing. And he most definitely didn't outfly rebel and empire ships -- Luke almost killed himself because he flew too low to the death star surface and if it hadn't been for Han's intervention Vader would of obliterated him. Your assessment is 100 percent wrong.", "label": 0}
{"text": "Exactly the vibes I’m getting too! Crank meets horror sounds like a wild ride, and if it's anything close to that adrenaline-pumping chaos, we’re in for a treat. Sam Raimi knows how to keep things intense—this could be a whole new level of crazy!", "label": 0}
{"text": "His limitation is his inability to sing but hum", "label": 0}
{"text": "Alternate theory: it’s structured like an anime, and each minute takes 30 minutes. We’re about to see the world’s first 15 hour horror film.", "label": 0}
{"text": "Garfield’s Spider-Man is my favorite. Just campy enough and not afraid to kill some characters off.", "label": 0}
{"text": "Kirk vs Gorn.\n\nDude made a homemade cannon.", "label": 0}
{"text": "Casablanca", "label": 0}
{"text": "I would agree except both Schwarzenegger and Stallone have had better films. Arnie's 80s run until the mid 90s was unmatchable, and Stallone has Rocky and Rambo as two of the most iconic characters ever - of the two, he's also the much better actor which Arnie will happily concede. The Rock has Arnie's limited range but doesn't pick quality films.", "label": 0}
{"text": "I can wait to see it", "label": 0}
{"text": "It also had fantastic marketing", "label": 0}
{"text": "It's not even close.  They set up such an amazing event, and then undid it all with dumbfuck time travel.  Yawn.", "label": 0}
{"text": "Loved Blood Diamond when it came out and on the first couple of rewatches, but I watched it again last year after not having seen it for at least ten years and jesus fucking christ it does not hold up. \n\nI mean it isn't bad, but it definately isn't the masterpiece I though it was. The acting is great, specially Di Caprio as Archer and Hounsou as Solomon Vandy, production values are great, the themes and setting is very interesting, the action is exciting and so on. \n\nMy absolute biggest problem with this movie is how after the first act it just completely sidelines Solomon in favor of that ridiculous love story between between Archer and Maddy (Jennifer Connelly). It is his story that is central to the movie, only he knows where the diamond is buried, which is the only reason Archer is helping him in the first place. They are essentially using each other. But after the first act he is reduced to being a passive character, just being dragged from place to place by Archer and Maddy, like a child or a dog. The whole movie takes place in his country, among his people but he basically becomes part of the scenery while the two white characters bond over being white in Africa I guess. \n\nIt really is Edward Zwick at his absolute worst.", "label": 0}
{"text": "When all of your characters boil down to the same old stereotypes... All you have left is \"Plot\". Whether it's chaste Super Hero, or tortured villain...\n\nLet's face it. Deadpool did not need a romance subplot. I don't give a f\\*\\*\\* how it focus group tested in Boise.\n\nVonnegut used to talk about the \"shape\" of stories. All of these big budget stories have the same \"shape\". It's boring now.\n\nI recently watched an Italian film that had an amount of nudity in it that would have made Showgirls blush... I swear I didn't think about it at all after the first 5 minutes. It was just a part of the story, it wasn't presented as anything dirty OR juvenile...\n\nAmerica has a weird thing about nudity and sexuality... We're prudes unless it involves a slow-mo gory decapitation... And the people who do dip into those waters do so from the perspective of a 14 year old edgelord. As a culture, we're not mature enough to handle mature content.", "label": 0}
{"text": "I know it's little late to the conversation and also the article I am going to share is also a little off to your question but it is worth reading for you. I have written this article about astrological analysis of the Godfather movie. \n\n\nhttp://www.rahuunlimited.com/2024/10/why%20godfather%20is%20a%20famous%20masterpiece.html", "label": 0}
{"text": "I love that boxing sequence….  Dude gets totally wrecked in seconds and he’s like twice Holmes size.", "label": 0}
{"text": "I’m tired boss.", "label": 0}
{"text": "I love that movie, one of a few movies with a twist I did not see coming!", "label": 0}
{"text": "Maybe we can get him to host SNL again.", "label": 0}
{"text": "At least Peele can write decent dialogue. M. Night's dialogue in all his movies is so awful. Sometimes it works, like in The Sixth Sense because the little boy is supposed to be awkward but in a movie where the characters are supposed to be normal people it stands out like a sore thumb. \"What's your name and occupation\" in Old is a prime example of this, my husband and I still quote this whenever we want to say something is awkward.", "label": 0}
{"text": "John C. Reilly is a name that comes to my mind. He is drop dead funny in Talladega nights, Walk Hard and Stepbrothers. But then you can see him in more serious roles like Gangs of New York and The Perfect Storm.", "label": 0}
{"text": "It shits all over the character of Joker too. \n\nI've been joking that the 2nd movie does to the 1st movie what the 1st movie did to the character.", "label": 0}
{"text": "SAME", "label": 0}
{"text": "I think he said he read it once a long time ago and wrote the script based on what he remembered. I do like the movie more than the book, but they’re so different they’re kinda hard to compare.", "label": 0}
{"text": "Discombobulate.", "label": 0}
{"text": "Because Eastwood has had multiple expensive flops in a row that just got released because he was Eastwood, and that's not a great reason to do it again?", "label": 0}
{"text": "The antihero journey hasn't been made.", "label": 0}
{"text": "Star Trek Insurrection \n\nData: \"Saddle up, lock and load\"", "label": 0}
{"text": "If it helps I wouldn't even call it Batman related.", "label": 0}
{"text": "Chaotic, all over the place. \n\nGood songs tho.\n\nThat was something, not sure what yet.", "label": 0}
{"text": "The matrix", "label": 0}
{"text": "Soldier, with Kurt Russell. He's up against a next generation super soldier who is stronger, quicker, younger and just as highly trained. He wins by knowing his terrain and the environment they're in.", "label": 0}
{"text": "Mr. And Mrs. Smith.  \nThe House had secret gun compartments everywhere and the shed was bonkers.", "label": 0}
{"text": "Have you not watched Andor?", "label": 0}
{"text": "Came here to say this", "label": 0}
{"text": "Always a good sign of a quality product.", "label": 0}
{"text": "That's what I was thinking too, but he's perceived as more of an actor than a comedian", "label": 0}
{"text": "Jeff Bridges talks about how his dad had some trouble getting cast because they were afraid he wouldn't be funny. Decades later, Bridges suggested his dad for a role as a grizzled Irish immigrant in an action thriller he was starring in, and they didn't want to cast him cause they thought he couldn't do serious.", "label": 0}
{"text": "Why do they have to keep making all these iconic movies so pg, pg-13 I want to see a dark ass Star Wars universe that shows how evil they can all be.", "label": 0}
{"text": "Richard Sheman tipping the pass to win an all time great NFC Championship Game, versus the Seahawks rolling the Broncos in a Super Bowl that wasn't interesting for non-Seahawk fans after the first quarter.", "label": 0}
{"text": "Touch grass.", "label": 0}
{"text": "Star Wars fans have Stockholm Syndrome.", "label": 0}
{"text": "Why do you have to bring up Dane Cook? /s", "label": 0}
{"text": "I can't believe an actual woman wrote earnestly about 'not wanting to give up the privileges of being young and attractive', it sounds like an incel writing a woman", "label": 0}
{"text": "A lot of rom-coms. They feel fun and uplifting when you first watch them, but then you start to think about all the messed up situations and tropes. Examples: 50 First Dates, Love Actually, While You Were Sleeping, etc.", "label": 0}
{"text": ">Pretty indifferent\n\nI don't believe you. You talk like someone who has something that they like be attacked and are taking it personally.\nKeep it moving maybe, or is it too hard not to cry?\n\nFor the record, I personally couldn't care less if they make 500 of these shitty movies. That doesn't mean I can't state my opinions and thoughts on them.", "label": 0}
{"text": "American Fiction. I forget the directors name but I'm pretty sure it's his first, and only, movie. When I first saw the trailer, I remember thinking it gave off an Oscar bait-y vibe, but I still wanted to give it a shot. I ended up loving it, crying at least 3 times, and recommending it to anyone that'd listen. It does a great job of showing what being gifted and black in America is like, and it's not just another black suffering movie.", "label": 0}
{"text": "Did she live to see the reboot? Perhaps kinder if she didn’t", "label": 0}
{"text": "A quote that lives in my soul, is when he lights the lighter to impress the peasants and the one guy says, “we already got fire.” I love it", "label": 0}
{"text": "It's like the question was created to get this answer.", "label": 0}
{"text": "Apocalypto", "label": 0}
{"text": "This was the movie they showed after the Star Wars Episode 1 trailer back in the day.", "label": 0}
{"text": "> even the easy to set up and knock down fun scenes like the Venomhorse and the trained military squad hunting a super alien are totally wasted.\n\nWhenever I see scenes like that spoiled in the trailers, Ghost Rider 2 taught me that they won't connect to anything and will usually disappoint.", "label": 0}
{"text": "It's not the fact it was released in May that was the problem. It's that it was May following a December release. If it had been next May it would have been fine IMO", "label": 0}
{"text": "Time travel.  We spent so much time wondering how they were going to unsnap people, and then they just used time travel, a crutch for writers who don't know what else to do.", "label": 0}
{"text": "Cliffhanger ", "label": 0}
{"text": "Jojo Rabbit was based on Taika Waititi vaguely remembering his mom talking about the book.", "label": 0}
{"text": "The scene where he is crushing the guys head with the door is goated", "label": 0}
{"text": "Stupid studios were interfering with your comment", "label": 0}
{"text": "The one movie I remember specifically seeing on USA Up All Night was Toxic Avenger.", "label": 0}
{"text": "I’m telling you it’s because Kathleen Kennedy micromanages the fuck out of everyone involved with a piece of Star Wars content and they bail because they lose all creative control. ", "label": 0}
{"text": "Terrible take. \n\nHim making mistakes is the most spider-man thing about him. And being tricked by mysterio isn’t some defect in his writing, that’s mysterio’s whole thing. He manages to trick Wolverine into killing all of the x-men at one point.\n\nHe’s also lost all his tech at this point.", "label": 0}
{"text": "Mine is a series though and it’s Severance. Very crazy and interesting and I can’t wait for the next season in January", "label": 0}
{"text": "V for Vendetta\n\nThat whole movie only works once. It went from the most profound movie I'd ever seen the first time around to nonsense trash the second time.", "label": 0}
{"text": "*Cure* (1997)", "label": 0}
{"text": "Both the 1970s Robert Redford and 2013 DiCaprio *Great Gatsby* movies are perfectly good, but I think the theme in the book of Gatsby's parties and lifestyle being fun but emotionally hollow and vapid is kind of lost in both. \n\nIt's kind of like the quote of \"there's no such thing an anti-war film,\" - I don't know if there's an anti-party film scene. \n\nIt'd be kind of interesting to do an adaptation that never actually shows a Gatsby party directly - only snippets or descriptions from characters. That could get the point of the parties, both their existence and what they reveal about Gatsby emotionally, in a way that nails the theme of the book.", "label": 0}
{"text": "> There's nowhere where I said I was offended that someone else called the movie trash.\n\n\nKinda like how the other commenter never mentioned being offended. Funny how it works when you do it, but not others.", "label": 0}
{"text": "Why not?", "label": 0}
{"text": "♪Lord, help me channel Sandra Bullock in the Blind Side♪", "label": 0}
{"text": "k", "label": 0}
{"text": "I don't hate it as much as others, but let me tell you, people were *extremely* vocal about how much they hated that movie the moment it came out.", "label": 0}
{"text": "Most of Tom Hanks roles. He did mostly comedies in the early 80s but transformed into a great dramatic actor.", "label": 0}
{"text": "This so much. And I guess also, in the same vein, Prey.", "label": 0}
{"text": "It is, but at the very least I enjoy the last like 20 minutes of it. But even the worst moments of AotC aren't as bad as the best moments of RoS (which isn't saying much), imo.", "label": 0}
{"text": "The Substance. Demi's scene pre-date in front of the mirror.", "label": 0}
{"text": "It’s an old one, but Masquerade with Meg Tilly and Rob Lowe.", "label": 0}
{"text": "No and then.", "label": 0}
{"text": "Drama queen 🤨", "label": 0}
{"text": "The Batman 2022.\n\nIt's so bad. Like, every scene is terrible.\n\nThe movie is awful the whole way through with no redeeming qualities. \n\nI thought it was OK when I left the theater but upon rewatch and reading the script I realized Matt Reeves doesn't understand Batman. Nor does he know how to make a detective/crime story. And his action choreography absolutely sucks.\n\nThe only good thing to come from The Patman is the  The Penguin show, because it isn't written by Matt Reeves.\n\nCan't wait for the next reboot.", "label": 0}
{"text": "Jackie Chan has a dozen movies where he beats up everyone simply by being more aware and nimble of his environment.", "label": 0}
{"text": "For real. Best Bond movie ever made IMO, and I will gladly die on that hill. I could watch it a million times and never get tired of it.", "label": 0}
{"text": "Gymkata.\n\nThe entire movie is a Kung fu movie with a style of fighting based around gymnastics and the entire area is littered with gymnastics equipment.", "label": 0}
{"text": "True.  \nIt'd be odd for the secret wars black suit origin for venom to be used given he has a primer for his entry in the mcu in place already though.   \nI didn't realise 'secret wars' was only a couple of years away at this point, tbh.", "label": 0}
{"text": ">I'm like every other person where the Marvel train kind of lost its steam after Endgame \n\n>Deadpool & Wolverine making 1.3 billion dollars a week ago \n\nWonder when people will drop this whole narrative that rhe majority checked out of Marvel. \n\nWill it change once Secret Wars comes out? \n\n\"Ehh I checked out of those Marvel movies after Secret Wars came out... they should've just ended the series with that one, there isn't more stories to tell... oh that new X-Men movie looks pretty good............\"", "label": 0}
{"text": "There are many possible ways to take the movie just a single perspective would ruin all the complexity of the movie imo.", "label": 0}
{"text": "Kenobi trilogy actually", "label": 0}
{"text": "They're perfect for Netflix tbh", "label": 0}
{"text": "Avengers in 2026 seems weird. The first Avengers had those solo movies building up to them all teaming up. The MCU has felt so disjointed so ar.", "label": 0}
{"text": "Anything with Jackie Chan. Whatever his environment, he knows that everything is a weapon.", "label": 0}
{"text": "A very force-sensitive person who has melee combat experience and is facing a grievously wounded opponent not trying to kill them, you mean?\n\nYeah, I’ll put that on par with Luke outflying the best pilots in the Empire and the Rebellion on his first time being in an x-wing.", "label": 0}
{"text": "The old Sho Kosugi movies from the 80’s (e.g. “Enter the Ninja”) always had this scene with each ninja tool in its proper place on the wall or in recessed display cases.  It was how you knew things were about to get serious. On a side note, if you ever get the opportunity make sure that you visit the armory inside the Tower of London as it has exactly what you’re looking for.", "label": 0}
{"text": "Might have to get a Tom Hollander movie in there too.", "label": 0}
{"text": "Really? I didn't know that, I always figured him to be the echelon of dramatic acting from all his movies that I've seen.", "label": 0}
{"text": "“A young woman’s journey from Milan to Minsk”", "label": 0}
{"text": "I love lynch, I watched it semi-recently with a mate who had just finished watching dune. There are parts of it that do feel like they could be part of a great lynch film. There's parts, I'm told, that do feel like they could be a good dune movie. But mostly the movie is disjointed and kind incoherent. But like all of lynch's work, I do find it incredibly interesting still - even if it's interesting only in how it fails.", "label": 0}
{"text": "Space Balls.  Loves me some Mel Brooks this one gets cringier and boringer every rewatch.", "label": 0}
{"text": "So weird how he randomly died in the Longest Yard. Just some goofy movie and then Chris Rock dies out of nowhere", "label": 0}
{"text": "Nope. He outflew everyone but Darth Vader.", "label": 0}
{"text": "Remember,  Biggs told Rogue Leader that Luke was a great fighter pilot (\"best fighter pilot in the outer rim territories\"). On top of that, Luke really didn't fly as good as the other person claims. He nearly killed himself flying too low to the death star surface and if Han didn't come when he did Luke would of been killed by Vader. Lastly, Luke had Wedge in his unit....Wedge is easily a better pilot and having him on his side helped Luke tremendously.", "label": 0}
{"text": "If you haven't yet, you should read All Quiet on the Western Front. It permanently altered how I view war, and it sounds like it would resonate with you.\n\nThe book and the movie are pretty different. I would recommend the book much more.\n\nHere is the preface: \n\n>\"This book is to be neither an accusation nor a confession, and least of all an adventure, for death is not an adventure to those who stand fact to face with it. It will try simply to tell of a generation of men who, even though they may have escaped shells, were destroyed by the war.\"", "label": 0}
{"text": "the last jedi killed star wars", "label": 0}
{"text": "The Connery James Bond movies. They are so incredibly sexist and usually degrading to women. I just can't ignore that anymore.", "label": 0}
{"text": "Oldboy \n\nguy had a hallway and a hammer", "label": 0}
{"text": "You're really making an effort to compare a long winded and tired forced tied narrative to a fun super hero character and world that people don't think of when they think of the boring marvel stuff", "label": 0}
{"text": "It's a remake, so they were just staying pretty faithful to that character fate", "label": 0}
{"text": "I am the greatest swordsman who ever lived.", "label": 0}
{"text": "Wasn't he going to do the Hobbit originally and then backed out at the last minute so they had to get Peter Jackson?", "label": 0}
{"text": "I haven't rewatched it yet, but I definitely agree that some of the scenes really worked because they were so dang unexpected.", "label": 0}
{"text": "Yeah, nobodies gonna show up for the next Avengers movie. Shits gonna bomb.", "label": 0}
{"text": "Is Elle definitively a better swordswoman that Beatrix?  When it that established?", "label": 0}
{"text": "I read the original post as \"best monologue\". Couldn't even count how many cuts there are in that scene lol still great though!", "label": 0}
{"text": "Prey was the first thing i thought of.", "label": 0}
{"text": "Mitch Hedberg is a good example. They kept trying to give him little rolls here and there. He even commented about it in his standup. Problem was he was just awful at acting. It felt so forced and awkward.", "label": 0}
{"text": "Guy Fieri too.", "label": 0}
{"text": "Wow. I’m the complete opposite on this one. I love Man of Steel more and more with every rewatch.", "label": 0}
{"text": "Red State is my favorite Kevin Smith movie. I'm in a minority, but I also really loved Jersey Girl.", "label": 0}
{"text": "and then to space.", "label": 0}
{"text": "Except Kylo is a dark side user, meaning pain makes him stronger. In th words of Palpatine \"gives you focus, makes you stronger \". Someone with years of dark side training shouldn't any issue ŵith simple wound. Sorry, but Rey winning that fight is pure plot induced stupidity.", "label": 0}
{"text": "Especially when they change or disregard the ending of the first movie in order to reset the characters back to the same level they were at in the original, regardless of how many decades have passed, so audiences aren’t too confused\n\nSee:\n\n>Zoolander 2\n\n> Dumb & Dumber To\n\n> Star Wars: The Force Awakens\n\n> Anchorman 2", "label": 0}
{"text": "Shame. I know Rey is a total Mary Sue, but I feel like the right screenwriter could take her in an interesting direction, and Ridley did an excellent portrayal even though she had barely anything to work with.", "label": 0}
{"text": "It’s a terrible answer since OP specified a “regular guy”", "label": 0}
{"text": "You are a shitload of weird pendulum swinging assumptions today. Get ahold of yourself", "label": 0}
{"text": "sounds about right, when i watch a tv show i want to see character development and plot progresion, if i want to see sex i can just go to porn hub.", "label": 0}
{"text": "I prefer Force Awakens, and though Last Jedi had some flaws but was still pretty good.  The hyperjump killshot is still one of my all time favorite theater memories.  I've said ever since that if they'd nailed the third movie it still could have been a great trilogy.", "label": 0}
{"text": "Indy 5 gave it the Kaiser William treatment.", "label": 0}
{"text": "Did Punch Drunk exist yet at the time of Longest Yard?", "label": 0}
{"text": "He must be talking about the OG motion picture.", "label": 0}
{"text": "Obi-Wan was never ever outmatched by that punk.", "label": 0}
{"text": "It was 3 years old at the time.", "label": 0}
{"text": "This is probably another thread entirely (what is the best reveal) but I feel in the spirt of the \"reveal\" part of OPs question I think the Desert Eagle scene from Snatch is way up there : https://youtu.be/LgBA1jA2-mo?t=116\n\nMuch like T2, it's not necessarily the armory that is impressive, it's when Arnie reveals that mini-gun is what makes it classic.", "label": 0}
{"text": "Haha I meant in context of what it stands for, not literally.", "label": 0}
{"text": "What’s his Garland’s take on TLOU? I searched and couldn’t find anything other than it being his favorite game.", "label": 0}
{"text": "Any word on who the villain(s) will be?", "label": 0}
{"text": "What is happening (and has been happening) to the IP of Star Wars is the Hollywood equivalent of “being MBA’d”\n\nYou have the solid IP of Star Wars that is a money printing machine -  then you get some MBAs (creators looking for clout) who don’t give a crap about the actual IP and just want to milk the cow for all its worth, and make a name for themselves promoting their own agenda, at the helm of major projects. When those projects crash and burn, they’ll blame the audience and move onto the next cash cow. \n\nIn the scenario that a true passionate creator and fan of SW wants to make project in the true spirit of SW, they will invariably get to much meddling from a studio “MBA” exec that jeopardizes the entire project. \n\nAt this point, it is high likelyhood that any major SW project will come out as garbage.", "label": 0}
{"text": "Sounds like a fun drama teacher!", "label": 0}
{"text": "And then going for the dum dums with that \"I know i shouldnt... But I will.\"", "label": 0}
{"text": "Emotionally stunted for not wanting something that should be intimate? Okay then", "label": 0}
{"text": "Yeah none of the plot points hold any weight because they can just write their way out of any situation now.", "label": 0}
{"text": "They should just announce ‘Rey vs. Blade’ so they only have to do one press release about the movie that’s never getting made.", "label": 0}
{"text": "Look at Japan, and to a lesser extent South Korea. It could definitely get much worse.", "label": 0}
{"text": "Batman Begins…Ra’s never learned to mind his surroundings.", "label": 0}
{"text": "Kaisee movie h 🍿", "label": 0}
{"text": "Give us a Nothing to Lose sequel!", "label": 0}
{"text": "And Dinosaur Land.", "label": 0}
{"text": "Yeah, just ignore the whole second half of the comment about secret wars cause that doesn't fit your narrative.", "label": 0}
{"text": "I *always\\** wanted an animated Harry Potter tv series, a season per book without a lot of material cut.  There's a lot of slice of life in the books that I think would do great on the screen.  \n\n\\*My ire for JK Rowling has changed what I want for HP officially, but so it goes.", "label": 0}
{"text": "Memories of Murder (2003) is absolutely brilliant.", "label": 0}
{"text": "Again, most of the movies you mentioned aren't trying to play on that many screens in the first place. If you have a Tarantino that cost $100 million you need it to play on every screen you can get. If you have a movie like Sing Sing, it was always going to be in the smallest auditorium of the multiplex anyway.", "label": 0}
{"text": "I think a lot of the praise and divisiveness back then was from the Disney PR machine trying to salvage the movie and the franchise reputation.", "label": 0}
{"text": "I actually read a comment on here a while back that the information may have been lost after Judgement Day.\n\nIIRC, the original Judgement Day happens in like 1997 or something so that seems plausible. That was before most/all information was put online so Skynet wouldn’t have convenient access to know exactly what weaponry we had in 1984.\n\nIf true, that also adds a cool layer to the conversation with the T-800 trying to sus out what exactly we were capable of and if we had anything that could hurt him.", "label": 0}
{"text": "I like Venom for only the sole reason being Tom Hardy. And the most fun part of Venom is that there is an interaction between venom and Hardy. Story wise this movie resonates road trip but there are lot scenes where you feel something must be added and some of it should be edited out. Not bad for a 90 min movie though, doesn't really feel unnecessarily stretched. I still think this is not the \"last dance\" because of the end credit scene, Venom saying this not the last bye and Juno temple having the last symbiote still hints there is more to come.\n\nBut as far as the story goes Venom kills himself trying to eliminate those space creatures sent by their boss. 6/10\n\n\nVenom is the only MCU movie/trilogy I have ever watched.", "label": 0}
{"text": "You should have comprised and watched Vegas Vacation, lol. It's a better vegas movie (has Wayne newton and all), and it's a comedy, so spirits would have been high. That being said, I also watched oceans 11 before my first vegas trip lol", "label": 0}
{"text": "\"Andor\" was a good portrayal of how it'd actually feel to live under the Empire in that universe.  You don't get that anywhere else in the franchise, far as I know.", "label": 0}
{"text": "Kurt Russell in Escape from NY too.", "label": 0}
{"text": "There are some that I feel like aged fairly well - it's been a couple years, but I remember watching 10 Things I Hate About You and it not being too bad (though maybe that's thanks to it being based on Shakespeare), Better Off Dead didn't give me any immediate ick feelings (aside from Dan Schneider playing a character that felt like how I imagine Dan Schneider), Not Another Teen Movie (though I'm not sure that one exactly counts since it's a parody of teen movies)... so it'd be the \"most\" rather than \"all\"", "label": 0}
{"text": "IIRC men in black had a good one", "label": 0}
{"text": "I assume Disney is looking to recreate their 2019 release formula", "label": 0}
{"text": "Yeah, Teen Wolf's dad dies in the original.", "label": 0}
{"text": "It gets wilder. The potion seller guy is also married to Celine Song who directed Past Lives.\n\nGood for him.", "label": 0}
{"text": "We came so close to a grown man biting a little kids fingers off", "label": 0}
{"text": "I did, but the typo stays", "label": 0}
{"text": "Keanu Reeves originally had The Matrix Resurrections and John Wick 4 scheduled for the same release day before Covid changed things", "label": 0}
{"text": "nah if u havent watched the sequel, u stay quiet on this topic", "label": 0}
{"text": "Both of my choices are by Tarkovsky:\n\nStalker \n\nNostalghia", "label": 0}
{"text": "Tom Holland is set for a hectic year ahead with all the projects he's working on.", "label": 0}
{"text": "Holy shit! I did not expect that to tell you the truth. I though Longest was a good deal earlier.", "label": 0}
{"text": "Commando, in the hidden section of the gun shop", "label": 0}
{"text": "> That a tick-box exercise in socio-political messaging around gender, sexuality and race is far too often driving bad casting and writing decisions, and is taking priority over good storytelling.\n\nThis point in particular has created pavlovian reactions to seeing movies that feature any of those tick boxes. There have been so many bad movies/shows that have followed that mold that just seeing that a new production has them has become an indicator that the product isn't going to be very good. Overall that's going to hurt the goals of inclusivity that the folks making them are trying to achieve. Eventually that's going to impact the bottom line hard enough that the bounce back effect is going to get rough.\n\nI almost didn't watch Agatha All Along because it seemed akin to products that had previously wasted my time, and if I hadn't heard good things from people I trust I'd have missed out as I've really enjoyed it. Kathleen Kennedy and a lot of others in Hollywood have spent a lot of the past decade teaching audiences that diversity equates to bad products and the death of the things they used to love.", "label": 0}
{"text": "Which Blink 182 songs? (I wasn't a huge fan even in high school, though I did like Dammit)", "label": 0}
{"text": "Watched a wordless animation called Robot Dreams on a flight, and have been telling everybody about it ever since. A brilliant commentary on love, loss and authority. All whilst featuring fun cartoon animals.", "label": 0}
{"text": "Looking back on the past few years, the films that comes to mind are Burning (Hae-mi dancing in the dusk), Aftersun (Under pressure...), Saltburn (I loved him), The Banshees of Inisherin (The sound of the fingers hitting the door) and of course All of Us Strangers (the final scene with the parents).", "label": 0}
{"text": "My wife doesn’t care for zombie movies and can’t stand foreign films but she watched it with me and thought it was one of the better movies she’s seen in quite some time.", "label": 0}
{"text": "Red Dawn. The 80s one.", "label": 0}
{"text": "Climax is his best by far for relying so little on cheap shocks.", "label": 0}
{"text": "I love those movies, maybe its time to rewatch them", "label": 0}
{"text": "So.. are they going to bring back Palpatine again?", "label": 0}
{"text": "Hollywood has too much money and not enough brains in their heads.", "label": 0}
{"text": "It just gets better every time I watch it. I used to like the first scene because he was shopping in his dressing gown and paying with a check. I thought okay he’s a chiller. later viewing I caught that he was buying milk; right on he only went to the store so he could make a beverage. Now I hear Nixon over the radio saying “this aggression will not stand”. Awesome movie", "label": 0}
{"text": "Not really an armory, but Taxi Driver has a good scene where Travis meets a gun dealer and there's some video gamey POV shots of him looking down the sites. Especially impressive cause of its age", "label": 0}
{"text": "Im worried about this one personally. No way home set the stage perfectly for a standard, run of the mill, \"low stakes\" spiderman story. Based on Sony's input I just dont think thats what we are going to get.", "label": 0}
{"text": "Ohhhhh you should check out Black Dynamite then. Same concept, but even nuttier. Michael Jai White create and wrote and stars in it, and he’s an absolute force of nature in it", "label": 0}
{"text": "Big fan of Martin Lawrence. He doesn’t really get credit for it, but he’s one of the best physical comedians of all time.", "label": 0}
{"text": "I'm glad I'm not the only one who thought this- looks like vintage Steadman", "label": 0}
{"text": "wtf was that insult supposed to be? I'm not even asian. I do think sex in movies is porn. you can cry about it if you want lmao", "label": 0}
{"text": "Make it stop", "label": 0}
{"text": "Yes 100%\n\nGive us NEW characters, NEW stories, NEW cool weapons and ships!\n\nSkywalker/Vader/Jedi/Sith/Rebels/Empire has be thoroughly tapped out and people are fatigued.", "label": 0}
{"text": "American Pie hits very different In 2025”4 compared to 1999. I still just don’t think the apple pie humping is funny. No desperate virgin is going, “fucking an apple pie is the closest I’ll ever get to sex.”", "label": 0}
{"text": "Every single road race fight in the anime Initial D is like this.", "label": 0}
{"text": "Portrait of a lady on fire", "label": 0}
{"text": "80s and 90s: Pacific Heights, Cape Fear, Fatal Attraction, the Game\n\nMore recent: LA Confidential, the Departed, No Country for Old Men\n\nSeries: Mare of Easttown, the Killing, Broadchurch, Bron/Broen", "label": 0}
{"text": "The nonstop PR campaign is going to age him ten years in a season.", "label": 0}
{"text": "You had to be there is a bit of a cop out, but it's incredibly difficult to convey to younger people just what late 70s early 80s NYC was like and how the stories that seem blown up were in fact just part of life in certain areas. Even later, in L.A., where I had Paul Schrader as a lecturer and school campus was a block away from the adult theatre he haunted (and my friend managed) and the area he lived in his car, all for the most part sanitized or forgotten. The internet in particular is wonderful at revising and reshaping intentions, perspectives and motivations , raising a generation knowledgeable only of the conveniently revised or repurposed history history of things, but rarely first causes. Best I can do\n\nhttps://www.slashfilm.com/756410/the-taxi-driver-controversy-explained-how-martin-scorseses-ultra-violent-ending-shocked-audiences/\n\nhttps://www.filmcomment.com/article/paul-schrader-richard-thompson-interview/\n\nhttps://brianair.wordpress.com/film-analysis/taxi-driver/", "label": 0}
{"text": "TIL there's a new Daisy Ridley Star Wars movie.", "label": 0}
{"text": "God, this explains so much.", "label": 0}
{"text": " Evil Dead 2\n\nSaws off the shotgun and attaches a chainsaw to his stub…”Groovy”", "label": 0}
{"text": "American Beauty. \n\nI found it artful and moving when I first saw it, but it doesn’t hold up well for me. \n\nThe 90s-era consumer capitalism ennui has become a cliche, a lot of the quirk has become cringy, what i originally found moving strikes me now as manipulative sentimentalism, and the whole thing with Kevin Spacey lusting after a high school girl feels a lot less cute for what it accomplishes in the narrative. \n\nThere are still things I really like about the movie, but it is definitely of its time.", "label": 0}
{"text": "You were supposed to destroy the Sith, not join them! High ground!", "label": 0}
{"text": "He is NOT a bad director, by any stretch. He is an iconic director and producer.\n\nWriting is not directing. You think if the Prequels had improved writing with the same directing they wouldn't be way way better? lol.", "label": 0}
{"text": "I'll say John Wick 2 is one of my favs, Peter Serafinowicz sold the scene as Sommelier!", "label": 0}
{"text": "The trilogy would’ve been so much better if it was Rated R…", "label": 0}
{"text": "I hope you don't wake up tomorrow, bye to you too porn addict😹😹", "label": 0}
{"text": "They just need to let it breathe for a while", "label": 0}
{"text": "That GoT’s trilogy loss felt like justice for the garbage they put out for the final two seasons. I’ve always had the thought it was so bad (& with short seasons) because D&D not only ran out of RR Martin’s source material, but had already mentally moved on to their next big gig. The Star Wars trilogy deal with Disney. Didn’t even try to finish cooking GoT.", "label": 0}
{"text": "I think it implies that Knull pulled him back and not Dr Strange’s spell. It’s a retcon … I think??", "label": 0}
{"text": "I loved him in Pam and Tommy. didn’t expect to get attached to both of em", "label": 0}
{"text": "Big agree. Think a lot of \"unadaptable\" novels could be made through animation. \n\nWhile they announced a live-action version of *Blood Merdian* I've always imagined a NC-17 type animated adaption of the novel.", "label": 0}
{"text": "Working on it. Thanks <3", "label": 0}
{"text": "I always judge movies based on the rewatch and not the initial watch for this reason. Everything is exciting when it’s new but if it can’t hold me the second time around, then I know if it’s truly good or not. \n\nI’m gonna get soo dragged for this but….\n\nI loved Scott Pilgrim vs the Universe so much the first time around, it was different and fun… could not pay attention to it if my life depended on it any other time I tried to watch it. Sorry, I know a lot of people love it and I wish I could too.", "label": 0}
{"text": "That’s kind of young nowadays", "label": 0}
{"text": "Men in black", "label": 0}
{"text": "We've outsourced all intimacy and eroticism to pornography. It's a bit worrying.", "label": 0}
{"text": "_Frozen II._ I used to like it because of the animation and the songs, but as I saw it again I _hated_ it because all of the characters were punted to the side and given _the most annoying and cliched schticks_ in favor of Elsa, who separated herself from her sister _again_ to live in the forest with _next to no responsibilities._ ", "label": 0}
{"text": "Im sure this will be a great quality sequel not a forgettable cash grab", "label": 0}
{"text": "_In Time_ is one of my all-time guilty pleasures, but it gets 200% dumber on each rewatch.", "label": 0}
{"text": "I'm also tired of it. Especially when I'm sitting down to a movie with my grown sons. It adds nothing to the plot in most cases. Sex can be easily implied without going full on softcore porn", "label": 0}
{"text": "You know what gets me excited about Star Wars again? Going back and watching the cinematic game trailers for Star Wars: The Old Republic. In 4-8 minute trailers they captured everything that Disney Star Wars could have done but didn't. It's really my hope that once Kennedy is out we get someone in who can put that depicted era on the big screen.", "label": 0}
{"text": "I just thought it was so boring. And the characters are just people who bicker at each other constantly till they smoke weed. ", "label": 0}
{"text": "What film is that? I don’t recall hearing of it.\n\nJohn Waters has stated that Pasolini is his favorite filmmaker and that Salo is his favorite film. \n\nI tried watching Salo a few years ago and gave up half way through it. It makes Pink Flamingos resemble a G rated children’s movie.\n\nNever much cared for his films in general and I’m pretty hardcore when it comes to international art films.", "label": 0}
{"text": "Is this based on the William Burroughs novel?", "label": 0}
{"text": "Love the montage in monster squad when they're gearing up to take on Dracula. Great song too", "label": 0}
{"text": "Where did the paycheque go ? \n*cue Holland pointing meme", "label": 0}
{"text": "Eyes", "label": 0}
{"text": "Watching Goblet of Fire when it first came out is one of the first times I remember leaving a movie theater angry and disappointed. It was my favorite in the series at the time and I remember seething to my parents at how much they butchered it.\n\n\nZero time spent at the Burrow and skipping the entire world cup?? They fucked it up right off the bat and kid me was devastated.", "label": 0}
{"text": "That’s been done too much. How about the desert planet of Dantooine?", "label": 0}
{"text": "They've bumped it up to 500k now, but yes she would receive 400k. Spousal SGLI is 100k. If she had died the Marine would receive 100k.", "label": 0}
{"text": "I feel the same about Spectre. I was enjoying it up to the destruction of the secret base in Africa. I thought the film was about to end! Then they added on a load of stuff in London and it got so dull", "label": 0}
{"text": "It will be very awkward when everything is still x-wings and tie fighters.", "label": 0}
{"text": "One that comes to mind right away is Die Hard, especially the scene where John McClane uses his knowledge of the Nakatomi Plaza to outsmart the terrorists", "label": 0}
{"text": "As much as I agree that they’ve made some serious and often bewildering missteps with the IP, from Disney’s end they have been rolling in dough from the endeavor. Last I checked they’ve made over 12b on a 4b purchase.\n\nI think like Marvel they’re just going to milk this thing until it dries up. The problem is people keep coming back to be abused all over again.", "label": 0}
{"text": "The movie for me at least is a master of disguise situation, yeah it sucks but it's a nostalgic kinda suck, like candy corn or circus peanuts. The movie is fine. Just smoke a bowl, have a beer and turn ur brain off for an hour and just enjoy it. It ain't Oppenheimer for gods sake", "label": 0}
{"text": "Boondocks Saints is a dumb movie? When did this happen?", "label": 0}
{"text": "Scarface.  Loved it the first few times watching it (was younger too).  Rewatched it recently and holy shit, Tony Montana just made a slew of terrible choices and was such a dick it was angering.", "label": 0}
{"text": "The Machinist \n\nThe Game\n\nFight Club\n\nSe7en\n\nShutter Island\n\nVanilla Sky\n\nDonnie Darko\n\nPrimer\n\nAmerican Psycho \n\nThe Truman Show\n\n12 Monkeys \n\nMemento\n\nTime Crimes\n\nEnemy \n\nThe Prestige\n\nEnter The Void\n\nBrazil\n\nLost Highway \n\nMemento \n\nInterstellar \n\nTenet\n\nBlue Velvet\n\nMulholland Drive\n\nInception \n\nInland Empire\n\nExistenz\n\nVideodrome\n\nFire Walk With Me\n\nNaked Lunch\n\nCrimes Of The Future \n\nAntiviral \n\nPossessor\n\nInfinity Pool\n\nDelicatessen\n\nHoly Motors\n\nSynecdoche, New York\n\nAdaptation\n\nI’m Thinking Of Ending Things\n\nThe Holy Mountain\n\nThe Killing Of A Sacred Deer\n\nBeing John Malkovich\n\nEternal Sunshine Of The Spotless Mind\n\nFear And Loathing In Las Vegas\n\nThe Adventures Of Baron Von Munchausen\n\nThe Illusionist \n\nMelancholia\n\nMother!\n\nThe House That Jack Built\n\nWe Need To Do Something\n\nPi\n\nEl Topo\n\nTriangle\n\nHereditary \n\nThe Lobster\n\nMystic River\n\nJacob’s Ladder\n\nThe Jacket\n\nMidsommar\n\nBeau Is Afriad\n\nI Saw The TV Glow\n\nOldboy\n\nPsycho\n\nThe Sixth Sense\n\nEraserhead\n\nLamb\n\nUnder The Skin\n\nUnder The Silver Lake\n\nHundreds Of Beavers \n\nGreener Grass\n\nThe Village \n\n2001 A Space Odyssey\n\nA Clockwork Orange\n\nThe Cabin In The Woods\n\nIn The Mouth Of Madness\n\nThe Usual Suspects\n\nGet Out \n\nParasite\n\nBlack Swan\n\nMr. Nobody\n\nRequiem For A Dream\n\nUS\n\nNope\n\nWaking Life\n\nA Scanner Darkly \n\nCircle \n\nBeyond The Black Rainbow \n\nMen\n\nCube\n\nThe Cell\n\nThe Platform\n\nThe Fountain \n\nThe Fall\n\nPaprika\n\nPerfect Blue\n\nPredestination \n\nCoherence\n\nVivarium\n\nThe Lighthouse\n\nUpstream Color\n\nSorry To Bother You\n\nDogtooth\n\nPrimal Fear\n\nHumane\n\nSunshine\n\nDark City\n\nThe Skin I Live In\n\nThe Substance", "label": 0}
{"text": "When the Witch King is being armored by orcs while Gandalf talks about how badass he is.", "label": 0}
{"text": "He probably has more 'juice' in that 80 year old brain than JJ Abrams, Kathleen Kennedy, and Rian Johnson put together.", "label": 0}
{"text": "He was the Mexican killer guy in Bullet Train.", "label": 0}
{"text": "I don't really think it does that. Einhorn/finkle is a deranged psycho that doesn't seem to care about anything besides killing Dan Marino. Kissing all those men was part of the cover to make everyone think she was a woman and to not make the connection with Finkle and ruin the plan.", "label": 0}
{"text": "This was a pleasant surprise for one of the first series of Netflix movies", "label": 0}
{"text": "X as well", "label": 0}
{"text": "One that probably won't get mentioned is Mr. And Mrs. Smith. They both had badass war rooms.", "label": 0}
{"text": "How has no one said the scene from The Interview, absolutely hilarious haha", "label": 0}
{"text": "I think the forest season was perfect, but the second season just felt like things were wandering all over and it didn’t have the tightness that made the first season so great.", "label": 0}
{"text": "Thats a huge problem. They should be looking at a million different scripts sent to them", "label": 0}
{"text": "I agree, but I offer this rationalization: K had enough faith in him that he felt he could handle a powerful weapon. But he couldn't miss the chance to mess with him and act like it was a pea shooter. Feels sort of like a prank by Q branch.", "label": 0}
{"text": "Series-4 De-atomizer", "label": 0}
{"text": "Fucking awesome flick", "label": 0}
{"text": "Who do you think they'll put with him to take all the questions away so he can't spoil anything?", "label": 0}
{"text": "Totally. The whole Holdo sacrifice buildup is amazing", "label": 0}
{"text": "Audio is how I consume my Star Wars novels. Mark Thompson is so, so good. And the sound effects just add to the atmosphere.\n\nAnd yet, I couldn't get into that sub-plot.", "label": 0}
{"text": "Man I could not disagree more, especially with the first two.", "label": 0}
{"text": "I write scripts for shows. The whole process is messed up. They don't buy scripts. They hire people and ask them to make scripts for them", "label": 0}
{"text": "💰💰💰", "label": 0}
{"text": "Kathleen Kennedy is like the Hilary Clinton of Lucasfilm presidents", "label": 0}
{"text": "Would be awesome with a soundtrack from *Bohren & Der Club Of Gore*, *The Dale Cooper Quartet* or *Timber Timbre*. These projects have a real Lynchian vibe!", "label": 0}
{"text": "Really hope the constant pr doesn’t flip on him. Seen a lot of celebs go from beloved to hated on this site when they’re over saturated.", "label": 0}
{"text": "The original Denmark version of [The Guilty]( https://www.youtube.com/watch?v=abaoKA6rn5k) is currently on Tubi. [The American remake is on Netflix.](https://www.youtube.com/watch?v=NaB_ERMAZu4) You can watch both and then compare and contrast. It's a bottle thriller that takes place in an emergency call center dispatch. I adore the Danish one so much. It had me on the edge of my seat the whole time despite the film being pretty much done all in one room. \n\nAnd speaking of movies on Tubi, check out [Traders.](https://www.youtube.com/watch?v=XleAc2a_i0M) The trailer doesn't do it justice. It makes it almost seem like a dark comedy but it is anything but. It's dark. The things people will do for money dark. \n\nThe serial killer thriller, [Don't Move](https://www.youtube.com/watch?v=YjTZMEbpKsc) just came out on Netflix *today.* I've personally haven't seen it yet. But I am sure there will be a discussion about it in this subreddit. You can get on the ground floor if you watch it now.", "label": 0}
{"text": "Yo tengo el gato los pantalones!", "label": 0}
{"text": "You mean the people living through peak free love/sexual revolution/disco/rock and roll. Those people?", "label": 0}
{"text": "Viva las Mexico", "label": 0}
{"text": "Ay, you can't do that", "label": 0}
{"text": "John Wick 3. There's something so bizarrely satisfying about hearing Charon say \"Steel slugs. Armor piercing.\"", "label": 0}
{"text": "Boondock Saints", "label": 0}
{"text": "Evil Dead 2. Workshed montage. Ash literally ’re-arms’ himself - his missing hand - with a CHAINSAW. \nFinishes up using his new chainsawhand to shorten the barrel of his BOOMSTICK. \n\nUtters the movie’s iconic line\n\n#”GROOVY”", "label": 0}
{"text": "The movies rarely follows the comics they are named after but Spiderman surviving this specific encounter with Doom is where we get \"the black costume\" that becomes Venom. Seeing how this is supposed to be the end of the Multiverse Saga and the Venom movies are coming to an end, I would wager Marvel and Sony at least talked about Spiderman getting the Venom for Spiderman 4. I wouldn't put money on it but there are plenty of narrative directions to justify it.\n\nI get the feeling Secret Wars and Doomsday is where they'll break some rules that they would only let Deadpool break normally.", "label": 0}
{"text": "They would stand to make more money if they’re not competing with arguably Hollywood’s most lucrative director whose movie also stars Tom Holland. If they push out by a few months they have more breathing room.", "label": 0}
{"text": "> It’s her first ever movie? And they’re giving her Star Wars? That seems like a huge risk.\n\nShe is pretty accomplished.\n\n>She is the recipient of two Academy Awards, seven Emmy Awards and a Knight International Journalism Award\n\nThat being said, her Oscars were for documentaries.", "label": 0}
{"text": "He was great in all his Star Trek roles. He definitely put his skills to work.", "label": 0}
{"text": "Their animated movies are really good.  The first 2 Tobey movies were great, 3rd terrible... and neither of the Garfield movies are well regarded at all.  The MCU Spiderman movies are definitely more well liked than either of them.", "label": 0}
{"text": "I only know him from CBB, so I'm glad to see he's going to get to be in a relatively big comedy movie.", "label": 0}
{"text": "Nothing like when someone just resorts to insults instead of discussion.", "label": 0}
{"text": "Ah ha!  I gotcha.   Thanks.", "label": 0}
{"text": "Read what OP said again, that's not what he specified regarding the A history of Violence example. \n\nThere is a word in there that completely invalidates your above complaint. That word is *except*. As in that example works, except you find out he's a killer.\n\nYes the characters in Predator are trained killers, but you come to see that they are completely outclassed and wiped out by the enemy with ease. The last guy manages to win by knowing the environment better and using it to defeat the tremendously superior enemy.\n\nNext time make sure you read what someone actually says before you get all huffy.", "label": 0}
{"text": "It’s such a bizarre post.", "label": 0}
{"text": "> everyone getting away scot-free for their crimes and selfishness, in the face of obvious consequences.\n\nHave you been watching the news for any of the last, oh, say, all of human history?", "label": 0}
{"text": "> Heard a podcast with Alex Garland years ago (possibly Joshua Topolsky's Tomorrow podcast) where he basically laid out that the central point of the film is about human characters mistakenly assuming that AI gaining sentience and becoming \"alive\" would automatically mean it has empathy, or in other words, is human.\n\nThis. This. This.\n\nIts so simple yet unintuitive. We know she used Caleb, but why not let him out? Well she might have passed the touring test but she doesn’t actually have empathy. ", "label": 0}
{"text": "To be fair, most of the \"cool guys\" in '90s movies were insufferable assholes.", "label": 0}
{"text": "It certainly has to be the most eclectic collection of songs on any soundtrack. Cline, NIN and Snoop Dogg???", "label": 0}
{"text": "I was quite sure there would be a slasher film exactly like this, where the final girl defeats a murderer solely because they have a home turf advantage... But nothing really comes to my mind.", "label": 0}
{"text": "Avatar. \n\nThought it was a masterpiece on first viewing, barely got through a second time at the cinema, never watched it since. Even the sequel doesn't interest me.", "label": 0}
{"text": "Honorable mention/trope reversal for when they DISARM the group before going into Theoden’s throne room in The Two Towers and Aragorn takes a full minute longer than everyone else handing over all his weapons.", "label": 0}
{"text": "SHE'S A GOAT!!!", "label": 0}
{"text": "Came here to say this", "label": 0}
{"text": "Boondock Saints when they go to buy guns.", "label": 0}
{"text": "Yeah, that's my point, they'd established this December release and then just decided to release another one 5 months later when they had the following December wide opened.", "label": 0}
{"text": "Imagine if there hadn't been an Olympic pommel horse in the middle of some random village. That guy would've been toast!", "label": 0}
{"text": "That was a prosthetic, unsurprisingly.", "label": 0}
{"text": "This is one that I liked when I was young, and also liked when I rewatched it a few years back, but for completely different reasons.", "label": 0}
{"text": "First time I saw him I screamed, 'That's Alex Keatons dad!'\n\nSo much better with Steven in it.", "label": 0}
{"text": "Yeah, I was thinking Jackie Chan… but even that doesn’t scratch the itch I’m thinking of, as his “regular guy” is still a martial arts master, and his use of the environment is unorthodox.  I’m thinking someone who wins because they know where the light switch is (and maybe we’re explicitly shown that), and the other guy doesn’t.", "label": 0}
{"text": "So, which is it? I mean Spiderman 3 did great, GotG 3 did great, Wolverine Deadpool did great, Loki 2 did great, and you're saying avengers is going to do great?\n\nBut at the same time you say people don't want to see those movies? \n\nIs either one or the other man, because I get the feeling that you're saying \"people like to see good movies, people don't like to see bad movies\" and that doesn't have to do with marvel lmao", "label": 0}
{"text": "Do you really get laid every night?", "label": 0}
{"text": "/thread", "label": 0}
{"text": ">They clearly just don’t know where to take Star Wars at the moment.\n\nI've always felt that the logical place to take the franchise was new stories with new protagonists set in the same universe. It's an awfully big place with lots of planets, characters, and lore. And, with the Skywalker saga previously resolved within the context of the original films, and the principal cast largely aged out of their roles, it was a great opportunity to start over.\n\nFocusing on Luke, Han, and Leia's post-retirement shenanigans against the remnants of the previously defeated Empire was certainly a choice. And, while I didn't hate it as much as some people did, I will admit those films provided no further conclusion to an already resolved storyline.\n\nThat they're considering making even more of these films to provide even more resolution to the story is just downright bewildering. It's like reading all the endings of a *choose your own adventure* book.", "label": 0}
{"text": "Madame Web was so bad it’s good … this was just bad", "label": 0}
{"text": "*Mulholland Drive*\n\nDon't read up on it, just revel in it.", "label": 0}
{"text": "I thought it was opium addiction for sure.", "label": 0}
{"text": "Bachelor Party is my favorite comedy with him, a classic ", "label": 0}
{"text": "Hannibal Buress had 3; The Nice Guys, Angry Birds Movie and Neighbours 2. Mind you one was a voice role", "label": 0}
{"text": "He's called the Terminator, not the carefulnator", "label": 0}
{"text": "How is there still Avengers movies after a movie called “Avengers: Endgame”?", "label": 0}
{"text": "Is anyone excited for this shit anymore?", "label": 0}
{"text": "I shudder to think of the species of human that would be aware of a new LOTR movie but not know that it's animated right from the get-go.", "label": 0}
{"text": "Yeah I don’t get 7, it was alright but having catch up the whole 6 movies before going into 7 I’m disappointed to find that it’s basically soft reboot of the first film again. \n\n9 was the most hilarious fever dream one. Suddenly palpatine is back, in an offshoot planet, with a shit loads of destroyers at the last 30m of film. O…kayyyyyy", "label": 0}
{"text": "Report this bot. They have a comment on a different sub literally every 60 seconds.", "label": 0}
{"text": "I am Norwegian, so i have seen the danish the guilty. I have the dont move on my list. Ill check out traders! Thank you", "label": 0}
{"text": "Except\n\nwe’re instantly introduced to the Predator crew as trained killers. That is never even vaguely ambiguous. They’re nothing like normal people, they were deliberately chosen for a specific mission. \n\nWe’re introduced to Viggo as a bartender with a shady past in A History of Violence, but we have no idea who he really is or what he’s capable of until the character himself is forced to show it.", "label": 0}
{"text": "I don’t get why they had to do Luke so dirty. Going from an idealistic young man this waste of a person seemed far fetched. Would the man who wouldn’t kill the legitimately evil Vader even think about killing a troubled teenage boy? It’s absurd. They destroyed his character in service of making a shitty movie. \n\nYou know what would have worked? For Luke to be the big baddie of this trilogy behind the scenes. Seemingly a good guy, helping everyone out, but then revealed to be the villain all along, his youthful idealism twisted by years of frustration so he at last gave in to the dark side.", "label": 0}
{"text": "Idk I write expressively but I didn’t expect such a hostile response lol just a benign difference of opinion.", "label": 0}
{"text": "Remember when Diddy blew up Kid Cudi's car?\n\nhttps://www.blackenterprise.com/kid-cudi-cassie-diddy/", "label": 0}
{"text": "The movie 1408 makes you feel like you took some @cid just before watching it", "label": 0}
{"text": "Isn't that they're point though? The problem isn't ret-conning, it's that the new stuff isn't good.", "label": 0}
{"text": "lol him quoting Nixon for some an unrelated situation is very funny. My favourite comedy for good reason.", "label": 0}
{"text": "I love the scene in Taxi Driver, with Easy Andy.", "label": 0}
{"text": "Does anyone know who the music is behind the trailer?? It seems like Christmas music but I cant remember exactly...", "label": 0}
{"text": "The assassination of Jesse James by the coward Robert ford", "label": 0}
{"text": "> Its like its ignored because the entire management pool is inept morons who are all just nepo babies.\n\nIt's because they're rich so they don't need to give af creatively as much, they get their salaries and they make alright money on whatever trash they put out", "label": 0}
{"text": "Just to add one I haven't seen mentioned: Repo Man\n\n\"The life of a repo man is always intense.\"\n\n\"There's one in every car! You'll see.\"\n\n\"Let's go get sushi and not pay!\"", "label": 0}
{"text": "Also The Patriot in the same type of situation. Not exactly outmatched, but certainly outnumbered with inferior fire power, so he used terrain, guerilla war fighting techniques and sheer savagery \"unbefitting a gentleman\" to his advantage.", "label": 0}
{"text": "*Fabulous*", "label": 0}
{"text": "Listen kid, it ain’t that kind of movie.", "label": 0}
{"text": "After next year starwars is dead to me. After season 2 of Andor. Im done. I had every toy and lightsaber as a child.\n\nThe current runners at lucasfilm are clowns. Everyone knows it.", "label": 0}
{"text": "I was so excited leaving TFA and wondering what Rey, Poe, and Finn would do next. ", "label": 0}
{"text": "That's how Tom Cruise makes movies and it works for him. Maybe they should let him take a crack at it. It would probably be awesome. Space cult meets space cult.", "label": 0}
{"text": "Definitely Collateral. >!spoiler!<At the end when Jamie folks is just shooting randomly through the door at Tom Cruise's terminator-like contract killer. Cruise gets nailed, Jamie leaves without a scratch.>!spoiler!<", "label": 0}
{"text": "Mostly it being anime. Many people have an unfair hate against anime. If disney would release a good handdrawn animated movie, it would probably make a lot of money again (or at least be veryopular on disney+)", "label": 0}
{"text": "The Rush Hour movies. Loved the when they first released and I hate them now. They are truly bad.", "label": 0}
{"text": "*Being John Malkovich*\n\nFits your answer as a glove.", "label": 0}
{"text": "In my mind a socially progressive 90s movie is Gregg Araki's Nowhere", "label": 0}
{"text": "Hell, Episode 1 is only the third worse Star Wars movie IMO.  2 and 9 are just garbage all around.", "label": 0}
{"text": "Dammit...you beat me.", "label": 0}
{"text": "Here's the problem-- they tried that. Kind of. The whole \"High Republic\" thing was a big multimedia effort to start a fresh Jedi-centric Star Wars setting that was divorced from the films and takes place hundreds of years before the Prequels. I wasn't a big fan of the outcome (I read a handful of the comics and novels), but they at least had some new-ish ideas. But they just couldn't fucking help themselves. They pumped out a ludicrous amount of books (every time I'd finish one I'd fine there were like, three more that had come out in that time) and they just couldn't resist putting Yoda in there. And now that the Acolyte flopped, I don't even know if they're going to bother with the High Republic anymore.\n\nGive us something new and exciting, please!", "label": 0}
{"text": "Movie was *Pasolini* (2014), directed by Abel Ferrara. \n\n Some of my fave Pasolini films are *The Gospel According to Matthew* and *The Decameron*.", "label": 0}
{"text": "You’re welcome! Enjoy!", "label": 0}
{"text": "That's how Johnny Cage beat Goro", "label": 0}
{"text": "This. 90% of shit that happens in movies isn’t cool, funny, or good to do in real life. Chill people.", "label": 0}
{"text": "yeah ever met one or seen how they vote? Heard of the satanic panic? They’re the generation that invented the myth that you have to get more conservative as you get older because that’s what they did, kid.", "label": 0}
{"text": "It's fantastic. NEVER listen to critics.", "label": 0}
{"text": "Maybe not the best, but definitely nostalgic: [Beverly Hills Ninja](https://youtu.be/NEhwZ7loMgQ?si=G8dAmmPV8fTivEiL) there are several scenes that depict choices of armory. Also when he dons the white ninja suit is fun too, but, there's no good video of it that I could find. \n \nAnother that isn't armory, but, I've always quoted for some reasons from: [The Stupids](https://youtu.be/vmRDcXADnbA?si=yl5flAoKslh0hh7_)", "label": 0}
{"text": "It must be a me thing, but I honestly didnt enjoy the movie that much. What am I missing? Everything I've heard on reddit calls it a masterpiece. I found it to be really corny and by halfway though, my mind was wandering and wondering when it was going to be over. Thought the acting from the brothers was pretty mediocre as well. Especially the final scene.", "label": 0}
{"text": "Wrong", "label": 0}
{"text": "That's still just like the prequels with just one galactic republic and a main jedi order with some hidden sith.  That's not new at all.", "label": 0}
{"text": "> The problem with Andor is that it is one of the least watched Star Wars series.\n\nIs this true? That's insane; IMO it's the best content they've put out.", "label": 0}
{"text": "Cars 2", "label": 0}
{"text": "Yo what was that thread 😵‍💫", "label": 0}
{"text": "The Incedent.  NYC gritty subway thriller with one of Martin Sheens earliest performances.  It's on YouTube too in decent quality ", "label": 0}
{"text": "I think he wins more by his experience and the bad leadership of the new soldiers.  If Busey was in charge, I think it would have been a different story.", "label": 0}
{"text": "Humans are sexual creatures. That discomfort you describe isn't natural, though, it's learned. Obviously, not every movie needs a sex scene, and even those that do, don't need it to be porn-level graphic. But it is, nevertheless, a useful tool.", "label": 0}
{"text": "I was in college and some of my friends loved it, saying how deep it was and all that, and I was just like... it felt as deep as a 100 level Philosophy class.", "label": 0}
{"text": "My rationalization that I came up with a good 5 seconds ago: new MIB agents get the noisy cricket to remind them to not judge on appearances, and to teach them to be hesitant and deliberate about firing their weapon. \n\nCops and soldiers shoot regular bullets, and so can be a lot more cavalier about when and where they discharge their guns. But MIB agents use futuristic weapons that can do a lot more collateral damage. Furthermore, they need to be discreet above all else, which is way harder when there’s a bunch of laser gun holes at the scene from some trigger-happy agent. Giving new agents the noisy cricket (and especially not telling them how powerful it is) means that every time they point their guns from then on, a part of their brain will wonder “is it worth it to fire if this might collapse this building AND send me flying back 10 feet?”", "label": 0}
{"text": "Especially after the absolute cacophony of drama around teen pregnancy. Do y'all want Gen Z having sex or not? Because for a LONG while there it was \"dont.\". Now it's \"oh my god the birth rate!\" Make up your fucking minds.", "label": 0}
{"text": "Here is also the scene at the beginning where his mountain side home is attacked and daughter is kidnapped. He has his personal armory behind a keypad door in his tool shed. That is my personal favorite armory scene from childhood. I wanted a tool shed gun room so bad!", "label": 0}
{"text": "SPOILERS :\n\nI got 20 minutes in to the movie. I'll probably finish it later but it's a little irritating. First of all, I don't think it would have taken anything away from the movie to just make it about British intelligence instead of the cia. I can hear every single person's British accent seeping through their dialogue. There are multiple characters I thought were playing British Nationals at first, then it became clear they were forcing an American accent.\n\nWTF is up with the subplot of her gift giving? She gets her husband a novelty clothing item for their ANNIVERSARY and then gets her boss a nice replica luxury watch. As far as I can tell it's a plot device to establish then she has a close personal relationship with her boss.\n\nIt's just really ridiculous. Turn your brain off for this one.", "label": 0}
{"text": "Team America: World Police.  Acting", "label": 0}
{"text": "I completely disagree, you frame it in a very weird and negative way.\n\nThe prequels were loved by millions in that era, and they are George Lucas created so they are just as Star Wars as the OT. Many millions love Anakin, Obi Wan, the Clone Troopers etc. \n\nAlso nah you're talking about 30-40+ adults who want to whine about that stuff, younger people liked those elements.", "label": 0}
{"text": "Noting the upside down cross, I'm guessing the Sisters are just a plot device and not a fully LDS researched project. But I'm gonna see it!", "label": 0}
{"text": ">  but Hams Zimmer is a hack\n\nAre you under the impression that he's only scored Nolan movies or something, because this is a *wild* take.", "label": 0}
{"text": "So 1 together 1, 2 to not, 3 together, 4 to not? Sounds like a primary school rhyme.", "label": 0}
{"text": "It feels like she has something on someone, so they can't replace her. \n\nI can't imagine why Lucas Films has so many failures over so many years and the person in charge keeps their job.", "label": 0}
{"text": "Justin Hammer kitting out War Machine in Iron Man 2.", "label": 0}
{"text": "This thread made my day lmfao", "label": 0}
{"text": "The movie was great, the reviews weren't.", "label": 0}
{"text": "> A murder would draw more attention that would impede its mission.\n\nSure, maybe, who knows, but that is not what that scene demonstrates.  The scene gives us the first glimpse of how completely mercilessness the terminator is before he even goes after Sara, nothing will get in his way, and it's very effective.", "label": 0}
{"text": "So, according to science, both fighting and fucking are hyper-adrenergic states. As in, the adrenaline is pumping through the veins when you're either fighting or fucking. And let's not forget the testosterone at play either. When there is already some tension going on in between the two amd when they're engaged in a fight where they are so close together, bodies and bodily fluids, it's very easy to switch from fighting to fucking.", "label": 0}
{"text": "What a ridiculous take.", "label": 0}
{"text": "Not the only one! Big, big, fucking guns!", "label": 0}
{"text": "*House* (1977)\n\nWeird, psychedelic Japanese horror movie. Not especially gruesome or gory, but definitely strange.", "label": 0}
{"text": "The Matrix. It's how I want my armory.", "label": 0}
{"text": "I just hate any type of Savior movie for the most part.", "label": 0}
{"text": "I rewatch movies reguralry and there are a couple of reasons to do so. First is tradition, like watching special movies on special day every year. Trick'r'Treat every halloween, Eternal sunshine every Vallentines, national lampoons every christmas, stuff like that. Others I watch to get myself into wanted mood and I know they would work. I also rewatch movies to focus on some specific aspect that time, like want to really understand how camera is moving, or how some special effects were done, or music. And there are those that are on just for the ambience that I dont really watch, just enjoy the general vibe and comfort it gives.", "label": 0}
{"text": "Nobody?", "label": 0}
{"text": "Certain channels may have known, but plausible deniability is key when doing some sketchy shit.", "label": 0}
{"text": "\"785 is the area code to Topeka, oh my gooood... 785 is the area code to Topeka Kansas!\"", "label": 0}
{"text": "In real life scenarios, you will encounter this in schools where several bullies have repressed homosexual tendencies. So engaging in physical fights give them proximity to other boys and they end up satisfying themselves with the fight.", "label": 0}
{"text": "Damn crocodile but my foot off!", "label": 0}
{"text": "> He’s kind of a dick to Buttercup\n\nHe thinks Buttercup is marrying the prince freely.  When he realizes the prince is forcing her into it everything changes.", "label": 0}
{"text": "I never liked this movie. I watched it because I was told it was amazing. I watched it, and told my co-worker his tasted movies sucked. I kind of feel bad about it now, but I think this movie sucked.", "label": 0}
{"text": "I was 13 when Phantom Menace came out, people absolutely hated them then. Thinking even Episode III was a hot take in it’s early days.", "label": 0}
{"text": "But that's what they're saying. The comparative reveal would be if we found out later than Arnold's character had encountered them before, had a cybernetic eyeball, something that actually changed the stakes.\n\nDutch and co. were trained human killers, the best at what they do - the Predator treats them as toys and systematically separates, toys with, disarms, or eliminates them in every situation. The only thing the Predator does not know is Earth itself, specifically the terrain, the environment, etc.\n\nThat knowledge - just knowing how things *work* here as passive knowledge, is the game changer that lets Dutch defeat the Predator.", "label": 0}
{"text": "Well now hold on. i'm not saying no to another Martin Lawrence Isekai.", "label": 0}
{"text": "I think Disney is in a spot where they can't be cocky and presume a trilogy is gonna be happening with anything new. Because what happens if the first movie doesn't land? They need reasons to have big fans get confident in the Star Wars brand again when they've been disappointed in current offerings.\n\nI think there's going to be more trilogies but they're going to need to have better focus on their goals and be a bit more creative than the NT.", "label": 0}
{"text": "So does this mean Spider-Man won’t be in doomsday since Spider man 4 comes out after?", "label": 0}
{"text": "they didn't say movies, they just said marvel in general, could be talking about all the shit tv shows ​", "label": 0}
{"text": "Yea and in that same timeframe: Antman 3 was dogshit, Dr. Strange 2 was dogshit, The Eternals was unwatchable, The Marvels- well I didn't even watch that because ti looked like dogshit. They abandoned their big bad and replaced him with... Robert Downey Jr. for some reason. The whole IP is a flailing, inconsistent, over-saturated and overcomplicated mess with no direction and zero reason to have confidence that it will find one.", "label": 0}
{"text": "And then ends up using gardening tools to finish the job", "label": 0}
{"text": "Falling Down", "label": 0}
{"text": "As far as the Predator is concerned, they are regular guys and they are dispatched with ease. Doesn't matter at all what they were chosen for or why they were there. They are game to be hunted. They are regular guys.\n\nThat's the point of the movie, these highly trained killers are nothing to it. Then it comes to realize what they are capable of. The only difference is the audience finding out at the beginning or at the end.", "label": 0}
{"text": "I heard it described once as someone listening to the abridged audiobook of *Dune* while on an acid trip, which isn't wrong.", "label": 0}
{"text": "That's an important clarification then - \"normal guy\" is a real parameter above \"assumed to be outclassed guy\" right?", "label": 0}
{"text": "*The Adventures Of Baron Von Munchausen*\n\nA very wholesome and lovable fantasy movie, but also quite out there too. Directed by Terry Gilliam of Monty Python fame. Many of his other movies would also fit this topic.", "label": 0}
{"text": "Babylon", "label": 0}
{"text": "Tremors original without a doubt. Broke into the wrong goddamn rec room didn't you, you bastard?", "label": 0}
{"text": "Bad times at the el royale.", "label": 0}
{"text": "I'd say a drama like the US version of Shameless is kind of what you are talking about. It has all different kinds of sex and there is impact with the plot and themes. So it's not just sex for the sake of having sex.\n\nSo yes, I agree that thematically keeping it more realistic, or even the crazy parts of sex explored from a realistic standpoint, has a more impact on a story than random sex that doesn't seem to fit the narrative the director is going for.", "label": 0}
{"text": "Came here to say this. Used to love the film for all those reasons. It has so much going for it but the overbearing amount of japanese accent jokes and Bill's rather condescending attitude in certain scenes really sours it all.", "label": 0}
{"text": "Tie between Prisoners and Nightcrawler for me\n\nAlso wanna give a shout out to the French-Canadian film Red Rooms, one of the best films this year and one of the best thrillers I’ve seen too", "label": 0}
{"text": "A little bit of an older one I don’t see mentioned enough is identity. \n\nI remember riding my bike to blockbuster as a kid and renting it and it’s stuck with me. I just rewatched it with my best friend who adores thrillers and he absolutely loved it.", "label": 0}
{"text": "Balead dat!", "label": 0}
{"text": "I reread it.\nHope your day got tremendously better and you let go of the snarky attitude.", "label": 0}
{"text": "The last of us, S1E3 when the preppers time has finally come to shine.", "label": 0}
{"text": "It sucks cuz we haven't really seen Tom be your friendly neighborhood spider man.", "label": 0}
{"text": "If you're into psychological thrillers that really mess with your head, I’d suggest checking out Coherence. It's a mind-bending low-budget gem that plays with reality in a way that leaves you thinking long after it’s over", "label": 0}
{"text": "Well then put em on the oodles and noodles", "label": 0}
{"text": "David Fincher - all", "label": 0}
{"text": "You mean ignore the part where you speculate that the movie, that won't be released for like 3 more years, will be a success?", "label": 0}
{"text": "Willow had an awesome one with mad cardigan.  The matrix had a cool one also in the white room.", "label": 0}
{"text": "Stupid ass movie to begin with. Nope is 100x better", "label": 0}
{"text": "What?! He’s a legendary director.", "label": 0}
{"text": "It has been years since I’ve seen it, so i may need to rewatch, but i remember thinking “none of this would have happened if that kid just did what she was told”.", "label": 0}
{"text": "But the whole conceit with these Predator fucks is that they limit themselves to what their prey can do for the competitive aspect, they limit their technology and tactics to be on a level playing field just as a rule. \n\nArnold was always operating on a relatively even playing field. He got the edge through just plainly a better use of tactics, all else being fairly even. \n\nBut this was still a trained soldier, against an enemy deliberately limiting themselves, it just doesn’t really fit to me.", "label": 0}
{"text": "The difference is that in the slasher, it's the bad guy who's going around killing, but in the comedies, it's usually the characters you're supposed to root for doing the crimes", "label": 0}
{"text": "Wow, I can’t believe they got the DJ from S4 of Comedy Bang Bang. Huge.", "label": 0}
{"text": "Their called Terminators. Not Knock-Out-And-Runawayers!", "label": 0}
{"text": "Same! I love Thrawn and he is such an interesting character. The recent Thrawn on screen is *not* the same or close to it. I pretend that's not him, lmao.", "label": 0}
{"text": "[https://youtu.be/V7c0BGLYy4U?si=auHQMD77OimgtMYX](https://youtu.be/V7c0BGLYy4U?si=auHQMD77OimgtMYX)", "label": 0}
{"text": "The system, LOL?!", "label": 0}
{"text": "I suggest Network- older (1976) but perfect for business class.", "label": 0}
{"text": "🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄", "label": 0}
{"text": "truth never lives in this world, and  always that is left in this world is the evil, isnt it, they all plan and kill the truth just to be heroes of their life, at last they are left, and truth is always butchered .", "label": 0}
{"text": "No, its simply because movie makers use it as a cop out for having a terrible movie ", "label": 0}
{"text": "It's going to feel like a Spaceballs-esque, \"YOU FOOLS!  YOU CAPTURED THEIR STUNT DOUBLES!\"\n\nIronHeart, Sam Wilson, Valkyrie, She-Hulk(?) are just so, so weak and hollow compared to the original team.  They should call it Avengers:  Great Value.", "label": 0}
{"text": "I honestly wanted to know what their Star Wars would been like had they not torched what remaining goodwill they had from GoT. \n\nIt was already a kick in the teeth how they rushed the show to get to it, but imagine had they somehow righted the Star Wars train that Disney derailed.\n\n… but realistically, they’d probably be dropped from the project anyway and if they managed to stay on long enough, they’re likely to be replaced with someone else since this is Disney and even they don’t know what they’re doing.", "label": 0}
{"text": "Steve Carrell was an actor first and foremost. He did comedy roles because other actors couldn't do comedy.", "label": 0}
{"text": "I think these movies are terrible. The first was a novelty but the second was legitimately dumb. It makes zero sense and the special effects look exactly like the slasher movies I'd rent from blockbuster 20+ years ago. \n\n\nI know people that like these movies but I don't understand why. Maybe the third one is better but I doubt it.", "label": 0}
{"text": "Ah yes you're right, I forgot about Saw.", "label": 0}
{"text": "Really hope Drew Carey makes a cameo in a fight.", "label": 0}
{"text": "Yes, but the movies are too gory. To be a Horror icon, it needs to have a wider audience. Gorehounds just aren't enough.", "label": 0}
{"text": "I love Tremors. Wore the VHS out when I was a youth.", "label": 0}
{"text": "Spawn", "label": 0}
{"text": "Ze uh...nooks and crannies?", "label": 0}
{"text": "For me, it was John work 2", "label": 0}
{"text": "Is this the film that Joaquin Phoenix left or am i mistaken?", "label": 0}
{"text": "I hope that's not true but given the evidence, I can't argue against it.", "label": 0}
{"text": "I mean, the tricycle race still does it for me.", "label": 0}
{"text": "It was ok, but it didn't hold a candle to \"Transformers: The Movie\". I'd trade Rob Lowe, Leonard Nimoy, and Orson Wells for Shia any day.", "label": 0}
{"text": "Same", "label": 0}
{"text": "Aww damn now I'm going to be humming this for the rest of the day", "label": 0}
{"text": "I think No One Will Save You with Kaitlyn Dever probably counts", "label": 0}
{"text": "He still had Luke restoring the Jedi even if he hit a snag. And Leia restoring the republic", "label": 0}
{"text": "> were speaking lines that sounded like they were lifted from the speech bubbles of the 1960s comic books. \n\n\nAnd to me that's exactly what is so endearing to me about those movies.", "label": 0}
{"text": "In the dance scene, did it feel like Venom’s CGI model wasnt properly rigged for those moves? It felt like something out of gmod.", "label": 0}
{"text": "My guy!! Bet he out there walkin dogs, in some Crisp skinny jeans rn", "label": 0}
{"text": "Uzi 9 millimeter", "label": 0}
{"text": "In this day and age when they straight up cancel 100% finished movies that is a very legit thing", "label": 0}
{"text": "The John Wick 3 panic room / armory in the hotel", "label": 0}
{"text": "I wouldn't even mind Jedi / Sith stories if both of them were reformed somehow. It's why I feel lukewarm on the Old or especially High Republic. I'm tired of the Jedi and Sith as we know them. Give me something else.", "label": 0}
{"text": "I agree with you about D-16. The hints/foreshadowing that others point to didn't quite seal the deal for me. That said, it's a very minor quibble in an otherwise good movie.\n\nEven when finding out the truth about Sentinel, he was in denial, and later when they watched the ship and Sentinel bow, is when he shows more disappointment. But up to that point he doesn't really show any menace or rage, just annoyance and self-interest. Then at that point he goes on his killing Sentinel diatribe which is a little much, but still understandable. From that point on it's an outright *sprint* to becoming the mean, nasty Megatron. \n\nA single flash of meanness or a sharp rebuke or Orion's antics before going along with him, would have been enough to plant the seed. \n\nIt doesn't need to be spelled out, but for power to reveal what's already there, we have to see that something is already there.", "label": 0}
{"text": "“That’s the point of the movie where Arnold kills the unstoppable alien at the end.”\n\nWhat?\n\nArnold wins at the end if you didn’t see it recently. And he’s not any better than the other soldiers, he’s just the one who survives, which is also a major point in the movie.", "label": 0}
{"text": "This is most of the battles in Last of the Mohicans.", "label": 0}
{"text": "the saga of Harry & Marv vs Kevin is actually a tale of the student surpassing the teacher", "label": 0}
{"text": "Jesus Christ Superstar made me dislike religion. Damned singing hippies. /s", "label": 0}
{"text": "It reminded me very much of when I was little and my mum would tell me “if you ever get separated from me or get lost, make sure you find a lady.” AK really did capture the feeling well, I felt it especially strongly when the woman who had the panic attack at the dating game was being questioned by her boyfriend, I also felt the urge to tell him to get the fuck out of the car.", "label": 0}
{"text": "I agree, season 2 is massively overrated. I actually liked season 3 more because it was actually about the Mandalorians.", "label": 0}
{"text": "Yeah he’s sexy", "label": 0}
{"text": "Yeah but tastes change. I’m sure you wouldn’t still laugh at some of the stuff you laughed at when you were 5. Just means you’ve grown and don’t find the same things funny anymore. \n\nYou guys responding to this like they’re saying “this isnt ok to laugh at” need to chill and realize people grow up and out of things they used to find funny.", "label": 0}
{"text": "Thats why i loved them but this one tried to have a more serious tone with a bigger plot but that plot was just kind of boring and the whole movie i wanted to see Knull but we never got to see him properly.\n\nThe whole movie just felt like one big Post Credit Scene", "label": 0}
{"text": "Monster Squad gearing up to battle the monsters.  Doesn't one of the kids make silver bullets in shop class?", "label": 0}
{"text": "Loved Up all night", "label": 0}
{"text": "I'm glad you loved it! I did say \"most\" and not \"all\" of the demographic I mentioned.", "label": 0}
{"text": "The scene with Tuco building his ideal pistol is one of the bestarmory scenes in terms of acting and character development. He somehow becomes more likeable  as a character and more sinister as a gunfighter in the same scene.", "label": 0}
{"text": "Who gets away with throwing away their parent’s furniture just to be whimsical? I too despise this movie.", "label": 0}
{"text": "Excellent list! Love that you Beau is Afraid in there 😏", "label": 0}
{"text": "Lewis was the fourth guy in the cabin and saw the drug dealers being murdered in front of him. The first movie established that you can pass the curse while violently murdering someone in front of someone else. So by that point the curse already passed to him (Lewis) so Joel was \"free\" of the curse and got killed by accident when trying to flee.", "label": 0}
{"text": "That scene in the first one where he grabs the map of the emergency exits off the wall is one of my favorite moments.", "label": 0}
{"text": "“Oh really? No O’Reilly, Reilly O’Reilly!” Wife and I still say that randomly. ", "label": 0}
{"text": "They couldn't afford Michael B Jordan", "label": 0}
{"text": "Well, they also bought Marvel, grew it bigger than star wars, and then fucked it up too.", "label": 0}
{"text": "Same. Also, growing up in Cleveland had had Big Chuck and Lil’ John.", "label": 0}
{"text": "Right, I was speaking more on the novels and whatnot. I don't know if a Sith or Sith-like character shows up later (I didn't read them all: I got bored of them), but what I was reading involved a conflict with sort of a Mad Max-esque terrorist group who was using hyper space as a weapon. I know they changed this in the Acolyte show, with the Sith character--I believe that show takes place 100 or so years removed from the novels I was talking about.", "label": 0}
{"text": "Maybe a sequel to black knight!", "label": 0}
{"text": "They had also just finished quite a few bad marvel projects, and or released right as everyone lost every bit of faith in Disney sadly", "label": 0}
{"text": "I know it's not exactly what OP asked for, but the montage of Kevin setting all the traps in Home Alone gives me the exact same feeling as Neo and Trinity gearing up in The Matrix", "label": 0}
{"text": "When I became an adult, I became disillusioned with the Lord of the Rings", "label": 0}
{"text": "Nah, Star Wars was Lucas’s baby. It’s purely revisionism by people that didn’t like the prequels that Lucas was just lucky to be surrounded by people that saved whatever good ideas he had from himself.", "label": 0}
{"text": "Funny, I got\n\n#1d1df2\nrgb(29, 29, 242)", "label": 0}
{"text": "Is that the guy whose car was blown up by Diddy in 2012?", "label": 0}
{"text": "This isn't a new approach. The \"Golden Age\" of Hollywood was made exactly this way, with contract stars and directors. It was still pretty common until at least the 80s.", "label": 0}
{"text": "Better acting, script and dialogue for starters.", "label": 0}
{"text": "Lung disease.", "label": 0}
{"text": "I still kinda liked Anchorman 2, it’s not nearly as good as the original but it’s still a decent below-average comedy, just hard to compare to the literal gold that’s the first one.", "label": 0}
{"text": "Lies! Some of the earlier ones (before they were all musicals) are still fun to watch.", "label": 0}
{"text": "This is a perfect example of why I don’t take rotten tomatoes or movie reviews seriously. Scores came out a couple days ago and were horrible for this and I ended up loving every moment of it. It’s not the best film ever but who cares man it’s fun as hell and a nice send off for this phase of the Sony verse. I’m only disappointed that we didn’t get more Knull, but tbf he’s such a massive character and the king in black storyline is so big that there’s no way they could’ve even began to do it justice here.\n\nIf the rumors are true and he’s gonna be in spider man 4 I’m really excited but also a little nervous because how are they gonna sneak him in between Doom, Battle world and whatever else is happening in secret wars.. but this is why they get paid the big bucks so we’ll see how it works out.\n\nI knew Rhys Ifans’ Martin was gonna be a misdirect but man I was still hoping he’d somehow be connected to lizard lol. The film had a ton of action but I kinda felt like the stuff with his family dragged at times, especially the scene where they’re driving in the car at night.\n\nMovie set up a few questions tho. What was the imperium project and who was the dude giving Strickland orders? Didn’t look like SecDef. Also since when can symbiotes just bond with anyone lol? And did the scientist get some sort of electric powers from her lightning strike that she couldn’t activate until she was bonded with the symbiote or what? She was generally annoying as hell throughout 😂 was really hoping we’d see Tom hardy back in the MCU somehow or venom in the MCU or a Garfield spider man cameo at the end but.. nothing", "label": 0}
{"text": "Pennywise is just goofy", "label": 0}
{"text": "Jigsaw's \"do you want to play a game?\" was quoted for years. Art doesn't even speak. Kind of hard to be an icon when people need to be pantomimes to reference you. Art is good as a reaction gif on tiktok at least.", "label": 0}
{"text": "All right, calm down, IMDB", "label": 0}
{"text": "Wait they are doing spin offs of the last trilogy? They have zero impact. I have pretty much blanked them out of my head.\n\nOther than the trailer for the first one. Holy shit that got me excited.", "label": 0}
{"text": "Totally agree, the first Transformers movie had a solid foundation, especially when it came to character relationships. I think the balance of action and emotional beats worked well overall, but I feel you on D16's arc feeling rushed. That kind of descent into darkness usually needs more time to breathe. And yeah, friendships as strong as his with Optimus should have had more weight when they clashed. Still, for what it was, the movie did a great job of bringing the Transformers world to life, especially for fans. Glad to see others appreciating it too!", "label": 0}
{"text": "I dont think Michael J Fox is in the movie", "label": 0}
{"text": "Not really what you're looking for but Bond fucks up some guys in Skyfall when they invade his childhood home alla home alone. I just can't remember what his house was called.", "label": 0}
{"text": "Ed Norton in fight club. Specifically the office fight scene.", "label": 0}
{"text": "Even without it, death hasn't been finite since at least 1992.", "label": 0}
{"text": "They should really give up another trilogy with her,she has no where to go as a character, she started max level and was uninteresting as a lead, the only one that was interesting was Kylo Ren, and Poe.   Lead character should have been Funny.", "label": 0}
{"text": "MIB", "label": 0}
{"text": "Tengo El Gato Los Pantalones!", "label": 0}
{"text": "Destin Daniel Cretton is confirmed to be directing.", "label": 0}
{"text": "Commando \n\nWhen Arnold geared up at the beach", "label": 0}
{"text": "utter bullshit lol", "label": 0}
{"text": "Smith just got the rights to it back a few weeks ago. It should start being available soon. Hopefully.", "label": 0}
{"text": "Good thing The Slammin Salmon is an equally funny movie about restaurant workers.", "label": 0}
{"text": "Oh, you want to watch a depressed old Peter Parker that killed MJ with radioactive sperm?", "label": 0}
{"text": "Ronin. The action in the film is so fantastic. Totally mind-blowing.", "label": 0}
{"text": "I was like hey that guy looks like Kid Cudi… oh, ‘Mescudi’… hey, that IS Kid Cudi! 😆", "label": 0}
{"text": "Agreed. I wasn't super on board at the start of the movie, but probably around the time the actual story begins and the robot starts her \"task\" is when it got engaging for me. \n\nIt was predictable, but well executed.", "label": 0}
{"text": "I really enjoyed this. Thought it started a little slow (first 20ish) but everything after that was great", "label": 0}
{"text": "I think Andor proved that talented people can create a very resonant, beautiful and thoughtful show even based on source material that feels on paper like a yawn. They need fewer writers and directors for hire because that's how you end up with grey slop regardless of the \"idea\" behind it.", "label": 0}
{"text": "I know. Its really difficult having to watch 2-3 movies a year. So stressful and difficult", "label": 0}
{"text": "I have kids. I like kids movies. This movie was schlock", "label": 0}
{"text": "Where does he say that?  One of the making of docs?  There's a million of them on the DVD, so just curious.", "label": 0}
{"text": "Good old 80s James Horner action soundtracks.", "label": 0}
{"text": "Arrival blew my mind. I wish I could watch it for the first time again", "label": 0}
{"text": "Maybe Kraven will be great, only because all of these have been fucking terrible.\n\nA 6/10 film will be turned into a 8/10...like, the bar has been set so low the only way is up.", "label": 0}
{"text": "Terminator 3 in the mausoleum with the casket armory, Arnold breaks through the stained glass with the casket o' weapons on one shoulder, like a boombox. It's a wicked action figure, too!", "label": 0}
{"text": "Hahaha I loved blue streak, but this worries me.", "label": 0}
{"text": "?They didn't cancel the Obi-Wan movie, it got turned into that god awful series, I think?\n\nIt's kinda amazing how they've managed to try and lose their fanbase while somehow not making money at the same time.", "label": 0}
{"text": "Kill Bill - Hatori Hanso sword scene", "label": 0}
{"text": "Don't forget that she has to fail at trying to kill a nephew that she is mentoring", "label": 0}
{"text": "I remember catching it whenever it aired on TBS", "label": 0}
{"text": "I would be very impressed if they pulled that off.", "label": 0}
{"text": "Same age. I could have wrote the same except that I gave up around the time Andor came out and never watched it and never will. I just don’t care at all about SW anymore. Sad. It used to be like my religion.", "label": 0}
{"text": "Crying Freeman had a good armory scene if I'm not misremembering.", "label": 0}
{"text": "This movie has been on again off again for YEARS", "label": 0}
{"text": "I just get so hung up on the stupid little things that it makes the movie not-enjoyable story-wise. Where did they get the jumpsuits? The scissors? Why is their skin not the palest skin on Earth? Etc. Haircuts?\n\nJust so much missing...", "label": 0}
{"text": "Well well well", "label": 0}
{"text": "I will add predestination, let the right one in and elephant to this list", "label": 0}
{"text": "very unique camera and color work by the director as well. you can check this scene: https://youtu.be/xW1CrQu_H6E?si=r-m9mTKYPx2s_hTQ", "label": 0}
{"text": "No mention of Lord of War? Where the warehouse of AKs was apparently real. Slightly different tack to most mentioned here.\n\nhttps://www.reddit.com/r/todayilearned/s/5D0xgWRpEq", "label": 0}
{"text": "Here, its Friday and I was bored and just to show you what a meant in my other comment I wrote an outline for a rewrite of The Last Jedi that actually makes sense:\n\n- They have to evacuate the base because the FO are coming.\n- Rebels scramble together and bring what they can, but it isn't much and they all know it\n- They start arguing about what they should do, but Leia says they don't have time to figure out a full plan now and she picks a place to go regroup\n- They jump away thinking they are safe for the moment since they got out before the FO arrives\n\n- Note: Rey scenes of training / finding out how disillusioned Luke is are scattered throughout wherever would make sense in the edit\n\n- Rebels arrive in new system, character motivations and concerns are established as they argue about a plan\n- FO order shows up out of nowhere. Rebels desparately try to hold them back \n- Poe has an idea for a reckless gamble to *try and distract* the FO fleet to let the majority rebels escape. It's selfless but wasteful of their limited resources\n- He's ordered not to do that but does it anyway\n- The distraction fails as it is almost wiped out and the survivors barely make it back to the fleet in time to jump away\n- Bridge is wiped out as they are about to leave and only Leia lives by using the force to close a pressure door control that she can't reach but she's seriously injured\n\n- Rebels arrive at a smaller friendly base to rearm what they can and assess what resources remain\n- Their dire situation is shown because the base doesn't really have anything that can help them against an entire fleet, but they rearm as best they can and the fleet tries to figure out what next\n- Character development happens as the new commanders have to deal with Poe's insubordination that cost them valuable ships and crew, as well as having to deal with all the previous leadership being dead\n- As the finger pointing reaches boiling point, the FO show up again ready to fight\n- Confused as to how they were found, the new commanders tell the fleet to jump to a random system, then jump to a different system that has another friendly base just in case\n- They jump away without trying to fight\n\n- Rebels arrive at the new \"friendly\" base, but the people there tell them they won't help because the FO nuked the entire planet where the last base they stopped at was located\n- Rebels are getting desparate and start to think that they have a spy among them who is telling the FO where they are\n- A small group is ordered to go find out if there is a spy by following up on a lead that someone on Canto Bight might have info\n- Fleet is going to keep moving and jumping around to try and stay ahead, but makes plans with the people on the Canto plot to meet up in a system\n\n- Canto plot happens but instead of already knowing about a tracking device, they are there to investigate a potential spy and in the process this is when they find out that there is a tracking devidce on the fleet (no trying to get codes from a hacker BS, the hacker could have been involved in the development of the system)\n\n- While they are busy investigating the spy / tracking, the fleet goes from feeling safe to under attack multiple times, each getting more desparate (yes, kinda like battlestar galactica)\n- They are about completely worn thin when a signal comes in from the team investigating that they are ready to rendezvous\n\n- The investigation team and the fleet meet up\n- Rey meets back up and tells them that Luke wasn't able to help and that there's no last jedi coming to save them\n- The commanders are told that the FO order has the ability to track the ships and that they'll keep following\n- Rebels are absolutely desperate now as they know they are being corned\n- They make a plan to jump to Crait where there is a defensive base and try to set a trap to hit the FO fleet when it jumps in as a way to hopefully distract the fleet from seeing the transports evacuating people to the base on the planet\n\n- The FO jumps into Crait system, but they show up much closer than the rebels expected - basically inside what is left of the rebel fleet\n- They see the transports and know that they are going to have to attack the base on the planet\n- Holdo decides to buy time by driving her flagship at their flagship and self destructing right next to it in some way that will destroy the flagship (this gets rid of the problem created in the movie as far as if a ship jumping to hyperspace can be used as a battering ram, why aren't there concrete blocks with hyperdrives on them to be used as missles and such)\n- FO flagship is destroyed but the section where Snoke and Kylo are is shown to be able to separate off and act like a ship of its own. It follows the rebels and lands near the base (its presence on the planet means that the rest of the FO fleet can't just glass the surface from space)\n\n- Final scenes are a desparate fight on the planet as the rebels try to defend the base against a seige inside the base while Rey and whoever else try to get into the command section of the ship to kill Snoke / Kylo before the base is taken\n- Throne room fight Snoke killed\n- Kylo decides to finish the job and kill the rebels etc\n- Luke shows up or whatever\n- Things end kind of how it did but with the handful of rebel **leadership** (not the entire rebellion like in the movie - that doesn't make a lick of sense) getting away", "label": 0}
{"text": "Check the NFL sub, even football fans are sick of the Kelce brothers", "label": 0}
{"text": "Sweet Home Alabama. I used to watch it with my late sister. Meant a lot to me. Recently went back and watched it & I still like some of it, but the way they glorified the father’s obsession with that particular historical reenactment was like… is that supposed to be charming? Idk felt weird", "label": 0}
{"text": "**bonk**\n\nI actually looked it up because I wasn’t sure of the number, but my guess was 5 too. But apparently it’s a Mandela Effect?", "label": 0}
{"text": "Best? I don’t think so but I think for the newer generations he’s making quite a splash for them.", "label": 0}
{"text": "some people didn't recommend yet:\n\n\n\nThe Holy Mountain - 1973\n\nHausu - 1977  \n\nGetting Any? - 1994  \n\nRubber - 2010", "label": 0}
{"text": "So Luke was just taking credit from R2 's work? Absolutely disgusting of him.", "label": 0}
{"text": "I've literally watched it dozens of times over my 44 years, and still love it as much as I did the first time.", "label": 0}
{"text": "It came out of nowhere.  Very little marketing.  Kevin Bacon was still just the Footloose guy.  This was years before A Few Good Men or Apollo 13 and before 6 degrees of Kevin Bacon.  Fred Ward was 'oh, that guy' and Michael Gross was the liberal dad from Family Ties.  Honestly, the biggest star was Reba McEntire and it was her first acting role, but she was a huge country music star at this time.\n\nBut despite that, the people that went to see it, loved it.  I was working at a movie theater at the time and it never sold out, but people were laughing and cheering throughout the whole movie.  The thing that saved it was word of mouth and then video rental.  The next bunch of movies were direct to video but still did well.  It's the perfect blend of horror and comedy.  It's funny but the monsters are truly terrifying (and a great use of practical FX).", "label": 0}
{"text": "Fun movie. I watch it fairly often. Just watched it again 2 days ago. I just realized the other day that his wife in the movie is Regina King. She did the voices for Huey and Riley from the Boondocks.", "label": 0}
