{"text": "People got to stop regurgitating this lie. Bronny played more than 3/4 a college season. Did he lose valuable time at the beginning? Yes. But he had more than enough time to recover and get acclimated. He sucks. Will ALWAYS suck, and has no future in this league the day LeBron retires.", "label": 1}
{"text": "You would probably be a better person if you werent forced to watch the Knicks/Jets the last 20+ years. Im sorry that happened to you. No wonder you look for solace in trump.", "label": 1}
{"text": "I would hope so…with our luck, they might find a way to keep our corpse working.", "label": 1}
{"text": "Why is this post worthy? If this gets a highlight, every bucket in the game should too.", "label": 1}
{"text": "Not who you voted for, but the fact that you voted. Plus your party affiliation. Some states make voting history public information and these are accessible to the public. A $10 a fee from a city hall can give you access to a town’s voting information if you so choose.", "label": 1}
{"text": "what's that **W**iki**P**edia tattoo on Brooks", "label": 1}
{"text": "Who are 2 all stars? Lmao can’t even get your facts straight. Yall are ass and got so lucky playing 2 injury riddle teams. Ya gonna be lucky to make the play in this year bums.", "label": 1}
{"text": "Fire Reddick, bring back Hamas! Make Terrorism Great Again! \n\n\nKidding", "label": 1}
{"text": "150 comments in the last two days on Reddit.\n\nFucking pathetic.", "label": 1}
{"text": "cappin for randos online\n\nFucking pathetic.", "label": 1}
{"text": "You wish it was cap.\n\nYou need it to be cap. Could've done something with your live, wasting it fucking talking into the wind on reddit.\n\nThe only difference between you and me was when I talked, people who you fucking dick ride listened, you sad little bitch.", "label": 1}
{"text": ">Joel Embiid(OUT)-**Swamps of Dagobah**", "label": 1}
{"text": "Probably two of the mods on r/lakers", "label": 1}
{"text": "CAP", "label": 1}
{"text": "😂😂😂😂😂", "label": 1}
{"text": "You wish.\n\nDie mad with you 10k comments and zero posts in two months, because you have nothing to offer the world, especially not the basketball one.\n\nSad, sad fucking life man. Get a hobby. Try basketball analytics, and tell me when you work for a single NBA player, then do it 50 more times so I can tell you that you still haven't accomplished what I did. Fucking waste.", "label": 1}
{"text": "CAP", "label": 1}
{"text": "Feel good? Feel whole? Feel useful?\n\nMuting now. Sorry you only have that dog in you for being a loser on reddit, and not in any way on the court. There's also MyCareer mode, bitch, hang those fucking banners lol", "label": 1}
{"text": "CAP", "label": 1}
{"text": "\\#EndWhitePrivilege2024\n\nReaves is so cooked after November 5th", "label": 1}
{"text": "But this sub and Laker fans kept ranking LeBron higher in the player rankings tho? 🤔\n\nAD has been better for awhile now, I'm convinced part of why he gets no respect for DPOY is because people attempt to shove him into the shadows of LeBron instead of putting him ahead as No. 1, which he is.", "label": 1}
{"text": "2025 NBA champions Toronto Moggers", "label": 1}
{"text": "Love when dudes think they’re being edgy and hilarious but they’re actually just lame and unfunny", "label": 1}
{"text": "Shut up fraud ass pelicunts fan", "label": 1}
{"text": "You don't even know half of it. That dude has like 15+ alt accounts. Several of which are banned. \nThey are always super easy to recognize.\n\n* Some kind of derogatory or demeaning username \n* *Really* hates Reaves, Kerr, Popovich, Sabonis and others \n* LOVES and defends Kyrie and to a lesser extent Jaylen Brown\n* accounts are generally less than 3 months old, he changes them a lot", "label": 1}
{"text": "Ahh some racist black kid or probably worse, grown man", "label": 1}
{"text": "You have low reading comprehension", "label": 1}
{"text": "That’s disrespectful to hustlers, pimps, and street urchins", "label": 1}
{"text": "I hope the 76rs lose lots of games this year and George and Embiid return only to lose in the first round to the Celtics.   I can't stand either of them and I hope Daryl Morey gets fired.  The 76rs are everything of what's wrong with the NBA", "label": 1}
{"text": "Honestly preferable to Brown’s opinion about Jews", "label": 1}
{"text": "You… don’t have to prefer a bad opinion just because he wears your team’s jersey lol.\n\nAnd yes, JB does say some really stupid shit. It makes my head fucking hurt when he does it because other times he sounds pretty smart.", "label": 1}
{"text": "Post pics of your ass hanging out then get all uncomfortable when ppl bring up said pics. What she wanted right? Thirsty ass dudes thirstin over her. Welcome to the real world angel.", "label": 1}
{"text": "Keep jerking off, weirdo.", "label": 1}
{"text": "Rapist apology? Are you out of your goddamn mind?\n\nTrying to equate a comment made about a woman who specifically wore what she wore for attention, and a vile human taking action and raping a woman is just batshit crazy thinking", "label": 1}
{"text": "Just saying the reality. This is what thirst traps look like in the real world? Fucking uncomfortable, right?", "label": 1}
{"text": "She’s hasn’t. She also doesn’t have a million followers or whatever the fuck. \n\nAgain I’m not saying it’s right, I’m saying it’s reality. Post pics of your ass hanging out certain percentage of dudes going to view you like a piece a meat. Again, not saying it’s right, saying it’s reality.", "label": 1}
{"text": "“Homophobia is ok, but anti-semitism is where I draw the line” - /u/MatterCold342", "label": 1}
{"text": "In this case you have a couple options:\n\n1. Realize that Angel Reese got exactly the attention she wanted to boost her brand, and more than likely invited shaq onto her podcast knowing full well that he’d make an off comment about her appearance \n\n2. Live in your weird little echo chamber the rest of your life, and think you’re a savior to women even when your wife fucks other dudes and leaves you\n\nThe choice is yours", "label": 1}
{"text": "This is closest you'll ever get to talking to a woman that isn't your mother. Congrats, babe.", "label": 1}
{"text": "I’m not blaming them, I’m saying it’s reality. Be mad at reality don’t be mad at me for pointing it out. Would you want your daughter posting pics with their asses hanging out in social media? It gives the creeps fodder, I’m not saying it’s right, it is what it is. Do with that info what you will. I’m saying don’t be surprised when thirsty ass dudes thirst over your thirst pics. That’s all I’m sayin.", "label": 1}
{"text": "\"Impossible to oppose both\"", "label": 1}
{"text": "So what pussy wtf lmao two dudes fought so what", "label": 1}
{"text": "Animals with no respect", "label": 1}
{"text": "I've seen some of these women on the prowl for pro athletes and entertainers. These hoes are some straight sociopaths. \n\nThey spend crazy money to travel from city to city, gain access to schedules then make calculated choices on where these guys may be at certain times of the day. They then pretend it's a huge coincidence to see an athlete they met in passing weeks or even months earlier.\n\nThese men are dumber than hell for even giving them the time of day.", "label": 1}
{"text": "Really ? She did everything to get attention and some are upset now ? Summum of hypocrisy…", "label": 1}
{"text": "These guys are competing over the same broad when they could be dating 9/10 university med students.  It's dumb.", "label": 1}
{"text": "Wut?  These women are clearly gold diggers lmao.", "label": 1}
{"text": "74 million people thought an orangutan in a fitted suit was a fitting president.  This is no surprise.", "label": 1}
{"text": "You really thought an Atlanta native would be a good role model? lol", "label": 1}
{"text": "Shes dressing like a prostitute as a professional athlete with sponsorships. Somebody had to say something to her face in public and I'm glad it was billionaire shaq who can't be cancelled by all the losers on social media. I am def a hater of reese but c'mon. She's a grown woman. Quit capeing for her and call a spade a spade. She's not a role model.", "label": 1}
{"text": "She…told him very clearly to stop, interrupted him to say it.  Then he just kept going and it’s clear she just wanted him to finish and move on.\n\nThe “freeze” reaction to a stress situation", "label": 1}
{"text": "hey guys,\n\nits been a decade. you really dont need to tag me every single time an NBA player gets somebody pregnant anymore. but today i wanna touch on an even deeper subject:\n\n you guys are massively obsessed with the sex lives of your favorite athletes. None of this has anything to do with basketball. I’m sure one of you stat nerds will create some spreadsheet about how Ant’s PER goes down every time he get someone pregnant, but other than that I don’t think this stuff is really basketball related.  We’re in a cock watching epidemic. united nations tier meat monitors. \n\nI’m a magic fan. I have put the last of my faith and hope in humanity into banchero.  However this does not mean I need to put an airtag on his dick.  I know where his dick generally is. It’s in his pants. I don’t need to know its further whereabouts.  It does not pertain me in the slightest. \nFollowing hoop is stressful enough as it is, don’t add to your stress by following dicks too.", "label": 1}
{"text": "Americans and brainrot when it comes to politics never ceases to amaze me. Just have a war and be done with it.", "label": 1}
{"text": "That that flair off, you a [fraud](https://www.reddit.com/r/timberwolves/s/REEXYbfUy1)", "label": 1}
{"text": "Or, hear me out, a person only needs to say No one time and the other person fucking listens to them", "label": 1}
{"text": "shutup simp", "label": 1}
{"text": "This is the internet not the real world. Iff she wanted him to stop the discussion she would've made a mire direct and exaggerated attempt", "label": 1}
{"text": "I would drink Cameron Brink's bathwater.", "label": 1}
{"text": "Why does it matter, click the link and move on pussy.", "label": 1}
{"text": "they have internet in South Sudan?", "label": 1}
{"text": "Dresses like a ho\n\nMen comment that she's sexy\n\nComplain\n\n????", "label": 1}
{"text": "Raps are really the down syndrome team of nba", "label": 1}
{"text": "I called the mods \"losers\" for doing that and they banned my other account. then they said they'd remove the ban if I apologized lolol. i just let that account be banned. these nerds wanted me to bend the knee and beg for reinstatement.", "label": 1}
{"text": "Dillon \"I'm a little bitch\" Brooks", "label": 1}
{"text": "barely found this game thread. im stroking rn thinking of wemby", "label": 1}
{"text": "Suns fans rarely venture to the game threads on this sub. They prefer to stay in their own complaining echo chamber.", "label": 1}
{"text": "Annoying guys are annoying till they’re on your side. Pat Bev was my favorite till he went over to that country I don’t like", "label": 1}
{"text": "My favorite MVP candidates are the ones who win a championship without a FMVP", "label": 1}
{"text": "that's only a response to your fuicking annoying bitching and moaning.  grow the fuck up.", "label": 1}
{"text": "you sonics fans are fucking annoying as fuck.  get over it.  you lost your team and you knew it was coming.\n\nnobody stole the team from you.  you're the most toxic fans in the nba and you don't even have a fucking team.\n\nyou get what you give.  stop being a bunch of snooty, toxic, assholes and you'll get more expressed sympathy from okc fans.", "label": 1}
{"text": "great hustle from sabonis.", "label": 1}
{"text": "Is fun to get em riled up. They thought the Cs we’re in for a rude awakening", "label": 1}
{"text": "Thinking the same thing!", "label": 1}
{"text": "Post that on social media in korea and the hate will be generational", "label": 1}
{"text": "Lmao at MITWestbrook's recent history. Looks like the people over at the Nuggets subreddit hate the guy.", "label": 1}
{"text": "All of it if he said \"Hey lebron, take over\".", "label": 1}
{"text": "he really is a beast.", "label": 1}
{"text": "Overrated bitch", "label": 1}
{"text": "wait i’m unaware why", "label": 1}
{"text": "Hopefully, he'll start wearing down as the season goes on. Luckily, it's just the first week.", "label": 1}
{"text": "The hand sign he made triggers Korean men as it was a trademark for a large feminist website in Korea which shit on men. So for example any time video games have this gesture they have to remove it in Korean versions, even if it’s coincidental, and if someone makes the gesture on purpose they get cancelled by Korean men.", "label": 1}
{"text": "Yeah but korean men r weird so its ok", "label": 1}
{"text": "Lol what? This wasn't a comeback, they were ahead most of the game. It's almost like you didn't watch it.", "label": 1}
{"text": "Naw too busy beatin my meat at Kobe's autopsy report", "label": 1}
{"text": "Lolol and soft", "label": 1}
{"text": "There was more to it than just blindly shitting on men—they “mirrored” misogynist content and reversed the gender roles. This triggered a lot of people. It’s interesting to read about:\n\nhttps://en.m.wikipedia.org/wiki/Megalia", "label": 1}
{"text": "Could it be that too many Korean men are basically snowflakes?", "label": 1}
{"text": "In the last like month or so I've suddenly learned that SK men are famously the abusive stereotype of the Asian dating scene and I'm not sure why", "label": 1}
{"text": "I appreciate your willingness to post the other stats despite you surely knowing that they make you look like even more of a clown lol", "label": 1}
{"text": "Dog it's been 4 losses in a row in the regular season, where are you getting 12 from?", "label": 1}
{"text": "Lebron is now 40 and still doin 30 pt triple double. Like man, this dude never gets old.", "label": 1}
{"text": "> I am neither american nor live in americ\n\nthen stop giving an opinion on American politics goofy\n\n>  I think people with misogynistic beliefs are misogynists. \n\nYou literally can't even define misogyny. Stfu", "label": 1}
{"text": "Jokic was looking fat af last night.", "label": 1}
{"text": "If you think the manosphere is bad in the US, wait until you see South Korea. I have friends who moved out of Korea and vowed to never go back because of how they’re treated.", "label": 1}
{"text": "She literally interrupted him and said “stop” loudly multiple times.", "label": 1}
{"text": "Too small", "label": 1}
{"text": "It suffered from the same dynamic I saw in feminist groups. The trans / lgbt issues, while incredibly small and negligible (in numbers) in real life, took an incredible amount of oxygen out of the room. It was both sides - Both people who want to have all the wrongs in the world addressed in feminist group because of intersectionality, and all the way to TERFs with abhorrent posts of athelets and \"tells\" that they are actually men.\n\nThe result was that the community was fractured and eventually the original cause (Feminist action for women) was forgotten.", "label": 1}
{"text": "🤏🏻", "label": 1}
{"text": "Oh so this type of redpill manosphere dumb shit isn’t just a west thing? Literally all over the world? We’re cooked", "label": 1}
{"text": "Damn, fuck Korean men yo", "label": 1}
{"text": "I’m traveling Asia right now & people are really people all around the world lol", "label": 1}
{"text": "LOL...It must be true if they all get so mad about it.", "label": 1}
{"text": "That's a short career in this style of play.", "label": 1}
{"text": "That's a short career in this style of play.", "label": 1}
{"text": "That's a short career in this style of play.", "label": 1}
{"text": "It wasn't multiple times she didn't even say stop", "label": 1}
{"text": "Yes. As a Korean, it is very embarassing and sad. Mfers are taking up pregnant receive seats in subways as a sign of rebellion against women. Pathetic shit", "label": 1}
{"text": "Who ok buddy.  I am generally a feminist, but statements like this are exactly why the manosphere is attractive to a certain segment of the now population. ", "label": 1}
{"text": "No wonder the Korean birthrate is in the shitter.", "label": 1}
{"text": "> that SK men are famously the abusive stereotype of the Asian dating scene \n\nWhat??? but their boy bands are just soooo cuteeee :3", "label": 1}
{"text": "The west is by far the most progressive in this regard lmao", "label": 1}
{"text": "Boston will probably win the title this year easily and it will be very boring and nobody will watch.           \n\nUnlike the KD Warriors, nobody is hate watching the Celtics.             \n\nThere are far better things to do with your time than watch them shoot 60 3s a game and win by 30.", "label": 1}
{"text": "Alr then u little cunt", "label": 1}
{"text": "Aren't you American?", "label": 1}
{"text": "JJ hard at work (pause) swing swing (pause)", "label": 1}
{"text": "Wtf is a 3 peak?  A mountain chain?", "label": 1}
{"text": "lil bro is posting about Corey Kispert on NFL Sunday LMFAO", "label": 1}
{"text": "Yeah, like I said, you aren't arguing in good faith or you are just a complete moron with reading comprehension issues. \n\nGo ahead and keep hating, bro.", "label": 1}
{"text": "Okay dumbass?", "label": 1}
{"text": "What the fuck do you want from me? The Simpson Paradox is about stats and I dont care about stats and I didnt even used them.", "label": 1}
{"text": "Yes his averages are lower because he used to be not good enough to be a star player the majority of his career while other players at the same age (the one I named) was never roleplayer.\n\nYou basically missed my whole point because you got offended. The facts that you keep on insulting me shows how weak you are.", "label": 1}
{"text": "Its one of those happy little accidents where its wrong but still kinda makes sense", "label": 1}
{"text": "I'm Korean-American 🤯", "label": 1}
{"text": "Wait till you find out how bad racism is outside of the US", "label": 1}
{"text": "Apt username", "label": 1}
{"text": "are you stupid? \n\ni said it won't be the same impact as you'd expect out of a player you see having 24/8/10\n\nlike harden doing that 4 years ago, the first year nets harden? 50 wins, pen it down\n\nalso wtf presumably make the playoffs? it's been 2 fucking games", "label": 1}
{"text": "Oh I’m aware how good we have it here compared to some places. Love this country despite its…. eccentricities lol. Was just surprised that it’s a global thing.", "label": 1}
{"text": "I was born in Seoul. Immigrated at age 2. Went back and forth a lot. Graduated middle school in SK. Speak Korean fluently and did military service to retain citizenship", "label": 1}
{"text": "Yep!", "label": 1}
{"text": "Nba just told refs to rig playoff series. Thats why lakers won a 3peat", "label": 1}
{"text": "Dudes the biggest harden dickrider on the sub lol", "label": 1}
{"text": "Do you not understand we can see you? LMFAO like you specifically crying about Tatum and SGA in all of those threads? \n\nLike you aren’t even trying to defend the actual basketball point, instead you’re just trying to push an agenda lmfao 😭", "label": 1}
{"text": "to be fair, south korea is quite western considering the split between south and north korea was created by the u.s.", "label": 1}
{"text": "op on that internet explorer", "label": 1}
{"text": "What game other than league introduced this emote?", "label": 1}
{"text": "This is hyperbole lmao", "label": 1}
{"text": "sounds like you need friends", "label": 1}
{"text": "Cheers for bothering to answer.", "label": 1}
{"text": "It’s gotta be the medium but like, DWade is alive.\n\nCan’t you take an impression in some silicone thing, then make sand mold and just cast him then attach the face to whatever you sculpt?\n\nMatter of fact, imma go google this and probably come back of examples of exactly that.", "label": 1}
{"text": "WHO THE FUCK IS TINGUS PINGUS!?", "label": 1}
{"text": "nobody cares bro Jayden Daniels", "label": 1}
{"text": "TL DR: The NBA is unwatchable", "label": 1}
{"text": "This man was positioned to be the face of the league for the next 15 years and squandered it cause food", "label": 1}
{"text": "Atlanta kept it scrappy until the 4th. I would have much rather seen a fully healthy Hawks team for a better 4th quarter. This Thunder team is unbelievable, we’re so blessed to watched these mfs", "label": 1}
{"text": "sculptor trying to make barrack obama.", "label": 1}
{"text": "well, they even allowed Glen to hire Hamas so they doubled down", "label": 1}
{"text": "that lefty beardy man is a 3 point killer!", "label": 1}
{"text": "Early life section of Wikipedia is always the answer", "label": 1}
{"text": "If that system could get a virus… that would solve some problems", "label": 1}
{"text": "I think what you need to do is take this even more seriously than you are now. That sounds healthy", "label": 1}
{"text": "he got 16 in the third, he's lit.", "label": 1}
{"text": "What the fuck are you talking about you clown?", "label": 1}
{"text": "get well now steph, your team really needs you.", "label": 1}
{"text": "He did, but I still hate it for him.", "label": 1}
{"text": "He is a part of the problem, that is part of the frustration. This isn't how I saw things panning out post-championship.", "label": 1}
{"text": "that must be too painful, hope he's fine. praying for you my Steph!", "label": 1}
{"text": "Meh. His play style always seemed gimmicky to me", "label": 1}
{"text": "you mean Israel", "label": 1}
{"text": "The fuck do you even mean by this comment?", "label": 1}
{"text": "lmao you know exactly what i mean", "label": 1}
{"text": "I actually don’t/want you to explain yourself. Darvin ham has gained the nickname Hamas bc he has been a terrorist for our organization. Obviously having him is bad and if you are associating anything bad with the Israel/palestine conflict towards Israel, you are blatantly disregarding the fact that Hamas (a terrorist organization who have killed plenty of innocent people) has done anything bad. I say all of this as a Jew who is completely against what Isra is doing, however understands this is an insanely nuanced conflict wherein both sides have legitimate claims to their actions however have been getting increasingly pissed about people randomly looping in Israel/jews in general to anything bad that happens.", "label": 1}
{"text": "An incredible tribute to a basketball legend! Dwyane Wade's legacy is forever enshrined. 🔥🏀 #LegendaryStatus", "label": 1}
{"text": "Fun police. \n\nThis isn’t a published paper, it’s a Reddit post on a player stat line in 1 out of 82 games.", "label": 1}
{"text": "least delusional lakers fan", "label": 1}
{"text": "wiggins contributes really great for his team.", "label": 1}
{"text": "MIP", "label": 1}
{"text": "Cry", "label": 1}
{"text": "so glad to read this!", "label": 1}
{"text": "no one noticed, i'm sure it's gonna be a real good match.", "label": 1}
{"text": "Israel is an ethnostate committing genocide. The world will be better when it no longer exists, and Palestine is free.", "label": 1}
{"text": "Might come as a shocker, but most nba players don’t fuck w a hick fan base that votes against their interests ", "label": 1}
{"text": "yes seems like this", "label": 1}
{"text": "Like idk about that one but for this they deserve it all lmao : [https://youtu.be/PPRde7KsN00](https://youtu.be/PPRde7KsN00)", "label": 1}
{"text": "I guarantee you’ve SAed someone and probably didn’t even notice", "label": 1}
{"text": "Which one do you find interesting the most?", "label": 1}
{"text": "Nope, It's not mine", "label": 1}
{"text": "I just found it and it's really good. Wanted to share it with ppl", "label": 1}
{"text": "Average tIMBERWOLVES fan.. It's not mine", "label": 1}
{"text": "Like why is it so hard to believe, I find a channel which has THIS QUALITY video and so low views. It's a gem and had to share it", "label": 1}
{"text": "Hahah good one. I mean Diddy carried 2023 ngl", "label": 1}
{"text": "WDYM a common sense, I just wanted to start a discussion, hence I wrote the same exact post there as well", "label": 1}
{"text": "IDK why But I read dear Diddy and i was like: broo??", "label": 1}
{"text": "that is one scary statue", "label": 1}
{"text": "Talking to s woman isn't sexual assault loser", "label": 1}
{"text": "I wish one day someone stomps Draymonds face when they are on the ground", "label": 1}
{"text": "Look at the longer clip. Doesn't seem like she was uncomfortable there or when she led into discussion about relationships and other adult topics. Also look at the difference in comments.  You reddit idiots are in the minority on this\n\nhttps://www.instagram.com/reel/DBjr_eTSshs/?igsh=MWRrM3BvcDA5bnp6OA==", "label": 1}
{"text": "Hick ass fan base lol", "label": 1}
{"text": "It’s a charge dumbass", "label": 1}
{"text": "Tfw you wanna sound smart but just end up telling everyone you've never been to Europe", "label": 1}
{"text": "I’ve been around him for long periods maybe a dozen times for work stuff (many other athletes too) and he is definitely in the “perfectly friendly and professional” group. Which is a bigger group than most people probably assume, but is still smaller than the “Not a complete asshole, but not pretending like they wouldn’t rather be anywhere else.”", "label": 1}
{"text": "I’ll probably keep the assholes to myself because when it comes to one off interactions you never know when someone’s just having a bad day or going through stuff you don’t know about. \n\nBut on the saints side, Victor Cruz is just a super friendly and personable guy. Had time for anyone. Barkley is the same guy on and off camera. Shaking hands and busting balls with everyone no matter who they are. Barry Sanders is super low key and down to earth. No ego whatsoever. I’m sure there are more but those ones came to mind.", "label": 1}
{"text": "Wow, that’s a strong opinion about Dwyane Wade’s statue! Comparing it to Fire Marshal Bill is pretty wild. Statues are meant to celebrate athletes, so it’s a shame this one didn’t turn out well. It must feel rough for Wade to see it get so much hate.", "label": 1}
{"text": "that's a really cool bearded man. good inside good outside. Harden really is life's MVP. love him so much.", "label": 1}
{"text": "It’s two games you miserable little troll", "label": 1}
{"text": "And?      \n\nCeltics coasted to a title last year without Porzingis.                    \n\nTheir competition is even weaker this year.                                      \n\nThey are running a half billion dollar squad to keep together the most stacked team since the KD Warriors", "label": 1}
{"text": "The Celtics best players are not injury prone like Bucks or Sixers.             \n\nAnd in season trade never swing the title races anyways.", "label": 1}
{"text": "top 1 and top 2 pick go against.", "label": 1}
{"text": "Bitch ass", "label": 1}
{"text": "and the crowd goes mild", "label": 1}
{"text": "lol tell you me you’re a child without telling me you’re a child", "label": 1}
{"text": "She gives me rimjobs by the stairs. Surprises let me know she cares.", "label": 1}
{"text": "moments before the tragedy.", "label": 1}
{"text": "i really like this man. he has strong athleticism.", "label": 1}
{"text": "buzzed before he jumped. Btw nice block.", "label": 1}
{"text": "brooks made cp3 look like a child.", "label": 1}
{"text": "referees improved. way back in 2000's that would be charged as offensive foul", "label": 1}
{"text": "Spurs fans in full support of flopping and playing like a bitch.  Reminds me when they were always encouraging the dirty POS Bruce Bowen.", "label": 1}
{"text": " Crazy", "label": 1}
{"text": "I bet u/thegiannispiece punched a hole in his drywall tonight", "label": 1}
{"text": "I think KD is just the better player lol", "label": 1}
{"text": "Yeah but also, hes not good lmao.", "label": 1}
{"text": "It’s the same shots.\n\nYou don’t think going 5-5 in the second quarter and then 1-6 in the second half is streaky? He’s always been a streaky player why are you trying to deny it", "label": 1}
{"text": "The thing is that, nobody is going to talk about it because it's luka. The headline today is going to be about jayson tatum scoring 11 pts vs the bucks but still got the win. Aint nobody going to go on the media hatin' on luka, they either gonna pretend like it never happened or make excuses for it, its always been like this. Just wait for a while, you'll see what casuals are going to say about jt. I swear, they be waiting for it 😂", "label": 1}
{"text": "Did you think before you typed that?\nOne of the greatest shooters ever isn't a threat off-ball?\n\nFucking what", "label": 1}
{"text": "Ooo, I haven't been a pervert to that name in awhile...", "label": 1}
{"text": "suck a fat one", "label": 1}
{"text": "Sabonis fans angry.\n\nGoing laugh when you guys get 9th seed or first round exist again.", "label": 1}
{"text": "The best baseball players post integration are black.\n\nAnd Baseball isn't even a culturally black sport...", "label": 1}
{"text": "He loves these", "label": 1}
{"text": "asshole", "label": 1}
{"text": "That’s not all on the coaches - Dame and Giannis are clowns for that", "label": 1}
{"text": "Not shooting the ball is a 4-d chess move tho /s", "label": 1}
{"text": "Paolo for me.  I’ll take guy who puts ball in hoop.  ", "label": 1}
{"text": "Lebron fans hold that title with the way they talk EVERYTIME he loses. Can never lose fair and square because someone else was better, always because of an excuse.", "label": 1}
{"text": "Feels like they’re trimming down all the stuff that made it interesting", "label": 1}
{"text": "No i doubt it", "label": 1}
{"text": "Well, they work at CNN", "label": 1}
{"text": "It's remarkable that in 100 simulated drafts, the Thunder and Magic's picks were identical every single time, even when the draft order was changed.", "label": 1}
{"text": "They seem to be removing all the things that made it unique.", "label": 1}
{"text": "U sure ai . /.", "label": 1}
{"text": "So, \n\nWackedBush343\n\nFavors\n\nGay\n\nLove\n\nSessions\n\nGreat lineup", "label": 1}
{"text": "Don't forget about people's formative years. I read the Tao of Bruce Lee as a teenager and that shit was very impactful on who knows what at this point but back then it was the best shit ever. Is it a must read? Nah, not at all. Is it a great book in comparison to all the books in existence? Nobody fucking knows. I don't have one book in my library that I'd say is a must read for everyone and neither does anyone else alive.\n\nJust out of curiosity, what's a few amazing books out there for you? And, to poke a bit.. Have you actually read it? And if so, where did it fall short in your opinion?\n\nTo show i mean it to have a discussion, I'll list 3 books (or series) that many think are amazing and one of them is another one that had a much bigger impact on me than many pedestalized works, recent or not:\n\n* Yuval Noah Harari's Sapiens, Homo Deus and 21 lessons \"trilogy\" wasn't all that much new for me as I've been interested and read apparently enough about \"the time line\"\n\n* Thinking Fast and Slow from Kahneman is a great introduction to what is now a volatile field of economics connected to human behavior. Back then it seemed revolutionary, now? I don't think I'd recommend it outside of someone wanting to go into that specific field of academia, we keep learning about things at such an increased pace and it is an anchor to a field but hardly the seminal one anymore.\n\n* Survivor by Palahniuk is a fairly simple, fun, weird and straightforward story but having read that around web 2.0's explosion as a young person, it had more impact on me than the two above (later) and a ton of other highly regarded works throughout the millenia.", "label": 1}
{"text": "But don't u think you should try the 🍰?", "label": 1}
{"text": "Hopefully you are going to notice that 🍑 and smash it", "label": 1}
{"text": "Also nice that you're gonna try that 🍑", "label": 1}
{"text": "Yeah and you're eating that 🍰 right now", "label": 1}
{"text": "I'm biased as well and I think you should try that 🍰 right now", "label": 1}
{"text": "And you're obviously trying that 🍰 right now", "label": 1}
{"text": "Nah because you are gonna try that 🍰 right now", "label": 1}
{"text": "Well I said that you're gonna clap them 🍑 right now tbh", "label": 1}
{"text": "I cant imagine caring about this", "label": 1}
{"text": "The NFL is the most dominant sports league in America because football is the most popular sport.            \n\nThat is why CFB is number 2.", "label": 1}
{"text": "Oh got it. You're just a troll who doesn't believe his own words", "label": 1}
{"text": "He can try other teams but I'm sure he's gonna have a hard time as hard as the statue.", "label": 1}
{"text": "LOOOOOOOL", "label": 1}
{"text": "Don’t think it’s serious he’s just fat", "label": 1}
{"text": "top kek", "label": 1}
{"text": "Luka’s a bum", "label": 1}
{"text": "Uncle drew really improves every season, he shines as he age.", "label": 1}
{"text": "Ok Trumper. Lolz.", "label": 1}
{"text": "People I would love to punch in the face:\n\nLeFlop James\nUrine Rodgers\nLuka Doncic \nDonald Trump. \n\nFuck em all", "label": 1}
{"text": "They did the same after the Suns game. They foul a ton on defense and then are bewildered when the other team has a lot of free throws", "label": 1}
{"text": "Ok Trumper. Lolz.", "label": 1}
{"text": "Takes one to not no one. Lolz.", "label": 1}
{"text": "Takes one to not know one. Lolz.", "label": 1}
{"text": "Takes one to not know one. Lolz.", "label": 1}
{"text": "When harden has a shit FG 3/12 shooting night with 15/16 free throw shooting yall glaze the fuck out of his true shooting percentage, but when other players do it it's a problem? Lmfao typical r/nba", "label": 1}
{"text": "regular season is a waste of time. Stars dont feel like playing", "label": 1}
{"text": "shall i consider this a monster block?", "label": 1}
{"text": "that's painful. hope he's okay.", "label": 1}
{"text": "Poverty Nepobaby coach gets his fatass carried by Jokic and Adelman again", "label": 1}
{"text": "no doubt jokic is really a monster!", "label": 1}
{"text": "Rose lead his team to the best record in the league with his 2nd and 3rd best player missing 23 and 34 games. Lebron formed a super team and played with another top 5 player and still finished behind the bulls. It’s not that hard to understand.", "label": 1}
{"text": "Why u mad bro?", "label": 1}
{"text": "You guys beat the Jazz bro. Enjoy the first round exit IF you guys make playoffs. Not too late to be a Lakers fan, Sactown is close enough to LA.", "label": 1}
{"text": "man i can't choose they both good as hell.", "label": 1}
{"text": "that signature step back three.", "label": 1}
{"text": "I am 100% a hater. I don’t know how it’s possible not too watching him play, mixed with his victim complex over westbrick and his complete lack of self awareness/accountability. \n\n\nYou have nutlicker energy lol.", "label": 1}
{"text": "Both are good", "label": 1}
{"text": "Gobert knows how that feels", "label": 1}
{"text": "I'm with you on Luka. He's due, and the Mavs look scary.  SGA is his biggest threat, though. OKC's hot start has everyone's attention.", "label": 1}
{"text": "I think the overwhelming sentiment will be Jason Tatum.  Perrenial 1st team all nba on a team that should cruise to 65+ wins.  Makes sense for him to get it.  Could also see SGA if the Thunder lead the league in wins or Luka if Dallas leads the league in wins.  ", "label": 1}
{"text": "Yeah you keep nailing it, that guy's your daddy.  One win in like 3 years against us right?\n\nWho's your daddy?", "label": 1}
{"text": "Ultimately, it'll come down to who can consistently make the biggest impact on defense throughout the season. It's going to be an exciting race to watch!", "label": 1}
{"text": "Yes. He had all the hype. the NBA had its perfect successor to Lebron and Zion chose fast food over being an all time great", "label": 1}
{"text": "Hey at least he's not such a bitch that he won't even put on a flair.\n\nBut on top of that,\n\nWho's your daddy, bitch?", "label": 1}
{"text": "Don’t vote for the Red or Blue genociders, a better world is possible.\n\nwww.VoteSocialist2024.com", "label": 1}
{"text": "nah, Miles' girlfriends face", "label": 1}
{"text": "Hate to hear this about Scottie! Hoping for a quick recovery, he's a big part of what makes the Raptors so exciting to watch!", "label": 1}
{"text": "I mean cmon nobody would watch that.                  \n\nIf Boston vs GSW did 11 million Thunder Magic would get like 6 million MAX", "label": 1}
{"text": "Hopefully! The league has way too much trash like Barnes that needs to get taken out!!", "label": 1}
{"text": "2 teams that barely get coverage and nobody cares about.", "label": 1}
{"text": "Only by NBA die hards.", "label": 1}
{"text": "The WNBA is rapidly gaining viewers while the NBA is rapidly losing viewers.", "label": 1}
{"text": "Something with extremely fucked up undertones can also be unfortunately the truth", "label": 1}
{"text": "Love me some self-awareness", "label": 1}
{"text": "LOL, the Celtics are definitely giving off major '90s vibes with all the bald heads! Haven't seen this many bald players on one team in a while.", "label": 1}
{"text": "They were up five with 1:10 fourth game into the season this is some major nuts in chin attitude.", "label": 1}
{"text": "And standing right behind me will be Dry-Cupstain-8589 as expected", "label": 1}
{"text": "With how ass Max has been playing, it couldn’t hurt to play bronny", "label": 1}
{"text": "Westminster and Garden Grove are looking over at you right now. And Bolsa….don’t even get me started, Irvine, the list goes on. California has the worst drivers, likely because 1/4 of Californias are immigrants.", "label": 1}
{"text": "This is why i love the league.", "label": 1}
{"text": "made me dizzy while he's making that spins.", "label": 1}
{"text": "Man that was clear foul. but it was good because he made that three bucket. Young is such an art.", "label": 1}
{"text": "it was a bluff to create space.", "label": 1}
{"text": "https://buckwilddesignss.etsy.com", "label": 1}
{"text": "Cleveland fans must be loving this moment for a local kid.", "label": 1}
{"text": "Keep his Dick out your mouth, sorry keep his name out your mouth.", "label": 1}
{"text": "That shot was pure clutch; Tatum thrives in these moments.", "label": 1}
{"text": "Suck my dick", "label": 1}
{"text": "The Cavaliers 2 left placards outside the away locker room welcoming both LeBron and Bronny back to Cleveland.", "label": 1}
{"text": "Sound of the net when it the ball lander is so sweet in my ear. Also, Siakam always my bias.", "label": 1}
{"text": "Cavs found their rhythm, and it’s like they’re sprinting now!", "label": 1}
{"text": "Just pointing out facts bitch boy", "label": 1}
{"text": "Might be a good fit for the Carolina panthers.", "label": 1}
{"text": "Jeremy Lin.", "label": 1}
{"text": "Looks like Knecht is ready to make his mark!", "label": 1}
{"text": "Who cares? Pussy", "label": 1}
{"text": "Hes shit compare to Nurse.\n\nNumbers are facts. I don’t need to explain more to a bunch of losers online", "label": 1}
{"text": "Nah he only checked out once the Spurs kept failing to get him the ball. There were three consecutive possessions in the second where he had a smaller man sealed and the Spurs couldn’t find him. Then the same thing early in the third and then he just seemed to give up.", "label": 1}
{"text": "mentally weak, unfortunately the french mind is not built for long-term competitive sports. sad to see", "label": 1}
{"text": "One of them is the next face of the NBA, and the other is simply a baguette.", "label": 1}
{"text": "Mann and waters had a great start this season.", "label": 1}
{"text": "he made that James Harden right handed version euro step.", "label": 1}
{"text": "dray is really a good offensive and defensive player.", "label": 1}
{"text": "u/pskill43 Draymond played like a DPOY tonight without Steph Curry. Might want to sign a apology form.", "label": 1}
{"text": "Warriors fanatics are THE WORST. Let's see what kind of Hall of Fame powers that meathead dirtbag (dirtiest player in the NBA) puts up at TD Garden next week. JT will have 50. JB will have 40. Your cheating bum won't be able to stop shit...\n\nCeltics 132\nWarriors 106", "label": 1}
{"text": "https://www.reddit.com/r/nba/s/p6tDPo64mI\n\n🤷", "label": 1}
{"text": "u/PoundIIllIlllI appears to not know ball", "label": 1}
{"text": "Donald Trump[is winning](https://amzn.to/4fpa3c5) and it's simply not close", "label": 1}
{"text": "i agree to this.", "label": 1}
{"text": "one of the best games he had for me.", "label": 1}
{"text": "Hope you watched the warrior game today dummy. Unplayable my ass lmao, no Curry and he was the best player on the floor tonight had Zion in hell. Stop speaking on ball you don’t know it.", "label": 1}
{"text": "You’re the idiot who thinks I’m comparing Dray to LeBron. All I’m saying is LeBron wouldn’t have been able to carry this shit team either. Lebron missed the playoffs with his first stint with the Cavs and Lakers too btw but you wouldn’t know that cause you’re full of shit", "label": 1}
{"text": "rare footage of the beard clumsy plays.", "label": 1}
{"text": "Donkey Green is jealous when his position on the team is at risk. He was a literal ass to Durant and Poole.", "label": 1}
{"text": "it's just a bad day not a bad season. Zion will surely make a comeback.", "label": 1}
{"text": "since lebron was still a rookie i think he's still on cavaliers that time.", "label": 1}
{"text": "that's a really good numbers.", "label": 1}
{"text": "Chad Holmgren still clears Wembanyabum, nothing changed", "label": 1}
{"text": "Lmaooo I click on this thinking Draymond has some 5x5 game or something and it’s fucking 14/4/6 LOL\n\nTurns out I was right, which is why so many people agreed with me then. A bunch of biased warriors fans that started getting mad enough to save my comment and then downvote *now* just proves my point\n\nStick to r/soccer. You don’t know basketball", "label": 1}
{"text": "He a fat pussy lol", "label": 1}
{"text": "Considering that prime time ratings are down up to 42% compared to last year, which was already down compared to 2022, I don’t think many agree with you.", "label": 1}
{"text": "they need to project that same confidence and swagger off the court too. Sometimes, less is more.", "label": 1}
{"text": "Dickhead Harden ball in the fourth quarters of early season aren’t really much of an anomaly. #ShouldveLetNormanCook", "label": 1}
{"text": "You can't trade players like that.\n\nAntetokounmpo basically would have to say \"Trade me to Team X! I will never play for any other team!\"", "label": 1}
{"text": "Like a faggy", "label": 1}
{"text": "I just posted Spencer Dinwiddie’s SAT score. \nhttps://www.thecrimson.com/blog/the-back-page/article/2010/9/6/mbball-recruiting-dinwiddie-090610/#:~:text=Carrying%20an%20overall%20core%20GPA,of%20them%2C%E2%80%9D%20he%20said.\n\n1800/2400. That’s converted to a 25 ACT and FAR lower than Kornet. Are u happy with that info? Now that you know he didn’t get in academically. Not hard to admit you’re were wrong the entire time.", "label": 1}
{"text": "great hustle annoying defense.", "label": 1}
{"text": "that scream is too soft lmao.", "label": 1}
{"text": "how did this man stole my heart in just seconds. LMAO.", "label": 1}
{"text": "He's the father of all left handed players on the NBA.", "label": 1}
{"text": "imagine getting guarded by him.", "label": 1}
{"text": "Only if their GM is a total bitch.  ", "label": 1}
{"text": "They are by far the dumbest fanbase I’ve ever encountered.  ", "label": 1}
{"text": "i agree. he's really that good. he could make it up to top 2 if he is lucky enough to put buckets.", "label": 1}
{"text": "50% from 3 seems not sustainable but dude looks awesome.  ", "label": 1}
{"text": "brown is such a good player.", "label": 1}
{"text": "gotta disagree with that last statement. Tatum and Brown absolutely took major steps and if they had been the players they are now 2 years earlier we might’ve beaten Golden State.\n\nlast year was easily the best playmaking year of Tatum’s career in both the regular season and postseason and he also posted the best rim finishing numbers of his postseason career. he shot a career-high 69.4% in the restricted area in the playoffs compared to like 55-60% in the restricted area over his first five postseasons\n\nBrown also had his best playmaking year and improved his shot selection, his decision-making off the bounce, his discipline and his consistency on defense (drastically), not to mention him really asserting himself the emotional leader and tone-setter for the team in the locker room", "label": 1}
{"text": "Clingan has been awesome but he just isn’t capable of playing more than 15 minutes yet.  ", "label": 1}
{"text": "OKC plays Portland tomorrow so they’re fucked.  ", "label": 1}
{"text": "such a young age. he has a lot to face. experience takes time and so learning does.", "label": 1}
{"text": "Yeah he has a daughter. It would be pretty weird to vote for Trump if you’re a father with daughters. You’d be voting for them to have less freedom lol. What kind of shit is that", "label": 1}
{"text": "He's a black man, it's already pretty apparent who he'd be voting for - even before endorsement. \n\nTrump does not fuck with us and black people have always majority voted for progression(left).", "label": 1}
{"text": "Another genocidal maniac. Anyone who supports Kamala or Trump is a p.o.s", "label": 1}
{"text": "Good. Fuck Trump", "label": 1}
{"text": "If mods delete this that means they love Trump", "label": 1}
{"text": "oh no, get well soon Banchero.", "label": 1}
{"text": "I’d rather not align myself with somebody who hangs out with Diddy.  ", "label": 1}
{"text": "Lenotwrong.", "label": 1}
{"text": "Diddy, PEDs, China.  ", "label": 1}
{"text": "Ok.  Thanks for the lecture dad.  ", "label": 1}
{"text": "cool advertisement! i'm probably getting those.", "label": 1}
{"text": "You don’t have to hate on third parties to make you feel better about your shit candidate.  And no I didn’t vote for her.  ", "label": 1}
{"text": "shouted like a kid.", "label": 1}
{"text": "I don't know what critical thinking you're doing to cosign a Trump presidency. You should've done the world a favor and taken Trump's cure for COVID instead of waiting for other vaccines to be developed. \n\nYour brain doesn't know what pattern recognition is because you're too busy providing a nice felattio to that orange turd's mushroom dick. \n\nI could've sworn I saw you riding in the back of that garbage truck Trump was driving the other day too. I couldn't think of a more appropriate look for a cult leader and his sycophants.", "label": 1}
{"text": "The Anti-woke crowd thinks the internet consists of just anti-woke people and bots", "label": 1}
{"text": "shaqs gonna be very angry at this.", "label": 1}
{"text": "Dude parties with diddy of course he’s gonna vote for the pedo party", "label": 1}
{"text": "LeFuckYouTrump", "label": 1}
{"text": "Your post was removed for the following reason(s):\n\n> No Reposts\n\nPlease check the new queue before posting. Make sure the content you are posting has not already been submitted by another user.\n\nIf you have any questions, feel free to message us via [modmail](https://old.reddit.com/message/compose/?to=/r/nba).", "label": 1}
{"text": "Ain’t no part like a diddy party", "label": 1}
{"text": "Lediddy", "label": 1}
{"text": "I voted for who I thought was the best candidate.  Did you?", "label": 1}
{"text": "unrelated but the mods just deleted the Lebron endorsement post 🤔", "label": 1}
{"text": "I did participate.  ", "label": 1}
{"text": "Even got one of his ping pong babies from the Olympics", "label": 1}
{"text": "It does change things.  I give my vote to the candidate I feel deserves it.  Rather than just vote for whatever shit candidate is presented to me.  ", "label": 1}
{"text": "Your point is vapid and not worth addressing.  ", "label": 1}
{"text": "Google.com", "label": 1}
{"text": "You’re not taking about politics.  You’re just saying everyone who doesn’t agree with you is Hitler.  You’re a dumbfuck.  ", "label": 1}
{"text": "ever seen a girl hike up her dress so she can move more freely?  \n  \nWemby can do that too when he's not on camera... lift up the costume and his feet will be free to move. He's fine under there, no worries.", "label": 1}
{"text": "It’s insane to me that literally anyone who isn’t a reject is supporting Kamala. Like it was literally a parade of the biggest losers the other night, saying the dumbest shit. \n\nWhat dumbass are they seeing themselves in? \n\nThe failed comedian who single-handedly might have cost them the election?\n\nThe Jewish guy who didn’t see the irony of joking about a Nazi rally, in the same place as a Nazi rally 100 years ago?\n\nDr Phil, the worlds most successful failure of a doctor? \n\nRudy Giuliani who just lost his entire life to two election workers for a buddy who left him out to dry?\n\nThe imitation white man with the bald head who looks and sounds like the dumbass brother from arrested development? \n\nLike every single person on that stage is a loser. Their dude couldn’t even steal an election.", "label": 1}
{"text": "Maybe if your daughter is a careless hoe who let's strange men nut in her and can't afford a plane ticket", "label": 1}
{"text": "This didn’t hit the way you wanted it too bud. Also you might wanna stop cheering for a team and league full of black folks", "label": 1}
{"text": "Lol nice job setting yourself up to get dunked on dumbass", "label": 1}
{"text": ">harris+beyonce, 5 days ago, 1 million views, 55% likes\n\n>trump+rogan, 5 days ago, 42 million views, 98% likes\n\n>jd+rogan, 8 hours ago, 4 million views, 99% likes\n\nThe People have spoken.", "label": 1}
{"text": "Old, slow, dumb, badly coached, two stars that seemingly don’t like each other\n\nWe can go on and on", "label": 1}
{"text": "oh no! heal fast Paolo!", "label": 1}
{"text": "that swaggy Ja Morant pass.", "label": 1}
{"text": "this belongs to shaqtin a fool.", "label": 1}
{"text": "his scream didn't fit his size.", "label": 1}
{"text": "he clearly watches anime.", "label": 1}
{"text": "Yeah you do. \n\nYeah you do. \n\nI don’t need luck. I just need you to keep being an incel. Turning women to Kamala every day. Thank you for your service. 🫡", "label": 1}
{"text": "i hate it when my idols are injured.", "label": 1}
{"text": "they made it look easy.", "label": 1}
{"text": "chris paul never fades when it comes to passing.", "label": 1}
{"text": "the confidence that his team mate would score. i love it Ja!", "label": 1}
{"text": "Hope bucks fans realize this\n\nIt’s was all a mirage\n\nThe hype\n\nThe expectations\n\nYour supposed Greek god was supposed to turn this team into something that is feared when in reality, ain’t nobody losing sleep over this team\n\nAnd him being in all of these lofty positions that all of y’all put him in is truly showing to be complete and utter nonsense kind of like the all of the other wannabe dynasty teams", "label": 1}
{"text": "Nerd alert", "label": 1}
{"text": "Lmaoo told you that you were voting. It’s actually two cats, and I don’t need or want a partner right now. I’m actually really happy with my life. 10/10, no complaints. You aren’t slick. You are an incel out here simping for Trump. I kinda get it though, if he can get away with sexual assault and become president, maybe you can too! \n\nI am voting, because I’m not a moron. I am not idolizing anyone, again projecting buddy. You aren’t slick. Plain as the personality you refuse to improve. \n\nGonna remind you that they *endure you*, they do not like you. You offer nothing but a reflection of what you think a normal person is. Everyone can see it. That’s why I’m getting under your skin. Hitting home. \n\nYou have nothing. No enemies, no friends. It’s just you and your fat stack of cash that can’t seem to make you happy. You are bitter, lonely and lashing out at the world for problems you are too scared to admit. You are a coward. \n\n🫡", "label": 1}
{"text": "yo mama", "label": 1}
{"text": "Chasing stats, but forgot about winning basketball.", "label": 1}
{"text": "You don’t even understand the market isn’t the economy…", "label": 1}
{"text": "Uh, were you sleeping during the last game or do you have the memory of a goldfish?", "label": 1}
{"text": "He has literally scored less and #shot worse from 3 in each additional game# I know reading is hard for someone like you", "label": 1}
{"text": "Ok trumpie lol", "label": 1}
{"text": "Yes. This team right now for this season has it's potential. Rooting no injuries and everyone is healthy tbh", "label": 1}
{"text": "Yup these people are either bots or absolute clueless like lebron. A video promoting hate & they call it inspiring?", "label": 1}
{"text": "Amen", "label": 1}
{"text": "‘24 Magic and Bird", "label": 1}
{"text": "Shut the fuck up cunt. You're embarrassing.", "label": 1}
{"text": "Explain how Trump is bad for the U.S. and the world. Dont just brush it off. Be an intelligent individual and actually explain your thought process, you absolute buffoon", "label": 1}
{"text": "Could be 2 CP3’s stacked on top of each other, lol", "label": 1}
{"text": "[best friends](https://static01.nyt.com/images/2019/07/11/us/politics/09dc-trumpspstein1/09dc-trumpspstein1-superJumbo-v2.jpg)", "label": 1}
{"text": "Most qualified versus the guy who's done the job... \n\nShe doesnt believe in anything, cant answer a question. She has a long history of abusing power and treating people unjustly. \n\nWe're so fucked no matter who", "label": 1}
{"text": "There was once a photo that showed the whiteboard in the Lakers locker room when Kobe/Dwight and co. were playing. It showed that good shooters in game essentially never missed in practice and bad shooters like Dwight hit like 90%. \n\nIt’s clearly all mental and stress.", "label": 1}
{"text": "Hey man, take an upvote! You deserve it! So brave!", "label": 1}
{"text": "[Partying with Epstein](https://www.thedailybeast.com/resizer/v2/BIMHDDRT75FC3A5IZZVTW2GROI.jpg?auth=ce0545719064be2fd6e4f1c9d640748a2cfa793fc4fb76d5da0b673fb5fbf21e&smart=true&width=300)", "label": 1}
{"text": "Here comes the \"I don't like LeBron because he's too political like the time he [insert china generic thing here] or [insert police brutality misidentification here]. [Insert Bronny joke here]. He's a crybaby and needs to just ball", "label": 1}
{"text": "A that's lil Dirk right there", "label": 1}
{"text": "Shut up you big baby bitch.", "label": 1}
{"text": "hope someone in Philly socks him in the eye for that dumbass shit", "label": 1}
{"text": "Fuck Marcus Hayes", "label": 1}
{"text": "Politics are a cancer,  just destroys everything.", "label": 1}
{"text": "Real talk though, this sub should not be throwing stones inside this particular glass house lol.", "label": 1}
{"text": "That correlates.", "label": 1}
{"text": "Communism is when thing I don’t like", "label": 1}
{"text": "Kakashi has all the flow 😎", "label": 1}
{"text": "ahh good point", "label": 1}
{"text": "They replied and said \"Russian collusion\" but must have deleted it. Yeah, about that...", "label": 1}
{"text": "i'll repeat the last part.   and?\n\nthis isn't even smoke... find the fire.  i'm all for burying everyone on the Epstein list - it's not Trump hiding it.", "label": 1}
{"text": "Maybe Embiid should stop dedicating his career to his dead brother if he’s just gonna fuck around half the time and choke in big moments.", "label": 1}
{"text": "Watch the video clip Lebron posted. It is impossible to say \"lmao\" at that. What a show of disrespect. You are either racist or support racists.", "label": 1}
{"text": "lol get a load of this regard. MMA wannabes make up the best fantasies.", "label": 1}
{"text": "Just off the top of my head Westbrook, Penny Hardaway, Yao Ming, Grant Hill just immediately off the top of my head and all of them were more skilled, not better, but more skilled players than Giannis. Any player CAN have a career altering injury, but Giannis playstyle increases the likelihood, especially as he ages.\n\nIs chet going to improve? What a stupid question to asl after he just played all 82 last year and would have easily won ROY if not for an alien winning it lol. Asking if we are gonna pay to keep them together is also stupid when you're advocating trading one of their rookie contracts for a player who makes 50 mill a year... we have a nig chance to win as is and a big chance to sustain success. Giannis isn't needed and doesn't really move the needle on this team with what we'd have to give up to get him", "label": 1}
{"text": "Wants to leave immediately because the team isn’t currently amazing.  What a league, ring culture is so gay", "label": 1}
{"text": "1 down, 9 to go.", "label": 1}
{"text": "📢NBA Streams:", "label": 1}
{"text": "NBA Streams:", "label": 1}
{"text": "Suck harder bro AD’s about to cum.", "label": 1}
{"text": "Thanks to u/Mukbeth\n\nThink he's talking about the below my guy \n\nhttps://www.yahoo.com/news/76ers-cut-employee-salaries-joel-000000950.html\n\nhttps://www.libertyballers.com/2022/10/14/23403664/joel-embiid-launches-in-memory-of-arthur-community-initiative-philadelphia-non-profit-organizations\n\nhttps://www.nba.com/sixers/news/embiid-receives-march-nba-cares-community-assist-award\n\nhttps://www.borgenmagazine.com/youth-of-cameroon/\n\nhttps://www.google.com/amp/s/whyy.org/articles/joel-embiids-donation-to-philly-area-shelters-is-why-sixers-fans-love-him/amp/", "label": 1}
{"text": "Cavs are a scary ass team. wonder if they have any marginal moves left to make", "label": 1}
{"text": "I mean Kawhi's bounce doesn't go in, in Game 7 vs the 76ers they probably beat the Warriors that year due to their own injuries. \n\n\nY'all had similar luck on your way to the finals, oh and against a Jimmy Butler heat lmao. \n\nNice job on one ring but your teams done and donelmao.", "label": 1}
{"text": "Here jackass, thanks to /u/ Mukbeth\n\nhttps://www.yahoo.com/news/76ers-cut-employee-salaries-joel-000000950.html\n\nhttps://www.libertyballers.com/2022/10/14/23403664/joel-embiid-launches-in-memory-of-arthur-community-initiative-philadelphia-non-profit-organizations\n\nhttps://www.nba.com/sixers/news/embiid-receives-march-nba-cares-community-assist-award\n\nhttps://www.borgenmagazine.com/youth-of-cameroon/\n\nhttps://www.google.com/amp/s/whyy.org/articles/joel-embiids-donation-to-philly-area-shelters-is-why-sixers-fans-love-him/amp/", "label": 1}
{"text": "don't expect you to read but he's pissed at a writer bringing up his dead brother fool: https://old.reddit.com/r/nba/comments/1ghb464/neubeck_embiid_when_i_see_people_saying_he_doesnt/luw2t5o/", "label": 1}
{"text": "don't expect you to read but he's pissed at a writer bringing up his dead brother fool: https://old.reddit.com/r/nba/comments/1ghb464/neubeck_embiid_when_i_see_people_saying_he_doesnt/luw2t5o/", "label": 1}
{"text": "Thanks to /u/ Mukbeth\n\nhttps://www.yahoo.com/news/76ers-cut-employee-salaries-joel-000000950.html\n\nhttps://www.libertyballers.com/2022/10/14/23403664/joel-embiid-launches-in-memory-of-arthur-community-initiative-philadelphia-non-profit-organizations\n\nhttps://www.nba.com/sixers/news/embiid-receives-march-nba-cares-community-assist-award\n\nhttps://www.borgenmagazine.com/youth-of-cameroon/\n\nhttps://www.google.com/amp/s/whyy.org/articles/joel-embiids-donation-to-philly-area-shelters-is-why-sixers-fans-love-him/amp/", "label": 1}
{"text": "Thanks to /u/ Mukbeth\n\nhttps://www.yahoo.com/news/76ers-cut-employee-salaries-joel-000000950.html\n\nhttps://www.libertyballers.com/2022/10/14/23403664/joel-embiid-launches-in-memory-of-arthur-community-initiative-philadelphia-non-profit-organizations\n\nhttps://www.nba.com/sixers/news/embiid-receives-march-nba-cares-community-assist-award\n\nhttps://www.borgenmagazine.com/youth-of-cameroon/\n\nhttps://www.google.com/amp/s/whyy.org/articles/joel-embiids-donation-to-philly-area-shelters-is-why-sixers-fans-love-him/amp/\n\n\n\nAlso he's pissed and responding to a reporter bringing up his dead brother even, he's not bringing this up out of thin air: https://old.reddit.com/r/nba/comments/1ghb464/neubeck_embiid_when_i_see_people_saying_he_doesnt/luw2t5o/", "label": 1}
{"text": "> wow this thread is a huge pro Embiid circlejerk.\n\nSo I asssume you're just beating your shit on the other threads with Embiid that's 99% hating on him??", "label": 1}
{"text": "This is a theory that holds water actually.\n\nWe’ve seen him act out even worse after getting the 1st tech in the game and the refs just stand there awkwardly laughing.", "label": 1}
{"text": ">This media attention and criticism is a privilege that many wish they would have\n\nlmao you're just saying shit to say shit now. \n\nThanks to /u/ Mukbeth\n\nhttps://www.yahoo.com/news/76ers-cut-employee-salaries-joel-000000950.html\n\nhttps://www.libertyballers.com/2022/10/14/23403664/joel-embiid-launches-in-memory-of-arthur-community-initiative-philadelphia-non-profit-organizations\n\nhttps://www.nba.com/sixers/news/embiid-receives-march-nba-cares-community-assist-award\n\nhttps://www.borgenmagazine.com/youth-of-cameroon/\n\nhttps://www.google.com/amp/s/whyy.org/articles/joel-embiids-donation-to-philly-area-shelters-is-why-sixers-fans-love-him/amp/\n\nAlso he's pissed and responding to a reporter bringing up his dead brother even, he's not bringing this up out of thin air: https://old.reddit.com/r/nba/comments/1ghb464/neubeck_embiid_when_i_see_people_saying_he_doesnt/luw2t5o/", "label": 1}
{"text": "-some fat dude on reddit", "label": 1}
{"text": "Stfu pussy", "label": 1}
{"text": "that slow motion step and reverse finish is too fabulous.", "label": 1}
{"text": "be the person you want others to be. Lmao.", "label": 1}
{"text": "this is the behind the back pass that splash brothers always does.", "label": 1}
{"text": "how did he miss that wide open lay up.", "label": 1}
{"text": "Lebron to AD connection!", "label": 1}
{"text": "I always assume they're some bot", "label": 1}
{"text": "Refs actually raped the soul out of thia game \n\n\nWe were all thinking it", "label": 1}
{"text": "thought the ball was his girl", "label": 1}
{"text": "muscle memory", "label": 1}
{"text": "Nah he only hit the ball once 💀", "label": 1}
{"text": "Damn he THROWED the shit outta that ball with the top 1/8th inch of his fingers. Eat dogshit 🤓", "label": 1}
{"text": "Tatum was asking for it, just look at him", "label": 1}
{"text": "Nobody “quietly” starts a season 6-0. \n\nJust write a damn title instead of trying to shoehorn random words in to make it sound catchy.", "label": 1}
{"text": "it was already a dead ball anyway", "label": 1}
{"text": "NBA is always improving. i never saw someone throwing this far at 90's, imagine a near half court bucket!", "label": 1}
{"text": "is williams a former quarterback?", "label": 1}
{"text": "shaqtin' a fool.", "label": 1}
{"text": "that's too far to pull a three! i love the confidence!", "label": 1}
{"text": "incredible numbers from suggs!", "label": 1}
{"text": "was expecting this tie.", "label": 1}
{"text": "credits to Garland for contributing a large amount of FG.", "label": 1}
{"text": "God that got dark(er) quick", "label": 1}
{"text": "THISS GUY NEVER FAIL TO IMPRESS LAKERS FANS", "label": 1}
{"text": "Only Lakers fans will defend this disgrace. \n\n\nLAL = Privileged bastards.", "label": 1}
{"text": "I didn’t know china had a democratic nomination this year.", "label": 1}
{"text": "Maybe don’t give people season ending injuries after the whistle you dumb piece of shit", "label": 1}
{"text": "Yes but without the tears.", "label": 1}
{"text": "You said consensus moron hahahhaha. Google it.", "label": 1}
{"text": "this is cool.", "label": 1}
{"text": "that's a swaggy finish!", "label": 1}
{"text": "Philly fans as floppy as their piss work ethic false idol, no surprise there - horrible rude shithole fanbase, famously so - world famous\n\nSo to watch yall flop and pretend this is a foul, hahahahahahahAHHAHAHAHAHA\n\nIt's not even, but you all take after that boi - sucks to have poor role models", "label": 1}
{"text": "Scoot with a scoop, nicely done!", "label": 1}
{"text": "That's why gaybert was flinching lol", "label": 1}
{"text": "Nuggets have gayberts number cause he sift af", "label": 1}
{"text": "Said to a Chicago bulls flair. God you idiots just spit out generic shit after npc line without a thought", "label": 1}
{"text": "When it’s all said and done this could be the best defensive team since the 2003 Pistons, and I can always say that I called it before the season", "label": 1}
{"text": "Look how mad you weirdos are about getting dunked on, my god it's weak, it's hard to imagine a person being this weak lmao", "label": 1}
{"text": "I just can't-er with this guy", "label": 1}
{"text": "Gobert cried in a press conference for missing the all star team. Talk about being a baby.", "label": 1}
{"text": "I agree with him. My view is that if your parents are Nigerians, you are as well. You have no greek blood to be greek. Also we Europeans know how should a person of certain ethnicity appear. Most of french football national team players arent real french. The same is with Switzerland and their team. Nikola Tesla was not an American yet you often say he was. ", "label": 1}
{"text": "He needs to just have a stroke already", "label": 1}
{"text": "Does he have to spell it out for u?", "label": 1}
{"text": "Only the first letter. Racist ass bitch.", "label": 1}
{"text": "Imagine playing a victim lmao", "label": 1}
{"text": "yeah really.", "label": 1}
{"text": "that's gigantic hell of a hand.", "label": 1}
{"text": "dame will come back strong.", "label": 1}
{"text": "Tatum definitely a bitch 🤣", "label": 1}
{"text": "Autism", "label": 1}
{"text": "not the older ones", "label": 1}
{"text": "[they just drive to the rim more i swear](https://www.reddit.com/r/bostonceltics/s/9oR0lJLeI4)", "label": 1}
{"text": "Get on that gay Tatum dick train. Tatum a bitch.", "label": 1}
{"text": "Fuck you mean those are shallow reasons to hate a man.\n\nI was a junior doctor during COVID \n\nDo you know how hard it is to explain to a family that their grandpa who came in with a lil cough and breathlessness would need to be intubated  and most probably won't make it until tomorrow.\n\nHave you ever had to sit down with a 10 year old kid and explain to them that both his parents were suffering from an unknown respiratory condition and that their saturations were falling no matter what we did.\n\nI can understand that non medical folks would not be able to appreciate the gravity of something like COVID. But for fucks sake you could at least not go on national TV and mock our recommendations.\n\nI say fuck gobert and I'll stand by it any day of the week.", "label": 1}
{"text": "Where did I say gobert played bad defense? Do you have down syndrome? All I said was that he dunked it on a 4x defensive player of the year? And he's like what 6'4? Ppl wanna take down on this dunk but was praising a 7ft Gianni's cause he dunked on *checks notes* fucking vuicic that fat slug? U ppl man, just crazy and slow in the head", "label": 1}
{"text": "Looking at those numbers confirms one thing to me.  Jaime Jacquez is probably the most overrated player in the league.  ", "label": 1}
{"text": "Was he?  I didn’t watch a lot of Raptors games, I thought it was just a not enough playing time situation?", "label": 1}
{"text": "That’s cool.  Always love seeing the young guys start putting it together.  ", "label": 1}
{"text": "Nuggets FO needs to take a look in the mirror about how they have approached this offseason, no faith at all in this team winning a chip from what i’ve seen so far", "label": 1}
{"text": "Russ has been bad, but Murray and MPJ being the exact same players as last year combined with losing KCP for nothing is a crime. No reason why the team looks so awful when Jokic goes to the bench", "label": 1}
{"text": "Crazy how some of the best players come from low draft picks! Shows talent can come from anywhere.", "label": 1}
{"text": "Jaylen Brown has been ruled out of tonight's game against the Charlotte Hornets due to a left hip flexor strain. Sam Hauser is listed as probable", "label": 1}
{"text": "X**", "label": 1}
{"text": "Because those are Jewish-founded firms that have been in the entertainment industry for decades and decades and Rich Paul has been painted — by \"journalists\" who need to be loyal to those firms — as the Black new-money upstart trying to tear down their hegemony. If Rich Paul was a white guy, people wouldn't be talking about him the way they talk about him.", "label": 1}
{"text": "Probably true.", "label": 1}
{"text": "Is it incorrect or wrong to specify?", "label": 1}
{"text": "Let’s kill him", "label": 1}
{"text": "Factually true lol. White South Africans are not Africans either.", "label": 1}
{"text": "Unfortunately we can’t, that is against democracy", "label": 1}
{"text": "Even on Howard stern interview back in the 00s he’s always said stupid shit that actuslly quite funny like take what he said about more Greek like what the fuck lmao it’s just hilarious and off the cuff. He says Tom of dumb shit and also moments like this that’s hilarious", "label": 1}
{"text": "Someone already tried and they failed", "label": 1}
{"text": "Not stupid at all. If they are Jewish founded firms then everyone is enabled and correct to call them that without any connotations. \n\nHere such firms have a hegemony. Rich Paul is breaking it and getting backlash. Could it be related to the nature of the hegemony? Sure, that’s why it’s relevant to call them Jewish firms.", "label": 1}
{"text": "He can’t shoot.  ", "label": 1}
{"text": "Wiggins", "label": 1}
{"text": "Yes, I would have, because my entire point is that Rich Paul is unlike 95% of the other people in his field, and that has impacted the way he is talked about in media. Newsflash: most agents in sports or film or comedy are Jewish; if that's antisemitic, then you're a moron. If CAA, WME, etc. were owned by WASPs, I 100% would have pointed out that they were run by old white guys, yes.", "label": 1}
{"text": "Because most agencies are run by white Jews and Rich Paul is... *checks notes*... not a white Jew. That's why I brought it up. Because that's literally my whole point: that Rich Paul is not white and that has impacted the way we talk about him.", "label": 1}
{"text": "At least wait until the all star break to start pulling this shit.  ", "label": 1}
{"text": "I don’t give a fuck, it’s an absolute embarrassment as a franchise for Toronto to honour this man", "label": 1}
{"text": "Stirling knock off", "label": 1}
{"text": "💯", "label": 1}
{"text": "I think Timelord is worth the risk considering what his trade value is.  Dude could literally be the difference maker for a team or get hurt.  ", "label": 1}
{"text": "Literally nothing happened 😂 you’re so fckn soft who raised you?", "label": 1}
{"text": "lol soft", "label": 1}
{"text": "Drake's a groomer and a pedophile", "label": 1}
{"text": "Nikola Jokic's impressive stats demonstrate his all-around skill and impact on the court.", "label": 1}
{"text": "Fuck WestBrick. He's such a net negative.", "label": 1}
{"text": "A team is indicative of its leader", "label": 1}
{"text": "I came across a post on there of a guy being swindled by a fanon wiki that was fake and people actually beloved it was real.", "label": 1}
{"text": "If it was Marcus Hayes he deserved that shit", "label": 1}
{"text": "Should've gotten more than shoved imo", "label": 1}
{"text": "You, douchebag, are a douchebag. 10/10 rage bait", "label": 1}
{"text": "I'm sorry but you use my child and dead brother to shit on me and you're getting these hands", "label": 1}
{"text": "Shut the hell up, you are probably the type of redditor to think everything is staged.", "label": 1}
{"text": "Or just don’t bring up someone’s dead brother just to stir shit. NBA player or not if someone does that shit they deserve to get their ass beat. Freedom of speech isn’t freedom of consequence.", "label": 1}
{"text": "Ultimately it just proves what the reporter said about Embiid not showing up to fulfill his duty. Embiid is going to get suspended for this and leave the Sixers in a bad spot because he couldn't control himself. He's well within his rights to demand an apology but physically attacking him is not going to help.", "label": 1}
{"text": "Mitchell's shot was next level. These clutch plays are what make the game exciting.", "label": 1}
{"text": "white people why yall act like this", "label": 1}
{"text": "This dude over here defending a glorified tabloid reporter shit talking someone's dead family members. What a piece of trash.", "label": 1}
{"text": "you'd be the coolest dude in the prison shower", "label": 1}
{"text": "Shut the fuck up Pompey, and I just WISH Embiid knocked the fuck out of Marcus Hayes that stupid piece of shit.", "label": 1}
{"text": "It’s not inappropriate to be someone’s mentor. wtf? Reddit is so quick to call everyone a pedophile that it’s bizarre. Maybe Redditors are the pedos because they are legit obsessed. \n\n“Omg. You hang around 6 year olds?”\n\n“Yeah… that’s my son.”\n\n“Omg! Pedo!” \n\nLike wtf. Y’all are weirdos", "label": 1}
{"text": "Ohh ok so he didn’t actually say anything bad about his brother, thanks!", "label": 1}
{"text": "You’re reaching bruh. And it’s ironic because your name is Muhamed.", "label": 1}
{"text": "Quick reddit comment search confirms my suspicions\n\nhttps://i.imgur.com/b2g82qr.png\n\nFour years (at least) of complaining about the Lakers getting help from the refs\n\nWarriors get 40 FTs: “uhh we deserve it actually”\n\nTruly the prototypical NBA fan", "label": 1}
{"text": "How to be with a guy like him? Dog wtf", "label": 1}
{"text": "Get it out ya mouth nephew 😭", "label": 1}
{"text": "I’m defending the principle. I don’t know about that guy, haven’t read a word of his work beyond this quote. There’s a problem with having a low iq (folks like yourself), where you get mad at somebody and justify things that, if applied in practice in society, would destroy it. Make the world a shitty place. It’s bad to shove people for offending you. I’m not saying I don’t feel for Embiid. Never felt what he did in that moment. But it’s if anything a moment of weakness", "label": 1}
{"text": "There's such a thing as nuance, troglodyte. What the reporter said is wrong, but that does not justify violence.", "label": 1}
{"text": "Just saying that if he assaulted the reporter who brought up his dead brother, I’m all for it and think he should be able to assault the reporter again lol", "label": 1}
{"text": "Embiid is a pu$$y", "label": 1}
{"text": "Depends on how the brother was mentioned. I don't think covering family is off-limits, it requires more context before we know who was in the wrong.", "label": 1}
{"text": "A brilliantly funny thing to clown Embiid for was ruined by the fact I want him to hit the guy again", "label": 1}
{"text": "As strict as your no pussy policy? I think context matters", "label": 1}
{"text": "They sometimes do. Not often, but sometimes. \n\nThere are certain people who will use words to hurt not just you but your loved ones and they will be in such a position where normal methods of preventing them from doing so don't really work. In such cases, a punch in the face can be the right remedy. People who use such tactics often do because they know they are protected and a simple punch shatters that perception.  \n\nViolence in not the answer in most civilized environments. Not all of them, tho. Blindly avoiding any violence can lead you to becoming a victim and invite further abuse.", "label": 1}
{"text": "karma farming weirdo", "label": 1}
{"text": "yeah sorry for expecting emfraud to act like a grown adult and not get triggered by an article rightfully calling him a bum 🤣bet he injured his knee with that shove and he’ll play even less", "label": 1}
{"text": "Well too bad it is just a shove then. That dude deserves to get punched real hard om the face.", "label": 1}
{"text": "Deserved way worse than what he got", "label": 1}
{"text": "That's literally all he said. People here, especially sixers fans, are making up their own stories and making out like the reporter literally accused Embiid of shaming his dead brother for not playing. We see this so often on reddit, the pitchfork waving, hive mind mentality....you got posts in the sixers sub calling for the reporter to be killed. It's collective insanity.", "label": 1}
{"text": "Blackballed? He deserves a fucking black eye on that", "label": 1}
{"text": "Get off his nuts bro, all you do on here is complain about Shai", "label": 1}
{"text": "Honestly, embiid showed a lot of restraint with just a shove.", "label": 1}
{"text": "Embiid shoulda beat his ass", "label": 1}
{"text": "All he does is flop", "label": 1}
{"text": "It doesnt make you an asshole to oppose violence and threats over mere words. And the words werent even offensive to his dead brother at all, people act like he was dancing on his grave.", "label": 1}
{"text": "theres a reason philly is a shit hole. good on Embiid", "label": 1}
{"text": "You’re one stupid fuck aren’t you?", "label": 1}
{"text": "But Embid himself said when you talk about his life you HAVE to talk about his brother…", "label": 1}
{"text": "Bunch of rubbish right here. You don’t like the words someone is using just leave weirdo. Embid is a public figure who has publicly said you cannot talk about his life without talking about his brother.", "label": 1}
{"text": "Context matters. Are you dumb?", "label": 1}
{"text": "I think you knew the answer to that before you asked it", "label": 1}
{"text": "It would have been rude of me to assume.", "label": 1}
{"text": "So you think he is failing at leaving a legacy for the people he specifically and publicly stated he was leaving a legacy for? Really crappy thing for you to say about Embids family.", "label": 1}
{"text": "Get off his dick bozo. Commenting the same shit over and over.", "label": 1}
{"text": "Yeah,  a former child actor befriending and mentoring a current child actor under the supervisory of her parents sounds really sus.", "label": 1}
{"text": "Drake’s not even a true raptors fan, \n\nhe was hopping to each new nba championship teams in finals game every June. \n\nDrake is the definition of fake.", "label": 1}
{"text": "Ok racist", "label": 1}
{"text": "Embid should stomp on his head like he did with Grant.", "label": 1}
{"text": "It's not Halloween anymore. You can take off the clown outfit", "label": 1}
{"text": "100%. He should absolutely follow through on this threat and live with the consequences", "label": 1}
{"text": "Yup, because mentors texting their mentees \"I miss you.\" and \"I can't wait to see you.\" is totally normal behavior.\n\nLike come on, at least acknowledge how weird it is.", "label": 1}
{"text": "Bout to see a ngannou ko and an absolutely deserved one", "label": 1}
{"text": "You gotta have the worst comprehension, and the thickest skull of anyone in all these threads.", "label": 1}
{"text": "You can miss people, yes you're allowed. Michael Jordan said that he misses Kobe I promise you that it is perfectly okay.", "label": 1}
{"text": "There's dudes in Philly who wouldn't hesitate to hunt a man down and break his legs for a hundred bucks. Embiid knows people who know people.", "label": 1}
{"text": "As a passionate embiid hater. I 100% agree. That reporter is a fucking cunt and Embiid you should have punched him rather than “shoved” him.", "label": 1}
{"text": "Question have you lost a brother??. Or any family member. Emotions run VERY HIGH and its just a shove I would have punched the guy", "label": 1}
{"text": "After reading what Hayes wrote, absolutely go get him Embiid. \n\nFuck these reporters thinking they can cross those lines. How disgusting of a human do you have to be to criticize the memorial of Embiid’s late brother to make a point about LOAD MANAGEMENT. \n\nThese kinds of NBA Twitter pilled losers need to touch grass. You’re not important.", "label": 1}
{"text": "I hate that society evolved like this, and reporters are protected like polar bears. Legitimately worst scum of planet Earth are those people. You have to be a massive piece of shit to be a successful reporter. I hope Embiid beata the shit outnof this mofo", "label": 1}
{"text": "Fuck it, shoulda hit him. That’s some bullshit to say that.  \n\nTo invoke the death of his brother - which he has publicly spoken of as referenced by this idiot - is classless and reeks of being performative to be provocative. To tap someone’s pain like that. It’s like an emotional raw nerve for some. \n\nIt’s so unneeded it feels intentional.  Fuck it. Take the suspension and rest your knee some more.", "label": 1}
{"text": "If I’m Embiid gotta be smart about this. Hire some goons to break his legs", "label": 1}
{"text": "I hate that attitude. Yes, asshole, I will hit you.", "label": 1}
{"text": "thug behavior ", "label": 1}
{"text": "Hope to see a vid of the altercation. The reporter def deserved some pushback from what he said about Embiid’s family", "label": 1}
{"text": "You're right, he shouldn't have shoved Hayes.\n\nUntil Hayes was in front of a 3rd story window.", "label": 1}
{"text": "Embiid shouldn't have shoved him, until they were on a balcony", "label": 1}
{"text": "Someone in Philly should just do it for free. It's almost Christmas, time to do a good deed for Santa.", "label": 1}
{"text": "I hate Joel and the Sixers, but I would have been completely okay with Joel knocking Hayes out here. Such a piece of shit.", "label": 1}
{"text": "It's just funny how there are zero zero zero footage of any white people acting nuts. Besides Depp being recorded. It's hilarious to see video after video of 12% of a population. God bless America", "label": 1}
{"text": "Actual demon lmao i wish he socked em", "label": 1}
{"text": "I'm killing", "label": 1}
{"text": "Well there's a difference. I'm applauding Embiid here, and still want Draymond hanged the Poole punch", "label": 1}
{"text": "You can be technically correct and fully stupid at the same time", "label": 1}
{"text": "You never thought that maybe that 14 year old could have been a big fan? Yall love to say bro makes music for young women, so when one is a celebrity and asks to text + get advice, idk why you 100% know they are fucking. Like I said, I can tell you’re secretly hoping dudes balls deep in a 8 year old right now… that’s how much you hate a celebrity yet, you’re calling me weird.", "label": 1}
{"text": "Most disgusting basketball fan I've seen. There's no humanity within you, no one will sympathise with you when you lose your loved ones with your shit attitude.", "label": 1}
{"text": ">If Drake put out a diss track on DeRoz, the entirety of the 213/323 would be on their way to Toronto.\n\nGood luck to all of them getting past the border with their criminal history.", "label": 1}
{"text": "r/whitepeopletwitter is even worse", "label": 1}
{"text": "> hell, even most denver fans are on embiids side\n\n\nnot your team sub", "label": 1}
{"text": "If Embiid attacking a reporter (deservedly) is the thing that turns the tide on r/nba's opinion of him it would be the funniest shit", "label": 1}
{"text": "You are a gross person.", "label": 1}
{"text": "Ah, so the good people of those areas are gonna go drive all the way up to Toronto and engage in criminal activities? Way to criminalize a whole 2 neighborhoods!", "label": 1}
{"text": "Do you not know what area codes are? \n\nIt's ok man, we see you. We know what you are.", "label": 1}
{"text": "Kendrick is a dork. Got bullied in high school and his baby momma is ugly as dog shit", "label": 1}
{"text": "Yeah, and we know what you are... A man waiting to win with DeRozen and my friend that ain't happening.", "label": 1}
{"text": "Yeah, definitely make it about the woman, not the man who constantly air dicks and within the last 72 hours pretended to fellate a microphone during a rally. That makes sense.", "label": 1}
{"text": "Sucking Willie Brown’s, Brown Willie", "label": 1}
{"text": "Pedo sympathizer ^", "label": 1}
{"text": "its less mickey mouse than lebrons last ring", "label": 1}
{"text": "Bruh I don't even like Drake but what is he supposed to do when a supposed friend just jumped on stage *and* on the music video of a hit song calling you a pedo? Lmao, come on man.", "label": 1}
{"text": "If it were done pro bono the league would never be able to connect it to Joel in an investigation either, two gifts in one", "label": 1}
{"text": "Maybe don’t be an asshole pedo?", "label": 1}
{"text": "lol i don’t even like drake but you make a valid point", "label": 1}
{"text": "You're missing the point out of a need to be performative. What DeRozan did was stick the boot in, in front of a national audience, regardless of whether the accusation was true or not.\n\nAnd if he's a pedo - which hasn't been proven, matter of fact, the only thing proven is he's one of the few rappers that Diddy didn't fuck with - then fuck him.", "label": 1}
{"text": "Man’s defending a grown man kissing a 17 year old fuck bro you actually might be a pedo, I’m outta here.", "label": 1}
{"text": "Chronically online people of reddit will never understand lmao. Not everything is a meme that disappears in 3 business days.\n\nAgain, not defending Drake the person nor the rapper, but what kind of reaction did people actually expect from him? To clean DeRozan's Kobes after the game?", "label": 1}
{"text": "Ngl you’re gunna get shit on for defending Drake (would even really call it defending, just kinda telling the truth of the story), but I agree with you.", "label": 1}
{"text": "“Proven”—MFer Drake fucking rapped about it. And then there’s Millie Bobby Brown. This is like arguing with someone that Trump isn’t a fascist.", "label": 1}
{"text": "facts lol", "label": 1}
{"text": "Yeah the woman who slept her way to the top. Seems pretty apt to me", "label": 1}
{"text": "I read “DeRozan” as “Degrassi” lol", "label": 1}
{"text": "I'm not surprised lmao, so many people who don't even follow rap that way have an opinion on this feud. But in any case, it feels common sense to me that Drake wouldn't be cool with DeRozan after jumping on stage and the music video to a diss track against him.\n\nI don't know man, maybe these people are cool with people who throw shade at them in their 9-to-5s lol", "label": 1}
{"text": "OK now you're making me want to ask you \"what do you think are the at least 3 most important characteristics of fascism? (10%)\"", "label": 1}
{"text": "lulz, you’re in the Drake echo chamber. I’m in literally the rest of the world. Touch grass, bro.", "label": 1}
{"text": "You got Google, ain’t ya?", "label": 1}
{"text": "Drake is a pedo though", "label": 1}
{"text": "So... no examples then?\n\nJust like your idol, Trump.", "label": 1}
{"text": "> incels assume she slept her way to the top.\n\ngod do you dweebs ever get tired of using that lame insult every single time?", "label": 1}
{"text": "If there was any side DeRozan was going to take, it’s Kendricks. Dude is from Compton lmao if Drake didn’t see that coming, then he’s delusional.", "label": 1}
{"text": "Leave it to reddit nerds to ride kendrick 24/7", "label": 1}
{"text": "I mean, do you fuckwits really think this is what I'm arguing for or against? It goes without saying that *regardless* of what the truth is, DeRozan very publicly stood against him. What kind of reaction did people expect?", "label": 1}
{"text": "Ur an idiot", "label": 1}
{"text": "Dude is from Compton but Drake is - or at least was - his friend.\n\nWe can do the whole West vs East coast thing here, but DeRozan was the one who inserted himself in the feud lmao. You don't get to be mad at facts.", "label": 1}
{"text": "You're seemingly being very emotional over your defense of a fucking pedophile trying to act like he's hard in a public televised arena.", "label": 1}
{"text": "Just hot air. Coming from the person who replied to me first. Got it.\n\nNo facts.", "label": 1}
{"text": "lulz, I don’t take tests anymore. You know, because I’m not a nephew. Sit down. Be humble.", "label": 1}
{"text": "Don't make him bring out Wheelchair Jimmy", "label": 1}
{"text": "Bro thought it's his own bars\n\nI don't give a shit about Drake, and everybody knows what kind of person Trump is after all this years anyways. But I'd never let go of any chance to make fun of people who treats the word \"fascism\" as Russ treats his three balls, not knowing shit about it while throwing them around like idiots.", "label": 1}
{"text": "*Yawn* cool story, stable genius.", "label": 1}
{"text": "Sure thing, lil buddy", "label": 1}
{"text": "Kobe is a rapist and everybody liked him too.", "label": 1}
{"text": "Now that story time's over it's time to sleep baby boy, xoxo", "label": 1}
{"text": "You finished yet?", "label": 1}
{"text": "Ahh, of course you’re a Zionist", "label": 1}
{"text": "Where are these examples, brotherman? Still waiting.", "label": 1}
{"text": "But derozan went on a podcast and said him hopping on NLU wasn’t serious and that him and drake are still friends so clearly he didn’t think the accusations have any substance lol", "label": 1}
{"text": "You’re yapping", "label": 1}
{"text": "Yes. If you ever put up a 15 year old girl in front of me I would pull her pants down. That’s the answer to your question. Is that what you were gonna ask? Oh, okayyy 💅🏻", "label": 1}
{"text": "You can die waiting, bro! It’s funny you think I owe you anything.", "label": 1}
{"text": "You are absolutely insane.  If someone talks shit about my dead brother for their own well being and straight up being disrespectful I’d break their collar bone.\n\nThis is what’s wrong with society.  People defend scumbags who say whatever they want and condemn any physical altercation.  It’s put the wrong type of people in the right and ruining society", "label": 1}
{"text": "If that reporter hack wrote that for my family, he's head is getting caved in. You can criticize his game all you want but draw the line on family matters.", "label": 1}
{"text": "I need upvotes fam to fed my kids. I don't get millions of dollars like Embiid for doing nothing ;)", "label": 1}
{"text": "Stfu bitch", "label": 1}
{"text": "You are jealousy as fuck", "label": 1}
{"text": "gradey dick spins for the camera", "label": 1}
{"text": "You know zero about American politics. Don’t be racist bogan clown. Dog.", "label": 1}
{"text": "I live here goofball", "label": 1}
{"text": "you would know", "label": 1}
{"text": "says the redditor from his basement lmao", "label": 1}
{"text": "I said what I said.", "label": 1}
{"text": "I’ve also lived in Australia and I know they think like you and slander like you. Moved to Brisbane the week Trump won in 2016. Should have heard what they said about Hilary. I can only imagine it being worse with Kamala cause she’s a minority. Most ignorant, racist group of people I’ve ever met. Funny part is they don’t  know enough to know that they don’t know enough.", "label": 1}
{"text": "alright bro where’s the hard drive", "label": 1}
{"text": "Yeah, I think it could be his breakout season for sure; he’s really stepping up and showing his potential!", "label": 1}
{"text": "The whole thing.", "label": 1}
{"text": "Jokić is just on another level right now; if he keeps this up, MVP is pretty much his for the taking!", "label": 1}
{"text": "Lmao, the dude really said, \"It's funny you think I can't just make shit up without evidence.\" This is his \"gotcha\" moment.", "label": 1}
{"text": "Common Celtics fan behavior.", "label": 1}
{"text": "Flair up there, champ. Or are you just another pedo dickrider? You *are*, aren’t you? Freaky MFer.", "label": 1}
{"text": "Kobe’s case was very he said she said, and a lot of the evidence pointed to her being the liar. \n\nDoesn’t mean he didn’t do it. But he was accused of sexual assault - and there wasn’t physical evidence to support it. \n\nAnd we live in a country that says innocent until proven guilty, and he wasn’t proven guilty in a court of law.\n\nIt’s actually entirely different than in DV cases that have physical evidence, and in some cases the player has been convicted. (Bridges for instance)", "label": 1}
{"text": "You not like us.", "label": 1}
{"text": "Therapy my man.", "label": 1}
{"text": "Over this? lulz, you guys stick together. Keep white knighting, bro. Enjoy!", "label": 1}
{"text": "you dont need therapy you def need reading comprehension though", "label": 1}
{"text": "Cool story.", "label": 1}
{"text": "Flair up, coward.", "label": 1}
{"text": "It really work for him. Looking at his career now he is booming on OKC.", "label": 1}
{"text": "Don't know what you are about, but we of course demonstrate that Trump checks many points of fascism theory.", "label": 1}
{"text": "By the events he admitted, it was rape. He made his statement as part of an agreement that it wasn’t a guilty admission, but let’s be clear that by HIS statement of what occurred, it meets the definition of rape. Kobe Bryant was a rapist.", "label": 1}
{"text": "Looks like Vince is just relieved he didn't get a statue. Can you imagine? 😂", "label": 1}
{"text": "the statement he had to say just to get the case over with", "label": 1}
{"text": "She never verbally consented and had serious bruise marks on her neck. You think she consented to being straggled too? Kobe Bryant was a rapist. ", "label": 1}
{"text": "A whole lotta mindless yapping.", "label": 1}
{"text": "Mmhmm. Shoo.", "label": 1}
{"text": "You guys don’t seem to have conversations in good faith on the internet, just an observation. I have no real opinion on the issue tho", "label": 1}
{"text": "You still yapping?", "label": 1}
{"text": "You definitely like em young, don’t you?", "label": 1}
{"text": "Ive been on here when people have been arguing that he isn’t a rapist but ‘close’ so it’s funny to see you guys getting downvoted today for saying essentially the same thing lmao", "label": 1}
{"text": "So you think the case ended because Kobe and his lawyer had too much evidence to prove him not guilty but instead chose to have Kobe write a letter where he admits to rape? Wow, Kobe needed a better lawyer fr.", "label": 1}
{"text": "You’re just a Lakers fanboi lol", "label": 1}
{"text": "so what was the stuff with her going around bragging about sleeping with Kobe? i’ve seen that brought up a lot", "label": 1}
{"text": "How a bich going to kick you out the house you paying for , I know she not paying for that big ass house", "label": 1}
{"text": "What's the game? Ignore every question directed my way? From what I see you're the 🐐 in this game", "label": 1}
{"text": "Rapist my ass ...she had semen stains from multiple donors in her panties.", "label": 1}
{"text": "I like both of them. \n\nIt's you fake anti socials no one likes", "label": 1}
{"text": "Hyper sexuality and trying to “claim” the rape to avoid being a victim are not rare responses to rape.", "label": 1}
{"text": "okay. i see the facts of this case represented very differently based on subreddit so i was just curious what your response to that would be. it’s usually the Kobe sides proverbial killshot and i don’t know enough about the case to dismiss it", "label": 1}
{"text": "this goes hard 🔥🔥🔥", "label": 1}
{"text": "During the trial he admited he liked to choke women who aren’t his wife. Nothing problematic there. He definitely got consent for that every time. /s if that wasn’t painfully obvious.\n\nHis initial statement was actually that they never had sex, so he’s clearly providing a reliable narrative. Even if that is an accurate recount of the encounter, consent can be revoked at any moment, but it’s hard to do that while being violently penetrated and choked from behind, because that 100% happened.\n\nInnocent people with piles of evidence always issue apologies admitting to rape and settle civil suits for millions of dollars.", "label": 1}
{"text": "Should have punched him tbh", "label": 1}
{"text": "Same with D rose, even if you ONLY go by his testimony he raped a woman.", "label": 1}
{"text": "Legal consent requires explicit consent. Kobe didn't get that. It's legally indefensible.\n\nIt's also not just about consent to have sex. Consent can be fluid, meaning that someone who initially initiates or seems receptive might change their mind or have different boundaries during the encounter. The girl could have non-verbally consent to have sex and not consent to being strangled.\n\nEspecially someone in his position, Kobe should know that he has to get clear, expressed consent and both parties have to come to a mutual understanding or established comfort level and boundaries. It's also not a one time question--someone in his position need to ask the partner through out sex if they are still comfortable with where things are going, if this is okay, if they want to keep going, etc.", "label": 1}
{"text": "Lollll", "label": 1}
{"text": "TIL you don’t understand the verbiage of his apology and never admitted to rape and was never found to have raped. \n\nIf you truly followed the story at all it was obvious the woman was unreliable and had tried to get money out of other celebrities in the same fashion.", "label": 1}
{"text": "I mean you can. But Drake has felt very fake his whole career, is corny, and is a pretty bad person. He also doesn’t write his own shit. Drake is cringe.", "label": 1}
{"text": "Cool you made hating Drake your personality, what's it done for you? \n\nDrake's been lauded by many top tier artists as having a great pen and having wrote for many top tier artists. You got a small handful of songs others write pieces of so now he doesn't write his own shit? \n\nYou corny, cringe and crying bro", "label": 1}
{"text": "Bro go touch some grass. Having an opinion is not close to the same thing as making it your whole life. Grow up", "label": 1}
{"text": "I already said Kendrick won and Drake lost. What are you crying about? \n\nWhat's this huge hit he took? His streams are literally up and he's the most streamed artist all year.", "label": 1}
{"text": "Y'all really just say the same dumb shit to every comment huh? \n\nLeave your lonely ass room and go talk to an actual girl tomorrow. We both know you don't got it in you.", "label": 1}
{"text": "In an 8 year relationship homie. Nice projecting though", "label": 1}
{"text": "Yikes no ring you and Kenny got so much in common. \n\nShe gone buddy", "label": 1}
{"text": "Drake fans are all the same thanks for the laugh and the good start to the day 🙏", "label": 1}
{"text": "Yeah I figured this was the only positive thing you had going", "label": 1}
{"text": "So salty. Want some fries?", "label": 1}
{"text": "Go spend time with your girl bro. Or she \"out\" again?", "label": 1}
{"text": "I couldn’t even find it in the two columns", "label": 1}
{"text": "Some astral level projecting by this guy. Gotta love reddit", "label": 1}
{"text": "Everybody in eagle county knows that woman and say shes a compulsive liar and made it up", "label": 1}
{"text": "You got your cape on and everything huh? \n\nLeave your room and go talk to a girl too. You guys get wing man each other awkwardly", "label": 1}
{"text": "Or she knew that the video/audio is recorded plus she probably is an actress...there are so many factors....", "label": 1}
{"text": "r/redditmoment", "label": 1}
{"text": "He should have punched him… get suspended and an excuse to not play", "label": 1}
{"text": "You lame baby girl", "label": 1}
{"text": "She's definitely the divorced single mom with teenagers who fucks every 21 year old their first time at the bar.", "label": 1}
{"text": "Not Drake fans using Drake's sames disses towards Kendrick on Kendrick fans 😂\n\n\nBut I guess writing their own stuff was never their strong suit", "label": 1}
{"text": "Lame ass reply", "label": 1}
{"text": "No.", "label": 1}
{"text": "Figured", "label": 1}
{"text": "🤣", "label": 1}
{"text": "Take your politics elsewhere", "label": 1}
{"text": "'I understand!!!'\n\nProceeds to state exactly why you don't understand. \n\nYes, the thunder are legit contenders and are expecting to make the finals. But if they don't, they have enough assets to immediately retool with essentially no rebuild needed. Like the other poster said, this is a measure of 'win or bust'. If they don't win, they don't bust. In fact the thunder are in a better position to rebuild than most currently rebuilding trans AND are legit contenders. That is extraordinary. Them being in the 'bottom' 5 of this list isn't a knock", "label": 1}
{"text": "When /r/nba sides with Embiid you know they fucked up", "label": 1}
{"text": "You can't just assault people for words and expect that you're in the clear, stupid", "label": 1}
{"text": "> my sweet summer child\n\nwhoever talks like this deserve a beating irl", "label": 1}
{"text": "So this could be a violation of his NBA contract and can be waived and voided without hitting Lakers cap.\n\nRob is about to get an open roster spot without sending assets.", "label": 1}
{"text": "He victim of what? Using dead family members to stir shir up and get the consequences of your actions? Should've got his teeth kicked in", "label": 1}
{"text": "I want to punch this guy in the face, let alone Embiid. What a loser.", "label": 1}
{"text": "You’re dumb as fuck. Good luck.", "label": 1}
{"text": "True. Also true that Embiid bring his dead brother over and over seeking empathy. Of course people will respond to that.", "label": 1}
{"text": "Beat his girlfriend", "label": 1}
{"text": "He’s in his dodging accountability era smh", "label": 1}
{"text": "Not glazing u fanned out bitch", "label": 1}
{"text": "I can't tell his skin color from this ass quality video so I'm not sure if that's racism", "label": 1}
{"text": "Legally, it is most of the time. This is one of those times.\n\nEmbid can break the law if he wants. He'll pay the price for it.", "label": 1}
{"text": "Brook Lopez is a piece of crap", "label": 1}
{"text": "He just shoved him that’s not even like a punch. I hate the online era of sticks and stones actually hurt you but words never can. Reporters do way more damage with their words.. think of it like this the shove Embiid gave him compared to the shit he faces in the post? Reporters dish it but can’t take it. Calling a man soft and not honoring his dead brothers name cause he can’t “play through” something when he was literally risking his eye sight and ability to walk in the future while the reporter sits behind his desk eating Cheetos is crazy. Get your head outta your ass", "label": 1}
{"text": "Westbrook can't shoot, can't pass without turning the ball over 10 times a game, can't finish at the rim (he gets there but he's got an awful touch), doesn't play defense but he's got an insane usage rate and plays on a team that were the NBA champions 1.5 years ago. I think there is room for Fultz maybe not on the Nuggets but he can defo get PT on the Pelicans rn. Is he much worse than Jose Alvarado? I don't think so", "label": 1}
{"text": "i've never seen this move since Michael Jordan. Now this is art.", "label": 1}
{"text": "This is where James harden learned.", "label": 1}
{"text": "sweet alleyoop!", "label": 1}
{"text": "really giannis?", "label": 1}
{"text": "Tyler Herro.  ", "label": 1}
{"text": "Hot take incoming, losing a legit mvp candidate would probably be bad for the team.  ", "label": 1}
{"text": "why do big guy punched him right away? that's trash mentality.", "label": 1}
{"text": "time to enjoy the rest of your life with family DJ", "label": 1}
{"text": "Man, seriously all of the players in the team contributes. obviously, if Tatum is not around then probably the team would not be placed on where it is now.", "label": 1}
{"text": "caption is wrong, CP3 finding his strength.", "label": 1}
{"text": "but rarely did.", "label": 1}
{"text": "Cunningham got em.", "label": 1}
{"text": "that's some really bad news!", "label": 1}
{"text": "he's truly hilarious!", "label": 1}
{"text": "funny how jokic trolls them.", "label": 1}
{"text": "That's not his alias.  Say it again", "label": 1}
{"text": "The reason why i love him.", "label": 1}
{"text": "Lets go paul george!", "label": 1}
{"text": "now this is painful.", "label": 1}
{"text": "PG is back!", "label": 1}
{"text": "Looks like Marcus Hayes just found out the hard way that Embiid's not just a powerhouse on the court! 💥", "label": 1}
{"text": "Lmao. You're claiming you knew Shai was going to be an MVP caliber player and that Kawhi and PG wouldn't work out before the trade was made? No. You didn't. You're using the benefit of hindsight to act like you're some basketball prophet. Embarrassing.", "label": 1}
{"text": "that's a classy spin move finish.", "label": 1}
{"text": "Holy fuck we almost witnessed a mascot getting fucking lynched at a basketball game", "label": 1}
{"text": " can't imagine if he died try to make everyone happy.", "label": 1}
{"text": "that's unsportmanship!", "label": 1}
{"text": "Where have i not been consistent? You haven’t even had a conversation with me on anything, how do you know how i feel about it? You keep bringing up Kobe like I’ve been in here defending that lol.", "label": 1}
{"text": "No lil dummy, there are hella articles written about it. Go suck your man off elswhere, y’all are all weird af", "label": 1}
{"text": "Ps pick a new fam base base goofy, cleveland dont fuck with pedos!!! ", "label": 1}
{"text": "is this a coincidence? am i dreaming?", "label": 1}
{"text": "Just a bunch of big ol women wit fistfuls of churros", "label": 1}
{"text": "Who gives a fuck, he's on our team and he's playing well.", "label": 1}
{"text": "Hamas is a liberation org, the \"good guys\". Darvin Ham is a basketball terrorist", "label": 1}
{"text": "Leader of Ball-Qaeda", "label": 1}
{"text": "That’s why you said “didn’t know we hated him” yeah ok", "label": 1}
{"text": "It’s basketball. The NBA rewards acting like a pussy now", "label": 1}
{"text": "Glad to see him still playing basketball! I miss their trio in Spurs Manu, Tony and Tim", "label": 1}
{"text": "What a soft ass midget getting checked by a white boy get yo ass the court bum", "label": 1}
{"text": "Honestly, I don't really like the fact that information got leak out ", "label": 1}
{"text": "Prince of Pockets", "label": 1}
{"text": "It’s funny, I felt the same way after reading the responses ITT. \n\nY’all crying for this lil weasel like something significant happened to him", "label": 1}
{"text": "Does anyone have a pdf or link to the original article? I'd like to read it myself, before I react to it based on other's reactions.", "label": 1}
{"text": "Bro, are you being serious?", "label": 1}
{"text": "It's ok. Yea, he overreacted. If he got hit in the ribs like the guy says, the Pelican player pushing him away at the chest/ribs would've hurt him. But it didn't. Then, his teammates wraps him up around his ribs as they walk away. Again, Alvarado doesn't even wince.\n\nIt's all show, but he shouldn't have gotten hit like that.", "label": 1}
{"text": "Wrong? No, noy at all. Can you tell us more about how he was feeling while desperately gasping for an ounce of oxygen, and he was making every effort to get back on his feet?\n\nQuite a heroic performance.", "label": 1}
{"text": "Neither am I, yet you choose to defend a pedophile with all your heart 😂", "label": 1}
{"text": "Yeah dummy, i actually can READ and not just watch videos like you all 😂i know y’all struggle with comprehension ", "label": 1}
{"text": "The games I’ve watched from him he looks like a no iq player", "label": 1}
{"text": "W no PG out there he cannot do anything he gets doubled and gives the ball up right away", "label": 1}
{"text": "Did you see the Pelican player hold him back by putting his hands on his ribs or his teammate wrapping his arm around his ribs without a wince from Alvarado? So out of breath that he couldn't stop talking about a few seconds later.\n\nBut tell me more about how it was like MMA... overdramatic child.\n\nEdit: Same energy, but keep falling for the game - https://youtu.be/yV-yo9EYI1E?si=Rf2M2LHxMEw8ASx7", "label": 1}
{"text": "Every American thinks words justify violence lol. You can see it in how they vote.", "label": 1}
{"text": "Agree, a light shove only? Should've beat him down.", "label": 1}
{"text": "He was good enough to start for the Spurs too; he was their third, arguably second, best player.  He just came off the bench because that's what was best for the team and Pop's rotation", "label": 1}
{"text": "Lol, i played football for years, not that it matters. You aren't making points here, your just a douche.  You clearly have either no clue what you're talking about or you're too stupid to have an actual point so you're just trolling. Either way,  get help. Maybe go outside.", "label": 1}
{"text": "Lol,  so you think insulting me is going to make me think I'm wrong? You're just frustrated because you want to be right, but you aren't.", "label": 1}
{"text": "Damn.  Get well soon Pop.  ", "label": 1}
{"text": "He’s not a victim, shut the fuck up.\n\nJust because he experienced negative consequences of his actions and that those were violent in nature doesn’t make him a victim. \n\nVictims are people that are preyed on by other people, not someone who goes out of his way to instigate shit with people and then act like their reaction (if a bit extreme) comes out of left field. Dudes a dickhead not a victim.", "label": 1}
{"text": "Id love to see Roy Keane snap your leg in half", "label": 1}
{"text": "Vaxxed?", "label": 1}
{"text": "Dumbass American trailer trash", "label": 1}
{"text": "God has other plans homie.", "label": 1}
{"text": "Can’t even win gold at basketball 😔😭", "label": 1}
{"text": "At least we don’t need to naturalize French whiny little bitch to win", "label": 1}
{"text": "Can’t hear you from up here", "label": 1}
{"text": "Man, you really like violence don't you? First saying that elbowing people should be allowed, now saying that assault over words is justified?? You need some anger management homie", "label": 1}
{"text": "Good riddance Bitch!", "label": 1}
{"text": "You know he's gon have some ferocious ass dunks niggan", "label": 1}
{"text": "Hell yeah Buckus\n\n12 and you can get a little Columbian bam-bam", "label": 1}
{"text": "2016 haunts me and not for basketball reasons", "label": 1}
{"text": "\nI honestly love it. I love high octane offense but\n\nThe League Offense is gonna keep growing and grow to such an unprecedented level the owners will be forced to find something that handicaps the offense again for a few years.\n\nWonder how far they’ll let the offense swell.", "label": 1}
{"text": "The media calls Drake a pedophile.\n\nWhat the media did was get a bunch of actual criminals and rappers together in Los Angeles to call Drake a pedophile on stage.", "label": 1}
{"text": "and the USPS never fails, right?", "label": 1}
{"text": "Dr. Dre is a criminal, one might even call him a pedophile. Many gang members are criminals. These are facts. I’m sorry if that bothers you. \n\nIt’s not too much to understand. “The culture” has had countless opportunities to come together and stop the violence and unite, but they choose to do it when Kendrick Lamar called Drake a pedophile. \n\nIf it takes the alleged downfall of a major contributor to “the culture” to bring “the culture” together, I don’t know what we’re doing here.", "label": 1}
{"text": "You should take some more cheap shots to the ribs.", "label": 1}
{"text": "You gone be the one to do it? Don’t make threats if you’re not going to follow through", "label": 1}
{"text": "Couldn't be that he's the greatest player of this generation. Dumbass he had insane net rating playing with Facu and Company.", "label": 1}
{"text": "Yea I hate redditors because you can't read. Doesn't seem complicated to figure out tbh \n\n\nI like how after me and the other dude told you why you just decide to completely move the goalposts and disregarded every point. Have a good one squirt", "label": 1}
{"text": "Small town fans are usually like that though", "label": 1}
{"text": "He also plays more than any other star clownshow. Check per minute stats with 2 or fewer starters and he grades out the same as any other player.", "label": 1}
{"text": "What a strong finish!", "label": 1}
{"text": "though he was gonna dunk it.", "label": 1}
{"text": "what a nice left handed slam!", "label": 1}
{"text": "crossover and a beautiful three.", "label": 1}
{"text": "This is why i love tatum!", "label": 1}
{"text": "Big man finish!", "label": 1}
{"text": "saw it but happened so fast.", "label": 1}
{"text": "appreciated the block from stewart.", "label": 1}
{"text": "Players evolved now in the NBA they be shooting more than 7 meters from the ring.", "label": 1}
{"text": "FLASHY JA! NBA IS INDEED THE MOST ENTERTAINING LEAGUE IN THE WORLD!", "label": 1}
{"text": "Golden state's beautiful team work.", "label": 1}
{"text": "Dame is on fire!", "label": 1}
{"text": "that's smooth from Al", "label": 1}
{"text": "this is why i love NBA!", "label": 1}
{"text": "poole and curry exchanging answers.", "label": 1}
{"text": "impressive Ivey.", "label": 1}
{"text": "i could say ivey really had a different night.", "label": 1}
{"text": "this is a once in a lifetime moment and a very rare achievement.", "label": 1}
{"text": "this is hilarious!", "label": 1}
{"text": "nice double cross!", "label": 1}
{"text": "I haven't been plugged into the Lakers fanbase but usually the knock was that he couldn't be the number 1 on both ends of the floor all year for a contender _and_ stay healthy", "label": 1}
{"text": "A shit sandwich is smarter than you. (in my opinion)", "label": 1}
{"text": "I love when dumb ass dudes on here say stupid ass shit and when they get called out all they can come back with is “dick rider” grow tf up kid.", "label": 1}
{"text": "what a strong core!", "label": 1}
{"text": "thought they gonna have a fight.", "label": 1}
{"text": "were rivals now!", "label": 1}
{"text": "Our commentary is nowhere near the worst", "label": 1}
{"text": "PG getting back now!", "label": 1}
{"text": "Mark Jones is elite. Kayte, if I wasn’t a kings fan I would hate her, but it is a local broadcast so she should be a homer", "label": 1}
{"text": "Drapes does the games when mark is out. He’s not the best, but he’s a great guy lol", "label": 1}
{"text": "Or atleast call the obvious ones. Sabonis does it too, but he’s found a way to make it seem like he’s trying to roll when he’s really just setting a moving screen. Bam just straight moves with the defender", "label": 1}
{"text": "How fat is Harden now??", "label": 1}
{"text": "People can hate Allen for previous flagrants all they want, and the flagrant is probably the correct call just cause the knee could have seriously injured him, but there's literally no way he could have made a .2 second decision to purposefully knee him in the head after he got faked out. It was an accident and it's ignorant to say otherwise.", "label": 1}
{"text": "Bro he’s done some real dumb shit on the court but if you compare him to bridges or Kobe you’re an idiot", "label": 1}
{"text": "He is one with the ball\n\nCuz he fat", "label": 1}
{"text": "So punching a girl in the face or raping someone is just as bad as what Draymond did? Yeah you’re an idiot", "label": 1}
{"text": "If you think one man punching another man is the same as hitting a woman 100lbs lighter than you….yeah you’re an idiot", "label": 1}
{"text": "If you simply use the law as your moral compass, yes you’re an idiot", "label": 1}
{"text": "Not running plays for him in crunch time was a missed opportunity.", "label": 1}
{"text": "His ability to create his own shot is just insane; pure skill.", "label": 1}
{"text": "The other angle of this would’ve made this thread pop. This angle doesn’t do a great job of him cocking it back like a dunk before hitting the 360", "label": 1}
{"text": "I didn’t delete anything. You’re saying what dray did was as bad as Kobe or bridges. That makes you a moron. Simple", "label": 1}
{"text": "this is why i love James Harden.", "label": 1}
{"text": "really sweet!", "label": 1}
{"text": "Pickleball Legend...", "label": 1}
{"text": "In the WNBA sub you get called racist for saying players should trim their nails.", "label": 1}
{"text": "James Harden's defense has been pretty wild lately! It's surprising to see him play that way. Do you think he’s focusing more on defense this season?", "label": 1}
{"text": "first time anyone has ever said anything about my username and you went for an insult, congrats on being a cunt. the fact that my ex was abusive has nothing to do with the Hornets being arguably the worst franchise in NBA history. the all time scoring leader for the team is Kemba Walker.", "label": 1}
{"text": "who cares", "label": 1}
{"text": "I wish he would have punched him the face", "label": 1}
{"text": "Post ups aren’t drives dumbass. It’s also not a “drive” if the center receives a pass on a roll to the rim. It’s also not a drive when you pass to a cutter. There’s more ways to score at the rim than drives", "label": 1}
{"text": "You said he’s an “offensive black hole” who doesn’t make others better. That’s not true based on both the numbers and just watching them play \n\n[Sixers record with Embiid vs their record without](https://www.statmuse.com/nba/ask/sixers-record-with-and-without-joel-embiid-this-season)\n\n[Sixers stats with and without Embiid](https://www.reddit.com/r/sixers/s/c5yBubMRZW)\n\n[Sixers defense with and without Embiid](https://www.statmuse.com/nba/ask/76ers-offensive-and-defensive-rating-with-and-without-embiid-this-season)", "label": 1}
{"text": "Agreed. Although your insinuation is valid for any team. I mean, the Celtics lost to the Pacers. Lol. Fact of the matter is that Okc is still experimenting with lineups and is still blowing out teams. We've literally been pulling our top players with 5 minutes left every game. And we're still missing 2 key players and a rookie that we haven't even seen yet. I think we've played plenty of \"good\" teams, depending on your definition of \"good.\" Because at least 2 of the teams we've beaten to a pulp are most likely gonna make the playoffs. I'd consider those good teams. But as are you, I'm excited to see our upcoming tough stretch of games.", "label": 1}
{"text": "They’re calling him weird like he’s a Republican lol\n\nwouldn’t be surprised if he was, tbh", "label": 1}
{"text": "Young n—-a bringing disruptive single mama-raised antics to the professional organizational structure of men\n\nYea… Kyshawn (name of productive lad) lands his lucky ass in the NBA (harder than gettin in Harvard or DSNY, sanitation for non NYers) and he talkin ignint shit to a grown man\n\nPiece of shit kid he needs to take his little ass home", "label": 1}
{"text": "Oh my science Lebron is so stunning and brave. Tell that organe darumph fascist pig, my hero Lebron! What was God-King Lebron's opinion on Diddy parties, by the way?", "label": 1}
{"text": "Sounds like the Celtics played it smart with their tryouts! I remember picking teams for dodgeball at school and we'd always test everyone, even if we knew a certain kid was great. Sometimes the ones you overlooked turned out better than expected! Maybe the Lakers just missed that elementary school wisdom lol.", "label": 1}
{"text": "Lance is a national treasure and Granger never ran his mouth man you're the clown PS Bron aint gon fuck you", "label": 1}
{"text": "The NBA suck dick….god the sport is garbage 🗑️ straight suck donkey balls", "label": 1}
{"text": "Fuck Joe Rogan, Boycott Spotify", "label": 1}
{"text": "Fuck Joe Rogan, Boycott Spotify", "label": 1}
{"text": "Yeah, I got banned from there a few days ago. lol", "label": 1}
{"text": "Worth it.", "label": 1}
{"text": "Fuck that shit.  ", "label": 1}
{"text": "Bullshit.  I’d sue the nba if I were him.  ", "label": 1}
{"text": "Yep... Should have been 1 game max.. dude deserved the \"assault\"", "label": 1}
{"text": "Lebron is old, coach sucks, roster sucks.  It’s not that hard to figure out.  ", "label": 1}
{"text": "Normalize violence against  speech. You wanna talk that talk you better be ready to catch these hands", "label": 1}
{"text": "When was the professionalism in the other side ? The only reason the dude put out that article was because there is zero consequences for him otherwise. Should have gotten somebody to clock him on his behalf, use that fuck you money.", "label": 1}
{"text": "Ananin amina cam agaci sokar, golgesindede seni sikerim. Salak salak konusma.", "label": 1}
{"text": "/r/iamverybadass redditors not understanding their real world actions have real world consequences.\n\n> I'd beat the shit out of the reporter for writing means words!!\n\nlmao then you go straight to jail/sued.", "label": 1}
{"text": "Pop gotta come back. Need him to dance on Trump’s grave.", "label": 1}
{"text": "Two weeks into the season and he's almost ineligible for mvp,again. Great start.", "label": 1}
{"text": "I’d put Barnes lower.  ", "label": 1}
{"text": "Yes they do", "label": 1}
{"text": "bro is throwing", "label": 1}
{"text": "hope he recovers fast!", "label": 1}
{"text": "Should have knocked his ass the fuck out and gotten 6.", "label": 1}
{"text": "Weak\n\nHe should've caved his face in if it's like that", "label": 1}
{"text": "Fuck Joe Rogan, cancel your Spotify subscription", "label": 1}
{"text": "🤣🤣🤣", "label": 1}
{"text": "He shoulda punched him. You gone lose a million. At least punch him. He talked about your dead brother anyway.", "label": 1}
{"text": "Giannis is gonna be a Net by the deadline huh.", "label": 1}
{"text": "🤣", "label": 1}
{"text": "Reporters about to get real ballsy now knowing they can get away with this shit", "label": 1}
{"text": "oh no, this is not good.", "label": 1}
{"text": "Tatum's new nickname - \"Puerto Rican gay\"", "label": 1}
{"text": "No lol. They are hoping for a top5 pick", "label": 1}
{"text": "Ochai just got sent to a bad situation. The Cavs drafted him which was perfect but he didn’t fit with a young bad jazz team", "label": 1}
{"text": "did i just heard puertorican gay?", "label": 1}
{"text": "this is tough guys. lmao", "label": 1}
{"text": "why did his team went deaf?", "label": 1}
{"text": "wait i need to ask shaq for his opinion.", "label": 1}
{"text": "not surprised, he really is that good.", "label": 1}
{"text": "jokic is a really great player.", "label": 1}
{"text": "i'll just wait what will be shaq's reaction on this.", "label": 1}
{"text": "And we’re sick of yall, whos president doesnt change that? Think im going away because i hate people like you and want your politicians dead?", "label": 1}
{"text": "Self defense against tyrannical government, calling it murder is a lack of knowledge of civics and the god given rights granted to me by the constitution. \n\nPresidents dont deserve immunity", "label": 1}
{"text": "Hey. Choke on a cock\n\n🇺🇸🇺🇸🇺🇸4️⃣👍\n\nYour daddy owns you", "label": 1}
{"text": "It’s really impressive how well he plays given his disability (Canadian).", "label": 1}
{"text": "lmao . this is accurate af.", "label": 1}
{"text": "Fuck off with this bootlicking garbage.\n\nThat piece of orange shit isn’t going to do a damn thing about ticket prices.", "label": 1}
{"text": "This dumb cunt belongs in jail.", "label": 1}
{"text": "Eat shit", "label": 1}
{"text": "This is gonna be interesting to see if it actually happens! Will be a pretty big moment if the Celtics do make the visit.", "label": 1}
{"text": "Just give him a few years and he will develop into a superstar.", "label": 1}
{"text": "last 4 years have been shit. it really can't get any worse for america", "label": 1}
{"text": "you had 4 years of trump already. it wasn't that bad compared to Biden's presidency. not sure why everyones being over dramatic", "label": 1}
{"text": "Bubble ring doesnt count", "label": 1}
{"text": "I consistently see you in threads with just the worst takes. Chiefs fan, checks out", "label": 1}
{"text": "replying to your paragraphs with simple sentences and watching you become more unhinged each time has been entertaining. i'm sure most of your replies are copy and pasted because you're having the same lame arguement with several other people on reddit. find a new way to cope instead of being salty. its unbecoming", "label": 1}
{"text": "That was fresh just for you. Again, just let people be worried. Realize the world is bigger than you.\n\n\n\n\"It's unbecoming\" is hysterical. The irony. Someday you'll see it little buddy.", "label": 1}
{"text": "its trump's victory song sing along with me !", "label": 1}
{"text": "I'm losing IQ points, if I respond to you enough maybe I'll get low enough to be a Republican ba-dum-tsss", "label": 1}
{"text": "If he said that last part, he'd need to be banned from living", "label": 1}
{"text": "A real team would have Khashoggi'd his ass with a bone saw.", "label": 1}
{"text": "as a Cs fan who can't stand Embiid 99% of the time, this is genuinely fucked up. Marcus Hayes should be worse than banned from the 6ers arena he should have to survive a 1 minute cage match with The Process.", "label": 1}
{"text": "Your coach looks like he has aids.", "label": 1}
{"text": "Fuck Jeremy?", "label": 1}
{"text": "why are you following me", "label": 1}
{"text": "Holy shit, why are you following me?", "label": 1}
{"text": "Hopefully they can find someone to replace him in the long run, his time on the court this season hasn’t looked very good at all", "label": 1}
{"text": "fake news, manufactured storyline, legacy media cant be trusted and luckily the American people are not as easily manipulated by fake storylines as I thought", "label": 1}
{"text": "you're just a dumbass", "label": 1}
{"text": "Lmao.", "label": 1}
{"text": "this is hilarious.", "label": 1}
{"text": "i don't doubt. he's literally working on himself. he deserve everything because he earned it.", "label": 1}
{"text": "Noice!", "label": 1}
{"text": "My man Kerr just play ball don't enter politics.", "label": 1}
{"text": "yeah really.", "label": 1}
{"text": "everything he accomplish is the reward of his hard work, i think he'll end up first if giannis couldn't maintain.", "label": 1}
{"text": "You dumbfucks no high school diploma having ass voted for tax cuts that your minimum wage having ass won’t ever see the light of day 😭😭😭", "label": 1}
{"text": "Do you still beat your wife?", "label": 1}
{"text": "hope his foot injury would not trigger again. Good luck!", "label": 1}
{"text": "Steve Kerr, liberal do nothing douche", "label": 1}
{"text": "smooth!", "label": 1}
{"text": "lot of hate in this arena. lmao", "label": 1}
{"text": "Yes, and how do you pay with an Argentine card living in the US?", "label": 1}
{"text": "google reddit nba streams. it comes up like with second link.", "label": 1}
{"text": "this kid is gonna be a superstar!", "label": 1}
{"text": "at first it was just like \"curry just dropping miracle buckets\" but now i know that he is such an artist!", "label": 1}
{"text": "He just hasn’t been in a situation that’s a good spot for a role player.", "label": 1}
{"text": "Can you link us here in the comments ? the google stuff is kinda cooked.", "label": 1}
{"text": "space created.", "label": 1}
{"text": "funny how he made that caption. who scares king james by aura?", "label": 1}
{"text": "They’ll be banned and the comment will be deleted within minutes", "label": 1}
{"text": "Show me your fucking sources dipshit", "label": 1}
{"text": "Has to be direct message if they wanna send link. Ill check out rn from someone that sent", "label": 1}
{"text": "He could have, if I misinterpreted that I urge OP to let me know.", "label": 1}
{"text": "that's too swaggy.", "label": 1}
{"text": "steph is dancing again.", "label": 1}
{"text": "morant's hang time is amazing.", "label": 1}
{"text": "this is what i love about this league.", "label": 1}
{"text": "Made sense? Idk about that", "label": 1}
{"text": "Curry fans try to downplay Draymond so hard", "label": 1}
{"text": "Gotta love the hornets commentators", "label": 1}
{"text": "Play before this was funny\n\nCurry miss\n\nOREB\n\nCurry miss\n\nOREB\n\nLooney make\n\nGuy is getting carried in the clutch lmao", "label": 1}
{"text": "thetvapp(dot)to is a solid alternative", "label": 1}
{"text": "If you think that one play is the only reason you lost then you’re just a dumb piece of shit… get over it, you’re team player like shit, stop being a pathetic bitch, good luck next game 👍", "label": 1}
{"text": "Warriors fans already tryn insult Klay’s legacy lmao", "label": 1}
{"text": "Back to back misses here from the Clutch Player of the Year!", "label": 1}
{"text": "\nhow could Darvin Ham do this?", "label": 1}
{"text": "☝️", "label": 1}
{"text": "Trump was spotted visiting Waiters Island", "label": 1}
{"text": "It's 8 games u fucking loser lmao.", "label": 1}
{"text": "Time to carry load, just as horse does. *Jokic smiles softly.* alright idk why I did the fan fic part", "label": 1}
{"text": "hoo, shaqtin a fool.", "label": 1}
{"text": "Get well Ja! still cheering for team!", "label": 1}
{"text": "that's too slowmo.", "label": 1}
{"text": "Chet abandoning the Honest Abe look for the Punk Rock Paul style. What does this mean for his game?", "label": 1}
{"text": "6-0", "label": 1}
{"text": "just release it jimmy.", "label": 1}
{"text": "We can take solace that Goatbrook haters are in complete and utter shambles rn", "label": 1}
{"text": "Westbrook is back on track!", "label": 1}
{"text": "this is what i've been waiting for, westbrook coming back strong!", "label": 1}
{"text": "i'm speechless. i love how they worked together to get the win.", "label": 1}
{"text": "Nah, check yourself though. Easy to find out a lot of info on you through a cursory glance.", "label": 1}
{"text": "i love the hustle!", "label": 1}
{"text": "My man westbrook is now back!", "label": 1}
{"text": "i was waiting for this news all along! proud of you russ!", "label": 1}
{"text": "jelly dance.", "label": 1}
{"text": "still good numbers.", "label": 1}
{"text": "i tried as well, can't reach that high.", "label": 1}
{"text": "jokic is a wizard. he's really has high IQ in the game.", "label": 1}
{"text": "it's just bad days.", "label": 1}
{"text": "My assumption is that you think I'm making some play here that I'm unaware of... I'm trying to point to my lack of political related whatever-it-is that you're assuming I'm guilty of. It might be something I'm entirely unaware of, given my location... Idfk. I asked you to tell me what 2A means, and you've chosen to be hostile.", "label": 1}
{"text": "Im fine with it tbh at least you get a basketball player instead of her dumb ass", "label": 1}
{"text": "What the fuck are you talking about. You've not once illustrated whatever the fuck it is 2A is... acronyms are not exclusively tied to any single domain. \n\n2Ass, 2Anus 2Arificial, 2Augmented, 2Anal...", "label": 1}
{"text": "Im 23 fool", "label": 1}
{"text": "The West has been a bloodbath since magic retired", "label": 1}
{"text": "Ur socks are safe", "label": 1}
{"text": "jokic is the real MVP, He never complains he just focus on the game.", "label": 1}
{"text": "russ is really a monster.", "label": 1}
{"text": "that was clearly a foul. can somebody explain why is this referee not whistlin?", "label": 1}
{"text": "correct.", "label": 1}
