{"text": "I’ve been pretty down on Sarr but this was very exciting. Being able to switch your center onto a player like Tatum is extraordinarily valuable", "label": 0}
{"text": "This is like when I was in school writing a paper, and I slapped a title on it so I could tell my mom I started my homework so she'd get off my back", "label": 0}
{"text": "Wemby needs to wake up", "label": 0}
{"text": "Lively >>>>>>>> Wembanyama\n\nDon't care what anyone says. Even last year Lively owned him.", "label": 0}
{"text": "mvp mvp mvp", "label": 0}
{"text": "Glad we got a slow motion replay of Luka holding his nuts.", "label": 0}
{"text": "Lively!!", "label": 0}
{"text": "Why not both? \\*insert Old El Paso commercial\\*\n\nLike both teams should be fighting for which year they should receive the pick.", "label": 0}
{"text": "Doesn't excuse him for thinking it was an all star game draft. Even for that, I'd start with someone other than AI", "label": 0}
{"text": "Wemby got owned here", "label": 0}
{"text": "Luka is so good at that steal in the post", "label": 0}
{"text": "This makes the Clippers look really really bad. I'm sorry but Kawaii doesn't play until he's fully recovered.", "label": 0}
{"text": "Damn Wemby can't dribble", "label": 0}
{"text": "Who woulda thought Luka and Klay would be amongst the best defenders for us tonight", "label": 0}
{"text": "So the highly paid medical professionals employed by most teams are wrong. Dr. Kenny Smith and Charles \"back in my day\" Barkley are the real knowledge bearers.", "label": 0}
{"text": "It feels like Wemby has lost control of the ball every time he puts it on the floor.", "label": 0}
{"text": "I mean, he was in an interview and was being real. Sue him. He and the organization knew he would get criticized.", "label": 0}
{"text": "Shit, I read it as Shareef at first and my heart sank for a minute.\n\nEither way, the loss of life at such a young age is awful news to hear.", "label": 0}
{"text": "that’s fair. i’m not sure i believe someone can be absolved from racist roots so maybe pessimistic was accurate lol.", "label": 0}
{"text": "Can’t wait for them to fire Reggie Miller. I will be in a suit", "label": 0}
{"text": "You can tell Victor has been working this offseason, but he's still struggling to keep that dribble tight", "label": 0}
{"text": "Porzingis took 18 months to recover from ACL surgery and then tore his lateral meniscus. Just because you CAN play in 1 year doesn’t mean you SHOULD. I think the trainers advice to wait 2 years is valid given Kawhi’s injury history to his quad, along with his ACL injury creating a lot of knee instability", "label": 0}
{"text": "Wemby lookin like Bol Bol out there", "label": 0}
{"text": "Reggie Millsr so upset Luka did a great defensive play he went and talked about Jaden hardy", "label": 0}
{"text": "CP3 and Wemby OMG", "label": 0}
{"text": "Luka --> Wemby stopper", "label": 0}
{"text": "Yes. Embiids rotation has been playing the entirety of the 3rd quarter and half of the fourth. You’d see narratives of him sitting out the fourth quarter but then look up and he still played 31 minutes. He’s still an amazing scorer but the years of back and forth between Jokic fans and Philly fans taught me the narratives that each side tried to push well.", "label": 0}
{"text": "Klay's shooting transferred to Luka lmao", "label": 0}
{"text": "Yea cause you’re actually trying to lose", "label": 0}
{"text": "I agree. He'll be a supercharged AD. Whether or not that's a No. 1 option, idk.", "label": 0}
{"text": "ok wemby just do that 50 more times", "label": 0}
{"text": "WESTBRO-I MEAN JOHNSON FOR 3", "label": 0}
{"text": "wemby on track for a quadruple double if u count the TOs", "label": 0}
{"text": "God Luka's heavy ass is always stumbling everywhere. It's stressful to watch him run around", "label": 0}
{"text": "Oops, they already did.", "label": 0}
{"text": "CP3 actually hitting Wemby for lobs 🥹", "label": 0}
{"text": "my bad, google tricked me when i searched the livescore", "label": 0}
{"text": "It's a mix of Giddey stans, SGA haters, and weird Redditors who feel the need to defend Giddey for sleeping with underage girls", "label": 0}
{"text": "These old heads believe what they were told by the billionaires play as much as possible dont worry about life after the nba when you can’t walk anymore….", "label": 0}
{"text": "poole just checking he is human", "label": 0}
{"text": "Wait I'm very confused by this exchange. Don't you guys both mean cool and a cucumber", "label": 0}
{"text": "Luka needs to be put in bubble wrap", "label": 0}
{"text": "Hell of a lot of grown man hero-worshipping in this sub", "label": 0}
{"text": "So many airballed 3's. Yawn.", "label": 0}
{"text": "“39 he looks like he’s 29.”\n\nMe:  No \\[shaking head\\]", "label": 0}
{"text": "Guess they hate Utah", "label": 0}
{"text": "Kidd needs to pull Luka. It's gm1, the fuck are you letting your star player suffer like that?", "label": 0}
{"text": "NBA fans man, they’re the only people I’ve ever seen want LESS of their sport", "label": 0}
{"text": "Just from this information, it seems pretty bad..", "label": 0}
{"text": "Who would've thought that we look better when our best players are playing?", "label": 0}
{"text": "I feel like anytime there is some sort of ceremony which messes up the length of the pre-game or halftime, the home team always comes out a little flat.", "label": 0}
{"text": "Lucky they are the deepest team in nba history", "label": 0}
{"text": "I wonder how good Luka would be if he just locked in for a game and focused his ref frustration into playing", "label": 0}
{"text": "Yes I find it very strange as well. Simple back down and jump hook seems like a lost art.", "label": 0}
{"text": "Barnes has been so good! So has Thompson.\nTwo former championship teammates what a battle", "label": 0}
{"text": "**Replays/alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "label": 0}
{"text": "“Oooh, in the boys”", "label": 0}
{"text": "If Jokic only had 3/4 of Brown's supporting cast, he'd be a perennial Finals contender", "label": 0}
{"text": "UNCLE DENNIS WANTS TO KNOW YOUR LOCATION", "label": 0}
{"text": "Olden state", "label": 0}
{"text": "this game has been so entertaining but so sloppy", "label": 0}
{"text": "No, the more common ones can be attributed to an accumulation of fatigue, or a certain player is just more prone to it.\n\nStrains, hamstrings, soreness, inflammation etc.\n\nBreaking a leg on a stancion or James Wiseman rupturing his Achilles first game of the season doing a movement he does 100 times a day, are freak injuries and can happen to anyone at any time.", "label": 0}
{"text": "That single possession is about to push so many narratives lol", "label": 0}
{"text": "He’s not “ black” he’s biracial. He’s not a full blood like me…. Stop telling me other people are us when they aren’t get that one drop rule out of my face", "label": 0}
{"text": "Wemby said look at me, I am the point guard now. I love to *you*", "label": 0}
{"text": "I wonder if teams studied a bunch of Wemby tape in the off-season and now have figured out how to get him discombobulated", "label": 0}
{"text": "He also missed pretty much the entire college season in 2019-20", "label": 0}
{"text": "Klay has shot 3-19 FG, 2-12 3PT and 5-20 FG, 2-8 3PT in his last 2 game 6s.", "label": 0}
{"text": "AWWWW that would've been so cool", "label": 0}
{"text": "Is Wemby waking up?", "label": 0}
{"text": "LIVELY PICKPOCKETS PAUL.\n\nlol what?!\n\nLove the energy so far", "label": 0}
{"text": "Embiid has played with a broken face, injured knees, and injured hands throughout his career. He clearly is dedicated to the game and wants to play no matter what condition he is in. This is very obviously a decision made by the organization. If it was anyone else other than Embiid, you all suddenly would have more common sense and realize that.", "label": 0}
{"text": "Luka took the defensive criticisms personally", "label": 0}
{"text": "I’d say you can give JT his flowers while still believing Cam got this\n\nWouldn’t surprise me at all if Cam led the league. Feels like defense doesn’t affect that guy lol", "label": 0}
{"text": "WHY DOES SARR KEEP DROPPING??", "label": 0}
{"text": "Wild 20 seconds", "label": 0}
{"text": "wemby you're 8ft tall. you cant go 2/8", "label": 0}
{"text": "Mavs have really active hands on defense", "label": 0}
{"text": "Luka cant hit a shot", "label": 0}
{"text": "nah bro is playing like a terminator rn if anything the deal did this", "label": 0}
{"text": "Luka's defense has been better than his scoring this game lmao", "label": 0}
{"text": "WE'RE SO FUCKING BACK", "label": 0}
{"text": "I love Lively so much", "label": 0}
{"text": "Hardy plays like he’s the best player out there", "label": 0}
{"text": "LOL that got me.\n\nSeems like a mullet, but usually fade mullets are longer at the top.", "label": 0}
{"text": "I think their responsibility is towards ensuring maximum success for their team and themselves as they define it. This problem is created by greedy owners who refuse to movie with the times. \n\nDo fans who miss out on seeing players when they're injured not count? Id rather give the players maximum chance to players being healthy for the playoffs than this BS about some kid who paid to see XYZ on a tuesday in December. At least, with back to backs, fans still have some idea of who they are likely to see or chance to not see.", "label": 0}
{"text": "I roll with what curry is saying since he would know best in this situation", "label": 0}
{"text": "Kinda wished luka hit that to make me feel a bit better lol", "label": 0}
{"text": "This is the same joke again", "label": 0}
{"text": "He ain’t Giannis… that part of his game is a work in progress", "label": 0}
{"text": "What a game and what an end to that quarter wow", "label": 0}
{"text": "The close of the half was certainly 60 seconds of a basketball game", "label": 0}
{"text": "Post timeskip Luka just not the same", "label": 0}
{"text": "So Chris Paul just extended his career by another 5 years playing with Wemby.", "label": 0}
{"text": "Yeah that final Jordan All-Star game was a thrilling finish (until Jermaine O'Neal fouled lol).", "label": 0}
{"text": "Just expect wemby to have more than 6 pts. The physical gifts are insane", "label": 0}
{"text": "the dallas derrick livelies vs the san antonio harrison barnes", "label": 0}
{"text": "Hardy makes up for the loss of Josh green :(", "label": 0}
{"text": "cool and a cucumber actually", "label": 0}
{"text": "Every time I see Lively he impresses me greatly. The intensity from that guy is awesome, a big reason why Wemby can't get into this.", "label": 0}
{"text": "I would like to see Poole in Spurs. Either Pop will succeed in fixing his mental game and turn him into proper star or we will get daily leak of incessant bullying in training sessions.", "label": 0}
{"text": "It's been ugly, but it's been fun so far. Let's keep this shit going second half.", "label": 0}
{"text": "He's playing good on defense and giving a lot of effort, his shot is just not going in nothing to worry about.", "label": 0}
{"text": "i mean biased too, but he’s putting in the effort at the very least", "label": 0}
{"text": "That looks like a very healthy locker room", "label": 0}
{"text": "His efficiency wasn't bad last year.  It never has been. Obviously, improving it would be a big deal, but he'd have to improve it a lot for it to make a dent in perception.", "label": 0}
{"text": "We don’t even have Vassell", "label": 0}
{"text": "why is the game thread so hard to find now", "label": 0}
{"text": "wemby and luka look hungover offensively", "label": 0}
{"text": "Hood-Schafino shouldn’t have even gone above Jackson-Davis. I watched like all of their games at IU and I never understood what teams saw in JHS", "label": 0}
{"text": "Wheeler HS legend R.I.P", "label": 0}
{"text": "Not a fan of the CP3 iso the finish out the half when there was plenty of time to run a proper play", "label": 0}
{"text": "This is the worst timeline.", "label": 0}
{"text": "Damn, I’m so jealous", "label": 0}
{"text": "Luka won’t play like this the whole game so I’m comfortable", "label": 0}
{"text": "Luka has been playing lock down defence no joke lol. His offence has been ass tho. Makes sense he played 0 pre season games he’s rusty.", "label": 0}
{"text": "He's settling because he still has the ability to make any shot on the floor. Still learning how to manage being both in a center's body and having a shooting guard's repertoire", "label": 0}
{"text": "That's the thing here... if they're not disclosing his injury or the severity of it, why can't he do that again this season?", "label": 0}
{"text": "So many of last night's games were unwatchable with the absolute fucktons of fouls. Tonight, they are absolutely lettin' 'em play. I've seen about 20 or 30 plays tonight that I'm surprised weren't whistles based on the shit I saw last night.", "label": 0}
{"text": "We just saw the worst team get the 5th overall pick lol as long as we finish bottom 5 I’m cool.", "label": 0}
{"text": "Yeah the ref r good too not calling all contacts", "label": 0}
{"text": "I wont even say low ceiling really. \n\n\nLike no he isnt goiing to turn into Durant or some shit, but a high level starter who you cannot leave open i.e. a gordon hayward lite is not a bad outcome for him, and isnt really too far out of reach for him", "label": 0}
{"text": "I'm sorry, did he just say 3.9 BLOCKS A GAME?", "label": 0}
{"text": "MJ’s break in his foot was due to how he moved too. Before he worked with Tim Grover he had issues with his ankle/foot bothering him. Embiid needs to change his diet and his training/workout regime", "label": 0}
{"text": "Y’all getting lazy with the game threads", "label": 0}
{"text": "She said she's enjoying it 👍", "label": 0}
{"text": "A few players have brought this up. And yeah that’s the example I usually give to people that think Embiid should just play once a week. Imagine instead of running 30 miles throughout 4 days. You just run 15 miles once a week. Way higher chance to get injured.", "label": 0}
{"text": "Imagine living some place where you walk into a restaurant, order a steak, and they hand you a fucking sandwich \n\n\nWhat a joke", "label": 0}
{"text": "Lively looking really impressive!", "label": 0}
{"text": "I'm interested to see when dudes stop thinking they can go over Wemby just because they think it will be really cool. You cannot will this into existence, he is 1 million feet tall and 2 million feet long.", "label": 0}
{"text": "That’s a good welcome though, you can do everything right and still get torched", "label": 0}
{"text": "You want some unsolicited advice?  \n\nWhen you say \"cannot imagine [a person] over the age of like, 25 feeling any type [way]\" about something, you're either calling into question their range of experience or their maturity.\n\nYou are implicitly saying that my opinion is either uninformed or immature.\n\nYou don't get to just backpedal your way out of that.\n\nAnd more about what you said after that, IT DOESN'T FUCKING MATTER IF THE SPURS HAD IT GOOD.  When I said \"endured\" I wasn't acting like they had suffered.  You read it that way because that's how you think of your fan experience.  That's a YOU problem.  Not my problem.  You made something that wasn't about you about you.  The people who agreed with you did so because they are also self-centered and they identified with your self-centeredness.\n\nI don't accept your weak excuses, Boomer.", "label": 0}
{"text": "Doesnt seem like hes biggest fan of contact", "label": 0}
{"text": "the nfl is worse for the body and they don't have this problem.  need a scarcity of games and for the regular season to matter", "label": 0}
{"text": "Mods ass gatekeeping the game threads. Gotta search for them.", "label": 0}
{"text": "TNT broadcast has been ass. No wonder the NBA is leaving them", "label": 0}
{"text": "Kevin Harlan was put on this Earth just so he could say Wembanyama’s name during play calling.", "label": 0}
{"text": "Gawtdammit I'm sold! Mavs are winning it all, and Klay is getting his 5th, i don't even care", "label": 0}
{"text": "at a certain height, your center of gravity works against you. i always thought the same thing about zingis and he’s certainly not 7’5", "label": 0}
{"text": "Same…", "label": 0}
{"text": "He swapped his shooting with defense", "label": 0}
{"text": "Yeah he struggles against strong bigs, and dribbles too much, he needs to get the ball closer to the rim and dribble less", "label": 0}
{"text": "His shot especially 3 has been short looks rusty which is fair considering he didn't play in any of the preseason.", "label": 0}
{"text": "What’s up with Lukas threes there not even close", "label": 0}
{"text": "He’s been playing pg but the addition of Klay and Grimes does reduce his ball dominance a bit, it was more visible during the 1st quarter.", "label": 0}
{"text": "You say that so confidently, the Celtics may win 70 games and he is going to have monster stats", "label": 0}
{"text": "Sixers medical team last year, as reported by sixers best reporters, wanted Embiid to play more!", "label": 0}
{"text": "It's less that he shifted the Overton window and more the Democrats stopped being hypocrites.\n\nThe wall isn't a new wall. It was put up to vote in 2006 and it was overwhelmingly approved. Some notable senators who voted in favor of it being built include Obama, Biden, and Clinton. Then when Obama entered office he had it built.\n\nWhat Trump did was extend the wall that _they voted to have built and then built it_. If they hated it so much then maybe they shouldn't have voted for it and then build it.", "label": 0}
{"text": "Yea... but some of that \"quick\" is just really good fundamentals and footwork. Its like a wideout whos fast and one who runs really good routes but isn't as fast, using technique to generate spacing.", "label": 0}
{"text": "@NBA investigate this too", "label": 0}
{"text": "He did make a change. It’s literally the reason he falls as much as he does.", "label": 0}
{"text": "It’s so crazy how distinct tearing your Achilles is. There’s really no mistaking it. Seeing that replay was brutal", "label": 0}
{"text": "Or Wemby makes his moves quickly and they're screwed.", "label": 0}
{"text": "He’s just not yet at the point where he’s gonna create great offense for himself because of strength, balance, and handle. But you gotta give him the reps to grow into it. If the team was contending, he’d dribble less and be more of a shooter and play finisher. Hes already a good passer though so him in the post can still create good advantages", "label": 0}
{"text": "This will sound weird, but Lively really reminds me of Gobert on D.\n\nKnows where to be and when to be aggressive or not. Isnt just relying on his size either...", "label": 0}
{"text": "It feels like the Spurs/Mavs are often bad matchups for Luka and Wemby. They're often struggling because these are very physical games perhaps", "label": 0}
{"text": "that time lively grabbed cp3s arm in transition after he got blocked was a terrible non call", "label": 0}
{"text": "Shades of that Luka steal to DJJ oop play of last season", "label": 0}
{"text": "It's all in your mind.     Shown when, when he's played with scrubs 1 minute left in games that first year?\n\nHow is he supposed to develop defense and team defense not playing, and always playing with a different set of scrubs for a few minutes?   What he can bring is offense and this has already been proven.   He can yet prove he can be a better defender while helping spacing on this team now and then.\n\nHe helped destroy the Nuggets one game for a Wolves win.   In another, they lost to Denver but he scored 19 points on 12 shots.  How many of those game chances you think you remember him getting? \n\n  \n22-33 season.     11 games over 10 minutes.   Wolves had 6-5 record those games.   He scored 15 or more in 6 of those games.  \n\n23-24 seasons.    5 games over 9 minutes.  Wolves had a 3-2 record those games. He scored between 8 - 16 pts in all his top games.  He was inactive or dnp'd 57 games.  20 of 25 games were 5 minutes or less.   What the hell kind of defense do you expect him to show you in 5 or less minutes? 14 games were 3 or less minutes.  7 games less than 2 minutes tie.    4 games less then a single minutes time. \n\n\n\nHe is absolutely the big they should be putting on the court when the rest of the team shows up like freaking slugs like we saw opening night.", "label": 0}
{"text": "Or since Caruso was only a laughable meme but since he’s not a Laker anymore now he gets the recognition lol", "label": 0}
{"text": "That was a fluke. Beat a NY team that shouldn’t have even been in the playoffs and collapsing Sixers with a mentally collapsed Ben Simmons", "label": 0}
{"text": "🤦‍♂️\n\nMy bad", "label": 0}
{"text": "i know that casuals get bored of the safe prospects after a while but i had hope it wasn’t the GMs as well. comforting to think i’m on their level though 🏀🧠", "label": 0}
{"text": "Brightest spot so far for Dallas.  Even when he doesn’t get the boards he’s doing everything right.", "label": 0}
{"text": "I mean we still won with the handicap, so all good", "label": 0}
{"text": "It’s like during pick-up when someone who’s new to pick-up or doesn’t typically play basketball defends you. They don’t bite on anything and you lose all your moves lol", "label": 0}
{"text": "I mean is it?  They finished 2nd in the East last year.", "label": 0}
{"text": "He has one of the best first steps in the league which you absolutely need as a guard.", "label": 0}
{"text": "Who knows. Sixers medical team last year wanted Embiid to play more, so all up to them and the org.", "label": 0}
{"text": "This has nothing to do with KD.", "label": 0}
{"text": "Luka will have 1 great defensive stop and suddenly he is in the all defense team according to luka stans", "label": 0}
{"text": "“Chris Paul = Cone” - Pat Bev", "label": 0}
{"text": "Again, chronically online people are not representative of real life people. Most liberals are chill irl. Meet us in real life and we’ll get along great! I’m friends with many different people, including people I know who will vote for Trump.", "label": 0}
{"text": "The two players who barely played preseason or didn't at all are playing below their standard!\n\nAnd there both rhythm players \n\nWho would have thought?\n\n/s", "label": 0}
{"text": "Hate the Lakers, but damn that was cool.\n\nImagine having fun at practice?", "label": 0}
{"text": "Klay looked really good but didn’t see him much in the 2nd quarter", "label": 0}
{"text": "Is House of Pain the new trendy song with the kids? I've heard it a heap the last few days", "label": 0}
{"text": "Yeah I love Chuck but he's a terrible spokesperson for this, he's a living example of what happens if you don't put your body first.", "label": 0}
{"text": "Imo, I can’t see one dude coming forward with this if he couldn’t *prove* every single claim. He has 1/100000th of the money and power as the clippers/NBA, so it would be (unfortunately) absurdly stupid to fight this unless it could all be unequivocally proven with hard evidence.\n\nMy assumption is that it’s actually *worse* than this, and that this is just the stuff he can undoubtedly prove in court.", "label": 0}
{"text": "MVP loading…", "label": 0}
{"text": "Refs in the 90s would NEVER", "label": 0}
{"text": "Your post was removed because it is a short self post. You should try to start the discussion by talking about what you think, not just asking a question, submitting a phrase or a stat line. Any self-post with less than 100 characters in the body will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "label": 0}
{"text": "I forgot about the Kidd early season lineup terrorism", "label": 0}
{"text": "Anyone who watched in March Madness knows from the beginning. He's a wizard.", "label": 0}
{"text": "Why was Jordan Poole politely twerking for a moment there", "label": 0}
{"text": "Wemby needs that Porzingis-type quick 18 foot turn around in his game", "label": 0}
{"text": "Did they forget to stretch or something", "label": 0}
{"text": "I'm already seeing the deep team jokes but I unironically think we might still beat the Jazz even if all three don't play.", "label": 0}
{"text": "Using a late 2nd round pick on a total flyer is fine though. If someone had drafted Bronny in the lottery, that would have been what the person you responded to is talking about. In the case of Bronny, there wasn't some clear superior player that was passed over for him. At that point everyone available were extreme long shot prospects.", "label": 0}
{"text": "Why? We've gotten torched for the way the Spurs \"treated\" Kawhi for years, despite there being only speculation.", "label": 0}
{"text": "Being called out by THE people’s president. The LIFETIME commander in chief…. Phew, talk about feet to the fire.", "label": 0}
{"text": "Man Steve deservers a championship so much. Its a shame that it likely wont happen anytime soon.", "label": 0}
{"text": "Kinda is tho, you want the players to play and don’t seem to care why they might not want to under rules/approach league and owners have implemented, it’s not like the players haven’t told them they don’t like the potential health risk of back to backs. I’m not gonna hate on the workers actually having the power to negotiate personally even if I selfishly would like to see them play.", "label": 0}
{"text": "It’s not really because Embiid is not sitting out due to health fully, he’s sitting because 1. He got his stats he needed and 2. Health lol", "label": 0}
{"text": "Kenny acting like Klay never has open looks before playing with Steph.", "label": 0}
{"text": "Siri play “Contusion” by Stevie Wonder", "label": 0}
{"text": "Did you just call Rudy coordinated? haha\n\nBut i've never heard people compare the two", "label": 0}
{"text": "Jaylen Brown 💪", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "Caruso signed a contract for a tiny $9m a year to leave the Lakers, because they wouldn't offer the same (he even said he would take less to stay, and they didn't offer it).\n\nThe opinion from around the league at the time, including from the Lakers, was that he was pretty average.", "label": 0}
{"text": "Damn Kenny’s analysis was so bad lmao", "label": 0}
{"text": "Not to be cynical but … this is the NBA, nothing surprises me.", "label": 0}
{"text": "Yeah they ain’t trying to win this year. Capture the Flagg", "label": 0}
{"text": "That right there is why James Harden will never win a championship while playing significant minutes.", "label": 0}
{"text": "Why is that something to keep an eye on? It's a meaningless stat without any context attached. Klay is playing pretty well so far, +/- aside", "label": 0}
{"text": "I’ve been saying Dalton is a pro from way back when I saw him demolish Kentucky. He can shoot yeah but he’s got some ups too. Not the prettiest player and I do think teams look at marketability as another factor when evaluating draft picks.", "label": 0}
{"text": "What’s Kenny talking about? First time Klay’s not been doubled in his career? Bro was on a team with Curry and Durant. No one even looked his way on that team", "label": 0}
{"text": "Lively and Wemby were kind of going at eacher a couple times there. This is gonna turn into a rivalry for years to come at some point", "label": 0}
{"text": "Wembustyama is back on the menu", "label": 0}
{"text": "OMG HES ASS WRAP UP THE SEASON", "label": 0}
{"text": "No", "label": 0}
{"text": "Come on ref. Also I’d rather see a replay", "label": 0}
{"text": "The drama being caused us by redditors like you, he’s sitting at home chillin rn, tf you mean.", "label": 0}
{"text": "knew it was OP before i even read it, welcome back bro.", "label": 0}
{"text": "I saw him play a gleague game which he did as part of the end of his first knee rehab. Santa Cruz Warriors play one game a year at the main team's stadium. Everyone was cheering for him so hard and he played great. Such bad injury luck for a good kid.", "label": 0}
{"text": "The council got together, we asked the oracle, and we decided this video is okay.", "label": 0}
{"text": "At least you are consistent lmao 🤣", "label": 0}
{"text": "Unfortunately I was right. Hope he makes a full recovery. [https://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-opener](https://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-openerhttps://www.si.com/nba/pacers-center-james-wiseman-suffered-torn-achilles-season-opener)", "label": 0}
{"text": "You Philly fans really are fucking dense.\n\nWhy else would they be looking into it?", "label": 0}
{"text": "Yeah, he probably needs to make his moves faster. One move and go up, instead of working his way into it. Plus the ball is pretty vulnerable when he dribbles because he's so tall", "label": 0}
{"text": "Watch him cook next half", "label": 0}
{"text": "farm teams are told when to stay in their place and when to look the other way", "label": 0}
{"text": "Check out the big bruise on Brad.", "label": 0}
{"text": "Champagnie and Lively > Luka and Wemby", "label": 0}
{"text": "I think the reality is that Joel knows he’s getting older, he got his MVP and his Gold Medal, and he’s probably content with that. It was just stupid to say what he said out loud.", "label": 0}
{"text": "Can't believe they get to play in the same conference as the wizards", "label": 0}
{"text": "was bout to upvote till i realized the username", "label": 0}
{"text": "Lebron has taken this further and perfected it imo. Spends a lot of money on his body, saves energy while on court and does this while playing smartly without being a negative to his team.", "label": 0}
{"text": "Where’s the salt. He said they don’t deserve what they have as the only thing he’s accomplished is leading a team to the 26th best record 🥱 6 points 4 turnovers. Maybe he’s the one who doesn’t deserve the hype he’s getting.", "label": 0}
{"text": "It’s always him lmao 🤣", "label": 0}
{"text": "CHUCK WHAT ABOUT THEM SAN ANTONIO WOMEN", "label": 0}
{"text": "who cares all of America is watching this banger TNF game", "label": 0}
{"text": "That “little guy” he says 😭", "label": 0}
{"text": "It’s wraps y’all. Let’s trade him for Jordan Poole", "label": 0}
{"text": "Kawhis accused both of his long term teams of mishandling his health. The guy has bad knees and I feel for him on that front, but at some point you gotta realize it was your choice to keep playing basketball, negotiating max money, and dealing with the expectations that come with. Doing this with the Clippers and *Spurs* of all organizations is enough to tell you this would have happened with any team. Either negotiate a lesser contract that won't hamstring a team cuz you're going into it expecting to miss 2 whole ass years, medically retire, or realize you're going to be expected to play basketball.", "label": 0}
{"text": "Injuries ruined his career bro. He never could get development because health always came into play as he hit strides man.\n\nI think it might be time to sell my stock, he’s probably done. This is sad man had such high hopes for em.", "label": 0}
{"text": "I disagree actually. If he’s lying, he has EVERYTHING to lose. They can sue him into the ground and ruin his life. \n\nMy assumption is that this is all the stuff he can unequivocally prove, and that it’s actually a hell of a lot worse than this in reality. \n\n(Speaking from the experience of someone who’s had to be in a legal battle with an organization who wronged me. They have SO much power and the system is so fucked - it would be almost nonsensical for the whistleblower to be lying, bc this will most likely ruin this dudes life anyways, even if he wins, which means that he’s probably only doing it bc he feels like it’s the right thing to do.)", "label": 0}
{"text": "His age 20 season wasnt 18-19?", "label": 0}
{"text": "Was that ever on the menu?", "label": 0}
{"text": "Wow Shaq giving Wemby the benefit of the doubt instead of being a hater", "label": 0}
{"text": "Because he missed the opening game.... literally in the report. But I'm dense.......", "label": 0}
{"text": "Kawhi injured.\nEmbiid sitting out controversies.\nRusty starts.\nOverreactions.\nNo flex zone.\n\nNBA IS BACK", "label": 0}
{"text": "Lindy Waters III will be watering the court with threes.", "label": 0}
{"text": "First time Luka and Lively have ever been called “a little guy”", "label": 0}
{"text": "This is good", "label": 0}
{"text": "Damn feel bad for the guy.  This might (will) be the end of his career.", "label": 0}
{"text": "The game is in Dallas silly", "label": 0}
{"text": "Please don’t post Luka’s statline", "label": 0}
{"text": "> Just saying that being an adult doesn't mean you automatically make the right decision.\n\nPlease point out where I made that argument?", "label": 0}
{"text": "wemby just needs to be more aggressive and act his height", "label": 0}
{"text": "Wemby with 6 points and 4 rebs?  Fraud", "label": 0}
{"text": "I dont know the specifics of the contracts we’re talking about, just know per game stats are often in there", "label": 0}
{"text": "Can't wait for another season of everyone hating Kidd as a coach then when we get to the WCF or something going \"he's so good the Mavs have made the WCF 3 times in 4 years.\"\n\n\nI can already feel how ridiculous some of his post game quotes are going to sound in my head.", "label": 0}
{"text": "I'll seriously put a sharpened pencil in my ear if I have to hear this commercial again", "label": 0}
{"text": "bust", "label": 0}
{"text": "The basketball gods were doing some heavy lifting…", "label": 0}
{"text": "I kinda don’t get how you could read this and come away with that takeaway lol", "label": 0}
{"text": "What is this shit", "label": 0}
{"text": "Kenny with the Carlos Boozer beard LMFAO", "label": 0}
{"text": "I know it may sound silly but I think Luka hates his shoes.  I remember him switching back the his original 1’s during the playoff run last year.  These new shoes look clunky and odd and I think he hates them maybe lol", "label": 0}
{"text": "LOL", "label": 0}
{"text": "They are also very big in Dallas.", "label": 0}
{"text": "This whole game has been ugly. Both teams playing so sloppy.", "label": 0}
{"text": "Then they traded away that team they amassed internally.  It was sad.  It was just coming together.", "label": 0}
{"text": "In preseason last year, yes", "label": 0}
{"text": "People swear shaq is a hater but i really think he just gives his honest opinion of players. Tbh i think hes right more than hes wrong especially when evaluating bigs", "label": 0}
{"text": "That festive Noel flair", "label": 0}
{"text": "Booty Gobert I remember people calling him that after his first summer league game.", "label": 0}
{"text": "and KD...lmao", "label": 0}
{"text": "I’m not his biggest fan but I love dudes that never stop being themselves. It’s always good to see.", "label": 0}
{"text": "dont forget the draymond tech", "label": 0}
{"text": "Kuzma is a comedian LMAO", "label": 0}
{"text": "Your best player Jaylen Brown wouldn't have had any issue getting past him.", "label": 0}
{"text": "I’m glad Klay is doing well and fits in defensively.  I was concerned that he’d have some trouble due to the injuries.", "label": 0}
{"text": "Going to share his knowledge of how fakeKawhis's injuries were too?", "label": 0}
{"text": "That was certainly a possession for the Wiz", "label": 0}
{"text": "I guess.", "label": 0}
{"text": "Embiid is the example of why all athletes are extremely boring in interviews. People think they don’t like it, but look at what happens when you just say what’s on your mind.", "label": 0}
{"text": "Damn what a bum, trade him to the wizards for Poole I heard he’s having a monster season so far", "label": 0}
{"text": "5 FRPs and SGA while OKC get Cooper Flagg.\n\n\nLET TEAM CANADA UNITE ONE BY ONE", "label": 0}
{"text": "Tatum MVP szn", "label": 0}
{"text": "Holy fuck Kuzma that was awful. What happened to this guy", "label": 0}
{"text": "Oooh yes, forgot about that", "label": 0}
{"text": "I didn’t see the tape.", "label": 0}
{"text": "But he won't play much good or not, cuz  twolves are twolves", "label": 0}
{"text": "Warms a mans heart", "label": 0}
{"text": "Boozma", "label": 0}
{"text": "Premier league? Soccer? I know messis tiny but being bigger is surely an advantage no?", "label": 0}
{"text": "Tatum's playmaking is so good", "label": 0}
{"text": "this dude kyle kuzma man haha", "label": 0}
{"text": "More than likely I’d assume", "label": 0}
{"text": "Moving quickly ≠ Making your moves quickly\n\nIt means doing your move before the defense is set.", "label": 0}
{"text": "Through preseason and this first few days of the season, Kuzma has a great case for LVP", "label": 0}
{"text": "He still hasn't proven he's not a bust for the amount of hype he recieved. Best prospect in team sports history I was told", "label": 0}
{"text": "I mean thats exactly what I said, the money they paid him for the role they wanted him to play didn’t match up with the caliber of player he actually is. 17 ppg with solid defense and rebounding is still a good player, people just had expectations that he would be a star because of his contract, and when he didn’t live up to it, they act like he’s trash which is ridiculously false. \n\nWhats he supposed to do, turn down the 50 mil and say “Nah, im not that good, pay me less”? If the sixers offered you 50 mil to be their complimentary star next to embiid are you about to turn them down and say “nah, I don’t deserve it”? Fuck no you aren’t. Just cuz Tobias was overpaid and didn’t live up to his expectations doesn’t mean he’s a trash player.", "label": 0}
{"text": "Lock the thread", "label": 0}
{"text": "Poole is such a ridiculous shot chucker that I almost respect it\n\nKuz on the other hand... fucking hell", "label": 0}
{"text": "Oofzma", "label": 0}
{"text": "Bro I’ll always remember Lively’s first game vs us. I had no clue who he was, but he blew me away. I love a classic rim running big man. He reminds me of a young Deandre Jordan.", "label": 0}
{"text": "Anyone remember when Kuzma was being put above Tatum by Lakers fans?", "label": 0}
{"text": "And that is wraps for his disappointing career", "label": 0}
{"text": "Wemby was a chucker and turnover prone last year and in the olympics too", "label": 0}
{"text": "2015 and thr 2016 Rockets DEFINITELY were especially when u factor in who was actually playing and shjt", "label": 0}
{"text": "they need to add that \"BLOCKED AWAY BY WEMBANYAMA\" to 2k for more variety", "label": 0}
{"text": "**Replays/alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "label": 0}
{"text": "Luka does look like the meme now.", "label": 0}
{"text": "JB been way better at  shooting free throws to start the season", "label": 0}
{"text": "It’s because he has a tendency of putting some players down, like Dwight, Rudy and JaVale McGee.", "label": 0}
{"text": "We know better", "label": 0}
{"text": "This is the wizards that I’ve known to grow and hate 😢", "label": 0}
{"text": "lol its a new account with a similar name too he must've gotten his main banned or something.", "label": 0}
{"text": "Well last year Spurs were one of the worst 3td quarter teams IIRC. \n\nWouldn't be surprised if Mavs blow them out here", "label": 0}
{"text": "Don't nurses typically work 3 days a week though?", "label": 0}
{"text": "Compared to vic he is", "label": 0}
{"text": "“treated their team” man gtf on. broke back tony parker who couldn’t even make it past 2 games in the rockets series had the nerve to publicly badmouth kawhi for not rushing back after getting his ankle blown out by a cheap shot the next round which he saw with his own two eyes. he already brought them a chip and stopped another 3 peat the year after he left. go figure", "label": 0}
{"text": "Kuzma eat popcorn with movie butter before the game?", "label": 0}
{"text": "They can give recommendations as a doctor but if Kawhi literally says “my knee hurts and I don’t feel comfortable playing, I will not play” what could the team do?", "label": 0}
{"text": "Justin Jefferson is insane", "label": 0}
{"text": "My torn meniscus and ruptured achilles were both in my left leg. My basketball career is pretty much over at 40.....but I didn't make millions :(", "label": 0}
{"text": "theres a black ops 6 already? i remember playin cod4 in high school. man im old lol", "label": 0}
{"text": "Bait used to be believable now we got Ben Simmons of bait trynna be Lebron. Your not that guy pal", "label": 0}
{"text": "That's the point, they're not steel workers or nurses but basketball players that just happen to generate millions (billions) in revenue. They're valuable to a certain point that the NBA needs to figure out.", "label": 0}
{"text": "Best I can do is a 3peat", "label": 0}
{"text": "Eh, it is and it isn’t.  One of our biggest complaints last season was when Klay would make some really confounding decisions and momentum would swing, directly costing point swings that add up and do get shown by the stat.  Over time, it’s hard to ignore the coincidence aspects of +/-, IMO.  Still, I agree it‘s fairly useless without context.", "label": 0}
{"text": "As an owner of the 2's, they're not great shoes. Also they're crazy hot on your feet. I like the profile but I don't do anything athletic in them, too clunky.", "label": 0}
{"text": "\"Kawhi is an adult, not an underaged child. He can make his own decisions.\"\n\n  \nBeing an adult and having the ability to make your own decisions doesn't mean that nothing happened. If these things did happen, he SHOULD speak up about it, but we've seen Kawhi over the years. Dude doesn't like to talk.", "label": 0}
{"text": "thats not a dunk attempt lmao", "label": 0}
{"text": "https://i.redd.it/xp78va3fdgt61.jpg", "label": 0}
{"text": "Take away their pick swaps and then 2030,2031,2032 and 2033 first round pick. I'd also put a salary penalty meaning they have to be under the cap for 4 years straight. \n\nOverall it's harsh but it would ensure no team tries to pull this stunt again.", "label": 0}
{"text": "His body really failed him. Sucks really bad.", "label": 0}
{"text": "Wouldve clipped it if i could😔", "label": 0}
{"text": "Wingstop", "label": 0}
{"text": "Also Stephs shooting form is learned and consistent for him but his fundamentals are not something you should teach anyone. When the Splash Bros were on fire the usual take was if you want to learn how to shoot don't watch Steph watch Klay because Steph has no business making the shots he makes at the rate he makes them with the crazy tight and quick release he has and the constantly off balance platform. It's like if you want to learn how to throw a football watch Tom Brady not Aaron Rodgers because one is incredibly fundamentally sound and one has learned with rep after rep to do things well that most coaches would tell you to not do at all.", "label": 0}
{"text": "Lmao, the airball 3 gonna be his signature move atp", "label": 0}
{"text": "Twas a joke\n\n\nBut also the NBA is the prime time example of why unions are important and that they work\n\nI definitely don't generate that much revenue, but employees also definitely don't get 50% of revenue", "label": 0}
{"text": "I think he is going to be able to play better defense by not playing in a motion offense and conserving energy. He won’t be as good on that end as he once was, but I think he can be better on defense than he has the last couple years.", "label": 0}
{"text": "Is Kyle Kuzma the most unserious player in the nba?", "label": 0}
{"text": "The Wingstop bags lmaooo", "label": 0}
{"text": "Bout to bag it up", "label": 0}
{"text": "Yepppp", "label": 0}
{"text": "Wingstop doing too much wtf now on player walk ins", "label": 0}
{"text": "Wembys self creation is kinda mid this has to be his bread and butter", "label": 0}
{"text": "We hope you're right. Lag for Flagg, baby", "label": 0}
{"text": "He's still 7 feet tall", "label": 0}
{"text": "Okc and Nuggets both sullied by sponsorship lmao", "label": 0}
{"text": "Luka last year was a good defender", "label": 0}
{"text": "“That was unsullied by sponsorship since…” lmaooo", "label": 0}
{"text": "No preseason for Luka and 40 minute preseason for Wemby. To be expected.", "label": 0}
{"text": "Bro is dressing like it's the early 2000s", "label": 0}
{"text": "Fyi: sam darnoldo is back balling on them hoes", "label": 0}
{"text": "Again kind of like Charles said .. it’s basketball …when we’re talking about health risk .. gotta stop acting like the nba is some under paid over worked .. with no benefits laborers", "label": 0}
{"text": "This game is a great example why Poole is fool's gold. Looks awesome when he's streaking then he scores 5 points for the rest of the game and shoots the team into a 20+ point deficit.", "label": 0}
{"text": "Funny thing is SA is still winning in Dallas despite this. Wemby is always impactful even on an off night. That's why you take him over stat pad triple doublic.", "label": 0}
{"text": "He tried and got bitched by Lively\n\nEven Luka bodied him\n\nHe also doesn't have grit like Chet. Dude is soft af", "label": 0}
{"text": "Oh you’re a troll. Got it", "label": 0}
{"text": "Kyle Kuzmoment", "label": 0}
{"text": "yeah, but at least he works harder than proven nba superstars", "label": 0}
{"text": "I've never been\n\nAny good?", "label": 0}
{"text": "Currently down 20", "label": 0}
{"text": "Let's just put all the players into a hat every offseason and randomly assign them to a team.", "label": 0}
{"text": "Do you think he will be better than LeBron? Or atleast a top 5 player of all time?", "label": 0}
{"text": "I'm not buying his jumper right now, I thought he shot like KD based on the hype", "label": 0}
{"text": "this shit is so weak. do better", "label": 0}
{"text": "First of a million in one season...", "label": 0}
{"text": "Just thinking , how come the Clips were able to ‘force’ Kawhi to return soon and play heavy minutes, unlike what he was able to do with the Spurs?", "label": 0}
{"text": "It's so Mavericks to see him in a weird jersey", "label": 0}
{"text": "I thought only Trump had opinions this bad", "label": 0}
{"text": "His response to me here was to instantly shit on the Celtics lol, guy clearly has something going on in his personal life", "label": 0}
{"text": "Who can defend that though? Besides wemby", "label": 0}
{"text": "?? How would they get flagg? Impossible", "label": 0}
{"text": "He can be a hater and give his honest opinion. It’s possible to have a hater mindset", "label": 0}
{"text": "in the six years since noel left dallas you’re the first person to have ever commented on my flair", "label": 0}
{"text": "Yup, there is a Black Ops 6 already, and every CoD since 4 has played exactly the same. They could be mission packs. Activision has FIFA-ized shooters.", "label": 0}
{"text": "Shades of OKC Wiggins ", "label": 0}
{"text": "I'm mpre surprised by the travels called, didn' know that was still a rule lol", "label": 0}
{"text": "Because its hard to guarantee the sixers will have a 30 point lead in 33% of their games this season, and he missed 40 games last season so it's also hard to say it worked.", "label": 0}
{"text": "We’ve settled on Capture the Flagg as the slogan btw", "label": 0}
{"text": "It's not about being a standout player, however. I don't understand why anyone thinks that Embiid wouldn't want to play 82 games, healthy if he could. If Embiid had the magic ability to not get injured in the playoffs, which he has for the last six years, why would a 30ppg scorer sit games and not be stat stuffer and bolster his MVP case? \n\nIt's completely opposite thing to do for a player that is thinking about himself and notoriously considered by fans around here as a whiny, self centered man.\n\nGuy X has frequently missed time in playoffs, the trophy decider part of the season. He says to the press, \"okay I won't do some of the things I did for the last half decade because I'm 31 with big man knees and need rest. I'll do something different and not play b2b games because this method hasn't worked so far.\"  the\n\n implicit slash explicit message is that he wants to be there in the playoffs for his team and wants to go make a deep run. Not once did he say anything about the number of games for the rest of the league. It's just a man recognizing the limitations of his body and adjusting appropriately. How is any of that snobby, lazy, stuck up, complaining?", "label": 0}
{"text": "It wasn’t just his full speed, it was that it felt like he could do it going like sideways and take off at full speed like that. I remember thinking he looked like he just had wheels for feet that could rotate any direction. It wasn’t just downhill speed, MVP year Rose was absolutely insane", "label": 0}
{"text": "He got hurt", "label": 0}
{"text": "He's getting carried lol dude aint impacting shit", "label": 0}
{"text": "following in the footsteps of hornets legend tre mann", "label": 0}
{"text": "This one needs to be banned to lol", "label": 0}
{"text": "is jason kidd actually shorter than 6'4 or did he just shrink with age? he doesnt look like he clears 6'2 when you see him next to kyrie", "label": 0}
{"text": "That’s for being this up. Also he has connections on University street in Toronto (Hospital Row). Pretty sure Kawhi’s daughter was born in Mount Sinai, top top hospitals in Canada.", "label": 0}
{"text": "Steve Nash was also almost a foot shorter and 100 lbs lighter than Embiid.", "label": 0}
{"text": "Shit is wild man …people act like it makes them part of some revolution lol \nJust seen a comment of “just play him a quarter..on b2b.. fuck the league” \nLike honestly what are we talking about here", "label": 0}
{"text": "I have always hated the lakers and lebron but man JJ is gonna get me to love this team lol", "label": 0}
{"text": "D > o", "label": 0}
{"text": "He was right about all of them. Dwight was super limited on offense and never got better. Rudy is a one dimensional player. Javale was a total clown until he decided to become serious after he got that label.", "label": 0}
{"text": ">Namely, Kawhi is an adult, not a child\n\n\nIdk, adults speak Kawhi has never said damn shit since ever regarding his knee and the handling of it IIRC", "label": 0}
{"text": "Yes, but Embiid’s body can’t handle the NBA season.", "label": 0}
{"text": "He travels after the gather step when he leaves the ground with both feat", "label": 0}
{"text": "Lmao kuz thought he was him", "label": 0}
{"text": "Probably wearing flatter shoes plus aging", "label": 0}
{"text": "I respect the dedication of this hater", "label": 0}
{"text": "alright I'm not about to sit up here and argue with you when homie is talking about Klays skin tone. we obviously have bigger fish to fry.", "label": 0}
{"text": "is jkidd 6’4 flat or 6’4 when they measured with shoes?", "label": 0}
{"text": "It's been SO long since I've been I can't even say. There are hardly any on the east coast", "label": 0}
{"text": "lol yeah for real. The dude literally ghosted the spurs. Was rewarded for it with a trade to a contender and won a ring. The dude was a top 5 player with as much leverage as any player could have. Yet all the sudden the clippers (of all franchises, lol) were able to force him to play? Right.", "label": 0}
{"text": "Because not every defender be as bad as Luka was on this play ", "label": 0}
{"text": "Both teams: *making shots is lava*", "label": 0}
{"text": "Saw that worst starter in the league poll this offseason lol.", "label": 0}
{"text": "“Played college ball, you know.”", "label": 0}
{"text": "Yeah, like Maxey, Fox, and Ja I would say have freakish speed right now, obviously Rose and Westbrook from the previous generation were also absolutely insane to see fly down the court in their primes.\n\nTrae is fast but like you said, it doesn’t look like freakish athleticism that he was born with that he would be good at regardless. He has that freak athlete shit in his mind and hand eye coordination.", "label": 0}
{"text": "reggie miller loves a good stroke", "label": 0}
{"text": "Flagrant?", "label": 0}
{"text": "My favorite moment of last night was a sole Suns fan sitting Courtside who started to chant \"miss\" at the Clippers shooting free throws and I could hear him in the nose bleeds. Dude was on a mission to match the wall all by himself.", "label": 0}
{"text": "Wtf 1 hand is crazy", "label": 0}
{"text": "What a miserable post history. Get some friends homie", "label": 0}
{"text": "sochan back to 1 handed? he did 2 handed during preseason", "label": 0}
{"text": "Harden??!!! What are we doing? What championship level experience was Harden going to create for Russ?", "label": 0}
{"text": "Chuck's all-time record hahaha", "label": 0}
{"text": "being a shooter /=/ can shoot the ball lol", "label": 0}
{"text": "Funny thing about the Denver fans is in their sub even when they don’t play the Lakers, all they can talk about is LeBron, and the Lakers lol", "label": 0}
{"text": "He’s funny, and I love him. I wonder tho if he’s bad for the league’s image. Can’t be good having the main nba talker be someone who consistently trashes the product.", "label": 0}
{"text": "They need Jamal Murray to play like he’s actually worth 50mil a year", "label": 0}
{"text": "LeComplaint", "label": 0}
{"text": "They’re gonna be super disappointed when someone tells them there’s no playoffs in the premier league and 3rd gets you nothing", "label": 0}
{"text": "They have Aaron Gordon. That's a weird fit", "label": 0}
{"text": "They need to ride their starters and find quality role players. They have arguably the best player in the world right now, you don’t waste that opportunity.", "label": 0}
{"text": "It definitely puts you on that trajectory. 8 guys besides Jokic have won three MVPs and 7 of them are top 10 all time", "label": 0}
{"text": "> Top NBA players really value intense competitors. \n\nThis sounds really poetic but do people really think NBA players watch their teammate running really fast and blowing layups and think \"this mf is really *competing*\"?", "label": 0}
{"text": "Jokic pushed for the Westbrick special thinking he could fix him.", "label": 0}
{"text": "I thought he was talking about Russ no need to come for me. He ain’t word his comment right", "label": 0}
{"text": "Honestly I feel like people are overreacting a bit. Yes, Denver is worse than they were last season and they absolutely should have done more in the off season to get more shooters. But people are acting like they’re doomed just because they lost 1 game to what is probably the 2nd best team in the league.", "label": 0}
{"text": "think it's this one maybe\n\nhttps://www.youtube.com/watch?v=jNOMQJ6NFs4", "label": 0}
{"text": "Aww, I didn’t see the presser. Didn’t know he mentioned Reggie. That makes me happy.", "label": 0}
{"text": "The NBA might as well be playing a completely different sport at this point and the league has so much more talent than it did them especially in the East.", "label": 0}
{"text": "I imagine the travel costs must have been pretty big.\nI mean, how often did it seem like Zach was in California when he lived in Connecticut? How much did it cost to have Zach travel to speak with people so he could write a feature about someone like Gary Harris?\n\n\nThis article from a prior set of layoffs mentions that some people wanted to continue to work even if they didn't have any expenses and they were told no:\n\nhttps://www.sportsbusinessjournal.com/Journal/Issues/2017/05/01/Media/ESPN.aspx\n\nESPN agreed to pay out full contracts, which in some cases lasted more than five years. Several reporters offered to continue working through their contracts without incurring expenses, but they were told they couldn’t.", "label": 0}
{"text": "i believe it was said that most people cant take those sharp turn that Messi did. shit i remember the goal that Thierry Henry talk about . He touch the ball with his left foot.  and while the ball was in the air he touch again with his left foot. \n\nIt was pulling an elastico like Ronaldinho  used to do, but Ronaldinho did it from a standing position. Messi did it while running fullspeed. That kinda shit is unteachable.", "label": 0}
{"text": "He's not a productive player, period. Even min salary players get critiqued if they're in the rotation.", "label": 0}
{"text": "KCP = Keep Championship Players", "label": 0}
{"text": "WELCOME TO!", "label": 0}
{"text": "It would be really cool for someone to retroactively go back and do this for past seasons as well.\n\nWe could get really nerdy stats about who was the “best” value season by a player of all time.\n\nProbably it would be someone young/on a rookie deal, like Shaq or Duncan.", "label": 0}
{"text": "Not many people know this, but once your net worth exceeds $20m, you become immune to physical ailments.", "label": 0}
{"text": "From a fan perspective.. Westbrook is one of my favorites.. don't even need/want to see him shoot. Just want to watch him be a psycho on defense and just a crazy athlete.", "label": 0}
{"text": "I guess im too American to understand what a middle of the road truth is in this context. ima bit flummoxed.", "label": 0}
{"text": "This one ain't on Russ. He was bad, but so were a lot of other players. Malone has to step down from that cloud 9 he's been on since the chip. No more friendly coach. He's gonna start barking hard at the players.", "label": 0}
{"text": "Forgot about Simmons, fair call. I put lol next to Steph because it's pretty evident who he got to play next to, I didn't feel like it's worth mentioning at all. You can see my flair", "label": 0}
{"text": "Abortions and guns it is then!", "label": 0}
{"text": "He's literally the last player you would want young guys using as an example.\n\nAnd people still don't get that it doesn't matter if he's on a vet min, he's such a massive net negative on the court and seemingly can't be benched. Any good team would be better off paying him more money to never play.", "label": 0}
{"text": "well he can do middy or 3's if his inside game is already solid, currently they ranked Wemby so high, and I hope he is not like this for a whole season or even for most of the games,", "label": 0}
{"text": "He has, but still technically never an allstar.\n\nI also think the MPJ contract was a necessity.  Keeping a 6'10\" sharp shooter is hard, especially in small markets, we had to do it.  It got us a chip, no matter what happens I will never regret it lol.  He is streaky, last night he was down pretty bad lol, but I still think he is going to have a great season by the end.", "label": 0}
{"text": "tbh no one is the shooter that Kennard is. He's quietly a top 5 shooter in the league", "label": 0}
{"text": "They're not comsider top 10 guys because of their mvps though", "label": 0}
{"text": "Taj's a dawg, he'll play defense and hustle for boards till he's dead on the court. But yeah, he's been well and washed for a few years now. Last year he was basically out of the league, barely played 20 games and the Knicks had a whole mini-retirement ceremony for him. \n\nBut the thing is, the Hornets are seriously attempting a complete culture overhaul for their team. It's like their whole mission for this year. Change. Hornets. Culture. And Taj is well known to be one of the most humble, hard-working, lunch pail guys in the league. Doubt he'll play more than 20 games this season. Wouldn't be too surprised if the Hornets try to get him off the roster later in the year. But the Hornets need a mature bench presence, and Taj can't complain about another NBA contract and getting to hang around the game he loves. Works for both sides.", "label": 0}
{"text": "Ya that’s odd how nobody has ever scored 25 points in each of the first two games.", "label": 0}
{"text": "They probably need to flip MPJ for 2 players, their depth is abysmal. But they need Murray to look great again, without him they are no real contender, no even for the West title.", "label": 0}
{"text": "glad we figured that out", "label": 0}
{"text": "They should've just stuck with the original name -\n\nThe Hospital of the New York Society for the Relief of the Ruptured and Crippled", "label": 0}
{"text": "People who use the word simp unironically in the big 2024 lol", "label": 0}
{"text": "They got the best player in the league for the past 4 years at the 41st pick, and won a championship. \n\nWhat more do you want?", "label": 0}
{"text": "Shocked they let KCP walk", "label": 0}
{"text": "KD and Russ?", "label": 0}
{"text": "The Timberwolves demise was greatly exaggerated", "label": 0}
{"text": "If I had a nickel for every time a team replaced KCP with a washed Westbrook I’d have 2 nickels", "label": 0}
{"text": "KAT also has disappeared in the playoffs for most of his career -- I just think it was strange that in r/nba's mind KAT became a top 20 player and Randle became a bottom 100.", "label": 0}
{"text": "It’s fun to imagine Luka + Jokic + kyrie + klay. Honestly would be unstoppable", "label": 0}
{"text": "It's disappointing to see Denver win a title and then over the next two season gets worse and worse. The front office tried to be too smart with saying how great their development system is with young guys and they clearly were nowhere near ready to be very impactful players.", "label": 0}
{"text": "Ok good point, maybe 18-25yo Lebron would have killed to play with Jamal Murray. Not really as relevant post 2010 though.", "label": 0}
{"text": "That's kind of my point. A vet on that money should be an example.  \n  \nAnd it's why so many other teams passed on him.", "label": 0}
{"text": ">Russ is at his absolute best when he’s surrounded by bums, because he can raise the floor. He’s at his absolute worst when he’s surrounded by talent, because he lowers their ceiling.\n\nThis is actually they key.  And why he can work here.  Running the bench unit with the ball in his hands is where he will be most useful, and we don't need our bench to be great, we just need it to not be bottom 5 in the league.  Running him with a Jamal stagger, largely playing off-ball will never work with Russ, and minimizes the only thing he is still good at lol.", "label": 0}
{"text": "16/7/1/2/2 on 8 for 15 shooting from their 5th starter is average?\n\nI'm hoping Kuminga or Wiggins can consistently put up 80% of that and they're likely the Warriors #2 or #3 offensive option most nights.", "label": 0}
{"text": "It’s 2 games dude", "label": 0}
{"text": "\"But he's hurt\" he has millions as his disposal to get the best medical and sport science work done, but this fat baby faced fuck can't be bothered to even maintain weight. These Embiidi sycophants are absolutely insane.", "label": 0}
{"text": "I don't know. He's taller but he seems to get into more foul trouble.", "label": 0}
{"text": "Russ is on a 3 million a year contract. He’s serviceable at that point and shouldn’t be the scapegoat just because he’s a big name.", "label": 0}
{"text": "It’s just a circlejerk \n\nThe Nuggets FO let KCP leave, but it’s apparently the fault of a 36 year old that they signed for $3 million", "label": 0}
{"text": "That was for when he went for 60", "label": 0}
{"text": "\"He's still in the league!?? \" is actually the correct answer to any garret temple question.", "label": 0}
{"text": "He's actually retired", "label": 0}
{"text": "Julian is literally the same player. \n\n You wanting to replace a backup pg with wing players shows how dumb you are tbh.", "label": 0}
{"text": "Russ will push a team to give their best, while he is -34 in 20 min.", "label": 0}
{"text": "This is so disingenuous", "label": 0}
{"text": "\"We are not a good shooting team, so we added Westbrook\"", "label": 0}
{"text": "If he gets to his 35% clip then I’m all for it. Fuck it lol.", "label": 0}
{"text": "I always bring that up when people criticize trae haha, it was legitimately super impressive. But still, I think it's kind of dumb that someone could lose the scoring title for getting a minor injury where they have to sit after playing for like 5 mins. I think it should be kept at ppg, just with a heavy minutes played threshold.", "label": 0}
{"text": "crazy fan fiction right here", "label": 0}
{"text": "Either way, there's nothing anyone can do about it. Eat those fucks.", "label": 0}
{"text": "where are there two posts for the exact same quote as #1 and #2 lol", "label": 0}
{"text": "Cam Johnson and Cam Thomas from the Nets would be great fits for the Nuggets.  \n\nJohnson is a perfect compliment for Jokic, a long stretch 3 who plays smart.  Thomas is real fire power that can provide the 1-1 scoring they need when not running through Jokic.  Both can be had from the Nets, but the Nets won't want Porter Jr or Murray back.  Would need to be a three team trade.", "label": 0}
{"text": "Nikola “Jerod Mayo” Jokic", "label": 0}
{"text": "Who was the doctor’s agent who negotiated the surgery fee though? We need to know", "label": 0}
{"text": "i have never seen a man hotter in the nba than when klay had his 37 pt quarter, love watching that guy when he hits everything", "label": 0}
{"text": "they would have to move on from AG for sure, siakam would play that exact same role while bringing 5x more to the table", "label": 0}
{"text": "ah, the snl-comedian-who-feuds-with-andy dick guy", "label": 0}
{"text": "Funny thing about the Lakers fans is even when a post isn’t about the Lakers, they still try and find a way to make everything about the Lakers.", "label": 0}
{"text": "i’m no medical professional but i feel like you never want to end up in the hospital for special surgery", "label": 0}
{"text": "and created open looks from 3 that we cashed on since he got doubled in the paint, Randle has one of the highest double rates in the NBA", "label": 0}
{"text": "Did you watch the game?  Braun was an absolute menace.  Help SGA to just over 40% from the field, had 2 steals and 2 blocks.  He is switchable 1-4, where KCP was always in trouble on 4s, and often in trouble on bigger 3s.  If we had made the move to Braun on Ant last year in the Minne series earlier we might have won that series, Ant was absolutely cooking KCP but in a torture chamber with Braun on him.  \n\nSpacing is the key issue with Braun versus KCP, in theory MPJ and Jamal are the answers to that, but everyone shot like shit last night.  \n\nWe will see how it goes over the season, one game is simply too small a sample size for meaningful analysis.  But I expect Braun to be at worst a sidegrade to KCP.  The place it hurts us is losing Braun bench minutes, and who will make up for those.", "label": 0}
{"text": "Think about that comment for a few minutes lol might even want to look at some pictures of him as well over the years.", "label": 0}
{"text": "Those are both true", "label": 0}
{"text": "If he just never touched the ball, aside from rebounding and immediately passing it, he would be fucking great.", "label": 0}
{"text": "If I'm being a bit more clear: he's at his best when he's surrounded by bums and gets to have *volume.*  For example, when PG+Kawhi went down against Phoenix, Russ became captain of the ship and he made us competitive in a lot of games.\n\nBut as a bench player leader?  Russ had incredibly mixed results and then you start to game plan around his deficiencies.  Staggering is a key part of good rotations, and *avoiding* staggering because Russ is better with bums is a stupid strategy.\n\nThis was exactly our issue with Russ and you'll face it too: you should never, *ever* cater such a big strategy to a minimum player like that.  He's meant to be a role player, but his playstyle and strengths almost demand otherwise.", "label": 0}
{"text": "Come on. He is coming off one of the worst benches in the league. His +/- will be jacked up the entire season.", "label": 0}
{"text": "Joe Smith and the Wolves......oh wait", "label": 0}
{"text": "Getting old sucks, slowly forgetting all the niche nba knowledge", "label": 0}
{"text": "Point is, I don’t think anyone believes Harden would ever truly lead a team to a ring no matter what. You either win or you don’t. I won’t compare that to Bron, match ups and playing styles matter. Apparently Russ’ teammates love him too, when did locker room affection become the metric. Hey “the community” loves this guy or that guy, you just don’t know enough about a guy to degrade them the way folks degrade him.  Maxey said? Come on man, if you take a poll with teammates you’d likely hear similar stuff about a lot of players. I’m not an apologist, he hasn’t played great but I think the expectations have been too high for what was clearly going to be his output and that’s not his fault. Shame on Russ for not making the shit pop for Anthony Roberson and Dion Waiters.", "label": 0}
{"text": "Give Shea Serrano and Jason Concepcion’s Six Trophies a look, my favorite NBA podcast out right now since the Lowe Post went away", "label": 0}
{"text": "They didn't have assets for siakam and ag isn't worth 2nds lol", "label": 0}
{"text": "maybe, but I think demar doesn't like shooting threes, and I think wemby doesn't like rim rolling. His shot diet is genuinely concerning and I think it's coming from him wanting to take those shots.", "label": 0}
{"text": "Exactly. Sorry if I was being pedantic. Have a great weekend!", "label": 0}
{"text": "This sub is really trying to blame the dude who who was the second best nugget on a rookie contract instead of the 3 players getting paid 30 million who couldn't hit a barn.\n\n\n16 and 7 on over 50 shooting or the people who went 14/43 from the field and accounts for 75% of the cap....If you think the 16 and 7 on a rookie contract is the problem you are completely brain dead.", "label": 0}
{"text": "I think because he was snubbed from an all star game once by Sabonis.", "label": 0}
{"text": "That 1 championship was all it took for them to start talking about Jokic's legacy in the same breath as Shaq lol. In some cases, they were comparing Jokic's 'peak' with Jordan and Lebron's.. Bucks also won a chip recently and their fans were much better!", "label": 0}
{"text": "I agree with the decision stop shooting, but I think a half courter would've made it OK.", "label": 0}
{"text": "Tanking for the 6th pick", "label": 0}
{"text": "The things Donovan Mitchell wouldn’t say to Mike Conley when Conley was losing the Jazz games.", "label": 0}
{"text": "Its the first game in his second season nobody expects him to shoot as good as one of the greatest shooters of all time and nobody said that.", "label": 0}
{"text": "Seeing how he played, this isn’t surprising at all", "label": 0}
{"text": "Zach Lavine you are a nugget", "label": 0}
{"text": "Russ is by all accounts an amazing dude (aside from his intense hatred of being called \"Westbrick\" by fans, lol).\n\nEnd of the day people just enjoy working with good people.", "label": 0}
{"text": "Expected to go between Lakers and G-League, but mostly G-League", "label": 0}
{"text": "I'm number 2.", "label": 0}
{"text": "Bingo. They knew Bruce brown was walking and traded their last 1st for 3 mediocre rookies", "label": 0}
{"text": "Not at all - an important point, IMO. You too!", "label": 0}
{"text": "He’s going to stay in the G League nearly all season and make an occasional appearance or two in blow outs. Unless Daddy LeBron complains about his playing time, I don’t think we’re going to see him in another minute of competitive basketball", "label": 0}
{"text": "Good. The G League will be great for him. The cardiac arrest fucked his short college career so there’s a lot of unused room for development.", "label": 0}
{"text": "Welcome to the NBA, where traveling and carrying are not called. Good luck!", "label": 0}
{"text": "Now this is true future proofing", "label": 0}
{"text": "I genuinely hope he does well, but what do the lakers do if he's unplayable even on their G league squad?", "label": 0}
{"text": "Yeah that's fair. 6' isn't though.", "label": 0}
{"text": "How old do we think he really is?", "label": 0}
{"text": "Jokic can not play 48 minutes per game. He ran himself into the ground and it cost them the series against Minnesota. Jokic was gassed as fuck come game 7.\n\nSo the idea behind Westbrook is a guy who can be a playmaker and run the floor for them when Jokic is resting.", "label": 0}
{"text": "OKC has a ‘27 one I believe.  I mean, of course they do.", "label": 0}
{"text": "Played him a few minutes first game to appease the crowd and get it over with. Now back to regularly scheduled broadcast.", "label": 0}
{"text": "Years of being the Knicks' sole offensive engine has made wonders for his decision making, you don't even the the Beyblade™ turnovers that often now.", "label": 0}
{"text": "Hopefully not", "label": 0}
{"text": "He played 25 out of 33 USC games last year", "label": 0}
{"text": "Udonis Haslem from Wish", "label": 0}
{"text": "Wait till you find out what the Mavs did last year without Klay", "label": 0}
{"text": "Call me a reactionary doomer, but today I saw exactly what I've been afraid of.\n\n\nThis team has crossed the Rubicon of shooting. They don't hav enuff. If they don't get serious shooting development from someone already on the roster -- Jokic, Braun, or Strawther, probably --- then they need to trade for shooting, and if they don't do that, they're not getting home court this year.", "label": 0}
{"text": "Nobody said it was the same but it’s still a superteam dominating an individual matchup that deserves context lmfao.\n\nIf you’re gonna say discredit KDs warrior record against Bron then discredit Bron’s Heat record against KD too.", "label": 0}
{"text": "Seriously, rip through", "label": 0}
{"text": "Sochan forgot that Vic was in the paint to stop Derrick Lively and followed him, rather than switching onto Klay.", "label": 0}
{"text": "we all know you've been an asshole for years", "label": 0}
{"text": "players come back too early from all these injuries. I hope he takes like a year and half off.", "label": 0}
{"text": "No Typhlosion", "label": 0}
{"text": "He’s not even the worst player in the parent squad, so he probably won’t be unplayable", "label": 0}
{"text": "Breaking news, 2nd round pick spends time with G-League", "label": 0}
{"text": "Hot take, he’s kind of always been a good player during the playoffs might I say similar to Jimmy B", "label": 0}
{"text": "Non compete clauses became illegal this past September \n  \n“Non-Compete Clauses Now Illegal\n\nAs of April 23, 2024, the Federal Trade Commission (FTC) has issued a final rule banning non-compete clauses nationwide, effective immediately. This means that employers are no longer allowed to include non-compete agreements in new employment contracts or enforce existing clauses that restrict workers from switching employers within their industry.”", "label": 0}
{"text": "Kid will likely bounce around the league a bit and then go play in Europe or something. He won’t stick unless his dad buys a team.", "label": 0}
{"text": "I feel like his career is done after this.  Mainly because the pacers felt like his last chance to prove himself.  Idk how y'all see it but I just don't think the league is willing to take a ride with him.  I hope for the best and a good recovery so he can play somewhere. ", "label": 0}
{"text": "wait but this sub told me his daddy was gonna force the lakers to play him during the regular season!", "label": 0}
{"text": "Wheres Trae?", "label": 0}
{"text": "[https://x.com/YoungNBA/status/1849257745075392914](https://x.com/YoungNBA/status/1849257745075392914)\n\ni'm trying to find a video where they zoomed out, they did have a shot of it during the game and it looks crazy. it just looks like thousands of people stacked up on each other", "label": 0}
{"text": "The main reason is because the west is *so* competitive, that every win matters.  It's the same reason Kawhi attempted to come off the bench post injury--to ease back into things.\n\nThe Clippers team spent their entire summer and training camp with Russ being the lead guard, whereas Harden simply wasn't in shape.  From purely a \"how can we maximize our chance of winning more games,\" this was likely a smarter decision.\n\nThat being said, there's simply no way that the locker room dynamics would allow for this.  You get Harden, you play him.  That's basically what you'll abide by, just like you give Russ a shot at starting with your stars.\n\nAll that being said: what gets forgotten in a lot of this is that Plumlee getting injured made us insanely small, and we waited for Theis to reach a buyout before making any moves. I'm not sure anything was fixable, but LAC's approach to last season was always going to fail because the roster composition was janky and it was 1000% reliant on Kawhi being healthy.  We literally had no other proper PFs outside of PJ Tucker and Kobe Brown.", "label": 0}
{"text": "That’s pretty neat. I dunno if this is possible with how you’re doing this, but one possible improvement would be to use exact TS% rather than estimated TS%. I *think* you’re using the estimated version with the 0.44 coefficient, but for single game sample sizes it can be off.", "label": 0}
{"text": "I’d love to know if there’s a clean censored version out there. My young kids would love watching but there’s too much language", "label": 0}
{"text": "you don't play sports do you?", "label": 0}
{"text": "Honestly yes, because they consistently say it. A season of basketball is a physical and mental grind and someone keeping the team engaged through it matters. \n\nThanasis is only a garbage time player but a couple of former Bucks have talked about how important he was to team chemistry in the training and off the court.", "label": 0}
{"text": "I know it’s not going to happen, but I’m curious if Ingram for MPJ could be an option. Pelicans need more off ball shooting, Nuggets need more creation outside of Jokic/Murray. Also, Julius Randle for MPJ looks decent for both sides, but I don’t see the Wolves and the Nuggets trading at this moment.", "label": 0}
{"text": "Well usually it means you need medical care but it is one of the most renowned medical institutions in orthopedics and sports medicine.", "label": 0}
{"text": "Cool design, and I like the url statline.app\n\nSome players stats arent showing ie Risacher", "label": 0}
{"text": "Dirk \n\nSteve Nash \n\nKidd \n\nIverson", "label": 0}
{"text": "He Hate Me.\n\nWhat other random athlete names did we have then.  I feel like there was another big one.", "label": 0}
{"text": "He already did ", "label": 0}
{"text": "I honestly blame the new CBA more than the FO being incompetent. The 2nd apron rules make it extremely difficult to keep a championship core together.\n\nThey had to pay Jamal, MPJ, and AG to keep the core intact, which didn't leave enough money for a competent 5th starter - they had to let both KCP and BB walk or they would've been over the 2nd apron. Once you're over that threshold it's not just expensive but handicaps your teambuilding - no more sign & trades, no more multi-player trades, can't include cash in trades, no signing players who were bought out. It's crazy prohibitive.\n\nThe only alternative was letting either MPJ or Jamal walk, but Denver's a small market and there's not a lot of chance of attracting stars to replace them.\n\nThe T-wolves made the conference finals last season and still traded KAT to dump salary and stay under the 2nd apron. The C's are over the apron and will need to dump salary next season; they won't be able to keep Tatum-Brown-Porzingis-Holiday together long-term. OKC has a great young core but they're going to lose their roster flexibility once Chet signs an extension. The CBA's a dynasty killer.", "label": 0}
{"text": "> but teams will scheme him IN to your offensive plan and it’s unavoidable unless you bench him.\n\n You're absolutely right about everything and the most interesting part of it is that its not subtle or seemingly difficult for coaches to do this. I think if Russ gets an open 3, he shoots it 100% of the time and most defenses accept those odds. Russ gets some pretty great looks for a player of his reputation and accomplishments.", "label": 0}
{"text": "I can’t imagine how his body feels with the mileage he’s put on it. \n\nI’m 34 and played college ball and there are days where it’s hard to get out of bed because of my back injuries. Embiid is a lot bigger and has played a lot more than me in his life. Maybe his shit just hurts real bad and he wants to be able to walk when he’s 50", "label": 0}
{"text": "Bron knows sitting at the end of the Lakers bench all year ain’t good for Bronny’s development", "label": 0}
{"text": "Joe Harris and Korver have higher efficiency but yeah", "label": 0}
{"text": "Christian Braun had a decent game still. The problem is Jamal Murray.", "label": 0}
{"text": "Now that would explain a lot of things", "label": 0}
{"text": "But r/nba told me LeBron was going to sabotage winning by forcing Bronny minutes?", "label": 0}
{"text": "Good gooseneck though, Russell. Remember to follow through.", "label": 0}
{"text": "lol Yeah, I’m huffing the same hopium you are.", "label": 0}
{"text": "3.6 and not enough games.", "label": 0}
{"text": "imagine being as good a shooter as Buddy already has been finding a jump to improve further with Steph", "label": 0}
{"text": "Jokic didn't get to be who he is by not being passionate about playing team basketball.", "label": 0}
{"text": "lol that’s my point that it’s even more impressive than he makes it look because he does this stuff so often", "label": 0}
{"text": "The only place he was truly bad was on the Lakers. He was pretty good in the second half the year in Houston, was pretty good on the Zards, and was solid for a minimum guy on the Clippers.\n\nImo the fit is actually pretty clear, the Nuggets just seemed poorly coached in general? Was not a fan of everyone standing around on the perimeter while Jokic gets triple teamed in the post.\n\nFor Russ it's pretty simple, when Jokic is out, you play shooters around him and let him grab and go to push pace, defense collapses, pass to open shooter. They did this a couple of times and Russ found Murray for a wide open 3.\n\nBut the most common line up with Russ and without Jokic was Russ, Murray, Strawther, Watson and Saric. Porter wasn't in any of the line ups with Russ and no Jokic. They should be trying Russ, Murray, Strawther, Porter, Gordon. Defense isn't great but that's their best shot in theory. Also no Murray dribbling isos in that line up (happened a few times).\n\nWith Jokic and Russ, I'd want to see a lot of DHOs between Jokic and Russ to get Russ putting pressure on the rim. And you can also fake the hand off and the defense will still guard Russ going to the basket. It just creates movement which is something that was very lacking in the game against the Thunder.\n\nI think they should also put Russ in the dunker spot like the Celtics and OKC do with their guards. That way the defender isn't just leaving him open.", "label": 0}
{"text": "He has freakish eye hand coordination because of his training regiment too. Look up his training routine and how his trainer incorporates technology into his exercises. Steph is an outlier for sure but he adds to that with his work ethic.", "label": 0}
{"text": "Oh interesting - what's the formula for exact TS?", "label": 0}
{"text": "From THJ to Klay, Nico you are a god among men.", "label": 0}
{"text": "So all this fuss for 3 minutes? Lmao ", "label": 0}
{"text": "I for one am shocked by this reveal.", "label": 0}
{"text": "One of the young guys from the warriors once told a story about trying to train with steph and just thinking \"wtf is this, this is impossible\"", "label": 0}
{"text": "The pre hype was Ant was going to be The Guy in this series. Agree with a lot of these takes above", "label": 0}
{"text": "It's a rotation problem not only in how long they played him but who they have to play him with.\n\n\nIf he were playing with a bench lineup full of competent NBA 3-point shooters, it might okay. But he's not. The Nuggets don't have nearly enuff acceptable NBA 3-point shooters.", "label": 0}
{"text": "I mean, he just turned 20 and he lost his only college year to injury. I'm pretty hesitant to map out his whole career based on preseason only.", "label": 0}
{"text": "Thanks for checking it out :). Risacher is showing for me - here's what I'm getting:\n\n\n\nZaccharie Risacher 7 PTS/1 REB/0 AST/0 STL/0 BLK/1 TOV/ on 2/8 FG and 2/4 FT and 36% TS with 1 +/- in 19 MIN", "label": 0}
{"text": "Or if a horse somewhere wants to hang out.", "label": 0}
{"text": "Tor releases 2-3 chapters a week from the new book on their website to hype it up. \n\nhttps://reactormag.com/read-wind-and-truth-by-brandon-sanderson-preface-and-prologue/", "label": 0}
{"text": "Sort of, but a guy at 180lbs will always be able to outcardio somebody at 250", "label": 0}
{"text": "That might useful to have in your back pocket. Plays break down all the time. So when you need a quick reset and go, Russ on ball isn’t a bad idea. But using him as a cog is a bad idea.", "label": 0}
{"text": "The thing is now it's not really a mismatch with Vernon, it's just the match. I hope it works out though.", "label": 0}
{"text": "Poor kid's whole career is just gonna be a five second highlight in his dad's retirement video.", "label": 0}
{"text": "It's either that or he wants to be on Klutch payroll once TNT loses Inside the NBA", "label": 0}
{"text": "LeAgue G", "label": 0}
{"text": "He might develope into a servicable water Boy... maybe ", "label": 0}
{"text": "Lebron and Andy Varejao", "label": 0}
{"text": "Okay? Got anything to say other than that?\n\nPeople who are Sonics fans in big 2024 lol", "label": 0}
{"text": "How it should be. They had their moment, now he needs to develop against somewhat comparable competition", "label": 0}
{"text": "People were adamant he’d be starting lmao", "label": 0}
{"text": "Bronny wasn’t cleared to practice until November 30th, 2023, and he didn’t actually return to full contact practice until December 7th, 2023.\n\nMeaning he missed a full three months of training and practice due to the cardiac arrest.", "label": 0}
{"text": "No fuckin way he plays in Europe lol stop it", "label": 0}
{"text": "Good.", "label": 0}
{"text": "> f that was true anyone can be great runners or cyclist.\n\n99% have the capacity to be great runners.\n\nThey won't be goat runners, they won't Kipchoge, but anybody with enough work can be a great runner.", "label": 0}
{"text": "You guys continue to paint Lebron as some control freak that he simply isn’t lol", "label": 0}
{"text": "wait a minute r/nba was wrong about something? no way!", "label": 0}
{"text": "That’s awesome", "label": 0}
{"text": "who gives a shit", "label": 0}
{"text": "Agreed that’s why I said it puts him on the trajectory", "label": 0}
{"text": "I always love these posts because it feels like the doctor leaked this info for future nba patients", "label": 0}
{"text": "I think he retired", "label": 0}
{"text": "Sabonis can't handle the Randle\n\nbut I don't blame him no one can", "label": 0}
{"text": "This article is super annoying to read", "label": 0}
{"text": "I heard that. \n\nThis one time the Trailblazers had the Lakers down by almost a billion going into the 4th quarter in Game 7 of the finals. I'm not sure how it worked out but all the gambling odds said we won so I never bothered to follow up. \n\n2nd to 4th in odds the Mav's make it back right now.", "label": 0}
{"text": "He's literal cancer to every team he's on", "label": 0}
{"text": "They looked way more helpless in some of the playoff games against Minnesota, and OKC is an objectively better team (despite being foul-baiting floppedy-floppers or outright dirty when it comes to Dort).\n\nIf this continues there's a point but (pre-) judging an entire season by the opening game seems a tad premature.", "label": 0}
{"text": "oh so Jacoby was let go by ESPN too?", "label": 0}
{"text": "Some of the worst things ever I was reading. And there were reports saying he’d play with LeBron for a game then be sent to the G League. And it’s like people ignored that.", "label": 0}
{"text": "He needs minutes. the 4 or 5 a night he would get on the Lakers bench would only hurt his development.", "label": 0}
{"text": "I swear all these subs have are snarky replies and overreactions", "label": 0}
{"text": "They couldn't retain Brown as they didn't have full Bird rights. KCP though they should have just paid him.", "label": 0}
{"text": "Aight I can't type out all this harden shit again to someone that is clearly just parroting the same bs. You didn't watch games but like 5 minutes of research shows that prime harden was one of the best playoff performers of all time, and one of the greatest clutch playoff scorers of all time. If he was in the east he would have cruised to the conference finals or finals every year. From 2015-2020 the only teams he lost to in the playoffs won the championship or were the spurs. There's only so much that's humanely possible when you're carrying a shit roster up against a championship level roster.\n\nAnd the rest is just nonsense, they're both well liked in the locker room, the difference is Harden makes everyone he plays with better on the court, russ...does not, to put it kindly.\n\nAnd no I don't think you would hear a lot of quotes from a star player saying they would never be the player they became without their ex team mate.\n\nRuss on a vet min doesn't even matter, he's such a massive net negative on the court any good team would be better off paying him more not to play.\n\nHis only expectations are to be a vet min guy, a neutral to slightly positive guy that can add some things to the team. He can't even be that, any time he's on the court it's open season for the other team.", "label": 0}
{"text": "It is a homer take looking dumb af because how are you wrong about your own team lmao", "label": 0}
{"text": "I always hated Threads not being time-based, absolute ass for live events. Good enough for news since most of the brands and journalists are there but it's not the same for moments like the timeline cooking for a buzzer beater or a big dunk. Bluesky isn't all the way there yet but it's got the right ideas. Real strong college football community.", "label": 0}
{"text": "He was fantastic on both ends. There was really one possession where rhythm dictated he should have passed it back out to Luka instead of holding onto it to shoot an out-of-rhythm three. \n\nMore than adequate passer too, great entry passes to the bigs. Disruptive on the defensive end. Curious if this kind of performance is sustainable over an 82 game season for him, but this is the Klay they want to see in the playoffs.", "label": 0}
{"text": "I mean LeBron is the goat, so some hate is expected, but jesus you all give this kid such a hard time. He could be anybody else and he wouldn't be worth thinking about. But because he's the goat kid, ya'll give me maximum shit.", "label": 0}
{"text": "It didn’t really happen with the Wolves since they have so many big guards but there are definitely some teams where Bronny has a good matchup.", "label": 0}
{"text": "There is no argument for Reggie in skill level. Reggie might got him if we’re doing relative to era. That’s like bob Cousy vs Steve Nash", "label": 0}
{"text": "Word limit ass journalism", "label": 0}
{"text": "Man  this guy kinda sounds like a loser", "label": 0}
{"text": "Staggering is key, but staggering the right players to fill the holes in his game.  Staggering MPJ for a knockdown shooter to kick out to will be important.  Staggering Jamal to take the ball out of his hands?  Not so much.", "label": 0}
{"text": "This is what I'm hoping for with CP3/Barnes & Taj in Charlotte. The first paragraph part lol", "label": 0}
{"text": "actually agree with the first one", "label": 0}
{"text": "Even his response is streaky, well, average.", "label": 0}
{"text": "**Replays/alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "label": 0}
{"text": "Portis is more a Full Metal Jacket. You can see it in the eyes", "label": 0}
{"text": "I firmly believe the Knicks are not stronger and it's not because of the KAT trade itself but losing Hartenstein. His two man game with Donte, Playmaking, rebounding, interior defense that's all gone. Sure he can't shoot like KAT, but if you're running DHOs with the guy with the third most 3s it creates a strong level of spacing. \n\nWe never got to see Brunson/Donte/OG/Randle/Hartenstein with McBride, Hart, Bojan, Mitch off the bench for extended time. That's a better roster than what they have right now and there was a reason they went like 10-1 together. \n\nI dont think Bridges and KAT bring enough diversity to the offense considering there's even less passing/playmaking on the roster now. Once Hartenstein left, they had to pull the trigger on this trade to at least maximize talent and spacing around Brunson, but just think its a slightly worse team than last year when healthy.", "label": 0}
{"text": "Coaches, yes. But that's because sports psychology shows that insulting your team publicly is bad in pretty much every facet. Stay positive to everyone else, but speak the truth to your players.\n\nPlayers though, have two angles they take (in America), either they shoulder the blame which is very American style because of the whole \"pick yourself up by your bootstraps, be a leader\" type mentality, or they use corporate speak because again, blaming your teammates publicly is bad for locker room morale. \n\nA good example here would be LeBron in 2018. His team was hot garbage and he did everything he could to win, there was NOTHING he could've done though. If he says \"yeah this team is ass, I'm the only one who can do anything really\" that would cause a massive uproar, but saying \"we gotta play better as a team\" is corporate speak until he gets to the locker room and it's a bunch of \"I am going to look at you and tell you your ass, that way you understand\"\n\nThis is why what jokic said isn't that controversial, but more direct. He said *WE* aren't a good shooting team, including himself. He was being honest, but he also wasn't being rude, just stating a fact. Very Slavic.", "label": 0}
{"text": "Of all subreddits I didn’t think r/nba would downvote the same comments as r/conservative", "label": 0}
{"text": "That was expected, no? Like, they obviously just wanted to get the Father and Son feat out the way.", "label": 0}
{"text": "Any Vikings fans in here must be beside themselves", "label": 0}
{"text": "From a purely \"how can we maximize our chances of winning games\" the biggest answer is \"how do we keep westbrook off the court as much as possible.\"", "label": 0}
{"text": "**Replays/alternate angles**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "label": 0}
{"text": "Exactly, he needs reps", "label": 0}
{"text": "Right now he struggles against players with tremendous lower body strength. Sorta like how a wild boar is more likely to flip a car than a deer is.", "label": 0}
{"text": "They asked him how his summer vacation was", "label": 0}
{"text": "The dumb AF look is claiming like you know more than the people who actually watch the games. Box scores don't tell all", "label": 0}
{"text": "3-Point Specialist PJ Tucker?!?!", "label": 0}
{"text": "Didn’t he injure himself skateboarding while he was on the lakers?", "label": 0}
{"text": "One loss means something if you don’t make the playoffs by a game.", "label": 0}
{"text": "More than just hitting 3s, he uses his gravity as any smart 3 point shooter does. It's how he got his only 2 pt bucket, taking advantage of Cp3 closing out too hard for a wide open middy. Used it to make good passes inside and attack the paint to make the defense collapse.", "label": 0}
{"text": "It’s based on play by play data. Basically you need to know how many trips a player had to the free throw line. True shooting is essentially just points per possession converted to a percentage. \n\nEx: If a player shot 6 FTs, they could’ve come from 3 possessions (3 2pt fouls), 2 possessions (2 3pt fouls), 0 possessions (6 and1s, possessions already reflected in FGA), etc. No way of knowing from the box score alone\n\nThe approximate formula does 0.44*FTA because that gives you a good enough estimate over a large sample. \n\npbpstats.com does exact TS% for example. [Here](https://www.pbpstats.com/game-logs/nba/player?Season=2024-25&SeasonType=Regular%2BSeason&EntityId=2544) they have LeBron’s TS% from the opener as 50%. \n\nAnyway I said “I dunno if this is possible with how you’re doing this” because if you aren’t using play by play data already, probably not worth the hassle to try to work that into your workflow. \n\nCool site regardless!", "label": 0}
{"text": "Chuck also started saying “one more” with two to go.", "label": 0}
{"text": "Nuggets really thought they could fix Westbrick", "label": 0}
{"text": "Good thing they got Russ.", "label": 0}
{"text": "Well everyone outside of Denver. This was the summer of denial from fans and FO", "label": 0}
{"text": "Chatgpt ahh article, lame af", "label": 0}
{"text": "See I question how much the better spacing even impacts the offense though. Like the spacing is better for players to isolate and score yes. But the screen quality is lower. Hartenstein had a great two man game with Donte, which provides a level of spacing itself since you cant let Donte shoot right off the hand off. \n\nLike they are still putting all playmaking responsibility on Brunson and the spacing is maximized for him, but I dont think there's as much diversity to how they can score compared to last season.", "label": 0}
{"text": "Randle got the double boost of playing the Kings AND Sabonis", "label": 0}
{"text": ">valuable time at the beginning?\n\nYeah, because he almost died...", "label": 0}
{"text": "They shouldn't need scouting reports lol", "label": 0}
{"text": "You think LeBron forced the lakers to draft him to play 3 minutes together?", "label": 0}
{"text": "Once again: one loss *in the first week of the season* doesn't mean shit.  \n\nHow do you know they're not going to string together ten straight wins?", "label": 0}
{"text": "He's not sponsored by Nike so he would've been left out anyways", "label": 0}
{"text": "Ben Simmons had 6pts 8 ast and 5 rebs just the beginning of the season guys will round into form", "label": 0}
{"text": "Dunno what youre talking about.\n\nLeBron got Robert Saleh fired", "label": 0}
{"text": "I don’t think Bronny is concerned about legacy.", "label": 0}
{"text": "Another year another Randle/Siakam/Sabonis debate", "label": 0}
{"text": "Gonna remember this before he explodes in the playoffs after people call him washed… again", "label": 0}
{"text": "Whose next?", "label": 0}
{"text": "Trying to deny that OKC was bad is definitely something", "label": 0}
{"text": "Tim Hardaway Neutral", "label": 0}
{"text": "I'mma miss Chuck", "label": 0}
{"text": "You are correct, for some reason I had thought he had heart issues for the whole season. I will say, I do think he lost valuable time. \n\n>He sucks. Will ALWAYS suck, and has no future in this league the day LeBron retires.\n\nThis is just dumb though, especially considering your username. You have nothing to base this on except for opinion. Look at guys like Steve Nash, dude averaged 3/1/2 as a rookie, same with John Stockton. Generally speaking smaller guards take longer to develop.\n\nYou could point to Scoot last year and say he'll never be an NBA player because he sucked last year, but it'd be a dumb statement.", "label": 0}
{"text": "Just saw your edit. My comment was never changed, you probably saw the “short” part. It would say that there was an edit.", "label": 0}
{"text": "But he was still drafted on his own as the 51th pick. So he earned that.\n\nWithout knowing college ball, the other day somebody made a calculation that there are probably 800+ college players that are better or at least as good as Bronny who one year ago even had a heart problem.", "label": 0}
{"text": "I like this take. If you are a star in the league, look at all the shit lakers did for lebron. That must be pretty appealing if you are a superstar", "label": 0}
{"text": "Dywane Wade and Dorell Wright", "label": 0}
{"text": "2021 Kawhi was the terminator. Unfortunately his knees got terminated first.", "label": 0}
{"text": "This doesn’t say anything about him not getting NBA minutes, but even if he doesn’t play another second in the NBA, there’s still the fact that a draft pick was used on a non-NBA player whose agent would not let him sign a 2-way contract. There are plenty of better players in the league grateful for their 2-way contracts.", "label": 0}
{"text": "Yep. the thing is Westbrook will never adjust his playstyle or improve his shooting, bc he is too stubborn to understand he need those adjustments, and need them here and now. Or it will be another shitshow", "label": 0}
{"text": "You’re just arguing in bad faith considering the amount of threads on this very topic was all over the place this summer.", "label": 0}
{"text": "Lebron got his Hallmark moment, now we can treat Bronny like an actual player relative to his skill level", "label": 0}
{"text": "Already in mid season form look out.", "label": 0}
{"text": "I got the Bucks next.", "label": 0}
{"text": "NBA contracts need to be revised. \n\nPlayed 82 games = 10% bonus\n\nPlayed 75 games = 5% bonus\n\nPlayed 70-74 games = -2% contract pay.\n\nPlayed 65-69 games = -5% contract pay.\n\nPlayed -64 games = -10% contract pay and not eligible for a max contract until 2 seasons of 70+ games played.", "label": 0}
{"text": "Bron got to play with his son. Bronny can now collect a nice little paycheck of his own until Bron retires and then move on to some other venture.", "label": 0}
{"text": "Then why wouldn’t Bronny sign a 2-way contract?", "label": 0}
{"text": "We happy for him, small childe. Learn Jon, not whatever this is.", "label": 0}
{"text": "TIL - thanks for checking out the website and sharing.\n\nAnd yeah, I don't have play by play data right now, so this would be tough to add. Very interesting though.", "label": 0}
{"text": "When an article should’ve been a Tweet", "label": 0}
{"text": "What the fuck are you talking about? Unless I missed something, Denver didn’t do something stupid like negotiate under the table with receipts with Joe Smith.\n\n2004 was the only time the Wolves ever won series with KG. \n\nThe Nuggets made the WCF in 2020. Won first round series in 2019, 2021, and 2024.  Lost in 7 in 19 and 24 in their 2nd round series.", "label": 0}
{"text": "you can train it, but he also has god gifted hand-eye. even before working with his trainer, iguodala would talk about curry always beating everyone in team activities involving aiming, like darts, bowling, golf", "label": 0}
{"text": "Very optimistic of you. We're gonna see all kinds of flairs posting G league clips ", "label": 0}
{"text": "“I gotchu America!” 🤣", "label": 0}
{"text": "He’s absolutely the problem. Money aside, it’s him wanting the ball and having to play him that’s the problem. Don’t be a fool.", "label": 0}
{"text": "Obviously with hindsight looks bad but at the time that trade got them finals MVP Kawhi and PG13", "label": 0}
{"text": "Just to add onto this, a lot of what makes a good **high-volume** shooter in the NBA isn't just your form, it's how to get those looks in the first place. \n\nAny good 3p shooter is going to have the defense working to deny them those shots and, with a few exceptions, most high volume 3p shooters haven't been guys who can get those looks while also dribbling the ball for extended periods (Harden and Luka are probably the main exceptions to the rule here).\n\nYou have to build offensive actions that let those guys sprint into possession around screens, which now means your footwork running into those looks, how you rotate your body towards the basket, how you set and jump, how you transfer that lateral energy from your body moving into a shot without that shot drifting left or right, etc. So there's so much detail that is specifically *not* about just getting a ton of stationary shots up in training.\n\nSo I do think some shooters come into the Warriors gym and see Steph working through all these scenarios to make sure that all the work that leads into the shot, no matter how weird the angle or how imperfect the look at the basket is, is as close to perfect as possible, and I think that has an impact.", "label": 0}
{"text": "I don’t think Lebron forced any of it, the Lakers drafted him because they like the prospect and to show appreciation to Lebron, and then knowing the big story of “when will Bron and Bronny step on the court together” they just got it out of the way the first game while everyone was watching, simple. None of it was forced by Lebron", "label": 0}
{"text": "Damn your username takes me back", "label": 0}
{"text": "I’m not saying he’s doing it nefariosly, but Chuck keeping NBA “discourse” so proudly stupid is such a gift to the sports betting industry.", "label": 0}
{"text": "years ago", "label": 0}
{"text": "😂😂 Let me hold your hand when I say this….", "label": 0}
{"text": "It was a bad trade then, it’s catastrophic failure of a trade now. \n\nClippers fell into to sunkcost fallacy, they should have traded both PG and Kawhi after 2022 and recoup some of the assets. Now every year that passes the trade keeps getting worse and worse.", "label": 0}
{"text": "Russ continues teamwrecking behavior", "label": 0}
{"text": "He lives (lived?) in my partners old town. He’s supposedly very nice (smallish town so people know one another) and his niece is playing youth ball there", "label": 0}
{"text": "Y’all won that game, for whatever that’s worth.", "label": 0}
{"text": "Do you believe everything you read on the internet?", "label": 0}
{"text": "Can't statpad assists when you don't have shooters.", "label": 0}
{"text": "> Bro experienced ONE normal Russ shooting night and immediately folded\n\nWhy are you putting this all on Russ? Their entire team can’t shoot. \n\nGordon 0/1\nBraun 0/3\nStrawther 0/2\nWatson 0/4\nSaric 0/1", "label": 0}
{"text": "He gonna be Las Vegas NBA teams’ first max player", "label": 0}
{"text": "We were in cali. I'm sure Draymond felt his spidey sense tingling.", "label": 0}
{"text": "I think that all it does is promote nepotism and is a complete net negative for the league", "label": 0}
{"text": "Lmao sorry I thought by lol you were implying Steph hadn't had any help. I guess I thought you were the world's most delusional Warriors rather than a sensible one. This subreddit has lowered my expectations for discourse considerably.", "label": 0}
{"text": "I believe you. If you want to say his college career wasn’t what it could have been because he missed time in the offseason, fair enough. \n\nJust from everything we’ve seen of him since I don’t think there’s a lot of indication that he has a ton of untapped potential or has improved a great deal. Usually when I think of players who do they either picked up the game late or were put in suboptimal conditions to be successful (e.g. Giannis, Embiid, Siakam etc). I don’t think Bronny’s raw, I just don’t think he’s an NBA level player", "label": 0}
{"text": "WHen it comes to someone like WB who's as fierce a competitor as anyone, players love that cause you can't teach that. \n\nProblem is, they have a MASSIVE blind spot and for some reason can't be objective once a player's washed. Westbrook by all metrics has been ASS for years now, but they still see him like he was OKC Russ. And even OKC Russ had massive faults, he was just athletic enough to still be able to lift a team by himself", "label": 0}
{"text": "You mean 0-point specialist PJ Tucker?", "label": 0}
{"text": "You think for example the entire league running around in BLM shirts etc. is \"middle of the road\"?\n\nI am not from the US, but if anything the NBA and many other major US sports actually do their very best to alienate roughly half of the population == their potential national audience. Of course often only because the sponsors demand it, but stlll.", "label": 0}
{"text": "Now im gonna see people do a 180 on this trade AGAIN and talk about how knicks got fleeced in the trade lmao", "label": 0}
{"text": "No there has to be some other option like hire an assassin", "label": 0}
{"text": "Agreed. Getting rid of KCP for Russ is just stupid as all hell.\n\nI'm happy about it as a Magic fan though", "label": 0}
{"text": "I'd say it's not a good thing that Jokic and Malone are criticizing front office moves after Game 1 of 82.", "label": 0}
{"text": "https://youtu.be/2FnzZYEPEGw?si=1s3M8nIvtyy86Hh1", "label": 0}
{"text": "This doesn't tell the whole story of last night's game. Besides that one chase down block, I didn't see Russ hustle back on transition once. I thought he was the \"hustle and heart\" player.", "label": 0}
{"text": "Why would you take a two way instead of guaranteed money and play in the g league anyways?", "label": 0}
{"text": "You think people weren't mad at Bron for joining the Heat? lol", "label": 0}
{"text": "lol I’d protect him in the draft as a fuck-you to lebron", "label": 0}
{"text": "Nice, thanks for the link!", "label": 0}
{"text": "Tim Connelly is so good at making adjustments for a championship roster. Bruce Brown felt like a fringe move at the time of signing that would help us a bit. Gordon didn’t seem like someone we could afford to trade for and he got em, and got us off the Gary Harris contract. Him being gone is realllly showing", "label": 0}
{"text": "Technically as Mitch only played 31 games last year Knicks are hoping he replace Ihart. Obviously two different players but people forget he’s a starting level center in this league and one of the best offensive rebounding bigs in the league. Unfortunately he’s out until Jan. We are also missing Precious which is a big piece off the bench.", "label": 0}
{"text": "There are literally two sentences in this article that are actually relevant", "label": 0}
{"text": "He's basketball's craig kimbrel. Someone gets tricked every year", "label": 0}
{"text": "Isn't everyone lol", "label": 0}
{"text": "i dont have KOC as much as others on reddit, but I also dont like chris vernon\n\nive heard \"the mismatch is OK, KOC sucks but Verno carries!\"\n\nive listened to a LOT of Mismatch, and both of these guys are fucking goons tbh, i dont know why verno gets a pass. I feel he is less knowledgeable than KOC and tries to be funny/cute too much", "label": 0}
{"text": "That is not all it does. It shows the club will bend over backwards for their stars. Do you think Lebron or any of the top guys gives a shit about nepotism?\nThey care what the clubs will do for them.", "label": 0}
{"text": "Obviously.", "label": 0}
{"text": "He’s the #55 pick, who actually cares?", "label": 0}
{"text": "And we convinced them that the solution was trading Caruso for Giddey", "label": 0}
{"text": "I forgot he was a Maverick until just now. I was like why would Luka be running back on defense when Klay shoots?", "label": 0}
{"text": "How can Russ boost Jokic's advanced stats? Genuine question.", "label": 0}
{"text": "\"Damn I'm so smart because I know where Egypt is.\"  - a dickhead asshole", "label": 0}
{"text": "This is genuinely my ideal for almost all rookies coming in to the league.\n\nThe NBA should be leveraging it's developmental league to develop its young talent.\n\nI have to imagine playing 30+ minutes a night as the main focus on the team in the G League is better experience than 3 minutes a night in the NBA.", "label": 0}
{"text": "LeBron confirmed to play G League games this season.", "label": 0}
{"text": "That’s what I’m saying is the problem. The precedent that now teams will draft your kid to get you to play there is awful. I’m not saying LeBron is losing any sleep over it", "label": 0}
{"text": "Reading between the lines…the troll was either paid to troll or had seeking opportunities on their mind and didn’t give a fuck about ball. They just wanted to be seen and then be seen getting accosted during the game so they could make a scene and likely get their money/social media attention. \n\nSituation was diffused and they didn’t have shit else to do so they dipped. Probably couldn’t even name another player on the Suns. \n\nIt’s be like stopping a streaker who was going to display some shit and offering them club level seats. Cant get the same attention", "label": 0}
{"text": "Say hello to D'Angelo Russell", "label": 0}
{"text": "I was happier before reading this comment", "label": 0}
{"text": "No? Am I being trolled? Why are yall missing the point lol\n\nIf you’re gonna discredit KDs warrior record against LBJ, then you have to discredit LeBron’s Heat record against KD too. Especially considering KD is younger and was on some tank teams while Bron was on contenders. Thats all I’m saying \n\nI’m not even sure why this is controversial lmao", "label": 0}
{"text": "I am really supporting Westbrook to win a ring before he retires, but at this point it looks like he is doing to much. Maybe he should just concentrate on playmaking instead of taking 10 shots every game.", "label": 0}
{"text": "Looking forward to his career in Taiwan when his dad retures", "label": 0}
{"text": "Hahaah you guys in Dallas are in for a wild ride with my beloved Klay. Buckle up!!", "label": 0}
{"text": "You dont need to \"believe\" lol it shows if a comment has been edited.", "label": 0}
{"text": "I found myself upvoting it too! Then I reread it, and it broke my brain.", "label": 0}
{"text": "What’s your cats @ ? I’m always looking for good cats.", "label": 0}
{"text": "Thank god, he really needs a chance to develop more away from the spotlight", "label": 0}
{"text": "This is as concrete as LeBron pushing for him…a Nuggets ‘insider’ has ‘someone’ tell him Jokic has been ‘pushing for’ Westbrook. That would stand up in court if nothing else.", "label": 0}
{"text": "With the 55th pick? It’s not like they burned a valuable draft asset on Bronny. \n\nThe only three picks after him were Kevin Mucullar, Ulrich Chomche, and Ariel Hukporti. If one of those turns out to be a startable player, then yeah, the Lakers messed up. But I don’t see that happening.", "label": 0}
{"text": "Reminds me of the 2021 lakers and their window closing", "label": 0}
{"text": "New black ops 6 is early access. Bronny is cooked", "label": 0}
{"text": "right? 8 million and a legitimate chance to be an NBA player. what a world.", "label": 0}
{"text": "The jokic thing has always felt like a flimsy justification to me. Did he want russ on the team? Maybe, im sure he said something nice about him at some point. Highly doubt he marched into booths office and demanded that the front office go get russ.", "label": 0}
{"text": "I feel bad for Bronny. I get the vibe that he's just forced to do this for LeDad's legacy. \n\nRealistically, I still hope he becomes a decent player ala Avery Bradley or Tony Allen.", "label": 0}
{"text": "I am very happy for Buddy. The dude is one of the best shooters ever. Putting him under Steph's tutelage is really awesome", "label": 0}
{"text": "What? He touches the ground again after doing so.", "label": 0}
{"text": "Julius Randle 🤝 me 🤝 Draymond Green", "label": 0}
{"text": "If NBA players acknowledge that Russ is washed then they would have to eventually concede their own battle against father time and that's just not something a majority of pro athletes have any interest in coming to terms with", "label": 0}
{"text": "Helps that the east was a flaming pile for his first 5 years, but yeah, insane carry", "label": 0}
{"text": "He's a worse passer and shooter, so is he really \"way better\" than Haliburton?", "label": 0}
{"text": "This is a dumb conversation to be happening, but if you edit a comment within a few minutes of posting it the comment doesn’t say it’s edited", "label": 0}
{"text": "So he’s going to be driving players who get called up? That’s the only way he should be going in between.", "label": 0}
{"text": "Bronny beats him out for pt. Sheesh", "label": 0}
{"text": "Lively and Hardy count from ￼a couple months ago too then 😄", "label": 0}
{"text": "I don’t blame Malone for throwing the FO under the bus", "label": 0}
{"text": "Nephews gonna nephew ", "label": 0}
{"text": "I, for one, welcome our new Splash Buddy.", "label": 0}
{"text": "Same shit with the Lakers, with LeBron and AD pushing for him, and Clippers with PG/Kawhi pushing for him, I think", "label": 0}
{"text": "Raptors got rid of dead weight AND took back an asset just this off-season. It's up to the GM to wheel and deal, teams fall for young players all the time.", "label": 0}
{"text": "Presti has been there for like 18 years, had arguably the best young core of players in nba history and only went to one finals and one wcf. \n\n\nI agree he’s a good GM, but he also got lucky (just like the Celtics) that a dumbass billionaire thought this was soccer or mlb and that he could just buy a championship, rather than doing it proper. The same way prokhorov screwed the nets for so long, ballmer did that to the clippers.", "label": 0}
{"text": "He not lying and also included himself. People can’t even be honest these days", "label": 0}
{"text": "I’m not sure people noticed but Bron took basically the exact pay cut that is Bronny’s salary. I’m not sure if that was a coincidence or intentional though but it seems intentional.", "label": 0}
{"text": "When another player has a kid old enough to play in the league at the same time as their dad, then your concern might be valid. The Lakers are showing everyone that if you’re a star, they will treat you well", "label": 0}
{"text": "You see pitchers in baseball every so often be out because they pulled a muscle sneezing", "label": 0}
{"text": "Other commenters have this covered, but wanted to point out as he was hiding out and avoiding speaking to anyone, Pop had to leave the side of his wife (who we now know was dying) to try to track down and talk to Kawhi, who was still cashing his paychecks from his $20M/year salary while avoiding everyone in the Spurs org.", "label": 0}
{"text": "Yes, but also the G league season hasn’t even started yet either. So he was always going to be available Game #1", "label": 0}
{"text": "But that was the point of the original comment. That people don’t understand, that the real value Lakers got out their bronny pick was signal value to other stars.\n\nIf that is good for basketball as a whole, is another discussion, where I tend to agree with you. The insane cash and now more or less blatant nepotism is not healthy for the NBA", "label": 0}
{"text": "As if the Lakers have thus far struggled to attract superstars…", "label": 0}
{"text": "It wouldn’t be an issue if he hadn’t been shoved into the spotlight when he isn’t talented enough to be there. When someone gets things they clearly don’t deserve because of who their parents are, people are going to hold them to a higher standard and give them shit.", "label": 0}
{"text": "Which is sad. Somebody somewhere isn’t getting a shot because of this nepotism", "label": 0}
{"text": "Especially when you have been irrelevant before and know the pain. They had no team if they didn’t get this trade and billionaires hate that shit", "label": 0}
{"text": "Teams aren’t going to draft regular players kids just cause. This is LeBron", "label": 0}
{"text": "Hasn’t been decent in the playoffs since 22", "label": 0}
{"text": "KCP is such a big loss for Denver.", "label": 0}
{"text": "They’ve already shown that they’ll blow up championship rosters for mediocre over the hill superstars. I don’t think any players are coming to the Lakers thinking “well if my son ever makes the league we can play together” lmao.", "label": 0}
{"text": "It's got nothing to do with the pick they burned. They brought in a player to appease the ego of another player. If the entire Curry family walked on and played one minute, it would still be a clown show. It's the NBA. Not bring your son to work week.", "label": 0}
{"text": "Yeah I bet if it were only pull-up 3s curry would lead in efficiency and volume. Would like to see where other guys like Trae Luka and Tatum are too.", "label": 0}
{"text": "the precedent is that if you're a Lebron-caliber player you'll get treated like that by the Lakers organization.\n\ngood thing for you that there's been only a handful of Lebron-caliber players in NBA history", "label": 0}
{"text": "What are you talking about? Everyone in the initial thread stated it was around the time quoted. 4 to 6 weeks was by far the most upvoted suggestion....", "label": 0}
{"text": "My nemesis ", "label": 0}
{"text": "This is what you get when you enter \"Rob Lowe\" as the system instructions", "label": 0}
{"text": "I think this signing by the nuggets says more about how desperate they are than anything else..", "label": 0}
{"text": "He’s in the air after his gather step. He then gets two more legal steps after. Zero, one, two. I agree it may look fishy but players like harden and trae practice getting the most possible steps without traveling. The gather step was huge and awkward looking, helping to fool his defender and makes it look almost like a travel but trust me it’s not", "label": 0}
{"text": ">He headed to the customer service section where the Clippers offered him and his buddy a new pair of seats that were not in The Wall! Christian, a gentleman working the counter when Chris arrived, called it an upgrade: Main 1, row 21, seat 11.\n\n>**But for whatever reason**, Chris turned down opportunities both to change sections and to return to The Wall! in either his black tank top or a Clippers shirt the team gave him.\n\nYeah, I think the reason was obvious.", "label": 0}
{"text": "Brony is in the nba because LeBron deserves it.", "label": 0}
{"text": "Who also owns the avalanche. Has a championship from 3 different professional sports in 3 years", "label": 0}
{"text": "Don't be too harsh. He's also terrible with the ball in his hands.", "label": 0}
{"text": "Haters in shambles.", "label": 0}
{"text": "Can't be worse than Perkins and SAS", "label": 0}
{"text": "Bronny's Make A Wish moment over", "label": 0}
{"text": "Weird how no one on r/nba cares as much about the rampant nepotism in coaching and front offices where it's even less justifiable ", "label": 0}
{"text": "🅱️ald 🅱️eagle", "label": 0}
{"text": "Gobert?", "label": 0}
{"text": "it was a paycut to get below the second apron", "label": 0}
{"text": "Smdh do people not understand what a 2 way contract is? My god we’re on a NBA forum and this has been talked about for months now… there can’t be this many people uninformed still", "label": 0}
{"text": "They probably asked him do you prefer Russ or Reggie Jackson.I doubt he went to the front office and demanded that the team gets Russ. I don't see him doing that,and if he did,I would think there would be way more guys that he would want,instead of Russ.", "label": 0}
{"text": "So you're saying Bronny = 2nd apron?", "label": 0}
{"text": "Randle felt disrespected when Sabonis was popping off in Indiana and getting All Star nods over him i guess. And they were playing the same position at that time so it was direct competition. Kind of like Fox hates Lonzo and the Lakers are paying for their drafting mistake to this day when we play them lol", "label": 0}
{"text": "the russ curse continues 😂", "label": 0}
{"text": "> speaks a lot to their desire to appease superstars\n\nWhat a weird take.", "label": 0}
{"text": "I'm surprised Denver didnt try get some cheap bench shooters at least - Gordon maybe or whoever. Relying on westbrook will be interesting.", "label": 0}
{"text": "one reason is that randle is actually just good and is capable of putting up those numbers against anyone.", "label": 0}
{"text": "Boohoo ‘tired in the playoffs’ lol everyone’s tired", "label": 0}
{"text": "Im gonna eat the NFL refs alive for that BS last night", "label": 0}
{"text": "Crazy, I didn't realize that", "label": 0}
{"text": "Why does where he was picked matter?", "label": 0}
{"text": "They were considered the favorites in the west after the trade, and the Lakers were a laughing stock for not understanding the cap. It's weird how things change.", "label": 0}
{"text": "There are a lot of Canadians who are fucking pissed for him doing this to them in the Olympics.", "label": 0}
{"text": "Isn't that a Kim Possible villain?", "label": 0}
{"text": "His name is Lebron James Jr.", "label": 0}
{"text": "U lost to Austin Reaves and Taurean Prince last year", "label": 0}
{"text": "Yeah think we do mostly agree. With single game stats, you can maybe make some observations and very tentative conclusions looking at them in the context of the game, but even those are very iffy.\n\nOver a far larger sample size, ts becomes a significantly more reliable and meaningful tool for player evaluation purposes. But it’s still a means to that end rather than the end itself. This sub sometimes treats it as the latter.\n\nOn heaves: I tend to, as I did here, use the term differently than somewhere like bballref (where I’ve previously looked for the stat). My understanding is they limit it to shots beyond half court. Naturally, there aren’t many of those.\n\nBut there are tons of end of quarter/half shots where a player has only just enough time to race the ball across half court and get a shot off. I’m talking those kinds of running off balance 3s. Might have to look into the numbers for those at some point but lacking the time now unfortunately.\n\nAnyway thanks for engaging with me and my giant blocks of text on this!", "label": 0}
{"text": "“And why would I watch the (insert bottom feeder team)” is a great response by chuck", "label": 0}
{"text": "Legit question from someone who started watching nba these last playoffs, do players move from G League to the NBA", "label": 0}
{"text": "Sabonis was nowhere close Randle defensively and isn't defending him for the last 3 or 4 years already because he plays exclusively Center nowadays. But yeah Randle sees red when Sabonis is on the same floor with him and always goes supernova lmao", "label": 0}
{"text": "You expect people to be knowledgeable about basketball things on this forum?? Lol", "label": 0}
{"text": "I think it makes it easier for their to be a natural rivalry if they have an east and west all star team rather than captains picking", "label": 0}
{"text": "Terrible sportsmanship by the Clips.\n\nIn retaliation, Clips gear/Jerseys should get you banned from opposing arenas this season. ", "label": 0}
{"text": "G-League competition is stronger than college where he only averaged 4 pts. \n\nAlso, what in the world did you see that made you think he is better than Hood-Schifino?", "label": 0}
{"text": "He's a christian nerd who doesn't party, he does cardio instead of clubbing.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "as long as they have nikola they should be able to rebuild quickly imo", "label": 0}
{"text": "The crowd?!", "label": 0}
{"text": "Same reason we gave Kobe a fat extension even after it was clear he was no longer able to carry the team", "label": 0}
{"text": "We overuse the Laker for Life thing, but AC is truly loved and welcomed by the city", "label": 0}
{"text": "Bron ain't got locks like that", "label": 0}
{"text": "Braun is a good player and might turn out to be a better overall player than KCP, who knows? But they have 2 very different play styles, and I would argue that KCP's skills and playstyle fit with this current Nuggets roster than Braun does. \n\nBut the thing is, they could have kept and played both. They did not have to let KCP walk, they did so because they were being cheap and the fanbase is attempting to rationalize it.", "label": 0}
{"text": "The next 5 years are mine \n\n-PatBev", "label": 0}
{"text": "Sorry for citing what our actual coach said rather than diving into conspiracy theories that Lebron is holding our organization at gun point", "label": 0}
{"text": "he should come play for my mavs instead", "label": 0}
{"text": "Warriors and Raptors also did too", "label": 0}
{"text": "“I purposely disregarded the rules and regulations stipulated in the purchase of my ticket and suffered the very forgiving and generous consequences!”", "label": 0}
{"text": "The discourse was nasty and stupid by both teams fan bases and it was all over a ROY award which is pretty silly.", "label": 0}
{"text": "Is that the best you've got? I get to watch my team play basketball tonight. You don't get to say the same. LMAO.", "label": 0}
{"text": "“Was busy rewatching LeBron and Bronny highlights, sounds like we lost?”\n\nLiterally posted at the top of the Friday Talk thread Denver sub LMAO", "label": 0}
{"text": "For real. I saw so many pissed off “he’s gonna be starting” comments. Bron cares a lot about team chemistry. He’s not gonna destroy it by having Bronny take someone else’s minutes.", "label": 0}
{"text": "Or on the Bucks", "label": 0}
{"text": "LeBron was in the crowd, I thought he played?", "label": 0}
{"text": "All the time", "label": 0}
{"text": "8m is the exact amount by which Lebron took a pay cut this season. Me thinks it ain't actually Bronny who'll rake in 8m after this year", "label": 0}
{"text": "Man this security is tighter than TSA.  Gonna have to shove road team jerseys up asses going forward", "label": 0}
{"text": "NBA players are casuals. It's just that simple. They love Russ, Iverson, Kyrie type players over Gobert, Kareem, Duncan types. Kawhi and PG wanted John Wall over Isiah Hartenstein.", "label": 0}
{"text": "Lol 'stupid' is revisionist's history. They were adding two wing lockdown defenders (one of which just won his second Finals MVP) to a scrappy Clippers team with great chemistry. Every front office trades a young SGA for that.", "label": 0}
{"text": "Probably play only in lakers national games for more views", "label": 0}
{"text": "It may just be me..but I think Bronny can get better quicker by practicing with the Lakers main squad everyday. He might get no playing time,  but those practicing will be extremely helpful.  Than just playing against g leaguers. You here it all the time with rookies who miss their first year due to injuries. How valuable just sitting there helps. And he won't be just sitting there, he will be active in practice. It definitely works for football. Especially Quarterbacks.", "label": 0}
{"text": "u trying too hard big bro", "label": 0}
{"text": "I only got tht because I was shocked he actually outplayed some end of bench hopefuls in preseason lol", "label": 0}
{"text": "You've been listening to too much Lil Durk", "label": 0}
{"text": "Got the best passing big man just for the team to shoot bricks", "label": 0}
{"text": "I can’t see him going to Europe. He’s isn’t good enough for the Euroleague now and the coaches would not be patient enough to develop him. \n\n\nWhich would leave him with non-Euroleague teams in Europe which would could potentially be a massive culture shock and pay downgrade for him. At that point, he would be better off just staying in the U.S. and pursuing things other than basketball. Being LeBron’s son will make him money for a long, long time whether he’s playing or not.", "label": 0}
{"text": "I love his honesty", "label": 0}
{"text": "Nikola Belic", "label": 0}
{"text": "second abron", "label": 0}
{"text": "The fact that Bronny is even on an NBA roster says otherwise", "label": 0}
{"text": "> What people dont understand is that the 55th pick was to market the Lakers as the spot to be if you are a superstar.\n\nThis is some ridiculous spin.\n\nThe Lakers wasted a second round pick to appease LeBron, not to market themselves to other unnamed superstars. The Lakers would not have made that pick if LeBron hadn't instructed them to do so.\n\nThis is like saying the Bucks keep Thanasis around to market themselves to other superstars.", "label": 0}
{"text": "Imagine if instead of Ken Grif Jr. being one of the best players ever, he actually sucked and was there for a game while his dad throws himself a parade", "label": 0}
{"text": "I was forced to LEAVE THE STADIUM ^after ^turning ^down ^the ^alternatives ^they ^kindly ^offered", "label": 0}
{"text": "Has randle not fried ad too?", "label": 0}
{"text": "I can’t imagine what it was like living under Lebron James’s roof 💔", "label": 0}
{"text": "Wow r/nba wants to talk about a former mvp who has aged horribly compared to the other MVPs of his era", "label": 0}
{"text": "It's mostly for Lebron's movie he is currently making of his life work and for photos to send to his museum. \n\nMan's got a full crew of people filming his \"big\" moments now including that record he broke last season, and now being the first to play with his son etc.\n\nHe's trying to make his own version of the \"last dance\".", "label": 0}
{"text": "Tyus Jones was a free agent. If Jokic reached out to him instead of Brick the Nuggets would have him.", "label": 0}
{"text": "Appease the crowd or appease Lebron? I don’t think the crowd would have ever given a shit about Bronny if Lebron never made it his mission to get a couple forced minutes with him", "label": 0}
{"text": "Pretty sure he's only going to play a few minutes here and there against Pistons and Wizards.", "label": 0}
{"text": "Chet's a killer man, OKC's future is insanely bright", "label": 0}
{"text": "I kinda love the in season tournament and hope it continues to be competitive and develops into a trophy players actually show pride in trying to win.", "label": 0}
{"text": "And how does that usually go? I'm still a bit confused on how gleague works", "label": 0}
{"text": "Bullock was ass? You Def don't watch ball, he was incredible that whole series but okay bro 👍", "label": 0}
{"text": "He pulls up at home on payday and lebron is just standing there in the driveway with one hand out, palm face up.", "label": 0}
{"text": "Did anyone say to him \"Nikola, it's only the first game of the season\". I get told that all the time on here.", "label": 0}
{"text": "Would Russ accept playing 10-15 minutes per night?", "label": 0}
{"text": "He’s been on the decline for years now, and it’s why he’s paid so little \n\nPlus the man is 36 years old, I’m not sure what people expect lol", "label": 0}
{"text": "I can name like 10 worse things about this subs users than shitting on Westbrook lol", "label": 0}
{"text": "Yeah because your coach would totally just come out to the public and tell people that the organization only made the pick to placate their superstar player. You’re the one building conspiracy theories if you believe the Lakers, or any other NBA team for that matter, would’ve drafted Bronny if he had a different dad", "label": 0}
{"text": "Shoutout to Patrick McCaw, the last player to threepeat in the NBA.", "label": 0}
{"text": "If iron sharpens iron, then Bronny will get plenty better even in the G Leauge. \n\nHe's recovering from a heart condition and also just generally not ready for NBA basketball.", "label": 0}
{"text": "Two-way player on a guaranteed contract. Makes sense.", "label": 0}
{"text": "I’ll take the over on that", "label": 0}
{"text": "When he was a child?", "label": 0}
{"text": "Go for it", "label": 0}
{"text": "If things had worked out and the Clippers got a championship, I bet they’d still be saying it was worth it. Too bad (for them) that they didn’t", "label": 0}
{"text": "Right. I don’t even care when he was cleared for practice. Imagine how long it took just to feel mentally ready to go full tilt and not be scared you’re going to fucking die. Also, these professional sports leagues are entertainment. Idk why we’ve got so many people pretending to care about this hypothetical 55th pick that “got it out the mud” missing his shot at the NBA.", "label": 0}
{"text": "Polish Boys and Pierogi\n\ndunno why you're downvoted, I'm a Clevelander in Denver living out fantasies", "label": 0}
{"text": "But then we might have to acknowledge Allen Iverson was actually good at the game.", "label": 0}
{"text": "It wasn’t a bad trade then at all considering it got them both Kawhi and PG. Every team in the league would make that trade if they could. Could evaluate it differently in hindsight but if you were a  GM in 2019 and you didn’t take that chance you’d be a damn idiot.", "label": 0}
{"text": "\\+ I think that they kept all of their relevant role players that helped them to the 8th seed, Clippers were incredibly stacked and very heavy favorities for the title", "label": 0}
{"text": "Boy you'd be really upset by the MLB draft then", "label": 0}
{"text": "Do you think Lebron is gonna get paid his sons contract? Or that he will make his kid turn over 8 mill when that’s nothing compared to what he has made over his career? What is this comment?", "label": 0}
{"text": "Steve Nash ", "label": 0}
{"text": "Plus it’s not like nepotism in other professions. Athletic ability has a much bigger genetic component than say, being a good partner at a law firm.\n\nAnd yes, it doesn’t always translate because basketball is more than that, but there’s more than goes into the decision.", "label": 0}
{"text": "Honestly, I think that is enough for him. No need to downplay a freakin championship", "label": 0}
{"text": "Sabonis really wasn’t guarding him that much last night, but he went crazy", "label": 0}
{"text": "Who?", "label": 0}
{"text": "He did average 30 alongside 13.5 9.5 shooting 55fg%, 46 3pt% in the playoffs on his way to a ring.I would say that is proving that he can do it on elite efficiency.", "label": 0}
{"text": "We got Bronny in the NBA before Tominaga smh", "label": 0}
{"text": "I could watch these guys talk ball all day. So ridiculous they’re done after this year", "label": 0}
{"text": "They still have a child's mentality from where they were growing up as fans. Put all the big names on the same team and cream. Russ/Melo/John Wall/and current Shaq type beat.", "label": 0}
{"text": "they were sent to the roof?!", "label": 0}
{"text": "Everyone can look smart in hindsight! When the Clippers got Kawhi and PG not a single person said it was a bad move, not one.", "label": 0}
{"text": "Facts", "label": 0}
{"text": "I mean is anyone surprised? Bronny average like 4 ppg in fucking college 🤣 how did people magically expect him to perform better against better competition? ", "label": 0}
{"text": ">You’re automatically assuming the Clippers are in the right\n\nNo, I'm not assuming anything. I just happen to know what the standard procedures and recovery timelines are for these things. I'm not *assuming* that 16 months is an acceptable ACL recovery time. I *know* it is.", "label": 0}
{"text": "Yeah, that’s kind of weird. Posts about Westbrook vs posts about Derrick Rose, both former MVPs who were not great in the latter half of their careers, are the “flirting vs sexual harassment” meme. \n\nAnd that even with one of those two being one of the best people in the NBA, and the other having a weird case.", "label": 0}
{"text": "Because that is the cost the Lakers paid to get him. There is almost zero opportunity cost for what they did to get Bronny compared to if they had got him with a first round or lottery pick. If he was any other 55th pick, no one would give a crap at all about what he did in the summer league or how he was being dropped to the g-league or how the Lakers even drafted him.", "label": 0}
{"text": "So any team that can get hot from 3 can potentially blow them out. It will be interesting to see how they fair against the Celtics and golden state then.", "label": 0}
{"text": "Eh why not change sections though", "label": 0}
{"text": "He be good if he just never shot the ball", "label": 0}
{"text": "Is this a joke? The whole intent behind that section of seating is so that it’s for Clippers fans only. Anyone can sit anywhere else in the arena but that section has very clearly outlined stipulations. Seems fair to me and looks like a cool idea for creating a passionate atmosphere for home games.", "label": 0}
{"text": "$8M contract and the son of a billionaire. Absolutely tragic. Prayers up 😔🙏", "label": 0}
{"text": "To appease the crowd or to do one of the greatest nba players a favor?", "label": 0}
{"text": "The man averaged 4 ppg in college lol how do people expect him to play better against far superior athletes ", "label": 0}
{"text": "That Washington team's record would not be enough to make the play-in in the West.", "label": 0}
{"text": "tbh i know he wasn’t the most deserving of his spot in league but he’s a very serviceable defender. If he can knock 3s down consistently and be a good ball handler he can easily be a backup pg or good role player.", "label": 0}
{"text": "I’d argue it’s the opposite, most of his fans are aware of what calibre of player he is at this point in his career \n\nBut you got guys talking about him like the Nuggets expected him to be a third option lol", "label": 0}
{"text": "RemindMe! 6 Months", "label": 0}
{"text": "hur dur hur dur hur dur", "label": 0}
{"text": "People want his fans to stop trying to gaslight people who aren't blind like they are.", "label": 0}
{"text": "???? what???? Not to the hate of westbrook extent. Cmon lets be real.", "label": 0}
{"text": "In fairness most GMs are bad too. There's only a few good ones every decade.", "label": 0}
{"text": "At least the rookie didn’t fall on his ass like Luka on a Jaylen Brown crossover.", "label": 0}
{"text": "Why would it be over?  What if Lebron requests Bronny get more minutes with the regular squad? Would they really say no now?", "label": 0}
{"text": "I hope to God Bron just keeps making this an issue and forces his kid to play.", "label": 0}
{"text": "reality is they come and go as NBA bench players get injured. they just tryna stay ready and play good enough in g league to be the first call up for an injury", "label": 0}
{"text": "Harrison Barnes!", "label": 0}
{"text": "There is a point when being competitive hurts you and your team. And russ is at that point. His bite doesn’t match his bark.", "label": 0}
{"text": "I got you lock in, buddy\n\n\n\nI'm with you tho but only 13 losses 📉", "label": 0}
{"text": "I think you’re overestimating the G league. Bronny isn’t good, but the G League was called the D league for a reason. The players over there aren’t good.", "label": 0}
{"text": "2nd #KidFromAKRON", "label": 0}
{"text": "If the bar is \"bringing in an end of the bench guy to make a superstar happy\" than literally every team with a superstar ever is below your ridiculous standard. The Warriors do it, the Bucks do it, EVERYONE has done it for years. What a clown ass statement.", "label": 0}
{"text": "I see. What are some good cases of players that moved up?", "label": 0}
{"text": "We know", "label": 0}
{"text": "I guess that depends on your definition of the term legitimate.", "label": 0}
{"text": "If his name was Mike Smith not a single NBA scout would have heard of him.", "label": 0}
{"text": "For real. This is jokic we’re talking about. I don’t think he’s ever deliberately said anything negative about another player and he’s who the teams built around. Of course he’s going to show support regardless of who the nuggets signed.", "label": 0}
{"text": "Always the move. He needs to go to the g-league.", "label": 0}
{"text": "Pels front office has been killing it with these draft picks for a minute now\n\n2024 Missi\n2023 Jordan Hawkins\n2022 Dyson Daniels\n2021 Herb Jones (second round!), Trey Murphy (via trade with Memphis)", "label": 0}
{"text": "I mean u could say that about the east for most of the past 20 years", "label": 0}
{"text": "But then you get back to the issue, which is MPJ will be *less* open because Russ is on the floor.  This is why even staggering Russ with guys like PG and Norm *still* didn't work out well, because it puts more defensive pressure on the shooters.\n\nWe can go back and forth on this, but a ton of the ideas Nuggets fans have shared have *already* been tried to very occasional success but more often failure.\n\nIf Russ played like a role player and adapted his game, he'd still be a Clipper.", "label": 0}
{"text": "Poor kid indeed.", "label": 0}
{"text": "Thanks, Magic!", "label": 0}
{"text": "Where my rent money at son?", "label": 0}
{"text": "Luka is probably the worst player in the nba if i had to say", "label": 0}
{"text": "Ya Booth gave away 2nds like it was candy. Some were justified but the picks of Ryan Dunn and 2 seconds for Holmes was kinda a head scratcher?", "label": 0}
{"text": "Or...the Milwaukee Bucks the year they win the championship \n\nSeriously, what the fuck are we even doing here besides \"LeBron Bad 😡\"", "label": 0}
{"text": "You wouldn’t consider his chance better than yours or mine?", "label": 0}
{"text": "First few minutes of first quarter", "label": 0}
{"text": "ya he's one of the rare names with a big enough following that he could walk right into his own thing with a twitch/YouTube/substack/patreon combo\n\nshitload of overhead compared to being on somebody else's payroll tho", "label": 0}
{"text": "I have no idea why he doesn't take more midrange shots,when he is one of the best midrange shooters in history.He is unselfish to a fault.A 50% midrange from him is definitively better than a wide open 3 from Westbrook,AG and Watson", "label": 0}
{"text": "He's not and will never be a scorer lol. What they want him to improve is his catch and shooting, spacial awareness, ability to stay in front of guys, and use his athletiscm to make cuts and push the ball. \n\nRight now he's just lost on the court.", "label": 0}
{"text": "Connections matter a lot in life if you think of it that way.  Just so happens this connection is family.  \n\nEvery job I’ve had was through connections.  I’d say knowing people matters just as much as if not more than knowledge, skill, and experience.", "label": 0}
{"text": "Randle owns elbow man", "label": 0}
{"text": "Agree to disagree my friend", "label": 0}
{"text": "Right, everyone who keeps acting like this sets some kind of precedent is missing the bigger picture that these circumstances will probably never happen again. Even if a guy has a kid as early as the age of 18, he still needs to be a big enough superstar and talented enough at 37 that a team would be willing to bend over backwards to appease him. I just don’t see it happening any time soon or maybe ever again.", "label": 0}
{"text": "Are you a Euro or Soccer fan? Just guessing by Mavs being the team you picked. Think of it like a first team sending a player down to the U23 team for some PT.", "label": 0}
{"text": "His shot form has been bad his entire career, not just since leaving OKC. He jumps to the moon and releases the ball right as he starts to descend, and then on top of that has a “flicky” shot motion- which wastes the energy generated by his legs and puts all the stress on his arms & hands to generate power. \n\nI don’t know his injury history in detail but I would bet money that he’s had a hand or wrist injury that coincided with him suddenly not being able to power/aim his jumper like before.", "label": 0}
{"text": "Yeah because we all have seen that well run organizations bow to their superstar’s demands even if it hurts the team… LA should’ve vetoed the Russ trade outright.", "label": 0}
{"text": "Who’s gaslighting who lol\n\nMost of his fans are aware that he’s near the end of his career, is almost 40 years old, and pretty much supposed to be what Reggie Jackson did last season\n\nYet there’s multiple posts on r/nba talking about him last night and multiple users here acting like the Nuggets expect him to be the 3rd option or something", "label": 0}
{"text": "Legitimately just not NBA caliber at this point. Maybe he could be since he's young but he needs minutes, minutes and more minutes", "label": 0}
{"text": "Denver fans deserve this. IDGAF", "label": 0}
{"text": "He has never changed his play style. The only time the money was a factor was because Lakers fans created that argument. He's not a winning player and does no self-reflection, but he'll kick you out of the arena if you chirp or heckle him. Jot about to feel bad for him.", "label": 0}
{"text": "ESPN was getting into gambling too. I think Simmons at least understands that you don’t mess with Lowe’s formula. Please I hope he understands. He’s gonna draw listeners either way", "label": 0}
{"text": "They should let him try to settle the score with Ant in a Celtics game. For entertainment purposes.", "label": 0}
{"text": "isn't the most comparable to murray is 09 Mo Willaims playing with Bron?", "label": 0}
{"text": "Oh wow, what an honor and a privilege it must be to be a Knicks fan…..Magic are who theyre probably going to lose to in the first round this year so tonights match up should be interesting.", "label": 0}
{"text": "And why would they care about keeping an end-of-career LeBron happy? He straight up said a big part of the reason he went to the Lakers was how they took care of Kobe at the end of his career. Players definitely care about this stuff, you're being incredibly shortsighted.", "label": 0}
{"text": "Good. The reality tv can slow down and we can get to hoops.", "label": 0}
{"text": "Who you got over them", "label": 0}
{"text": "But it isn’t.. he got the recognition from his game and took advantage of it, which is all HS and college rankings are about until you become a professional", "label": 0}
{"text": "Probably around the same time a 55th second round player did", "label": 0}
{"text": "They really had to do that to not having it hanging over their heads every game. Now that it happened, reality time.", "label": 0}
{"text": "God, what a joke of a league built for storylines around rich egos...", "label": 0}
{"text": ">I thought it was really cool of the Lakers to draft Bronny, speaks a lot to their desire to appease superstars. \n\nThis is a great way to ruin the sport.", "label": 0}
{"text": "Wild considering he won the media's coach of the year award last year.", "label": 0}
{"text": "Bronny can maximize his available talent and still not be good enough to be a real NBA player.", "label": 0}
{"text": "Bingo. It's weird how logical /r/NBA is compared to the delusional homers on the nuggets sub", "label": 0}
{"text": ">  and pretty much supposed to be what Reggie Jackson did last season\n\nI got absolutely shit on by some people(both some nuggets fans and some russ fans) when the signing happened for suggesting that they are basically the same tier of player.", "label": 0}
{"text": "> acting like the Nuggets expect him to be the 3rd option or something\n\nExhibit A", "label": 0}
{"text": "And then the injury lingered and he missed the entire next season after that. The poor kid just hasn’t been able to play much basketball since the start of Covid.", "label": 0}
{"text": "Whenever people try to say that the NBA just hands anyone money it’s because of guys like Timmy.\n\nI swear you can play well over 10 seasons being the biggest spare and making 8 figures.", "label": 0}
{"text": "> It may just be me..but I think Bronny can get better quicker by practicing with the Lakers main squad everyday\n\nAs the season goes on, teams don't practice that much. He's better served in the G-League getting way more consistent playtime and practice. This isn't just a Bronny thing. this is a general NBA thing as more players are younger and lack as much higher level non-AAU bball these days. \n\nThis is why you usually see the teams that have success with G-League utilize their young guys there more.", "label": 0}
{"text": "I mean, a lot of stars have ‘stans’ with wild takes \n\nMost reasonable fans accept that he’s pretty much on his last contract", "label": 0}
{"text": "Standing dunk: 99\nPost control: 32", "label": 0}
{"text": "Dang. I was looking forward to watching him look disoriented for ~5 minutes every game. At least we will still get some G League highlights and box scores.", "label": 0}
{"text": "And LeBron also wants to win.  He has a few years left.", "label": 0}
{"text": "Lebib", "label": 0}
