{"text": "Either way, Trump is still polling very well and vegas odds are heavily in his favor.  I think he has a very good chance of winning.", "label": 1}
{"text": "Zero cons. Vote", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "There's an anarcho-pacifist concern that voting makes you morally responsible for the violent acts carried out by the state.        \n\nDemocrats who are considering not voting because of Biden's support for the war crimes in Gaza are probably having that feeling, moral responsibility for actions of whoever you elected", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "\"I don't agree that words have meanings.\"\n\n-- You, apparently.", "label": 1}
{"text": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\n\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\n\n\n^((mod:nosecohn)^)", "label": 1}
{"text": "I never hear a PSA saying \"please exercise your right to get informed on the election, and then vote\".\n\nIt's always only the latter, and that concerns me.\n\nIt seems there is substantial pressure - and I've seen this from both sides to be clear - to keep voters uninformed.  And to the extent they are informed, it comes from 30 second low-quality TV ads with strawman arguments.", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "How can such a well written post be asking such a stupid question?", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Oh, sure thing, thank you! I added a link to a WaPo article if that works, I appreciate the correction", "label": 1}
{"text": "Ill tackle a portion of your question.\n\nThe Majority of Military aid the U.S provides to Israel is munitions for the iron dome. An iron dome interceptor rocket costs around $100,000, while the missiles it intercepts usually only cost around $400-800. \n\nObviously left to their own devices, this isn't a very sustainable model, so the U.S chips in to help prevent civilian casualties for one of its allies.", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Israel does not have a large population and is not super rich(big difference between 27th gdp and top 3). Meanwhile USA is super rich and spends big amount of money on defense.  Furthermore USA and Israel are allies for various reasons.\n\nThis leads to following:\n\n1. Why spend more when you don’t have to? USA has a vested interest in the region and is willing to support israel. They can provide/lend/sell at discount various equipment at favorable conditions any time. Israel takes advantage of that because it makes financial sense. Note that this is not unique to Israel: USA has a huge military (more gdp than next x countries put together). It uses that military to do a lot of power projection and protection of its overseas assets/friends. \n2. USA provides unique abilities. Israel is not quite in a war with Iran. They are instead in a weird state of throwing missiles at each other.  USA can help here at least with shooting down missiles which is hard to in general. No other country can help here as much as USA*, and you generally can’t buy that kind of help with money.\n3. Buying military equipment is very country specific. You can’t just buy your way into it, plus timing can very long. In Israel example they don’t want weapons 8 years from now, they want them now.\n\nThis is all very general info though, broad overview", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "I would argue the the US needs Israel as a launching pad into the Middle East as is paying \"rent\" for access.  It's actually more a shared interest relationship.", "label": 1}
{"text": "Would seem like the people of Gaza may be in need of our help for the reason of genocide , as stated above", "label": 1}
{"text": "The same reason the rich and the big corporations \"need\" tax cuts in the US.", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "I would think that Israel would not have sufficient gdp without the aid to sustain their current military stance", "label": 1}
{"text": "Because Jerusalem enjoys greater representation in the U.S. Congress than Washington D.C.", "label": 1}
{"text": "It doesn't, but it wants the cash anyway. ", "label": 1}
{"text": "Israel already produces more than enough weapons. Which is why they supply countries like Azerbaijan", "label": 1}
{"text": "What does this have to do though with how Israel is useful to the US because it’s a good testing ground for cutting edge defense equipment and military tactics?", "label": 1}
{"text": "In the vein of looking at it as an extension of offshore balancing it is appropriate; not stating I believe that to be the actual result.b", "label": 1}
{"text": "It's an interesting one!  That's for damn sure!", "label": 1}
{"text": "Vote TRUMP 2024!", "label": 1}
{"text": "I like his foreign and energy policy. Tariffs are a huge gamble, but could be extremely beneficial to US businesses & labor. Tax cuts will be inflationary if they are not met with reduced spending; not every business will reinvest tax savings into growth.", "label": 1}
{"text": "Dude you’re not really relying to what I’m saying and you’re kinda ranting about stuff here I’m not even talking about and also what sources are you needing the literal charts from FRED showing you that you’re wrong about corporate tax revenues they DID decrease after the TCJA and that percent of GDP being tax revenues didn’t increase significantly until 2021 well after the TCJA also the NBER itself disagreeing with your analysis?\n\n\nI never made any reference to job losses or gains from the effect of Covid we all know those numbers are dramatically skewed what I was saying is once we did rebound we started hovering around 6 percent and this is when the government passed their budget reconciliation the same way republicans passed their legislation with the TCJA. You also seem to be missing that a large amount of the spending came from trumps administration that is when we see inflation start rising now did Biden’s admin do more than was needed ? Obviously that can be argued and I don’t disagree there but no one here is arguing that point I merely said why they may have still seen it necessary and it’s also what the people wanted they were just slightly heavy handed as is usual with the government but like I mentioned don’t forget a large amount of the spending was from trumps spending as well it’s just a fact.\n\nYou contradict yourself here in your second paragraph you argue about the timing but you just said yourself this was an artificial recession due to shutdowns and “everyone” knew there would be a quick turnaround so why would the trump administration pass a ton of money knowing with how quick the economy was gonna rebound due to the artificial recession and cause a ton of inflation? Remember inflation began increasing directly following Trump admin spending and continued into Biden’s admin yet you speak as if only Biden’s admin is in the wrong for the inflation? You then mention the timing of the TCJA which was at an objectively great point was good due to some specific indicators but it specifically disagrees with you on what you said about the 1964 tax cuts which don’t support the TCJA we already had extremely low unemployment so let’s lower it slightly more by cutting taxes when we don’t need to and aren’t in recession? Compared to the 1964 tax cuts where they definitely did not already have near record low unemployment rate.\n\nI’m not sure what claims about Keynesian I’m making that you need sources for I didn’t make any claims besides saying Kennedy got the idea for the tax cuts and defecit spending from a Keynesian economist is that what you need a source for? Besides that I described how Keynesian economics works you spend in defecit to help growth when needed and you shrink deficits when the economy is doing good. I’m not really gonna respond to your discussion on Medicaid and 1970s inflation I believe that’s outside the scope of the conversation I’m just gonna say you phrased the 1964 acts as great policy in relation to the TCJA but when I bring up the economic principles behind it now you are phrasing it in a bad light due to various things from the 1970s onward so we’re those cuts bad or good policy? \n\nYour final paragraph you seem to arguing as if I disagree that cutting taxes leads to economic growth but that’s not my point I DO agree that tax cuts especially corporate tax cuts can and do lead to increased economic prosperity however they also can and do result in less revenue which can create defecits \n\nhttps://fred.stlouisfed.org/series/FCTAX\n\nhttps://fred.stlouisfed.org/series/FYFRGDA188S\n\nhttps://fred.stlouisfed.org/series/FYFSD\n\nI don’t know what numbers you look at but the NBER disagrees with you and all these charts show less corporate revenue and larger deficits since 2018 TCJA and my main point here is that you attribute the 19 percent number of gdp that tax revenues were in 2022 to the TCJA but those numbers didn’t jump like that until after the Covid recession so a full two years of the TCJA did not result in that number increasing.\n\nI forgot you said one more thing about democrats versus republicans I am trying to be non biased hence why I’m trying to stick to numbers but I will acknowledge I’m biased and it’s annoying? I guess to see the argument that the TCJA was the great amazing choice for the time but all decisions democrats made were bad when both admins caused this inflation and according to economic policy that led to the 1960s record low unemployment rate would not agree with the TCJA being a good idea because increasing deficits kn good times restricts how much you can increase the defecit further in bad economic times. And then you blame democrats for not negotiating ? We both know the republicans entire legislative goal was to block literally anything Obama wanted or tried to die and McConnell is on record saying that however once again that’s outside the scope. Ultimately could I agree that the TCJA slightly boosted some numbers such as NBER saying we got 11 percent more corporate investment and could this had led to slightly lower unemployment when it was already really low? Sure I’ve never disagreed with that but it wasn’t smart policy and wasn’t necessary in a time where the economy is doing great.", "label": 1}
{"text": "Tariffs are almost universally considered by economists to be a huge net negative, and will increase costs for businesses and reduce our exports due to retaliatory tariffs.", "label": 1}
{"text": "Thanks for adding this. However, per our [source requirements,](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) video sources must be accompanied by a transcript or an article describing the content. To comply, you could edit this into the comment:\n\nhttps://www.huffpost.com/entry/robert-reich-donald-trump-election-trick_n_6721ce12e4b02f82add5d7be", "label": 1}
{"text": "The strategy is to cause maximal chaos and if they lose, claim that a winner can't be called because of all the chaos. The ultimate goal being to get the already captured Supreme Court to call the election just like they did in 2000. The key is to be ready for it, call it out as it's happening, and educate those who might otherwise go along with the argument that sounds sensible on the surface but it really just political dirty tricks.", "label": 1}
{"text": "Aside from contractors, aid tends to be strongly favored both by pro-Israel lobbyists, as well as evangelical Christians in the U.S., who tend to be surprisingly strong in support for Israel and quite politically active.\n\nI don't know why people don't realize that Christian fundamentalists are Israel's biggest supporters and they are a much larger voting group than Jews. The Christian fundies never question Israel - Jews do. Both Bernie Sanders and Chuck Schumer have denounced Netanyahu. I defy you to find a single Christian fundamentalist preacher who has done the same.", "label": 1}
{"text": "Americans are oblivious to Netanyau's plan to have Israel become independent of the US and have stronger ties with Russia and China. Netanyahu is NOT an ally of the United States.", "label": 1}
{"text": "Hi there /u/HenryXa. I'm a mod in /r/NeutralPolitics.\n\nThis submission is in the queue awaiting approval. It's an interesting topic, but could I make a few suggestions on how to change it to improve engagement?\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 1}
{"text": "Hi.\n\nThere's a lot of background in here about previous elections when the question is really about 2020. I'm concerned people won't read far enough to get to the heart of it. \n\nIt seems to me you could lose everything from, \"The New York Times did\" through \"process itself,\" without it affecting your core goals. What do you think? That change isn't required for the post to be approved, but based on my experience, getting to the questions sooner would improve responses.\n\nNext, for clarity, I'd recommend you reword this part:\n\n> Has there been any journalism on the detail of the 2000/2001 New York Times investigation regarding the 2020 election...\n\nto:\n\n> Has there been any journalism **with a similar level of detail to** the 2000/2001 New York Times investigation regarding the 2020 election...\n\nFinally, there have been quite a few investigations of 2020. While it's entirely possible they don't cover specifically what you're asking, we like to make sure submitters have at least performed a web search on the topic and included any relevant sources from that search, framing the questions around whatever's missing from those sources. \n\nSo, here are a few articles you could check out to possibly include:\n\n* https://www.pnas.org/doi/full/10.1073/pnas.2103619118\n* https://apnews.com/article/voter-fraud-election-2020-joe-biden-donald-trump-7fcb6f134e528fee8237c7601db3328f\n* https://www.hoover.org/research/lost-not-stolen-conservative-case-trump-lost-and-biden-won-2020-presidential-election\n\nThanks for being willing to engage in the process. Just reply here with any questions.", "label": 1}
{"text": "Hi. Just making sure you saw my other comment. Do you want to remove that 2012 stuff or shall I approve this as is?", "label": 1}
{"text": "Hi there /u/Sai1orV3nus. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rule D?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPlease link to a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) to support this premise: *There are organizations whose only goal is to make sure people vote.*\n\nIf you have any questions, just reply here, and thanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 1}
{"text": "Is the link I edited the post to provide sufficient? If not then you can just delete the post.", "label": 1}
{"text": "Yeah, that's good. Thanks.", "label": 1}
{"text": "I see what you mean, understood, I have removed the tangential language.", "label": 1}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1ge5sct/-/luukfpx/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 1}
{"text": "For things like this I think reality is usually a lot more boring than fiction. I doubt gangs or organized crime has literally any measurable impact on the election at all", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Keep in mind that 538 used to be independent, and is now owned by the Walt Disney Company.", "label": 1}
{"text": "Independent as of when? It was bought by ESPN (which in turn is owned by Disney) [more than a decade ago, and became a NY Times licensed feature >14 years ago.](https://en.m.wikipedia.org/wiki/FiveThirtyEight)", "label": 1}
{"text": "Yeah that's fair. The influence from Walt Disney Corporation increased after Nate Silver left. I'll have to dig around some more.", "label": 1}
{"text": "I think the main thing they are providing is some additional clarity of a race that has an electoral college. Polling doesn't tell you who is winning in a system where you can lose the popular vote and still win.", "label": 1}
{"text": "I'm not sure what Trump could say at this point that would alienate any of his voters. The man praised Nazi generals and bragged about going into a beauty pageant dressing room to watch underage girls undress, among countless other horrific comments. No significant effect on polls.", "label": 1}
{"text": "That vindication must've been bittersweet", "label": 1}
{"text": "I've lost track of the number of times I've seen posts and comments on Reddit - just like the OP here - dragging Silver/538 for being *literally the only people* giving Trump a credible chance in the election he ended up winning. \n\nI'm not sure what the reaction has been over the last 8 years in other spheres, but if it's anything like the above I would imagine it's almost entirely bitter and not at all sweet.", "label": 1}
{"text": "He's an interesting guy, seems like a bit of a maverick. I feel like he doesn't mind being slightly ostracized", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Just intuitively, you don't need to have a major effect on Trump's committed voters to have a major effect on a USA presidential election, because of a couple factors:\n\n- votor turnout is consistently low.\n\n- presidential victory means victory in the electoral college, which is consistently decided by only a few swing states, in which the margins are often slim.\n\n- there is a body within the electorate who are weakly attached to any political party and indeed the idea of voting.\n\nFor example, imagine a candidate made the news the day before the election for praising in detail a really unpopular local mayor in Georgia, who actively makes their constituents' lives miserable (the mechanism for this is irrelevant; it's just a hypothetical): now a politically-apathetic/agnostic chunk of that mayor's city receives a kneejerk revulsion towards the candidate, which motivates them to get to the polling station out of spite, but the rest of the country (and even much of the rest of the state) really don't give a damn. \n\nThis wouldn't affect the national polling average at all, and would be a rounding error in the popular vote results. And yet, in 2020 Georgia's 16 electors were decided by just 12,000 votes: that 'rounding error' news story just caused a swing of 32 electoral college votes, over 10% of the winning candidate's expected total. \n\n---\n\nThis part is pure opinion, but I think this magnifies the polling errors for Trump in particular, because, to use mdoern parlance, he's such a yapper. I don't believe it's a controversial take to say that Trump just loves to throw so many different claims and ideas out into the world, which makes him more vulnerable to that kind of extremely localised voter swing, in either direction, simply due to the quantity of material which he produces.", "label": 1}
{"text": "This comment has been removed because users are not allowed to post top-level comments on their own submissions.\n\nFor more information on the /r/NeutralPolitics rules, please see the [guidelines](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_how_we_moderate_submissions). If you have any questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FNeutralPolitics&subject=Removed%20comment&message=https://www.reddit.com/r/NeutralPolitics/comments/1gjfpn1/a_friend_of_mine_created_a_website_that_collects/lvcq41y/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "I believe this is intentional. The 2008 election and 2010 Census revealed that the Republican Party was loosing the racial type by percentage that traditionally voted for the Party. In 2011, the National Republican Party investigated and developed recommendations to bring people of color into the Party. Republicans at the State and local level ignored the recommendations for the most part and began developing ways to limit the voting power of non-Republicans through Gerrymandering, voting access, and other methods.", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Agreed. Fantastic website, Wolf Blitzer can die in a fire", "label": 1}
{"text": "Appreciate your interest! This is so important. \n\nBeware though - it’s very unlikely the results will be clear for a while. There will likely be several states that are so close they will have recounts. \n\nAnd of course if it’s not a Trump win there will be a gazillion lawsuits and state legislatures trying to overturn their state’s results and plots and mysterious goings on that will extend the suspense.", "label": 1}
{"text": "They fired the guy who called Arizona", "label": 1}
{"text": "Yeah, because Papa Trump got angry and felt he was being treated very unfair by his state media channel.", "label": 1}
{"text": "Not specifically about Section 8 housing, but [this link](https://www.lendingtree.com/home/mortgage/us-election-housing-issues/) may give you a good brief of each candidate's housing policies at large. [This discussion](https://reddit.com/r/NeutralPolitics/comments/1fsafdb/precedent_for_trumpharris_proposals_on_affordable/) on the subreddit also goes in detail about their housing proposals.", "label": 1}
{"text": "This comment has been removed because users are not allowed to post top-level comments on their own submissions.\n\nFor more information on the /r/NeutralPolitics rules, please see the [guidelines](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_how_we_moderate_submissions). If you have any questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FNeutralPolitics&subject=Removed%20comment&message=https://www.reddit.com/r/NeutralPolitics/comments/1gki55b/what_is_the_impact_of_elon_musks_political/lvlf1n7/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Hi there /u/Independent_Theme223. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rules?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPer Rule D, please add [qualified sources](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) to support the premise and all factual claims.\n\nIf you have any questions, just reply here, and thanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 1}
{"text": "Yeah. Thanks.\n\nI'll approve it straight away.", "label": 1}
{"text": "Why on earth do tech workers feel like they need a union?", "label": 1}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rules A and D.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 1}
{"text": "All workers deserve a union. Tech workers may be considered (incorrectly by some) \"the petit bourgeois\" of workers, but because tech is so competitive, many tech companies, especially FAANG, have some ATROCIOUS labor policies and churn and lack serious worker protections because so many people want to work there it's easy to kick out dissenters or rabblerousers. It's also a bit of a \"boys' club\" and gender equality in work often isn't there.\n\nAll labor is valid labor, and all labor deserves to organize.", "label": 1}
{"text": "Maybe speculate on this after the election?", "label": 1}
{"text": "Only actual possible answer.", "label": 1}
{"text": "Workers in competitive spheres are unsympathetic when their unions are destructive because that destruction exists only to further enrich individuals who could have easily chosen less lucrative jobs with more favorable working conditions.\n\nI hope the NYT comes down as firmly as the law allows them to on this group. I would expect that they should be held personally accountable for either the fraudulent work that was done in preparation for this extortion, or else the lost revenue. The public service opportunity that would have been provided is unfortunately permanently unavailable. \n\nI would have considered myself a strong union person before this. Organized labor can also be a tool for greed.", "label": 1}
{"text": "The NYT Tech Group posted a date for their strike if their demands were not met well ahead of time. This wasn't extortion, it was collective bargaining. The NYT failed to meet their demands with full prior knowledge of what would happen. I have no sympathy for the NYT and there are plenty of other (often better) sources, such as the AP for the election.\n\nPut more simply, the execs at the NYT fucked around and now they're finding out.", "label": 1}
{"text": "It is openly destructive collective bargaining for laughably marginal improvements in wages and a return to work policy. I’d hope that personal pride in the product of one’s work would have prevented this over a 5% pay raise.", "label": 1}
{"text": "Hi there /u/DisruptorInChief. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 1}
{"text": "Hi, I'm open to whatever suggestions you have. FYI, I attempted to make a similar post a few days ago, but the main issue was that I didn't cite specific sources (Rule D) for what I was saying in my original post. I decided to make a new and shorter post instead, and although this one is also discussing the same subject, I decided to cite a specific source (The WallStreet Journal video that's also citing Gallup polling for data). I'm hoping this satisfies all the requirements for the submission rules. Thanks!", "label": 1}
{"text": "nothing good ever comes from pathological wealth hyperhoarder involvement.", "label": 1}
{"text": "We need a control group without him, someone fire up the parallel universe", "label": 1}
{"text": "Imagine spending a vast quantity of what you make on your companies that you know are helping people everywhere and pushing the bounds of human ingenuity, only for uneducated people online to refer to you as nothing more than a ‘hyperhoarder’", "label": 1}
{"text": "Hi. \n\nYes, I remember. Thanks for resubmitting. Our submission rules are pretty extensive and have a lot to do with syntax, so let's go through this version and see if we can adjust it to fit.\n\nI'd begin by eliminating the entire first paragraph. I know that's rough, but the best way you can ensure neutrality under Rule B is to say *nothing* about your political position or background. On top of that, entering a forum full of political and policy wonks by saying you've never voted and never will is going to cause a lot of potential respondents to dismiss you as unserious from the outset, so despite your intent, you'll actually bias the responses with this introduction.\n\nInstead, start here:\n\n> There's a considerable number of men who have voted for Hillary Clinton in 2016 and Joe Biden in 2020 that men have now become conservative. \n\nSince this is phrased as a factual claim, it needs a source. Setting aside for a moment the source in the next sentence, the reason it needs its own is because the assertion that the men have \"become conservative\" is not the same thing as them voting for Donald Trump. There's a strong argument that Donald Trump is not a conservative and that those men don't hold beliefs traditionally associated with political conservatism. So, the statement would either need to be reworded to say \"become supporters of Donald Trump\" or it would need its own source to support the \"become conservative\" claim.\n\n> Here is a YouTube video...\n\nThe [source requirements](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) of this subreddit say that video or audio may not be used as the primary or exclusive source, but can be included if accompanied by a link to an official transcript or an article describing the content. So, you'd need a text source or sources for all the factual information in this paragraph. If you want to include the video as well, you may, but it would need an accompanying transcript or article. The presumption should be that nobody will watch the video.\n\n> I think there are other factors at play besides just abortion and economy as the main issues, but I'll make a separate post about that. \n\nYou can leave this out. r/NeutralPolitics is a strictly evidence-based forum. What OP thinks might be in play are not relevant.\n\n> But as the election results start to come in, I wanted to ask what everyone else thinks about his subject.\n\nRephrase this to be a specific question that's not asking for personal opinion (Rule A). Something like this would work:\n\nWhat evidence exists to explain this shift of men towards Donald Trump?\n\nI know that all seems like a lot, but beyond finding the source, the four edits to the text are relatively simple. Just reply here if you have any questions, and thanks for participating!", "label": 1}
{"text": "You can’t really claim to be a union person if you reject the need to form a union because it inconveniences you and you don’t like it.", "label": 1}
{"text": "Are you a god?", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Ok, I made some more modifications. I removed the Youtube video because I couldn't find a proper transcript. There hasn't been an official confirmation that Trump has won and been elected yet (as of 3:30 AM EST), so I didn't mention it and removed anything about election results. Let me know if this works. Thanks!", "label": 1}
{"text": "I think men don’t like how well women have been doing in comparison. There’s a similar thing that’s been happening in South Korea in the past ten or so years. South Korean men really want women to be obedient and traditional while women want to live freely. Also I think men are consistently getting outpaced by women in college statistics. Men are getting left behind and don’t like it.", "label": 1}
{"text": "In being so angry at white men to where SF school system removed Lincoln from a school name - democrats lost some white male allies. And there was no room for the aggressive male.", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "I feel this comment. I’ma straight white Man with a college education and I feel like the democrats demonized traditional male values.", "label": 1}
{"text": "Which values?", "label": 1}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 1}
{"text": "Because they’ve miserably failed them. And failed women, and failed minorities. They love tokenism.", "label": 1}
{"text": "Please be specific. As a straight white man as well, I would like to know what values they demonized.", "label": 1}
{"text": "In my opinion, it's because the left has nothing to offer men. When we are the minority of applicants, accepted students in post secondary, and/or graduates, affirmative action for women continues. Because the balancing act that the ideology of the left supposedly believes in doesn't seem to be flexible enough to support new underdogs. \n\n\nExtrapolating from there, that means that men can't expect support even when we become the party that is more in need of it.\n\n\nSo why should we invest in a system where we are expected to sacrifice for other people when we, as a group, are on top, but when we are not on top, other people don't sacrifice for us? \n\n\nThis is ignoring the problem with judging success of groups rather than individuals. I personally never want the amount of help I do or do not deserve to be measured by how many other men are successful. Whether or not I need help should be about how much I as an individual need help. Turning this into a gendered or racial issue means ignoring men who need help just because men as a class are doing well. This kind of identity politics is rife for abuse.\n\n\nThe best reason democrats can give men as an interest group to vote for them is to support women. That's because democrats have nothing to offer men as an interest group. ", "label": 1}
{"text": "Straight white male here; I'm not sure what values you're referring to.  Can you elaborate?  I do see that he appealed to frustrated men who are stuck and can't seem to succeed.  There are a lot of those in a highly competitive economy.", "label": 1}
{"text": "Calling them racists, sexists, xenophobes, incels (I particularly hate that word) and on and on does not seem a bit suspect to you? And while much might be targeted at white men, other men feel just as annoyed or even angry at terms like \"toxic masculinity\". Meanwhile, many young men continue to fall behind young women in areas like higher education.\n\nI should add, since when do Democrat elites, journalists, and academics even *talk* to young men? Another reply goes off of information from NPR. Seriously? Do people think they have the pulse of anyone but white, college-educated Yuppies? I have been watching Peter Santenello's travel videos on YouTube, and he gets much more at the heart of current American thinking than do traditional journalists.", "label": 1}
{"text": "What do men get out of voting for Trump? \n\nHe doesn’t seem to do anything for men, he just hurts women.", "label": 1}
{"text": "Power, racism, and misogyny. Duh", "label": 1}
{"text": "Because they say masculinity is toxic?\n\nBecause they say whiteness is a problem?\n\nBecause you are seen as the worst kind of toxic white male if you object in any way to these ideas\n\nMy kids are white males. So am I.\n\nI don't want them to be ashamed or to check their privilege. And I'm not voting for people who believe I should.", "label": 1}
{"text": "Not doing anything is probably better than the perception of doing something negative.", "label": 1}
{"text": "Being male. Not hating being male.", "label": 1}
{"text": "Incel is a term from reddit. I'm not sure if it's still around, but r/incel was a sub for men that were \"involuntarily celibate\".  I think it started as a support group for guys that couldn't get a sexual relationship, but it quickly turned into blaming women for their lack of action.  You can hate it, but it was a moniker invented by and applied to the men it describes.", "label": 1}
{"text": "Personally I feel as if the values that Dems have are against white men. I have been told many times that I'm racist and have an easier life because I'm white. (From media, news, stuff like that) There's these safe spaces which white people can't be in, I remember seeing a video asking students if black only dorms was okay to which they said yes, but in the same video white only dorms were racist. \n\nThe nuclear family has been thrown out, the nuclear family works for a reason, statistically speaking, having 2 parents in the home decreases your chances of going to jail, dropping out of high school and increases your chances of going to college. (Of course because you'll have 2 parental incomes, not because of a male and female). I feel as if Dems demonize the nuclear family.\n\nI voted for Trump this time around because my 401k had huge growth from 2016 to 2020, 2024 as a year was the best of Biden but still nowhere near Trumps. The tax plans are the same, the only change was Biden/Harris, Harris said she would do nothing different. \n\nI wish Dems had a better candidate, give us Walz and anyone else and trump would have lost in a landslide. \n\nI know this was an lot, just hope and pray 2024 will be about more than money, need stronger candidates.", "label": 1}
{"text": "Incel as a term was invented by and described women. \n\n\nRegardless of the word's history, the current dismissive attitude towards the social and economic malaise of young men is a huge part of the problem.", "label": 1}
{"text": "I don't know about \"traditional male values,\" but I think white men, especially young white men, are tired of being told that they're the source of society's ills because of generations past and factors that they have no personal control over, and have reacted by migrating to the right.", "label": 1}
{"text": "You’re not gonna like this answer, but MANY men want to have a more traditional marriage. \n\nThe Latino vote? Look there. \n\nRural African American? Look there.\n\nRural white American? Look there\n\nYou’ll find a common thread. 🧵", "label": 1}
{"text": "Look I'm gonna be straight with you. That shit you just said? That's why we lost. That's why Republicans now have control of the entire federal government.\n\nThe results are fucking in. Identity politics and socials activism focused campaigning loses elections.", "label": 1}
{"text": "I’ve got a friend group from my Army days of white dudes in rural Idaho.\n\nSpoke to a few before this election. Common point - life is too expensive. They didn’t care about anything else. They weren’t going to hear logic on inflation. \n\nEverythin was much more expensive after Trump. \n\nKamala constantly ran on a great economy. While true, people are still hurting on the price increases. It’s real, and rural groups voted.", "label": 1}
{"text": "Specifically what does Trump offer these men? Are you suggesting he's going to compel women to marry them?", "label": 1}
{"text": "Can you elaborate on that? I’m male and never have issues with democrats hating me. Tens of millions of democrats are men, including the current leader of the party. \n\nThere are certain behaviors (racism, sexism, harassment) they are adamantly against. Sometimes they speak about macro-level issues, like violence against women committed by men, but they don’t mean literally all men no matter what. They are specifically talking about the toxic ones. If you aren’t being harmful, they aren’t talking about you.", "label": 1}
{"text": "This isn’t complicated.\n\nHe promotes the lifestyle and relationship that fits with what they want. They want a traditional, “obedient” spouse.", "label": 1}
{"text": "No one will answer this question because it's not a facts argument it's a feelings argument. We didn't lose on issues we lost on vibes. Vibes largely created from right wing media. And we will likely continue to lose on those same vibes because even if things never improve none of the trump voters will accept being wrong. So we will always have been the worst option.", "label": 1}
{"text": "Where was this rhetoric from the Harris campaign. Please show me where?", "label": 1}
{"text": "I am referring to people using the term such as in [articles like this one](https://www.bbc.com/news/uk-58207064), and the general idea of incels as terrorists and threats to society. Definitions can change and usage can be used to target the \"other\". I think the idea that men who are socially and--often--economically disadvantaged are a threat based on *solely* those factors is dehumanizing and has the knock-on effect of changing voting habits.", "label": 1}
{"text": "It's more like the gradual rollback of leftwing idpol. Lots of voters have grown up hearing nothing but pro-woman pro-PoC pro-lgbt rhetoric. When their lives aren't getting much better or they perceive unfairness, then there will be backlash towards the groups they feel are to blame.", "label": 1}
{"text": "You sure it's not voter suppression? Or billionaires spending copious amounts of money on astrotrufing and advertising?\n\nI'm so sick and tired of Dems having to play the bigger person in this shit while R's run around calling trans people abominations, claiming elected officials are criminals, and everyone is cheating if they don't get there way.\n\nIt's fucking time to give that nice guy shit up. These people are everything I just said. And fuck 'em.\n\nI'm a white man. Other white men that can't see the forest for the trees are not my problem.", "label": 1}
{"text": "The rhetoric came from the left for years. I'm latino and even I see it all the time. White people this, white people that. ", "label": 1}
{"text": "Lol sorry but that just sounds like you're saying we would have won if it weren't for Elon Musk.\n\nAs for the rest, bro I don't know if you know this but when you pick a hill to die on you aren't actually supposed to die. We can't protect minorities from bigots if we lose.", "label": 1}
{"text": "The dems have done plenty of losing under the guise of bringing everyone in.", "label": 1}
{"text": "And likely won't ever be again frankly.", "label": 1}
{"text": "IDC if your latino, Idc about the \"left\" i asked where the harris campaign said this? If you voted for this reason because you thought harris supported it show me where she said it. If you can't then its not true thats not the reason why you voted. You voted on vibes. Which is fine its your vote, but if democrats are going to change messaging first we have to actually know what messages you were receiving in the first place because if you received messages that democrats never sent, well democrats can't fix an issue that doesn't exist. So where did the harris campaign use this rhetoric?", "label": 1}
{"text": "A general feeling of powerlessness and doing what they want to do in their lives, and an unwillingness/inability to question the economic system that causes it. So their only resort is to find a scapegoat or two. Trump offers those.", "label": 1}
{"text": "Being male. Seriously.\n\nWhat? You want a plank on their platform? Statistics? The problem with the democrats isn't their declared platform, it's the \"soft\" cultural values, and those are aimed squarely at men.\n\nYou want to argue about it?  Trump just got something like ten percent more of the *popular* vote, you all just aren't fucking listening any more than you've been listening for the last decade.\n\nYou want to pretend to be the party of fairness and ignore any unfairness that you personally like. Is just another version of the shit the republicans push and you'll argue unendingly that it's not the case, but here we are.\n\nShit, I vote democrat and I'm angry about these results and you never listen when people like me speak.", "label": 1}
{"text": "People are pretty good at sensing when they are not wanted.", "label": 1}
{"text": "Exactly", "label": 1}
{"text": "Poo culture/academia/media is dominated by left wing folks so when this rhetoric leaves it mark elected Democrats will bear the consequences, whether you think that’s fair or not.", "label": 1}
{"text": "Did they lose the youth vote?  Or was there not much of a youth vote to lose?  That's always been the problem with the youth: they don't vote.", "label": 1}
{"text": "I had a colleague tell me the reason she didn’t inform me of an incident involving one of my employees was because I was “sis white guy and wouldn’t the right thing” \n\nThe employee dropped the hard R… i would’ve fired them on the spot but she dragged it out with HR first instead 🤷‍♂️\n\nI can also guarantee the second Kamala started talking about banning guns she lost a good chunk of people too", "label": 1}
{"text": "Same and same. Clearly some guys are so insecure in their \"manhood\" that they can't handle the truth or women having equal rights and agency over their own lives and bodies. The fsb and others have effectively weaponized the incel movement and are using it to get us to destroy ourselves and its working. \n\nI am now realizing that there are more misogynistic, racist, assholes out there than I ever would have imagined. This country (as we know it) is over and Bidens win in 2020 was our democracy's dead cat bounce. I'm not going to stop fighting while I can but I am pretty sure my wife and I will be planning our exit from this country that the right has been calling a shit hole and have done everything they can to prove themselves right.", "label": 1}
{"text": "I wasn't asking about fair or not. However, if the issue is that people think she ran a message that was anti-male and she factually didn't then message isn't the issue.  Second pop-culture is dominated by ring wing media rn, the most popular podcasts in the world are all right wing, the most popular content creators are right wing. The most popular news sources are right wing. This idea the left runs the media or pop-culture hasn't been true for a long time. The right just does a good job of pretending, and the left has to counter that narrative because despite the fact that the right overwhelmingly controls the media narrative in this country somehow people think it leans left because the right has no actual policy to run on so they just flame culture war issues all day long.", "label": 1}
{"text": "Honestly? I feel it's because the Democratic Party expects something of them. It expects these men to recognize their place as an equal partner in the world and work to make things better for everyone. It expects then men to look at themselves unflinchingly and want to improve their standing and their lives. The opposition expects nothing. It offers enemies upon which to heap blame. It tells them, \"It's not you. It's THEM.\" Once we get rid of THEM, your life will be better and you won't have to do anything. In fact, once we get rid of THEM, you will reobtain your top point in society.\n\nThe Democrats offer nothing but work and the GOP offers success without effort.", "label": 1}
{"text": "\"We didn't like to be universally tolerant, so we became fascists.\"", "label": 1}
{"text": "I'd like to ask more about the first couple of values here, and I'm not here to start a fight, I think it would be genuinely worth talking about because I'm struggling to see how these values line up specifically with men.\n\nOn the first one, around how you feel being told that you have an easier life because you are white: there is some evidence that this actually does happen. For example, a study 20 years ago showed how people with black-sounding names get fewer callbacks for job applications than people with white-sounding names, and the results were replicated just a few years ago ([see here](https://www.npr.org/2024/04/11/1243713272/resume-bias-study-white-names-black-names)). Is your view that these studies are wrong, or that the difference is so small as to not worry about, or that the difference does exist but that it's OK for it to exist? It feels like it has to be one of those three in some way.\n\nOn the nuclear family, I agree that children who come from 2-parent families generally show better life outcomes like you said. But mothers worry about this too (indeed, many of them stay in bad marriages for the kids) so I'm struggling to see how this is a men's issue - isn't it an issue for all parents?\nAnd if we agree that women care just as much for their children's outcomes, then how come they are voting more Democratic then men?", "label": 1}
{"text": "The dude is a magat, don't waste your time.", "label": 1}
{"text": "Why does it have to come from Harris? The topic is democrats", "label": 1}
{"text": "You've never heard of \"whiteness\"? You've never heard of \"toxic masculinity\"? Or are you just obfuscating?", "label": 1}
{"text": "Just to be clear, there are bigots in every demographic. I'll grant that some people genuinely discriminate against white men, but they are outliers, and no more extreme in their beliefs than their ideological opposites. Living in a liberal city I've met them, but they are absolutely a minority and most democrats have been nothing but welcoming to me; a cis, straight, Christian(ish), white man. Those bigots do not represent the democratic party any more than literal neo-nazis represent the republican party. They can and should be ignored.\n\nAnd yes, democrats ironically shoot themselves in the foot every time they talk about guns. Whether their arguments have merit or not doesn't matter, Americans like guns more than they like not having school shootings, and it's not even close.", "label": 1}
{"text": "Right wing podcasts are so popular precisely because legacy media, pop culture, and academia are so left wing and hostile to them.\n\nI’m a lifelong Democrat who’s left the party - and it seems whenever people ask these questions about why they are basically unable to understand it.\n\nYou can think it’s disinformation or bias or bigotry or whatever but doubling down is clearly not working.", "label": 1}
{"text": "Toxic masculinity refers to specific problematic behaviors in a specific subset of men. If you aren't a bigot or sexual predator, *it does not apply to you.* \n\nI've heard of \"whiteness\", but that's some permanently online SJW shit. I live in a big liberal city, and have never heard someone say that in person, ever. Nor have I ever been discriminated against for being white.", "label": 1}
{"text": "Wassup Destiny enjoyer", "label": 1}
{"text": "You keep saying they \"are\" and have not shown a single example at all. if you assert something without evidence people will dismiss it without evidence. \n\nRight wing podcasts are popular because they are entertaining and simplify reality to an absurd degree. They just take you from one rage talking point to the next which is good for people who generally feel left behind but they don't offer any actual solutions or try to fix anything. It's the perfect receipe for a perpetually mad child. \n\nI don't care if you are a lifelong democrat that is a meaningless statement why were you a democrat? What could have caused you to have abandoned all of your democratic values, as a life long democrat and a man, I don't see any hostility in the democratic party, but I hear this talking point a lot. Either say something or yes please go away because saying nothing isn't helpful and thats all you've done.\n\nI didn't say it was any of those things. I said the right runs on culture war issues because they have no policy, and most americans don't understand policy so its easier to identify with random culture war bullshit. i don't need bias or bigotry to get that. You are the one stating that there is bias and bigotry... YOU STATED DEMOCRATS ARE BIASED AND BIGOTED AGAINST MEN? WHy are you projecting???", "label": 1}
{"text": "Are you seriously acting like the Republicans *aren't* riding the vibes of identity politics? They just have the benefit of massive double-standards.", "label": 1}
{"text": "Reductive much?", "label": 1}
{"text": "Oh? Can you expand more? I'm not from us but was searching more on why Trump won and those who voted for him and their opinions. Can't find much.", "label": 1}
{"text": "You can lead a horse to water and all that, man. You can't help people who actively refuse it. Dude literally just listed off things that have happened and you're all \"yeah see you can't say that and expect to win\". There's no winning.", "label": 1}
{"text": "Have you seen that Gillette video a few years ago? Watch it again and there's your answer.", "label": 1}
{"text": "One of apparently the majority of Americans", "label": 1}
{"text": "The most watched media network is Fox, which is  conservative.\n\nLiberals tend to favor education, so don't be surprised when you find liberal educators practicing what they preach.\n\nPopular culture is popular because the population consumes it. If more people like \"not pop culture\" that's what the people making money from it would provide.", "label": 1}
{"text": "Much to our national shame, yes.", "label": 1}
{"text": "Haha you answered in good faith and are awaiting a response. I wish you luck", "label": 1}
{"text": "This is not a serious position.", "label": 1}
{"text": "Incel pre-dated reddit as a word.", "label": 1}
{"text": "That’s a good question, I’d love to see the data on that.\n\nAnecdotally I know a surprising amount of <30 men who have been convinced that the republicans are the only ones looking out for them. That masculinity (and especially straight, white masculinity) is the enemy of the Democratic Party. And the Republicans are their last hope.\n\nThat’s a bit of hyperbole of course but it does seem like the Democrats have pushed away a lot of these men somehow.\n\nI’m curious to see how much it mattered.", "label": 1}
{"text": "Agree, but in some states with a +-5% swing that youth vote can be the difference to either party.", "label": 1}
{"text": "No it's pretty spot on", "label": 1}
{"text": "One brand is a reaction to the other. Democrats have been focusing on identity for a long time.", "label": 1}
{"text": "The reductive misandry is most likely part of the reason men are drifting away from the Democratic party.", "label": 1}
{"text": "Dems don't speak to working people's needs at all.  They have pivoted to the party if the elite and wall street.  Harris outspent Trump 2 to 1.  Trump is a reaction to being left behind and he always has been.", "label": 1}
{"text": "Which ironically qualifies them as valid targets for that blame.", "label": 1}
{"text": "Oh, of course not.  It's not serious because it's so laughable that it was part of Donald F'ing Trump winning at 71MM to 66MM even in the pop vote.\n\nI already knew the issues, but having a daughter cemented the shit out of it.  I didn't feel as much a piece of the scenery even in the army where I was barely even a number.  In the hospital I didn't count.  In school they keep changing my contact information to the mother.  In court we had literal video of her mom laughing about how easy it was to lie to the court so I spent six months only seeing my girl for two hours on wednesday.\n\nChild support is ridiculously fucked.  Her mom's house is fine and we're 50/50 but I still have to pay child support.  We have an entire system for food stamps where individual items are in a database of UPC codes for what you can buy and what you can't but we can't make child support pay for clothes, food, school supplies, rent, etc...and you all motherfuckers will spend hours laughing about how it doesn't matter.\n\nDance was great...want to feel like you're nothing but a piece of shit?  Be a single dance dad.  Women yelling at you to gtfo, having police called on you because you're helping your kid change, etc.\n\nOn that note how about having the police called on you for sitting on a park bench?  Yeah, I was watching my kid play but that shouldn't be what lets me be in a goddamned park.  How about getting thrown out of a local pool because someone made up some shit? Oh, the cops got sheepish when they realized it was a custody dispute but they went for it just fine.\n\nOh, poor widdle *meeen* how bad must you have it when you have it so good?  You can call it what the fuck you like, but when suicide is one of if not the [leading cause of death for men under 50](https://headsupguys.org/suicide-in-men/suicide-stats-men/#:~:text=Nearly%2012%20men%20lose%20their,every%20day%2C%20over%2036%2C000%20annually.) maybe you all motherfuckers should pay attention.\n\nYou raised women up, great! ...except you mostly didn't, you just beat men down and you want to pretend that the [nearly 60/40 gender split in college](https://www.forbes.com/sites/michaeltnietzel/2024/08/07/women-continue-to-outpace-men-in-college-enrollment-and-graduation/) isn't a result of that.\n\nWe die, we work, we get no love, we have no friends, we have no future but being a fucking ATM machine for a family that doesn't give a shit about us and now we can barely feed ourselves and can't buy homes and you're fucking surprised that we care?  \n\nOh well, at least it's not affecting you at the ballot box, huh?\n\nWait, no, this guy here is *wrong*!!!  Do you motherfuckers have no sense of cognitive dissonance when you lose to some geriatric diaper wearing shitstain and keep on parroting your bullshit while asking \"but whyyyy?!?\" and then refusing to listen to the answers you get?\n\nGoddamn it's frustrating.", "label": 1}
{"text": "I think it may be more about the youth not voting. Most of them were 8 when Trump was elected. I think what we will see similar to what happened with Brexit - buyer’s remorse and not realizing what the massive impact this will have. I’m not surprised at the outcome of this election at all.", "label": 1}
{"text": "You are lost", "label": 1}
{"text": "The point that needs to be internalized, IMO, is that *lecturing* people is bad politics. Being right is irrelevant. If you make someone defensive, you've lost the ability to persuade them. It's not a question of rightness or wrongness -- the onus is always on the persuader in politics.\n\n*Should* white men need to be coddled? No, obviously not (upper middle class white man, for the record), we are quite probably the most historically fortunate demographic group in history. But *should* is irrelevant; you meet people where they are or you lose them, full stop.\n\nPolitics is persuasion. It's not an exam where the folks with the most factually correct answers win. Would it be better if that were the case? Yeah, probably, but that's not the game we're playing, unfortunately.", "label": 1}
{"text": "So go have a traditional marriage? Literally nothing is stopping them?", "label": 1}
{"text": "If that's what it comes down to then any incumbent was doomed to lose.", "label": 1}
{"text": "I’d suggest looking up empathy. \n\nIf the dnc can’t understand this group, they won’t win again for a long time.", "label": 1}
{"text": "Good luck with the custody situation mate. Hope it works out.", "label": 1}
{"text": "No I'm speaking facts, the dissection of the cross tabs don't show that democrats lost any significant margin to republicans, it just shows that democrats failed to turnout a large portion of their base.  So if anything Ironically doubling down of red meat for the base and ignoring centrists or people who flipped their vote to trump would be the most correct play moving forward. I'm only engaging because there might be some messaging I missed but considering no one is actually showing me any messaging just repeating the same old talking points I'm pretty sure i'm correct and it was all vibes and had nothing to do why democrats lost.", "label": 1}
{"text": "Basically groceries and other necessities are too expensive.  Along with rent increases and payroll remaining stagnant.   I personally don’t think this is an issue Trump would have solved any differently, just a product of a post-pandemic world.  However, trump voters blamed Biden/Harris and along with illegal immigration fear mongering, won over many voters.", "label": 1}
{"text": "“We blamed them for our problems, so they voted against us. See how that means they’re the problem?!”\n\nIf this is the position Democrats take then the party is truly dead.", "label": 1}
{"text": "$25,000 later it's mostly settled down to exactly what it was before and it was always going to be.\n\nI'm so tired of that fight, more tired of the constant fear that it's not over because she can make up anything she wants and start shit again whenever she feels like it.  I finally got a contempt of court hit against her and enough of her backers caught on that she's backed off for the last several years...but it's only a whimsical story away from jail for me again.\n\nBoy it'd be nice if weaponizing angry women wasn't a primary function of the courts.", "label": 1}
{"text": "Jesus christ this sub is being overrun by revisionism. Republicans started focusing on identity politics in the 60s-80s. Learn some history. The old kind based on reality, not the historical fiction your party is going to shove down our throats.", "label": 1}
{"text": "This unserious position just decided the election. I don’t know how many times you have to have it drilled into your head. Do you want Democrats to win? Or do you want to blame straight men for all of your problems? Can’t have both.", "label": 1}
{"text": "I mean people hate me just for being a straight white male so …", "label": 1}
{"text": "Yup, this is just an expression of our garbage individualistic culture. This is your nation's brain on consumerism.", "label": 1}
{"text": "Good lord.  Please don’t ever change 😘", "label": 1}
{"text": "Just look at who gave her money.  Look at the entire culture of media and elite lining up against Trump.  They don't believe any of that.  They didn't offer that in the 4 years they were in power, in fact they created the opposite.\n\nAll Trump had to say is that they aren't against me, they are against us and the people with no job who can't afford groceries line up", "label": 1}
{"text": "It's not my party. I'm not republican. I would never vote for trump. \n\nI'd say this kind of thing is what I am talking about. You immediately misidentified me as an enemy and attacked.", "label": 1}
{"text": "The argument is that they are being blamed for being racist and mysongistic, and therefore push by by supporting racists and mysongists. Thereby proving the initially false accusation, true.\n\nAs an analogy: \"Don't call me a thief or I'm going to steal your wallet!\"", "label": 1}
{"text": "Agreed 100% and there has been a constant stream of media around it for years now. The constant drum banging and scare politics used to be AM radio, but it has shifted to YouTube, where the algorithm makes sure you have a constant stream of PragerU-esque content to wallow in until it starts sounding reasonable. \n\nEveryone can name several prominent conservative talking heads that are driven almost entirely by streaming culture and redpill YouTube, but there doesn't really seem to be the reverse. Who is the liberal Andrew Tate or Ben Shapiro?", "label": 1}
{"text": "Oh no, you got me, I'm an SJW. It's just a reaction to conservatives' identity politics, though, so you didn't get to criticize me for it.", "label": 1}
{"text": "This is why you lose", "label": 1}
{"text": "I mean, you SORT of gave us the answer.  Just indirectly.\n\nYes, democrats lost the elections largely because they underestimated (still, to this day) how monumentally stupid this country is as a whole.  Hopefully, they can fix that.\n\nEverything else you typed is the most braindead nonsense I've seen since ANY Trump speech ever.  So good on you, big guy.", "label": 1}
{"text": "I think you're giving too much credit to the average voter. You're saying they peeked behind the curtain and determined that the Democrats are being disingenuous, while at the same time disregarded all of Trump's blatant lies? I mean, let's be honest, it seems like the guy can't open his mouth without telling a lie that's easily debunked.", "label": 1}
{"text": "is no one going to mention the elephant in the room?", "label": 1}
{"text": "Look at the last comment I linked. You are just outright saying that Michigan is a racist place because white people exist there.\n\nThat's the sort of dumb, polarising, identity politics shit that turns people away from the democrats. People like you are why we just lost the election. Great job.", "label": 1}
{"text": "Care to elaborate?", "label": 1}
{"text": "So, are we not supposed to talk about sexual assault at all? Or are we supposed to pretend some terminally online minority’s rantings are some major pressing issue despite never running into these people in real life?", "label": 1}
{"text": "Does Trump espouse good traditional marriage(s)? [He seems to have cheated on every one of his wives, including a New York Post 1990 headline \"Best sex I ever had!\" - from a woman who was not his then wife. He also paid a pornstar who had sex with him, and had another one paid off by a supporter](https://www.newsweek.com/how-many-times-trump-cheated-wives-780550)", "label": 1}
{"text": "I see where you’re getting confused. This should clear it up:\n\n“Hey man, I’m going to assume you’re a criminal because you have tattoos. By the way, don’t vote for that other guy who I also assume is a criminal because he has tattoos.”\n\n“Okay, well I’m not a criminal and don’t appreciate you making that assumption about me. Also, since I know your assumptions about people with tattoos are flawed, I don’t really trust that the guy you don’t want me to vote for is what you say he is. In fact, that guy doesn’t assume I’m a criminal because of the way I look so I sort of prefer him.”\n\nWho knew that telling people they are bad would make them not feel welcome in your political movement (bonus points if you are poorer than and suffering more than the people telling you you’re the problem).", "label": 1}
{"text": "If you have a point to make, make it.", "label": 1}
{"text": "Don't label it as a form of masculinity. Find me someone on the left saying anything good about men. White men even better. \n\nDoesn't exist", "label": 1}
{"text": "You think democrats lost because they didn't put something on their website.\n\nLet's just roll through that SUPER quick: how many people who voted this year went to [democrats.org](http://democrats.org) to make up their mind?\n\nThis is such a shallow, vapid reading of what is happening that it makes it so clear that all you're doing is injecting your own personal pet project (sexist gibberish) into the election.\n\nIf you voted for the guy who actively tried to overturn the last election, then I don't know how to help you.  You are, objectively, too stupid for this conversation.  Please leave me alone.  You have a toddler's understanding of the world, not just american politics.", "label": 1}
{"text": "This comment sums up the problem perfectly in my opinion. You were asked specifically what you're mad about and you can't even explain it. Looks like you just FEEL like you should be able to be more manly, whatever that means, and the Democrats are trying to get you to stop, which is annoying. Is that _really_ happening? Who knows! No one can seem to define manly in a way that doesn't just mean \"dominating someone else\" or make them sound like an absolute gremlin, and so we're left to wonder if that's what young men are upset about missing out on.\n\nAsk someone what time period they are imagining when they say \"great again\" and you get something between \"i don't know but now seems bad\" and a completely fictional dream world that is a bizarre blend of the 20s 50s and 80s with none of the downsides. Telling them \"that version of America actually never existed\" is pointless because they weren't really basing their position on facts in the first place.\n\nNational politics are about vibes and the red pill is a much easier pill to swallow than the left's relatively complicated stance that we should stop glorifying sexual harassment, that people like Elon are not actually good people, that taxing the rich isn't \"unfair\" because they extracted their huge wealth from the society in the first place, that times are hard but actually just about every single measure of societal progress has been steadily improving this entire time, etc.\n\n\"Me man, you woman\" is easier to understand, \"seems right\" if you're the kind of person that doesn't really want to dive too deeply into it, and doesn't alienate any demographic large enough to swing the election.", "label": 1}
{"text": "Still waiting for you to get back on topic and respond, by the way.", "label": 1}
{"text": "Trump promising tax free OT while Harris says you’ll get a 25k credit towards your first home. What good is a credit if the prices of homes are sky high.", "label": 1}
{"text": "Hi there /u/oyodeo. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rule D?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPlease add links to [qualified sources](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) to support the premise and all factual claims.\n\nIf you have any questions, just reply here, and thanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 1}
{"text": "Hi, I have added 2 sources:\n- 1 regarding the resurgence of far-right ideology in Europe during the last elections\n- 1 regarding the misinformation and propaganda coming from Russia.\n\nLet me know if that's enough to satisfy rule D ?", "label": 1}
{"text": "Thanks for adding those sources. There are two other phrases that are come across as factual claims:\n\n> It’s as if democracy itself is eroding from within, with parts of the population becoming more skeptical, even hostile, towards it. \n\nInstead of providing a source, it may be easier and more neutral to just rephrase that as a question.\n\n> This change is surprising, especially given the longstanding belief that democracy was the gold standard of governance.\n\nThe first part of this is personal opinion and the second is going to be especially difficult to source, so I'd suggest eliminating the whole sentence.", "label": 1}
