{"text": "I am not sure what you use to determine but the polls are all showing Trump leading and the vegas odds are heavily favoring Trump.", "label": 0}
{"text": "Taking bribes would be wrong for one.\nEnabling trafficking would be at least morally wrong. \nEnabling people who intend to murder to get rid of competing groups  would be morally wrong. Both of those are denial of human rights \n\nViolence to intimidate voters, as happened in Sicily, woupd be wrong.", "label": 0}
{"text": "Hi there /u/jpoptarts. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) D and G.\n\nThis might be a better fit in r/PoliticalDiscussion or /r/Ask_Politics.\n\nThanks for understanding.", "label": 0}
{"text": "Hi there /u/Individual-Parking46. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rules D & G?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPlease add a link to at least one [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) to support the premise and any factual claims (an article about the PA incident would suffice) and make sure to frame the question around what is *currently* or *historically* possible, not what would be possible in a hypothetical future.\n\nIf you have any questions, just reply here, and thanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "K.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) B and E.\n\nWe don't allow poll/survey style questions or requests to support only one side of an issue.\n\nYou might find that /r/PoliticalDiscussion or /r/Ask_Politics are better subreddits for this. On the other hand, if you're committed to posting it here, just reply and I'll offer some suggestions on how to rework it.\n\nThanks for understanding.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1g95a9z/-/ltrnkgr/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Hi there /u/Shmexy. I'm a mod in /r/NeutralPolitics.\n\nHave you checked out the [voter information post](https://www.reddit.com/r/NeutralPolitics/comments/1g4rpq8/info_the_rneutralpolitics_voter_information_post/) pinned to the top of this subreddit? It has links to the candidates' policy pages near the top and links to some comparison sites at the bottom. One of the comments on that post also notes the same thing as you.\n\nThis post cannot be approved, because it doesn't ask a specific political question, per submission Rule A, but hopefully, you can find the information you're looking for in the information post.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules. Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "A few years ago, I learned about a book that says that about the \"Dark Ages.\"  But I can't remember what it is.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "One's vote is important even in a non-competitive election. The percent vote of any candidate voices the support for that candidate and their policies. When a candidate wins by a significant margin, they might claim that their platform \"has a mandate from the people.\" If an election is close, they should conclude that the voters are split in their support for the platform (\"should\" because \"candidate quality\" is an easier thing to place all the blame on). \n\nEven voting in primaries in non-competitive states is valuable, as it sends a message to the party as to which issues or candidate style are desired in the future. “As a person of this party, I want more people who talk like So-And-So.” They may send that message because So-And-So is advocating more extreme positions that the voter feels are very important to support, or they may send it because they believe So-And-So or their message is a step towards making their currently non-competitive party more so.", "label": 0}
{"text": "Presidential elections are among the **least impactful** elected roles on the ballot for any given voter, despite the outsized relevance of the presidential election on nationwide media. Local officials determine how much you pay in taxes, where you park, it builds committees that decide whether your church's property can be rezoned as a car wash. \n\n[State ballot measures](https://ballotpedia.org/2024_ballot_measures) can be astoundingly impactful, and are arguably the most direct forms of democracy in US electoralism, generating a definitive mandate from the people on state policy, or even the wording of the state's constitution. Ballot measures create consensus on issues like civil rights (both granting and denying), and tend to be both directly democratic and directly impactful to the voter. \n\nI think there is some power in *withholding* your vote from a candidate, but that's only true if you cast a ballot. If a politician is supposed to understand that some of their supporters are withholding support, they can only do that if you're both registered for that party and cast a ballot during that election. Otherwise, you're just among the [80 million eligible non-voters](https://en.wikipedia.org/wiki/Voter_turnout_in_United_States_presidential_elections), and they could just as easily assume you didn't care, or threw the ballot away, or you were blackout drunk all October. \n\nPersonally, I don't think it's the be-all-end-all of civic participation, but it's a small amount of paperwork and an only a moderate amount of reading.", "label": 0}
{"text": "We dont know if it is a provlem or not. Turns out other nations are doing a lot to undermine our politics and it would be good to know more else it isnt our country--I havent seen outside influences as having the best interest of the natives. They dont have a right to vote in our situation. There are no freedoms without responsibilities but no one wants to talk about those. Would not a responsible political person, a public figure who has given up some privacy to serve, disclose sources of dark money? \n\n I think you jumped to \"ending all protections.\" I never said that. My inclination is say what you want [Short of fire in a crowded theater] but own it so we know what and who we are voting for.", "label": 0}
{"text": "Thanks for this response. I wasn't looking for exclusively con arguments, but could you point to some further reading about the claims in that last paragraph?", "label": 0}
{"text": "Thanks, it was an opportunity to sound out some thoughts I've been having watching this election discourse. As for the con argument, it's theory of mind stuff, and as such is bound to be up to subjective experience. I think it rings true, but I wouldn't expect sourced argument to justify a disagreement against it. It'd be hard to find material directly relating to it, and it's not my field of study, but some related information is in the topic of cognitive dissonance.", "label": 0}
{"text": "> Which is more beneficial for the country, the community and his future?\n\nThat the education system in your hypothetical not have failed Johnny so thoroughly already that he can only fathom \"don't vote\" or \"double my dad's ballot\" as the only options. Like your hypothetical is more grounded in realism perhaps than one where voting involves sacrificing a child, but its just as divorced from reality.\n\nEven assuming Johnny is so fundamentally and completely incapable that he could only imagine casting the exact vote in the \"pre-filled sample ballot\" the \"con\" of him voting is outweighed by the fact that the democratic process is in play. Johnny's voice has been counted and the government derived from the result of it and all the others is more legitimate for it. And yes Johnny really fucking phoned this shit in by not being able to go \"hmm I could also vote this other way\" but Johnny has a connection to the political process and if Johnny hates someone he voted for he has a direct cause and effect and can pressure the candidate representing him to change, or at the very least make a less absurd choice next time.\n\nYour hypothetical requires such a weird detachment from the human condition, from the baseline capabilities of an adult with  drivers license, that it really undercuts how laughable the \"voting is bad actually\" arguments are. The only cons to voting currently are the investment of time and energy, cons which are only noticable in cases where people in power fear losing their power because they've fucked over the citizens they're accountable to, so they argue and legislate against voting to keep the privilege but lose the accountability.", "label": 0}
{"text": "I appreciate and thank you for your points about Johnny's voice being counted and the value of that.\n\nHowever, I definitely need to push back on the numerous assertions about this hypothetical being divorced from reality. As a moderator of this subreddit, I've been fielding a lot of queries lately from first-time potential voters who really have minimal interest in politics and/or do not see the value in voting. I've also talked to a few parents of young people who feel similarly and/or have a parent fill out a ballot for them. They were the impetus for this post. \n\nI won't for a second deny that the education system has failed them, but it's considerably more common than one might imagine if you don't know people in this age cohort. Plenty of them just go about their lives not thinking about politics and how it affects them. And to be honest, I knew people like that when I was their age too. But the significant [diminishment of civics education since then](https://www.usnews.com/news/education-news/articles/2023-05-03/a-national-concern-student-scores-decline-on-u-s-history-and-civics) has exacerbated the problem, to the point that [most Americans couldn't even pass a citizenship test](https://www.usnews.com/news/politics/articles/2018-10-12/2-of-3-americans-wouldnt-pass-us-citizenship-test) these days. [Young people tend to have the least civics knowledge](https://www.pewresearch.org/short-reads/2023/11/07/what-americans-know-about-their-government/) of all on most questions.\n\nMy point is, I'm not sure it's advantageous for all of us to live under the representation and policies voted in by the least informed amongst us, and I don't think there's a real way to force them to be informed. You can lead a horse to water... but you can't make him take his civic duty seriously if he's completely disinterested. It might be preferable if stubbornly ill-informed voters don't subject the rest of us to their choices.", "label": 0}
{"text": "You entire hypothetical is pushing this idea that in some cases there's a negative to voting...there is not.\n\nI'd argue that a large chunk of the electorate that does vote also doesn't know anything about policy or even how our government works. I'm not making an assertion to that because I don't feel like linking survey after survey after survey demonstrating lack of knowledge.", "label": 0}
{"text": "And 1 & 2 generally total less than an hour a year. People likely spend more time taking a shit each week than it takes to vote and research in an entire year...do the research while shitting (2 birds 1 stone)", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C and D.\n\nThanks for understanding.", "label": 0}
{"text": "The original post gave the impression that you were talking about the pros and cons of an individual voting. But in this case, you are asking about the benefit to the country and community. Are you discussing pros and cons to communities or individuals here?", "label": 0}
{"text": "The question came about because I fielded questions from a couple people who fit the general description of \"Johnny\" asking why they should bother voting. Their thinking was that it'll make no difference and they wouldn't even know who to vote for anyway, because all the candidates seem the same to them.\n\nI generally encourage people to vote, and although I can certainly make some good arguments in favor of doing so, I didn't have what I considered a particularly persuasive response to these clearly low-information potential voters. \n\nSo, in that sense, this resulting post (which needed to consider both sides in order to meet the sub's neutrality requirements) was about the individual. But as I researched it and considered the \"cons\" above, the one about such voters potentially having a negative impact on the rest of the electorate was one that got me wondering, so put forth this hypothetical as well.\n\nI'm still highly in favor of voting, but as this is a forum to have open discussions of political issues, supported by logic and evidence, I guess I'm asking about both the individual rationale and the potential affect on communities. \n\nThat was kind of a long response, but does it answer your question?", "label": 0}
{"text": "But the will of every voter is not equal.  \n\nI assume we've all once stared at a ballot for the seventh district court majesty, and said \"whatever, I'll choose the one with a cool sounding name\"\n\nMy point; we should encourage people to be more informed voters, rather than just ballot filling bots.", "label": 0}
{"text": "In my experience, the difficulty with local officials is getting good information about them, especially if they've never held office before", "label": 0}
{"text": "Wouldn't a federal government be required to grow as it's population grows and as we find new technologies and vocations that require regulation to succeed?\n\nAnd by every metric? Which metrics are you measuring with?", "label": 0}
{"text": "This seems to be a reasonable source:\n\nhttps://usafacts.org/articles/how-much-money-does-the-government-spend-per-person/\n\nYou can also look at metrics like our national debt. But you're right, it's not easy to gauge against an increasing population.", "label": 0}
{"text": "I appreciate the response. I'll have a look at this when I get a chance.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule A.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) B and D.\n\nHowever, it could be reworked to comply with those rules by keeping it neutral. Relevant questions along those lines would be:\n\n* Did the party conventions in the US ever consist of more public motions and debate?\n* If so, when did this change and why?\n* What are substantive differences between the party conventions in the US and those in other democratic countries?\n* Is there any kind of movement or initiative to increase the amount of open debate at US political conventions?\n* Do the less dominant US parties engage in more open debate than the two dominant parties at their conventions?\n\nI think you get the idea. Under Rule B, submitters may not take a position.\n\nIf you have any questions, just reply here. Thanks.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nHowever, there is a [voter guide](https://www.reddit.com/r/NeutralPolitics/comments/1g4rpq8/info_the_rneutralpolitics_voter_information_post/) pinned to the top of the subreddit that includes links to the candidates' policies, then further down, links to comparison sites. Those might help you get accurate information. And for specific \"is this true\" type questions, try the various fact-checking sites.\n\nThis post as it stands might work in a subreddit like /r/PoliticalDiscussion.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, D and E. As a strictly evidence-based forum, we don't allow survey-style questions or requests for personal opinion.\n\nHowever, this is an interesting topic that could be reworked into a post we would accept if it included a link to at least one [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) (such as a study on the topic) and asked fact-based questions like:\n\n* Is there evidence that online forums promote inclusive, thoughtful discussion about politics?\n* If results are mixed, what are the features of forums that do promote such discussion and those that don't?\n* Is there evidence that users in such forums are more or less likely to engage with others they disagree with politically?\n\nFeel free to review the rules and submit something like that if you're so inclined. We'll review it an offer additional suggestions if necessary.\n\nThanks for understanding.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rule D,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) which requires inclusion of the link to at least one source.\n\nTry performing a web search with your question. If you don't find a suitable answer, use one or more of the articles from that search as the basis for a new submission.\n\nThanks for understanding.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Rioters are still American citizens and you cannot use the military within America's border per federal law for law enforcement purposes. \n\nhttps://en.wikipedia.org/wiki/Posse_Comitatus_Act#:~:text=The%20Posse%20Comitatus%20Act%20is,policies%20within%20the%20United%20States.\n\nNote this does not apply to the national guard, but they must be invited by the states governor first. Not sent there, per the link.", "label": 0}
{"text": "This is a reasonable complaint. Mods will discuss. Thanks.", "label": 0}
{"text": "Labor Racketeering has always been a hotbed of organized crime involvement in politics, and that issue hasn't gone away. See [The DOL's semi-annual report to Congress](https://www.oig.dol.gov/public/semiannuals/91.pdf), page 57 ff.", "label": 0}
{"text": "Israel and Iran have been engaged in a sort of smoldering on-off indirect war for decades.\n\nIran is an Islamist state whose government considers Israel an eternal enemy, one it wishes to see destroyed. Many Arab nations would have said the same in decades past, but have increasingly been persuaded to make peace with Israel, while Iran's government has maintained a hard line. As it lacks the capacity to do much directly against Israel (see the limited damage from recent strikes) it tends to instead funnel money/arms to militant groups like Hezbollah (which hangs out in South Lebanon) or Hamas (which hangs out in Gaza) so they can wage low-grade guerrilla wars and launch rockets at Israel. In turn, Israel intermittently intensifies military responses, sometimes invading South Lebanon to attack Hezbollah. (Lebanon itself doesn't really have the military power to get rid of Hezbollah, even if it had the political will to do so, so it gets roped in.)\n\nThis has been the status quo for a while. The smoldering conflict gets a bit hotter or cools down, but never quite peters out or flares into full-on war. Recent events have heated things up and led to fears of a full-on war that pulls in more of the region. (Formal declarations of war have been rare since WWII. As it stands, Israel has declared war on Hamas, and Hezbollah has called Israel's pager attacks a \"declaration of war\" but it's not clear what that means.) \n\n[https://www.csis.org/analysis/escalating-war-between-israel-hezbollah-and-iran](https://www.csis.org/analysis/escalating-war-between-israel-hezbollah-and-iran)\n\n[https://en.wikipedia.org/wiki/Iran%E2%80%93Israel\\_proxy\\_conflict](https://en.wikipedia.org/wiki/Iran%E2%80%93Israel_proxy_conflict)", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Hi there /u/Two_wheels_2112. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rules?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPer Rule D, please edit in a link to at least one [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) and make sure your post only asks questions not covered by that source.\n\nThanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "Those are daily aggregators, not newsletters, but perhaps they will help...\n\nA lot of people seem to like [Ground News,](https://ground.news/) because it links to multiple articles for each news item and ranks them on a left-right-center scale. I personally find the layout a bit too busy, but I do appreciate the concept.\n\nAlong the same lines, [memeorandum](https://www.memeorandum.com/) links to multiple stories on the same trending item, but it's focused on U.S. politics. It too has a less-than-ideal layout (reminds me of early 2000's news aggregators), but is information dense.", "label": 0}
{"text": "I subscribe to\n\n1. [https://ground.news/](https://ground.news/) \n2. [https://www.readtangle.com/?ref=tangle-newsletter](https://www.readtangle.com/?ref=tangle-newsletter)  // free newsletter, I choose to pay for it\n\n  \nGround News is really amazing IMO.\n\nI also subscribe to some traditional newspaper's online editions", "label": 0}
{"text": "2nd 1440", "label": 0}
{"text": "Can you provide a source for your claims about Israel's intentions? It's not clear what your views are based on.", "label": 0}
{"text": "The fact you keep using words like \"begging\" and \"coveting\" tells me you're not just laying facts on the table. As such, I'm holding you to a higher standard of proof than \"my observations say so.\"", "label": 0}
{"text": "India would not have accepted dependancy on US weapons. That was never on the table. The same applies for Russian or Chinese weapons.", "label": 0}
{"text": "This article is an interesting read\n\nhttps://www.cfr.org/article/us-aid-israel-four-charts\n\nIt sets out how US aid is used for military use.\n\nThe implication is that if Israel had to fund its own defence, there would be less of its domestic budget left for other areas of spending", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "I have read others say that certain measures of the TCJA have phased out or been slowly phased out over its duration which explains why it’s deficit impacts haven’t been as bad as maybe initially projected , I’m not sure tho just a thought.", "label": 0}
{"text": "Is it fair to only look at GDP when determining if more stimulus was needed? It looks like unemployment was still pretty high when democrats passed their bill through budget reconciliation ?", "label": 0}
{"text": "All part of the scheduled reconciliation process as most changes have to be temporary within a single decade.  (The corporate tax cuts are permanent.) The TCJA is still revenue positive as we have yet to reach that point.  Or as described in the CBO report above:\n\n>Receipts are projected to subsequently rise to 17.9 percent by 2034, largely because of scheduled changes in tax provisions and because the Federal Reserve is anticipated to begin once again remitting significant amounts to the Treasury.", "label": 0}
{"text": "Yeah I agree that it was likely too much stimulus money at that point in time I guess I’m more just thinking out loud on why it could make sense with high unemployment being a possible argument on still pushing stimulus along with it being extremely popular with the public", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nThe issue is that we don't allow respondents to use video sources, because history has shown them to incomplete, manipulated, or biased. And debates, though sometimes useful, tend to favor whoever is best at debating, not governing. That being said, there was a [debate between the two candidates of the major parties, Trump and Harris,](https://www.youtube.com/watch?v=4dOgWZsDB6Q) about a month ago.\n\nIf you're open to non-video resources, there's a [voter information post](https://www.reddit.com/r/NeutralPolitics/comments/1g4rpq8/info_the_rneutralpolitics_voter_information_post/) pinned to the top of this subreddit right now that's geared towards first-time voters. It includes links to information about the candidates and, down at the bottom, links to sites where you can compare them. \n\nIf you have any questions, just reply here. Thanks for understanding.", "label": 0}
{"text": "> They are built to conduct a war quickly, seize enemy capitals, and establish psychological supremacy in the outset of a conflict\n\n\nExtremely telling that this is a description of a country. Objectively, an imperial bulwark.", "label": 0}
{"text": "Yeah I know it was 6.1 percent however they evidently still had a goal to lower it and as other commenters pointed out a lot of people complained about the slow recovery of Obama’s economy from 2008 which is an explanation on maybe why they went above and beyond with the spending like I said I’m just theorizing on why it could make sense in the moment especially if one doesn’t necessarily believe the corresponding inflation is gonna be as bad as it maybe was. While I agree the stimulus money was excessive I think the reasoning can be pretty subjective and don’t believe it’s entirely black and white.", "label": 0}
{"text": "Revenue never decreases after implementing the TCJA.  The dataset above shows revenue was static after implementation breaking a heavy decline trend that began in 2014.  Then increases to an historical high rate at 19% of GDP by 2021.  Now it is set to settle at half a point higher than the historical average.  It has overwhelmingly been a revenue positive policy.", "label": 0}
{"text": "But it didn’t get lower.  It was already at a historical low rate of 3.5% before COVID and we returned to that level afterwards.  We couldn’t maintain it either as it has now risen to 4.1% despite doubling the deficit.", "label": 0}
{"text": "It sounds to me like a strategic choice by a very small nation surrounded by much larger, hostile nations. Mathematically speaking, they simply can't produce enough arms to match all of Iran, Syria, Yemen, and Lebanon combined (all of whom are additionally receiving arms from Russia). But they know they can count on America to supply enough arms for a protracted conflict.\n\nSince they *can't* sustainably make arms in that quantity (being so small), and don't need to (being supplied by America), they choose to focus their efforts on making an \"oh shit\" button instead. If something goes terribly terribly wrong, they have the ability to deal catastrophic damage (disproportionate to their size) to their enemies very quickly. \n\nI known it's tempting to look at such an infrastructure and say \"Israel bad, Israel want kill everyone and take their land\" or whatever, but imo we simply need to look at the history of Israeli expansion efforts to see that this really isn't true. They occupied Gaza, the West Bank, and the Golan Heights in 1967. Since then... nothing. Absolutely nothing. \n\n(They did establish a security zone in Lebanon in the 80s, but that was a narrow strip of land along the border exclusively to defend against the PLO, not to settle or annex. They left it voluntarily in the year 2000. They've invaded Lebanon like 5 times now and left voluntarily each time except this current ongoing one, which they will doubtless leave again soon enough.)\n\nClaims of Israeli imperialist expansionism have to live alongside claims of Israeli genocide, in that, if that is what they're trying to do, they must be *exceedingly* bad at it. No new land in almost 60 years, and Gaza's population has doubled in the last 20.", "label": 0}
{"text": "Punchbowl reports on the wheeling and dealing of congress not the theater: https://punchbowl.news/\n\nI also enjoy puck for more in depth analysis though it definitely leans left: https://puck.news/", "label": 0}
{"text": "Ground news is amazing and less than $30 per year is a great value. Any articles I find out in the wild I run through a GN search to find more coverage and any highly factual or non biased entries.", "label": 0}
{"text": "Really?...need a source? This is common knowledge and has been for decades.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1gewboa/-/luhg1lc/) so that we can reinstate it.\r\n\r\nThis comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1gewboa/-/lui30s2/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "> This is common knowledge and has been for decades.\n\nYes, all claims of fact need a source here, especially since \"common knowledge\" is often wrong.", "label": 0}
{"text": "> They occupied Gaza, the West Bank, and the Golan Heights in 1967. Since then... nothing. Absolutely nothing.\n\nIsrael also gave Gaza back in a \"land for peace\" deal that is still looked at as a total failure from both a Palestinian and Israeli perspective. Some 8,500 Israelis, at times by force were removed from Gaza by the IDF. \n\n\nhttps://www.reuters.com/article/world/shadow-of-israels-pullout-from-gaza-hangs-heavy-10-years-on-idUSKCN0QF1QQ/", "label": 0}
{"text": "If we are now at 4 percent and it was 6 percent when the bill was passed then unemployment did get lower?", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \n\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\n\n1. Be courteous to other users.\n1. Source your facts.\n1. Be substantive.\n1. Address the arguments, not the person.\n\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\n\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Dropping the corporate tax rate from 35% to 21% is absolutely related to an increase in corporate profits.  Then we know from studies like this one that those profits were invested heavily to bring about a 20% increase in corporate investment.\n\nhttps://conference.nber.org/conf_papers/f191672.pdf\n\nThe key takeaways was corporate investment increased by roughly 20% while having a near “static effect” on revenue from corporate taxes.  That investment lead to more jobs and the larger tax base brought about more revenue.", "label": 0}
{"text": "I've been subscribed to [The New Paper](https://www.thenewpaper.co/share/e?s=1x0y3nsvjpg) for a few years. It's a daily summary of the top news stories with links to reputable sources and no sensationalism. It's short and factual, and a nice way to stay informed without getting overwhelmed. (And yes, that's a referral link for a free month.)", "label": 0}
{"text": "We were in a sharp decline for months before the bill was passed.  Over a point a month where in the Obama years it was a point a year.  The problem is we doubled the deficit with excess spending with no additional gains in unemployment to show for it.  \n\nWe can also compare this to the last time we had a major tax cut that included corporations.  We often hear how this is the lowest unemployment rate in 50 years, and the dataset above shows this was achieved after [the 1964 tax cut.](https://en.m.wikipedia.org/wiki/Revenue_Act_of_1964) There is precedent for this which is why even Obama argued to cut taxes desperate in his second term to turn around the slowest recovery in US history:\n\n>President Obama believes that business tax reform is necessary to create jobs and spur investment, but that it should come as part of a broader effort to support job creation and competitiveness that benefits the middle class.\n\nhttps://obamawhitehouse.archives.gov/the-press-office/2013/07/30/fact-sheet-better-bargain-middle-class-jobs\n\nI get it.  There is a simplistic view that cutting taxes lowers revenue and vic versa, but it is not that simple.  Overtaxation is real and it will reduce revenue that appears to have been the case for the last 60 years.  Obama covers the general concept above as businesses are highly likely to invest the savings from a tax cut, they invest in employees that lowers unemployment, and that increases the tax base which has increased overall revenue from this tax cut.", "label": 0}
{"text": "I honestly don’t see where you think revenue wasn’t affected ? Looking at federal government tax receipts in corporate income I see it dipping pretty significantly from 2016-2017 to around 2019 then we have it sharply rise 2020-2023.\n\nThen I see the corporate profits after tax chart showing that Q3 2016 to Q1 2020 there is not much change besides a dip around the time of covid but then dramatically shooting up right after and now in 2024 Q1 corporate profits are higher than any point in time on the chart.\n\nMy sources are the FRED economic data charts. What this makes me conclude is that revenue whent down initially from the TCJA and profits weren’t really affected but then after Q1 2021 we see a massive increase and I say this can’t be because of the TCJA clearly something else or combination of many other effects is making corporate profit to be so high these last few years considering they didn’t jump up like that for years since the TCJA\n\nI looked through some recent postings from your source the NBER and they posted in July 2024 “lessons from the biggest tax cut in US history” they say multiple things but importantly they say “corporate tax revenue fell 40 percent due to the lower rate” “total tangible corporate investment increased by 11 percent” and they say the advertised effect was much lower with long run GDP only increasing by less than 1 percent and labor income by less than 1000 percent employee. Along with numerous other things. \n\nSo my confusion here is that you seem to be saying things that contradict the charts I’m looking up for these numbers and what the NBER itself is saying?", "label": 0}
{"text": "So on the specific topic I see a sharp decline in unemployment from April 2020 to about October 2020 then we slow down and soon after pass the bill early 2021 and it takes a full year to drop from 6 percent to 4 percent so it could be argued if the act hadn’t happened I might have taken longer to go from 6 to 4 percent. When I correspond this with the inflation chart inflation is on a sharp increase ever since the 2020 cares act and continues dramatically until it starts dropping generally in 2022 telling me that both presidents and their congresses passing massive spending bills with Trump passing the CARES act then that massive spending bill that included Covid relief then all of Biden’s massive bills so far in his administration. So we do literally see lowered unemployment directly after the passing of the act it’s just 2 percent but remember the closer to 0 we get the harder it is to lower but also the importance of going from 6 to 4 can be pretty subjective so it could be argued was it worth it or not.\n\nI’d like to touch on the 1964 tax cuts cause I believe it actually agrees with my assessment that the TCJA was poor economics so Kennedy actually got the idea of temporary deficit spending to boost growth Keynesian economics which says temporary deficit spending can boost economic growth and lower unemployment which it did however the caveat is you only want to do that when it’s needed , if the economy is great and you cut taxes then you make it harder to cut taxes if suddenly the economy stumbles a bit which tells me that when Trump passed the TCJA during an objectively great economy he inherited from Obama then it was poor economics if we follow those same principles from 1964s decision and yes Obama was following those principles by wanting to cut taxes during his recession too. Donald Trump cutting taxes during a good may cause some small growth in certain spots but it is arguably unnecessary and makes it harder to now really spend in a defecit when something bad happens with the economy", "label": 0}
{"text": "I don’t have wrong time frame I know when it kicked into effect lol I’m just stating the frame I was looking at which was 2016 / 2017 until 2019 and I do not see anything b it a decrease in corporate revenue \n\nhttps://www.nber.org/papers/w32672", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "The FRED dataset above was to all revenue and not just corporate taxes.  The previous trend is quite important for there to be two years of sharply declining overall revenue and then to bunk that trend to a static trend after TCJA was implemented.  The CBO has that data if you are interested from the same report above:\n\nhttps://www.cbo.gov/publication/58147#_idTextAnchor168\n\n(Again, hit the link again if it doesn’t go straight to the dataset. There site is a bit wonky.)\n\nThanks for the source as I was unaware they had second version of the study.  I’ll have to review this in detail as this looks like a perfect example of how politics infect research.  I got to see how exactly they went from a static effect on corporate tax revenue to now a 40% drop as that is huge.  The first report was quite critical to say it was static overall as the CBO dataset shows corporate tax revenue followed the trend in overall revenue after implementing the TCJA.  I suspect they are comparing it to the economic bubble in the mid-2000s which of course would be a bad baseline for comparison.  Still, this research is just on the corporate tax cut alone and the overall effect is unchanged.  Be it 11% or 20% increase in corporate investment or static to 40% decline in corporate revenue the overall results remain the same.  We still got an historical low unemployment rate while increasing overall revenue.  That is a huge win-win for a tax policy to bring those job numbers while also increasing revenue.", "label": 0}
{"text": "This comment has been removed for violating [comment rule 3] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\nBe substantive.  NeutralPolitics is a serious discussion-based subreddit.  We do not allow bare expressions of opinion, comments without context, sarcasm, jokes, memes, off topic replies, or perjorative name calling.\n\nIf you edit your comment to comply, it can be reinstated. If you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Yikes.  Please review Rule 4 as there is a word here that  ‘U’ (hint hint) shouldn’t be using as it is about addressing the person instead of the argument.  That happens like every other sentence.\n\nTo briefly cover the main point as there are some major faults to the premise of the argument.\n\n>You also seem to be missing that a large amount of the spending came from trumps administration that is when we see inflation start rising \n\nWe don’t see spending increase from the Trump Administration (time period) as the CBO dataset shows 2017, 2018, and 2019 spending was below the historical average of 21% of GDP.  \n\nhttps://www.cbo.gov/publication/59946#_idTextAnchor041\n\nObviously in 2020 that changed greatly with a global pandemic which essentially brought about a very short World War level spending.  Yet this was bipartisan spending and the situation would have been much worse without it after shutting down the economy.  Still short term and spending likely would have returned to preCOVID levels of spending if the Trump Administration got a second term.  We didn’t and the Biden Admin doubled the deficit.  If it wasn’t for a single moderate Senator in their a party Democrats would have more than tripled the deficit too with their second reconciliation spending package coming in originally at $6 trillion after passing the $2 trillion ARP.\n\nhttps://www.washingtonpost.com/us-policy/2021/06/17/senate-democrats-biden-reconciliation/\n\nThat FRED dataset is the first one for Corporate revenue taxes I’ve seen here.  Be careful as that is in raw dollars that can be deceptive.  It doesn’t account for the value of the dollar.  In the short term it isn’t so bad, but with surging inflation that does gets quite bad.  Notice the CBO dataset on revenue types split out is based on GDP which is much more stable data.  Either way both show that corporate tax revenue is overall positive since passing the TCJA.\n\nI would like to see a source for the Keynesian economics because I’ve never seen tax cuts as part of it.  Seems to be conflated that with supply side economics which the results of the TCJA has given a lot of credence to that economic theory.", "label": 0}
{"text": "I really like jyst They offer a news brief that gives a solid rundown of the day’s news and then dives deeper into one particular story. There are no opinion pieces or any smugness—just well-produced, summarized news that’s easy to digest", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\n\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\n\n\n\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "That's a fantastic question. Let me know when you have an answer. I'll be 50 at the end of the year and I've been watching this conflict on TV news for about 42 years. This conflict has been going on for a decade or two longer roughly. People and the stubbornness of people suck. Forget about the religion and cultural beliefs, reasonableness could have prevailed, but neither side is reasonable. Let's see what happens in the next decade. Fingers toes crossed and pray for peace.🙏", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "I don’t see how any of these charts agree with you tbh I see a slight decrease of revenue from 2018 to 2020 just like I mentioned and I see the massive spending from the budget bill passed in 2019 that I also mentioned which also coincides with the deficit increasing to one trillion before Covid hit then we have the spending from the cares act and the next budget bill. I don’t understand why it can be extrapolated that we would’ve seen big decreases in the deficit if Trump was showing a pattern of passing big bills without also cutting government programs or increasing revenues significantly enough to cut the deficit ?\n\nI didn’t mean to say inflation increased during the pandemic what I more meant was there was already massive stimulus sent in and massive spending measures made at the end of 2020 with delayed effect because the economy is effectively shit down and as we saw once things opened up and Biden passed his own stimulus act all this along with the massive consumer demand and supply issues caused the inflation but acting as if Biden was the only contributor to that deficit is disingenuous when Trump built it up to one trillion and left right before feeling any of the effects.\n\nLast paragraph I won’t respond to it’s an argument against something I didn’t say I was specifically discussing how tax cuts can be considered deficit spending since it increases the deficit from a Keynesian of economic theory not discussing anything about outlays versus revenue.", "label": 0}
{"text": "Your bot and rules attached are infringing on right to free speech  a citizen of the United States. There was nothing disrespectful in my post to either side of the conflict.", "label": 0}
{"text": "Then that is a matter of opinion if a “slight decrease” is actually significant enough on the dataset to be a solid trend and not a static trend.  Data this complex does just level out completely for multiple years.  This is as static as it gets.  The main point here is we dropped the corporate tax rate from 35% to 21% and there is only a “slight decrease” in revenue to show for it.  Spending we have more control over and it was also static.  Very responsible budgeting from the Trump administration and mostly Republican Congress outside of the last year in a global pandemic. \n\n>along with the massive consumer demand and supply issues caused the inflation but acting as if Biden was the only contributor to that deficit is disingenuous\n\nThe MIT/Sloan research shows it wasn’t that massive.  I’ll provide that source again:\n\nhttps://mitsloan.mit.edu/ideas-made-to-matter/federal-spending-was-responsible-2022-spike-inflation-research-shows\n\n10.1% of the inflation spike was from producers and 41.6% was from government spending.  Notice the CPI for COVID actually dropped because the economy had just stopped.  The government dropping trillions into the economy then isn’t that inflationary.  Then we dropped trillions into a hot economy after the recovery and it was clearly highly inflationary.  Hard to ignore such historical trends of these dataset.\n\nI’m happy to drop the Keynesian economics as they have mostly been arguing baseless claims.  Only think about it that has been proven with a source was that it has been highly inflationary economic policies.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule A.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "No my main argument is kinda three parts\n\n1. Not smart to cut taxes during a period of great economy just so you can get some temporary growth but be less prepared when the next downturn hits \n\n2. Attributing the 19 percent number to the TCJA is ridiculous considering that 2 years of the TCJA results in no increases of tax revenue as a percentage of GDP but then magically Covid and soaring business profits after Covid suddenly make it jump so obviously TCJA was a non factor in getting that number to 19 percent there’s no possible genuine way to say TCJA caused it when TWO YEARS kept it steady.\n\n3. Trump ran some of the highest deficits in history and literally had the record for highest deficit of all time to say Biden spent too much money is agreeable but to say his spending was solely bad and solely the cause of inflation is ridiculous considering he spent less money on covid relief compared to Trump and the economy was shut down right after Trump passed massive amounts of money meaning the effects wouldn’t be felt until it opened back up.", "label": 0}
{"text": "This is a completely ridiculous take tbh so we wanna say that due to delays in pay offs from investments that’s why 2 straight years the number goes down then soon as economy crashes and begins to reopen and we have all kinds of issues such as high demand high inflation massive amounts of stimulus in the economy resulting in historically high corporate profits causing this increase in revenue. This all must be due to the TCJA 4 years ago as of 2022??? That makes no sense this also forgets all the wage increases people have and inflation pushing them into higher brackets increasing their taxes there’s a myriad of reasons for this but somehow magically the TCJA caused this lol.\n\nI would agree with the argument if this was maybe 8 years after the act and we could see this consistent effect happening but to see a dramatic increase 2 years after the fact makes no sense and no reasonable economist would attribute that to the TCJA when MANY other factors spiked at the same time I guess since inflation spiked 2 years after that must be because of the TCJA too lol", "label": 0}
{"text": "Apparently we spent most of the time here discussing not the main counter argument.  Those were mentioned one or maybe twice and moves away from the data provided.\n\n1. It was not a great economy as it was shrinking as evident to a sharp decline in revenue for three years prior to the TCJA.  The FRED dataset show recessions marked in gray and significant periods of sharply declining revenue almost always precedes recessions.  That would make it the best time to spur corporate investment to stave off a recession.  Regardless, the timing couldn’t have been better for having the lowest unemployment rate before a government mandated economic shutdown.\n\n2.  It is ridiculous to attribute the 19% of GDP revenue to nothing given the history significance.  How is an overhaul in tax policies so detached from the resulting changes in revenue?  It was a two year peak in revenue that was mostly likely economic gains from COVID that were delayed from the 2020 shutdowns.\n\n3. The CBO dataset clearly shows Trump had the least deficits of the 21st century outside of a year with a global pandemic and governor mandated lockdowns.  Biden had the worst in US history as the longterm deficit has been doubled for the next decade at least according to the 2024 CBO Budget Outlook Report provided above mainly from partisan spending.  This is despite a revenue being above the historical average under current law from the TCJA.  The COVID spending was also short term bipartisan while the Biden spending was heavily partisan mainly passed through reconciliation for the next decade.  We have three years of Trump budgeting to analyze outside of a crisis to determine it was quite reasonable to keep spending static in response to trend in revenue.  We have 3.75 years of Biden budgeting to analyze to determine is was quite reckless to double the deficit which saddle us with record high inflation.", "label": 0}
{"text": "Mo News Podcast", "label": 0}
{"text": "Still in raw dollars.  That surge looks like a lot and messes with the scaling, but it does not account for inflation.  It also doesn’t account for a shrinking GDP that coincides with the shrinking revenue of that time.\n\n1. Nothing historic that I saw relative to the third highest revenue in US history.  Granted I could have missed giving we have spent so much time discussing that minute difference in revenue.  Please list those factors again with sources as I am eager to review them and follow the data.\n\n2.  Granted Obama had a crisis of his own to deal with, but is wasn’t global and quite deadly.  This was essentially a short World War as the dataset above shows WW2 as the only thing even remotely comparable in terms of outlays and receipts. (I cannot dig the source again for a 4th time.)  It it reasonable to factor in such an extreme outlier when 75% of the Trump Administration kept spending under the historical average when revenue was static?", "label": 0}
{"text": "Relative to what?  A 2005 economic bubble?  Corporate taxes are overall revenue positive from 2018-2024.  The CBO project that trend will continue through 2034.  \n\nAlso important to note corporate tax revenue is around 1% of GDP when total revenue is 16-19% of GDP.  \n\nInteresting how this admitted minor point somehow warrants its own comment tread now.", "label": 0}
{"text": "I wanted to put it at the top so other people could see sorry.\n\nhttps://fred.stlouisfed.org/series/FCTAX\n\nTax revenue clearly decreased from corporations as was admitted in our other thread.\n\nhttps://www.pgpf.org/blog/2024/05/how-did-the-tcja-affect-corporate-tax-revenues#:~:text=According%20to%20researchers%20from%20the,the%20law%20not%20been%20enacted.\n\nPeter’s G foundation with some summaries on the initial and potentially later effects of the TCJA", "label": 0}
{"text": "Every fact I’ve said is sourced bro saw two emojis and just ignored all my facts directly sourced 🤦‍♀️", "label": 0}
{"text": "In the future avoid absolutes like “every” as it is easily disproven by a single exception.  The many assertions made about Keynesian economics was not supported by a single sourced fact that the decision died due to all the baseless claims.", "label": 0}
{"text": "This is a particularly disingenuous tactic considering Republicans are the primary blocker for legislation enabling poll workers to start processing ballots before election day.", "label": 0}
{"text": "Bro I did not make a single assertion about Keynesian economics ??? I told you what they are literally google Keynesian economics and it’s what I told you what baseless claims did I make ???", "label": 0}
{"text": "It was necessary to bring this to the top after the assurances it wasn’t a major point?\n\n>I’m not using it as a counterpoint I’m merely pointing out nothing changed besides a slight decrease\n\nSo slight is isn’t worth mentioning again, but this reply is devoid of context below that proved how minor the distinction truly was.  \n\nI have pointed out many times that raw dollar datasets are misleading and especially in a time of high inflation.  The CBO provides data as a factor of a GDP for good reason and continual reliance on the least amount of context available makes for a poor, if not disingenuous, argument.  Focusing on corporate tax revenue instead of overall revenue covers only one point of GDP in a total of 16-19 point scale:\n\nhttps://www.cbo.gov/publication/58147#_idTextAnchor168\n\nDespite the continued focus on the minutiae of the matter the overall fact remains that the 2017 TCJA has been overwhelmingly revenue positive and the CBO estimates that revenue will be 17.9% of GDP under current law while the historical average for the last half century is 17.3% of GDP.\n\nhttps://www.cbo.gov/publication/59946#_idTextAnchor041\n\nThe PGPF bring more credence that fact corporate tax revenue was overall static that it describes the two periods of slight decline after  solid increase clearly above preTCJA levels in the dataset despite the narrative stating otherwise. Again putting a heavy focus on 1% versus 1.4% when overall revenue reached 19% of GDP in 2022.", "label": 0}
{"text": "Raw dollar datasets yet again.  The continual reliance on the least context available is duly noted.  \n\n>Inflation and corporate profits are at all time highs corresponding with the 19 percent number\n\nBefore we continue any further please acknowledge that corporate tax revenue is 1.4% of that 19% of GDP.  The please explain how that minute fluctuation is the main point and not the other 18.6% of GDP as revenue.\n\nhttps://www.cbo.gov/publication/58147#_idTextAnchor168", "label": 0}
{"text": "Merely mentioning that multiple stats coincide with the same spike demonstrating it can’t be TCJA related since we see many things like inflation , corporate profits etc etc all spiking at the same time.", "label": 0}
{"text": "How did that side discussion even begin if no assertions were made about it?  I made the assertion it was highly inflationary and provided the CPI dataset that supports its. The assertion that tax cuts somehow are part of it have yet to be supported by a sourced fact.", "label": 0}
{"text": "I simply said that you mentioned the 1964 tax cuts and how beneficial they were and I agreed and I mentioned Kennedy got the idea from a Keynesian economist idk where the hang up here is I never debated Keynesian economic theory anywhere ?", "label": 0}
{"text": "The inability to explain the relevance of focusing on 1.4% of the 19% overall revenue is duly noted.  Corporate tax revenue could drop to 0% and overall revenue would still be over the historical average.", "label": 0}
{"text": "Anything can be said which is why that is a baseless assertion.  This is a place of sourced facts.  Please see Rule 2.", "label": 0}
{"text": "I didn’t make any assertions is the argument here  trying to tell me I’m incorrect in saying Kennedy had a conversation with a Keynesian economist to come up with the tax cuts ??? \n\nhttps://www.cambridge.org/core/journals/journal-of-policy-history/article/abs/kennedyjohnson-tax-cut-of-1964-the-defeat-of-keynes-and-comprehensive-tax-reform-in-the-united-states/F8466CF7184465EB9CD542B7C8C763A6", "label": 0}
{"text": "Any assertions supported by sources facts. I appreciate the attempt now, but this source appears to support how the tax cut wasn’t Keynes.  \n\n>Through the policymaking and legislative process, the Kennedy administration’s Council Economic Advisers defeated the Treasury and Surrey by domesticating Keynes’s ideas on tax policy.", "label": 0}
{"text": "How exactly does government mandated lockdowns result in historical high revenue?  I definitely need to see a source on that one.", "label": 0}
{"text": "Simple understanding of the concept would help lol it’s called “domesticated Keynesianism” this refers to how Keynes policies were used during the 50s and 60s hence why Kennedy was talking to a Keynesian economist when deciding how to pursue economic growth. The quote literally says they domesticated Keynes ideas meaning they made it more palpable for the many members of government", "label": 0}
{"text": "In other words it was watered down and thus less Keynesianism.  Clear more supply side economics than Keynes. \n\n>it advocates tax cuts as a way to encourage job creation, business expansion, and entrepreneurial activity.\n\nhttps://www.investopedia.com/articles/05/011805.asp", "label": 0}
{"text": "How exactly does one of the worst pandemics in history affect the economy? Why would I need to source that when almost every single link we have shared supports that? The argument is that unlike the TCJA there are multiple factors making the spike so high in 2022\n\nhttps://www.crfb.org/blogs/2023-revenue-plunge-confirms-2022-surge-was-fluke#:~:text=As%20we’ve%20noted%20previously,inflation%20in%202021%20and%202022.\n\nNo where here is it discussed that the TCJA caused massive revenues", "label": 0}
{"text": "Old article.  The 2024 CBO Budget Outlook Report shows the 2023 revenue plunge was a fluke.  It has jumped back up in 2024 and revenue is set to be above the historical average for the next decade.", "label": 0}
{"text": "Actually I’ve anything I sent related to the topic was read or comprehended it’s more demand side economics not supply side nice try tho \n\nhttps://www.taxnotes.com/tax-history-project/jfk-supply-sider-keynesian-or-tax-reformer-pick-only-two/2022/04/01/7dbgf#\n\nIt’s specifically discussed how people could think he was a supply side believer but in reality was more like a best of both worlds and implemented those believes to make things more palpable for other members of government the argument is subjective at its core", "label": 0}
{"text": "I’ve never heard of taxnotes before.  Seem more like an op ed trying to explain away a clear contradiction.  The fact remains tax cuts are a supply side economics principle and not the other way around.", "label": 0}
{"text": "Tax cuts does not automatically mean supply side economist lmao 💀 demand side effects colonics literally works by lowering taxes on the middle class both sides can use tax cuts it’s more about the surrounding philosophy", "label": 0}
{"text": "Quite relevant as they didn’t have the most recent data to see the 2023 revenue plunge was a one off.  The CBO explains this discrepancy in 2023 as businesses were targeted by a scam claiming to help them qualify for a tax deduction that didn’t exist, and this was corrected in the following year on top of some agricultural losses that year.", "label": 0}
{"text": "This wasn’t a targeted tax cut.  Both 1964 and 2017 tax cuts were across the board.  Corporations are far from the middle class.", "label": 0}
{"text": "Definitely not relevant because like I said many factors are mentioned and the fact it coincided with things like inflation and corporate profits demonstrates this was not because of the TCJA it’s plain obvious to anyone reading the words.", "label": 0}
{"text": "No one said anything about targeted tax cuts? Me saying one of the ways demand side economics can work is not the end all be all like I said the philosophy behind the cuts or other measures", "label": 0}
{"text": "> demand side effects colonics literally works by lowering taxes on the middle class \n\nThat is a targeted tax cut.  Assuming colonics is a typo.", "label": 0}
{"text": "Not saying more relevant to 2024 I’m saying the article specifically says why that spike happened in 2022", "label": 0}
{"text": "Yes I said one way it can work please keep the strawman arguments coming it’s funny lol when an easy google search of any of these terms would educate and end this discussion", "label": 0}
{"text": "Hi there /u/Acceptable_Duck_8589. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "Hi there /u/DegenFrend. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nThis might be a better fit for /r/AskHistorians. It may need a little adjusting to comply with their submission rules, but the topic is closer to what they do.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, D and G. We don't allow requests for opinion or speculation.\n\nThanks for understanding.", "label": 0}
{"text": "Are you referring to yourself?  Support is not not unwavering and never has been.\n\nIsrael's enemies are and have been on record for a long time.  They are committed to the nonnegotiable destruction of Israel.", "label": 0}
{"text": "Hi there /u/Apprehensive-Sea1888. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but would you be willing to edit the post a little so it conforms to our [submission rules?](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nPer Rule D, please add at least one [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) to support the premise. What something seems like to OP cannot form the basis for a submission here. Pasting your title into a search engine should lead you to a good source or two.\n\nIf you have any questions, just reply here, and thanks for participating.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1gflxpk/-/lumoymb/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Hi there /u/Acceptable_Duck_8589. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some reworking to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "I am interested!  How would I improve this to fit your submission rules?  I read through your rules and was comparing to other posts, attempting to fit in, but I must have missed something.", "label": 0}
{"text": "No worries. Our rules are extensive and pretty much every submission needs some adjustment to comply. Let's go through it...\n\n\n> Is Workforce and Pay/Tax Policies the Most Important Topic of This Election?\n\nUnder Rules A & G, we ask submitters to pose questions that can be answered with evidence, not opinion. There's no real way to cite evidence about what the \"most important\" topic of an election is. Everyone is going to have a different opinion on that, and with dozens of topics in play, the majority answer to that title question is likely to be simply 'no'. A better core question would be something like:\n\n> How do the Trump and Harris plans for workforce pay and taxes compare?\n\nFeel free to use that or compose your own, so long as it solicits evidence instead of opinion or speculation. (Note that the Reddit platform doesn't allow editing of titles, so you'll have to resubmit to make that particular change, but let's go through the rest of it first.)\n\nAlong the same lines, this closing question is a little too close to soliciting personal opinion or judgment:\n\n> ...who has the upper hand in terms of proposed policy and previous execution?\n\nYou could change it to something like:\n\n> What are the pros and cons of each candidate's proposed policy and previous execution?\n\nThe rest of the changes are all about Rule D. Anything phrased as a statement of fact needs a link to a qualified source in r/NeutralPolitics. These are the factual statements currently lacking sources:\n\n* Both parties have been promising policies that will increase take home pay and better reward workers. \n* Both parties have promised no tax on overtime pay\n* Trump's 2017 Tax Cut and Jobs act increased wages and decreased unemployment and decreased taxes on lower/middle class significantly. \n* Walz in MN has done a fantastic job with workforce, arguably the best the US. \n* MN even spawned the getfulfil company that helps people into blue collar jobs and growing fields that don't require college.\n\nTo make things easier, you can look for single articles that cover a few different claims and/or eliminate any claims that aren't particularly relevant.\n\nIf you have any questions, just reply here, and thanks for engaging in the process.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule A.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "We don't allow people to ask for opinions:\n\n> G) No requests for speculation. If the question cannot be answered with facts — which includes any that are phrased in the future tense (What will/would/could happen?) — then it's not appropriate for NeutralPolitics.\n\nHere are the full guidelines:\n\nhttps://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules", "label": 0}
{"text": "If I may ask then, how would you submit this to this sub? Conceptually, it feels deeply relevant, given that it is a full attempt to design a system of democracy where decisions are made in a neutral, party-free way. Partisan politics are an absolute nightmare, and it's fair to say there needs to be some way to break their stranglehold over our country.\n\nWe want to essentially ask the question \"how would you redesign democracy?\", and we have a specific proposal we think works well. From what I can tell reading the rules, that discussion would be a fair submission. All that makes us different is that we've actually built our answer, making it concrete enough to be interacted with. Given that a lot of discussions about how to implement reforms die before reaching this stage, and given the premise's relevance to the sub, it feels like there should be some way to at least let people see it.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nHowever, you might want to check out the [voter information post](https://www.reddit.com/r/NeutralPolitics/) that's pinned to the top of this subreddit. It has links to some useful information and comparison sites to help people make up their minds.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B, D and E.\n\nYou might consider posting this in r/PoliticalDiscussion.\n\nThanks for understanding.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Thanks!  I made a post with these changes.  Hope I got everything.", "label": 0}
{"text": "I think they just want to improve American democracy. [The United States has some of the lowest voter turnout among western democracies](https://www.pewresearch.org/short-reads/2022/11/01/turnout-in-u-s-has-soared-in-recent-elections-but-by-some-measures-still-trails-that-of-many-other-countries/), especially during non presidential elections. Furthermore, [younger generations tend to have much more voter apathy which means that many elections are decided by older adults, particularly the elderly who vote at much higher rates than any other age group.](https://www.statista.com/statistics/1096299/voter-turnout-presidential-elections-by-age-historical/)\n\nPerhaps some groups aren’t neutral and know that [younger generations tend to vote left (as opposed to the elderly who vote conservative)](https://www.pewresearch.org/politics/2023/07/12/voting-patterns-in-the-2022-elections/)so they could be trying to tap into that demographic to give the Democratic Party an advantage.", "label": 0}
{"text": "There are some clues in the example you linked to.\n\nRock the Vote was specifically created to get out the youth vote, because the founders of the organization knew that young voters tend to align with them on the issue they were originally advocating: halting censorship in music lyrics. So, they're ostensibly neutral, but in targeting certain voters, they're actually advocating for specific issues.\n\nThe reason for the facade is to maintain their tax-exempt status under [Section 501\\(c\\)\\(3\\) of the IRS tax code,](https://www.forbes.com/advisor/business/types-nonprofits/#501c3_charitable_religious_or_educational_organizations_section) which requires them to operate for educational, not political, purposes. Overtly political organizations fall under the less advantageous [Section 527](https://www.irs.gov/charities-non-profits/political-organizations/taxable-income-political-organizations) of the tax code.", "label": 0}
{"text": "Sorry, thanks for noticing. Fixed!", "label": 0}
{"text": "I don't think I understand the premise of your question. \n\n2000 is unique because the Supreme Court [extra-legally overrode Florida state voting procedure ](https://scholarship.law.duke.edu/cgi/viewcontent.cgi?article=1707&context=faculty_scholarship)and stopped the count. Because the count was extremely close and disrupted, there was a huge amount of public interest in finding the \"true\" outcome. \n\nNo counts were halted in 2020, nor were any results as close as 2000 Florida. [Many states had some variety of recounts which included analysis of whether ballots were properly marked. ](https://web.mit.edu/healthyelections/www/sites/default/files/2021-06/Recounts_Contests_Battleground_States.pdf) All states had margins of thousands of votes, and all recounts were within a few hundred of the original count. Based on those recounts in the closest states, there is no reason to believe that the outcome is not accurate.", "label": 0}
{"text": "Churches are 501(c)(3).  They're politically active and partisan, should be section 527.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule A.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Churches that are 501(c)(3) [are forbidden from being political or partisan](https://www.irs.gov/newsroom/charities-churches-and-politics).  The issue is enforcement... sorta.  They (like any other 501(c)(3) charity) are allowed to advocate for positions, no matter how polarizing, so long as they are not directly partisan and do not unambiguously tell parishoners to vote for or against a candidate..  \n\nMy local priest, for example, might say things in mass like \"you can vote either party, but it is a sin to vote for someone who is pro-choice\".  Technically speaking (from above ref), ANY 501(c)(3) can get away with that type of verbiage, not just a Church... at least under certain circumstances.  I mean, I think it's approaching a dark grey area, but you can understand why occasional \"grey area\" moments won't trigger large and wealthy organizations to get into a fight with the IRS?  I mean, just look at the long and brutal battle [between the IRS and the Church of Scientology](https://www.cs.cmu.edu/~dst/Cowen/essays/irs.html).  My opinion at least is that most major churches push far fewer limits than the Church of Scientology, but others might disagree.\n\nThis appears to be [the legal guide used by the Catholic Church on this matter](https://www.usccb.org/about/general-counsel/upload/24-0627_poli_activity_lobby_guide-c1.pdf).  Please note (and this is often misunderstood) that in none of these cases does their status as a Church give them any legal political advantage over other 501(c)(3) organizations.  You can accuse them of unequal enforcement and might be able to demonstrate it, but the *rules* themselves do not favor them.", "label": 0}
{"text": "I agree.  That's an enforcement problem.  This is *100%* opinion, but I think it's more about fear of net financial losses than it is about tolerance of extremist religions.  I cited the IRS/Scientology article above and I followed it fairly deeply as someone fairly disgusted by that particular church.  The IRS presumably spent a lot of money trying to fight with the Church of Scientology on reasons that seem to me to be more cut-and-dry than political grey areas.\n\n[It was a 28-year legal battle.](https://www.cs.cmu.edu/%7Edst/Cowen/essays/battle.html) and the IRS is a [tax collection body](https://www.irs.gov/) whose goal involves bringing IN money.", "label": 0}
{"text": "The Florida Supreme Court extra-legally allowed for a partial recount based on a 7-2 SCOTUS decision.  On ideological lines the safe-harbor deadline was upheld.  Either way a court was going to decide that election. \n\n>In the first part of the decision, seven justices (including liberals Stephen Breyer and David Souter) agreed with Bush that his Equal Protection rights were violated because there was no existing legal standard to recount the punch-card ballots.\n>\n>Another part of the decision, a 5-4 vote along ideological lines, said that any solution to the recount problem couldn’t be put in place by December 12, the safe-harbor deadline. The Florida Supreme Court of Florida, the majority said, indicated that the Florida state legislature wanted Florida’s electors to “participat[e] fully in the federal electoral process” by honoring the December 12 safe-harbor deadline.\n\nhttps://constitutioncenter.org/blog/on-this-day-bush-v-gore-anniversary", "label": 0}
{"text": "Still, I believe the country would be far better off if more young people voted.\n\nIf this were the biggest voting bloc, then both parties would have to try to court their votes, and some of them would join each party (and many would remain unaffiliated).\n\nSo I wholly support Rock the Vote, even if they add new Republicans to the rolls.  I would hope those new Republicans would agitate for change inside their party.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Hello again /u/Two_wheels_2112 \n\nI just wanted to remind you that this submission is 95% of the way to being approvable. If you resubmit it with the two changes noted above, it would go live pretty quickly.", "label": 0}
{"text": "Are you suggesting that there are no religious organizations anywhere in the US that play by the rules?\n\nAlso of note (from [the legal guide reference](https://www.usccb.org/about/general-counsel/upload/24-0627_poli_activity_lobby_guide-c1.pdf) above and others) ALL 501(c)(3) organizations can have outspoken views on the issues, even extreme views on the issues.  That means they can be anti-abortion organizations, anti-immigrant organizations, anti-gay organizations, racist organizations.  They can lobby for Fascism.  They can do anything BUT favor specific candidates.  But how close they can come while following all the rules is pretty shocking.  I was part of a pro-gay, pro-legalization, pro-choice, pro-trans church that didn't come anywhere near crossing any lines despite being so outspoken about gay rights you can't forget (rainbow flag flown at virtually every UU church).", "label": 0}
{"text": "IMO, full due process hearings should be conducted to investigate all charges of election tampering.  All the witnesses and evidence should be tested. Perjury should be severely punished.\n\nOf course both major parties would have to really want free and fair elections.\n\n“Corruption also plagued paper ballots. For the better part of the 19th century they were more likely to be destroyed or manipulated than counted. In 1850's New York, party chieftain Boss Tweed used \"floaters\" to vote at several polling places across the city, \"repeaters\" to visit the same polling place more than once, and \"plug-uglies\" (thugs from Baltimore) to intimidate voters all over the city. The fake voters exploited the names of children, the deceased, even fictional characters. **In 1869, 21-year-old Thomas Edison patented the design of a \"switch-and-lever\" voting machine, but he couldn't find any buyers. The status quo suited politicians just fine.”**\n\nTIME MAGAZINE, **A BRIEF HISTORY OF**, Ballots in America, By M.J. Stephey Monday, Nov. 03, 2008.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C, D and E.\n\nThanks for understanding.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1ggtk67/-/luttnyv/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C, D and E.\n\nThanks for understanding.", "label": 0}
{"text": "Restored. Thanks.", "label": 0}
{"text": "What is the stated justification for not cou ting ballots until election day?  I've never understood what the upside could be, it's always just seemed like an excuse to possibly invalidate those votes.", "label": 0}
{"text": "One difference is Trump's tax plan would bankrupt Social Security earlier than the current path we're on:\n\n[https://www.cnbc.com/2024/10/21/trump-social-security-plan-insolvency-faster-study.html](https://www.cnbc.com/2024/10/21/trump-social-security-plan-insolvency-faster-study.html)", "label": 0}
{"text": "I could certainly see that as a reason not to report the unfinished count.  As of now, the extra time that it takes to count absentee ballots in high pop counties is being used to fuel conspiracy theories about election fraud and that seems much more dangerous.", "label": 0}
{"text": "Wouldn’t any change to taxes that took in less money to the fed accelerate the projected date on social security?  Both have proposed protecting social security and Medicare. So unless something else was shown on how to increase funding to the programs or making both programs more efficient, then both proposals will lead to reduced funding.", "label": 0}
{"text": "We would love to have you help us out! This really is the sort of project that only succeeds when there's a group of people working on it, and the fact that it speaks to you is really encouraging. :)\n\nWe've created the subreddit r\\AgreedUponSolutions, and made (so far two) fairly basic posts, if you'd like to take a look. I imagine you have a much better idea of how to start\\run a community than we do, so we're also definitely open to the idea of having you on as a moderator! We just need to actually have a proper conversation with you about it to make sure we're on the same page; as you may have guessed we're very opinionated. XD\n\nDM me if you're still interested!", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't quite conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nI would usually offer suggestions on how to adjust it, but in this case, let me first see if I can answer the question, and if that doesn't work, we'll go from there...\n\nVance is following an argument that's common on the right that affirmative action and the practice of considering the diversity of the student body in college admissions, especially at the elite level, have resulted in a [disadvantage for white students,](https://www.bbc.com/news/world-us-canada-40804848) because some of the limited slots available may go to minority applicants who have not performed as well academically, just so the university can reach its diversity goals. Vance is suggesting in [this speech](https://www.usatoday.com/story/news/politics/elections/2024/11/01/jd-vance-trans-kids-joe-rogan/75985933007/) that those white students, in their quest to restore a level playing field, are declaring themselves trans, thereby making themselves part of a minority community that would benefit from the same diversity preferences as racial minorities do. \n\nIt's the kind of argument that has an internal logic, but isn't based in evidence, which is kind of a [trademark of Vance's rhetorical style.](https://www.rollingstone.com/politics/politics-news/jd-vance-haitians-if-i-have-to-create-stories-1235102572/)\n\nIf that explains it, then good, but if you want more elaboration about the facts behind his view and that of the opposition, reply here and I'll help you rework this into a compliant submission.\n\nThanks.", "label": 0}
{"text": "Hi sorry for the late reaction. If you could give some suggestions that would be awesome, thank you!", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Hi,\n\nThank you for your prompt reply! And yes, I absolutely would not mind rephrasing my question in order to comply with the submission rules. I trust that you understand the essence of what I'm trying to say, so if there's a better to phrase my words properly, then I wouldn't mind at all. Thank you!\n\nAlex T.", "label": 0}
{"text": "Lots of states within the US have these programs as well.  I know NY does!", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nYou might try posting in /r/moderatepolitics.\n\nThanks for understanding.", "label": 0}
{"text": "I see this remains the top up-voted response which, to paraphrase, says \"the only reason 2000 was interesting was because the Supreme Court stopped the recount\", but this seems an incredibly unsatisfying sentiment. The 2020 election was extremely interesting itself, due to a variety of factors, including the unprecedented adoption of mail in voting.\n\nWe know mail in voting is subject to problems counting votes, also from New York Times:\n\n[Error and Fraud at Issue as Absentee Voting Rises](https://www.nytimes.com/2012/10/07/us/politics/as-more-vote-by-mail-faulty-ballots-could-impact-elections.html)\n\n>Yet votes cast by mail are less likely to be counted, more likely to be compromised and more likely to be contested than those cast in a voting booth, statistics show. Election officials reject almost 2 percent of ballots cast by mail, double the rate for in-person voting.\n\n>  \nIn the last presidential election, 35.5 million voters requested absentee ballots, but only 27.9 million absentee votes were counted, according to [a study](http://www.law.nyu.edu/journals/legislation/issues/volume13number3/ECM_PRO_068045) by Charles Stewart III, a political scientist at the Massachusetts Institute of Technology. He calculated that 3.9 million ballots requested by voters never reached them; that another 2.9 million ballots received by voters did not make it back to election officials; and that election officials rejected 800,000 ballots. That suggests an overall failure rate of as much as 21 percent.\n\nMany states were contested with less than 2% difference between the candidates.\n\nUltimately, in 2001, if the New York Times did not publish the landmark investigative reporting they published as part of that article, we would never have known about the process abuses committed during the Florida election. The public would be in the dark. Considering the vast amount of lawsuits, discovery, and information about the 2020 election, I was hoping there was a similar deep dive on the level of 2001 in Florida, but it appears there unfortunately isn't.", "label": 0}
{"text": "Sure, would be happy too.", "label": 0}
{"text": "Hi there. I'm a bot. It looks like this submission to /r/NeutralPolitics does not contain any links. According to the [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules), this subreddit does not approve any posts that do not link to sources, with one small exception that's detailed in the rules. Unless your post falls under that one exception, it will not be approved. A mod will comment if they see a way for the post to be submitted with edits.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Great. Let's go through it...\n\nTo begin with, under the neutrality requirements of Rule B, we don't allow questions that solicit just one side of an argument. So, you could ask about the pros and cons of such sites, but not take a position and then ask respondents to argue against it. Subreddits like r/changemyvew are set up to handle that style of discussion. Posts here must be neutral. Questions framed in the negative (*Isn't the premise fundamentally flawed?*) should also be eliminated, because they are also considered leading, not neutral.\n\nSecond, per Rule D, anything phrased as a factual claim needs a link to a source, including, but not limited to, statements about the roots of such models and the current status of their probabilities.\n\nFinally, and perhaps fundamentally, I think there's a little bit of conflation here between \"poll aggregators\" and \"election prediction models.\" Poll aggregators are largely understood to be simply what they sound like: aggregators of polls. They may include a bit of weighting, but they pretty much just present all the relevant polls and come up with an average. Some examples are: [RealClear Polling](https://www.realclearpolling.com/polls/president/general/2024/trump-vs-harris) and [this one at The Hill](https://elections2024.thehill.com/national/harris-trump-general/).\n\nElection prediction models, by contrast, do a lot of weighting, consider a bunch of other factors (like historical trends and events influencing individual races), and most importantly, try to distill it all down into probabilities of victory. Some examples are: [538](https://projects.fivethirtyeight.com/2024-election-forecast/) and [The Economist](https://www.economist.com/interactive/us-2024-election/prediction-model/president/).\n\nAggregators don't present win probability. And while election prediction models may disclose the polls they're using to feed into their models, their goal isn't to present a pure average.\n\nSo, if you decide to rework this, it'd be important to distinguish which one you're asking about.\n\nIf you have any questions or comments, just reply here, and thanks for participating.", "label": 0}
{"text": "Thanks for the adjustments. You're nearly there. Just a few things left to change.\n\nFirst, this needs a source:\n\n> Most predictive models are largely predicting a \"50/50\" result for the upcoming 2024 election, including basically 50/50 chances in most battleground states.\n\nThen, at the end, these two statements of your own opinion or how something \"feels\" to you should be reworded for neutrality:\n\n> It feels to me like you would be better served and informed by looking at individual polls to make a guess at who is ahead. \n\n> I'm not sure how the \"predictive models\" themselves add anything to the conversation.\n\nThe easiest way is probably to turn them into questions: \n\n> Would we be better served and informed by looking at individual polls to make a guess at who is ahead?\n\n> What do the \"predictive models\" add to the conversation?\n\nFinally, based on all the above, the title needs to change. Something like this would work:\n\n> What are the pros and cons of predictive election models, like 538, for our discourse around elections?\n\nUnfortunately, the Reddit platform doesn't allow editing of titles, so you'll have to resubmit to make that last change.\n\nThanks again.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nHowever, I'll take a quick crack at answering...\n\n> Why can't Biden be working on this? \n\nThey [launched a task force](https://www.nbcnews.com/business/business-news/biden-launch-task-force-crack-unfair-illegal-pricing-rising-inflation-rcna141823) that is working it. They're looking at what the executive branch agencies can do in the absence of a specific law limiting the practice.\n\nA federal ban, as Harris proposes, would likely mirror the laws many states already have, which means it would require Congressional legislation. But the Democratic party doesn't hold the House of Representatives right now, so they can't even get a bill to the floor. They did draft and introduce a [House bill in 2022](https://www.congress.gov/bill/117th-congress/house-bill/7736/text) and a [Senate bill in 2023](https://www.congress.gov/bill/118th-congress/senate-bill/355), but those didn't get out of committee.\n\nLegislating is hard, but just because it hasn't gotten done doesn't mean people aren't working on it. With an evenly split Congress, only bills with some degree of bipartisan support have any hope of passing.\n\nThe other aspect of this situation is the campaigning component. There's a little rhetorical campaign trick that happens in elections like this. The opposition talks constantly about everything that's wrong with the current administration, then tries to tie the candidate from that administration to its policies, saying she's \"more of the same.\" But if she breaks from those policies or proposes something new, the same people ask, \"Why isn't she doing that stuff already?\" \n\nSo, it's a no-win situation. Whether the candidate holds course or does something new, they're criticized. This is just how politics works and the campaigners count on the fact that people won't get wise to the logical inconsistencies.\n\nI hope that answers your question. If not and you'd like suggestions on how to rework this into a submission we'd approve, reply here and I'll see if I can help.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nThanks for understanding.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Okay thank you very much for the answer, i'll look up some sources", "label": 0}
{"text": "Dont know until you look.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nIf you'd like to submit a reworked version that complies with those rules, we'd be happy to consider it.\n\nThanks for understanding.", "label": 0}
{"text": "Made the adjustments and posted the updated question here: [https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/what\\_are\\_the\\_pros\\_and\\_cons\\_of\\_predictive\\_election/](https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/what_are_the_pros_and_cons_of_predictive_election/)", "label": 0}
{"text": "Great. I see another mod already approved it.\n\nGood luck.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "> Famously, 538 predicted a 70+% chance that Hillary would win the 2008 election, and she ended up losing. Most predictive models are largely predicting a \"50/50\" result for the upcoming 2024 election, including basically 50/50 chances in most battleground states\n\n\nThis is a misunderstanding on what the model is good for.  A model that says that Hillary has a 70% chance of winning means that if you hold an election three times with similar probability, Trump would have a 65% of winning once.  Nate Silver was the only person who showed that if all the polls are wrong by a little in the same direction, Trump's probability of winning was much higher than what we thought, and that's exactly what happened.\n\n\nThere was a famous article by Ryan Grim calling Silver out before the election for doing exactly that.\n\n\nRemember, a model is an attempt to create a representation of reality. It's there so we just don't take polling averages.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "\"All models are wrong, but some are useful\". George E. P. Box, father of modern mathematical modeling.", "label": 0}
{"text": "> What are the pros and cons of predictive election models, like 538, for our discourse around elections?\n\nThe first HUGE pro is that people genuinely are very very interested in the output of these models and a lot of primary and secondary industries make a lot of money from that. And regardless of how we interpret the statistics, they may allow people to get a kind of 'temperature' feeling about the ebb-and-flow of things. \n\nAnother huge pro is the amount of material it provides to the traditional media and social media companies. These polling models drive a huge amount of engagement - albeit somewhat toxic at times IMO. That in turn supports the advertising industry that (like it or not) bankrolls the whole show.", "label": 0}
{"text": "\nYou should edit this source in to your comment: https://www.huffingtonpost.co.uk/entry/nate-silver-election-forecast_n_581e1c33e4b0d9ce6fbc6f7f\n\n\n> The models themselves are pretty confident. HuffPost Pollster is giving Clinton a 98 percent chance of winning, and The New York Times’ model at The Upshot puts her chances at 85 percent.\n> There is one outlier, however, that is causing waves of panic among Democrats around the country, and injecting Trump backers with the hope that their guy might pull this thing off after all. Nate Silver’s 538 model is giving Donald Trump a heart-stopping 35 percent chance of winning as of this weekend.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule G.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Hi and thanks so much for reviewing and letting me know what I did wrong", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "> * If predictive models are simply summing up and weighing error-prone polls, how does such a summation result in a more accurately framed \"probability\" for election outcomes?\n\nThere are two kinds of errors in polls: sampling errors and non-sampling errors.\n\nSurveys try to be representative of the population in question, and for polls the population in question are usually either the set of registered voters (RV; you tend to find these being emphasized a few weeks or more out from the election) or the set of electors who are going to cast votes by the end of election day i.e. likely voters (LV; you tend to find these being headlined close to election day).\n\nFor a particular election let's say that the population in question is completely evenly split 50/50 between parties D and R.  If you survey 2 people from that population then it's two coin flips: there's a 25% chance you get a response of 0% D / 100% R, a 50% chance of 50% D / 50% R, and a 25% chance of 100% D / 0% R.\n\nStatistics is a well-developed field of mathematics, and these kind of results (even if the population isn't 50/50 split) follow a binomial distribution which when you get towards larger numbers (N = a few score interviews or more, typically) can be approximated by the [normal distribution](https://en.wikipedia.org/wiki/Normal_distribution).\n\nPolls exist because it's prohibitively expensive to interview all of the millions upon millions of people who might possibly vote and most won't tell you anyway.  So you interview a couple hundred or a thousand or so instead, and use the normal distribution to calculate what the sampling errors are because dumb luck will mean that you happened to contact a slightly larger fraction of blue voters than red voters than exist in the actual full population.\n\nSo this sampling error is what you find quoted as the margin of error (MoE) of a poll, usually the 95th percentile i.e. given that this N = 1000 poll might have a ±3% MoE and says D 49% / 51% R, there's a 95% chance that the underlying population is somewhere between D 46 / 54 R and D 52 / 48 R.  That sort of thing.  To find out that the actual vote is outside of this range should only happen 1 time in 20.  The MoE drops by √2 for every time you double the number N of interviews, so the bigger N the smaller the sampling error.\n\nIt's slightly more complicated than that because of weighting (i.e. putting more or less weight on a particular individual's responses so that the sample as a whole looks more like the known population from e.g. census data, but that can be accounted for statistically as well.\n\nNon-sampling errors come from issues that are hard to control for.  For example, are Republican voters or Democratic voters more likely to answer your questions via your chosen method of surveying them?  Are one or the other more likely to lie to you?  These are very difficult to control for - there are ways to try, but they have become a progressively bigger problem for pollsters as the response rate has dropped and differences in response rates have risen.\n\nDoing math on a big bunch of published polls by aggregators aims to reduce the sampling error by essentially adding them up into a bigger N.  It can kind of do something - maybe - about non-sampling error if half of the pollsters have mucked up their sampling method one way and the other half the other way.  If there's a proper diversity of methodologies then that can help a bit.\n\n538's model famously has some fudge factor built in to try to account for non-sampling errors that might affect large swathes of the polling industry.  That's why some aggregators who only considered the published sampling errors of polls said Clinton was 95+% likely to win in 2016 while 538 put it at only 70%.\n\n> * How are elections \"probabilistic outcomes\"? The election will be determined by voters - there is no skill, chance, or luck involved, and certainly not to the degree of something like a professional sports match.\n\n\"If the election results are going to be X% vs Y% then there's a 95% probability that our N = 1000 poll result is within 3 percentage points of that.  Our result is X₁% vs Y₁%, so X and Y are almost certainly within 3% of those values.\"  Poll aggregators transform a bunch of those into probabilities that X > Y, or X < Y, or X = Y, where X and Y are each candidate's EC vote counts, or the number of Senators or Representatives each party is going to wind up with in Congress.\n\n> * If a predictive model can't really tell who wins the election at 70%+ probability, then what value does it provide and what insight does it provide and what value does it add to the conversation? I understand a 30% chance of something happening is a far cry from \"impossible\" but what value does it add when we can simply look at polls to understand who is likely to be ahead?\n\nWhen 538 told us that Clinton was 70% likely to win in 2016 it was essentially saying that it wouldn't be surprising at all if either candidate won and we should temper our expectations accordingly.\n\n> * Would we be better served and informed by looking at individual polls to make a guess at who is ahead?\nWhat do the \"predictive models\" add to the conversation?\n\nThey make N bigger to reduce sampling errors and generally add a fudge factor for non-sampling errors which you're not going to get from any individual poll.   A dose of skepticism that a poll (or a plain mathematical aggregate of them) showing a lead outside the MoE necessarily means that there's an actual lead rather than a problem with how the samples were collected.\n\nIf you're really into things then they can tell you something very valuable: where your GOTV efforts or your political donations are the most likely to result in a difference to the ultimate end result.  For example, the polls are showing a tighter Senate race in Ohio than Montana, but if you want to make the biggest bang in the 119th Congress given a fixed time and money budget then you should throw them into the latter because you don't have to persuade as many people in order to change the outcome since MT has many fewer voters overall.  Sam Wang of the Princeton Election Project [has the calculated per-vote power in the side bar there](https://election.princeton.edu/) and [Vote Maximizer](https://votemaximizer.org/) lets you investigate the same on an interactive map.\n\nOf course, major parties are doing exactly this kind of modeling all the time (as well as their own internal surveys) in order to try to figure out where their candidates' time and money are best spent to maximize their chances of victory.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hi there /u/Clutch-Corypheus. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic that would generally fall under our \"request for sources\" exemption to [Rule D,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) but it includes some factual claims as well, so those would need to be supported with links to [qualified sources](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources) or removed entirely.\n\nPlease edit the text accordingly and then reply here once you've made the adjustments or if you have any questions.\n\nThanks.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "> 538 predicted a 70+% chance that Hillary would win the 2008 election, and she ended up losing.\n\nThere's no inconsistency there.\n\nProbabilistic thinking isn't natural for most people, so they convert it into their heads into a binary assumption that something will or won't happen. Silver himself explains it in [this interview.](https://news.harvard.edu/gazette/story/2017/03/nate-silver-says-conventional-wisdom-not-data-killed-2016-election-forecasts/)\n\nThe truth is, 30% is a pretty high probability. \n\nThe fatality rate for skydiving in the US is about [1 in 370,000 jumps,](https://www.uspa.org/about-uspa/uspa-news/a-widespread-improvementthe-2023-fatality-summary) yet most people are afraid to do it because of that one chance. The risk is too high. Yet when someone says there's about a 1 in 3 chance Donald Trump would win the presidency, they're shocked when he does. Humans are just naturally bad at probabilistic thinking.", "label": 0}
{"text": "Sorry about that!", "label": 0}
{"text": "…we don’t know the election results though. Not until they actually happen. We can attempt to guess the end result by conducting polls, looking at polling data, and coming up with statistical predictive models to attempt to suss out a result. Hopefully with error bars et al.\n\nSilver’s / 538’s 30-35% trump victory prediction was hardly discrediting.\n\nNYT et al’s 95% HRC predictions however kinda were.\n\n30% is still, obviously, a VERY high predicted likelyhood of something happening. As opposed to 1 in 20, 1 in 200, or what have you.\n\nA 1% odds predicted event is still something that can and will happen. Albeit is probably an indicator that you model data and/or methodology were bunk, as an electoral predictive model.\n\n70% though, yeah, is NOT any kind of guarantee that something can or should happen.\n\nIf your model is “correct” - based on past historical data - and includes all factors that most likely will, realistically, predict how populations might vote given a very limited polling sample size, and demographic data.\n\nWhich to be clear it probably isn’t. But will at the least be more “useful” - and help estimate the *actual* impact of recent events - than just looking at *raw* polling data, gut feelings / local anecdotes, or what have you.\n\nThe main utility of these polls + models is ofc for the actual campaigns.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "\\> Polls are trying to assess voter intention, but voter intention is not like a coin flip or a sporting event. The concept of \"if we ran 3 elections, Harris wins 2 and Trump wins 1\" is non-sensical - the voters aren't going to be flipping their votes en-masse in some non-deterministic way. It isn't like a coin flip or a sports game.\n\nPolls try to assess voter intention but 538's model doesn't. Here's a really basic example model that uses two factors:\n\n\\- Pollster X says Clinton will win PA. This pollster is accurate 90% of the time.\n\n\\- The winner of PA has won the election 80% of the time. \n\nI know Pollster X is right 9 out of 10 times. I don't know when they'll be right or wrong. Polling takes skill, and pollsters can randomly screw up.\n\nI know how often the winner of PA wins the election. I don't know which years though.\n\nSo I would predict that 72 out of 100 elections, Clinton should win.\n\nA better way to look at it: \"Out of 100 elections, the candidate whom Pollster X predicts will win PA should win the election 72 times. This means there's a 72% chance that this is one of those elections.\"\n\nOr: \"Historically, when candidates have met conditions A and B, they have won 72 out of 100 elections.\" This isn't exactly accurate but it's the basic idea.", "label": 0}
{"text": "> There could - or could not - be substantial methodology issues with those polls.\n\nFunny you mention that, Nate Silver actually just wrote about this in his substack: https://www.natesilver.net/p/theres-more-herding-in-swing-state\n\nBasically, a lot of the polls are unnaturally 50/50. If you take a random sample of the population, every once in a while you expect to get outliers by chance. In his post, he explains that there are far fewer outliers than the number we should be seeing.", "label": 0}
{"text": "Nate Silver is an obnoxious little man that always thinks he's smarter than everyone in the room. \n\nHe claimed liberals wanted to withhold the Pfizer vaccine. \n\nHe claimed halting the J&J vaccine due to clotting would cause more skepticism and they should just let it roll?\n\nHe literally recently just openly stated he was using his \"gut\" to make some predictions.", "label": 0}
{"text": "You should also post this on statistics forums as many of your questions have much more to do with statistics, forecasting models, inferential thinking, and the philosophy of predictions than with politics. \n\nAlmost everything in your question can be shared with predicting the weather, predicting hurricanes, predicting economic recessions, etc.", "label": 0}
{"text": ">But sports games and coin flips are all based on some combination of \"luck\" and \"skill\".\n\nWhat part of coin flips do you think is skill based?", "label": 0}
{"text": "There are a couple concerns with counting early, even if results aren't reported.\n\nOne is that the states train, staff and equip their processing centers for a limited period of time. They may only be set up to do this work for a week or so for budgetary reasons.\n\nThere's also the possibility that the count, though unreported, could be leaked.\n\nBut generally, some degree of pre-canvassing (examining, verifying and sorting the ballots) is done in most states, which speeds up the process even in those that don't count until election day. [Here's an article](https://www.spotlightpa.org/news/2024/10/pennsylvania-election-mail-ballots-precanvassing-101/) explaining why pre-canvassing is not done in the key swing state of Pennsylvania. It has [some people worried.](https://edition.cnn.com/2024/09/22/politics/vote-counting-delays-election-states/index.html)", "label": 0}
{"text": ">How are elections \"probabilistic outcomes\"? The election will be determined by voters - there is no skill, chance, or luck involved, and certainly not to the degree of something like a professional sports match.\n\nElections are probabilistic because a lot of tiny little random things happen to determine who actually makes it to the polls -- whether you get a flat tire that morning, whether you over sleep, whether you run into your friend who convinces you to go and vote together, and so on.\n\nBut, you can model things using probability even where there is no randomness involved.  Suppose you're taking a history test.  It asks \"Who was the 9th president of the United States\": A) Bill Clinton, B) Andrew Jackson C) William Henry Harrison, or D) Zachary Taylor.\n\nThere's no randomness here whatsoever, and no prediction either.  This is something that has already happened.  But you probably don't know the answer for sure.  Maybe you're a presidency buff and already know this one, but most people would look at the question, and not be sure.  So it would be perfectly sensible to say, \"I think there's a 60% chance it's Andrew Jackson\" or \"I'm 100% sure it's not Bill Clinton, but I'm just guessing randomly among the others.\"  These are perfectly reasonable uses of what's called [Bayesian probability](https://pmc.ncbi.nlm.nih.gov/articles/PMC4158865/).  You're using probability not to predict a \"random\" outcome like a coin flip, but rather to describe your own degree of belief in something.  \n\nSo, let's imagine you're right and the outcome of the election is completely deterministic; ignore all those random factors above.  We are still in the position of not knowing who will win with certainty, and we can quantify the information available to us as a probability.\n\n>Would we be better served and informed by looking at individual polls to make a guess at who is ahead?\n\nThe rest of your questions really seem like riffs on this one.\n\nSo, let's say we look at an individual poll.  Which one? Look at all these [recents polls in PA](https://www.realclearpolling.com/polls/president/general/2024/pennsylvania/trump-vs-harris).  The Hill/Emerson has Trump up by 1 point.  Muhlenberg College has Harris up by 2 points.  Which poll should we pick? \n\nIf you answer is some form of \"let's look at all of them\" or \"let's look at the ones that are especially good polls by some criteria\" then you're just informally recreating a predictive model.   A predictive model is just a more rigorous way of taking a bunch of polls and trying to figure what they're telling you when you put them all together.\n\nThat only takes you so far.  Even taking all the polls put together, there's only so much information in them.  And so, once you aggregate that, you may be left with answers that still have a lot of gaps.  But you're still better off looking at all the information you have instead of just picking and choosing.", "label": 0}
{"text": "The mistake you are making is thinking that the \"random event\" is the voter action. If we knew the voter action, there would be no need for a model at all. What a model does is translate data like polls into some statement about reality like an electoral outcome. In that sense, the \"random event\" is the poll. If you poll people Monday, Tuesday and Wednesday, there is a very high chance that each day your poll will have different results. That is partly because polls are attempting to randomly sample the population. It's partly because polls sometimes play a role in people's decision (e.g. people pointing to Biden's declining polls as a reason for wanting him to drop out or Clinton's high poll margin as an excuse to stay home from voting). It's partly because the way the polls is designed may impact how people answer or who even responds. It's partly because pollsters will have blind spots to these things. But when you add it all up, each of these polls is going to have some probability of every kind of error and some probability of every amount of \"bad\" random sampling. This probability is what you're generally talking about. So, it's almost looking at it backward: Suppose Trump is going to win, what are the odds that we would have \"randomly\" sampled people in such a way that said he was down by 2 points? And you can look at enough different polls with that question that you aren't looking at one event, you're looking at thousands of events.\n\nHowever, it's still true that the voter actions have some probability attached to them. The idea that every voter knows exactly who they will vote for and noting can happen that will change their mind is false. There is some probability that Bob is going to see the right attack the morning of polls that make him change his mind on something. There is some probability that Jane is going to be tired from working late and decide voting doesn't matter. There is some probability that a major world event will occur that changes people's focus as they rank candidates. Etc. Studies shows that the order of candidate names on a ballot impacts how many votes they get (which is why some states rotate the candidate positions from ballot to ballot). If something that meaningless impacts voter actions, clearly, these other kinds of random events that occur and are of more substance will influence voter behaviors.\n\nIt's also worth noting that while one election is one event, people who create models can run their model on many different elections under the presumption that a good model will do well at predicting the most elections (state, local, federal, mid term, special, etc.) or even that it will do well at predicting \"similar\" elections (e.g. recent elections, elections with similar candidates/issues).", "label": 0}
{"text": "So, a coin flip is not really random.  If you knew: \n* Whether the coin started on heads\n* The velocity with which it was hit \n* The exact position \n* The weight of the coin and distribution \n* The distance to the floor \n* The composition of the floor\n* The air resistance \n\nAnd many other factors, you could guess with 100% precision on the outcome of the coin flip.  Because we don't, we have a very simplistic model that just gives us a 50% chance, and some more sophisticated ones that show that if it starts facing a certain side, it'll be a tiny bit over 50%.  It's very accurate. \n\nThis works in the same way for the population.  The more information we have, the better we can guess on who will win the election. In general, the fact that we can't is not due to a model failing, but lack of information. \n\n> It is almost 100% voter intention\n\nIt may appear that way, but even if you could poll 100% of the voters, you're not factoring in time.  If you polled them 3 months ago, Kamala would have almost certainly won.  If you polled it 4 months ago, Trump would have almost certainly won.  \nEven if it were 100% voter intention, voter intentions fluctuate and the only way", "label": 0}
{"text": "Even if you ignore the consequentialist arguments that the reason to do it is to benefit the side that currently has less representation, you can still be in support of having a robust functioning democracy that is predicated on people going out to vote.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "For sure. That's why I'm not sure why he is saying its skill and luck.", "label": 0}
{"text": "Great answer. Theoretically, we could know exactly which side a coin would land on if we had 100% of the data. But we don’t, so we assign odds relative to the information we do have. Same with election forecasts. If you could poll every person the day before a poll on their intentions to vote and for whom, you could have a much higher predictive outcome. \n\nHonestly, you could better predict a coin flip than an election with 100% of the info on each because things will happen in 24 hours that change voting patterns.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rules A, B, C, D and E.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Hi there u/Decent-Sport5744. I'm a mod in /r/NeutralPolitics.\r\n\r\nThis is an interesting topic, but the post itself would need some editing to comply with our submission rules. Let me know if you'd be interested in doing that and I can make some suggestions.\r\n\r\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "Hi there /u/KissMiasma95. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "If everyone who was eligible to vote actually voted, the results would be vastly different. In 2016, if \"Did Not Vote\" was a candidate, it would have beaten both Trump & Clinton by the biggest landslide in history. Apathy is our biggest enemy to a truly representative government.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hi there /u/Slizced. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "yes what are some suggestions.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C and D.\n\nThanks for understanding.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/-/lvc22c8/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/-/lva0sxy/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/-/lvchpve/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Depends on the details of how it's flipped! In certain setups, it's basically deterministic. See [Diaconis, Holmes, & Montgomery (2007)](https://www.stat.berkeley.edu/~aldous/157/Papers/diaconis_coinbias.pdf). See particularly the abstract and first paragraph. The first author, Persi Diaconis, is an expert in the subject of randomness, which is noted in [his wiki page](https://en.wikipedia.org/wiki/Persi_Diaconis). And he's rather a fascinating person: At a young age he ran away to join a travelling magician troupe, and started learning math and probability in order to get better at gambling games. See an interview in [Quanta Magazine](https://www.quantamagazine.org/persi-diaconis-mixes-math-and-magic-20150414/).", "label": 0}
{"text": "Added sources, not that it really matters since parent comment is also removed.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Sure, I added some sources.", "label": 0}
{"text": "Just to be clear on how misleading you're being. \n\n\n> I inevitably get a question: “C’mon, Nate, what’s your gut say?”\n\n> So OK, I’ll tell you. My gut says Donald Trump. And my guess is that it is true for many anxious Democrats.\n\n> **But I don’t think you should put any value whatsoever on anyone’s gut — including mine.** Instead, you should resign yourself to the fact that a 50-50 forecast really does mean 50-50. And you should be open to the possibility that those forecasts are wrong, and that could be the case equally in the direction of Mr. Trump or Ms. Harris.\n\nhttps://www.nytimes.com/2024/10/23/opinion/election-polls-results-trump-harris.html\n\nWhat do you find controversial about that comment?", "label": 0}
{"text": "You should also add the New York Times with its famous election needle. However, the needle might not be working tonight. \n\nhttps://www.theverge.com/2024/11/4/24288107/the-new-york-times-election-needle-just-got-even-more-stressful", "label": 0}
{"text": "I took a look at the published plans of the [Trump](https://rncplatform.donaldjtrump.com/?_gl=1*8xlmpy*_gcl_au*MjkyNzAwNjYuMTczMDgyODg1OA..) and [Harris](https://kamalaharris.com/wp-content/uploads/2024/09/Policy-Book-Economic-Opportunity.pdf) campaigns. Neither specifically mentions Section 8.\n\nThe Trump plan doesn't have any instances of the word \"rent.\" It mentions housing costs in general and says it will improve affordability by reducing immigration (p.7). This is the entirety of the section on Housing Affordability (p.10):\n\n> To help new home buyers, Republicans will reduce mortgage rates by slashing Inflation, open limited portions of Federal\nLands to allow for new home construction, promote homeownership through Tax Incentives and support for first-time\nbuyers, and cut unnecessary Regulations that raise housing costs.\n\nThe economic portion of the Harris platform alone is nearly six times as long as the entire Trump platform. Chapter 7 (p.36) is titled, \"Help Americans Buy a Home and Afford Rent.\" It's too long to excerpt all the of the relevant parts, but here are some highlights...\n\nIt aims to address high rents by expanding the Low-Income Housing Tax Credit and increasing supply. There's also an \"innovation fund\" idea to help state and local governments build more affordable housing, plus a section about taking on abusive corporate landlords who drive up prices. Finally, there's a plan to convert renters to buyers by helping them save for their downpayments. I encourage anyone interested in this topic to read the whole section.\n\nAs an aside, it's notable that the comparative specificity of the two housing plans carries across to other issues. The Harris platform is pretty detailed and specific on all the issues it covers, while the Trump plans are extremely brief and vague. The contrast is pretty shocking when you dig into it.", "label": 0}
{"text": "Many of the networks reference [The Associated Press](https://apnews.com/hub/election-2024) to call specific races. It is \"the only organization that [collects and verifies election results in every city and county](https://en.wikipedia.org/wiki/Associated_Press#Election_polls) across the United States.\" They're [known for accuracy and widely trusted.](https://www.esquire.com/news-politics/a34496862/how-associated-press-counts-us-presidential-election-votes-results/)\n\nYouTube will host live streams of election coverage from the major broadcast and cable networks. [Steve Kornacki](https://en.wikipedia.org/wiki/Steve_Kornacki) on NBC has an incredibly detailed knowledge of the individual districts (he can rattle off their past results from memory) and uses what they call [the \"Big Board\" to present results.](https://www.nbc.com/nbc-insider/about-steve-kornacki-how-to-watch-him-on-nbc-election-night)", "label": 0}
{"text": "I have used the CNN website for many years, though I am not particularly a fan of CNN I have liked their election websites.", "label": 0}
{"text": "The way he glides around the room and works that board sure is a sight to behold", "label": 0}
{"text": "Decision Desk HQ has been good during the primaries.\n\nI plan to use it for all the state legislative races I want to track that will get no TV coverage.", "label": 0}
{"text": "Aww, I really like the needle as it sums up all the like-for-like changes in precinct-level results rather than the vagaries of the running total that are dependent on their variable reporting order.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "I do NBC News because of Dave Wasserman.\n\nAny time he says he's \"seen enough,\" I instantly feel better. Or worse.", "label": 0}
{"text": "If you don't want to cross a picket line, please don't use the NYT needle tonight. [They've asked that people supportive respect their \"digital picket line\"](https://newsguild.org/press-release-new-york-times-tech-guild-walks-off-the-job/)", "label": 0}
{"text": "I have been clicking around on the CNN website for five minutes and after seeing nothing but articles about the elections I have given up where to find results only. Do you have a specific URL where the results appear, or isn't that live yet until the first results come in?", "label": 0}
{"text": "Op posted a link...\n\n> Asking as a non US citizen, just curious to follow the results and I'd like to know what everyone uses to track the results throughout the day.\n> \n> I've found some so far, not sure which website is best:\n> \n> https://www.270towin.com/\n> \n> https://www.axios.com/visuals/presidential-election-results-2024-updates-harris-trump\n> \n> **https://edition.cnn.com/election/2024/results/president?election-data-id=2024-PG&election-painting-mode=projection-with-lead&filter-key-races=false&filter-flipped=false&filter-remaining=false**\n> \n> https://abcnews.go.com/Elections/2024-us-presidential-election-results-live-map/\n> \n> https://www.nbcnews.com/politics/2024-elections/president-results\n>", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "Meaningful results won't really be available until sometime after 7pm Eastern when polls start closing and start reporting.  The west coast will still be voting until 10pm Eastern time.  And even then, there will still be counting going on for several days, so a close result may not be known for days or weeks.", "label": 0}
{"text": "One day, every four years, I think of that guy as the hero that’s always forgotten about. Dude is a legend", "label": 0}
{"text": "That's nothing compared with [this guy](https://youtu.be/9qI0LTmSr38?si=1WM5AVJm9Bp1dMcV&t=3).", "label": 0}
{"text": "No results? NH has already reported 6 votes from Dixville! (3 Harris, 3 Trump)\n\nhttps://www.nbcnews.com/politics/2024-elections/new-hampshire-president-results", "label": 0}
{"text": "Fair enough.  I retract my earlier statement ;-)", "label": 0}
{"text": "I’d sacrifice all of the mainstream anchors to Gozer in a second to get Tim Russert back.", "label": 0}
{"text": "The article you’ve referenced does not talk about using the needle or NYT broadly, they’ve asked people to refrain from using the NYT cooking and NYT Games apps", "label": 0}
{"text": "Yeah my bad, this any better?", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "This comment has been removed because users are not allowed to post top-level comments on their own submissions.\n\nFor more information on the /r/NeutralPolitics rules, please see the [guidelines](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_how_we_moderate_submissions). If you have any questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FNeutralPolitics&subject=Removed%20comment&message=https://www.reddit.com/r/NeutralPolitics/comments/1gki55b/what_is_the_impact_of_elon_musks_political/lvlph1m/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "> rather it's the nature of the activity\n\nBut is it? That's what I'm asking about a justification for. The discussion/disagreement above seems to be predicated on this assumption, and there is not evidence for it. Particularly since the point has been challenged, continuing to assume it without evidence is not a productive way to engage in the discussion. It just leads to a back and forth of \"Yes it is\", \"No it isn't\", \"Yes it is\", and so on.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hi, I decided to rewrite make my post as a new question, since I made this post a few days ago (post is kinda old and expired since then?). I adopted the changes you said and hope that'll be good enough for approval. Thanks!", "label": 0}
{"text": "This comment has been removed because users are not allowed to post top-level comments on their own submissions.\n\nFor more information on the /r/NeutralPolitics rules, please see the [guidelines](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_how_we_moderate_submissions). If you have any questions or concerns, please send us a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FNeutralPolitics&subject=Removed%20comment&message=https://www.reddit.com/r/NeutralPolitics/comments/1gk42lg/what_is_the_best_website_to_view_live_election/lvm6egs/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Really?  I have a like 200 day Wordle streak going", "label": 0}
{"text": "Does one need a source to differentiate between a coin flip and getting a bullseye on a dart board? I think it is fundamentally understood that a coin flip is mostly based on luck and a dart board bullseye is mostly driven by skill (although there is a small amount of luck involved in throwing darts and a small amount of skill in flipping a course).\n\nLikewise, a voter voting for a candidate involves neither luck nor skill to the same degree as either. It is a rational choice made by an intentional individual.\n\nFor something in the realm of the discussion, here is a paper exploring the unique rational decision making behind individual and community voting:\n\n[https://www.jstor.org/stable/2111531](https://www.jstor.org/stable/2111531)", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Now it's 6 years later after this comment and the associated press is back at it again calling an election when not even 30% of the ballots have been counted specifically Oklahoma.\n\nYes I understand that they call it for Oklahoma due to the fact that they're confident that we'll just vote Republican again, but 20 minutes ago in North Carolina they projected them to be won by the Democrats yet it flipped the other direction completely.", "label": 0}
{"text": "[NPR](https://apps.npr.org/2024-election-results/) has a nice clean design that doesn't crowd out the results tracker with a bunch of news feeds, and if you select \"ELECTORAL\" on the presidential results page, it shows states proportionally to their number of electors rather than geographic area.", "label": 0}
{"text": "If you live in a reasonable country your national broadcaster is probably just running NBC or CNN broadcast so just that one", "label": 0}
{"text": "That was great, thank you for that.", "label": 0}
{"text": "The answer will just be STRIKE for a while", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C, D and E.\n\nThanks for understanding.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) D, E, F and G.\n\nYou might try posting this in /r/PoliticalDiscussion.\n\nThanks for understanding.", "label": 0}
{"text": "This and all the replies are removed for being off topic. This post is about where to watch live election results.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B, D and F.\n\nThanks for understanding.", "label": 0}
{"text": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, D and G.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nNews articles from reliable sources can be posted to our sister subreddit, r/NeutralNews.\n\nThanks for understanding.", "label": 0}
{"text": "[As of last month, Musk had given at least nine figures $ to help the Republicans win this election, including another $56 million in a period of weeks](https://www.bloomberg.com/news/articles/2024-10-25/musk-gives-at-least-132-million-to-elect-trump-gop-allies) (Bloomberg.com).\n\n[Musk pledged $46 billion to buy X](https://www.reuters.com/markets/us/how-will-elon-musk-pay-twitter-2022-10-07/), [and under Musk, X has become \"epicenter\" of spreading misinformation, with Musk personally frequently spreading large amounts of misinformation to his hundreds of millions of followers](https://www.reuters.com/world/us/wrong-claims-by-musk-us-election-got-2-billion-views-x-2024-report-says-2024-11-04/) (Reuters.com).\n\nAlthough [election officials increased their efforts in 2024 to combat misinformation, they were \"outmatched by Elon Musk’s misinformation machine\":](https://edition.cnn.com/2024/10/31/politics/election-officials-outmatched-elon-musk-misinformation/index.html)\n\n>Elon Musk’s misinformation megaphone has created a “huge problem” for election officials in key battleground states who told CNN they’re struggling to combat the wave of falsehoods coming from the tech billionaire and spreading wildly on his X platform.\n\n>Election officials in pivotal battleground states including Pennsylvania, Michigan and Arizona have all tried – and largely failed – to fact-check Musk in real time. At least one has tried passing along personal notes asking he stop spreading baseless claims likely to mislead voters.\n\n>“I’ve had my friends hand-deliver stuff to him,” said Stephen Richer, a top election official in Arizona’s Maricopa County, a Republican who has faced violent threats for saying the 2020 election was secure.\n\n>“We’ve pulled out more stops than most people have available to try to put accurate information in front of (Musk),” Richer added. “It has been unsuccessful.”\n\nOverwhelming the system with misinformation and disinformation is not a brand new strategy - from 2020: [\"'Flood the zone with shit': How misinformation overwhelmed our democracy\"](https://www.vox.com/policy-and-politics/2020/1/16/20991816/impeachment-trial-trump-bannon-misinformation).\n\nI personally don't know how we solve the problem of misinformation and disinformation overwhelming the system, let alone with richest American putting in hundreds of millions or tens of billions of dollars on the opposite side.\n\nWe have places here like the neutral\\* subreddits where sources have to be provided, but obviously most Americans aren't getting their information from the neutral\\* subreddits. Even the mainstream media ends up largely covering \"nonsense\" made-up scandals that the GOP and conservative media created, overwhelming any other biases that mainstream media may have. For example, Hillary's email server received more television news coverage than all policy issues combined in the 2016 election. When similar issues of Trump and his team also using insecure communications years later, those who claimed that Hillary (who was never president) having insecure communications was incredibly important, suddenly no longer felt that it was important at all. But when the GOP, and conservative media who largely took their coverage cues them, make an issue their #1 issue, and their existing audience then sees it, mainstream media then introduces the news story as well as something that \\~half of Americans are focused on, even if it objectively wouldn't be something that they'd focus on if it were a GOP president doing it, etc. [Source](https://www.vox.com/2018/10/23/18004478/hack-gap-explained).", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Hi there. I'm a bot. It looks like this submission to /r/NeutralPolitics does not contain any links. According to the [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules), this subreddit does not approve any posts that do not link to sources, with one small exception that's detailed in the rules. Unless your post falls under that one exception, it will not be approved. A mod will comment if they see a way for the post to be submitted with edits.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Identity politics", "label": 0}
{"text": "This comment has been removed for violating [comment rule 3](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\nBe substantive.  NeutralPolitics is a serious discussion-based subreddit.  We do not allow bare expressions of opinion, comments without context, sarcasm, jokes, memes, off topic replies, or perjorative name calling.\n\nIf you edit your comment to comply, it can be reinstated. If you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "This comment has been removed for violating [comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "https://www.usa.gov/elected-officials", "label": 0}
{"text": "> Where did this violate the rules?\n\nThis is a standard reply we put on all posts, it is helpful to actually read it.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rules A, B, C and E.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Comments ITT are a pretty good example of why people left the left and they don't even see it.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "The biggest impact Musk had on the election is probably trying to excite younger male voters to vote.\n\n[Musk targeted young men during the campaign](https://www.businessinsider.com/elon-musk-trump-america-pac-targets-young-men-vote-2024-9)\n\n[How Trump won the 2024 election — CBS News exit poll results](https://www.cbsnews.com/news/exit-polls-2024-presidential-election/)\n\nMen under 30 broke for Trump by almost 30% in Pennsylvania. Trump overall improved on courting young voters by 5% nationally compared to Biden.", "label": 0}
{"text": "Explain to me how disillusioning your own voter base is just vibes. For sure the party pushes away centrists, it did me years ago. Unfortunately this isn't something so simple and singular it can be explained in a reddit thread. I apologize I can't offer you anything more concrete. Sorting through the left and rights bs is hard. I do what I can by trying to consume discourse by each as fairly as I can.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Harris campaigned on tax cuts for the middle class and lowering costs for groceries and housing. How have they pivoted to the party of the elite?", "label": 0}
{"text": "I don't think the base was disillusioned, I think the base was apathetic. For a variety of reasons, inflation hurt even if it's not dems fault people are simple they blame the party in charge and democrats unlike republicans don't flip their economic view simply based on who is in office. The war in Gaza hurt because Democrats represent a large jewish base who support israels right to exist and also a left leaning base who is openly hostile to the existence of israel. So walking a tight rope of saying we have empathy for palestine while supporting israel was a herculean task. The War in ukraine is honestly the biggest failure on messaging from my perspective because they failed to concisely detail why the importance of democracy overseas is an American issue. Somehow the same base that thinks genocide is happening in Gaza can't see the Genocide happening in Ukraine... It's ridiculous. All while trying to grapple with keeping the rust belt and union voters who have moved into an extreme protectionist bend that is outright harmful to the US economy... Democrats try to argue from reality and it forces us to have to have complex nuanced positions, whereas trump won people by simply denying it and offering simple solutions. Protectionism 20% tariff that will raise enough taxes to eliminate income tax and also lower the cost of goods. Ukraine I will solve it day 1 . I wont tell you how lol. Healthcare I have concepts of a plan. These moves wouldn't work for the democratic base.", "label": 0}
{"text": "[Biden's policy made inflation so bad](https://www.washingtonpost.com/us-policy/2022/10/09/inflation-economy-biden-covid/) and I think people don't think trump would have done the same thing", "label": 0}
{"text": "What have I said that is particularly idiotic?", "label": 0}
{"text": "I'm a white dude, buddy. I respond ok to it because I understand context and can apply nuance to my understanding of the world. Yeah, I made a flippant, tongue in cheek comment. Guess it's all on me.", "label": 0}
{"text": "It’s a very specific trait in a very specific subset of some men. Conservatives usual similar rhetoric against other groups. Try having a discussion with a conservative about any given minority group’s “cultural” problems. \n\nThe left has tens of millions of men, and recently elected one president. They very clearly don’t have a problem with men on the whole. Only toxic ones. If you aren’t toxic, no one is criticizing you.", "label": 0}
{"text": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Allsides and The Free Press.", "label": 0}
{"text": "> Likewise, a voter voting for a candidate involves neither luck nor skill to the same degree as either. It is a rational choice made by an intentional individual.\n\nLuck is a factor in whether some individuals or other individuals make it to the polls.  Skill of the campaigns is a factor affecting this as well.  \n\nVoting is a mechanical process (like throwing a ball through a hoop), not just a rational decision.  This is where luck and skill enter.", "label": 0}
{"text": "Were there certain policies or specific statements of Musk or Harris/Trump/Walz/Trump/Vance that accomplished this though? Or was it more like \"Try to forget the last \\~year of Trump under COVID, and try to only associate the global inflation of years ago with Biden/Harris, and everything is going to magically be better and there will be deflation and tax cuts under Trump but not the typical major negatives or debt historically associated with those things\"?", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule A.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B, D and G.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the sub, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nSpecifically, rule G.\n\nIf you'd like to submit a reworked version of your post after [reviewing the guidelines,](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines) we'd be happy to consider it.\n\nThanks for understanding.\n\n* *Note: If you wish to discuss this topic under more relaxed submission rules, consider posting to our sister subreddit, /r/NeutralTalk.*", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, B and D.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nHowever, this subreddit hosts an annual examination of each presidential administration. You may want to review [the last one from Trump's first term,](https://www.reddit.com/r/NeutralPolitics/comments/l2zp5q/what_were_the_successes_and_failures_of_the_trump/) which includes links to the prior two years.\n\nThanks for understanding.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Well, I’m not really seeing what you’re describing, but it’s not worth all the hassle. Have a great day.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) C, D and F.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) B and D.\n\nIf you'd like to ask a question about the comparative eligibility for the highest office in various countries, that would be something we'd be happy to host, but it would need to be neutrally framed and based on sources.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, D and E.\n\nYou might try posting this in /r/PoliticalDiscussion or /r/Ask_Politics.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A, C and D.\n\nNews articles from reliable sources should be posted to our sister subreddit, r/NeutralNews.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't quite conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules)\n\nHowever, this would be an excellent question for /r/AskHistorians. Just review their rules before posting there.\n\nThanks for understanding.", "label": 0}
{"text": "Will do, thanks.", "label": 0}
{"text": "As other commenters have said, misinformation and disinformation has very real effects, and there’s really no practical solution that could solve it. \n\nYou can tell people to research what musk is saying, for instance, but if their research is confined to sources within that bubble, it will reinforce the same message. \n\nYou can teach people how to research reliable data, but most humans don’t want to find out their ideas are wrong, so cognitive dissonance kicks in. It creates a bizarre scenario where you actually dig in to your original ideas even more when presented with factual evidence to the contrary. \n\nThat’s a base level human reaction. How do you counter that? How do you teach genuine curiosity and humility? \n\nI don’t know. I don’t know if anyone really does, at least on a large scale. ", "label": 0}
{"text": "No, it means what I said.  I understand why it might seem that way, but the uncertainty doesn't come from people acting different during election night, it comes from the information we have from the polls.", "label": 0}
{"text": "No sorry.  I have a masters degree in mathematics.  One of the first things they teach you is how flawed political polls are and how even the “experts” misinterpret what they are doing.  Oh, I also have 20 years experience working with predictive models in the financial industry, so add that to the list of reason why you should trust me.", "label": 0}
{"text": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1giqib5/-/lvtfxg9/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) However, a web search leads to a few articles on the topic:\n\n* https://time.com/6334409/is-whats-happening-gaza-genocide-experts/\n* https://www.cbc.ca/news/world/genocide-gaza-debate-1.7042809\n* https://www.vox.com/politics/378913/israel-gaza-genocide-icj\n\nIf you're still not sure after reading those, make a new submission citing at least one of the articles and pose whatever questions remain unanswered.\n\nThanks for understanding.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "OK, but just to provide an example, here's what a version that complies with Rule 2 would look like:\n\n----\n\nIt has to do with [confidence intervals.](https://www.statology.org/confidence-intervals/) If you poll every person in the US, you will know the result with 100% certainty. If you only poll half, you’re not sure what the other half will do.  Using what you know and what you don’t know, you can use statistics to come up with a decision with a certain percentage of certainty.\n\nThe main reason predictive models are helpful in an election is they can tell when there is no hope. For example, the [polls said that Biden had no chance,](https://edition.cnn.com/2023/11/08/politics/trump-biden-election-cnn-poll-takeaways/index.html) so they made a change. You will never be able to use a poll to know the outcome of an election.\n\nThe problem with polling now is that [people are afraid to say they are Republican](https://www.vox.com/2024-elections/370649/trust-polls-2016-2020-election-2024-pollster-polling-miss) because of cancel culture. So they keep their mouth shut and they’re under representative in the data. Therefore, even the people you poll, you don’t know who they’re actually voting for, which makes the polls pretty much useless in close races", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nWe appreciate your participation in the subreddit, but we did not approve this submission, because it doesn't conform to our [submission rules](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) A and D.\n\nAlso, respondents are not allowed to post videos in this subreddit, so it's not the appropriate place for it. You might try a Trump-oriented subreddit, like r/conservative or /r/TheDonaldTrump2024/.\n\nThanks for understanding.", "label": 0}
{"text": "Hello there. I'm a mod in /r/NeutralPolitics.\n\nThis submission is in the queue awaiting moderator approval.\n\nIn some cases, we will allow requests for sources, but we like to see that OP has at least performed a web search and tried to find a few of those sources first. The post can include links to those and a request to recommend whatever's missing.\n\nIf you'd like to submit a reworked version along those lines, we'd be happy to consider it.\n\nThanks for understanding.", "label": 0}
{"text": "Hi there /u/Neoleth. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some reworking to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*", "label": 0}
{"text": "I'm not really sure it's about corrections, but more of a fundamental issue with the question. This is a strictly evidence-based subreddit, and there's no way to provide evidence to determine what someone cares about. It'd be like asking the users to read minds.\n\nSo, the first task would be to think up an evidence-based question, perhaps about what policies that appeal to men have been supported by Democrats. And when you do, it should include sources to support the premise and any factual claims. (Rule D). Finally, you'd have to remove all your personal opinion from it. (Rule B)\n\nIf you feel all that would pull it too far away from your intention, you might try posting it in one of the other political subreddits, like /r/moderatepolitics.\n\nLet me know how you want to move forward.", "label": 0}
{"text": "Nevermind, any question that can lead to a more factual answer I can already find the answer to it myself. Doing that slightly led me to the answer I was looking for initially but like you said the question I asked was akin to reading minds. Thanks for the initial fast response though!", "label": 0}
{"text": "Good deal. I'm glad you made some progress.", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
{"text": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "label": 0}
