{"text": "She knew and did nothing. Worse than nothing, she actively shut down people who reported the abuse (the cousin) and kept the hallways clear so the abuse could be kept hidden (per multiple family members). She aided and abetted the abuse.", "label": 0}
{"text": "Design a better mouse trap. ", "label": 0}
{"text": "Being Hispanic is about ethnicity not skin color.", "label": 0}
{"text": "Hahaha legit, I was picturing someone showing up on some doorstep, bleeding out, and someone helps them up and then they get tackled by law enforcement. You're probably right about the Wikipedia article, my guess is it's more along the line of 'aiding and abetting', like helping them with their illegal deeds, rather than just helping someone. I know some places even have laws stating that it's illegal to *not* help someone in fatal need, like letting them drown when you can swim or letting them choke and you just stand there. Instead of, say, getting rid of a murder weapon or arson tools to help them out kind of thing.  ", "label": 0}
{"text": "That’s a federal crime", "label": 0}
{"text": "Same here, but in 2013. \n\nIt was a history project where we were supposed to write texts from famous figures during a battle and send them to our teacher at the time they would have said that. 15% of our grade was how accurately we timed our texts.\n\nI got an 85% on that project because my time stamped printout got a zero for that section.", "label": 0}
{"text": "You’ll be replaced. ", "label": 0}
{"text": "Terrorists love 'em it seems", "label": 0}
{"text": "Prosecution needs to prove that a reasonable person would've believed ballots would be in there, which any reasonable person would know, considering it's election time. Not too hard to prove.\n\nThese types of people are unhinged. Bet you he googled something like \"Where do the most Democrats vote in Arizona\"", "label": 0}
{"text": "Because it's obvious the only reason people care about this \"injustice\" is because it's rich white guys suffering from the consequences of their actions. And we can't have that in America.", "label": 0}
{"text": "It almost seems like putting the cost on people to have smart phones rather than paying for their own computers/ipads/etc.", "label": 0}
{"text": "I have an iPhone 7 and can no longer use the Ticketmaster app because it now requires iOS 16, which is not compatible with iPhone 7.\n\nMy phone still works perfectly fine. I’ve had it for 7 years now.", "label": 0}
{"text": "Either way, fucking with the post office is federal offenses", "label": 0}
{"text": "The mail is fucked where I live. Senior citizens who cant figure out on-line bill paying are getting royally screwed over", "label": 0}
{"text": "Superstition about death in 3s is quite common among different cultures too.\n\n\nThe indigenous peoples where I am believe that as well, and I've experienced the phenomenon twice in my life", "label": 0}
{"text": "Am incredible amount of rape and domestic violence.", "label": 0}
{"text": "Dahmer and Bundy were serial killers that impacted communities and multiple families with their gruesome killings.", "label": 0}
{"text": "A major issue for tourists from Canada, where data roaming is very expensive.\n\nOn a trip to San Diego two years ago I insisted that a restaurant provide me a paper menu as I was not willing to spend $13 to turn on my data. I waited 10 minutes for them to bring me a menu but they eventually did after I followed up. I know they weren’t happy but that’s not my problem.", "label": 0}
{"text": "The school offered a laptop, she wasn't excluded, this was her mom's choice for mental health, not financial reasons.", "label": 0}
{"text": "My kid just got her first phone when she started high school two years ago. She had access to an iPad at home and could talk to friends but didn’t have unlimited, unsupervised access all the time. When she was at school she could call me from the office anytime she needed me. \n\nI tried hard not to make her feel left out with the access she did have but I tried to limit my own phone usage while out of the house. If I’m telling her she doesn’t need to be walking around staring at a phone, I needed to do the same. \n\nHer ability to be in the moment without having her eyeballs glued to a phone really shows when she’s amongst her peers. She also takes care of that phone like it’s the Crown Jewels.", "label": 0}
{"text": "So it can show the Taliban then?", "label": 0}
{"text": "Not a MAGA dude lmao", "label": 0}
{"text": "> Not an American, so maybe I'm missing something, but why wouldn't you just do both trials at the same time? Why would you have to wait until one sentence is over before charging them with the next crime?\n\n\nThey can do both at the same time - they usually do.", "label": 0}
{"text": "The profitable companies will survive. The Uber talented will write their own ticket. The other 99% will fall in line or will lose their positions. ", "label": 0}
{"text": "They broke the bridge, they should pay for the new one.", "label": 0}
{"text": "Until tech took over. the richest people in the world were usually shipping magnates or their heirs.  So $100 million is a lot of money but maybe  not to them.  I don't think taxpayers should have to pay for what they broke.  And for what I remember, the cost to fix this is more than $100 million.", "label": 0}
{"text": "Oh, the fuckery is starting early this year, too", "label": 0}
{"text": "And self serve gas is inconvenient.", "label": 0}
{"text": "They were seditious, not treasonous.", "label": 0}
{"text": "You can always cheer yourself up thinking you will drown before you boil :)", "label": 0}
{"text": "Are the service members who were court-martialed under that former policy now getting honorable discharges in place of the dishonorable ones they had before? Or is this recent change only for Clinton-era discharges?", "label": 0}
{"text": "How can you say killers won't kill again. It's a pretty huge leap to be confident you know they aren't a threat. So many unknowns.", "label": 0}
{"text": "Trump back at it again", "label": 0}
{"text": "Idk why I got downvoted, honest worrisome question. Trumplicans think any vote besides there Führer is fucked", "label": 0}
{"text": "Good call its a simile", "label": 0}
{"text": "Being abused should not be an excuse of murder. They had the choice to leave. Instead they planned the murders. \n\nIt’s disgusting that in 40 years our country has turned around to sympathize with brutal killers.", "label": 0}
{"text": "I'd like to invite you and your partner to a dinner...at McDonald's.\n\nThe movie didn't take into account presidential support in the wars.", "label": 0}
{"text": "He also added “I swear! Pinky promise!”", "label": 0}
{"text": "One piece of evidence I saw recently was the picture of his father in a family picture with his hand in one of the boys' crotch. If they did that publicly..\n\nThere is more evidence but they haven't shown much.", "label": 0}
{"text": "Well this time he promised pardons... So expect the worst unless the turnout is somehow so much better than what polls are suggesting... And his loss is so embarrassingly bad, even in swing states, that he can't challenge anywhere close to enough to flip the Electoral College.\n\n\nThat said... He lost by 8 million in the popular, and Biden had a decent Electoral College victory... And January 6th insurrection occurred despite that...\n\n\nSo yes... Expect the worst.", "label": 0}
{"text": "It’s like home Internet 20-25 years ago.\n\nWe were late getting home Internet in my house, and it was getting to the point that I was getting left out of social connections and even homework assignments. I had a teacher in 2001 that just assumed everyone had Internet at home and could do the assignment that required visiting a certain website, and I had to explain that I couldn’t do the assignment because of a lack of Internet access. It was incredibly embarrassing. (We weren’t even poor, Internet was just something my parents didn’t think was necessary at the time)", "label": 0}
{"text": "are the schools devices just short on ram and cpu?", "label": 0}
{"text": ">this was pushed forward as some kind of tolerance or compromise\n\nWasn't it? \n\nI get that it was still wrong, but you know that gay people had been banned from serving all along, right?", "label": 0}
{"text": "Who controls shipping data and stuff? Gotta wonder bout all these breaches and when someone is going to be held accountable", "label": 0}
{"text": "Please read the article. This is just one of the claims being made.\n\nFrom the 2nd paragraph of the article:\n\n“The settlement does not cover any damages for rebuilding the bridge, officials said in a news release announcing the agreement. That construction project could cost close to $2 billion. The state of Maryland has filed its own claim seeking those damages, among others.”", "label": 0}
{"text": "The postal service doesn’t fuck around about crime involving the mail system.  The culprit is gonna face some hard time.", "label": 0}
{"text": "technically you don't walk into them", "label": 0}
{"text": "conspiracy theorist.", "label": 0}
{"text": "Please read the article. This is just one of the claims being made.\n\nFrom the 2nd paragraph of the article:\n\n“The settlement does not cover any damages for rebuilding the bridge, officials said in a news release announcing the agreement. That construction project could cost close to $2 billion. The state of Maryland has filed its own claim seeking those damages, among others.”", "label": 0}
{"text": "A lot of service industries are like that now.", "label": 0}
{"text": "It’s for his re-election.\n\nI don’t care if they’re released, as long as his transparency is recognized.", "label": 0}
{"text": "the left is already rigging the elections. damn.", "label": 0}
{"text": "Aren’t they already guilty? Throw his ass in jail.", "label": 0}
{"text": "If Gascon is on your side, you’re doing something wrong", "label": 0}
{"text": "No thanks, I already ate.", "label": 0}
{"text": "I understand what you are saying. Just a couple few years ago I remember a librarian at a school getting shuffled off to pasture, and the relief of the teachers. The woman had really embraced her duty to protect the books from the kids, that she trusted not at all. And how amazingly effective her replacement librarian was, at always placing just the right book in the hands of a kid who was struggling a bit and just on the edge of becoming a solid reader.. the I T thing is going to be all over the trial for a while yet. But smart phones aren't going away.", "label": 0}
{"text": "There should still probably be some distinction between trespassing in some random place and being a part of whatever that march was.\n\nOh sorry officer I just suddenly found myself in a Nazi raid on the capital and decided to follow them by accident.", "label": 0}
{"text": "These people probably incriminated themselves on Twitter or Truth social.", "label": 0}
{"text": "But the demand for full serve is so low that almost no one offers it. \n\nI remember as a kid in the '90s it was getting rarer and rarer.", "label": 0}
{"text": "The world has changed. Buck up and deal with it", "label": 0}
{"text": "It wasn't a lack of demand. Gas stations just stopped doing it for cost savings if you read history of it. ", "label": 0}
{"text": "A local upstate New York city councilman and Republican candidate for the NYS Assembly just got caught on camera possibly stealing mail from a mailbox and then placing his own flier in that box. \n\nThe camera is a ring doorbell on the same wall as the alleged mailbox, so it remains to be seen if the political flyer was actually in a mailbox. Regardless, its a hilariously terrible look for a sitting officeholder and prospective state legislator.", "label": 0}
{"text": "This is just the cleanup cost", "label": 0}
{"text": "They are generally middle of the line when they are purchased but then expected to last for far longer than they should be.  \n\nThey are also shared by many students so you have to log into everything every time.  It’s the booting time and logging in time that takes forever.  \n\nAlso, a 36 student long line to get to 1 (maybe 2?) Chromebook cart takes significant time.  Then, the teacher can either stand there to make sure each and every kid actually plugs in the damn thing when they are put back, you can take their own time after the class to sort it out. And, if you want to “follow the rules” and get each computer in the correct slot?  As well as plugged in? Gaah!!!!    Add to that that you are supposed to make each kid sign them in and out every single time.  That works if you have a couple kids getting one.  But 36?   It’s ridiculous.", "label": 0}
{"text": "Could just be satellite or drone imagery, knowing the start and destination doesn't let you hit a target with a couple hundred feet accuracy. \n\nAlso, basic shipping data is pretty open information you can look it up yourself like flightradar does for planes.", "label": 0}
{"text": "The market responds to demand.  Gas stations stopped doing it because there wasn't enough demand at a price that people were willing to pay. \n\nPlenty of people will say they want full service gas, but very few will be willing to pay 15 cents a gallon extra for it.", "label": 0}
{"text": "So here’s the stage in history where they begin to destroy entire tranches of votes, bounce it to the election commission, and the popular vote will be negated for a facist… again.", "label": 0}
{"text": "Conservatives: We don't want to ban abortions. We just think the matter should be returned to the states to decide.\n\n\nStates: OK. *passes a slew of abortion protections*\n\n\nConservatives: No, not like that!", "label": 0}
{"text": "I'm gonna be devastated learning how long it could have taken for her to die. I hope she had a stroke and it ended quickly.", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "Multiple actually. \n\nTampering with mailbox\nTampering with mail (one count for each damaged piece)\nTampering with election materials (one count for each)\n\nWhoever did this is completely fucked if caught.", "label": 0}
{"text": "i would guess if this dude was running to be a state senator he probably had a decently high job and will not be back as a new recruit or base security.  \n\nif i had to guess, i would say he probably has some specialized knowledge regarding the black sea or the arabian sea.", "label": 0}
{"text": ">Number 4 will *shock* you!”\n\nThat's b3cause it's an electric chair :x", "label": 0}
{"text": "Depends on the federal prison.", "label": 0}
{"text": "Read the article", "label": 0}
{"text": "You think that Gascon made this decision arbitrarily? This motion was in process long before the Menendez story came back into the public lexicon this month.", "label": 0}
{"text": "Flight information? It's not, it's delayed data too. It got killed on Twitter because Elon didn't like someone posting about his plane. It's a political topic not a safety one.", "label": 0}
{"text": "How did Republicans manage gerrymandering if they didn't have control?", "label": 0}
{"text": "Republicans not understanding doesn't make it nationalization. \n\nAnd replacing Elon or forcing some sort of change in management is very, very different from nationalization. Once assets and operations are seized by the government, that's a point of no return in the modern world. \n\nI don't have the data in front of me but a lot of the WW1 and WW2 wasn't full of permanent asset seizure and nationalization, it was a temporary (albeit forced) mandate to manufacture critical goods. The ones that were seized were largely due to labor disputes between management and workers that threatened output, not management breaking laws. \n\nAnd I would argue that people are not clamoring to build factories in China. People are clamoring for Chinese companies to ramp production in China, but no one at Ford is trying to build a Ford plant in China. If you look at the Foreign Direct Investment metrics - we invested $120 billion into China last year. We did $4 TRILLION into the EU. \n\nAnd as an extension, most of the examples of nationalization in the West are directly tied to boots-on-the-ground, global warfare or when **collapse** of the company the company is going to hurt the economy. No one does it because the CEO broke a law.", "label": 0}
{"text": "It's baffling to me that people still don't understand that this election is going to be challenged at the county, state and federal level.\n\nDonald Trump will be the next President not because he won but because Jan 6 was a hasty try to Install Trump and they've spent 4 years figuring out how to do it legally", "label": 0}
{"text": "It's very easy, kick him out and give the company to whoever the fuck is actually running it.", "label": 0}
{"text": "Phew, OP struck a nerve in your little bitch ass.", "label": 0}
{"text": "Yea that doesn't fly here. If everything had gone right that day, Baldwin would have taken that gun, loaded with a blank, pointed it directly at the camera/camera operator and pulled the trigger.\n\nHe was quite literally supposed to point the gun at someone. That's a perfectly normal thing to do when making a film. And it's the reason they have an armorer to make sure it is safe. That armorer was grossly negligent.", "label": 0}
{"text": ">Just because we haven't had systemic election fraud in the past doesn't mean the reds won't try systemic fraud in every swing state this time around.\n\nIt would be an interesting side effect of the ridiculous false claims of election fraud - a very large number of complete morons become convinced that it's easy to do, try it for themselves and inevitably get caught.", "label": 0}
{"text": "Which makes more of a Logan act situation since he is a citizen of the US", "label": 0}
{"text": ">. Both Elon and Trump will end up dead or in prison in the next couple of years. \n\n&#x200B;\n\nwhy do you say that? You mean Putin kills them?", "label": 0}
{"text": "Communication is the first step to unity and peace.", "label": 0}
{"text": "Am I allowed to make a prediction? I agree there are likely some on both sides hence my percentages. It is just ironic that the right says the left does all the fraud when really the majority comes from the right. They create hysteria out of nothing", "label": 0}
{"text": "Potentially he should be charged with corruption, his assets nationalized or transfer to other individuals", "label": 0}
{"text": "Republicans are Republicanning. Story at 11.", "label": 0}
{"text": "It's happened pretty much every election after 2016.", "label": 0}
{"text": "Everyone assuming it was the right doing this gonna get real quiet if it turns out it was a bunch of democrats trying to ensure trump loses. Could be the right trying to sow doubt in our elections, could be the left trying to “protect democracy”(oh the irony). it could be a lot of things. How about we wait and let the investigation go ahead and figure it out instead of all of us jumping to conclusions.", "label": 0}
{"text": "Even one order of magnitude would mean Putin is a trillionaire, which is unlikely.\n\nMaybe worth more than Musk, but not magnitudes.", "label": 0}
{"text": "Dried, at least that's how it was when I worked there.", "label": 0}
{"text": "\"Israeli solider murdered during mission, somehow 131 other people died too\"", "label": 0}
{"text": "Gaslighting 101. Create the problems you claim exist and then simply stop doing it and then claim victory over said problems. \nTrump's been grifting like this his whole life.", "label": 0}
{"text": "String this guy up already.", "label": 0}
{"text": "It goes all the way up to Russia. People need to realize this.", "label": 0}
{"text": "Excuse me what the fuck? How is he knee deep in federal contracts? Full blown traitors just walking around in broad daylight these days. I think Putin had more money to share than anyone ever knew.", "label": 0}
{"text": "The US is israel's biggest supporter ... they condemn the news and give them all the weapons.. I didn't see any sanctions or repercussions .. heck, Netanyahu was celebrated in Congress more than your presidents. Oh, the ICC, ICJ, and international law means nothing now .. cuz israel is the US biggest base in the Middle East. \nAlso, how many civilians were killed in iraq? And for what? Oh, and when you knew it was all fake reports .. what did you do? \nSorry if I sound so rude, man, but facts are facts, and people here don't argue .. they just downvote", "label": 0}
{"text": "If you are sending 100 tons to orbit in a way that’s difficult to differentiate from an ICBM it would be completely NEGLIGENT not to inform an egomaniacal warmonger of how great you think he is and how Russian astronauts will always be welcome.  How this is news is only because the left is running a smear campaign ahead of the election.  Funny how people here fell for it.", "label": 0}
{"text": "What kind of an idiot would risk catching voting fraud charges for someone who has already made 1600 people ruin their own lifes for his lies? 1 million Americans died on his watch as he tried to obstruct efforts to limit the loss of life just to protect his fragile ego. I am so tired of mainstream media giving him a platform so he can use more people like expendable pawns for his schemes.\n\n\nDon't let the polls or attempts to intimidate you discourage you, it is the votes that count, not the polls or the tricks. Keep this repugnant living caricature of the seven deadly sins out of the White House.", "label": 0}
{"text": "Sounds like it very well could be a false flag operation but it’s still early to have any emotional reaction to it.  Stand by for more.  \n\nJust need a few of these types of events to justify the Republican narrative that elections are easily manipulated.", "label": 0}
{"text": "sure, you're technically right, but what exactly are you supposed to do if you're also meant to fire the gun in the first place?\n\nAlso, if the issue is charging him extra because he's \"a producer\"...i just don't understand this take. Like the entire point of hiring a vendor to handle the weapons is that they're meant to take on the responsibility cause assumedly, producers aren't trained armorers. Alec being a producer has no bearing in this situation.", "label": 0}
{"text": "He bought twitter around two years ago didn't he?", "label": 0}
{"text": "Really? I assumed everything was frozen. That would be a good advertising opportunity.", "label": 0}
{"text": "Every. single. time.", "label": 0}
{"text": "Someone apparently filled out a lot of the forms using the same handwriting.\n\n>When reviewing the personal information, identification and signatures listed on the forms, election officials found inaccurate information, signatures that did not match the one that had for the voter on file, and [forms seemingly completed by the same individual with the same handwriting.](https://www.nbcnews.com/politics/2024-election/fraudulent-voter-registration-lancaster-county-pennsylvania-rcna177322)", "label": 0}
{"text": "Because you either sign on the dotted line promising you'll never do it again under penalty of spending the rest of your life, however long that may be, in the deepest darkest hole the government can find OR you spend the rest of your life in the deepest darkest hole the government can find.", "label": 0}
{"text": "The charges were dismissed with prejudice.  Meaning they can't be refilled.  This isn't new news to people that live in New Mexico.", "label": 0}
{"text": "cant wait for all the opeds from the \"leaders of the opposition\" just like in 2017", "label": 0}
{"text": "It’s not a question of if they could be, they are. America needs to wake up and directly address this it is huge issue", "label": 0}
{"text": "In SA, they call it a brai", "label": 0}
{"text": "They going back to this Well ?🪣", "label": 0}
{"text": "I wouldn’t be shocked if it weren’t people trying to game Elon’s voter registration raffle.", "label": 0}
{"text": "I don't. Don't  melodies directors have multiple cuts and takes that are spliced together to make a coherent scene? Or did you think they shot the entire movie in one take?\n\n And yes, actors should go through training before handling a live firearm. Like am I crazy? I don't even understand how that's a question.", "label": 0}
{"text": "haha..no.", "label": 0}
{"text": "The Iowa State Sec just pulled something like this as well. “Found” 2000 non-citizens who register to vote or attempted to vote. Won’t release the audit details to the press", "label": 0}
{"text": "It is. I’m in Illinois and my home town they said if you see people walking towards mail boxes looking suspicious to report them.", "label": 0}
{"text": "Oh shit hey Russia can you fuck off and mind your own business. We don't anything to do with you.", "label": 0}
{"text": "While I would wonder if this is tied into trying to muddy the waters I think this is more likely linked to Elon and other efforts to pay people to sign up to vote and enter his \"lottery\". People do a lot of stupid stuff for money. People make fake accounts on doordash to get referral bonuses and fake accounts on fast food to get free stuff and money. That is way more common and this sort of reeks of someone trying to scam some sweet probably illegal elon money than trying to muddy the waters.", "label": 0}
{"text": "O of course its Gascon.  He fled Norcal for Socal after backing the initiatives that led to car breakins being classified as misdemeanors.  Which of course also meant the police didn't give a shit about them, and now its kind of expected to see lines of broken windows of cars parked on streets.  Apparently he was a driving force in just not prosecuting most misdemeanors as well.", "label": 0}
{"text": "I am pointing out that there are a number of issues around this case and I recognize that if it was a random extra that had pulled the trigger we would not be having this conversation, they would be serving their sentence. The armorer is serving their sentence despite the prosecutorial misconduct.\n\nWhy are you enabling the two tiered justice system?", "label": 0}
{"text": "Here's a paywalled version of original WPost article: [https://archive.ph/IYybm](https://archive.ph/IYybm)", "label": 0}
{"text": "Just fucking vote anyways. I'm sick of the this defeatist attitude. The GOP can pull a lot of bullshit in low voter turnout elections. \n\nIf everyone else votes for Harris **as a bloc** it will be much more difficult for them to rig the election. Split ballots and protest votes just add to the chaos. Vote for Harris and keep Trump out of office. \n\nStop fucking treating this like a foregone conclusion. It's not.", "label": 0}
{"text": "Legibility, I would think.", "label": 0}
{"text": "And kakocracy.", "label": 0}
{"text": "Has there ever been a such an organized effort of ballot fraud? 2500 is a lot! There is a group behind this and that’s pretty concerning.", "label": 0}
{"text": "A lot of people are also going to prison for schemes that were created solely to cast doubt on the election and delay certification", "label": 0}
{"text": "Off to YouTube I go...", "label": 0}
{"text": "Fun fact- the railroads used to be nationalized.  We had better maintenance back then.  Now trains are derailing all the time.", "label": 0}
{"text": "yes, when he said \"he might go to jail of kamala wins\" he's definitely 100% alluding to the fact that he has been committing serious crimes against the USA", "label": 0}
{"text": "Dude isn’t an elected official or govt employee? Seems like an easy concept to you ? \n\nIf you work in the government and asked this question- no wonder we are where we are.", "label": 0}
{"text": "Last election they were coming up with feelings and guesses. If they have some kind of video showing how the “test” worked, they would try to say that is proof that the other side absolutely did it on a huge scale.", "label": 0}
{"text": "They'd just bomb you with drones.", "label": 0}
{"text": "That prosecutor just has a vendetta and trying to get famous and start a political career.", "label": 0}
{"text": "There is a mechanism for certain situations.  I think it's article II that says something to the effect of in the event of the electoral college failing to elect a president the house of representative votes in a president with each state getting only one vote rather than each representative getting one vote. That's a very paraphrased abridged version.", "label": 0}
{"text": "Agree with most of what you wrote (though I think you're wrong on some of the China aspects).  There is no reason to fully nationalize SpaceX. We only need to oust Elon.", "label": 0}
{"text": "This is without a doubt facilitated by republicans.. let it play out. The story likely ends here or when some Republican led conspiracy to make the election seem fraudulent unravels.", "label": 0}
{"text": "add traitor to the list", "label": 0}
{"text": "Yes, the famously left-wing WSJ, owned by Rupert Murdoch, published this story because they love \"the left\" so much.", "label": 0}
{"text": "On my last visit to Tokyo, one of my kids really wanted us to do McDonald's because he thought it would be neat to do it in Japan. I was not wanting to because McDonald's in many many places around the world really has been the same, and not great. \n\nThe one I went to in Tokyo was incredible. The chicken sandwich was like a real chicken sandwich and not just separated chicken product. The fries were incredible, and it was all really good. Except the Japanese extra large was smaller than an American small", "label": 0}
{"text": "Are you talking about Trump?", "label": 0}
{"text": "In Ohio one person has submitted 16k challenges so far.", "label": 0}
{"text": "He loves feeling important, could not help himself", "label": 0}
{"text": "Hundred percent there’s going to be tons of maga people busted. 2020 there were a lot that said they were doing it because the democrats were doing it.", "label": 0}
{"text": "look up what adolescent means", "label": 0}
{"text": "Nope, this is not about money, me thinks.", "label": 0}
{"text": "My statement accounts for this.  If the House cannot elect a president (granted that would never happen in our current system) then we're in unmarked territory", "label": 0}
{"text": "They're trying to cast doubt. It's a major part of their contingency plan if they lose.", "label": 0}
{"text": "!RemindMe! 14 days", "label": 0}
{"text": "Allot harder than it seems. Space X dominates the US Military Space Lift capability. This is extremely dangerous.", "label": 0}
{"text": "The same person wrote dozens of applications.", "label": 0}
{"text": "At this point, there are two most logical explanations for Musk’s behavior, one more disturbing than the next.\n\n1. Russia has blackmail material; something or somethings that could out him away for decades and end his public life. Men like Elon are easy to entrap with things like underage girls or overt crimes. It likely happened earlier in his career. Think Epstein or similar, which was probably a state sponsored program that continued to exert leverage today on an untold number of powerful people.\n\n2. Musk things the time is ripe to align with authoritarians and make a run to dominate the planet. If you lack scruples and morals and see the opportunity to treat the world like a Risk game, maybe that’s the play.\n\nEither way, it’s grim.", "label": 0}
{"text": "These ballots were intercepted from the mail before the voters received them, so it didn’t have anything to do with where you choose to drop them off.  \n\nI do agree with you fully though.  We use the drop box at our YMCA.  They received my ballot the day after I dropped it off.  They counted it ~5 days later.  I like the system we have here, and I’m not happy that the maga trolls in mesa county are trying to ruin it.", "label": 0}
{"text": "The situation is a becoming more complicated. Ray D'Agostino (the person making this claims) is a known trumper with wild claims about election fraud in the past. The Secretary of the Commonwealth, Al Schmidt, has already told Ray to fuck off for hampering voter registration, specifically among college students voting. I would not be surprised if Ray and his cronies are the ones denying registration but also behind the registration fraud. I was pissed when this treasonous, insurrectionist piss-stain was allowed to oversee out elections.", "label": 0}
{"text": "Why isn’t there a Republican and a Democrat both watching?", "label": 0}
{"text": "X is a Russian cyberwarfare tool.", "label": 0}
{"text": "The vast majority of prisons are not private.", "label": 0}
{"text": "Or just go look at the election fraud that happened in 2020.  I'll wait.", "label": 0}
{"text": "Firefly Aerospace was majority owned by a Ukrainian investor. At the start of the Ukrainian/Russian war we was compelled to sell his stake. The fear being he could leak secrets and designs for better rockets (which could be used for weapons) to the Russians. [It was a long and drawn out affair which he was ultimately exonerated for.](https://arstechnica.com/space/2024/07/feds-who-forced-ukrainian-investor-to-sell-rocket-company-backtrack-years-later/)\n\nMeanwhile, FUCKING MUSK can just chat with Putin all day and there is no fucking inquiry here? Why the fuck isn't SpaceX under this kind of scrutiny?", "label": 0}
{"text": "Hi Trans I'm Dad!", "label": 0}
{"text": "“In some cases, applications contained correct personal identification information, such as the correct address, correct phone number, date of birth, driver’s license number and Social Security number — but the individuals listed on the applications informed detectives that they did not request the form,” Adams said. “They did not complete the form and verified that the signature on the form was not theirs.”", "label": 0}
{"text": "Sir this is reddit. We barely read the articles linked. I assume at this point it was aliens.", "label": 0}
{"text": "We’re fighting a proxy war in Ukraine, drip-feeding weapons to ensure the depletion of Russian resources. Just like we finally bankrupted them in the early 1990s. Meanwhile they’re attacking the minds of our citizens through social media, causing distrust and chaos in our government which will leave the most powerful military in history without clear direction. It’s time we wake the fuck up and steamroll these paper tigers.", "label": 0}
{"text": "Wait for what??", "label": 0}
{"text": "The person they really need to be going after is the PoS AD that took a plea deal and ratted on everyone while changing his story multiple times", "label": 0}
{"text": "They were all signed in and obnoxious sharpie marker", "label": 0}
{"text": "It was in the class select screen.", "label": 0}
{"text": " You want to change how an industry uses firearms so you can feel better? How many times has a gun been used in a scene vs how many times was someone injured or killed?\n\nWe aren't agreeing on this but I will come back and congratulate you when they see your comments and adopt them.", "label": 0}
{"text": "It's like an inept Tony Stark making deals with Red Skull, Baron Zemo, and Doctor Doom.  \"Global leaders\" is a hell of a nice way of saying authoritarian warmongerers.", "label": 0}
{"text": "You're so full of shit I can smell you from here.", "label": 0}
{"text": "It isn’t just Trump that gets away with flagrant violations of the law. It is anyone with enough power and money to \n\nThe rule of law is pretty much dead in the US.  \n\nI am pretty sure Putin has some compromising materials on Musk. Maybe the Diddy parties, maybe something else.  But what does it matter? Trump and Musk could both put YouTube videos of them raping babies and nothing would happen. Hell, Trumps ratings would probably go up.", "label": 0}
{"text": "And a lot of that is through X", "label": 0}
{"text": "Don't forget Starlink has been found to be used by Russia in some situations last I checked.", "label": 0}
{"text": "Or is it good things happen to bad people", "label": 0}
{"text": "You can't. They'll only respond once they're personally affected and that won't happen until the rest of us are affected because political apathy is a privileged position.", "label": 0}
{"text": "The guy who supports Trump who is also buddy with Putin is regularly talking to Putin? I’m shocked😱", "label": 0}
{"text": "Great intel", "label": 0}
{"text": "To be fair both sides do this", "label": 0}
{"text": "It is.  These were flagged right away.", "label": 0}
{"text": "More MAGA lawbreaking to “prove” the law is being broken?", "label": 0}
{"text": "No this is by design. This is the Republicans attempt to sow mistrust in our elections. It doesn't matter if they made it look like a dem did it or a Republican did not t, all they are looking for is to get people to not trust elections. That's all that is needed to end our republic. If you dot have trust then you don't have elections. Buckle up. Shits about to get real scary.", "label": 0}
{"text": "No no I'm with you. I just saw a cop drama on TV where they actually had guns and pointed them at each other! I'm calling the FBI as we speak, they need to know they aren't following proper gun safety procedures. What if someone got hurt???", "label": 0}
{"text": "Oops I accidentally violated more us trade laws than I have fingers and toes", "label": 0}
{"text": "Because it’s the hypocrisy party.", "label": 0}
{"text": "For them to look up who committed election fraud in 2020, Democrats or Republicans.", "label": 0}
{"text": "And a lot of those same people will be pardoned the day trump enters office if he wins.", "label": 0}
{"text": "It’ll be nice to wake up one day and see this shitbird get his justice", "label": 0}
{"text": "Lancaster County PA... This is probably having to do with the Republican effort to get the Amish community registered to vote. This can present problems due to the way the Amish live.", "label": 0}
{"text": "Kids definitely do that. There was a story in the news back in September of an 8 year old girl driving her mother’s car 13 miles to Target.", "label": 0}
{"text": "Probably not in this case.  Especially given where it was I know my first thought was \"A homeless crazy person probably set that fire\"", "label": 0}
{"text": ">I don't believe none of this shit, certainly not taking the guy he fired at his word when it benefits the blue team.\n\nSee? You just disengaged your brain entirely. You automatically assume he must be lying on behalf of the Democratic Party. No thinking whatsoever, you just jump straight to conspiracy theory. And John Kelly wasn't even fired; he resigned.\n\nLike I said: mindless. Cult behavior.\n\nDo you think maybe there's something to the fact that the vast majority of the people Trump appointed to his administration have come out against him? They weren't all fired. Some of them served until the very end. You just hand-wave all of that away? You think it's no biggie? It's unprecedented in the history of this country for appointees and staff to come out like this against a former president. \n\nIf you were interviewing someone for a job and pretty much all of that person's references told you in no uncertain terms to never hire that person, would you assume those people have an axe to grind? Or would you think maybe the person who applied for the job probably isn't the best person?", "label": 0}
{"text": "I'm not, just trying to get clarification on the logistics.", "label": 0}
{"text": "Have a step-brother who can literally only say he protected Subs. Can't even say where or when or anything about it. They would literally be on standby until a sub needed to come in for some reason or another, then they would be stripped of outside communications days before and then moved to the location to provide security.", "label": 0}
{"text": "Poisoned. By our enemies.", "label": 0}
{"text": "*were not going back*", "label": 0}
{"text": "Except even attempted voter fraud is punishable. If they did a 'test' and recorded it, they would be admitting they knowingly broke the law. Not that the Republican party cares about that anymore... they nominated a convicted felon/rapist.", "label": 0}
{"text": "These are registrations not votes.", "label": 0}
{"text": "Sure, it’s been going on for years and now the article comes out, lol", "label": 0}
{"text": "There is a lot of accusations lately from fairly good sources that a lot of these polls are being directly manipulated and are illegitimate. Even more than normal polling!b", "label": 0}
{"text": "Sure, he gets the presumption of innocence.. which is why criminal liability depends on what the prosecution can prove. It was literally my second sentence. I'm just saying it's not that far of a stretch to say he should have known there were ballots in the mailbox during an election.", "label": 0}
{"text": "Registrations not votes.  Try reading.", "label": 0}
{"text": ">The business magnate Elon Musk initiated an acquisition of American social media company Twitter, Inc. on April 14, 2022, and concluded it on October 27, 2022. Musk\n\nSooooo when Elon bought Twitter and made it into a right wing shit hole laden with bots.   Okay.  I see.", "label": 0}
{"text": "Elon's mother recently tweeted in reply to a parody Liam Nesson account that her son has development disorders too.\n\n[https://www.reddit.com/r/facepalm/comments/1fypy2f/elon\\_musks\\_mom\\_is\\_just\\_as\\_stupid\\_as\\_her\\_son\\_she/](https://www.reddit.com/r/facepalm/comments/1fypy2f/elon_musks_mom_is_just_as_stupid_as_her_son_she/)", "label": 0}
{"text": "Imagine thinking nationalizing industries would have a positive outcome given it's history.", "label": 0}
{"text": "\"Clear evidence of collusion and election tampering between Musk, Trump, and Putin.\"\n\nRepublicans: Naaah", "label": 0}
{"text": "Lancaster is republican. They also said the ballots were not for one party, but for both.", "label": 0}
{"text": "This is not a serious country anymore", "label": 0}
{"text": "I accidentally had my financial lobe removed instead.", "label": 0}
{"text": "ikr, it's thatguy's own fault ffs", "label": 0}
{"text": "Got money? Right, all other questions are irrelevant then...", "label": 0}
{"text": "clarifying them for who? you? why?\n\nthe people who have and give these title know what they mean and the people in charge of finding out who was responsible here also know.\n\nnot everything needs to be understood by the layman", "label": 0}
{"text": "let alone their government!", "label": 0}
{"text": "The new House starts January 3. It should have had time to elect a speaker by then...", "label": 0}
{"text": "Ok well next thing you'll tell me people are shooting up campaign offices", "label": 0}
{"text": "Personally, if their whole system is app reliant, I would rather them just leave tablets at our tables to order from then. Same idea without the customer data harvesting via apps.", "label": 0}
{"text": "I'm going to go out on a limb and guess voter information was leaked by a republican to some friends. They found out names who had not registered to vote and submitted documents under those names. They intend on using the registrant information to submit fake ballots.", "label": 0}
{"text": "I wonder how much information Trump and Musk have passed on to their boss????", "label": 0}
{"text": "It's almost as if Putin has been spending all his time talking on the phone with either Elon or Trump.", "label": 0}
{"text": "That's less than 1% of registrations and 0.03% of total voters . That's not really a lot.", "label": 0}
{"text": "“Evil deeds will not be less cowardly because they are spoken in the shadows.”\n\nbtw lol", "label": 0}
{"text": "I'm telling you. Putin has some actual dirt on him and trump. I hope it comes out in my lifetime.", "label": 0}
{"text": "We are talking about a man who suggested nuclear strikes to deal with bad weather, so yes, he probably did think that", "label": 0}
{"text": "Something about that sentence is redundant ", "label": 0}
{"text": "“his shortcut”\n\n?", "label": 0}
{"text": "You mean if the studio followed procedures. Part of the movie industry involves intentionally breaking firearms rules with mock weapons. They have processes in place to mitigate those issues. Those were not followed", "label": 0}
{"text": "Fraudulent registrations are still election fraud.", "label": 0}
{"text": "Or mention the fact that the process used to \"catch\" these alleged individuals is the same standard check for voter eligibility which has always been done on every voter eligibility application, thereby demonstrating that there is no simple way for non-citizens to register to vote, which is what sane people have been saying this entire time.", "label": 0}
{"text": "Immediately cut off govt subsidies to his corporations.", "label": 0}
{"text": "For an organized effort? Never heard of something that large.", "label": 0}
{"text": "Aren't there reports of Putin having some terrible illness? Guy is probably going to croak in the next 10 years and leave Russia a destitute alienated ruin.", "label": 0}
{"text": "Yeah it's almost like actors are expected to point guns at each other and pull the trigger on a regular basis. You're so close to the point, yet so far at the exact same time.\n\n\nIt's almost like it's someone's job to ensure guns on sets can't kill people when they're used as guns. But no no, like you say no one should ever *point a gun at another person and pull the trigger*, that definitely doesn't take place in films. So actors should only point and use Nerf guns, the audience won't mind right? Certainly not audience members like you who *never* watch movies with shooting in them.", "label": 0}
{"text": "> adolescent \n\nwhy stop at 19 then? go all the way through the mid 20s\nmake the stats even worse. \n\nThe problem is when you take out the 18-19 year olds the stats drop hard.", "label": 0}
{"text": "Afaik, you also have to change coils in the refillable vapes often and there are no standardized parts. I ended up ditching the multiple vapes I had for disposable for this very reason. You also have to manually set the wattage on those things correctly or the vape juice burns to fast / slow which effects what you're inhaling. Who knows if that changes or increases chances of having health issues.", "label": 0}
{"text": "I mean ideally, that would be great.", "label": 0}
{"text": "Reading your comment made me realize just how serious this is.\n\nI really, really hope Diddy starts talking", "label": 0}
{"text": "I can't wait for the day this moron gets locked up and deported.", "label": 0}
{"text": "We need to seize his assets and revoke his clearances immediately ", "label": 0}
{"text": "This says in 27% of burglaries someone is home. That does not mean it happens to 27% of the population. \n\nThere are roughly 270 per 100,000 people so thats less than 1%.", "label": 0}
{"text": "Probably fixated on hating someone they don't know.", "label": 0}
{"text": "Traitors are gonna traitor", "label": 0}
{"text": "going to be funny when all those who did this are republicans", "label": 0}
{"text": "Exactly well said", "label": 0}
{"text": "Elon musk is the richest man in the world apparently.", "label": 0}
{"text": "> Every woman should make her man understand our rights to our bodies\n\nWhile I agree with your main point, this probably isn't a great way of getting that point across.", "label": 0}
{"text": "This used to be much easier until the US taxed reusable vapes and juice companies damn near out of existence, leading the way for pods and disposable vapes.", "label": 0}
{"text": "It’s actually kind of impressive how stupid this defense is.", "label": 0}
{"text": "The issue with your example is having drugs in this case is just illegal. So how you got them would be difficult to prove. But you having them would be easy. \n\nA better example would be a worker in a factory that turns on a furnace. One day, the furnace is set for repairs and can’t be turned on until all workers are clear and all safe is declared. Their manager comes to them and tells them everything is all clear and they can turn the furnace on. So they do but someone was still inside and died. Is it their fault for not following up and checking it was all clear?", "label": 0}
{"text": "I somewhat disagree about it having anything to do with brand recognition. My family, friends, I also know what Target was and spent time cross-boarder shopping. People were kind of excited we had a better Walmart. Target had better products in the US than Walmart and very comparable prices. There was lots of excitement in the first couple weeks.\n\nI went shopping in it a few times and it wasn't anything like the US. Didn't carry the same clothes or really any of the same products. Shelving was almost empty with products spaced feet from each other. The prices were high for the junk they had. They never had what I was looking for anyway.", "label": 0}
{"text": "Right…\n\n“In reaction, Bremmer tweeted, “President Trump in Tokyo: ‘Kim Jong Un is smarter and would make a better President than Sleepy Joe Biden.’”[48] After he was criticized on Twitter for appearing to quote Trump falsely, Bremmer acknowledged that President Trump had not spoken as Bremmer had quoted him and suggested that the statement was facetious, calling it “objectively a completely ludicrous quote.”[48][49] President Trump used the incident to call for stronger libel laws.[50]…", "label": 0}
{"text": "Also nearby and have annual pass, and this poster is just wrong. I was just at Cafe La Bamba yesterday and no app is required.\n\nThe only thing i can think of is they wanted to mobile order which would require using the universal park app? But, as I'm sure you know, that app covers the entirety of Universal and has ride info, wait times, maps, etc...", "label": 0}
{"text": "Everyone I like can't be a Nazi.", "label": 0}
{"text": "And does ketamine therapy…I’d lose mine in an instant if the roles were reversed.", "label": 0}
{"text": "Or there is only identity theft to cast doubt on the election. You don't have to actually prove fraudulent votes to make people think it's fraudulent, just enough to say \"see, we have no idea how much fraud is going on!\"", "label": 0}
{"text": "Just a reminder that voter registration fraud is not voter fraud. These are not illegal votes, they are fraudulent registrations. No one is going to show up and vote as Mickey Mouse.", "label": 0}
{"text": "They have software now that allows them to scrape voter rolls and submit thousands of challenges with a click, inundating state election officials and wasting valuable resources delaying the process.", "label": 0}
{"text": "Hasn't been in a long time, and the people pulling it down are waving bibles and calling themselves patriots.  I'm just at my most apathetic about the future these days.  No matter who wins I think we're in trouble", "label": 0}
{"text": "My wife and I were lucky to know she was pregnant at about 5-5.5 weeks only because she usually tracks her cycle and for the most part it is fairly regular. \n\nIn our case we wanted the baby and now have a wonderful little girl, but if she didn't want the baby there is almost no way she could have gotten into her OB/GYN to terminate the pregnancy by 6 weeks. \n\nIt's disappointing that reproductive freedoms aren't codified into law nationally.", "label": 0}
{"text": "Yeah I guess snark can be misconstrued over the internet, you’re right.", "label": 0}
{"text": "Trump isn’t pardoning anyone that’s not connected.\n\nHe might have whole swaths of casss thrown out, but the pardon I expect is strictly for sale.", "label": 0}
{"text": "You actually open the linked articles?", "label": 0}
{"text": "How do we think he bought twitter? I’m not joking. Idk if it’s from Russia but dark money would not surprise me at all.", "label": 0}
{"text": "A sensible government would need to fund SpaceX and Starlink.\n\nOur government's unwillingness to properly fund NASA and its unwillingness to operate nationalized industries in the first place (muh communism!) is *the reason* SpaceX and Starlink exist and contract to the government at all.", "label": 0}
{"text": "Honestly, I can't remember the last time I was unbuckled!", "label": 0}
{"text": ">\n\n>\n\n>No, he's delusional enough that he probably thought he could make it profitable because no one tells him that he's an idiot anymore.  \n  \n  \n\nIt's 100% this. Narcissism is powerful delusion generator", "label": 0}
{"text": "It doesn't matter. He can do whatever he wants, no matter if it makes sense. He can break laws. And will win. There will be ABSOLUTELY zero consequences for him", "label": 0}
{"text": "Truly a convincing counter-argument. You raise a lot of interesting points lol.\n\nAnd I hate to point this out, but people who think the Democratic Party and Kamala Harris are \"the left\" are absolute morons. This is where I end the discussion. 🤡", "label": 0}
{"text": "As an outsider looking at the US: \n\nCan someone explain to me - like im five - how its possible that he can have any kind of security clearance? Can e assume he is being monitored 24/7?", "label": 0}
{"text": "VOTE COUNTRY OVER PARTY.\n\nDon't let these treasonous assholes plunder our county. They will leave all Americans in the dust. We can not go down this road. \n\nfuck trump fuck elon fuck putin/maga.\n\nTake friends and family to vote,  encourage people to vote for our country.", "label": 0}
{"text": "What’s funny about that is Trump walk out with a document from ‘the vault’, then allegedly sold it whatever it was to… someone.", "label": 0}
{"text": "More Republican fraud.", "label": 0}
{"text": "So confidently incorrect. Typical MAGAphant. \n\n\nHere you go: https://pmc.ncbi.nlm.nih.gov/articles/PMC2759797/#:~:text=Association%20Between%20Gun%20Possession%20and%20Gun%20Assault&text=In%20assaults%20where%20the%20victim,more%20likely%20to%20be%20shot.\n\n\n> After we adjusted for confounding factors, individuals who were in possession of a gun were 4.46 (95% confidence interval [CI] = 1.16, 17.04) times more likely to be shot in an assault than those not in possession. Individuals who were in possession of a gun were also 4.23 (95% CI = 1.19, 15.13) times more likely to be fatally shot in an assault. In assaults where the victim had at least some chance to resist, individuals who were in possession of a gun were 5.45 (95% CI = 1.01, 29.92) times more likely to be shot.\n\n\nA simple Google search could've saved you some time.", "label": 0}
{"text": "Sounds dangerous to me.", "label": 0}
{"text": "I guess I missed the news that we gave Musk a diplomatic post with the authority to negotiate on behalf of the United States:", "label": 0}
{"text": "Biden has authority to throw him in jail.  He hasn't yet tested his new immunity powers yet.  On the other hand, it was Obama roasting Trump that got us in this situation we have today.", "label": 0}
{"text": "It shouldn’t be a dehumanizing rape factory either.", "label": 0}
{"text": "He's also a US citizen so his immigration status isn't really an issue anymoe if we're being serious. You can't deport citizens.", "label": 0}
{"text": ">The implications of a secret channel of communication between Musk and Putin are enormous for western security. The Tesla tycoon is a key player in the US space programme and has a high-level security clearance. His company SpaceX launches US national security satellites, his Starlink satellite communications system is critical to the war in Ukraine, and he runs one of the world’s biggest and most influential social media platforms, X, which has provided a vehicle for Russian disinformation campaigns.\n\nSpace X needs to be Nationalized and Elon should be deported.", "label": 0}
{"text": "Musky isn’t even an American.", "label": 0}
{"text": "\\*Foreign hostile dictators", "label": 0}
{"text": "He can do whatever he wants. He could skin your entire family alive using a pair of salad tongs and mo one would bat an eye", "label": 0}
{"text": "\n\n\"On an individual level, someone killing their abuser or someone that hurt their loved ones isn't something I'd necessarily condemn. But I don't want the state to hold that power to execute who it pleases, as executions are an exercise of power by a justice system I already really don't like.\"\n\nwell said. after having seen so many cases where black men were given life in prison for armed robbery versus someone like Arthur Shawcross being released after murdering and raping two children I do not trust the American justice system. and famously Arthur went on to murder 11 more women.", "label": 0}
{"text": "They didn't have gloves small enough for his tiny hands and his hair doesn't fall out because it's not real.", "label": 0}
{"text": "Must have been a good paycheck from Alec", "label": 0}
{"text": "Thanks for the links, exactly! \n\nThere was shenanigans in Colorado, Arizona, Georgia, and I'm sure many other states. All Republican. \n\nTalk about projection.", "label": 0}
{"text": "Seems like the ultra rich can just tie up court proceedings with an army of lawyers", "label": 0}
{"text": "Their mental gymnastics, lack of impulse control, lack of self-awareness, lack of truth or facts, focus on bad faith rw media sources, and their resulting actions makes sense, at least to me, if I consider them a cult with limitless loyalty to DonOld as their \"fearless\" leader. IMO, since they're following an irrational leader, we're not dealing with rational beings right now. Perhaps a _false prophet_, to link back to your comment.", "label": 0}
{"text": "Of course he has.  </sarcasm>", "label": 0}
{"text": "Hell ya can't even get every woman to vote in their own self interest. People are messy.", "label": 0}
{"text": "Incorrect. The house elects at that point", "label": 0}
{"text": "If Trump wins he will be exporting starlink to Russia and cutting off Ukraine. Probably get a cut of rare earth mining in Ukraine too.", "label": 0}
{"text": "So this is why he wants Trump to win so bad.", "label": 0}
{"text": "I'm still not sure he can be believed. He's a child, they are known to make up shit to try and look cool", "label": 0}
{"text": "Don't forget to freeze his assets first", "label": 0}
{"text": "Ohio found and is busting some of these. It's 6. 6 people over the last *10* years. One of them isn't even alive", "label": 0}
{"text": "And that it means they were not citizens sometime in the last 24 years and doesn't account for naturalization.", "label": 0}
{"text": "No, about musk", "label": 0}
{"text": "Is the thinking here that the only way we get to January 20th without a certified election is if the House refuses/is unable to elect a speaker between January 3rd and inauguration?", "label": 0}
{"text": "When was this?", "label": 0}
{"text": "Being pedantic about this very simple thing doesn't make you correct. \n\nYou've clearly never been on set, why are you commenting on anything having to do with this?", "label": 0}
{"text": "This has Scott Presler written all over it.", "label": 0}
{"text": "> Also twitter wasn't mildly profitable. It was in the red. Now its in the MUCH deeper red.\n\nWhich is a very common place to be in, for a tech giant. Just add a few adds, sell a bit of user data. You, know. The Google way.\n\n> No, he's delusional enough that he probably thought he could make it profitable because no one tells him that he's an idiot anymore.\n\nNo, that's just a very common marketing trope, related to _any_ brand that you change. You can't call Kleenex 'Superwipes' from one day to the next. You _may_ survive it, you you know that you'll be going through a down-curve. It just depends on how you perceive timeframes.\n\nI'm not trying to defend Elon, but I refuse to believe the 'he's just gone delusional power hungry mad' meme. People are complicated, but rarely completely mad. Especially for a longer period of time.", "label": 0}
{"text": "If they have their SSN, it is something more than what you just posited.", "label": 0}
{"text": "Fair enough, might depend on where you lived. I didn't live close enough to the border for convenient cross-border shopping, so nobody cared about Target at all.", "label": 0}
{"text": "Testing the system is punishable as a felony.  Guess which side it was…\n\nhttps://apnews.com/article/cd376bd2df01a4e49c7a6300e0385f8c", "label": 0}
{"text": "How many of these complaints came from a single person?", "label": 0}
{"text": "The _assumption_ this was organized. However, reasoning includes \"questionable handwriting\" which isnt exactly strong evidence for any malfeasance.", "label": 0}
{"text": "Leaking, parts replacement (see: overcharging opportunities), recharge isn’t a big deal at all with them imo, they also are often not activated on an inhale, while most disposables are. For whatever reason the disposable companies just really made much better products in terms of convenience and just functioning properly. If they weren’t so much better I’d just do re-usable as well. Hopefully some day the re-usable people will get their act together. ", "label": 0}
{"text": "Ya hear that Diddy? R.I.P Diddler!", "label": 0}
{"text": "Practically the same person these days.", "label": 0}
{"text": "We can use what we know about who cheated in 2020 to make an educated guess on who is cheating now.", "label": 0}
{"text": "> Cyber Truck\n\nand what about that new van-looking-thing?", "label": 0}
{"text": "Come to our side sister. Make yourself a bean burrito bowl with extra queso fresco. You can even add extra salt since it’ll *still* be better for you. Low effort recipes are the best. I love budget bytes. Mexican cuisine especially is very low effort high reward.", "label": 0}
{"text": "By the time \"missing soldier\" reaches the news, it's because it's a lurid fucked-up story. People go missing from the military all the time for much more mundane reasons (desertion, especially) and it doesn't make news.\n\nIt's also pretty common for a suicidal soldier to just not show up to work on Monday, and sometimes it takes a few days for them to figure out where he decided to park his car and blow his brains out. None of that stuff makes the news. 400 soldiers did it last year, so it's too common to be boring.", "label": 0}
{"text": "He literally said if Trump loses he is going to jail. I guess we now know why he feels this way (it's not the other crimes he probably has committed as rich people aren't bound by these types of petty laws)", "label": 0}
{"text": "… and that’s a good thing!", "label": 0}
{"text": "I feel like the Republican machine is creating a scapegoat to take the fall for all of their shenanigans.\n\nTake them all down.", "label": 0}
{"text": "That's more like it, interestingly looks like it had a [rather mundane explanation too](https://www.politifact.com/factchecks/2023/aug/14/gateway-pundit/suspected-voter-registration-irregularities-in-mic/):\n\n>\"The leading internal indication was that fraud was being perpetrated against GBI Strategies by its employees to fabricate work product without conducting the work expected of them, and not in explicit pursuit of defrauding the election infrastructure of the state,\" Wimmer said.\n\nThis is something I had not even considered and it doesn't seem unreasonable that we may be seeing something similar here. It will be interesting to see what (if anything) comes of it.", "label": 0}
{"text": "Only if they can afford to pay for the pardon.  Before he left office, he was selling pardons.", "label": 0}
{"text": "> “This is a story about oligarch capture of the US,” said Fiona Hill, who was the senior director for European and Russian affairs in the Trump White House\n\nOh yeah, NOW the oligarchy we live under is a concern, before Elon everything was fine. 🙄", "label": 0}
{"text": "Basic firearm safety like not ever pointing the gun at something you don't intend to kill? Which is something every shoot with firearms violates?", "label": 0}
{"text": "I'm not even sure *what* you're calling fake news?", "label": 0}
{"text": "So you think the government will push rocketry further when SpaceX has made more progress in a decade than the rest of the world made in the better part of a century? I have a bridge to sell you", "label": 0}
{"text": "I live here. He’ll win it again this year too. When the PA Supreme Court re-drew the districts they included the southern part of neighboring York county, which is very red, in with all of Lancaster county. The only blue area is the city itself. It’s so safe that our congressman and official Trump jelly supplier, Lloyd Smucker, doesn’t even bother to come here anymore.", "label": 0}
{"text": "So the guy from South Africa, bribing voters with a million dollars clearly interfering with the election process, talks to the Russian communist leader who interfered with the last 2 elections on Trump behalf? How is this guy allowed in America. It’s so painfully obvious that he wants to run America but can’t as he was not born here so he is buying Trump and Putin is helping. He wants America to be corporation and he wants to be on its board of directors with Trump as Director. Get rid of his secretary clearance confiscate his companies and lock him up. He is clearly a traitor.", "label": 0}
{"text": "He should be deported back to Africa.", "label": 0}
{"text": "Stock comes with the right to vote on company decisions. Whatever percentage of shares you own is the percentage of votes you get.  Both Black Rock and Vanguard exercise the voting options on behalf of their customers with some third party companies involved to give the whole thing a veneer of legitimacy.\n\n\n\nOther funds do the same. It's the worst scam in market history.", "label": 0}
{"text": "I don't think it was Alec's decision whether he was going to use a real gun or not. Like, there is definitely an discussion to be had on whether movie sets should ever be using real guns or not, and the answer to that is not at all clear cut, but the fact of the matter is that movies currently do use real guns. And to ensure everyone's safety, there are specific protocols that need to be followed by multiple people on set constantly.    \n\nFor an actor, the protocol is to *not* fiddle with a gun that you have been told has been checked by professionals to be safe. Doing so just risks the actor undoing what the armorer did to make the gun safe to handle, adding more chances of accidents on set. Baldwin did what he was supposed to do. The armorer and the AD on set did not, and that is why someone died.", "label": 0}
{"text": "I understand the need for a justice system.  It's having an entity/government determining death.  I don't want to assume what country you are from.  Here in the United States we have proof that entities have carried out executions in order to save face.  Innocent people have died to protect entities.  Now people can argue philosophically about public good, scope, and all that good stuff.  On a personal level, knowing that our government has let people die because they were afraid losing power is terrifying.", "label": 0}
{"text": "Yes, but that’s because Putin’s wealth is hidden - there are articles about it", "label": 0}
{"text": "18/19 year old are adolescents, as was this killer. So it is entirely within the scope.", "label": 0}
{"text": "Personally I am not 100% certain (I mainly tinker on the backend, I see these vids in product meetings) but I believe things like ublock and Adblock will block fullstory by default — or at least you can make rules for it. You can simply block ’fullstory.com‘", "label": 0}
{"text": ">Baldwin is liable to some extent as producer IMO, but only because he presumably went along with hiring a criminally negligent prop person.\n\nDonwe even know what his producer role was? Because there are all sorts. Some producers are just money men who help finance. Oftentimes, actors are given a producer credit as a promise of backend pay if the film does well. More often than that, it's so an actor has the weight to influence decisions in the story/script. And sometimes, it's just to lend credibility to a film. It doesn't necessarily mean he was involved with any hiring.", "label": 0}
{"text": "Killing journalists is an early stage move for Israel apparently. Gotta make a thick fog of war for those war crimes.", "label": 0}
{"text": "I bet Garland is really starting to maybe consider the possibility of potentially doing something about this! ", "label": 0}
{"text": "So you haven't seen a single film since The Crow that involved actors with guns? Big fan of the Cars franchise or something?\n\n\nBecause if you have, you're a hypocrite.", "label": 0}
{"text": "3.  Musk has always been authoritarian himself as his ego has been pumped since his PayPal days and thinks he is one of them", "label": 0}
{"text": "I am confused...  Do the registration forms contain accurate information about eligible voters, or not?  What is the alleged plot here?  If the information doesn't identify an eligible voter, then it will simply be rejected.  If the information does identify an eligible voter, then where's the scandal?  \n  \nSo really, all this does is demonstrate that the process is secure, since it is literally just the process of comparing the information on an application to a database of known voters.  Either it matches or it doesn't...", "label": 0}
{"text": "Trump has **not** won yet. Nothing is set in stone.", "label": 0}
{"text": "This is how basically all of the “sources say trump is literally Russian hitler” articles work. One tabloid newspaper publishes the original article, then all the other publishers cite that original article. Yet the only primary source in the original article is either “sources close to X at the time” “anonymous sources” etc. It is cheap, lazy, and it works.", "label": 0}
{"text": "Two years ago.", "label": 0}
{"text": "99% maga rubes - guaranteed", "label": 0}
{"text": "Oh gee, I wonder who the perps will turn out to me.", "label": 0}
{"text": "Matt Gaetz has entered the chat.", "label": 0}
{"text": "The life of one innocence you say? Then the life of one un-born baby outweighs all the other issues put together.", "label": 0}
{"text": "Double jeopardy is when you've already gotten acquitted but later there's basically reason to believe you actually did it. \n\nThink O.J. Simpson writing his \"fictional\" confession book.", "label": 0}
{"text": "John Oliver talked about these specious investigations.", "label": 0}
{"text": "Pennsylvania county says 2,500 voter registrations being investigated for possible Democratic Party Registrations\n\nFTFY", "label": 0}
{"text": "Delay of the process is the point. States were also trying to pass legislation to let the state legislatures just pick who they wanted to send electoral votes for in the case the election was deemed \"fraudulent or delayed\".", "label": 0}
{"text": "Don't forget her word salad via projection.", "label": 0}
{"text": "She did!!!! And you just know it was 100% on purpose. \n\nhttps://www.nytimes.com/2024/08/20/style/kamala-harris-dnc-tan-suit.html", "label": 0}
{"text": "firearm safety rules are different on movie sets when people are expected to point guns and shoot at each other. boggles the mind that this needs to be explained at all. like spend two seconds and think about how movies work", "label": 0}
{"text": "Can we deport the salmon white bellied looking mf'er already? ", "label": 0}
{"text": "His global spyware companies need to be confiscated.", "label": 0}
{"text": "If it was keanu reeves it would be a lot different", "label": 0}
{"text": "The question is why isn’t anything being done? Is the entire DOJ buddies with Putin too?", "label": 0}
{"text": "Best buds with Trumpler too.", "label": 0}
{"text": "Cocaine is also banned, doesn’t stop kilos of that getting into the country every day.", "label": 0}
{"text": "I think they might still sell those in Canada? Don’t quote me on that but have a look.", "label": 0}
{"text": "The formula for determining each state's vote results in a 27-23 Republican advantage.  Same plan as 2020, but they are more organized now on how to implement it.", "label": 0}
{"text": "Judges **HATE** this one *wierd* trick!", "label": 0}
{"text": "Finally something good we can all agree on", "label": 0}
{"text": "So are 25 year olds. If you take out the 18/19 year olds the numbers drop dramatically and guns are no longer the #1. \n\nThe study is manipulating data to show that guns are #1", "label": 0}
{"text": "Rittenhouse was chased down for several blocks trying to avoid the group coming after him, who were also armed. KR is a heartless person and I despise what he stands for, but the fact stands that he acted in self-defense. People attacked him and he was reasonably scared for his life. Saying otherwise just makes you look uninformed or foolish.", "label": 0}
{"text": "Are you worth hundreds of billions of dollars?", "label": 0}
{"text": "I hope it leaves cold shit in his shoes every night", "label": 0}
{"text": "Dollars to doughnuts a republican operation just[ like was carried out in NC in 2018.](https://www.nbcnews.com/politics/elections/four-people-plead-guilty-north-carolina-ballot-probe-2016-2018-electio-rcna49534)", "label": 0}
{"text": "Countdown to them discovering that all the perps are Republicans starts...NOW", "label": 0}
{"text": "Sure that was mostly Iraqis and Kurds though with SF and aerial support from western forces and not a part of the Iraq war", "label": 0}
{"text": "...and further divide this country with those lies. Then when called out on those lies they, and their cult leader, use the \"_Nuh uh, you're doing that_\" defense. Are they _still_ in fucking fourth grade?", "label": 0}
{"text": "Two different classes. Rich vs poor. Poor follow all the rules and the rich make them up as they break them.", "label": 0}
{"text": "Aren't these crimes handled at the state level? The president has no power in pardoning those crimes.", "label": 0}
{"text": "But it must be different in the context of a movie or tv show. I can’t imagine the industry standard is for the actors to be single point accountable for gun safety. After all, they have an armorer for a reason.", "label": 0}
{"text": "Hahahaha.  That will do a lot.", "label": 0}
{"text": "Sounds like this kid was already a psychopath. Blaming his own brother shows that he has no remorse or empathy in any way. It was just a matter of time before he committed an act of violence.", "label": 0}
{"text": "It's Ohio's corrupt government. They'll probably try to find a way to make his family pay for it", "label": 0}
{"text": "What I will say out loud is that this is dumb, because an application which is rejected because the information does not match an eligible voter is not fraud or some massive conspiracy - it is just the normal way voter registration works, and has always worked.  It does nothing to demonstrate the likelihood of fraud.", "label": 0}
{"text": "If it’s true that somehow Only gop SoS’s and election folks are finding all this noncitizen voter fraud in these red states, that would speak volumes to their GOP management being shitty, allowing no citizens to get through the multi-layered process.", "label": 0}
{"text": "My ex's idiot republican brother literally posted a video on facebook of him filling out a voter registration with a fake name and posted pictures of the board of elections letter he recieved confirming his registration. \n\nHe thinks it's some sort of gotcha that he committed voter fraud... like, nobody forced (or even encouraged) him to register to vote under a fake name.", "label": 0}
{"text": "Treason? That’s not a word thrown around lightly… certainly not a word to throw around without concrete evidence.", "label": 0}
{"text": "I cannot overstate this. There is a reason foreign nationals can't be involved with US space programs except in very distinct cases. They have access to rocket tech that absolutely should not be shared with some very specific people/countries for reasons that should be pretty obvious. Elon owns a space company. How this is not front page news is beyond not ok. HOW IS NOBODY DOING ANYTHING.", "label": 0}
{"text": "Almost all federal elections receive some amount of challenges. The issue is how quickly that can happen. If Trump loses the vote, the burden is on him to prove within a few weeks, ala Bush v. Gore, that individual votes, or whatever, should be thrown out. You can't have due process within that timeframe, and you can't get a stay on inauguration. Therefore, 99% chance whoever gets the most votes wins. \n\nThat isn't to say they won't do shit like this, or protest, or commit violence, or whatever to delegitimize elections in general.", "label": 0}
{"text": "Best we can do is a 4-year investigation and then fine him a few thousand bucks", "label": 0}
{"text": "Yeah I'd have to imagine the NSA/CIA absolutely know the contents of those calls and for once I think that's a damn good thing", "label": 0}
{"text": "It's a bit of a stretch. It's simpler and less invasive than they are making it seem.", "label": 0}
{"text": "“I don’t understand how journalism works”", "label": 0}
{"text": "One of the reasons I don't really read either anymore even though I read the NYT quite often 10 to 15 yr ago", "label": 0}
{"text": "Lol, so the applications contained all of the correct information for a person who was an eligible voter, and was registering in the correct precinct?", "label": 0}
{"text": "okay let me break it down for you because you apparently need it. people in movies are actors, so they are expected to point guns at each other, violating \"basic fucking firearm safety\". How do you suppose they film action movies? DO you think they should be arrested for speeding when they start filming a car chase? do you think the actors should be arrested for assault when they film a fight scene? should I go on?", "label": 0}
{"text": "Just look who owns them. Definitely a psychopath", "label": 0}
{"text": "Yep. When this idea was conceived of, most Americans were rural so there wasn't really a significant disparity in representation (for white property holding men), but with modern population distribution and district boundaries there is significantly unbalanced representation in Congress and the electrical college.", "label": 0}
{"text": "And musk is a spectrum baby. I wouldn’t trust him to keep his mouth shut when it comes to US secrets.", "label": 0}
{"text": "But the person didn’t register it. Someone else was registering a person.", "label": 0}
{"text": "Elf Bar Elfa line is literally the same form factor as disposables with pods you can buy pre-filled or refill yourself. After about 10ml/5 refills the coil/pod wears out and you replace. \n\nIt’s really very simple.", "label": 0}
{"text": "Oh that's surprising, I haven't come across full serve gas stations in rural areas in a while, unless it was in Oregon.", "label": 0}
{"text": "If anyone followed the trial, even with the misconduct on the prosecutors part, the charges were bs in respect to Baldwin's. \n\nI watched it and at one point they showed a rehearsal of the scene in which the shooting happened. Baldwin was using a revolver. And he draws it very fast from his side and points and is supposed to shoot I would assume. Maybe the gun did go off on its own. Maybe he did have his hand on the trigger. But it would be very hard for any actor to do that scene and not accidentally touch the trigger pulling a revolver like that. Never should had got this far.", "label": 0}
{"text": "Takes literally seconds to check for live ammo 🤷\nMaybe something good will come of this and the dummies in Hollywood will stick to airsoft and CGI.", "label": 0}
{"text": "I’m going to laugh my ass off when we find out MAGA is responsible for this. Lancaster County is very red, like Adams where I am. Blue dot towns surrounded by red backass idiots.", "label": 0}
{"text": "Saying I'm pedantiese and incorrect diednt make me incorrect either!\n\nI'll ask you the same thing. Why does anyone comment on Reddit threads?", "label": 0}
{"text": "It was dismissed", "label": 0}
{"text": "What’s in it for Elon? Is it just the “implicit threats”? I wish someone could elaborate on these threats…also I obviously understand what’s in it for Putin!", "label": 0}
{"text": "Still doesn't change the fact that she would be alive if he followed the standard firearm procedures. Because it was a movie set and rules were bent, someone died.", "label": 0}
{"text": "Biggest shocker of 2024.", "label": 0}
{"text": "It's nearly always people who 1) didn't realize they were not allowed to vote, 2) people who cast ballots for deceased loved ones, they still got the ballots in the mail and figured nobody would notice.\n\nOutright and deliberate \"I think the system is flawed and there's no way to catch me if I vote multiple times\" is pretty rare, though the conservative echo chamber has been trying to convince people that there are no systems in place to catch fraudulent votes. Spoiler alert -- they're wrong.", "label": 0}
{"text": "> Even one order of magnitude would mean Putin is a trillionaire, which is unlikely.\n\nHe basically owns Russia. If he needs to, he can take the assets from any of his oligarchs and push them out of a window. I think it's very likely he is a trillionaire, though there'd be no way to effectively do accurate accounting", "label": 0}
{"text": "Jumping to a conspiracy is straight up braindead when the case was dismissed with prejudice. You would have to be intentionally ignorant to believe that idiocy.", "label": 0}
{"text": "No, it literally has not. Elon himself bragged about his dad owning a share of an emerald mine in Zambia.", "label": 0}
{"text": "This is going to be repetitive in the news, but in PA it's legit.  My parents live in Easton. They never received their mail-in ballots. They were taken from the mail somehow. They called to request new ones, and it's still an ongoing process.  They live in the heart of Trump Mind Virus-land. \n\nInvestigate and hopefully prosecute these incidents.", "label": 0}
{"text": "Totally with you. Reeks of MAGA.", "label": 0}
{"text": "And that's on the armorer.\nNeglect of her job is what caused this.", "label": 0}
{"text": "Serious question: Musk reportedly still has his clearance with no plans to revoke it. Before I go sharing this with my conservative leaning siblings, could someone play devil's advocate and try to explain why this isn't a big deal, or is it, in fact, a big deal?", "label": 0}
{"text": "I always appreciate a Dom(me) who takes their role seriously.", "label": 0}
{"text": "Self defense is intentional.", "label": 0}
{"text": "This is Ohio, we dig them up out of their grave, sell the grave plot off to the highest bidder along with the headstone. Chuck the body in the river, Kentucky's problem now.", "label": 0}
{"text": "Yeah see, the funny thing is, the intelligence community is aware that he's talking to Putin and very likely the contents of their conversations and they haven't revoked his security clearance yet. But I guess you know better right?", "label": 0}
{"text": "They said they knew the tricks they were going to attempt to use to attempt another coup, hopefully that wasn't just bullshit and they actually have a plan to protect our country from our enemies.", "label": 0}
{"text": "You know, I'm something of a homo sapiens myself.", "label": 0}
{"text": "The issue is their burgers are cooked to absolute death so it will kill anything in or on it. It is unlikely to have so many problems from so many locations that would cause undercooked burgers. Produce is implicated a lot in food borne illnesses and onions are actually about 10% now.\n\nOdds are too low that so many places are messing up. If it is the beef then there is horrible cross contamination going on.", "label": 0}
{"text": "Well. Everyone in the Trump circle penetrated it included Elon. So... Pretty inept apparently.", "label": 0}
{"text": "He has publicly admitted to using illegal drugs. That in itself should be grounds of never getting it in the first place.", "label": 0}
{"text": "If you want the voting rights that you are entitled to as a shareholder, then you should buy the stock directly. When you purchase ETFs, you are purchashing part of a fund which is owned and managed by the financial institute that owns the underlying shares. As an index fund owner, you are sacrificing your right for direct ownership for the benefit of being able to own a highly diversified asset. It's a tradeoff, though a positive one for most investors.", "label": 0}
{"text": "I wonder if they contact the person/person that mailed their ballots.", "label": 0}
{"text": "Hope this gives comfort to the family of the little girl.", "label": 0}
{"text": "Elon is straight up Hammer from Iron Man 2. No bullshit.", "label": 0}
{"text": "There's a *strong* chance the majority of these are Maga voters, let's see a list!", "label": 0}
{"text": "Have you tried being one of them richest man on earth", "label": 0}
{"text": "R+13 county…. Hmmm republicans shenanigans? You don’t say.", "label": 0}
{"text": "Leon Musk Rat the Enemy of the State. Guantanamo for domestic terrorists and traitors of the United States.", "label": 0}
{"text": "How are you people saying this unironically. Connecting to missiles and drone ship bombs is more restricted than trade sanctions not less.", "label": 0}
{"text": "You’re right. I think I jumped the gun and made assumptions. My apologies.", "label": 0}
{"text": "Trump, buddies with Trump. \nIt’s the only logical explanation?", "label": 0}
{"text": "Great segment on John Oliver last week explaining this shit.\nCheck it out on YouTube", "label": 0}
{"text": "So creepy. Guns aren't that fucking special. Do you get upset when an actor drives too fast for a movie?", "label": 0}
{"text": "Welcome home, just in time to vote ", "label": 0}
{"text": "\"If only the parents had more guns to combat the one their son used.\"\n\n-2A people rn", "label": 0}
{"text": "If they do this and don't show the evidence then the state secretary should face some sort of charges. Someone shouldn't be allowed to interfere with elections like that and have nothing happen. The next election they will just do it more and more until our elections *are* nonsense chaos, which is what these traitors want so they can just seat their dictator and the US is no more.", "label": 0}
{"text": "No it's really not.\n\nThe ones in the product photos are staged for the menu covered in oils, liquors, non food items top prop up and stack the bun tall to look bigger than it is etc.\n\nThis looks like reality... someone quicky made the food, threw it in box, held it on it's side, tossed that in the bag, handed that to you, you took it out on it's side out of the bag open it and wonder why it looks like this and not the photo.\n\nMeanwhile... for similar money to you could go to a mom and pop restaurant for a \"home burger\" that will look more like food have more toppings and cost about the same.\n\nIt's not good food, it's not even fast food anymore and it certainly does not look like the photos at most North American McDonalds locations.", "label": 0}
{"text": "Unfortunately I bridge the gap on Gen Z, so I am in the sub, and holy shit -- the level of young ignorance and bots on their post about him at McD's is incredible.", "label": 0}
{"text": "If a federal employee fails a drug test for medical marijuana prescribed by a doctor then they lose their security clearance.  But if you are a billionaire and smoke weed on the Joe Rogan podcast then you are just fine apparently.", "label": 0}
{"text": "Wait. You don't do that?!", "label": 0}
{"text": "Elon’s group’s fingerprints are all over it.", "label": 0}
{"text": "Sounds like more than a handful", "label": 0}
{"text": "Why are we surprised? Is this news? He’s been openly communicating, hanging out with, and supporting the Saudi leaders. There’s media pictures of them together at high-profile soccer games and other events. He’s been colluding with foreign nations openly. Of course he’s also simping for Russia. He’s been supporting Trump so obviously he’s on the side of Russia.", "label": 0}
{"text": "I like that he kept it professional and \"political.\" He's aware it would look bad for his position if he were to be celebrating publicly. He's basically saying, \"I'm not mad that he's dead, but i can't come out and say it.\" This is what you'd want from your police chief for a public comment", "label": 0}
{"text": "So, is he going to jail? Is he being tried? No. Because why would he.", "label": 0}
{"text": "Fuck off musk. Go and live there with Snowden ", "label": 0}
{"text": "Depends on who wins.", "label": 0}
{"text": "Jesus, who is surprised by that??? Wake up USA!!", "label": 0}
{"text": "Yup, that was one of my jobs in the 80s. I’m absolutely appalled that nothing is being done.", "label": 0}
{"text": "You clearly don't know Dave Yost. He would absolutely posthumously charge someone if it made daddy Trump look his way. \n\n[I am not kidding. He charged him without even seeing if he was alive.](https://ohiocapitaljournal.com/2024/10/23/ohio-attorney-general-dave-yost-announces-six-voter-fraud-indictments-two-weeks-from-election-day/)", "label": 0}
{"text": "If he's been selling intel to Putin he should be put in ADX or something.", "label": 0}
{"text": "Some forms had false names, but other forms contained partially accurate information. Some of the folks identified on the forms have been contacted by authorities and they said they never filled out a registration form.\n\n>Some of the applications contain handwriting that matches other voter registration forms, signatures that don't match what's logged in the Statewide Uniform Registry of Electors (SURE), inaccurate addresses and inaccurate driver's license and Social Security numbers, D'Agostino explained.\n\n>\"In some cases, applications contained correct personal identification information such as the correct address, correct phone number, date of birth, driver's license number and social security number, but [the individuals listed on the applications informed detectives that they did not request the form, did not complete the form and verified that the signature on the form was not theirs,\"](https://www.cbsnews.com/philadelphia/news/lancaster-county-voter-registration-fraud/) District Attorney Heather Adams said.", "label": 0}
{"text": "The point of the justice system is not justice, but rather the maitenance of the state's monopoly on the justified use of violence. But yes, it is possible to have an organized response to abuse and harm outside the carceral state, it's just very hard to do when the state will respond, with violence, if you try something like what Rojava does and ignore the courts and reject police intervention.", "label": 0}
{"text": "Taking Reddit this seriously is idiocy and pathetic, take your own advice.", "label": 0}
{"text": "JFC I hope her family is able to be insulated from all this as much as possible. Yes, I know they're still investigating but they don't need to be bombarded by people thinking/hoping that the truth is actually like a Law & Order episode and not the horrific enough explanation of an awful workplace accident.", "label": 0}
{"text": "You know what, I am definitely no fan of Baldwin's, but I really feel like he has been raked over the coals over this. I mean, on a movie set, he should have no more expectation that a gun is real and may kill someone than a a kid on the Harry Potter set expecting sparks to fly out the end of his wand. Terrible situation and you KNOW it was unintentional. The armorer is definitely the one that needs all the blame, ridicule, and criminal prosecution.", "label": 0}
{"text": "Weird. I couldn’t even get mine because I smoked pot. I wonder if Elon has smoked pot…", "label": 0}
{"text": "The audit details go to another school, you guys wouldn’t know her.", "label": 0}
{"text": "They must appear too democratic to be real.", "label": 0}
{"text": "Setting the stage for another attempted coup obvs", "label": 0}
{"text": "> “Being careful not to express my personal beliefs on a professional platform, I will say that I would find it impossible to compose a rational, articulate argument in opposition of those expressing relief,” he said.\n\nChief, I have to admit, that is one *hell* of a professional way to say of the people glad this fucker’s dead that “They ain’t wrong.”", "label": 0}
{"text": "My sister was a senior in high school when she was diagnosed with cancer. She was valedictorian, beautiful, and like the nicest person. She was planning on attending an Ivy League university to study nursing the next year. She fought for 2 years, relapsing every time right before she was going to leave for college. She eventually ran out of treatment options and just decided to go to college anyways, knowing she was 100% going to die. She just lived as best she could as a college kid for about a semester before she got too sick to continue and then she came home and died there with us. \n\nThe thing that fucks me up is that she was ok with it. Like I’m so grateful she had that perspective, at such a young age, but like wtf. I wasn’t ok with it then, and I’m still not and I’m in my 40s. I couldn’t face death with the grace she had and I’ve gotten to actually live a life. \n\nI’m sorry about your loss. Personally, I’m trying to make peace with the fact that it just won’t ever make sense. Just make sure to stop every once in a while and just enjoy being here.", "label": 0}
{"text": "Prison culture and the possibility of being tortured/murdered, is a much higher deterrent to these crimes than the shitty jail food and loss of freedom.", "label": 0}
{"text": "I’m legit curious what Putin has on Elon Musk", "label": 0}
{"text": "My brother got questioned and background checked for an IT-Job in the police because an uncle lives in russia and gets his pension there... Yeah.", "label": 0}
{"text": "republicans aren’t serious people. All they do is constantly move goalposts, they have no morales or standards anymore as long as they “win”", "label": 0}
{"text": "Get those rumors started early!", "label": 0}
{"text": "> They told me to go and if they ever even saw me in this part of town I’d be arrested no questions asked.\n\nBecause that's totally how that works...", "label": 0}
{"text": "Damn, Trump didn’t wear gloves or something?", "label": 0}
{"text": "That's a felony, fbi would love to receive details of the individuals doing this. Go ahead and lock all these idiot Maga people posting their voters fraud.", "label": 0}
{"text": "I hope he suffered and was terrified, and I hope that if there's a hell, he's cooking over a hot fire.", "label": 0}
{"text": "Yup! All the people cheering on these bans are going to be just shocked when half of the vapers end up going back to smoking cigarettes again too.", "label": 0}
{"text": "That's why we vote for judges. No one appointed you.", "label": 0}
{"text": "Interesting. Of course, this is right outside of Philly so I am sure this will feed the narrative that illegals are somehow super eager to vote. You've got Elon paying people to register to vote, GOP canvassers lying about door knocks. Dirty tricks. \n\nWhere the fuck is Roger Stone?", "label": 0}
{"text": "Would it be possible to vote in space?", "label": 0}
{"text": "Jfc...I'm not surprised, yet somehow still disappointed.", "label": 0}
{"text": "People are saying Ray DAgostino isn't a US Citizen. Look, people are saying it.", "label": 0}
{"text": "This is a very uninformed take. The accusation appears to be more damning of mass Republican voter registration, specifically campaigns that were outsourced to sign Republicans up in Republican heavy counties.", "label": 0}
{"text": "My dad works in a vault (engineer) and it’s exactly as you described. It’s the reason he still uses a pager because that’s one of the only devices they’ll allow in. So he gets to walk around looking like a drug dealer to everyone else lol", "label": 0}
{"text": "Parent comment didn’t mention being attacked or injured, just being in danger. I wouldn’t choose to be at home during a burglary if given the choice.", "label": 0}
{"text": "what's with all these recent high profile cases having awful lawyers?", "label": 0}
{"text": "I know there’s plenty of people that would be willing to take the charges and believe they would be getting a pardon for it after the fact. Lots of people were left hanging waiting for a pardon from Jan 6th. \n\nThat’s how all patsys believe, if they take a hit for their dear leader, they’ll be rewarded for life.", "label": 0}
{"text": "And they both absolutely are. KR was completely justified self defense.", "label": 0}
{"text": "Remember hunter Biden? They sure thought his, no power-having, party boy ass was a threat to our security. \n\nWatch them now defend this.", "label": 0}
{"text": "they don't.  its a security placebo that's actually way more likely to kill your friends, family, or self.", "label": 0}
{"text": "Why? Because his politics are different than yours?", "label": 0}
{"text": "But Kamala is the commie. Got it.", "label": 0}
{"text": "And of course his self fulfilling prophecy. The only way I can lose is if they cheat. He laid the ground work way back in 2015 for all three elections. And we saw how he behaved when he lost already. Given this is his final chance, it will be uglier I think if he loses.", "label": 0}
{"text": "Sources told CBC News (as articles have stated) that the door 'did not lock'. Speculation swirls around foul play possibly being involved. Why would staff not be able to turn the oven off or even simply open the door?", "label": 0}
{"text": " Because some Dept of transportation automatically register all who apply for DL. So that they could get a ballot on their address. Even though no non-citizen votes, because they were put on the rolls, we have “voter fraud”. Which should mean defrauding the voters and taxpayers.", "label": 0}
{"text": "Gossip like everywhere else there’s people?", "label": 0}
{"text": "No, a prosecutor can't reopen a case.", "label": 0}
{"text": "Republicans are seeing the benefits of their decades long coup", "label": 0}
{"text": "He was in Iron Man 2, too!", "label": 0}
{"text": "Love this reply and perspective. Thank you for sharing", "label": 0}
{"text": "This sums up living in Ohio for the last decade. Just constant soul crushing disappointment.", "label": 0}
{"text": "He talks about reducing government regulation, wanting more free speech, telling people to have more babies, and going to Mars. What is he saying that we should be alarmed about?", "label": 0}
{"text": "Point to a democrat doing this kinda shit  and I'll show you 100 Republicans doing it.", "label": 0}
{"text": "My first thought was actually that there are groups that just try to get people to register, and there's probably millions across the US that don't actually know their status, so they figure why not try to register, worst thing they can say is no.", "label": 0}
{"text": "The CEO reportedly has security clearance given his companies' work on classified US government projects. While there are many rules around who can get security clearance, such as abstaining from cannabis use, the designation is awarded and maintained on a risk-vs-reward basis for the US government.\n \nUntil a couple of years ago, NASA was in talks too... for rocket booster engines.", "label": 0}
{"text": "Same. Uncle lives next to Electric Boat. He hasn't even told us he worked on subs, but disappearing for months at a time, his work history, and some logic...", "label": 0}
{"text": "Apparently yes.\n\nhttps://www.nasa.gov/general/how-nasa-astronauts-vote-from-space-aboard-international-space-station/", "label": 0}
{"text": "I think he's guilty of negligent manslaughter, as are a few people on the project. There should have been quite a few checks on the firearm even if it was a fake, then the shooting should have been framed that even with a negligent discharge, no one would have been on the other side of the weapon.", "label": 0}
{"text": "Musk is a bad person. Let's start to believe him when he is showing us this.", "label": 0}
{"text": "I’m kinda curious to see the 100 republicans doing it?", "label": 0}
{"text": "I mean that often women in a nutshell.  You can't make a mistake or it becomes \"see women are terrible [insert profession here]\".", "label": 0}
{"text": "Not surprised in the least but they need to do something about it. There’s no telling what he’s planning on doing for Putin.", "label": 0}
{"text": "Evidence of suspicious registrations being caught.. is literallybevidence of how secure out elections are.", "label": 0}
{"text": "Servicemen and scientists have been jailed for same or less than what Elmo has done with Putin", "label": 0}
{"text": "Unfortunately that’s all politics is now, even in Canada it’s the same. The public are just a vessel to win elections to funnel money to their friends.", "label": 0}
{"text": "And also… will\nBe all GOP", "label": 0}
{"text": "Sounds like a SCIF, and yeah that's not a place for fucking around. You'll be fired with actual fire, and potentially even face criminal charges.\n\nAnd people often think about spooky helicopters and space aliens when they hear classified data, ehh, think about something much more actionable like known security vulnerabilities and real names of informants.", "label": 0}
{"text": "Pull his contracts, revoke his clearances and investigate him.", "label": 0}
{"text": "My God it’s not necessarily a bad thing. We need peace maybe this is a way forward.", "label": 0}
{"text": "Is this the same prosecution that was caught on recording talking about how they wanted to ruin his life and destroy Baldwin? Because, if so, the judge should just play that clip and maintain eye contact.", "label": 0}
{"text": "Disposables are definitely worse in terms of electronic waste but from a public health perspective it’s night and day compared to like 20% of the population smoking cigarettes everywhere. Even if vapes were just as bad for the people using them as cigarettes are—which they categorically aren’t—the lack of second hand smoke alone is revolutionary.", "label": 0}
{"text": "I am no expert, and didn't mean to suggest doing anything you don't want to or have already tried. Just frustrated, apologies lol.", "label": 0}
{"text": "Ukraine is not a US ally", "label": 0}
{"text": "Based on what I'm hearing, it's the Republicans who are committing this.\n\nLancaster County is Amish Country, and Republicans are trying to court them heavily this year\n\nBut let's wait to see what's happening.", "label": 0}
{"text": "Huh, so knowing the definitions of legal terminology is idiotic now. I would think being so r/confidentlyincorrect on such a basic part of our modern society is more indicative of stupidity, but I guess not.", "label": 0}
{"text": "Could he just go make South America great again?", "label": 0}
{"text": "They’ll look how far up it goes until they find out it was their team", "label": 0}
{"text": "Is this related to Musk's million-dollar lottery for Pennsylvania registered voters? People trying to get in on the action?", "label": 0}
{"text": "Or it's a cover, and we have that technology and it was used on him! He never said he wasn't dead at some point.", "label": 0}
{"text": "My late father worked for defense contractors and would sometimes hurry back to the office if he wasn't 100% sure was secured within the  SCIF.  We never had vacations outside the US because of the amount of paperwork and interviews that would entail.  The consequences that he was able to relay was the \"go to jail. go directly to jail...\" without hearing or recourse.  \n\nI'm sure it's beyond appalling to the professionals who would face real consequences and the families and friends of those professionals who are interviewed and questioned so they can get those clearances.", "label": 0}
{"text": "Yea, there is no reason...AT ALL... why he is literally paying American's to vote for Agent Orange.  Nope, nothing to see here.", "label": 0}
{"text": "I just took advantage that I could leave and left. Wasn’t about to argue semantics.", "label": 0}
{"text": "You're misrepresenting what I'm saying. So this will be my last response. \n\nI'm operating under some assumptions here as we all are because none of use were in any decision making room. I'm assuming the US Military was aware that Ukraine's military was planning to use starlink to support operations in Crimea. I also assume that if the US military didn't tell Ukraine to pump the brakes, they were fine with it. I don't think the \"Is the military okay with this?\" question was even on the plate by the time Musk had input, which leaves the trade restriction excuse.", "label": 0}
{"text": "Really? Religion? Going backwards, my dude.", "label": 0}
{"text": "No problem! Believe me, I'm frustrated too. Pretty sure dude will be caught considering he put his real address on the registration and his county is currently under investigation. These people are not very smart lol.", "label": 0}
{"text": "That doesn't mean backronyms suddenly become acronyms. That was my whole point and you have some desire to be right, so you insisted.", "label": 0}
{"text": "Bunches of fake registrations in Lancaster County PA. Interesting. This comes on the heels of Republicans bragging that there were a whole bunch of Amish, a group notorious for not caring about politics outside of their communities, that were registering to vote for Trump and how convenient it would be for them to vote by mail.", "label": 0}
{"text": "He has US citizenship.", "label": 0}
{"text": "Mail in ballots were intercepted before they made it to the rightful owners and cast in mesa County Arizona. The signature authentication check flagged them as potentially fraudulent. Maga is intentionally making it appear as though democrats are cheating. He really did have 4 years to prepare...", "label": 0}
{"text": "All we know is he wasn't personally revived.", "label": 0}
{"text": "How about the statement that Ukraine would have gathered the same military intelligence anyways?", "label": 0}
{"text": "No one knows how wealthy the Russian oligarchs are, Elon is only the richest based on public information.", "label": 0}
{"text": "I understand your concerns, and the justice system is far from perfect.  Maybe some experts in criminal justice, philosophy, politics and maybe humanities can have some joint public forums about it to identify possible solutions.", "label": 0}
{"text": "> There’s been at least one who was on a mission up there during an election.\n\nWe've had people on the ISS since November 2nd, 2000. So that covers last 6 presidential elections.", "label": 0}
{"text": "It’s not even news. Elon has said this publicly for years. SpaceX’s first rockets were ICBM’s purchased from Russia", "label": 0}
{"text": "Yup. Guaranteed we're gonna see a lot of MAGA morons trying to \"prove the election is rigged\" by submitting fake registrations/ballots and expecting them to just be processed. Who will then be shocked to find out that our elections are actually highly protected when they get caught and charged with crimes.", "label": 0}
{"text": "The more they push on this the more it looks like a political hitjob.", "label": 0}
{"text": "The case will be both rock solid and weak until someone reviews it.", "label": 0}
{"text": "This is a distinct possibility. Amish don't normally have ID's or Social Security Numbers. They can also have lower literacy rates which affect things like Handwriting.", "label": 0}
{"text": "You know how you fix all these mess - national popular vote. Harder than it sounds unfortunately", "label": 0}
{"text": "Yeah, definitely the right move.", "label": 0}
{"text": "They think a lot of the forms were filled out by the one individual based on handwriting, and some of the people they've contacted said they never requested, completed, or signed a form.\n\n>\"In some cases, applications contained correct personal identification information such as the correct address, correct phone number, date of birth, driver's license number and social security number, but the individuals listed on the applications informed detectives that [they did not request the form, did not complete the form and verified that the signature on the form was not theirs,\"](https://www.cbsnews.com/philadelphia/news/lancaster-county-voter-registration-fraud/) District Attorney Heather Adams said.\n\nI'm not sure how many are honest mistakes. They say \"[at least\" 60%](https://www.nbcnews.com/politics/2024-election/fraudulent-voter-registration-lancaster-county-pennsylvania-rcna177322) of what they've investigated so far has  been identified as fraudulent.\n\n>After undergoing extensive review of registration applications, at least 60% of the forms that have been investigated so far have been determined to be fraudulent so far, Adams said. Some of the applications appear to be legitimate.", "label": 0}
{"text": "\"when a country seems wholly committed to trying to screw up other nations instead of helping it's own people\" ... 👀👀👀 Can anybody think of any other examples of such a nation?", "label": 0}
{"text": "Hmm not surprised one bit!", "label": 0}
{"text": "It worked for the Greeks...", "label": 0}
{"text": " Good. There’s no reason for disposables.\n\nI quit vaping October 1st last year. If anybody has been thinking about quitting, you should. I feel so much better. I feel younger. I still think about vaping once in a while but then I remember how I used to feel. Never again", "label": 0}
{"text": "It's crazy this isn't the widely held belief. You teach kids that guns are always loaded when you hand them a bb gun but adults get a pass on real life guns? If the scene had been him putting the gun to his own head i guarantee he'd check the barrel", "label": 0}
{"text": "I've heard a grieving mother say:   \n\"On the days where I could not live for me, I lived for her\"  \n\nI hope this mother has strength to carry on, to share stories about Gursimran, to keep her memory alive.", "label": 0}
{"text": "They spend 4 years talking about the Dominion conspiracy theory that one random crazy lady who “talks to the wind” and “ghosts” sent in an email to Fox News.", "label": 0}
{"text": "That's a whole lot of bloviating. You're trying to paint Kyle with a very soft brush and downplay the reality of who he is.", "label": 0}
{"text": "lol I’m an ex trained chef. A lazy ex-trained chef. Well, I’m still trained… I just don’t do the kitchen anymore…\n\nBut what if I don’t want it because I made it :(", "label": 0}
{"text": "Remember Elon’s website that harvested your personal information to purport to register you to vote and ended in an error page…..", "label": 0}
{"text": "1/2\n\nElon Musk, the world’s richest man and a linchpin of U.S. space efforts, has been in regular contact with Russian President Vladimir Putin since late 2022.\n\nThe discussions, confirmed by several current and former U.S., European and Russian officials, touch on personal topics, business and geopolitical tensions.\nAt one point, Putin asked the billionaire to avoid activating his Starlink satellite internet service over Taiwan as a favor to Chinese leader Xi Jinping, said two people briefed on the request.\n\nMusk has emerged this year as a crucial supporter of Donald Trump’s election campaign, and could find a role in a Trump administration should he win. While the U.S. and its allies have isolated Putin in recent years, Musk’s dialogue could signal re-engagement with the Russian leader, and reinforce Trump’s expressed desire to cut a deal over major fault lines such as the war in Ukraine. \n\nAt the same time, the contacts also raise potential national-security concerns among some in the current administration, given Putin’s role as one of America’s chief adversaries. \n\nMusk has forged deep business ties with U.S. military and intelligence agencies, giving him unique visibility into some of America’s most sensitive space programs. SpaceX, which operates the Starlink service, won a $1.8 billion classified contract in 2021 and is the primary rocket launcher for the Pentagon and NASA. Musk has a security clearance that allows him access to certain classified information.\n\nKnowledge of Musk’s Kremlin contacts appears to be a closely held secret in government. Several White House officials said they weren’t aware of them. The topic is highly sensitive, given Musk’s increasing involvement in the Trump campaign and the approaching U.S. presidential election, less than two weeks away. \n\nMusk didn’t respond to requests for comment. The billionaire has called criticism from some quarters that he has become an apologist for Putin “absurd” and has said his companies “have done more to undermine Russia than anything.”\n\nDuring his campaign swing through Pennsylvania last week, Musk talked about the importance of government transparency and noted his own access to government secrets. “I do have a top-secret clearance, but, I’d have to say, like most of the stuff that I’m aware of…the reason they keep it top secret is because it’s so boring.”\nA Pentagon spokesman said: “We do not comment on any individual’s security clearance, review or status, or about personnel security policy matters in the context of reports about any individual’s actions.”\n\nOne person aware of the conversations said the government faces a dilemma because it is so dependent on the billionaire’s technologies. SpaceX launches vital national security satellites into orbit and is the company NASA relies on to transport astronauts to and from the International Space Station. \n\n“They don’t love it,” the person said, referring to the Musk-Putin contacts. The person, however, said no alerts have been raised by the administration over possible security breaches by Musk.\n\nKremlin Spokesman Dmitry Peskov said the only communication the Kremlin has had with Musk was over one telephone call in which he and Putin discussed “space as well as current and future technologies.” \n\nApart from that, he said neither Putin nor Kremlin officials were holding regular conversations with Musk.\n\nA spokeswoman for Trump’s campaign called Musk “a once-in-a-generation industry leader” and said “our broken federal bureaucracy could certainly benefit from his ideas and efficiency.”\n\n“As for Putin,” the spokeswoman continued, “there’s only one candidate in the race that he did not invade another country under, and it’s President Trump. President Trump has long said that he will re-establish his peace through strength foreign policy to deter Russia’s aggression and end the war in Ukraine.”\n\n####A BOTTLE OF VODKA\n\n\nMusk has long had a fascination with Russia and its space and rocket programs. Walter Isaacson’s biography of Musk said the businessman traveled to Moscow in 2002 to negotiate the purchase of rockets for his fledgling space program, but passed out during a vodka-heavy lunch. The sale ultimately failed, though his Russian hosts gave Musk a bottle of vodka with his likeness superimposed on a drawing of Mars.\n\nThe billionaire’s conversations with Putin and Kremlin officials highlight his increasing inclination to stretch beyond business and into geopolitics. He has met several times and talked business with Javier Milei of Argentina, as well as former Brazilian President Jair Bolsonaro, whom he defended in an acrimonious online debate. \n\nPutin is on a different order of magnitude. The Russian leader has created an authoritarian system that oversees fraudulent elections and the assassinations of political opponents, for which President Biden called him a “killer.” With keys to one of the world’s most powerful nuclear arsenals and growing territorial ambitions in Europe, Putin has become the U.S.’s chief antagonist.\n\nLabeling him a “despot,” the Treasury Department took the unusual step in 2022 of blacklisting him for invading Ukraine, putting him in the same company with North Korea’s Kim Jong Un, Syrian President Bashar al-Assad and Alexander Lukashenko of Belarus. \n\nIn October 2022, Musk said publicly that he had spoken only once to Putin. He said on X that the conversation was about space, and that it occurred around April 2021. \n\nBut more conversations have followed, including dialogues with other high-ranking Russian officials past 2022 and into this year. One of the officials was Sergei Kiriyenko, Putin’s first deputy chief of staff, two of the officials said. What the two talked about isn’t clear.\n\nLast month, the U.S. Justice Department said in an affidavit that Kiriyenko had created some 30 internet domains to spread Russian disinformation, including on Musk’s X, where it was meant to erode support for Ukraine and manipulate American voters ahead of the presidential election. \n\nAfter the Russian invasion in February 2022, Musk at first made strong public statements of support for Kyiv. He posted “Hold Strong Ukraine,” flanked by Ukrainian flags on what was then still known as Twitter. Shortly after, he jokingly challenged Putin to one-on-one combat over “Україна,” the Ukrainian language name for the country.\n\nHe followed up by donating several hundred Starlink terminals to Ukraine. By July some 15,000 terminals were providing free internet access to broad swaths of the country destroyed by the Russian attacks.\n\nLater that year, Musk’s view of the conflict appeared to change. In September, Ukrainian military operatives weren’t able to use Starlink terminals to guide sea drones to attack a Russian naval base in Crimea, the Black Sea peninsula Moscow had occupied since 2014. Ukraine tried to persuade Musk to activate the Starlink service in the area, but that didn’t happen, the Journal has reported.\n\nHis space company extended restrictions on the use of Starlink in offensive operations by Ukraine. Musk said later that he made the move because Starlink is meant for civilian uses and that he believed any Ukrainian attack on Crimea could spark a nuclear war.\n\n\nHis moves coincided with public and private pressure from the Kremlin. In May 2022, Russia’s space chief said in a post on Telegram that Musk would “answer like an adult” for supplying Starlink to Ukraine’s Azov battalion, which the Kremlin had singled out for the ultraright ideology espoused by some members.\n\nLater in 2022, Musk was having regular conversations with “high-level Russians,” according to a person familiar with the interactions. At the time, there was pressure from the Kremlin on Musk’s businesses and “implicit threats against him,” the person said. \n\nAt the same time, Musk increasingly took to Twitter, for which he was completing the purchase, to say SpaceX was losing money by funding the operation of the terminals.  \n\nIn October 2022, he asked his tens of millions of followers on X to vote on a pathway to peace that mirrored some aspects of the Kremlin’s offer to Ukraine at the time.\n\nThose conditions included continued Russian occupation of Crimea and Ukrainian neutrality outside of NATO. He also specified that Ukraine should continue allowing the supply of water to Crimea, an issue that had been an important concern of the Kremlin before the war.\n\nOne current and one former intelligence source said that Musk and Putin have continued to have contact since then and into this year as Musk began stepping up his criticism of the U.S. military aid to Ukraine and became involved in Trump’s election campaign.\n\n####‘RED LINES’\n\nIn the fall of 2022, political scientist Ian Bremmer, founder of New York-based consulting firm Eurasia Group, wrote on Twitter that Musk had told him he had spoken with Putin and Kremlin officials about Ukraine. “He also told me what the Kremlin’s red lines were,” he wrote.\n\nBremmer wrote in a newsletter to subscribers that Musk had relayed to him a message from Putin that Russia would secure Crimea and Ukrainian neutrality “no matter what,” and that it would respond to a Ukrainian invasion of Crimea with a nuclear strike. Musk said that “everything needed to be done to avoid that outcome,” Bremmer wrote.\n\nMusk has publicly denied he said any of those things to Bremmer.\n\nIn the past year, Musk and Russia’s interests have increasingly overlapped. Apart from Russia’s use of X for disinformation and Musk’s outspoken opposition to aid to Kyiv, Ukrainian officials said earlier this year that Russian forces occupying the country’s eastern and southern swaths had started using Starlink to enable secure communications and extend the range of their drones.", "label": 0}
{"text": "Well of course it's like their favorite thing to cry about and gaslight around election times", "label": 0}
{"text": "Wait for it..... 2,500 fake Republican registrations. It's always projection with those clowns. See: The Villages, FL voter fraud.", "label": 0}
{"text": "Wouldn't preventing them from using the train make them more likely to be on the road?", "label": 0}
{"text": "Why did you name me this way?\n\nWhy? Why? Why?", "label": 0}
{"text": "That should be enough to cancel most of his government contracts and the rest as soon as they can find alternative sources that aren’t compromised.", "label": 0}
{"text": "Wonder if it’s the people literally paying people to vote in that state", "label": 0}
{"text": "I wouldn't be surprised if they're going to try to falsely register voters, mail in false ballots etc to muddy the waters. I really think nothing is too low for them in this election. It's going to be a rocky month. People will probably die, and for nothing.", "label": 0}
{"text": "Again, so you have been picketing every movie and piece of entertainment that I cludes that then? You seem a little slow, so let me outline this for you\n\n\nPointing guns at people = bad\nTherefore \nEntertainment involving pointing guns at people = bad\n\n\n\nAnd yet, you won't clarify if you still watch and pay for movies that involve that explained above. So either I'm right, and you exclusively watch things without that. Or you're a hypocrite. This is the part where you started crying and stopped making an argument. Has your own reading comprehension improved since then, or so I need to explain it using monosyllabic words exclusively?", "label": 0}
{"text": "Acting like SpaceX would exist without Musk lol -- It's so weird how common this trope is on Reddit, exclusively in response to Elon. \n\nNo, Musk doesn't personally launch the rockets and run the business by himself. He runs the entire organization and is responsible for it's existence and leadership towards progress. SpaceX would be nothing without him at the helm. I know that hurts to read, but it's reality. You don't have to like the guy to recognize he knows wtf he's doing with rockets.", "label": 0}
{"text": "Yes, locking people up over anonymous reports for not actually doing anything illegal will preserve democracy.", "label": 0}
{"text": "There's a base rate fallacy likely at work.\n\nNews articles about the death penalty in the USA are very often \"this person has been denied an appeal, even though the prosecutor says the conviction was bogus, and he will be executed soon.\"\n\nNews articles about child molesters are usually about successful prosecutions of accused child molesters.\n\nThe emotional responses that drive people to *comment* on posts are very different.", "label": 0}
{"text": "Have to assume they are liars, then.", "label": 0}
{"text": "Trial was declared a mistrial. There was now verdict. Double jeopardy does not come into play.", "label": 0}
{"text": "It's simply increased public access so the public can see it. \n\nThese issues with investigators, lawyers, and prosecutors are easier to see, and more people are keeping an eye out, but are not new phenomenon.", "label": 0}
{"text": "“That’s why we vote for some* judges.” Again, consider that community college course. \n\nDo you think people here are submitting amicus briefs? Do you just generally disapprove of the populace debating the moral infrastructure of the world around them?\n\nIt’s probably neither of those, and you just saw an opinion on an issue that you disagreed and got pissy about it instead of engaging in the conversation like an adult.\n\nPity. Now, we don’t know anything about your reasoning and you’re being justifiably condescended to. Effective strategy.", "label": 0}
{"text": "Our secrets are open source info for Putin....in my opinion.", "label": 0}
{"text": "He was a producer* and part of the decision to cut corners and not go union (which in film production is a major difference in safety standards among other things), so while he has more responsibility in what happened than many are claiming he's certainly not guilty of murder or probably any other crime.\n\n\nThat said whenever there's a major problem with, say, a Boeing aircraft, there are reasonable calls to put some blame on the executives at the top who demanded cost-cutting instead of just the mechanics operating on the planes, and there's not much reason why this should be different. \n\n\n\n\n\n*inb4 people with the \"producer is just a vanity credit\" response no, on this one he wrote the thing and was a major part of it getting made from the beginning", "label": 0}
{"text": "or let him keep them and put a watchdog on him. \n\nNice bait.", "label": 0}
{"text": "This county alone should be a wild ride: \n\nRay D’Agastino is the County Commissioner and heads the board of elections was quoted in the article. \n\nSome other info about this guy:\n\n“After nearly all Pennsylvania counties certified their primary results last year, six Republican commissioners spread out across three counties stood in the way of completing the process.” His county was one of them. \n\n“D’Agostino and Parsons last year voted to remove Lancaster County’s only drop box for mail-in ballots, for instance, and Hopkins is concerned by local commissioners’ crusade against mail voting, which is central to Trump’s own lies about fraud.”\n\n“Two attorneys who were involved in efforts to challenge the results of Pennsylvania’s 2020 presidential election are representing the Lancaster County Board of Elections in a lawsuit recently filed by a labor union-backed group over the counting of mail-in ballots,” he literally brought in attorneys that challenged Biden’s victory in Pennsylvania. \n\n“Lancaster County’s elections office on Monday said 18,554 mail-in ballots sent to voters starting last week contained an error that required the ballots to be voided and replacements distributed,” he fucked up almost 20,000 ballots in the 2022 primaries. \n\n“Duncan Hopkins, an organizer with progressive advocacy group Lancaster Stands Up, who asked Commissioner Ray D’Agostino at Tuesday morning’s work session about his attendance at the March 31 Pennsylvania Election Summit, organized by Cleta Mitchell of the Conservative Partnership Institute. LNP newspaper reported on D’Agostino’s participation in an article on Sunday. Mitchell was part of the team that tried to overturn the 2020 election on behalf of Donald Trump. She has since launched a nationwide project to recruit poll watchers and election officials to “take back our elections.” I mean, that’s just plain frightening. We need to handpick OUR people to run elections so we get the results we want.", "label": 0}
{"text": "Ah the old Werner von Braun gambit", "label": 0}
{"text": "But it didn't even get that far. Alec says the gun went off on its own, he didn't even pull the trigger. He didn't even accidentally do it, the gun did it on its own!", "label": 0}
{"text": "You mean the richest man in the world is in communication with other world leaders? Dear god, next thing you'll be telling me he does business with China.", "label": 0}
{"text": "> “The Vault”\n\nA \"scoff\" - https://en.wikipedia.org/wiki/Sensitive_compartmented_information_facility", "label": 0}
{"text": " Election workers are on hyper alert for this bullshit.  Keep it up and thank you !!", "label": 0}
{"text": "No, you might be a brick in a wall, but Kahzgul is a great long-time contributor to this sub who always brings receipts. I think you’ve done him and yourself a disservice by starting an argument that didn’t need to happen and then doubling and tripling down.  I don’t know Kahzgul personally, but I do know he tries to always be accurate.", "label": 0}
{"text": "\"change coils often\" I usually change my $6.50 coil after two 100ml bottles of juice that each last me 3-4 weeks unless I run it empty too many times.  \n\nThe coil even tells you what wattage it should be run at right on it.", "label": 0}
{"text": "I’m missing something obvious but why do tourism heavy places favour apps? Is it because they can change prices much easier than a printed menu?", "label": 0}
{"text": "Did you read the documents submitted by the prosecution or did you just read a headline and decide he's guilty? \n\n\nBecause it you read the publicly available evidence and still think he's only getting the charges dropped because he's famous I have follow up questions.", "label": 0}
{"text": "Elon Musk is a criminal and should spend every day of the rest of his life in a tiny prison cell.", "label": 0}
{"text": "Could be coincidence, or it could be an illegal attempt to create enough doubt and “evidence” to challenge results later. \n\n> Ray D’Agastino is the County Commissioner and heads the board of elections was quoted in the article.\n\n> Some other info about this guy:\n\n> After nearly all Pennsylvania counties certified their primary results last year, six Republican commissioners spread out across three counties stood in the way of completing the process.” His county was one of them.\n\n> D’Agostino and Parsons last year voted to remove Lancaster County’s only drop box for mail-in ballots, for instance, and Hopkins is concerned by local commissioners’ crusade against mail voting, which is central to Trump’s own lies about fraud.”\n\n> Two attorneys who were involved in efforts to challenge the results of Pennsylvania’s 2020 presidential election are representing the Lancaster County Board of Elections in a lawsuit recently filed by a labor union-backed group over the counting of mail-in ballots,” he literally brought in attorneys that challenged Biden’s victory in Pennsylvania.\n\n> Lancaster County’s elections office on Monday said 18,554 mail-in ballots sent to voters starting last week contained an error that required the ballots to be voided and replacements distributed,” he fucked up almost 20,000 ballots in the 2022 primaries.\n\n> Duncan Hopkins, an organizer with progressive advocacy group Lancaster Stands Up, who asked Commissioner Ray D’Agostino at Tuesday morning’s work session about his attendance at the March 31 Pennsylvania Election Summit, organized by Cleta Mitchell of the Conservative Partnership Institute. LNP newspaper reported on D’Agostino’s participation in an article on Sunday. Mitchell was part of the team that tried to overturn the 2020 election on behalf of Donald Trump. She has since launched a nationwide project to recruit poll watchers and election officials to “take back our elections.” I mean, that’s just plain frightening. We need to handpick OUR people to run elections so we get the results we want.", "label": 0}
{"text": "Musk is a national security threat and his assets should be seized.", "label": 0}
{"text": "Did the prosecutor pay you to say that?", "label": 0}
{"text": "trump chief of staff, mark meadows cast an illegal ballot in 2020. That says they don't actually give a fuck about supposed voter fraud and they're not worried about anyone finding out.", "label": 0}
{"text": "Tbf, I'd be very concerned in their shoes that I would get Epsteined for ever even speaking of such a conversation.", "label": 0}
{"text": "Which is weird because if internal control is flagging suspicious votes for fraud, that means internal control is working.", "label": 0}
{"text": "Um no his politics have been different than mine for a long time. Did you not read the article that you commented on? I would consider Putin an enemy of the United States and so would a large portion of our population. I do not think the guy who is thriving off of defense contracts and who is personally overseeing many of our spy satellites should be be having private conversations with Putin. Furthermore, it’s the official stance of the United States government that we will protect and defend Taiwan. So why is Elon Musk taking orders from Putin about using star link over Taiwan? That is in direct contradiction of the official stance of our nation. Also, if he is going to do that he should have been open about it from the start and not tried to hide it for so long. \n\nIt’s a lot bigger than republican/democrat when the guy in question is taking defense contracts and handing many of our spy satellites and their intel.", "label": 0}
{"text": "Pull a trigger on a gun pointed at someone, whether you know it’s loaded or not and kill them and see what happens to you. First thing you learn in a gun safety course is not to point the gun at something you aren’t ready to destroy. But he wanted to look like a badass cowboy so fuck em", "label": 0}
{"text": "To be fair, Republicans have been making a habit of committing voter fraud as of late.", "label": 0}
{"text": "You responded \"uhhh. no.\" to \"what if I think they're both innocent\" what was the \"no\" in response to lol", "label": 0}
{"text": ">Which is a very common place to be in, for a tech giant.\n\nYes, but that doesn't make it *profitable*. Which is what you claimed. Which is why I said it wasn't. \n\nYou know, the conversation that happened, instead of whatever tangential thing you're bringing up now. \n\n>I refuse to believe the 'he's just gone delusional power hungry mad' meme.\n\nThe fuck are you on? \n\nHe's just surrounded by yes men and bought in to his own propaganda. Just look at the cybertruck and his messages about Twitter that came out in the court case. \n\nHe BELIEVED he could make it profitable. It was not a reasonable belief backed by reality.\n\nI said nothing about \"power hungry mad\" so come off it.", "label": 0}
{"text": "Reddit ppl only read titles obviously…", "label": 0}
{"text": "Every round was not checked before being brought to set, or before being used.\n\nInevitably at one point or another due to the nature of the components that make live and other rounds and the people that work with them they're both in the same place.", "label": 0}
{"text": "No. Sorry.  If absolutely everything does the D way, the results will still be challenged in the house of representatives, Mike Johnson will send to the state caucuses and Trump will be selected the winner \n\nThis has been discussed extensively by Johnson, and the committee in the House that deals with this hired 3 people who worked with Trump on 2020 to advise them on how to do it.\n\nI really thought this was on knowledge at this point but maybe it's not.\n\nThe courts are just the first line of their attack.", "label": 0}
{"text": "Putin can fight against another country with a strong army and backing it up with resources for years.\n\nMusk can't even win against his own insecurities", "label": 0}
{"text": "So you didn't read the evidence.", "label": 0}
{"text": "fucking reddit", "label": 0}
{"text": "The person responsible for the gun is the gun wielder. Unless he is mentally incompetent and unable to check his own weapon he intended and knowingly pulled the trigger of directed at a living person.", "label": 0}
{"text": "Two weeks!", "label": 0}
{"text": "I guess it depends on a lot of factors. I can afford to go to a walk-in clinic or urgent care, but a lot of things without insurance in the US will bankrupt you.", "label": 0}
{"text": "I still can't believe the MAGA cult turned this into a political thing.", "label": 0}
{"text": "I think people hate feeling useless. I don't believe this to be unique to old men. A ride mower under most circumstances would have been a safe and leisurely activity.", "label": 0}
{"text": "Hi Florida DeSantis, I’m dad", "label": 0}
{"text": "Yikes. Sucks cuz I like onions on my burger", "label": 0}
{"text": "I grew up during the Cold War. \n\nIf a major political and economic figurehead who influenced policy was found to have ties DIRECTLY with the head of Russian state, that person would have had a swift and immediate trial, and it would end in front of a *brick wall*. \n\nSeriously, I have no understanding how so many of the same republicans alive then are now tolerating overt enemy collusion and interference. \n\nOh yeah, money and blackmail. That's all it takes.", "label": 0}
{"text": "The problem with that is that it's a federal crime.", "label": 0}
{"text": "The onions aren’t cooked. It’s much more likely that they are the source of contamination.", "label": 0}
{"text": "a non expert who relies on experts to do their job for safety, was told by the director, his boss, to do a motion toward the camera. \n\nwhy would anyone with a brain capable of consciousness think he deserves to go to jail. \n\nthat's like charging the passengers of a bus crash with manslaughter.", "label": 0}
{"text": "lets finally cancel him.", "label": 0}
{"text": "The revolver was supposed to have dummy rounds in it, so you wouldn't be able to easily tell just by looking at it.", "label": 0}
{"text": "Did Alec Baldwin impersonate Trump for a few years and this orange guy has quite the sway with judges it seems. Makes me wonder if he called in a favor to have this guy’s life ruined. He’s done it his entire life to various people who have called him on his shit.", "label": 0}
{"text": "Per the state dept website, the UN General assy does NOT consider Crimea a part of Russia, but as a part of Ukraine. (Resolution 76/70, passed 12/9/21)\n\nSources: https://www.state.gov/crimea-is-ukraine-2/\n\nhttps://www.state.gov/reports/2019-country-reports-on-human-rights-practices/ukraine/crimea/\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2021/02/26/statement-by-president-biden-on-the-anniversary-of-russias-illegal-invasion-of-ukraine/\n\nIn short, Elon skirted around helping Ukraine in the vital early days of the war, has been in frequent talks with Putin and is all-in for trump with increasingly fascist rhetoric and obscene financial contributions. It’s not hard to connect the dots here.", "label": 0}
{"text": "you’re not wrong. i still hit friends’ vapes when we’re at the bar or just drinking. \n\nso maybe once a month. \n\nnot enough to feel any downsides of it. i’ve said screw it and bought a disposable and they are definitely worse feeling on your lungs than refillable systems. even then it’s night and day between vapes and zyns. \n\nzyns definitely don’t make you feel like shit the way vapes do but instead make you feel like you have to shit lol. \n\ndepending on who you are this is merely a bonus and not a downside. \n\ni couldn’t imagine spitting everytime i had a zyn in. that would be ridiculously inconvenient which is one of the great factors of zyns, their convenience.", "label": 0}
{"text": "Of course it's the plan. Cause fraud, accuse fraud, chaos with attempted profit. How so many American evangelicals think this is the path to Jesus is beyond me", "label": 0}
{"text": "This, me either. I hate Walmart. My anxiety level goes way up the minute I have to go into a Walmart. Unfortunately I have to go sometimes.", "label": 0}
{"text": "A film crew did an experiment like this in Georgia in 2020. If even a handful of people accuse a group of people of voter registration fraud they will be investigated and their votes will not be counted. There is a documentary out about this. It was a test run to see if it weren't. Now the Republican campaign has sent tens of thousands of people to accuse hundreds of thousands of people of voter registration fraud. They're not guarding the poles, they're gathering information to accuse them.", "label": 0}
{"text": "Thats exactly the bit I'm referring to.", "label": 0}
{"text": "Clarifying from a legal standpoint so that it's clear which producer is responsible for which aspect of filming.", "label": 0}
{"text": "No. Did I say that? I'm suggesting that normal, sane people commit heinous crimes every single day. You don't necessarily have to be \"mentally ill\" to commit heinous crimes.", "label": 0}
{"text": "Dead two months into his sentence? The guy was a piece of shit to be sure, but I expect prison officials to at least try to prevent prisoners dying on their watch.", "label": 0}
{"text": "Yost is a fucking scumbag, genuinely one of the worst people on the planet.", "label": 0}
{"text": "Except it was caught so it means that cheating is hard to not get caught...", "label": 0}
{"text": "I mean if your still eating fast food at Applebee's prices but at dollar store quality \n\nI think you only have yourself to blame on being stereotyped", "label": 0}
{"text": "Do you think that only \"mentally ill\" people commit irrational acts?", "label": 0}
{"text": "Sounds a lot more like people paid by the application forged applications. Maybe Wells Fargo can hire them.", "label": 0}
{"text": "regular quarter pounders don't have cheese... that's why the quarter pounder with cheese exists", "label": 0}
{"text": "I care, it's why I don't eat there.", "label": 0}
{"text": "what about that time he wanted to finish an email before a plane took off and yelled at a flight attendant when she told he needed to turn his ipad off or it would confiscated? \n\nor what about all those times he played a jerk in movies and 30 rock? those characters were horrible people!", "label": 0}
{"text": "When I had a clearance, I could've lost it for investing in the wrong company. Fuck, Elon is committing actual treason wtf", "label": 0}
{"text": "For me it was a guy getting shot in the head in broad daylight sitting outside in his car eating at the McDonalds I frequent.\n\nA sign’s a sign.", "label": 0}
{"text": "I was an armorer in the military. When doing exercises, move rounds or blanks, we preloaded and issued magazines.\n\nYou think we then expected everyone to dump there mag and check every round? No. If a live round made it in when they were supposed to be blanks, I would have been fucked.\n\nThe basic that should have been applied here is never allowing live rounds in a scenario where you are meant to use blanks. \n\nThis is all on the armorer.", "label": 0}
{"text": "Prosecutor is probably looking to get onto trump’s radar.", "label": 0}
{"text": "It was a joke.", "label": 0}
{"text": "> The surviving sibling told investigators that the handgun was kept in a lockbox and that the suspect was the only one of the children who knew the combination\n\nAll kids were home-schooled and well known in the community, supposedly.", "label": 0}
{"text": "It's in Canada.", "label": 0}
{"text": "That's not how a film set works. The armorer is responsible for gun safety. They assume criminal and civil liability for the weapons on set. The actors are supposed to follow their directions and trust them implicitly. Outside of show biz yes it's the responsibility of whoever is holding it, but not on set.", "label": 0}
{"text": "Explains why he's gone hard-core MAGA. Trump wouldn't revoke his clearance or pull his contracts.", "label": 0}
{"text": "God obviously didn't like their Trump endorsement.", "label": 0}
{"text": "Eh, you ain't wrong", "label": 0}
{"text": "My favorite quote from the decision has to be the catch-22 \"Because the State's Amended Motion raises arguments previously made, and arguments that the State elected not to raise earlier, the Court does not find the Amended Motion well taken\"", "label": 0}
{"text": "Tech is education has not been a net positive.\n\nI really think if we were still doing things by paper with the occasional projection we'd be in the exact same place and would have saved trillions of dollars.", "label": 0}
{"text": "The timing of this couldn’t be more perfect.", "label": 0}
{"text": "I hear you, I am just very wary of automatically assuming (without any evidence) that, because someone committed a horrible crime, they MUST be mentally ill. I don't think it's a sound logical progression. I think it has the potential to create some very unfair stigmas and associations, as well.", "label": 0}
{"text": ">she corroborated to hide evidence\n\nDid you mean \"conspired\"?", "label": 0}
{"text": "In that case it would be resolved civilly, something like that doesn't rise to the level of criminal conduct.\n\nIf you were injured or killed on the job because your employer failed to enforce all work safety standards for your position, you would sue and they would pay out.  Your direct supervisor, or his manager, or the CEO wouldn't go to prison.\n\nAlternatively, I'll give you a real case I've had that rose to the level of criminal conduct.  Say for example you were a dump truck driver.  Your company sticks you in a truck that has had reported and recorded mechanical issues with the brakes.  On your way to pickup the load the brakes are again having issues, but your boss tells you to just \"be careful.\"  While you are waiting to pickup the load you sit in your truck and smoke methamphetamine.  On your way back with your load you go down a steep hill, speeding, the brakes go out and you run a red light killing the driver of the other vehicle.\n\nIn this scenario there is criminal culpability on multiple levels.  The driver was charged with DUI, for operating a vehicle under the influence of methamphetamine.  The owner of the company was also charged because he knowingly put the truck back on the road multiple times despite clear records indicating an ongoing problem.  That day when notified the issue was persisting he merely told the driver to \"be careful and get it back to the yard\" rather than take it out of service.  If I recall, there were also forged maintenance and safety records for the truck.\n\nThe short story is, we don't put people in prison for accidents unless they rise to the level of negligence.", "label": 0}
{"text": "Np, I’m not sure why you’re getting so much hate though. Imo an argument can be made that Baldwin should’ve checked the rounds before directly aiming a pistol at someone and shooting, and that Baldwin should have known the danger of not doing checking the rounds first. I can see a judge allowing that question to be answered by a jury in a trial.", "label": 0}
{"text": "I just feel like it’s inevitable that he was mentally ill during the act, not necessarily before or after consistently.", "label": 0}
{"text": "Yup. I’m a PA voter and this is why I won’t do our “early voting,” which is literally just filling out and turning in a mail-in/absentee ballot in person at your county’s election office. In 2020, my own freaking Congressman was one of the ones who tried to get a bunch of the legitimate mail-in ballots thrown out because they didn’t like how people voted. It’s going to be even worse this year. I won’t go down without a fight - so I’ll stand in line for freaking ever on Election Day to cast that ballot for Kamala.", "label": 0}
{"text": "And didn't wash his hands, for real. So gross. It's fitting, though, since that location failed their health inspection.", "label": 0}
{"text": "At least Richard Clocks already dead!\n\nOh my god, that reminds me of my wife", "label": 0}
{"text": "Yeah, but he should go to prison, too.", "label": 0}
{"text": "Since the journalists have it, I presume the DOD, DOJ, CIA, FBI, and everyone else and their mother knew about this.\n\nAnd yet he still got DOD contracts. And walks freely. \n\nWTF America?", "label": 0}
{"text": "The attempt was caught as registrations were submitted. If anything it shows that you can't just cheat, it will get caught", "label": 0}
{"text": "You said how it looks, not how it tasted, so who is making things up to try and push their editorialization now.", "label": 0}
{"text": "It’s the same for KFC. Awful in USA, but amazing in Asia.", "label": 0}
{"text": "rittenhouse would be dead and crickets would be coming from that event if he didn't kill someone else. that's a tragic truth.", "label": 0}
{"text": "Yes this dude. I can't stand his guts. Bragging about registering people", "label": 0}
{"text": "I really hope you're joking.", "label": 0}
{"text": "as a new mexican, sadly she just wants to make the spectacle", "label": 0}
{"text": "This was almost certainly people being rewarded for signing up new registrations and faking names to get a bonus. \n\nPetition folks deal with this all the time.", "label": 0}
{"text": "Same here, it's infuriating the shit these people with top level security clearances are able to get away with because they're rich.", "label": 0}
{"text": "I kiss the days when the biggest controversy about a president was the color of his suit. This country has lost its fucking mind", "label": 0}
{"text": "Oh well when you put it that’s way, let’s strip him of US citizenship and cancel his contracts with US. Freeze his assets. If he’s discussing things with foreign governments he needs to let the US government know. To enjoy the benefits of the law one needs to obey the law.", "label": 0}
{"text": "Shirley he filled in Putin as a foreign national contact when filling out the background check portion of his security clearance. It'd be illegal to leave that out..", "label": 0}
{"text": "“My name Is ASAC Schrader - And you can go fuck yourself”", "label": 0}
{"text": "And I'd rather that be their problem than the environments problem quite frankly, as it should be. ", "label": 0}
{"text": ">\"After 150 years, the United States government eventually stopped the program,\" the president said. \"But the federal government has never, never formally apologized for what happened — until today. I formally apologize, as president of the United States of America, for what we did. I formally apologize. That's long overdue.\"\n\nIt's at least as bad as you think it was. Here's a [pair of handcuffs](https://compote.slate.com/images/a1d9525a-07f0-4eca-ad3e-f5fb1c0a9b90.jpg?crop=920%2C516%2Cx0%2Cy0&width=960) used on children. One school even had an [onsite jail](https://slate.com/human-interest/2013/01/small-handcuffs-the-artifact-was-used-to-bring-native-american-children-to-boarding-school.html).", "label": 0}
{"text": "I guess I missed the news where Musk was negotiating treaties and doing diplomat work.", "label": 0}
{"text": "People see all the time these stories on the news of corruption, security leaks and etc. But they don't realize how seriously the military does take these things, does investigate and does prosecute when they can.  \nEspecially the Triad - that is how you will get life or death in Prison.  \nThe military is fucking huge, and as a result things do happen like every other military in the world pretty much. Combined with the news feeding people fear and ratings people seem to not think these things are serious anymore.", "label": 0}
{"text": "Who says the US government doesn’t know?", "label": 0}
{"text": "Maybe but this seems massive. They had 2500 in one rural county and mentioned that two other counties were investigating similar applications as well. If there were similar numbers in every county in the state it would be enough to change the result of the 2020 election.", "label": 0}
{"text": "How many times can you be told your children are being physically and sexually abused and you turn a blind eye? She wasn’t innocent in this.", "label": 0}
{"text": "this is the equivalent of seeing a race car driver die in an accident and saying \"oh well they shouldn't have been speeding\"", "label": 0}
{"text": "exercises, move rounds or blanks, we preloaded and issued magazines.\n\nYou think we then expected everyone to dump there mag and check every round? No. If a live round made it in when they were supposed to be blanks, I would have been fucked.\n\nThe basic that should have been applied here is never allowing live rounds in a scenario where you are meant to use blanks. \n\nThis is all on the armorer.", "label": 0}
{"text": "That’s an almost Trumpian level of word salad there.  \n\nIt’s almost as though you’re struggling with the cognitive dissonance of your own belief that religion is and must be evil, as I’m showing that the logic you used to get there isn’t the argument you seem to think it is.\n\nHumans build institutions.  It’s what we do.  It’s a part of the human experience.  And yes, human corruption always infects those institutions.  No institution is protected from this corruption.  All institutions can fall to evil.  \n\nIt’s obvious you have some unresolved religious trauma.  That’s actually *very* common—it’s almost universal among American adults, because as I’ve been saying, American religion isn’t about community building rituals, it’s about being unwilling to challenge views.  If you’re unwilling to challenge your own views about religion by investigating ones other than Christianity and seeing how they live and how it impacts their lives, then you’re engaged in the same kind of “belief”—that is, you’re trying to shield yourself from information that might cause cognitive bias.\n\nBut if you’re willing to confront your cognitive bias about religion and maybe find resources to help you heal from your religious trauma, go talk to your local Unitarian Universalist Church.  While they describe themselves as a church, and they did emerge from the union of two heterodox Christian groups, they aren’t Christian anymore.  Rather, they primarily function as a group of unbelievers trying to recover from religion-as-dogma.  As such, they have some actually good resources I think you’d benefit from.  \n\nBut that also requires that you put away your anger at yourself for having been wrong about God.", "label": 0}
{"text": "You mean is it 6 white people and 1 black person? Not sure. Ohio is racist these days but I don't think they had the 3/5 counting", "label": 0}
{"text": "Good point, but the person you're replying to isn't the same person who made that argument.", "label": 0}
{"text": "If this is what happened, it's pretty frequent for people being paid for registration drives to just fill in fake info because they're lazy. I remember one election Republicans made a huge deal out of a fake registration for Mickey Mouse. Which is stupid since obviously Mickey Mouse doesn't exist and the registration wasn't successful.\n\nThis case sounds like someone maybe doing the same thing but doing actual homework", "label": 0}
{"text": "The projection by Republicans *continues* to be off the charts. Stay vigilant, Democrats!", "label": 0}
{"text": "My god they need to stop with this nonsense.  The DA is losing all credibility by continuing to bring charges for a crime he’s not guilty of committing.  Thankfully the judge has a sound legal mind", "label": 0}
{"text": "If Trump wins we are essentially Russia. That immunity decision was for the GOP to do whatever they need to do to stay in power. \n\nThis is literally the most important election in the history of the country.", "label": 0}
{"text": "Sure but there aren't perfectly acceptable alternatives to cocaine like there are disposable vapes, these things really aren't the same at all lol\n\n\nRegardless we can't let perfect be the enemy of the good here - these things are a fucking environmental nightmare and so any reduction would be beneficial even if it's not 100%", "label": 0}
{"text": "Why anyone pays any money for trash can food like this is mind boggling 🤯", "label": 0}
{"text": "Bro youd be fucked if you had direct contact with a foreign dictator and didn't divulge it immediately", "label": 0}
{"text": "Why do people buy shit from this morons company? Look at what your moneys going to…", "label": 0}
{"text": "It’s time to do something about these billionaires.", "label": 0}
{"text": "Everyone  assumed you're a troll and an imbecile before you started writing. You didn't have to confirm the suspicions.", "label": 0}
{"text": "So, is Gitmo still a thing?", "label": 0}
{"text": "But they are very difficult burgers to not fully cook through…they’re very thin…\n\nIt is statistically more likely to be the uncooked onions than the cooked to death burger and is the logical place the start the investigation. \n\nIt *might* beef, but even the lettuce or tomatoes have a better chance of being the culprit despite not having any recalls currently ongoing.", "label": 0}
{"text": "Yup. Personally, unless McDonald’s corporate puts out a statement condemning that little stunt I won’t be going to a McDonald’s again. And it won’t be for a while even after they do that I go back", "label": 0}
{"text": "Two years, you say? Well here's an [AP article about Musk refusing Ukraine's request to use Starlink in Crimea in Sept 2022.](https://apnews.com/article/spacex-ukraine-starlink-russia-air-force-fde93d9a69d7dbd1326022ecfdbc53c2)", "label": 0}
{"text": "Movies and TV always portray a prosecutors win rate as the most important thing, even if it’s wrong.\n\nGuess there is some truth to that trope", "label": 0}
{"text": "AP is missing a lot of information. This is a large scale criminal investigation with all of the county detectives and multiple counties involved. They contacted the people listed on the fraudulent applications and most of them stated that they did not submit the application. Many of the names, SSNs, etc. were also fake, and they have all been linked to one or two groups doing voter registration drives.", "label": 0}
{"text": "A jury would see:  \n-  Halyna Hutchins was killed by a bullet  \n-  fired from a gun held by Alec Baldwin  \n-  who made statements he didn't touch the trigger  \n-  with testing showing the firearm would not fire without the trigger depressed, and photos showing Alec's finger on the trigger contrary to his statements  \n-  and that New Mexico's statutes and unified jury instructions state that guns are considered inherently dangerous and handling them without 'due circumspection' is criminal negligence in line with the charge of involuntary manslaughter\n\nThere is no carve out in the law currently for actors on movie sets.  It could be found by the jury that they believe there should be one and that following SAG guidelines should be considered 'due circumspection' as opposed to the current standard (that I believe says treat every gun as if loaded, don't point a gun at something you're not willing to destroy, and keep your finger off the trigger until you are going to fire), but that has yet, as far as I am aware, not been decided and become case law/precedent.\n\nWith this fact pattern I am certain 10/10 times I would be charged, you would be charged, Keanu Reeves would be charged, or Denzel Washington would be charged.  You and I would almost assuredly be convicted, 50/50 on John Wick and Man on Fire though...\n\nI'd also point out that Baldwin was handed the gun by assistant director Halls, and Baldwin was, or should have been, aware of multiple negligent discharges on set, and waived inspecting the gun himself for a blocking practice that didn't require him to use a gun nor point it at anyone...\n\n...So even if in theory there should be a carve out for industry standards counting as 'due circumspection' there is a fact question for the jury on whether those industry standards were even followed here.\n\nSo the tl;dr: the fact pattern in the case against Baldwin would have landed you or I in jail every single time, and even with this happening on a movie set the law and sloppiness on set would have exposed Baldwin to a serious risk of being convicted by a jury.", "label": 0}
{"text": "Monkey paw curls. The immigration officer is Clayton bigsby and he already worships Elon", "label": 0}
{"text": "Oh shit. You're saying they trained her on how to handle a car safely beforehand? Imagine that.", "label": 0}
{"text": "So every actor in a movie must be guilty of attempted manslaughter by “pointing a gun and shooting at” another individual during the course of the film.  Completely asinine logic", "label": 0}
{"text": "They really want his liable for something, don’t they. Dude has no culpability in this matter, leave him be already.", "label": 0}
{"text": "Unsurprisingly, two years ago, Elon bought Twitter and now it's a megaphone for Russian disinformation.", "label": 0}
{"text": "Play stupid games, win stupid prizes it’s a fucking gun", "label": 0}
{"text": "I disagree.", "label": 0}
{"text": "Until we get the unlimited billionaire dollars out of politics, anyone we put in will become just as corruptible.  \n\nSCOTUS has legalized corruption and bribery and this is the result.", "label": 0}
{"text": "More Apple-Crummy and Filth?", "label": 0}
{"text": "I understand. I'm not arguing the reality of the situation. I just think it's irresponsible after the crow, and now rust for people to still be allowing this.", "label": 0}
{"text": "They need to revoke his security clearance and seize his assets.", "label": 0}
{"text": "How many producers were involved in the film?\n\n\nWhich producer was to oversee the armorer?\n\n\nOh, you don't know? Ok\n ", "label": 0}
{"text": "Taylor Farms had ecoli in salads recently too. ", "label": 0}
{"text": "I'm almost amazed that such an industrialized process will still have ecoli outbreaks.... Someone as big as McDonalds could just add an irradiation step at the end of their process. It's not like individual franchises are sourcing their own beef & onions  \n  \nlife finds a way I suppose. I wonder if E coli has at all adapted to the mitigation efforts of the past 60 years.", "label": 0}
{"text": "Guns are absolutely special. You can take a person's life by pulling your finger. There are few things as dangerous as easily as a gun.", "label": 0}
{"text": "Sure, assuming recycling doesn’t change in the next 20 years", "label": 0}
{"text": "I wonder if they are just waiting out for the election results.\n\nAll these rulings/judges/trials seem to be \"on hold\" as to not influence the election.\n\nWe're over here like \"rich people always get off\" but I also keep an open mind that these guys are trying not to give these guys a persecution/martyr excuse.\n\nI really hope Kamala wins, because I really am looking forward to Trump, Elon, and their ilk behind bars. Even then, who knows, but I just hope Kamala wins.", "label": 0}
{"text": "Then why aren’t we seeing E. Coli outbreaks from other restaurants?  Taylor Farms doesn’t just supply McDonald’s.", "label": 0}
{"text": "It was the sliced onions.\n\nThis all happened awhile ago. Unfortunately it takes a long time to track down food borne illnesses and the additional cases are likely people that got sick now realizing it was from McDonald's.", "label": 0}
{"text": "Thankfully, the Vice President has the authority now to not certify any results we may think are fraudulent.  The candidate gets to pick the winner just like Mike Pence wasn't brave enough to do!", "label": 0}
{"text": "I needed authorization 3-6 weeks in advance to travel out the country. Chatting with foreign dictators? Straight to gitmo.", "label": 0}
{"text": "He wanted to buy refurbished ICBMs from Russia, but the asking price was too high, so he decided SpaceX would just build their own rockets instead", "label": 0}
{"text": "We need to start avoiding all Musk companies and push our elected officials to investigate this immediately. Musk has overstepped big time.", "label": 0}
{"text": "Everyone with any semblance of common sense knew this case was a complete accident from the start. The way it blew up is a joke! Like have they got nothing better to do? He’s an actor not a fucking hitman", "label": 0}
{"text": "We're gonna pretend like the context doesn't matter at all?", "label": 0}
{"text": "Amen he deserves a years worth of good meals, and fuck all the pdfs who dont like it", "label": 0}
{"text": "The part that some might miss is, they were caught. And I understand there are always rejected registrations which seems to mean the system usually works.", "label": 0}
{"text": "Colorado and Michigan too. Their double votes were counted in the primary", "label": 0}
{"text": "Breakfast at McD's in Japan was pretty on point... but I tried a burger at lunch and it was disgusting.\n\nI also tried KFC in Japan during Christmas because it's a \"tradition\" there, but it, too, was horrible.\n\nI'm not even going to try some of the others tbh.", "label": 0}
{"text": "Anti American, pro self.", "label": 0}
{"text": "Should just have people show up at the capital and stand on the side they want. At noon on the 4th, the bigger side wins. In person, no excuse, for god and everyone to see.", "label": 0}
{"text": "I was about to post during the whole PA paid registration thing, that Musk seems awfully desperate to have Trump win. \n\n\nNot that it was any kind of secret but it seems he might be in a heap of trouble if Harris wins. Hope I see him on trial.", "label": 0}
{"text": "I mean DJT stole troves of top secret documents and didn't return them when asked and fought court officials every step of the way and we are about to elect him president again.\n\nNothing matters.", "label": 0}
{"text": "I meant Indian as in people who immigrated to Canada from India.", "label": 0}
{"text": "Little bit late for the. The government depends on Musk to much now with SpaceX. They destroyed NASA and leaned into SpaceX to fill the void and now they're stuck dealing with a company that has a maniac in charge. Gee, maybe they shouldn't have defunded their government owned space company so hard and out sourced it, I don't know.", "label": 0}
{"text": "I'm a gun nut and something that's more than a liberal but not full on \"your stuff is our stuff\". The reaction from the gun enthusiast sphere was both expected and disgusting. They're the kind of people that shouldn't be trusted with the responsibility the 2nd Amendment asks for. ", "label": 0}
{"text": "Mesa Co. The same place where that election chick went to prison.", "label": 0}
{"text": "That's precisely what a guilty person would do! /s", "label": 0}
{"text": "There is absolutely nothing inherently \"threatening\" to talk to another human being. There is no \"ban\" on talking to people. You guys are just so hopped on on hating Elon you don't even think through things. This isn't Russia. People are free to talk to literally anyone.\n\nDo you think the US government isn't aware of this, and hasn't discussed and cleared him on this?", "label": 0}
{"text": "Ah shit.... Here we go again. ", "label": 0}
{"text": "\n>*inb4 people with the “producer is just a vanity credit” response no, on this one he wrote the thing and was a major part of it getting made from the beginning\n\nLmao. You can’t just type that to handwaive all of the valid criticism you seem to understand exists surrounding your argument. \n\nYes Baldwin wasn’t the type of producer where he gives some money and gets a producer credit under his name. He was indeed more involved than just that. \n\nDoes that translate to his involvement made him responsible for ensuring safety on the set? Overseeing the armorer? You have literally no clue about any of these details, yet you seem to be so willing to conclude that he would have been simply because he was a producer.", "label": 0}
{"text": "I’ve legit see conservatives say we should keep redoing elections until 0 discrepancies are found. Which is fucking insane. Imagine having to redo a national election because some crazy old person sent in a ballot for their dead spouse or accidentally put in their old address after they moved into a retirement home.", "label": 0}
{"text": "McD's corporate approved of the stunt in the first place.", "label": 0}
{"text": ">But that individual doesn't have the ability to choose whether they want to live with a disability until they are born.\n\nEven when they are born, they do not have the ability to choose.  They must live with the hand they are dealt.  It is not for several years that one develops the intelligence needed to understand and make decisions about their own life/health/future.\n\nKnowing this, parents and healthcare providers make decisions on behalf of children, babies, infants, and the unborn.  Not everyone will agree with how everyone else makes these decisions, but that is a separate problem entirely from having the ability to choose to have an abortion in the first place.", "label": 0}
{"text": "His parents gave him the code for the lockbox. To have access in case of “emergency and protection.”", "label": 0}
{"text": "You should stop replying because you don't know anything about what you're talking about\n\nA big controversy at the time was that himars was range limited to 50 miles because the US government was not willing to authorize strikes into defacto Russian territory. With Russian forces on the western bank of the Dnipro river, Crimea was squarely out of range. So why should a private company be willing to do what the government was not willing to. It was in lockstep with US policy.\n\nStop making assumptions about things you don't know about", "label": 0}
{"text": "The fact that musk feels comfortable doing that implies that there is reason to believe he will never face prosecution for it", "label": 0}
{"text": "\"Hey guys he doesn't want to be on Earth\"", "label": 0}
{"text": "It's so fucking crazy that he isn't being disappeared into gitmo, never to be seen again.", "label": 0}
{"text": "It’s like swatting. One person doing thousands of them. Honestly there should be fines or prison time if you abuse the system like that.", "label": 0}
{"text": "The prosecutor is a Democrat. This has nothing to do with Trump. Not everything that happens is about Donald Trump. \n\nThis is about a prosecutor who wants to get attention to advance her career.", "label": 0}
{"text": "It's a duty of the office of the presidency to protect classified information, right? So Kamala's first 'official acts' could be to shoot down his jet & unilaterally nationalize his companies.", "label": 0}
{"text": "Now is probably a good time to get out of those stocks, if you haven't already. \n\nThis is craziness and investors aren't going to want to get mixed up in that.", "label": 0}
{"text": "There's publicly available video evidence but do u", "label": 0}
{"text": "Didn't that come up though?\n\nMy understanding is that the judge tossed that argument out when none of the other higher ups were up against the wall. Not knowing much of anything about the case or the law over there that would kind of make sense to me, over here you're not suppose to apply laws unequally and things can get tossed out when you do(like a speeding law that is unenforced on a given road except for a certain class of person). It would kind of match the rest of the weird handling of the case that people talk about.", "label": 0}
{"text": "How horrific. I cannot imagine that like.. I have to charge headfirst into this meat grinder for a war I don’t even believe in, that isn’t for my country..", "label": 0}
{"text": "Yes, sure; BUT WHEN WAS WALZ IN CHINA? June or August?!  JUNE????  AUGUST????!?!???", "label": 0}
{"text": "Those judgeships don't just award themselves, you know.", "label": 0}
{"text": "Someone needs to take a look into the Anduril guy as well", "label": 0}
{"text": "Well, you said it yourself. You don’t know how things work in Hollywood. \n\nIt’s the one place where to make realistic looking movies, they intentionally break those rules. Whether that should change or not, the reason this is acceptable is because of the extensive length studios go to make sure there are teams in place to ensure doing just that is safe and doesn’t result in any injury. And those teams and individuals are the ones that take one the liability, not the actors being handed what is supposed to be a safe prop so that the production can make their realistic looking film. \n\nYou can argue those rules are bad and should be changed. But they absolutely are the current standard in the movie making industry.", "label": 0}
{"text": "I had never even HEARD of this at school (ofc) and went to an exhibit to learn about it as a whole ass adult during a trip to ser family in Scottsdale. \n\nIt made my physically ill. I would like to say \"I can't believe the horrors..\" but I'm a black American so I can believe it. \n\nBut 150 years of untold cultural genocide, abuse, terror...on children....\n\n\nIt's despicable and this apology is long overdue", "label": 0}
{"text": "Nice integrity of data you got there, sampling the untrained public.", "label": 0}
{"text": "While I don’t particularly have remorse for Alec Baldwin, I do feel like maybe it’s time to just leave him alone.", "label": 0}
{"text": "Didnt he move to pull starlink out of Ukraine 2 years ago?", "label": 0}
{"text": "The producer with responsibility for under the line staffs and to whom the armourer and her immediate superior reported, was a woman called Gabrielle Pickle. \n\nOSHA confirmed Baldwin had no direct reports under the line, and so have no control — and this responsibility — for the armorer and AD. \n\nBaldwin producer role allowed him vetoes on casting and script changes only. \n\nWhen you realise “producer” is just a fancy Hollywood word for “manager”, and that there are hundreds of people on a set with many different managers, it’s clear that that you can’t hold one manager arbitrarily responsible for the a separate team being supervised by another manager.", "label": 0}
{"text": "Actions worthy of a shotgun blast to the face?\n\nThe real q is whether 35 yrs in prison for the perpetrator(s) for that action is sufficient. While you may disagree, I say no", "label": 0}
{"text": "He really shouldn’t. This prosecutor isn’t relentlessly pursuing him in the interest of justice, she’s trying to score brownie points with the potential next president of the United States. Who of course doesn’t return the loyalty he demands, but is very butthurt about Alec Baldwin parodying him on SNL for 4 years. She probably thinks she can get a job offer from this, which is why she committed a Brady violation to try to secure a conviction.", "label": 0}
{"text": "I will point out I'm someone in a HICOL state in a town that borders two mega HICOL towns. We have a franchised McD right on the border between the towns. Owners are super active in the community, place is kept spotless, employees treated amazingly. Their burgers and fries look as close to the pictures as you can get without the gloss or non food items, like you can open a box and the burger inside actually looks and smells the way the ads make you imagine. \n\nI'm 100% sure it's because of their location and the care the owners put in, and they are the exception rather than the rule, but some places it really is a different experience. I mean this place has a working milkshake machine all the time, lol.", "label": 0}
{"text": "\"The federal government often contracted with Presbyterian, Catholic and Episcopalian religious institutions to run the schools\"... now there's a recipe for disaster!", "label": 0}
{"text": "You’re the man. Thank you", "label": 0}
{"text": "I had one a couple months ago. I remember getting them as a teenager and liking them, but I'm not sure if it's the meat or what, but it was pretty disappointing.", "label": 0}
{"text": "I would absolutely love if his U.S. Citizenship is revoked.", "label": 0}
{"text": "Remember that kid who shared information in his friends discord?", "label": 0}
{"text": "Baldwin didn’t have the right to discipline under the line staff. The producer tasked with hiring and supervising them was Gabrielle Pickle. \n\nBaldwin’s executive producer credit gave him veto rights over casting and script changes only", "label": 0}
{"text": "The Michigan marijuana market is producing a metrc fuckton of disposables right now.  A lot of us aren't very happy with this but there's so many people buying them that they're profitable.  We even have .15g hash rosin disposables being sold.", "label": 0}
{"text": "Imagine going back to 1995 and telling someone that the cold war is still happening and we're probably going to lose.", "label": 0}
{"text": "I’m only Middle Aged but it gets really frustrating not being able to do a whole lot and having to sit  around bored when dealing with/recovering from a serious illness. Sometimes we do stupid things to feel capable or really just normal for an hour or so. I think my biggest offense was stopping in at a Taco Bell while actively receiving chemo from a portable pump and an IV bag in a sling . It’s…not my proudest moment and I can’t defend it , (certainly would have been a stupid thing to die from) but I thought I could provide maybe a little insight.", "label": 0}
{"text": "Yeah same. I used to eat em all the time when I was growing up. But as an adult every time I got one it was dry, a mess, and just… off. \n\nDouble cheese is a 1/3 of the price, and in the least because it’s in a wrapper it isn’t in pieces when I open it. Although none of it is good for you, I’ll always eat McDonald’s on the road or in a hurry.", "label": 0}
{"text": "This is an excellent rule", "label": 0}
{"text": "As a western slope resident, Mesa county is fucked. People from elsewhere can’t really understand what goes on in Grand Junction.", "label": 0}
{"text": "Being in contact with Putin and Xi can’t possibly badly right?", "label": 0}
{"text": "Any yet today many people want to disregard Native American Indian culture and religion. “The only god is my god” mentality.", "label": 0}
{"text": "San Antonio, or is this a more frequent occurrence?", "label": 0}
{"text": "I feel cheated. I had to go two blocks and pay good money to get similar treatment earlier this month.", "label": 0}
{"text": "Trust me, it doesn't lol. It's just like them yelling about the numbers at the border claiming Biden is letting them all in, when those numbers are based off border patrol stopping immigrants.", "label": 0}
{"text": "You misspelled \"Popeyes\"", "label": 0}
{"text": "That has been my experience as well. The Lancaster county Amish adult men that I have been around have credit cards, state issued IDs without a picture (which they use to get their bank accounts), and I would hazard a guess to say that if they own property, they are also claiming tax exemption (taxes on 50+ acres of land is costly).", "label": 0}
{"text": "That’s one good thing the heritage foundation might be good for (I’m still skeptical). They keep a repository of convicted instances or voter fraud. https://www.heritage.org/voterfraud-print/search\n\nThere are block entries that show what a voting precinct finds wrapping up an election in review. \n\nThey look something like this:\n\nTexas, 2024, Harris County 180th District Court, Judicial Finding, False Registrations, Fraudulent Use Of Absentee Ballots\n\nThe result of the 180th District Court judicial election was overturned in Harris County, Texas, after a state judge concluded that over 1,400 illegal votes had been counted. The margin of victory was only 449 votes in an election with over one million votes cast. However, the judge found clear and convincing evidence that:\n\n- 983 votes were cast by individuals who did not reside in Harris County, listed incorrect residences, or used non-residential addresses (such as PO boxes).\n- 40 absentee ballots lacked required signatures, and 8 ballots were mailed late.\n- 445 voters did not provide proper identification or acceptable substitute documentation.\n- 5 provisional ballots lacked a signature, and one lacked a photo ID or acceptable substitute.\n\nIn total, the court ruled that 1,482 illegal votes were cast, significantly exceeding the 449-vote margin between the two candidates. The court ordered a new election.\n\nSource: herit.ag/3Y4e2VV", "label": 0}
{"text": "Anything to avoid the plain fact that Baldwin thought it was funny to point a gun at people and pull the trigger, and the rest of us would easily get a charge and conviction for that.", "label": 0}
{"text": "It had more to do with Target fucking up then Canadians kicking them out. Everything that could wrong did.", "label": 0}
{"text": "Could be something happening in the process between the farm and getting the quarter onions to the store.", "label": 0}
{"text": "Hands up, who DIDN’T already know this?", "label": 0}
{"text": "AND DID KAMALA ACTUALLY WORK AT A McDONALDS!? AMERICA NEEDS TO KNOW!\n\nBecause if she didn't then we might need to vote for the Hitler worshiping felon rapist who did an insurrection and mishandled a pandemic and is a bumbling fascistic moron.\n\nSuch a tough election choice.", "label": 0}
{"text": "From what I recall, they arrive fresh, whereas the onions that go on the 10:1 burgers are dehydrated and come in a plastic jug that you peel the lid off of and put some water in.", "label": 0}
{"text": "I'm shocked they haven't bailed already. Elon's been getting more openly fucking stupid ever since he declared that rescue worker was a pedophile ages ago.", "label": 0}
{"text": "Lol. Give wsj a call. I am sure they'd give you the dits!", "label": 0}
{"text": "If this was the Cold War, the government would’ve seized X, Starlink, Space X, and Tesla", "label": 0}
{"text": "What a selfish way to commit suicide.", "label": 0}
{"text": "Nice, now let the, have all their artifacts back.", "label": 0}
{"text": "Hell ya. That's my president", "label": 0}
{"text": "His producer role for this particular film wasn’t the vanity title that they often are, as I understand it he was heavily involved with writing the script as well as potentially overseeing casting. But it’s my understanding that apart from also acting in the film, his roles and responsibilities as actor and producer end there.\n\nSomeone else hired the incompetent armorer who was at fault for this tragedy, the fact that the gun was in Baldwin’s hands at the time is effectively circumstantial. Shooting the gun is literally part of his job as an actor, it’s not his responsibility to check that a cold gun is actually cold if he’s been told that it is, just as you have said.\n\nThe whole thing was effectively a political prosecution. If some other actor had been holding the gun, this case likely would have had the same outcome, but it would never have been re-litigated to this extent.", "label": 0}
{"text": "Not really, a boiler operator takes care of the day-to-day running of the boilers. If you’re in a hospital, I’d guess you guys have a couple high pressure steam boilers to supply the sterilizers and maybe some low pressure ones possibly to heat the building?\n\nBoiler operators basically make sure everything is running as it should, they don’t really go into them and the boilers at a hospital would be much, much smaller than the one I was talking about above (typically find them at sawmills).  My job is to make sure all the safety devices function as they should and inspect the physical integrity of the pressure containing components.", "label": 0}
{"text": "I've seen this comment or similar a few times in a few places now. Are you a robot or a real person ferociously posting the same comment on various sub reddits?", "label": 0}
{"text": "They need to just admit that it came from bronzer dripping into the fries", "label": 0}
{"text": "To be fair he didn't intend to buy twitter. He was shitposting and meming. He tried to back out after he signed a contract because he's an idiot and the courts forced him to honor his contract. Remember he paid way more than the value of twitter at the time and has been losing revenue pretty much ever since.\n\nHe's just been addicted to it because he's in constant desperate need of validation from his fruity cult ever since.", "label": 0}
{"text": "Smells fishy … laying ground to claim fraud for Tangerine Man?", "label": 0}
{"text": "It was so fucking frustrating being with a couple who are friends of mine, and the husband (more or less conservative) laughing at Baldwin, says they should throw the book at him, but he then said they \"were being too hard\" on the armorer, who is the biggest fuck-up in the century. My head was spinning.", "label": 0}
{"text": "Imagine Bernie Mack saying surprise surprise mother fuckers.", "label": 0}
{"text": "He went hardcore MAGA because his tech bro crypto fascist fan base are all far right libertarian reactionaries and he also doesn't want to like.. Pay his employees because he's an unethical rich billionaire apartheid emerald mine heir with big time daddy issues.", "label": 0}
{"text": "I really do like and hate this heritage foundation database of voter fraud. \n\nOn one hand, I hate that it's a site set up to scare people into thinking that voter fraud is some huge pervasive problem. \n\nOn the other hand, I like that they have the numbers, and if you actually look at them you notice that people commit voter fraud about as often as they get struck by lightning.", "label": 0}
{"text": "Yeah honestly as others said, it's been 20 years for me so I'm not sure what they do now but they used to come in large clear plastic bags that we'd cut open and dump into smaller containers. I want to say we added water as well but honestly I just don't recall", "label": 0}
{"text": "What on earth is this prosecutor doing??? It feels like it has come more about her ego than justice.", "label": 0}
{"text": "I caught my trump supporter friend the other day watching a thing claiming Kamala isn't actually black....", "label": 0}
{"text": "Can we please force him to sell spacex now? Also, if you're a even a half decent person you should delete your xitter accounts permanently.", "label": 0}
{"text": "Yup patties are cooked pretty well normally so it's probably not from that. E.coli is almost always produce because it's not normally cooked.", "label": 0}
{"text": "He's been getting help.  Now we know where.", "label": 0}
{"text": "How? \n\nShe is a nerd, yet somehow she will set science stuff behind... Like literally the VP .. this is their portfolio .. space shit. The last few years she has been good for space program. Somehow, she becomes president and the shit she has been portfolio-ing gets set back by a massive amount?\n\nPick a fucking lane. Stop making up shit elona muska!", "label": 0}
{"text": "ADX Florence??? That's the minimum of what this traitor deserves.", "label": 0}
{"text": "They will not abandon thier Conservatism, but rather they will abandon democracy.   \n\nJan 6th was a poorly executed attempt already.   Do not expect these zebra to change thier stripes.   Best we can hope for is the leopards to eat thier faces, while the adults fix shit.", "label": 0}
{"text": "*there are a lot of Midwesterners and East Coastians who transplanted to Phoenix in the last 30 years and brought their white privilege with them.", "label": 0}
{"text": "I wish I got sick from this. I need dental work.", "label": 0}
{"text": "Carmel valley, not Carmel by the sea /s\n\nBut for real, thought the same thing", "label": 0}
{"text": "> cooked to absolute death so it will kill anything in or on it\n\nKill, yes; Remove, no. Many bacteria (don't remember which ones, so maybe or maybe not this one) produce toxins that aren't destroyed by cooking (unless you cook it so hot that the food itself is destroyed and inedible).", "label": 0}
{"text": "I'm more concerned with Elon having control over all those satellites and so on. He's embedded in the military industrial complex.", "label": 0}
{"text": "Easy to tell he's from South Africa even if you are blind.", "label": 0}
{"text": "You know this story came from wsj?!", "label": 0}
{"text": "He found a new opponent.", "label": 0}
{"text": "The only true thing he ever said: 'I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn't lose any voters, OK?\"", "label": 0}
{"text": "what? blanks have no bullet attached, the ends look very different. how do you think the armorer checks lol", "label": 0}
{"text": "Reminder that Florida did this in 2020 and found about 10,000 people.\n\nThey convicted one of them. And quietly dropped the other 9,999 that were wrongly accused.", "label": 0}
{"text": "Wow another new one? Or you are just reposting?", "label": 0}
{"text": "Probably by pointing it in that general direction and putting it in gear.", "label": 0}
{"text": "Black ink", "label": 0}
{"text": "We still consider it a \"prop\" from the perspective of the production.", "label": 0}
{"text": "I had vaguely heard of these boarding schools, but as an adult and not from school.  But it wasn't until their depiction in the \"1923\" TV series that I realized how truly awful they were.  At first I thought \"This is just for TV drama, I know they were bad but they can't *really* have been as bad as they are depicting.\"   Then I hit up Google and learned the terrible truth.", "label": 0}
{"text": "She wasn't an international student she apperently came here 2 years ago from the UK", "label": 0}
{"text": "Yeah, and it’s hard to tell what affiliation they are. It seem as though alot of what is recorded is just dumb stuff and people doing the wrong thing in municipal elections. \n\nYou can also see that the punishment for registering to vote and casting a vote while ineligible can be unevenly administered. I get that there can be malice, the majority don’t appear to be made with malice. It largely appears that the governments in these places have a flawed system that allowed ineligibles to register and cast a vote. That’s two gates that were left wide open for it to happen and they punish the person?", "label": 0}
{"text": "Too soon =-(", "label": 0}
{"text": "Yeah, I understand. My brother was ready too, according to my mom. But my issue is, he shouldn't have had to be ready. He shouldn't have had to deal with death at that age. I'm trying to live happy, I am happy alot of the time, it's just if I'm alone with my thoughts, it's a guarantee if gonna think about it", "label": 0}
{"text": "The GDP of Russia is around $1.8T, so you could estimate it at that. Explains why Musk is jealous.", "label": 0}
{"text": "This is all assuming he has the clearance. Just because a company does stuff for the government doesn't mean that everyone involved in the company has high level clearance; hell not even leaders at the company might.\n\nA great example is the fact that some defense contracting companies for the military are HQed in the UK but due to the type of projects involved; the execs back in the UK won't ever know what that arm of their company is doing. This could be a similar case for Musk.", "label": 0}
{"text": "Not according to the FDA and USDA. The last recall they had in the United States was for a miss branding and undeclared allergen in an Apple walnut salad. They had recall for Salmonella in Canada in Feb., however, those products were produced and only sold in Canada.", "label": 0}
{"text": "This is wild because I was recently denied a security clearance due to a recent bankruptcy declaration.  Dude is literally talking to our enemy", "label": 0}
{"text": "Because the death penalty is used disproportionately against persons of color.", "label": 0}
{"text": "They probably made that mistake because the only people in the general public that seem to be invested in this trial are all in the MAGA sphere. It’s a weirdly partisan nonpartisan event.", "label": 0}
{"text": "Here is a fun fact , Rupert Murdoch was called \"Red Rupert\" when he was in university because he kept a bust of Lenin in his room .", "label": 0}
{"text": "America sure loves to bend knee and pray to its billionaires", "label": 0}
{"text": "Was about to post that as well. He’s got his “secret list.”", "label": 0}
{"text": "I didn't vote for you to appoint a judge either.", "label": 0}
{"text": "Elon should be in prison for treason but billionaires make their own rules and we just live in their world.", "label": 0}
{"text": "Again, I’m surprised that people find this eye opening to be honest.\n\nRace car drivers (like NASCAR and Formula 1 for instance) are allowed to be aggressive on the track in ways that wouldn’t be allowed during everyday driving. I’m really not sure why people find it so difficult to believe that guns work similarly. \n\nRules should be fit for purpose - so to me it makes sense that a mantra like “the buck stops with the person holding the gun” doesn’t necessarily apply to certain niche professional use cases where the situation is very very different from personal use. Especially when those situations have specific controls in place to mitigate the increased risk.", "label": 0}
{"text": "I feel like we are in some kind of constant fever dream with this shit where 2 years after a scandal breaks out there's some report reaffirming it and we are supposed to pretend like its breaking news. \n\nThat has happened so many times within the Trump era.", "label": 0}
{"text": "What’s funny is I’m in Colorado and I’ve had a few quarter pounders out here and they all look way closer to the ad pictures than what is shown in Colorado. Thankfully none this year though…", "label": 0}
{"text": "True, but that doesn't change the sentiment. Nir the injustice", "label": 0}
{"text": "I hope the 'cameras we're undergoing maintenance' at that time and the hero who did this good deed to society walks free.", "label": 0}
{"text": "It's almost like they're rich enough and white enough to get a Netflix documentary, which showed that they're white enough to have their sexual abuse claims taken seriously. And the DA wants to curry favor with a certain demographic by showing that they're willing to let rich white guys walk free, even after they were fairly convicted by a jury of their peers.", "label": 0}
{"text": "In fact, they did, and the judge eventually ruled \"No, you aren't charging him as the producer of the movie, you are charging him as the actor\", or thereabouts.\n\nThe point being that the jury wouldn't have been able to consider his role as a producer if it had eventually gone to the jury.", "label": 0}
{"text": "Add this reason on the pile of reasons not to eat at McDonald's, and McDonald's will still have a line around the corner in some areas. It's just astounding how stupid some people are. \n\nThis company has been smacking people across the face with red flags and they just lap. It. Up.", "label": 0}
{"text": "\"Collaborated\" might have been their intended word? But \"conspired\" seems more correct for what they're trying to say", "label": 0}
{"text": "> I just don’t trust felons to mete out “justice” to only deserving inmates.\n\nbut you trust the state to do that?", "label": 0}
{"text": "Well, if a ”report“ says so.", "label": 0}
{"text": "Why do we care about what the weapon looked like? Unless it's some crazy home made shit.", "label": 0}
{"text": "That’s possible, I don’t know.", "label": 0}
{"text": "Whatever he did to his face is a war crime", "label": 0}
{"text": "Reservation Dogs had a wild episode about this.", "label": 0}
{"text": "https://civileats.com/2020/11/02/how-four-years-of-trump-reshaped-food-and-farming/", "label": 0}
{"text": "It's simple to not want the state to hold the power of death over someone, it's also rare that another inmate kills a wrongfully accused person for crimes they didn't commit. Also from a fiscal perspective death row is far more expensive than life long imprisonment and the issue figure itself out is cheaper too", "label": 0}
{"text": "bros a fucking traitor", "label": 0}
{"text": "Does a dismissal like that leave the prosecutor open to being sued for things like legal fees?", "label": 0}
{"text": "It's the specialized niche professional use case that's the issue here. The average person is not aware of how filmmaking uses firearms, so they assume guns on set must follow the rules of personal gun use.", "label": 0}
{"text": "Imo Disney World was worse than universal.\n\nAt Universal the app was mostly just for food, but at Disney it was for *everything*. \n\nin order to make the most out of the thousands you're dropping on a Disney trip you had to spend that whole trip looking at your phone trying to micromanage everything through the always crashing app.", "label": 0}
{"text": "🤮\nPeople like that should NEVER be released. Anyone who releases them should be put in prison themselves.", "label": 0}
{"text": "Destroying young children deserves torture & death.", "label": 0}
{"text": "Why does he have security clearance?", "label": 0}
{"text": "Yep, my grandma got sent from the Blackfeet Reservation in Montana all the way to a Catholic boarding school in Tacoma. There were several just in Tacoma.", "label": 0}
{"text": "If I believed in heaven, I’d imagine Phil and Jerry are about to have a good time. \n\nRest in peace, Phil.", "label": 0}
{"text": "Unfortunately, Native American affairs rarely make a ripple. I don't think this will matter at all in the election.", "label": 0}
{"text": "This is CORRUPTION people. He's trying to tilt the scales to gain more power.  This will end us all", "label": 0}
{"text": "The rage would certainly kill someone.", "label": 0}
{"text": "Makes total sense why he said he wasn't supporting either candidate and the suddenly he's funneling 80 million into the Trump campaign and jumping up and down for Trump like a dipshit.", "label": 0}
{"text": "Aren’t you finished with Hunter Biden yet?", "label": 0}
{"text": "I just know Phil, Pigpen, and Jerry are having a hell of a fucking jam session right about now. The music will never stop! ⚡️💀", "label": 0}
{"text": "Yes, but people will still buy Teslas because what Musk does outside of the company isn't at ALL related.\n\nTesla = Musk = MAGA.\n\nBut a new Tesla and you're directly supporting Russia's MAGA agenda in the US, courtesy of Musk: the purposeful face and primary beneficiary of Tesla.", "label": 0}
{"text": "My god. What a vile thing to just make up out of nowhere. Just wait for the facts, ffs", "label": 0}
{"text": "Is US counterintelligence COMPLETELY ineffectual at this point?", "label": 0}
{"text": "Wow. Guess it had to happen sooner or later but it always hits hard when it does. Rip buddy", "label": 0}
{"text": "Yep, they call it TS-SCI. Top Secret - Sensitive Compartmentalized Information. There's all sorts of articles that like to talk about super secret higher levels of security clearances, but as far as I know, that truly is the highest level you can get.", "label": 0}
{"text": "Pull his Security Clearance immediately!", "label": 0}
{"text": "They love wasting or stealing taxpayer dollars.", "label": 0}
{"text": "What are the chances the X app on android or iOS have a kremlin backdoor ? \n\nX for the Kremlin \nTik Tok / Temu for the CCP\nDerpbook for the US Fed\n\nEtc", "label": 0}
{"text": "Apologies are good, reparations are better. We have all of these billions to send to other countries", "label": 0}
{"text": "I thought the picture was his skeleton from \"The Touch of Gray\" video and I was like \"damn that's cold\"", "label": 0}
{"text": "He needs to be deported as a Russian agent.", "label": 0}
{"text": "High-end private schools in Silicon Valley don't have any tech.  It's the latest trend for the ultra-wealthy, while public schools hand kids a tablet and tell them to learn on their own.", "label": 0}
{"text": "Other fast food places such as BK have been affected too. It’s a batch of contaminated onions that appears to have been the source of e.coli", "label": 0}
{"text": "Woman in red has ice running through her veins.", "label": 0}
{"text": "Rest in peace, Phil. You shook my bones and stirred my soul. Thanks for all the magic", "label": 0}
{"text": "America is clearly for sale.", "label": 0}
{"text": "It’s great satire when it makes both sides laugh and this will because these morons are proud of this kind of behavior.", "label": 0}
{"text": "I would disagree with that. Being told its a cold gun is simply not enough. When told its a cold gun, all firearm safety requirements are still in effect. Being told its a cold gun is simply not enough when you then ignore the safety instructions and act reckless. Now if that rises to the level of criminal negligence may be a different question and one a jury would have to consider, but only being told its a cold gun isn't enough.", "label": 0}
{"text": "He sounds like he has an anger management problem to say the least.  I hope he got banned on airline for it. \n\nMalice has a very specific meaning in legal terms.  If you are accusing someone of both malice and unforgivable acts, you better have receipts to prove your charges. \n\nFathering five children between three wives while cheating with the next wife on the way previous one, stealing money from children cancer charity or slipping over-the-counter pill on the mistress in her drink while chanting “sanctity of marriage” etc\n\n\nThose are all malicious and unforgivable acts that you should be raging on.", "label": 0}
{"text": "Is it the same guy who said only pretty people are allowed to wear the clothes his company makes?\n\n\nI knew right then and there he's an outstanding human being.", "label": 0}
{"text": "the guy wanted to suicide by cop as stated by the mother.", "label": 0}
{"text": "Dismissed with prejudice is my favorite thing a judge can do.  It's their equivalent of \"fuck you for wasting the court and my time\".", "label": 0}
{"text": "> Good. They’re a massive source of e-waste. I can’t even imagine how many tons of disposable vapes there are deteriorating in our environment right now.\n\nyes. it needs to get banned ASAP\n\n>Ban cigarettes next.\n\nhell no, prohibition is not the answer. read a book, or watch a movie, man.", "label": 0}
{"text": "No doubt he had a specific reason.", "label": 0}
{"text": "https://www.marlerblog.com/case-news/what-you-need-to-know-about-the-e-coli-o157h7-bacteria-during-an-outbreak/\n\nThis particular strain is heat resistant and prone to mutating. \n\n“unlike generic E. coli, the O157:H7 serotype multiplies at temperatures up to 44°F, survives freezing and thawing, is heat resistant, grows at temperatures up to 111°F”\n\nThis strain while it can be found In produce like onions it is primarily found in bovine.", "label": 0}
{"text": "Phish got to play terrapin station or ripple tonight", "label": 0}
{"text": "Don't fuck with the Deer Lady!", "label": 0}
{"text": "Trump and musk have both publicly stated he will be in a key position of Trump's government .\n\nFucking party full of ACTUAL traitors, tyrants and threats to democracy yet the 2a crowd votes for them.", "label": 0}
{"text": "[Dummy rounds](https://en.m.wikipedia.org/wiki/Dummy_round) are not the same thing as [blanks](https://en.m.wikipedia.org/wiki/Blank_(cartridge))\n\nBecause he was using a revolver, the bullets are visible, so they have to look real. This is why the role of the armorer is so important and why the armorer for Rust is in jail.", "label": 0}
{"text": "I'm doing just fine thank you.", "label": 0}
{"text": "Isn't it more that the armorer is the daughter of a qualified armorer, and she was hired based on her dad's reputation rather than cost?", "label": 0}
{"text": "This is a misunderstanding. When we talk about people like Gates, Bezos, and Musk being \"the richest men in the world\", what we are really talking about is legally recognized wealth. There is a whole other class of wealthy billionaire which dwarf the likes of Musk. These are people like Putin, who essentially have national wealth. People who either can use the assets of a nation as their own piggy bank (as is the case with Putin) or those who have emptied out a nation's bank account and fled the country.\n\nPutin could buy and sell Musk like nothing.", "label": 0}
{"text": "i knew someone would remind me", "label": 0}
{"text": "Wow, he lasted a whole month!\n\n> Fisher used Clorox wipes to try to conceal his crimes, scrubbing the child’s face so hard he rubbed off the pigment.\n\n...that's not possible", "label": 0}
{"text": "Jesus Christ! They’re minerals!", "label": 0}
{"text": "He's had violent altercations with paparrazi, other drivers, people questioning him on the street, etc.", "label": 0}
{"text": "What does “suspicious handwriting” look like?", "label": 0}
{"text": "He damaged an entire generation with his over-sexualization of teens. I remember thinking *if this is a clothing store, why aren't they wearing **any clothes** in the marketing graphics?* There used to be a huge 10 foot poster of a shirtless guy right as you walked in, is that still there?", "label": 0}
{"text": "Not Kamala.\n\nSpaceX will continue doing space shit, just not for NASA. Guess they can just use Boeing, lmao", "label": 0}
{"text": "Lynchings are wrong, ,but this guy was tried and found guilty by a jury of his peers. Also it's a well known fact that child molesters don't fare well in prison.", "label": 0}
{"text": "rectum resizing gone right, too right.", "label": 0}
{"text": "*on* the SDN list no less", "label": 0}
{"text": "I wonder if that's his mother or the concerned neighbor? The article mentions both of them were the ones who informed police was trying to commit suicide by cop. In the short video in the article you can see the woman is actually walking g along with him so maybe she was trying to deescalate the situation. What a terrible position to be in though. ", "label": 0}
{"text": "I think in a lot of cases it is also that eligible voters who did not *remain* eligible are still registered and cast votes.\n\nFor example, if I move to a new apartment 10 miles from my old apartment. I don't update my registration, but I'm technically in a new county. On voting day I go to the same place I have been voting for the past 3 years and vote. And I do this because, like most Americans, *I don't know what fucking county I live in.*\n\nI am sure that shit happens all the time.", "label": 0}
{"text": "Fyi, it's *schmuck. Fun word weird spelling.", "label": 0}
{"text": "Not really no.", "label": 0}
{"text": "That's just patently false...\n\n[source](https://mappingpoliceviolence.org/)", "label": 0}
{"text": "Just write African on the form", "label": 0}
{"text": "There’s no “regular quarter pounder” on a McDonald’s menu so yes this is an editorialized image", "label": 0}
{"text": "We can rebuild him…", "label": 0}
{"text": "The fact it's only \"about double\" strengthens the position that black people are more likely to get killed by cops.\n\nper capita is a thing you should learn about.", "label": 0}
{"text": "Would you prefer we built separate prisons for child molesters?", "label": 0}
{"text": "I got mine suspended because I didn't tell them I had extended family in another country even though I talk to them 2 or 3 times a year.  When my grandma died, I told them I was going to the funeral, I came back and they asked me why I did not disclose I had foreign contacts that I called to tell Merry Christmas to.", "label": 0}
{"text": "Any of his technology developed with government/tax payers money become property of the American people.", "label": 0}
{"text": "Super shocking. Like, soooo shocking.", "label": 0}
{"text": "Didn't Elon have starlink shut down just as Ukraine made a huge advance, causing several of them to die as they has no communication?", "label": 0}
{"text": "Then why didn't Biden and his crew bring back regulations? It seems that he also doesn't care for our food safety.", "label": 0}
{"text": "I'm going to investigate a ham sandwich for possible mayonnaise, only difference is that my investigation will conclude with results.", "label": 0}
{"text": "Your source is showing proportionality, not total killings, which I mentioned in my comment that black people weee over represented in police killings.", "label": 0}
{"text": "**CARMEL, Calif. (KION-TV)** -- A man with an AK-style rifle walked 8th and Monte Verde streets in Carmel Friday, multiple witnesses told KION.\n\nThe Monterey Sheriff's Office confirmed that the suspect is now dead. They say that he passed away in the hospital after officers opened fire. This after deescalate efforts failed, according to the Monterey County Sheriff's Office.\n\nDeputies said that the suspect's mother and a neighbor were the people who notified police, and that his mother said that he had told her he wanted to die in an officer-involved shooting.\n\nAccording to Golden Bough Playhouse Executive Director Stephen Moorer, the man was walking in a barricaded area and police were notified, arrived on the scene and then shot bean bags at the suspect. Moorer said he saw the man being carried out on a gurney.\n\nThe DA's office confirms to KION that they have taken over to investigate the \"officer involved shooting.\"", "label": 0}
{"text": "thank you, Phil.  i really appreciate what you meant to me.", "label": 0}
{"text": "They’ve already done it. This is enough. If Trump loses you can bet his team have “evidence” “connecting” all these incidents to Harris. \n\nMaybe I’m giving them too much credit.", "label": 0}
{"text": "I'll bet somebody $1000 if any fraud is found, and it wasn't just some technical hiccup its Republicans doing it.\n\nBasing this on the voter fraud we have seen in the recent past.", "label": 0}
{"text": "Sorry but now I’m a business class psychopath I just see an opportunity to use this to enslave you. \n\nObviously I’m not sorry. I just said that because the metrics say you are likely to respond with the least resistance if I say that and essentially, resistance costs money and losing money is the closest approximation to feeling sad that I can muster.", "label": 0}
{"text": "Well…yeah? This isn’t surprising", "label": 0}
{"text": "I'm very liberal, but I can absolutely respect his stance and attitude. I don't expect everyone to agree with how I think taxes should be spent or how foreign policy should be handled. But Trump isn't even a conservative, and anyone supporting him at this point has abandoned any ideals they started with.", "label": 0}
{"text": "That’s also true but thanks to the Brady violation a jury didn’t even get to confirm it lol", "label": 0}
{"text": "I literally said that black people are over represented in police killings.", "label": 0}
{"text": "He should come out with a sound bite saying Shut up, Donnie, you're out of your element.", "label": 0}
{"text": "The bean bags they shot were the size of a Mini Cooper", "label": 0}
{"text": "There wasn't, no. He tried to argue that, but by the time he wanted to back out, he had made a legally binding offer and they accepted.", "label": 0}
{"text": "Ah I see so you just don't know about making movies.", "label": 0}
{"text": "Don’t forget about Oregon.", "label": 0}
{"text": "Because the goofy ass prosecutor wanted to be internet famous.", "label": 0}
{"text": "Uhm, something all statistics lie, something useful, whatever. It's very hard to explain, but you have to consider the source, and motivation when looking at statistics. You can separate \"killed by a cop\" vs \"suicide by cop\", so on and so forth. Your link isn't worth the paper it wasn't printed on.", "label": 0}
{"text": "“Ram” brand mounts are popular if I recall correctly.", "label": 0}
{"text": "RIP The Pride of Cucamonga.", "label": 0}
{"text": "There’s your sign! And Biden hasn’t been. Go figure 😂", "label": 0}
{"text": "Did you just mistake Reddit for a courtroom? Do you understand how utterly ridiculous you sound? ", "label": 0}
{"text": "originally he wanted to buy ICBMs from Russia but the asking price was too high so he decided SpaceX would just make their own rockets instead", "label": 0}
{"text": "Which clone are we on? I forgot the count", "label": 0}
{"text": "You do know that his home atmosphere is 10% heroin, right?", "label": 0}
{"text": "That happened to me actually, except, because I moved counties, I wasn’t registered in my new county. \n\nI had my registration closed on the old county and registered in the new county same day.", "label": 0}
{"text": ">pleads not guilty\n\n\nHe should ask Weinstein and Maxwell how this goes, the Feds rarely charge cases they aren't sure they can win.\n\n\nYour best shot is having your case dismissed (8.2%)\n\n\nFor the rest, 99.6% are convicted, because 97.5% plead guilty.\n\n\nOf the 2.5% who go to trial, 82.6% are convicted.\n\n\nThis is just a Hail Mary because at his age (80) it's probably a life sentence either way.", "label": 0}
{"text": "“Beanbags” are *less* lethal, not non lethal. Cops in Vancouver, Canada shot a man (not dangerous, he’d been attacked with pepper spray and was panicking) to death with beanbags a few years ago. ", "label": 0}
{"text": "what makes me skeptical of this is I saw the County Commissioner attacking the democratic Penn Secretary of State during the press conference for this.  It's a republican county, I'm hoping this isn't political games being played to sow doubt, but we'll see.", "label": 0}
{"text": "Seize SpaceX and change his password 😂", "label": 0}
{"text": "It doesn't matter what they consider a part of Russia. A couple hundred thousand men with guns in Russian uniforms say otherwise.\n\nUS was sending himars limited to 50 miles because they were not willing to authorize strikes deep past the front line. Why should a private company be expected to do what the US would not do themselves. It was in lockstep with US policy.", "label": 0}
{"text": "Don't forget Brent!", "label": 0}
{"text": "This is a discussion about why there are less people in Ukraine.  I think it's fair to point out that casualties aren't necessarily that right number to be looking at when it comes to the population decreasing.", "label": 0}
{"text": "No it’s not.  It’s called being History’s Richest Person. \n\nHow on earth is this “crazy”?", "label": 0}
{"text": "Bro is NOT denying the Communist Kamala allegations 🤣", "label": 0}
{"text": "Thought that was a diorama of The W Hotel in Edinburgh at first", "label": 0}
{"text": "Doubtful, I don't think they would have the military or resources for it on their own.", "label": 0}
{"text": ">Some people don’t deserve to live.\n\nAnd yet those who arbitrate such decisions often make mistakes. How is one ever to be certain you have the right person? \n\n>If you want to talk about how the death penalty is used in cases in which we cannot be entirely certain of guilt, that’s an entirely different argument.\n\nNo, it's the same argument in fact", "label": 0}
{"text": "The prosecutor is/was a special prosecutor. She is a local defense attorney. The DA on the other hand…", "label": 0}
{"text": "America will not survive the billionaires.", "label": 0}
{"text": "Why in tarnation are so many traitors allowed to roam free in the US?\n\nSupreme court, a ex-president, defense contractors, tons of various other politicians...", "label": 0}
{"text": "I feel like people on Reddit think I am on his PR team.  I am not a fan of Baldwin.  Some of his work is excellent but I don’t do celebrity chasing. \n\nIf you are siding with vultures called out paparazzi, boy, you got work cut out for you.", "label": 0}
{"text": "his father owned a stake in a Zambian emerald mine that didn't make a huge amount of money. \"emerald blood money\" is confusing this with diamond mining. Zambia is a different country from South Africa.", "label": 0}
{"text": "Does Musk have a security clearance??", "label": 0}
{"text": "To be fair, we also aren’t really sure if she’s black or not and if she is, when she became black. What’s she trying to hide!!! \n\nObligatory /s because Reddit", "label": 0}
{"text": "A sad state of affairs.", "label": 0}
{"text": "Nationalize Tesla, Space X, and Twitter.", "label": 0}
{"text": "Look at all these redditors eating up the fake news and it's anonymous sources 11 days before the election 😂", "label": 0}
{"text": "What laws were broken?", "label": 0}
{"text": "I suppose it comes down to whatever legal tap dancing Tesla did in their EULA for FSD adopters.  It probably includes language that protects Tesla from future claims resulting from a failure to deliver a full FSD feature.\n\nI seriously doubt we're going to see a massive class action suit for this.", "label": 0}
{"text": "Shut down his space x", "label": 0}
{"text": "Desperately grasping for higher office.", "label": 0}
{"text": "Back in my day treason was a crime.", "label": 0}
{"text": "Yes, I'm aware you weren't using the word 'prop' correctly in its technical definition. Hence my use of quotation marks around the word.", "label": 0}
{"text": "Well yeah, when you mothball and outsource NASA you're going to have to make some concessions for the only company keeping us in space, which is just slightly strategically important.", "label": 0}
{"text": "Maybe time for prison after violating the Logan act. ", "label": 0}
{"text": "Gloves are generally not used in kitchens as it tends to encourage bad handwashing habits, and is just generally not good safe due to cross contamination", "label": 0}
{"text": ">The death penalty is unquestionably currently used in many situations in which we cannot be 100% certain of guilt.\n\nWhich is why it should be abolished\n\n>But that doesn’t mean there are no cases in which we are 100% certain of guilt - this is one of them.\n\nEven if that is true - and for sake of argument let's assume it is - the mere fact of your former statement precludes any moral arguments in support of the death penalty in the case of that latter.", "label": 0}
{"text": "8th & Monte Verde is Carmel, not the valley.", "label": 0}
