{"text": "Fields was pretty awful immediately and stayed that way. Even in year two he only took off once Getsy realized he needs to get him 10-15 rushing attempts per game. \n\nIn 12 games as a rookie he had 7 passing touchdowns, and in only one game did he have multiple (2). \n\nCaleb is already significantly better than Fields ever was, let alone his rookie season, which by all measurements was objectively terrible.", "label": 1}
{"text": "Saying he believed it was consensual and she doesn’t means… two parties viewed it differently. Sorry bud.", "label": 1}
{"text": "The medical experts are all on the dolphins finance team.", "label": 1}
{"text": "The fact they took the long way around saying “they said he can play football” that tells me they probably weren’t very supportive and said “not saying you shouldn’t but if it were me I wouldn’t”", "label": 1}
{"text": "Dork", "label": 1}
{"text": "No, your assessment is correct.", "label": 1}
{"text": "How will Goff be looked at if he fails to win a superbowl again? You know how many superbowl rosters and elite coaches he’s had ? Shouldn’t he have the expectation to win a superbowl ?", "label": 1}
{"text": "Go ask your doctor “hey, am I healthy enough to play football” I bet mine says yes. Plus he’d get paid when I get broken. ", "label": 1}
{"text": "Agreed, dork. ", "label": 1}
{"text": "Honestly if he doesn't come out in a guardian cap that he has the choice to wear that's how I actually feel.", "label": 1}
{"text": "Right? These were the same dudes who saw tua get a concussion and put him back out there like what? Same day?", "label": 1}
{"text": "Yeah it felt a lot closer until Lamar had 5 TD’s against the bucs lol. We’ll see if either qb can sustain the level they’re playing at", "label": 1}
{"text": "Ahaha ftp indeed", "label": 1}
{"text": "Canales has been pretty poor with media performance lately. He’s got that power of positivity mindset but all it really does is make it sound like everything he says is a bold lie. He’s probably the most annoying HC personality wise to me, and I wonder how the players react to that.", "label": 1}
{"text": "\"All scoring plays reviewed\".  Hmmm", "label": 1}
{"text": "He's going to get another concussion this year, I guarantee it.", "label": 1}
{"text": "It’s funny how this sub is so quick to call out stats that are moronic but if it’s Aaron Rodgers everybody gets wet. \n\n“Nobody said it reflected anything” — it’s what the stat implies? Are you slow or something?", "label": 1}
{"text": "Rodgers is a massive lightning rod right now as he should be. Nice use of childish insults though.", "label": 1}
{"text": "So you’re saying even though this stat is absolutely pointless in terms of the scope of this post, it’s ok because it’s Rodgers?\n\nThe “lightning rod” comment proves this sub is after gossip and weightless nonsense. We’re turning into Facebook. \n\nBut you seem happy because “fuck Rodgers lol” - you deserve the childish insults imho.", "label": 1}
{"text": "People are just fucking around.", "label": 1}
{"text": "and if you know anything about concussions, his situation isn’t unique in this league\n\nThey can’t force him out, cause where in the fuck do you end it at that point?\n\n3 concussions unfortunately isn’t “a lot”. I had that many in high school alone.", "label": 1}
{"text": "there's a lot left out because there's a lot we don't know and never will.  we don't study the general population so we don't know how common cte really is.  We get loads of confirmation bias because the players submitting for analysis after death, know something is wrong mentally.  plenty of people like that also in the general population though.", "label": 1}
{"text": "Because, unsurprisingly, you’ve managed to piss off the hive mind of Reddit for no reason which is pretty common", "label": 1}
{"text": "Zeke and Cook have combined for 15,000 yards in there career, Henry only has 10,000.\n\nSo obviously Zeke/Cook are 1.5x better than Henry.\n\nWe call that \"Jerry math\"", "label": 1}
{"text": "Ah, the McFlurry conundrum.", "label": 1}
{"text": "It’s been this way for a few years now, if people don’t get how this works at this point they don’t have the IQ to even be worth correcting", "label": 1}
{"text": "It’s possible that they haven’t been in this sub all that time. Never know when someone is new to all this", "label": 1}
{"text": "I mean you don’t have to be in the sub to understand the basics of the CBA but maybe I am being to harsh idk", "label": 1}
{"text": "No one’s calling you a nerd but maybe you shouldn’t be so critical when most people don’t know the specifics about the % of 1st time offenses abt specific fines lol", "label": 1}
{"text": "I mean I'm calling him a nerd.\n\nHim being a nerd ain't the problem, him expecting everyone to care as much as he does is.\n\nYou'd think people who know this kind of info would want to inform, not belittle.", "label": 1}
{"text": "Imagine telling someone after the 2020 season that by 2024, teams would be more scared of Jameis Winston than Deshaun. \n\nThey'd assume Jameis somehow became an All-Pro", "label": 1}
{"text": "On reddit? You'd be flipping a coin that might be flat on one side...", "label": 1}
{"text": "I truly cannot imagine taking a hit like that to my head. I think I'd be in a dark room for months.", "label": 1}
{"text": "it doesn't help that whoever tweeted this was clearly baiting with the way they phrased it, and they know this is the case too\n\nfucking hack knew what they were doing", "label": 1}
{"text": "Single anecdote here, I don't generally pay too much attention to the legalese behind CBAs except for whatever is important enough to make the headlines whenever the NFL and NFLPA are having discussions. Even then, I just don't care too much so I'm probably not going to remember it for too long.", "label": 1}
{"text": "Legends? Lmao. This entire sub clowned Baker and said he wasn’t a Super Bowl QB. Pathetic ass hind sight", "label": 1}
{"text": "Yeah yeah. Sure he was, loser", "label": 1}
{"text": "Lmao that flair", "label": 1}
{"text": "Your dad should've shot you on your mom's back, not in her.", "label": 1}
{"text": "The good old days😖", "label": 1}
{"text": "Lmao Bears fans are so soft I have no idea how this is downvoted\n\nYou're 100% right, it's literally them vs the world according to their fans, it's so goddamn pathetic.", "label": 1}
{"text": "“Detroit vs everybody”", "label": 1}
{"text": "👀", "label": 1}
{"text": "Oh, I don’t know, I guess I think about killing myself pretty frequently. And why not? What’s so great about living? You know when I’m happy? For about five seconds in the morning when I first wake up, before I remember who I am and what my life is all about: anxiety, disappointment, diarrhea more often than not. (sighs) I don’t know if there’s an afterlife, but who cares? Nothingness couldn’t be any worse than this meaningless march through my empty days.", "label": 1}
{"text": "🤣🤣🤣🤣🥊", "label": 1}
{"text": "Dawg I couldn’t stand seeing the fucking Twins in those ads. Like bro you can’t just use the ad you made a month before the playoffs started", "label": 1}
{"text": "Sorry lil bro, you’ll take home Paul Bunyan next year 😔", "label": 1}
{"text": "See this is why no one likes you", "label": 1}
{"text": "Look at the Walmart trash commenting and you get why they are despised lol", "label": 1}
{"text": "All the comments feel free to post your UofM degrees and net worth. Bunch of white trash.", "label": 1}
{"text": "Titans bros don’t worry about the infighting amongst the Lions fans, the family’s just having a little discussion", "label": 1}
{"text": "You started it lol so fucking dumb to play victim", "label": 1}
{"text": "You’re the bitch", "label": 1}
{"text": "Broke ass bitch", "label": 1}
{"text": "Go back to drawing anime you fucking clown lol", "label": 1}
{"text": "Bro you really bout to get juked by mason rudolph", "label": 1}
{"text": "\tgo back to posting about your online video games you incel little bitch.", "label": 1}
{"text": "WE GOT A SHOOTOUT", "label": 1}
{"text": "Sonic and Knuckles already on full display here", "label": 1}
{"text": "They probably share a bed too", "label": 1}
{"text": "wtf is this game", "label": 1}
{"text": "Mixon out there beating bitches like he’s back at OU", "label": 1}
{"text": "I have such a strange feeling inside", "label": 1}
{"text": "THATS A FIELD GOAL", "label": 1}
{"text": "What a snag", "label": 1}
{"text": "Pretty clear there", "label": 1}
{"text": "1 pt / passing yd??? Goff the GOAT???", "label": 1}
{"text": "Right?", "label": 1}
{"text": "All for the Lions right?", "label": 1}
{"text": "No offense but you’re an idiot if you expect people to be rational in Reddit game threads", "label": 1}
{"text": "Sons of anarchy for maga", "label": 1}
{"text": "Yes I'm sure the refs are just deciding to fuck with the Jags today and favor the Packers. You people that think this way are truly special.", "label": 1}
{"text": "If Arnold wore a costume as skin color accurate as Myles, Arnold would be called a racist.\n\n\nWhy is a Black man allowed to wear whiteface and that not be racist? ", "label": 1}
{"text": "Next offensive possession they should try to take out sauce’s knee. \n\nA torn acl+MCL combo would be legit hilarious and we deserve a free hit on the jets for their dirty play earlier.", "label": 1}
{"text": "And you're a disgrace to society", "label": 1}
{"text": "So is the jets defense for headhunting a qb because they were losing.", "label": 1}
{"text": "Uh huh. Still doesn't takeaway how much of a shitty person you are.", "label": 1}
{"text": "Bears players know what to do. Light him up hard. ", "label": 1}
{"text": "Nah they can fuck right off", "label": 1}
{"text": "It's (d)ifferent", "label": 1}
{"text": "lame af", "label": 1}
{"text": "It's football. He didn't have to type it for that to be the understand. Loosen up.\n\n\nThey won't touch JD with our Line. Anyway.", "label": 1}
{"text": "Fuck this Hilter wannabe. Get out and vote, please, for the love of God.", "label": 1}
{"text": "The commanders are starting a dude with an injury. What are bears players supposed to do ? Not hit him hard ? ", "label": 1}
{"text": "absolutely not", "label": 1}
{"text": "How shit is starting a player with an injury when they got a healthy backup. ", "label": 1}
{"text": "i’m talking about you, the Bears will play tough regardless but encouraging injuries is bitch-made", "label": 1}
{"text": "What was the injury? It was hard to tell on redzone", "label": 1}
{"text": "Did I say injury Daniel’s ? I said hit him hard. ", "label": 1}
{"text": "That’s the playoffs vs 1 regular season game. When Mahomes dislocated his knee and put it back they still took 1 game off for him. ", "label": 1}
{"text": "lol you definitely implied it", "label": 1}
{"text": "Are you serious?", "label": 1}
{"text": "Lighting him up is not the same as trying to injure him. Don't be soft.", "label": 1}
{"text": "Okay...so...It's racist because for about two centuries, white people put on black face to put on comedy shows where they depicted black people as stupid, lazy and incompetent as a justification for slavery.\n\nBlack face isn't bad because \"white guy pretending to be black guy\". If you're going to complain about a double standard, start by learning why any standard exists in the first place.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Eagles winning the nfc", "label": 1}
{"text": "It was a really good play.", "label": 1}
{"text": "Fuck the bills for making me think our defense was turning a corner", "label": 1}
{"text": "Chiefs win 80-50", "label": 1}
{"text": "Saints won’t even score 10 😂", "label": 1}
{"text": "Worst team in the nfl? More like worst team in nfl history", "label": 1}
{"text": "More like freshman lmao", "label": 1}
{"text": "Poverty franchise Jets", "label": 1}
{"text": "You realize the injury report for each team every week has at least multiple players on it who still play, right? Regular season or not.\n\nYou're just an asshole asking for a player to get targeted and injured.", "label": 1}
{"text": "Bro watched LSU’s kicker last night and decided to dress up as him for Halloween 💀", "label": 1}
{"text": "Lmfao", "label": 1}
{"text": "God dammit", "label": 1}
{"text": "This is Tom grossi’s fault for messing with the strouds", "label": 1}
{"text": "Fuck", "label": 1}
{"text": "It’s always the actual sex offenders who bring up him getting a handjob lol", "label": 1}
{"text": "Suicide is back on the menu boys", "label": 1}
{"text": "angers me", "label": 1}
{"text": "First, he’s already done that today \n\nSecond, why is he supposed to throw from the 1 yard line?", "label": 1}
{"text": "Falcons your up by 2 scores with 5 mins left against a once tom Brady led team! Finish the job\n\nBaker: 😈", "label": 1}
{"text": "WTF?", "label": 1}
{"text": "Why do u like seeing people get hurt?", "label": 1}
{"text": "Because I'm allowed to #trump #russia", "label": 1}
{"text": "Well your guy there literally is a big voice on the left and is consistently a guest on left leaning media. So maybe your party has a bit of an issue.", "label": 1}
{"text": "Your party is the issue, they're traitors tryinglg to ruin the country and put up new Russia. I prefer my country over party.", "label": 1}
{"text": "I know I’m just joking", "label": 1}
{"text": "Aye my g, eagles got a good team. It’s crazy that the saints were close to beating yall. Maybe we aren’t that bad after all, just not healthy rn. Idk", "label": 1}
{"text": "The NFL is the greatest entertainment on planet Earth", "label": 1}
{"text": "👆 Supports sexual assaulters when they play well", "label": 1}
{"text": "Me too", "label": 1}
{"text": "NFL is king for a reason", "label": 1}
{"text": "You’d think Eddie Jackson was Tyreeks wife considering how much he’s been beat today", "label": 1}
{"text": "Seethe", "label": 1}
{"text": "Also why were people talking about the Patriots defense as if it's regressed?\n\nThey're missing: Barmore, Bentley, Peppers, Dugger and Uche, yet have given up 30 less points this year.", "label": 1}
{"text": "Robert is laughing rn", "label": 1}
{"text": "Do you two know each other then", "label": 1}
{"text": "Exactly. With worse talent, Mayo is leading a defence to better results.", "label": 1}
{"text": "Lamar is a RB", "label": 1}
{"text": "Head Coach calls them soft, they come out and win.\n\nSeems like a good coaching move to me? Or at least a move that worked", "label": 1}
{"text": "Most of us did not", "label": 1}
{"text": "I JUST SAW WE GOT A SAFTEY ????? 2-0 saints right now wtf we haven’t gotten a saftey since like 2008 lmao. Idk man saints got Dennis Allen as the coach so he ain’t scary lmao", "label": 1}
{"text": "Go trump", "label": 1}
{"text": "\"just missed him\"", "label": 1}
{"text": "Trump was already president for 4 years and only lowered taxes for rich people and fucked up Covid?", "label": 1}
{"text": "No they fucking didn’t. I live in Ohio and met one person who supported him. Everyone else was like god damnit, what the fuck. A handful of people on Reddit don’t equate to the entire fanbase.", "label": 1}
{"text": "Yup", "label": 1}
{"text": "Or maybe Ben Rapeshisburgers?", "label": 1}
{"text": "It was a cfb 25 angle", "label": 1}
{"text": "We suck again! Yay", "label": 1}
{"text": "Jameis is a decent quarterback. Deserves a staring position somewhere.", "label": 1}
{"text": "No they didnt", "label": 1}
{"text": "Def not all on either side", "label": 1}
{"text": "I like first downs.", "label": 1}
{"text": "Black Tebow strikes again", "label": 1}
{"text": "What a terrible play. That saints player should be ejected from the game. I hate being a saints fan. The fuck is this shit man.", "label": 1}
{"text": "I’m officially done being a saints fan, how do you remove your own flair? I’m done. Which team should I join now (won’t pull a Kevin Durant I promise)", "label": 1}
{"text": "That’s the only possibility. If not, he’s an asshole", "label": 1}
{"text": "Refs have money on the Bears", "label": 1}
{"text": "Why did I ever become a saints fan. I can’t do nothing about this I don’t have control over it but it feels bad even saying I’m a fan anymore. Should I just not be a fan of the saints anymore or what", "label": 1}
{"text": "Trump will destroy this country", "label": 1}
{"text": "Alright bet I’m becoming a falcons fan", "label": 1}
{"text": "Even though I agree, can we just like watch a football game for a few hours?", "label": 1}
{"text": "Dude I don’t even wanna watch football anymore this is my breaking point. Unless he thought he still had the ball, that’s inexcusable. I truly hate football. God dammit man", "label": 1}
{"text": "He's doing a pretty good job of that already", "label": 1}
{"text": "Commercials: no", "label": 1}
{"text": "I agree, but political ads play during football. It boggles my mind that a convicted felon and racist can be neck and neck with a legitimate candidate.", "label": 1}
{"text": "Yeah that was a horrible play. Watching LSU choke last night was painful, now the saints scoring 2 points and tryna hurt Justin just made it even worse. Fuck football man fuck football. If football never existed I wouldn’t have to go through this", "label": 1}
{"text": "dude, a massive majority of us hated Watson from the start", "label": 1}
{"text": "I think not even he can do that without getting elected", "label": 1}
{"text": "Here we go again. Plenty of our players aren’t dirty. Lattimore for example. He’s not dirty. Neither is Demario. You’re using 15 years ago and trying to connect the dots. Without any proof Dennis Allen is telling players to do this, u can’t just make false allegations and think it’s ok.", "label": 1}
{"text": "So no Bucs player has ever made a dirty hit? Sure, sure. That’s totally not biased at all. It’s totally ONLY the saints who have had dirty hits man. Real nice dude. People are assholes. Your not helping", "label": 1}
{"text": "Accusing an entire team of being dirty because a few players are is stupid", "label": 1}
{"text": "I guess it’s hard to gauge “majority” from my pov bc of response bias so I’ll take your word for it… I 100% recall seeing browns flairs who didn’t hate him early on but idc that much", "label": 1}
{"text": "Left the who dat nation 7 years ago. I love Brees, Payton, colston, Jordan, Gleason, etc but they are genuinely hard to watch and a dirty organization at the core, even if it’s not a bounty program. It feels so good now that the redskins are good, you should join us", "label": 1}
{"text": "No im not a bandwagon but thanks for the offer", "label": 1}
{"text": "Shut up fucker. Just shut up. You made the accusation without proof, that’s enough from the clown. You think we are dirty bc of 15 years ago? Or because a select few guys this year had dirty hits?", "label": 1}
{"text": "Most stable saints fan.", "label": 1}
{"text": "I can show plenty of Bucs players making dirty hits in history. But I have a life and don’t have time to send every link of every play. It’s crazy how u think no Bucs player ever has been dirty. Ur insane to believe that", "label": 1}
{"text": "I’m not on the team man. Worry about ur own team", "label": 1}
{"text": "This isnt the flex you think it is", "label": 1}
{"text": "You need to take some deep breaths and step away from reddit lol", "label": 1}
{"text": "Ok bud that’s enough please stop lying on reddit", "label": 1}
{"text": "You need to stop lying on people before I report your account", "label": 1}
{"text": "Had me in the first half ngl", "label": 1}
{"text": "Reported for misinformation. Karmas a bitch. Fuck you. You don’t care about bounty gate u just want an excuse to hate the saints", "label": 1}
{"text": "Lmao what’s wrong w the second half tf", "label": 1}
{"text": "I’m not flexing? I’m happy to not watch the saints every week and that’s all I was trying to say", "label": 1}
{"text": "Lost me at “redskins” so ur racist and wrong. Man fuck you", "label": 1}
{"text": "I like Jayden too I can’t hate but damn ur ignorance is showing", "label": 1}
{"text": "Lmao if you think saying redskin is racist you need to go outside some more", "label": 1}
{"text": "Ok", "label": 1}
{"text": "Yeah washington has been a real pleasure to watch the last decade", "label": 1}
{"text": "I don’t even care anymore. Fuck this and fuck everything I’m done", "label": 1}
{"text": "Winston is a sexual predator just like Watson.", "label": 1}
{"text": "That’s not evidence", "label": 1}
{"text": "Do you know what evidence is? Like a trial and arrests made? There’s been none dummy", "label": 1}
{"text": "You’re a hypocrite since every team has a bounty gate according to you. You said one dirty hit is proof. Those are ur words", "label": 1}
{"text": "Fuck ou", "label": 1}
{"text": "\"Not shit talking\"\n\n\"they are genuinely hard to watch and a dirty organization at the core, even if it’s not a bounty program. It feels so good now that the redskins are good, you should join us\"\n\n  \nBrother I'd get back with my ex if I wanted to be gaslit", "label": 1}
{"text": "Yes", "label": 1}
{"text": "This dudes having a meltdown damn", "label": 1}
{"text": "Ok but that’s genuinely how I feel", "label": 1}
{"text": "My friend I'm native American and I fucking hate that term. Maybe get outside of your little world", "label": 1}
{"text": "Combination of having guys like Mecole/Watson running routes designed to pull corners away from the mid, and Kelce just registering \"I can get leverage on this guy so I'll pull X move to get into open space\", and hopefully Mahomes notices it and finds 'em for the easy yardage.\n\nKelce helped run a Tight End clinic in the offseason, he detailed a lot of it there, you can find vids of it.  [Here's Kelce detailing...pretty much exactly what I said above.](https://youtu.be/0kd4gzmgVdc?si=pmpaIXSlSMv1nj9s&t=630)", "label": 1}
{"text": "Tf, theres Natives, myself included, that think it shouldve never even been changed. It was a clear play by snyder to take the heat off", "label": 1}
{"text": "You said recent history. 15 years ago is not recent dude. That’s a whole different coaching staff bud", "label": 1}
{"text": "Bounty gate happened 15 years ago. If you didn’t know. Time to move on unless your an absolute loser and think the saints still do it", "label": 1}
{"text": "Omfg maybe you could solve all the problems in your own life by doing the right thing!", "label": 1}
{"text": "“Recent history” is like 2 years ago lol", "label": 1}
{"text": "Wdym local saints fan", "label": 1}
{"text": "By ur logic, dak presscot is a rapist. According to you. Since he was accused of it", "label": 1}
{"text": "Why won't you do the right thing? You live in fucking Massachusetts", "label": 1}
{"text": "Exactly nothing to say cause u have no proof, I hope you get falsely accused of something terrible one day so u understand how it feels. I don’t like Dennis Allen but to say he’s running bounties is dumb. You don’t know Dennis then. This dude apologized to the falcons last year. He would never do such a thing he’s too nice for that shit lol", "label": 1}
{"text": "You are actually slow if you think the guy who apologized to his own rival would put bounties on people. You’re actually dumb.", "label": 1}
{"text": "You’re just like my ex. Bringing up 2 decades ago cause she doesn’t done anything good since then so blames it on that last. Rich coming from you. Living in the past is the panthers strong suit apparently. Cant you just get over it already. The Vikings had a bounty gate that same year", "label": 1}
{"text": "Yeah I don’t care anymore. This is my last season of watching football anymore", "label": 1}
{"text": "you’ve not lived here before if u think we are a shitty city. But I do agree we are a shitty team. Whatever man enjoy this shit while it lasts cause it’s all gonna be fucking over one day", "label": 1}
{"text": "You'll never see a Superbowl before you pass in 6 years so who are you really laughing at", "label": 1}
{"text": "Guy really came in here and proved your point 😭", "label": 1}
{"text": "Thought they would give it to watson for tearing his acl.", "label": 1}
{"text": "Nah you can't be this mentally deficient, get the rope and be gone", "label": 1}
{"text": "Lmao cry more and cope harder. Gonna suck when you guys have to find a new narrative to get your fake little internet points up eh", "label": 1}
{"text": "You maggots ever stop being triggered? I mean shit one daddy in your entire life and still ungrateful", "label": 1}
{"text": "I don't think Ben is his favorite. Why do you?", "label": 1}
{"text": "Same response you’ll have after this L to the bills lmao", "label": 1}
{"text": "Ah yes, make it about you, you guys truly are assholes with no empathy for others, pretend to care about peoples mental health and this all just proves me right all along. Nobody cares or gives a fuck, I’m sand. And what happened to sand? It gets washed away one day, nobody cares about me and I know that now even more. I shouldn’t have expected human deceny from losers on reddit, that’s my dumb mistake", "label": 1}
{"text": "I’m native and couldn’t give a fuck less. Maybe don’t get so mad about a word?", "label": 1}
{"text": "Yeah I could. I’ve been done wrong by so many mfs and abused by people I LOVED and thought loved me. Do you think I should care", "label": 1}
{"text": "So are you trying to invalidate my feelings by throwing a bunch of famous people at me who barely care about football at all???\n\nTell me, are you Native or are you white?", "label": 1}
{"text": "I thought you promised your dad you were going to be a man and now you a transmission?", "label": 1}
{"text": "You’re an eagles fan lmao", "label": 1}
{"text": "In 2022, Kelce was still playing at an insane level. That allowed Juju to be a good #2 and MVS to be a solid #3. Those 3 combined for 3,000 receiving yards, that's good/great. \n\nIn 2023, the offense was objectively bad, and they would not have won a Super Bowl without a dominant (arguably best in the league) defense.\n\nIn both years they had 3 All-Pro Olineman.", "label": 1}
{"text": "Chiefs fans complaining about the refs is hilarious", "label": 1}
{"text": "posting it again so I can have the fucking mole people come out of the walls to say that it's not true \n\n\nistg chiefs fans in this sub feel like a victim literally anytime anything happens. \n\nany penalty ever called  on the chiefs? \"I tHoUGhT tHe rEfS wErE pAiD oFF\"\n\n\nclear missed call in the chiefs favor? \"well the rules pretty dumb anyway\"\n\ndumbass penalty on their opponent? \"rules are rules, you must've missed that play earlier where the chiefs right tackle started humping the defensive lineman and got a penalty for it, keep saying it's rigged though hater\"\n \nmajority of the sub is chiefs fans whining about people shittin on the chiefs atp", "label": 1}
{"text": "Here’s a ni—-", "label": 1}
{"text": "Don’t forget the rings on that cute little frog puppet next time", "label": 1}
{"text": "The Kansas City Domestic Abusers with another W. The script keep scripting.", "label": 1}
{"text": "Celebrating rigged championships, how cute?", "label": 1}
{"text": "Sounds like you hit your wife", "label": 1}
{"text": "He isn't Can Newton", "label": 1}
{"text": "Hitting your wife?\n\nFlair checks out", "label": 1}
{"text": "Sorry your checks haven't been clearing to the officials.  Have you tried cash?", "label": 1}
{"text": "PFF has the Chiefs with the #1 Center by far, the #5 and #8 Guards, and the #9 and #15 TE's.\n\nThe offence has lots of talent.", "label": 1}
{"text": "PFF has the Chiefs with the #1 Center by far (graded at 92.2, next highest is 85.5), the #5 and #8 Guards, and the #9 and #15 TE's.\n\nThe offence has lots of talent, and Andy Reid is still an offensive genius.", "label": 1}
{"text": "LOL", "label": 1}
{"text": "Stop thanking god good fucking grief. I can’t stand these gen z god lovers. \n\nGod doesn’t care about football because god doesn’t exist you moron. ", "label": 1}
{"text": "Have you tried not hitting your wife?", "label": 1}
{"text": "DID THE REMINDER WORK LIL BITCHHHH", "label": 1}
{"text": "Any ref that throws the flag for a hold there should be taken out back and shot. ", "label": 1}
{"text": "Congrats on getting away with a Hail Mary bum\nYet to face a healthy secondary", "label": 1}
{"text": "If you think that then you shouldn't be allowed to complain about any call.", "label": 1}
{"text": "I mean he could have came back to sf.", "label": 1}
{"text": "They NEVER call penalties on hail Marys", "label": 1}
{"text": "Haha you little bitch had the refs help all the way shut the fuck up and hold these nuts", "label": 1}
{"text": "Why not move the endzone back by 40 yards too if you’re just going to dispose of rules completely 🤷‍♂️", "label": 1}
{"text": "....why?", "label": 1}
{"text": "You sound dumb. Everyone cheers when someone in their division loses lol go dry your eyes", "label": 1}
{"text": "65 yard bomb", "label": 1}
{"text": "I treat my wonderful boyfriend with tremendous kindness, thank you very much", "label": 1}
{"text": "You’re acting like this is a new thing. They never call that on a Hail Mary. Ever. ", "label": 1}
{"text": "I've seen an OPI called once.", "label": 1}
{"text": "Saints are still the dirtiest most dogshit org", "label": 1}
{"text": "Soft", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Caleb fuckin sucks. If he could complete a pass without airmailing his receiver then they wouldn’t be in the situation", "label": 1}
{"text": "Imagine renewing your fuckin Covid shot lmfao", "label": 1}
{"text": "Bait", "label": 1}
{"text": "Now that you mention it; time for me to re-up.", "label": 1}
{"text": "I bet you struggle to get out of bed everyday", "label": 1}
{"text": "I bet you struggle to be a productive member of society.", "label": 1}
{"text": "Oh how I’d love to compare our lives on paper.   Thank you for the laugh.", "label": 1}
{"text": "Genuinely if you are a right winger and one of your biggest concerns is trans people you are a net negative to society", "label": 1}
{"text": "Imagine being so triggered about what someone does with their own body.", "label": 1}
{"text": "Triggggggggerred he says as he weeps in his pillow over the thought of catching covid 19. Come sit down and have a talk little boy you have so much to learn!", "label": 1}
{"text": "🥁 💥", "label": 1}
{"text": "> You can’t spell 49ers without ER\n\nlmao", "label": 1}
{"text": "Collinsworth got an injured throat from sucking off bosa", "label": 1}
{"text": "Sean Payton is still coaching in the league\n\nDon't forget that 🤡🤡🤡", "label": 1}
{"text": "Ha. But not 50. Loser", "label": 1}
{"text": "Lol a fun text to your teammate is a douche move? You never had friends before?", "label": 1}
{"text": "Yes, he actually was.", "label": 1}
{"text": "The Mark of the Beast?", "label": 1}
{"text": "It's literally a guy running a straight up slang getting slammed into by two DBS... Is he supposed to stop his route and let them run around him to cover kittle? What don't you understand. From a Bills fan too... Disappointed in you to be a bitch just to be a bitch", "label": 1}
{"text": "Lol they added a regex to prevent me from sayingFuck the cowboys.\n\nA shitty regex too. Soft ass shit r/nfl mods", "label": 1}
{"text": "Yeah we all got to laugh at you guys for years. Turn tables.", "label": 1}
{"text": "BEARS DOWN", "label": 1}
{"text": "Pearsall is too ghettofied, his speech and mannerisms is like a black man", "label": 1}
{"text": "1 white player gets shot and you'd think it was 9/11", "label": 1}
{"text": "1/10 rage bait ", "label": 1}
{"text": "Wtf. Wrong sub r/nflcirclejerk", "label": 1}
{"text": "Wtf", "label": 1}
{"text": "Tf?", "label": 1}
{"text": "Holy casual racism, Batman.", "label": 1}
{"text": "I have no idea how he does it", "label": 1}
{"text": "Cee Dee is a good looking dude no h0m0", "label": 1}
{"text": "Fantasy owners the real winners today", "label": 1}
{"text": "He took like 3 steps lol", "label": 1}
{"text": "You seem stable", "label": 1}
{"text": "Wish dak would drink bleach with McCarthy…two fucking geriatric losers.", "label": 1}
{"text": "Guerendo is scared of contact apparently. 49ers fans can’t be happy with him. Luckily for them his blunder ironically sealed them the win. Oh well. Godspeed you mentally impaired bastards", "label": 1}
{"text": "This is one of the worst takes in history lol", "label": 1}
{"text": "But how is it ironic if it's intentional?", "label": 1}
{"text": "Best player in high school... In your road to glory?", "label": 1}
{"text": "Do you have an actual rebuttal to my points, instead of just a random attack?\n\nThe 49ers offence, despite missing Jennings, Aiyuk for 2 games now, and Deebo being hurt, are basically just as good without McCaffrey as with him.\n\nMaybe this changes, but we're now 8 games into this and it's true.", "label": 1}
{"text": "Because it wasn’t intentional. In his fear he made a business decision that just so happened to benefit the team. Irony", "label": 1}
{"text": "Are rushing yards a running back stat? What about yards per carry?\n\nThe 49ers are basically the exact same rushing team with and without CMC.", "label": 1}
{"text": "Then don’t be a fucking Niners fan", "label": 1}
{"text": "They have 210 points in 8 games this year, they had 218 points in their first 8 games last year.", "label": 1}
{"text": "No I meant in real life sorry for the miscommunication", "label": 1}
{"text": "That's exactly my point it was intentional. He was trying to ice the game that's the real business decision.", "label": 1}
{"text": "“Objective opinion” dumbass. Buy a dictionary. Don’t vote. Get a blueberry Covid vaccine. +1", "label": 1}
{"text": "He so wanted to be at that klan fest", "label": 1}
{"text": "Holyshit my guy I love that this moment is lost on you.", "label": 1}
{"text": "No since he scored the touchdown unlike Guerrero. Not his fault his defense allowed a touchdown. Also that was a totally different era of nfl football why are you bringing up ancient games like they’re still relevant 😂", "label": 1}
{"text": "Cause it's why Guerendo slid. To secure the win. Obviously in this case the niners were probably winning anyways but the logic still applies.", "label": 1}
{"text": "Trust me I enjoy seeing pussies get their karma 😂 Bet on a Guerendo achilles tear soon", "label": 1}
{"text": "We don't all need a dictionary beside our computer when we're on the internet, Vlad..", "label": 1}
{"text": "Brady to the 49ers instead of the Bucs in 2020.\n\nI think they likely win 2, maybe 3 Super Bowls and possibly 3 straight. \n\nAlso they no longer draft Lance, so he goes elsewhere.", "label": 1}
{"text": "You can always tell who is so lonely in the real world that their only choice is to become chronically online.", "label": 1}
{"text": "…huh?", "label": 1}
{"text": "He just called him obnoxious thats all he said, how about you go for a walk cry baby.", "label": 1}
{"text": "People forget, but Baker was basically gone either way. For whatever reason the locker room hated him", "label": 1}
{"text": "Backs like Guerendino operate off their fear and instinct rather than their intelligence. I’ve seen it first hand", "label": 1}
{"text": "Last I checked, points won games, not red zone percentage.\n\nYour offence is almost identical in PPG with/without him.", "label": 1}
{"text": "Literally Google", "label": 1}
{"text": "Wat", "label": 1}
{"text": "lol gheeey!", "label": 1}
{"text": "How about you stay the hell out of it.", "label": 1}
{"text": "Buzzword roulette over here", "label": 1}
{"text": "You should have taken your own advice brother. ", "label": 1}
{"text": "Apparently the new booster comes in different flavors. This is welcome news to me.", "label": 1}
{"text": "Imagine pining over Trump and Henchcliff while your beating the Cowboys.", "label": 1}
{"text": "Do not give a shit", "label": 1}
{"text": "You seemed pretty pressed about that dude calling Bosa obnoxious lol", "label": 1}
{"text": "Inject that shit straight into my veins \n\nLiterally", "label": 1}
{"text": "Embarrassing\n\n(For you)", "label": 1}
{"text": "I DO!!!!! I HAVE A KAP JERSEY", "label": 1}
{"text": "Lmao the other NY team has Rodgers and somehow it’s *checks notes* Daniel Jones turning New Yorkers into anti vaxxers", "label": 1}
{"text": "Its kinda basic but I heads Moderna's pumpkin spice is actually pretty good", "label": 1}
{"text": "I heard they’re micro dosing it in Zyn pouches", "label": 1}
{"text": "Oh so Bills fans aren’t smart? Okay. Noted.", "label": 1}
{"text": "in my opinion you’re objectively an incoherent lunatic. \n\nobjectively, if someone has an opinion that politics should be kept out of sports but also support Bosa here, they don’t actually have an opinion on politics in sports. they have a biased belief about politics in sports. \n\nyour mom blue on my berry until i gave her the vaccine", "label": 1}
{"text": "Go back to r/seahawks", "label": 1}
{"text": "I'm an unrepentant slut for vanilla bean pfizercinno", "label": 1}
{"text": "Hell yeah pass me the dip can let's get boosted homie", "label": 1}
{"text": "spray it down my throat", "label": 1}
{"text": "He wanted to play against Dallas and it was personal with their voter base among other factors.", "label": 1}
{"text": "Redditors care way too much about politics. Also people thinking trump is fascist is cringe as hell ", "label": 1}
{"text": "But he's masters seeming to be super passionate and candid about the most lukewarm takes. \n\nIf someone asked McAfee about his opinion on Trump vs. Kamala, he would give a captivating speech about how he believes everyone should vote.", "label": 1}
{"text": "[Too much coconut](https://images.app.goo.gl/zNNWFYK9pHnGLjqR9)", "label": 1}
{"text": "he’s a fucking clown and a piece of shit. god i hate this dipshit so much.", "label": 1}
{"text": "I feel bad lol. I have no idea what Kittle and Purdy's political views are, nor do I care at all. But now they're gonna be associated with this, against their will.", "label": 1}
{"text": "Surely the \"no politics in sports\" crowd won't take kindly to this\n\n🤔", "label": 1}
{"text": "For someone who keeps saying they don't give a shit, you sure seem to be giving lots of crying shits over it.", "label": 1}
{"text": "It was just a maga hat, really not surprising", "label": 1}
{"text": "You guys are pathetic.", "label": 1}
{"text": "Surely the people who have no issue with athletes expressing their beliefs on the field will have no issue with this, right?", "label": 1}
{"text": "You played in high school so you know their mentality?\n\nOMG this is just a classic bit of redditism.", "label": 1}
{"text": "He's not.", "label": 1}
{"text": "As a basic bitch give me all the PSL boosters. 💁🏼‍♀️", "label": 1}
{"text": "I feel bad that you legitimately believe that. 4 years in office and everything y’all said would happen (wars, inflation) happened under the Ds. \n\nSame old same old from 2016. Still gonna win too because people are tires of folks like you.", "label": 1}
{"text": "You should stick to your wheelhouse of action figures and cars going in a circle", "label": 1}
{"text": "Gonna cry?", "label": 1}
{"text": "One side is weirdly obsessed with loving everything a man does. \n\nOne side is weirdly obsessed with hating everything a man does. \n\nSHOOT YOUR WEBS SPIDER MAN!!!!", "label": 1}
{"text": "enlightened centrist with no argument, classic. Interesting how you didnt push back on anything I said, because its all 100% factual.", "label": 1}
{"text": "I’m crying and sharting", "label": 1}
{"text": "Better record than you, motherfucker", "label": 1}
{"text": "I mean that could mean two very different things. A \"devout\" Christian could literally be someone who's very devout to god and the Christian philosophy of decency, service, truthfulness and forgiveness. Or he could be that \"devout\" Christian but in the fake sense of where they go to church once a week but live a completely hypocritical life. From what we hear and see from Brock, he doesn't really seem that way. When he has talked about his Christian beliefs he talks about being of \"service\" a lot which isn't really the go to talking point of most maga Christians. So until Purdy starts spouting maga stuff like Butker, I'll give him a benefit of the doubt. I don't believe in Christianity, but know many Christians who have never been into Trump or maga", "label": 1}
{"text": "That's not what that hat means.", "label": 1}
{"text": "That's not what that rally in NY was about.", "label": 1}
{"text": "Please dude. The right wing guys are all in on culture war shit.", "label": 1}
{"text": "Also none of the three things they listed are true", "label": 1}
{"text": "See the speakers and listen to the full thing. That is exactly what it was.", "label": 1}
{"text": "You know Mike Shanahan went to a Trump rally before right", "label": 1}
{"text": "You must be mistaken, bosa was wearing the hat of the guy who killed a border security bill.  That hat is against better border security.", "label": 1}
{"text": "Are the legal Haitian immigrants welcomed?", "label": 1}
{"text": "If man had a mag hat in the isn’t it obvious?  I mean what a  red e they going to ask him?  All he has to say is yes I support the guy and next question.", "label": 1}
{"text": "Why wouldn’t they be?", "label": 1}
{"text": "“Nick Bosa is racist”  \n“So is your state!”  \n\nYeah, that’s exactly what we’ve people have been trying to say, I’m happy u finally get that", "label": 1}
{"text": "I would definitely say I care about the hypocrisy from people to be claiming to be Niners fans when we’ve known all of this about Bosa from even before we drafted him in 2019, yes.", "label": 1}
{"text": "“Reddit is not real life man. Nobody cares” - you\n\n“I would definitely say I care” - also you\n\nLOL", "label": 1}
{"text": "Keep saying that Trump is 1940’s Germany but that has no equivalence to the Holocaust. Go read a history book", "label": 1}
{"text": "Reddit, where nerds who have never played contact sports are judgemental over a fucking reaction on the sidelines.", "label": 1}
{"text": "Lower inflation even though Trump wants to have 20% universal tariffs and deport 20 million illegal immigrants (which would skyrocket inflation to an insane level). The tariffs alone would raise prices to an absurd level. \n\nThis shit right here is why Trump supporters aren't serious people.", "label": 1}
{"text": "Again, no one is bringing up the Holocaust but you. \n\nAre you okay?", "label": 1}
{"text": "flair up pussy", "label": 1}
{"text": "Who that", "label": 1}
{"text": "Cry more", "label": 1}
{"text": "Because they’re eating the cats and they’re eating the dogs! Or was that somehow taken out of context too?", "label": 1}
{"text": "Have you seen his tweets? Bosa isn’t voting off of policy lmao", "label": 1}
{"text": "Not all Jamaicans are black. Her dad has said he is East Indian.", "label": 1}
{"text": "I wonder if youre an asshole because of your parents or in spite of them. Either way your mom shouldve swallowed.", "label": 1}
{"text": "Bunch of Caspers", "label": 1}
{"text": "Wow are you a bigot and a racist, since none of that happens with Trump you must be deflecting.", "label": 1}
{"text": "Looks like only one Broncs fan was brave enough to take a banning after beating ... the Panthers.  Good job!", "label": 1}
{"text": "This here is a child that doesn't know economics, security, or foreign policies.\n\nHe just knows what his favorite person vomits all day long.\n\nResearch inflation today and pick one of the others tomorrow.", "label": 1}
{"text": "What a horrible idea especially because sometimes its DPI but the ball is almost uncatchable even without the DPI", "label": 1}
{"text": "People care about what fascists do and plan to do. Weird, right?", "label": 1}
{"text": "Death by firing squad.", "label": 1}
{"text": "Probably because Trump’s administration has said he doesn’t care if they’re legal they need to get out of the country", "label": 1}
{"text": "lol thanks for sharing", "label": 1}
{"text": "Little joke book for you", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "This is what that other posts said and exactly what that other  one said that had that X link attached to it.", "label": 1}
{"text": "The mods of this subreddit are so dog shit with what is allowed vs not. The whole twitter rule especially is straight trash.", "label": 1}
{"text": "My twitter timeline has been very divided about it", "label": 1}
{"text": "😂", "label": 1}
{"text": "I'm not?\n\nI'd criticize literally any QB for this.\n\nThe entire world isn't against you just because you like to play the victim. You're acting like a big time loser for a fan of such a successful team. Reflects pretty poorly on you.", "label": 1}
{"text": "Go ahead and tell him you snowflake!", "label": 1}
{"text": "I’m content with knowing I don’t have sawdust for brains 👍", "label": 1}
{"text": "I know like Bosa even more", "label": 1}
{"text": "Lmfao you really are an idiot.", "label": 1}
{"text": "Hey bud, I already pointed out which specific seasons and all you've done is ignore it. I think you're more interested in avoiding the topic atm.", "label": 1}
{"text": "My initial question was specifically about a season, last season. He played in a lot of big games last season, how many did he win?", "label": 1}
{"text": "I hear you. I don’t know. Which ones were big games? I’m sure you already know. Still not what we were talking about.", "label": 1}
{"text": "LMAO if any admins see this reply, your all weirdos. Deshaun Watson is genuinely the scum of the earth and deserves worse than his achilles rupturing.", "label": 1}
{"text": "Not new. I'm pointing out something that's objective not playing any type of victim card.\nFans across the NFL have coined the term \"40 whiners\" because of the perpensity to whine and make excuses.", "label": 1}
{"text": "Yes they should. I will celebrate every injury that happens to a rapist and or domestic abuser. Literal scumbags making millions to play a game. I hope Deshaun Watson never takes another snap.", "label": 1}
{"text": "Well they are the only fanbase that has ever been mocked so you got me there.  /s", "label": 1}
{"text": "Dude is a top coach all time and I’m not trying to correct that by saying he could’ve done better but he definitely could have been nicer or at least a little more friendly to his team lol", "label": 1}
{"text": "He does live in Cleveland.", "label": 1}
{"text": "McAfeeis such a shit show. The guy's an annoying jackass who gives a plstform to a medical disinformation conspiracy theorist who hibernates in a gopher hole. And this clip, wtf? The play they're showing takes up 1/20th of the screen. Is this a clip for ants?\n\nGarbsge person  Garbage production.", "label": 1}
{"text": "You know that most people aren't going to clutch their pearls about someone taking a picture with a former president, right?", "label": 1}
{"text": "Games against the worst of the NFL?  Awesome argument you got there, bud Anything to dodge the reality of Caleb Williams throwing for 33 total yards until the game was almost over. \n\nDude is not that good. Get over it. No need to have a potty mouth over it. ", "label": 1}
{"text": "Oh, so not only are you still whining about it, you don't understand how football works.  Got it. \n\nJust because you looked up someone's position on a Madden depth chart that does not mean it's accurate to that players role on an actual NFL team.  \n\nIt was not a \"TE3.\"  It was a pass-blocking specialist.  And the assignment wasn't to full-on block Reddick, it was to chip him.  And it actually worked.  Reddick was out of the play long enough for the QB to get rid of it, but Purdy - by his own admission - held onto it too long.  \n\nBut yet again, your still playing the victim card acting like your team was the most talented team of all time and a healthy QB wouldn't have resulted in a different level of play and how dare anyone make such a point, or else feel so offended.  \n\n\n>about a non NFL player who hurt your feelings \n\nLmao.  \n\nMy feelings weren't hurt.  Again, I'm here laughing at the Eagles.  \n\nAnd no, what he did was put his hands on an opposing player.  \n\n>Enjoy last place in your division\n\nUm... What?  They are in 2nd.  \n\n\nDo you feel this victimized that you are stuck in the past all because some people said having a healthy QB on the field matters?", "label": 1}
{"text": "> about a non NFL player who hurt your feelings\n> \n> Lmao.\n> \n> My feelings weren't hurt. Again, I'm here laughing at the Eagles.\n> \n> And no, what he did was put his hands on an opposing player.\n\nBro, you're posting about it a year later in a totally unrelated thread because you're so hurt by it lol. It's really not hard to see. \n\nYou really don't understand the core concept of the word \"Victim\".\n\n Ah my bad you're right they're in 2nd. \n\n>It was not a \"TE3.\" It was a pass-blocking specialist. And the assignment wasn't to full-on block Reddick, it was to chip him. And it actually worked. Reddick was out of the play long enough for the QB to get rid of it, but Purdy - by his own admission - held onto it too long.\n\nSo it in fact....did not work. Got it. What do you think Purdy is going to do in that situation? \"Ah yeah, well, the protection sucked so I kinda got blown up\". \n\n>And no, what he did was put his hands on an opposing player.\n\nSo after Greenlaw suplexed a player out of bounds ( a penalty btw), and was standing on the sidelines jawing at Eagles players, a staff member inserted himself inbetween them. In response the undisciplined player (while on the Eagles sideline) proceeded to jab his hand towards the staff member. \n\nThanks for clearing that up, my guy.  \n\n\n>And the assignment wasn't to full-on block Reddick, it was to chip him. And it actually worked. \n\nMy guy, this is a straight up block. He's not chipping in this. A chip block would indicate (shocking) chipping a player and continuing on a route. He is full on blocking. He in fact continues to try to block as Reddick rushes past him.\n\nhttps://www.youtube.com/watch?v=qcZgvUzIc7w\n\nlmao, bro just take your witty one liner W and bounce.", "label": 1}
{"text": "Great White Hope", "label": 1}
{"text": "For what Watson did, I hope he breaks a new bone every morning that he wakes up. Forever.", "label": 1}
{"text": "Thats like 3x of the nBA finals", "label": 1}
{"text": "NFL is KING for a reason.         \n\nHilarious people thought NBA would overtake it when an NBA finals havent even broken 14 million in half a decade lmfao", "label": 1}
{"text": "He's not. This guy is just on the verge of fainting because somebody doesn't share his views", "label": 1}
{"text": "Part of publicly expressing political views is that people might not like your political views, sorry but that's the situation Bosa has put himself in", "label": 1}
{"text": "This kind of response is why they knighted him Sir Charles. Legend", "label": 1}
{"text": "LMAO cry bitch.", "label": 1}
{"text": "You’d think it was JJ coming back, the way he’s grinning.", "label": 1}
{"text": "Ofc your brain dead ass would say this", "label": 1}
{"text": "can't wait to no longer see these soy vote commericals when right wingers purposely make your vote worthless if you arent a swing state, just vote guys!! so important im gonna turn California red!", "label": 1}
{"text": "Pickens would be a HOF in Smear the [Removed]", "label": 1}
{"text": "Oops! All pass rush", "label": 1}
{"text": "A former president with a pretty shady history. You take that presidency away and he's still... A terrible person? Come on man. ", "label": 1}
{"text": "I’m really why that wasn’t a flag. The rusher flew into the punter’s plant leg.", "label": 1}
{"text": "He dove into the plant leg lol\n\nSteelers definitely got away with one.", "label": 1}
{"text": "Eli is genuinely hilarious.", "label": 1}
{"text": "I think I’d get tired of hearing the same sentence or phrase repeated about 3 times.", "label": 1}
{"text": "I think he did back in week 1, 2008 against KC", "label": 1}
{"text": "Where the fuck was the flinch? What the hell is  going on?", "label": 1}
{"text": "Sometimes a bad guest will make it unlistenable but it’s usually pretty good.", "label": 1}
{"text": "Oh! sorry", "label": 1}
{"text": "It’s the giants dawg. I know yall lost to em but it’s the giants.", "label": 1}
{"text": "You lost to Jameis Winston 😂", "label": 1}
{"text": "Was Russ purposefully bad in Denver or something?", "label": 1}
{"text": "I'd fuck her other eye out", "label": 1}
{"text": "You lost to two of the below 25th rated worst defenses in the league. The cowboys and colts. Don’t get so high and mighty just because Russ showed up. Our matchup will be a rude awakening for how good you think your team is.", "label": 1}
{"text": "Rude awakening? If by that you mean watching Lamar lose against us for the 10th straight time sure.", "label": 1}
{"text": "Lmao enjoy yourself when we come back to that comment in a few weeks.", "label": 1}
{"text": "And I’ll come back to this comment when we we the division.", "label": 1}
{"text": "I feel like they just picked trans people as the enemy arbitrarily and now we're getting close to trans people getting lynched regularly.", "label": 1}
{"text": "Did he just leg drop the ball carrier?", "label": 1}
{"text": "lol. lmao even", "label": 1}
{"text": "Insane Daniel Jones has lasted 6 years in fucking New York City", "label": 1}
{"text": "Says the guy with a dog fucker of a QB", "label": 1}
{"text": "It sucks for him so much because he played pretty well but the bad parts are so bad", "label": 1}
{"text": "Chicken Nugget head", "label": 1}
{"text": "It’s good, but no. Nothing will ever replace that.", "label": 1}
{"text": "Eberflus said no TO was needed because “everyone was lined up.” He’s a fucking clown.", "label": 1}
{"text": "What’s the explanation for the no call on that punt?", "label": 1}
{"text": "The lack of awareness when your losses are the \n\n*checks notes* \n\n2-6 Browns \n2-6 Raiders\n\nIs astonishing LMFAO. Do you understand that if not for the Ravens both those teams would have achieved a single win this season coming from against \n\n*checks notes*\n\nThe Raiders via the Browns\nThe Browns via the Jaguars. \n\nLMFAO. Wtf are you talking about you dumb fuck.", "label": 1}
{"text": "Haven't you guys been pretty bad against the last few years and Lamar himself has been historically bad for him in the last several years as well? Not saying is impossible that we lose, but history is kinda on our side. We've had your number for a while. ", "label": 1}
{"text": "History doesn’t matter though since every year is a completely new team", "label": 1}
{"text": "There’s no lack of awareness. Do the browns not have a significantly better defense than either team you lost to? Were they not led by a significantly worse playing quarterback before with Watson? I know they shouldn’t have lost either I’m not unaware. Didn’t the ravens also clock off 5 straight wins and the browns was flukey at worst considering the drops. That doesn’t mean you didn’t have bad losses too you dumb fuck. You think you did something. Congratulations you’re still a fucking clown. Bye", "label": 1}
{"text": "Can’t wait to come back to this thread. Fucking clowns", "label": 1}
{"text": "Cannot wait 😂", "label": 1}
{"text": "Rather lose to New York than Cleveland lmao", "label": 1}
{"text": "You have anger issue that I’m guessing exist outside of Reddit as well. Get that sorted. You’ll be happier.", "label": 1}
{"text": "One thing I tell young people is there’s just no point in slacking off. Like if you’re there just be there. It’s like the easiest thing in the world you can do to separate yourself from the pack. Like just be present and genuinely show up.", "label": 1}
{"text": "Real Tortoise & The Hare shit.", "label": 1}
{"text": "I understand the rationale because there are over 100 games being played every week between FBS and FCS alone, and then there are D2 and D3 games that can generate highlights and interest.\n\nThe megathread solution is really annoying, though. I'd rather just rely on filtering by post flair.", "label": 1}
{"text": "Oh hey, it’s another idiot who thinks wins are a QB stat and never actually watched how awful Sanchez was!", "label": 1}
{"text": "Are you mentally stupid or something? \n\nYou hate so much, you can even appreciate greatness. Why not? You wanna some dumbass conspiracy theory. You uneducated degenerate", "label": 1}
{"text": "Damn bro. Are you okay?", "label": 1}
{"text": "My team’s a dynasty. Not my fault you wanna have and disrespect greatness. Sorry the saints only got 1 ring with Brees buddy lmao", "label": 1}
{"text": "Programs that remain traditional developmental programs are going to be NFL pipelines for savvy franchises.", "label": 1}
{"text": "I'm talking about the coach dummy, good coaches adapt to the talent they have and play to their strengths.", "label": 1}
{"text": "No that's a yes, as in, yes, you're a moron lol", "label": 1}
{"text": "When I learned Anthony Richardson grew up without a father, I connected a lot of dots about his work ethic.\n\nHe’s lazy and has failed to scratch his potential because he coasts off of his god given gifts. No one was there to tell him to tell him to raise his GPA in school, no one was there to give him tough love, he’s a coddled brat who happens to have the best arm and athleticism we’ve ever seen. \n\nImagine how good Richardson would be if he grew up with a father like Deion man.", "label": 1}
{"text": "It's gotta be all that sweet sweet ad money on all their broadcasts.\n\nSeriously any Eagles game or Steelers game is just wall to wall KAMALA TRUMP KAMALA TRUMP", "label": 1}
{"text": "Somehow, Flacco returned.", "label": 1}
{"text": "lol this is the comment.", "label": 1}
{"text": "eat shit and die", "label": 1}
{"text": "This was not a MNF game, we were pushed to Monday because of Covid, but we weren’t the MNF game that week.", "label": 1}
{"text": "Thats so dumb because they coulda kept him to build around bryce young", "label": 1}
{"text": "As a black male unfortunately the racism bait you just tried to force on me don’t work. Stop projecting. And if you noticed I said in the playoffs. Have a nice day you ignorant bitch", "label": 1}
{"text": "Teams need to employ the Jordan Love plan if it's obvious the incredibly raw but extremely physically gifted qb is incredibly raw but extremely physically gifted. Anthony Richardson should've never touched the field last year because then he would at least have a year of practice reps instead of a year of injury rehab going into this year. He's basically still a rookie, a rookie who already had limited playtime in college.", "label": 1}
{"text": "I'm sure someone like you actually would", "label": 1}
{"text": "No one said Nazi, you bot", "label": 1}
{"text": "Just because you disagree with me doesn't make me a bot.", "label": 1}
{"text": "If he was a surfer he'd be Xavier Surfie", "label": 1}
{"text": "Was the insult in my comment that Americans are weird? \n\nSorry if that crossed a line.", "label": 1}
{"text": "Justin Jefferson ", "label": 1}
{"text": "Why did a small comment set you off so much. You need a therapist. Also the two jokes are related as the first person didn’t make the fish joke , the fish reference is the post title and not presented as a jokeas you suggested. Commenter one made a pun of worthy’s last name which commenter two followed with another pun. So the joke is good, in line with the theme. You just can’t fucking read and are too angry to think above a room temperature iq donkey.", "label": 1}
{"text": "What’s wrong with you", "label": 1}
{"text": "Are you a trump supporter?", "label": 1}
{"text": "ignore the trump troll they are getting desperate.", "label": 1}
{"text": "No but I don’t wish death on anybody’s children you weirdo", "label": 1}
{"text": "If Trump wins then women will be forced to carry babies.", "label": 1}
{"text": "Found the MAGA apologist", "label": 1}
{"text": "Not surprised to see MAGA goons in r/nfl coming out of the woodwork.", "label": 1}
{"text": "People like you who use the \"reddit cares\" feature as a troll need a therapist. That's actually really creepy behavior.", "label": 1}
{"text": "Worthy and scurvy have assonance in the \"er\" sound, it's a play on words.  So, not entirely unrelated, but puns aren't for everyone.", "label": 1}
{"text": "Fuck Jim.  He’s all of my neighbors", "label": 1}
{"text": "You know what isn't confusing for any of us? The fact that you are acting like an ass.", "label": 1}
{"text": "I don't disagree that it's a pun, it's just an irrelevant pun, since no one was talking about pirates.", "label": 1}
{"text": "Any wordplay connection is a functional pun.  Doubles and triples are awesome.  But one connection is enough.", "label": 1}
{"text": "u/rocksoffjagger is just your typical unadjusted pissed off racist Bostonian. He'll die of some rage fueled heart attack at the ripe old age of like 32 and one of his parents might care.", "label": 1}
{"text": "Mr Bad Comic", "label": 1}
{"text": "You sound ignorant as hell. 1. I said in the playoffs 2. My distaste for Lamar has absolutely nothing to do with his skin color considering 300 years ago me and him would’ve been on the same field together and I’m not talking football. 3. I’m assuming you also wrote the book on race too which ya didn’t cuz if u did you would know that Mahomes is a black man first. So the next time you feel so emboldened to use a term coined by the good ole boys make sure you aren’t addressing a black man.", "label": 1}
{"text": "Bringing a racism accusation into this is wild.", "label": 1}
{"text": "> People like you who use the \"reddit cares\" feature as a troll need a therapist.\n\nAgreed. Doesn't matter how dumb someone's argument is, it's a low blow to do that.", "label": 1}
{"text": "But it is.\n\nThe guy was out with a concealed weapon without a permit. That's... not good, at all.\n\nIn a nation where we can't even seem to keep kids in schools safe - downplaying gun crimes is a bit pathetic, IMO.\n\n\\*Sorry, guys, didn't realize a WR being able to carry a gun is so important to all of you, lmao.", "label": 1}
{"text": "Was he charged with a gun crime? This dude ain’t even in the innocent until proven guilty stage of the justice system and you’ve already passed judgement. Fuckin Reddit….", "label": 1}
{"text": "Clutch those pearls a bit tighter", "label": 1}
{"text": "The law does nothing but help trap criminals. People out here thinking like carrying a gun without a piece of paper is some horrible crime. It’s no more of a background check to get a permit than it is to purchase a handgun in the first place. But go off", "label": 1}
{"text": "it’s ok to be ignorant but to be that confident? Oof. Go read some law & come back boss", "label": 1}
{"text": "Over the past 24 hours we've seen the true all pros of pearl clutching come out of the woodwork. It's like you have to wait for the dumb dumbs to come down from their emotional high and go back to the shadows.", "label": 1}
{"text": "LOL! WHAT???\n\nI'm racist because I think breaking gun laws is actually bad? Holy fuck.", "label": 1}
{"text": "His brother has a concealed permit, and the law is muddy on whether his gun under the seat is covered by that. Quit acting like this is even a story, it’s literally just blown out of proportion by local tabloids", "label": 1}
{"text": "cause fuck ya that’s why. its deep now", "label": 1}
{"text": "This is the same idiot I was arguing with the other day. He has had WAY too much Broncos koolaide and he come out the closet full blown blackout drunk after a couple wins against doormats.", "label": 1}
{"text": "If you read some Bills Postgame threads, you'd think they're a bottom five staff lol", "label": 1}
{"text": "What the fuck are you talking about you dork? This \"argument\" was me saying the Panthers suck ass and it's the direct result of Tepper's ineptitude and you got pissy over people saying Tepper suck as an owner, lmao. What does Broncos fandom even have to do with any of that?\n\n>he come out the closet full blown blackout drunk after a couple wins against doormats.\n\ndog I've been here for a decade posting away through the worst of it win or lose lmao I'm not going anywhere", "label": 1}
{"text": "Ah so you can link where he was charged? Oh wait, he hasn’t been and you’re just incriminating black people at this point. Gotcha. True colors will always shine through!", "label": 1}
{"text": "Maybe I misremembered which Broncos fan it was. For whatever reason, I continue running into you dudes on a high horse right now. Also, you’re still wrong about Tepper.", "label": 1}
{"text": "Lmao you're over here criticizing the Broncos for coming out after beating doormats (ie, you) and still want to act like Tepper isn't the entire reason the Panthers are doormats", "label": 1}
{"text": "Call em like I see em. Sorry for offending you.", "label": 1}
{"text": "Read this and then stfu, bigot. \n\n[https://www.cbssports.com/nfl/news/police-launch-an-internal-investigation-after-lions-wr-jameson-williams-avoids-arrest-for-gun-possession/](https://www.cbssports.com/nfl/news/police-launch-an-internal-investigation-after-lions-wr-jameson-williams-avoids-arrest-for-gun-possession/)", "label": 1}
{"text": "What the hell is there to be offended by? I'm just astounded you can't put the connection between the Panthers being the punchline of the NFL and Tepper's ineptitude", "label": 1}
{"text": "Well, Tepper doesn’t coach and Tepper doesn’t play on Sundays. Blame trading the farm for BY on him all you like, but Tepper isn’t the one out there shitting the bed.", "label": 1}
{"text": ">Tepper doesn’t coach\n\nWho do you think is the one hiring and firing these bad coaches every other year lmfao\n\n>Blame trading the farm for BY \n\nYou guys were a doormat before trading the farm for BY because of Tepper\n\nAnd yeah, I am going to blame Tepper for that, just like practically every important move the Panthers have made under his tenure, Tepper has been a shit owner because he's been getting involved in football decisions when he has no business in any of that", "label": 1}
{"text": "Get the fuck over it.\nThe man is now HAPPILY with a new organization and coach that he clearly loves and that clearly appreciate him. \n\n\nAnd you all seem to be overjoyed with your recovering-drug-addict-has-been coach and new rookie QB who you all act like is the reincarnate of Elway&Manning. \n\n\nRuss is a Steeler now. Worry about flicted feet Bo Nix for a change", "label": 1}
{"text": "You’re talking about the past. By all accounts, Tepper has ceded much of that decision making this past off season. We made some good moves during that time frame. I’m looking at the future. We’ve been shit, we are still shit, and we might even be shit next year. But we do not have a bad owner. Over zealous in trying to make his mark? Count it. Throwing everything but the kitchen sink at the team trying to win? Also, yes. I refuse to fault a proactive owner for being proactive. I’d rather that than many other situations around major league sports.", "label": 1}
{"text": "We’re joking about testicles, buddy - relax.", "label": 1}
{"text": "This man is down bad", "label": 1}
{"text": "Damn we got black MAGA now we got black Zach Wilson.", "label": 1}
{"text": "Is AR restarted?", "label": 1}
{"text": "We take testicles very seriously in Pittsburgh.", "label": 1}
{"text": "Don't worry about him. He's just uncomfortable with Russ's exes talking about the man's beautiful balls. You'd be jealous too!", "label": 1}
{"text": "They rushed three dude, shut the fuck up.", "label": 1}
{"text": "He kept the play alive for almost 13 seconds before throwing.", "label": 1}
{"text": "They rushed 3 defenders against 5 linemen. He could have held the ball another 30 seconds if he wanted to what does that matter lol", "label": 1}
{"text": "They gotta be bandwagon young fans cause most of us aren’t like this lol", "label": 1}
{"text": "Why would owners agree to that? Players get their bucket and these would be players", "label": 1}
{"text": "Because it improves the quality of the on field product which theoretically will increase revenue. I'm not saying they'll go for it but that is the argument. You want your star players to stop getting hurt, so you increase the roster size so they can play less snaps per game.", "label": 1}
{"text": "Maybe dont be a moron. You *seriously* think having a bucket of money explicitly for paying players and then we should add players and not pay them from that bucket makes any sense. If so you are literally braind dead and should feel bad.", "label": 1}
{"text": "He’s a menace", "label": 1}
{"text": "Its also the price to pay to allow for evaluating the team and to keep the offense steady. A bad LT would make everyone look bad, but this at least allows the rest of the players to do their job.", "label": 1}
{"text": "Your fan base is a joke.", "label": 1}
{"text": "Stay trash", "label": 1}
{"text": "“Lazy N-word” - couch athletes who happen to also be racist", "label": 1}
{"text": "Gotta gas up the cash cow", "label": 1}
{"text": "Two things:\n\n1.) Kinda pathetic that there’s a lot of comments going “lol man wearing girl thing”.\n\n2.) Bell is a Trump supporter and went on stage with him, let that clue you in as to what he means by “they done got to em”", "label": 1}
{"text": "Well lev is a trumper, I think that should explain everything.", "label": 1}
{"text": "Are fans just supposed to accept watching what boils down to practice for a season? The season isn't technically over yet and teams should be trying their hardest to win and put a good, entertaining product on the field. You can plan for the future but throwing good after bad or tanking is a big \"fuck you\" to the people who are paying good money and spending their time to watch you just shit the bed.", "label": 1}
{"text": "Fuck the Packers.\n\nThat is all.", "label": 1}
{"text": "What a shame it didn’t take you down lmfao. Maybe next time 😂", "label": 1}
{"text": "Reddit when the handsome white guy with boyish charm has a big arm and is an effective runner: 😍\n\nReddit when the kinda fugly black guy has a big arm and is an effective runner: 😡", "label": 1}
{"text": "Step 1: Be attractive \n\nStep 1: Don’t be fugly ", "label": 1}
{"text": "Dude im more healthy and in shape than you'll ever be sitting on the computer being a keyboard warrior. I promise the only thing COVID is gunna take down is your fat ass.", "label": 1}
{"text": "https://www.reddit.com/r/BreakUps/s/QsFPo4ZRxC\n\nLol", "label": 1}
{"text": "Keep it about football , weirdo behavior making it personal", "label": 1}
{"text": "how deep did you dig to find that? you've achieved salt levels I thought were just myths", "label": 1}
{"text": "Okay buddy. Feel better?", "label": 1}
{"text": "😬", "label": 1}
{"text": "okay, fuk the jets but that’s a perfect defensive playcall", "label": 1}
{"text": "Injury fans eating good tonight", "label": 1}
{"text": "How dare Aaron Rodgers do this.", "label": 1}
{"text": "This game is terrible.", "label": 1}
{"text": "People say this, but I don't get it. The HOF is becoming more accepting for players that were dominant at their position but didn't have the best longevity stats (not that Henry's, particularly TDs, aren't impressive). We've seen Calvin Johnson and Terrell Davis get in because they were clearly better than everybody else and Henry falls in that same boat.", "label": 1}
{"text": "Not when ya mutha's eating ^ooooooo", "label": 1}
{"text": "Untouched for 10 yards, oline porn right there", "label": 1}
{"text": "He has like 80 yards today", "label": 1}
{"text": "Hell of a nose on that guy", "label": 1}
{"text": "Al Michaels 😂", "label": 1}
{"text": "Alright. I’ll take the account ban. How many white dudes have done this?", "label": 1}
{"text": "To be fair, most WRs and RBs are black.", "label": 1}
{"text": "Soft soft soft holding call.", "label": 1}
{"text": "Holy shit that was an incredible snag.", "label": 1}
{"text": "If the shin counts then that’s a catch.", "label": 1}
{"text": "What I hate is how feet are treated differently. If you catch with one foot and your heel inbounds but then the rest of your foot steps out, it’s ruled an incomplete pass. Yet if your toe just grazes inbound and then your heel lands out it’s complete.", "label": 1}
{"text": "I like the call, I just wish feet weren’t treated differently. It should be any part of both feet being inbounds at the same time with control should constitute a catch. I’m OK with other body parts counting as two feet, too.", "label": 1}
{"text": "What a dipshit lol.", "label": 1}
{"text": "You can’t bowl the snapper over on FG attempts.", "label": 1}
{"text": "DOINK", "label": 1}
{"text": "How are the Jets going to manage to lose this one?", "label": 1}
{"text": "Texans fan here - OC has been shit on a lot lately but that trick play is icing in the cake he may be a bust", "label": 1}
{"text": "average bengals fan ball knowledge", "label": 1}
{"text": "I don’t know why you don’t snap it there and run the play. How many times have we seen teams desperately need that third TO at the end of the game?", "label": 1}
{"text": "A-Rod is back.", "label": 1}
{"text": "It’s called Obama", "label": 1}
{"text": "r/jets has been the real poison all this time", "label": 1}
{"text": "It's a Thursday game that is garbage itself... it's 12:24 on the east coast, ... I'm in the west. U stayed up for this garbage game despite a 2-6 team besting a 6-2 team... go to bed", "label": 1}
{"text": "Not as much as ur mom when she had u", "label": 1}
{"text": "The list of guys who have done this isn’t very long to begin with. Far too small a sample size for you to be making racist assumptions.", "label": 1}
{"text": "See, I said it's great... 🤣", "label": 1}
{"text": "It did for her", "label": 1}
{"text": "Thank u. She keeps calling.", "label": 1}
{"text": "Try to add to someone else else's missory...get u more points in no one cares land", "label": 1}
{"text": "1st comprehensive thought. Actually a Hawks fan that's lives in SoCal. Gave an opinion and got attacked.", "label": 1}
{"text": "Costumes were terrible", "label": 1}
{"text": "TY", "label": 1}
{"text": "Listen to E40, bitches ain't women", "label": 1}
{"text": "Ur mom. Go to bed", "label": 1}
{"text": "Why", "label": 1}
{"text": "Coherent think different \nIt's cool \nGo Vote", "label": 1}
{"text": "Pickens literally never got his other foot down. His left foot touched twice. That’s not a touchdown, moron.", "label": 1}
{"text": "Imagine living such a sad life that you're still concerned over who took the COVID vaccine or not.", "label": 1}
{"text": "Found ur ass in Fairfield", "label": 1}
{"text": "Gay", "label": 1}
{"text": "I mean there is logic, you're just too dumb to get it i guess\n\n> 2 toes is better than 10 toes depending on which direction you face\n\nThis is also completely irrelevant, the number of toes or direction you face has nothing to do with it. if you have 1 toe from each foot you're good, regardless of direction. Idk why you're making up these dumb rules to make it seem worse than it is.\n\n1 foot touching twice is obviously not the same as a shin down, or 2 feet. \n\n>A lil tippy tap is not the same as the full forefoot on the ground\n\nIf you have \"a little tippy tap\" from both feet, it sure is the same as 2 feet down\n\nDamn bruh just make our education system look even worse, keep crying so everyone knows how dumb we are in the US -_-", "label": 1}
{"text": "Wow, Malachi Corley had an easy touchdown all lined up, but he just couldn't resist the urge to drop the ball before crossing the goal line! Talk about a rookie mistake! It's one of those moments that makes you cringe as a fan—he had the entire field ahead of him and a clear path to the end zone. All he had to do was secure the catch and finish the play. That’s a tough lesson to learn, especially at this level. You’ve got to play until the whistle blows! I hope he bounces back from this because he’s got a ton of potential. Let's hope he learns from this and doesn’t let it define his season! 😬🏈", "label": 1}
{"text": "Down 4 late in the 4th and you elect to not take the opportunity for a touchdown? Are you dumb?", "label": 1}
{"text": "30 sacks halfway through the season is pretty rough. Almost 1/4 of ALL the sacks this season coming in one game is truly awful.", "label": 1}
{"text": "Anyone at any level should be able to take a day to be a parent.", "label": 1}
{"text": "I heard this in my head so clearly that I'm convinced he's actually going to say it.", "label": 1}
{"text": "I really enjoyed that postgame interview. He was having fun with the whole costume bit and was being pretty genuine and relaxed.\n\nThe funniest part was Fitzy telling Rodgers that since 2016 only one Jets QB has had a worst first half: Ryan Fitzpatrick. https://youtu.be/kOT_yYY0EeE?si=4u3CQzjJ3OMRbt9m&t=90 starts around the 1:30 mark.", "label": 1}
{"text": "He hasn't thrown for 300 yards!!1!1!!\n\nThe Rodgers hate is so ridiculous around here. Dude is undeniably one of the greatest QBs to ever play the game and redditors treat the guy like he's Deshaun Watson because he has some opinions they disagree with.", "label": 1}
{"text": "😂😂😂", "label": 1}
{"text": "I made a one-liner joke and got paragraphs back in response. Yeah, I’m soft. lol", "label": 1}
{"text": "Lmao 4 sentences is a lot. Oh boy. It musta took me all day to write it\n\n2013 Seahawks fans over here. Decent for a season or two and yall get all arrogant\n\nWin something first before talking shit", "label": 1}
{"text": "No one is talking shit about winning. Just about statements perceived as soft. I know it’s complicated soI tried to dumb it down to your level.", "label": 1}
{"text": "LOL no one is confused dipshit. Read the thread. \n\nAll these lons fans crying and it's the packers fans who are like \"if you actually read the quote, it's not really anything\"\n\nYou didn't try and do shit besides whine about it like everyone else. Please.\n\nIf ur gonna pretend to be winners, act like it. No one but insecure fans are upset about a Lil trash talk", "label": 1}
{"text": "You can't make me treat the lions like the bad guys. This is their catharsis. Let them have it.", "label": 1}
{"text": "I said your safety was “in the safe space zone”. Is that talking shit about winning or is it calling his comment soft in a satirical way? And don’t call names, this isn’t that serious.", "label": 1}
{"text": "Not that serious either. My response less about ur specific reply and more the general response from Lions fans\n\nThey calling him for soft for a nothing comment and then they are the ones being soft about it.\n\nAnyways, see ya Sunday guy. Settle this on the field", "label": 1}
{"text": "Lol you really did legit fall for it, didn't you", "label": 1}
{"text": "You wanna know what's ridiculous? The entire republican party voting down a bipartisan border security bill that would've given them everything they asked for. Because Trump told them to.\n\nThat's ridiculous.", "label": 1}
{"text": "Yeah, we have it because Biden isn't wasting *billions* on a fucking insane nonsense wall.", "label": 1}
{"text": "Thanks for proving my point and destroying your own point", "label": 1}
{"text": "When you promise open borders, you get a lot more border crossing, when you get a lot more border crossings, you get more encounters. The border agents have denounced Biden’s handling of the border. When they’re not flying migrants all over the country, they’re releasing them without any sort of vetting. I cannot believe I have to explain this.", "label": 1}
{"text": "Guy probably thinks there are 500 million trans antifa illegal immigrants living in the US", "label": 1}
{"text": "or to put it more bluntly, that open is a synonym for unsecure", "label": 1}
{"text": ">source source source sourcehahahaiauagsgdiwkuabthththtltptptptp\n\nLiterally all common knowledge. Step outside your bubble once in a while", "label": 1}
{"text": "So you don't understand how any of this works, just what Trump and his ilk tells you to believe. Got it.", "label": 1}
{"text": "Reetard alert ⚠️ 📢", "label": 1}
{"text": "To remind you to vote, but also this https://www.reddit.com/r/bengals/s/XA7TxaC8v8", "label": 1}
{"text": "Hopefully his holiness graces us with a #GoBirds next", "label": 1}
{"text": "Caleey Williams and they/them’s lgbtqb isn’t even a good qb", "label": 1}
{"text": "Well, when you look at it like this...", "label": 1}
{"text": "Then go stop them", "label": 1}
{"text": "Panthers have no idea at all what they’re doing.", "label": 1}
{"text": "You understand he was asked the question? He didn’t just randomly say this? He was asked a question and gave a common sense answer. I can guarantee you Flacco isn’t taking it as a slight", "label": 1}
{"text": "“Using Flacco as a scapegoat” smartest Pats fan", "label": 1}
{"text": "Epic reddit burn 😱", "label": 1}
{"text": "You don’t know ball", "label": 1}
{"text": "Listen I love shitting on it but I also am mostly fine with it. If I was a Giants/Jets fan I'd be livid. You will almost always have to be 2-3 guys deep on offense and defense at almost every position because playing on that field. You can say other teams have it, yet whats under the grass, is it indoor, etc. I bet there are no other outdoor / northern teams that have that exact type of shit grass in their stadium. And if they do, they will have same issue you guys have.", "label": 1}
{"text": "ilove atl kirk", "label": 1}
{"text": "Hi", "label": 1}
{"text": "Yes, because trashtalking on a months old comment only when your team wins is reasonable behavior and sportsmanship.\n\nAnd you may remember how poorly you were collectively treated after the Russ trade because of all of the Broncs fans going JILTED EX GIRLFRIEND and ENJOY DREW LOCK nonsense every time a Hawks fan appeared.  How did that trade work out for you?  Oh, right, Hawks fans were right all along.  Oops.\n\nBreak out the fiddles, fellas, we have Professional Victims over here.\n\nGo cry in a corner, but don't dial my number unless you want me to pick up.", "label": 1}
{"text": "Showboating will kill you.", "label": 1}
{"text": "He’s probably shocked that he can’t get away with saying crazy things like the people he’s voting for lol", "label": 1}
{"text": "Wish he had slammed the student into the ground", "label": 1}
{"text": "Hell no he shouldn’t. Fuck that guy for saying that, hopefully he get exposed and doxed", "label": 1}
{"text": "It’s frankly getting time to suspend assault laws and let these guys remind everyone why you don’t talk shit.", "label": 1}
{"text": "Nice to know college white boys haven't changed a bit. What an asshole.", "label": 1}
{"text": "Probably a Trump supporter", "label": 1}
{"text": "Sadly, this is far from Penn State’s worst. See: Sandusky/decades of child rape cover up along with James Frankin, rape apologist at 2 schools.", "label": 1}
{"text": "Apparently it is to MAGAts. They admire couch fuckers.", "label": 1}
{"text": "She’s not some supermodel but it’s not hard to see the appeal. Her talent/worth easily outweighs the lack of an ass imo.", "label": 1}
{"text": "Dude Donald Trump is Bad", "label": 1}
{"text": "\"Yo, your brother is gay because he's fucking a hot billionaire woman.\"\n\nPlease fucking vote, people.", "label": 1}
{"text": "That kid needs his teeth kicked in. Jason's response was less than deserved.", "label": 1}
{"text": "Hate to have you as a sibling.  I'd have put that guy in a box.", "label": 1}
{"text": "Mid 30s but it feels like I'm really close to figuring out how to do it. Just need a guidance counselor who gets me.", "label": 1}
{"text": "It’s not actually hate speech if the person isn’t gay", "label": 1}
{"text": "Ooh no, i just kinda figured if i ask a certain person a question and then someone answers it as “I” that logically i could conclude it would be the person i asked the question too, because what self righteous prick would go out of their way to answer a question that wasn’t asked to them so they can point out the incorrect use of grammar that has no impact at all on literally anything in a football thread lol? Well i guess i can answer that. Handlit33 is the self righteous prick. Is it like a high you guys get?? 🤣", "label": 1}
{"text": "Yeah because saying that about a straight couple is suuuuuch a problem lol", "label": 1}
{"text": "He needs to apologize for saying the slur back to the kid.", "label": 1}
{"text": "Saying what? Go on, we know you want to.", "label": 1}
{"text": "Oh I say it all the time :) Bi though, so find another slant.", "label": 1}
{"text": "No they let you put stuff on the back of helmets", "label": 1}
{"text": "Gonna come down to this\n\n\nhttps://imgflip.com/memegenerator/237132471/Peter-Griffin-skin-color-chart-race-terrorist-blank", "label": 1}
{"text": "Nerds on the internet", "label": 1}
{"text": "I feel like there should be a link. \n\nFTP! My friend", "label": 1}
{"text": "Redditors with nothing else going on", "label": 1}
{"text": "Fuck Trump 🇺🇸🇺🇸🇺🇸", "label": 1}
{"text": "I mean as a 49er fan this makes it harder to enjoy watching him play.  Not just because of his personal politics, but moreso because he's the kinda shitbag to make it a public thing.\n\nEspecially once you stack on the stuff he said when he was younger... the bs apology...", "label": 1}
{"text": "2024, and people still think it's cool to trash \"nerds.\"\n\nsad", "label": 1}
{"text": "I’m a nerd you nerd", "label": 1}
{"text": "NFL cowered to BLM terrorism hbo", "label": 1}
{"text": "Probably any 49er fan whose Hispanic... and that's probably hundreds of thousands of them.\n\nmaybe white midwestern boy like you don't give no fucks.", "label": 1}
{"text": "Patrick Surtian 2 question how do y'all get the team logo next to your name ?", "label": 1}
{"text": "Only a nerd would say this\n....and I'ma science nerd🤣", "label": 1}
{"text": "Are you Hispanic?", "label": 1}
{"text": "Thanks", "label": 1}
{"text": "….you all are getting offended over a red hat.", "label": 1}
{"text": "Could just say Redditors", "label": 1}
{"text": "You believe a bunch of unarmed 50 year old boomers broke into one of the most secure buildings in the DC? Okay bud.", "label": 1}
{"text": "I’m not a fan of the electoral college, for many reasons, but I think doing away with it would actually make the process of getting election results slower. Right now if Alabama and California (which counts mail ballots received up to seven days after Election Day in the results, as long as they’re postmarked by Election Day) take a long time to finalize their results, it doesn’t affect our knowledge of who won the election. But if the popular vote count is close, it would be irresponsible to declare who actually got the most total votes until we’ve had a chance to actually count those votes.", "label": 1}
{"text": "Same party that wears diapers to support their guys who wear makeup 😂", "label": 1}
{"text": "My guy you've commented on this post 10 times I don't think you got room to talk", "label": 1}
{"text": "….not about the actual post, correcting other Redditors. But good to know you went through my comment history.", "label": 1}
{"text": "I could understand it if they didn’t make so much money or if it was maybe someone who had humble beginnings but so many politicians come from money or influential families that I just don’t understand donating or buying mercy.", "label": 1}
{"text": "Why comment on something that no one cares about?", "label": 1}
{"text": "Should he apologize for being white? Because that's obviously what you're alluding to.", "label": 1}
{"text": "Why comment on a comment about a comment that a commentator said about a comment?\n\nHow exactly is a rainbow made? How exactly does the sun set? How is exactly does posi track rear end on a Plymouth work? \n\nIt just, does.", "label": 1}
{"text": "Thank you for posting to /r/NFL. Unfortunately, your submission has been removed due to the following rule:\n\n**[Duplicate Posts](https://www.reddit.com/r/NFL/wiki/rules_detail#wiki_duplicate_posts) AKA Reposts**\n\nThis topic has already been posted about.   Please direct discussion to that post.\n\nIf you have any questions about this removal, please [message the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Fnfl)   \n\nThis post was removed by a human moderator; this comment was left by a bot.", "label": 1}
{"text": "Do you know of cat that likes getting wet?", "label": 1}
{"text": "Let’s see how this comment weathers", "label": 1}
{"text": "If you saw the weather report, it's not gonna be a pretty game through the air. Below 50 degrees, 30 mph winds. IIRC we could expect some rain.", "label": 1}
{"text": "I explained to you my reasoning for my bias against Seahawks fans and you say I'm claiming victim? Okay\n\nI comment on a month old comment cause it got linked in this thread here, guess I didn't realize there was an expiration date on that.\n\nAnd buddy, trash talk was never the issue, trash talk is what raiders fans do, and despite them being bigger rivals I've met so many raiders fans I love. Seahawks fans however all seem to be like you, so I guess thanks for proving my bias.\n\nAnd lastly buddy, you seem to be the only one here crying. The Seahawks have gotten the better of the broncos in every sense for the past 10 years and now we talk a little shit and you have a full fledged meltdown. Haha. \n\nGood luck on your sportsballing, I'll keep looking for a Seahawks fan I can get on with.", "label": 1}
{"text": "Whatever you say, buddy.  Queue up the violins.", "label": 1}
{"text": "I dislike kamala and her voters. screw reddit", "label": 1}
{"text": "So brave.", "label": 1}
{"text": "Fucking [morons](https://amzn.to/3UyncHO) man", "label": 1}
{"text": "much ballsy, so wow.", "label": 1}
{"text": "Thanks for the laughs, and proving my every sentiment correct bud. Best luck on your season!", "label": 1}
{"text": "All of his posts are either about sports betting or “anarcho-capitalism” so safe to say he’s definitely got his head on straight!", "label": 1}
{"text": "Am I missing something? Since when is below 50 and 30 mph difficult weather?", "label": 1}
{"text": "“My feelings were hurt, but now I say it was all a laugh!”\n\nAre you ten?", "label": 1}
{"text": "Since that not the condition teams that play in closed stadiums are used to", "label": 1}
{"text": "Stop following me around weirdo\n\n“I’m not!”\n\nYou literally replied to two comments within seconds of each other while not being part of said convo. Get a life", "label": 1}
{"text": "He’s going to rather eat a salted cracker than play in Buffalo after today’s game…too far? Ok I’m new to trash talk DON’T JUDGE ME PLEZ", "label": 1}
{"text": "I love it when players talk trash of other teams, especially rivals. Adds more spice to the games.", "label": 1}
{"text": "Sorry, I’ve just been having a tough week, heh…guess it feels like a whole scalloping army to me…", "label": 1}
{"text": "Would it be hypocritical to judge you for misspelling “Get’em?” Oh well CALL ME A HYPOCRITE ALL YOU WANT I DONT CARE ANYMORE", "label": 1}
{"text": "FUCK YOU STOP DOWNVOTING YOU FLIPPING MOLLUSK", "label": 1}
{"text": "Day 6 alcohol free definitely not going to drink alcohol especially since I've been in the hospital all night apparently I have a gallstones and am going to get surgery to get my gallbladder out...", "label": 1}
{"text": "Ok…PSYCHE! Gottem 💀", "label": 1}
{"text": "I thought Arizona passed a law where they didn't have to change the time", "label": 1}
{"text": "Don't forget Chris Benoit the wrestler not Chris Benoit the monster", "label": 1}
{"text": "Who you calling degenerate, scallywagging bum? 👹", "label": 1}
{"text": "11 downvotes WHAT DO YOU HAVE TO SAY NOW", "label": 1}
{"text": "When he's at the tail end of his career and he gets traded to Bill's for a 7th it's going to be amusing dredging up these tweets", "label": 1}
{"text": "Yeah, we get it.", "label": 1}
{"text": "Yea I saw that comment up there too", "label": 1}
{"text": "Your username…those who know 💀", "label": 1}
{"text": "Like MANGO MANGO MANGO haha 😆 like the viral meme? Lol 😝", "label": 1}
{"text": "He’s so good x4", "label": 1}
{"text": "Yeah idk why I didn't think of that live right next door in New Mexico guess it's the morphine 😅", "label": 1}
{"text": "yeah, banter is good for the league. fans should def talk their shit in return but anybody taking this seriously is a dweeb", "label": 1}
{"text": "Trust me, you don’t want to 💀 ignorance is bliss my Missourian friend…", "label": 1}
{"text": "He ain’t trash talking the team though, he’s trash talking the city", "label": 1}
{"text": "Not Texas pointing fingers lol", "label": 1}
{"text": "Are pretending he's not at the tail end of his career?", "label": 1}
{"text": "Did you know Texas is a state?\n\nYou're welcome to compare Dallas or Arlington or Frisco to Buffalo if you want.", "label": 1}
{"text": "Im not a Jonnusmithologist", "label": 1}
{"text": "Okay bud, go ahead and quote the area where my \"feelings were hurt\" \n\nYou can project all you want, I shit talked you on an old post, I explained why I thought your fan base was trash when you replied, not once was it because it affected me personally but a judgement on the sportsmanship, and treatment of your past players.  You've done nothing but continue to prove true the things I say. Keep your sad little downvote of my comments while you fall apart like a trump supporter being asked about how a tariff works. \n\nYou've genuinely cemented my opinion with this. Seattle really has some of the worst fans I've ever interacted with and thus I stuck to my original statement.\n\nNever met a Seattle fan I liked. Still open to being proven wrong.", "label": 1}
{"text": "Do you really think \"I think the Bills drafted poorly in the 5th round last year\" would be as entertaining as dissing buffalo wings?", "label": 1}
{"text": "It doesn’t matter what city, all of Texas is a joke", "label": 1}
{"text": "You're mad. But I would be too if I had to live in Buffalo, so I get it.", "label": 1}
{"text": "I'm from a couple hours away, it's actually a lot better than it used to be & it's actually a pretty nice city. Like any other city it's just dependent on where you go. I've had a ton of fun in Buffalo and would pick going there over some of the other places I've been in the US.", "label": 1}
{"text": "Great comeback kid, at least I don’t live in a failing state, and cheer for a team controlled by “the best gm in the league”", "label": 1}
{"text": "You got me.", "label": 1}
{"text": "I don’t care if you like Seattle fans or not.  I have seen about a dozen Broncos fans get semi- or perma-bans for harassing me on this board, in the Broncs sub, and via DM.  No other fan base has even one.  “My personal reasons are that Hawks fans are mean to me.”  Buddy, you have no idea.\n\nSo, again, go cry, but if you want to “trash talk” but coming back to a months-old comment, don’t play the victim when I hand it back to you.\n\nGo be a victim somewhere else.", "label": 1}
{"text": "Your petty downvotes give me life. Thanks for those.\n\nAlso again, never once said the fans being mean to me affected my opinion. You literally have to create fake quotes from me to make your point seem valid.  But you very much seem incapable of comprehending the written word so I'll stop trying to spell it out for you as I clearly have before.\n\nI never said you couldn't hate broncos fans, in fact I encourage it. If you don't understand why broncos fans are salty at the hawks you must have just started being a fan. Welcome to rivalries dude, play victim to simple shit talk if you wish, I'm done conversing in circles with someone so focused on arguing in bad faith.", "label": 1}
{"text": "To be fair he is a Cowboys fan. There’s a real chance he is an asshole who has also never been to Texas.", "label": 1}
{"text": "Austin and san antonio have better food and are much more awesome cities than buffalo. Houston if you can get away from the traffic or katy as well. Houston has some excellent seafood. Dallas i personally didnt care for.\n\nI say this as someone born and raised in new york and loves talking up new york a ton. Buffalo is such a mid city and western NY is very eh when compared to the rest of the state. Rather be in the finger lakes or the mountains in north country and of course NYC and what they consider upstate.", "label": 1}
{"text": "Wow now, Austin is great and San Antonio looks cool. Don’t stoop to his level.", "label": 1}
{"text": "Nah.... this is exactly what he has always been.  A below average, not really starting capable player who is constantly hovering around 450 yards a season.  \n\nIn the year 2034 I am sure some coach, somewhere will be talking about the break out potential of an almost 40 year old Jonnu", "label": 1}
{"text": "Yall are about to put 50 pts on their defense while they can’t do shit against yall ", "label": 1}
{"text": "Xavier Mckinney was trash talking us earlier in the week saying we are too good and should score less points 😎", "label": 1}
{"text": "Bro, only you would take notice of who you're replying to. I didn't know that you made another comment that I replied to lol. Why don't you get off here and get a life since you're so offended by people replying to you", "label": 1}
{"text": "Start watching college football.", "label": 1}
{"text": "Even better.", "label": 1}
{"text": "“I replied to the same user within milliseconds but I swear I’m not stalking”\n\nOnly person that needs a life is you", "label": 1}
{"text": "And the CB for Bengals said we have a nice college offense. I loved it!!!", "label": 1}
{"text": "Damn right. Harmless petty shit is fun. See: The Titans wearing Oilers throwbacks against Houston (only to lose).", "label": 1}
{"text": "Lol you're still replying within seconds as well. Maybe we both need a life", "label": 1}
{"text": "Sedrick Van Pran-Granger is a Saint!", "label": 1}
{"text": "My wife left me because I’m studying Jonnusmithology.", "label": 1}
{"text": "a niche area, for sure, but an essential one", "label": 1}
{"text": "There’s a difference between 50 degrees, and 50 degrees with rain and wind. \n\nHow do you not understand that lmao", "label": 1}
{"text": "Yeah but you should actually be a factor if you're talking trash", "label": 1}
{"text": "OH MY GOSH HAMMER THAT FLIPPIN OVER RIGHT NOW", "label": 1}
{"text": "Fox NFL Sunday just said he pulled himself out of practice on Wednesday upon learning he wouldn’t be starting this week. If that’s true, he should just be cut or traded for a 7th.", "label": 1}
{"text": "Imagine a Belichick-coached player doing this. He probably would have been cut almost immediately. Dude got pissed at players celebrating a 40-pt blowout early and taking plays off.", "label": 1}
{"text": "So got banned from r/twoxchromosomes and some other subs for saying things, I may be banned here too but its worth it.\n\n/r/twoxsex told me \"peace was never an option\"\n\nive worked, and am currently working for a political campaign. for the record, everything im saying right now is made up and a lie, so its completely not real. im just lying.\n\nbut ive been in central africa and syria and ive seen how bacd life can get. people. PLEASE do not get violent over the election. we're hearing rumors of riots/successions/fights, people hoarding guns, i promise you that is **NOT** the way to go. America is in a hard time right now but we are still so lucky, we have such a good country compared to the rest of the world, *please* dont fuck it up because ive seen how bad it can get. 4 years of a trump or harris campaign is NOTHING campaigned to the horror i have seen. so stay chill, please, i promise, we will be ok", "label": 1}
{"text": "So you're drinking with number 4. I'm Thomas, the MRA in the blue shirt from the jubilee middle ground video. [this is me](https://www.youtube.com/watch?v=bVH_c-s9Oho&t=639s)\n\n\nwhen i was 6 i had a very weird and very vivid dream, it wasnt like any normal dream. basically i was told that in my mid 30s id become the most influential person in the world, but the price id pay is that i'd die young. id say yes.\n\nthings are happening now that seems like its coming true. \n\nim not someone who believes in woo or magic or bullshit. im athiest. but its about m theory, the higher dimensions, we are very much not alone.", "label": 1}
{"text": "I thought they had already a chip in the ball swear this was a conversation just these past few seasons", "label": 1}
{"text": "mens rights would be no more circumcision, male DV victims taken seriously, addressing the education gap, etc.\n\nbut the ultimate goal is more along the lines of aubrey de grey and ray kurzweil...women stop aging at 20, men stop aging at 27, we never get old, we never die. we learn to manipulation spacetime and create a pocket of absolutely safety in the universe.", "label": 1}
{"text": "eject him right now, I'm done with players doing this shit", "label": 1}
{"text": "Ironic", "label": 1}
{"text": "If the Bills win this game, another illegal immigrant will be getting a trans surgery in prison. Is that really a world you want to live in Bills fans?", "label": 1}
{"text": "and what annoys me is that one day, it *will* be the norm. people will look back at us, dying at 80, and think \"how horrible.\" they will see life today the same way people today see the stone age. and could do it! we're actually closer than people think. with nano, stem cell, mind uploading, we are in range to be in the bridge-to-a-bridge era", "label": 1}
{"text": "Their glorious fans will donate to the charity to fund it", "label": 1}
{"text": "lol.", "label": 1}
{"text": "This shit made me audibly laugh, thank you", "label": 1}
{"text": "Slant boy going off", "label": 1}
{"text": "And I'm sick of hearing how she's going to \"fix\" our country despite having the opportunity to do so the last four years. Don't see me bitching every commercial break.", "label": 1}
{"text": "This is a moronic take", "label": 1}
{"text": "🤡", "label": 1}
{"text": "im going to the bahamas 5th/6th", "label": 1}
{"text": "Nope, I just think it's funny that this shit happens in every game, but it's only a league wide conspiracy when it benefits KC. Enjoy your copium.", "label": 1}
{"text": "These fucking Trump commercials are pure unfiltered gas lighting", "label": 1}
{"text": "You can't have chicks reffing NFL games. I'm sorry you just can't. It's a men's sport", "label": 1}
{"text": "Great feedback sirqueefs_alot", "label": 1}
{"text": "Alright grandpa now come on it’s time for your pills", "label": 1}
{"text": "Go play with your kitty's nerd", "label": 1}
{"text": "Says the one being mad about a women ref", "label": 1}
{"text": "Affirmative action. Start a women's football league", "label": 1}
{"text": "I can’t stop laughing. You’re talking about fucking rain as if no team ever has played in it. \n\nDo you even hear yourself?\n\nIs this what happens when your team plays indoors in 15/17 games? Lol", "label": 1}
{"text": "Still pushing the covid thing. Crazy.", "label": 1}
{"text": "The largest public health crisis in a century?  Crazy people care about that", "label": 1}
{"text": "You have to realize how stupid your argument is as you’re typing this out. “Approximately 0.29 seconds” from the START of cooper stumbling and you’re still trying to blame this on the QB 😂", "label": 1}
{"text": "are you ok?", "label": 1}
{"text": "And we went all back to \"normal\" after the virus kept on mutating and the consistent need for vaccine updates.", "label": 1}
{"text": "It's a chick doing it. Clueless", "label": 1}
{"text": "Bitch ass bills sub gonna have to apologize to me now", "label": 1}
{"text": "Flair. Up.", "label": 1}
{"text": "Starting the excuses already 😉", "label": 1}
{"text": "lol, lmao.", "label": 1}
{"text": "All the toxic positive loser fans downvoting, how does it feel to be proven wrong", "label": 1}
{"text": "He’s a full time depressed Bills sub troll.", "label": 1}
{"text": "You need a job or hobby", "label": 1}
{"text": "How you feeling? Bills looking great today huh?", "label": 1}
{"text": "Bills by a billion huh 🤣", "label": 1}
{"text": "You need a job or hobby", "label": 1}
{"text": "Not football related but I can't tell if I'm going to actually get seen by a doctor today or if they are going to try and keep here til Monday fucking getting ready to check myself out at this point", "label": 1}
{"text": "Gallstones", "label": 1}
{"text": "Josh Johnson is a starter? Tylan Wallace over Bateman and Flowers? Special education steelers fans again lmfao", "label": 1}
{"text": "If you don't think heavy wind with some rain effects passing the ball, idk what to do to help you. Lmao", "label": 1}
{"text": "Yes, it was a joke lol\n\nDidn't realize i needed a sarcasm tag", "label": 1}
{"text": "Fuck jamar chase. Dude is such a bitch. Cries all year for a contract, plays like shit, can’t make plays. Fuck this dude. Fuck everything about him. Fucking bitch", "label": 1}
{"text": "Jesus fucking christ this sub is dense as shit", "label": 1}
{"text": "Gg Ravens. \n\nHopefully this lights a fire under some asses this week. \n\nOn to FUKC", "label": 1}
{"text": "That would've been good from 70 holy shit nice kick", "label": 1}
{"text": "Great to see Bryce actually smile", "label": 1}
{"text": "[This you?](https://www.reddit.com/r/nfl/s/FAbpbTSvbE)\n\nFeel free to call the suicide hotline any time", "label": 1}
{"text": "Ravens showed up. Donkeys decided to show up instead of the Broncos. \n\nPlease never play zone defense again, thanks. \n\nBo Nix will still somehow get blamed for this loss. \n\nHumphrey sucks ass.\n\nGg Baltimore.", "label": 1}
{"text": "You sound like a moron.", "label": 1}
{"text": "That game seems like punishment for Hitler", "label": 1}
{"text": "And nobody cares about you. ", "label": 1}
{"text": "He still cries to sleep knowing he got cucked by the instructor tho", "label": 1}
{"text": "As long as the receiver is open by 20 yards he is golden. ", "label": 1}
{"text": "Why didn't Kanala grab her Glock and simply stop all the crime?", "label": 1}
{"text": "Can anyone see this comment", "label": 1}
{"text": "Least brain-damaged Fins fan.", "label": 1}
{"text": "Big balls Campbell vs noodle dick lafleur", "label": 1}
{"text": "You said “since when is 50 degrees and 30mph difficult weather”\n\nYou show a complete misunderstanding of how weather impacts the game lmao", "label": 1}
{"text": "I no speak english, does Green Bay Packers also mean small peepee hoes?", "label": 1}
{"text": "No one said it DOESNT impact the game… are you really this special? \n\nI said lions fans pretending it’s DIFFICULT weather is hilarious. Almost every outdoor game in November-December is below 50 with wind lol\n\nSomething can impact a game without making it difficult. Wait until you hear that some teams don’t play indoors!\n\nYou show a complete misunderstanding of the English language.", "label": 1}
{"text": "Thank you for posting to /r/NFL. Unfortunately, your submission has been removed due to the following rule:\n\n**[Duplicate Posts](https://www.reddit.com/r/NFL/wiki/rules_detail#wiki_duplicate_posts) AKA Reposts**\n\nThis topic has already been posted about.   Please direct discussion to that post.\n\nIf you have any questions about this removal, please [message the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Fnfl)   \n\nThis post was removed by a human moderator; this comment was left by a bot.", "label": 1}
{"text": "I’m only here for u/Paulett21’s shit takes", "label": 1}
{"text": "See ya dumbass. Dirty bitch", "label": 1}
{"text": "Holy shit. Branch Ejected.", "label": 1}
{"text": "Should of hit his ass harder lol", "label": 1}
{"text": "Guess you hate Jesse Owen and prefer Nazis?", "label": 1}
{"text": "Harris ads: Trump bad, also ima cut your taxes\n\nTrump ads: Kamala bad, along with Latinos and black people, also here’s some 9/11 footage", "label": 1}
{"text": "Shout out to Trumps tax cuts that he keeps reminding us of. Raised my biweekly paycheck by $0.32. Truly changed my life", "label": 1}
{"text": "These pieces of shit are really using Russian lies in their ads now? Lmao, jfc", "label": 1}
{"text": "Which is a good thing!", "label": 1}
{"text": "\"Donald Trump is an actual rapist\".\n\n\n\"His sons are rapists too\".\n\n\nSee, you can put anything in quotes.", "label": 1}
{"text": "really dont think Trump ads should mention \"doubling down on failure\"\n\nthey wont have the affect they think", "label": 1}
{"text": "Bros just remember we only have 2 days left of political ads left hang in there", "label": 1}
{"text": "I can't wait for this spray tanned cockass to be a distant cringe memory like JNCOs", "label": 1}
{"text": "Can’t wait for Trump to lose and gone from our lives forever", "label": 1}
{"text": "That is back breaking.", "label": 1}
{"text": "Nah y'all just really white", "label": 1}
{"text": "Why on earth are they passing right now?", "label": 1}
{"text": "Great take, \"NFL\" fan", "label": 1}
{"text": "Go into the locker room?", "label": 1}
{"text": "He just threw a pick six and it’s down pouring with less than a minute. Just call it a half.", "label": 1}
{"text": "You can exchange your flair at anytime", "label": 1}
{"text": "Can tell you frankly that it doesn’t feel that way for my emotional state every February", "label": 1}
{"text": "It doesn't matter dumbass you don't swing like that at peoples heads. Read the rules.", "label": 1}
{"text": "He did have a crucial sideline catch in the Cleveland game", "label": 1}
{"text": "Yes", "label": 1}
{"text": "🤦", "label": 1}
{"text": "Love hearing about how a mass deportation of agricultural and construction workers is going to keep down the cost of food and housing", "label": 1}
{"text": "He talks like Barrack Obama.", "label": 1}
{"text": "Wait what’s happening on the packers sideline???", "label": 1}
{"text": "Deported for being too \"ethnic\"", "label": 1}
{"text": "lol get fucked", "label": 1}
{"text": "Lick my nuts. You don't know what grit is.", "label": 1}
{"text": "😂 ur such a loser", "label": 1}
{"text": "Reported for the personal attack. Violation of sub reddit rules. \n\nYour defender tried to kill a Packers player today and then stuck the finger up when given justifiable consequences. Lack of discipline there going back to the Lions Rams playoff game", "label": 1}
{"text": "Bitchmade individual", "label": 1}
{"text": "My bad for having parents who support different teams and growing up rooting for both of them", "label": 1}
{"text": "My parents root for two teams and I chose my own cuz I’m not a follower. Also I’m fucking with you, I know they aren’t the brightest in New Orleans but damn \n\nSource: New Orleans native", "label": 1}
{"text": "Most of us have stopped watching lol", "label": 1}
{"text": "Suck a dick lmao that wasn’t a fumble refs goofy as hell", "label": 1}
{"text": "(a) I’m not from New Orleans\n\n(b) I respect your choice of fandom!", "label": 1}
{"text": "I outed myself🤣 And thank you, RG3 is what led me to this choice. It’s been not fun mostly, but I’m finally having fun this season.", "label": 1}
{"text": "I said the same thing…it really didn’t even look like a big hit by Hamlin.", "label": 1}
{"text": "But did you vote? Really weird to say that your husband voted in that context lol", "label": 1}
{"text": "Delusion seems to e a typical trait of packer fans", "label": 1}
{"text": "FTP and their zebra stripe friends", "label": 1}
{"text": "Guys, what the hell is wrong with Love? He’s been a starter for long enough not to do stupid shit like that.", "label": 1}
{"text": "God awful decision-making…", "label": 1}
{"text": "It just took him a bit to get used to the flow and becoming comfortable speaking fluidly. He isn’t pausing at weird moments nearly as much and he’s actually enjoyable to listen to. \n\nI was worried for him at first but he is adapting nicely.", "label": 1}
{"text": "Fuck Donald Trump. Get the fuck off my TV already.", "label": 1}
{"text": "Yea, wasn’t bad, but definitely sounded like a new guy (which he was). Also his partner is the perfect fit for him.", "label": 1}
{"text": "TDS", "label": 1}
{"text": "And you'll always be fat", "label": 1}
{"text": "That’s fair.", "label": 1}
{"text": "You show a complete understanding of how to effectively communicate with others.", "label": 1}
{"text": "Comments: Can someone translate this?\n\nMe translating: Carr is dookie. I called Carr out on how dookie he is, they tried to tell me I was just jealous of Olave, even though we homies. The coaches always cover up for how dookie Carr. I swear on my grandma.", "label": 1}
{"text": "I live in the Twilight Zone, forced to relive walking in on my parents having sex over and over again.", "label": 1}
{"text": "I am going to kill Nick Sirianni", "label": 1}
{"text": "They may have won but Eagles weakness has been exposed. They can't do tush push anymore.", "label": 1}
{"text": "Take my dick", "label": 1}
{"text": "Hur dur dipshit 😂", "label": 1}
{"text": "\nThey’re Packer fans. They’re not very smart people.", "label": 1}
{"text": "FTP", "label": 1}
{"text": "i can feel the bitterness through the screen", "label": 1}
{"text": "Anyone else just wake up every day wishing trump died?", "label": 1}
{"text": "Whatever helps you cope 😂", "label": 1}
{"text": "will do 🫡", "label": 1}
{"text": "This is insane lol", "label": 1}
{"text": "Is it? I don’t like nazis", "label": 1}
{"text": "You’re too young to even remember the last time the Packers were relevant 😂", "label": 1}
{"text": "What? Clean hit pretty boy", "label": 1}
{"text": "And God said \"Fuck them kids\"\n\n - the Bible, somewhere", "label": 1}
{"text": "Get your asthmatic ass outta here", "label": 1}
{"text": "We won the game stfu", "label": 1}
{"text": "Stafford cold as fuck 🥶. That catch was even colder. God damn. Fuck the  Seahawks.", "label": 1}
{"text": "What’s up guys, I’m running a Watchalong on YouTube for this game, tap in if you guys want some company for the game\n\nhttps://www.youtube.com/live/6-h0ksJYaNI?si=Vh3gHz3wdqdUuIvH", "label": 1}
{"text": "What’s up guys, I like advertising and asking people to fuck my wife, tap in if you guys want some nuts in your mouth", "label": 1}
{"text": "Black?", "label": 1}
{"text": "Your first season watching football?", "label": 1}
{"text": "Vikings fans don’t worry flacco cracks under pressure he’s a cracker", "label": 1}
{"text": "No one can possibly hate the Bears more than we do. I might hate the Bears more than I hate any other team.", "label": 1}
{"text": "Mahomet would have made that FG smh", "label": 1}
{"text": "Yea that’s a foul are you stupid", "label": 1}
{"text": "How? There would be monetary punishments, suspensions, etc. The punishments would be much more severe for the player than just a flag that inconveniences the team.", "label": 1}
{"text": "your reading comprehension is about as sad as your insufferable fanbase", "label": 1}
{"text": "fuck magat garbage.\n\ngo vote", "label": 1}
{"text": "You know what's a penalty? Forcible contact to the QBs head. Bozo.", "label": 1}
{"text": "the colts' kicker is literally gay", "label": 1}
{"text": "You expect make up call for last week. You no get. You get mad. Understand?", "label": 1}
{"text": "Yeah I'm texting on a phone not writing an essay genius, referees didn't seem to think it was rtp even picked up the flag so keep crying", "label": 1}
{"text": "Yeah I'm bitching not the 10 Vikings fans still messaging me 🫣😂 hope you learn ball", "label": 1}
{"text": "Wait so why is it a missed call on the first one and not the second? On both the defender’s arm incidentally contacted Darnold’s helmet while making the tackle.", "label": 1}
{"text": "The 5-0 Vikings went into the BYE and never returned. These 0-2 Vikings can't get anything going.", "label": 1}
{"text": "Don’t try to act like they’re the moron here", "label": 1}
{"text": "Jefferson really makes any QB look good.", "label": 1}
{"text": "Alright. Good stuff.", "label": 1}
{"text": "I had this thought recently. It _feels_ like the middle of the pack QBs in the 00s and 10s were so much better than their counterparts these days. It’s like there are about 7 or 8 guys who are really good and then there’s an enormous drop off.", "label": 1}
{"text": "Frauds, like every other non-Detroit NFCN team.", "label": 1}
{"text": "I kind of thought they were going to flag that last second slam of Sam to the turf.", "label": 1}
{"text": "I have nightmares of Jonathan Taylor running all over B1G defenses.", "label": 1}
{"text": "Harrison Smith is a bad man.", "label": 1}
{"text": "I don’t know, but Saquon was the bogeyman, too.", "label": 1}
{"text": "Alright ", "label": 1}
{"text": "One of the things I hate most about pharma commercials (other than their existence) is how the colors in the ads (clothing, buildings, food, etc. ) match the drug logo’s colors. They’re usually subtle enough as not to be distracting, but I look for it now and I know they’re trying to subconsciously affect me and it pisses me off.", "label": 1}
{"text": "Trash  gonna be trash", "label": 1}
{"text": "Peacock is for sports, old NBC sitcoms, and some Universal movies. That’s it.", "label": 1}
{"text": "NFL fight songs rule.", "label": 1}
{"text": "The Pack looked like ass today. No one is giving them flowers.", "label": 1}
{"text": "Looked like Joe was busting out the latest hit dance moves.", "label": 1}
{"text": "Why is Joe taking sooooo long to do anything?", "label": 1}
{"text": "It was a joke dumbass", "label": 1}
{"text": "He stumbles because he stepped on his own lineman’s foot. Debatable whether that was secondary to the contact by the defense. That doesn’t make it the right call, but it makes it difficult to overturn the call on the field.", "label": 1}
{"text": "Jesus Christ fuck this clown. Come on NBC do better.", "label": 1}
{"text": "How is this Llama able to type so well with the refs balls so deep in their mouth?", "label": 1}
{"text": "Nobody said that lol “tank for tua” was the motto back then", "label": 1}
