{"text": "Catch the damn ball Puka", "label": 0}
{"text": "I'm not superstitious but it seems like you're trying to jinx your team", "label": 0}
{"text": "Being tied with AR 5 for something is never a good look", "label": 0}
{"text": "Honestly after a certain point (definitely brown fans having to deal with a rapist) we give it a pass, cause honestly no one deserves to suffer that much, it is a sport after all", "label": 0}
{"text": "Watching non-niners Oline and am just confused when I see other QBs having time to throw", "label": 0}
{"text": "gotta hold on to that", "label": 0}
{"text": "Ah. I know the main different thing is commercials in Canada so that is probably it.", "label": 0}
{"text": "Josh Oliver with the first b tuddy? Lol Remember that dude on the Ravens for his blocking", "label": 0}
{"text": "Gonna blame that drop on the weather, even though I have no idea how it feels in Cali rn", "label": 0}
{"text": "Goddam so many Vikes fans in attendance its basically a home game lmao 🤣 ", "label": 0}
{"text": "Oh Puka… damn", "label": 0}
{"text": "Why don't you just MARRY the Vikings if you like them so much?", "label": 0}
{"text": "Please Stafford I beg you.", "label": 0}
{"text": ">THE WEBSITE IT UH IT SOUNDS LIKE BARF STRING", "label": 0}
{"text": "Both I would say our tackles are really good but our guards are ok at best", "label": 0}
{"text": "To be slightly fair, she owned it and then he later became mayor.\n\n\nBut yeah, it's a bit of a conflict of interest now. ", "label": 0}
{"text": "He’s done that for a few years", "label": 0}
{"text": "Look up ReVanced.  No need to root or anything.  I've been using RiF this whole time.", "label": 0}
{"text": "Why not ask the bigger question...why is this new generation of owners so fucking incompetent?", "label": 0}
{"text": "Could be worse, could be a big market team and be the worst team in the league by a historic margin. *cough cough* White Sox *cough cough*", "label": 0}
{"text": "I can’t see his eyes, Kirk.", "label": 0}
{"text": "Look at how grippy those gloves are", "label": 0}
{"text": "He made up for it", "label": 0}
{"text": "They have as many WRs injured as we have RTs injured. If that tells you anything.", "label": 0}
{"text": "Cam Ward", "label": 0}
{"text": "RED ORB, TAKE WARNING", "label": 0}
{"text": "Walker Hayes, Justin Herbert, Jenny Martinez, Shaquille O'Neal, Martha Stewart, Gabrielle Union Commercials: 1", "label": 0}
{"text": "God, his hair is beautiful", "label": 0}
{"text": "Was hoping Mayfield would but idk anymore", "label": 0}
{"text": "POOPA SHITS THE BED", "label": 0}
{"text": "Orbs in this bitch", "label": 0}
{"text": "My internet is down, I'm sailing on my phone Hotspot.  Oh what a night.", "label": 0}
{"text": "Amusing to think about, but while Harry has a hell of a lot of Stafford experience, the entirety of the rest of the Vikings have never really seen him. And there's us, the fans, the long-suffering, etc.", "label": 0}
{"text": "There ya go Pukie", "label": 0}
{"text": "Ok so I should’ve played Puka if he’s gonna feed him like this", "label": 0}
{"text": "That was a clever play", "label": 0}
{"text": "Koopa Nacua.", "label": 0}
{"text": "Nacua looks like he's 34", "label": 0}
{"text": "Go Rams!", "label": 0}
{"text": "In LA, if you're not the Dodgers, the Lakers, or the Trojans, you're irrelevant.", "label": 0}
{"text": "We feel the same way about you guys tbf", "label": 0}
{"text": "how was the line only like -142 vikings when it's the rams", "label": 0}
{"text": "I like that long developing screen play, cool idea.", "label": 0}
{"text": "It was also super purple when we played there in 2018", "label": 0}
{"text": "Wow Rams defense is absolute bootycheeks. It looked like they weren't even covering JJ", "label": 0}
{"text": "The boy was sscared.", "label": 0}
{"text": "Puka got that HAIR \n\n\nBut he fcked up ", "label": 0}
{"text": "Who is this announcer with Al Michaels and what did they do with sleeping, boring Herbstreit?", "label": 0}
{"text": "The vibes when Baker started to turn them around were so good too. \n\nSpeaking of Baker, whatever happened to that guy?", "label": 0}
{"text": "Lmao 3TDs for Stafford?\n\nWhen the situation isn’t perfect…that’s the Stafford you get.\n\nGuy didn’t win shit with Megatron", "label": 0}
{"text": "Dammit Puka", "label": 0}
{"text": "Puka looks a bit like Hockenson with the long hair", "label": 0}
{"text": "Has Staffords beard always been so chin strappy", "label": 0}
{"text": "That's exactly what I'm saying... I said only 3 qbs could be in a similar situation to purdy and still win. And that's cuz mahomes is the undisputed best qb playing rn.", "label": 0}
{"text": "RAMS LFG", "label": 0}
{"text": "Puka Nacua is just fun to say", "label": 0}
{"text": "Kirk Herbstreit is that friend you had as a kid that when you invited him over to your house he spent the whole time hanging out with your parents trying to show them how well behaved and mature he was", "label": 0}
{"text": "I have Sunday ticket and I still end up watching at least two games illegally, because I live out of market for my team.", "label": 0}
{"text": "I will make an exception for the Browns. No one should have to suffer like that.", "label": 0}
{"text": "Something something you have a running back for a QB", "label": 0}
{"text": "Williams is underrated", "label": 0}
{"text": "Defense optional on TNF.", "label": 0}
{"text": "AI trying to guess who is going to blitz", "label": 0}
{"text": "I look forward to seeing Puka star alongside Patrick Mahomes in future Head and Shoulders ads", "label": 0}
{"text": "Wtf is \"Red Orb: Defensive Alert\"?", "label": 0}
{"text": "The yac is back", "label": 0}
{"text": "that player might potentially blitz but also might not", "label": 0}
{"text": "Why is it that the NFL wont allow another team like the Packers.\n\nIt is because they want the NFL to be a good ol boys club?", "label": 0}
{"text": "Are we gonna have a shoot out?", "label": 0}
{"text": "Still 75 in LA right now.", "label": 0}
{"text": "Welcome back Puka!", "label": 0}
{"text": "Even a QB like Mayfield would be acceptable at this point", "label": 0}
{"text": "Missing 2 of the best blocking WR have been as big of an impact in our run game as the pass game.", "label": 0}
{"text": "DVOA has you as the 6th ranked defense. EPA/play has you at 13 overall, with a bad run defense but the 10th best pass defense.", "label": 0}
{"text": "Is it me or is it really bright", "label": 0}
{"text": "Defense picking up right where they left off last week I see", "label": 0}
{"text": "Was Puka on vacation instead of actually being hurt?  Bro hasn’t even put in a full practice", "label": 0}
{"text": "0/10 insane puka fall off", "label": 0}
{"text": "Its gonna be a shootout 😬", "label": 0}
{"text": "I took two Pukas at work today.", "label": 0}
{"text": "You don't like dry vinegar pork???", "label": 0}
{"text": "I’ll pass. My address is actually in San Francisco. There’s no other team for me Mr Malaysian pm", "label": 0}
{"text": "If your the Trojans and you’re not winning aren’t you also irrelevant?", "label": 0}
{"text": "Fair enough", "label": 0}
{"text": "Did Detroit write the script to beat Beef Lows D? ;)", "label": 0}
{"text": "I wouldnt mind seeing a 42-40 Thursday game", "label": 0}
{"text": "8 play drive with no 3rd downs", "label": 0}
{"text": "Pretty sure that's AI pointing out mismatches", "label": 0}
{"text": "Why is that a thing?", "label": 0}
{"text": "O\n\nR E D\n\nB", "label": 0}
{"text": "The community benefits are overstated anyways, so they may as well use that downtown real estate for something that the community would actually benefit from rather than a football stadium that's empty for all but 20 or so days a year.", "label": 0}
{"text": "It's a fakeout to make you look at someone who has no effect on the play.", "label": 0}
{"text": "Hawaiian Hockenson", "label": 0}
{"text": "ESPN also shoves Stephen A Smith and Pat McAfee down everyone’s throat.", "label": 0}
{"text": "Do my ears deceive me, or does Al Michaels sound a bit more excited tonight?", "label": 0}
{"text": "It isn't my fault, I was my mulriplrle bad decisions fault.", "label": 0}
{"text": "That mustache is insane", "label": 0}
{"text": "kinda both i think. we do have a really good o line", "label": 0}
{"text": "which LA team will eventually draw in more home fans than away fans? \n\nmy guess is the Rams, but it'll take 20 more years", "label": 0}
{"text": "Stafford with weapons is going to dice up this defense", "label": 0}
{"text": "It’s the red circle that highlights a defensive player before the snap. I think they use AI or something to identify who is likely to blitz", "label": 0}
{"text": "Yeah Puka’s name is so fun to say, also lol Kupp is always motioning.", "label": 0}
{"text": "Who is that dude with the mustache lmao", "label": 0}
{"text": "Polamalu Level", "label": 0}
{"text": "The offense is going to need to be perfect if we want any chance in hell of a W", "label": 0}
{"text": "Oh yeah that's right. Stafford is still pretty good and this offense is different with its weapons", "label": 0}
{"text": "That mustache omg", "label": 0}
{"text": "Man the rams winning the SB has not helped them build a fandom at all lmao. But that’s to be expected when you move them to a whole ass other part of the country. You see the same thing with Vegas.", "label": 0}
{"text": "Yo that moustache is the best thing I’ve seen all night", "label": 0}
{"text": "DLine is young but pretty promising, LBs and DBs are uh... you know.", "label": 0}
{"text": "What a mustache", "label": 0}
{"text": "Kirk was playing really well before his injury last year", "label": 0}
{"text": "no, Hawaiian", "label": 0}
{"text": "That dude's mustache is glorious", "label": 0}
{"text": "Lol at the idea that these players type these statements themselves.", "label": 0}
{"text": "He's Samoan.", "label": 0}
{"text": "You know what puka more like Jason Momoa", "label": 0}
{"text": "Mustache", "label": 0}
{"text": "These scripted plays going crazy", "label": 0}
{"text": "They threw him to the wolves immediately after promising he wouldn't play his rookie year, and they neglected to draft OL early to protect him. That is so neglectful of the guy who is supposed to be your franchise QB. Then again only Cleveland can ruin talented QBs they draft so quickly.", "label": 0}
{"text": "That mustache lol", "label": 0}
{"text": "What a clit tickler of a mustache that was", "label": 0}
{"text": "That Stacy was immaculate", "label": 0}
{"text": "Sick mustache", "label": 0}
{"text": "That mustache tho.", "label": 0}
{"text": "Hail the orbs", "label": 0}
{"text": "#LOOK AT THAT MANS MOUSTACHE ", "label": 0}
{"text": "Sticks guy with the wicked ‘stache", "label": 0}
{"text": "Truuuuuue. So many y hoops to jump few for an \"addictive\" med that I forget to take! Hell half the time I do remember and go to get a glass of water to take it with, notice my cat doing anything, get distracted and play with him for awhile, grab breakfast, get into work and... What were we talking about again?", "label": 0}
{"text": "Everyone saw that mustache right?", "label": 0}
{"text": "Polynesian", "label": 0}
{"text": "Maybe if he goes on a bender every night, it'd be worth watching but probably not.", "label": 0}
{"text": "Movies that I just won't watch. If I see either kelce brother on TV just for talking, I change the channel ", "label": 0}
{"text": "Me too", "label": 0}
{"text": "Oh shit they got the Red Baron as a ball boy", "label": 0}
{"text": "Brian Flores is a sick man", "label": 0}
{"text": "Pacific islander, I think", "label": 0}
{"text": "Fancy mustache", "label": 0}
{"text": "rams could theoretically be good because mathew stanford \nevery team that has played detroit has lost the game after they played detroit\npeople expect vikings teams to choke because they have done it a lot in the past", "label": 0}
{"text": "final score is gonna be 84-80 with how fast these offenses are moving", "label": 0}
{"text": "Nice mustache", "label": 0}
{"text": "That chain guys mustache is awesome", "label": 0}
{"text": "Mahomes doesn’t always have the stats but that is why he’s easily best QB in the league. He always makes a play when it matters", "label": 0}
{"text": "Perfect 75 degrees", "label": 0}
{"text": "That was one hell of a mustache", "label": 0}
{"text": "Nobody has diced up this defense lmao", "label": 0}
{"text": "Mustachioed chain gang alert", "label": 0}
{"text": "Nice mustache on the dude with the yard marker duty!", "label": 0}
{"text": "Elite mustache holy shit", "label": 0}
{"text": "Mustache comment", "label": 0}
{"text": "Using a timeout this early is oof", "label": 0}
{"text": "i still can't decide whether i like these rams unis or not", "label": 0}
{"text": "More like gross ", "label": 0}
{"text": "That's not ESPN, thats just the entertainment industry in general", "label": 0}
{"text": "Who said I was a Florida *man*. ( ͡° ͜ʖ ͡°)", "label": 0}
{"text": "By the power of nut invested within me, i hereby declare rams shall emerge victorious in this skirmish against the vikings from afar.", "label": 0}
{"text": "That stache could win the superbowl", "label": 0}
{"text": "That stash", "label": 0}
{"text": "Amazon AI trying to predict a blitz", "label": 0}
{"text": "In terms of coaches being locked in on the sideline McVay gotta be up there", "label": 0}
{"text": "That mustache was crazy", "label": 0}
{"text": "Pacific island", "label": 0}
{"text": "Or maybe a pool of degenerate gamblers who lost betting on the Broncos after their first five dollar newbie parlay on DraftKings^TN", "label": 0}
{"text": "Good to get those time outs out of the way early.", "label": 0}
{"text": "mustache man knew he would get camera time", "label": 0}
{"text": "Technically the stadium is outdoors. Window roof that shields some of the heat", "label": 0}
{"text": "Samoan", "label": 0}
{"text": "There's so many Vikings fans there!", "label": 0}
{"text": "We diced you up fool", "label": 0}
{"text": "Minnesota on Minnesota crime on Johnson", "label": 0}
{"text": "DVOA is certainly one metric to use, and it tells one story.\n\nI’m using [this FOX link for actual statistics.](https://www.foxsports.com/articles/nfl/2024-nfl-defense-rankings-team-pass-and-rush-stats)", "label": 0}
{"text": "Just cracked the first of a six of Octoberfest", "label": 0}
{"text": "That is what has been sorely missing in our offensive. Not Puka, not Kupp, but early first quarter time outs.", "label": 0}
{"text": "There's no way Flores would be able to make a play call if he realized that mustache was right behind him.", "label": 0}
{"text": "Staffords wife’s bf > Stafford > Brian Flores", "label": 0}
{"text": "The bone is really good! The helmets are really good! Everything else is… not so good", "label": 0}
{"text": "Rams will probably be pretty good in like 3 years or so", "label": 0}
{"text": "The best waiver wire pickup of my lifetime, so long my sweet prince Puka. Got him last year after week 1", "label": 0}
{"text": "That guy on the chain gang behind Flores had a fucking insane mustache", "label": 0}
{"text": "I looked", "label": 0}
{"text": "I missed the mustache 😭", "label": 0}
{"text": "Kirk Herbstreit begging for this game to end so he can get ready for college gameday", "label": 0}
{"text": "That one Rams staff member is short already but standing in the middle of all the players she looked like 3ft tall lmao", "label": 0}
{"text": "Lmao I love this", "label": 0}
{"text": "Those wasted mcvay timeouts still piss me off and it’s been like 7 years", "label": 0}
{"text": "Idk how else to phrase this, but why can I see Nacuas face through his helmet more than everyone elses?", "label": 0}
{"text": "McVay goes to Applebees and orders microwaved chicken with the full menu over his mouth", "label": 0}
{"text": "Rip Van Grinkel", "label": 0}
{"text": "The Turkish mustache", "label": 0}
{"text": "Now I’m going to spend the whole game hoping we get to see that stache again", "label": 0}
{"text": "I believe a high energy white linebacker with long hair is an essential role on an NFL defense", "label": 0}
{"text": "Mustache man going viral", "label": 0}
{"text": "The city proposed like $500M or something and a 30 year lease agreement", "label": 0}
{"text": "The Vikings have 4x more sacks than the Falcons", "label": 0}
{"text": "They might just figure now is the time to do this stuff, they can't be hated that much more right", "label": 0}
{"text": "Shhhhh we’re using alternate facts here", "label": 0}
{"text": "I would too!", "label": 0}
{"text": "The Lord wants you to bare witness", "label": 0}
{"text": "No defense tonight ig", "label": 0}
{"text": "Yeah he is quite literally qb proof", "label": 0}
{"text": "Puka is back baby!!!!! Let’s go", "label": 0}
{"text": "We're still acting like \"We still\" is good grammar, eh?", "label": 0}
{"text": "All depends on the next QB. I see Stafford having 2 more years max.", "label": 0}
{"text": "both defenses need to change schemes obviously", "label": 0}
{"text": "I think they're great. I'm tired of navy blue everywhere.", "label": 0}
{"text": "When you hate for the right reasons but come on too strong.", "label": 0}
{"text": "This is ironic.", "label": 0}
{"text": "Someone link a pic of the mustache", "label": 0}
{"text": "Puka getting involved early", "label": 0}
{"text": "Nacua gets a few blocks and runs at 3mph:\n\nNACUA GETS ROOM, HE'S GOT SPACE\n\nlmao", "label": 0}
{"text": "Maybe that's his secret", "label": 0}
{"text": "A rare WR battle.", "label": 0}
{"text": "I was told that Puka would be injured", "label": 0}
{"text": "I have Nacua and JJ in Fantasy - looks like I'm goingto have a good day", "label": 0}
{"text": "Nacua is really good", "label": 0}
{"text": "Puka YACua", "label": 0}
{"text": "Independence Avenue and Truman Road if you’re brave.", "label": 0}
{"text": "We diced you up too then lmao", "label": 0}
{"text": "NFL rank - MOST. what the fuck was that Amazon?", "label": 0}
{"text": "Puka BACKua", "label": 0}
{"text": "wait why are the Rams running our offense", "label": 0}
{"text": "Limited snap count my ass", "label": 0}
{"text": "That wasn‘t NFL brotherhood though, that was deeply involved on a personal level. They paid his lawyer bills when his money ran out afaik.", "label": 0}
{"text": "Stafford has always been great against the blitz.", "label": 0}
{"text": "https://x.com/jimmyrandazzo/status/1849609382616559794?s=61&t=UBgdBmEas5hg2mDx3oBdgA", "label": 0}
{"text": "Why did they need to have fresh Puka and Cupp today 🥲", "label": 0}
{"text": "dats a facemask", "label": 0}
{"text": "Watch out for Dick Dastardly on the chain gang there", "label": 0}
{"text": "When a screen play actually works it’s one of the most beautiful things to watch", "label": 0}
{"text": "Hey do you think we’re going to cover a receiver? Or not tonight", "label": 0}
{"text": "he had like 8 blocks, nothing what he did was skill lol", "label": 0}
{"text": "Yea flags, refs getting some airtime", "label": 0}
{"text": "Nacua vs Jefferson let’s go.", "label": 0}
{"text": "This is already more entertaining than 90% of TNF games", "label": 0}
{"text": "So the counter to Flo's defense is quick passes?", "label": 0}
{"text": "Both teams look just flat out exhausted", "label": 0}
{"text": "in my opinion, the winner will have more points", "label": 0}
{"text": "puka is top 5 idc", "label": 0}
{"text": "lol bad", "label": 0}
{"text": "Just to let you know, ChatGPT isn't citing sources. Not to say it can't produce sources, but that's by coincidence. ChatGPT is predictive text that tries to provide a realistic result based on a plethora of examples. So you're as likely to get made up citations.", "label": 0}
{"text": "Crazy what getting your all pro receivers can do.", "label": 0}
{"text": "Ayyy yo, thanks homie.", "label": 0}
{"text": "Would you prefer more political ads instead?\n\nOf anyone here, I would think a fellow PA bro would welcome the soothing cup of tea that is the Kelce bros ads compared to the fucking 130249u8438932408th political ad during a break in swing state PA a week before the election", "label": 0}
{"text": "Beautiful screen.", "label": 0}
{"text": "So we’re just not gonna play Kupp?", "label": 0}
{"text": "Karen Williams is one of the most underrated backs in the league", "label": 0}
{"text": "Really glad Nacua is back, so great to watch", "label": 0}
{"text": "Al Michaels sounds so relieved to be watching decent teams for once", "label": 0}
{"text": "Because it works", "label": 0}
{"text": "That man's voice is the type to get people's attention real quick", "label": 0}
{"text": "he was a fat version of his father's necklace?", "label": 0}
{"text": "Goddamn man that dude on the chain gang's mustache was awesome", "label": 0}
{"text": "Am I crazy or does Nacua kinda look like Eddie Van Halen?", "label": 0}
{"text": "Pace Mask", "label": 0}
{"text": "It's weird that, sometimes, it doesn't seem like the ref will throw a facemask penalty until the player getting facemasked asks for it.", "label": 0}
{"text": "Great cut to force the facemask", "label": 0}
{"text": "Are these Amazon Cameras 8k or something. Everything looks so good.", "label": 0}
{"text": "Jesus I had no idea Kyren was such a baby", "label": 0}
{"text": "Damn defense looks rough.", "label": 0}
{"text": "If nobody plays defense it's a good game right", "label": 0}
{"text": "What happened to Vikings defense", "label": 0}
{"text": "Feel bad for everyone who kept Puka on the bench because he would have a “limited workload”", "label": 0}
{"text": "Dude has been good against straight up abuse. Tough mfer.", "label": 0}
{"text": "If the ball gets punched bc hes signaling for the flag with one hand, would the fumble have counted due to the facemask?", "label": 0}
{"text": "Really nice screen design for Puka.", "label": 0}
{"text": "Cristiano Ronaldo enters the chat", "label": 0}
{"text": "CALL A FUCKING HOLD", "label": 0}
{"text": "I’m interested in the receives financial assistance from the state or a political subdivision…what constitutes financial assistance?  Because playing in the tax supported stadium would not be enough because that is part one a a two part equation.  There has to be some other financial assistance aside from that.   \n\nI assume it’s tax credits.  If the Browns stop taking those benefits, how long would they have to wait?  Because it seems like the law indicates receives as in actively receiving, not previously receiving.", "label": 0}
{"text": "Battle of the horn teams", "label": 0}
{"text": "Die", "label": 0}
{"text": "Regardless of what movies and videogames show, shooting someone in the head, from a distance, is extremely difficult. But whoever did this did so with intent to kill.", "label": 0}
{"text": "Yeah hit chances took a big hit with injuries last game and 5 picks last two games", "label": 0}
{"text": "He demands to speak with your endzone!", "label": 0}
{"text": "LMFAO you ain't wrong", "label": 0}
{"text": "With the help of puka, he’s killin it", "label": 0}
{"text": "Stafford is a clear Hall of Famer", "label": 0}
{"text": "Bro what is a Nacua?  That dude looks poised to change the NFL", "label": 0}
{"text": "I think every defensive player should get a rebuild orb fuck it why not", "label": 0}
{"text": "Are you suggesting that wasn't a facemask?", "label": 0}
{"text": "I think Williams got hit in the balls on that last tackle", "label": 0}
{"text": "?????", "label": 0}
{"text": "Woah", "label": 0}
{"text": "This timeline is so bad for the Browns, they probably trade him to the Ravens.", "label": 0}
{"text": "My personal opinions aside, as an NFL fan, I really hope this game is competitive offensively. I’m pretty confident Minnesota will bring the heat, but the Rams just have so much talent and the games are so much more fun with a healthy Kupp/Nacua.\n\nLots of pressure, but I wouldn’t be surprised if this is the best the rams have looked all year", "label": 0}
{"text": "I think Blake Cashman may have been important to the defense", "label": 0}
{"text": "Horns vs Horns, loser has to upkeep the illicit ivory trade!", "label": 0}
{"text": "Honolulu Flu after getting in a physical game with the Lions. Every team has lost afterwards. We'll see if it continues", "label": 0}
{"text": "Ok, I got two screens going now. Love this time of year.\n\nWorld Series, CFB, NFL, NBA, NHL\n\nPerfection", "label": 0}
{"text": "Lions exposed this defense", "label": 0}
{"text": "That shit is wild, lmaoo.", "label": 0}
{"text": "Rams going to feed Kupp to raise his trade value", "label": 0}
{"text": "I didn’t start Puka in my fantasy team because I thought it was a bluff and he wouldn’t be that involved", "label": 0}
{"text": "Important question- does Kirk have Ben with him? I need to know so I can update my husband on Ben’s whereabouts", "label": 0}
{"text": "Strapped", "label": 0}
{"text": "The dumb part is they’re asking it to be unconstitutional and thrown out when they themselves benefited from the law to acquire a soccer team, all while being the worst owners in the NFL and currently hated by most of Cleveland, which I’m personally very happy to see.", "label": 0}
{"text": "McVay is bringing the heat with this play calling", "label": 0}
{"text": "Gotta go for it on 4th here if you don’t get it.", "label": 0}
{"text": "You gotta Kupp the ball, Cooper", "label": 0}
{"text": "This game is going to end up being 74-63 game", "label": 0}
{"text": "Starting to think keeping Nacua on my bench this week is gonna be a mistake", "label": 0}
{"text": "My boy Tutu getting lost in the shuffle :(", "label": 0}
{"text": "Missing Blake Cashman rn", "label": 0}
{"text": "I missed a glorious mustache.\n\nI can't grow one.\n\nIt'd probably have quite a few grays by now anyway", "label": 0}
{"text": "Kupp kinda sold that", "label": 0}
{"text": "Let Jimmy Halsem pull a modell. He can take that garbage team to St.Louis and call them whatever he wants and maybe third times a charm at starting the Cleveland Browns", "label": 0}
{"text": "Both offenses look sharp tonight.", "label": 0}
{"text": "I don't mind that not being PI across the league, but we've all seen way less contact flagged for PI lol", "label": 0}
{"text": "Something that needs to be said is this: you don't have to be a fan of this team or any team. It's ok to disagree and move on. It's not a blood oath. Hell people can disown their own family and kids, actual blood relatives. Legally binding marriages can be divorced. \n\nIf you're in an unhappy relationship with a team, then end the shit. It doesn't make you a better person being miserable. It's not just about bandwagon a winner either. I have no problem supporting a losing team that has an organization I respect. There's this weird almost cult mindset behind fandoms that needs to be shed. \n\nYou don't have to disown them forever, just take a separation until they get their shit together (again not just wins but as an organization, etc). Until then find another team you can respect and go from there.", "label": 0}
{"text": "Gilmore being around for 13 years is so crazy", "label": 0}
{"text": "Also sounds like a racial slur lol", "label": 0}
{"text": "We just played an insanely intense game on Sunday. This was always going to be a rough spot for us to have a Thursday night game.", "label": 0}
{"text": "That was clear PI", "label": 0}
{"text": "Seriously, he has nothing interesting or insightful to say.", "label": 0}
{"text": "just dump it off 3 times in a row with downfield blockers\n\nworks every time", "label": 0}
{"text": "Because if you’re going on pure yardage it would be an automatic TD, which doesn’t seem fair IMO", "label": 0}
{"text": "Feel your pain", "label": 0}
{"text": "We got a game boys!!", "label": 0}
{"text": "I’m here for the shootout", "label": 0}
{"text": "Nasty", "label": 0}
{"text": "The streak continues!", "label": 0}
{"text": "Blatant hold", "label": 0}
{"text": "An interesting game, it’s tied", "label": 0}
{"text": "That was clean", "label": 0}
{"text": "I started him. At 2 and 5, I have nothing to lose in my league at this point so I figured it wouldn’t hurt.", "label": 0}
{"text": "LETS GO", "label": 0}
{"text": "Oh this might be a shootout.", "label": 0}
{"text": "We got a game of \"no defense\".", "label": 0}
{"text": "First team to get a stop wins", "label": 0}
{"text": "Ivan Pace Jr what the fuck was that coverage?", "label": 0}
{"text": "Handjob is my job; blowjob is your job. ", "label": 0}
{"text": "Ah so it's gonna be one of those games where both teams refuse to play defense. Hope y'all are ready for a 54-51 finish. Honestly I wouldn't complain compared to what we usually get on Thursday night games", "label": 0}
{"text": "Start of the Vikings season crumbling", "label": 0}
{"text": "Alright. This could end up being a good game.", "label": 0}
{"text": "Good fucking job king", "label": 0}
{"text": "Has Brian Flores been exposed? Streets are talking", "label": 0}
{"text": "Ball don't lie.", "label": 0}
{"text": "Ball don’t lie", "label": 0}
{"text": "Gilmore got away with PI there", "label": 0}
{"text": "Don’t like that defense", "label": 0}
{"text": "His scripted plays are always especially on point", "label": 0}
{"text": "This game pleases the Lion", "label": 0}
{"text": "As someone who likes defense I remain flaccid :/", "label": 0}
{"text": "Okay, maybe the Vikings defense is just cooked.", "label": 0}
{"text": "#WHOSE HOUSE?", "label": 0}
{"text": "Stafford looking pretty comfortable so far", "label": 0}
{"text": "Hmm, I prefer it when we score touchdowns, it isn't as fun when they score touchdowns.", "label": 0}
{"text": "Lfg! Beat that Viking ass!", "label": 0}
{"text": "Not a fan of either team, so let's go Scoring!!!", "label": 0}
{"text": "Vikings d looks cooked! Lions exposed them!", "label": 0}
{"text": "Send him to us for a 4th round pick", "label": 0}
{"text": "I've always hated them, welcome to the right side of history", "label": 0}
{"text": "Blake Corum truthers are sad", "label": 0}
{"text": "Holy fuck, get some pressure. This oline is absolute ass.", "label": 0}
{"text": "Looks like neither defense decided to show up for the first drives.", "label": 0}
{"text": "ruh-roh", "label": 0}
{"text": "Good Thursday night game? 👀", "label": 0}
{"text": "This is gonna be a fun one", "label": 0}
{"text": "Kyren with the possession catch", "label": 0}
{"text": "U wot m8?", "label": 0}
{"text": "Gonna be a shootout", "label": 0}
{"text": "A penalty cant advance the ball into the endzone. So any defensive penalty that would result in that become half distance to the goal", "label": 0}
{"text": "This is by far the best we've looked on offense all year.", "label": 0}
{"text": "Excellent response", "label": 0}
{"text": "Kyren, I love you!", "label": 0}
{"text": "Finally a good fucking TNF game", "label": 0}
{"text": "Vikings can potentially go from first place to 3rd place in just 1 week \n\nWhat a time", "label": 0}
{"text": "Kyren just KEEPS SCORING", "label": 0}
{"text": "TD that should've went to Jefferson gone to a TE, and now a TD that should've gone to Puka went to Williams. I hope both of them get their Tuds sometime this game!", "label": 0}
{"text": "Don't watch Rams games lol", "label": 0}
{"text": "It was this good. We just didn’t have any defense during those times", "label": 0}
{"text": "The key to beating this defense was a screen pass All along", "label": 0}
{"text": "both teams playing vanilla zone D just to avoid injuries on the short week\n\nit's basically just a walk through kind of game", "label": 0}
{"text": "Might have ourselves a game boys", "label": 0}
{"text": "Good job ramily", "label": 0}
{"text": "\"I just happen to be watching Kyren Williams live\"\n\nYup that's generally what you do when you're broadcasting a live game Kirk", "label": 0}
{"text": "Wait wait wait. You can score in the first quarter??? Someone get Sirianni on the horn", "label": 0}
{"text": "All those stats and nothing to show for it", "label": 0}
{"text": "Guys why did I think Sam Darnold was like mid 30’s not 27", "label": 0}
{"text": "I am displeased that Vikings are getting the real rams after everyone else got the broken ass rams", "label": 0}
{"text": "I'll eat my words. Expected Vikings defense to play better, but McVay is cooking", "label": 0}
{"text": "Lions curse is back on the menu boys", "label": 0}
{"text": "Middle LB wearing the number 0? Cmon man", "label": 0}
{"text": "No defense will be played tonight", "label": 0}
{"text": "Man we really miss Cashman. Pace is much better as a run stopper & blitzer", "label": 0}
{"text": "they just liike us, they just like us", "label": 0}
{"text": "3 interceptions and 3 sacks on Rodgers 3 weeks ago 🙆‍♂️", "label": 0}
{"text": "With everything favoring the offense, I'm fine with this favoring the defense.\n\nAs for the logic...what else are you gonna do?", "label": 0}
{"text": "What’s with both of there defenses? \n\nBoth are feeling like a shadow of there former selves.", "label": 0}
{"text": "They not like us", "label": 0}
{"text": "Beef Low looking like skirt steak", "label": 0}
{"text": "Dadfford is right there", "label": 0}
{"text": "Drake punching the air rn", "label": 0}
{"text": "Vikings defense looked the best I have probably seen in my lifetime the first 5 games. I am not sure what happened.", "label": 0}
{"text": "Song is way overplayed", "label": 0}
{"text": "num num num I love hate watching", "label": 0}
{"text": "Vikings defense getting that Honolulu Flu", "label": 0}
{"text": "Kyren deciding to shake it up with a receiving touchdown today", "label": 0}
{"text": "Foolish to count out the Staff-infection so early", "label": 0}
{"text": "Fck him ", "label": 0}
{"text": "Rama upset inbound", "label": 0}
{"text": "🙄Vikings bruh", "label": 0}
{"text": "Healthier weapons does some crazy shit man", "label": 0}
{"text": "I would be ecstatic to get a 4th round pick for him. He is getting washed out by TEs lol", "label": 0}
{"text": "Kyren is just so lethal at the goal line. So fun to watcg", "label": 0}
{"text": "What a drive ", "label": 0}
{"text": "Kendrick dominated 2024", "label": 0}
{"text": "This feels like a game where the opening drives are promising and then the game just turns into a punt fest.", "label": 0}
{"text": "They are not like us indeed", "label": 0}
{"text": "Defense we don't need no stinking defense", "label": 0}
{"text": "*They not like us* is what this game is telling the other TNF games", "label": 0}
{"text": "I'll do you one better. Why is Nacua?", "label": 0}
{"text": "Another Falcons/Bucs game?", "label": 0}
{"text": "Man me too. Two sick kids, I'm setting personal records for how exhausted I can be daily.", "label": 0}
{"text": "Ummm guys???? Is it possible we are getting a good Thursday night game???", "label": 0}
{"text": "Playing Not like Us is an interesting choice lol", "label": 0}
{"text": "Nice answer by the Rams", "label": 0}
{"text": "They signed a habitual sex pest for 280+ million guaranteed", "label": 0}
{"text": "LeDancer", "label": 0}
{"text": "THEY NOT LIKE US THEY NOT LIKE US THEY NOT LIKE US", "label": 0}
{"text": "I don't mean to alarm anyone but we may never see a punt again", "label": 0}
{"text": "Thursday games are not too bad lately.", "label": 0}
{"text": "This is not the week 4 rams", "label": 0}
{"text": "no they not like us", "label": 0}
{"text": "Either the Lions have put out the blueprint to beat Flores or we are REALLY missing Cashman. Maybe both 😔", "label": 0}
{"text": "I feel a good game coming", "label": 0}
{"text": "If people haven't watched the last 5 games they wouldn't understand just how much better our offense looked on that drive than it has looked since game 1.", "label": 0}
{"text": "MUSTARD ON THE BEAT HO", "label": 0}
{"text": "I don't have anything against Jason its just the Kelce's are over exposed so I'm not interested", "label": 0}
{"text": "The LA logo is just so fucking ugly", "label": 0}
{"text": "Do they still blackout teams in the subscriber's state?  That never made sense to me.  Texas is a big state, so you can be hundreds of miles from your favorite team but unable to stream them.", "label": 0}
{"text": "\\#0 was fucked no matter which way Williams went, his only chance was to meet him in the crease", "label": 0}
{"text": "He went to the Rams two days before a game and played better then Watson has in over two years in Cleveland", "label": 0}
{"text": "That looked like a Madden glitch - Ivan Pace moved like a bot", "label": 0}
{"text": "Maybe this whole debacle came about after the owners watched Major League.", "label": 0}
{"text": "Shootout time!", "label": 0}
{"text": "Kevin Hart, Walker Hayes, Justin Herbert, LeBron James, Jenny Martinez, Shaquille O'Neal, Martha Stewart, Gabrielle Union Commercials: 1", "label": 0}
{"text": "Gambling", "label": 0}
{"text": "Drake catching strays on TNF lmao", "label": 0}
{"text": "I hate these number changes for any position? Why the fuck is someone wearing number 0 as a lb?", "label": 0}
{"text": "Probably, but he had some good throws that drive. It does help for sure when you can trust your receiver to pull in the ball wherever you throw it I’m sure", "label": 0}
{"text": "Eh, fair", "label": 0}
{"text": "He's not appealing because of where it falls in the schedule and so it doesn't drag out the process.", "label": 0}
{"text": "Sounds like the Fed X guy is a Packers fan and switched the samples.\n\nThey have Ryan Braun investigating right now.", "label": 0}
{"text": "Who needs defense.", "label": 0}
{"text": "Kendrick really handed out a generational ass beating", "label": 0}
{"text": "Nice pace to this game", "label": 0}
{"text": "But then they couldn't glaze him for being a false god.", "label": 0}
{"text": "Why he say fuck me for?\n\n-every Vikings fan in this thread.", "label": 0}
{"text": "If this is another Darnold Mahomes shootout game like back in the day, I’d be happy.", "label": 0}
{"text": "He’s black", "label": 0}
{"text": "basically us lions were cursed for 60 years and then we found out about the board game Uno and the reverse card", "label": 0}
{"text": "Looks like Puka and Tyler Johnson are splitting 50/50", "label": 0}
{"text": "They not like us on drake's birthday is crazy", "label": 0}
{"text": "I can’t wait for gambling ads to be illegal so I have to make an effort to see Kevin Hart in anything.", "label": 0}
{"text": "Kyren Williams is guaranteed a touchdown every game", "label": 0}
{"text": "We gonna have a good game cooking", "label": 0}
{"text": "Both defenses look tired af haha", "label": 0}
{"text": "Can't wait to hear Not Like Us at the Superbowl", "label": 0}
{"text": "RAMS TO THE SUPERBOWL!!!!", "label": 0}
{"text": "Lol", "label": 0}
{"text": "Hottest take \n\nJason kelce and the Mannings are entertaining and fine. People just like to be annoyed.", "label": 0}
{"text": "Vikings played the Lions last week, they aren't allowed to win.", "label": 0}
{"text": "NFCW: \"Fuck you, we don't know why either\"", "label": 0}
{"text": "Just our luck to be the first team to get the healthy Rams all fucking season", "label": 0}
{"text": "Refs letting them play. A hold on the Rams they didn’t call, PI on the Vikings they didn’t call. Shootout incoming!", "label": 0}
{"text": "Idk dude, beat you.", "label": 0}
{"text": "Copy and paste what he said. You won’t, because that’s not what he said.", "label": 0}
{"text": "What da fuck happened to the Minnesota defense?!", "label": 0}
{"text": "Battle of the horned teams,", "label": 0}
{"text": "Shhh. Don’t jinx it.", "label": 0}
{"text": "Looks like some type of tie game ", "label": 0}
{"text": "Back to back scoring drives to start the game? This isn't the Thursday Night Football I love!", "label": 0}
{"text": "While true, one would think that the flag would be in the air as soon as Williams was chirping for it.  It looked that obvious.\n\nBut this isn't just in this instance.  I get the feeling that, a lot of the time, the flag isn't thrown unless a player throws a mini-fit (which, in this case, was totally justified).", "label": 0}
{"text": "Kupp would've had that catch if Gilmore wasn't grabbing his shoulder", "label": 0}
{"text": "Ugh love Pace but he makes a lot of overaggression mistakes - 2 on that drive alone- and that would've been Cashman there instead if he was healthy", "label": 0}
{"text": ":(", "label": 0}
{"text": "This man Thursday Night Footballs", "label": 0}
{"text": "Welcome to the club", "label": 0}
{"text": "Must be nice scoring on your first drive… or even in the first quarter. Wish my team could do that.", "label": 0}
{"text": "Cupp and Nakua open up so much for this offense. They could jump into top 5 by the end of the season if they stay healthy.", "label": 0}
{"text": "Kyren is a TD machine", "label": 0}
{"text": "i wanna say that man coverage was how belichick beat shanahans offense in atlanta when they played in the superbowl, cant say for sure though", "label": 0}
{"text": "The only thing DraftKings hiring Kevin Hart as their spokesman is sure that I will continue never having used their service", "label": 0}
{"text": "Even went with Times New Roman. Max professionalism.", "label": 0}
{"text": "Can’t wait for Drake to be called a pedophile at the super bowl", "label": 0}
{"text": "We are so back 😭", "label": 0}
{"text": "The uniforms are crisp?", "label": 0}
{"text": "That’s his ninth in sixth and a fourth of a game. Realistically has no shot at Faulk (26 fucking tds) but he’s a scoring monster", "label": 0}
{"text": "I think he'll be staying", "label": 0}
{"text": "No idea, something Amazon introduced this season. They say it’s to help viewers to spot who is trying to blitz. Anyone who actually watches football doesn’t really need it though.", "label": 0}
{"text": "Geico needs to retire the cavemen dude", "label": 0}
{"text": "LFG", "label": 0}
{"text": "He's a great blitzer and run stopper. Horrible in coverage.", "label": 0}
{"text": "With Kendrick playing in the SB halftime, the Rams in the SB confirmed!", "label": 0}
{"text": "Packers, Lions and Bears fans bandwagoning the Rams hard tonight.", "label": 0}
{"text": "I mean we beat that defense the last 3 out of 4 times", "label": 0}
{"text": "You either broke them, or it's a ruse\nOr both. Hard to say.", "label": 0}
{"text": "i'm gonna do that Chili's $10.99 deal soon\n\nlooks like a great value and i need to know how full it'll make me", "label": 0}
{"text": "Huh...never thought of it that way.", "label": 0}
{"text": "kyren", "label": 0}
{"text": "Praying for a high scoring game. I remember the matchup between these teams in 2018, it was a classic for the ages", "label": 0}
{"text": "I guess I just don’t understand what “broken” means. If the bone is in 2 pieces the leg won’t work will it?", "label": 0}
{"text": "Anyone else's amazon stream suck ass?", "label": 0}
{"text": "2018 Vikings vs Rams incoming", "label": 0}
{"text": "This is our first time lol", "label": 0}
{"text": "I hate these caveman ads with a passion", "label": 0}
{"text": "As season progresses, people figure out schemes. Flores needs to adjust", "label": 0}
{"text": "Glad we faced them in week 4...", "label": 0}
{"text": "You say that like GB isn't a solid team.", "label": 0}
{"text": "gotta be the vikes", "label": 0}
{"text": "He's on a snap count.", "label": 0}
{"text": "You’re not allowed to say this.", "label": 0}
{"text": "Puka might be balls deep in the manosphere but he's good at football!", "label": 0}
{"text": "And then he fell off the face of the earth, right? Right????", "label": 0}
{"text": "Guy is tired of being hurt I respect him recognizing a QB he can trust with his health ", "label": 0}
{"text": "Again?", "label": 0}
{"text": "lol Kenny", "label": 0}
{"text": "Cashman got turf toe", "label": 0}
{"text": "HOLY SHIT A WORKING SMOKER. FUCK YOUR LITTLE CONCEPTUAL, YOU CAN FUCKING WORK WITH LIME IT'S NOT HARD FUCKFACE. MAYBE YOU SHOULD REMEMBER YOUR FUCKING BURNT ZITI YOU FUCKING WHITWORTHLESS PIECE OF SHIT. AT LEAST THE CAVEMAN MADE YOU IN CAKE VERSION AND HE LOOKS BETTER THAN YOUR CAKE GECKO.", "label": 0}
{"text": "Underrated ngl", "label": 0}
{"text": "I heard Venom 3 was awful.", "label": 0}
{"text": "So a standard rams away game like usual", "label": 0}
{"text": "Kyren Williams getting me points for fantasy. Good start after losing last week because of garbage time baker mayfield", "label": 0}
{"text": "i got hyped when i heard it just now, figured they played it bc they're in LA", "label": 0}
{"text": "Team just looks way more fluid", "label": 0}
{"text": "Venom horse.", "label": 0}
{"text": "Imagine how much the Venom movies would’ve been if they were R rated", "label": 0}
{"text": "Kendrick is dangerously close to going too mainstream. Going over that edge due to Drake beef would be ironic as fuck", "label": 0}
{"text": "It’s supposed to be our time man, everyone else in the division needs to fuck off lol", "label": 0}
{"text": "You can do this Rams. Beating the Vikings isn't that hard, tell em Packers", "label": 0}
{"text": "> Los Angeles Rams TD Drive: 9 plays, 70 yards, 4:05\n\nThe first two drives in this game took 4:17 and 4:05, both went 70 yards and resulted in TDs. Shootout time", "label": 0}
{"text": "They’re still making venom movies?", "label": 0}
{"text": "Oh I must have missed that", "label": 0}
{"text": "Mine is great.", "label": 0}
{"text": "You can tell Stafford has a lot of practice having an O-Line not be able to protect him for more than a second or two", "label": 0}
{"text": "The Browns will fail to challenge the law, then flee to London in the dead of night. They will be rechristened as London GFC next season, though a creative legal fiction which transfers all of the assets of the Cleveland Browns to the new, legally distinct franchise.", "label": 0}
{"text": "Getting the healthy rams on Thursday after huge division game vs a Dan Campbell team isn’t ideal", "label": 0}
{"text": "Petition to give a raise to whoever at Amazon decided to use \"Not Like Us\" right there", "label": 0}
{"text": "We need Jason and Travis sending us a text every hour from a different number talking about how critical this election is and how important our vote will be.", "label": 0}
{"text": "Someone gotta start losing, I would like a cushion in the division", "label": 0}
{"text": "What happened to the defense I loved. Getting baked like a frozen pizza at boy’s weekend.", "label": 0}
{"text": "Mines been fine so far. Tried restarting your WiFi?", "label": 0}
{"text": "Bold accusation against GEQBUS", "label": 0}
{"text": "LFG rams", "label": 0}
{"text": "Do they have some special German HGH over there or something?", "label": 0}
{"text": "On Twitch, how do I stop these stupid predictions from popping up?", "label": 0}
{"text": "Ivan Pace is a monster getting into the backfield but he simply cannot be asked to cover RBs and TEs like this", "label": 0}
{"text": "As a partial observer I hope this is one of those games the Vikings lose", "label": 0}
{"text": "Im so fucking high rn. Go ravens", "label": 0}
{"text": "In my head canon, the Giants are horned, too. Because so many skyscrapers have antennae", "label": 0}
{"text": "wtf venom is a trilogy??", "label": 0}
{"text": "If the rams are back, the 49ers are screwed.", "label": 0}
{"text": "Damn that Venom movie is gonna be ass", "label": 0}
{"text": "falsely doing a lot of heavy lifting there", "label": 0}
{"text": "All the same people in all the commercials, I definitely appreciate why games are watched on mute", "label": 0}
{"text": "I think the caveman needs another sitcom.", "label": 0}
{"text": "KOC vs. McVay. Defenses don’t stand a chance in this one. ", "label": 0}
{"text": "oh no, ew", "label": 0}
{"text": "According to wikipedia samoan, Hawaiian, and Portuguese. ", "label": 0}
{"text": "Did Al say so fi opened in 2000", "label": 0}
{"text": "yeah, no one's trying to do anything crazy. like just stay in your lane and don't get hurt", "label": 0}
{"text": "Should probably save some TDs for the other TNF games this season. Rams and Vikings are going to use them all up!", "label": 0}
{"text": "Turner is averaging a pressure every 40 snaps", "label": 0}
{"text": "want a birthday gift and it's prolly a minorrrrrrr", "label": 0}
{"text": "This is a great game!\n\nLet’s go Stafford", "label": 0}
{"text": "It's been a while since I've seen both teams with clean TD drives.", "label": 0}
{"text": "To all the people freaking out about the vikings D...relax. it's a long season. Some games are weird and randomly high scoring. Their D is still good", "label": 0}
{"text": "Potentially a 2nd good Thursday night game this season? That’s 2 more than many expected lmao", "label": 0}
{"text": "He's just not that interesting", "label": 0}
{"text": "Yeah was mentioned they'd be assessing him before the game and likely playing him on a limited snap count.", "label": 0}
{"text": "But the shitty tv commercial that played during my football game said it was radical so it must be true!", "label": 0}
{"text": "This is actually good for the Vikings’ 2024 season. If the DL appears incapable of beating a bunch of corpses on the Rams OL, then they have to trade for Sexy Dexy. \n\nUniverse-brain, 4D chess, giga-chad move by Flores to force the GM’s hand", "label": 0}
{"text": "Rams chiefs incoming", "label": 0}
{"text": "The fuck is your username", "label": 0}
{"text": "Chili's For Me: 3\n\nTouchdowns: 2", "label": 0}
{"text": "P Drizzy fan spotted", "label": 0}
{"text": "Oh? We gonna leave defense at home and have a shoot out tonight? I'm game", "label": 0}
{"text": "Dude fr in both the games he’s played against us this year we were applying awesome pressure, but he’d just let the ball fly in 0.2 s (and hit his targets)", "label": 0}
{"text": "Weirdly enough he’s making interesting choices. For instance, he has a role in Ryan Murphy’s Grotesquerie.", "label": 0}
{"text": "All Raiders fans in Nevada get a One (1) Free Hooker Session coupon upon purchase of merchandise", "label": 0}
{"text": "… may I see it?", "label": 0}
{"text": "That Honolulu flu is rough from what I hear", "label": 0}
{"text": "I have a confession I need to confess,  I low-key like watching the Rams.  I have for awhile, I like the team, the stadium, the pace of play, the coach, the unis...im sorry Midwest", "label": 0}
{"text": "Unfortunately for us all", "label": 0}
{"text": "I’m just glad there’s another Marvel trailer for some variety", "label": 0}
{"text": "49ers are kinda screwed anyway", "label": 0}
{"text": "You see the Lamar news…", "label": 0}
{"text": "How are Vikings fans feeling regarding whether or not you sign Darnold long term vs starting the rookie next year?", "label": 0}
{"text": "Same play he ran against the 49ers where he juked Fred Warner!", "label": 0}
{"text": "Fraudulence", "label": 0}
{"text": "Darnold pick 6 right here...I have him in fantasy too lol", "label": 0}
{"text": "Were any of them not?", "label": 0}
{"text": "Reminder that teams are 0-4 so far after playing the Lions the week before. Would have been 0-5 but the cowboys were on a bye 😔😔", "label": 0}
{"text": "I almost bet on it then looked at the odds haha it's like betting on Jefferson yards", "label": 0}
{"text": "And Fields was *never* doing the things Tice highlighted in this article: manipulating the D with his eyes, calling protections, progressing on reads regularly. The main thing Fields had done was rip off throws to primary read WR and scramble for first downs. He was never keeping his eyes up to be pass first on a scramble.", "label": 0}
{"text": "You just wait", "label": 0}
{"text": "So much WINNING in MEGASODA \n\nARE YOU TIRED YET FOLKS???", "label": 0}
{"text": "What does “the opportunity to purchase the team” mean is what they’re challenging", "label": 0}
{"text": "twitch is much better for me than prime", "label": 0}
{"text": "LA team is playing??? **SMASHES \"NOT LIKE US\" BUTTON**", "label": 0}
{"text": "Sounds so good right now", "label": 0}
{"text": "matte helmets are the best", "label": 0}
{"text": "I swear this team is obsessed with making sure Kyren scores at least once every week.", "label": 0}
{"text": "It’s too modern, it looks more like it belongs to a corporation than a football team", "label": 0}
{"text": "Na I've hated them since about 2007. That's 10 years of watching football for me. \n\nI see them piss away top 3 picks year in and year out. I've said for a long time that the browns are thr worst franchise in the league and they should be relocated because they'll never be good. Sorry to the browns fans, it's not your fault but that team just flat out sucks.", "label": 0}
{"text": "Boo this man!", "label": 0}
{"text": "I’m sorry you’re offended by court facts. Weird that you root for the rape to have occurred.", "label": 0}
{"text": "Well we’re not", "label": 0}
{"text": "Just throwing it out there that the Lions are current accepting all ship-jumpers, especially Browns. We’ve both suffered so long, please share in our happiness!", "label": 0}
{"text": "Liberty is taking the Kennesaw state loss hard", "label": 0}
{"text": "It must be because Campbell lacks class.  A New Yorker told us.", "label": 0}
{"text": "This secondary man...", "label": 0}
{"text": "Yeah :/", "label": 0}
{"text": "As long as we win let’s do it 😆", "label": 0}
{"text": "Hey, that's not Jefferson!", "label": 0}
{"text": "Don’t sign Darnold unless we get to the Super Bowl. Stick with the plan.", "label": 0}
{"text": "Haslam and Tepper are really trying to speedrun that \"worst modern NFL owner\" trophy, aren't they?\n\nConsidering you've got three active owners who've fucked their fans over by relocating, that's a good trick.", "label": 0}
{"text": "I have no room in my life for Al Michaels haters", "label": 0}
{"text": "It’s incredibly hard", "label": 0}
{"text": "It’s entirely based on getting pressure and we are getting zero pressure", "label": 0}
{"text": "Punching the ball out on the sideline is wild", "label": 0}
{"text": "CBs too. NFL taking everything away from defenses smh", "label": 0}
{"text": "lol the punch out", "label": 0}
{"text": "Haven’t they told this story before? Lol", "label": 0}
{"text": "Pitt erasure", "label": 0}
{"text": "Bro what was that dude on the sideline’s problem lmao", "label": 0}
{"text": "Number 4 petty af", "label": 0}
{"text": "Delay game rams #4", "label": 0}
{"text": "For the 2nd part of the law, how’s the price established? Is the previous owner “forced” to sell at a certain place? Also conversely if not, then what’s stopping the owner from setting a super high price and saying “aaaah, I tried to sell nobody wanted to buy, <insert city here> it is, I guess 😢”", "label": 0}
{"text": "#4 on the rams mad ", "label": 0}
{"text": "Seeing a clean pocket by an OL makes me jealous.", "label": 0}
{"text": "#4 on the rams is a certified douche nugget", "label": 0}
{"text": "That peanut punch on the sideline is making the blop 10", "label": 0}
{"text": "lmao at #4 on the sidelines", "label": 0}
{"text": "You best the Cowboys bad enough that it should count as 2.", "label": 0}
{"text": "Same.", "label": 0}
{"text": "Both these teams scare me, but I like the Rams roster ngl", "label": 0}
{"text": "that was a cool play call", "label": 0}
{"text": "finally!!", "label": 0}
{"text": "A habitual sex pest for hundreds of millions *who isn't even any good*", "label": 0}
{"text": "Bitchmade lmao", "label": 0}
{"text": "Why did bro punch it out lol", "label": 0}
{"text": "What's with the red video game highlighter on irrelevant players?", "label": 0}
{"text": "Tug on your balls boys, this may be a good game tonight", "label": 0}
{"text": "Dude on the sideline just punched the ball out? Lmao", "label": 0}
{"text": "I appreciate the D’s taking the night off so we get a fun TNF.", "label": 0}
{"text": "Did a guy on the sideline just punch it out??? lmao??", "label": 0}
{"text": "Defense optional game.", "label": 0}
{"text": "That should be 15 on the dipstick that swatted at the ball from the sideline after the play", "label": 0}
{"text": "#4 thinks he’s on the team", "label": 0}
{"text": "Al Michaels calling Addison a beta", "label": 0}
{"text": "Hot take: unsportsmanlike penalty for punching the ball out when you’re on the sideline and not playing", "label": 0}
{"text": "#4 on the Rams is such a clown for that on the sideline hope he gets fined", "label": 0}
{"text": "BETA MALE!", "label": 0}
{"text": "BETA", "label": 0}
{"text": "Jordan Addison, our beta boy", "label": 0}
{"text": "When KOC goes heavy to run it doesn’t seem to ever be great. With these WRs idk why you would unless you love the match ups", "label": 0}
{"text": "Beta Addison", "label": 0}
{"text": "Al calling Addison a beta lmao", "label": 0}
{"text": "Every Jones run alleviates the pain of watching Mattison as our RB1 last year", "label": 0}
{"text": "Tough guy #4", "label": 0}
{"text": "Doing that now. Everything else has been streaming fine so far tonight but amazon was slow motion, unsynched audio, artifacting, etc.", "label": 0}
{"text": "I'm sure Addison would love to be known as the beta", "label": 0}
{"text": "Is that meant to be something worth staying over?", "label": 0}
{"text": "Lil bro on the sideline needs to calm down", "label": 0}
{"text": "Well I’m sure calling Addison a Beta will not cause any drama at all for the Vikings", "label": 0}
{"text": "AI predicting pressure", "label": 0}
{"text": "Soooo… what are they getting for McCarthy?", "label": 0}
{"text": "This", "label": 0}
{"text": "Sofi opened in 2000 and Quentin lake is named karnell lake\n\nHow much did they spend on this booth again?", "label": 0}
{"text": "Our fans are coping so hard rn, its gonna be the same thing like with Cine where he is a huge bust for like a year or two before people admit it.", "label": 0}
{"text": "Jefferson is going OFF", "label": 0}
{"text": "The Rams should just stop Jefferson from catching the ball", "label": 0}
{"text": "Addison hearing being called a beta: “the fuck gonna go drink and drive”", "label": 0}
{"text": "Our defense is little better than a traffic cone against the Vikings.", "label": 0}
{"text": "Total score is gonna be wild", "label": 0}
{"text": "/r/nfl is a place where people from all walks of life can get together to talk about a sport we love, so please keep your posts related directly to the National Football League.\n\nIf it's related to the NFL, but not about the NFL (such as streams, fan-related posts, business promotions, betting-related posts, video games, Fantasy Football, College Football, or NFL-related jokes), please check if there is a more appropriate subreddit listed in the sidebar of /r/NFL.\n\nPeople who are related to the NFL have lives outside of their organization as well, and in the majority of instances these are best discussed in the subreddit associated with their particular team.\n\nThe following are topics which are commonly removed for not being directly NFL related:\n\n* Requests for streams or sites to watch games or replays\n* Fantasy Football Posts - try /r/fantasyfootball \n* Video Game Posts - Be it Madden or any other video game franchise, use a gaming centric sub like /r/Madden or /r/gaming \n* Betting-Related Posts\n* Stories/tweets about fans\n* Business promotions \n* Other Football Leagues - these will often have their own subreddit, please search on Reddit to find the appropriate home for this discussion - /r/XFL, /r/USFL, /r/CFB, /r/AAFB\n* Merchandise or fandom-related discussion (fan jerseys, decorations, custom art, footballs, signatures, questions about stadium seating/tickets) - when a post is about an item you or someone you know owns, please use the [Free Talk Threads](https://www.reddit.com/r/nfl/search/?q=flair%3A%22Free+Talk%22&sort=new&restrict_sr=on&t=all)\n* Crypto currencies of any sort unless it is news about currencies officially licensed by the NFL or a team - player endorsements do not meet this threshold\n* [Pop Culture Posts](https://www.reddit.com/r/NFL/wiki/rules_detail#wiki_pop_culture_posts)\n* [Fandom Experience Posts](https://www.reddit.com/r/NFL/wiki/rules_detail#wiki_fandom_posts)\n* [Political and Religious Posts](https://www.reddit.com/r/NFL/wiki/rules_detail#wiki_political.2Freligious_posts) - Posts about politics and football are becoming more commonplace, but r/NFL is not the place to talk about the political world, writ large. Posts of a political nature should be limited to specific policies and laws that impact the NFL, not opinions or \"hot takes.\"\n\nOn occasion the moderating team might use their discretion and allow significant news which falls under one of these topics to remain. Non-definitive examples might include a stadium sponsor changing, a team rebrand revealed via merchandise, moderators from another subreddit to raise awareness of their sport or a significant piece of memorabilia breaking a record price at auction.", "label": 0}
{"text": "Vikings offense is going to be even more crazy once Hock is back.", "label": 0}
{"text": "Our secondary is sooooo trash 🥲", "label": 0}
{"text": "JJ is doing the work.", "label": 0}
{"text": "Sigma dick hahahaha", "label": 0}
{"text": "GIVE JEFFERSON 200 YARDS", "label": 0}
{"text": "This game is gonna be good for my JJ fantasy stats", "label": 0}
{"text": "Holy hell", "label": 0}
{"text": "Ya'll think JJ might be better than Moss one day? I mean dudes do tend to play longer now", "label": 0}
{"text": "Guys not even playing but he’s got that edge. Rams should trot that dude on the field. He has heart.", "label": 0}
{"text": "200 yard JJ game incoming", "label": 0}
{"text": "Jefferson is unfair, Vikings shouldn’t be allowed to have him out there for more than a quarter", "label": 0}
{"text": "I like when the Vikings march down field\n\nI don’t like when the Rams march down field", "label": 0}
{"text": "Rams D is getting cooked by Jefferson!", "label": 0}
{"text": "I don't see a lot of Rams games, but it still seems weird not seeing #99 absolutely destroy the interior of the offense", "label": 0}
{"text": "That’s not even a hot take, that’s the definition of being unsportsmanlike", "label": 0}
{"text": "League fucked :(", "label": 0}
{"text": "I was so excited to have our top two receivers back I completely forgot we have one of the worst defenses in the league.", "label": 0}
{"text": "His hands dropped that 4th down pass in SF last year.", "label": 0}
{"text": "Addison is a beta confirmed, the JJ always gets the girl", "label": 0}
{"text": "rams should try to cover the vikings receivers better", "label": 0}
{"text": "JJ puttin da team on his back doe", "label": 0}
{"text": "Hey Al, hockenson has to come back next game, nice commentary though.", "label": 0}
{"text": "Did someone tell Jefferson to change out of the red gloves and cleats?", "label": 0}
{"text": "Jefferson should get a 10% cut of Cousins' checks and 25% of Darnold's future earnings", "label": 0}
{"text": "More likely to verbally abuse the behind the scenes crew?  Al or Kirk?", "label": 0}
{"text": "Rams defense sucks ", "label": 0}
{"text": "DARNOLD IS PERFECT", "label": 0}
{"text": "Defense? What is defense", "label": 0}
{"text": "Gotta stay ready 😎", "label": 0}
{"text": "r/unexpectedIASIP", "label": 0}
{"text": "Panthers were only borrowing the crown for a little bit", "label": 0}
{"text": "You must not have played it as much as I did this summer then.", "label": 0}
{"text": "Did Jefferson change his shoes and gloves after the first drive?", "label": 0}
{"text": "That was his son", "label": 0}
{"text": "Did al Michael's just call Jordan Addison a beta?", "label": 0}
{"text": "Jefferson ripping the Rams apart", "label": 0}
{"text": "i wanna see a 300 yd receiving game", "label": 0}
{"text": "Must be nice to have a QB who slides", "label": 0}
{"text": "People sometimes pay attention to traffic cones tho", "label": 0}
{"text": "Justin Jefferson on pace for 350 receiving yds this game", "label": 0}
{"text": "J jettas is just so special. He’s gonna be one of the greats when it’s all said and done", "label": 0}
{"text": "Appreciate it Bengbear bro!", "label": 0}
{"text": "Jefferson gonna have 300 yards and 4 touchdowns", "label": 0}
{"text": "Look, Josh Allen was terrible, so was manning, hell OJ Simpson was terrible too plenty of people need to develop hold off for at least a year lol", "label": 0}
{"text": "uh oh, you can't call a WR2 a beta like that, it activates the diva gene. Addison is gonna demand a new contract tomorrow.", "label": 0}
{"text": "Oh boy this is gonna be a shootout isn't it", "label": 0}
{"text": "Way too much depth being given by the safety. Just allowing Jefferson to kill them in the deep middle.", "label": 0}
{"text": "Sam Darnold is r/wallstreetbets hero.\n\nTurning 10 mil into 200.", "label": 0}
{"text": "So after 6 weeks, is Darnold at least an average QB or are the weapons that good?", "label": 0}
{"text": "JJ going for 200", "label": 0}
{"text": "Jesus this game is gonna be fucking crazy high scoring if the rams can keep up", "label": 0}
{"text": "and where's the sigma.", "label": 0}
{"text": "JJ must of read the Dorothy comments and decided to shape up", "label": 0}
{"text": "Yeah he messed that up. His son.", "label": 0}
{"text": "Good game so far, highly unusual for a thurs night", "label": 0}
{"text": "Either JJ or Puka is going to break 336 yard record", "label": 0}
{"text": "The Jets catching sprays!! Beautiful", "label": 0}
{"text": "Jets catching strays.", "label": 0}
{"text": "lmfaoooooo I heard that and did a double-take myself. You just pulled an Al too though, his name is Al Michaels 😂", "label": 0}
{"text": "Pretty much. I mean the only reason we have any knowledge of NFL teams such as finances, taxes etc is cuz we make guesses based on the Packers financials and such.", "label": 0}
{"text": "If I hear that story one more time this season I’m going to lose my mind", "label": 0}
{"text": "Defense is just chilling", "label": 0}
{"text": "This is my first time watching Twitch instead of Prime. Are the aerial camera shots a new thing or has it always been on Twitch??", "label": 0}
{"text": "rams d is terrible", "label": 0}
{"text": "He’s just like me fr", "label": 0}
{"text": "Al Michaels just called Jordan Addison a Beta.", "label": 0}
{"text": "Sammy Two Feet, etc.", "label": 0}
{"text": "Mcvay looks so tired", "label": 0}
{"text": "Panthers fans catching strays", "label": 0}
{"text": "#EXCUSE ME, WHERE ARE THE FLAGS?!", "label": 0}
{"text": "Def was wearing red gloves & shoes lol", "label": 0}
{"text": "Guys I played Madden for the first time ever today and I beat my partner 38-22 (it was 38-9 until I showed some mercy in garbage time) and at one point early in the game I went for it on 4th and 29 at my own 3 yard line and launched a 97-yard TD pass.\n\n(My partner was the Bills and I was the Seahawks).", "label": 0}
{"text": "Way ahead of you", "label": 0}
{"text": "Jets fans are never safe", "label": 0}
{"text": "Let’s not forget the random games on random streaming services", "label": 0}
{"text": "I swear Addison is open every play", "label": 0}
{"text": "Silly commentary. The GEQBUS is the only alpha.", "label": 0}
{"text": "GEQBUS MAKES HUGE GAINS WITH HIS FEET", "label": 0}
{"text": "God damnit rams make a fucking tackle on Jones", "label": 0}
{"text": "Yes. Had red on. I was using that to find him on the field since I have the overs on him.", "label": 0}
{"text": "What the all time receiving record in a game? JJ might smash that next week vs us", "label": 0}
{"text": "Does this make Nailor the sigma?", "label": 0}
{"text": "How do you not tackle Jones trying to alligator roll his ankle off?", "label": 0}
{"text": "Yes, apparently lol", "label": 0}
{"text": "DARNOLD *IS* PERFECT! MANY PEOPLE ARE SAYING SO.", "label": 0}
{"text": "Best of luck man, super frustrating when that happens.", "label": 0}
{"text": "Why can't I just watch TNF without the Jets catching strays?", "label": 0}
{"text": "I don’t understand how Darnold went from being a laughing stock to a solid ass QB", "label": 0}
{"text": "I think the Rams have forgotten about Justin Jefferson.", "label": 0}
{"text": "My quarterback has the best legs. Beautiful legs, people are saying.", "label": 0}
{"text": "Please make it the third head to head game of the season, in the playoffs, and destroy their hopes.\n\nPlease please.\n\nI'm not still bitter.", "label": 0}
{"text": "Jets and Panthers out here catching strays for no reason  other than being complete dumpster fires 😂😂", "label": 0}
{"text": "The way Al Michaels says “banging” makes me feel uncomfortable.", "label": 0}
{"text": "Jones keeps banging", "label": 0}
{"text": "Kirk dumping on the Jets lol ", "label": 0}
{"text": "How’d he get away there lol", "label": 0}
{"text": "They’re going to Reno!", "label": 0}
{"text": "Whoops!", "label": 0}
{"text": "First team to get a stop wins", "label": 0}
{"text": "BIG if", "label": 0}
{"text": "Jets fans: “WHAT HE SAY FUCK ME FOR?!?!”", "label": 0}
{"text": "Damn so many teams, including the Ravens unfortunately, are trying out the glass cannon build this season.", "label": 0}
{"text": "This zone is not working. ", "label": 0}
{"text": "The Jets", "label": 0}
{"text": "Because the NFL *needs* the threat of relocation to force people into paying for stadiums.\n\nLook at Houston. They didn't trust Bud Adams enough to give him money because he was a giant fuckwit, so he packed up and left for second-rate Nashville.\n\nThe fourth-largest city in the nation would've gone without a team if the LA bid hadn't fucked things up so monumentally the owners (minus Bud Adams) went \"okay, Houston, you've got your shit together, here you go\".", "label": 0}
{"text": "What a Q1 for Darnold and Jefferson", "label": 0}
{"text": "Easier said than done for Browns fans. I was born there 60 years ago. Sat in the Dawg Pound week after week and saw some thrillers and some heartbreakers. I moved to the Bay Area in 1993 and still tried to hang on, even after they left for Baltimore. What we got back was a shitty joke of a franchise that I couldn't support anymore. And this many years later, I'm just not from Cleveland anymore.\n\nEven now my friends, classmates, etc  back in NE Ohio think I'm a traitor for being a Niners fan. I'm like my dudes are you honestly telling me I should hang on to that shit? Jfc there's no point", "label": 0}
{"text": "least impressive Justin Jefferson quarter", "label": 0}
{"text": "You don't understand. They are... Or they're \\*trying\\*", "label": 0}
{"text": "Darnold ain’t making the pro bowl but not for the reason you think 🤫", "label": 0}
{"text": "WAIT DOES JEFFERSON HAVE AN END RACISM ON THE BACK OF HIS HELMET AND DARNOLD JUST HAS VIKINGS LMAO! DARNOLD WTF LMAO", "label": 0}
{"text": "Kirk keep our name out ya mouth \n\nEnough of the strays ", "label": 0}
{"text": "all gas, no brakes!", "label": 0}
{"text": "Carolina randomly catching strays is insane", "label": 0}
{"text": "As a neutral observer yes plz.", "label": 0}
{"text": "I might need to check this out.", "label": 0}
{"text": "Many people are saying he's the fastest man they've ever seen", "label": 0}
{"text": "All this competent offence last few weeks has me having an internal crisis about what Thursday night football even is.", "label": 0}
{"text": "Everything is system.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "\"First, I want to apologize directly to the young woman\ninvolved in this incident. I want to apologize to her for my behavior that night and for the consequences she has suffered in the past year. Although this\nyear has been incredibly difficult for me personally, I can only\nimagine the pain she has had to endure. I also want to apologize to\nher parents and family members, and to my family and friends and\nsupporters, and to the citizens of Eagle, Colo.\n\n\"I also want to make it clear that I do not question the motives\nof this young woman. No money has been paid to this woman. She has\nagreed that this statement will not be used against me in the civil\ncase. Although I truly believe this encounter between us was\nconsensual, I recognize now that she did not and does not view this\nincident the same way I did. After months of reviewing discovery,\nlistening to her attorney, and even her testimony in person, I now\nunderstand how she feels that she did not consent to this\nencounter.\n\n\"I issue this statement today fully aware that while one part of\nthis case ends today, another remains. I understand that the civil\ncase against me will go forward. That part of this case will be\ndecided by and between the parties directly involved in the\nincident and will no longer be a financial or emotional drain on\nthe citizens of the state of Colorado.\"", "label": 0}
{"text": "I cannot wrap my mind around reborn Sam Darnold", "label": 0}
{"text": "The Jets and Panthers are trach tier franchises", "label": 0}
{"text": "KOC, a future HOF WR, and a really really good WR2", "label": 0}
{"text": "He’s just too good", "label": 0}
{"text": "not me but I hear ya", "label": 0}
{"text": "Sammy Sneako", "label": 0}
{"text": "Haha you football teams are so stupid, covering JJ is what they'd expect you to do!", "label": 0}
{"text": "Gotta say I am loving how good GEQBUS looks. Sexy, very manly. Everybody has been saying this, even Stupid Stafford agrees with us. I’ll admit, Stafford doesnt look bad , hes handsome too, very handsome. Not as handsome as GEQBUS.", "label": 0}
{"text": "Anyone pick the under?", "label": 0}
{"text": "NFL announcers stop short of Darnold and Kurt Warner comparison", "label": 0}
{"text": "Just shows you how often draft scouts frequently miss. NFL enthralled with Juedy and Ruggs. Meanwhile Jefferson and CD 10x better.", "label": 0}
{"text": "Wasn't a problem against the Niners.", "label": 0}
{"text": "Rams recreate 54-51 with the Vikings", "label": 0}
{"text": "What did he say I missed it", "label": 0}
{"text": "Like watching competent offenses", "label": 0}
{"text": "Rams defense signaling a stop when he's 3 yards past 😂", "label": 0}
{"text": "Viking horn helmets are the only other helmet style I think is as cool as my Bengals’ stripes, it just looks so good with the matte finish", "label": 0}
{"text": "Jesus let the Jets just enjoy TNF for gods sake.", "label": 0}
{"text": "jets and panthers fans go through enough bs. Why bring that up?", "label": 0}
{"text": "Bet he got warned since it’s not a standard color", "label": 0}
{"text": "What's going on with Sam Darnold is that the Jets and Panthers have been absolutely awful teams", "label": 0}
{"text": "Darnold really is perfect evidence of how impactful good coaching and having a well run organization is", "label": 0}
{"text": "Really feeding Jefferson early", "label": 0}
{"text": "Defence looks like it’s… trying to improve? A couple of good tackles but we still suck a little", "label": 0}
{"text": "Yeah...if I'm a Columbus Crew fan, I may start to feel concerned.", "label": 0}
{"text": "This is lowkey making me proud of our Defense.", "label": 0}
{"text": "“Hey guys should we cover Jefferson”\n\n“No”", "label": 0}
{"text": "I feel like Jets fans have been catching a staggering amount of strays since the Adams trade.", "label": 0}
{"text": "He's coming back down to Earth.", "label": 0}
{"text": "Justin Jefferson looking for that Brandon Marshall record", "label": 0}
{"text": "Rams defender wasn't signalling 4th down, but \"fight the power\"", "label": 0}
{"text": "They say you can tell a lot about man by the company he keeps.  Maybe he is better at managing his public opinion than we realize.", "label": 0}
{"text": "Fuck it. Let JJ get 30 receptions this game", "label": 0}
{"text": "Robinson and Tutu are great until the redzone.", "label": 0}
{"text": "He didn't write back.\n\nWrong former Jets QB?", "label": 0}
{"text": "CALL HIM SAM HURTS SMART PEOPLE ARE SAYING IT", "label": 0}
{"text": "Absolute facts. I have ADHD and my school makes it a fucking nightmare.", "label": 0}
{"text": "I walked in here I said \"wow what beautiful legs\"", "label": 0}
{"text": "Sam \"Jaylen Hurts\" Darnold", "label": 0}
{"text": "THE REAL KING OF THE NORTH", "label": 0}
{"text": "I love that no huddle sneak. Total Eagles move.", "label": 0}
{"text": "Yeah but Ruggs was pure speed", "label": 0}
{"text": "I heard JJ came out of his mother’s womb with a couple 100 yard games under his belt", "label": 0}
{"text": "how so?", "label": 0}
{"text": "What happened? The roster doesn't suck.", "label": 0}
{"text": "Agree. \n\nI hope Reynolds is OK and makes a full recovery. But there can't be a benefit thats worth the risk og going to a strip club past 1 AM on a Thursday.", "label": 0}
{"text": "Jefferson catches the ball so effortlessly. He's sure on pace for a big-time game.", "label": 0}
{"text": "How did the Jets become the new Patriots, where they're the second most hated team in the league? (Dallas still Dallas y'know)", "label": 0}
{"text": "KoC was also a Jet.", "label": 0}
{"text": "Alpha Jefferson is goated with the sauce\n\nBeta Addison drinks and drives", "label": 0}
{"text": "He’s got a great oline, a pair of elite receiver, a great veteran running back. He as all the time in the world to throw and someone seems to always be open.", "label": 0}
{"text": "Also he has never missed a game and basically never fumbles, and had 1k yards every season. \n\nHe needs o line help he often doesn't get, but if his first contact is past the line of scrimmage he's *very* hard to get down. A lot of his runs are a gang tackle of 3-4 guys being ran backwards, and it can exhaust the defense, (which helps him in the 4th quarter).\n\nI definitely think he's underrated. He's not the best, but people talk about him like he's average, and he's not.", "label": 0}
{"text": "The NFL  is *really* pushing those ugly ass hats this year like Kevin O'Connell is wearing. \n\nThe kind of hat only 60 year old white dudes would like.", "label": 0}
{"text": "Does he have a sex addiction? Problem with sex? Addicted to sex? Sex addiction or something? ", "label": 0}
{"text": "Kirk is just shitting on the jets lol", "label": 0}
{"text": "Jesus Christ this game is like a John Wick movie. Calm down everyone. It’s a school night", "label": 0}
{"text": "I didn’t start Puka, AMA", "label": 0}
{"text": "JJ just casually dog walking an nfl team", "label": 0}
{"text": "Stop bringing it up Kirk! Jfc", "label": 0}
{"text": "Zam Darnold", "label": 0}
{"text": "I'm a Giants fan in Sac and I wish to never hear of the A's again tbh", "label": 0}
{"text": "i just wrote a cover letter with AI and it sounds like exactly the type of dogshit i'd write if i were strapped into a chair and forced to write a good cover letter. god bless the future", "label": 0}
{"text": "GEQBUS does the best sneaks, many people are saying it!", "label": 0}
{"text": "Is it me or is the video quality on prime significantly better than abc/espn?", "label": 0}
{"text": "Yeah he’s due for a post Super Bowl slump", "label": 0}
{"text": "Tepper and Haslem. Big yikes for you", "label": 0}
{"text": "“Not too many guys go from Green Bay to Minnesota”… many guys do though ", "label": 0}
{"text": "Do the NFL players and staff not have free NFL network or any of their many partnered apps access for free?!  I worked at a sports network and all their employees got free access to that network (not the NFL).", "label": 0}
{"text": "You have to hover over the window for it to not lag? I feel like streaming services have taken a step back.", "label": 0}
{"text": "Did the No Fun League make a call to make Jefferson switch away from the red gloves and shoes?", "label": 0}
{"text": "So they're saying that Rodgers is eventually going to be a Viking?", "label": 0}
{"text": "Yo is it me or this primevision view is dope. Love seeing the game unfold at this angle.", "label": 0}
{"text": "I can’t explain it but Mcvay looks rough and disheveled", "label": 0}
{"text": "I aspire to that level of confidence", "label": 0}
{"text": "Dunno if they'vet tightened it up since they played us but Mixon should be able to feast on that run D.", "label": 0}
{"text": "Bryce Young hoping to get traded from Carolina while he still has a chance. Panthers are trash from the owner down.", "label": 0}
{"text": "The uniforms aren’t even the right color. They are literally called the “Browns” yet have orange jerseys. \n\nAnd I stg if a Browns fan comes in mentions it being named after the surname “Brown”, I’m gonna mock them further.", "label": 0}
{"text": "not too many guys go from gb to minn? Seriously I remember it seemed like half our team did at one point", "label": 0}
{"text": "It stands for Keep Jerkin’", "label": 0}
{"text": "Why would anybody not hate the Jets?", "label": 0}
{"text": "Al Michaels is calling this game like he's up against Jefferson in a full PPR fantasy league and wincing at every catch.", "label": 0}
{"text": "Rams defense - The Milk Carton Boys.", "label": 0}
{"text": "Fuck you", "label": 0}
{"text": "Jefferson on pace for 272 yards", "label": 0}
{"text": "Where is the defense?!", "label": 0}
{"text": "ALL HAIL THE GEQBUS", "label": 0}
{"text": "I love this game", "label": 0}
{"text": "Sherfield tha GOAT", "label": 0}
{"text": "Maybe that’s how I like it?", "label": 0}
{"text": "So what does it matter if it’s moved 15 minutes outside of the city if it doesn’t bring an economic impact worth much of anything?", "label": 0}
{"text": "3 drives, 3 touchdowns", "label": 0}
{"text": "“Beta Addison drives on the sauce” \n\nWas right there cmon man", "label": 0}
{"text": "That blitzing LB had no idea what to do", "label": 0}
{"text": "Ahh. An \"Oops, All Offense!\" game", "label": 0}
{"text": "HEY DOLPHINS LEGEND TRENT SHERFIELD!", "label": 0}
{"text": "He brought up Favre just so he could talk about the Jets", "label": 0}
{"text": "Man, defense is optional so far", "label": 0}
{"text": "No seriously how is Sam Darnold so good now??", "label": 0}
{"text": "Saaaaam Daaarrrrnooolllddddd!!!", "label": 0}
{"text": "Sam Darnold and Geno Smith being quality starters and Aaron Rodgers looking washed definitely points to the Jets being the problem", "label": 0}
{"text": "This is fun. Ngl I'm enjoying this game", "label": 0}
{"text": "Do the Rams even have a defense out there", "label": 0}
{"text": "KOC Mastermind", "label": 0}
{"text": "I feel like I could torch this defense. No one is near anyone.", "label": 0}
{"text": "No defense tonight I guess.", "label": 0}
{"text": "I think you could argue it either way. Or both.", "label": 0}
{"text": "RIP Prince, you would’ve loved Sam Darnold", "label": 0}
{"text": "I was saying back in 2020 that Jefferson not going at least top 10 will be an all time mistake for a lot of teams. I have very poor judgment but I pride myself on that one", "label": 0}
{"text": "I should of put more on the over.", "label": 0}
{"text": "Darnold ice cold tonight", "label": 0}
{"text": "Sammy (big) D right down the field", "label": 0}
{"text": "Welp, looks like we have a purely offensive game", "label": 0}
{"text": "true", "label": 0}
{"text": "we've got a shootout on our hands boys", "label": 0}
{"text": "No stops tonight lol", "label": 0}
{"text": "Do the rams have any DBs on the field?", "label": 0}
{"text": "Sam Darnold & JJ are having their way.", "label": 0}
{"text": "Lol this game", "label": 0}
{"text": "This game about to have a college score", "label": 0}
{"text": "JJ is pretty good at his job.", "label": 0}
{"text": "SHOOT OUT! ALL GAS AND NO BREAKS!", "label": 0}
{"text": "Will the rams defense get a stop all game", "label": 0}
{"text": "I believe he tried this one, an agent would've put it on some letterhead or a tight social media post.  \n\nNow, someone may have given him many of these words and he copy pasted over to his word doc.", "label": 0}
{"text": "Daddy has friends in high places.", "label": 0}
{"text": "lmao yes! we got a shootout!", "label": 0}
{"text": "Let's go! Shootout babeeeee", "label": 0}
{"text": "Because they're Jets fans...?\n\n..... Oooooooh I get it, because they hate the Jets too.", "label": 0}
{"text": "Trent Sherfield catching TDs now huh", "label": 0}
{"text": "NY Jets is where QB's go to die.", "label": 0}
{"text": "Bro we were stealing packer players for years I don’t know what he’s talking about", "label": 0}
{"text": "If people there are soft enough to want to shoot other people there, then I'm going with Little Willies", "label": 0}
{"text": "Yep it’s a shootout. \n\nGotta be since each QB is auditioning for the other team", "label": 0}
{"text": "Guess tonight will be a shootout lmao", "label": 0}
{"text": "Oliver and Sherfield popping off!!!!!!", "label": 0}
{"text": "Vikings legend Trent Sherfield", "label": 0}
{"text": "Can the rams keep up with the shootout about to happen", "label": 0}
{"text": "Shootout?", "label": 0}
{"text": "Darnold has enough time in the pocket to do his taxes", "label": 0}
{"text": "Rams looking booty cheeks on defense", "label": 0}
{"text": "Are there more TDs than flags? That would be something.", "label": 0}
{"text": "And had an unblockable turn around!", "label": 0}
{"text": "Vikings are doing whatever they want offensively.", "label": 0}
{"text": "JJ gonna get 300 yards, no TDs", "label": 0}
{"text": "The reason I'm mildly surprised that the Browns are going out of their way to challenge the Modell Law in court is because it's almost comically easy to run a fake sales process for an asset near the valuation of an NFL team. \n\nAn investment bank can throw together a fancy investor presentation, and then you can write up a process letter that says potential purchasers who can show (1) Cleveland residency, (2) $1-2 billion in available cash and (3) $3-5 billion in committed debt financing from banks are invited to contact the investment bank for \"next steps\" in the process.\n\nLoad up a virtual data room with a bunch of confidential team documents but don't give anyone access to them until they show satisfactory proof of 1, 2 and 3 to your investment bankers.\n\nThe Modell Law just requires a 6 month opportunity to purchase from the date notice is given, so just deliver notice tomorrow along with the process letter and see what happens.", "label": 0}
{"text": "Election year geqbus is different", "label": 0}
{"text": "The lack of flags just feels weird.", "label": 0}
{"text": "Vikings offense is immaculate today", "label": 0}
{"text": "Damn it’s amazing what an offense can do when the betas all know their place and support the alphas", "label": 0}
{"text": "I love that angle, I always watch it as it allows seeing what coverage the defense is in & exactly what plays the offense is doing to deal with it.", "label": 0}
{"text": "First to punt loses?", "label": 0}
{"text": "Alright time to see if the Vikings D wants to do something.", "label": 0}
{"text": "This has to be the worst defense performance ive seen so far this year by the Rams", "label": 0}
{"text": "Unfortunately :/\n\nHe follows T*cker C*rlson, T*te and more of those folks", "label": 0}
{"text": "Vikings are gonna score a touchdown on every drive", "label": 0}
{"text": "Look at Sam throwing tuddies", "label": 0}
{"text": "He’s gotten two suspensions for the absolute most petty shit. Who cares. He’s a great teammate and this team will step up while he is absent ", "label": 0}
{"text": "Has there been an incompletion yet?", "label": 0}
{"text": "Must be nice to have CJ Stroud", "label": 0}
{"text": "I am so incredibly curious about what happens with Sam darnold in the offseason and where he ends up", "label": 0}
{"text": "over/under 70 points?", "label": 0}
{"text": "Al Michaels needs to get his alpha/beta lingo up to date.", "label": 0}
{"text": "someone on the Vikings is wearing a diamond necklace", "label": 0}
{"text": "The anti TNF game", "label": 0}
{"text": "TRENT SHERFIELD AND JOSH OLIVER THE HEART AND SOUL OF THE OFFENSE", "label": 0}
{"text": "Basically the Jets are sitting wondering why?", "label": 0}
{"text": "Darnold looking Goffesque through 1Q", "label": 0}
{"text": "this looks very easy for minnesota", "label": 0}
{"text": "A quality Thursday night game? What is this nonsense.", "label": 0}
{"text": "Trent Sherfield Buffalo Bills legend", "label": 0}
{"text": "Snead and McVay have to get over their thing of not prioritizing linebackers.", "label": 0}
{"text": "63-60 final score", "label": 0}
{"text": "Man, that blue flu is really hurting here, eh Lions fans?", "label": 0}
{"text": "i love it", "label": 0}
{"text": "The loss of AD is very apparent.", "label": 0}
{"text": "There was a facemask flag on the rams drive", "label": 0}
{"text": "Like a ton of guys go from Green Bay to Minnesota.", "label": 0}
{"text": "Both times I tended to my pizza, the Vikings scored.", "label": 0}
{"text": "Will “third” Reichard still perfect on the season", "label": 0}
{"text": "Yeah the 4th string WR gets a TD. Why not?", "label": 0}
{"text": "Those crossing routes are killing the Rams.", "label": 0}
{"text": "Rams defense looks absolutely lost.", "label": 0}
{"text": "We got a banger brewing.", "label": 0}
{"text": "Darnold hand it off to Jones you fraud", "label": 0}
{"text": "So is sherfield the sigma receiver", "label": 0}
{"text": "Prime time darnold.", "label": 0}
{"text": "I'm stupid and my English isn't very good.\n\nWhat does JJettas mean? I know JJ are his initials and Jet like the plane but what about the 'as' at the end ? Is it there just to sound cool?", "label": 0}
{"text": "That's what separates the good from the great. So glad he's in purple and not green lol", "label": 0}
{"text": "I think he’s constipated - really has to poop but never got the chance to", "label": 0}
{"text": "Sam Darnold is absolutely “son’ing” this Rams Defense lmfao", "label": 0}
{"text": "great drive", "label": 0}
{"text": "JJ McCarthy could be anything!! He could even be 2024 Sam Darnold!!", "label": 0}
{"text": "Yeah I was going to make the same comment. That was a definite untrue statement by old Al lol", "label": 0}
{"text": "Vikings offense is a thing of beauty.", "label": 0}
{"text": "“Not too many guys make that jump for Green Bay to Minnesota”\n\nWhat the fuck are they talking about, the Vikings sign one salty ex Packer every year", "label": 0}
{"text": "Someone tell Al the game has started", "label": 0}
{"text": "This is disgusting. Even if rams offense can keep pace, and they very well could with Puka and Kupp back, their defense will crumble well before Minnesota’s will.\n\nAt least make geqbus work a little", "label": 0}
{"text": "Oh fuck this is gonna be a banger isn’t it", "label": 0}
{"text": "Ayo for yayo.", "label": 0}
{"text": "Darnold always looks more like he threw an interception when he throws a TD lol", "label": 0}
{"text": "GEQBUS is back baby", "label": 0}
{"text": "Twitch is in the future very week, it’s crazy", "label": 0}
{"text": "Bruh. Darnold is actually good. I haven’t had a chance to watch the vikes much this year. Holy hell he’s wheeling and fucking dealing. Love to see it.", "label": 0}
