{"text": "This was great. Got me at the end there thinking you didn't get to go through with your plan.", "label": 1}
{"text": "Boo on them. Fantastic story. Best of luck.", "label": 1}
{"text": "Thanks so much! It’s not as entertaining when it happens to you, but glad to have made it through and be able to share!", "label": 1}
{"text": "Thank you! I questioned myself for a bit - I’ve never been a violent person - but I feel like it was him or me. Thanks for the positive reinforcement! 😊", "label": 1}
{"text": "This is great!!", "label": 1}
{"text": "Glad you do! Thanks for reading 😁", "label": 1}
{"text": "Thanks for reading, appreciate it 😁", "label": 1}
{"text": "A", "label": 1}
{"text": "Superbly written \nLoved it 🌼", "label": 1}
{"text": "I’m so sorry you went through that and I’m beyond thankful nothing happened to you. It’s insulting to know you can’t have anything legally done for your safety until “physical” harm takes place. Nonetheless- I hope you have peace of mind now.", "label": 1}
{"text": "Why was this deleted?", "label": 1}
{"text": "Thank you. I really was one of the lucky ones. I really want to hope that things have improved in the 20+ years since this happened.\n\nI hope you feel safer too.", "label": 1}
{"text": "They said it was “incomplete”…?", "label": 1}
{"text": "I am glad it is still up on a couple other pages", "label": 1}
{"text": "Me too! I am not familiar with Reddit so when it’s removed from subs I’m not sure why or how to resolve it…? If you have any recommendations on if this should be posted anywhere else, please let me know.", "label": 1}
{"text": "I have been here a while but have no idea how to fix things. Sorry.😔", "label": 1}
{"text": "This is after that clean girl TikTok", "label": 1}
{"text": "This is SO GOOD! Wonderful work so far, OP!", "label": 1}
{"text": "Keep on writing! I really like the rhythm of the paragraphs in this. You have a real talent!", "label": 1}
{"text": "Don't think I've ever hated anything as much as I hate this. literal trash and demeaning. feels like a caricature of a woman although some women apparently want to be fucking caricatures.", "label": 1}
{"text": "I’m not on TikTok but I can send some YouTube links about her it’s her her cleaning peoples graves and some people think it’s disrespectful", "label": 1}
{"text": "https://youtu.be/DtfhRx7OaNw?si=MNdCoqBfkW4INofA", "label": 1}
{"text": "Good read! At first I saw a bunch of directions it COULD go and I'm happy with how you let us know early which direction it took. \n\nAlso the detailed descriptions are awesome", "label": 1}
{"text": "The future of toxic boy moms lol", "label": 1}
{"text": "Thank you so much! I’m so excited you enjoyed it!", "label": 1}
{"text": "This was a fun read! I can't wait for part 2!!!", "label": 1}
{"text": "Um… I didn’t think it was but the way people are commenting makes me think this is a true story. Is it?", "label": 1}
{"text": "This series is awesome 😎 ", "label": 1}
{"text": "The [nosleep commenter FAQ](https://www.reddit.com/r/NoSleepAuthors/s/95r9e2hfks) and subreddit rules have some helpful info.", "label": 1}
{"text": "Holy terrifying..please give a part 2. Ty", "label": 1}
{"text": "Cool story", "label": 1}
{"text": "Does saying the name not reverse it in this case? Because Conner said Charlotte's name.", "label": 1}
{"text": "She could’ve just told you about it, instead of gaslighting you", "label": 1}
{"text": "Still showing the following for me:\n\nConner pointed trembling fingers in the direction of the two girls. \"A-Abby jinxed Charlotte,\" he stammered. \"They said the same thing at the same time.\"", "label": 1}
{"text": "Just went to the story from op's page and it's switched to what you have here.\n\nNice job, u/Mister_Glimmer, fixing it without acknowledging the person who pointed it out 🖕", "label": 1}
{"text": "Keep up updated!", "label": 1}
{"text": "I used to have dreams about Thomas, and his voice in the dreams, kinda brassy but soft if you know what I mean, it was a lot like the voice I heard in the slough, so I assumed it was him, the voices were probably in my head, so if they were, then obviously they'd just sound like what I assumed his voice would sound like, the voice I heard in my dreams.", "label": 1}
{"text": "I believe dreams have a lot of significance in our lives, and can tell us things that we couldn't learn in reality. It's just my belief, but my dreams have often given me a lot of insight into things that've troubled me, like my great uncle's death.", "label": 1}
{"text": "This shit is crazy I’m invested as fuck rn", "label": 1}
{"text": "Oooh I like this idea of a liminal space type of thing. Also - HOW DAMN HUGE IS YOUR FRIDGE?", "label": 1}
{"text": "https://www.reddit.com/r/nosleep/s/xeygSHGSTx", "label": 1}
{"text": "If I shed my skin it’d have fur underneath cuz I got that dog in me!", "label": 1}
{"text": "Is this fake? Looked up the film. No data on it whatsoever. This pictures show hotels, people, and a romance cover. Romance doesn’t seem to fit in with horror. No videos. Nothing.", "label": 1}
{"text": "And here I thought I was reading a relationship advice post until it became very different \n\nWheeee.", "label": 1}
{"text": "Why in the last part of the passage, does the author indicate that her body is rejecting?  Does the body not belong to her?", "label": 1}
{"text": "Performatively doing nothing is quite an art form. Well done.", "label": 1}
{"text": "dude found a sex tape of his wife getting assaulted by some kind of humanoid.", "label": 1}
{"text": "There is no Antimemetics Division.", "label": 1}
{"text": "So you just watched The Substance and have a vivid imagination and lots of free time, huh?", "label": 1}
{"text": "Hilarious", "label": 1}
{"text": "Reddits not built for essays you say.", "label": 1}
{"text": "LSD is a hell of a drug. Everythings gonna be ok bro, just breathe, right through those gills.", "label": 1}
{"text": "I am just going to wait on the cliff notes or made for tv movie which ever comes first", "label": 1}
{"text": "Cool story bro.  Are you a pilot or a writer for the reboot of the Twilight Zone series though?", "label": 1}
{"text": "Goddammit! Every time I get caught halfway through by seeing r/nosleep 😅", "label": 1}
{"text": "Wow, so good. Bravo, OP !", "label": 1}
{"text": "This was terrifying but really good", "label": 1}
{"text": "Trying for those crappy redot stories are you?", "label": 1}
{"text": "You writing a book?", "label": 1}
{"text": "Meh", "label": 1}
{"text": "\"To cut a long story short, \".............", "label": 1}
{"text": "The most terrifying part was a pilot in a bar before his flight….", "label": 1}
{"text": "Omg I thought I was in a different sub....harsh reality check...no sleep for me tonight", "label": 1}
{"text": "VIDEO TAPE OR IT DIDN’T HAPPEN", "label": 1}
{"text": "Bro actually said cut a long story short once in there 😂", "label": 1}
{"text": "It's fake obviously", "label": 1}
{"text": "Wow! I want to read the book I hope you are working on!", "label": 1}
{"text": "Wow! Hilarious", "label": 1}
{"text": "I normally dislike horror, but this was so well-done!  Thank you so much for sharing.", "label": 1}
{"text": "Me as well lmao I was like nah ur the asshole for going through her stuff 😭", "label": 1}
{"text": "while obvious from a mile away, i still found enjoyment in reading", "label": 1}
{"text": "Can someone summarize plz", "label": 1}
{"text": "great writing!", "label": 1}
{"text": "I knew the second he described his shoes and the way his wife swiveled in her chair, this was not real lol.", "label": 1}
{"text": "Lame", "label": 1}
{"text": "Amazing! Bravo!", "label": 1}
{"text": "Lmao, exactly where I realized. Ain't nobody looking at that when they're checking someone out.", "label": 1}
{"text": "What an amazing journey, thank you for sharing", "label": 1}
{"text": "I was so confused at first because I thought I was on r/relationships\n\n\nThis is so well written, great work", "label": 1}
{"text": "This had me hooked! Very well done!!! The twist at the end was perfectly executed, IMO. Keep it up!", "label": 1}
{"text": "I went down there… they took down the story for title reasons but hopefully it’ll be up again soon… it was a nightmare…", "label": 1}
{"text": "I did… they took it down for title reasons but hopefully it’ll be back up soon…", "label": 1}
{"text": "Great, great story. I had a suspicion Maggie was actually Madeline. Now we need a sequel to find out why.", "label": 1}
{"text": "👏", "label": 1}
{"text": "Wow, great read, I love how descriptive it is, one of the better ones I’ve read on this sub!", "label": 1}
{"text": "This was amazing.", "label": 1}
{"text": "Super duper well written. I expected the skeleton to be your father's real daughter and for Preston and Shea to find your birthmark, maybe through a \"grab the ankle to stop you escaping\" kind of way. Now I'm even more intrigued as to who the skeleton really belonged to. How did your parents pass off suddenly having a 2 year old, if not by losing a child secretly?", "label": 1}
{"text": "But did you get the money at least?", "label": 1}
{"text": "What an excellent story. Beautifully horrific.", "label": 1}
{"text": "I didn't even finish reading this. Looks like AI generated content to me.", "label": 1}
{"text": "He didn't describe his shoes, epaulettes are the pieces of fabric worn on the shoulders of dress shirts/uniforms, like in the military. \nHe was indirectly implying he was a captain, black epaulettes with four golden bars, this is what pilots wear. 🤦🏼‍♂️", "label": 1}
{"text": "I couldn’t read the story fast enough, but then I was sad that I was finished reading it. Great writing.", "label": 1}
{"text": "Oh shit", "label": 1}
{"text": "Wow that was definitely intense. Well done!!!", "label": 1}
{"text": "You're funny 😁", "label": 1}
{"text": "Agreed, I think it's my favorite this year.", "label": 1}
{"text": "I've read better 😌", "label": 1}
{"text": "Thirteenth paragraph in : \"Reddit isn't built for essays....\"", "label": 1}
{"text": "Take care, if you say what you think about his writing he will harrass you in the DMs", "label": 1}
{"text": "Very well done.", "label": 1}
{"text": "Can I translate this story into my native language and use it in my YouTube content? I'll tag you", "label": 1}
{"text": "I'm gonna see orange for days now and hopefully I NEVER MESSAGE THEM IN MY SLEEP!!! I feel like I won't get nosleep tonight now.", "label": 1}
{"text": "I'm gonna see orange for days now and hopefully I NEVER MESSAGE THEM IN MY SLEEP!!! I feel like I won't get nosleep tonight now. Absolutely wonderful and thank you for warning us.", "label": 1}
{"text": "I'm gonna see orange for days now and hopefully I NEVER MESSAGE THEM IN MY SLEEP!!! I feel like I won't get nosleep tonight now. Absolutely wonderful and thank you for warning us.", "label": 1}
{"text": "I'm gonna see orange for days now and hopefully I NEVER MESSAGE THEM IN MY SLEEP!!! I feel like I won't get nosleep tonight now. Absolutely wonderful and thank you for warning us.", "label": 1}
{"text": "Im definitely getting no sleep tonight thanks for the warning 😭", "label": 1}
{"text": "Why can't I reply here?", "label": 1}
{"text": "I should've brought popcorn😭", "label": 1}
{"text": "🖤", "label": 1}
{"text": "That's up to derby man and his pals. I hope they try another fast food place.", "label": 1}
{"text": "This is one of the best opening paragraphs I've read on this site, I love it", "label": 1}
{"text": "Thanks! I appreciate it.", "label": 1}
{"text": "Someone wanted to self publish his work of fiction. Not for a second do I believe any of this.", "label": 1}
{"text": "LOL \nSo that's what it is!", "label": 1}
{"text": "This is a masterpiece", "label": 1}
{"text": "This was great!  I want more!", "label": 1}
{"text": "Wow I want more! This was great!!", "label": 1}
{"text": "Absolutely incredible!", "label": 1}
{"text": "I imagined this like a movie while reading", "label": 1}
{"text": "Good story, Man! 🤣🤣🤣🤣", "label": 1}
{"text": "The unnecessary dialogue is too much, you get bored & forget about the story. & it really doesn’t add much in way of character development. 😬", "label": 1}
{"text": "Anything with space or the ocean I love! So this was a double whammy!", "label": 1}
{"text": "Bloody excellent. I had to read start to finish non stop. Are there more like this?", "label": 1}
{"text": "Omg SAME 🤣", "label": 1}
{"text": "Wow that’s some pretty high praise:)", "label": 1}
{"text": "God i want a part 2 so bad but I also get the mystery of it all adds a layer of scaryness this was so well crafted OP good job mate!", "label": 1}
{"text": "Why am I not seeing anything written? All I see are comments?", "label": 1}
{"text": "Same tf", "label": 1}
{"text": "That does send shivers down the spine. \n💀", "label": 1}
{"text": "Me too! 🤣🤣", "label": 1}
{"text": "LMAO \n\nThanks. I needed that laugh. \n🎃", "label": 1}
{"text": "Update me", "label": 1}
{"text": "There is a post about on the series subreddit - to quote it: \"every post onwards from \"The Goat\" has just been removed ... for some combination of \"immersion breaking\" and \"self-promotion\".\"", "label": 1}
{"text": "This was really good!", "label": 1}
{"text": "Okay I will", "label": 1}
{"text": "You seem confused about your location. At nosleep, EVERYTHING is true. Check rule 8.", "label": 1}
{"text": "Burn it! Great Story!", "label": 1}
{"text": "The writer is the presence in the room, the fourth wall bulging inward, as it were", "label": 1}
{"text": "Did it sound like *ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn*?", "label": 1}
{"text": "TLDR", "label": 1}
{"text": "One of the best I've read, may sound weird, but I'd like to read part 2 if there is going to be one.", "label": 1}
{"text": "I always love when I can tell where the inspo came from…this time- in the tall grass??", "label": 1}
{"text": "Yeah absolutely based on In The Talk Grass with the whole time warp, coming across yourself again maze thing.", "label": 1}
{"text": "Same. I was very confused.", "label": 1}
{"text": "hey you have a few typos - after asking if he had a camera, “i slowly got back “f” to my feet”. and then a little after, he “kicked” the bowl clean", "label": 1}
{"text": "Amazing story dude.", "label": 1}
{"text": "Fantastic story!  I would love to read a continuation.", "label": 1}
{"text": "Maybe this is lack of sleep on my part, but is this a story or something that actually happened? \n\nI can't fucking tell. All I know is, I'm not going back to sleep now.", "label": 1}
{"text": "Americans know both date styles, asshole.", "label": 1}
{"text": "Can anyone here read anything? Why did OP post an empty page?", "label": 1}
{"text": "Oh for fuck's sake! Even my posts are invisible! Someone help me!!!!", "label": 1}
{"text": "How about trying to write? Has your husband noticed anything?", "label": 1}
{"text": "You must be psychic or something. Other commenters said I just left a blank page! No, he just ignored me. I bet that horrible woman with the glitters on her face drugged him. Probably as part of their sick fantasies together!", "label": 1}
{"text": "Congrats! You turned a young man full of potential, aspirations, dreams and a natural charisma to help people overcome their mental issues and potentially help hundreds in a psychology career, to an almost unresponsive shell of the man he once was.\n\nAll because of a stupid crush. Congratulations, you basically killed him, but worse.", "label": 1}
{"text": "I don't think that was a woman, or that the fangs were fake. Idk what advice to give, but it kinda sounds like you're seeing behind the scenes, so to speak", "label": 1}
{"text": "One of my ALL TIME FAVORITE AUTHORS posts for the first time in like 9 months and I missed out on it?!!!\n\nNooooooooooo!!!", "label": 1}
{"text": "I am sooooo bummed I missed it! They’re one of the best r/nosleep authors of all time!", "label": 1}
{"text": "Update us!! This was a good read. Hope everything is ok. Shoot I would take that job in a heartbeat! Maybe lol", "label": 1}
{"text": "Oh it was so exiting but then the stories disappeared", "label": 1}
{"text": "Ngl stories about space and the deep ocean.  They have a good way of sticking with me like we can't wrap our minds around this great writing gl on your next dive!", "label": 1}
{"text": "OMG  update me as soon as you find out. I'll be waiting for more!", "label": 1}
{"text": "Definitely interested in more updates!", "label": 1}
{"text": "That definitely was a woman straddling my idiot of a husband. I just didn't know he was into that sleeping porn kind of thing. He's been out of focus for a few months now and has been ignoring me. He's been complaining of some weird dreams lately and that something feels heavy when he sleeps, but  it's probably the drugs he took. Seems like he's been having that affair with her for a while now. I can't forgive him. I'm so fuming mad. \n\nBut, my bigger problem is that when I got back to the office, no one can see me. I don't know what happened. I can't seem to get anyone to see me or hear me.", "label": 1}
{"text": "I hope they offer HMO and Unlimited PTO, my friend. What a great read!", "label": 1}
{"text": "Remind me!", "label": 1}
{"text": "Oh yes!", "label": 1}
{"text": "Mermaid Ghost. Now that is a character class worth checking out.", "label": 1}
{"text": "Well you’re in luck because it would appear you’re an eligible bachelor!", "label": 1}
{"text": "Oh boy I like this. Terrifying, yet simple. Just enough to make you feel uneasy, but not too much to make you feel frightened. Beautiful psychological horror, executed flawlessly.", "label": 1}
{"text": "What a good story", "label": 1}
{"text": "That sounds like the best job ever! Sign me up!", "label": 1}
{"text": "Ok but it is not obvious when both numbers are under 12", "label": 1}
{"text": "I thought I was reading a Stephen king book 📖 I think it was to precise to the word", "label": 1}
{"text": "mind raped someone and now you're crying? wow", "label": 1}
{"text": "Nice!! Awesome!!", "label": 1}
{"text": "Update me too! That sounds awesome.", "label": 1}
{"text": "I sense allegory here. Good story", "label": 1}
{"text": "Snu snu??", "label": 1}
{"text": "This story is soooo good! Please continue with stage 2!", "label": 1}
{"text": "Wow", "label": 1}
{"text": "If that is a real story.. please leave without causing any harm to them. \nMy grandfather used to have an old farm ..we would go there only on vacation. The place is huge and no other kids are there except me and my cousins. At around 3 am we would hear like if some one is throwing pebbles to the window, we take a look at no one there.", "label": 1}
{"text": "I'm crying I thought this said the gay man at first", "label": 1}
{"text": "Anyways great story", "label": 1}
{"text": "WOW. This is incredible. Just incredible.", "label": 1}
{"text": "I’m glad I didn’t read this at night, really good!!!", "label": 1}
{"text": "Awesome", "label": 1}
{"text": "I can't imagine how panicked I would have been if it were me. I am very timid and I like to make up stories in my mind.", "label": 1}
{"text": "Is this sub roleplay or are you guys for real? Honestly curious", "label": 1}
{"text": "Riveting tale. This deserves more attention", "label": 1}
{"text": "Thank you so much!!!! I am so very glad you enjoyed it. The second part is almost finding.", "label": 1}
{"text": "Really? In my five years, I've had run ins with that creature and we really didn't know what that thing is. I had a suspicion that it was probably just a huge grizzly but it really doesn't match. The fact that a wendigo fell victim to that bear speaks volumes", "label": 1}
{"text": "Someone has been reading lots of Stephen King eeh", "label": 1}
{"text": "Bullshit post", "label": 1}
{"text": "Hi there! [Your post](https://redd.it/1gjavvi) has been automatically [removed](https://www.reddit.com/r/NoSleepAuthors/comments/z93asr/comment/jfigj88/) from /r/nosleep for the following reason(s):\n\n\n\n* **[Long Paragraphs (Over 350 Words)](https://www.reddit.com/r/NoSleepAuthors/comments/zav2k9/comment/iynqcom/)**\n\n  You have one or more paragraphs containing more than 350 words. Please break up your story into smaller paragraphs. You can create paragraphs by pressing `Enter` twice at the end of a line.\n\n  **[Don't delete this post.](https://www.reddit.com/r/NoSleepAuthors/comments/z93asr/nosleep_indepth_modmail_removals_and_reposts/jfiggh0/)** You may [edit it](https://www.reddit.com/r/NoSleepAuthors/comments/z93asr/comment/jfigt8d/), then [message the NoSleep moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fnosleep&subject=Please+reapprove+submission&message=%5BMy+post%5D%28https%3A%2F%2Fredd.it%2F1gjavvi%29+to+%2Fr%2FNoSleep+was+removed+for+formatting+issues.+I+have+fixed+those+issues+and+am+now+requesting+re-approval.%0A%0A_Note+to+moderation+team%3A+if+this+story+is+eligible+for+re-approval%2C+remember+to+remove+the+bot%27s+comment+from+it._%0A) ONCE to ask for a review. Be sure to include [the link](https://www.reddit.com/r/NoSleepAuthors/comments/13men0r/guide_to_getting_a_commentpost_link/) to this post. _Please be patient_ and don't take any further action until the mods reply. This means **don't delete and/or repost.**\n\n\n**See also:** [NoSleep Posting Guidelines](http://www.reddit.com/r/nosleep/wiki/index) | [NoSleepAuthors](https://www.reddit.com/r/NoSleepAuthors/comments/z0qnxx/introduction_to_nosleepauthors/) | [Similar Subreddits](https://www.reddit.com/r/nosleep/wiki/similarsubreddits) | [Author FAQ](https://www.reddit.com/r/NoSleepAuthors/comments/13hku3x/nosleep_faq_authors/) | [Beginner's Guide to Reddit](https://www.reddit.com/r/NoSleepAuthors/comments/10lw4z9/a_beginners_guide_to_reddit/) | [If you use the Reddit app](https://www.reddit.com/r/NoSleepOOC/comments/x2t7ur/reddit_app_users_please_read/)\n\n_I am a bot, and this was automatically posted. Do not reply to me as messages will be ignored. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose?to=%2Fr%2Fnosleep) if you have any questions, concerns, or bugs to report._", "label": 1}
{"text": "dude I was at the nearby mall earlier and I tried out this shwarma rice they were selling and it was so good T\\_ T T\\_T\\_T\\_T\\_T\\_T T\\_T I wanna eat at it again but its like a few km out of my home and I can't be arsed to drive down there just for a shwarma rice but it's so good bro I swear it was like heaven.. anyway I just felt the need to write my thoughts out", "label": 1}
{"text": "It's in no sleep. People get a grip.", "label": 1}
{"text": "well a serious question , is the story real ?", "label": 1}
{"text": "This is by far the best horror story I have ever read. If you ever make a book please let me know.", "label": 1}
{"text": "Every story on this subreddit is real. It's in the rules.", "label": 1}
{"text": "absolutely stunning story, I hope both of you find the peace you rightly deserve", "label": 1}
{"text": "It sounds like an exciting experience. I want to try it myself, but I can't find this chatroom on [dark web websites](https://darkwebfans.com). Please share the onion link.", "label": 1}
{"text": "He doesn't mention anywhere in the narrative when he types the letter\n I'm calling bullshit to the whole story.", "label": 1}
{"text": "thank you", "label": 1}
{"text": "Another great read. I always looking forward to it when I get the notification. \nBut there is one little question:How are November 2021 to February 2024 4 years? Did I miss something or is it just an error?", "label": 1}
{"text": "Maybe try to give better prompts to chatgpt or whatever, this story makes no sense", "label": 1}
{"text": "Mabye the real Biggsie was the friends we made along the way", "label": 1}
{"text": "Can I just say, I love how everyone and every news article says \"x (formerly twitter)\", it makes me laugh at how nobody will ever just call it \"x\".\n\nBut also oh shit", "label": 1}
{"text": "HAHA I CAME HERE TO SAY THIS 😂", "label": 1}
{"text": "Where is this gone pls? I can’t read the rest without reading this one!!☝️", "label": 1}
{"text": "Not sure if a comment is required here, I don't post a whole lot, but just in case here's mine. I don't think I've ever shared this with anyone except close friends, and I spent some time making it more story like in structure to fit this subreddit, straightening my phrasing and minding my \"Ps\" and \"Qs\" better than my natural speaking cadence.", "label": 1}
{"text": "Name a name, let the community folks storm it's place with pitchforks and torches. Aye?", "label": 1}
{"text": "damn i already saw the plot coming 😭", "label": 1}
{"text": "I don't want to write a name here just leave the video of who I suspect:\nhttps://youtu.be/dQw4w9WgXcQ?si=ewHvYDMlX9u5zkSU", "label": 1}
{"text": "Fake but very interesting anyway. Good fantasy 👍", "label": 1}
{"text": "Yea … keep working on that story telling. The point was bland and too drawn out like rubbing sand paper over your eyes", "label": 1}
{"text": "This was... not good. 😬 It just doesn't ring.", "label": 1}
{"text": "Mods, WTH are you doing? This series is the best content to come along this sub since How to Survive Camping!! Everyone, look for the dedicated sub by searching the name of the village on Reddit.", "label": 1}
{"text": "Well done. Very enjoyable read.", "label": 1}
{"text": "> “So can we do like one of those Florida recount things?”\n> “Absolutely! We can do it right now!” \n\n\nThis is great ", "label": 1}
{"text": "I'm honestly just looking for help. Any of yall paranormal people know what this girl is?", "label": 1}
{"text": "More pie for me if you don't want it.", "label": 1}
{"text": "that was a pretty good read", "label": 1}
{"text": "I had to edit a few things out to make it a little more 'immersive.' I hope you enjoy!", "label": 1}
{"text": "I appreciate it! I'm actually writing series based on the 22° Angel, so that angelic critter will make another appearance in No Sleep ☺️", "label": 1}
{"text": "Very interesting.  I'm curious if this particular angel is of the fallen variety...as in some descriptions I believe they're supposed to have the heads of various animals.", "label": 1}
{"text": "I'll say you're on the right track", "label": 1}
{"text": "Sounds like she's a Super Saiyan 4 honestly... The saiyans are a ruthless alien species who are sent to planets to conquer. They have 4 transformations, but with the red fur... the tail... the biting... I'm inclined to believe it's the fourth one. The necklace reminds me of this mutant named Broly who would go berserk if it got taken off.", "label": 1}
{"text": "Now this is an origin story I can get behind.", "label": 1}
{"text": "ooo i like this one", "label": 1}
{"text": "thanks!", "label": 1}
{"text": "Jesus fu king christ", "label": 1}
{"text": "wish I hadnt read this", "label": 1}
{"text": "I'm glad you like it!", "label": 1}
{"text": "So just out of curiosity, what do you do to survive? How do you get food and water? What do you eat? How do you keep your phone charged? \n\nOh and FYI, it’s November the 6th now and trump is back in the Oval Office. Do what you want with that information.", "label": 1}
{"text": "Which ever you decide she is is I truly don’t think she will harm YOU since YOU seem to be her best friend and look out for her , but that doesn’t mean the same for others necessarily.", "label": 1}
{"text": "Let your son listen to this and let us know how he reacts.\n\nhttps://youtu.be/rQxrWxSV9z0?feature=shared", "label": 1}
{"text": "He-hell naw 🌕 🚶", "label": 1}
{"text": "nope nope nope nope, .... i am out noooooooope", "label": 1}
{"text": "Isn't the fleshgait just 4chan's creation that mixed aspects of the wendigo with the skinwalker", "label": 1}
{"text": "For some reason this gave me an impression of Basil Coppers works, namely the one about a person who was seeing similar kind of dreams, and also managed to snag something from his dreams into real world. Eventually, he was dubbed as insane, put into mental asylum, where he met his end, being chopped into pieces by beings from his dreams.", "label": 1}
{"text": "I think I would have to give the succubus a try, hell of a way to go I bet.  Another good chapter thanks for sharing it with us", "label": 1}
{"text": "Good thing they're not overly common. But hey, you might come across a half breed that will show you a good time and not kill you.", "label": 1}
{"text": "Is this a true story?", "label": 1}
{"text": "you are going places in this world my friend", "label": 1}
{"text": "Could have been a real tragedeight if you had looked up those stairs !", "label": 1}
{"text": "I always enjoy these stories, would make for a good TV show!", "label": 1}
{"text": "This is terrifying and gripping", "label": 1}
{"text": "Fred! We've been trying to reach you about your car's extended warranty!!\n\nVery nicely written! Would make a decent short film I reckon.", "label": 1}
{"text": "The best 👍", "label": 1}
{"text": "this isnt real right?", "label": 1}
