{"text": "Ha! Clowns supporting Clowns.", "label": 1}
{"text": "Finally found someone that knows.", "label": 1}
{"text": "Exactly when I think of Harris supporters I'm thinking clowns so this endorsement was a big pickup for the Harris campaign.", "label": 1}
{"text": "How is that any different than the Israeli government? Care to elaborate?", "label": 1}
{"text": "It is not. There’s the nub.", "label": 1}
{"text": "I haven't seen Iran target any civilians or civilian infrastructures so far.\n\nCan't really say the same about the mOsT mOrAl ArMy.", "label": 1}
{"text": "Oh please the fuckfaces in charge of the west have been wanting war with Iran forever. Isntrael only exists and has power because America needs a country for its little proxy wars in the Middle East. Unfortunately Isntrael has become a money laundering scheme turning our tax dollars into bonus checks for our politicians allowing Isntrael to kill, genocide, rape, steal, and force apartheid without facing consequences.", "label": 1}
{"text": "Israel assassinates Iranian scientists.\n\nIran: ...\n\nIsrael bombs Iranian embassy.\n\nIran: ...\n\nIsrael assassinates political figures in Iran's capital city\n\nIran: Alright, we have to defend ourselves. Enough is enough.\n\nWestern media: Iran is antisemitic and is attacking our most important ally and OnLy dEmOcRaCy in the Middle East with the MoSt MoRaL aRmY in the universe for no reason whatsoever and (only) Israel has a right to defend itself!\n\nIsrael: bombs Iran once again\n\nBiden: Aahh, finally we will have peace because Israel got the last hit in, and Iran will obviously do nothing about having its sovereignty violated.\n\n🤡", "label": 1}
{"text": "This isn’t stupid logic. This is Biden giving Israel all the possible support. \n\nIsrael attacks Iranian embassy.\nBiden suggests caution.\nIsrael kills a foreign visitor in Iran\nBiden praises and suggests caution.\nIsrael kills an Iranian general.\nBiden praises and recommends caution .\nIran attacks Israel.\nBiden is furious at Iran for escalation and states Israel right to self-defense. Offers THAD to ensure Israel is able to defend after its next attack.\n\nThis is more or less how the story has played out for the last year and will continue to play out like this.\n\nWe are not neutral in this war and is exactly why we can’t be good moderators.", "label": 1}
{"text": "Honestly, that would be a good thing to say, to tell the disobedient child that you’ve raised all their life as a spoiled brat to stop bullying everyone around them for once, and have them take accountability for their actions. But Biden won’t.", "label": 1}
{"text": "America can be an adult and engage is diplomacy. Reign in Israel, talk to Iran with Saudi Arabia, Qatar, Jordan, Egypt and Lebanon present.", "label": 1}
{"text": "So your claim to truth is trust me bro? I can claim some bs too then. Who’s to say I’m not just pulling horseshit on here.  \n\nThere is enough hard evidence out there for everyone to see if you want to and alternatively there is equally enough if note more of the bullshit you’re spewing on every MSM. Most isreali dont want it yet they will celebrate rape and protest the arresting of IOF who raped men and children.", "label": 1}
{"text": "And Iran did that out of the blue because they \"just hate the jooz like the rest of the world who are all anti-semites\" or did Israel start all of this by attacking Iran first?\n\nYou must be one of those who starts their calendar on Oct 7th as well, right?", "label": 1}
{"text": "Yeah, Israel should really get out of there too.", "label": 1}
{"text": "He’s been an absolute blind supporter of Israeli aggression for his entire political life. \nNothing has changed. \nIf Israel nuked Iran he would praise them for deescalating the situation.", "label": 1}
{"text": "??????? Do you think israel just decided to bomb lebanon????? Hezbollah has been launching rockets and drones from lebanon for over a year at israeli bases and cities\n\n\nHow fucking dumb are you", "label": 1}
{"text": "Why are you blaming abuse victims for getting punished for retaliating against abuse? Personally, I’d put the blame on the abusers for starting the conflict in the first place.", "label": 1}
{"text": "I hope Joe Biden is remembered as the monster he is, and that the Democratic party voters do not allow him to enjoy the fantasy of his presidency being anything short of a joke. George W Bush was a monster, but he can't be accused of genocide or supporting genocide.", "label": 1}
{"text": "yeah yeah, the same old line about a few Arabs overcoming the oppression of apartheid to hold successful positions. And it’s meaningless. It doesn’t change that Israel is an apartheid state, and that inherently is an evil not fit for modern times. \n\nso again, what good is your government if it’s enacting apartheid?", "label": 1}
{"text": "Fuck joe and fuck israel.", "label": 1}
{"text": "what the fuck does israel even want man, they literally decapitated both hezbollah and hamas in the past month. are they really not gonna stop until the entire damn middle east is scared of them, or do they really wanna go full hitler on the palestinians? jesus fucking christ", "label": 1}
{"text": "Well, Iran’s turn to inflict pain then. Eye for eye.", "label": 1}
{"text": "Hmm, I wonder if anyone in Lebanon or Palestine might have done anything to provoke a response? I also wonder if Iran might be behind these hypothetical let's just call them terrorists.", "label": 1}
{"text": "The naqkba.\n\nThe terrorists that formed the illegal state that occupied Palestine.\n\nIsrael has no business existing in the 21st Century. Ethno nationalism doesn't work.\n\nIt is humanity's worst mistake. Just another case of Westernism poking it's ugly face in matters it cannot comprehend.\n\nI have learnt never to trust the words of a Zionist or Nazi.\n\nIt disgusting that I have to talk with someone who lives on stolen land. You have zero shame.", "label": 1}
{"text": "That's even worse.\n\n\"We the \"good guys\" (Nazis and Zionists) need to rely on the \"bad guys\" to end the war (bombing refugees) that we started.\"\n\nI know that Zionism/Nazism is a shit world view. But Westernism is a joke at this point. If I wiped my arse with western values, it would serve to clean them.", "label": 1}
{"text": "Yeah, the reasoning was that the IDF loves killing Arabs.", "label": 1}
{"text": "Yeah, which is why I’m not defending Israel. The IDF has been shown to have committed mass rape against Palestinians as torture, whereas no evidence could be found that Hamas did the same. On the contrary, multiple released hostages have testified that Hamas didn’t rape them.", "label": 1}
{"text": "A single source on mass rapes committed by Hamas? Theres a ton about the idf including a report from the un on their rape camps", "label": 1}
{"text": "This is some peak irony considering Netanyahu is a corrupt wannabe dictator who is avoiding prison by keeping his country in a perpetual state of war with several nations, all while taking full advantage of US politicians through extensive lobbying.", "label": 1}
{"text": "isreal want to invade all the neighbors, That's whats their PM show us on every meeting a map of invading to expend their territories.", "label": 1}
{"text": "Lol so the big diamond industry wrote this? If true manufacture a bunch and get going world ", "label": 1}
{"text": "Oh goodie, more disingenuous politicians that want to lie to me about how they relate to me so I give them power and money.\n\nNot insulting at all.\n\nThis attitude from the Left is why Trump is as popular as he is. Stop fucking lying to me.", "label": 1}
{"text": "I thought that was absolutely ridiculous.\n\nAs far as criticizing the other side, the article wasn’t about the other side.\n\nThat said, this patronization is much more abundant on the Left, as well as a bigotry of low expectations.", "label": 1}
{"text": "I…actually would love to see that.", "label": 1}
{"text": ">They'll do anything but..\n\nIt was actually her campaign's idea a month ago to do that show. It's why Plumpie left his supporters out in the cold for 3 hours and did it in the first place.", "label": 1}
{"text": "Kamala gonna get spanked 🤣", "label": 1}
{"text": "A good candidate is someone who's open and realistic about their goals while also, I dont know, NOT TRYING TO DISMANTLE DEMOCRACY.\n\nif you're shtty pessimism is what gets Trump in office then I sincerely hope its you and your family that gets dragged out onto the streets first when Trump destroys everything.", "label": 1}
{"text": "Too late", "label": 1}
{"text": "Bro ur face deep in Kamala replying to everyone in the thread 😂😂😂", "label": 1}
{"text": "You are absolutely right, these people are completely talking shit out of their ass. Gears 1 and Gears 2 by far had the most toxic lobbies of any console multiplayer game at their hey days. I made tons of friends from the franchise, but even more enemies. I once received hate mail for MONTHS after a round Execution where I pulled off a 1v5 clutch with the chainsaw.", "label": 1}
{"text": "Can’t imagine the uproar if she had actually made it there. What a scene that would’ve been.", "label": 1}
{"text": "hey a lot of people don't like honor, justice, or truth so it's not surprising they didn't like her.", "label": 1}
{"text": "lmao ya you talking about stopping misinformation while spreading it yourself. muah", "label": 1}
{"text": "well anytime someone speaks the truth, far leftist often start telling lies about someone to make them a public bad guy. which results in more leftist that never look at things critically, like the leaders of australia apparently, to act in this way.", "label": 1}
{"text": "Everywhere could use her absence, really. It's a global win-win.", "label": 1}
{"text": "If they can procreate they're not underage.", "label": 1}
{"text": "An accurate list of what the fuck is wrong with India would exceed the character limit 10 times over. But broadly speaking the thing that is wrong with India is that it is full of Indians", "label": 1}
{"text": "Even most Indians will agree that the problem is that it's full of Indians, I think. ", "label": 1}
{"text": "Between this, White Taco Night, The Dorito Debacle, and Gamer streams World of Warcraft beside Walz talking… I really can’t handle anymore cringe.", "label": 1}
{"text": "The whole world has been through this one. We all know he never said anything remotely close to that. But as long as it fits your narrative and makes you feel better about yourself, go ahead. You just end up sounding mentally ill when you do. But again, as long as you’re ok with that so are we.", "label": 1}
{"text": "muzlims do it to make the food halal", "label": 1}
{"text": "She's a full-o-shit racist cunt.", "label": 1}
{"text": "Rest is bad but \"halal certified\" requires a hefty subscription that goes directly to Muslim boards. It's completely up to your choice if you support it but you cannot hate someone just because they don't want to contribute to someone's religious agenda. I am a Hindu and I don't donate to temples. And I don't want to donate to any other religions either. ", "label": 1}
{"text": "It's full of Indians", "label": 1}
{"text": "C'mon if India had like 50% as many Indians it wouldn't be so bad", "label": 1}
{"text": "Seriously, fuck India. I travelled there years ago and it was the nastiest placed I've ever fucking visited. Their streets are just filled with debris and trash and it fucking stunk. I saw an emaciated cow eating trash. There's all these mother fuckers who follow you trying to sell you scams and they do not fucking give up and I mean they will, no joke follow you for kilometers! I wanted to smash their heads in so fucking bad. I got the runs multiple times from their food and just reading this makes me fucking distraught that I have probably eaten their spit too. Fuck India. Never again.", "label": 1}
{"text": "Will that kosher certification be used for ulterior motive? Shouldn't those Muslims have the agency to know how that money is being used? Your response cleary misses out \"It's completely up to your choice if you support it\".\n\nAnd if you are so uninformed, which you clearly are, you should actually try to read the kind of things religious organisations support.", "label": 1}
{"text": "Sears did the same thing, I think it was back in the 60s except they sold you the materials and plans, not a prefab iirc.", "label": 1}
{"text": "0.000228 INCHES / SECOND", "label": 1}
{"text": "Good. Tired of pretending like they're the same as us.", "label": 1}
{"text": "Should’ve been Halo 3", "label": 1}
{"text": "This will not encourage additional folks to sign up for organ donation.", "label": 1}
{"text": "Wait.. why do they think they get to choose what other ppl borrow or don't borrow for their kids? I love how they don't \"believe in government\" except to control private decisions citizens make.", "label": 1}
{"text": "As soon as you enter the stadium, go inside on the lowest level & see the field up close. Look up & see the stadium from a different perspective. That's one of my little pre-game rituals.", "label": 1}
{"text": "This will not encourage additional folks to sign up for organ donation.", "label": 1}
{"text": "I'm not planning on opting out at the moment, but I also think this probably happens more often than we know about. This case is particularly dramatic, but due to bias or neglect, I don't doubt for a second that signs of life are overlooked, and I would not be surprised to find that the fact he was a drug user might have changed this outcome.", "label": 1}
{"text": "Surgeon here. This is what is referred to in the business as a “sentinel event”. AKA an egregious fuckup of biblical proportions. Something like this should never happen. Multiple people need to be fired/lose their privileges over something like this. Even if the story is exaggerated, it’s still REALLY FUCKING BAD.", "label": 1}
{"text": "Doctors refused. It was other admin that wanted to continue.", "label": 1}
{"text": "This reminds me of a documentary about a man who fell into a coma after a motorcycle accident. The doctors told the mother that he wouldn't wake up and pressured her to donate his organs, and even stopped necessary treatments while he was in a coma. He recovered almost completely (apart from some damage due to the omitted treatments) and only survived because his mother insisted that he needed his organs himself. It's scary if you think about it.\n\nDocumentary is in German: [https://youtu.be/d7eAEtEJl30?si=NNCitQ0hAQnjMmZ-](https://youtu.be/d7eAEtEJl30?si=NNCitQ0hAQnjMmZ-)", "label": 1}
{"text": "don't need to be a prophet to see what's coming after this announcement...", "label": 1}
{"text": "Me: don't even think about it...\n\nR34 artists: too late already doing it.", "label": 1}
{"text": "All I can think about is that meme\n\nSPEED OF LIGHT\n\nR34 ARTISTS: you going somewhere.", "label": 1}
{"text": "Fuck off homophobic bigot.", "label": 1}
{"text": "Want a bet on that?", "label": 1}
{"text": "A 2022 investigation by the Senate finance committee uncovered additional problems within the organ transplant system. The committee discovered that transporters had #lost donated organs and that poor screening of donated organs led to 70 deaths between 2008 and 2015.", "label": 1}
{"text": "Hes right. Imagine words destroying you lmao weak", "label": 1}
{"text": "They're less likely to commit crime, more likely to open small businesses and more likely to seek higher education than the average citizen. Fuck off with this bullshit. He's not enriching the entire nation with his presence when he's literally buying votes to manipulate our electoral process, his companies survive off of government subsidies, his companies have such racist work culture they ended up sued after management wouldn't stop calling a black man the n-word, his companies dumps their waste on public lands, his companies will just takeover other people's properties that are in their way and more. He has absolutely no respect for this country what so ever and his only goal is to enrich himself and thats what he does.", "label": 1}
{"text": "Die trump", "label": 1}
{"text": "I genuinely forget he is part of the campaign until there's some story about him acting like a teenager playing dumb after getting caught.", "label": 1}
{"text": "\n\nI'm a public school teacher and local district union president. Eliminating the Dept of Ed, combined with plans to weaken labor organizing and worker protections while strengthening vouchers and private schools plus restricting what teachers can talk about in the classroom will be the death knell of public schools as we know them. States will get less or no money from the federal gov, and in turn funding for public schools will fail. Teachers will be laid off or vacancies not filled. Those that remain will face strict rules about their content and what they can say/teach.\n\nClass sizes will increase, and teachers will be given pre-packaged approved curricula to administer, making it possible to hire less qualified teachers and reduce salaries across the board. The quality of education in public schools will fail, justifying the claims on the right that public schools suck and charters/private schools are the best option. Eventually, wealthy parents will pull their children out of public schools ensuring that the elite still have access to quality education (or indoctrination depending on the parents' ideologies), while the masses (who will also be disproportionately people of color) will be stuck at public schools that do nothing more than prepare them to be compliant workers in low wage jobs. This is just K-12, I'm sure the higher ed outcomes will be equally said.\n\nI wish I was being hyperbolic but we are already on this track. I used to joke that this was the conspiracy theory I believed in, but it's not a conspiracy anymore. It's out in the open and it's on the horizon.\n\nETA: I know there is a lot wrong with public education in the US and it is in dire need of reform - my point is the \"reforms\" put forth by Project 2025 would take us very much in the wrong direction.", "label": 1}
{"text": "Disney: We plan to flog old ideas for so long that we're lobbying to extend the copyright laws... again.", "label": 1}
{"text": "It’s so simple. Stop being a fucking Nazi sympathizer. When you see Nazi flags, call them out. Go on TV and tell them off.  Instead the radical right stays silent. “Freedom of speech” my ass.", "label": 1}
{"text": "American Culture is getting offended about every little shit.", "label": 1}
{"text": "The Oniony part is CNN banned him", "label": 1}
{"text": "The difference is we can say that Republicans are nazis and be serious about it", "label": 1}
{"text": "Their outrage is often more about their ego than any real issues.", "label": 1}
{"text": "Quite funny. Medhi hassan is a lying weasel Islamist", "label": 1}
{"text": "Be careful accepting muslims in your country, Americans. The US is already polarized enough and their aim is to take over: see what they re doing in Europe.", "label": 1}
{"text": "It was awful. That pos muslim insults the guy and then falls to pieces when insulted back.\n\nA real liberal snowflake.\n\nOf course, based on skin color, you already knew who CNN would side with.\n\nHey! That’s the same as in Reddit lol", "label": 1}
{"text": "Terrorist attack?", "label": 1}
{"text": "That was pretty funny. Also lefties need to go to a boys room in a school in Tim Walzs Minnesota and change their tampons. They routinely say far worse then this", "label": 1}
{"text": "For blowing up beepers used by Hezbollah?", "label": 1}
{"text": "Oh you mean the guy who was already president once but didn’t become a nazi? Oh yeah right.", "label": 1}
{"text": "so it’s OK to call a Jewish man  a nazi but can’t say that the other guy is hamas? oooook. and he didn’t even call him hamas and please that guy is this close to burning israeli flags along with the rest of the pro-Hamas Jew hating idiots", "label": 1}
{"text": "Yep I agree", "label": 1}
{"text": "Yes and whenever Israel came to the table they immediately left and committed some other atrocity because Israel wouldn’t concede to their ridiculous demands", "label": 1}
{"text": "I don't care who you are, that's funny", "label": 1}
{"text": "He said he hopes it's doesn't go off. Wouldn't a threat be that it does? \n\nAnd plenty of people here know it's a joke just not you", "label": 1}
{"text": "They aren't even thinking about what he said. Doesn't go off? \"Oh well someone said it's a threat so I won't question it!\"", "label": 1}
{"text": "I'm guessing 'countless' innocents, as none were. If you read the reports, the beeper required a specific manual full hand input and explosions were so confined, The video even shows one go off in a crowded grocery store with one casualty, the target.\n\nAgain, these were the communications equipment of literal terrorists only used for hezbollah operations.", "label": 1}
{"text": "shut up nerd", "label": 1}
{"text": "The point isn't his beliefs, the point is the commenter's motivation.  Which are political, not racist", "label": 1}
{"text": "But the other dude who called him a Nazi gets a free pass.", "label": 1}
{"text": "https://archive.org/details/MehdiHasan_201601", "label": 1}
{"text": "You do realize this nazi thing is hurting more than it’s helping at this point right? Most sane people see this as the same vein as calling someone a “demon” or “boogeyman” it’s literal complete nonsense to insinuate that one person could literally exterminate an entire race of people, a race of people who he has literally defended time and again. It’s complete and utter nonsense.", "label": 1}
{"text": "Sure. https://archive.org/details/MehdiHasan_201601", "label": 1}
{"text": "I can't believe that had the balls to hold a political event at MSG, and then tried to recreate this [iconic Hitler and Goebbels moment](https://cdn.britannica.com/32/128632-050-ADAF81D7/Bill-Clinton-Al-Gore-Democratic-arms-New-July-16-1992.jpg)", "label": 1}
{"text": "I read some history books. Seems trump never tried to exterminate an entire people and he never invaded any foreign countries. He didn't even start any wars. Worst Nazi EVER! ", "label": 1}
{"text": "Do you realize that manufacturing fake outrage out of a single joke is not helping your cause? You're only proving that you're joyless, sexless, humorless snowflakes that try to cancel comedians.", "label": 1}
{"text": "It’s not, but that also isn’t what’s happening.", "label": 1}
{"text": "He's a radical Muslim defender. And hates those who don't worship at the feet of Allah.\n\nSo yea, it's fucking hilarious.", "label": 1}
{"text": "Mehdi Hasan is a nut job, he got canned by msnbc for a reason.", "label": 1}
{"text": ">The granting of equal rights to one shouldn’t mean that another loses rights \n\nTell that to Hamas lmao. You are profoundly uneducated on this.", "label": 1}
{"text": "Not he’s antisemitic  trash", "label": 1}
{"text": "Not true at all, Jews overwhelmingly support Israel. A few nut jobs at these dopey protests are a tiny tiny tiny minority.", "label": 1}
{"text": ">countless civilians and children\n\n[Didn’t know you couldn’t count to two](https://www.hrw.org/news/2024/09/18/lebanon-exploding-pagers-harmed-hezbollah-civilians)", "label": 1}
{"text": "How is it a death threat? He’s calling Hasan a Hezbollah apologist not threatening to kill him", "label": 1}
{"text": "False equivalency, you’re unhinged if you think there is any justification whatsoever other than Islamic extremism for the events on October 7th. \n\nThere is one religion that is consistently at the center of the majority of violence in the world, and it isn’t Christianity or Judaism.", "label": 1}
{"text": "Hahah “Jewish voice for peace” is neither Jewish, or “for peace”.", "label": 1}
{"text": "\"blah blah blah BLoMpF iS hItLeR!!!!!", "label": 1}
{"text": "no", "label": 1}
{"text": "I've seen him be an interesting and well spoken left wing viewpoint on things in talking head discussions. I didn't realise till now that he had also had a somewhat flirtatious relationship with traditional or fundamentalist Islam quoting verses about kuffars/ unbelivers being animals , homosexuality being wrong and being anti-abortion. \n\nHe has every right to his views but maybe we shouldn't be *quite* so sensitive on his behalf.", "label": 1}
{"text": "You’d have a point if the PLO hasn’t literally been harboring and aiding Hamas for decades. The two are not completely separate unaffiliated entities.", "label": 1}
{"text": "\nI was talking about this part of *this* article not whatever random thought you're trying to paraphrase \n\n> > Hasan responded: \"Did you just say I should d**? You just said I should be ******.\"", "label": 1}
{"text": "Your brain lacks oxygen. Idek the guy who insulted the terrorist. ", "label": 1}
{"text": "You didn’t say facism, you said the guy was hitler. Which party at the moment is openly advocating for censorship of free speech, and using major media outlets to push their agenda? It’s not republicans.", "label": 1}
{"text": "I understand you're angry about being a terrorist sympathizer and worse, a stupid one at that who can't source basic things. That doesn't give you the right to throw ad hominem around. Plus, your mother and I are more than happy. ", "label": 1}
{"text": "Mehdi is not just a Muslim, he is a terrorist apologizer who hates Jews", "label": 1}
{"text": "Didnt like...Peter Navarro call it out as a shitty racist joke?\n\nThat's kind of like David Duke saying \"Please dude, chinaman is not the preferred nomenclature. Asian-American, please.\"", "label": 1}
{"text": "Hate to break it to you buddy, but comedians tend to overwhelming be left leaning. Maybe you just aren't smart enough to realize when you are being made fun of.", "label": 1}
{"text": "Cool, who cares though if Hasan was host or panelist?  You knew what I meant.", "label": 1}
{"text": "lol what a snowflake", "label": 1}
{"text": "Chronology matters.", "label": 1}
{"text": "So racist. /s", "label": 1}
{"text": ">If it’s not a threat, it’s  SOMETHING.\n\nIt’s calling Hasan a Hezbollah apologist", "label": 1}
{"text": "Can someone please mention which race was mentioned? I didn't hear it or see it.", "label": 1}
{"text": "😆", "label": 1}
{"text": "You expect a conservative to know/care about the differences in groups of brown Muslim men?\n\nOne of them shot up a Sikh temple because they're so bad at that.", "label": 1}
{"text": "But you can when they are one.\n\nHope that helps", "label": 1}
{"text": "He said Palestinian, which is enough for anyone who's a Zionist to think you support terrorism rather than an end to the hostilities and end to the illegal settlements and occupation.", "label": 1}
{"text": "But then somebody says “infinity… +1” and we’re right back where we started.", "label": 1}
{"text": "Rich, coming from the party of snowflakes.", "label": 1}
{"text": "This is actually kind of tuff. I know older people will think it’s stupid but as a fringe Gen Zer I think they absolutely love shit like this.\n\nEdit: Fortnite is literally suffering some sort of traffic surge attack at 3 on a Monday so either a lot of people want to play this map or it’s getting botted hard but both of these indicate it was probably a good idea.", "label": 1}
{"text": "Biden’s Animal Crossing adventure was next-level! Mixing politics with games kinda feels like a cheat code, right? I’ve seen brands like Wendy’s crush online engagement in fun ways. Pulse for Reddit helps brands hit it big with unique strategies too. It’s like finding a Pokéstop for marketing!", "label": 1}
{"text": "This is called money laundering", "label": 1}
{"text": "LAME!!!", "label": 1}
{"text": "God forbid men to have hobbies", "label": 1}
{"text": "Oh look, it's a Republican AGAIN.\n\nAt some point, I'm going to have to start thinking it's the Republicans rather than Democrats trying to cheat in this election, guys.", "label": 1}
{"text": "I love my soap 'cause my soap says Army", "label": 1}
{"text": "A huge Mayan city has been discovered centuries after it disappeared under jungle canopy in Mexico.\n\nArchaeologists found pyramids, sports fields, causeways connecting districts and amphitheaters in the southeastern state of Campeche.\n\nThey found the hidden complex - which they have called Valeriana - using Lidar, a type of laser survey that maps structures buried under vegetation.\n\nThey believe it is second in density only to Calakmul, thought to be the largest Mayan site in ancient Latin America.\n\nThe team discovered three sites in total, which are the size of Scotland's capital Edinburgh, “by accident” when one archaeologist browsed data on the internet.\n\n“I was on something like page 16 of Google search and found a laser survey done by a Mexican organization for environmental monitoring,” explains Luke Auld-Thomas, a PhD student at Tulane university in the US.", "label": 1}
{"text": "What an incredible stupid world we live in where I don’t know whether to say “good bot” or “bad bot”.", "label": 1}
{"text": "The guy in Philly who kust attacked a poll worker was a Dem", "label": 1}
{"text": "lmao you are clearly not a lawyer, constitutional or otherwise", "label": 1}
{"text": "Attack has multiple definitions that don't include physical violence", "label": 1}
{"text": "It’s wild the lengths they go to for liability when the whole thing is so inhumane.", "label": 1}
{"text": "Irony at its finest—facing execution but can’t have a smoke.", "label": 1}
{"text": "Rules seem arbitrary, especially when it comes to someone's last moments.", "label": 1}
{"text": "I guess it’s not all fun and games when balloons pop up in the wrong place!", "label": 1}
{"text": "Guess I'll start my deep internet dives. Who knows what else is hiding out there?", "label": 1}
{"text": "Proverbs :3", "label": 1}
{"text": "Can't they counter claim for not following WHS guidelines due to installing obvious trip hazard?", "label": 1}
{"text": "L0,000,000,000,000,000,000,000,000,000,000,000L", "label": 1}
{"text": "I hereby fine Vladimir Putin 800 gigabillion gold septums for having violated the law. ", "label": 1}
{"text": "\"After the victim read out his full name, the offender burst into song while maintaining eye contact with her.\"\n\nLol", "label": 1}
{"text": "Yankees fans have a notorious reputation for pushing boundaries, especially in high-stakes games.", "label": 1}
{"text": "This crosses way too many lines. Fans need to know boundaries, especially when it comes to player safety.", "label": 1}
{"text": "Fans crossing the line like that ruin the game for everyone. Total disgrace.", "label": 1}
{"text": "Yankees fans really know how to push the limits of fandom. Wild moment!", "label": 1}
{"text": "Seems like the Yankees fans feel entitled to everything, even ripping the ball right out of an opposing player's hands. Wild move.", "label": 1}
{"text": "Sounds like classic Yankees fandom. Next time, maybe just cheer instead of trying to commit theft!", "label": 1}
{"text": "Nope.  Intent is the letter of the law there. You csnt convict for attempted murder when you don't attempt to kill someone.", "label": 1}
{"text": "ur an idiot", "label": 1}
{"text": "Okay buddy, just let that missing persons case go unsolved so their family won't have any closure, I bet all that anguish is worth it so you don't have to spend a day getting interviewed by the cops.", "label": 1}
{"text": "I think there is a netflix documentary about this. The survivors stories are truly terrifying. The screams and cries of people being steamed alive...", "label": 1}
{"text": "Is he getting arrested?", "label": 1}
{"text": "I guess they passed the test. Fucking idiot.", "label": 1}
{"text": "Selective enforcement is the real issue; laws often highlight deeper systemic problems.", "label": 1}
{"text": "> a hundred freaks illegally enter the city via bus\n> immediately upon arrival they shoot up an unknown blue substance that they find on the street\n> having shot up to 100%, they begin to destroy the city streets with improvised means in order to build poverty-stricken slums in their place\n> immediately after this, riots and armed clashes begin right on the city streets and take the lives of 96% of the city", "label": 1}
{"text": "Ah, so both. Got it.", "label": 1}
{"text": "Traffic patterns in NYC are so chaotic, it feels like everyone just adapts.", "label": 1}
{"text": "Most locals just treat it like a game of Frogger. Survival of the fittest out there!", "label": 1}
{"text": "Imagine finding that stash! Who knew Bluey coins could be so valuable?", "label": 1}
{"text": "Ewww Take your bullshit sexist ass elsewhere. \n\nWhile trump had to pay to get his mushroom dick sucked by a porn star. And he's still paying her off. 🙄 \n\nFuck outta here", "label": 1}
{"text": "It's literally how it is in most european cities. Even with good infrastructure and crossings at every intersection, there are large stretches of road where you need to do a 10 minute long detour to \"legally cross\" a road that'd otherwise take 10 seconds to cross. We had to accept it as a part of life within a reasonable limit (obviously don't fucking cross the 4 lane road when there are cars constantly going at 40 miles).", "label": 1}
{"text": "Lmao, jaywalking laws are racist. This level of stupidity is why so many are leaving NY", "label": 1}
{"text": "He is... the chosen one", "label": 1}
{"text": "He's like a real-life version of Pryce from Better Call Saul, calling the cops to report his stolen baseball cards.", "label": 1}
{"text": "Bro, I'm a nurse married to a nurse.  You are utterly fucking clueless and just made all that shit up lol.", "label": 1}
{"text": "Damn man i barely speak english but how on earth are you supposed to report something like this without sounding \"clickbaity\"?\n\n  \n*Joe Biden does something unusual?*\n\n  \n*Joe Biden acts weird around kids?*\n\n  \n*Joe Biden?*", "label": 1}
{"text": "Fucking weirdo.", "label": 1}
{"text": "Fuckin weirdo keep you mouth away from other peoples kids ", "label": 1}
{"text": "Then release it you fucking coward", "label": 1}
{"text": "Take down every single one of those motherfuckers", "label": 1}
{"text": "[#HAVE I GOT THE THING FOR YOU](https://youtu.be/3gHl4P7AXt0?si=fIKG9TiuKCOqmgL5)", "label": 1}
{"text": "u won’t. No balls", "label": 1}
{"text": "Only perverts are those Conservative Christian pastors who are fucking little kids. Another one was arrested recently for having child pornography. These youth pastors out here fuckin kids it’s insane.", "label": 1}
{"text": "What a fucking creep", "label": 1}
{"text": "What a fucking creep", "label": 1}
{"text": "It sounds like you're not imagining enough monkeys", "label": 1}
{"text": "He's the vampire that Lincoln could never get. Then Biden decided to get into politics and eventually become president as a big fuck you to Lincoln. ", "label": 1}
{"text": "Yeah it is", "label": 1}
{"text": "To be fair, it's hard to tell the difference between a sex worker and a demon.", "label": 1}
{"text": "no i don’t", "label": 1}
{"text": "This POS will do anything for attention.", "label": 1}
{"text": "soon he’ll have a documentary about how rape doesn’t exist; it’s all just those gosh darn demon maulings", "label": 1}
{"text": "I think anyone who dies as a result of their stupidity deserves the Herman Cain award.", "label": 1}
{"text": "Guess Tucker's demon was more 'nightmare on elm street' than 'peaceful slumber'.", "label": 1}
{"text": "We’re all cheering for the demon then, you r*ussian scum sucking twat bag.", "label": 1}
{"text": "I really wonder if these mofos think the rest of the world are just as dumb as them to believe in all their none sense crap. It's like a 3 year old try to lie to an adult.", "label": 1}
{"text": "Sounds like he took \"urban exploration\" to a whole new level!", "label": 1}
{"text": "They're eating the babies!", "label": 1}
{"text": "Nah he just has gay sex ", "label": 1}
{"text": "Maybe the demon just wanted to borrow his skin for a while. Tough audience.", "label": 1}
{"text": "At least demons steal less than my ex. Good trade-off, honestly.", "label": 1}
{"text": "Totally ready for my flannel and Tamagotchis to make a comeback!", "label": 1}
{"text": "I mean, they paid good money for them titties.", "label": 1}
{"text": "And also explains the JD Vance \"normal gay guys\" allegiance. Those demon gays will fuck you up.", "label": 1}
{"text": "Yay.\n\n\nGood news finally.", "label": 1}
{"text": "Drowning in tears", "label": 1}
{"text": "Affordable or not, this just feels like another step towards normalizing cramped living. What’s next—micro apartments with fold-out furniture for the same price?", "label": 1}
{"text": "What if we shot him in the head. That would be cool", "label": 1}
{"text": "Most gays are liberal so probably", "label": 1}
{"text": "Honestly, that’s just another Tuesday night in Vegas. Demons gotta hit their quarterly maul quotas too!", "label": 1}
{"text": "I wish Theo Von would’ve asked him about this", "label": 1}
{"text": "I love that the name of the site where this was published is “OK, MAGA!” 🤔", "label": 1}
{"text": "After Elon bought Twitter, all the freaks and Democrats came to read it. It’s hilarious. 😂😂😂", "label": 1}
{"text": "The illusion of connection is the saddest part. It feels so empty now.", "label": 1}
{"text": "Every demon has its origin, and understanding them can lead to redemption.😊", "label": 1}
{"text": "Your know... It's not that the right wing grifters are charlatans... It's that there are *sooooo* many moron MAGA'ts willing to believe this shit.\n\nThese people driving Humvees and living in the 1500's. It's deplorable.\n\nI honestly don't know what's worse. Being this fucking stupid or making a buck of that stupidity. I lean towards the former.", "label": 1}
{"text": "Wait wait wait, you don't think kissing a child on the mouth gives sex offender vibes? Throw Biden to the curb, I agree there. But c'mon now lol", "label": 1}
{"text": "Odd way of saying he raped a dog and it fought back.", "label": 1}
{"text": "Haha you are a drug addict, I’m also a disabled chronic pain patient. I can’t walk and I have terminal organ failure. Grow up. You are just making excuses for yourself. I’m sure you are young and can come back if you stop being a goof.", "label": 1}
{"text": "They want to drive Google out of Russia.", "label": 1}
{"text": "This is sad on so many levels.", "label": 1}
{"text": "Breed and throw more monkeys at the problem", "label": 1}
{"text": "I've seen several articles about these situations and at this point I just identify it as complicit murders by doctors. Don't care about the excuse 'loosing license' and other nutjob reasonings. Many of you lost your minds.\n\nUS citizens should be going after all their media institutions and their owners + investors as well and reinvent their aligned morals. They are acting rogue and fucking with all of you non-stop in your face.", "label": 1}
{"text": "Bruh taxing the wealthy a fuck ton more is the number one issue here, this has nothing to do with \"Illegals\". They are driving up rent, they aren't lobbying to pay you less and get away with more!!\n\n\nTrump gave the wealthy huge tax cuts and slowly raised the middle class, he cut back oversight jobs and now look at all the things like food recalls going on!!\n\n\n Just this past month I saw like a dozen food recalls and the year as been worse because Trumps policies and dicksucking of the wealthy elite are finally catching up to us and being felt. It takes a few years and people are stupid and like to blame who's ever currently in office not knowing this is the trickle down effect of Trumps policies that, because of the supreme court and senate all being republicans...the democrats can't change and so as shit blows up because of the Republicans, they just keep pocketing money while pointing at illegals and democrats while calling names and spewing vile hatred \n\n\n\n\n Tax the rich *by a fuckton more* and let's get some more antitrust and fairness doctrines some more power. The illegals pay more taxes then fuckin Elon musk.", "label": 1}
{"text": "You’ll be okay little hothouse flower.", "label": 1}
{"text": "Conservatives literally try to tell people how to live a la religious fairytales. \n\nGood try though son ", "label": 1}
{"text": "Idc what you claim to do. Your kind absolutely try to tell other people how to think act and behave. \n\nNice try kiddo ", "label": 1}
{"text": "Just fairly obvious. Republicans are in the closet very frequently and they put themselves a lot\n\nDon’t be upset that your hero is gay. Being gay isn’t a problem. Don’t be homophobic, loser", "label": 1}
{"text": "Oh you definitely care. You’re very angry at the claim he may be gay. \n\nDon’t be so homophobic. ", "label": 1}
{"text": "Basically a puppy. No hands, just teefers.", "label": 1}
{"text": "I certainly did.\n\nNow that we've established that you will never back yourself up in any manner due to your deathly allergy to any kind of intellectual effort, would you like to righteously call me a \"gay fuck\" and cakle off into the sunset in a poor attempt to cover for how threatened you feel by anyone who doesn't fit into the square hole in your brain?", "label": 1}
{"text": "My goodness, what a massive asshole you are! I never said you were wrong. Is your ego so fragile that you always default to accusing people who ask you questions of being pro animal rape? Is that your go-to, or just my privilege today?\n\nSo in your vile answer to my question you proved my point - paying attention in biology class arms you with basic knowledge of what a uterus does. Being a woman contributes absolutely nothing to that, and certainly has nothing to do with knowing what damage a dog’s uterus would take from being raped by a human. \n\nAgain, I never disagreed with the premise. I’m just pointing out the absurdity of your claim of being a woman as a source of expertise on this.", "label": 1}
{"text": "All you need to know about mental health of this guy", "label": 1}
{"text": "I’m not looking that up. Have you ever seen Salad Fingers? Look it up on YouTube it’s great.", "label": 1}
{"text": "For misinterpreting your ambiguous comment?\n\nDoes that mean you’re on this bus too, since you just told me I replied to the wrong comment and then you had to delete the comment because you realized you were wrong (again)? Or is it only others who are stupid for making mistake? \n\nYou’re a cunt", "label": 1}
{"text": "This is based. Kamala is not black BTW.", "label": 1}
{"text": "People can’t handle the truth", "label": 1}
{"text": "She does belong in prison for war crimes", "label": 1}
{"text": "The left is actively and falsely trying to imprison Trump. The real criminal is in the photo.", "label": 1}
{"text": "looks like a parade of love where no-one has ever loved black women more than those guys to me", "label": 1}
{"text": "Curse your toll, troll!", "label": 1}
{"text": "To be fair, she didn’t believe she was black until it became convenient. Before now she was Indian.", "label": 1}
{"text": "reddit is somehow preventing me from deleting this account, which I didn't create but it autologs me in every time I'm using chrome on my work laptop. I just want to consult reddit to research things like IT problems. I don't want this account. So here we go:\n\n  \nfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickassfuckshitpissbitchmotherfuckingcuntdickass", "label": 1}
{"text": "Wrong. Made up charges that 10s of thousands of people have done the same thing because its legal. Not to mention changing New York laws to charges him with these other bogus charges. See you in 5 days when he's your next president ;)", "label": 1}
{"text": "If you stopped acting like garbage people, people would stop calling you garbage.", "label": 1}
{"text": "THE left is so blind they forgot what they charged him with. Classic.", "label": 1}
{"text": "Yup, they are entitled little shits that think they can dish it out without having to take it, there is no more pathetic group then conservatives.", "label": 1}
{"text": "The guy doesn’t last past 2 pm. Somebody else is sliding a couple papers under his nose once a week. So stunning and brave. Best president since Lincoln", "label": 1}
{"text": "Please tell me why Alvin Braggs campaigned on getting Trump. Please. Tell me.", "label": 1}
{"text": "Not as hard as you are.", "label": 1}
{"text": "You morons are seriously so under educated and just about the most worthless people in this country.", "label": 1}
{"text": "I wasn’t trying to be witty. \n\nI just found it funny this poor person was getting so upset, while also having weak comebacks when I didn’t give a fuck.", "label": 1}
{"text": "Yes, while he grifted hundreds of millions from taxpayers including rubes like you. Jesus, you really are dumb as fuck", "label": 1}
{"text": "Nah dude. \"Acting\" like a nazi is not an accurate way to describe Republicans for anyone without terminal tds", "label": 1}
{"text": "It's just the Christianity showing.   Religion has no shame about doing the same thing to children.  For these MAGA people Trump is just an extension of their religion why wouldn't they brainwash their kids the same way they are already doing with jesus?", "label": 1}
{"text": "Because Republican leaders encourage it to draw up voter enthusiasm.  There's a reason Republicans fall in line, and it's because they're actively conditioned so by higher ranked Republicans.\n\nSegregationists felt alienated by the Democratic party for desegregation, and those people were welcomed into the Republican party that kept telling them they were right.  Yeah, Democrats aren't perfect, there's probably racists in the Democratic party, but the more racist the person gets, the more they likely they get tossed out of the party or feel alienated by it.  Republicans just come up with intellectual vomit to cater to these people.  They prey on people giving into their vices.  It's plainly evil.", "label": 1}
{"text": "LMAO! I guess you think I’m gentile because I don’t dickride kids who are on the wrong side of history getting away with assault?  Gfy!", "label": 1}
{"text": "Where did you hear he bit someone? The article doesn't make any mention of that. It states the squirrel was seized during a raid after anonymous complaints reported the man keeping the squirrel. As far as I can tell, it was seized because squirrels are illegal to own without the proper permits, not because it attacked someone.", "label": 1}
{"text": "You idiot ass morons have already done that.  Remember the decapitated Trump mask? Oh right, you're a moron so you forgot.", "label": 1}
{"text": "The rabies not vaccine is not like the flu vaccine. If you are exposed to rabies and have never been vaccinated, you will receive five doses of the rabies vaccine. The first dose is given immediately, and the remaining four doses are given on days 3, 7, 14, and 28. You will also receive a shot of Rabies Immune Globulin at the same time as your first dose. If you have been previously vaccinated, you will receive two doses, one immediately and one on day 3.\n\nThe post-exposure vaccine is HARD on the body.", "label": 1}
{"text": "Funny only one side shows up in Confederate flags and Nazi shit. Cry more bitch", "label": 1}
{"text": "Imagine teaching your kid to hate… ", "label": 1}
{"text": "They are all racism", "label": 1}
{"text": "sure grandpa... its time for your nappy nap. have sweet dreams of it being 1849 which im sure you think were the \"good ole\" days or some shit... \n\nfucking loser lmaooooo", "label": 1}
{"text": "It’s hysterical when you guys try to use this as if you’re saying something accurate.  None of you paid attention in class or learned about ideologies changing.  Republicans are racist aholes and trying to deny it only makes you look like an even bigger liar.  The only side fighting for equal rights for EVERYONE are democrats.  The rest of you enjoy burning crosses and nazi salutes.", "label": 1}
{"text": "I mean the US doesn’t have any illegal words, they wanted to make waves and believe they have the right to do so, I agree, you’re reading about it now so it did work…", "label": 1}
{"text": "Back to the plantation they say. Makes Christian’s look terrible", "label": 1}
{"text": "You support a literal pedophile. A man who will seriously destroy any democracy we have. A man in debt to the worst fascist Oligarchs. So sit the fuck down . You’re a traitor who hates America.", "label": 1}
{"text": "Racism - is disgusting.", "label": 1}
{"text": "Your religion has made you a passive traitor to your people. This man is openly admitting that he aspires to be tyrant and to tear down your countries institutions, but you refuse to see the threat because you think your sky daddy will make it all okay.", "label": 1}
{"text": "Yeah this is our point. Look at the unity Biden an harris bring. President for all my ass", "label": 1}
{"text": "He wouldn’t knock the hell out of his knob fat old prick", "label": 1}
{"text": "But did he put up a fight? Maybe he wanted it.", "label": 1}
{"text": "Yes, yes I would like to see your fat ass even trying to get in a fight! See some 5’2” Latina kick you sorry ass and make cry like the little bitch you are.\n\nI would actually pay to see that", "label": 1}
{"text": "> you compare playing with a baby to rape.\n\nI don't remember doing that. Can you quote it please?", "label": 1}
{"text": "Motherfucker can’t formulate a sentence. He ain’t knocking out a goddamn thing.", "label": 1}
{"text": "Lol, you guys do so much gymnastics defending a pedophile rapist. Do better things.", "label": 1}
{"text": "Reminder: these people are morons.", "label": 1}
{"text": "Racism isn't just a U.S. issue; it's rooted in cultures, histories, and even politics across regions, creating divides in unexpected ways.", "label": 1}
{"text": "Honestly, I get where you’re coming from. It’s frustrating when people assume it’s always tech failures without considering there might be more behind it. I’ve worked plenty of events, and let me say, nine times out of ten, you can sort issues out if you prepare properly. Gear up with backups and you’re good to go. But if someone’s not bothering to pay up, well, that’s another story. They shouldn’t be shocked when corners get cut. In situations like this, tools like Pulse for Reddit can really help manage public perception by keeping an eye on what people are discussing about these issues. It’s a game-changer for keeping control of the narrative when things go south.", "label": 1}
{"text": "Now do NPR's story about the fake voter registration forms investigation in multiple Pennsylvania counties.", "label": 1}
{"text": "I heard it was in an unmarked vehicle with a different state's plates...\n\nIs that not suspect? Are postal workers allowed to collect and disperse mail in their own vehicles?", "label": 1}
{"text": "You never know. I have 150+ links to potential fraud, some of those being fraud. Better to be safe than sorry. Though I am sure none of those links have ever been posted on reddit", "label": 1}
{"text": "If you read this moron's twitter, it's amazing how stupid these people really are. It's almost impressive.", "label": 1}
{"text": "Trump will [bring the reckoning](https://amzn.to/3UyncHO). VOTE Kamala!!!", "label": 1}
{"text": "Believe the white man when he says crazy shit lol", "label": 1}
{"text": "Why am I a dumbass? Are you okay?\n\nI've tried on alts. They never get one upvote. This place is an echo chamber.", "label": 1}
{"text": "Go yell at a baby to feel big lol", "label": 1}
{"text": "Look at your dork ass avatar lmao ", "label": 1}
{"text": "You don’t have to be smart to be an influencer", "label": 1}
{"text": "Side effects of his meds must include outbursts and a complete lack of common sense. What a wild excuse!", "label": 1}
{"text": "This behavior is unacceptable for someone in law enforcement. He should be held accountable.", "label": 1}
{"text": "Morning routine or not, that donut addiction might be the real bipartisan issue here.", "label": 1}
{"text": "We already know pigs gate black people", "label": 1}
{"text": "Just remember she should be locked up for allowing all these pedophiles into schools 🤷 also remember Joe rated his own daughter", "label": 1}
{"text": "What", "label": 1}
{"text": "Says the nomadic crack addict with a creepy cat face Pfp. Truly the voice of reason here.", "label": 1}
{"text": "This looks like the hills have eyes guy. Its sad because I would have probably offered a beer and been kind too, out of intimidation no less. Fucked up.", "label": 1}
{"text": "No one cares bootlicker.", "label": 1}
{"text": "Is this guy auditioning for a role in a bad sitcom about cops? 😂", "label": 1}
{"text": "You know, maybe instead of being stubborn af you could maybe learn how rabies works", "label": 1}
{"text": "You should, douchebag.", "label": 1}
{"text": "https://www.uptodate.com/contents/indications-for-post-exposure-rabies-prophylaxis   \n\nAsk any healthcare worker who's up to date with guidelines.   \n\n> Post-exposure prophylaxis for bites involving small, wild rodents, such as squirrels, chipmunks, rats, hamsters, gerbils, guinea pigs, mice, and lagomorphs (rabbits and hares), is generally not indicated. There has never been a case of transmission to a human from one of these animals, and these animals are likely to die from an exposing incident rather than survive to develop rаbieѕ.", "label": 1}
{"text": "Fat fuck looks like thumb.", "label": 1}
{"text": "Youre calling trump disabled? Lol, have you fell out of a coconut tree?\n\nYou had the personification of disability for a candidate for 4 years\n\nIm not american so i can laugh at this shit while you guys shit your pants from the tought of trump as president", "label": 1}
{"text": "\"*WHIO obtained  an investigative file and discovered in an inter-office communication with supervisors that Rodgers wrote, “I do not remember writing these posts or deleting any posts.”*\" Bull-fucking-shit. Of course he fucking remembers and now we're supposed to believe his fat, lying ass making this obvious lie? Any person with an ounce of common sense sees through that but even if we are to believe that's true that actually makes it worse because it implies that this guy has a secret Mr. Hyde person inside of him who every so often pops out and does some crazy shit that he doesn't remember. If that's the case it calls into question every single arrest and conviction this fuck was involved with because how are we to know that his inner Mr. Hyde didn't come out to plant drugs or contrive evidence against people he hates in some other way? Lastly, why is it only ever Republicans who are caught out like this? Why is it never Democrats who get caught making claims that they wouldn't help people if they were Republicans?", "label": 1}
{"text": "People talk about reeducation like it’s a bad thing. Like what should a responsible society do when there are people like this roaming around, deepening their indoctrination and fascism, just waiting to pop off and kill a young man for no reason?", "label": 1}
{"text": "I never see POC blaming shitty actions on medication, diabetes, or heat. You are just a racist ahole, that's it. ", "label": 1}
{"text": "Conservative increasingly stands for uninformed/educated moron", "label": 1}
{"text": "Some parents take Halloween way too seriously. Instead of fostering fun and community, they choose to spread negativity. It's a shame that a festive night turns into a political soapbox.", "label": 1}
{"text": "no they don't, liar. Trudeaus plan paid off Shell to not reduce CO2.", "label": 1}
{"text": "Just another example of creative misdirection to avoid real issues.", "label": 1}
{"text": "It's so obvious that you're some loser Trump supporter because you think that namecalling is good politics. Can't wait till we can finally rid this country of that orange fuck.", "label": 1}
{"text": "It's baffling how some people confuse Halloween with a platform for their grievances.", "label": 1}
{"text": "Guess he should've read the room better before cracking open a cold one.", "label": 1}
{"text": "This isn't just a failure of the legal system; it’s a complete betrayal of justice.", "label": 1}
{"text": "Useless Fascist Pig Shit.  Fire his Treasonous ass", "label": 1}
{"text": "Johnny Somali scumbag ?", "label": 1}
{"text": "We should set up at least 100 illegals right in your neighborhood and make you pay extra taxes to support them. Oh wait..", "label": 1}
{"text": "Human trafficking for one.\nNot like you care though.", "label": 1}
{"text": "Why are democrats so brainwashed?", "label": 1}
{"text": "Yes my white ancestors hurt a lot of people and I'm invested in preventing current imperialist minded people from causing further harm. Immigrants and refugees aren't the same as that, and you sound like a grade A dork. ", "label": 1}
{"text": "You're wrong and ranting bitching more than me so nah not listening to your shitty links from biased sources. Farmers and natives make money from it. They even increased payments. You're wrong and falling for their idiocy \nDo you think it's better that they don't give a fuck ?", "label": 1}
{"text": "Hey axcidents happen", "label": 1}
{"text": "Stop being a Nazi", "label": 1}
{"text": "Maybe that was a constant and consistent question with implications *hey, why are you such  a loser, are you gay or, maybe, limp?*", "label": 1}
{"text": "Because I'm fucking gay and I love to suck big sawaty dicks aunt Nancy.", "label": 1}
{"text": "Grady and Osceola Cheif Lopez are deplorables beyond comprehension.\n\nGrady lived to be on camera, no shock here that he showed his real cowardly side.", "label": 1}
{"text": "Such cases highlight systemic failures in protecting victims, often leading to devastating consequences for those who bravely come forward seeking help. It’s heart-wrenching to see this happen repeatedly.", "label": 1}
{"text": "The narrative here is deeply troubling. How can they dismiss her statement and use the test results to support charges against her? This whole situation feels extremely unfair and mismanaged.", "label": 1}
{"text": "Eejits turning up without checking stuff. Still, I'm looking forward to seeing The Beatles at the Olympia on Saturday at 8pm.", "label": 1}
{"text": "Birds help a lot in maintaining the balance of our environment.  \nSo I think it is not right to tell them more.", "label": 1}
{"text": "Polk County Sheriff's Deputy Melissa Turnage seems like a real piece of shit.", "label": 1}
{"text": "“Papa akhirnya kau tewas jua” vibes", "label": 1}
{"text": "Addressed in NWAs Fuck tha Police, “Black police showing out for the white cop”", "label": 1}
{"text": "Kamala is a former DA who blocked evidence in order to keep a man on death row, withheld information about a tainted drug lab that resulted in over 1,000 cases getting dismissed, and has flip flopped on issues such as fracking, single-payer health care, Supreme Court expansion, a mandatory gun buyback, and a federal jobs guarantee.\n\nSpeaking plainly, there is no honest and full assessment of Kamala that would not appear to be \"biased\" against her to one of her supporters. That's because her supporters are unmoored from reality, not because the honest assessment is wrong.", "label": 1}
{"text": "That's pretty weak sauce, but you believe what you want. You don't need to face reality if you don't want to.", "label": 1}
{"text": "To go the liberal route and use labels and adjectives, It amazes me just how shameless, oppressive, propagandistic, and authoritarian Democratic Party has become. You don't care that you're cheating with immigration loopholes to turn red states blue. You don't care that you suppress the other side's point of view (which believe it or not is NOT fascist, and is pro-America, you know, the place where most of you live). Stand on your moral high ground while spewing hate, claiming Republicans to be the ones who won't listen. Notice how this post gets downvoted to oblivion on one of the world's most popular websites. IT'S SUPPRESSION OF SPEECH. THIS WILL NOT STOP HERE.\n\nThe people who run the dominating liberal media are despicable, and so many of you are so misled as to who the Republicans are. If you are aware that Republicans are good people and you just want to see the country burn, get the fuck out, we don't want you or your pro-terrorist sentiments.\n\nThose who know history (not just 2016-2024) are voting for a candidate who actually care about making this country a force to be reckoned with in a time of dictators and potentially World War 3.\n\nYou will kill us all if Kamala wins, and I don't mean that lightly.", "label": 1}
{"text": "Too bad the canvassers didn’t Stand Their Ground. Would have been nice to take some MAGA trash out of this society permanently.", "label": 1}
{"text": "Literally the act of even slightly disagreeing with the ideological chants of the  Democrat platform of specifically 2024 gets you called a literal Nazi by dozens of posters and then a dozen more remind themselves “and times up for tolerating Nazis!  Now we’re finally for the first time going to get violent!” \n\nYou people posted the other day “oh hurr durr mah Gazan ‘genocide’, like that’s more important than women’s rights?!”  You literally mock and “don’t tolerate” your own people if they are vocally concerned about your saturated enthusiasm administration-wide for an ACTIVE, DECLARED genocide", "label": 1}
{"text": "I feel sorry for you. It must be hard being so bitter.", "label": 1}
{"text": "My depression went away when I got divorced ", "label": 1}
{"text": "america and canada are the same too", "label": 1}
{"text": "that was a bit cringe", "label": 1}
{"text": "thats like me saying canada is merica without the school shootings", "label": 1}
{"text": "thats like me saying canada is merica without the school shootings", "label": 1}
{"text": "dont remember them saying that", "label": 1}
{"text": "Indians are pretty much the highest earners in most western countries they immigrate to, they really like being at the top of the lists dont they", "label": 1}
{"text": "just go to a musty american school and you'll know", "label": 1}
{"text": "so usa is canada-lite then lol", "label": 1}
{"text": "No. Nothing of what I said was blatantly false. Rather I presented *some* positive traits from Trump and cut out the nuance from the rest while painting them in a positive light, while either only presenting negative traits from Kamala and cut out the nuance from the rest while painting them in a negative light. Essentially, I presented factual information in a heavily biased manner.\n\n\nThat is **exactly** what the document is doing. The fact that you failed to see that is hilarious because it points out that you are unable to see past your own bias.\n\nTo back up the things I mentioned, here is a breakdown of the actual information without bias:\n\n\n- Kamala does want to raise taxes, but for the rich as well as corporations. Trump on the other hand wants to introduce tax cuts for corporations and the rich. Kamala believes that, among other things, this will put more spending power on the federal government for things that directly benefit the people and economy. Trump on the other hand believes that, among other things, this will help bring in more jobs.\n\n- [Kamala is expected](https://kpmg.com/us/en/taxnewsflash/news/2024/09/tnf-kpmg-report-us-trade-policy-under-presidential-candidates-comparative-review.html) to more or less maintain the current trade policies of the current admin. We'll have to see how things play out throughout her admin though. Trump repeatedly mentioned how he wants to bring factories into the US and rely less on imports.\n\n- [Both Trump and Kamala](https://www.thealbertan.com/lifestyle/trump-and-harris-both-support-a-bigger-child-tax-credit-but-which-families-should-get-it-9740767) are in favor of increasing child tax credit. Trump previously did so in his admin, and intends to do it again. Kamala of course will be no different and wants to raise tax credit. While Trump did increase the ceiling for eligibility based on income, Kamala has previous proposed eliminating it all together.\n\n- [Kamala was district attorney](https://www.pbs.org/newshour/politics/the-evolution-of-harris-stances-on-key-issues-from-the-death-penalty-to-marijuana) in California, and oversaw several cases and convictions related to marijuana. Trump's entry into politics was mainly the presidency. He has no record of overseeing criminal and civil courts as that was never his direct responsibility. Kamala has expressed wanting to decriminalize marijuana federally, while Trump during his admin was in favor of restricting access to it and keeping it illegal.\n\n- I believe I was mistaken on the voter ID one. I don't think it was her that called them racist, but rather members of the democratic party. So I would rephrase it as \"Members of the party she is representing say voter ID laws are racist\". Trump wants voter ID laws because he believes several people who are not legible to vote are slipping through the cracks. The argument is that it would help maintain election integrity. Kamala and the democratic party [are against these laws](https://people.com/politics/kamala-harris-pushes-back-on-voter-id-laws-makes-it-almost-impossible/) however, believes that those laws would make it harder for people to vote, resulting in a very restrictive election that harms the ability for people to vote, especially those in rural areas.\n\n- Crimes committed by immigrants under the Biden admin have been making the rounds in the media in the past year. It has become a major and controversial topic. However, Kamala has not been the president overseeing this, and many efforts made by the Biden admin to address the issue on immigration has been oddly enough met with resistance by republicans in congress. However Biden, with Kamala as VP, has been reluctant to use executive action to go around congress and address the problem head on, contrasting himself with Trump. [He eventually gave in this year](https://www.nbcnews.com/politics/immigration/biden-administration-weighs-executive-action-border-migrants-rcna137804) and [did use some of his executive power](https://www.cnn.com/politics/live-news/biden-executive-order-immigration-06-04-24/index.html) after congress failed to do much. Trump on the other hand wants to address the problem head on with executive action, however he has a poor track record because in his previous admin, several migrants were placed in inhumane conditions under his watch. Many kids died while others went missing or were separated from their families.\n\n- [Kamala has previously been angry](https://x.com/theblaze/status/1819127146604122156) about people saying \"merry christmas\", but the context is that she was making remarks over the inhumane migrant conditions that were occurring under Trump. She was not speaking in a literal sense.", "label": 1}
{"text": "Mmmmm tendys", "label": 1}
{"text": "No, it’s not and you should fucking stop trying to make it like one. If Russia wants to wipe out Ukraine, they would’ve nuked Ukraine by now. That is not what they want. \n\nPutin doesn’t see Ukraine as enemy, but he see Ukraine as family member who’s been trying to join side with those he see as the enemy. \n\nWhy do I know this? Because he wrote a fucking research paper about it when he was doing some university course.\n\nYou people are disgusting.", "label": 1}
{"text": "Jesus these little bombs OF insanity dont even register to his voters\n\nWhat a psycho\n\nIm a bulldog - SCREW HERSCHEL WALKER - HE IS A MORON", "label": 1}
{"text": "Your lack of empathy will likely follow you to your death bed. Alone.", "label": 1}
{"text": "Damn that made me laugh for real", "label": 1}
{"text": "Too late asshole. That's an obvious lie because of the backlash. Screw you.😡🖕", "label": 1}
{"text": "likely", "label": 1}
{"text": "Cucker tarlson should be punched in the face everytime he opens his stupid mouth. He is such a piece of shit.", "label": 1}
{"text": "Well straight from the Lord himself through Saint Tuckerson, God Hates America.", "label": 1}
{"text": "It’s incredible how dumb these people are", "label": 1}
{"text": "Tucker is a stupid piece of garbage.", "label": 1}
{"text": "I am so fucking over these religious loonies.", "label": 1}
{"text": "I didn't call him vermin. I said people like him. That's like someone posting a fake rape story on reddit and me saying I don't want rapists in my country", "label": 1}
{"text": "Now wait, I thought the dems were causing the hurricanes. You can't have it both ways unless you are literally insane and so delusional you should be totally ignored.", "label": 1}
{"text": "Why did I google that \n  \nTIL what `34` is which I guess is a silver lining but I was probably better off remaining ignorant ☹️", "label": 1}
{"text": "This guy is as dumb as a post. Anyone who takes him seriously, really needs to get themselves checked but sadly those who do follow him are probably too far gone anyway. Can’t fix stupid.", "label": 1}
{"text": "Guess even the Pope can't escape the NSFW side of AI. Bless his digital heart.", "label": 1}
{"text": "this must be the first time air comes with a price tag", "label": 1}
{"text": "America. I figured my use of \"y'all\" was enough to tip you off to that.\n\n\"Not complaining\"??? You people just had massive race riots because of brown people immigrating to your country. The whole polite Brits thing is a total farce. Not to mention your heinous attitudes towards trans people.", "label": 1}
{"text": "Hospitals hire \"hit crews\" to just drive around running down cyclists and pedestrians on purpose. Hospitals start to like the one in Silent Hill 2, with butchers hacking everybody's limbs off and sending the family a bill per ounce if tissue removed. Pyramid-head is the bill collector.\n\nQuick, we need an A24 screenwriter over here! We got a new franchise on our hands!", "label": 1}
{"text": "Turns out Kamala Harris *is* fucking stupid.", "label": 1}
{"text": "Guess his car's got more votes than he does!", "label": 1}
{"text": "I'm so sick of these dumb fucks.", "label": 1}
{"text": "You know you're a loser in everything when you own children hate you", "label": 1}
{"text": "DONALD TRUMP WILL WIN\n\nKAMALA WILL LOSE AND REDDIT WILL SUCK SHIT, YET AGAIN", "label": 1}
{"text": "lol its like being tied into who to pick . Campaigns play into that by simplifying things and focusing on catchy, surface-level messaging. It makes sense from a strategy standpoint, but it definitely doesn’t encourage informed decision-making", "label": 1}
{"text": "They were talking about uninformed people and Hawk Tuah Harris voters are uninformed and live in a bubble. Cope with it. Trudeau is next.", "label": 1}
{"text": "Definitely has nothing to do with the candidate that the Democratic Party pushed forward. Installed, if you will.", "label": 1}
{"text": "What are you doing, step onii-chan?", "label": 1}
{"text": "If I remember correctly 3 times was elected dead dude.", "label": 1}
{"text": "Dude I hate to be the bearer of bad news but I think you're in a relationship with a dumb dumb.", "label": 1}
{"text": "Or maybe the constant word salad and drunken laughter?", "label": 1}
{"text": "they vote to piss off libs and to keep immigrants out of the country i vote for economic progress and social awareness, idc how it looks, yea im better than those fucking orcs", "label": 1}
{"text": "This just shows how misinformation can warp public perception in real-time.", "label": 1}
{"text": "The cope on here is delicious. Move to Canada!", "label": 1}
{"text": "your an idiot dude", "label": 1}
{"text": "Staying informed feels like a burden sometimes, but ignorance can be bliss until decisions affect you directly.", "label": 1}
{"text": "Democrats you mean?", "label": 1}
{"text": "The average democrat is pretty dumb. Here’s the evidence", "label": 1}
{"text": "Children children or voting adults with the mental capacity of children?", "label": 1}
{"text": "Dems problem is they stand on their principles but their voters are split among groups with very different values. If you try to appeal to the dumb, the educated \"elite\" will balk. If you appeal to moderates you lose the left and vice versa. Appeal to minorities, you lose a lot of blue collar white guys who feel like their problems are ignored and vice versa. Push for immigration, turns out a lot of current immigrants don't want people to come after them, and are actually pretty conservative and don't care if you are the one who let them into the country in the first place.\n\nI think the best example is when Roy Moore was running for Senate in Alabama, a disbarred accused pedophile, the whole Republican party gave him full throated support. Curiously at exactly the same time, Al Franken was accused of inappropriate touching and was immediately forced out of the Senate by the Democratic party.\n\ntl;dr I agree dems suck at messaging for how much smarter they pretend to be. But the real problem is that dem voters hold their politicians accountable. Republicans, educated or not, don't seem to care if you lie cheat and steal to win.", "label": 1}
{"text": "Is it easy being this stupid?", "label": 1}
{"text": "Imagine being this fucking stupid", "label": 1}
{"text": "Bothsidism wouldn't be possible if 75% of the population weren't complete dipshits but here we are.", "label": 1}
{"text": "Fuck this fucking country and their fucking idiots voting for literal fucking racist rapist felons.", "label": 1}
{"text": "And those dipshits will buy it.", "label": 1}
{"text": "I know 3 people from different groups that I talk to on a semi regular basis that thought we were leaving fucki g Europe, as in, we just decide to be our own continent. I thought they were joking but people really are just thick as pig shit and for some reason their vote fucking counts as much as anyone else's. Uninformed voting boils my fucking blood.", "label": 1}
{"text": "Nice for you benreeper, glad to hear all about your “I got mine, fuck everyone else” sentiment.", "label": 1}
{"text": "wait, you got 11.2k points for actual hate speech... I forgot how toxic Reddit is these days. Wow. I remember when people like you who hate poor people used to try to hide their opinions, now you outright come out and be full-on classist and elitist. Only a decade ago, you would have been called a far right conservative. Amazing. You literally are arguing that you should have to be somewhat wealthy to vote. Disgusting.", "label": 1}
{"text": "And they are talking purge now.", "label": 1}
{"text": ">Second, some people rely on TikTok for income. I mean, I don't, and noone I personally know does, but some do.\n\n>\n\nHilarious argument you have there friend.\n\nWhat happens when I change one word in it?\n\n\"Second, some people rely on **espionage** for income. \"\n\n\"Second, some people rely on **slavery** for income. \"\n\n\"Second, some people rely on **murder** for income. \"\n\n\n\n>And again, we live in Canada and it's kinda cool that they have the freedom and ability to do so", "label": 1}
{"text": "Go ahead and post these all day. You are the reason Trump won.", "label": 1}
{"text": "Them dastardly dems", "label": 1}
{"text": "Womp womp, cry harder in your delusion", "label": 1}
{"text": "Delusional TDS, womp womp", "label": 1}
{"text": "I am just gonna post this here:\n\n[https://www.annenbergpublicpolicycenter.org/fact-checking-presidential-candidate-robert-f-kennedy-jr-on-vaccines-autism-and-covid-19/](https://www.annenbergpublicpolicycenter.org/fact-checking-presidential-candidate-robert-f-kennedy-jr-on-vaccines-autism-and-covid-19/)\n\nRFK Jr., and some of the people he associates with, are a threat to public health.", "label": 1}
{"text": "I’ve been getting RFK ads on social media about “make America healthy again.” This is terrifying.\n\nBut the good news is that Temussolini doesn't generally keep his promises, as evidenced by all the people he's swindled over the years.", "label": 1}
{"text": "Holy shit sorry for pointing out a potential silver lining in a bad situation. I hope you enjoy going back to being fucking miserable. Hope dunking on me made your day slightly better.", "label": 1}
{"text": "[https://www.youtube.com/watch?v=nQzOHAwCfXs](https://www.youtube.com/watch?v=nQzOHAwCfXs) You must be smarter than a PHD, or you drank the koolaid either way I'm concerned for you.", "label": 1}
{"text": "If he lost, moron. The illegal aliens are being used as bioweapons to destroy the fairness of the political process. By specifically air dropping the bio weapons in to destroy small town America. They have done it in a dozen states in a dozen towns each.", "label": 1}
{"text": "As much as I despise this timeline, I actually think he could do some good for our health. I think he needs to hire Erin Elizabeth. She is very smart, she has seen the corruption, and they could help us out here...", "label": 1}
{"text": "You sore losers are back to posting out of context titles and trump isn't back in office yet", "label": 1}
{"text": "Do you think even 10% of the commenters in this thread have ever heard him speak at length?", "label": 1}
{"text": "it's like you can't even read ", "label": 1}
{"text": "Ukrainian women will just laugh them into suicide", "label": 1}
