{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Kamala is going to win so don't worry about it.  Get out and vote Donald J into retirement.", "label": 0}
{"text": "On the other hand, maybe insurers shouldn’t be allowed to charge customers for a service they can’t afford to provide.", "label": 0}
{"text": "I work in the travel industry. Airlines pull this kind of crap all the time. It's not specific to this guy, and it's not okay. The airline SHOULD get penalized for their behavior here. I don't care what breed of dog the guy has, he paid for a very specific seat and did all the right things. Would people be saying 'grandma shouldn't have flown' if a human passed away in a similar circumstance? Airlines are shady and then need to be held accountable for their crap. I hope this guy wins.", "label": 0}
{"text": "That’s revenue not profit. \n\nhttps://www.insurancejournal.com/news/national/2024/02/08/759892.htm#:~:text=The%20combined%20ratio%20for%20homeowners,about%20%241.4%20billion%20for%202022.\n\nThey lost about 300 million last year", "label": 0}
{"text": "I would love to know where the term washed up originates. Nerd moment, sorry. A guess before I Google it: a beached animal too old to keep up?", "label": 0}
{"text": "No but reports from escapees just that the guards force people to procreate and there's family punishments, not just individual punishments, so like if you escape and you leave your family behind in the camp it is NOT good for them", "label": 0}
{"text": "He blocked ALL military promotions for 10 months. It was insane he had that power.\n\nhttps://federalnewsnetwork.com/federal-report/2024/03/impacts-of-tubervilles-military-holds-will-be-felt-for-years/", "label": 0}
{"text": "Greetings, \\/u/johntwit!  Your submission from nbcnews.com has been automatically removed because it violates Rule 3 (must be a news article).  **Only news articles may be submitted- no blogs are permitted.**  [For more information on Rule 3, click here.](https://www.reddit.com/r/nottheonion/wiki/nto101#wiki_rule_3.3A__must_be_a_news_article.)\n\nFor a complete list of domains that are not allowed, [click here](https://www.reddit.com/r/nottheonion/wiki/autoremoval).  If you're new to \\/r/NotTheOnion, you may want to check out [NTO101: An Introduction To \\/r/NotTheOnion](https://www.reddit.com/r/nottheonion/wiki/nto101) for more information on our rules and answers to frequently asked questions.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Kurt however, saw plenty of dope.", "label": 0}
{"text": "No I just actually look at things rationally. I don’t just hate because it’s convenient", "label": 0}
{"text": "There have been a few breeders that are trying to reintroduce healthy traits back into bulldogs, and I think one was successful for French Bulldogs. Its gotten so bad that there are two separate German Shepard Breeds now, 'Working' Shepards, which don't have spinal issues or hip displasia, and 'show' shepards, that do", "label": 0}
{"text": "At that rate, he’s buying a new carton every week at least. They can damn near last outside that long", "label": 0}
{"text": "And the mom knew he was struggling. Why not look in a mirror and ask herself why she didn't do more to help him? Nah, it's easier to sue Google and the chatbot maker...", "label": 0}
{"text": "The irony lol", "label": 0}
{"text": "rip kurt you would have loved google maps", "label": 0}
{"text": "Being moved while absolutely a shitty thing airlines need to fix if that caused enough stress to kill your dog while your there sitting with him then your dog wasn’t built for this world to begin with", "label": 0}
{"text": "THATS A HUMAN BEING FOR CHRIST'S SAKE.", "label": 0}
{"text": "What a stupid fucking comment. Go ahead and give your kids the digital crack machine.", "label": 0}
{"text": "Yeah apparently they're even cheaper in the uk", "label": 0}
{"text": "Let's see--\n\n> He took them to the vet BEFORE the flight to clear them for safe travel\n\n>When asked to move, he told the attendant - *\"To move the dogs now would make them very anxious and excited, which would lead to extremely dangerous breathing and heart problems. This change could be lethal for a dog, especially right before you change altitudes,\"* which they did not care about.", "label": 0}
{"text": "Do they think they're customers are stupid? And do they realize when they fuck over their customers the fucked over customers don't come back? And do they realize that in the long run they fucked themselves over? I'm assuming there's a class action suit or something like that? Am I correct?", "label": 0}
{"text": "they're only on retainer if I pay them 😉", "label": 0}
{"text": "He signed himself out of rehab against orders.", "label": 0}
{"text": "Yo this girl showed me her talking to an AI the other day and it was so advanced replies with sarcasm and wit it seemed like a real person now a robot. I was kinda freaked out I see why it’s easy to fall for an AI if you’re young and lonely it’s messed up how easy it is to just talk to a bot for hours about anything", "label": 0}
{"text": "I have too it's a bipolar thing see what I said above ", "label": 0}
{"text": "  Yeah, I'm not going to defend the existence of that breed. Definitely a travesty.", "label": 0}
{"text": "“Just enough brandy to keep the ice outa me veins your honor.”", "label": 0}
{"text": "poop", "label": 0}
{"text": "For real. ", "label": 0}
{"text": "Maybe if he had GPS, he wouldn't have felt so lost.", "label": 0}
{"text": "Might be even more cursed than the Megadeth endorsement for John McCain :P", "label": 0}
{"text": "Kurt never got to experience “Golden Eye” on Nintendo 64.", "label": 0}
{"text": "Understandable! I see where you are coming from.", "label": 0}
{"text": "Epic trolling", "label": 0}
{"text": "So the juggalos and swifties are teaming up on this one? This has been an interesting year.", "label": 0}
{"text": "https://imgur.com/8fbM1Rg", "label": 0}
{"text": "Oh nos, won’t anyone think of capitalism?! Letting ppl skip work to take care of their pets, who btw DO NOT contribute to shareholder values, will surely be the downfall of free market capitalism.", "label": 0}
{"text": "How do you open an inward swinging door without touching the nasty handle?", "label": 0}
{"text": "Tacky.", "label": 0}
{"text": "Damn.  The French really do suffer when they have to slum it.", "label": 0}
{"text": "I'm seriously impressed by the amount of organisation required to get this installed on the down low. Brava to those involved!", "label": 0}
{"text": "Leave Sorbsy alone!", "label": 0}
{"text": "There's a shocker.  Amoral heartless GOP:  \"Fuck them, they are sub-human animals!\"", "label": 0}
{"text": "Light the fire afterwards, AFTERWARDS ", "label": 0}
{"text": "> Americans look terrible lately too,\n\nOkay first of all, how dare you. Secondly- oh you meant the bulldogs", "label": 0}
{"text": "In the last **20 years** there have been a total of **147** brachycephalic dog deaths on flights. Around **2 million** pets fly per year. That's what you call EXTREMELY RARE.\n\n> Yeah... You're the ignorant one here. It's not extremely rare. Quite the opposite\n\nHaha nope, still you but worse now. Lmfao you used ChatGPT, it gave you bullshit, and you confidently repeated it while saying I'm the ignorant one 🤣.\n\nAt first, I thought you were either full of typo's or intentionally lying, but now I realize you're just using ChatGPT and have no clue what you're talking about.\n\nWhat prompt did you use? You clearly directed it to give you a specific opinion, regardless of the facts because that's what it did. It even cited junk studies that admit themselves they're biased😆.\n\n> French Bulldogs have am average lifespan of **4.5 years**\n\nLOL try 10-12+ years. Only a fool and AI would think it's <5 years...[this is the study](https://www.nature.com/articles/s41598-022-10341-6.pdf) AI hoovered up and repeated to make you look like a fool.\n\nI love how your argument is so pathetic that ChatGPT had to resort to conflating every statistic it could, like average lifespan (wtf?), to try and justify how French Bulldog deaths on planes are *not* extremely rare. Spoiler...they're extremely rare.", "label": 0}
{"text": "ICP gets a bad rap but they built a community for outcasts and support non violence and support.", "label": 0}
{"text": "The only advantage a phone has is portability.\nA Computer has more powerful software, has more powerful input devices and has a larger screen making work infinitely more convenient.\n\nPlus students will learn how to use a phone anyways, while they might not learn by themselves how to use a Computer, although that will be an absolute necessity later in life.\n\nSee both CAN roughly do the same things, so its not the same debate as books vs manual labor, or even as books vs computers. But the laptop is simply better at teaching those things.", "label": 0}
{"text": "You could smuggle it under your jumper and pretend you're reeeeaaally pregnant? 🤔", "label": 0}
{"text": "One is the head, one is the ass. They take turns.", "label": 0}
{"text": "Can't really feel sorry for artist crying about the amount of money Spotify pays them. They're not entitled to make millions of dollars because they made a good album or wathever. Is Spotify the bad guy, or the record label who agreed to the terms? And if you can't make a living posting songs to Spotify alone, maybe change careers.", "label": 0}
{"text": "The thing is she's not just dependent on Spotify, if her music has 7.5 million listeners on Spotify, she probably has at least another 7.5 million spread across other services, which pay both more and less than Spotify. So even if she's only making 10k from Spotify a month, she's overall making around 20-25k a month, that's a great amount for someone who hasn't put out anything new in a long time. And 7.5 million streams is the lowest possible number 7.5m listeners can give her, the actual earnings could be 2-10 times higher. \n\nI'd consider her to be very successful in music, so this actually makes me wonder two things \n\n1. Is she personally getting only a tiny fraction of the money that streaming her songs pays, cause then the two shouldn't be compared at all.\n2. Is she in the top 5% of onlyfans earners? Cause the success disparity is not so different there.\n\n\nTo me what all of this means is that musicians need to build multiple streams of income. Other artists do it as well, it's not like successful actors do commercials, and shity movies for passion, they are just capitalising their fame to have money so that they can time to time work on prestige movies that have small budgets.", "label": 0}
{"text": "Unfortunately this has real world consequences.", "label": 0}
{"text": "The takeaway here: *Don't store your pot butter/oil at work, folks.*\n\nSomeone might use it and then you'll have lost it.", "label": 0}
{"text": "🫡", "label": 0}
{"text": "OF also doesn’t gave record labels taking their huge cuts before the artist", "label": 0}
{"text": "What if Putin makes Luke a colonel in the Russian army before the war is a fact?", "label": 0}
{"text": "i'd argue that the past was a lot darker", "label": 0}
{"text": "Oh nooooo brahhhh where is that special olive oil!? You used the whole bottle it was rosin duddddeeee!", "label": 0}
{"text": "Is she saying there are more people into feet than her music? Self burn?", "label": 0}
{"text": "They got my attention", "label": 0}
{"text": "Oddly, this made me instantly load her up on Spotify, and then I felt bad realizing she won't get fuck all for it.", "label": 0}
{"text": "It's actually probably a brain proximity issue. Probably for most fetishes.\n\nIt's somewhat common that the part of your brain that processes feet is very close to the sex part of your brain. Then you get a foot fetish. \n\nWish I remembered all of the details, but overlapping brain structures with the erogenous zone is a very likely cause for a lot of \"weird\" stuff.", "label": 0}
{"text": "A little scary to those who grab a slice for the drive.", "label": 0}
{"text": "i dont want the playlist", "label": 0}
{"text": "They’re a market economy with some state control. You might have some point if we lived before Deng’s market reforms, but we don’t, China since then is no less capitalist then any other country with a market economy. Even before the reforms it still wouldn’t be socialist, just state capitalism, but you could reasonably argue that’s different enough from regular markets, but China doesn’t even have that to argue from.", "label": 0}
{"text": "And neither are really that useful", "label": 0}
{"text": "Is this an indirect advertisement for her OF, cause I'm sure people are into feet picks but were not particularly into or aware of her are probably considering checking it out now.", "label": 0}
{"text": "If it's coming from a spring what are they expected to do?!", "label": 0}
{"text": "I now know I don’t know what a five star foot looks like. Just looks like a foot. I know what nasty feet look like as I assume all people know. But the good ones I’m a layman.", "label": 0}
{"text": "Meh, they love MTG, they love Kari Lake.  It really isn't about intersectional categories when it comes to this thing.  They use misogyny to hurt women to disagree with them, they use racism to hurt minorities who disagree with them.", "label": 0}
{"text": "That's the excuse I would use if I accidentally gave the wrong person my special pizza.", "label": 0}
{"text": "You could usually earn more money with a bake sale then you could on streaming with Spotify. Such a rip.", "label": 0}
{"text": "Stop listening to music.  You sound boring as fuck.", "label": 0}
{"text": "Careful, using that brain of yours. Not all are so gifted with the thinking.", "label": 0}
{"text": "He'd do the parody called 'Meat' and it would be images of prime cuts with porn-music in the background while trashy singers moan and gasp out lyrics about juicy steaks.", "label": 0}
{"text": "Feet it, just feet it 🎶🎵🎶", "label": 0}
{"text": "Do you still have to ask for anchovies to get the ‘special’?", "label": 0}
{"text": "High people are usually less courageous than drunk people. I’d bet they would pull over. Weed doesn’t really inspire courage the same way alcohol does.", "label": 0}
{"text": "Not unless you're on a long drive. It takes a good while for food-based cannabis to kick in — up to two hours or more.", "label": 0}
{"text": "I am confused.  What is there to apologize about?", "label": 0}
{"text": "> Musk obviously can afford attorneys, and they know what they’re doing better than random people on Reddit.\n\nMusk has done blatantly illegal things — and even got himself into trouble for some of it — on several occasions, despite being able to afford attorneys. That he can afford attorneys doesn’t mean what he’s doing is legal. The DOJ also knows what they’re doing better than random people on Reddit do, and the DOJ clearly thinks that this is potentially illegal. You know, hence this whole post that you’re commenting on. Redditors who say this is a clear breach of the law may be full of it, but anyone arguing the opposite is just as.", "label": 0}
{"text": "They seem square and there doesn't seem to be a nice arch.", "label": 0}
{"text": "Getting high by surprise problably sucks", "label": 0}
{"text": "Former?  Did Lowe’s hire them?", "label": 0}
{"text": "Doubt we'll get any more details but if it was just normal looking oil sitting in a shared space without any labeling saying it was THC, that's crazy, that stuff should definitely be labeled in a shared space", "label": 0}
{"text": "That's the opposite of a problem.", "label": 0}
{"text": "I used to sit with the sound guy and drink beer while the young All \"Amercian\" Rejects played on stage before they were old enough to drink.  I guess I was young, but I was older than them.\n\nGo Pokes!", "label": 0}
{"text": "Here's the actual quote from the people who made the survey:\n\n\n> Americans are divided on whether they favor (47%) or oppose (50%) rounding up and deporting immigrants who are in the country illegally, even if it takes setting up encampments guarded by the U.S. military.\n\n\nMuch less inflammatory than Axios' blogspam. You can even rephrase it as \"would you support deporting illegal aliens even if it means getting the military to defend holding centers\".", "label": 0}
{"text": "Yea figured as much", "label": 0}
{"text": "It's even worse :D the antique authorities knew it was there, they had excavated two tombs next to it already and left that one sealed for later excavation, it contained what they thought it did and added precisely zero to our knowledge of the place, time or people :)\n\nIn other words it was all hype for the TV show/media", "label": 0}
{"text": "It's an insane argument that sounds awfully communist, as if the State is somehow entitled to the children that people choose to have or not.", "label": 0}
{"text": "You mean the nation that has no allies besides Russia but instead alienated all its other neighbours, made Poland massively reinforce the border? And also already has russian military and Wagner mercenaries inside?\n\nThe only reason for it not to get annexed is because Putin thinks this is not necessary.", "label": 0}
{"text": "Don't kink shame", "label": 0}
{"text": "Accidentally, uh huh", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "I wouldn't hope on a \"bet\" for intoxicated driving.\n\nNot to mention, a ton of people here in Canada drive high all the time. It's rather infuriating with how much it goes under the radar.", "label": 0}
{"text": "I mean its right in the name...", "label": 0}
{"text": "We talking raccoon, lipstick, fishnet stockings and a slightly wobbly gait?", "label": 0}
{"text": "No, it's implying you should be paid fairly for your work", "label": 0}
{"text": "Looool, how you gonna help Russia annex your neighbor and then have a problem with Russia Annexing you?!?!", "label": 0}
{"text": "THC pizza? I can get behind that", "label": 0}
{"text": "> They’re a market economy with some state control.\n\nNot every market system is capitalist. China describes itself as market-socialist, not capitalist. A lot of communist states were similar - East Germany, for instance, implemented market reforms in the 1960s while maintaining their planned economy.\n\n> Even before the reforms it still wouldn’t be socialist, just state capitalism\n\n\"Not real communism\" is a bullshit excuse and you know it.", "label": 0}
{"text": "Came here to say this", "label": 0}
{"text": "Look for \"Live-Events-Feet\"", "label": 0}
{"text": "\"Women seem wicked\n\nwhen you're unwanted\n\nStreet's are uneven \n\nWhen you are down\"\n\nNo need to change anything. It's written for the strange feet weirdos.", "label": 0}
{"text": "I think the [Treaty on the Creation of a Union State of Russia and Belarus](https://en.m.wikipedia.org/wiki/Union_State), that Lukashenko signed in 1999, might be one of those events. Lukashenko has pointed to the Union State as justification for aligning with Russia in the war against Ukraine and enabling Russia to launch attacks from Belarus.", "label": 0}
{"text": "The mafia deals in stolen and fake cheese. \nGood profit.", "label": 0}
{"text": "You were trying to rope me into a position about prison time which I never claimed and don't hold. Sentencing is up to a judge, after conviction and I don't think I know better than them. I'm not arguing for Musk to be treated differently than Ben & Jerry's.\n\nI'm not interested in stretching this disagreement beyond the original point: the law prohibits us from making voter registration a condition leading to payment, which the petition does in plain ink.", "label": 0}
{"text": "Don't recognise the feet, I mean face, don't recognise the face", "label": 0}
{"text": "Spike, because Gizmo stayed a Mogwai", "label": 0}
{"text": "What the hell is a bat farm? I see something about Minecraft...but?", "label": 0}
{"text": "Greeta Van Feet", "label": 0}
{"text": "Getting high without knowing you’re getting high sounds terrible and this is coming from a no good dirty stoner.", "label": 0}
{"text": "I'm very sorry that I took slightly more than an hour to reply on a workday.", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "We used GPS during the 1991 invasion of Iraq and Kuwait. I tend to believe though that Kurt never did.", "label": 0}
{"text": "_Like a bot out hell, I’ll be gone when the mornin’ comes…._", "label": 0}
{"text": "I love this for him", "label": 0}
{"text": "I actually like her music.", "label": 0}
{"text": "It isn't. They have a $76B market cap and a PE ratio of 155, which means that their earnings at a $76B valuation would only be about $490M, but they've never actually had a profitable year, so that $490M is theoretical. \n\nNobody wants to say it, but artists greatly overvalue their art. They complain about the payout rates per play, but how much are any of us willing to pay for a 3 minute long non-immersive experience? Then, with the little amount of money we're willing to pay for that experience,  they need to build the infrastructure to deliver that experience. It makes sense that touring is where the artists make most of the money. That's a high value immersive experience.", "label": 0}
{"text": "Spotify is functionally a near monopoly, market principles don't really apply.  There aren't any meaningful alternatives.  So a conversation about who's entitled to what is sort of identical to \"might makes right\".  They're absolutely taking as much as they can from artists, and unfortunately, artists have no alternative to Spotify's functional monopoly (duopoly with Apple, I guess).\n\nIn practice, it's an absurdly unhealthy market.", "label": 0}
{"text": "> Who knows how Trump became the nominee? Wasn’t the Republican’s fault though \n\n- Republicans trying to justify their ideology", "label": 0}
{"text": "My bad! No, I didn't. Not that it's any defence, but I'm drunk xD", "label": 0}
{"text": "Here we are now, entertain us\n\nI feel stupid and contagious\n\nHere we are now, entertain us", "label": 0}
{"text": "Type Toe Negative", "label": 0}
{"text": "Most people get high *and then* order pizza.", "label": 0}
{"text": "So how many wars we gonna have then?triple war?\nSexpenteeneth war ?\n23And a 1/3 war?", "label": 0}
{"text": "I wonder if it's where Meatloaf sourced them from", "label": 0}
{"text": "Always wanted to open up a cannabis restaurant. But i never actually wanted to run one, lol", "label": 0}
{"text": "My jack in the box has to many jacks", "label": 0}
{"text": "I'm not sure you get the whole picture. \n\nThere's more money in holding the rights to your music in various income streams. (otherwise noone would buy it) the only thing selling the rights gets you is predictable amount of income and income right now rather than over the years.", "label": 0}
{"text": "So they used the special oregano?", "label": 0}
{"text": "Nope, no problem with legal pot. None at all.", "label": 0}
{"text": "He's got to squeak when he's being buggered.\n\n\nDrive a train of leopard up hiz arse", "label": 0}
{"text": "Honestly, it feels like everything was designed to exploit. I’m just happy I’m seeing the younger generations waking up to this bullshit. That’s why everything sucks right now. The powers that be are freaked out by this new enlightenment and they’re fighting back.", "label": 0}
{"text": "basically", "label": 0}
{"text": "His days are numbered.", "label": 0}
{"text": "I'm confused unless they put the oil on afterwards. The pizza oven will absolutely destroy any THC I would think?", "label": 0}
{"text": "Yeah spotify pays artists terribly, but if it didn't exist, she wouldn't be earning that money at all. The listens are going to be almost exclusively from fans who bought the albums at the time, and it's now easier to use Spotify than play an album you already bought. This ofc doesn't apply to more recent artists, but in her particular case, she's not losing anything as she made the money from album sales at the time.", "label": 0}
{"text": "This pizza is making me want some pizza", "label": 0}
{"text": "At least the part about using a shared kitchen wasn't a lie.\n\n>As mentioned in the Famous Yeti’s statement, the public health department confirmed that Famous Yeti’s does indeed operate in a building with a shared industrial kitchen where many businesses make food and other products. ", "label": 0}
{"text": "Spotify is pretty dominant but still only has about a 30% share of subscribers.  Tencent, Apple, Amazon and YouTube are pretty even with each other.", "label": 0}
{"text": "The point was to ask the original person what they meant by Kamala doing the exact same thing.  You just jumped in with your semantics.", "label": 0}
{"text": "Another reason to be annoyed at Wisconsin. Get a free buzz and they complain", "label": 0}
{"text": "Maybe they thought if they labeled it as THC oil then it might be purposefully stolen. Still, you'd think that everything would be labeled as to who owns it (or have separate shelves per company) so I would guess that the best-case scenario here is still theft by someone making the pizza.", "label": 0}
{"text": "How do you think people get malware on a computer???", "label": 0}
{"text": "Never know till you try. \n\nCould be a new career", "label": 0}
{"text": "I was thinking about when it starts to kick in when you're sure you haven't taken anything.", "label": 0}
{"text": "Never thought i'd see Wallace and Gromit stoop this low", "label": 0}
{"text": "Why is he not already in prison for this? And why is he not already in prison for having policy talks with Vladimir Putin without US government authorization?", "label": 0}
{"text": "Edibles basically give me a panic attack. Id be pretty pissed my day was dedicated to have to deal with that", "label": 0}
{"text": "Nine Inch Toenails", "label": 0}
{"text": "Pizza that gives you the munchies. We’ve found the perfect food.", "label": 0}
{"text": "Greetings, \\/u/Ok_Requirement_7752! Your subsmission from youtube.com has been automatically removed because it violates Rule 3 (must be a news article). **Only news articles may be submitted, YouTube videos do not qualify.** [For more information on Rule 3, click here.](https://www.reddit.com/r/nottheonion/wiki/nto101#wiki_rule_3.3A__must_be_a_news_article.)\n \n For a complete list of domains that are not allowed, [click here](https://www.reddit.com/r/nottheonion/wiki/autoremoval). If you're new to \\/r/NotTheOnion, you may want to check out [NTO101: An Introduction to \\/r/NotTheOnion](https://www.reddit.com/r/nottheonion/wiki/nto101) for more information on our rules and answers to frequently asked questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Especially if you don't normally intake that substance, because then it's MUCH stronger, as you don't have a tolerance.\n\nAlso, it just gets worse with edibles, because the high lasts a long time.", "label": 0}
{"text": "Why is she even trying to monetize feet pics on Spotify? 👀", "label": 0}
{"text": "> yet, you don't object to authoritarianism elsewhere\n\nThat’s an entirely baseless presumption on your part.", "label": 0}
{"text": "Good marketing strat. \"Yeah I make so much on OF for my feet pics\" All the feet people desperately race to OF to subscribe.", "label": 0}
{"text": "Someone ordered No. 40 again.", "label": 0}
{"text": "Lukashenko sees the weakening of Putin. Putin wouldn't annex Belarus right now. Putin is too busy losing the war. Lukashenko was a boot licker for Putin, but It is great to see Putin lose allies.", "label": 0}
{"text": "Disgruntled employee consulted r/ULPT on how to screw pizzeria without harming customers?", "label": 0}
{"text": "I’m not saying half the world is evil. But a lot of our politicians are. They shamelessly lie and manipulate, pass policies that are harmful to people they were elected to represent, for their own personal enrichment. \n\nIt’s meaningless to claim to be pro-life or pro-families then elect people that enact policies that harm children and families. \n\nSo the people that do that, are either full of crap or woefully misinformed. \n\nIf", "label": 0}
{"text": "And, for most of us at least, neither are useful.", "label": 0}
{"text": "Probably that guy on r/trees who was going to decarb his weed in the work oven.", "label": 0}
{"text": "Well unless they're visibly high, there's not really a good way to test somebody's intoxication level. I could've smoked 3 hours ago or 3 weeks ago and still piss hot.", "label": 0}
{"text": "Who makes all the money off of Spotify? It's practically a monopoly at this point", "label": 0}
{"text": "I watched the Architectural Digest home tour with David Harbour. They seem like absolutely unhinged crazy wealthy people.", "label": 0}
{"text": "Usually the concert tees with typos are from the dudes selling them outside the venue", "label": 0}
{"text": "I get ya. But there is very much a delayed \"fuse\" between when the THC is consumed and when it hits you. \n\ntl;dr - When you smoke THC, it goes through your lungs directly to your brain when you eat it, it has to be processed through the liver, so it just takes a lot longer to get to the cannabinoid receptors. You often hear stories about people eating gummies and thinking they were bunk, only to find out an hour later that they ate the real deal. \n\nWhen it does kick in and you are unaware, you're definitely in for a not-so-fun time.", "label": 0}
{"text": "Also, Spotify paid out $9bn to the music industry last year. So those two could liquidate all their assets (which would tank the stock but whatever) and it wouldn't even cover 1.5 years of payments.  ", "label": 0}
{"text": "Fck Spotify.", "label": 0}
{"text": "It’s a “how much would it cost to prosecute the defendant, how likely are we to win, and what kind of sentence are they likely to get if convicted?” kind of thing.  If it would cost a billion dollars to have a 50% chance of making him serve an afternoon of community service, was it worth it?\n\nI want to see him serve the full seven year jail term for buying votes, but it would take a decade to investigate, a vast amount of money to try, and he’d wind up getting off anyway.  So, yeah, the system is broken and ineffective against anyone who can bring enough lawyers to the defense.  Which makes it really difficult to continue to believe that we should not be resorting to pitchforks and torches already.", "label": 0}
{"text": "Project my turds into your propagandized mouth.", "label": 0}
{"text": "Someone’s getting fired, and I know why. Yeah Yeah.  \nBecause customers got high.  \nCustomers got high.\n\nCustomers got high.", "label": 0}
{"text": "Time to buy NFTs of feet pics?", "label": 0}
{"text": "Drug testing.  I work at a place that has mandatory random drug tests.  I have walked into work 3 times in the last year and had to go straight to drug test.    I am NOT anti weed, but I have been working in a drug testable job for decades.  \nThe first thing I am doing after I retire is get high for the first time since high school 🤣\n  If this happened to me, and they hadn't publicly acknowledged it, and I couldn't definitively prove that was the reason I failed the test I would be fired and find it nearly impossible to be employed by someone else in my career field.", "label": 0}
{"text": "People like you are why earth deserves to die.", "label": 0}
{"text": "Probably heard of the song Bella Ciao and just connected the wrong dots", "label": 0}
{"text": "Imagine it’s lunch and you have a 3pm presentation😅", "label": 0}
{"text": "You CANT go back to work man, you can’t. They’ll know. They’ll all know you’re high. You gotta get to a quiet dark room FAST maaannneeeeee", "label": 0}
{"text": "Can the CIA not do CIA things and make a secret agreement with him? He must know Russia is short on time, which means he’s short on time.\n\nGet Belarus on Ukraine’s side clandestinely, and allow Luka to live out his life somewhere in a international witness protection program", "label": 0}
{"text": "The algorithms will make us Gods", "label": 0}
{"text": "Has there been any actual talk on annexing Belarus? Kinda seems like a non-story, especially given the source.", "label": 0}
{"text": "The initial conversation was about someone unknowingly consuming cannabis before driving. \n\nNot for people that knowingly do it.", "label": 0}
{"text": "How much should you pay per listen?", "label": 0}
{"text": "I know right? I’ve genuinely not seen a CD in years outside of dedicated music stores at this point", "label": 0}
{"text": "As someone with marijuana induced psychosis I would literally sue (after the voice in my head stopped telling me people were going to torture me and film it for entertainment)", "label": 0}
{"text": "Pizza with THC? My weekend just got WAY more efficient.", "label": 0}
{"text": "Not even communist, just authoritarian in general", "label": 0}
{"text": "As someone who used to buy stuff on OF, I’m sure she will get a surge now", "label": 0}
{"text": "That must have hurt!", "label": 0}
{"text": "Lock those windows Mr. Lukashenko.", "label": 0}
{"text": "For real, this whole \"and this proves there's something wrong with the industry\" comments are so stupid. Imagine having a Patreon for literally every band you listen to. Imagine paying like 9.99 to hear maybe a demo a month plus their songs for each band, all totalling up to something like 300.00 a month or more.\n\nOf course a famous musician showing off feet pics makes more money doing that than as revenue from Spotify.", "label": 0}
{"text": "imo, I wouldn't mind elon paying Kamala's gov't.", "label": 0}
{"text": "Bless, he thinks Belarus is sovereign.", "label": 0}
{"text": ">Every election they have to fight for swing voters\n\nIf they won every election easily, how would they convince you to donate to their campaign? 😉\n\n>hell, why the fuck do *Black people* even consider to vote for Republicans?!\n\nI think your comment is a perfect explanation of why not all black people vote blue; because they are not a monolith, yet are treated as such.\n\n>and their voters are also very critical, yeeting off to non-vote or third party for bullshit issues such as Israel/Palestine\n\nSo Blue MAGA loses voters because they don't understand the issues their voters care about? Israel/Palestine is one of the biggest topics for young left leaning Americans, but you refer to it as \"utter bullshit\" which is not far off from Harris' official position.\n\nNo wonder the Democrats run a real risk of losing to Orange Man, Felon Musk, et al.", "label": 0}
{"text": "$10 a month with over 1000 subscribers...La Dolce Feeta indeed.", "label": 0}
{"text": "Porn is free :/", "label": 0}
{"text": "If I remember correctly musicians make more from merch (like a single shirt sale) than from years of being played on Spotify (by that one fan who bought that shirt). That's why so many of them don't mind if you pirate their work as long as you just buy something too.\n\nSpotify, which is also owned to a high degree by music publishers (that's how they got their license), is essentially as close to legalised piracy as you can get when it comes to paying most musicians nothing at all. It's just another way for publishers to extract some value from their assets.", "label": 0}
{"text": "They apparently backed out or were kicked out at the last minute because they refused to commit to playing one whole old album. Boys like girls replaced them lol.", "label": 0}
{"text": "You can succeed on OF without fame but I’m sure it’s a lot harder. This article will drive more subscribers for example", "label": 0}
{"text": "This post has inspired me to intentionally contaminate the next pizza I make with THC. Just need to learn how to make a pizza first", "label": 0}
{"text": "https://www.youtube.com/watch?v=waPngGP7Awk", "label": 0}
{"text": "there's absolutely no way it wasn't labeled in some fashion if it was stored in a shared space....right? lol", "label": 0}
{"text": "I’m going to assume you mean my employer isn’t paying me to vote a certain way. As even if they were explicitly paying me just to vote, I don’t believe that’s illegal. \n\nRegardless, Musk isn’t paying people to vote a particular way. He’s giving away money. Granted, to be eligible to win the give-away one must sign his free speech petition but he’s not requiring anyone to vote for one candidate or the other. If one wants to claim Musk’s actions are ‘buying votes’ then nearly everything political candidates do is illegal (e.g. student loan forgiveness).", "label": 0}
{"text": "Having heard her music I can understand why her skeletor feet are more succesful", "label": 0}
{"text": "You'd think so unless someone grabbed it and started using it without looking at the bottle...", "label": 0}
{"text": "I joke about this but what company sends out £300,000 of goods without payment or even finding out if who they send it to is even real? It sounds like they never even meet anyone.", "label": 0}
{"text": "I will never forgive the Democrats for *completely* caving on this. They are to the right of where the Republicans were in 2016. Republicans are far, FAR worse, but you wouldn't see damn near a majority of the country want fucking camps if Democrats didn't act like Republicans are basically right about immigrants being a disease, just less competent at dealing with the issue. They used to push back on this, now Kamala is criticizing Trump for not backing the fascistic border bill from earlier this year.", "label": 0}
{"text": "I mean, I don’t get the shame in it. I got weird tired feet but I’d be sharing em with whoever paid my rent lol", "label": 0}
{"text": "Well it obviously wasn't very secure given a 14 year old child could get their hands on it.\n\nThey did do something, but not enough. I can sympathize that they live in a society where the obvious option is looked down upon and therefore not considered, but it is shocking to me that this is even a possibility.", "label": 0}
{"text": "I’m just going to ask you to point on the doll where the mean Republican touched you.", "label": 0}
{"text": "the russians dont even trust themselves much less other countries.", "label": 0}
{"text": "I was gonna say something witty, but just shut up, man.", "label": 0}
{"text": "You after another cookie or what?", "label": 0}
{"text": "*quentin Tarantino has entered the chat*", "label": 0}
{"text": "Exactly", "label": 0}
{"text": "We can go deeper!\n\nFeet (feat. Feet)", "label": 0}
{"text": "What exactly do they need to apologize for?", "label": 0}
{"text": "No fences needed it's clothbound", "label": 0}
{"text": "You'd love that, wouldn't you. Naughty boy 😈", "label": 0}
{"text": "Greetings, \\/u/2big_2fail!  Your submission from washingtonpost.com has been automatically removed because of Rule 11 (no blocked or redirected links).  **Submissions from websites that contain a paywall, survey walls, or pop-overs of any kind such as washingtonpost.com, are not permitted.**  If you don't see a pop-over, it may be that your source's pop-over only appears after a certain number of articles have been viewed, or it may be an ad whitelist pop-over and you don't run an adblocker.  [For more information on Rule 11, click here.](https://www.reddit.com/r/nottheonion/wiki/nto101#wiki_rule_11.3A__no_blocked_or_redirected_links.)  \n\nFor a complete list of domains that are not allowed, [click here](https://www.reddit.com/r/nottheonion/wiki/autoremoval).  If you're new to \\/r/NotTheOnion, you may want to check out [NTO101: An Introduction To \\/r/NotTheOnion](https://www.reddit.com/r/nottheonion/wiki/nto101) for more information on our rules and answers to frequently asked questions.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "That's what makes it a great lie. \n\n\nI kid, but it's probably not a lie because every other user of that kitchen could easily deny using any THC infused oil.", "label": 0}
{"text": "Mom: we have Jack in the Box at home.\n\n(Shot of Great Value “Peter in a Package” toy, still in the cellophane covered in a layer of dust.)", "label": 0}
{"text": "This sounds like a South Park episode lol", "label": 0}
{"text": "That's normal and not weird at all.", "label": 0}
{"text": "As is often the case with Luka, this is a diversionary tactic.  \nIn fact, he's so deep in Vlad's colon that he can't find the exit.  \n  \nHe is probably preparing to take part in the war in Ukraine.    \nCheapest Putin tactic.   \nAnnounce exactly the opposite of what you actually planned.", "label": 0}
{"text": "What you said with a sprinkle of the fact they didn't get main stage and they were salty about it. Apparently they complained about that at the 2022 WWWY set.", "label": 0}
{"text": "No Feet Tees", "label": 0}
{"text": "Why is it every time Missouri is in the news it is for something terrible? I mean there's this. Mohela...anytime Mohela is mentioned by anyone ever it is because they are being fined again or they are suing to prevent loan forgiveness because it hurts their profit", "label": 0}
{"text": "I would imagine there aren’t too many people browsing spotify trying to find feet pics.", "label": 0}
{"text": "Apparently you can’t read. It’s OK. Get a grown up to read the America PAC page about the petition to you.", "label": 0}
{"text": "Tarantino has entered the chat", "label": 0}
{"text": "Imagine popping hot with a federal agency or military because you ingested this pizza", "label": 0}
{"text": "Greetings, \\/u/RareShrimp!  Your submission from columnblog.com has been automatically removed because it violates Rule 3 (must be a news article).  **Only news articles may be submitted- no blogs are permitted.**  [For more information on Rule 3, click here.](https://www.reddit.com/r/nottheonion/wiki/nto101#wiki_rule_3.3A__must_be_a_news_article.)\n\nFor a complete list of domains that are not allowed, [click here](https://www.reddit.com/r/nottheonion/wiki/autoremoval).  If you're new to \\/r/NotTheOnion, you may want to check out [NTO101: An Introduction To \\/r/NotTheOnion](https://www.reddit.com/r/nottheonion/wiki/nto101) for more information on our rules and answers to frequently asked questions.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Or Veggies Tales", "label": 0}
{"text": "Where did the geese go?", "label": 0}
{"text": "I just looked up the recommended dose for Delta9 oil:  5-10 mg for \"casual use\" and 10-25 mg for \"experienced users.\" \n\nBut if, for example, pizza dough uses 1 or 2 tablespoons of olive oil, that's roughly \\[according to an online converter, converting an oil volume measurement to mass\\] 13,574 - 27,149 mg. If that's accurate, that's some dosing of THC throughout that pizza! (But I also read that high heat causes Delta-9 THC to degrade, leading to loss of potency.)", "label": 0}
{"text": "In the music industry, everybody gets a cut of the royalties: The Talent, the producers, the sound engineers, and a bunch of other people I don't know about that make a song happen.  On OnlyFans, it's just her and her feet.  Maybe her folks get some of those royalties because they made her?  LoL!", "label": 0}
{"text": "Lol is George Soros in the room with us right now?!? Haha what a loser! You don’t know dick about me and what I would do. Hahaha thanks for the laughs, chimp.", "label": 0}
{"text": "Oh, oh deary me\n\n\nMy older sister's in her bedroom posting feet..", "label": 0}
{"text": "Their parents or whoever brought them here, need to be deported. As for the child, if they are an adult by the time it's known that they were brought here, there should be an option between a fine or deportation, because there cannot be any incentives to encourage others to do the same.", "label": 0}
{"text": "Stop posting on the internet. You sound stupid as fuck.", "label": 0}
{"text": "My time at Pizza Hut back in college was wild, but I don’t think any of us got so blitzed the Pizzas bought a contact high…", "label": 0}
{"text": "Hey tell us your thoughts on putting things in people's drinks without their consent. You just said people should apologize for doing it with food.", "label": 0}
{"text": "spotify makes deals with the record companies because they are the rights holders. Spotify did not replace them as middlemen, they replaced the radio as the distribution. The money is still going to the rights holders with the big catalogues instead of the artists.", "label": 0}
{"text": "Hose it off?", "label": 0}
{"text": "Are cds not a thing anymore (seriously asking, I don’t actually know if major artists put out physical media)?", "label": 0}
{"text": "What?", "label": 0}
{"text": "Then they are not very smart or even slightly possibly a tiny ounce of smart.", "label": 0}
{"text": "My brother got me an edible chocolate bar. I was napping at the time so when he gave it to me I was lucidly paying attention to his gift that he threw next to me on my bed. The chocolate ended up falling off my bed and just sat there for like 2 weeks. I was cleaning my room and I found the bar, and just left it next to my computer. Later that day I was watching a movie and saw the chocolate and decided to eat some. I was not really paying attention this entire time to what it actually was and ate half the bar (roughly 200mg). It just looked like a normal Godiva bar. \n\nAnyway fast forward like 30 min and I'm suddenly feeling this high sensation. I know what it feels like to be high on weed, but I know I hadn't smoked. I started to panic thinking that perhaps there was a gas leak or some invisible vapor that was getting me high. I ran around my house giving the sniff test to each room, while still fighting the high. I eventually got back to my room and was about to call 911 when I saw the chocolate bar had a pot leaf logo. Sigh of relief and I just let the high take me. That shit took me over for the whole damn weekend.", "label": 0}
{"text": "Only if he doesn't have any flights scheduled to Moscow.", "label": 0}
{"text": "Oh hell no", "label": 0}
{"text": "> Walmartian\n\nPlanet WalMars sounds like some sort of dystopian rebranding of planet Mars", "label": 0}
{"text": "Especially if random drug tests are required by your job, and the 1st positive means immediately fired and it's on a record for future potential employers to see. The DoT doesn't play around and \"I didn't know\" hasn't worked for anyone.", "label": 0}
{"text": "Theirs now", "label": 0}
{"text": "Schrödinger’s Fighters.", "label": 0}
{"text": "Men have never been weaker.", "label": 0}
{"text": "Halo 3 was so cool! - Kurt Cobain if he had lived long enough to play it, probably.", "label": 0}
{"text": "I mean shit.", "label": 0}
{"text": "My roommate and I used to live in this city, and just the other day he had to come home after eating a couple of their slices before work because he felt like he ate an entire edible. Lol.\n\nFamous Yeti’s used to be in a much smaller space in a strip mall until recently, when they moved in to this building and expanded to have an arcade. It’s beyond me how this kind of thing happens, but they’ve got a great track record and both Yeti’s and their other restaurant in Stoughton have been there for almost a decade.", "label": 0}
{"text": "Yeah, that would be wild to just eat your dinner then get high afterwards. I would be all for that if I knew what I was getting into, but would probably think I was dying or something otherwise. Some people REALLY don’t do well with THC and I could imagine that would be a nightmare.", "label": 0}
{"text": "I gave up on mainstream music.\n\nJust YouTube then borderline no name or off style artists. My playlist gets weird as fuck: Nekrogoblikon, Billy Strings, Stupendium, Sturgil Simpson, Amalee, BARDCORE covers, Scott Bradlee Post Modern Jukebox.\n\nFuck convention be weird. ", "label": 0}
{"text": "The number one film this year was called \"Feet.\" And that's all it was for 90 minutes. It won't 8 Oscars, including best screenplay.", "label": 0}
{"text": "I saw this some time ago, and to be honest that’s really cool…but on the flip side those dogs will probably cost thousands of dollars. That doesn’t help the world that we live in as much as it may seem (in my estimation, anyway.)\n\nIf people want to take on the responsibility of owning a dog I think that they need to understand the gravity of the decision, and I think they should adopt (again this is all my opinion and I am not a doctor.)", "label": 0}
{"text": "Callus In Chains", "label": 0}
{"text": "We’ve had so many chances to stop him but just keep letting him do it and……hope Harris wins the election and that he doesn’t run again in another 4 years? And if that doesn’t work then oh well. It was a nice 250 years while it lasted.", "label": 0}
{"text": "Motivation to never try evwr", "label": 0}
{"text": "I feel like there is definitely legal recourse to be had in a situation like this.", "label": 0}
{"text": "Well yeah you don’t sell feet pics on Spotify", "label": 0}
{"text": "I'm significantly larger than Taylor Swift, I guess I should get in better shape.", "label": 0}
{"text": "well see, back in the before fore times you used to have to pay for each individual album or song you wanted to listen to, rather than getting access to a catalog of every song ever recorded for one low monthly price.\n\nSome might say this new model is unsustainable.", "label": 0}
{"text": "I respect the hustle, why not", "label": 0}
{"text": "Everyone (Ben Shapiro) knows AOC got the best tootsies.", "label": 0}
{"text": "Stop living cause what’s thenfucking point", "label": 0}
{"text": "Talk is cheap. Has he gone to the cops to turn himself in?", "label": 0}
{"text": "And probably no one would know about her unless she was a musician.", "label": 0}
{"text": "Total horseshit. Thrift is **NEVER** bad for an economy, ever.\n\nThe reason China's economy is struggling is because of [Tofu Dregs](https://en.wikipedia.org/wiki/Tofu-dreg_project), institutional corruption and waste, and an overly controlling state-run economy.\n\nChinese citizens saved up their money to invest into properties that have turned out to be worthless, and the cause of the property boom in the first place is because the Government placed strict controls on other types of investment.\n\nBasically, the savings of a generation of Chinese subjects have been squandered due to graft and incompetence, and now they're living with the consequences.", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "That's because her feet are much better than her music!", "label": 0}
{"text": "Might be a hint to her music quality?", "label": 0}
{"text": "it just keeps happening dude. company reports record high profits, those profits go to the shareholders and i guess stop existing? vanish from reality? are no longer allowed to be factored in? and the company complains that x thing is just *absolutely destroying them* (shareholders report record profits the next year).", "label": 0}
{"text": "That model *is* unsustainable for the way we consume music today. We cycle through artists, albums, songs way faster than we did in the past. The subscription model is a reflection of that.\n\nIt's the same idea as video streaming sites vs DVD purchases. We just consume way more than we used to.", "label": 0}
{"text": "I don't care what you got. I'd still love to fill your mouth with my fecal matter dip shit piggy. Pittsburgh sucks fat dicks btw", "label": 0}
{"text": "They've already effectively annexed you, you idiot potato", "label": 0}
{"text": "We had that. It was called iTunes.", "label": 0}
{"text": "Spotify is going to start streaming feet", "label": 0}
{"text": "Honestly, I feel really sorry for you after reading that. It sounds like music plays almost no role in your life. I hope one day you find a piece of music that speaks to you.", "label": 0}
{"text": "Someone watches Archer.\nHell ya", "label": 0}
{"text": "The Toe Cheese Incident", "label": 0}
{"text": "The intern they are barely paying to make these shirts wasn’t alive when these bands broke.", "label": 0}
{"text": "Those are some basic ass feet. Could be worse I suppose. Any man that pays for her (or anyones OF) are losers.", "label": 0}
{"text": "French tips", "label": 0}
{"text": "I said that is what he would do, turn on Putin. I also say he will flee Belarus with in a year or be arrested.", "label": 0}
{"text": "Quentin Tarantinytoes", "label": 0}
{"text": "Seriously, what is the fascination with feet?", "label": 0}
{"text": "Seeing as I pay for Spotify BECAUSE I like their music discovery (though it has gotten worse in my opinion), I would literally have to pay thousands and be stuck on the same artists.\n\nSuch a stupid idea that music streaming should work like OnlyFans, the issue is that record labels and such constantly fuck over artists.", "label": 0}
{"text": "\"Sorry you guys are lame.\"", "label": 0}
{"text": "even back when people were pirating music, musicians made more money from sales than they do from streaming.", "label": 0}
{"text": "Lol", "label": 0}
{"text": "I get the artist's intent, but I think it trivializes the event and demotes an attempted removal of the government by a mob to simple vandalism.", "label": 0}
{"text": "Sooo how it used to be buying multiple CDs a month", "label": 0}
{"text": "I mean Spotify did change things, they paid a much leaner and realistic price for the music, which means that a lot of parasitic execs and employees are now taking too much to allow for the business to happen.\n\nThis isn't the first time. New record companies, that work on a leaner model that leaves enough for the artists will appear, and the artists will flock there. The thing is artists could recover a lot of this with live music, seeing streaming as more of an ad for their tours, but with 2/3s of the money going to Ticketmaster from the get-go, then the venue getting its cut, then it going through all the execs and what not, then finally it goes to the producer, authors, and finally the musicians get whatever is left. Well, you realize they get pennies on the franklin ($100).", "label": 0}
{"text": "As someone who was a courier before GPS really took off, I do this unironically.", "label": 0}
{"text": "Gotta unionize. It's the only way to make these corporations pay the workers who generate their massive profits their fair share.", "label": 0}
{"text": "Spotify doesn't even make profits. It they operated on the same pay structure they'll go bankrupt soon.", "label": 0}
{"text": "Dang. I think I start taking feet pics.\n\nPeople told me I could be a feet model back in the days.", "label": 0}
{"text": "A sexy foot for me would have high arches, toes that aren’t like messed up from tight shoes, toe nails not overly small (so they can display polish well).\n\nI guess we don’t know how lucrative they are compared to other nudity. There are people like myself who would rather look at feet than nudity so there is a market. I’m guessing lots of people would prefer to just show feet so it may be a crowded market to get into.\n\nI think people will pay for feet if there is some custom allure to them, eg a celebrity, or particularly beautiful feet, or the model is willing to customize like include more specific fetishes, make custom videos, etc.\n\nI’m not turned off by other body parts but just also not that turned on by it", "label": 0}
{"text": "They can still leave a VM and you can see the number but you're probably a lot more important than I am. It just doesn't ring.\n\nOf course, I don't have to worry about a boss calling from a known telemarketer number going on in my life. Other people get more calls than me.", "label": 0}
{"text": "Is there a niche for crusty work boot pics? Asking for a friend.", "label": 0}
{"text": "thats part of why its frustrating tbh. *spotify* might not be able to afford paying artists more but the shareholders of spotify, the ones who report to be making more and more and more and more and more money every year absolutely can. but because theyre just the people who own spotify and not spotify itself, they cant be expected to do anything but continue their econonmic vampirism. \n\nspotify CAN afford to suddenly start paying exponentially more to artists, capitalism has just successfully convinced us that we shouldnt expect that of them. that it would be unfair to expect the insane amount of money we give to these shareholders to, idk, go back into the company? literally fulfill the purported purpose of currency and circulate? \n\nim not mad at you lol im just mad at how fruitless it is to be aware of this and completely unable to affect change in it.", "label": 0}
{"text": "Thousands (if not millions tbh) of people try to sell feet pics and think it's easy money, those who even reach 3 figures made are a handful and those who can keep at it for more than a couple months are even less. Even finding a single customer is a challenge.\n\nThe ones making enough money to make it worth their time are amongst the elite. It's an extremely saturated market, populated by tons of people who have zero understanding of the kink itself and think pointing their phone down is gonna make themselves swim in money because for some reason this is what is told online constantly.\n\nThe reality is a ton more work and effort, both in the content and outside of it with all the networking required, in one of the most heavily saturated sex-work market.\n\nSource : Nearly 2 year of sexwork including lot of ff content, saw countless people around me try to get into it with sparkly eyes and miserably fail", "label": 0}
{"text": "Lol probably", "label": 0}
{"text": "That's such a bad take away from what they said. It ignores literally everything they said. Working from home means that the two major points in the day do not have as many people driving because they don't need to. They're working from home. They'll drive if they want to or need to, but there isn't a forced time frame everyone is driving. It isn't hard to understand.", "label": 0}
{"text": "They are going to be disappointed, wrong sort of cheese.", "label": 0}
{"text": "Are you arguing that Catholics aren’t for having lots of kids? Because that’s the exact opposite of the Catholic platform", "label": 0}
{"text": "feet guys fuming rn", "label": 0}
{"text": "Depends on the nun. Could range from canceling each other out (so I guess they turn into a bowl of bland school cafeteria macaroni) to Dolores (the one that ruler smacks people for being lefthanded) going Legendary Super Sister.", "label": 0}
{"text": "I don't know who that is but also I don't care. You're a shit society and why would you expect anything different?", "label": 0}
{"text": "This has feathers mcgraw written all over it", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "CDs not so much, but vinyl has seen a pretty large resurgence the last few years. ", "label": 0}
{"text": "Someone check Quentin Tarantino's finances.", "label": 0}
{"text": "Ok.\n\nFirst of all I agree that Spotify needs to pay their artists better.\n\nNext, It's not hard to imagine a celebrity making wild amounts of money from onlyfans.", "label": 0}
{"text": "No one listens to her anymore is what’s being said here", "label": 0}
{"text": "That's not what I said at all. I said it's weird to convert to Catholicism and then go around shit talking celibate people when the Church explicitly teaches that celibacy is holier and more noble than being married because it emulates Jesus.", "label": 0}
{"text": "Did you even read these links or did you just link them for the headlines?\n  \nBecause the first one says:\n  \n‘But how do we know for sure that cloud seeding didn’t help create the massive thundercloud? How do we know for sure that cloud seeding didn’t prompt the thundercloud to release its water all at once?\n  \nSimple. The cloud seeders had not been seeding. Although not much rain falls during the winter and spring in Dubai, they are considered the desert’s “rainy months.” As Professor Ambaum explains about the weeks preceding the flood of April 2024, “There would have been no benefit to seed these clouds as they were predicted to produce substantial rain anyway.”’", "label": 0}
{"text": "So hear me out... Foot bath water, amirite?", "label": 0}
{"text": "Not sure. He broke the law when he started trying to influence the election.", "label": 0}
{"text": "Obviously your clueless about what it really was cause all you do is sit in your echo chamber", "label": 0}
{"text": "are you expecting a reply? I bet you felt sigma wolf Christian bale after typing that.", "label": 0}
{"text": "Looks like feet 🦶 🤷‍♂️", "label": 0}
{"text": "Most likely Pitbull's feet", "label": 0}
{"text": "I go out of my way to buy albums directly from the artist through their website. Even if I never listen to it it’s a small way I can support them.", "label": 0}
{"text": "This is more someone had a deadline, didn't have the illustrator spell check on, and lack of checks and balances when it came to the design.", "label": 0}
{"text": "I agree, but the Reddit powers that be also adjusted their algorithm to increase visibility of controversial and/or high comment posts.\n\nShitbot posts this garbage. Other shitbots comment a lot. Boosts to the forefront of feed regardless of how you have it sorted. Reddit uses and allows the use of bots and algorithms in pretty dystopian ways.", "label": 0}
{"text": "What what what?\n\nIt’s the mob way of buying vote: you have a chance of winning $.\n\nThe $ is a lie? (who’s shocked?) Doesn’t matter, still illegal.", "label": 0}
{"text": "Can you even post feet pics to Spotify?", "label": 0}
{"text": "Ped Zeppelin", "label": 0}
{"text": "Wonder if it’s the Fountain of Youth?", "label": 0}
{"text": ">Spotify is functionally a near monopoly\n\nAre you crazy? You never heard of Apple music, YouTube music, not to mention niche services like Tidal?\n\n>They're absolutely taking as much as they can from artists\n\nThe record labels are doing that, they give artists a pittance of the money they get from Spotify. Spotify barely makes a profit and it's been losing money most of its existence.", "label": 0}
{"text": "Feels like you’re conflating Priesthood with how the church encourages laypeople to behave, e.g., have as many kids as possible to further populate the church", "label": 0}
{"text": "Welcome to fapitalism - Only fans ", "label": 0}
{"text": "I got my wife to pull a Blade Runner. It was so good it made us both decide giving up porn altogether was probably for the best lol", "label": 0}
{"text": ">If Spotify operated on the same pay structure as only fans….. idk who knows.\n\nNo one would use it. I guess young people (young being relative, I'm only 28) don't remember but music used to be the most pirated media out there. That is until Spotify and other streaming services basically killed music piracy. There used to be hundreds of websites where you could download mp3s and now no one uses them.", "label": 0}
{"text": "Kids today don't know how rampant music piracy used to be. Spotify basically wiped it out. Artists can cry about earning pennies on their songs but at least they're getting something. Pirating mp3s got them nothing.", "label": 0}
{"text": "Seem help my friend, all these delusions are not health for you", "label": 0}
{"text": "Those are some gross feet 🦶", "label": 0}
{"text": "Okay. So it is illegal to pay someone to vote. Good to know and thanks for linking that. Still though, Musk isn’t paying people to vote or vote for anyone in particular (not expressly anyways).", "label": 0}
{"text": "This is a really dumb take. They paid radios to play songs because that drove sales of singles and albums. Streaming has cannibalized those sales. So while I could agree to saying it would make sense for labels to pay for features on popular playlists, Spotify is not a platform that acts as a connection between artists and fans. It’s radio for the internet age. And don’t forget, artists also got paid for radio plays. \n\nAside from that, the data selling you’re referring to is roundly illegal in the EU, and would be an enormous invasion of privacy regardless. People don’t listen to music to then have spam from those artists forced upon them, even if they actually like the artist.", "label": 0}
{"text": "What if I told you you could get OF for free...", "label": 0}
{"text": "I doubt it's this way with other genres, but metal bands pretty commonly still press to vinyl and CDs, and the vinyls at least often sell out very quickly. I saw this band called Fallujah in May, who isn't completely unknown but is definitely very niche (they've got under 40k monthly listeners right now on Spotify) and when I asked about vinyls for the new remaster of their now 10 year old album, he told me they sold out before he even got one himself. Obviously that's an example of a band underestimating the demand for vinyl but I think it also shows that at least in metal circles, there are people still buying full albums.", "label": 0}
{"text": "I swear as a guy my feet look just as good as hers. Why isn’t the male foot genre more popular 😔", "label": 0}
{"text": "Famous Yeti’s Pizza.  Sign me up for that franchise !", "label": 0}
{"text": "I feel for artists. Genuinely. Its a hard fuckin game. \n\n\nBut if we’re comparing the market saturation of music vs the feet pic industry, feet are gonna win income wise every time lol", "label": 0}
{"text": "Yes but Lukaszenko still refuses to join the war in Ukraine because he knows it's a lost cause, and he must be under intense pressure from Putin to attack Ukraine. Probably Putin would like to replace Lukaszenko with someone who would attack Ukraine", "label": 0}
{"text": "He mispronounces his last name", "label": 0}
{"text": "Back in the day people would download mp3s instead of paying for Spotify. I guess everyone's forgotten how rampant music piracy used to be. Of course Spotify's model is unsustainable, it had to beat something that was free. And it did.", "label": 0}
{"text": "I didn’t know there was a feet pic market on Spotify", "label": 0}
{"text": "It's evocative, though I feel like the poop should have been much more or much less cartoony.", "label": 0}
{"text": "Fun! I've made more money on spotify than I have on /r/myleftfoot", "label": 0}
{"text": "The article is not saying that's what happened, the article is saying that the owner is suing because they believe the seat change caused this to happen. It could be both! It could be that the dog was entirely unfit to fly. It could be the seat change. People are arguing because it's not known lol", "label": 0}
{"text": "Confused deaf people?", "label": 0}
{"text": "I think they’re onto something", "label": 0}
{"text": "Agree", "label": 0}
{"text": "No I don’t.  You do", "label": 0}
{"text": "Snoop said his paycheck was ridiculous from Spotify. Less then $45,000 for reaching a million streams.", "label": 0}
{"text": "Having seen her feet, I understand where the music came from", "label": 0}
{"text": "> [open your eyes fool](https://i.imgur.com/aB4QJS9.gif)", "label": 0}
{"text": "Definitely the pigs.", "label": 0}
{"text": "David Lowery did a good write up of this situation more than 10 years ago, and doubt the situation has improved\n\n[https://thetrichordist.com/2012/04/08/meet-the-new-boss-worse-than-the-old-boss-part-1/](https://thetrichordist.com/2012/04/08/meet-the-new-boss-worse-than-the-old-boss-part-1/)", "label": 0}
{"text": "I thought he was Putin's sphincter boy?", "label": 0}
{"text": "Most of the onlyfans models money comes from a few whales. Just like freemium and gacha games. Just paying the subscription doesn't get you everything, they have pay per view videos and pics too LOL. Most people can tell it's a scam, all you have left are the few whales with money to burn.", "label": 0}
{"text": "Is that a clash royale reference what is that", "label": 0}
{"text": "TBH, it’s not just a China thing.\n\nI’m in the U.K., not a drop of China in me. But I still have times where I think like I’m still 20 and earning minimum wage part time. Not 36 and in a full time salaried job that, while not amazing, is still 3x what I earned back then.", "label": 0}
{"text": "As A Black Man 2: Insurrectionist Boogaloo", "label": 0}
{"text": "Those 5 votes will help.", "label": 0}
{"text": "Gotta give those free samples", "label": 0}
{"text": "So then how to addendums to filters work? Do they just excise the data they have and spam it with a ton of new data that features the filter response?\n\nI don't think I've ever run into an LLM that censored on the client side. It seems to react to what the bot will message.\n\n>so it is not possible at all with the current architecture to do something like that using a simple prompt. The simplest thing is to inject it at the beginning of every input \n\nI think I've lost your train of thought. \"inject it at the beginning of every input\" is the solution that I was thinking of. It sounds like you're saying it's not possible, but then it is? Sorry.", "label": 0}
{"text": "\"Critical juggalo vote\" LMFAOOOO", "label": 0}
{"text": "Yeah I basically pirated all my music, literally everything, up until Pandora became a thing. From like 2004-2011 all I did was pirate music with the occasional (we're talking like once every six months) album purchase, especially if the album had a cool gimmick like TOOL's weird albums or I remember buying Coheed and Cambrias album because it came with booklets the told the story of the album.", "label": 0}
{"text": "In the Australian sun with no sunscreen for two hours.", "label": 0}
{"text": "So just another regular day at walmart?", "label": 0}
{"text": "She needs potatoes ", "label": 0}
{"text": "music sales were still far more profitable even with piracy than Spotify currently is", "label": 0}
{"text": "Makes sense… I’ve never been able to find feet pics on Spotify", "label": 0}
{"text": "Source?", "label": 0}
{"text": "Cool beans. Does screaming into the void of the internet feel good? \n\nI think Pittsburgh is pretty neat.", "label": 0}
{"text": "I read Leicester could be where the truck went.", "label": 0}
{"text": "Helen Mirren would like to know, Clearbay", "label": 0}
{"text": "Back in the day it was just seedy brick weed. We dropped a whole 1/4 into that brownie mix though.", "label": 0}
{"text": "I hate this reality more and more with each passing day.", "label": 0}
{"text": "*Girl, same.*", "label": 0}
{"text": "Yeah I'm skeptical about the validity of this story in general. I know that Spotify pays artists shit, but she's got 7.5 million listeners right now. If she made the absolute minimum from Spotify which is $.003 per stream (she definitely makes more since she's a big artist but I'll be generous), even if every listener only listened to a single song that month (obviously not actually the case), she'd be making over $22k a month. That's just from Spotify too, she probably makes another ~$50k a month from the other streaming services.\n\nMaybe she does make more from her feet pics on OnlyFans, but she still makes really good money from her Spotify.", "label": 0}
{"text": "Winning in life godamn", "label": 0}
{"text": "No. Pizza doesn't get that hot. Just like how it doesn't get destroyed in cookies/brownies/etc.", "label": 0}
{"text": "Is it just me or is feat.Pics starting to sound like an awesome stage name?", "label": 0}
{"text": "I sure hope so.", "label": 0}
{"text": "This is more—we used to be able to afford a person to design the T-shirt, and a person to proof it. Now, we just ship it out wihtout checking cause corps aren't paying", "label": 0}
{"text": "That's what they get for stealing other people's fucking oil.  A shared space doesn't mean \"what's yours is mine\"", "label": 0}
{"text": ">imagine being and artist and having nearly 8 million monthly listeners on spotify but earning more money from having 1000 people subscribe to pictures of your feet. don’t hate the player, hate the game.\n\nImagine being a music executive and not ever contributing anything to her work and earning the majority of Lily Allen's spotify money while she complains that its spotify's fault for not paying her more than the estimated $1.4 million per year.", "label": 0}
{"text": "Yeah that about sums up the 2020’s so far, I’d say.", "label": 0}
{"text": "Nine Inch (toe) Nails\n\n\nthe Blisters of Mercy", "label": 0}
{"text": "A parolee could get sent back in", "label": 0}
{"text": "Cool beans? That's fucking lame. I'm not screaming at anything, just responding to a propogandized dipshit. Seriously you sound dumb as fuck parroting billionaire owned media like its truth, haha. Fuck that hilly shithole and your gay fish.", "label": 0}
{"text": "Heelen Ready", "label": 0}
{"text": "What flavor of the month? The fuck are you talking about lmao", "label": 0}
{"text": "not surprised\n\nspotify is horrendous", "label": 0}
{"text": "Wow. Wish I had good feet, thats decent money.", "label": 0}
{"text": "Looks like feets back on the menu boys", "label": 0}
{"text": "Pretty much. What would happen now is music piracy would have a massive resurgence.", "label": 0}
{"text": "spotify has the money to pay artists more for streams. they just like hoarding it for the ceo and shareholders", "label": 0}
{"text": "Yeah, you can typically still buy CDs from most major artists. I don't think that will die out anytime soon because frankly it's dirt cheap to make CDs. Like, even if they went to a burn on demand model they'd still make money without making them too expensive. ", "label": 0}
{"text": "I would imagine selling feet picks on Onlyfans is more profitable than selling them on Spotify.", "label": 0}
{"text": "is she torn between the grossness and the large numbers on the checks?\n\nsrsly, that sucks, she's got some super fun songs", "label": 0}
{"text": "Oh likely.  I always found her music to sound like feet.", "label": 0}
{"text": "\"Monopoly\" is almost never a literal term meaning only one single company controls 100% of the market.\n\n>[Spotify (36%), Apple Music (30.7%), and Amazon Music (23.8%) boasted a cumulative 90.5% subscriber market share in the U.S. as of February of 2024.](https://www.digitalmusicnews.com/2024/07/05/music-streaming-market-share-us/#:~:text=With%20this%20pertinent%20background%20information,as%20of%20February%20of%202024.)\n\n90% is handled by 3 mega corporations. When that was the case for the telecomms industry, or the steel industry, we broke them up because at that point market forces don't work the way libertarian types like to imagine markets should work.  That's my point.  \n\n>The record labels are doing that,\n\nRecord labels certainly can make things worse, but even still, Spotify has a dogshit payout structure, even for independent artists.\n\nNow, if you wanna argue that these tiny bands with 1000 listeners a month would have been tiny bands with 100 CD sales a month 20 years ago, and they've always been broke, that adds up to me.  Either way, your first comment reads as someone inexplicably going to bat for one of the most complete monopolies in history.  They're radio/record sales/distribution, and half of what labels used to be all in one.  Even 36% of that is monumental compared to one of the major labels in 1990.\n\nThe point is, all of these rules are completely made up, we can make them whatever we want, and there's no reason the current structure is automatically good, it's not EVEN based on market forces (not that those outcomes are inherently good, imo), it's just what Spotify has decided it wanted to do, lol.  Why the fuck are you going to bat for them?  I want my musician friends eating better.", "label": 0}
{"text": "Nah, directly on the produce, without breaking eye contact with the customers.", "label": 0}
{"text": "Should release a song about selling feet picks on Onlyfans.", "label": 0}
{"text": "Finally! I’ve been on the fence until now", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "I'm still waiting for Ja Rules endorsement to make my final decision", "label": 0}
{"text": "Looks like feet’s back on the menu!", "label": 0}
{"text": "In the article, they estimate that Lily Allen makes $1.4 million a year from Spotify streams… idk if that’s true or not, but it directly contradicts the title of the article.", "label": 0}
{"text": "I mean, it's the internet, you can lie.", "label": 0}
{"text": "My payout on Spotify is about a third of a cent per stream. It varies artist to artist depending on where their fans are though. 50,000 plays for me has netted me less than $150.", "label": 0}
{"text": "You sound pretty upset. Picking a fight with me over a silly comment. Seems butthurt to me. \n\nGo look at bushes on reddit and cool off, champ.", "label": 0}
{"text": "Honestly that's probably not true in many cases. I wouldn't be surprised if there are large networks and agencies that manage OF creators, own their accounts, and take huge cuts of their revenue. Even YouTube has those (with the most recent controversial ones being V-Tuber companies). ", "label": 0}
{"text": "Historic", "label": 0}
{"text": "Luckiest raccoon ever", "label": 0}
{"text": "I mean, not being able to spell is on point for being young, though they probably don't mean that young.", "label": 0}
{"text": "Haha, drag their feet...", "label": 0}
{"text": "Where is Ja???", "label": 0}
{"text": "Um, her feet are better than her music. I don't know what to tell her.", "label": 0}
{"text": "The term monopoly almost never refers to a literal single entity controlling 100% of a market.  We broke up the telecomms industry for less.  We broke up the steel industry for less as well.", "label": 0}
{"text": "Half price muffins coming soon", "label": 0}
{"text": "Another wingnut and fraudster from the Right. Figures.", "label": 0}
{"text": "While this seems silly... Juggalos are a fucking rabid fan base. Maybe not the largest in numbers but gat damn they are dedicated.", "label": 0}
{"text": "Or people will switch to using youtube music, which my guess pays artists even less", "label": 0}
{"text": "\"***critical***\" ???", "label": 0}
{"text": "Lol. I'm sharing information from lawyers with you, and leon has ignored his lawyers advice many times. I don't claim to know law better than lawyers. That's you.", "label": 0}
{"text": ">In 2017 Christopher Owens was at a crossroads. After a decade spent making records and touring them – initially with cult indie band Girls, then as a solo artist – he suddenly found himself without plans. His fiancee and partner of seven years suggested they could start a family. Owens was starting to like the idea of being “the best stay at home dad” when he got on his 1982 Honda MB5 motorbike.\n\n>The crash wasn’t his fault. The SUV that pulled out was making an illegal turn. Owens heard screaming, saw blue skies and wondered what was going on. Slowly he realised he’d been knocked down – the screaming was coming from the woman who’d hit him. Although in pain, his immediate instinct was to hug her and tell her he was fine. Owens staggered home to recuperate.\n\n>“I denied the ambulance on the scene,” he says today, reliving the moment from his home in New York City. “I must have had so much adrenaline because the next day I woke up and it felt so much worse. My legs were black and blue and I think I’d broken a bone in my foot. I should have gone to hospital but the truth is I was terrified of the money I might have to pay. I didn’t know what the bill would be like.” Such is the precarity of life in the US for the countless musicians without health insurance.\n\nThis is something that happened to a guy whose band has at least 5 songs with more than 3 million streams on Spotify (and some more as a solo artist.) If that level of popularity, which isn't superstar levels but still decent, can't pay for health insurance, then that streaming model is absolutely fucked and shouldn't exist.", "label": 0}
{"text": "Imagine being a guy, making more money working at McD at minimum wage than from selling bath water.", "label": 0}
{"text": "Usually that headline ends before the word \"vote\"", "label": 0}
{"text": "The emails? It’s just email! Who doesn’t have the internet in this day and age?", "label": 0}
{"text": "yup,  about 20 CDs a month... that is quite a lot. Depending on what albums you got, some could run over 20/CD", "label": 0}
{"text": "Why are there quotation marks around the word \"berries\"?", "label": 0}
{"text": "Which of my words did you interpret to be me complaining that we are wasting money on something other than housing migrants?\n\nOr did you just make up that assumption from literally nothing?", "label": 0}
{"text": "Is your comment a self-fulfilling prophecy?", "label": 0}
{"text": "Piss is actually good for plants growth, my brother wondered why his plants had grown so much during their stay at my place, it's because I'm a lazy alcoholic, your welcome.", "label": 0}
{"text": "> Edit: There are a fair few corporate boot lickers in here\n\nClassic reaction to getting called out on your bullshit", "label": 0}
{"text": "\"I’m a black gay guy, and I can personally say that Obama did nothing for me, my life only changed a little bit and it was for the worse. Everything is so much better under Trump though. I feel respected — which I never do when democrats are involved.”\n\n-Dean Browning (not gay, not black)", "label": 0}
{"text": "Would be good for everyone if big names like TS etc all got together and forced Spotify to pay all musicians a reasonable royalty. They have the power. Spotify could do it if they want to.", "label": 0}
{"text": "Okay, society is doomed.", "label": 0}
{"text": "That’s cute ears raging at two hot spots already. Would be cool if China and North Korea decide to be a part of the chaos as well, we will be a part of really fun times (sarcasm, just in case some didn’t get it)", "label": 0}
{"text": "They found it three days later in a storage house and brought it to the evidence room, but it mysteriously dissapeared from there.\n\nThe daily morning meetings at the precinct stank of cheese farts for weeks!", "label": 0}
{"text": "Insane clowns don't endorse insane clown. \n\nBetter headline", "label": 0}
{"text": ">If they won every election easily, how would they convince you to donate to their campaign? 😉\n\nThat's a fundamental problem on its own, here in Germany the government partially funds political parties with a fixed price per received vote. We don't have things like PACs here.\n\n>I think your comment is a perfect explanation of why not all black people vote blue; because they are not a monolith, yet are treated as such.\n\nIndeed, but I just cannot think why a Black person should vote for a party filled to the brim with racists. Yes, there were a few Jews who voted for Hitler for whatever reason, but they were an utterly tiny minority (and many paid with their life for their foolishness).\n\n>So Blue MAGA loses voters because they don't understand the issues their voters care about? Israel/Palestine is one of the biggest topics for young left leaning Americans, but you refer to it as \"utter bullshit\" which is not far off from Harris' official position.\n\nSame here: the fact that young people would rather risk fascism - everyone has seen the first four years of Trump and everyone has seen what Project 2025 would bring - than whatever the fuck Harris is gonna do regarding Israel/Palestine is mind-boggling.\n\nI can get conservative or wealthy people voting for Trump, he embodies what they want, but for fucks sake I'd rather accept collateral damages in urban warfare against terrorist groups openly sharting on international law than voting for Trump. The fuck is wrong with their priorities?! And the fuck is \"queers for palestine\" anyway, if these dumbass morons would even step a single foot in Gaza they'd end up stoned and their bodies dragged through the streets, there have been more than enough examples of that happening...", "label": 0}
{"text": "'s back on the menu, boys!", "label": 0}
{"text": "I mean edibles do all sorts of good things for me and I'd still panic if I felt something coming over me that wasn't drugs I know I took. Even if I knew it was weed from the feeling I'd still have a bad time worrying what else I've been slipped without my consent.", "label": 0}
{"text": "Maybe that's because her music is shit and her feet are sexy as fuck?", "label": 0}
{"text": "Pulling in them juggalos like a fuckin’ magnet", "label": 0}
{"text": "I knew I was being generous by saying pennies.", "label": 0}
{"text": "Remember when juggalos were classified as a gang? 🦄", "label": 0}
{"text": "It was really bad this year. I've been to all 3 years it was on, and this year the merch was just terrible quality materials and bad prints. Overall it is the worst overpriced merch I've ever seen at a festival, and I've been to at least a hundred.", "label": 0}
{"text": "There fan base is nearing retirement age.", "label": 0}
{"text": "They would have to keep their artists off of Spotify is the issue and somehow collect revenue.byilding the depth of Catalog to get a good negotiating position might be impossible.", "label": 0}
{"text": "No shit.", "label": 0}
{"text": "At least since the 50s, musicians always made most of their money on tours and concerts, not by selling music. \n\nBack in the days of record labels, they were keeping most of the proceeds in exchange of services such as distribution, access to recording equipment, management, writers, etc. The only thing that changed in a real sense since then is that most of the talent that's not under the umbrella of a big record label has the distribution part covered, but otherwise the shit proceeds are still the same. The only reason streaming services make a lot of money is the sheer volume of content they have to offer, because on a per paying customer level their earnings are pretty shit too.", "label": 0}
{"text": "Jesus fuck what the hell kind of dystopian mess is going on in the US", "label": 0}
{"text": "Didn’t know they had feet pics on Spotify", "label": 0}
{"text": "Have you tried being the richest man in the world?", "label": 0}
{"text": "I get to post this tomorrow", "label": 0}
{"text": "She needs to show that superfluous third nipple of hers. Then she'll really rake in the dough.", "label": 0}
{"text": "The issue is that politicians now have incentives to be *fucking useless* at their jobs. The less housing gets built, the more expensive current houses become, which benefits existing homeowners and earns them their vote. They can also get votes from environmentalists who hate high-density cities, and nationalists who think new construction would drive immigration.\n\nWhat are the incentives to build? The *chance* of *possibly* getting a few votes from new homeowners... who will then immediately campaign to stop you from building any more, because pulling the ladder up behind you is always the easiest path to success.", "label": 0}
{"text": "Just as many of them blame the woke, or see themselves as advocating for better with their spending when they really aren't.", "label": 0}
{"text": "The National Gang Intelligence Center estimates there are 1 million Juggalos in the US. Depending on where they live that is kind of a big deal. They are a hive mind like the MAGA cult.", "label": 0}
{"text": "I dunno… I think my feet are nicer than hers", "label": 0}
{"text": "I like it!", "label": 0}
{"text": "Damn those feets are looking soooo feetlike", "label": 0}
{"text": "Yes ! Literally dozens of votes secured !", "label": 0}
{"text": "That’s… actually surprising", "label": 0}
{"text": ">90% is handled by 3 mega corporations\n\nYeah but in your original comment you said Spotify alone was a monopoly. Which isn't true.\n\n>Record labels certainly can make things worse\n\nThe Record labels ARE the problem. You're crying about 90% of the streaming marketing being owned by 3 companies and it seems you don't know that 90% of the music industry is controlled by 3 record labels, Sony, Universal and Warner. These are the companies you should be complaining about. \n\n>it's just what Spotify has decided it wanted to do, lol\n\nI really don't understand why the hate for artists not making enough money is directed at Spotify. They rarely turn profits, and have consistently lost money for most of their existence. They give 70% of everything they earn to the record labels. The record labels then gives artists a pittance of that. Doesn't matter if Spotify gives even 100% of the money it makes, cause record labels keep the majority.\nThe inherent unprofitable nature of music streaming is even more true for Apple music, YouTube music and Amazon music, whose massive losses are subsidised by the enormous profit their parent corporations earn through other sources. \n\nSo no, this isn't \"just what Spotify has decided it wants to do\". They already give the maximum they can to record labels without going bankrupt.\n\n>I want my musician friends eating better.\n\nThen tell the record labels to give artists their fair share.", "label": 0}
{"text": "Do they have the power? My understanding is in most cases, labels own the rights, and they likely sign long term contracts with streaming services, they'd need to wait until those are renegotiated,  and then the labels would have to be on board.... and they mostly do represent the big names who see some payouts, so why would they want to benefit indies more? Their whole niche is built on finding indie talent and getting them better deals- not making it easier for them to he truly indie.", "label": 0}
{"text": "Some artists would get mega rich and lily allen would make even less money.", "label": 0}
{"text": "It's really always been money that makes the world go round.  Racism, sexism, homophobia, etc has always been secondary.  Whiteness as a concept only exists to contrast the blackness that was used to justify slavery.  Race only exists to justify slavery.  Hillary Clinton and Ted Cruz, Jeff Bezos, and the rest of our ruling class are just as uncomfortable in a West Virginian trailer park as they are in the hood of Baltimore.  The racism splits members of the working class in awful ways, but to them, the only color that matters is green.\n\nIt's the same reason black cops have zero issue killing black folks, they do it at the same rate as white cops.  For that matter, white cops have no issue killing white folks either.\n\nI find that often times folks get hung up ranking people by intersectional minutia, and that can trick people into concluding that all we need is a more diverse ruling class.  The ruling class wastes no time worrying about poor whites vs poor blacks, except to invent new ways to keep us easy to control.  We shouldn't waste any time either in conversations about the rulers.  We're all just cattle to them.", "label": 0}
{"text": "\"Fuckin' MAGAs, how do THEY work' -- Violent J", "label": 0}
{"text": "Then the reversal of the classification as fiction was the proper course of action, just as I had written.\n\nI do not know why people down-voted me.\n\nBooks and other documentation of questionable historicity have existed throughout history.  Books about historical events that cannot be corroborated. Books about myths passed off as historical. Books about UFOs and the coverup of crashed space ships. Books about magical powers. Books about divine intervention. Falsified memoirs and journals. Books pushing junk science as fact. Books pushing magical thinking. Science publications that are found to be inadequately peer-reviewed, found to have unverifiable data, found to have inappropriate citations, or found to have some other issue (I am thinking about the attempts to disguise creationism and its axioms via the guise of intelligent design in order to give it a veneer of scientific credibility by its proponents in order to get their ideology into classrooms).", "label": 0}
{"text": "I wonder what Alfie's cut is 🤔", "label": 0}
{"text": "Who?", "label": 0}
{"text": "Red Ryan enters the chat", "label": 0}
{"text": "It would be so difficult to write a more concisely stupid post than this.", "label": 0}
{"text": "Capitalism is a pyramid scheme that all falls down when you can't convince the next person to take on more of the burden than the one before it.", "label": 0}
{"text": "Can’t tell if this is sarcasm.", "label": 0}
{"text": "huh? You need a device for a social life? You don't think children can, idk, talk in person? ", "label": 0}
{"text": "When you run a circus you get clowns.", "label": 0}
{"text": "Yeah. People who aren’t releasing independently are making even less, and music that doesn’t reach a threshold of streams (I think something like 3,000 streams a year) doesn’t get any payout at all", "label": 0}
{"text": "The music industry’s version of OF is essentially touring. It’s a temporary exclusive connection you get with an artist that people are willing to pay for.", "label": 0}
{"text": "> [Is that a clash royale reference\n](https://i.imgur.com/qBZrBg2.jpeg)", "label": 0}
{"text": "Also, wait, haha. You're a man that waxes his bush? That's pretty fucking gay and pathetic. Sad fuck...", "label": 0}
{"text": "Ignore this tinfoil hat wearing Soros conspiracy theorist.", "label": 0}
{"text": "That's the next heist.", "label": 0}
{"text": "Who does he think is picking up the phone when the Little Green Men show up in Minsk like they did in Crimea?\n\nI wish the people of Belarus every success if the Russians do decide to move Putin's drinks cabinet a hundred kilometres closer to Paris, but they don't have a lot of friends.", "label": 0}
{"text": "Besides pretending to be black on Xitter, he...\n\nAllegedly defrauded a couple out of a house.\n\nOwes 6.7 million dollars in back taxes to the state of NY.\n\nIs a self-admitted opioid addict.", "label": 0}
{"text": "Watching the video I don't think he remembers either", "label": 0}
{"text": "Wait, Much Music is a real thing and not something How I Met Your Mother made up?", "label": 0}
{"text": "omg i lost my shit reading this. Thank you, stranger!", "label": 0}
{"text": "How many times am I going to be forced to see this reposted onto different subreddits?", "label": 0}
{"text": "Then don’t slow your music on the platform…… ", "label": 0}
{"text": "Peppridge Farms remembers", "label": 0}
{"text": "Juggalos would never.", "label": 0}
{"text": "“MAGAts, how do they work?”", "label": 0}
{"text": "Why do you allow them across to your content then?", "label": 0}
{"text": "Toe King Heads", "label": 0}
{"text": "Dedicated and medicated", "label": 0}
{"text": "Lol what the hell is he talking about? It's like he looked up and saw Putin pulling his strings for the first time. 😂", "label": 0}
{"text": "She had 2 good albums.  I think she lost her mojo.", "label": 0}
{"text": "I doubt NATO let's poland fall, if russia could even muster something like that, even if they were the aggressors. just because they don't have to join doesn't mean they wont", "label": 0}
{"text": "That was a bit misleading though. It was for a single song that through heavy use of sampling and featuring, he was one of about 20 people getting credit for. There was a huge splitting of the payments from it, so he would have gotten a lot more if that wasn't the case.", "label": 0}
{"text": "Feet?  Yeah, I've never understood that particular mental illness.  Sorry Quentin.", "label": 0}
{"text": "There's a raccoon loose in the department store!", "label": 0}
{"text": "Lots of disenfranchised, rural white kids in that community.", "label": 0}
{"text": "Who’s next Pitbull?", "label": 0}
{"text": "I’m a 47yo guy and I manage to make just as much from Spotify as I do for my feet pics.", "label": 0}
{"text": "TIL about WikiFeet, so anything goes, I guess.", "label": 0}
{"text": "Jeff Bozos wants the orange clown’s tax breaks for actual billionaires.", "label": 0}
{"text": "I like to listen to feet before I see them", "label": 0}
{"text": "I bring the bags", "label": 0}
{"text": "Sure but saying that someone shouldn't make music unless they are literally at the top of the charts is nonsense.", "label": 0}
{"text": "I have always been down with the Clowns!   I wanna celebrate with a Faygo.  FDT", "label": 0}
{"text": "Sorry, but your post has been removed because it contains URL campaign spam.  Please remove utm_source and anything after from your URL and please submit just a direct link to the article.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "After he was a part of the Fyre Fear fiasco, his career tanked hard core.", "label": 0}
{"text": "Didn't Taylor Swift publically exit Spotify a few years ago because the pay was so shit?", "label": 0}
{"text": "lol", "label": 0}
{"text": "Prime Trump base, even if they don't vote blue, they might just not vote with this endorsement in mind.", "label": 0}
{"text": "Eh, I've seen nicer feet.", "label": 0}
{"text": "Yeah I guess my issue is mainly with the comedic effect of the piece over something serious that many are still coming to terms with. Plus there are those who were involved or supporters who would prefer it be characterized as not that serious.", "label": 0}
{"text": "True.  I retired 3 years ago.", "label": 0}
{"text": "I have never seen another kid being bullied for not having a phone. In fact, when I was in middle school, some of the most popular kids never had one. ", "label": 0}
{"text": "> Rachel’s Beef Trifle.\n\nI don't know why but that sounds like a weird euphemism", "label": 0}
{"text": "For not having their kid have a smartphone? Lol!", "label": 0}
{"text": "My brother was there the day Harambe died. Granted he was about 600 feet away running the carousel and had no decision making capabilities what so ever beyond keeping nearby guests calm. But still he heard the shots that were fired and killed Harambe and this was a part of history.", "label": 0}
{"text": "there are more juggalos on earth right now, than there are polar bears", "label": 0}
{"text": "They're also overrepresented in crucial Midwest states.", "label": 0}
{"text": "My thoughts exactly.", "label": 0}
{"text": "Oh neat", "label": 0}
{"text": "I made music for fun in college back in 2021-2022. The last song I released was summer 2022. I'm still raking in $450/month from spotify. At my absolute peak, I was making $1200/month. Which is not bad at all, considering it's free passive income.", "label": 0}
{"text": "How much does Spotify earn from feet pics on OnlyFans?", "label": 0}
{"text": "Spotoefy", "label": 0}
{"text": "Potting mix = soil with markup?", "label": 0}
{"text": "Only because that's where all the Faygo is sold.", "label": 0}
{"text": "To be fair that’s just supply and demand. Lily Allen feet pics are rare loot, but her music can be found in many a dungeon.", "label": 0}
{"text": "Too late, dude... did you not play attention the last DOZEN times Russia did this?", "label": 0}
{"text": "Wallace is positively wetting himself right now.", "label": 0}
{"text": "New Found Glory actually released an official shirt with the typo \"New And Glory\".", "label": 0}
{"text": "Yep that too. 40% of MPs ( in 2022, dunno about after the election ) have money invested into Real Estate. So as you say, if they don't do shit ( and simultaneously allow mass migration \\~ another topic where, just as you say, they have an incentive to not do anything ), the value of houses rise massively. \n\n>*What are the incentives to build? The chance of possibly getting a few votes from new homeowners*\n\n100% agreed, this also reminds me of the USA. Not only is the chance of getting a few votes slim, the actual problem is that construction takes sooo painfully long, that it will be most likely the next MPs/the other Party who will reap the benefits of the houses. That's the issue with the National Debt in the USA. Clinton was the last president who focused hard on reducing the national debt, and he did and created a budget surplus for the first time since Eisenhower. However not only did Voters care little about the reduction of debt/budget surplus, it was Bush who reaped the rewards by being able to spend literally TRILLIONS and massively increase the debt aswell. Since then the Democrats don't care about the national debt either... and it is at 37 trillion now. The US debt rises by 1 trillion every year now, and the INTEREST payments alone are 1.1 trillion each year, which is higher than their military budget which is \"only\" 916 billion. Neither Biden nor Trump talked about the debt in 2020, same with Harris & Trump in 2024, despite it being just insanely high.  \n\nSo yeah, not only an incentive not to do anything, but also an incentive to allow the problems to grow... If the problems grow --> they get more money. \n\nThat's ultimately why I mentioned the proverb of \"where there's a will there's a way\", there really just is no will for politicans to do anything.   \nAll we see from them is campaigning, same with this post. It's pathetic and depressing, honestly.", "label": 0}
{"text": "And there she is going away feet pictures for free in the article.", "label": 0}
{"text": "Add an adjective to feet and there's a community that's into it", "label": 0}
{"text": "In Japan physical media is still king, CDs everywhere.\n\nI personally buy CDs and blurays to support some of my favourite artists or at least buy their music on iTunes.\n\nThis is probably why Japanese bands survive easier.", "label": 0}
{"text": "I mean, they are clowns just like the rest of the people who “support” her.", "label": 0}
{"text": "Ohh you sweet summer child. What makes you think there isn’t a market for that?", "label": 0}
{"text": "The world needs to know where Ja stands on this issue", "label": 0}
{"text": "the article estimates that she makes $4k per day on spotify (~$120k/mo), and $8k/mo on Onlyfans. That's wayyyy more money on spotify. Is she just lying? or maybe the article is way off with their estimates", "label": 0}
{"text": "if she releases throu label then im not surprised.", "label": 0}
{"text": ">  they’re the only ones that make any money off of content\n\n[Spotify isn't profitable](https://www.reddit.com/r/Infographics/comments/17eimpw/spotify_still_cant_make_money/).  That doesn't cover 2023 but they weren't profitable that year either.", "label": 0}
{"text": "Recent polling shows juggalos make up 17% of the electorate in Michigan and Pennsylvania. Surprising, I know", "label": 0}
{"text": "It's just enough to get you hooked. Clearly this article is subtle advertising disguised as commentary on Spotify's awful pay, and you know what? I'm here for it. Get that bag.", "label": 0}
{"text": "lmao what? They made that in the 70's and opened it up to civilian use in the 80's", "label": 0}
{"text": "Spotify on blast, they absolutely suck. They fight to lower royalty rates, sue music artists, and add fake copies of music in order to avoid paying full price on songs", "label": 0}
{"text": "Lol.  What episode was this?", "label": 0}
{"text": "“Fuck Nugent, like anybody gives a fuck. You like to hunt a lot, so fucking what?”\n\n-ICP", "label": 0}
{"text": "So I need to trt taking pictures of my feet and create an Onlyfans to be rich?", "label": 0}
{"text": "CDs are still pretty widely available online (retail presence has mostly vanished besides specialty stores). There's also digital purchases if you want to own it - I mean even iTunes is still alive and kicking.", "label": 0}
{"text": "A great song by Adele.", "label": 0}
{"text": "[Her husband is famous too!](https://x.com/lmp3rfect/status/1776067343707164872)", "label": 0}
{"text": "I am very stoned and thought it said \"Kamala Harris Locks Up Criminal Juggalo...\" initially.", "label": 0}
{"text": "To know that all the clowns are going to be voting for Trump? I don't have to wait a week for that.", "label": 0}
{"text": "Yea she did!!!", "label": 0}
{"text": "I didn't know you could sell feet pics on Spotify", "label": 0}
{"text": "By the Obama administration no less .", "label": 0}
{"text": "When I worked in China I had to pay taxes which were automatically deducted from my salary. Part of the taxes was for the social security which included healthcare, retirement or unemployment.\n\n\nI had an appendicitis surgery and was hospitalized for 3 days and all I have to pay was 18$ because I didn't have a complementary health insurance plan.", "label": 0}
{"text": "Nice anecdote, but that has as much value as \"Well I never heard of any racism at my school, so there isn't racism among youth.\"\n\nWhen I was in middle school, a kid killed himself after excessive bullying. The straw that broke the camel's back was everyone going after him for his mom taking his phone because he was cutting himself.", "label": 0}
{"text": "So this isn’t an onion article, but it is an article in a daily show skit. A very funny one, but it isn’t accurate of the video. One ICP member said he would vote democrat, and then took drugs. \n\nNot a win for the Democratic Party.", "label": 0}
{"text": "MAGA altar", "label": 0}
{"text": "I didn't realize that you get paid for feet pics on Spotify.", "label": 0}
{"text": "Was it sheogorath?", "label": 0}
{"text": "Who suggested that? Lots of people make music without getting paid millions, most musicians even.", "label": 0}
{"text": "This is from like a week ago. And has been posted at least once in this subreddit earlier this week.  We just karma farming now?", "label": 0}
{"text": "Still less makeup then Trump", "label": 0}
{"text": "As a foot lover, I can say that her feet do nothing for me.", "label": 0}
{"text": "I would assume they don’t usually vote. I was thinking this would get them off the couch", "label": 0}
{"text": "No judgement of the feet guys, but I have no clue what makes for good/bad feet outside of maintenance.", "label": 0}
{"text": "She isn't being robbed by the music industry,\n\n  \nShe had multiple co-writers on most of her big hits, and most heavily used other songs as samples. So a lot of the profits from those songs are going to other people who deserve it.\n\n  \nIf she wanted to make more of the money from her music she should have made the music in a different way.", "label": 0}
{"text": "I mean poor rural white young men  are a demographic that Harris could certainly use help getting and this might help get some.", "label": 0}
{"text": "People probably like her feet....", "label": 0}
{"text": "Reread your comments you fucking idiot, haha. The lack of comprehension is all on your end there, champ.", "label": 0}
{"text": "Thanks for that context.", "label": 0}
{"text": "Quentin Tarantino enters the comments...", "label": 0}
{"text": ">Regarding taxes, Violent J said, “I pay taxes up the f—ing anus, and I’m happy about it.” Violent J said humans have a superiority complex to overcome, adding, “Let me tell you what a superior animal is: a whale.”", "label": 0}
{"text": "Yeah, I transposed too many zeros while composing the message and didnt notice; cheers.", "label": 0}
{"text": "The funny thing is most people think OF is one job where experience doesn't matter. \n\nIt actually matters a lot. A lot of the most successful OF creators have been doing it for years, and they've accumulated a really broad base of fans, and they have a lot of repeat subscribers. They also know their fans, know their niches, and have gotten better and better at taking pics and videos. But a lot of it is just time. Lots of time to accumulate subscribers. \n\nAnd being realistic with their prices too. Understanding what the market value is for their content, not their personal value. They know it has to be done like the Netflix model-make it affordable, and rely on vast quantities of subscribers month after month to make money. And that requires a psychological/social adjustment too, because you're basically making your body into a commodity, which isn't easy or natural for a lot of people to do. \n\nBut all these things come with time, and experience. \n\nUnsuccessful models put their own personal value on things \"here's a pic of my boobs! Omg, I said I'd never do this so everyone better pay a lot of money for these! I don't want just *anyone* seeing them!\" \n\nFans: \"You wanna charge $30 for one pic of *just* your boobs? Are you delusional?\" \n\nThat's why OF doesn't work for most people. You have to do it all the way or not at all.", "label": 0}
{"text": "Spotify keeps people interested in her though.", "label": 0}
{"text": "If you look on her twitter you can see them for free.", "label": 0}
{"text": "Greetings, \\/u/altacan!  Your submission from bbc.com has been automatically removed because it violates Rule 10 (no mobile versions).  **Submissions from mobile versions of websites are not permitted.**  Please resubmit using the desktop version.  [For more information on Rule 10, click here.](https://www.reddit.com/r/nottheonion/wiki/nto101#wiki_rule_10.3A__no_mobile_versions.)  \n\n[.amp]\n\nFor a complete list of domains that are not allowed, [click here](https://www.reddit.com/r/nottheonion/wiki/autoremoval).  If you're new to \\/r/NotTheOnion, you may want to check out [NTO101: An Introduction To \\/r/NotTheOnion](https://www.reddit.com/r/nottheonion/wiki/nto101) for more information on our rules and answers to frequently asked questions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "I once read about a woman who makes a large amount of $ per year selling pictures of her thumb on OF.", "label": 0}
{"text": "That money is being shared with her co-writers and the other artists they sampled for her songs.\n\n  \nArtists from the 2000-2010s who heavily relied on sampling old songs are discovering it was a bad way to create some recurring income.", "label": 0}
{"text": "Ok, she has support from all the clowns except the Bozos.", "label": 0}
{"text": "Can you imagine your sister releasing a diss track on you, then selling feet pics on onlyfans?", "label": 0}
{"text": "He’s not wrong. Whales are awesome.", "label": 0}
{"text": "My buddy made more money through his connection to a clothing company than he did with his music. They paid him a lot of money to wear everything in their catalogue in his music videos. The music did well enough that he had a large audience and would get recognized in the street but he made more money for wearing clothing.", "label": 0}
{"text": "Literally the person I replied to originally", "label": 0}
{"text": "You know the guy that operates the rouge river draw bridge in Delray and Jefferson? FUCK him.", "label": 0}
{"text": "If Spotify operated on the same pay structure as only fans, you’d still want Quentin Tarantino in your followers list to make bank", "label": 0}
{"text": "ICP read the room better than Bozos", "label": 0}
{"text": "she would definitely kick me out of bed for eating crackers.\n\nin fact, i'd insist.", "label": 0}
{"text": "His security team should begin boarding up those windows and Lukashenko should move to a ranch house.", "label": 0}
{"text": "They do have occasional nuggets of wisdom in their insanity.", "label": 0}
{"text": "Nine Inch Nails", "label": 0}
{"text": "Because if I don’t nobody will hear the music *and* I won’t get paid anything", "label": 0}
{"text": "That sounds like a case of “it wasn’t me”, if I ever heard one", "label": 0}
{"text": "They should fire inspector Rickey and hire you.", "label": 0}
{"text": "You are all clowns for supporting either party", "label": 0}
{"text": "The moment you argue the person and not the point, is the moment you lose the argument.", "label": 0}
{"text": "Yeah it was basically the Canadian MTV lol", "label": 0}
{"text": "Sane Clown Posse", "label": 0}
{"text": "No we're talking about ICP not MAGA.", "label": 0}
{"text": "Probably right on the exhibition fetish, there's a number of photos taken at her gigs where she wasn't wearing underwear while posing in positions that basically guarantee a view up a short skirt.", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Seems like there is an opportunity to start your own streaming platform and pay better amounts to artists to operate on your platform.", "label": 0}
{"text": "Michigan was won by trump with 8,000 votes against Hillary which is the only R win since the 80’s. Pretty sure at least 10,000 Juggalos are gonna vote if not more because of this, ICP has passionate fans even if they’re not the smartest. They could literally decide Michigan.", "label": 0}
{"text": "Several.", "label": 0}
{"text": "I mean it has to be her music or personality cause those feet are mediocre and I’m a degenerate", "label": 0}
{"text": "What an interesting comment.  Your first sentence is reasonable.  You then go completely off the rails with the second one.  Which one of those most reflects your position, I wonder.", "label": 0}
{"text": "this has small dick energy... \"if i have to suffer, so should everyone\" vs lets do better for everyone", "label": 0}
{"text": "Absolutely not.", "label": 0}
{"text": "Been hearing that rhetoric for my whole life. Nothing's changed. Nobody's waking up. Massive corporations are still exploiting.", "label": 0}
{"text": "Every single comment I have made here is about the industry as a whole and how everybody from Lily Allen to your musician friend who works a 9-5 job to afford making music, is being robbed by the streaming and music industry.\n\nShe’s saying there isn’t a reasonable profit in streaming.  She said it in a tongue in cheek way, comparing selling feet pics on onlyfans, and instead of using nuanced adult reasoning, everybody is on here like “boo hoo she’s a millionaire.”", "label": 0}
{"text": "Shut down and move, I guess. Not like the city cares so long as it’s not their problem to deal with.", "label": 0}
{"text": "I spend about as much as I do for Netflix per month and they seemed to make a lot of money on that model. 🤷‍♂️", "label": 0}
{"text": "The music industry isn't fair but Lily Allen just likes to talk shit. Shes not above making things up to stay relevant.", "label": 0}
{"text": "Not really. Spotify customers aren't cancelling over this.", "label": 0}
{"text": "Is she fucking high? Like, that is just such a random thought. Seriously, a woman who was in her fifties when the man was alive, who lives on the other side of the world, thinks it is sad that a specific person died before they could experience something as specific as GPS.\n\nThat is a completely weird as highdea or shower thought to pop into someone's head to begin with. And then to feel the need to share in to a news outlet.\n\n\"So anyway...\"\n\nThe real tragedy is that Jimmy Hendrix never got to experience a crystal pepsi.", "label": 0}
{"text": "lol, you don’t understand English, Ruski", "label": 0}
{"text": "They don’t vote period", "label": 0}
{"text": "He literally just had an interview with The Daily Show last week saying he wasn't getting involved.\n\nIn other words; celebrity does something they said they weren't going to do shocking the world in awe /s", "label": 0}
{"text": "You're over generalizing these problems as something everyone with depression experiences or understands. It's simply not true and it doesn't mean we \"live in a utopia where we've never been depressed\".", "label": 0}
{"text": ">then their entire economy as well as military would be diverted into Ukraine\n\nWhat do you mean? Economically, Russia itself has not gone into full wartime production, while at the same time Belarus is absolutely providing a great deal of direct support to Russia. I don't know what \"their entire economy would be diverted into Ukraine\" is supposed to mean, especially given that Russia hasn't fully committed to it yet either.\n\nMilitarily, Belarus appears to only be slightly on the other side of \"annexed\" as Chechnya, which has its own political leadership and military forces within Russia. Military forces which are directly involved in the war, but more as auxiliaries rather than being fully committed. Belarus has no independent foreign policy and essentially no economic independence from Russia.", "label": 0}
{"text": "No we get it.", "label": 0}
{"text": "The be faIr. THOSE ARE SOME NICE FEET!", "label": 0}
{"text": "Please, let us all hope and pray that Belarus' leader doesn't unleash his fury at the whole world.  I am going to stock up on supplies and hide in my shelter, aka my downstairs living room.", "label": 0}
{"text": "it’s more: we used AI to design the merch so we wouldn’t have to pay a person.", "label": 0}
{"text": "Already exist:  https://www.youtube.com/watch?v=1buRiUu1nOg", "label": 0}
{"text": "The linked billboard article which actually came up with that estimate goes a bit deeper \n\n> estimates Spotify would’ve paid a total of $4,077 a day, with $3,239 going to sound recording for the copyright owner; $336 of mechanical royalties going to the publisher, who pays the songwriter; and $503 in performance royalties going to performance rights organizations (ASCAP, BMI, etc.).\n\nSo assuming she is not the copyright owner of her own songs (which is the most common situation for any artist on a large label), from $4000 in revenue, she at most makes $336, and probably much less because it is split with her publisher.\n\nSo from $1.4m per year revenue from her songs Spotify plays, her and her publisher split $115k. From 1000 onlyfans subscribers she earns $96k per year, with no split (that is already accounting for the 80/20 OF split)", "label": 0}
{"text": "Isn't this just an indictment of the quality of her music?", "label": 0}
{"text": "And that's why I'd much rather go to a live gig, with the incredible atmosphere, pay the ticket, tip the band and support the bat that's got luve music. \n\n\nDo that. Buy the album. Buy the merch. Hand the band actually fuxking cash.", "label": 0}
{"text": "What did the man with three penises reply when his tailor asked him if he dresses left or right?\n\n\"Yes.\"", "label": 0}
{"text": "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*", "label": 0}
{"text": "Well that’s because it’s really hard to post your feet pics on Spotify", "label": 0}
{"text": "One of my wife's employee's sister has a fetish onlyfans and sells her \"worn socks.\" but apparently they were only worn by her dog.", "label": 0}
{"text": "Yea, because the guy with the Muslim ban is so much more attractive.", "label": 0}
{"text": "I enjoyed that guffaw", "label": 0}
{"text": "Best reply I have seen in a while.", "label": 0}
{"text": "Nuns don’t work on Sunday.", "label": 0}
{"text": "Yeah, to support them. They can still buy merch and vinyls to do the same. That option hasn't gone away. I think some artists still sell cds too.", "label": 0}
{"text": "Ads, endorsements, and public appearances, too!", "label": 0}
{"text": "The juggalos I've met most certainly were not medicated. \n\nNot for lack of trying on their doctors or family's part, of course.", "label": 0}
{"text": "How so? They're saying you're not entitled to make millions, and that just dumping songs on Spotify isn't necessarily enough. Completely reasonable.\n\n> They're not entitled to make millions of dollars because they made a good album or wathever. Is Spotify the bad guy, or the record label who agreed to the terms? And if you can't make a living posting songs to Spotify alone, maybe change careers.", "label": 0}
{"text": "As an rural white kid, I can agree.", "label": 0}
{"text": "Luka about to fall outta window", "label": 0}
{"text": "Feet-uring two new hits :)\n\nBut yes, sad as hell what the streaming services have done.", "label": 0}
{"text": "I don’t support a party, but ok. 🤦", "label": 0}
{"text": "“Tarantino, you’re up!”", "label": 0}
{"text": "Struggling artist Lily Allen FORCED to sell pictures of her feet to horny men on the internet to survive on paltry income of 1.4 million dollars a year.", "label": 0}
{"text": "While I do agree that Spotify's pay structure is dog 💩, there's no way they can compete with OF. Those OF subscriptions are split between OF and a single content provider. Spotify is a pool subscriptions that has to be shared based on a percentage of plays.  If music artist want to get out that boat they are going to have to follow BlackStar's  model which is basically just patreon subscriptions for music.", "label": 0}
{"text": "Counterpoint: Lions", "label": 0}
{"text": "The vast majority are making peanuts as a side hustle. There's a world of difference between someone already famous with a following opening one up, and someone trying to turn it into a career from scratch. Outside of that tiny sliver of massive successes, the ones making a living at it solo are pretty much constantly hustling for it.", "label": 0}
{"text": "They sell Faygo in Canada. Am I Juggalo?", "label": 0}
{"text": "I didn't downvote anything.  My sense is there is a group of people who want to support the efforts of wacky people who want to sanitize history (and culture in general).  And they say things like \"if this history book for ten-year-olds used anything other than documented historical record, i.e. conjecture or notional descriptions, that's just as fictional as, well, the Bible.\"  Only they use a different example.", "label": 0}
{"text": "Well, those feet are art. I’m guessing. I definitely don’t know for sure.", "label": 0}
{"text": ">But the law is the law and unfortunately if you ignore the law\n\nYou did not address this.", "label": 0}
{"text": "That's how they get you hooked. The first one is free.", "label": 0}
{"text": "Kamala is down with the clown!", "label": 0}
{"text": "🤢", "label": 0}
{"text": "78 years old. That’s wild. Imagine seeing grandpa in the news for his dicks. after donating his body", "label": 0}
{"text": "And yet no one has a link", "label": 0}
{"text": "Top onlyfans creators make an *eye-watering* amount of money off the most mundane content. I don't think we're recognizing just how big the porn market is.", "label": 0}
{"text": "One, twice, three times the…gentleman", "label": 0}
{"text": "He interrupted VP Harris, repeatedly, because he’s a disrespectful, rude, crude misogynist.", "label": 0}
{"text": "Seems like a boring use of my time. I’d rather make music", "label": 0}
{"text": "Critcal Juggalo Vote..3 words I never thought I'd see together.", "label": 0}
{"text": "After reading this article I'm just imagining the pedicurist has a crippling foot fetish and found the best career for themselves. On top of that, they convinced Lily Allen to post feet pics. What a G", "label": 0}
{"text": "Well yeah, you can't sell feet pics on Spotify", "label": 0}
{"text": "Yeah but construction has barely started, and the money spent so far has by vast majority been spent at the planning stage by the non-stop bad faith objections at every step.", "label": 0}
{"text": "...doesn't she have 3 nipples?", "label": 0}
{"text": "Whoop whoop!", "label": 0}
{"text": "You don't know about no prosecution of shoplifting under 950$ in Cali and who actually pulled this as a law?  \nAnd nah, not a bot. I hate Putin for what he did with my country, and i really don't like watching just the same way of taking the power happening in US right now.", "label": 0}
{"text": "Pics or it didn't happen", "label": 0}
{"text": "My Little Shit Head ™️", "label": 0}
{"text": "Two of his penises were in his scrotal sac, and his condition was only found upon dissection after death.", "label": 0}
{"text": "Nah, that was me. She’s someone else.", "label": 0}
{"text": "Big names are getting more, guaranteed. The money is in having power to threaten leaving. If youre just a bunch of bits in their catalog and not a marketable partner then you arent really making any money for spotify either.", "label": 0}
{"text": "Ok, first off, a lion…swimming in the ocean?\nLions don’t even like water.\nIf you placed it near a river, or some sort of fresh water source, that’d make sense.\nBut you find yourself in the ocean, a 20 ft wave, I’m assuming its off the coast of South Africa, coming up against a full, grown, 55000 lb whale with his 5 or 6 friends. You lose that battle nine times out of ten.", "label": 0}
{"text": "Oh the breeders should absolutely be considered animal abusers for intentionally creating brachycephalic breeds. But *also* the airline shouldn't have made a last minute change like this after previously agreeing to the priority boarding, etc.", "label": 0}
{"text": "ICP has a bunch of songs about punishing rednecks for being racist, so I'd say your perception is way off.\n\nThey are trashy, but weirdly progressive in some ways (and super awful in others).", "label": 0}
{"text": "Same. I’ve got a stack of unopened CDs, but handing them that $20 directly (literally for small artists) makes a small difference.", "label": 0}
{"text": "Wait lily allen sells feet pics?!?!?!?!?!? 😳 \nGimme about 2 minutes homies", "label": 0}
{"text": "Oi, that’s Three Hog Henry from down the road, innit.", "label": 0}
{"text": "I mean, I have one if you have any questions. But yeah I’m gonna go ahead and say that most of the pics on there are mid, even as a foot-fetishist.", "label": 0}
{"text": "He didn't send people dick pics, he sent them dicks pic", "label": 0}
{"text": "I would have guessed their fans would have been Trump voters/nonvoters, so maybe this is actually something lol", "label": 0}
{"text": "this would be funny except for the fact that that i know so many people who have  severe bad reactions to cannabis", "label": 0}
{"text": "You can buy mp3s", "label": 0}
{"text": "Yeah that battle is already lost", "label": 0}
{"text": "That means he will soon be removed and replaced by someone even more pro Putin. He knows and is making noise.", "label": 0}
{"text": "That’s what patreon is for", "label": 0}
{"text": "Lord I've seen what you do for other people and I want that for me", "label": 0}
{"text": "That’s it . I’m selling pictures of my asshole.", "label": 0}
{"text": "Yeah, I’d imagine for a signed artist any money they would come from Spotify is divided 17 ways before it reaches the artist, so even your 10m+ artists probably aren’t really seeing any money.", "label": 0}
{"text": "Hey come on now.\nMany self-medicate!  In some cases the only reason they decide to do it themselves is their doctor won’t prescribe meth.\n\nLove juggalos.", "label": 0}
{"text": "As a feet expert, hers are very very underwhelming.", "label": 0}
{"text": "The registered breeders are just as evil as any backyards. Look at the fucking Dalmation breeders that kept out the pointer backcross.", "label": 0}
{"text": "Even then it’s probably a rounding error amount for Taylor swift.", "label": 0}
{"text": "They probably run an edible side hustle.", "label": 0}
{"text": "[The Impact of Streaming Services on Music Royalties](https://www.royaltyexchange.com/blog/the-impact-of-streaming-services-on-music-royalties#:~:text=Changes%20in%20Royalty%20Distribution&text=Traditionally%2C%20artists%20and%20record%20labels,time%20someone%20streams%20their%20song.)", "label": 0}
{"text": "Some people have all the luck.", "label": 0}
{"text": "Exactly. This story has legs…", "label": 0}
{"text": "They'd still have to sell the lot, if they even can, with this ongoing thing.", "label": 0}
{"text": "Even more crazy is the artists that were baited into signing bad deals with major labels and are actually indebted to the label by hundreds of thousands of dollars, so they go on tour to pay off the debt and sell out every date, and are still cash negative! Fucked up predatory world. People who seek to make “business” out of music and art are imo next to fascists on the scale of irredeemability.", "label": 0}
{"text": "Not legal here, they didn’t get high.", "label": 0}
{"text": "\"Have you ever had a Cockathree in your hotel room?\"", "label": 0}
{"text": "So more people appreciate your feet than your music.... lol.", "label": 0}
{"text": "But you didn't do any actual work for streaming.", "label": 0}
{"text": "I think that just says more about the commercial potential of women's feet than it does about spotify.", "label": 0}
{"text": "Kid you fuckin not they had some 8 bit feet pic nfts. I bought two for the giggles lmao", "label": 0}
{"text": "Wait! Those are all bands I listened to in high school! But I'm still youn-- oh no.", "label": 0}
{"text": "Does this say more about weirdos on only fans or more about how s***** we treat musical artists through digital media.\n\ni remember seeing statistics for average per song payments to artists. It was from a few years before they shut down Google Play music. GPM was the highest pair by almost double and then instead of rolling that service into some combination with YouTube they just created YouTube music and canceled the GPM. \n\nWhich sucks even more because I thought GPM was actually a really good service and was great at finding me all kinds of new music that was a good match to what I had. YTM is trash and pushes the pop market so hard. I listen almost exclusively to playlists. The suggestions are terrible", "label": 0}
{"text": "But Spotify has to spend that money on dipshits like Joe Rogan instead! How else would talentless hacks like him make millions upon millions of dollars", "label": 0}
{"text": "Makes sense, last time I checked I couldn’t buy feet pics on spotify 😂", "label": 0}
{"text": "Couldn't it be argued that allowing corporations to relocate overseas hurts state's financially.", "label": 0}
{"text": "As usual, The Mighty Boosh have a relevant song. \n\nhttps://youtu.be/GocoVI4RTyw", "label": 0}
{"text": "That's how you always made money as a musician. Streams are a promotional tool like music videos.", "label": 0}
{"text": "I'm mean yeah, you can't even sell feet pics on Spotify.", "label": 0}
{"text": "Except make the thing that people are paying by listen to", "label": 0}
{"text": "Fuck Ticketmaster, I literally don’t even bother to go to concerts anymore. Prices for tickets are outrageous, not to mention the ridiculous hassle it takes to contact them if you have an issue. It was weeks of phone calls, being cut off and being intentionally misdirected. Fk them.", "label": 0}
{"text": "if my feet weren’t so large I’d be tempted but it would be hard to pass 12 1/12 as a woman’s foot but maybe some people are into big feet? 🤔", "label": 0}
{"text": "Id do the same if i was a blonde white chick. It’s like punching in the money cheat for GTA.", "label": 0}
{"text": "\"Agh! It's a class-IV piss hydra from hell!\" - [Scottie](https://www.youtube.com/watch?v=N_KeXfd5OHI)", "label": 0}
{"text": "End of an era", "label": 0}
{"text": "This was posted on r/music and all the people who actually attended said its all blown out of proportion.", "label": 0}
{"text": "No but teachers don't get such terrible wages like they do in the US. With having to deal with republican anti woke nonsense, parent frustration and shitty students, it seems like a quick way to cause burnout.", "label": 0}
{"text": "“They act all crazy like a herkey jerk.”", "label": 0}
{"text": "He can eff you left, right and centre", "label": 0}
{"text": "Tri-force", "label": 0}
{"text": "Every. Vote. Count.", "label": 0}
{"text": "Nope, voters in Wisconsin and Michigan have been given checks.", "label": 0}
{"text": "Warned, there’s no consequences anymore", "label": 0}
{"text": "Why would you guess this?  I'd never thought about the political leanings of those people before but I can't think of a reason they'd lean hard right.", "label": 0}
{"text": "Album sales allow me to tour my local area, I have under 150 listeners a month on all platforms combined, and I make less than $5 a month (I don’t even get money from Spotify cause none of my releases have over 1k streams). I sell physical CDs I burned at shows and that’s enough for gas and 2 meals usually. I have to sleep in my car but that comes with the territory I guess.", "label": 0}
{"text": "I am just pointing out it's passive income where you don't need to perform at bars.", "label": 0}
{"text": "Please dude those 1 million juggalos are like 30 plus and out of shape and probably dont even listen to icp anymore. Get real.", "label": 0}
{"text": "Unless, of course, you're Joe Rogan (I know, not a musician).", "label": 0}
{"text": "Who is this lady", "label": 0}
{"text": "I don’t have a problem with that ", "label": 0}
{"text": "> Why isn’t the male foot genre more popular\n\nIt is lol. You just never looked into it, and you wrongly assume it's not.\n\nYou DO need to be attractive and have good-looking feet. But if that's the case, you can make an OnlyFans where you share foot pics and take requests from fans, and as you put free samples (both photos and videos) on Twitter, you'll get thousands of followers and paying subscribers. Like... https://x.com/FootMasterBuck If you search \"Foot\", \"Master\", \"Footmaster\" or \"Alpha\" on Twitter, you'll drown in accounts with thousands of followers. If you do findom on top of it, you can make thousands of dollars per submissive.\n\nI have a friend (twink, blonde, very attractive) who went on a world trip and came back over $50,000 richer than when he left. He announced to his fans on Twitter and OnlyFans that he would travel internationally, and any of them was free to send him $250 to secure a meeting with him, upon which they had to pay him another $350 in cash per hour spent worshipping his feet. His fans paid for all his hotels, plane trips, restaurant meals, etc, on top of flooding him with cash.", "label": 0}
{"text": "People really pay money for pictures of feet? I thought it was just a joke.", "label": 0}
{"text": "Sure but there better be nice lighting, good angles, and a nice camera. Oh, and your feet better be looked after", "label": 0}
{"text": "This is such a weird flex on my part but I'm a dude and the few times I've had a pedicure the girls have told me that I have really nice feet.\n\nDeep down I wonder how much money I'd make with horny gay men if I recorded myself squishing cake with my feet. I dunno.", "label": 0}
{"text": "Because they tend to be lower income white people, most prominently from the Midwest. That demographic is typically Republican.", "label": 0}
{"text": "Millennials, actually.", "label": 0}
{"text": "For months maybe years to come", "label": 0}
{"text": "It’s a wrap", "label": 0}
{"text": "I’m 50+ and still listen. I am out of shape, though, so you’re half right.", "label": 0}
{"text": "Who's actually gonna take that to court? ", "label": 0}
{"text": "Potentially, but for that to work the same way we’d all have to subscribe to each specific artist for lets say $10+ a month. That would easily be worse than how it is now lol. I just have a feeling not a lot of people would pay for specific people. Look at Tidal for instance", "label": 0}
{"text": "67 million for that is insane. People know porn is free right?", "label": 0}
{"text": "Let him bake! ", "label": 0}
{"text": "this sub has become absolute trash if you haven't noticed. It's just another place for karma farmers to post their slop", "label": 0}
{"text": "It’s already been annexed lmao", "label": 0}
{"text": "How many Juggalos are actually registered to vote?", "label": 0}
{"text": "Hey \"happy wife, happy life\" and all that.", "label": 0}
{"text": "We need to see Juggalos en masse canvassing trailer parks around the country. That would tip the election for Kamala", "label": 0}
{"text": "This is how I find out I can get lily allen feet pics? /s", "label": 0}
{"text": "I don't know any personally, but Workaholics said it, so it must be true.", "label": 0}
{"text": "there’s a guy on there who sells vids of himself burping.", "label": 0}
{"text": "Thanks! So in other words, a govt handout? And Boeing wants to keep the gravy train rolling?", "label": 0}
{"text": "Foot fetish is quite common. Dont ask me why.", "label": 0}
{"text": "Literally in the numbers you gave, you proved it's incredibly possible for her to be making it.\n\n  \nYou really are underestimating the money that is in onlyfans and those types of websites", "label": 0}
{"text": "I went to this pizza shop for directions on how to get directions away from this pizza shop.😏", "label": 0}
{"text": "Thats 7.5mio monthly listeners not streams. You have the 3x the number to get a more realistic idea of how many streams she has. \nShe probably clears 100k a month of spotify alone.", "label": 0}
{"text": "Let’s goooooo!", "label": 0}
{"text": "Shh... That's not what we want to hear.", "label": 0}
{"text": "At least 8", "label": 0}
{"text": "What’s the value of anything if not tax revenue and cheap labor for the state? ", "label": 0}
{"text": "People are dumb simps. They think if they send someone $1k they'll care about them.", "label": 0}
{"text": "You can't lie to OnlyFans. Or, you can, but they are a billion dollar corporation and they'll take you to court.", "label": 0}
{"text": "Who is Lily Allen? \n\nAlso, why is this surprising? \n\n\"I make more money blowing people that busking.\" Wow shocker... ???", "label": 0}
{"text": "> If Spotify operated on the same pay structure as only fans….. idk who knows.\n\nThat would be silly.  There's no way it would work.\n\nWhy would music fans tolerate subscribing to each artist for $10/mo when they can just go buy the damn album?\n\nFrom the customer's perspective, the whole point of Spotify is the all-in pricing.  Your monthly fee gets you access to their entire library.", "label": 0}
{"text": "As long as the feet are filthy I’ll pay more. In pesos", "label": 0}
{"text": "Well, pics don’t usually sell to well on Spotify.", "label": 0}
{"text": "Do you mean the nearly 100 man strong force of sheer terror.  The world waits and trembles in fear.\nI may not be a military analyst, but his forces are capable of taking over nearly 2, maybe even 3 gas stations simultaneously.  After both of his tanks run out of fuel.", "label": 0}
{"text": "If all three got hard it must have looked like the predator yawning", "label": 0}
{"text": "\"Go down to Wake & Bake Pizza, ask for Jojo. Tell him you want the Bob Marley Extra Crispy. He'll know what you're talkin' about.\"\n\nAlways wanted this type of pizzeria in my area.", "label": 0}
{"text": "I hear Musk is giving away a $1M supply of Faygo every day for those who sign a petition stating that they're not registered to vote (*offer only available to those that own clown makeup while living in Midwestern swing states).", "label": 0}
{"text": "Problem is, so does (almost) everyone else. The successes sometimes make it look easy, but they had to somehow out-compete everyone else.", "label": 0}
{"text": ">you sweet summer child\n\nA minute ago, in a totally different subreddit, people were discussing the expressions that entered regular language due to A Song of Ice and Fire. Amazing example of the Baader Meinhof phenomenon.", "label": 0}
{"text": "So about 2 out of 10 people are voting based on ICP.    I'll let you keep believing that", "label": 0}
{"text": "Yeah but those are the people who give the politicians money.", "label": 0}
{"text": "Everyone's looking to you /u/wishilikedhugs, the election is in your hands", "label": 0}
{"text": "Good on her.", "label": 0}
{"text": "How do you say it? Feetdotpics?", "label": 0}
{"text": "There’s an mma fighter who gets like 50k a month on only fans, she’s not even close to ufc so probably get fuck all to fight", "label": 0}
{"text": "Wasn't Belarus the staging ground for northern Ukraine offensive? Someone needs to remind Lucky Luka that Russian tanks are closer to his state house than to Kiev.", "label": 0}
{"text": "We can make that work, tell me what else would you pay money not to see. ", "label": 0}
{"text": "As someone who spends their money on alcohol and drugs...at least I'm getting something out of it.", "label": 0}
{"text": "Don't get high on your own surprise.", "label": 0}
{"text": "Are you on wikifeet?", "label": 0}
{"text": "I'm strongly suspicious that a lot of the online sex trade is funded by bad actors who want to encourage naive people to ruin their lives.", "label": 0}
{"text": "The American dream is so weird now", "label": 0}
{"text": "An ex of mine took care of people with autism and other disorders so that they could live semi-normal lives, and one story always makes me smile.\n\nShe said that they were going to go to an event or something (coworkers or someone told her about his foot thing), and the guy that she was helping replied \"why don't we just hang out here and take our shoes off?\" so he could get a look at her feet.", "label": 0}
{"text": "Will you come clean about your obsession with Lily Allen's feet also? And disclose your personal contributions towards her OF income too?", "label": 0}
{"text": "\"The Shatner\"", "label": 0}
{"text": "I like her music. And I bet she has nice feet. Not sure what to do.", "label": 0}
{"text": "The people who go around talking about how much they hate women buy that shit up. They trash talk women with only fans and then turn around and pull out their credit card.", "label": 0}
{"text": "I've seen better", "label": 0}
{"text": "she has disgusting feet wtf", "label": 0}
{"text": "Today I learned <3 LOL!", "label": 0}
{"text": "Oddly spongy feet", "label": 0}
{"text": "If you send me $1k I’ll care about you", "label": 0}
{"text": "isn't she married to the stranger things cop hopper", "label": 0}
{"text": "Because spotify payouts are low?", "label": 0}
{"text": "Apparently.\n\nIf it was up to me, Trump wouldn't be allowed to run, as he stiffed my father's contracting company for his AC casino 30+ years ago and it really hurt my family. But people who support Trump don't care that he hurt people, you can tell by the other person's tone that they just want to \"stick it to the libs.\" And to bring it all back around, I don't know how anyone with a conscience can look at the types of things he does and support him... Total clown behavior.", "label": 0}
{"text": "Tbf, Juggalo ganga are a thing. It's just not the same as the Juggalo subculture. There's overlap, at best, in the same way there's overlap with Dodgers fans and the Crips.\n\nhttps://en.m.wikipedia.org/wiki/Juggalo_gangs", "label": 0}
{"text": "In 2016 there were \"Trumpalos\" at the Gathering. I found them almost as surprising as the crew that rolled in with confetedate flags on their rig. Juggalos supporting a rich dude born into wealth was baffling for me. By the way, the Confederate flags got taken down shortly after that crew parked.", "label": 0}
{"text": "I guess you have more marketable feet than music?", "label": 0}
{"text": "No, Spotify on blast.\n\n\nThey paid a fucking idiot like Joe Rogan, but don't pay their bread-and-butter, \"The reason I want premium is to play these artists with no ads\" artists bullshit.", "label": 0}
{"text": "Such a kickass album. First metal band I ever saw live and even got to meet Phil because I got in early since I did will call and everyone else printed their tickets. As soon as everyone started coming in he bounced lol.", "label": 0}
{"text": "Get that bag. Easy money. Horny dudes pay for just about *anything*", "label": 0}
{"text": "Someone privately seeking out their fantasy perfect person not bothering anyone over alcohol and drugs which have killed millions……", "label": 0}
{"text": "Oh yeah don’t get me wrong teachers definitely deserve to be much better compensated. But you become a teacher because you love helping people and doing that makes you happy first and foremost. The money is just to make it viable as a profession rather than a hobby. \n\nThis woman essentially sold her body and future to make a quick buck, which there is nothing at all wrong with as she’s an adult, but you can’t really compare professions where the main goal is to make alot of money and one where the money is only there so that it’s viable enough to be an actual job", "label": 0}
{"text": "The swing-state Juggalos may just decide this election. Maybe.", "label": 0}
{"text": "Who is even going into porn willingly these days?", "label": 0}
{"text": "Edibles don’t work on me so I wouldn’t even notice.", "label": 0}
{"text": "I have CDs, Vinyl, and a huge MP3+Lossless collection thanks to Bandcamp.", "label": 0}
{"text": "I wish I could make money off my body. Lucky you", "label": 0}
{"text": "If that's the case she should complain about the music industry in general and not Spotify.", "label": 0}
{"text": "Be Best.", "label": 0}
{"text": "She is probably among the top couple individuals on the platform. \n\nWouldn't surprise me if she had a few billion site visits for that 67m", "label": 0}
{"text": "My ex roommate was a guy, and we got a free big screen tv from his creepy coworker in exchange for feet pics. You best believe that I did my best glamour shots ever", "label": 0}
{"text": "While they may be down with the clown, they aren't down with that clown.", "label": 0}
{"text": "i;m willing to care for 997.97", "label": 0}
{"text": "They're in the article", "label": 0}
{"text": "The problem is that the former tolerate the latter as allies.", "label": 0}
{"text": "If that's the case she should complain about the music industry in general and not Spotify. Spotify didn't make her sign her contract with the record company.", "label": 0}
{"text": "I mean, there are men who have become millionaires on OF too. don't sell yourself short.", "label": 0}
{"text": "I'd say the opposite.", "label": 0}
{"text": "And now .io is endangered too", "label": 0}
{"text": "But still true! Anyone can make it here.\n\nUnless you're ugly.", "label": 0}
{"text": "Influencer, former Vlog Squad member, yeah, being on OnlyFans sounds like the most respectable thing she did, and I don't even know what a Vlog Squad is but I'm annoyed just reading the term.", "label": 0}
{"text": "I think they only have one free hand to hold money", "label": 0}
{"text": "I am all for better for everyone, just not sure why people don't expect corporations not to fuck over anyone, musicians aren't special.", "label": 0}
{"text": "Don't forget, he also shit his pants to dodge the draft and wrote a song fantasizing about raping a 13 year old girl.", "label": 0}
{"text": "Ya gotta post pics of your feet and asshole to make the big bucks. I shave my crack and paint my toe nails ... they don't even know I'm a dude, or they do and just don't care.", "label": 0}
{"text": "Yeah, and they are very easily sent via post. Maybe even via letter mail, if it's a thin case. ", "label": 0}
{"text": "Bud, have you ever recorded a band?\n\n\nThis is one of the most brain-dead takes I think I've ever seen.", "label": 0}
{"text": "When you're extremely lonely, actual real time feedback from a beautiful woman becomes like a drug. The overwhelming feeling allows them to ignore the reality that the woman is only responding to the money and not them as a person. It all adds up. Quick.", "label": 0}
{"text": "Wait, you're *that* Dadbot!? Hey, did you end up getting that checked?", "label": 0}
{"text": "protip: if you're a blonde white dude you can make good money too.\n\nnot to be sad about the reality. but...just gotta be hot.", "label": 0}
{"text": "When they go low, we go Juggalo.", "label": 0}
{"text": "I just wonder what variety of mushrooms they use.", "label": 0}
{"text": "Add a one and two zeros to that, and we have a deal.", "label": 0}
{"text": "and that, my friends, is the free market!", "label": 0}
{"text": "i think most people are just horny.", "label": 0}
{"text": "David Ar-shoe-leta", "label": 0}
{"text": "“Contaminated” is…an interesting choice of words", "label": 0}
{"text": "Ya, it was just an old piece of cheese from my snack the day before. Everything’s good. \n\nThanks for checking in, though, bro!", "label": 0}
{"text": "Porn has been free since 1993. People pay for their specific kinks.", "label": 0}
{"text": "Many people have gone to jail without violating the letter of the law for violating the spirit of the law. It's called being in the grey, and it's not a good place to be. Rich white men certainly have much more ability to operate there, but if the justice system were half as just as it pretends to be, Musk would be shitting his pants.", "label": 0}
{"text": "He seems to think Belarus and Russia have a cooperative relationship.\n\nPutin tells him what to do and he cooperates.", "label": 0}
{"text": "Bet his trousers fit like a glove.", "label": 0}
{"text": "And then when Spotify raises their prices Reddit will bitch and moan and proudly proclaim they are returning to piracy.", "label": 0}
{"text": "What, you think it's higher?", "label": 0}
{"text": "you can't buy music there either", "label": 0}
{"text": "If any group needs to support birth control it's the Jugs", "label": 0}
{"text": "When was her last hit? \n\nYeah Spotify royalties are trash but they aren't the only streaming place around and they all pay trash. That's why merch and concert tickets are the typical big ways artists get paid unless they signed a bad deal in the first place.\n\nThe only artists complaining about Spotify haven't been popular in years or they're greedy.", "label": 0}
{"text": "Most times when ppl say this they're referring to public school.", "label": 0}
{"text": "One man’s contamination is another’s upgrade.", "label": 0}
{"text": "What if they're not filthy but kinda weird? Not deformed per se, but you can tell something's not all right with those piggies.", "label": 0}
{"text": "> Of course a famous musician showing off feet pics makes more money doing that than as revenue from Spotify.\n\nAnd how long are people actually gonna keep paying for her OF?  It's a clever commentary, but it's just that.", "label": 0}
{"text": "Okay, where is the current PR disaster? There is none. They can arrest those without it and have done so.", "label": 0}
{"text": "> I’d be tempted but it would be hard to pass 12 1/12 as a woman’s foot\n\nPeggy Hill would like a word /r/KingOfTheHill", "label": 0}
{"text": "does it matter what people spend their money on? either way it's their earned money to spend. i find that it's easier to just not care what people do with their own time and resources as long as they're not hurting anyone else. it's not like you can/should control what other people are doing anyway.", "label": 0}
{"text": "Seriously?", "label": 0}
{"text": "Step one: Bed hot, have good boob's, a nice round ass and thick thighs while have a low body fat %\n\nStep 2: take pictures of your ass as an advertisement\n\nStep 3: Sell videos of yourself performing sex acts on yourself and even charge more for \"personalized\" videos\n\nAnd all you gotta do is have the perfect body", "label": 0}
{"text": "What the fuck?? I guess there really is a market for everything.", "label": 0}
{"text": "wat? more people are doing sex work than ever before, *because* of the rise of things like OF.", "label": 0}
{"text": "It's hard....maybe that's why it's only making $150 a year", "label": 0}
{"text": "I heard that motherfucker had, like, 30 goddamn dicks", "label": 0}
{"text": "To be fair to the subreddit, pretty much every headline nowadays could sound like an onion article. They have to make everything as outlandish as possible", "label": 0}
{"text": "I believe it allows you to talk to somebody claiming to be them.", "label": 0}
{"text": "Nestle is on the way!", "label": 0}
{"text": "I want to know what Keegan the freak thinks", "label": 0}
{"text": "The disproportionate condemnation has nothing to do with the current war. It started decades ago.", "label": 0}
{"text": "How the fuck did she get so big in 3 years, like she was a nobody and opened it and it took off?", "label": 0}
{"text": "Can confirm. We'd be like \"oh, there it is\" and use it without thinking twice about it", "label": 0}
{"text": "The avocado toast equivalent", "label": 0}
{"text": "Wait wait wait im making some connections....women are becoming millionaires on onlyfans and romantic relationships are at an all time low.   Hmmm", "label": 0}
{"text": "> back in the before fore times you used to have to pay for each individual album or song you wanted to listen to, rather than getting access to a catalog of every song ever recorded for one low monthly price\n\nYea, but in the middle we went through a period where we had access to every song ever recorded for free.  I'm sure that my Spotify subscription is the majority of money I've spent on music, even adjusted for inflation, at this point.", "label": 0}
{"text": "Yeah there is a chat feature were they will send you messages, sometimes for additional charge. I think a lot of models actually just outsource it to Indian and the Philippines though so you’re basically paying for a middle age south Asian man to tell you you have a huge dick", "label": 0}
{"text": "because theres no good platform for musicians or because her feet are better than her music?", "label": 0}
{"text": "I'm not sure how much she gets, but it's more than a share of the publisher's take. That's just for the actual songwriting (which she'll only get a fraction of if she actually helped write any individual song.)\n\n\nShe and the record label will have some sort of deal to split the big chunk of the total. Unfortunately, as you mention, the labels are notorious for not paying artists very much and this isn't new. ", "label": 0}
{"text": "Some people really hate sex workers getting paid, like really hate it.", "label": 0}
{"text": "It's been posted here already.", "label": 0}
{"text": "yeah there's a messaging system and some creators, probably on the smaller side, do charge extra for videos/pictures, and sometimes you can make a specific request if you pay a lot.", "label": 0}
{"text": "Who?", "label": 0}
{"text": "OnlyFans killed the video stars?", "label": 0}
{"text": "The yeti spaghetti pizza is dope.  Even better if it contains dope", "label": 0}
{"text": "Never underestimate the power of lonely, horny guys.", "label": 0}
{"text": "How many times a day are we gonna see this exact post go up", "label": 0}
{"text": "The article ended up showing it probably wasn't true though", "label": 0}
{"text": "Man if my body was tea, super thick, super pretty and get super lucky I would do only fans for a paycheck. That on period.", "label": 0}
{"text": "Oh cool. You know the dadboters care.", "label": 0}
{"text": "I think you can pay to message them. But people at her level have a whole team of people messaging for her. So you think you are speaking directly to the model, but instead, it's a glorified discord mod.", "label": 0}
{"text": "This is very different from the Insane Clown Posse that is voting for Trump…", "label": 0}
{"text": "I think she got famous dating YouTubers and then her fame rose from there. I remember she dated a fortnite streamer I watched like 5 years ago or so.", "label": 0}
{"text": "To be fair, porn has had a lot of issues with non sensual videos and the ethics are very bad. It’s morally better to pay for porn that you know is consensual and not predatory for the women", "label": 0}
{"text": "I only know him as \"guest on top gear in the reasonably priced car\"", "label": 0}
{"text": "Tee many martoonis Helen?", "label": 0}
{"text": "India's scammers need somewhere to spend their free money.", "label": 0}
{"text": "this country is devolving into a literal nightmare. We have to be living in the times just before it all crumbles down.", "label": 0}
{"text": "I know several personally, but I also suspect that theseare somewhat outliers and this demographic generally doesn't vote at all.", "label": 0}
{"text": "You could try for rectum of the year - here’s a story about it from Sean Locke at about 2m mark — but watch the whole thing for the full effect. \n\nhttps://youtu.be/0Q9IRpFGgPY", "label": 0}
{"text": "My guess is the sites algorithms really liked to promote her content.  Probably a high rate between peoplw visiting her page and subscribing or whatever it is people to get the paid content from the different content creators", "label": 0}
{"text": "My understanding is that successful OF creators work their asses off doing engagement, often one on one, with subscribers.  I've never used OF, but my understanding is that it's about more than just seeing a pretty girl with her tits out.", "label": 0}
{"text": "Their ideological controllers and corporate overlords don’t need to worry about that just yet. One step at a time.", "label": 0}
{"text": "That’s quite impressive for someone I’ve never heard of.", "label": 0}
{"text": "Income is income", "label": 0}
{"text": "Nah. She got famous because she was a regular on David Dobrik's vlogs.", "label": 0}
{"text": "Barely. If you want to go into porn as a man your likely to do gay scenes before any straight ones", "label": 0}
{"text": "She already had millions of youtube/twitch/Instagram followers before the OF", "label": 0}
{"text": "pft someone doesnt jerk himself off with big wads of cash. The papercuts are a status symbol.", "label": 0}
{"text": "you can always buy the perfect body if you weren't born with it", "label": 0}
{"text": "Did you even read what I said?", "label": 0}
{"text": "sharing a kitchen with other businesses sounds like a nightmare.", "label": 0}
{"text": "Yea", "label": 0}
{"text": "They can't be siries", "label": 0}
{"text": "You literally can go do it right now, but you won't", "label": 0}
{"text": "That 3rd foot pic is actually pretty wretched, some boney ass feet lmao. Man people got whack fetishes.", "label": 0}
{"text": "Isn’t that surprising never heard of anyone buying feet pics on Spotify", "label": 0}
{"text": "I meant for a “professional” porn company. Why would anyone work for a company like brazzers if they can bring this type of money as amateurs.", "label": 0}
{"text": "> Like the takeoff of sports betting apps  \n\nUS, right ?  \n\nBecause sports betting has been a massive thing in Europe for decades. It's just been made easier with apps but PMU, La Francaise des Jeux, William Hill and many others have been flourishing for a long time.", "label": 0}
{"text": "There is probably a market for ugly. Just average or bland won’t work.", "label": 0}
{"text": "I am not a fan of ICP at all. But I think it's pretty dumb that people are mocking ICP endorsing Kamala. They have a huge fanbase of people that are usually people that don't turn out to vote. The fact that they are willing to speak up and try and use their influence to better the country should not be mocked.", "label": 0}
{"text": "Homie the leopards already at your face", "label": 0}
{"text": "Those are very nice feet though.", "label": 0}
{"text": "This is a cursed timeline.", "label": 0}
{"text": "And getting type cast as an asshole", "label": 0}
{"text": "Smaller local shows are the way to go. God it's been so amazing not to deal with ticketmaster and the like.     \nThere's a few big artists that every few years I'm willing to bite the bullet for but Smaller bands/artists are also just better to support and usually better experiences tom", "label": 0}
{"text": "> While this is probably true\n\nIf you read the article you'll see that it's not true.", "label": 0}
{"text": "You don't math much to you...", "label": 0}
{"text": "Wasn't their a star who decided to sell foot pics on OF", "label": 0}
{"text": "It's a mixture of good marketing, and mostly luck of being in or on the right place at the right time. That's the tricky part", "label": 0}
{"text": "You can still make it if you're willing to do some questionably wierd and specific stuff.", "label": 0}
{"text": "She's literally a singer and (now) is a softcore porn star, why wouldn't she want to attract attention?\n\nWhy are you so salty?\n\nIs it because nobody wants to hear your bad singing or see your ugly AF feet?", "label": 0}
{"text": "I would!", "label": 0}
{"text": "I am not buying this.", "label": 0}
{"text": "To be perfectly honest, I don't think I know any of her songs off the top of my head.", "label": 0}
{"text": "I could but I’m really stoned and can’t get up.", "label": 0}
{"text": "The Jonas Brothers feat. feat. Pics", "label": 0}
{"text": "Former USPS letter carrier here. I used to pick up and deliver Netflix DVDs. Music CDs can absolutely still be sent via snail mail.", "label": 0}
{"text": "There are feet pics on Spotify?!?", "label": 0}
{"text": "Way off. We hate pedophiles and racists. \n\nFor their entire career (over 30 years now) ICP has preached against everything the orange clown is. \n\nIn fact, if you go to the Juggalo subreddit you’ll see people talk about how being a MAGAt is very much anti-Juggalo.", "label": 0}
{"text": ">Why are feet pics so lucrative?\n\nThey aren't. Not more lucrative than other things. Butthole pictures are a big step further for a lot of women I guess. The biggest OF earners aren't doing much foot stuff. In fact, foot stuff can function as a bit of a gateway. Someone can start doing feet stuff and graduate to butt and boobs when they are inundated with $$$ for it. Roleplay stuff can pay a lot too, like femdom stuff.\n\n\n\n>Do feet pic enthusiasts get turned off by pictures of other sexy body parts, so they put all their porn money towards feet?\n\nHeck no. I always say if I have a fetish for liking a part of a women's body, then I have loads of fetishes. Eyes, hair, mouth, neck, arms, hands, back, boobs, waist, hips, ass, thighs, calves, ankle, and feet. Oh, and voice. I guess it's much easier to list the parts I haven't been turned on by at some point on some women: Ears, armpits. That's it. I'm sure there are only-feet guys out there though.\n\n\n\n>Can someone who likes feet pics explain what makes a sexy or non-sexy female foot?\n\nIt's the same as everything else. What makes a sexy leg? Or face? Or ass? Proportional, shapely, smooth and soft. Really, as with everything else, [average is hot](https://en.wikipedia.org/wiki/Averageness). Toes not long but not stubby. Feet not flat but not a ridiculous arch either. Not huge not tiny etc...\n\nAnd as with everything, we're not a monolith. On Wikifeet, currently, Morgot Robbie has the highest rated feet. Can't say I personally understand that.", "label": 0}
{"text": "Hence why Taylor is rerecording all her stuff.  The copyright is what's valuable.  Obviously, living out of a Gulfstream is easier than living out of a van, but she's locking in that IP so she can live out of a mansion instead of a vehicle of any sort going forward.", "label": 0}
{"text": "I have Jiffyfoot from being barefoot in my yard chasing my dogs around. \n\n\nNobody want to see that right? \n\n\nPlus my toes are a little long.   Nobody would pay to see mine.", "label": 0}
{"text": "Directed by  Tarantino", "label": 0}
{"text": "Fun fact: the reason why some people are attracted to feet is because the regions of the brain that’s attracted to feet and vaginas are close together so some brains just mix them into one group ", "label": 0}
{"text": "The band named “Siouxsie and the Banshees” is misspelled on the blackboard in a scene from School of Rock (the movie). When the Broadway adaption recreated the chalkboard on the wall outside the theater, they retained the misspelling.", "label": 0}
{"text": "Meat Canyon existsand is popular enough to be mentioned on the simpsons", "label": 0}
{"text": "I hate to be that guy, but isn't Spotify's middling 7% margin largely a result of literally burning hundreds of millions of dollars to get exclusive podcasts?", "label": 0}
{"text": "i think i got it right!\n\n1000 subscribers per month x $10 per subscriber = $10,000 a month. $10,000 a month x 12 months = $120,000 per year. Six figures!", "label": 0}
{"text": "Drummer for a few smaller bands here. When we make physical copies, it's generally vinyl, sometimes tapes (still popular in genres such as black metal, punk, etc). Vinyl has the highest margin, you can get 12\" LPs for about 7 or 8 euro a piece from a presser for an order of 300 LPs, but this really depends on how fancy the cover is etc. Let's say you're keeping it cheap, that's 2100 euros for just pressing. Add another 1800 for recording, and ignore the costs of buying instruments and practicing, that's 3900 total, so you'll make a profit on anything over 13 euros. We usually sell at 25, so a margin of 12 per record sold, meaning we make around 120 on LPs per show with an average volume of 10 records sold. It's not a large amount, mostly a nice extra on top of the payment for the gig. Margins improve on higher volumes though, so it really becomes worth it if you scale up. I know bands that do around 3k in merch sales every show, often exceeding the ticket sales.", "label": 0}
{"text": "Spotify premium is by far the most I've ever spent on music.  I didn't have much allowance money with which to buy tapes, and then mp3s were free.", "label": 0}
{"text": "Probably! You are right I can’t sing and my feet aren’t that cute. Guess I’ll keep kicking rocks with my bare toes", "label": 0}
{"text": "Amor for sleep. Sounds like a Spanish love song", "label": 0}
{"text": "OnlyNo", "label": 0}
{"text": "I watched that Daily Show episode and wondered if this might happen. That's freakin' hilarious that a Daily Show bit resulted in an endorsement like this.", "label": 0}
{"text": "1)I had no idea that \"wikiFeet\" was a thing 2) She has a high rating on \"wikiFeet\". \n\nSo apparently she has highly likeable feet. No doubt being a relatively famous musician doesn't hurt.", "label": 0}
{"text": "I assure you it was not easy money. If you’ve ever talked to a successful content creator, they basically don’t have lives. They’re always thinking about the next thing they post.\n\nI’m sure she didn’t have a moment of peace in those three years. Worth it, sure, but 0% chance it was easy.", "label": 0}
{"text": "True, but she got hers and cashed out, it’s hard to argue with that. Get it girl!", "label": 0}
{"text": "I’ve heard that! Could be truth - but then again I’ve spoken to gooners online and they will jack it to *anything*", "label": 0}
{"text": "That is the saddest job. Man.", "label": 0}
{"text": "You know, that’s a damn good question", "label": 0}
{"text": "I cracked up, thank you for this comment. 😂", "label": 0}
{"text": "when it comes to porn, absolutely", "label": 0}
{"text": "Another vote for small local shows here. Seen hundreds of shows in the past couple years, most I've paid is $25. Seen more amazing music from bands I've never heard of than I can remember. With all due respect, Ticketmaster can suck my sweaty balls.", "label": 0}
{"text": "Well, since 1992 they have been saying \"Fuck Your Rebel Flag\".", "label": 0}
{"text": ">In making the case that the states have standing this time, the attorneys general contend access to mifepristone has lowered “birth rates for teenaged mothers,” arguing it contributes to causing a population loss for the states along with “diminishment of political representation and loss of federal funds.”\n\nSeriously? Maintaining population levels through unwanted (by the girls) teen pregnancies? Never mind this preferred method kind of encourages statutory rape, if not rape in general.", "label": 0}
